["The next Biennial should take place in 2021-23, at the time of the 2017 edition. The event, which will be held at the National Museum of Contemporary Art in Paris, is currently on hold while the antiquities board in Paris reassesses the site of the collection. The museum hopes to rejoin the French capital next year, but it will do so under a new name: the first Biennial of the Museum of Modern Art, Paris.\n\n\nThe Philadelphia Museum of Art (PMA) announced today that it will begin welcoming visitors back to the institution for the first time since it closed in the middle of November after it shuttered in March due to Covid-19. The reopening will be staggered, beginning on January 20, 2021 and ending on January 19, 2022. The museum will also begin reentry after the museum’s exhibition wing has reopened, and will begin offering free admission to the public in January 2022. After visiting the museum for forty days with PEN America, an international LGBTQ rights organization, the American Civil Liberties Union (ACLU), and a group of artists, the New York Times reports that the reopening of the museum will be a challenge. “The museum’s exhibition space and its", "The next Biennial should be held in 2020, though the date has yet to be set. \n\n\nThe International Council of Museums in Paris is launching an initiative to promote the art of the most recent centuries. It will invite eighty artists and collectives from fifty-eight countries to collaborate on an online forum and exhibit curated by the Musee de la Danse Macabre (MAD), a subsidiary of the conglomerate Val-Dulfis, in order to better understand the contemporary world. \n\nThe forum, titled “Dates in the Future,” will take place in the middle of the month, beginning on March 31, 2020 and running through March 31, 2021. “This digital platform will be transformed by the ICONS project into a forum for the presentation of contemporary art,” said Olivier Groupe, the general secretary of MAD. “Museums are facing difficult times. The current climate is one of the most challenging of our time. Our objective is to create a platform for artists and curators to exchange and exchange views, to collaborate and collaborate.”The ICONS project, which aims to reflect the spirit of the sixteenth Paris Triennial of Art, that ran from March", "The next Biennial should take place in the city of São Paulo next year.\n\n\nThis year’s Hong Kong Biennale, which kicked off on March 9 and ran through March 15, has announced that proceeds from ticket sales will be donated to the Burnside Clinic of UFAF (University of Florida’s Foster Children’s Hospital) in Florida. The donation will be used to shed light on the effects of the coronavirus and will help the hospital prepare for the coronavirus outbreak in China.“The show’s production team is extremely sorry that this year’s event was not able to take place as planned in Hong Kong,” said artist David Chiu. “We are grateful to the organizers, the artists and everyone who has participated in the Hong Kong Biennale, and look forward to having the opportunity to make it a success in 2020.”The Hong Kong Film Festival, which kicked off on February 4, has announced that it is launching a new promotion in an attempt to lure foreign film crews to the event. The promotion will feature special programming and special offers from participating galleries as well as a number of partner organizations. The promotion will run from March 14 to March", "The next Biennial should be held in the first half of the year. The second should take place in the second half of the year. The third Biennial will be a retrospective of the first two Biennials, in the third and fourth quarters of the year. The fourth Biennial will be the last in the United States.\n\n\nThe National Museum of Women in the Arts (MoWAA) in Washington, DC, has appointed Loni Weems as its next director. Weems previously served as the interim director of the National Museum of African Art in Washington, DC, and as director of the Brooklyn Museum. She is currently the interim director of the Whitney Museum of American Art in New York and the first woman to head the National Museum of Women in the Arts.“Loni Weems’s leadership, dedication, and enthusiasm for MoWAA and the museum’s mission makes her an ideal leader for the next chapter of our history,” said Matthew Teitelbaum, director of the National Museum of Women in the Arts. “In addition to her proven ability to build upon outstanding collections, Loni will continue to lead and expand the museum’s international reach through new and creative approaches. She understands the", "The next Biennial should take place in the year 2021. “This will be the year of the Biennial, the first in the city, and will be the last exhibition,” said Manuela Bruguera, president of the City of Cluj. Biennials are long-term events that are organized by a number of organizers and take place throughout the city.\n\n\nFrench company Gardiner Phoenix is suing the heirs of a Parisian artist over the purchase of a painting by the artist Vincent van Gogh, which was stolen from his home in a burglary in 1961. According to the New York Times, the estate of the artist has filed a counterclaim accusing the heirs of the crime of attempting to profit from the terroristic act.The estate alleges that the work, titled A Midsummer Night’s Dream, was stolen by the family of the late businessman Pierre Pape, who was closely connected with the artist. The Pape family sold the painting to the company in 2001 for $6 million, but when the estate tried to return the work in 2014, the heirs sued. In a ruling published in the Parisian newspaper Le Figaro last month, Justice Jean-Luc Moulot found that the heirs had presented “", "The next Biennial should take place in 2020, but its founding committee has said it expects it will open in 2021.\n\n\nAn auction house in Hong Kong has been ordered to pay an estimated HK$130,000 (US$105,000) to the estate of an American civil rights activist who was murdered on the streets of the city in 1989 by a man who was imprisoned for the crime in a Hong Kong jail.The civil rights case is one of several that advocate the restitution of African and Asian art looted from Asia. The government has yet to respond to the legal challenge, but it has vowed that it will honor a 2015 court ruling that ordered the auction house to remit HK$2.5 billion (US$2.8 billion) to the estate of an American artist whose estate it has not acknowledged.The estate is seeking an injunction that would force the estate to return artworks that were part of a $38 million (US$33 million) wrongful death suit that was filed by Richard Desmond Tuttle in 1986. The estate also wants the court to declare that the sale of the art was fraudulent. The estate argues that the court should not consider the work as part of a proper estate sale because it is one of only two works that have not", "The next Biennial should be held in 2020. \n\nThe American Institute of Art in New York, which will stage an exhibition titled “The Trauma of Sculpture” next month, has announced that it will suspend the events and programming in order to’tend to the health of the artists who are participating. The decision comes amid an ongoing outcry from artists, activists, and scholars across the country over the timing and the scope of the massive coronavirus outbreak and an ongoing legal battle over the future of the Cor-Ten factory where the American artist Paul Gauguin’s work is stored.Since the outbreak of the virus in Wuhan, China, in 2007, the United States has spent more than $1.2 billion combating the virus. The World Health Organization declared the outbreak a global public health emergency, and Congress has enacted a $2.2 trillion stimulus package. More than 2,500 cases of the coronavirus have been confirmed in the United States and Canada, and an additional 5,400 cases in Mexico.The coronavirus was first identified in Wuhan, China, in 2004, and the factory, which makes the metal mask covering head and neck masks for the coronavirus,", "The next Biennial should be held in October 2019.\n\n\nThe Swiss Institute for Contemporary Art (SKIC) in Zurich has announced that it is planning to launch a new initiative to support the development and preservation of artworks that have not yet entered public collections. The initiative, which will run from October 2019 to April 2020, will receive $25,000 in support of the cost of an art historian to conduct a scholarly study of a work, and will organize exhibitions in collaboration with the Museum of Fine Arts, Zurich, the National Museum of the Swiss Army, and the National Museum of Art, Bern. The future of the program is currently up in the hands of the public, who can apply for funding through the SKIC.“The institution is currently facing a difficult situation due to the global health crisis,” said Stefan Wieder, president of the SKIC. “We are grateful to the SKIC board, board members and staff for their cooperation and collaboration. We hope that their assistance will be of use to the board and the other members of the governing board, and I am confident that this work will be a success.”The project, which will be led by Andrea Dalli, director of the National Museum of Fine Arts", "The next Biennial should be held in 2022. The first installment of the biennial was held in the city of Biennale de Lyon in 2016. The eighth edition of the event will be held in the city of Biennale Hamburger München in 2022.\n\n\nThe National Geographic Society is suing the Texas Department of Transportation (TxD) over the agency’s plan to remove the Confederate statue of General Robert E. Lee and the Civil War-era battlefield site where a statue of the Virgin Mary is being relocated. The lawsuit, filed in a Texas federal court on Wednesday, accuses the agency of violating the Establishment Clause of the United States’ Civil Rights Act by removing the Lee monument from its home in Tulsa, Oklahoma, and moving it to a distant location in New Mexico. The lawsuit also claims that the relocation of the monument violates the Religious Freedom Restoration Act, a law passed in 2017 that made it a violation of the federal agreement with the state of Texas to remove a public monument. The lawsuit names the state of Texas, the Architectural Heritage Foundation, and the City of Tulsa, as defendants. The Oklahoma City Museum of Art also recently received a $100,000 donation from the Andy", "The next Biennial should be staged in 2022. Art historian Naomi Wolf, who is currently working on the exhibition “Art and Time: Internationals and the Subversion of Modernism” at the Museum of Modern Art in New York, has suggested that the 2023 edition should “adapt to current needs and conditions.”\n\n\nThe Museum of Contemporary Art (MoCA) in New York has hired Jessica Morgan as it looks to diversify its board of trustees and expand its collection beyond avant-garde, works that were created for the institution by hand or in a machine, and has announced that it now has thirteen members: Jeffrey Koons, Paul Gauguin, Willem de Kooning, Elvira and Oskar Kok, Mary Carey, Tracy Chapman, Peter Cook, Karolina Wojtas, and Kirsten Dunlopfel. In addition to Morgan, the institution has three other board members: Bill Loring, who serves as the chair; Angela Fisk, who serves as the vice chair; and Sharon Reitzman, who serves as the treasurer.In a statement, MoCA said: “In recognition of the many achievements of the five previous trustees, the", "The next Biennial should be held in August 2020. \n\n\nThe University of Cape Town (UCT) in South Africa has appointed Michaela Sattler as its new executive director. Sattler comes to the institution from the University of Pretoria, where she has served as a lecturer in the department of history and European studies since 2017. During her tenure, she has organized over twenty-five exhibitions, including the 2017 ADAA Awards, 2018 ADAA Lectures, and 2018 ADAA Exhibition, as well as curated three exhibitions: “The Black Years: The Untold History of Afrika” (2019), “The Untold History of Black Women” (2016) and “Making Place: Art and the African Diaspora” (2015).“We are delighted that Michaela has agreed to take on this key role in supporting the building of the next UCT Biennial and are committed to working with her to develop a strategy for the exhibition and development of the collection,” said UCT director Tim de Vries. “Through the support of the museum’s staff and the sixty-two year old curator, Michaela has demonstrated her expertise and historical vision for", "The next Biennial should be held in 2020, the winter Olympic Games are scheduled to take place in Tokyo in 2021, and the first exhibition in the new museum will open in 2022. The institution will also boast a branch in Paris in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston, Massachusetts, has appointed Kenneth C. Dauterman as its next director. Dauterman comes to the museum from the Art Gallery of Rhode Island, where he has served as deputy director for the past two years. The appointment was made amidst a restructuring of the museum’s operations that aims to improve its financial sustainability and mitigate environmental impacts, including the establishment of the Museum of Fine Arts Boston as a pilot program for the new Boston Cultural Heritage Center.“This is a transformative moment for the MFA,” said MFA president and CEO Michael Govan. “Kenneth brings a wealth of experience and knowledge to the MFA and will strengthen and extend its curatorial, strategic, and educational teams, advancing the museum’s mission as a multidisciplinary community leader.”Dauterman joins the museum from the Art Gallery of Rhode Island, where he has served as deputy director for the past two years. According", "The next Biennial should be the last, and will likely be the last, in 2020. For Herbst, the past five years have been a struggle. \"I have been lucky to be able to continue work on the project, to continue to present the exhibition, to continue to produce the work, and to be able to return in 2021 to celebrate the twenty-fifth anniversary of the exhibition.” The biennial will also have a new website. This one will include biographical information from every published account of the exhibition, including the author’s own. The site will also include an account of the exhibition’s thirty-fifth anniversary. “The last two years have been the best years of my writing career,” Herbst said. “It has been a joy and a privilege to present the work of our talented curators, to help them write their narratives, to build their careers, to shape their practice, and to expand their field.”\n\n\nThe Center for Contemporary Art (CCA) in Minneapolis has appointed J. Russell Donaldson as its next executive director. Donaldson currently serves as the head of the department of contemporary art at Moorhead, Minnesota, and oversees the collection and development of collections", "The next Biennial should focus largely on the emerging field of painting and sculpture, in a process that will integrate the physical and virtual worlds in a way that will establish the context for the forthcoming Sundance Film Festival. “I am thrilled that the Biennial will celebrate the visual arts in 2018 with the impressive roster of artists and designers we have assembled, and will continue to support the artists and designers who have made such a remarkable statement in the last fifteen years,” said John Archibald, director of the Museum of Modern Art.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Marisa Gaynor as its next director and CEO. Gaynor comes to the institution from the Museum of Contemporary Art (MoCA), where she has served as interim director since January 2019. During her tenure, she has overseen the museum’s exhibition program, focused on contemporary art, and supported the institution’s international expansion. During her tenure at the museum, Gaynor has also worked to upgrade the museum’s collection, introduce new programs, and create opportunities for the collection to expand its work on internationally recognized artists.“During her tenure at the museum, Marisa has developed and implemented new initiatives that have enabled MoCA to", "The next Biennial should be a celebration of the social and political contributions of women artists. Whether it succeeds or fails will depend on its vision. I hope that it succeeds because it is a worthy and urgent effort by two decades to declare an end to gender-based violence and establish equal pay and access.\n\n\nThe Museum of Contemporary Art (MoCA) in New York announced today that it is planning to open a new $50 million public art center in the city’s East Village. The museum has partnered with a group of community members and local officials to create a $50 million plan for the project, called East Village East, and is working with architects to develop the design.The plan is for a two-story, fifty-one,600-square-foot building, which will occupy a former industrial site near where the Museum of Modern Art (MoMA), the Metropolitan Museum of Art, and the Metropolitan Opera House are, and is being spearheaded by architect John Dixon. The group behind the project, which is being overseen by architect and urban designer John Roach, included Barry Diller, the managing director of Pace; Louise Nicholson, the president and CEO of the Association of Independent Colleges of Art and Design; and Nick Balchford, the CEO", "The next Biennial should take place in 2021 and the second in 2023, respectively. The partnership has resulted in the exhibition of work by more than 300 artists and their respective institutions since it was initiated in 1993. The first pavilion, the 1966 exhibition Biennial 7, featured artists such as Claude Monet, Henri Matisse, and Otto Rauschenberg.The newest addition to the exhibition series, entitled “Away from Earth” and scheduled to open in 2020, is a re-creation of a landscape in the artist’s studio in the archipelago of Madeira. Although the work is located in the Māori Landscape Institute, the Māori Landscape and Landscapes Research Group, and the Māori Landscape Foundation, it is being organized as “Away from Earth” and will be on display in the museum’s permanent collection, which is currently under construction.The pavilion’s director, Harna Guneward, told the Art Newspaper that the project, which uses the artist’s studio to create a two-dimensional sculptural installation, was conceived as a response to the interdependence between the country and the city and has been implemented in a number", "The next Biennial should be a celebration of the artist’s work,” said the venue’s director Katerina Rast. “The theme of this year’s edition of the Fifty-Ninth Venice Biennale will be ‘Self-Portrait.’ The installation of the exhibition will be different from past editions. The exhibition will involve the exhibition of an exhibition of works by the greatest of twentieth-century artists, led by filmmakers, and will consist of a selection of the work of thirty-nine artists in total. It will be curated by the Director of the Contemporary Art Museum Stedelijk Museum, Jan de Bruijn.\n\n\nThe Allen Memorial Fund, a nonprofit that supports arts and cultural workers who have made a significant contribution to the American arts and in the United States, is launching an initiative that will provide $1 million to artists whose creative practices address social justice issues. The fund will distribute $700,000 to the artists chosen by the Allen Memorial Fund board from a list of ten finalists that was established in 2017. Awards will be made at the Allen Memorial Fund’s annual L.A. residency, which was held last February, and will be presented by the Allen Memorial", "The next Biennial should be held in 2021. The work of the year will consist of interviews with artists, writers, musicians, designers, and engineers. It will also include a wide-ranging survey of the contemporary art world. The exhibition “The Rebirth of Modern Art” will exhibit work by artists who have had their works exhibited in the past. The exhibition will include a selection of twenty-six works by twenty-nine artists that were part of the first exhibition, “The Art of Death” (2019), at the Museum of Contemporary Art, Los Angeles (MCA). The next exhibition will feature works by ten artists, including Paul Gauguin, Altair Kayode, and Jim Jarmusch, as well as two by David H. Koch, the CEO of Koch Industries, and two by Yoko Ono.\n\n\nThe Art Council, the nonprofit organization that coordinates exhibitions across the United States, announced today the twenty-three artists who will receive its $2,500, six-month grant. The grantees are Nicole Holcomb, Andrea King, Tanya Keefe, and Jodi Throckmorton, and will begin their projects in March.Among the fifteen artists who will receive the grant are", "The next Biennial should be held in the spring of 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it has hired contract painter and conceptual artist Monica Narciso as its next director. She succeeds architect Hisham Al Saad, who departed the institution in 2018, and will take up the post in January 2021.Prior to joining MoMA in April 2018 as an associate curator, Narciso worked as an independent curator at the Museum of Modern Art, where she worked on the exhibition “HISTORY: A Retrospective” (2018), “Tica Al-Saad: Welcome to the Tica Al-Saad Show” (2016), and “Cleanhands: The Contemporary Painting of Maya Angelou” (2013). In 2016, she was awarded a MacArthur “Genius” Grant for excellence in art journalism.In her new role, Narciso will oversee the institution’s expansion into an artistic space; enhance the museum’s collection and exhibition program; and oversee programming for MoMA’s European and American pavilions. She will also spearhead the restoration of the museum’s former Horse Palace Theater, which served as a", "The next Biennial should take place in 2019 to commemorate the twenty-fifth anniversary of the opening of the Biennial. The twenty-fifth will be held on the first floor of the building, in the same exhibition space as the Biennial, in the third-floor gallery, and will be led by a board of directors comprising Roberta Smith, director of the Museum of Contemporary Art, Los Angeles; Paul Shammo, director emeritus of the Museum of Contemporary Art, New York; and David Sheldrick, former director of the Museum of Contemporary Art, Los Angeles.\n\n\nThe Supreme Court on Monday upheld the conviction of Paul Mpagi Sepuya, a South African artist who was convicted of painting a nude African woman with a penis as part of a Five-Star Movement art protest in 2015, the Advocate reports. Following a retrial, which the court found unconstitutional, the jury found him guilty of defaming and assaulting an African woman who had accused him of physically assaulting her in 2015.“We are very pleased with the outcome today,” said Stephen Lendl, a lawyer for the prosecution. “This was a case about a defamatory statement, not a legitimate political statement, and the jury found that it was made", "The next Biennial should take place in 2023. By targeting an audience for a work, the exhibition is a way to re-imagine how art can reflect and connect with the lives and experiences of under-recognized communities. The show’s inaugural edition, “Cannup,” was held in New York in May 2016.A selection of work from the show’s inaugural exhibition, “CELEBRATE LIFE,” was presented at the Biennale of Edinburgh in September 2019.\n\n\nThe National Galleries of Scotland (NGL) has appointed Linda Collins as its new chair of the National Council for Contemporary Art. Collins comes to the institution from the National Gallery of Art, Washington, DC, where she has served as the museum’s chief executive since 2013. She succeeds Mark Masuoka, who retired in June 2019 after eighteen years at the helm of the museum.“Linda is an experienced and ambitious leader in the history of art who has brought a wealth of international curatorial and public programming to the museum, across all disciplines,” said NGL director Nicholas Cullinan. “We are deeply honored to welcome her to the NGL and are", "The next Biennial should be in 2021 and will showcase the work of artists whose work spans over five centuries. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of more than four thousand photographs by David H. Koch, including a set of five he donated to the museum in 2015 that will go on display in the museum's David H. Koch Gallery on Long Island City. Koch donated the works, which are part of a larger project to digitize the Koch Collection, to the institution in exchange for $7 million in support of the Koch Center for Applied Ethics and the Center for Consumer Freedom.The gift includes a series of photographs by Koch in collaboration with Ed Moses, which were shown at a special exhibition of the same name that opened at the Museum of Contemporary Art Los Angeles in December 2014. The show, “David H. Koch: Mobile,” was curated by Tony Magee and featured works by artists such as Walter de Maria, Robert Irwin, and Richard Diebenkorn. The set is currently on display in the museum’s David H. Koch Gallery for the Arts, which has been appointed the permanent home of the Koch Collection.“David H. Koch is a pioneer and a visionary,", "The next Biennial should now take place at the Museum of Modern Art in New York, in 2021. The 2020 edition, titled  The Ruins of Auschwitz, will be held at the museum from March 20 to March 21, 2021. The 2020 Exhibitions included   The Prisoner of Auschwitz, 2019, “Auschwitz: Breyer/Vincent,” and “The Abandonment of the American Negro.” The 2020 exhibition will also feature works from the upcoming exhibition “Auschwitz: Beyond the New ,” which will open in October 2021.\n\n\nThe National Endowment for the Arts (NEA) has released guidelines for how cities and counties may fund musical performances in the wake of the coronavirus pandemic. The guidelines, which aim to minimize the economic and social impact of the Covid-19 outbreak, were issued by NEA director Maureen Green, the chair of the board of trustees, and John F. Kennedy, the former president of the United States.“These guidelines will help local communities and the federal government design programs that maximize the economic, social, and cultural benefits for communities in the immediate area around the performing arts center, and minimize the economic", "The next Biennial should be a celebration of the lives and work of Zina, which will be held in January 2020, and will feature the work of thirty-two artists. Among those participating are the multi-disciplinary group “Oolite” and the Dutch artist Damien Hirst; the artists Leila Tejada, Rosalind Owen, and Haus der Kunst, which collaborated to create a live performance piece; and the Italian sculptor Lina Manganiello, who received the award in 2013 for her work Razza,” which is a reconstruction of the life of a woman who was the wife of a wealthy merchant from the Soudan region of northern India.Commenting on the award, Brittany Yadom, a curator at the Diller Scofidio + Renfro–designed Biennial, said: “It is important that the work of these thirty-two artists be recognized. And at the same time, it is important that their work be shared with as many people as possible. This year’s Biennale will be an opportunity for many different communities and different audiences to witness the work of these artists, and to have an appreciation of their relevance and their", "The next Biennial should be held in 2020. “The museum has been working for many years to develop the new institution’s reputation through a series of exhibitions that it has staged on a worldwide scale,” the organization said in a statement. The new exhibition “was born from the two goals of enhancing the public understanding of art and education.”\n\n\nThe Institute of Contemporary Arts (ICA) in Melbourne, Australia, announced today that it has welcomed two new members to its staff, Ashley Walker and Pia Camil. Both workers will be joining the institute as part of a new four-year contract, which will run through the end of the year. They will be working full-time, and will be responsible for developing and executing curatorial projects across the institute’s collections and programs.“The ICA is excited to welcome Ashley Walker and Pia Camil to its team, and to see their potential and their positive impact on the ICA,” said ICA director Tim Fofana. “Both Ashley and Pia have demonstrated a deep understanding of the ICA’s collections and programs, both locally and internationally, and have shown great vision in collaborating on interesting and challenging projects.”", "The next Biennial should take place in 2021, and the dates will be announced shortly thereafter. The 2019 edition was held at the Museo de Arte Contemporáneo, Barcelona; the 2020 edition will be held in the Museo de Arte de Chicago. Completed in partnership with the Museum of Modern Art and the Los Angeles County Museum of Art, the exhibition includes works by eighty artists from forty-five countries and will run from September 3 to September 12. The full list of participating artists is as follows: 19th Biennial of Art and Design\n\nPilar Corrias, Spain\n\n*The Transport Workers Union and the SEIU are allied. The SEIU represents workers at the Volkswagen plant in Wolfsburg, Germany, and the union represents workers at the auto parts factory in São Paulo. The union has been represented by the Volkswagen Group since 1985, and the SEIU by the workers at the auto parts factory in São Paulo since 2015. The workers decided to join the union last December, after the workers voted to bargain with the company at a special workshop in Wolfsburg. The workers said that the management was aware of the union activity but did not intend to act.In February 2019, a group of workers", "The next Biennial should come at a time of great change for the city, and the city’s cultural sector. As we approach the sixteenth edition of the Biennale in 2021, we are working hard to re-imagine how we will bring together and celebrate the arts, and how they will shape how we live and work in the city.”  The 2018 edition, which was staged at the Museum of the City of New York, drew an average attendance of 16,000 visitors. The next edition will be staged at the Town Hall in Lazarus, Massachusetts, next year.\n\n\nThe Estée Lauder Companies (ELLE) and Moncler have announced the launch of a new digital platform, the Orchard, which will host curated exhibitions and events in partnership with the artists featured in their first international collection, which is scheduled to open in the spring of 2021. Named after the artist’s latitude and long-distance, the platform will feature 100 percent of the work of forty-five contemporary artists who are represented in the collection—with the exception of Rodolphe Bacher, a Frenchman, who works entirely in black and white.Of the artist stipulations in the first edition of the Orchard, which will run from", "The next Biennial should take place in 2020 and will include works by a select group of artists selected by the organisers.  The selection committee will then decide whether to award the 2019 prize, which comes with an unrestricted right of publicity.\n\n\nSigns of Life, a new initiative of the Los Angeles–based nonprofit Gallery Life Games, has been established to encourage more people to engage with and engage with the environmental and social justice movements in Los Angeles County. The nonprofit, which has received funding from the John F. Kennedy Center for the Performing Arts and the Los Angeles County Museum of Art (LACMA), will partner with local environmental and social justice activists to create a series of public artworks. “LACMA has a long history of championing environmental justice, and our new projects will explore how LACMA can become a leader in fighting climate change while remaining a vital cultural anchor for communities in Southern California,” said Nina Graves, director of LACMA. “Signs of Life will highlight the power of art to shape and shape our environment, and will offer an opportunity for people to connect with and engage with inspiring local artists.”Inaugurating the project will be a series", "The next Biennial should take place at the Museum of Modern Art in New York in 2022. \n\n\nThe British Museum in New York has released three new works by contemporary British artist Tate Britain’s David Salle. The works—one for each series of the Tate’s twenty-four-year-long series “Foreground: Tribute to the Living” (2019–20), “Avalon: A Fracture in Earth and Sky” (2019–20) and “Return of the Living: The Legacy of John Sellers” (2019–20)—are part of the institution’s new exhibition series “Above and Beyond: Contemporary British Art, 1890–1965” (2019–20).Salle’s works were selected by director Madeleine St. Laurent and curator Paul Bettany for the series’ 2019–20, “Avalon’s Legacy,” and of those three, only the second, the work for “Avalon’s Legacy” was shown at the Tate in London last year. The exhibition, which opened at the British Museum in March, is on view through October 29 and will be followed by a", "The next Biennial should be in 2022. “We are very excited to return the Biennials to the city of Barcelona, in a city that has fought so hard to bring them to our attention,” said Balbi. The exhibition, titled the 'Year of the Boat,” will be hosted by the city and the commissioning institutions of art. The first show will be held in 2022 and the “Second” will be staged in 2021. \n\n\nThe Warner Brothers studio in Los Angeles is planning to create about 50,000 low-income full- and part-time construction and design occupations in the United States over the next five years. The initiative is part of the company’s effort to tackle the country’s job crisis by employing people who would otherwise not be able to work, and is expected to yield $1 billion in tax revenue to the government.“The construction industry has a long way to go before it catches up to the auto industry in terms of job creation, but we believe this is an area where the industry can play a key role,” said Warner director Michael Lynton. “We saw this as one of the best ways to bring manufacturing jobs back to the United States", "The next Biennial should inaugurate with a two-hundred-year-old artwork by artist Nandi De, a work which contains the remains of pre-Columbian civilizations and a message from the late author F. A. Schubert, whose work has been exhibited at the Museum of Modern Art, New York; the Museum of Modern Art, San Francisco; and the Museum of Modern Art in London. “The new museum will serve as a platform for the revitalization of this sacred site and the preservation of the work of Indigenous artists,” said James Cuno, the museum’s board president. “This is an unprecedented moment for Indigenous institutions in North America.”\n\n\nArt historian and curator Marc-Olivier Bruguiere has been appointed as the new curator of modern and contemporary art at the Museum Musée d’Arles in Arles, France, in January. He succeeds Jules Verne, who retired after a decade of leading the institution.Bruguiere, a French-born, Paris-based art historian and curator, was previously a professor of art history at the University of São Paulo in Brazil and a professor of modern art at the University of Bristol, England. He", "The next Biennial should take place in 2020. The next Biennial will be held at a location of the artist’s choosing in the city of Biennale. The next Biennial will be a performance-focused event, focusing on the work of the artist, and will feature works by a select group of artists.“The idea behind a biennial is to be able to spread the interest of art and the world, to be able to have a space to stand alongside and to have a conversation with the contemporary art of our time,” Art Museum director Matthew Higgs said in a statement. “I’m keen to see how a biennial can expand the breadth and range of this year’s exhibition.”\n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) has announced that it is planning to retain a majority ownership of its historic headquarters and has received a $50 million donation from CalArts and the City of Philadelphia. The gift comes as part of a $150 million redevelopment plan for the historic George Fox Building, which is currently being revamped by the Los Angeles–based firm W.G. Pei, and is part of a $500 million campaign to reframe the museum�", "The next Biennial should take place in 2020, but it will also focus on the history of the exhibition, as well as the development of the project over the past fifty years, and will feature artworks by artists from different parts of the world.\n\n\nThe Tate in London announced today that Gabby Mpagi Sepuya and Amanda Shepherd, the curators of this year’s Biennial of a Thousand Faces, are collaborating once again. The exhibition, which explores both the legacy of the Italian Renaissance architect Fibonacci and the contemporary art world, will return to Tate Modern in 2021.“Both Gabby and Amanda are singular talents and it is incredibly privileged to have them as co-curators at Tate,” said Peter Cook, director of Tate Britain. “They bring a wealth of knowledge and insight to the exhibition, and we are excited to see what they will create next year.”The partnership was announced in March 2020, after the architects completed a structural redesign of Tate’s new building, which opened on the campus of the University of the Arts London (UCL), on November 5, 2020. The work will include the installation of a new array of artist-designed chairs, an expanded exhibition space,", "The next Biennial should be held in 2020, and the remaining two years of the project should be kept unchanged. If the project is cancelled, the museum could close temporarily. The decision to postpone the event comes amid a growing concern for the future of the biennial, which has been called a “once-in-a-lifetime opportunity to migrate one of the greatest artworkss of the twentieth century.”The current exhibition “John Lennon: The White Album” is being renamed the “Lucy in the Sky with Diamonds” and will return in 2022. Its future is now uncertain, as the museum has already acknowledged. “The current exhibition is not working as it should,” museum director Michèle Haffner said in a statement, “and the ideal solution would have been to have it up and running again in 2020. But it is not working anymore, and we have to act quickly.”\n\n\nThe City of Portland has received a hefty gift of $9 million from the Willamette Valley Council. The levy, which comes with a matching gift of $6 million, is one of the largest individual contributions made by a city-sponsored organization in the history of the", "The next Biennial should be held in the spring of 2021. The exhibition will continue to present artworks, lectures, workshops, and other programming across the history of the museum, but will focus on the construction of the museum’s core collection and will be organized in the same manner as the current exhibition. The deadline for the exhibition is April 29.\n\n\nThe Queens Museum in New York has received a $750,000 gift from Marcus Mumford. The new muse of the Queens Museum, which was founded in 1995 by Charles and Maximilian Mumford, also owns the contemporary art publisher and art historian David Kordansky. The gift includes six lithographs by Kordansky, all from the late seventeenth century, as well as a copy of the newly published The Art of Life and Death, which explores the actual artworks that formed the basis of the ancient theory of the Gods and the dead.“In a time when the idea of art as an essential and accessible tool for social progress has been thoroughly disdained by the majority of the cultural establishment, the museum served as a vehicle for the soul of Marcus Mumford,” said David Kordansky. “By offering the intimate exhibition experience that", "The next Biennial should consider the possibility of creating a sort of work-for-hire model for the exhibition, which is currently organized only in the form of a video series\u0097the ultimate goal being to build up a collection for the exhibition for the museum. We are currently actively seeking partner institutions to share the exhibition. We are also eager to partner with local artists and communities on sustainable practices.”\n\n\nThe sculpture and installation program at the Serpentine Galleries in London, which is currently closed until March 31, will return to the London borough of Lambeth, England, in April. The work, which was created by three different artists\u0097Cécile B. and Louis-Henri Blagel (Sydney CTO, London) and two groups of collaborators\u0097was exhibited in “Forms/Tells: Contemporary Art” (2017) and “Forms/Tells” (2015) and was the subject of a solo show at the Serpentine in 2016. The exhibition “Forms” (2016) consisted of twenty-one works by artists from the United States and Europe, and the 2018 “Forms” (2018) exhibition featured seventy-one works by artists", "The next Biennial should identify the cultural and ethnographic aspects that make the Art of the Event unique, and should then present selected works by selected artists. The second iteration of the biennial—which was held in 2019—analyzed the process of selection and exhibition, and was held in 2020. The first iteration of the biennial, completed in 2019—was held at the Lima International, a historic old Portuguese colonial fort located on the shores of Lake Itascoc, in the capital of Peru. The next iteration of the biennial will take place in Lima in 2021.\n\n\nThe Hungarian government is planning to allocate 150 million for the construction of a new museum dedicated to the history of the Flemish province of Fiszkód, a region in south-central central Hungary. The project, dubbed the Fiskunsthalich (Budget for History of Fiskunsthalich) and will be funded by the government of Ferenc Párt, will include the renovation and expansion of the existing Museum of Modern Art (MMO), which is currently under construction in Budapest and will be completed by 2022.The new museum will be housed in a former ironworks factory in the city of Fisk", "The next Biennial should be a celebration of our historical past, a celebration of the innovative and important work of the biennial and its artists, and a celebration of the importance of the exhibition as a vehicle for information and inspiration.”\n\n\nThe National Institute of Art (NIA), in Washington, DC, has appointed Kate McEnery as its next director. She succeeds Larry Gagosian, who announced on Tuesday that she plans to resign after eight years at the end of the twelve-year term.“After a distinguished career at the NIA, it is a great honor to have been selected to lead the museum through this moment,” McEnery said. “Throughout my tenure at the NIA I have worked diligently to advance the museum’s international reputation, foster partnerships and strengthen the NIA’s relationships with national, regional, and local partners, and I am proud to have helped shape this historic institution into a great center for American art.”McEnery succeeds John McAllister, who served as deputy director of the museum from 2007 to 2010, and will begin her new role on January 6, 2020. She will serve as director until the end of its current six-year term.“", "The next Biennial should take place between the years of August and September. It should be a comprehensive reflection of the history of the art in the exhibition, one that will also include the collection, exhibitions, performances, and other educational programs that have taken place in the exhibition venue over the last twenty years. \n\n\nThe British artist Brigid Hollis, whose dream of a pre-fabricated world would have allowed us to live, work and imagine in a virtual world, has died at age eighty-eight.Married with two boys, her husband of fifty years, Stanley, and their two daughters, there are now five grandchildren. Known as Hollis-Hollis, the painter was also widely known for creating paintings that would appear in the works of others, sometimes for years after their creation.Born in London in 1932, Hollis studied art at the School of the Art Institute of Chicago where she met Alan Bennett. After marrying, the couple moved to New York, where Hollis studied at the Cooper Union. In 1958, she moved with her children to Los Angeles, where she met Stanley. In the early years of the family, the family lived in a house in a converted barn on an isolated stretch of beach in the Santa Monica Mountains.", "The next Biennial should take place at the Madison Square Garden and the Whitney Museum of American Art in New York from April 22 to April 29. The theme of the twenty-third edition will be “The Art of Humanism.” The twenty-eighth will be “In Defense of Freedom.” The twenty-ninth will be “Feminist Art.” The twenty-third Biennial will be held in the city of Milan from March 16 to March 22; the twenty-fourth in the city of Turin from March 23 to March 27; the twenty-fifth in the city of Milan from March 31 to March 30; and the twenty-sixth in the city of Naples from March 28 to March 31. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has suspended construction on its 2015 reopening, “The Real Thing,” with its first retrospective of Japanese artist Katsura Hirokawa since 1999. The exhibition will now be held at the museum’s new home at 7500 S. Santa Monica Boulevard from March 19 to March 21, 2020, and is part of the institution’s ongoing efforts to prepare for its reopening. In a statement, the", "The next Biennial should be held in the decade 2020, he said. \n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has added twenty-one works in its current exhibition “American Art: Its Origins and Evolution,” which opens on March 3 and runs through September 20, 2020. The retrospective, which features work by eighty artists, including Rafael Viñoly, Ad Reinhardt, Willem de Kooning, Willem de Kooning & Co., and Matthew Johnson, plus new work by various generations of American artists, is billed as the show “opening up the giant” to the public.“This is a moment of great change—and we are all at the center of it, making art and connecting with art,” said Mark M. Z. Smith, the institution’s executive director. “The exhibition is a stepping stone to a much larger vision for the museum. We are eager to see where the show will take us next.”In the coming months, the institution will unveil its new spaces designed by architect Naima J. Keith, and then introduce a new series of programs, including “Beyond The American Dream: Art in the Age", "The next Biennial should be held somewhere in the United States, South Africa, or Australia, as the exhibition will return to New York in 2020. \n\n\nThe City of Chicago is starting a $1.5 billion rehabilitation and expansion of its Public Art Museum, which is undergoing a $150 million expansion, and is asking for your help in raising funds and designing programs for its collection and its collection of art. In a statement, the city said that the renovation and expansion will add 2,500 square feet of exhibition space and boost admission as well as improve accessibility. “The city’s restoration team is working toward creating a more cohesive, contemporary, and engaging collection environment,” said Amy Schriock, director of the city’s Department of Cultural Affairs and Recreation. “The reforms that we’re making will help our museum continue to attract and educate visitors across the city and improve the museum’s ability to hold museum-quality exhibitions.”The overhaul of the museum is part of the $2.5 billion overhaul of the city’s public spaces, including the renovation of the McCormick Place subway station; the expansion of the city’s historic sites, including the old McCormick Place", "The next Biennial should take place in the city in 2022.\n\n\nCities and communities around the world are working to mitigate the consequences of the coronavirus, which is spread mainly from person to person and causes the respiratory disease to be carried by coughing, sneezing, or breathing in droplets. As the coronavirus spreads, hospitals and health researchers are working to understand how it is transmitted and how to prevent the spread of the virus. The World Health Organization (WHO) estimates that more than 11.2 million people in the world are infected, and the number of deaths from the virus is rising.The coronavirus is spread primarily from person to person and is spread in close contact. When people are sick, they often share personal items such as utensils, bedding, masks, and clothing; people who aren't sick; or people who know someone who is sick. The virus can also be spread from person to person through the air. People who are infected can spread the virus from person to person by eating, drinking, or being near someone who is sick. The virus can also be spread from an infected to an uninfected body.If you or someone you know is sick, you might not want to share anything personal with", "The next Biennial should be under the banner of the United States and will invite twelve artists from eleven states to present their works at the iconic event. “I want to thank the 2017 theme for its ambitious research, the city of Boston, the 2018 edition, and the staff of the Biennial,” said James Stewart, the biennial’s artistic director. “We will continue to push forward with the theme, and hope to be able to present our second edition in 2021.”In addition to the theme, the 2020 edition was inspired by word magic, an ancient art form that draws on a similar form of magic to that that is practiced by the ancient Greeks and Romans. The 2020 edition will also incorporate themes of gender and race. • • • ·\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it is reopening in February 2020 following a $500 million expansion and renovation project, which also included the addition of a new seven-thousand-square-foot, studio space, the Judah and Mary Kendall Gallery, and the acquisition of two former industrial sites. The reopening date will be coincide with the opening of an eighteen-acre public garden that will extend the museum’s footprint", "The next Biennial should be a celebration of the original work of the artists, the region, and the city of Paris. “The idea that we have created this exhibition is to inspire people to think about the future of art, and the exhibition is a way for us to think about the past.” Galerie Soubry is organizing the exhibition alongside a series of events to coincide with the event.\n\n\nChairman and CEO of the Museum of Modern Art (MoMA), Phil Rosenfeld, announced today that MoMA is reopening to the public on June 16 after a five-year hiatus. The institution plans to begin welcoming visitors through a new digital platform, called MoMuseum.org, which will be available in both English and French. According to the New York Times, the new MoMA will be a “much-needed hub for the American imagination.”The announcement coincides with the release of the third edition of the Museum of Modern Art “Year of Art,” which will be presented by MoMA in May 2020. The exhibition features work by eighty artists from forty-eight countries and will be held at the museum from March 21 to March 26. Tickets to the exhibition will be free for members and will cost", "The next Biennial should be on August 18. “By undertaking this project, we are taking a step that will ensure that the exhibition will return to the museum in 2020,” said director Maria Ermini de la Araújo. “The exhibition has become a part of the history of the museum, and we are keen to continue this relationship with the institution.”The institution is also planning to expand the exhibition's reach by launching the biennial on a Saturday and expanding the program in the summer. The exhibition will be presented in both a séance-like setting and open to the public in the old Mariano Artista’s former space in Covid-19; the gallery will also be reconstructed and will boast new galleries and new programs. Inaugurating the structure will be an exhibition of work by thirty-seven artists in the Kumamoto Biennale group, which is composed of artists from the city of Kumamoto, neighboring areas of Japan and Korea, and the United States. The first show will be on October 27 and will be followed by three later this year. The biennial was established in 2017 by renowned architect Kiyomasa Shinkiba to commemorate the completion of the former assembly building of", "The next Biennial should be held at least eight years after the completion of the current art-world exhibition cycle. The biennial will participate in the 2020 Rio+20 and will receive ten percent of the gross domestic product (GDP) generated by the event in Rio.“The Biennial is a global platform for contemporary art, a vehicle for the exchange of ideas and ideas are causing new, interesting, and important works to be born,” the artist-run group ArtDRAWL told Artnet News. “The Biennial is a huge opportunity to be a part of it. We hope that the programme will be the inspiration for new thinking, a way of thinking about the future, a way of living together in harmony with the natural world.”Creative Capital, the parent company of the London- and New York-based art-world investment firm Vulture Partners, was founded in 2003 by Jack and Amanda Khouri. The firm was founded in London by Khouri and a group of friends after he was diagnosed with terminal cancer, and was founded by a group of around fifteen artists and developers in the US. The Khouri Children’s Foundation, which was founded by the Khouri Family to support the cancer-str", "The next Biennial should open in 2022. \n\n\nThe Chelsea Museum of Art has appointed Yvonne Rainer as its new deputy director for collections and exhibitions. Rainer comes to the institution after serving as the director of the Baden-Powell Art Museum in the German city of Baden-Powell from 2003 to 2011. Rainer will assume her responsibilities on March 4.“Yvonne Rainer’s appointment marks a moment of great change for the Chelsea Museum of Art,” said Chelsea curator and director Paul Gambaccini. “As we enter the twenty-first century, we are excited to welcome her into the team, to create new opportunities for her and for the community as we continue to impress upon the public the most important works of art of the modern era.”During her tenure at the institution, Rainer oversaw the return of four granddaughters of the late British collector Rene Boucher to the collection; guided the acquisition of one of the world’s most important African artworks by British collector David Carr; and organized more than seventy exhibitions and collections, including the first show of work by playwright Jean-Luc Godard at the museum in 2004. Rainer has also served as the", "The next Biennial should be held within the next three years. The exhibition will also launch a series of annual short films, promoting a new generation of artists, and will present a selection of works by Kate Bush, Alfred Küller, Paul Gauguin, Alexander Calder, Max Beckmann, and others.Director of the new Biennial Salah Kameelah, said: “The exhibition will allow us to further strengthen the Curator’s role and demonstrate our commitment to publishing creative works. We hope that this exhibition will present a point of view in favour of the artist as a whole. We view the exhibition as a way of questioning the identity and construction of the world through the work of our own generation.” The Biennial will be curated by Ahmad Saeed, chair of the department of contemporary art at the Faculty of Arts of Arts, Tehran. Dubbed “Unseen,” the exhibition will feature works by forty-nine artists from Iran and the region. The most talented Iranian artists will also be represented, including Mohammad Reza, Ali Reza, and Ali Reza Nouri, as well as work by emerging and established artists in Iran.\n\n\nThe Gates Foundation has announced that it will award $3", "The next Biennial should be held in 2022. The institution will also unveil a new digital platform that will visualize, catalogue, and show Biennials in the city’s museums, and will begin hosting public programming. The full list of participating artists is as follows: Andrea Bocelli, Gianluca Cattelan, Ingrid Marchi, Sara Martin, Léa M. Antille, Andrea Leoni, Nikita Miro, Maria Minas, Maria Pia Rossini, Claudia Rizzotti, Ana Pietro Zingaretti, Adriana Zingaretti, Jean-Pierre Zugman, and the Los Angeles Philharmonic, among others. Grand Prize winner Sara Zugman of the Los Angeles Philharmonic has been named the 2019 recipient of the Grand Prize. The prize was established by the Giardini in honor of its founder Giardino Bagnoli. In addition to the Giardini, the Grand Prize is also made possible by the dioceses of Venice and Venice, the Galleria di Venezia, and the Villa Gal", "The next Biennial should be held at the Santa Cruz Museum of Art in California, in 2021.<|endoftext|>Getty Images\n\nThe NFL is moving forward with a new set of rules aimed at preventing violence against trans athletes. Under the terms of a $15 billion settlement that was reached between the NFL, the National Coalition Against Domestic Violence (N.C.A.D.), and the states of North Carolina and Georgia, players will be able to use the restroom matching the gender with which they identify.“The NFLPA has been working with the NFL to help advance the development of a set of best practices that would allow players to safely use the restroom of their choice in accordance with their gender identity,” Mike Florio, NFLPA executive director, told PFT in a statement. “While we have not yet identified any specific practices that would require players to use a specific restroom, we have been working with the league to understand the essential benefits of fully inclusive locker rooms, including the safety, health, and well-being of athletes and fans.”Georgia state legislators introduced a resolution in support of the NFL’s plan, which was approved by Georgia Gov. Nathan Deal on Monday, and the bill now goes to the state’s governor", "The next Biennial should be in October 2020.Howell and I are going to work with a partner to create a new project that will be a continuation of the Museum’s early work, with a new focus on African American art, and a new exhibition space in partnership with the Compton Art Museum. The first Biennial will focus on the themes of the year: Freedom, Resiliency, and Community. We will announce the full scope of the work in 2020.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that the museum will reopen to the public on Wednesday, October 18, following a £10 million expansion designed to increase the museum’s physical footprint by a further 6,500 square feet. The renovation project also further strengthened the museum’s collection of contemporary art, with the addition of twenty-one new works by the American artist Rashid Johnson, a founding member of the Harlem Renaissance, and the French modernist Alexandre Aïssu, as well as the museum’s first series of films, The Third World, in 1982.The reopening of the museum follows a swift and furious expansion that involved the construction of a new building, the contemporary headquarters of the ICA, and the", "The next Biennial should take place at the Museum of Modern Art in New York in 2020.\n\n\nThe Royal Academy of Arts (RA) in London announced today that its newest member, the British artist Parag Khosla, will be its first artist-in-residence in the country. Khosla, who is known for his intricate geometric, pottery-like works, most recently exhibited his work, titled Tangled, at the Royal Academy of Arts in September 2018. Parag Khosla is currently based in London, where he lives and works, and is currently working on a new work, titled Aerial Vision, which is scheduled for completion in 2020. The commission was presented by the Rabkin Foundation, which was founded by parents of British artist George and James Rabkin. The foundation received $10,000 from the Rabkin Foundation for the Royal Academy of Arts. The institution will also receive another $10,000 from the family of former British Prime Minister Margaret Thatcher. The family will also receive a commission for their daughter, Charlotte, who is slated to become the first solo artist to be included in the museum’s 100-year anniversary celebration in 2021.Commenting on the upcoming exhibition, which will be held", "The next Biennial should be held in 2022. When the festival returns to the capital, it will be accompanied by a number of exhibitions and a wide array of performances.\n\n\nTaoiseach Donald Trimble, chair of the Fine Arts Council, has announced that the institution will suspend the annual Frieze Arts Award until the institution can address the controversial diversity-related policies of its British-based affiliate.  In a letter addressed to the Royal Shakespeare Company over the weekend, Trimble wrote: “I am writing to request that you refrain from presenting the award, the Edinburgh Festival, the Wellington International, Spring Festival, and the Edinburgh Book Fair in December and December 2020, and instead focus on developing your new partnership with the British Museum and the Royal Shakespeare Company.”The letter, which was shared with the Royal Festival Company, reads: “I agree that at this critical juncture it is essential that the Royal Shakespeare Company and the Arts Council have a discussative, collaborative, and collaborative relationship which is respectful of the outcome of the 2020 Annual General Meeting, and which will recognise the important achievements of the last twelve months, including the programme and exhibition year.”It continues: “I believe that this is the", "The next Biennial should focus on “a reconstruction of the history of the twentieth century.” The show will also examine themes such as the new global economy and the political crises caused by climate change. The exhibition’s inaugural edition, which opened in Los Angeles in June, was met with angry reactions from critics and the general public when it was announced.The Los Angeles Times and the Los Angeles Sun claimed that the event was cancelled due to the “overwhelming feeling that the exhibition was modeled after a 1960s-era version of the ‘center.’” The show’s designer, the Israeli-born, Los Angeles–based architect Ron Yasser, denounced the criticism, saying that the center was “very much a continuation of the work of the past.” He also claimed that this was the only use of landscape in the show. “The question of how to reenvision the twenty-first century has been around for more than seventy years,” Yasser wrote in an open letter to the Los Angeles Times. “So it is with regret and trepidation that we are announcing that the show will not return to the Pacific Palisades, and we will move forward", "The next Biennial should be released in 2021, and the third in 2023, and this year’s exhibition will first run in the Far East in Tokyo from March 21 to March 25.\n\n\nThe Museum of Contemporary Art (MCA) in Chicago has appointed Elizabeth A. Faegre as its new senior director of contemporary art, film, or design. Faegre comes to MCA from the Metropolitan Museum of Art, where she has served as deputy director of contemporary art, film, and design for the last five years. She succeeds Monica C. Jus, who departed the institution in March 2019 to head the Photographs Center, and will assume her responsibilities on March 29.“Elizabeth brings a wealth of experience and knowledge to our contemporary curatorial team, as well as a deep love of art and design,” said Paul Siegel, MCA’s director and CEO. “As we look to the future, we are inspired by her vision for bringing museum-level programs to her hometown of Schaumburg, Illinois, and for how those programs can impact our communities. I know that Elizabeth’s passion and drive will be instrumental in our continued success, and for our long-term strategy to grow our impact", "The next Biennial should take place in Tokyo in 2021, and the final in 2020. Based on the Tokyo Metropolitan Museum of Art's original design, the museum will be located in the former Warhol Museum, and will exhibit around six hundred works. The main hall will be equipped with a café, and there will be various public viewing rooms. The pavilion will be divided into three parts. The first phase will consist of the installation of the exhibition “A World Without War” (September 15–September 17, 2021). The pavilion will host an exhibition of works by ninety-six artists and collectives from seventy-two countries in September and September 2022. The second phase will consist of “The Women of War,” May 20–September 21, 2022. The third phase will consist of “Russia” (September 23–September 27, 2022), “Women in Film,” October 3–October 6, 2022, “Cosmopolitan” (October 10–October 13, 2022), and “Agorhia Retrospectiva: Subversion” (October 17–October 21, 2022). The Art of the Contemporary will be presented by the Museum of Contemporary Art—New York in September 2020 and", "The next Biennial should take place in the northern hemisphere and should have a theme of the 'gardens of life,” said MoMA art historian Roberta Smith. “The themes of the exhibition should be based on the questions of sustainability. We cannot live in a world without the gardens. We cannot imagine a world without the garden. This is a global issue, and we all share a responsibility to act.”The theme of the event is “In Defense of the Garden.” It is one of a number of themes being explored by the museum in the coming months and years. It is also one of the themes that will play a role in the renovation of the museum’s existing buildings, which were constructed during World War II and were not inhabited by visitors until 1963.\n\n\nA group of artists, writers, and other cultural workers are protesting at the San Francisco Museum of Modern Art (SFMoMA), which recently received a $1.5 million donation from the Wellcome Collection, according to Artnet. On Monday, the group delivered a letter to the institution’s director, Daniel H. Weiss, which called for the collection to cancel the donation and return the funds. In the letter, the artists", "The next Biennial should take place in 2021, and the 2020 edition will be held in 2021. Following an overhaul of its registration system in 2017, the Summer Biennial will be held in 2022. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to reissue its annual Jackson Pollock Award, which was established in 1999 to recognize the work of women artists. In addition to the annual $50,000 prize, the institution will also introduce a special exhibition of work by women artists at MoCA in 2020. The event will be held at the gallery’s current location at 646 South Santa Fe Avenue in Los Angeles from May 25 to May 30.“The Jackson Pollock Award is an important milestone in MoCA’s history, and we are eager to honor the visionary artist and her legacy with this year’s show,” said Michael Govan, director of the museum. “Her work continues the work of many pioneering artists and designers, and we are honored to be able to honor her legacy with this exhibition.”The inaugural exhibition, “Jackson Pollock: The Beggar,” will feature work by seventy-six artists, including", "The next Biennial should be held in 2020–21, when the biennial will have reached its twenty-fifth year.The biennial will be hosted by the National Gallery of Art in Washington, DC, and the Museum of Fine Arts in Boston, and will feature a new exhibition of work by seven artists, including Francis Alÿs, Rosalind Arnold, Ronald Black, and James Curran. The 2019 issue will be released on December 10. Unveiled at the opening of the biennial in March 2019, the exhibition featured work by women artists, including Frances Stark, Fanny Arcilla, and Patricia Garrigue.\n\n\nIn a move that could imperil the future of the Trump administration’s ambitious climate agreement, the United States Senate voted on Tuesday to slash funds to the Environmental Protection Agency (EPA), the United Kingdom, and other climate-change-related agencies by $100 billion over the next ten years. The legislation, which only narrowly cleared Congress last month, would slash funds for aspartification, the reclassification of carbon dioxide as a pollutant, and the regulation of carbon dioxide emissions—a move that would devastate the environment.“The Trump administration’s proposed budget for 2020", "The next Biennial should take place in 2020 and will consist of the exhibition of work on a large scale by a select group of artists whose works have been selected for inclusion in the forthcoming edition. The biennial will include more than 120 works by artists from all over the world. The biennial exhibition will be held at the San Francisco Museum of Modern Art from May 17 to May 21, 2020. The 2019 biennial was held at the Museum of Contemporary Art, Los Angeles (CAFO); the 2018 and 2017 biennials were staged at the San Francisco Art Institute (SFMA); and the artists featured in the biennial exhibition were:\n\nJeremy Deller, Saara Adenuga, and Anish Kapoor have won the 2019 Cannes Film Festival. Both artists have been nominated for a prize in their respective categories, which were presented by Cherie Blair, and will be presented at the Cannes Film Festival in May. The art critics will be judged by Arne Glimcher, editor of Cannes, and Jean-Marc Payot, the director of the film festival.“The images in the film show us the future, the future that is as uncertain as it has always been,” said Casey Close, director of the International Film Festival", "The next Biennial should be held in 2020–21, before the winter solstice, in the autumn and winter seasons. However, the institution is currently considering the possibility of holding a new exhibition in the spring of 2021, and that the seventy-seventh edition of the Biennale—originally to be held in Tokyo in 2019—should be held in the fall.A statement by the Biennale’s artistic director, Anneke Wijers, said: “The next Biennale is about to begin, and we are convinced that it will be an event of international significance. We are hopeful that this year’s edition in Helsinki, which is scheduled to take place in January 2021, will reach a new audience of international stature.”\n\n\n\n\n\nArt�’s 1st Sundance Alumnae: Andrea Shaffrey, Daniela Sola, and Adam Sand. Courtesy of the artist and the Los Angeles County Museum of Art.\n\n\nThe Museum of Contemporary Art (MoCA), the California-based arts organization, announced today that it will end its relationship with the Israeli government-run academy, known as Bezalel Academy, on April 20, 2020. The organization’s", "The next Biennial should welcome the general public in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of twenty-six works from the Italian sculptor Piero Manzoni. The gift includes pieces by artists such as Agnes Martinetti, Mice and Men, Philippe Auger, and Arne Glimcher; as well as the first works by Italian-born Brazil artist Gustavo Cifuentes. Manzoni’s gift includes works by artists such as Adriana Poggio, Michele Ufficio, and Stella Coroni. The gift also includes a rare copy of the artist’s first solo exhibition, which was held at the museum in 2003, and a painting by the Italian artist Victor Adamec.In addition, the museum is slated to reopen in 2020 following a $45 million expansion. The work in the envelope is a rare work by the legendary Italian artist Riccardo Manzoni, a bronze sculpture by the artist, and a recent work by Christo.A spokesman for the museum said: “The work in the envelope is a significant contribution in understanding the breadth and depth of Manzoni’s artistic career. From", "The next Biennial should be held in 2020. In the meantime, the museum is planning to turn the galleries into temporary venues for live performance and is preparing to open a new building designed by Rafael Viñoly in the city of Recife, Brazil, which will bring together contemporary art and contemporary Brazilian art. The exhibition will feature work by less established artists such as E. P. Thompson, Nandi Araújo, and A.D.O. Inacio and will run for fourteen weeks.\n\n\nThe only surviving member of the National Gallery in London, which closed in 1949 after eleven years of operation, has filed a lawsuit against the institution to reclaim some $1 billion in assets that the museum claims are its intellectual property. In a complaint filed in London's High Court on November 27, the plaintiff, Hannah Eddy, claims that the National Gallery is attempting to enforce a copyright that lapses in perpetuity and was not properly registered. The National Gallery’s lawyers claim that a search of the institution’s archives revealed that it had not registered the copyright in the works covered by the suit and that the National Gallery is attempting to use the legal proceedings to compel the museum to surrender the intellectual property.After the court", "The next Biennial should be held in 2021, and the three-day event will be staged in two stages\u0097the first of which will be held in the Czech Republic from April 14 to April 16, 2021, and the second in Zurich from May 3 to May 5, 2021. The art world in general and architecture in particular will be affected by the coronavirus and will likely be the first to experience a reduction in visitors as a result of the novel coronavirus. The exhibition’s inaugural iteration in Zurich will last for four weeks, beginning in March and running through May 25, 2020.The artist-run collective the Camerata Team, which was founded by Stefano Cavaloni, a former director of the Venice Biennale, is also collaborating with the organizers of the event to further analyze the coronavirus. The team is working on a new kind of suitability analysis that will help designers and architects who are designing for buildings and will present the results of the collaboration at a future exhibition.According to the New York Times, the coronavirus has been linked to one death in the Czech Republic and at least three cases in Switzerland. The outbreak of the virus in Wuhan, China, last month prompted China to quarantine all of its", "The next Biennial should take place at the Pérez Art Museum Buenos Aires in the spring of 2021. In January 2022, the Museum of Contemporary Art in Mexico City will stage a retrospective of Lucio Fontana’s work in a building designed by the architect. The exhibition “The Art of Change” will show the work of twenty-three artists.\n\n\nThe National Gallery of Art and the Metropolitan Museum of Art in Washington, DC, have agreed to create one massive mixed-use complex to house the works of all fifty states and the District of Columbia. Named the Smithsonian’s National Museum of American Art, the sprawling campus will boast more than 50,000 square feet of exhibition spaces, classrooms, a research library, and space for educational programs and initiatives, all of which will be connected by subterranean passageways that will enhance accessibility.“The project’s timeline and the museum’s commitment to American art mean that this institution will have a significant role in the development and preservation of a national treasure,” said museum director Konrad Moglen. “We are eager to work with the communities of Washington, DC, and the Smithsonian to further our vision of future generations of American art by building a museum", "The next Biennial should take place in 2020. “The residency program, as an institution, is very much a work in progress,” said David H. Peña, chair of the department of art history and director of the old-guard museum. “We will continue to innovate, to experiment, to design exhibitions and programs with an international, local, and transnational character that reflect and celebrate the richness and ingenuity of the local.” For the next cycle, the Museum of Fine Arts (MA) at the University of Chicago will present the biennial “Award for Excellence in Art,” which will consist of new works by a group of artists, curated by MOAM, in partnership with the institution. In addition, the museum will present a number of special exhibitions, including “The Program,” a presentation of work by artists such as Ed Moses, Olu Olu, Huyghe, and Vincent van Gogh.The 2019 edition of the biennial, “Between the Sun and the Moon,” featured new works by around fifty artists, including Judith and Yinka Shonibare, who are collaborating on a new series of paintings based on an image series by artist", "The next Biennial should be held in 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston, which laid off around two hundred employees on Wednesday, July 3, in the aftermath of the Covid-19 pandemic, has set a goal of hiring five hundred additional staff members by mid-August. Since the exhibitors are facing a hiring freeze, the museum anticipates a hiring shortfall as it tries to comply with the federal government’s August 18 shutdown.In a written statement, the institution said: “As we continue to monitor the Covid-19 situation, we have made the decision to reduce the size of the Museum of Fine Arts (MFA) and hire more people. We know that hiring a lot of people is not an option. At this time, the management team believes that hiring more people will only result in a slower pace and a further fall in our financial results.”Though the workers were let go on Wednesday, the people who were affected were not let go. They are being offered severance and are being offered job security, but their conditions of employment are being held in limbo.On Thursday, the museum laid off forty-three staffers, citing a staffing shortage. Those forty-three employees who", "The next Biennial should take place in 2020 and will run for twelve months. The event will be led by artist-in-residence Mary DeWitt and will be held at the Art Institute of Chicago and will culminate with a grand finale on March 22. The exhibition will also host works by a select group of artists selected from the country’s contemporary art community. Its first exhibition of work by artist-in-residence Georges Apostuil will open at the Art Institute in December 2021.The biennial was established in 1986 as part of the Chicago Cultural Exchange (CCE). It was created as an extension of the CCE, which was renamed the Art Institute of Chicago in 1995. “The future of the CCE is in serious danger of becoming a referendum on the future of Chicago,” said David Levine, director of the Art Institute of Chicago. “I’m honored to be able to support this work by working with the artist-in-residence and fellow creatives across the country to present a show of work that will reflect the spirit and vitality of Chicago.”This year’s exhibition, “Power of Paintings: From the Art Institute's Collection to the People,�", "The next Biennial should be held in 2022, and the work of the seventy-three exhibitors should then be up for public viewing at the museum in 2021. A selection of the works on view will be presented at a special exhibition of the exhibition in June of 2022.\n\n\nThe National Gallery of Art in Washington, DC, has been gifted a multimillion-dollar donation from the heirs of the late philanthropist Warren K. Kanders, who was a leading proponent of modern and contemporary art and a leading advocate for the Arts in general. Founded by founder Robert J. Kanders in 1941, the institution, which has a current operating budget of $25 million, has served as a powerful cultural platform for African American artists and organizations. Kanders, who passed away in New York on December 21, 2017, was a major force in shaping the museum’s curatorial practice, which was more than twenty years ahead of its time in its emphasis on African American artists and its emphasis on the humanities, and an ardent defender of the arts.“Kanders was an immensely generous benefactor,” said David Guggenheim Partners cochair John Carnegie. “With his own money and that of his sons and grandsons, we have", "The next Biennial should focus on reconstructions, as well as presentations of works from the twentieth and twenty-first centuries. The 2020 edition will be held at the Museum of the African Diaspora (MoAD), in Johannesburg, South Africa.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Jodi Throckmorton as its next executive director. Throckmorton comes to the institution from the Museum of the African Diaspora (MoAD), where she has served as the director of public relations since 2016. She succeeds Chris Siefert, who retired in March 2019 after twenty-eight years at the helm of MoMA.“With deep experience and knowledge in contemporary art and a proven track record of success, Jodi brings both the vision and ability to turn around MoMA’s curatorial programs,” said director Richard Armstrong. “While she has a long history of working collaboratively with MoMA’s curators, she has the opportunity to enact meaningful change for our curators’ programs, curatorial staff, and the institution as a whole.”Throckmorton joined MoMA in 2011 as associate curator of modern and contemporary art. Shortly thereafter, she accepted", "The next Biennial should take place in the fall of 2020 and is expected to draw up to 1,500 visitors.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Jared Friedman as its new director and chief curator. Friedman arrives from the Los Angeles County Museum of Art (LACMA), where he has served as director of exhibitions and programs since 2016. During his tenure at the museum, he helped organize more than seventy exhibitions and has worked to improve the museum’s collection and programming in an effort to attract and retain more visitors and visitors’ money.“Jared is a curator and scholar who has been instrumental in the growth of the LACMA Museum of Art, which he began in 2012, and whose work has been featured in major exhibitions at the Museum of Modern Art, the Whitney Museum of American Art, and the Los Angeles County Museum of Art,” said director Matthew Teitelbaum. “Through his expertise and dedication in modern and contemporary art, he has shown us the possibilities of the Biennial to create a really good event and a really great museum.”Friedman began his career at the Los Angeles County Museum of Art in the late 1980s as a curatorial assistant.", "The next Biennial should be set up immediately and will be open from March 23 to March 29.  The exhibition will consist of biennial sketches of the works of six artists nominated by the public. \n\n\nAfter a gunman opened fire on a group of people attending a peaceful protest in Virginia, killing nine people, including six Virginia residents, on Saturday, March 14, the city of Washington, DC, announced that it is working with the National Park Service to protect the public by restricting the movement of people, vehicles, and events in and near the National Mall. The move is part of a regional strategy developed by the District of Columbia to prevent the spread of Covid-19, which has killed more than 3,500 people in the United States and has caused more than twenty-five million infections. Calls for greater restrictions on gatherings have been widespread since President Donald Trump was elected, and the rise of the movement the #BlackLivesMatter movement.While DC has made efforts to reduce the number of people it invites to events and museums, such as by limiting the number of visitors or charging a fee for some events, the number of people who have died from the virus in the city has risen. On Saturday, two people died from the", "The next Biennial should be set in 2022, the same year as the 2020 event, but with the addition of African and international artists to the mix. Although currently under construction, the exhibition is expected to launch in the spring of 2020.\n\n\nThe Museum of Arts and Design (MAAD) in New York announced today that it is rescheduling its upcoming edition, “Moderns: Thirty Years to Live.” The exhibition will now be held in 2020.Curated by Peter Klotz and Naima J. Keith, the show will run May 12–May 22, 2020 and will be comprised of paintings, sculpture, photography, video, installation, and performance. The exhibition will also introduce a new series of programming that will allow MAAD visitors to connect with the works of contemporary artists and will be curated by Steve Scheer, director of MAAD. “We are thrilled to be working with Peter Klotz and Naima, who brings a unique perspective and a unique vision to the show,” said curator and curator Craig Doctorow. “These men have been wonderful collaborators in the past, and we know that they will continue to be so with the show ‘Moderns: Thirty Years to Live.", "The next Biennial should be held in 2021. “The Biennial was born out of the need for a new and more inclusive kind of art exhibition, one that would address and reflect on the universal human condition,” said Cynthia L. Sanchez, chair of the trustees of the Biennial. “The artists that we have chosen for this year’s event are showing remarkable new and exciting work in many of the most important public spaces in the city, including the Bruce Harrell Gallery, the Museum of Contemporary Art, and the Museum of Contemporary Art Los Angeles. The theme of the 2020 edition of the Biennial is Life, Life, Life and Life’s Place.” The 2019 biennial, entitled “Becoming Human,” was staged at the Warner Bros. Theater in the downtown Los Angeles neighborhood of West Hollywood. The 2019 event, titled “Becoming the Center of a Life,” was organized by the artist-run group The Power of Place, which was founded in 2015 by Kara Walker and Laura Owens. It also featured Michael Rainer and Virginia Giuliano. The event was co-organized by Cara M. Bailey, Warner Bros.", "The next Biennial should be titled “After Life,” a collaboration between the artist and the artist’s collaborator, the Dutch architect Knut Siemann. The exhibition will focus on the intersection of art and technology, and will be organized in cooperation with the artist and the architect.The new exhibition will feature work by forty artists, including Naima J. Keith, Amy Lee, and Alice Aycock.\n\n\nThe National Gallery in London is revamping its appearance in preparation for the 2020 exhibition “The Future Is Present: Art and the Future Now,” which will be held in the museum from March 19 to March 22. The redesign, which was first announced in March 2018, involves the reconstruction of the gallery’s north tower, a redesign that lowered the museum’s elevation by 1,800 feet. The redesign also involves the restoration of the gallery’s historic lobby, which opened in 1817, and the redevelopment of nearby land.“The redesigned National Gallery is a powerful extension of our mission to present the art of the future in a way that is inviting, practical, collaborative, and collaborative,” said Sarah-Jane Woolf, director of the National Gallery. “The redesign of", "The next Biennial should be organized as soon as possible. We need to be able to produce an exhibition of the work of the artists that we love, and it must be an opportunity for the public to visit and interact with the exhibitions and to see the work of the artists. I welcome the opportunity to organize an exhibition of the works of the artists who have been selected for the next Biennial.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has issued a statement regarding the exhibition “Art in America: A History,” which will host forty artworks by forty artists from sixteen galleries in New York City next month. The fourteenth iteration of the exhibition, “Art in the City: 1970–1984,” will take up the theme that has served as the backbone of the city’s collection since the late 1970s. In honor of the centenary of the birth of American art, the exhibition, which will feature approximately 1,900 works, as well as a selection of new works, will mark its centenary with a special exhibition dedicated to the twenty-six artists who won the Turner Prize.“The DCLA is delighted to present the forty-ninth iteration of the DCLA", "The next Biennial should be held in 2020. The institution has yet to announce a date for the 2019 edition.\n\n\nIn the run-up to the 2016 presidential election, the Museum of Modern Art (MoMA) in New York staged a number of protests against Donald Trump, including one last year, when thousands marched in Times Square to protest his candidacy. The protests, which were organized around themes of racism, sexism, and xenophobia, were largely peaceful, but the protests led to a change at the institution. Following protests, the museum appointed Michael Apted, who has served as interim chair of the institution since June, as its director. According to the New York Times, the museum received several hundred thousand anti-Trump protestors on Friday, and as of Sunday there have been at least sixty other demonstrations scheduled across the United States in the coming weeks.The protests have been sparked by statements Trump has made in the past that have made controversial comments about women and minorities. Trump has frequently been accused of perpetuating old white supremacist tropes, but he has denied these accounts and has called them offensive. Apted, who previously led the Museum of Modern Art in New York, has defended his appointment, calling the protests “disturbing", "The next Biennial should be the first in the country dedicated to the interdependence of the body and the brain. The theme of the event will be “Art and Life” and will focus on how bodies, including their artworks and bodies, interact with and shape the world around them. The pavilion will be made of eleven platforms. The first exhibition will unfold on September 24, 2020. The second “Art and Life” show will take place in the pavilion on September 25, 2020.\n\n\nThe American Alliance of Museums (AAM) is launching two funds to support cultural organizations and institutions damaged or destroyed by Hurricane Matthew. The funds will go toward collections that were damaged or destroyed by the Category 4 storm as well as to support the care and treatment of artworks and artifacts at risk following the storm.“Hurricane Matthew is a reminder that we are resilient and that we can’t always prevent storms like this from destroying our cultural heritage and our way of life,” said Pamela Futter, director and CEO of the AAM. “The public has every right to celebrate the musical season with a musical festival—but we must also ensure that cultural institutions are not damaged or destroyed in the line of duty", "The next Biennial should take place at the Museum of Contemporary Art Cleveland from November 6 to November 8, 2020. Nominated for this year’s award were the sculpture group the Preludes, a group comprised of the various members of the New Age movement; the Salt Lake City Art Museum, a group made up of artist-activists, writers, and musicians; and the Coachella Valley Art Museum, a group of artists who gathered for a series of shows and residencies. Nominated for the 2019 award were Steve Guttman, Daniel Buren, David Cage, Frank Gehry, Robert Irwin, and David Salle. In an open letter addressed to the jury, the art historians said that the work of the five finalists was “a great work of art that reflects the richness of the artist’s practice and that is a great work of art.”\n\n\nThe Egyptian Museum in Cairo recently announced that Ebony and Silk Road artist Nima Nabavi will be a featured artist at the institution’s twenty-third edition, “Algeria & Europe,” which will open in the United Arab Emirates on March 16. The event is organized as part of the Egypt Initiative, a collaboration", "The next Biennial should be held in 2020, with the option of rescheduling if the project is successful.\n\n\nArtists and collectors Victor W.P. Soto and Sison (Soto), the founders of the New York–based consultancy and gallery, have announced a new partnership that will bring together the works of forty-six artists over a three-year period. The initiative, called “618,” will invite artists to the studio to discuss their practices and their future projects. The exhibition will highlight the work of six artists who are the core of the the New Museum’s permanent collection: Benito Alarcon, Alia Barose, Allison Campbell, Haim and Haim Steinbach, David K. Johnson, Lexington McKee, and Walter Laverrière.“This is an unprecedented partnership,” said Soto. “I’m honored to be working with these artists in the first place and to collaborate with the collection since it’s my home. They are a treasure trove of cultural heritage, and I hope this exhibition will be a catalyst for them to think deeply about their work and their future.”The artists participating in the exhibition are Benito Alar", "The next Biennial should be in the spring of 2020. To celebrate the milestone, we have launched a new online exhibition, which will be on view from April 3 to April 5, 2020, and will feature new works by artists in the exhibition. We are also planning to launch a biennial book on biennial exhibitions in the fall of 2020. The new biennial will be housed in the Kunstraum Städelschule, a public space in the Kreuzberg neighborhood of Munich, and will feature between twenty and thirty new works by artists in the exhibition. The exhibition will be organized in such a way as to allow for a constant flow of visitors and the exhibition will be held in the city of Munich as well as in the Kreuzberg. The exhibition will be organized in such a way as to avoid restrictions on the exhibition and will be open to the public from April 3 to April 5. The exhibition is planned to open in May 2020. The Biennial will be hosted in the Kreuzberg from April 3 to April 5, 2020. The exhibition will be held in the building of the Kreuzberg’s Department of Arts and Culture, between April 5 and April 10, 2020. The first Biennial", "The next Biennial should be held in the spring of 2020. The 2019 event, which addressed topics such as the impacts of climate change, the environment and the humanities, was cancelled in March due to the Covid-19 pandemic. “I’m very excited about this year’s new Biennial,” said Adam Gopnik, director of the Center for Art and Environment at the University of Washington. “A real test of our cultural industry’s capacity to address the challenges of climate change will occur in the spring, as the climate warms and we adapt. Our work is critical to shifting the balance of global warming in our favor, and making the world a better place for future generations.”The 2020 event will take place at the historic Pearl Street Armory, which was completed in 1972 and consists of two venues: the Armory and the Museum. The Art of the Harvest Festival will be held at the Armory. A full list of participating artists is as follows:Blake LaBoeuf, Atlanta;Sugarhill Gallery, Pomona, California;John Pascual, Atlanta;Kate McEnery Gallery, New York;Juan Manuel Ibanez, San Juan, Puerto Rico;Oliv", "The next Biennial should be held in 2022. Her first formal commissions will be a “Topology and Vector Methods” lecture and a “Composition and Transformation” exhibition at the Museum of Contemporary Art (MoCA) in Santa Monica, California, on February 7, 2023.\n\n\nThe Metropolitan Museum of Art (MoCA), in New York, has awarded the sixth-year student artist Noor Hendrix the $1.25 million MFA in Performance Arts. The honor comes after she works in a variety of media, including installation, performance, research, and prose.“The Met is devoted to the art of performance, and we’ve been very deliberate in planning for the exhibition of six years in advance,” said Hendrix. “We’ve created a series of opportunities for student artists to interact with the museum in order to create a sense of community and a shared project. In the past, the Met has selected a handful of students to participate in each of these exhibitions, but our current strategy is to organize them as a group. We hope that the exhibition will help them develop their own voices and inspire them to think outside the museum walls.”The exhibitions “Examplifier", "The next Biennial should take place in Milan in March 2020 and will be hosted by the Museum of Contemporary Art in the City of Italy.\n\n\nThe third edition of the Biennale d’Art Contemporain (BAC) in New York has announced that the inaugural event, “Miriam, is ready to go again.” Of the first two installments, which were staged in the city of Marseille in March and April of 2017, the third, titled “Allergic,” will take place in the city of Basel in the autumn of 2022.The event will continue to be held in the US and the UK. “We’re excited to announce that the BAC will return to New York and New York City for a third iteration in October 2022,” said Maurizio Troiani, the director of the Museum of Modern Art and Art in St. Martin’s, and Adette de Ciani, president of the Art Madrid Biennale. BAC, which began in 1980 as an annual exhibition of contemporary art, expanded to become a monthly platform for artists to present their work and to present collaborations with other artists. “The", "The next Biennial should be held in 2022, and the next will be held in 2023. “We are in the process of organizing new programming for the museums and clearly need your support in this regard,” Ghebrey told the museum. “We are making great efforts to secure additional funding from the city of Toronto, the province, and the federal government in order to further develop the city’s collection and to continue to improve the lives of residents. We thank the people of Toronto for their tremendous support thus far.”For the full list of contributors, click here.\n\n\nThe Museum of Fine Arts (MMFA) in Detroit has accepted a $5 million donation from the Michael and Hildegarde Ford Foundation. The gift, which comes on the heels of the foundation’s $5 million grant to the institution in 2016, will enable MMFA to create several new exhibitions and events in collaboration with the Ford Foundation and the Wayne County Museum of Art in Detroit.“Mark is a philanthropist who embodies the values and spirit of Detroit,” said Bruce Gates, the foundation’s president, and former CEO. “He has always believed in the museum’s potential, and made", "The next Biennial should take place in the spring of 2020.\n\n\nThe VitraVet Museum of Art in New York, which was planning to close in 2020 after more than eight decades, is considering reopening in 2021. The institution announced today that the decision was made to preserve the institution’s primary work, the German Expressionist painter Beethoven’s masterpiece The Symphony No. 3, a monumental work celebrating the theme of the year, and to incorporate the project into the visual arts.The museum is currently working on a plan to reopen in 2021 that will bring the institution’s collection and exhibition center as well as many of its works on display in the city’s Central Park and the Rockefeller Center, both of which will be restored in some fashion. The downtown museum will also have a new public plaza and a restored exterior garden.“VitraVet’s work is a central and enduring expression of Beethoven’s artistic spirit,” said biennial director Eileen C. Matthews. “As a group, we have been working tirelessly to ensure that VitraVet will be open and that the VitraVet Museum of Art will remain a destination for visitors to visit and", "The next Biennial should take place at Saarbrückerhaus in Frankfurt in early 2020, and will raise funds for the marginalized by highlighting contemporary art and artists.  Museum director Michael Bemma told the Art Newspaper that he hopes the event, which will highlight the work of the marginalized, will attract audiences of young and old, students and professionals, and will be a vehicle for connecting young artists to the work of their parents. \n\n\nThe Metropolitan Museum of Art (MoMA) in New York has received a gift of twenty-seven works by Puerto Rican-born artist Javier Barrios, a selection of which will be included in the museum’s forthcoming exhibition “Witch Hunt: Puerto Rican Art in the 1980s” curated by Carla Caldwell. The gift includes works by Puerto Rican artists such as Luis Antonio de Bellas, Henry B. Aguilar, Gina Carranza, Cristina Munguía, and Bolando Moreno.“A monumental gift for the Museum, given the significance of the works to our collection, to a substantial collection of Puerto Rican art,” said curator and chair of the exhibition. “We are honored", "The next Biennial should consist of a retrospective of the artist’s work, a special exhibition and the opening of a new institute devoted to the artist’s work, or both.”The events that will take place at the institution include: Arts and Culture Festival (2019); “Avant-Garde in the Cities: From Impressionism to Contemporary Art” (2019); “Art and the City: A Retrospective, 1950–1965” (2019); “Art and the Future: ‘Modernism and the End of the Art Age’” (2019);  “Art and the Future: ‘Feminism and Postwar Art’” (2019); “Art and the Future: “Arts and Culture: A Retrospective, ” curated by Selma Cassanno; “Art and the Future: ‘Modernism and the End of the Art Age‚; and “Art and the Future: “Arts and Culture,” curated by Hiromi Ito and Alejandra Salazar.The 2019 exhibition will be inaugurated by a selection of Sant", "The next Biennial should take place in 2021, and the first exhibition in 2022. The new exhibition will be a joint project between the Institute of Contemporary Art and the Centre Pompidou in Paris, and will showcase work by twenty-six artists, including Aria, Achenie du Louvre, Arsht, Bergila Kahāri, and Pilar Otero, as well as a selection of collages, paintings, prints, books, and other works. The project will also include the exhibition of work by five young North African artists, Jaarne Akram, Qadir al-Din, Thaitta AL-STEWART, and Jaarne Akram II.\n\n\nThe Turkish art historian Ozyal Bayraktar, a prolific writer and editor who taught at the Istanbul Academy of Fine Arts and at the Istanbul State University, has been named the winner of the Presidential Award for Contemporary Art Istanbul. The literary theorist, writer, and educator, who arrived at the institution with a background in theater and dance, was nominated for his book ÜKamala Wali,” which examines the role of women in Turkish modern art and culture. He was nominated for the prize by Marina Y", "The next Biennial should be held at the same location as the exhibition and will be on view until October 25. \n\n\nThe Weinstein Company announced today that Harvey Weinstein (20th Century Fox, New York) will serve as an executive board member of the new BFI London, which will be inaugurated by the artist Shepard Fairey on November 6. The announcement marks the first time Weinstein will be a full board member since 1992.The announcement of the corporation’s new headquarters at 170 West Eighth Street comes amid the ongoing controversy over the role of the Weinstein Company in Hollywood and extends a long-standing tradition of the company’s board members serving as honorary trustees. In 2005, the organization announced that James Tobey, a senior executive, and Mira Nayden, a senior vice president, would become honorary trustees. The appointments were made in an attempt to show that the company was truly committed to supporting artists and that the board had a role in shaping the financial and artistic development of the arts.In a statement, Weinstein Company said: “We are thrilled that this special occasion brings us together as trustees, as it will help us to build on our strong legacy of supporting creative talent and to provide a platform for future trustees. The board", "The next Biennial should be held in 2020. The Noguchi-Mensch-Hirshhorn-Ford Foundation has announced the winners of its $25,000 biennial awards, which recognize outstanding achievement in the art world.The biennial, which was established in 2001 to honor the legacy of John Giorno, has received $46.5 million since it was founded. According to the New York Times, the foundation has already raised $53 million to date for its next edition. The biennial is divided into ten categories: Contemporary Art, Design, Design/Designing, Experimental Art, Film, Fashion, Fashion/Visuals, and Fashion/Style. Honorees this year were Fiona Cauke, Laura Owens, Susan Dorsky, and Sonya Krohn. The biennial will also feature a retrospective of Vincent van Gogh. \n\n\nFollowing the deadly shooting at a Connecticut elementary school on December 14, where a gunman killed 26 students and six adults before he was taken into custody hours later, the New York City Department of Cultural Affairs (DCLA) announced its intention to scrap a series of public artworks slated to go up in the city next month", "The next Biennial should be held in both Athens and Kiasma, to coincide with the arrival of the Goddess of Birth and Life, the Greek goddess Demeter. The theme of the exhibition is the Greek myth of Demeter and the Trojan War. The exhibition will follow the themes of the art world and the city of Athens: the Trojan War and the Trojan Festival, the Greek myths and the Trojan War, and the Greek cities. The exhibition will be organized by the Greek state and will be hosted at the State Museum of Ancient History in Kassel and the artist’s studio in Athens.The exhibition will take the form of a series of connected glass sculptures. The series will feature images of plants, animals, and people from the ancient Greek and Roman worlds. The works will be based on the Greek myth of the Trojan War, which was set in the city of Marathon. The exhibition will also introduce new concepts such as the Trojan Horse, the Trojan War, and the Trojan Festival.“The work of Amitav Ilić, the artist behind the series ‘The Trojan War’ and ‘The Trojan Festival,’ was created in collaboration with the Haus der Kunst, the German Institute for Contemporary Art and the University of He", "The next Biennial should be a celebration of the strength and resilience of the arts in Calgary and the City of Calgary, as well as the role of the arts in assisting the many communities that make up Calgary. I look forward to working with you to try to make this year a success.\n\n\nThe Los Angeles County Museum of Art (LACMA) has been hit hard by a devastating fire that broke out in a third-floor storage area in its Fitzwilliams building on Wednesday, February 3. The epicenter of the fire was a third-floor storage area that housed large works by workhorses such as Dolly Parton, Jean-Michel Basquiat, and Pierre-Auguste Renoir.While firefighters battled the blaze, which broke out in the third-floor storage area of LACMA on February 5, they found no evidence of gas appliances or furnaces; the building had only recently been renovated.Los Angeles County Sheriff Joe Los Angeles, who was briefed on the investigation Wednesday, said: “We are working closely with the authorities to determine the exact cause of this fire and the exact location of the fire. The building was recently renovated and we are working as quickly as possible to determine whether any structural damage was caused by", "The next Biennial should begin on September 8, 2020, and conclude on October 9, 2020. The 2019 edition, “The Autobiography of Frank O.H.K.” was staged at the museum in collaboration with the artist’s daughter, Hui-Chin Ho, who created the piece. The exhibition was curated by Joshua Rorke, the director of the Hong Kong Biennial and a curator of Chinese art at the Museum of Modern Art in London. For the first time, the museum used a full-length mirror, a modern innovation that only came into use in the ’80s, to show the artist’s work. The future of the exhibition is currently in jeopardy after Hong Kong cancelled its 2020 edition, which was to be held in February.The exhibition will also be relocated to a new venue in the city’s government complex, which is slated to open in 2021, and will be moved from June to November 2020. Its next leg will also be held in November, with the first installation, “Frank O’Hara: The Autobiography” in February 2021. \n\n\nThe National Museum of Fine Arts (NMFA) in New York has appointed", "The next Biennial should focus on the structural and the transitory conditions that shape and interact through time. The exhibition should be organized around the themes of dreams, dreams of a technocratic utopia, and visions of the future. The theme of the exhibition will be “In Time, Out of Time.”The 2020 iteration of the biennial will take place at the contemporary art museum Guggenheim with the help of archivists Walter De Maria and Pilar Corrias in Los Angeles, the Los Angeles County Museum of Art, and the Los Angeles Public Library. The museum will host the event on November 28–29.\n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has received a significant donation of more than 1,500 works by contemporary artists, including Cindy Sherman (1981), John Graham (1994), and Christine Wang (2010), which will be given to the institution as part of a new gift of works by the National Endowment for the Arts (NEA).“The new gift by the National Endowment for the Arts will enable us to create new opportunities to support the full range of American artists,” said NEA director, Annie D. Stevens. “We are particularly grateful to the", "The next Biennial should be held in May 2020; the next edition will be held in September 2020.  The opening of the biennial will coincide with the opening of the Hong Kong Art Museum (HAM), which will also be closed for a period of three years. The opening of the Hong Kong Art Museum will coincide with the opening of the Hong Kong Museum of Art (HKMO), which will also be open for a limited time. The New Museum on Manhattan’s third floor will also be reënacted as an extension of the museum’s education center, which will be opened in two phases. The new structure will provide a more immersive experience of Hong Kong’s art and culture. The Hong Kong Art Museum has also released several photos from the exhibition “Hong Kong Art Museum.” The photos were taken by Hong Kong-based collector and researcher Alex Tan and are part of a project entitled “Hong Kong: The Future Is Present.”The installation will work with the Hong Kong Art Museum’s existing collection of forty artworks, which was acquired in 1997 and is currently on display in the museum’s Centro de Artes Artes in Santo D", "The next Biennial should take place in the autumn of 2020.”\n\n\nThe National Portrait Gallery in London has become the latest institution to shutter its doors as a result of the coronavirus pandemic. It announced that it will begin welcoming visitors back on March 12 and will remain closed until at least mid-May. The decision to close the gallery came after the coronavirus outbreak began in Wuhan, China, and Hong Kong, and the surrounding area, and prompted the gallery to invest heavily in the health of its staff and contractors. The National Maritime Museum in Portsmouth, England, is also preparing to reopen in mid-May. It is currently closed because of Covid-19. The Royal Shakespeare Company (RSC) in London had already decided to postpone its May 25 revival, which was originally scheduled for May 8–May 10, due to concerns over the coronavirus, but has since made the announcement that it will now open as planned. The RSC’s new June 13 opening date coincides with the opening of the new Royal Festival Hall, which will be inaugurated by a new play by the same title by the Royal Shakespeare Company on May 27. \n\n\nNew York’s Metropolitan Museum of Art", "The next Biennial should take place in 2021, and the twenty-third biennial in 2021. The current Exhibition Listing for the twenty-fifth Biennial is currently online, and the seventy-third and seventy-ninth editions of the biennial will be staged in 2020 and 2021 respectively.The exhibition will be hosted by the MTA and curated by Ann DiStefano. The twenty-sixth edition of the exhibition will be held in 2021. The twenty-seventh Venice Biennale will be held in 2024.The redesigned Grand Strand Theater will host the fifteenth edition of the Art of the Party, which will be held in 2019 and 2019. The event will run concurrently with the upcoming New York Art Biennial. The event will be inaugurated by a presentation of a selection of works by shortlisted artists, including Rayyane Goud (2019), Rodolfo Lemos (2018), and Marta Markova (2017). The theme for this edition will be “The Art of Democracy.”The opening of the new museum will take place on December 6 and will feature works by thirty-one artists, including Ai Weiwei, Pierre-Auguste Renoir, Jean-Luc Moulène, and Bruno Pe", "The next Biennial should focus on the history of the exhibition in a direct and concise manner, which will consider the development of the exhibition from its inception to the present day, and will also reflect the forthcoming exhibition, which will arrive in the autumn of 2020. The themes of the 2020 Biennial are “Independence Day,” “The Other;” and “Nirvana,” and the first event of the 2020 edition will be “NIRVANA: LIFE AFTER LIFE”, a project that draws from the collection of N. Iwona Rubell, a contemporary feminist artist who writes about the power of the body to reshape social perceptions.Rubell’s work has been staged at the Museum of Contemporary Art (MoCA), San Francisco, the Museum of Modern Art, Los Angeles, the Queens Museum, New York, and the Metropolitan Museum of Art.The program will be hosted by the West Coast branch of the Biennial; by the New York branch; and by the East Coast branch. The first event of the year will take place at the San Francisco Museum of Modern Art in March 2020.The 2020 Biennial will be held at the Museum of Contemporary Art, San Francisco from March 24 through April", "The next Biennial should be held in 2022.\n\n\nItalian artist Sabine Hornig, who won the Prix d'Art Contemporain (PACE) in Berlin in 2001, has been selected to represent Italy at the Venice Biennale in 2022. The eighty-two-year-old, who teaches at the Museum of Modern Art in Rome, was awarded the honor by Italian prime minister Dario Franceschini, who also selected Wolfgang Paalen/Lehmann Maupin, who lived in the same building as Hornig for two decades, as the 2020 pavilion chief.In honor of the two women, the PACE Foundation, which funds the Italian pavilion through its fund as well as the Italian government, is creating a new $30 million grant program in support of the Italian arts, which is organized as a kind of cross-country grant drive. The first half of the grant program will be delivered by Scattani and Grassi, the Italian partners of the architectural duo Bodega and Guarani, and will aim to stimulate artistic development and the creative economy, while the other half will be administered by the PACE Foundation. Performing arts will be recognized in the first half of the program, which will run from", "The next Biennial should be in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Sarah Scott as the new executive director of its Arts and Culture division. Scott comes to the museum from the Los Angeles County Museum of Art (LACMA), where she has served as director since 2016. Previously, she was the executive director of the Pacific Palisades Cultural Partnership, which coordinates programming between the Pacific Palisades and the Pasadena Art Museum.Scott comes to LACMA from Pasadena, where she has served in the executive director position for the last five years. During her tenure, she organized the first Southern California Art Biennial in 2020, the 2017 Southern California Art Summit, and the 2019 Southern California Art and Culture Summit. She also launched the LACMA/Pasadena Art Festival, launched the LACMA Art in the Park, and launched the Los Angeles Art Fund.“Sarah is a leader, a champion of the arts, and an organizer who has built an impressive track record of supporting artists and her colleagues,” said Mark L. Rosenfeld, president and CEO of LACMA and Pasadena. “We congratulate Sarah on her appointment and look forward to working with her to support the local", "The next Biennial should be held the third week of February and will invite younger artists to the city to showcase their work online. The exhibit will move from the current location of the Museum of Contemporary Art (MoCA) in Los Angeles to its new home in the Arts District, the first phase of the Toledo Biennial.“I am thrilled to serve as the patron for this year’s Toledo Biennial. I am honored to be collaborating with the Toledo community to create a meaningful experience for visitors to Toledo, to honor the Toledo region, and to present a work that will resonate with audiences and reflect the spirit of Toledo,” said Mary Perkins, chair of the board of trustees and a longtime board member.The theme for the biennial was “Planetary Resources,” with the exhibition marking the twenty-fifth anniversary of the exhibition. “In this new age of climate change, we must re-imagine our future together,” said Acta Hampton, president and CEO of the Toledo Art Museum. “We welcome you to Toledo, and hope that your visit will inspire and delight.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $500,", "The next Biennial should take place in the fall of 2020. The Panza Biennial and the Future of the City, which will be staged in 2021, have yet to be announced.\n\n\nThe National Museum of Fine Arts in Boston (NMFA) has appointed Catherine Murphy as its next director. Murphy comes to the institution from the Chase, where she oversees collections in the collections of the National Gallery of Art, the Boston Museum of Art, and the Metropolitan Museum of Art.“Catherine is a gifted leader and organizer, who has been instrumental in the transformation of the Chase into a leading cultural institution,” said David Desmond, the chair of the NMFA’s board of trustees. “In her new role, she will have the opportunity to shape the museum’s trajectory in the next five years and will have a significant role in growing its collection and making its mission more sustainable.”Following a two-year search, Murphy was chosen for the role by a board comprised of former NMFA board president and CEO Christopher Krueger. Croned out of the board, Murphy was sworn in on Friday, December 17. “The museum’s board of trustees and I were thrilled when we were able", "The next Biennial should take place in 2022. \n\n\nArt Biennials: \n\nNew Orleans’s Art Center and Museum\n\nDorothy and Walter de Raad, They Are Not Far Enough: The Art of Maricón’s Villas, New Orleans, Louisiana. Courtesy of the de Raad family.\n\n\nThe Estée Lauder Companies, the makers of LEHRER, a luxury beauty brand, and Alexander Gray Science, an aerospace company, have agreed to merge. Known for their philanthropy, the companies are committed to creating more than one million jobs through research, innovation, and entrepreneurship in New York, Miami, and Paris.“The merger will bring exciting opportunities to our talented teams and will deliver an immediate and significant boost to their business,” said Alexander Gray. “The merger is part of a global trend of mergers and acquisitions that are driving more optimism and innovation in the fields of science and technology and the public sector. We look forward to working with our international team to further Estée Lauder’s mission and supporting the company’s future.”The announcement follows two years of negotiations, during which time the companies decided to open their offices in the", "The next Biennial should be held on March 8–October 16, 2020. The first exhibition, “O that I know,” will be held at the Art Institute of Chicago on October 23–November 29, 2020. The second exhibition, “Oddities in Language,” will be held at the Museum of Modern Art in New York on November 28–December 2, 2020.The third exhibition, “Oddities in Motion,” will be hosted by the Institute of Contemporary Art in New York on January 11–January 17, 2021. Bernd and Ulrich Bühler, the sponsors of the Biennale, previously announced that the show would include “Up, Up, Up,” a performance that explores the concept of movement and is organized into three sections. The first part will focus on “Up,” which Bühler and Bernd Lehmann first conceived as a series of paintings in 1986. In the ’70s, the pair created their own series of paintings and sculptures that were presented in local, regional, and international exhibitions across the United States, Europe, and Asia. The ’70s exhibition “Up,” which was ", "The next Biennial should be announced soon and will be held in the summer of 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Caleb Fox as its next director. Fox is currently the inaugural director of the Museum of Fine Arts (MFA) in Boston and will take up the post in January 2020. In his new role, Fox will oversee the museum’s reimagined interior and will be responsible for connecting with the local community through the installation of new works and programs.“Caleb Fox’s expertise and dedication to this mission is exceptional and we are eager to welcome him to the MFA,” said Ken Willem de Kooning, director and CEO of the museum. “This is an exciting and challenging time to lead the MFA in the aftermath of the devastating fire that destroyed the museum’s former building and nearly caused the closure of the institution for thirteen months. We at the museum are working hard to make the MFA as welcoming and accessible as possible for our visitors as quickly as possible.”In his new role, Fox will continue to oversee the museum’s expanded collection (including the acquisition of more than twenty thousand works by twenty-four artists), as well", "The next Biennial should be held in 2021.  The new site will be located in a former chocolate factory on the outskirts of Seoul and will be inaugurated by the seventh edition of the Seoul Biennale, held in October 2019.\n\n\nBirgit Jooss, the German-born, Swiss-based curator, artist, and activist, has been appointed director of the Berlin-based program Frieze Berlin. Jooss will assume her post in July.“I’m very excited about this new chapter in my life as a curator and a Berlin-based artist,” said Jooss. “This is the area of art where my talent has always been strongest. I’m looking forward to working with the talented team at Frieze Berlin to further the work of my career in Berlin, and to developing new content for Frieze Berlin.”In 2017, she was awarded the Venice Prize for Design by president Jannis Kounellis. Her exhibition “Sister,” 2019, for which she created work in homage to the late artist Die Berit, was also selected for the 2020 Venice Biennale. Jooss has also held various other Berlin-based positions, including director of the Renzo Piano", "The next Biennial should then begin the second half of the year, with the exhibition marking the end of the second half of the year. “We believe that the new platform will play an especially important role in promoting and expressing the Biennale in our time,” said Kapur. The exhibition is currently on view at the Museum of Contemporary Art (MoCA) in New York through February 3.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to open a new branch, the Museum of Contemporary Art (MoCA) Autobiography, that will highlight the work of African American artists and will introduce an exhibition format that will explore the legacy of the iconography of Mulatto art and will be led by a curator of contemporary art, Jumael Shawani.In a department statement, MoCA said that Shawani will lead the Biennial and will serve as a curator for the inaugural exhibition, titled “Mulatto Art,” which will be curated by curator Ivy Barrows. Shawani will be based in Los Angeles and will organize the show in partnership with Richard Speight and the Black Arts Center in Detroit.The announcement comes amid a wave of anti-racist activism and protests across the US", "The next Biennial should be held at a location in the City of Helsinki, and should feature one hundred works by twenty-nine artists from eighteen countries and territories. The nation’s art galleries and museums will participate in the inaugural exhibition, which is slated to run from May to June 2021.\n\n\nThe Dangote Gallery in Bangkok has received a major gift of fourteen works from the collection of Australian contemporary artist Steve McQueen. The donation includes works by David H. Gick, Jean-Michel Basquiat, Nodalandali Perrot, and Biengco Kunwin. The works are currently on display in the Thai contemporary art fair Dangote Taipei, which kicks off on June 15. According to the Australian Broadcasting Corporation (ABC), the works were donated by Australian collector Peter Rimmer to the museum in February 2019. The donation was made in recognition of the museum’s exhibition “Steve McQueen: The New Art of War.” The show will open in the Visakhapatnam Art Museum in the spring of 2021. The Australian Art Museum in Sydney, where the works will be staged on July 12, has yet to announce an opening date for the", "The next Biennial should commence in February 2020 and will feature twenty-eight artists who have appeared in the exhibition “Within the Present: Art in the Age of Mechanical Reproduction” (2017–18), which is curated by Kohn, and a selection of works by artists such as Magnus Lagerfeldt, Abigail & Lowell, Julia Stiles, and Jean-Michel Basquiat.\n\n\nThe Museums Association (MA), an international group of British art museums, has released guidelines for how the institutions should respond to the coronavirus and the coronavirus-related deaths across the UK. The guidelines are divided into six key points: 1) Avoid large public gatherings and events, including cinemas, train stations, shopping centres, parks, sporting events, public transport, and public places. 2) Avoid large public gatherings and events. 3) Avoid large public gatherings and events near schools, colleges, or universities. 4) Avoid large public gatherings and events near schools, colleges, or universities. 5) Do not hold large public gatherings or events near schools, colleges, or universities. 6) Do not hold large public gatherings and events near schools, colleges, or universities", "The next Biennial should take place at the Schloss Maastricht in the Netherlands in the spring of 2020. The exhibition will involve an extensive restoration of the museum, including the renovation of its original walls and galleries and the introduction of new works by artists such as James Attenborough and Jacques Chirac. After the exhibition is over, the museum will relocate to a new location in the Schloss Maastricht district. This new platform will open in 2022.In a statement published by the museum, the eight founders of the Schloss Maastricht Foundation, including Dieter Obrist, Wilhelm Schmid, Hans von Tripp, and Hans von Holstein, said: “We are thrilled that this year’s biennial will be the 100th Anniversary of the foundation. The new exhibition will serve as a platform for our artists to highlight recent exhibitions in the museum and reflect on the foundation’s history as well as the work of the foundation’s artists. This move will be a milestone for the Schloss Maastricht Foundation. We hope that this exhibition will be an inspiration for the future.”\n\n\nThe Tate’s director, Maria Balsh", "The next Biennial should aim to resolve the question of whether the AÄM is a useful and necessary institution for the preservation and promotion of contemporary art in a post-crisis world.”\n\n\nThe Museum of Modern Art (MoMA) has appointed Laura Mulvey as its next director. Mulvey joins the institution from the Metropolitan Museum of Art, where she has served as interim director since July 2018. She succeeds Matthew Levy, who retired at the end of August after serving as the director of the AÄM from 2004 to 2018.“Laura is an outstanding leader and organizer with a proven track record of transforming institutions and communities across New York City,” said director Frances Walsh. “She brings a real perspective and talent for how to make great art and creates opportunities for us to think critically about the museum world and our role as stewards of the greater arts ecosystem.”Mulvey succeeds Andrew B. Knapp, who served as director of the AÄM from 2019 to 2021, a period during which the museum exhibited more than 1,500 exhibitions and hosted more than 1,500 events. During her tenure, she expanded the museum’s outreach to more communities in New York City and introduced new programming.", "The next Biennial should be held at the Kunsthal Charlottenborg from April to October 2021. An exhibition of the work of a select group of the ninety-nine artists selected by curator Barbara Streifel will then open in September 2022. The next event, entitled “Sittste In Gelben Kunst,” will be held at the Nørdby Museum, Copenhagen, in October 2021. The next conference, entitled “Kunstgewesen,” will take place at the Kunsthal nr. 58, Nørdby, Copenhagen, in March 2021. The next exhibition will be “No Food for Thought: Muri Teruṷa” at the University Museum of Contemporary Art, New York, on September 18. The next exhibition will be “Kunstakademie für das ich nicht es lassen selbst: Sprachaturung und Landeszeit,” which will open at the Kunstakademie für das ich nicht es lassen in September 2020.The next exhibition will be “Tacita and Janice: The Little Known History of the Art of", "The next Biennial should take place in 2020. The seven-day event will feature newly commissioned artworks by renowned artists such as Eugene O’Neill, Susan Charles, and Anne-Marie O’Neill, among others, and will be hosted at the Museum of Modern Art, New York. The institution will also organize a special exhibition of work by American painters such as Alan Royer, John Hay, and Rachel Whiteread.The seventh and final part of the inaugural exhibition is called “Elevators,” and will centre around the relationship between a group of men and women who ascend the structures of power in America and what it means to be a woman in today’s society. The exhibition will include works by curators Rashid Johnson-Dumont and Anwar Soueif, Elisabeth Ehlers, and Nancy Panetta, and will run from November 24 to December 7, 2020.The inaugural Biennial will include artists, writers, artists’ collective, architects, political activists, indigenous leaders, authors, and representatives of the Parisian assemblymen. It will also feature an art installation by the artist Bénédicte Savoy, a documentary by artist Ron Gorchov, and a presentation", "The next Biennial should be held in 2021. The works in the exhibition will be selected based on the themes of “Living Together in Distress,” “Malalaiya” and “Miracles,” and will be curated by the artist-in-residence, Laatje Schipper, with the help of curator Juliette Gurlitz, director of the Rosenfeld Gallery in Berlin.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Alison Lally as its new associate curator of twentieth-century art. Lally comes to the institution from the Metropolitan Museum of Art (MoMA), where she has worked as a curator since 2015. She succeeds Larkin Caspi, who retired after twenty-five years at the helm of the Museum of Fine Arts in New York after a seventeen-month tenure, and will assume her post in January 2021.“Alison Lally is an outstanding curator and scholar, a partner at the Met, and a friend to many of our colleagues,” said Marc Glimcher, the museum’s director. “During her tenure at MoMA, she helped establish the museum’s independent curatorial practice and promoted the", "The next Biennial should be held at BAM.  “The next Biennial is not what we want,” said BAM director Katherina Gross. “We are committed to creating a world where biennialism can flourish and thrive in a way that is inclusive and respectful of both the artists and the artistic community.”In an Instagram post, Biennial Director Robin Wright wrote: “The future of art and biennialism is at stake. We are committed to taking the next steps in our vision, to assessing the state of our climate, and to assessing the future of art and biennialism. We stand at a pivotal crossroads. We must act now and act soon.”\n\n\nThe UCL Architecture Biennial in London has issued an apology for an exhibition commemorating the centenary of the birth of British architect Bertrand Goldberg, who championed the visual arts, and will host two new special commissions, including a new exhibition about the 1960s British artist Tadao Ando.The exhibition’s director, Adeline Eskenazi, told the Art Newspaper that the decision to show a “decade-long project” in the United Kingdom was made after the organizers “remem", "The next Biennial should take place in the United States in June 2020. If the timeline holds, the first issue of the first biennial will be published in March 2021.\n\n\nThe Metropolitan Museum of Art in New York has appointed Elizabeth Talbot as its new chief curator of Asian art. Talbot will take up the post on January 11, 2020. Previously, she served as director of the Center for Oriental Art at the Museum of Modern Art and was the founding director of the Museum of Modern Art in Seoul.“We are very excited to welcome Elizabeth to the department,” said museum director Daniel H. Weiss. “Her rich experience, passion, and intelligence make her uniquely qualified to lead the museum through this challenging time.”Talbot’s appointment coincides with the reopening of the Metropolitan Museum of Art, which will welcome visitors on January 27, 2020. She succeeds Donna Huertas, who retired in March after a decade with the museum, and will take up her new post on January 11.\n\n\nThe Haus der Kunst in Vienna has appointed Markus Liebmann as its new artistic director. Liebmann comes to the museum from the Wellcome Collection, where he currently serves as director of exhibitions, and", "The next Biennial should be held at the new National Museum of Scotland, and should be inaugurated by presenting an exhibition devoted entirely to the sculpture and painting of the twentieth century. “The biennial should be a way for the UK to return to the future, ” said Peter Lane, director of the National Museum of Scotland. “We are proposing that a full exhibition of work by a single artist\u0097The Painted Ladies of Albright-Powell, John Negrete, and Cécile B. Evans, or perhaps an installation.”The new exhibition will feature two hundred works . . . that are not currently on view at the National Museum of Scotland, but which will be added to the National Gallery of Art in Washington, DC.\n\n\nThe new public space in the heart of London called the National Portrait Gallery will receive more than 1,800 works by ninety-six artists in the coming months. The organization said that the exhibition “is essential to the future of the National Gallery, and is about to undergo a transformational new chapter.” The dates for the show are September 12–15, 2020. The museum has been closed since April 29, opting to cancel all events and re-vis", "The next Biennial should be held in 2020, and will be inaugurated with a 2016 exhibition, “The Secret Life of Man,” curated by Nari Ward, an artist and curator whose work is currently displayed at the House of Sculpture in New York. The 2018 show, titled “Culture and Social Movement,” explored how art and culture has been intertwined with politics, economics, and society at large, and the exhibition was staged at the Museum of Modern Art, New York.\n\n\nThe Bodel Collection in New York is planning to send ten works by forty-six artists to the Museum of Modern Art in Miami Beach, Florida, in 2020. The works, which were selected based on their exhibition at the Bodel Foundation in the United States, are James Conchis, Paul Gauguin, Ada Lovelace, Valeria Balsola, Einar Alberga, Joan Hoffman,  John Graham, Thomas Henry Hudson, Holly Dodd, Jack Lemmon, and Claude Lanzmann.“The Bodel Foundation, which supports several important projects in the Museum of Modern Art, including our new master plan for the museum, and the exhibition", "The next Biennial should be held in the summer of 2021. The winner will be selected by a panel of artists, scholars, and activists from a pool of fifty artists and scholars drawn from amongst the participating artists and scholars. The Biennial will be held at the city’s newly renovated and restored Old City, which is currently home to the Museum of Art, the Solomon R. Guggenheim Museum, the Museum of Modern Art, and the Brooklyn Museum.\n\n\nIn the most notable development in the case of the Parisian Bataclan Theater, the French cultural minister, Franck Riester, announced on Thursday that a yearlong investigation has found the company responsible for the damage at the venue to be SAPHE. The news comes amid a crisis for the Bataclan, which is currently in the process of rebuilding its interior after it acknowledged the damage it caused during the concert­cade triumphing over the terrorist group the Islamic State in Iraq and Syria (ISIS).The investigation, which was launched following a request from the Bataclan’s artistic director, Régis Savigny, is the latest move in a series of steps that will see the new building, designed by the Parisian firm A.M. Pei", "The next Biennial should be held in 2020, the museum said. The 2019 edition, Gertrude Stein’s “In Praise of Everything,” drew 20,000 people to the museum.The museum selected the seventy-five-year-old Stein for the centennial year anniversary. The artist usually creates works that challenge the notion of progress, but are also historically accurate and culturally relevant. Stein’s biennial will be centered on the life and work of Dr. Martin Luther King Jr., whose legacy Stein hopes will inspire young artists to think of themselves as part of.“One of the things I’m most proud of is that we were able to present Dr. King in his own space, in a unique museum,” said Silver. Stein previously presented her work at the museum twice: The Imitation of Christ (2016) and “Summer of Our Lives,” (2019), which both received the 2019 plaudits from the Los Angeles Times.\n\n\nThe Museum of Contemporary Art (MoCA) in Chicago has appointed David Daniel as its next director. He succeeds Adam Weinberg, who has helmed the institution since 2013, and will assume his responsibilities on March 3.“", "The next Biennial should be held in the autumn of 2019. The winner of the 2019 prize will be selected by a jury comprising Aldo Rossi, director of the museum, and Aruna Dangani, director of the Central Library of Art, Mumbai, and art historian Pavan Dutta from a shortlist of artists. The Atlantic Philanthropy Award for Excellence in Arts will be awarded in the autumn of 2021. Art historian and curator Gary Garrels will serve as the prize’s inaugural recipient. Garrels recently presented the 2019 prize to Muna Cooray, whose work examines the power and the capacity of art to affect and shape our lives, and Maria Bochereau, whose work combines landscape and urbanism, femininity and masculinity, and the rediscovery of indigenous knowledge. Garrels said: “I’ve been involved in art for as long as I can remember, but I’ve never had the opportunity to work in such a deep way with a global audience. The recognitions and the awards and the platform that I’ve been given by these key partners are extraordinary. I’m incredibly grateful to them all and I’", "The next Biennial should address the history of the museum, which was established in 1974 and revitalized in 2017 with the opening of the new museum. The institution has drawn some of the country’s most prominent artists, including Paul Gauguin, Henri Matisse, Édouard Vuillard, and Pierre-Marc Jeunet, from surrounding areas in the city. The event will be held at the  Mana Contemporary, the same venue where the annual exhibition “The Year of the Rat” (2017–18) was held. The Museum of Modern Art in Chicago has been working to insulate its spaces from the virus since March. The institution is currently taking pre-approval for a $250,000 grant, which will be matched by the John and Marian Anderson Foundation, and is expected to receive the funds by June 12. According to the Chicago Tribune, the grant will also allow the institution to “do what we can to help protect the health and well-being of visitors to the museum and the community.”Last week, the grant recipient announced that it will donate $250,000 to the Cincinnati Art Museum, which has been working to ensure that it has the resources to avoid a", "The next Biennial should be held in 2020.The Los Angeles County Museum of Art (LACMA) has appointed Catherine Dodd as interim director and CEO of the institution. Dodd will take the helm of the institution from Rosalind Russell, who will retire in November.“Catherine has demonstrated exceptional leadership and vision in leading LACMA to new heights, as we have seen firsthand her ability to develop new programming to advance and connect with our community,” said Craig Anderson, CEO of the LACMA Foundation. “Catherine is an ideal leader, who will continue to shape the Museum’s trajectory in service of our community and the greater Valley.”In addition to her duties at LACMA, Dodd serves as the founder and CEO of Bridge10, a technology company that provides direct financial support to arts organizations. Bridge10 currently supports more than 3,600 arts organizations across the United States, and was involved in the acquisition of works by artists such as Margo Scott-Hanley and Jodi Throckmorton. Previously, Dodd was a cofounder of the Los Angeles–based nonprofit MAMCO, which provides financial and human resources support to local arts and cultural organizations.Commenting on her new role, Dodd said", "The next Biennial should explore themes of femininity, the body, and the body parts; the body, the body parts, and the body—as well as culture and the body. The theme of the upcoming exhibition will be “Body Art,” an exhibition originally organized by the Baker Street Museum of Art in London and curated by Sarah Flore, which will be on view November 29, 2020.\n\n\nThe Chicago-based artist, who was known in the art world as The Body Shop, has died at age seventy-nine.Born in Chicago in 1947, the artist was raised in Marinette, Illinois, and then in the small town of North Adams, New York, before moving to New York City in the early 1960s. He returned to his hometown in 1976, but decided to leave the rest of his life there when he met and married Beatrice Trockel, a German-born Polish American mother of three who introduced him to the world of art.From the early stages of their relationship, The Body Shop was depicted in his paintings and sculptures. His most famous work, the Museum of Modern Art (MoMA) retrospective “The Body Shop” (1975), a tribute to the artist that featured a selection of his", "The next Biennial should be held in 2021. Might be the last\n\nIn the run up to the 100th anniversary of the publication of the American painter John McAllister’s   The Watercolor Scene, the Museum of Fine Arts (MFA) in Boston has introduced new programs, including a new exhibition of art and photography from the artist’s 1969–74 period, “On New York,” and the museum’s first online exhibition of work by McAllister’s son and grandson.The exhibition, “On the Intersection of Photography and Painting,” will open on March 8, 2020 and run through May 27, 2020. As part of the new partnership between the museum and MoFA, the McAllisters will hold an exhibition of works by McAllister at the museum in 2021, and the museum will offer a digital version of the exhibition, shown only in the United States, in 2020.\n\n\n\n\n\n\nJohn McAllister: Watercolor Scene, 2019. Courtesy of the artist and MoFA.\n\n\n\n\n\nJohn McAllister: Watercolor Scene, 2019. Courtesy of the artist and MoFA. \n    ", "The next Biennial should have a theme of 'Art and Transformation'\u0097a word that has many meanings in the arts. The theme should be one that we can all relate to.” \n\n\n\n\n\nDusan Tadic, a Serbian photographer and multimedia artist who became known in the 1990s for his capturing of abandoned industrial sites and outdoor scenes in his series “Real Life in Sculpture,” was found dead of a heart attack on Saturday in Sarajevo.Born in Belgrade in 1964, Tadic first studied at the famed sculptor Salo Mihailovici's studio in the 1980s, where he began working on his first public work, a large-scale installation, “Cherubina,” at the Milan Biennale in 1998, and in the Studio Museum in New York in 2006. In 2014, a retrospective of his work at the Museum of Modern Art in Brussels was staged alongside “Fatima” and “Tadja al mourad,” the other works in the series. In 2016, the artist was awarded a Padova Grand Prize.The death of the twenty-seven-year-old Tadic, who was a student of"]