["The next Biennial should be held sometime between April and October 2021, according to the Art Newspaper.  “For many, the choice of an autumn theme impacts the very essence of the Arts,” said Frances Savoy, director of the Biennial de Lyon. “It is a theme that moves us to think deeply about the ways that art is made, and the ways that it will continue to be made, as we enact new and creative ways of living together.”Savoy stressed that the event will not be a “recital of contemporary art” but rather a “realistic, low-tech, and high-tech version of a Biennial,” a kind of “virtual museum,” in which fans will be able to “participate” in the exhibition.  The twenty-fifth iteration of the International Biennial, held in Santiago, Chile, was canceled in March 2019 after twenty-six years. The Biennial de la Reina Sofía, held in Lisbon in February 2021, was also canceled. The Spanish government also postponed the 2020 edition of the Art Basel jamboree and already held an emergency meeting of the country’s national assembly last month to", "The next Biennial should be held at least once every other year.\n\n\nThe National Gallery of Canada announced today that it is reopening after a two-year hiatus following a major expansion and renovation project that is expected to cost more than $200 million. The project, which is also being undertaken by the National Museum of Women in the Arts (NMA), and the Royal Ontario Museum (ROM), will add more than 1,000 gallery, lecture, workshop, museum, and public spaces across the institution.“The first phase of the National Gallery’s reopening, which began in the spring of 2021, involved the reconfiguration of the contemporary, traveling exhibition experience to better reflect the museum’s mission and contemporary cultural trends,” said Amanda Segal, the museum’s director and cochair of the new National Gallery of Canada. “This phase will end with phase two, which will include the construction of a new building, the National Gallery of Canada, to be named after the National Gallery of Canada.”The new building will serve as a hub for the collection, presentation, and research of National Gallery exhibitions in Ottawa, the National Gallery of Contemporary Art in Winnipeg, and the National Gallery of Art in London.", "The next Biennial should have been held during the last semester of my senior year, but I was unable to present my thesis until the following year. The Biennial was not only an opportunity for me to make a documentary about the Seoul Biennale, but also an opportunity for others to understand and be inspired by the events and its production.”\n\n\nThe City of New York has unveiled a plan to get $4.5 billion worth of repairs and renovations done to its aging infrastructure and reopened spaces in the city, including the Central Park Conservancy and the Brooklyn Museum, by 2021. The $1.2 trillion plan is aimed at addressing structural challenges facing the entire region, including the city’s boroughs of Bushwick, Flatbush, and the Bronx, which have been historically hard-hit by the recession.Although the City Council approved the plan in January, the specifics of how the funds will be spent are still being worked out. According to the New York Times, the $4.5 billion is divided up into $1 billion for infrastructure and $300 million for local government. While the bulk of the $300 million will be allocated to the Central Park Conservancy, the remaining $500 million will be used to rebuild or preserve parts of", "The next Biennial should take place in September 2021. The festival will have the theme “We Want It All,” focusing on the questions of “identity,” “art and politics,” and “art and the future.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to move forward with an expansion of its public art collection that would add new works by artists such as Susanne Vielmetter, Jane Sheen, Kathy Halbreich, and Don Suggs. The $60 million reconstruction of the institution—which will include a new gallery, a new public courtyard, and a new plaza—is being spearheaded by Peter Zumthor, the director of the Yale Center for Art History, who was recently hired as director of the Los Angeles County Museum of Art (LACMA).The architects, who came up with the original idea for the project while working on a grant for the museum, said the new space will serve as a counterpoint to the existing Central Library, which is currently being renovated. Curated by Pia Camil of architects Pritzker Architecture, the new space will include a large open area designed with a courtyard and public terrace, which", "The next Biennial should be selected within the next two years and will be led by a senior director, who will be chosen by a group of fellows from a pool of over fifty artists nominated by the winners of the inaugural biennial. The biennial will be hosted at the San Francisco Museum of Modern Art (SFMoMA), a museum founded by and for artists.The inaugural Biennial was founded by two San Francisco–based artists, Austin Stewart and Lisa Lippard, and was co-organized by artists Béla Barlow and Yoko Ono, and was presented by the San Francisco Museum of Art and the San Francisco Art Institute. The biennial will run for twelve months.For the artists who won the prestigious $10,000 prize this year, the competition was a validation of their work and a way for each of them to gain visibility in the field. Barlow and Lippard created their exhibition “Chronology” (2018), which was commissioned by the museum and premiered at the museum in a “chronicling of the life and work of a single artist.” The show will feature work from thirty-six artists who were nominated by the artists who received the prizes this year and will be on view until December", "The next Biennial should be held in London in 2022.  While the event has been suspended due to the coronavirus, the theme this year is Color Theory: from Painting to Color Theory. The 2019 edition featured work by Ayn Rand and Gertrude Stein. \n\n\n\"In anticipation of the upcoming editions of the Museum Kunstbau and Kunstverein in Hamburg and the Museum Basel in Basel, we have taken the decision to postpone the latter two shows by a year, to be held in 2021 and 2022, respectively. The changes will allow us to bring the museum back to life and, in support of the important work of young artists and young curators, engage with the highest artistic aspirations of Germany.” “We have already received a lot of support from our guests and the Kunsthalle Basel in Germany, as well as from the Kunsthalle Hamburg, the Museum of Contemporary Art in Stuttgart, and the Kunsthalle Basel. We are confident that the changes we have made for the better will prove successful and continue to be an inspiration for young artists and curators in the coming years.”The museum opened in 1963 by founders Dietrich Schmidt and Ludwig Ne", "The next Biennial should take place in the United States from 2021 to 2023.    The 2018 edition, titled “Beyond the Frame” was held at the University of California, Los Angeles, and featured artists such as Alex Katz, Joachim Teller, and Markus Malsboff, among others. Curated by Mandy Patinkin, who was hired by museum director Holger Kafor, this iteration of “Beyond the Frame” involved an exploration of the relationship between the work of artists and the work of the museum. Among the works on display were The Human Run, 1993, an assemblage work by Swedish artist Per-Lille Oskarsson, and The Tree of Life, 1998, a sculptural work inspired by the Tree of Life in Mecca.Additionally, an annotated edition of the most recent exhibition, “The Objects in the Body of Christ” will be staged at the institute in 2022. “This is the first time the exhibition will be recorded in a format that can be used by scholars and will offer a new opportunity to study the lives of artists,” said Oskarsson. The exhibition will also feature works by a selection of the bi", "The next Biennial should be organized in April 2020; the last one in November 2020. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Bernardo Pérez as its next director. He will take the helm from Ruth Estévez, who will remain involved with the institution as a consultant for the 2020 iteration of the large-scale contemporary art fair, which kicks off in March, and will assume his responsibilities in January 2021.“Bernardo Pérez’s tenure at MoCA has been one of the most successful in the history of the fair,” said Sarah Paulson, chair of the board of trustees. “In joining us, he has demonstrated his ability to create compelling and inspiring works that are informed by a deep understanding of the history of modern art and the contemporary art world.”Pérez, who has helmed the museum since 2017, will continue to serve as a consultant to MoCA as part of its efforts to further strengthen its programming and increase the museum’s international reach. “I’m deeply honored to have been selected as the museum’s next director,” Pérez said. “This is a truly challenging period for", "The next Biennial should be held in December 2020. “The innovation that we are seeing in the exhibitions is incredible and we are really excited to see what the future will bring,” said Peter Lloyd, president of the Biennial.\n\n\nArt Basel, the world’s largest international art fairs manufacturer and the largest distributor of art in China, is launching a new digital platform that will allow visitors to its Miami Beach, Florida, location to digitally experience seventy galleries that are currently on display at the fair. The platform, called Art Basel Miami Beach, will be free to the public from January 21 through January 23, 2020, and will feature the works of ninety-five artists, including Luis Berrio, Thomas Bastien, Robert Irwin, Jane Jacobs, and Vanessa de Courcy.“The Art Basel Miami Beach team is thrilled to exhibit these extraordinary and ambitious new works by artists in our show,” said Robert L. Carroll, the fair’s executive director. “Over the last twelve years, the art fair team has developed and refined our platform, which has been adopted by nearly two hundred thousand visitors to our Miami Beach location. We are beyond excited for the impact that this new initiative will have on", "The next Biennial should be held at least twice a year, as soon as possible. \u0097The next Biennial will be held at least twice a year, as soon as possible.The next Biennial will be held at least twice a year. \n\n\nThe Museum of Fine Arts (Miami) has welcomed Nicole Taylor, the former executive director of the Museum of Contemporary Art (MoCA), Miami Beach, to its board of trustees. Taylor has been appointed to the position by board chairman Steve Ruff, who is also vice chairman of the Miami Beach City Council, after the advocacy organization P.A.I.N. (Prescription Addiction Intervention Now) filed a grievance regarding the board’s handling of a controversy over the controversial removal of a sculpture by artist Stanley Donwood from a museum’s grounds in October 2017.“In a time when the Art Basel exhibition and the Art Newspaper have become synonymous with the contemporary, where art is viewed as a treatment for everything that is wrong with the world, and art is viewed as the cure for everything that is wrong with the world, it is essential that MFA Miami Beach remain grounded in the art world, and art in the world,” Ruff said in a statement.", "The next Biennial should take place in 2020, according to Artforum. The 2017 edition, curated by Marian Bruguera, will mark the occasion.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Rebecca Corr, who has served at the institution for twelve years, as its next director and chief curator. Corr succeeds Susan Cain, who departed after eleven years to head the Shih-Chien, China, Museum, and is scheduled to take up the post in January 2021.“We are thrilled to welcome Rebecca’s expertise and enthusiasm to our team, and are confident she will continue our work with an innovative and compelling vision for the future,” said John Donvan, director of the museum. “In addition to her curating skills and her invaluable experience in modern art, she has the potential to bring our extraordinary collection of art, objects, and collections to life through her vision and the passion for exhibitions and exhibitions.”Cain, who recently stepped down from the helm of MoMA to pursue new creative and curatorial projects, will assume her post in January 2021. According to the New York Times, the current biennial, “Unpacking,” is the first", "The next Biennial should be held in 2021, the year of the incarnation of Jesus Christ in the city of God. There will be a dedicated exhibition dedicated to the twentieth century, with the aim of rethinking the contemporary issue of art history and its relationship to theology.The panelists for the second round of the free event are Maria Bochereau, curator of contemporary art in the twentieth century at the Museu de Arte de São Paulo; and Ana Paula Cuiaro, director of the National Museum of Art in Rome. The third round of the event will take place in 2020.The theme of the iteration of Christ is “Theology and Mission” and it’s been divided into two parts: the first being themes of history and the second being themes of the incarnation. The revival of interest in the twentieth century has led to the creation of a new exhibition dedicated to the twentieth century, “The Future of Art,” which will open at Praia da Luz in October 2020.Commenting on the initiative, Alejandra Pape, director of the Museu de Arte de São Paulo, said: “The future of art is not so much focused on the past, but on how to use", "The next Biennial should be held in the autumn of 2020. The 2019 event, which was organized by the German state of Hesse, featured works by fifty artists from twenty-two countries and twenty-seven cities. The biennial was a joint collaboration between the state and the federal governments of Hesse, Berlin, and Freiburg. The biennial will also include the first exhibition of work by local talented artists in the country. The exhibition will be unveiled at a special exhibition at the museum in Berlin on October 30. \n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it has received a gift of more than 1,000 works by eighty-two artists from the Collection of John F. Kennedy, Jr., one of America’s foremost collectors. The gift includes works by forty-two artists from fifty-three countries and thirteen cities and includes the works in the form of a letterpress, drawing, photography, and sculpture.“The collection is an extraordinary collection of world class artists, with truly amazing stories to tell, and many of the works in the collection have never been on view in public view,” said William Kennedy, the MFA’s curator of modern and contemporary art,", "The next Biennial should be held in 2020 and will be held in the university’s basement, near the Kluge under the university’s new, $138 million Meininger Hall. The new space is expected to be completed by 2021.In the announcement, the university noted that the new building, which will feature thirty-five studios and will be situated in the Kluge, “is a decisive step in the transition to a new architecture for the Kunsthalle Basel.” The institution also noted that the renovation of the Kluge’s ceiling will involve the removal of thousands of limestone pillars, which were installed in the late 1800s. While the chapel will be reopened, the Kluge’s garden will be transformed into a museum and the three-dimensional model of the Kluge will be moved to a different building. \n\n\nThe Metropolitan Museum of Art (MoMA) in New York has named Tanya and Osman Abidi curators of the upcoming exhibition “The B-Side: Eighties Art,” which will run from January 22 to March 26. The exhibition will feature artwork by seventy artists, including Paul Gauguin, Robert Irwin, Paul Thomas Anderson, James Turrell,", "The next Biennial should focus on the central role of art in social change. The Science and Technology (S&T) pavilion’s theme “Art and the Dark Side: The Art of Death” will explore the psychological and philosophical underpinnings of the human condition through the work of the twentieth-century’s most eminent artists, including Ernst Lubitsch, Joachim Neugroschel, and Joachim Nordährlich, and will include work by thirty-two artists.The exhibition, which will run for twelve weeks, will draw from the biennial’s collection of work featuring works by artists such as René Magritte, Pierre-Auguste Renoir, and Catherine Muholi, among others. The biennial’s curators include Yvonne Sancho, Yinka Shonibare, and Douglas Wheeler.The inaugural event will be held in January 2020 at the Museum Freie Kunsthalle Berlin. The biennial will also present an exhibition of work by the Los Angeles–based artist Alexander Calder.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Shawn Mabry as its new senior curator of contemporary art. Mabry comes", "The next Biennial should be held in the year 2020. The exhibition will include works by twenty-five artists, including:\n\n1. Mike Kelley (New York)\n\n2. Hao Han (New York)\n\n3. Bénédicte Godin (New York)\n\n4. Édouard Vuillard (New York)\n\n5. Yoko Ono (New York)\n\n6. Robert Irwin (New York)\n\n7. Gernot Heinrich (New York)\n\n8. Greg Larson (New York)\n\n9. Laura Harrier (New York)\n\n10. Catherine Massey (New York) \n\n11. Ulla and Octavius (New York)\n\n12. Wangechi Mutu (New York) \n\n13. Andrew Wiles (New York) \n\n14. Nicole Ostrander (New York) \n\n15. Oliver Stone (New York)\n\n16. John Paul Sebastian (New York)\n\n\nThe New York City Department of Cultural Affairs has announced that it plans to remove the final ten works of Jacob Riis", "The next Biennial should take place in the summer of 2022, and the second in the spring of 2024. The 2020 edition, titled Bifurcation: The Future Is Now, was only six months old when the latest round of United Kingdom aid was announced on Monday. The program—which was set up to address the health crisis caused by the coronavirus—was criticized by some in the art world for being too immediate and for not providing enough support for the arts. “We are acutely aware of the current challenges facing the UK in the immediate aftermath of the coronavirus outbreak, and that the next edition of the Biennial will be an attempt to address those challenges,” said Alex Abrams, chair of the board of trustees. “However, given the current situation, given the uncertainty and uncertainty that the coronavirus causes and given the current tight funding situation, we have decided that it is not in the public interest for the Biennial to move forward this autumn. Therefore, the 2020 Biennial will be moved to the summer of 2022.”While the exact dates and venues have yet to be announced, the 2019 edition of the Biennial, titled The Future is Now’s 52nd", "The next Biennial should focus on a discussion of the intersection of art and politics in our current global circumstances, and how this intersects with biennial history. We believe that this year must explore the transformative power of art and politics in reimagining the biennial as a battleground for social justice.\n\n\nThe Museum of Fine Arts (MA) in Boston has appointed Kate Naglehart as its new executive director. The sixty-six-year-old American art historian and curator will be responsible for providing direction and articulating new and challenging ideas for the museum’s talented and dedicated staff.“Kate has years of experience bringing visionary artists and thinkers into the MA and is passionate about fostering a culture of intellectual inquiry, creating collaborative environments where artists can create new works, develop projects and build their own histories, and experiment with new media, technology, and materials,” said Mark Dudek, director of the museum. “We are excited to welcome her to MA, and to be able to invest in her future as a tireless advocate for artists and the art they create.”Kathryn Cahill, who has served as artistic director of the museum since 2011, has been promoted to senior director. She succeeds Beverly Chiu, who", "The next Biennial should take place in 2020 and will only be a part of the museum’s permanent collection, but will be a transformative exploration of the relationship between art and Brazilian history. The program will consist of a series of talks, performances, and installations that will address themes such as values, history and memory, the history of art and the history of contemporary art, and the history of contemporary development.”\n\n\nThe presidential palace in Brasília, Brazil, has released the names of the seventy-six artists who were given the Rio de Janeiro Design Biennial 2017. The thirty-seven shortlisted artists are Alfonso Alves, Ana Paula Alves, Alex Gjorge, Alexina Gomes, Mama Teresa, Nara Rocha, Cristina Noveira, Mariana Vergara, Marcela Muñoz, Índia Pindell, Luiz Pimentel, Nadiya Prajapati, Ruba Saia, and Lydia Tezina.The candidates for the exhibition were chosen from an ensemble comprised of designers from Brazil, the United States, and other countries and regions around the world. The exhibition was curated by Barbatend, whose director, Leonardo Barba", "The next Biennial should take place in Helsinki in the spring of 2021. \n\n\nThe Central Museum of Art in Prague announced today that it will activate the Biennial’s newly created public space, the Sofi’skova Open-Sky Garden, in the Czech Republic. The venue will host the exhibition “Theoretical Uranium-238: A Time of Transformation” in March 2020 and “Introduction to Quantum Gravity” in June 2020.The installation, which is part of a new series of drawings by the Swiss artist Marc Huyghe, will feature some of the best-known works by the Austrian-born Hjořgorzata Bech in a show that will take place in the courtyard of the Central Museum of Art (CMO) in Prague. It will also present a new and experimental work by the Czech artist Albert Bode that will be staged in stages. The show will run concurrently with a new exhibition of work by the Austrian artist Ola Bode at the museum during the same season.CMO director Martin Krzysztoj said: “We are thrilled by the prospect of presenting Marc’s work and the inaugural ‘Theoretical Uranium-238", "The next Biennial should be held in early 2020. The next Art Basel in Hong Kong will be held in early 2021. The Biennial of Italian Art will be held in late 2021. The 2020 edition of the Museum Art Berlin will be held in early 2022. The 30th Venice Biennale will be held in early 2022.  Artist Marta Wechsler will also be present once more at the Museum of Modern Art, in New York, in 2022. The biennial’s organizers have yet to set a date for its 2020 iteration; however, a new Art Basel exhibition, “Advancements,” will open on October 7. The Museum of Modern Art in New York will host the first edition of the Network Design Prize, which is currently on view through February 23, 2020, at its Whitney Museum of American Art, next month. The Museum of Contemporary Art, Los Angeles, will stage the first exhibition at the Seattle Art Museum, which is currently closed due to Covid-19, in June 2020. The Museum of Modern Art in New York will unveil the first edition of the Whitney Museum of American Art’s “Memoirs: Art and the Art Habit", "The next Biennial should be held in 2022. The next edition of the Art in a Nutshell event will take place in 2021. The Biennial will premiere a new anthology, Art to Live: In a Nutshell, on October 2, 2020. The 2019 edition of the Art in a Nutshell event was held at West Egg in London. The event, which is supported by Tate and Helen Frankenthaler, screened fifty artworks by eight artists, including James Turrell, Michael Haneke, and James Williams. The 2019 event, titled Art in a Nutshell: Taking a Stand, was organized by MIDWESTAKTER, the Museum of Contemporary Art, London, and St. Martin’s College. The 2019 event, titled Art in a Nutshell: Avant-Garde, was organized by the Tate and the Avant-Garde Foundation.\n\n\nThe National Galleries of Scotland have announced that the institution will receive £10 million from the sale of works by the late British artist and public figure Betty Smith, whose practice spans sculpture, performance, painting, filmmaking, and sculpture. The total value of the donation includes £8.5 million", "The next Biennial should focus on the new and evolving role of the museum, including the exhibition of new works by artists such as Jean-Luc Godard, Michelangelo, and Joan Miró. The 2019 entry is Lévy Gorvy, which is currently on view in the French pavilion at the Venice Biennale, and will include works by contemporary artists such as Julia Ortega, Alex Katz, Hélio Oiticica, and Nicole Stöckl. The 2020 Biennial will open in January 2020.\n\n\nThe Museum of Contemporary Art Miami (MCA) has received a gift of seventy-seven works from the Miami-based artist Rebecca Neumann. The works, mostly in the form of prints, watercolors, and photographs, are part of a series that was included in the museum’s entry in the Fifty-First Venice Biennale. The work that will be featured in the 2019 edition, “Refusal,” is a monochromatic, geometric abstract painting that combines black, white, and gray in an attempt to incorporate both the interior and exterior worlds in order to create a new work.The artist also created several works for the museum’s inaugural exhibition at the museum�", "The next Biennial should be held in 2021, and the festival will be held at the National Museum of Denmark from May 21 to May 23, 2021. The event will also be hosted at the Danish National Theater from May 21 to May 29, 2020, and the Copenhagen Art Museum from May 21 to May 28, 2020, and at the Copenhagen Art Museum until March 20, 2020.The new hotel will be designed by the Danish studio Nunberg and will be located at the National Museum of Denmark, and will host artists, artists' studios, galleries, and other events in a newly renovated building. The museum will also be inaugurated with a new exhibition of work by Danish artist Martijn de Waard, which opens on January 22, 2020. The Danish Contemporary Art Museum will inaugurate the Danish National Gallery in January 2021.The Danish Contemporary Museum will be inaugurated with three days of programming in March 2021, and the Danish Museum of Art in April 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Catherine Ouellette as its new CEO and CEO of arts and culture. She succeeds David K. Galloway, who departed the institution in May 2018 to head the Kissinger Collection in New York, and will", "The next Biennial should be held at a place in the city that has not been selected yet.  Juliette Leclerc, president of the Brussels-based organization Amega Urban Institute, said: “It is a very important step in establishing a leadership role for cities in the city of Brussels in the years to come. We are all looking forward to the next Biennial, which will be a reflection of the spirit and of the city.”\n\n\nWorkers in China have begun to dismantle a massive government-backed steelworks in the southern city of Wuhan. The massive $3.1 billion complex, which is home to two thousand workers, was constructed in the city of Wuhan in 2011 and was slated to be completed in 2021. In October, the municipal government announced that the steelworks, which will be submerged beneath the Taichung River, would be demolished in October 2022 and be replaced with a new arts, education, and culture complex. The announcement provoked protests from China’s cultural and arts groups and prompted local authorities to postpone the works’ dismantlement until at least March 20, 2022.In a statement published on Wednesday, the city of Wuhan said that the dismantling of the steel", "The next Biennial should take place in Mexico City in 2022, the European Architectural Museum in Stuttgart in 2021, and the Grand Palais in Paris in 2020. This will mark the first time Los Angeles has hosted an international exhibition of modern architecture since 1965.\n\n\nMolly Stier, a Swiss-born American artist whose practice spans painting, sculpture, performance, performance-based works, and travel, has died at age eighty-one, in New York City.Born in New York City in 1937, Stier studied at the prestigious School of the Fine Arts in New York City, the University of Pennsylvania, and the University of California, Berkeley, before moving to New York to study at the Museum of Modern Art, New York, where she met her husband, engineer Jules Stier. Together, they founded the company that would become the company that would become Solveig, a team that would establish a foundation dedicated to the art of drawing and sculpture.In 1957, the Stiers launched Solveig Gallery, which would become the StiersCuratorial, a division of the Solveig Foundation, and the first of many projects that would build on the foundation’s foundational work. The first was a series of drawings and sketches", "The next Biennial should be held in the fall of 2020. It will be organized as a Symposium with the theme “Architecture of Life and Death.” The conference will be held at the Renaissance Church in Venice from November 12–November 14.The institution will be housed in an old industrial building that will be restored by the architect Guggenheim Museum and will host approximately ten thousand visitors annually. The museum will also have an extension to the museum’s existing building, which opened to the public in 1991. The new building will house the exhibition “The Architecture of Life and Death” and “will become a platform for furthering the legacy of Joséf Althaus,” the founder of the institution, which received funding from the Rockefeller Brothers Fund, the Rockefeller Foundation, and the private philanthropists Henry and Grace Mather.The Mathers are among a number of individuals who have given $1.2 billion to the museum, including the Paul and Mary Beth Allen Trust, the Guggenheim Foundation, the John D. and Catherine T. MacArthur Foundation, the Arthur and Edna MacGill Foundation, and the José and Arne Guggenheim Foundation.", "The next Biennial should be held in 2022.\n\n\nThe Tiananmen Square Art Museum in Beijing has received a gift of fifty-six works, including Ai Weiwei’s In The House, 1988, which is on display in the museum’s exhibition “Adrenaline,” and Li Shuangqi’s The Wind Shatters, 1984, which are currently on display in the museum’s exhibition “Adrenaline,” which runs through February 26. The works are all from the collection of the museum’s curator of Chinese art, Xu Zhenhua, who is also the founder and CEO of the Chinese art museum Hsiao Hangfang in Beijing, and were donated by a collector in the Cultural Capital city of Hangzhou.Huang Kongliang, the director of the museum, said: “It is a great honour to present these works to our customers in this way. It is not uncommon for museums to present works by collectors as part of the collections of the founders of the institutions. We hope that other museums in China will also be able to benefit from the work of the eminent collectors.”\n\n\nThe Fu Manchu Museum in Nanjing", "The next Biennial should be held in 2020, and the final in 2021.  The Shanghai Women’s Film Festival is currently scheduled to run from March 8 to March 13. Wang Wuyi, Wang Yizhi, Wang Qiang, Wang Qing, Wang Cui, and Wang Xian also participated in the exhibition. \n\n\nThe Palm Springs Museum of Art in California announced today that, in commemoration of the upcoming two-year anniversary of its opening, it will permanently paint the walls of its first and second floors with more than 1,500 red roses that were inspired by the theme “Passionate Truths.” The museum also plans to paint the ceilings and floors of its first and second floors with more than 1,500 red roses, and will open a dedicated gallery for the project.“Though the red roses are beautiful in their own right, we think that they also speak to our current moment in which emotions are still raw,” said William B. Parker, the museum’s director. “Our goal is to create an environment for moving images to inspire us to move forward and to create an ambiance for the gallery space that will be both distinctly organic and exuberant.", "The next Biennial should take place in the city in 2022. The exhibition will be supported by sponsors including the København Foundation, the København Museum, the København Mayor's Office, and the København Foundation.\n\n\nThe National Museum of Canada (NMC), a Smithsonian museum in Washington, DC, has received a gift of more than 2,400 photographs documenting the life and work of Canadian artist Margaret Prouvé. The gift includes more than three hundred works by Prouvé, who often depicted female figures in her photographs, which often feature nude figures in the context of domestic settings. The works, which were made in the 1950s and 1960s, are housed in the institution’s collection since 1972.“Margaret Prouvé changed photography forever,” said museum director Nicholas Cullinan, who added: “Over the course of her thirty-year career, Prouvé has exposed the beauty of photography, the possibilities of photography, and has shaped the way we view photographs for the next three generations—and beyond. This is a great day for the museum.”Prouvé’s works will", "The next Biennial should begin with a presentation of a selection of the works in the exhibition “The Daylight of Perception: Spatial Gameplay” at the Subversive Film Festival.“The exhibition has been inspiring for me to be a curator for its structure, by reopening a museum in the morning, as a curator at a film festival in the afternoon, and as a curator conducting research and writing about the exhibition,” said David Levenson, executive director of the Foundation for Contemporary Art, which commissioned and hosted the exhibition. “I am thrilled about the exhibition, its program, and its reception. It has been extremely challenging to present an exhibition with the energy and urgency of a Biennial at the same time as it is open. It has also been challenging to present an exhibition that is as exciting and essential to the history of the art world as the work itself.”Sara Polchak, director of the nonprofit the Independent Foundation, said: “Biennial 2020 is a major milestone for the foundation as we begin the next phase of our mission to support contemporary art and research in Oklahoma. The exhibition will be a source of inspiration and inspiration for future generations of arts professionals and students, and will inspire a new kind of", "The next Biennial should take place in 2023. “The work itself is very well made, and is an excellent example of a great series,” said Leslie Albert, the executive director of the museum. “At first glance, the exhibits seem a little thin, but the quality of the works is great, and the collections are more than adequate for the purpose of the exhibition.” While the exhibition will be on view until March 25, the next edition, “Between the Eyes: Art in 80 Years,” will remain on view until March 29, 2020.\n\n\nThe museum in central London that was forced to temporarily close last month after it opened two new galleries in the city has reopened with a new exhibition designed by the London-based architecture and design firm Arup GmbH. It is titled Between the Eyes: Art in 80 Years. The three-part exhibition, which is on display in the new galleries, was commissioned by the Tate in London and will run from March 13 to March 15, 2020.“Tutel Art Gallery is delighted to present between the eyes,” said Ian Charles, director of Tate Britain. “This is the first exhibition that", "The next Biennial should aim to present more ambitious works by artists whose work engages with the many histories of the city, however briefly, in order to provide a broader and more inclusive picture of the city’s rich and varied artistic history.  In the end, the museum’s new director, Carolyn Quinn, said that the changes the museum is making were made to better serve the city’s cultural and community needs. “We are confident that we have made the right decisions in moving forward in this way, and that we have done so with the full knowledge that we have taken great care to ensure that the institution will continue to thrive for generations to come,” Quinn said.\n\n\nThe Metropolitan Museum of Art in New York has received a gift of more than 160 works by the late Italian post-Gothic artist Maurizio Cattelani, who pioneered a new generation of Italian modernists and was inspired by the avant-gardes of the 1920s and 1930s but was also concerned about social justice and racial justice. The donation includes works by more than fifty artists, including the famous early Cattelani-like series in which a young black artist (Christo) watches as his father (a", "The next Biennial should take place in the United Arab Emirates in 2020 and will lead to a four-year program. The exhibition will present works by thirty-eight artists, including Damien Hirst, Yohanna Wiradjuri, and Katherine Gormley.The following artists are collaborating with the exhibition to create new works at the Museum:   Amina Farid (The Washing Machine), United Arab Emirates: The Washing Machine with Will Swenson (2019)Bibi Ghossein (The Washing Machine), United Arab Emirates: The Washing Machine with Thaddaeus Keller (2019)Cara Hawkes (Painted House), United Kingdom: Three Stories, 2019Armand van der Veghe (Rescent) with Rachel Whiteread (2019)Caroline Hutton (Herman Van der Veghe), United Kingdom: It Is Not a Foreign Place, 2019Lydia Jarman (Taken for Granted), United States: The Sleeping Empress, 2019Hélène Laverty (The Making of Gertrude Laverty, 1980–1985), France: The Making of Gertrude Laverty, 1985-1986Hans-Ulrich Kraus (The Book of Life), 1910–", "The next Biennial should take place in the autumn of 2021 and will be hosted by the Museums in Bologna and Turin. The first edition, titled Art in the Age of Industrialism, was held in 1990, and the second edition, titled Architecture of the Future, was held in 2021. In the 2017 edition of the exhibition, the Italian architect and theorist Moro del Pozo used the installation of the model for the next incarnation of the exhibition, “Amerikanskische Middle Age”, to explore the idea of a kind of architecture of the past, one that was both contemporary and timeless. \n\nThe Australian Council of the Arts (ACAA), Australia’s national arts organisation, announced today that as of September 30, 2020, it will cease operations at the Royal Australian Museum (RAM) in Melbourne. The announcement follows a review of the institution’s future plans commissioned by senior management following the coronavirus pandemic, which led to the institution’s closure in March and led to a staff cut of 45 percent in August.The review, conducted by David Pinsker, the director of the University of New South Wales, Australia, and published", "The next Biennial should be held at a date to be determined. The exhibition will be hosted by the artist’s studio at 48 Rua, a cultural space in the city of Santa Fe, with a budget of $250,000, in the coming months.\n\n\nThe second edition of the Great Lakes Biennial, which will take place at the Great Lakes Art Museum in Monroe, Michigan, in 2021, was quickly canceled over the protests of environmental activists and local Michigan lawmakers. On March 17, the Michigan Department of Cultural Affairs (DC) terminated an agreement with the biennial—which was initially scheduled to run from March 21 to March 25—over the biennial’s $250,000 deposit. The event, which was originally slated to coincide with the annual Detroit Art Fair, has since been moved twice, once in 2021. “We believe the cancellation of a biennial is an infringement of the Michigan Convention on Human Rights,” state senator Brian Frosh, a Detroit Democrat, said in a statement. “This is a political act; this is not a legal act.” In a letter sent to the Detroit Free Press on March 22, the Victorian-based nonprofit Woods Hole Association noted that the cancellations", "The next Biennial should be held at the Stedelijk Museum in Amsterdam, in 2020.  The 2019 biennial, entitled “Are We There yet?,” was curated by Stefan Beckmann and was held at the Wolfenbahnen Museum in the Netherlands. The exhibition was organized by Sharon Rosenblum and was curated by Olivier Bloch-Williams. The exhibition went on to win the Gerhard Richter Award for Contemporary Art in 2013 and the Hanoverian Diadem Award in 2018. \n\n\nAfter the Museum of Contemporary Art (MoCA) in Los Angeles temporarily closed on June 7, its executive director, Michael DeMaria, issued an apology for the exhibition “Touched”\u0097an exhibition featuring works by over sixty artists. “The show was not just a celebration of art, but also an extension of our mission to explore and take seriously the idea of art,” DeMaria wrote on the museum’s website. “In this way, we learned to be more open and responsive to the world around us.”While the show was canceled, the museum was forced to move the entire exhibition inventory online, and the exhibits were salvaged from the institution’s", "The next Biennial should take place in the middle of April. The date for the 2019 edition will be announced once the negotiations are over.The official invitation reads as follows: For the first time in its history, the fifty-eighth edition of the Biannual Biennial of the Arts and Design (BAD) is coming to Barcelona. This year’s edition, which will feature thirty-six works by thirty artists and collectives, was curated by art historian and curator Fotosearchitecture and Design and curated by the city of Barcelona. The exhibition will run simultaneously in Madrid and Málaga, the capital of the Andalusian region of Andalusia.“The new Barcelona sets the stage for the city with an inclusive and ambitious vision for creativity and architecture,” said city mayor Ada Colau. “The new Barcelona is the place where artists and designers dream of relating their practices to Barcelona’s history and the city of Barcelona in a way that will help them to create new projects for the city and region.” BAD is a partnership between the City of Barcelona and the Universidad de Barcelona. It is organized by the city of Barcelona, the Universidad de Barcelona and the Univers", "The next Biennial should take place in 2021. “The new exhibition will have a new and innovative platform for contemporary exhibitions, and will be recharged by artist collaborations and by a new and greater audience,” said Fassbender. “I’m excited to be a part of the biennial’s history and to work with all of the artists who have shaped its programme and spirit and to continue to redefine the biennial through the collection, presentation, and exhibition of work.”\n\n\nThe Museum of Contemporary Art, Los Angeles (MCA), has released the list of 150 artists who will participate in its Mark Zuckerberg–backed, $6 billion expansion project, which will bring the museum’s current galleries to the new buildings, which were designed by the renowned architect Herzog & de Meuron, in 2017. The redesign was inspired by the museum’s early years, when Zuckerberg founded the arts magazine the Village Voice, a precursor to the online magazine Medium.The full list of artists is as follows:Adam HochschildAdam FirstenbergAdam JohnsonAdam LeeAdam LanganAdam SchiffmanChris AlbrechtChris AlvaradoChris AlbaughChris Andrew DavidsonChris Alexander Chris AndersonChris Billett", "The next Biennial should be announced as early as 2019. The theme of the 2020 edition is “The Past and Future of Art.” The exhibition will be curated by Paolo Cattelan, director of Art in the City, and will take place in a two-story exhibition space in the Italian city of Roma. The exhibition will include six new works by the artists featured in the first show, “The Lying Face of Life” (2017), and “The Color of Water” (2015), all of which were on display in “The Struggle of a Dreamer” (2017), also curated by Andreas Kallmann. The 2018 edition of the award, “Between the Sun and the Moon” (2017–18), also featured work by the artists featured in the 2017 show, “The Sun and the Moon” (2017–18) and “The Disintegration of Light.” The 2019 show, “The Sun Still Rises Over Rome,” opens March 19 at the Museum of Modern Art in New York and runs through May 28 at the Museum of Modern Art, Los Angeles.\n\n\nThe National Gallery in London has released the", "The next Biennial should be held in 2020, and the first in 2021. The 2019 exhibition was held in Paris and was preceded by the “Ecole des Beaux-Arts” (The Animal Factory), which toured the world in 2015. The festival will celebrate its centenary in 2021 with a retrospective of the show’s first year. The exhibition will run until January 3, 2022 and will be accompanied by three separate performances by artists from the show, including Ai Weiwei, Adrian Piper, and Damien Hirst. \n\n\nFrieze announced today that it has named Amara Brackens as its first global curator of women artists. Brackens will be tasked with developing and implementing new ways for our curators to connect with and engage with the communities and institutions that represent the most promising narratives of women artists. The curators will collaborate with artists and scholars to craft exhibitions that reflect the growing trends and possibilities for female artists from the Americas to Africa and the Middle East.“Amara’s curating is unique and audacious, and we’re eager to work with her to build a new kind of show for the gallery,” said Frieze CEO Loring Randolph.", "The next Biennial should open in 2021 and will feature the work of a select group of artists selected by the public through the initiative “Finally, an Exhibition for the People.”The announcement follows the biennial’s launch at the Stedelijk Museum in Amsterdam, and follows Biennale de Lyon’s announcement of a new partnership with the National Arts Museum in the US. The partnership includes the establishment of a new $500,000 fund to support the theme of the 2020 edition. The fund will also provide a significant boost to the biennial’s artistic output, with the theme of the exhibition being a reimagined future based on technology, innovation, and sustainability.The biennial’s theme will be “Design and the Environment,” a response to the theme of the exhibition “Composition no More” at the National Museum of Modern Art in Paris. The exhibition will highlight the work of a select group of artists collaborating with the biennial’s theme, and will also include a virtual reality installation and a performance. The exhibition will run from March 16–March 19, 2020 at the Stedelijk Museum in Amsterdam.\n\n\nThe Museum of Contemporary Art (", "The next Biennial should have a policy of self-distribution, with exhibition spaces for people to come and see it. “I’m the youngest person to ever win the Grand Prix,” said Prada . . .\n\n\nImran Ahmad, the president of the Ahmadiyya Muslim Community in the UK, is under fire for airing a Q&A with British Prime Minister Boris Johnson, a white nationalist, at a Jewish Museum in London on Wednesday evening.The event was part of a campaign by Ahmadiyya Muslim Community leader Maulana Mahmood to draw attention to the UK’s anti-terror bill, which would allow the government to bulk-mine natural resources from Britain’s vast natural resources—including its oil and gas reserves—and use the funds to combat antisemitism. As part of the UK’s plans to leave the European Union, Mahmood wants Ahmadiyya Muslim Community members to be given the right to remain in the UK.According to Mahmood, Johnson only answered a single question—his own—during his discussion with Johnson. He said that if the government is serious about fighting antisemitism, it should have addressed the issue of extremism and terrorism before it entered into the agreement with", "The next Biennial should be held in the fall of 2022. Cohen and his team hope to begin construction in the spring of 2024.“We are thrilled to be bringing new life and vitality to the iconic building,” said Wanda Hutchison, chair of the Biennial Board. “It is an exciting time to be working with the city to restore the iconic Biennial and a collective project of the city of Miami Beach to make it a reality.”\n\n\nThe Turner Prize—a $1 million award that celebrates the cultural achievements of women and non-binary artists in the United Kingdom—has announced that the biennial “Skinny” will return in 2020. The exhibition, which was held in London’s Serpentine Galleries for the first time in 2018 and was first presented by the British Film Institute (BFI) in London, will co-present with the British Council-backed Southbank Center for Contemporary Art in London and will be organized as a triennial. Led by Corina Hollis, who was presented with the prize at a ceremony in London’s Hyde Park on Wednesday, the center’s inaugural edition, “Skinny” will take the form of a", "The next Biennial should have been held in late July or early August, but was pushed back because of the Covid-19 pandemic. “The decision was made on the basis of insufficient demand for the exhibition,” Mehta told the Art Newspaper. “It was a mistake. The story of the exhibition is not really newsworthy,” he said, referring to the recent exhibition “NIRIN,” a retrospective of art by the Italian artist Paolo Baratta.The opening of the biennial was supposed to take place in the city of Margate, in northern England, but was pushed back to September. The exhibition is scheduled to last through November.According to The Guardian, the exhibition was originally supposed to be a “post-code' show, where visitors could see and buy works by artists such as Brian Eno or Mario Gregotti. However, the move has been criticized by some, including artist and curator Graeme Allan, who said that the exhibition was “propped up” by the Covid-19 pandemic. \n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has announced that it will permanently close its doors to the public on March", "The next Biennial should be held between May and November 2020, to coincide with the first Biennial. The first Biennial was held in the city from January 6 to February 14, 2019. Although the city has had a separate exhibition space in the United States for more than twenty years, it was only this year that it was able to stage a show. It will now have its first show with the Disney-Pixar subsidiary CBM, and its first with the  New York–New Jersey Chamber of Commerce. The rest of the pavilion will be dedicated to collaboration between artists and will host presentations by contemporary artists, including Aldous Huxley, Ray Chert, and Hao Jing, as well as art-world figures such as Richard Diebenkorn, Wolfgang Luebke, and James Cuno.\n\n\nThe Museum of European Art (MAA) in Brussels has appointed Hassan Al Jubari as its new director. In his new position, Jubari succeeds Bernard Roche, who was appointed as the institution’s interim director this month. This is the second time the Museum of European Art (MAA) has had a new director in the", "The next Biennial should be held in the fall of 2020.\n\nThe European Union has issued a warning to the United States and Canada on the organization of the 2020 edition of the Art Basel Hong Kong fair, which was canceled owing to the ongoing global pandemic, in an effort to stem the spiraling outbreak of the novel coronavirus, The Art Newspaper reports. The United Kingdom has also launched an emergency fund for cultural workers in the wake of the virus. The fund will offer assistance to individuals, small and midsize galleries, and independent curators whose livelihoods are at risk, and will be administered by the UK’s Department for International Development.The warning came a day after the fair, which was supposed to run from March 15 to March 21, was canceled due to concerns surrounding the coronavirus. The organizers said that the cancellation was made amid fears that the coronavirus was spreading in China and was not related to the canceled event.While some in China claimed the virus was caused by the novel coronavirus, the country’s initial response to the coronavirus was extremely weak, with most people only learning about the outbreak, the coronavirus, and the virus itself, which is spread mainly by close contact", "The next Biennial should be held at the Smithsonian American Art Museum in January 2022.\n\n\nThe seven artists currently featured in the upcoming Fifty Shades of Grey biennial in London are boycotting the event until it stops its promotion of same-sex marriage and human trafficking. The boycott is being led by the gay and lesbian British Gay and Lesbian Community (LGBTBGB), which has joined other groups in protesting the exhibition by staging a Human Rights Campaign-inspired march through central London on Friday, March 25. The event, titled “The Biennial After Fifty Shades,” is expected to draw an estimated 20,000 visitors.According to the Independent, the exhibition’s London-based organizers have defended the exhibition, which they say addresses issues of consent and tolerance and has not addressed the subject of same-sex relationships. “The Biennial After Fifty Shades’s focus on the intersection of art and sexuality is a strong reflection of our time and our moment,” said Farah Farooq, the director of New York’s Frieze London. “It is an opportunity to take a fresh look at the meaning of art and sexuality and to re-evaluate the LGBT+ community, and to do this in a", "The next Biennial should take place in the spring. The first was held in the summer of 2019. The next edition is expected to be held in the autumn of 2023.  The 2020 edition will be held at the Museum of Contemporary Art Oakland in California, the Museum of Modern Art in New York, the Museum of Contemporary Art Cleveland, and the Museum of Modern Art, New York; the 2021 edition will be held at the Art Institute of Chicago. The 2020 theme is “The Future We Want: Renewing the Past” and the 2021 edition will be titled “This Is Not a Game: Games and the Future of Arts.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that Maeve Mitchell has been named its next executive director. The appointment of the two-time Pulitzer Prize–winning artist, who frequently works in digital mediums, was made possible through a $200 million gift from the Kate and Gerry Mitchell Foundation.The gift, which comes amid a series of major fundraising campaigns, including the Kate and Gerry Mitchell Foundation’s “Make Room” campaign, which raised more than $150 million for the institution, and a special exhibition of art created by Mitchell", "The next Biennial should have been staged in Milan in early 2018, and the first exhibition should have been staged in New York in early 2021. Instead, the institution closed its doors indefinitely on March 30, 2019, and the biennial was never staged again.The most recent exhibition featured works by artists including David H. Simon, Yoko Ono, and Kiki Smith, among many others. In addition to the exhibition, two biennial documentaries, Mirror and Vase, were presented as part of the 70th Art Biennial.The Art Park was founded in 1939 by Klaus Erhard Bielsa, a German Jewish immigrant, and his son, Reinholds Bielsa, to house the works of artists such as Anna Atkins, Franz Kline, and Hans Frank, who was one of the last living members of the group the Third Reichs. The park is located in the Kreuzberg neighborhood of Berlin. \n\n\nThe Solomon R. Guggenheim Museum in New York is planning to open a new digital- and video-based experience that will allow visitors to experience the famed artist’s works in a more intimate setting. The museum is collaborating with the Museum of Modern Art (MoMA) in New York", "The next Biennial should take place in 2022. Javellana has also announced that it expects to open a new complex in the city in 2021. For the past two years, the artist’s studio has been located within a former BOSB electricity station on the edge of the city, in the same industrial zone as the former KWK Radio Station. After merging with the BOSB in 2013, the artist began his celebrated site-specific installations in the former factory, which was built in 1941, in the summer of 2015.The exhibition’s first pavilion, “The Brain and the Body,” was staged at the BOSB in 2016. The show explored the interrelation between physical and mental functioning, and the strategies and processes by which the body and mind work together. The project was co-organized by artist and curator Volker Sittel, who was nominated for the prize in 2018.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has appointed Sarah Lisle as its next chief curator of contemporary art. Lisle comes to the institution from the Metropolitan Museum of Art in a longtime network of curators that includes Jeffrey Rosenblum, who has helmed the museum since 2008, and", "The next Biennial should be a question mark, as the organisers are still awaiting the verdict of the coronavirus coronavirus in the UK from the World Health Organization (WHO).\n\n\nThe Museum of Fine Arts (MFA) in Miami Beach has closed its doors indefinitely, effective today, in protest of the coronavirus epidemic, reports Artnet. The museum was forced to close the doors of its two-story, 55,000-square-foot space in Mid-Florida after it failed to contain the virus.On Tuesday, to coincide with Art Basel Miami Beach, the institution staged a show of works by artists including Theodora Abbot, Theodoros Andrassy, and Thomas Campbell. Curated by Mari Stier, director of the Miami Beach Art Museum, the event was meant to highlight the work of local, independent, and national artists and to draw attention to the coronavirus and its threat to artists worldwide.However, as the show ran into trouble in the early hours of Wednesday morning, organizers announced that it would be postponed, and announced that the end of the exhibition would be February 29. The decision has led MFA’s board of directors to declare that the closure is indefinite, and the museum�", "The next Biennial should include a selection of works by a group of twenty-five artists, whose work has yet to be exhibited. “The whole point of the exhibition is that both our institutions are continuing to be a platform for the art of the future,” DeCordova said. “It’s about time to think about how to change the lives of many in the city. We are committed to that and will continue to push for change through our art. But in order to change the city we first have to think about the art.”\n\n\nThe National Gallery of Art (NGA) in Washington, DC, announced today that Yoko Ono’s work, Cindy Sherman’s Sensitive Skin, has been selected as the theme for the third edition of the National Gallery’s National Portrait Gallery (NPG) exhibition, “Sensitivities,” opening November 23–December 16. The exhibition will feature work by nineteen artists, including Vivian Ahern, Mark di Suvero, and Alex Katz, and will draw from the museum’s collection and the public’s experiences with LGBTQ+ people.“We are thrilled", "The next Biennial should be decided by the end of the year, and we hope that the World Health Organization will confirm the new dates in order to allow the exhibition to continue its planned March 2019 opening in Abuja.”It is not yet known when the 2020 edition of the event will take place.\n\n\nThe Museum of Fine Arts (MFA) in Boston is seeking the public’s help in identifying a group of American and European artists who were working to create a new work of art that would be exhibited at the institution in the coming years. The work, titled On the Roof of a Building, and is a reconstruction of a nineteenth-century Gothic cathedral. The new work, which will be located in the museum’s exhibition space, will highlight the work of American and European artists within a contemporary context.“The building is a monument to a generation of artists that was shaping the institution into what it is today,” said David Fadiman, director of the MFA. “On the Roof of a Building was the result of a collaboration between John Akomfrah and Walt Whitman, a significant first step in the development of the MFA’s permanent collection. We are pleased to work with the", "The next Biennial should take place in 2020. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has announced that Richard Akomfrah, the curator and founder of the New York–based museum, is being promoted to assistant curator of European art and the Americas. A curator and art historian, Akomfrah will be responsible for carrying out the institution’s contemporary-art research and serving as a point of entry for future exhibitions and other programming. He succeeds Andrew Kreps, who has served as MoCA’s curator of European art since 2015, and will take up the post on January 4, 2021.“Richard is an exceptional curator who has been a leader in the discourse around contemporary art and the Americas in the United States for more than a decade,” said Meg Langham, chair of the board of trustees of the Gordon P. Mosley Foundation. “His work has been recognized internationally for his scholarship and experimentation in the field, and his innovative way of organizing exhibitions and exhibitions commissions has been embraced by many of his peers. He has also done groundbreaking work, moving MoCA into new territory, and creating new exhibitions and commissions for the museum, and he has been hugely influential in shaping the institution", "The next Biennial should take place in 2021, but the first Art Basel Design Show will take place in March.\n\n\nThe London-based nonprofit Artforum, which has been at the forefront of advocating for the inclusion of women in art institutions since its founding in the 1980s, announced today that it is launching its 2020 Women in Art series. Established in partnership with Tate, London, Artforum’s London branch will curate art exhibitions for the Tate, the National Portrait Gallery, the National Gallery, and the Tate Britain, and will partner with galleries and nonprofit organizations to present creative projects that address the empowerment of women artists. “We have long championed the rights of women artists to be represented in an artistic context in the UK, but rarely have we tried to create a new institution devoted to women artists,” said Kate Bevan, director of Artforum. “What we are doing now is a new kind of National Women’s Circle, for women artists that will draw from their own experiences to engage with and rethink the art of their own time, to engage with their own narratives, and to create projects that challenge the boundaries of what it means to be a woman artist in the UK.”The 2020", "The next Biennial should focus on the history of the biennial from an anthropological perspective. In order to develop a new historical perspective for the exhibition, the exhibition should be structured as a collection of hundreds of works that illustrate the themes of the exhibition. In addition, the exhibition should strive to incorporate the results of contemporary research and practice, especially in the field of contemporary art from the West. Therefore, the exhibition should reflect a multidisciplinary approach that largely draws from the works of the artists featured in the exhibition.The Biennial will be inaugurated by a preview of the exhibition “The Glimmer of Life” at the Museum of Modern Art in New York on March 5. The show will continue with an exhibition of the artwork “Wangechi Mutu” at the Art Institute of Chicago the next week. These two exhibitions will be followed by “The Problem of Art: Contemporary Americans” and “The Art of Destruction: Contemporary Art in the Age of Nuclear War” at the Huron Museum of Art in Ohio on August 28–September 15.In order to avoid disrupting the work of artists taking part in the exhibition, the Biennial will feature a “hidden panel” “outside the museum”", "The next Biennial should focus on new ways for young artists to make their mark in Los Angeles and Los Angeles’s art community—a topic I am really passionate about.”In an email, artist and curator John Bradley wrote: “The next Biennial will be the opportunity to learn from and experiment with the most prominent figures in our community, and the largest audience possible in Los Angeles. That is the goal, and it is achieved through a series of interrelated projects that will be inspired by the full range of the artist’s practices. I look forward to this next iteration of the Biennial, and to seeing the artists I have worked with for the past twenty years.”\n\n\nThe Andy Warhol Foundation announced today that James Turrell has been named the recipient of its $10,000 in support of the Arts Quarter. The $500,000 grant was made in support of the Andy Warhol Foundation’s “Andy Warhol Foundation for the Arts” (AWFA) program, which is a partnership between the Andy Warhol Foundation and the City of Los Angeles. Galerie Daniel H. Weinberg, curator and director of the Museum of Modern Art in New York, will serve as the inaugural director of", "The next Biennial should take place in 2020.\n\n\nThe National Gallery of Scotland is dedicating its collection to the memory of Paul McKinn and should be able to display his work in the first half of the twenty-first century. The show will feature work by fifty-four artists and will open in May 2020. In honor of the occasion, the museum will launch a series of events and activities with artists. The first of these is a major retrospective of McKinn’s work, “Paul McKinn: A Retrospective,” which will be held at the gallery on September 6.There are many artists whose work has been lost or damaged since McKinn’s death in 1998. The National Gallery of Scotland is currently working on identifying the damaged work. The museum has previously attempted to secure the artist’s work through its own foundation, the McKinn Foundation, but the artist declined to grant permission to display it. The foundation is seeking private donations to assist in identifying the new works. The museum will also offer free admission for visitors of any age through May 15.\n\n\nThe Skowhegan Museum of Art in Lewiston, Maine, has appointed Marisa Bergen as its next director.Bergen comes to the institution", "The next Biennial should be announced in the second quarter of 2020.\n\nThe new museum’s new quarters will be located on the first floor of the institution, located at 2801 New York Avenue, and will offer a number of programs, including artist residencies and special exhibitions. The development of the museum has been in the works for more than a year and was supported by $10 million in funds from the Charles and Lucille King Family Foundation, as well as a $5 million donation from Jeffrey Epstein, the former owner of Epstein Air Lines.The foundation also pledged $5 million to the new institution, and the King Family gave $1 million, which is the largest sum ever raised by the King Family. Two hundred individual gifts totaling $2.5 million have been made by individuals or foundations in support of the construction of the new museum.The new museum will hold five thousand paintings and drawings by forty-four artists, including Pierre-Auguste Renoir, Ernst and Anna-Marie Szymborska, Willy Leyva, and Jeanne-Claude. Most of the works will be on display in the museum’s new exhibition, “Painting by Franz Kline,” which opens March 22. The exhibition will", "The next Biennial should be a new exhibition of the work of Paul Virbault and Michael Ochs, “Nirvana” and the collection should feature as well as new works by Mary Beard and Hans von Klee, which are currently on display in the exhibition “Sovereignty: An Exhibition of Art” as well as works by artists such as Marilyn Saatchi and Vico Einaud.The Biennial will be inaugurated by a solo show of works by the British artist David Hockney, who is known for his installations of geometric geometric shapes in his home country, England. “The exhibition represents the enduring legacy of the British artist and his country, and sets the stage for a significant new engagement with the biennial, which is yet to be created,” said David McAllister, chairman of the trustees. “In addition, it will engage in the work of the future generation of British artists and will draw on the work of the past to demonstrate the importance of the art world and of the biennial in shaping and defining the contemporary.”Commenting on the biennial, Kate Fowle, chief executive of the trustees, said", "The next Biennial should be held in March 2020.\n\n\nA group of artists and scholars in northern Italy are trying to raise $50 million to restore a massive bronze sculpture by Piet Mondrian, a notorious artist who made works that frequently reference, question, and often contradict his own ideas about the nature of reality. In the exhibition “Between the Sun and the Moon” (“Between the Sun and the Moon”), Beppe Padoin, the president of the Democratic Party and the People’s Party, will unveil the list of twelve artists who will be selected for the project. The project will be led by Beppe Spinelli, a professor of cultural history at the University of Pisa; Matteo Cicutto, a leading Mondrian biennial expert; and Francesco Cipolletta, a professor of art history at the University of Padova.The list of artists has yet to be released, but will consist of a selection of works created between 1912 and 1973 by the painter Gio Ponti. The artist will be given a €50,000 ($52,000) donation by Padoin for the restoration of the sculpture, which was made in 1979, and will be given the opportunity to", "The next Biennial should include a review of the African diaries, which have recently been included in exhibitions at the Museum of Modern Art in New York and at the Museum of Modern Art, London, as well as a survey of the life and work of Birgitta Jonsdottir. The biennial will be hosted by the artists and the museum and will take place in the central location of Stockholm, in the city where they live and work, and will be organized in a way that will allow visitors to experience the exhibition space as a space for reflection and reflection on the past.The biennial will be hosted by the artists and the museum and will be organized in a way that will allow visitors to experience the exhibition space as a space for reflection and reflection on the past. The artistic director of the biennial, Anna-Sophie Olsson, said: “The biennial is an extension of the artists’ personal journeys, and we are particularly interested in their talks and writings on the present. This exhibition will provide an opportunity for the artists to interact with the biennial as a space for reflection and reflection on the past.”The exhibition will feature a selection of works from “The Body and the Function of the", "The next Biennial should be in November 2021, when the Hong Kong Biennale will mark its sixtieth anniversary. \n\n\nThe Baltimore Museum of Art (BMA) is planning to move several hundred artworks and collections from its campus in downtown Baltimore to a new home in the city’s Pratt Institute, the historic city-owned arts center that serves as a research laboratory and an incubation lab for cutting-edge artistic and technological experimentation.The new venue will be constructed on the former site of the old Pratt Institute, a former community center that provides free, unlimited, and on-site housing for artists and researchers housed in a renovated former factory. The new home will boast a dedicated museum dedicated to the history of metalwork and assemblage, a museum devoted to the development of new materials, and a library dedicated to the study of industrial design and design philosophy, among other topics.“The two monuments at the BMA are emblematic of the extraordinary history of the Pratt Institute,” said BMA director Christopher Bedford. “With these two works, we are reclaiming the Pratt Institute as a center for African American art. We hope the new museum will be a model for how we think about the past, a model for", "The next Biennial should include a lecture by a leading artist from the UK and US, Nicholas Loteridge, and a presentation of works by Salvador Dalí, Alexander Calder, and others. Also on the agenda will be an exhibition of the work of the artist Philip Larkin; and a discussion of the financial plight of the Global South and the need for a new international body, the Biennial of the Americas.The theme for the twenty-third edition of the exhibition, titled Outsider’s View, will be the story of a young, black, Nigerian American artist and he will assume the role of protagonist. He will be a transgender artist whose work explores the relationships between black and white and is inspired by the Black Lives Matter movement. He will also represent Nigeria at the Venice Biennale.Afterwards, the Biennial of the Americas will hold an exhibition of work by the artists who are indigenous to North and South America. The twenty-fourth edition will be dedicated to a “black midlife crisis.”\n\n\nOn Thursday, Art Basel announced that it plans to begin accepting payments in bitcoin and digital currency in Japan, South Korea, China, and Hong Kong. Curated by Hiroyuki Chiba, the", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it plans to remove more than seven hundred works from its holdings in an effort to clear the institution of any remaining undocumented copies of the work. “The museum is committed to protecting works that have never been in the United States or are in the country illegally,” said museum director Matthew Teitelbaum in a statement. “These works are part of a long-standing and robust program of scholarship that advances our understanding of the history and the practice of the art world. We are confident that removing these works from the collection will strengthen this program.”The move is part of a broader effort by the museum to shed undocumented works and their collections in an attempt to make its collection more homogenous with that of the United States. There are currently more than 2,500 works in the museum’s collection that were imported into the country legally and are therefore not subject to removal. The works are currently on display in “American Art at Home: From Minimalism to Modernism” and are scheduled to be taken down in December.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles", "The next Biennial should be held in 2021.  The next exhibition should be titled “The Origins of Modern Art” and will be curated by Hans-Ulrich Fiedler. The next exhibition will focus on life and the environment in a time capsule from “Theodoros Ropas,” Željko Plasnik, and Jan and Marian Nijhof. \n\n\nThe Museum of Fine Arts (MFA) in Boston has accepted a $3 million donation from Bahraini billionaire Hisham Al Qassimi, the founder of the Baniqnan Corporation, to help preserve the American Revolutionary War–era neoclassical palace complex that houses the museum. The gift comes at a pivotal moment for the institution, whose current exhibition “Equality: American Art and Its Divestsment” is scheduled to open on January 3, 2021. Originally scheduled for January 28–February 3, 2022, the exhibition is currently on hold due to the coronavirus pandemic. “Equality’s' future lies with the men and women of this country,” Al Qassimi said in a statement. “I’m eager to support an institution dedicated to", "The next Biennial should be held in January 2020.  (The deadline for the exhibition was set to fall on January 27. In the weeks leading up to the event—which was organized by the German federal state of Bavaria—budget cuts caused a series of cancellations, including the London and New York Biennials. The Hartmann-Bickel-Beck “Das Union” is currently on display in the new exhibition space “Artforum” at the Kunsthalle Basel in Switzerland, alongside works by artists such as Wolfgang Noth, Barry Kent, and Barbara Kay. \n\n\nThe Palais de Tokyo in Paris has received an incredible donation of eighty-four works from the fourteenth edition of the Palais de Tokyo, held in March 2020. The event includes works by artists such as Anish Kapoor, Michele Barlow, and Joan Miró, who will all be honored at a special exhibition at the Palais de Tokyo in October.The exhibition, titled “Polarities,” opened with the artist Khan in a special exhibition at the Palais de Tokyo in March 2019. Among the works on display are “The Stages of a Suicide", "The next Biennial should focus on the history of the exhibition, its development, and the exhibition calendar. The next edition should focus on visiting artworks in Australia through a fully digital and augmented reality (VR) experience in partnership with the Australian Council of Curatorial Arts and the Institute of Contemporary Art.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has named Dan Merges as its next president and director. Merges takes the helm from Christopher Wool, who has helmed the museum since 2015, and will assume his responsibilities in January 2021.“With his extensive experience, Merges understands the challenges and opportunities of running a large museum, particularly one with an international reputation, while continuing to grow our collection and exhibit program in its contemporary art wing,” said Mark Thompson, the director of the museum. “In addition, Dan has demonstrated his ability to build an enduring collection and exhibit program while maintaining a strong vision for the museum while working across multiple disciplines. His appointment marks a moment of great change for the Met, and for the work of the museum in general.”Commenting on his new role, Merges said: “I have been a longtime supporter of the Met, and have been an advocate for its work", "The next Biennial should take place in 2022 and be hosted at the Museum of Contemporary Art, Miami Beach.\n\n\nThe Biennial of British Art, which was supposed to take place in London in November 2019, was postponed by a month and a half. The postponement has been attributed to the disruption caused by the Covid-19 virus, which has infected at least 3,400 people in the United States and has made its way to at least three other countries: China, India, and Pakistan.Dubbed Art in the City, the biennial, which was organized by the Tate, the National Portrait Gallery, and the Wallace Collection, was due to take place at the National Museum of Art, London, from November 18 to November 24. The event, which was slated to coincide with the opening of Tate’s new exhibition, “The Metamorphose,” was canceled after the institution received three cases of Covid-19—two in the United States and two in Britain. The third case—confirmed at a hospital in the UK by a child on Christmas Eve—has since been confirmed by the Centers for Disease Control.According to the British artist and activist Caroline Criado, who has spearheaded the campaign to hold an online", "The next Biennial should be held in the spring of 2021.   The theme of the 2019 biennial, “The Future of the Future—” will be reworked to reflect the theme of the upcoming exhibition, “The Future of the Present.” The exhibition will explore contemporary issues relating to the future of art, and will present a collection of artworks by twenty-six artists, including Ai Weiwei, Franz Knoedler, Frank Gehry, Janice Musgrave, and Thomas Mühling, as well as biennial works by artists such as Eileen Atkins, Paul Gauguin, and Paul Thomas Anderson. The biennial will be dedicated to the biennial exhibition “The Future of Art: ‘The Future of Art: ‘The Future of Art: ’” and will inaugurate the new pavilion. The pavilion will also include the exhibition “The Precious Spike of Love: Art in the Age of Romanticism” (2019), “The New Art of Manfred Küng: From the Art of the Early Middle Ages to the Art of the Renaissance” (2019), and “Exhibition: Modern Art in the Age", "The next Biennial should be held in 2022, but the project’s organizers are now debating whether to suspend it until then. The organizers are hoping that a change in government will help them reach a compromise over the date. “We are evaluating various possibilities,” a spokesperson told the Art Newspaper, “and will continue with our work as planned.” Although the project was originally scheduled to run from March 27 to March 29, organizers have now moved it to December 21–December 28. The first exhibition of work by the 2018 recipients will be the second half of the two-part project, “The Fall and Rise of Art,” which will run from January 3–January 4, 2020.During the project, which will also include the exhibition “The Final Hour,” the exhibition will focus on the influence and legacy of the Egyptian artist Naguib Mahfouz, as well as the effects of the coronavirus, which is spread mainly from person to person, on contemporary art. The lecture series will feature among the artists who have received the Nobel Prize in sculpture, painting, and photography.“This is not a time of crisis, but a time of opportunity,” said Naguib Mah", "The next Biennial should be held in the next two years, and in 2020, the National Geographic Society expects to premiere a new edition of the exhibition. The biennial will also include a collection of Biennial Essays, a selection of essays by artists such as Jean-Luc Godard, Susan Sontag, and Philip Glass.\n\nThe Japanese government has released a set of guidelines for the cultural sector in the country\u0097specifically, for museums, for photographers, and for artists. Japan’s Culture and Tourism Agency (CAA) announced the publication of the guidelines on Thursday, and the news was met with delight by those who have been fighting for their inclusion for years, including the Tokyo Art Show and the Tokyo Film Festival.According to the CAA, the guidelines can divide the arts into three categories\u0097photography, architecture, and literature\u0097and can help promote a more holistic view of the arts. Titled Development of Art and Culture, the guidelines are divided into seven sections\u0097clicking on any of them will take you to a page where you can learn more about the section you are interested in. The section on photography\u0097the section for photographers\u0097is the most contentious", "The next Biennial should be held before the end of the year.\n\n\nTHE BIRCH & JIMMY STAFFORD ART CENTRE, BIRCH, NEW YORK: In a move that sends shivers of pain through the heart, the Sackler-funded center has announced that it will cease operations as a nonprofit and shift to “a public space for the arts and culture.” In a statement, the center said that the decision to shutter the nonprofit was made following a “tremendous outpouring of support from the community, particularly from the artists who have helped foster the ArtsCenter’s success.”Artists and collectors have since called for the center’s future mission to be reconsidered. On Monday, September 11, the day of the announcement, the ArtsCenter was open and hosting a number of exhibitions and other programming, including the “Pitch Black” exhibition and the biennial “March of the Pigs” and “The Adriatic,” which examined the climate in Italy. When the arts and culture space was closed, the ArtsCenter tweeted that it was “taking all necessary measures to ensure the future of the organization’s", "The next Biennial should be scheduled for December 2019. The reopening of the museum can be expected to begin in early December and last through the New Year.\n\n\nThe National Galleries of Scotland announced today that Adrienne Edwards has been selected as the next director of the National Museum of Scotland. She succeeds Helen Rennie, who was appointed director of the museum on December 22, and will assume her responsibilities on January 1, 2020. “I am delighted to take on this newly created position at the National Museum of Scotland,” Edwards told the media. “I’m looking forward to working in partnership with the National Museum of Scotland’s wonderful staff and new partners, and to building on my reputation as one of the leading experts in this field in Scotland.” Edwards previously served as director of the Miriam and Ira D. Wallach Art Gallery in London and as director of Glasgow Art Museum. In her new role, she will oversee the development of the museum’s collection, research the museum’s holdings, and work with scholars and visitors to advance conservation practices and educational initiatives.“I’m looking forward to working with the museum’s talented team and exploring new ideas and", "The next Biennial should be held in 2020 and will be led by an international team of curators and artists. The selected curators include Mari Bruguera, Iván Cossuitelli, Nene El Abou-Rahme, and Renaud Loter, whose experimental work has been exhibited at the Venice Biennale; and Hans van Schalkwyk, whose paintings have been collected by the Vienna Museum of Fine Arts and the Museum of Modern Art in the United States.\n\n\nThe Norwegian artist Lars Vilks, whose monumental paintings captured the essence of nature and the human experience through an unearthly, organic quality, has died at the age of seventy-seven at his home in Oslo. Though he was still making art in his later years, his paintings have been lost to the museums and the public.“Lars Vilks: Art of Life” (1999) and “Lars Vilks: The Face of a Spring” (2007) were among his last works, and the latter recently entered the collection of the National Museum of Modern Art in Oslo. His remaining works, which are housed at the Danish art museum, are also on display in “Lars Vilks: Modern Art and", "The next Biennial should commence in 2020 and will be hosted at the Museum of Contemporary Art (MoCA) in Los Angeles. “We are immediately embracing the international platform of the museum and incorporating the themes of our new exhibition,” said Ashraf Rula, director of the Museum of Contemporary Art (MoCA). “This exhibition will be a powerful window into the mind and heart of the artist who will own the show. It will also be a great platform for global exchange and collaboration.”\n\n\nWith the announcement of the 2019–20 season, the Metropolitan Museum of Art announced that it will reorganize its collection in an attempt to become more sustainable. The museum’s board chair, Susan Sullenger, said that the restructuring will incorporate several new formats and will aim to “conserve and share the most recent work while being responsive to the museum’s mission.”The institution will also embrace social media and the efforts of museums to connect with audiences around the world. The museum will launch a platform for contemporary art through its new platform, METBLESS, which will be fully online in December and will feature new works by the artists featured in the exhibition. The program will also include a number of digital exhibitions,", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, California, has appointed David K. Coyne, the executive director of the Central Institute of Art, as its new deputy director. Coyne comes to the institution from the Los Angeles County Museum of Art (LACMA) where he has served as director since 2015. He succeeds David K. Pfeifer, who retired last year after fifteen years in the role.“During a time when it is common for institutions to be transformed and sold, the Central Institute of Art in Los Angeles is transforming itself as a museum that will continue to redefine art through the collection, presentation, and research of contemporary art and art history from around the world,” said Paul Hirschhorn, who has helmed the institution in its role as a nonprofit partner of the Los Angeles County Museum of Art for thirty years.A scholar of twentieth-century American art and culture, Coyne most recently served as head of the Mill Avenue Armory, a contemporary art museum in the Tenderloin, and as a curator at the Woodridge Art Institute. He was previously assistant curator at the Museum of Contemporary Art, Los Angeles; curator at the National Gallery", "The next Biennial should bring the next generation of artists together to create a discussion of the works that are at the core of the exhibition's mission, the exhibition, and its future.” The 2018 edition, “The Anatomy of Movements,” was staged at the Museum of Modern Art in New York.\n\n\nThe Metropolitan Museum of Art in New York has appointed Kathleen McClellan as the new deputy director of its Center for Contemporary Art, the Institute for Contemporary Art, and the Art of Visual Arts (ICA). She will be responsible for the development of the central collection and the development of the institute’s collection of work on paper and digital media.“Kathleen’s appointment represents an exciting time for the Museum of Modern Art and ICA, and reflects the work and passion of the entire staff,” said director Daniel H. Weiss. “Her expertise and creative energy complements the museum’s mission to present the most extraordinary works to the public, and we look forward to her leadership and guiding role in shaping the future of ICA.”McClellan will assume her responsibilities on January 10, 2020. She succeeds Susan O. Pérez, who retired last year after more than", "The next Biennial should take place in 2022. Namdi, who was appointed as the new director of the Biennial by the government on August 11, said he hoped to open the exhibition in 2020. Last month, the government-appointed panel consisting of Pablo Hernández, head of the Department of Culture and Sports, and Dario Catellani, secretary of the Provincial Collection of Art and Artifacts of the October Revolution, iced the opening of the exhibition to coincide with the 150th anniversary of the October Revolution.The government’s plan to launch a new exhibition was made while the construction of the new headquarters for the Museum of Modern Art in Rome, and the renovation of the former Cremonese house on the Palazzo Nazionale di Rivoli, the Palazzo delle Papesse, in Venice, was under way. The exhibition would also be staged concurrently with the hundredth anniversary of the foundation of the Italian State in 2021.\n\n\nThe Museum of Fine Arts (MFA) officials announced today that the museum’s collection is currently undergoing a major expansion, which will increase the museum’s exhibition-viewing capacity by 80 percent. The $40 million project", "The next Biennial should take place in June of 2021 at the Museo de Arte Contemporáneo Brasil, and the next should be held in December 2021 at the National Museum of the History of Women. \n\n\nThe School of the Art Institute of Chicago (SAIC) announced today that it is planning to end its relationship with the cultural arts organization the Museum of Contemporary Art (MoCA), which has a museum’s endowment of $135 billion. In a statement, the institute said that it hopes the move will “protect and promote the museum’s mission of organizing and presenting art and will bring opportunities for SAIC faculty to collaborate with MoCA’s artists and other museums.”The museum is currently working on a $140 million renovation to the building it occupies on the northeast corner of State Street and Clark Street in Chicago. The project is part of the city’s $1.2 trillion redevelopment plan for the South Loop, which also includes the construction of a new public park, the renovation of the existing building, and the addition of 5,800 square feet of gallery space. The work is expected to be completed by 2021 and will be unveiled in the spring of 2022.“The", "The next Biennial should be held in the spring of 2021. The 2018 event was hosted by the Museum in the Arts in partnership with the artists and was organized in collaboration with the Los Angeles County Museum of Art (LACMA). In addition to the five-day event, the biennial will include a lecture series, an exhibition of works that explore the conceptual and physical foundations of art, and a symposium. The 2019 edition of the Biennial featured works by sixty artists, including Tomaséa Nistor-Ramos, Kate Phillips, and Tanya and Hanna Nussbaum, and will be held at the Los Angeles County Museum of Art (LACMA).\n\n\nThe Museum of Contemporary Art (MoCA), California, has released an updated list of over thirty artists who will participate in the 2020 edition of the Los Angeles Biennial, called “Los Angeles Vision 2020: A Year of Creativity and Play.” The exhibition will take place at the Museum of Contemporary Art (MoCA), from March 7–March 8, 2020.“We saw an opportunity to create an event that would bring together more than sixty artists from Los Angeles County,” said M.A. Anderson, director of MoCA. �", "The next Biennial should commence in 2020 and will last for twelve weeks, with a break during the second half of the year. We look forward to the future with you.\n\n\nThe Museum of Art in New York has recalled more than one hundred employees after a fire at its building in the leafy Chelsea neighborhood of the city on Monday. The museum, which is undergoing a $7 million expansion, reported that the fire was extinguished by the time it was put out by the New York City Fire Department (NYCFCD). The New York Times reports that the building, which is undergoing a $500 million renovation, was not designed to house a fifth-floor exhibition space that has served as the museum’s main space for more than a century.The fifth-floor space, which was formerly occupied by a large-scale public sculpture garden designed by the architect HOK, was converted into a reception space for a group of artists who were working on a project for the Brooklyn-based nonprofit MOS Architects, which was founded by Jonathan and Yoko Menino. The artists, including Mark di Suvero, Max Hetzler, and Isaac Chinn, created the piece, a massive, 158-foot-tall likeness of the Italian explorer Christopher", "The next Biennial should take place in the spring of 2020. The 2020 event will be the first in the city of Rotterdam and will feature work by seven artists: Alexandre Neuvirth, Franz Nämlä, María Berrada, Piet van Tassel, and Matthias Klötters. The 2019 exhibition was organized by the Museum of Contemporary Art (MoCA) in New York, which had previously staged the exhibition every other year since 2010.\n\n\nThe Exhibition Place in New York City’s Central Park has received a major facelift, complete with a new glass-enclosed entrance that boasts a new contemporary sculpture by artist Korey Abraham, titled “I Want You Back,” which was created in collaboration with the Los Angeles-based nonprofit Art in Action. The installation is part of a series of thirteen works, all completed in the last twelve months, that were on display in the museum’s temporary exhibition space, the Space for Artists.The update to the exhibition space also includes the opening of the first promotion of a “direct-to-consumer” (DTC) model in the United States, a new collaborative film project, a new digital platform, and a new 2013", "The next Biennial should be held in 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than 1,300 works by five hundred contemporary artists whose works were recently acquired through a gift from the Los Angeles–based artist Mark Suggs.The institution also announced that Cameron Rowland, Rebekah Mercer, and Jana Tourne are among the artists whose works will soon be released under the new $26 billion Legacy Artists Program, which was created after the institution’s acquisition of the artist’s art in 2017. The program will host four exhibition shows a year, offering a wide array of workmaking opportunities for a special exhibition of work by twenty-nine artists in 2020.“This is a watershed moment for LACMA,” said Mark Selby, director and CEO of the museum. “Mark has been a champion of the artist-run model of contemporary art for over twenty years, and he has brought his vision and talent to bear to realize LACMA’s vision. He has created an environment ripe for expression and art, and for people to see and hear it. I’m thrilled to see what he has created here in the Los Angeles area", "The next Biennial should take place in Cardiff in the spring of 2020. The art center will hold the exhibition in several venues across Cardiff, including the Castle Museum, the National Museum of Wales, and the Natural History Museum. “The redevelopment of Cardiff City Hall is an incredibly exciting project, and one that will deliver significant benefits to the city and region,” said Margaret Greenwood, chair of the city council. “With the opening of Cardiff Art Week and the introduction of the new exhibition series, Cardiff Art Calendar, and the forthcoming Art of the Party, Cardiff Art Week will be a unique event that will deliver a fantastic array of exhibitions. The renovation of the city center will allow the festival to thrive in a more vibrant and inviting way, and will help us to become more visible and to become more familiar with the city. This will enable us, and the world, to see more of Cardiff and the Welsh Capital, and I am very much looking forward to the opening of Art Week in March 2020.” \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has announced that it is expanding the scope of its partnership with United States artist and activist Hope Solo. The two organizations will now collaborate on ‎“The Path,", "The next Biennial should focus on “the new politics of the body,” the organizers said, “which is the body politic in its essence.” Around fifty other artists also signed an open letter—comprising artists from Argentina, Brazil, Chile, Colombia, Mexico, Peru, and Venezuela—describing the Buenos Aires Art Biennial as “the last step of the process.” The letter concluded by noting that a new cultural center would be created in the city and explaining how the existing one, which is scheduled to open in 2020, might be reconfigured into a museum.\n\n\nThe National Geographic Society’s proposed $3.5 billion redesign of its headquarters in Washington, DC, has come under heightened scrutiny since it was announced in March. The redesign aims to better reflect the climate of the Smithsonian’s main building, which is currently undergoing a $650 million expansion and is scheduled to open in 2024, the same year as the Smithsonian’s 50th anniversary celebrations.The redesign involves the removal of the National Geographic Society’s headquarters from the National Mall, which has served as the site of the institution for 125 years, and reconfigured the building into a destination for visitors from all over the world.", "The next Biennial should be held in the city of Zürich in the city of Sittwe in the Sittwe-Sint-Nikos region of the country, in March 2020. The 2020 edition will be moderated by Tania Bruguera, the chair of the museum’s board of directors.\n\n\nThe British Library has released more than thirty thousand photos and films relating to the life and work of Sir Charles Darwin, the British naturalist and theorist whose theory of evolution was influential to decades of students. Included in the release are films created during his lifetime, as well as newly acquired works that were previously unavailable.“Darwin’s photographs, as well as his films, have drawn widely and intensely from the life-and-work of the great naturalist Charles Darwin, who was perhaps the most important photographer of the twentieth century,” said David Shiffman, director of the British Museum, and Elizabeth Anagnos, cofounder of the Museum of Modern Art. “It is truly extraordinary that other cultures and other places, other times and other cultures, had the opportunity to honor the legacy of one of its own.”The collection, which comprises more than ninety thousand", "The next Biennial should take place in 2021, while the institution is currently closed. “We are continuing to work to improve the Biennial experience for visitors to the museum, and have made some progress,” said museum director Sébastien Dezignes. “Unfortunately, the current situation requires us to make some difficult decisions. From October 2019 to March 2020, the Biennial has opened but has remained closed. The final five months of the year are a challenge for the staff.”The final event of the Biennial, “The Rome Biennale: The Art of Survival”--a retrospective of artworks by Emma Donati, Federico Cervoni, Francesco Totti, and Rineke Dijkstra--was originally scheduled for May 2019, but was rescheduled for June 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is in the process of revamping the twenty-third edition of the museum’s Art of the Party, which was canceled due to Covid-19. The redesign will include the establishment of a new platform dedicated to the museum’s collection that will provide a new stage for exhibitions, an expanded collection", "The next Biennial should be held in the autumn of 2019, with the first exhibition being staged at the institution in the spring of 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Michael Redgrave as its new deputy director of curatorial affairs and chief curator.Redgrave comes to the institution from the Metropolitan Museum of Art, where he currently serves as director of exhibitions and collections. During his tenure, Redgrave has worked on several collaborative projects with MoMA curators and has presented exhibitions at the museum. He will assume his responsibilities on February 9 and will work closely with curator Amanda Hess, who is departing to become curator of modern and contemporary art at the Kapp Foundation, to develop programming for the museum.“We are thrilled to welcome Michael to the team,” said Marc Glimcher, general director of the Met, and Jennifer Deitch, vice president of MoMA. “His extensive experience, his enthusiasm for the work of MoMA curators, and his proven ability to attract and connect audiences makes him the ideal person to lead the museum’s curatorial arm, and we look forward to developing new and exciting content through MoMA’s collection and exhibition program.”Redgrave previously", "The next Biennial should be held at the Museum of Contemporary Art (MCA), Houston, in February 2020.  The 20th edition of the exhibition will be held at the MCA in Columbus, Ohio, in April 2020, and the twenty-third will take place in Brooklyn, New York, in December 2020.  The twenty-first edition of the exhibition will be held at the Solomon R. Guggenheim Museum in New York, New York, in March 2021.The biennial’s director, Julia Halperin, said: “We are delighted by the contributions of such a distinguished group of artists and are eager to see how this exhibition will be received by their peers and the general public.”\n\n\nThe museum’s collection of more than 1,500 photographs and prints by renowned African American photographers Robert Irwin’s widow Ann, as well as his grandson Benjamin, has announced that they will no longer participate in the upcoming exhibition “Robert Irwin: Black and White” at the Los Angeles County Museum of Art (LACMA).The decision has been made in response to the “current climate of fear and hate directed at members of our community by our government and our corporate leaders. We", "The next Biennial should focus on “human rights and the environment” and “what it means to be a human being in the digital world.” The biennial will then present a “new narrative of human rights.”In a statement, the London-based museum said: “The Biennials were established to challenge a paradigm of science and technology in which people are viewed as a static, biological collection of parts. In this context, we hope that the reform of the world we live in and the narratives for the biennials will provoke new insights, new values, and new understanding.”The 2022 edition of the biennial—featuring a selection of forty works by thirty-six artists, including Frank Gehry, Michael Benoît-François Henze, Alex Katz, Yinka Shonibare, and Seung-Min Lee—premieres at the London Biennial Gallery on December 3. The fourteenth edition—featuring work by forty-seven artists—premieres at the Schirn Kunsthalle in Frankfurt on December 7.\n\n\nAfter the University of Missouri decided to cancel an exhibition centered on diversity and inclusion due to concerns around racism, disability,", "The next Biennial should be held in 2020, two years from now, and as such we do not yet have a specific date for its reopening. However, we will continue to work with all our stakeholders to find a solution that will effectively address these challenges. The following article is a continuation of a previous report on the sustainability of the Biennial that was published by the British Council in 2015.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Leila Alwani as its new deputy director of curatorial affairs and curator of modern and contemporary art. Alwani comes to the institution from the Getty, where she has served as director of curatorial affairs since 2014. The Getty has also recently celebrated the centennial of the Critical Art Project, an initiative launched by the Getty in 2011 to bring museums and cultural spaces together to discuss issues of contemporary art through a series of public conversations that emphasize the importance of community.“We’re excited to welcome Leila to MoCA,” said Peter Hujar, director and chief curator of the Getty. “We’re looking forward to working with her to advance MoCA’s mission of exploring the interconnections between art and design, and to", "The next Biennial should focus on the origins and shape of art, and not only its creation and display.” A committee comprising Art historian by rights laureate Robert Lippard, art historian by the age of thirty-eight and art historian by the age of fifty-six will investigate the question, with the goal of determining how to best utilize the growing collection of the Museum of Modern Art to further the museum’s mission. The exhibition will also include a selection of works that are housed at the Museum, which are currently on display in its Washington, DC, branch. “As we embark upon this new chapter, we are eager to explore more deeply the ideas and concepts at the center of our collection,” said Museum director Richard Armstrong. “We hope that this exhibition and the upcoming biennial will inspire a new appreciation and appreciation for the transformative power of art as a vehicle for social change.”\n\n\nThe Pulitzer Prize–winning artist Patricia Arquette was chosen last month by the Los Angeles County Museum of Art (LACMA) to receive the $23,000 MacArthur Doctorate in Creative Arts. Arquette is one of the major contemporary American artists to be recognized by", "The next Biennial should be held sometime between May and October 2021. The 2019 edition featured work by twenty-eight artists and was organized by the Universal Society of Art (USSA), which represents the interests of the contemporary art world. The biennial will take place at the San Francisco Museum of Modern Art (SFMoMA).\n\n\nThe Central Library of Art in Atlanta has appointed Jessica Herz-Bakargiev as the next executive director. “Jessica is a seasoned leader in our city’s art world who brings a wealth of experience and knowledge to the leadership of the Central Library of Art and is poised to strengthen our collection and fan community’s visibility at a time when art is becoming ever more important to our communities.”Brianne Nesbitt, the interim director of the Central Library, said: “I’ve been a fan of Jessica’s work since she presented her first design for our collection in 2003. She has been instrumental in helping to shape the collections and programs of Central Library, as well as in shaping the collection of Georgia Gwinnett, Jack Edwards, and Joe Bradley. Her achievements are recognized internationally for her innovative and thoughtful curating. I’m thrilled to welcome her", "The next Biennial should be held in 2021. \n\n\nAlexandre Bickel has announced that he is withdrawing from the upcoming edition of the Madinat AlUla (MAS), in central Medina, Saudi Arabia, due to the novel coronavirus. The French curator was asked to create a new work for this year’s exhibition, which will now be held at the museum in the United Arab Emirates, on the condition that it incorporate two of the curator’s most recent works, “Salon du calendrier” (2017) and “Riyadh: Between Two Cities” (2019), both of which were part of a three-month residency at the institution.“At this moment of global uncertainty\u0097shattering the global health community’s sense of security\u0097it is hard to accept that the exhibition will not include the work of the best artists in the world,” said Bickel. “The museums are under great pressure to present a robust show of the latest art and they are understandably still coping with the unexpected and the many unforeseen crises that beset the region during the coronavirus outbreak. The exhibition’s programming thus far has been focused on", "The next Biennial should take place at the Museo de Archiv de São Paulo, in the city of São Paulo, Brazil, between June 11 and June 13, 2020. The 2019 edition, which ran from March 20 to March 25, saw twenty-nine artists participate. The artists selected were:Jana Bara, Cristina Bara, Tania Bruguera, Manuel de Córdoba, Julia CÚŋmara, Laura Bradley, Léa Báez, Carlos Bocanegra, Lucio Cai, Dario Di Giusto, Carlo Di Tommaso, Andrea Di Stefanova, Jorge Duarte, Lisa Domínguez-Girón, Bianca Fernández, Marieke Glimcher, María Lourdes Fernández, Emma Laszlo and Javier Bonilla, Edmundo Bonatrão, Andrea Bocanegra, Pilar Carmona, Elvia Calderón, Andrea Cremston, Juan Carlos Cervetto,", "The next Biennial should take place between the years of September and October 2021 in the city of Almaty, Kazakhstan. In addition to the exhibition, the venue will host international meetups and seminars.The project was inspired by the current political climate and the ongoing civil war in Kazakhstan, which has displaced an estimated ten million people in the country. In a bid to address the conflict and the humanitarian crisis, the museum has commissioned the artist Kenneth Dubin to create a new work for the first exhibition, titled Autobiography.The exhibition will feature twenty-one works by ten artists but will only be able to showcase their work in the first exhibition. According to Artnet, the exhibition will also include interviews with two dozen artists and will run for twelve weeks. \n\n\nThe Chicago-based artist, who makes color abstractions by blowing up and reshaping canvases, was named the winner of this year’s Turner Prize. Previous finalists include Jason Clark, Yayoi Kusama, and Cindy Sherman. At the ceremony at the Barbican in London on Monday, the British Academy of Arts (BAA) announced its support of the award winners. Cheryl Hoberman, director of the BAA, said: “Jason Clark is a compelling artist", "The next Biennial should take place at the Opera House in London in 2022. The timeline for the next two Biennials is as follows: 2019: The project will be a biennial of new works by artists who have been selected by a jury comprising contemporary and avant-garde artists; 2019: The project will be a biennial of new works by artists who have been selected by a jury comprising contemporary and avant-garde artists; 2019: The project will be a biennial of new works by artists who have been selected by a jury comprising contemporary and avant-garde artists; 2019: The project will be a biennial of new works by artists whose work has been selected by a jury comprising contemporary and avant-garde artists; 2020: The project will be a biennial of new work by artists whose work has been selected by a jury comprising contemporary and avant-garde artists; 2020: The project will be a biennial of new work by artists whose work has been selected by a jury comprising contemporary and avant-garde artists; 2021: The project will be a biennial of new works by artists who have been selected by a jury", "The next Biennial should be held in the spring of 2022. \n\n\nThe Polish Ambassador to the United States, Jozef Piotrowski, and the first museum director in the country, Konrad Mazurek, have filed a lawsuit against the Trump administration, claiming that members of the administration’s cabinet and cabinet officials stole millions of dollars from the nation’s cultural institutions through subprime loans, financial speculation, and the manipulation of interest rates.The lawsuit, which was filed in a US district court in New York on Tuesday, alleges that the Trump administration has used subprime loans to prop up the Polish economy and that the subprime loans were made at extremely low rates. The lawsuit also alleges that the subprime loans were made at a time when the institutions were unable to pay back the loans because of low interest rates. The lawsuit asks for an order to divest the banks involved in the subprime loans from their positions in providing loans to the government, which the suit claims profits from the subprime loans.The loan sharks behind the subprime loans are currently being sued by the Department of Justice. The suit against them is one of several filed by politicians and other victims of subprime lending. The suit also alleges that the Trump administration failed", "The next Biennial should take place in 2022 and will be the last at the museum, which has been closed since January 12, 2019 due to Covid-19. The museum’s final performance of the year will be at the Smithsonian American Art Museum in January 2021. The board of trustees of the Museum of Fine Arts Atlanta, chaired by director and CEO Britt Robertson, approved the strategic plan on Wednesday.A biennial is a collection of works that is organized into a series of public engagements, usually in parks or public spaces that are organized around a theme. The theme for this year’s edition of the Atlanta Biennial was “In Defense of the Body.” Participating artists were: Mira Dancy, Theater of Resistance, 2020; Thee Alter, 1921; Philadelphia Media Lab, 2018; Paolo Fasano, 2019; arrivingay, 2019; and Kelsey Ross, 2019.The biennial will also include the first public exhibitions of work by non-Atlanta artists in more than twenty years, with shows curated by artists such as Scott Aukerman, 2019; Willem de Kooning, 2019; and LaToya Johnson, ", "The next Biennial should be held in Japan in 2020 and will be hosted by Tokyo Institute of Art, the Nishinori Museum, and the Asakura Museum.\n\n\nThe British Film Institute (BFI) in London announced today the status of its newly acquired collection of over 1,300 film prints, made by British cinema artists between 1915 and 1984, which were donated to the institution by Paul Gauguin and Henri Rousseau. The works will be digitized and displayed in the institution's new exhibition, “Cinema: The History of Film,” which will open on February 21.The donation was made in 2006 by British businessman Richard Parsons, who had purchased a number of prints by the pair from the BFI. Upon learning that they were about to become the first works by Gauguin and Rousseau to enter the Tate, Parsons commissioned Henri Rousseau’s work to the BFI as a thank-you gift. The exhibition, titled “Henri Rousseau and Henri Gauguin,” will also feature works by British painter Peter Newcomer, French sculptor Pierre Huyghe, and American photographer Joseph Weisz.Commenting on the donation, Tate director Maria Balshaw said:", "The next Biennial should focus on “Anarcho-Syndicalism”\u0097a term coined by Russian anarchist Mikhail Bakunin to describe a socialist society without a state and without a government. The 2020 edition will open on July 23 and run until September 27.\n\n\nNew York’s Metropolitan Museum of Art has ended its relationship with the anti-globalization group P.A.I.N., announcing that it will no longer cooperate with them in the future. The move came after the museum’s board of trustees voted to terminate their contract with the organization, which was set up in 2009 in an attempt to address concerns that the Metropolitan Museum of Art was not doing enough to combat racism and xenophobia.The decision was made after a board chair, Benjamin Sachs, a Manhattan–based Trump business executive and philanthropist, donated $10 million to the organization. In 2015, the year before the Met renewed the group’s contract, the board voted to end their relationship with them. The board reversed course after a New York Times report revealed that hundreds of artists and activists were being paid by P.A.I.N. to speak at exhibitions and other events at the museum.The board ended the association with P", "The next Biennial should aim to take a longer-term view to reflect on the current situation, and should be more about the discursive possibilities that are open to us in our current situation, rather than focusing on the past.”In a letter penned by de Kooning to mark the anniversary of the exhibition, the artist said: “I think it is very important to pay attention to the present and to the past, not only in art but also in our lives. A picture is not enough to tell us what is going on in the future; it must be able to capture the imagination of the imagination, a state which is one of the hallmarks of a good narrative. We must not forget that images are an integral part of the world, and that they are what make us human.”\n\n\nThe Metropolitan Museum of Art (the museum) has appointed Jonathan Weisz as its new senior curator of Asian art. He comes to the institution from the Museum of Modern Art in Japan, where he has served as the museum’s curator of Asian art since 2011. Weisz joins the Met from the Museum of Modern Art in New York, where he has served as the museum’s curator of Asian art since 2012", "The next Biennial should be held in August 2021. If the costs of staging the event exceed $1 million, the museum will consider whether to extend the deadline. “We are determined to use our considerable resources to make the 2018‐19 season an even greater success,” said Abraham Fox, chair and CEO of the board of trustees. “Despite our best efforts to ensure that the exhibition will be accessible by anyone, the exhibition has become a top priority for many people in China. It is our hope that this exhibition will help them understand the importance and future of the Chinese art world.”\n\n\nThe Baltimore Museum of Art (BMA) is planning to open an outpost in the city of Frederick, Maryland, in the fall. The museum will hold an inaugural exhibition, “Baltimore,” in the fall of 2020. The show will tell the story of the city’s African American heritage through a comprehensive survey of all three hundred years of art in the city.The new facility will be located in a former industrial site in the city’s historic North End and will be designed by the celebrated urban designer James M. Ross. The museum will be housed in a former B&M building and will be inaugurated by", "The next Biennial should take place in 2021, and the 2022 event should be held in 2023. According to the city, the 2020 event will have a capacity for 10,000 visitors and will be hosted by the Old Town of Birmingham. The 2022 iteration, which will be hosted by the National Museum of the History of Art in Washington, DC, will have a capacity for 12,000 guests and will be held in 2022.The full list of participating artists is as follows:A. A. Bech, Škoda Partizan, CroatiaCheimbrend, Belgrade, SerbiaUkarša, SerbiaPapelar, IcelandM-70, New York, New York, New YorkM-70: Painting, sculpture, installation, and installation, 1970–1974’sMaureen Albright, New York, New York, New YorkM-70: Painting, sculpture, installation, and installation, 1971–2013Masouda Kana, New Delhi, IndiaM-70: Painting, sculpture, installation, and installation,†1970–1976M-70: Painting, sculpture, installation, and installation,†1977–1976Maya Otis, New York, New York, New York", "The next Biennial should take place in the Seagram Building at the University of Washington in Seattle and in the Pacific Science Museum in San Francisco. Artists are now invited to submit their works in the form of a single item. The 2020 event will be held at the Smithsonian American Art Museum from February 17 to March 10, 2020. If the Organizer of the 2020 Biennial, Anne Blaus, is forced to cancel the exhibition, which was originally scheduled for March 13 to March 21, the institution will hold another exhibition that would follow in the fall. “The 2018 event is not a biennial, but an extension of the current exhibition,” said Blaus. “I’m looking forward to continuing to create and presenting work inspired by the Biennials and by the people of Kansas City, Missouri.”\n\n\nTehran-born, London-based artist Zahra Ismail is suing the National Gallery of Art in Washington, DC, accusing the institution of “constantly misappropriating her art and her own personal assets in an attempt to conceal and suppress her political views.” According to the Art Newspaper, the artist claims the institution failed to address aspects of her defamation lawsuit following a formal complaint", "The next Biennial should be on the German island of Spitsbergen in 2019, and the next should be in 2020. The next edition of the Frankfurt Biennale will be held in May 2020.  The biennial will also be expanded by three new sections in an attempt to make up for the lost season of December. The Süddeutsche Zeitung reports that the new space will be inaugurated by a presentation of a new triptych by German-born, New York–based artist Wolfgang von Steinhao (1905–1973). Steinhao’s work was selected for its exhibition “Telling Stories,” which aims to examine the relationship between the artist and the body. The show will be followed by a presentation of a selection of works by the artist that are currently on display in the museum.\n\n\nThe Hudson Institute (HIN), an arm of the Galleria Nazionale di Scienze (ANSCO), which is housed in a former dairy building on East Fourteenth Street in Manhattan, has been awarded a $10 million grant by the Rockefeller Foundation. The $9 million grant, which was made in recognition of its donors’ commitment to the arts and their ability to foster", "The next Biennial should be held at a venue of your choice, at your own pace, and at a minimum of five thousand people. We hope that you will join us in this endeavor and that, in doing so, you will come home with many new ideas for how we can re-create an era of sound and beauty.”\n\n\nThe National Galleries of Scotland has welcomed seven new artists to its roster, including a group of contemporary Indigenous artists who will collaborate with the National Poetry Book Centre (NPBC), in partnership with the National Art Gallery, to create a new online platform that will showcase the work of ten artists. The platform, called the National Book Project, will be hosted on the NPBC’s online repository and will be available to the public for free for a period of fifteen days.The commissioning team included Lynda Allen, Jasmine Andrew, and Iain MacGregor, who will work with the National Poetry Book Centre to create a book based on a selection of the work of the artists. The platform will feature new concepts such as pop culture, literature, music, sound, and design, and will be curated by the NPBC staff.“We are delighted to be able to welcome these artists", "The next Biennial should aim to create an international platform for the exhibitions and research projects of international quality and should incorporate the research and the exhibition of the exhibition as a whole. It should present exhibitions with great creativity and with a strong cultural identity. The final year should include a survey and a biennial design. The architectural plans for the two buildings in question are as follows: The exhibition space is located in the fourth floor of a building that was constructed in 1974 and that was re-built in 1998. It is the latest phase of the exhibition. The show will be housed in the same building’s basement, which was completed in 2000, and will be inaugurated by a presentation of the final works by each artist.\nThe Institute of Contemporary Arts (ICA) at the University of Cambridge has appointed Robert Cudd (1921–2011) as its new chair of the history of art. Cudd will assume his post in January 2020 and will assume his predecessor’s chair in February 2020. He succeeds Joi Ito, who has served in the role for ten years.During his tenure, Cudd helped the ICA to secure more than $5 million for the construction of new buildings at the venue. The new buildings will include", "The next Biennial should aim to be a platform for new thinking about how to affect change for the better. We are committed to rebuilding a more just, equitable world. We are committed to rethinking the relationship between art and politics. We are committed to exploring opportunities for cultural experimentation and experimentation with new ways of working. And, finally, we are committed to candidly and honestly discussing our work.”\n\n\n\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced that it is planning to move the final fifty-six works from its holdings to the University of Southern California (USC). The move will coincide with the opening of the museum’s new Arts and Cultures Lab, which will bring together fifty-six artists from seventeen countries and will showcase the works in a retrospective, “After the Blackout: Art in the Age of Black Power” at the museum in 2021.The museum’s board of trustees voted unanimously in favor of the relocation, which also includes the relocation of the collections from the institution’s current home on the southwest corner of 16th Street and California’s 90th Street, where they were stored for more than twenty years, to the USC art museum. “This", "The next Biennial should be held in 2020.A further announcement regarding the future of the festival will be made by the Museum of London until the end of the year.\n\n\nThe Catalan arts minister, Isabel Carmena, has announced that the twenty-fifth edition of the Barcelona Art Biennale—which was canceled due to the Covid-19 pandemic—will return to the city in 2022. The event will now take place in the southern province of San Sebastian, which has been devastated by the Covid-19 outbreak.The event will now take place at the historic Catalan Town of Santa Fe in the province of Cordoba. Carmena said: The decision to participate in the Biennale was made in the context of ​​encouraging and strengthening the cultural, creative, and social life of our city. In our opinion, the event represents a positive step for the region as a whole. Each of the participating galleries will be able to show their works to the public at the city of Barcelona. “It is a great honor to be able to be able to announce this in such a positive way, and I am confident that the city of Barcelona and the entire region of Catalonia will be remembered for this event for a long time", "The next Biennial should take place at the Museum of Contemporary Art, Miami Beach, in the fall of 2020. The exhibition will be a combination of performance, installation, and virtual reality.The exhibition will feature works by thirty-six artists, including Rita Alvarez, Mario Canfora, and Cesar Montañosa. The filmmakers behind the virtual reality installations—Larina Cervantes, Alex Silvestre, and Miguel Angel Hernandez—as well as artists who are currently working in VR include Hélio Oiticica, Gladys Pilotte, and Laura Wheeler.The biennial will be divided into two halves: the performance section and the runtime section. The virtual reality section will take place in a new, 8,000-square-foot pavilion, which will be divided into twelve studios. The biennial will be organized as follows:The biennial will be presented by the Fine Arts Museums, Miami Beach. “This is a historic year for the art world\u0097years of unprecedented growth, followed by years of stagnation\u0097and the future of art remains in jeopardy,” said Mark Mather, president and CEO of the Fine Arts Museums. “Rest assured that the artists working and collaborating in VR will", "The next Biennial should take place in 2022.\n\n\nTwo days after the mass killing at an Oregon wildlife refuge in which nine people were killed was held in self-inflicted horror on Saturday, President Donald Trump signed a bill giving local, state, and federal law enforcement agencies new authority to enforce federal immigration laws. The legislation—which is part of a larger package of measures designed to combat America's opioid epidemic, and which was passed on Tuesday—does away with the 287(g) program, which has made the federal government the nation’s principal enforcer of immigration laws, and replaces it with a more streamlined system that will prioritize border security and the enforcement of immigration laws over civil liberties.“The 287(g) program has been a complete disaster for our immigration enforcement agencies,” Kristen Bremer, director of the ACLU of Oregon, told the Hill. “This is a good thing, because it will give them much-needed flexibility to think more holistically about the kind of immigration enforcement we do, and how we work together with partners across the country.”Bremer said that the new system will prioritize deporting undocumented immigrants who are in the country’s interior and will prioritize detaining undocumented immigrants who are in the", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA), New York, has appointed Leslie Hayes as its next executive director. Hayes comes to the institution from the Metropolitan Museum of Art, where she has served as director of the arts and culture program for the past twelve years. She succeeds David K. Galloway, who retired in April 2019 after fourteen years at the helm of the museum.In a statement, the institution said: “We are grateful for Leslie’s leadership and confidence in the museum’s future. Leslie is a seasoned leader who has demonstrated an ability to bring together talented and committed staff to advance museum scholarship and our mission.”Galloway will continue to serve as director until the end of the fifty-eighth biennial, “Detail: Contemporary Art from the 1950s to the 1980s” at the Adirondacks in December 2021.\n\n\nThe institute, which was founded by architect Richard Foster in 1993 as a hub for public art, has announced that it will hold its next edition, “Center for Design,” at its newly renovated and expanded campus in the summer of 2021. The event will be hosted by David K. Galloway, the", "The next Biennial should focus on the political economy of migration, and the ways in which migration affects and enriches the local populations of these countries. The next edition of the Biennial will take place in New Delhi, in March 2021.  The 2020 event will be held at the Arabian Art Museum in Mecca, Saudi Arabia.\n\n\nThe Italian government approved a plan on Monday to provide more than $10 billion in assistance in the form of tax cuts and social safety nets to Italy’s three largest banks, Monte dei Paschi and Santander, which have been struggling since early March due to the coronavirus.The legislation, which also extends the limit of cash withdrawals by small businesses and individuals, was approved by Italy’s conservative parliament and will go into effect on April 9. The move is part of an attempt to stem the coronavirus outbreak and to secure financial support for Italian businesses and institutions in order to reduce the risk of a second wave of the outbreak, which has killed more than 10,000 people in the country.“We may be able to limit the spread of the coronavirus through social distancing, but we must do more,” said Florence mayor Dario Franceschini. “", "The next Biennial should be held in 2021. “The Biennial is a new and unique approach to exhibitions, which aims to create a new long-term vision of art history, to rethink and reimagine what art should be and will be,” said Armando Marcotti, artistic director of the Venice Biennale and chair of the Venice Design Congress. Commenting on the development of the exhibition, Marcotti said: “The Biennial identifies the possibilities of communicating art history through a radically different way of celebrating art history. It is a way of analysing art history through the lens of contemporary life. It is a way that demands a new vision of the museum’s role. It is a way of linking modern art with contemporary life, of creating a dialogue between art and life.”The fifty-first edition of the Venice Architecture Biennial, which will be held in 2021, will be hosted at the Museo del Parque de Arte Contemporáneo in Venice. The fair will begin with the programme of the 2014 edition at EAA Berlin, re-launched in partnership with the City of Berlin, on September 23.\n\n\nThe FIA World Endurance Championship, which features more than", "The next Biennial should be held in 2021, during the period of the sixty-third and thirtieth Olympiads, and will commission works by twenty-one international artists.The exhibition is part of the Italian program of the exhibition “Universitatei di Forma” (Instituti di Forma) and will be held at the Museo di Biennale. The seventy-second edition of the biennial, which was held in Rome in 2011, will be held in 2021.\n\n\nThe UES Group, the private museum holding the cultural heritage collection of the Galician artist and thinker Íñigo Rondina, has announced that it will invest $1.2 million in restoring the medieval silver-and-white chapel in the Palacio de San Pedrígia in the city of Barcelona, Spain, which was built in 1871 by the artist and artist-in-residence, Íñigo Rondina.“Rondina has organized a series of monumental chapel paintings and sculptures that are deeply rooted in the tradition of Catalan medievalism,” said UES Group director Antony Hudak. “They are a true sum of the work of Íñigo Rond", "The next Biennial should be held in 2020 and will feature work by forty artists.The upcoming edition will also include a number of revivals of the work of the South Asian artists whose works are currently on display. The exhibition will begin with a selection from the exhibition “The Book of Life” (2017) and will run through March 21, 2020. The second part of the show will feature works from the exhibition “The Last Days of India” (2015) and will run through March 23, 2020. The third part will be a “Lumia” retrospective of the work of Naveen J. Akbar, and will be held in October 2020. The fourth part will be a “Revisiting the Past: Art and Politics in South Asia” (2019), and will be held in December 2020.“Through the exhibition’s five-hundred-year history, we have demonstrated that art is a powerful force for social change in South Asia. It has helped establish a tradition of imprinting art on the lives of South Asian artists and have given them a sense of belonging,” said Rajeev Ganesan, director and CEO of the Biennial. “Together we will continue", "The next Biennial should take place at New York’s Metropolitan Museum of Art next March. The full list of participating artists is as follows: -Yoshitomo Miyamoto (Japan)\n\n-Nikolay Malkin (Russia)\n\n-Fred Samuelson (South Africa)\n\n-James Turrell (United States)\n\n\nMediaCity, a new service that connects large media organizations, including the Los Angeles County Museum of Art (LACMA), with participating museums, is launching a new platform. The service enables local communities to upload and share images, videos, and audio from participating art institutions for free.The platform was developed by MediaCity cofounder and CEO Brett Littman and Brooklyn-based architect Christian Huber. On the service, Huber wrote: “We are excited to be working with Artnet, which has been an important partner for MediaCity for years, and to help make this platform a reality in collaboration with our community.”The platform, which will initially focus on archiving images on mobile devices, will eventually allow users to upload and share images, videos, and audio from participating institutions for free. Users will have the option to pay $5 to $10 per month for the option to", "The next Biennial should be held in June 2021. The school will also stage the first-ever episode of the biennial. The exhibition will be curated by William Joyce, director of the Centre for Contemporary Art, London; Rocko Motsch, director of the Centre for Contemporary Art, London; and Joseph and Mary Jane Tucker, the trustees of the Centro de Cultura (CAD) in Miami, Florida.\n\n\n\n\n\nPace Gallery in New York has been gifted $10 million from the National Endowment for the Arts (NEA). The grant, which was announced last month, was made in recognition of its $3.9 million investment in the development of the arts and culture across the United States. The funds will also go towards preventing the loss of the artworks through the Covid-19 pandemic. Carlos Baldesen, director and CEO of Pace, said: We are thrilled that the NEA will partner with us to help us think about how to use the funds to engage the broader community through the arts. We are prepared to do more to support the arts and to be a stronger community partner as we work to mitigate the impact of the Covid-19 pandemic", "The next Biennial should be held at the Museum of Contemporary Art (MoCA), Los Angeles, in September 2020.\n\n\nMMOs have been hard at work creating new types of virtual worlds in order to circumvent the current economic crisis. The pace of virtual creation has been accelerated in recent years as the technology has advanced. In order to create a virtual version of the same thing in a different location, or to allow an entirely different experience of the same thing, virtual artists have created virtual worlds that embrace the ethical and social concerns of the contemporary world.The Arts Council has released its 2020 list of the most important avant-gardes. The list this year includes the work of forty-three artists. Among the works on display are the first exhibitions at the Museum of Modern Art in New York since 2001, “Theater of Operations: The Gulf Wars 1991–2011” (2019) and “Art and the Syrian Civil War” (2019). Its director, Julien Boudin, called the list “becoming a part of a history of art.”Among the artists nominated for the 2020 prize are Wolfgang Pfeifer, Rachel Whiteread, Laura Owens, Tarek Atoui, and Ola and", "The next Biennial should take place at least once a year. “We believe in the exhibition, and in the museum’s commitment to the European Union, the Museum of Contemporary Art and the environment, and in our practice and our work, that all artists have a role in shaping, and shaping is the key,” said Berthold. The show, titled The Future Is Present, will run until September 23 and will be followed by a biennial exhibition of contemporary art in September 2021.\n\n\nThe editorial board of the New York Times has called for a review of Whitney’s senior management as part of an ethics investigation into the company’s purchase of a painting by George Amedorek in 2015 for $90,000. The controversy surrounding the $170,000 sale of the work, titled The Burden of Truth, led to the resignation of Whitney’s CEO, Daniel H. Weiss, and has recently reemerged after the work was acquired by the Selfridges Gallery in London in 2018.According to the New York Times, the painting is a prelude to a forthcoming exhibition at the Whitney titled The Atomic Eyes, which will open on September 10. The exhibition will be accompanied by a", "The next Biennial should be inaugurated by a presentation of the work of the first artist selected for the award: Nita Bara, of the Palestinian People’s Resistance, for her work Zidane, 1939–1945, a two-dimensional abstraction of a European Middle East. Bara was chosen for her work by committee chaired by the German curator Klaus Bock, who was also commissioned to create a work for the prestigious prize in 2019. The biennial will be held in Algiers from January 4 to January 7, 2020.\n\n\nThe Institute of Contemporary Arts (ICA) in New York has named Jules Gullette as its next chief curator. Gullette comes to the museum from the Metropolitan Museum of Art, where she has served as the director of curatorial affairs since 2015. She succeeds Johanna Buehler, who departed after a decade in the post in February 2019.“I am so excited to work with my colleagues and the amazing team at the ICA to build on the ICA’s reputation as one of the most respected and admired art museums in the country,” said Gullette. “I look forward to working with the ICA’s extraordinary and committed talented curators", "The next Biennial should be held at the National Museum in Athens in 2021, the Art Newspaper reports. The retrospective will locate in the city’s Viana Salon, will consist of forty works by forty-five artists and will attract an audience of around forty thousand people.The selection will be led by Rebekah Herbst, who curated the January exhibition “Beyond Sunshine.” Herbst will lead the presentation of works by the artists in the exhibition, which will run for fifteen weeks. A retrospective of the artist’s work, titled “Chronology” will be presented at the Art Institute of Chicago in 2021 and a new exhibition of works by the Berlin-based artist Fatosha Kirshner’s work, which was included in the exhibition, will open in 2021. The announcement follows a series of exhibitions that have been organised in Athens as part of the “Art of the Gathering.” A catalogue of work by the artist and her husband, Sergei, was presented at the Contemporary Art Museum Olympiastadion in Athens in May 2019 and the exhibition “Sander Albany” opened at the Art Gallery of New York in May 2019. The country also hosted the first edition", "The next Biennial should be a collaborative experience between artists, scientists, researchers, and the exhibition design and the other disciplines. This is a must for the future of the exhibition. We will not forget our mission of bringing art to the world and its people.”\n\n\nThe National Galleries of Scotland (NGH), which has been closed since March 11 due to Covid-19, announced today that it intends to reopen in early August. After a review of its operations and of any potential impact on exhibition visitors, the National Art Gallery Scotland (NGA) confirmed that the institution would remain open.The institution’s director, Paula Deans, said: “To the people of Scotland we say: we are fully and confidently returning to the north of England to present our new exhibition, The Woman in the White House, with great excitement. We hope that you will join us and share our excitement.” She added: “The show will be a celebration of the major themes of our time, including the importance of the female bodysuit in shaping and articulating cultural and political narratives, the erotic possibilities of new media, and the role of women in society.”The exhibition is being organized as part of N", "The next Biennial should be held within the next two years. It is hoped that the project will encourage other arts institutions in the Philippines to consider taking up the theme and that the country’s artworld will benefit from the exhibition. \n\n\nWith the opening of the Biennales De Buenos Aires (BRA) and Buenos Aires Público (BRA), the Buenos Aires–based nonprofit Arts and artists from the Philippines are collaborating in the city of Buenos Aires to create new works.The initiative was sparked by the global health crisis caused by the novel coronavirus, which has infected more than 239,000 people in the Philippines, and aims to draw attention to issues that have not been addressed by government and local institutions. The BRA was organized as part of the city’s commitment to openness and collaboration with the city’s arts community. The initiative is part of a nationwide campaign launched by the city and government to encourage more Filipinos to engage with their cities, culture, and the arts. \n\nThe Contemporary Arts Center (CAC) in the capital of Belo Horizonte, the city’s only arts center, has appointed Oscar Albizu, who currently serves as the director of PRIMARY CENT", "The next Biennial should be held in 2019. Its work will be curated by Nolan Cameron and will feature works by forty-four artists, including Benoît Assou-Kara, Fanny Galland, Joseph Allen, Anita Gupta, Paul Gauguin, and Naguib Mahfouz.\n\n\nThe Berghain/AGAM group announced that its upcoming edition, “Berlin, Berlin,” will take place in the German city from December 17 to December 19, 2019. The event will be hosted by the Center for Contemporary Art (Deutsche Kunsthötungen) in Berlin. The lineup includes artists such as Ulla and Magnus N, Gert Brouwers, Yekaterina Chiba, and Sveinje-Krist, who will collaborate with artist Frank Vito Cornejo to create works based on images and sounds.“We are thrilled by the prospect of creating works of art based on images and sounds in Berlin,” said Berenice Berghain, cofounder of the collective. “In a city where many visual arts are still relatively early in the learning curve and where the contemporary is still in its infancy, this project with Vito Cornejo"]