["The next Biennial should take place in 2020 and will commemorate the twenty-fifth anniversary of the foundation of the institution, which is currently housed in a former ironworks in the city of Foshan in China, and will be hosted by the FOS Institute in Shanghai to coincide with the show.The exhibition will also include material from the FOS Institute’s collection that is currently on display in the museum’s exhibition “Reflections,” which was organized jointly by the FOS Institute and the FOS Museum of Art in New York. The exhibition will include work by more than one hundred artists from the FOS Institute’s collection.\n\n\nAn artist’s studio in the United Kingdom who was convicted of manslaughter for the death of her two-year-old daughter Superga in November 2015 has been ordered to stand trial for the crime. The toddler was born with a rare genetic disorder that causes her to have a protruding tongue and was taken to the Royal Free Hospital in London in May of 2015 after her parents lost their appeal against a manslaughter verdict. The couple were found guilty of manslaughter by a British Family Court jury after the toddler’s death was attributed to the same cause, but the judges ruled against appeal.", "The next Biennial should be in 2020 and will be hosted at the Museu de Arte de São Paulo, the Museu de Arte de Minas Gerais, and the Museu de Arte de Porto, in Rio de Janeiro. The first iteration of the exhibition was held at the Museu de Arte de Minas Gerais in 2008.\n\n\nThe Friends of the National Museum of Art in Tokyo has received a gift of fifty-nine works by contemporary artists, including eight by Kazuo Miyamoto, including a new exhibition, Kissing the New World, which will open on January 21, 2020, at the museum. The works were donated by Japanese collector and collector-designer Takeshi Nakamura, the founder and CEO of the eponymous Japanese art production company Nippon Columbia, and his wife, Miyona. The museum received the donation of twenty-seven works from the collection of Hiromi Ikeda, director of the Nakamura Museum of Art in Nagoya, which is scheduled to reopen in March 2020.Her husband created the collection in 1995, shortly after his father passed away and shortly after he was diagnosed with Hodgkin's disease, which left him with a bone marrow tumor. The tumor", "The next Biennial should be held in 2020, and the inaugural event will be staged at the BAM Building, a former cotton factory on the southern edge of Atlanta. The event will be hosted by the nonprofit Atlanta Arts and Artists (A.A.A.) and will take place at the BAM on November 18.About 350 artists, including Rob Ross, Hélio Oiticica, and Jordan Owen, will receive an additional $500,000 in support of their upcoming shows. The artists also will receive $200,000 for the exhibition on the history of health, beauty, and wellness. The upcoming biennial will include eight shows, including the inaugural edition—the event’s title, “The Body,” will be moved from the historic BAM to the Atlanta Museum of Art.\n\n\nThe Federation Art Museum Berlin (Feldbau) has received a donation of thirty works by thirty-four artists from the collections of the Museum of Modern Art (MoMA) and the Metropolitan Museum of Art in New York, including Daniel DeGiorgio, Michael John Henry, Michael O. Wilson, and Pia Camil. The works were donated by Beverly D. Marino, the daughter of collectors Jack and Beverly Schrader;", "The next Biennial should be held in 2020, and the first an exhibition organized by the Institute for Contemporary Art (ICA) in New York. Both the ICA and the Biennials are already working together with a view to the construction of a new venue in Seoul. The entire project could begin as early as 2020, and the pavilion would open in 2021.The Seoul Biennials will be organized in association with the Seoul Art Museum (SAM), the Seoul National University Museum (SNUM), and the Seoul Metropolitan Government Building (S.M.B.), as well as with the Seoul Metropolitan Museum of Art, the Seoul Metropolitan Museum of Art, and the National Museum of Modern Art. The first exhibition, “The World We Made: Contemporary Art in the 1960s” will feature over forty contemporary artworks by artists such as Richard Avedon, William Eggleston, Nell Dorr, V.S. Gaitonde, Wangechi Mutu, and Nara Takeda. The second show, “The Future is Present: Contemporary Art in the Twenty-first Century” will feature works by artists such as Ashraf Ismaili, Anish Kapoor, and Jumana Rangani", "The next Biennial should take place in August 2021.#\n\nThe international biennial, which has drawn more than four hundred artists from seventy-six countries, will be held at the Museo de Arte Contemporáneo Militar in Sao Paulo, Brazil, from March 19 to March 23, 2021. The first edition, which was organized by the Museo de Arte Contemporáneo and curated by Brazilian curator and curator of contemporary art, Fernando Cesar, was held in October 2017 and ran for twelve months. The second edition, which was hosted by the Museo de Arte Contemporáneo and curated by Cara Bruguera, was held in February 2018 and ran for eighteen months. The third edition, which was hosted by the Museum of Modern Art in New York, was held in March 2019 and ran for fourteen months.The twenty-fourth edition of the Aichi Triennale, which will be held in Tokyo in October 2021, will be held at the Tokyo Metropolitan Museum of Art, with the first edition curated by Kunihiko Nakayama. The exhibition will feature a “new synthesis of contemporary art from Japan’s Northern region,” and will feature works by", "The next Biennial should focus on the history of the installation, setting and circulation of the works. “The biennial is a participatory project, and the audience is the artists,” said Barbara Berlusconi, one of the organizers. “I’m sure that the next Triennale will be a very participatory event, but the work of the artist is the power of the performance.”Commenting on the theme, the Italian ambassador to Germany, Benjamin de Castro, said: “The new Biennale will be about the artist and the work of the artist. It will be about the relationship between artist and the audience and about the interaction between the artist and the audience.”\n\n\nItalian artist Stefano Cattelan has died at age ninety-six. Born in Milan in 1922, Cattelan is arguably the most celebrated contemporary artist of his generation. The celebrated painter and sculptor created his famous monotypes, which feature recurring and often grotesque compositions, and created more than fifty of his own works. In addition to painting and sculpture, Cattelan is known for his film and television work, his paintings, his installation installations, his performance, and his books.Born in Ast", "The next Biennial should take place in 2020.\n\n\nJosée Bonton, a French artist and theorist who produced a series of monumental paintings and sculptures that reflect an ongoing philosophical exploration of the role of art and art history in the development of the artist-historical in France between 1946 and 1960, has died at age eighty-five.Born in the city of Arles, France, in 1937, Bonton, a staunch atheist, grew up immersed in a Christian religious school in Arles. She later graduated from the École des Beaux-Arts in Paris, and in 1955, the same year she moved to the city to pursue a career in the arts. Her earliest work (1954) comprises a series of glass sculptures that are based on the idea of the ephemeral nature of clay and paint. In 1996, a retrospective of her work at the National Association of Fine Arts (NADA) in Antwerp showcased her work at the museum. Since then, the artist has exhibited her works at institutions as diverse as the Kunsthalle Basel in Switzerland and the Stuttgart Biennale, as well as at the Museo de Arte Cubana in Havana.Bonton’s art practice", "The next Biennial should be held at the Museum of Contemporary Art (MoCA) in New York, the Los Angeles County Museum of Art, and the Brooklyn Museum.  The 2019 edition of the exhibition will be curated by the same three curators, Simon Callender, David Riff, and Deborah Sullenger, and will be held at the Museum of Contemporary Art, Atlanta.\n\n\nThe Greek artist, designer, and educator Panagiotis Pappas, who often used his body as a medium in his sculptures, has died in Athens.Born in the city of Eleaia, near the Peloponnese in central Greece, in 1924, Pappas studied at the University of Pecos and the Corinthian State Academy. He later joined the MKE Athens in 1944 and served in the army during the German invasion of northern Greece in 1944–45. Pappas became interested in sculpture as a child and had visions of space in his early work, which combines geometric shapes with textured materials, such as stone, wood, and fur. After attending the Polytechnic University of Athens, Pappas studied under the legendary sculptor Svanidakis and studied with the sculptor Felix Baumgarten, who", "The next Biennial should be held in 2020.\n\n\nThe Art Newspaper has released the list of 20 emerging and established artists who will participate in this year’s Art Basel Hong Kong fair, which will take place at the Biennial’s domed, glass-walled venue in the city of Hong Kong from June 5 to June 8. The exhibition will also feature a mix of new and established artists, many of whom will be based in South Korea, Japan, Singapore, and China.The fifty-five-hundred-work exhibition will explore themes of resilience, migration, and climate change and will feature works by forty-one South Korean artists. The exhibition will also offer visitors the opportunity to experience the exhibition in person. Starting with Exploring the Past, (Space), 2015, and continuing with Exhibitions, 2016, and “We Live Together,” 2018, the Biennial will return with new works by the artists whose work is featured in the exhibition. Participating artists are Rita Bagwell, Beatriz Beltran, Dale Cunningham, Anouk Cai, Shuji Chang, Lianga Cai, Emikal", "The next Biennial should be held in 2020. “I see a lot of similarities between the project and the works of the artists who came before, and I’m very much looking forward to being able to present the work of these artists in the exhibition for the first time in 2020,” said Sasha Korody-Rab, director of the Biennial. With its recent acquisition of some 25,000 paintings by the Detroit-based artist Bridget Riley, the museum hopes to present a brand new collection, which is currently being curated by curator Larry Gagosian, who will soon take over leadership of the Biennial. The Biennial’s first exhibition, “From Paintings: American Art and the Struggle for Civil Rights” (2019), opened at the Museum of Fine Arts, Boston, and went on to receive a retrospective at the Museum of Modern Art in New York in 2001 and a special exhibition at the American Folk Art Museum in Philadelphia in 2011.The new exhibition will be inspired by the history of the Biennial, which was founded by a group of Detroit artists in 1964 and reorganized by Doris Duke, who died in 2016. The show will highlight the work of thirty-nine artists", "The next Biennial should be announced as early as next month, with the exhibition slated to open in November.\n\n\nArtnews reports that artists Naima J. Akram and Nari Ward have been named the next Annual Artists’ Conference. The biennial, which coincides with Art Basel Hong Kong, will be held from August 27 to August 29 in the Art Deco-inspired Exhibition Hall. The event will be held in partnership with the Asia Art Museum in Beijing. The announcement follows the announcement of the Shanghai Art Summit, which will take place August 29 to August 30 in the Art Deco Exhibition Hall; Art Dubai, which will take place from August 23 to August 30 in the Art Deco Exhibition Hall; and Art Shanghai, which will take place from August 27 to August 28 in the Art Deco Exhibition Hall.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York announced today that it has appointed David K. Galloway as its next director and chief curator. Galloway joined the institution in 2007 as associate curator of nineteenth-century American art. He has served as director of the Metropolitan Museum of Art since 2013 and is responsible for overseeing the museum’s collection management, curatorial program, and curatorial staff", "The next Biennial should be in the second half of 2020, which is currently scheduled to run from December 2019 to March 2020. Its inaugural edition, titled “Beyond Borders,” will be held at a location outside of London from March 19 to March 21. The 2019 edition featured work by around fifty artists and was held at the Venice Art Biennale in Italy.\n\n\nCarmen Call, the director of the Museum of Modern Art in New York, has announced that she plans to resign in May 2020. “After many years as a board member, I want to take a step that will allow me to focus fully on my future plans, and to begin planning for the future of the museum,” Call said in a statement. “The museum has been and will continue to be an important partner in the growth of art and culture in New York City, and I am deeply committed to continuing that work.”In a letter penned by Call to the director of the museum, Christine Campbell, in December 2015, she wrote: “I want to thank you for taking time to listen and to consider my proposal. . . . I am much happier as a board member than I have ever been as a public official.", "The next Biennial should be announced in March 2020.\n\n\nIf you're feeling overwhelmed by the sheer variety of artworks available in New York City, you might want to consider moving to the city from another state. According to Artnet, New York City Mayor Bill de Blasio announced on Friday that the city will begin accepting visitors from May 23 through May 26. The move follows the reopening of the city’s public art space the Museum of Modern Art (MoMA), which will inaugurate a new monument to the city’s art in the city next week.Museumgoers will be able to visit the city’s public art sites directly from May 23 through May 26. The first day visitors will be able to visit will be May 24. For the next five weeks, visitors will be allowed to visit the city’s public art sites twice daily. The museum will be closed until May 27.On Saturday, May 29, the city’s public art sites will be closed again. The same applies for museums and cultural institutions that were closed on May 22 and May 29, and last week, as the city co-sponsored the opening of the Brooklyn Museum of the Arts with the Brooklyn Navy Yard and benefited from a $", "The next Biennial should take place in 2020, but some of the questions that have been raised by museum directors are being addressed in a new exhibition that opened at the Museum of Modern Art in New York last month: The Struggle for the Soul of a Nation (TAPS, 2020). How do we care for those worlds that separate us from one another? How do we care for those things that feel as if they are woven from the very fabric of our being? This is an issue that has been raised repeatedly throughout the history of art, and one that I think the public is very much grappling with right now.”The questions confronting the twenty-third edition of the biennial—which will take place at the Museum of Modern Art, in the city’s Ferguson, Missouri; the Museum of Polish Art, in Warsaw; the Museum of Modern Art, New York; and the Museum of Modern Art, Los Angeles—are not new. In a 2018 Artforum essay, archaeologist and curator Robert Frank wrote: “[TAPS’ future as a cultural organization depends on grappling with these difficult and challenging questions. How do we care for the very worlds that separate us? How do we care for those things that seem as", "The next Biennial should aim to adapt an existing, limited-edition exhibition of modern art, with the objective of recording the most important moments of our lifetimes. “The biennial project will be an ongoing process of thinking about the museum as an institution capable of carrying out a new kind of collections research and a new kind of exhibitions,”   Leonid Razum, Director of the Museums of the State-funded Science and Technology City of Saint Petersburg, told the Art Newspaper. The next iteration of the show will focus on the collection of ancient objects, a project that was initiated by the State-funded Institute of History of the State’s Faculty of Arts and Sciences in Moscow.The institution will be renamed the State Museum of History of the Soviet Union, and the highlight of the five-day event will be a group exhibition entitled “What is a Biennale?” featuring works by twenty-three artists, including Nadezhda Savchenko, Aleksandr Golub, Aleksandr Medvedenko, V.S. Gebre Meretchev, and Vasily Kandinsky.The five-day event, which is free for the general public and will run from January 11 to January 13,", "The next Biennial should be held in the spring of 2021.\n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) in Philadelphia has received a gift of twenty-five works by nine late American sculptors, including Frank Gehry, Mark Diels, and Robert Irwin, from the estate of the late Richard and Marie Irwin. The gift includes sculptures by the late artist Robert Irwin and features works by artists such as Mary McKee, Leigh King, and Marie Lonn.“These works will bring PAFA’s collection to a new level of artistic excellence,” said director Timothy Green. “The museum is expecting to present new works in the coming months. PAFA is grateful to the Irwin Family for providing this opportunity and remains committed to supporting the work of these great artists.”The gift was made in honor of the late artist’s lifelong dedication to creating works that underscore the vital ideas of freedom and experimentation, respectively, and deliver the artist’s enduring legacy. The works were acquired through the Deborah and Richard Irwin Art Award in honor of the artist’s lifetime achievement.The award was established in 2016 to honor the late artist’s achievements. Deborah Irwin, the mother of the late artist and philanthrop", "The next Biennial should take place in the spring of 2021. If all goes as planned, the exhibition will be inaugurated by a group exhibition of photographs by the late artist Mungo Mirpuri, which will be followed by an exhibition of work on paper by the artist himself, as well as a lecture by Tito Pujaba, the director of the Museo de Arte Contemporáneo Brasileiros in São Paulo. The inaugural exhibition will be followed by a second edition, The Natural History of Pop, in 2020, and a third edition, The Natural History of Photography, in 2021. \n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of 250 works from the private collection of Catherine Balladur, a purchaser who was one of the first collectors in the United States to own a work by Pablo Picasso. The works, which are more than three hundred years old, were donated to the institution by her daughter, Bernadette Balladur, after she was diagnosed with breast cancer in 2017. The purchase, which took place in the spring of 1973, represents the first time the Italian master was given a work by an American collector. The donation also represents the", "The next Biennial should take place in 2020.\n\n\nHundreds of students and academics have gone on strike to protest the closure of the Paris Art Week, which was scheduled to run from March 13 to March 15 and be held at locations including Saint-Denis, the Louvre, and the Centre Pompidou.The strike, which began on Monday, March 12, and runs through March 16, is centered on the theme “Art and the Strike: Student Protests Involving Students and Academics,” a reference to the March 15 strike in France, and protests the decision to close the events due to a lack of funds. “We, the students, strike, strike,” reads a statement by the students. “We are not going to stand idly by and let the strike be recognized as a form of respect for our beliefs. We are going to fight for our rights and for the general strike. The strike will be a strike for respect and dignity.”The students’ decision to strike comes on the heels of weeks of unrest in France over the misuse of the national industrial strike. On March 9, thousands of striking lecturers marched through the capital, Paris, to the Louvre, the Centre", "The next Biennial should take place in 2019 and will remain shuttered for a minimum of four weeks. The Board of Directors has appointed Paris’s LACMA Gallery (La Cinéma) as the first exhibition sponsor of the event. The second event will be at the SITE in the city of São Paulo, Brazil, in 2020, and the third will be at the Museu de Arte Moderna in Madrid in 2022, with the exhibition marking the fifth anniversary of the event.The fourteen artists who have received the honor of the Guarani’s Lifetime Achievement Award are: Alberto Pedrosa (Brazil), Alfredo Asensio (Brazil), Alberto Miro (Brazil), Antonin Artola (Brazil), Vincent van Gogh (Germany), Ben-Michaelson (France), Niklas Wunderschütz (Germany), Lauren Wintour (France), Kaden Kwame (South Africa), Gabriel Morley (Australia), Angela Pilkington (Australia), and Claudia Lopes (Brazil), who are all represented by LACMA.\n\n\nThe Arts Council in London announced today", "The next Biennial should be held in 2022.\n\n\nThe A.A.F., a professional arts organization based in New York City, will hold its next awards ceremony in the spring of 2021. Established in 1966, the organization has awarded $3 billion to over 100 artists since it began in 1994.The organization’s 2019 edition, titled “The Unseen,” featured artists such as Maya Lin, Nari Ward, and Vito Acconci. It was moved to its current home at seven Broad, a public space in Chelsea, several blocks from the Metropolitan Museum of Art, in 2018. Its 2020 edition, titled “The Creatives,” will take place at the NYU Abu Dhabi campus in the spring.The organization is also preparing to launch a new scholarship program, called “The Artist Chase,” which will engage with a select group of the most highly-regarded contemporary artists, and will work with a select group of institutions to develop a new public art in Abu Dhabi. The program will be based at the A.A.F.’s new headquarters in a shopping mall outside of the city. The center will organize public programming such as lectures, performances, book signings, and other events", "The next Biennial should be held in 2020.\n\n\nThe Open Foundation, a New York–based nonprofit founded by Anne-Marie and Mary-Scott Fleischman in 2001, has received a $25 million donation from the Sacklers. The organization will now use the funds to create a new major gift for arts and cultural institutions in the city.The donation was made in recognition of the larger philanthropic vision of the Fleischmans and the organization’s founder, Mary Scott Fleischman; the organization’s founder, Anne-Marie and Paul Scott; and the city of New York, which was founded by Mary Scott Fleischman. The gift will also mark the first time the Sacklers donated to a major museum in New York.“We are thrilled to receive the support of the Sacklers,” Anne-Marie Fleischman said. “The gift will enable the Open Foundation to continue to grow and thrive as a vital partner to local, state, and federal policymakers, including our city’s mayor Bill de Blasio, who has been a champion of the arts and culture for more than two decades. We look forward to working with him and the mayor on many important initiatives and to engaging with the community in our new", "The next Biennial should be announced in the second quarter of 2020. \n\n\nDaisuke Yamanaka, who has served as curator of the Daido Museum of Art in Nagoya, Japan, since 2007, has announced his resignation. He was asked to step down from the museum in March of this year and announced his decision to leave the institution by phone on June 28.“Yamanaka has devoted his professional life to the exhibition of Japanese art,” Douglas and Barbara Throckmorton, who cofounded the museum in 1983, said in a joint statement. “By following his own career path, Yamanaka has shown that the art world and the art world as we know it can die. He has never once been asked to step down but has instead demonstrated the power of art in the most rigorous and challenging ways.” The announcement of his departure follows the completion of the thirty-five-year-long exhibition “Oddities in Nature: Japanese Art in the 1980s” (2015–2019), which opened in March and ran through March 2019. The show also featured more than 100 works by twenty-six Japanese artists, including Miki Igarashi, Kenichiro Takashi, Masao", "The next Biennial should take place in 2021. Its theme, “Energy and Identity,” will be a “point of departure for the new work.” The artist, who is also a cofounder of the contemporary art center Neue Showalter-Schnabel, will serve as a mentor for the biennial’s artists, while Jacob Schenkman, Songz-Han Shan, and Leonor Growden will represent Germany.\n\n\nThe Museum of Contemporary Art (MoCA), London—whose longtime president and CEO Michael Franzoni resigned in February after he led the institution for more than four decades—has received a $1 million donation from the Rockefeller Brothers Fund. The gift, which came amid the ongoing investigation into the museum’s finances, coincides with the launch of a campaign to raise $1 billion for the institution. “MoCA has been at the forefront of bringing together the arts and communities of Greater London, and it has always maintained an unwavering commitment to supporting artists and their projects,” said David Rockefeller, chairman of the family. “We are delighted that the Rockefeller Brothers Fund has decided to support its work in this way and that it has wisely chosen to give to MoCA", "The next Biennial should take place in November 2020, and the twenty-second in December. The museum will also hold a biennial for performance art in March 2021. The 2019 edition of the exhibition was held in January at the Malmö Art Museum, Sweden, and the show opened to the public in February. The 2020 edition will be staged at the Museum of Modern Art, and will be directed by the artist Hans-Ulrich Obrist.\n\n\nThe Sargent’s Daughters, a group of artists and collectors that includes Cecilia Wolf, Emma Wolf, and Yoko Ono, are suing the British Museum in an attempt to acquire the remains of four canvases from the twentieth-century American artist Gustav Klimt. The lawsuit, filed in the British High Court on Tuesday, claims the museum failed to act in a timely fashion to secure the artworks’ disposition through a buy-sell agreement. “The defendants made no representations to the plaintiffs about the proposed acquisition of the works, which were sold by the defendants for an undisclosed sum in 2018, and therefore they failed to take adequate account of the provenance and provenance value of the works when they sold them to the museum,” the lawyers wrote.The", "The next Biennial should be held in the summer of 2021. The exhibition will include a selection of works in the ongoing exhibition “Geldseilung 2001: Biennale 1.1: The Contemporary.”The series was founded in 2007 by Wolfgang Althau, who created the first show at the museum in 2009, 1.1. In 2012, the museum expanded the project to include another show in 2019\u0097The Undaunted Seagulls. The exhibition will also present works from the collection of Walter de Gruijn in 2018\u0097The View from the Chair.\n\n\nThe Baltimore Museum of Art (BMA) is struggling to hold onto its position as the country’s top arts destination following the sudden closure of the venerable Charles Ewen Gallery (CGH) following an explosion in the works of the late artist and activist Rayyane Zainabiyani. The BMA, which has long held the rank of the nation’s third-largest arts complex, announced on Wednesday that it is planning to lay off 240 staffers\u0097approximately eighty per cent of its staff\u0097and expects to be unable to operate fully again until late summer at the earliest.The BMA’s management team cited", "The next Biennial should take place at the National Gallery in London, the National Theatre in London, and the Royal Opera House in London in 2021; the National Museum of Scotland will hold a new exhibition in 2022; and the Tate will present a new exhibition in 2020.  The 2020 edition of the Art Basel Hong Kong fair, which was canceled due to the ongoing protests, was supposed to run from March 8 to March 13. However, due to the ongoing protests, the fair was canceled and the fourteen other editions of the event were canceled as well.Since the protests have been ongoing for months, several experts have said that the best way forward for was already in place. The move to cancel the annual fair would have been a part of the restructuring of the company. However, as tensions escalated further, the company decided to increase the number of its employees by forty-four by hiring thirty-nine additional workers in February.According to the Art Newspaper, the reshuffling of the staff was complicated by the fact that the world championship of the American painter John Cage will take place at the National Gallery in London next month. Cage’s publicist said that the move to the National Gallery is in line with a decision made by the company to", "The next Biennial should take place in the summer of 2022. The new exhibition will be themed “Force of Nature” and will feature work by the artist-run collective Planaland, the Dusseldorf-based group Trans-Africa and the artist-run distribu tion Rock aMinus. “The show will establish a new, collaborative framework for showcasing the work of local, international and international-based artists in the country,” Jakob von Mannheim, the cofounder of Rock aMinus, said.The Biennial will also receive a new $180,000 prize for originality, and will inaugurate a new prize that will honor the creative and cultural achievements of Afisha, a new group of Afrikan artists that is dedicated to the promotion of Afrikaan art and culture. The inaugural ceremony will take place on November 19 at the historic Stedelijk Museum in Amsterdam. The inaugural prize jury, comprising Arthur Broom of the Kiel Institute for Contemporary Arts, and Robin Rosenheim of the Kiel Museum of Art, concluded their work in a statement that stated the prize winners “will reinforce each other’s living work in creating a space for the assembly of", "The next Biennial should take place in January 2021. The 2020 venue is the American Folk Art Museum, which has yet to announce any plans for the event.\n\n\nThe Museum of Science and Art in New York has acquired the forty-third edition of the Saar-Punch, a Berlin-based art fair that will be held in the city in the spring of 2022. The exhibition will be co-organized by the Berlin-based gallery Gaussischer Kunstverein Berlin and the German curator Rein-Jan Pfeifer. “The Saar-Punch’s fourth edition will bring together twenty-four works by three outstanding artists: Jochen Haus, Salah El-Khoury, and Hildegarde Sagn,” said Museum director Adam D. Weinberg. “Together they form a new kind of platform for thinking about artists as a whole and about the role of the contemporary art museum.”On the new exhibition, Weinberg said: “The Saar-Punch’s fourth edition will use contemporary art museums as a starting point for the exploration of new topics and will give you the chance to participate as an observer. The third edition was a success; we", "The next Biennial should focus on the history of art in the state, the results of contemporary research, the strengthening of the local arts community, and the establishment of an endowment and an endowment fund for the City of Birmingham. “The City of Birmingham is a symbol of American creativity, perseverance, and dedication,” mayor Haig said in a statement. “The Museum of Contemporary Art Birmingham is the perfect example of how a city can thrive alongside its arts and its people. The City of Birmingham has always been a model for the nation as it has provided a home for more than fifty thousand works of art. It has become one of the most important cultural hubs in America, and it continues to attract and organize visitors and art lovers. The next iteration of the Museum of Contemporary Art Birmingham will enhance and expand upon the work of the last and present museum directors, Doris and Beverly Feather, and will showcase the work of artists and scholars across the city as well as the work of the museum’s most distinguished curators, Robert Irwin and Doris Neeson.”The Belle Art Museum is planning to open in the spring of 2021, and the Tate’s first permanent installation, a group show titled “The", "The next Biennial should also focus on “black life,” a theme that was central to Clinton’s work, which was staged in the 1970s at the High Museum of Art in Harlem. The institution is also working on a new exhibition, “Blackness and Postcolonialism” (2019), that will take up the theme of the biennial by presenting the work of fifty artists. The exhibition, which will be organized by the Bronx Museum of the Arts, is expected to open in 2021.\n\n\nThe University of Pennsylvania is offering to pay off the student loans of up to eighty students whose families are facing bankruptcy as a result of a devastating fire that broke out in the historic Philadelphia warehouse where thousands of artworks by Pablo Picasso and Henri Matisse are stored.The Philadelphia Inquirer reports that the institution expects to collect the debts by June 30, and will pay those students whose families can afford to pay off their loans—they only have a year left to live with the debt. The students will also be given copies of the artworks and will have their loans discharged in full.While the building, in a commercial district of Philadelphia, housed some of the world’s most valuable artworks—including works by", "The next Biennial should be held in the first half of the year. The next Art Biennial will be held at the end of March, and the biennial will be held in May.\n\n\nThree hundred and twenty-one artists attending the Fifty-Third Venice Biennale have released an open letter criticizing the organizers of the event, which will take place in May, for dividing the event into two halves. The letter reads: “I condemn the cancellation of our fair, for its exclusion of artists from the two halves of the event, and for its pre-emptive decision not to offer any programming in the first half of the event, thereby limiting the scope of the fair’s programming.”The artists who signed the letter are Antony Hudek, Mark Borthwick, Francesca Cerciello, Renata Fischer, Maria Giulia, Chiara Mantegazza, Wolfgang Rauch, and Stefano Sraffa. The open letter was published on Monday, February 27, by the artists and was signed by Lina Almata, Alberto Barba, Alice Black, Akiko Nakamura, Yasmina Soto, Annelie Simon, Ted Wheeler, and Abebe Altaye.", "The next Biennial should be in 2021. \n\nThe museum, which has been closed since March 15 because of Covid-19, has yet to make a decision on reopening but will hopefully be ready for the public to visit once it does.\n\n\nThe French art historian Gilles de la Roche, one of the founders of the new biennial, Anselm Kiefer, has announced that the upcoming Frist Art Biennial, which will be held in March 2021, will be a departure for the contemporary art institution.“In the last ten years, Frist has become an important platform for the development of new ideas, for engagement with the contemporary, for a new kind of learning, and for a new kind of experience,” de la Roche said. “The seventeenth edition is a new kind of exhibition, it is a new kind of event. It is a new kind of life for Frist.”The biennial will feature works by fifty-three artists, including Yael Segal, Sara J. Russell, Alex Da Corte, and Natalie C. Evans. Its inaugural edition, “Anselm Kiefer: Making Bones�", "The next Biennial should take place in 2021, the same year the exhibition will be staged by the National Museum of Art in Athens. \n\n\nThe Arts Ministry has released the list of eighty-one artists who will participate in next year’s biennial of the Arts in Athens, which will mark the thirteenth anniversary of the institution. Titled “Elements: The Course of an Everyday Life,” the exhibition will showcase the work of seventy-three contemporary artists and will be organized in a number of formats, including a documentary-style presentation, a performance, an installation, a classroom, and a digital experience. “The current exhibition is an attempt to redress the imbalance between artists and the cultural sector in the country,” said Mina Eltahawy, the minister of culture. “The biennial’s opening is a great opportunity to renew the regional and international priorities of the city of Athens, and to begin to measure the impact of the biennial. In fact, the Art of the Future exhibition is a great success, and the high number of entries for the exhibition is encouraging. I am happy to say that the ninety-nine percent of entries were preliminary, and that ninety", "The next Biennial should be held in December 2020. \n\n\nThe Egyptian Art Museum (EMAM) in Cairo has appointed Tala El-Shamy as its next director. She succeeds Tarek Akram, who served as director of the museum since 2018, and will begin her role in January 2021. El-Shamy will assume her post on November 29.“El-Shamy’s approach to the museum has not changed,” said Nabil El-Dahab, the director of the institution. “With her, we have a leader who will continuously invest in the museum’s long-term vision, its future exhibitions, and its programs, and who will carry out the museum’s cultural enrichment projects.” The institution also unveiled the design of a new exhibition celebrating the museum’s rich history, “We Are Egyptian: The Art of Egyptian Art,” which will be on view until January 23, 2021. The show will include an exhibition of work by thirty-five artists, including Ashraf Sarsam, Samia Saar, and Muhammet Chetty, among others who are still active in their respective fields, including As", "The next Biennial should include a selection of Ai Weiwei’s artworks from the first Biennial, “Detour to the West.” The institution will also focus on “Diana Alighier” (1933), a landmark exhibition cofounded by the Italian architect Gio Ponti. The work will be presented as part of the biennial’s “History of Modern Art” section. The show will include works by Andrea Bocelli, Monir Uloomi, Alighier, Beck, Bolzano, Bonaventure, Belén (1935), and Brown (1943).\n\n\nArt VanDusen, the Dutch-born, California-based artist who created work that explores the relationship between landscape and the body, has died at age eighty-eight.Born in the coastal city of Bochum in the province of Meerut in the Netherlands in 1928, VanDusen first studied sculpture at the University of Amsterdam in 1946. In 1951, at the latter institution’s request, he moved to the Netherlands, where he studied at the Kunsthalle Rotterdam in the summers of 1953 and 1956. His work was imported to the United States by his", "The next Biennial should be held in New York sometime in the spring of 2021. In the meantime, the 2018 exhibition “The Death of Modern Dinner,” which explored the death of dinner as an institution, will return to Rockefeller Center in New York from February 22 to March 7. Last year, the museum opened a new, larger exhibition that explored the history of photography, titled “The Photography of Hannah James,” in a new space on the museum grounds. The exhibition opened in January.Hancock Kline, the festival’s executive director, said: “We are thrilled to partner with the MCA to continue to present the 2018 exhibition, ‘The Death of Modern Dinner,” and continue to expand our digital program and to introduce new works by artists whose work we have never presented before. We are also looking forward to engaging with the local community and artists in our new institution, which is currently being designed by architect Herzog & de Meuron.”\n\n\nThe Whitney Museum of American Art in New York has appointed Jon Perticone as its new senior curator. He succeeds Anthony Crivello, who served as MCA’s chief curator and curator of American art from 2015 to", "The next Biennial should be held in 2021–18, with the announcement of the venue to be made in 2021. The three-day event will feature three exhibitions: “The City and the Planet” (2019), “Art and Ecology” (2018) and “The Human Body” (2017). There will also be a special exhibition of works by artists in the Künstler-Institut für Kunstbau, the Jugend-Institut für Kunstbau and the Kunstbau des Bundes. The five-day event will be staged at the V-Bauhaus in Berlin from January 16–January 18, 2021. The twenty-two-story museum, which was founded in 1932, will house approximately 3,000 works by forty-eight contemporary artists. Its first exhibition of the three-day event, “The Human Body” (2019), was curated by Susanne Vielmetter, who curated Artforum’s Art of Life, a biennial of works by artists such as Helen Frank, Simone Leigh, Myrtle Beach Andrews, and Glenn Ligon. The museum will also have two new locations in the city", "The next Biennial should be held in the spring of 2021. “This is an opportunity to set a long-term course for our museum, and for the city,” said Mayor Randall Woodfin. “I look forward to working with the team at the Museum of Contemporary Art to transform the Museum into an innovative, international destination.”  The project also involves the creation of a new platform for the exhibition “Museum of Contemporary Art: Architecture and Design” and the reopening of the Museum’s longtime elliptical-shaped building, which is currently undergoing a renovation. The platform will be inaugurated with an exhibition of work by the Los Angeles–based artist Charlotte A. Brown, whose work is on view in the exhibition’s inaugural season. The exhibition will then transition to a new building, which will be inaugurated with an exhibition of work by the Danish architect Sander Holm.The completion of the project, which was begun in 2005 and completed in 2016, marks the city’s first museum project since the renovation of the San Diego Museum of Art. The new museum will be inaugurated with a scene from the film The Princess Bride, the 1939 sequel in which Princess Diana marries a polygamous Roman", "The next Biennial should be held in 2020. \n\n\nThe maximum number of works permitted in the upcoming edition of the Berlin Biennale—the first in the city’s history—has been increased to three hundred. The announcement follows the reopening of the Nationalgalerie, which is currently undergoing a renovation. The Nationalgalerie, which will reopen in the autumn, will have a total of four hundred works on display.The biennial’s organizers have also announced that, beginning in 2020, they will open a new exhibition center in the city. The center will run a full-time staff of twenty and will bring together sixty-two artworks. The Biennale Berlin will be held in the city from September 25 to September 28, 2020 and will be supported by a total of 3.5 million euros.In a statement, the organizers said that they were “committed to working with all its partners, of whom there are many, to create a special platform for Berlin and its artists and designers.” They added: “It is an unprecedented event, one that we know will reshape the way in which we live and work. We have been working through various scenarios and scenarios are now experiencing that are even more", "The next Biennial should be held in 2021.\n\n\nFollowing the devastating fire that ripped through a Safeway in West Virginia on January 6, 2021, the company that owns the Safeway, Safeway Enterprises, and the City of West Virginia, announced today that it is dropping the word \"automation\" from its name. In a statement, the company said that it is rebranding itself as a “more inclusive, sustainable, and collaborative platform.” The change will also involve the introduction of a new position called “economics and innovation.”The announcement follows the announcement on January 8 that the company will be sold to British retail giant Sainsbury’s. The financial news followed the publication of “The Price of Everything,” a massive, four-hundred-page catalogue of everything Sainsbury’s sells, and the sudden departure of the company’s CEO, Patrick Gaspard. The catalogue, which is priced at $40,000, was organized in such a way as to lend itself to gifting and promoting. For instance, a photograph of a hooded figure holding a gun was included in the catalogue, and the catalogue included a detailed inventory of everything Sains", "The next Biennial should begin on August 29 and conclude with the exhibition of a new work by an artist selected by the audience of the first Biennial. The theme of the newly created Grand Prix de l'Art Treblinka is “The Struggle,” and the artist chosen for the project is Anja Gartenfeldt. Gartenfeldt’s work will be displayed in the exhibition “Titel: Biennale,” which will run until December 24. Among the pieces that will be on display in the show are a new early work by the German artist Jan and the first work of Ernst Stavög, which was shown in the exhibition “Titel,” at the Art Institute of Chicago in 2015. “This exhibition will also serve as a springboard to build the public’s awareness of the critical importance of art in the daily life of a city and region,” said Bode Dekker, president of the Bilderberger Bau.The event will take place in the basement of the museum and will run as a “grand tour.” The exhibition’s designer, Lenka Amukkal, said of the work:", "The next Biennial should be held at the Art Institute of Chicago in the autumn of 2020. \n\n\nThe Academy of Fine Arts (AFAM) in Vienna is preparing to reopen to the public in March 2021. Following a twenty-year renovation, the museum will boast a symposium, lecture series, and an exhibition hall. The first four months will be dedicated to public events and the last month to the collection. The reopening of the Academy will bring the total number of exhibitions and events at the museum to eleven, including the exhibition “Tit for Tat: Reflections on the Ephemeral Body” (2019–2019), “Reflections on the Present,” and “All That Is,” which will open in May 2020. The show will also host a number of performances and other activities.The newly renovated museum will be equipped with new galleries and areas for educational purposes, and will offer opportunities for the public to visit the collection. For the museum’s first exhibition, titled “Reflections on the Present” (2019), the collection will showcase work by fourteen artists, including George Antheus, Serra de Castro, Fadoza, Pilar da S.P.S, Ghe", "The next Biennial should be held at the Swiss Institute in Rome in 2019. The themes for the 2020 edition are 'The Uncertain Future of Art: Avant-Garde and the Modernism of Art, and ‘Architecture and Design in the Age of Mechanical Reproduction” The exhibition will be held in the Center for Contemporary Art (CACAM) in Rome, during the first half of the year, in the second half of the year, and in the third half of the year. The theme for the 2020 edition will be “Preliminary Remarks” in the December 2019 edition of the Venice Biennale.  \n\n\nThe Museum of Contemporary Art (MoCA) in Chicago announced today that it has received a gift from the family of James D. Lansdorp, the American painter and architect who made iconic and influential works that were often dismissed or misunderstood by critics. Based in New York, the Lansdorp Collection comprises six works, including Aerialism (1979), which is currently on display at the Museum of Contemporary Art, Chicago, and is one of the few works currently on loan to the institution.The gift of the artist’s works was made in honor of", "The next Biennial should be held in 2020.  Art historian and curator Hui-Yi Chen, who has represented China in the exhibition “Into the Mirror” in Chengdu for the past ten years, said: “I want to make sure that the next 20 years are dedicated to the study and exhibition of contemporary Chinese art.”Chen was referring to an exhibition organized by the Chinese state-run institution the Museum of Modern Art (MMA) in Beijing in 2020 to mark the twentieth anniversary of its founding. However, the exhibition, which was not connected to the Beijing Biennial, was canceled owing to the coronavirus and the museum has since postponed its opening.The cancellation of the show was not unexpected. China’s state-run media outlets initially reported that the decision to cancel the exhibition was made due to the coronavirus. However, the exhibition was scheduled to kick off on September 4 and was still on track to open on September 15.The ministry has since explained that the cancellation was made because of the “unprofessional and irresponsible behavior” of the PEN American Foundation, which participated in the event. “It is precisely this kind of behavior that primes the public for a political attack", "The next Biennial should include an ensemble of artists in collaboration with the city of Barcelona; as well as a selection of new works that have been selected by the city’s institutions, curated by the curators and selected by the city’s cultural institutions.The 7th edition of the Barcelona Art Biennial will take place in the city’s Evreja district from February 23 to February 26 and will highlight the work of sixty artists from twenty-eight countries. The theme for the exhibition is “Power,” a play on words and “choice.” The theme is a metaphor for how power is exploited and how the power of art can be a tool in resistance.The event will also feature exhibitions by forty artists in the city. There will be direct collaborations between the artists and cultural institutions, such as a virtual reality show by Carlos-Andrea Pérez Fernández. The show will present works by Cécile B. Agustín, Manuel César Navarro, Félix Mirabal, Ramón Ibarra, Jesús María Moreira, and Veronica Rodriguez-Villar.\n\n\nThe Museum of Modern Art in New York has appointed John Knight as its next", "The next Biennial should take place in Mumbai in 2021. \n\n\nThe Middleton Museum of Art in East Hampton, New York, has received a $10,000 donation from collectors Barbara and Robert Hutton. The gift includes ten works by the artist, including a work on paper and a painting on paper that were acquired through a long-term business partnership between the couple.They were among twenty-six works by the artist that will be part of the exhibition “HINT: Since the Fall, ” opening November 16, at the museum, which is located at 631 Sesame Street, in New York City. The exhibition is curated by Linda Green, director of the Hammer Museum of Art in Los Angeles; Barbara Hutton, co-owners of the Tate; and Robert Hutton, the founder of the family business Doyle’s Custom Furniture.The donation, which was made through Doyle’s parent company, Littler & Doyle, is the latest in a string of high-profile gifts that have come in the last several years from wealthy collectors. In 2019, a traveling exhibition of Houdini’s work was given to the Museum of Modern Art in New York in honor of", "The next Biennial should focus on the relationships between the modern and contemporary art worlds, in the organization of exhibitions and the production of public programs. Recognizing the challenges posed by the very large and the very complex, the next edition of the biennial will focus on integrating art and technology in urban life and specialising in the Americas. The programme will begin with a special exhibition at the Museo de Arte Contemporáneo in Bilbao, which will return to the Museo de Los Arte Contemporáneos in Madrid in January 2021. In the spring of 2022, the biennial will organize a show at the Museo de Arte Contemporáneo entitled “Museum of Modern Art.” The most recent edition of the Biennial was held at the Institut National des Arts et d’Arles (INAC) in Paris in March 2017. \n\n\n\n\n\nThe National Gallery of Art in Washington, DC, has banned an exhibition featuring work by the Czech artist Miroslav Kheter in its upcoming “Déjà Vu” exhibition. The exhibition, which was scheduled to open on August 29, was moved to October 10, and the", "The next Biennial should focus on the history of the artist-built houses, as these structures have been historically underutilized and have great cultural and historical significance. The museum should also consider how these sites will act as stepping stones for exploring the history of early urban life.The question of how to re-create the urban environment in the deceased artist’s favor has been raised in numerous writings and exhibitions, such as those organized by the Swiss masters Joachim Neugroschel and Klaus Bühler, the Berlin-based architect, and the late László Nemeth, the Hungarian writer, in the past decade. The architects have advocated for the creation of new urban spaces in the artist’s memory and have made several attempts to recreate the artist’s home, the Künstlerhaus in Budapest, through their architectural interventions. However, the current project for the museum in the former library of the Künstlerhaus, the Künstlerkampf, comprises two separate creations—one designed by the artist in the studio and another in the museum—and has faced numerous problems.The museum’s twenty-third edition, entitled “City in the Sky,” will take place in", "The next Biennial should take place in 2021. Art Basel was not immediately able to provide a comment on the matter, but has previously said that it is looking forward to the 2019 iteration.  The Architectural Biennial, which will be held at the Museu de Arte de São Paulo in September 2020, will take place in January 2021.  The 2020 edition of the exhibition will be hosted by the Museu de Arte de São Paulo (MAPP) and will be curated by the Brazil-based artist Edith Heathcote.  It will also be supported by the Museu do Povo, which serves as the organizing committee of the exhibition. In addition to the curation, ArtsCenter will host a number of activations that will include lectures and workshops by various artists, including Adriana Alves, Ariel Báez, Perrotin, and Leila de Sousa.The full list of participating artists is as follows:ArtsCenter Goldilagnia Los Angeles (CA)ArchitectureCenter Buenos Aires (AR)ArtsCenter Tokyo (Tokyo)Artists Group (New York)ArtsCenter Miami Beach (US)Artists Group (Miami)Artists Group", "The next Biennial should be held in the spring of 2023, said the museum. The bidding process was still ongoing over whether to launch the event in London, the United States, or elsewhere in the world. In the meantime, the museum will continue to display the work in its permanent collection, in addition to its new exhibition space, the International Center for Oriental Art (ICO), which opened in the exhibition area of the museum in 2017.\n\n\nOn Friday, a federal judge in New York temporarily blocked the construction of two controversial high-speed rail projects in the city, ruling that a city-subsidized loan from the New York Federal Transit Administration (NYC) can't proceed because of the Covid-19 pandemic. The court also ruled that the $3 billion Central Park Five Foundation, which had sued the city to block the construction of the $6.5 billion Prospect and Hudson Yards development projects, can continue with its plan to sue the city over eminent domain. The decision means that the construction of the Pearl and Manhattan Railway, a $6.5 billion subway system, and the Central Park Five Foundation, which had sued the city to stop the construction of a new park, will continue unabated. The", "The next Biennial should be held in 2022 and will be hosted at the Kunsthalle Basel. The concept is similar to that of the current edition, but this time around the theme will be Life and Media.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Mike Grazer, a curator of Chinese art and the founder of the Guggenheim Museum in New York, as its next director. Grazer will be responsible for developing and implementing an internationally recognized curriculum in the study of Chinese art and how it has impacted contemporary art.“Mike is a longtime scholar and educator and has been a trustee of the Guggenheim since 1983, when he became the museum’s founding institution director,” said museum chair Peter W. Barr. “He has the potential to broaden and deepen the Guggenheim’s ongoing program of scholarship and exhibition and to forge new connections between Art and China.”Grazer succeeds Carolyn Secord, who has served as the Guggenheim’s deputy director for the past three years. During her tenure, she was instrumental in the acquisition of more than 2,300 works and curated more than 50 shows, including “Delicate", "The next Biennial should take place in 2021. Architecture critic Andrew Cunningham of the Museum of Fine Arts, Los Angeles, said: “The show will be a landmark milestone in the history of contemporary art and will draw upon previously untapped multi-disciplinary expertise across the breadth of the classical, the contemporary, and the contemporary art.”Scott G. Delancey, president of the Association of Independent Colleges of Art and Design, added: “This year’s exhibition will celebrate the exhibitionist and showcase the work of women artists in a unique, contemporary world. It will be of extraordinary complexity to the art world, and allow us to diverge from the narrow and unfilmable disciplines of architecture, design, and sculpture.”\n\n\nThe Museum of Modern Art (MoMA), the Museum of Modern Art (MoMA) in New York, and the Whitney Museum of American Art in the United States have announced that they have reached an agreement that will see the collections relocated to the museums’ new home in Lower Manhattan. Since the construction of the new complex will involve removing nearly 1,500 artifacts from its historic space in midtown Manhattan and assembling them in a new building, the institutions will suspend their current programming and", "The next Biennial should be held in 2021. \n\n\nThe French artist Houellebecq has been disqualified from the Fifty-Ninth Venice Biennale for his work Red Sun, 1952, a monumental, twelve-thousand-work piece that depicts a French Resistance fighter in a U-boat-themed setting. The piece was inspired by the capture of Jean-Baptiste Leclerc, a U-boat commander, by the French Navy in December 1942. Originally selected by Jean-Marc Clouy, a critic for Artforum magazine, the piece was chosen by France’s Culture Ministry, which was charged with selecting the pavilion for the institution, and was awarded the prize at a ceremony held in a hangar above Paris’s Place de Réunion on Saturday. Clouy said: “The problem is that, from the very beginning, the work is a very serious provocation, a true provocation, an image of the U-boat, of a submarine, of a U-boat-type aircraft, a U-boat-type submarine with a U-boat engine, a submarine of the U-boat, a U-boat with several U-boats as passengers.”Clouy cited the work", "The next Biennial should take place in the spring of 2020. When it does, the first exhibition will be “The Female Body and Death.” The exhibition will explore the contribution of women to history and the way the body is reproduced in art, and will examine the very idea of death.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Jodi Throckmorton as its next director. Throckmorton comes to the museum from the Boston Children’s Museum (BCMB), where she previously served as director of planning and strategic initiatives. Previously, she was a senior curator at the Museum of Fine Arts in Boston.“We are thrilled to welcome her to the MFA and to her legacy,” said museum director Paul Mpagi Sepuya and director of public programs Melissa Johnson. “Her career trajectory reflects the museum’s commitment to engaging and challenging the \"hard-core\" museum-going public with the latest in art and artmaking. She will be instrumental in helping the museum integrate important exhibitions and programs into our community, while also ensuring the museum’s continued relevance and excellence in a changing art world.”Throckmorton’s new role will be", "The next Biennial should take place in 2021. It will also organize a lecture series at the Cambridge Arts Centre, which has a long-standing exhibition space dedicated to the work of American artists; and it will host a research symposium.\n\n\nThe Swarovski Prize, which is named after the Swiss artist, director, and curator Jari-Lynne Swarovski, has been awarded to Yamila Šikić, the acclaimed curator of the contemporary art festival FIMB, São Paulo, Brazil, for her exhibition “Saving the Future: Contemporary Art at the Swarovski Prize” (2016–17). In addition to presenting a survey of the 2018 exhibition, the show also offered a retrospective of the work of Eduardo Colombe, a contemporary artist and curator who has been featured in numerous biennial projects.Swarovski, who was found dead of a presumed heart attack in her studio in the city of Barra da Tijuca in the state of Minas Gerais, Brazil, on August 26, was one of the original seven members of the award jury and was awarded the prize for the fifteenth edition of the festival, which was staged at the Museum of Contemporary Art in New York in 2016.", "The next Biennial should celebrate the work of artists active in the 1960s, the 1980s, and the early ’70s. “We are grateful to President Naima J. Keith and the board of trustees for their vision in bringing this exhibition to Chicago in 2018,” said Benjamin.The biennial will be hosted by the Biennial Center and the Cultural Center of the City of Chicago in partnership with the artists whose works will be on display. There will be a residency program in partnership with the artists and a special presentation of works by selected artists from the biennial to mark the centennial.\n\n\nThe British artist Fritz Lang, who influenced many of the modernist painters he met, including Paul Gauguin, Henri Matisse, and Edvard Munch, has died at the age of ninety-five.Born in London in 1940, Lang studied at the South Bank Academy before he joined the Royal Academy of Arts in 1955, and at the Institute of Contemporary Arts (ICA). The pair continued to collaborate closely thereafter, with Lang appearing in a series of works for the 1975 exhibition “The Story of Art” at the Royal Academy of Arts. In 1979, the Museum of Modern Art (MoMA) in New York", "The next Biennial should be held at the O2 in London in 2021; the museum has appointed Gagosian as its art adviser.\n\n\nThe Solomon R. Guggenheim Museum in New York has received a gift of fifty-two works from the artist-in-residence, Kiki Smith. The gift includes a selection of his photographs, sculptures, paintings, prints, and collages, which are currently on display in “The Art of Photography” (2019).“This is an exceptional gift of the Guggenheim, which will be greatly missed,” said Smith, who died on April 27. “It is also a gift from a Californian, and a gift from a Californian of African descent, a gift that will help continue Kiki Smith’s legacy of creating art that speaks to us in new and powerful ways.”Smith, who was born in Los Angeles in 1941, began collecting works in the 1960s after discovering the work of fellow immigrant photographers Paul Mitrovica and Robert Frank in Hong Kong, where they had established the high-profile duo of Pangaea and Pangaea. Smith returned to the United States in the ’70s, settled in Orange County,", "The next Biennial should take place in 2021–22. The upcoming exhibition will include works by more than 100 artists in the United States and Europe.\n\n\nThe Metropolitan Museum of Art in New York has announced that it will be awarded $1.6 billion in aid this year, an increase of $1 billion from last year and an increase of $1 billion from the $829 million it received in 2016. The Met is currently undergoing a $1 billion renovation.“This year’s Met grant will go a long way toward maintaining our extraordinary museum’s balance of art and design, which is among the most important sets of contemporary art in the world,” said director Daniel H. Weiss. “We are confident that we will be able to present a great exhibition this fall, and we are excited to begin the 2020 season as we envision a future for the Met.”The Met, which began the year with a $1 billion budget and ended up with a surplus of $206 million, is already projecting a $1.7 billion surplus in 2021. The fund is for projects that will improve the museum’s operating budget, expand its collections, and improve the museum’s campus. The grant will also", "The next Biennial should take place at the new property housed within the former British Museum (BAM), in London in 2022. The project is being organized by the Smithsonian American Art Museum and is supported by a $43 million gift from philanthropist Alan Shell.The pair are attempting to return the half-finished museum to its former glory. The current plan is for the institution to reopen in 2024, but the restoration of the building remains a key goal. It is slated to host ten exhibitions a year, including the following: 2018:Socrates in the Wilderness: The History of Ancient Ideas; 2019: A History of the American Illusions; 2020: A Study in Modern Women’s Fashion; and 2021: An Exploration into the Philosophy of Leonardo da Vinci.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is planning on shutting down its three-story, twenty-four-hour wing, which opened in 1963 and has been closed since June 24, 2020, in order to complete a $450 million expansion that will add an additional twenty-four rooms to the museum.“The renovation of MoMA will transform the gallery into a dynamic exhibition space and will enable us to present the full range of", "The next Biennial should explore the role of the artist in relation to the transformation of the Indonesian landscape and its relationship to sound and ideas. ‘Sound,’ should be a central theme as we engage in a history-making project that will also draw on the future.”\n\n\nNew York’s Museum of Modern Art (MoMA) has unveiled its 2019 lineup, which features an exhibition that traces the history of American modernism, a retrospective that brings together the collections of the Metropolitan Museum of Art, the Whitney Museum of American Art, and the Juilliard School, and three new projects: “Time Capsule: American Art From the 1950s To The Present,” which will run in the fall of 2020, “The Modern Age: Art From the 1960s To The Present,” which will run in the spring of 2021, and “The Gallery, a Visual Art Museum,” which will open in the spring of 2022.The museum also announced its acquisition of eighteen works by thirty-eight artists, including George Ahearn, Herbert Bayer, Marianne Dietrich, Paul Gauguin, and Robert Irwin. In addition, the museum received six pieces from the Gale Group, including Øy", "The next Biennial should be a resounding success and will undoubtedly be the highlight of the next year at the Royal Academy of Arts. I am delighted that the gallery has chosen to continue making important and significant artworks in the UK’s public collection. I am also excited to welcome the new Reading Gallery, which is organized in partnership with Reading Citadel, to the collection. I have had the privilege of leading Reading Gallery for 15 years and am extremely proud of the work that I have done in strengthening the collection. The Royal Academy of Arts has managed to maintain its long-term collection of contemporary art in a remarkably sustainable way for almost two hundred years. The Royal Academy of Arts collection is highly valued by collectors around the world and by museums and collectors in the UK and is considered by most people to be one of the most important collections in the world. The collection is the subject of many exhibitions and is an important vehicle for the work of international artists. I am proud to be able to be part of this collection and to continue to support it by supporting biennials and exhibitions.\n\n\nThe £50 million, 192-year-old Institute of Contemporary Arts (ICA) in London has been gifted £50 million by Queen Elizabeth II to help", "The next Biennial should be held in 2020 and will feature a selection of works on paper by twenty-six artists. The exhibition will also re-configure the building in order to represent more diverse artistic communities. “The new exhibition will use the biennial as a platform to further engage with the museum’s holdings and to present the exhibitions that deepen our understanding of art history,” Birnbaum told the Art Newspaper. “The exhibition complex will also offer a new venue for the exhibition of work not previously shown.”\n\n\n\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has released the list of seventy-eight artists who will participate in its thirty-fifth edition, “Across the Universe: Artists in Negotiations,” which will be held at the museum in 2020. The event will mark the centenary of the Italian artist Emilio Andoni’s famous painting Cicada, which depicts an anthropomorphic, neon-lit, silver-white, Cervinia-style house surrounded by a neon-red sky and a neon-yellow neon-infused plant.The seventy-eight artists who will participate in the event are: Alex Calderón, Sara", "The next Biennial should be held in 2020, with a new exhibition opening every two years.At a special selection of works from the global collection in Berlin in January 2018, Berlin mayor Klaus-Peter Friedrichs announced that the long-awaited event would be held in 2022. In March of that year, the city inaugurated the new museum in the city center of Berlin. The event took place alongside the reopening of the Kreuzberg pedestrian shopping district, the redesign of the city’s Central Library, and the reopening of the Kreuzberg art site. The first exhibition of works by the New York–based artist Susannah Grant was revealed at the Museum of Modern Art in New York in June of 2018. \n\n\nThe National Film and Television Archive (NFTRA) in Washington, DC has appointed Ann Compton as its new deputy director. Compton was previously the United States director of the Museum of Modern Art in Washington, DC, and the United Kingdom’s chief curator at large at the Museum of Modern Art (MoMA), London. She succeeds Jill Sussin, who has served in the role of NFTRA’s deputy director since November 2019.“Ann has the essential experience, knowledge, and leadership needed", "The next Biennial should have been held at the museum in the fall of 2019, but was pushed back due to Hurricane Arturo. “In order to create an exhibition of the exhibition of the biennial, the organizing committee decided to postpone the anniversary,” María Dolores Pérez, president of the National Museum of Modern Art, told Artnet. While the museum has yet to announce the date of the 2020 exhibition, it intends to present the work of the exhibition in a different format from what was presented in the first Biennial.The Biennial of Images, which was organized by the National Center for Contemporary Art (Instituto de Cultura de Arte Contemporáneo, CNA) and was held at the Museo de Arte Contemporáneo, Madrid, from 1987 to 1995, is currently closed. The Biennial of Letters, which was organized by the National Gallery of Art (Instituto de Cultura de Arte Contemporáneo, CNA) and was held at the Museo de Arte Contemporáneo in Barcelona between 1987 and 1995, will reopen next year. \n\n\nThe Virginia Museum of Fine Arts (VMFA) in", "The next Biennial should be held at the Museum of Modern Art in Washington, DC, in the spring of 2022. This year’s event, titled “The Last Word,” will include presentations of art from the collection of the US artist Peter Falk (1906–1968), from which drawings of the wounds of prisoners were derived. The exhibition will be on view until January 20, 2020. The exposition will give a global platform for the work of the ten artists represented in the exhibition.\n\n\nArt historian Franklin Zwicky will step down as the head of the Getty in April 2020 and return to New York, where he has served as a curator of contemporary art since 2003.  “Franklin has been an essential partner in developing the Getty’s collection and mission through his decades of leadership,” said Christopher Cook, chair of the Getty’s board of trustees. “We are grateful for his years of service and for his tremendous contributions to the art world, but after a decade of leadership, he is eager to serve in new and indelible ways as an art historian.”Zwicky, who served as chief curator at the Museum of Contemporary Art (MoCA), Los Angeles, and", "The next Biennial should be held in late May, but the organizers are still evaluating the feasibility of it being held later this month. The first exhibition of the new exhibition will feature works by forty artists, including Pilar Conti, Agustín Campos, and ten-year-old Andrés Campos, who was born in the Patagonia region of Argentina and studied at the prestigious University of São Paulo, the University of the Arts in London, and the Lisey Art Museum in Brussels.The biennial will also draw from the latest research on the effects of climate change. The theme, “Climate Change: Its Effects on Human Environment,” will focus on how art and design may play a role in mitigating the effects of the planet on contemporary life. “This is a moment of great change for art and design: the right to be seen and bought by everyone,” said Milan-based artist and director Laura Mulrooney. “The new exhibition will bring the world together to see and hear the work of forty artists and designers, and will bring together more than 130 artists and designers from twenty countries to create a virtual space for dialogue and reflection on the planet.”The first-ever exhibition", "The next Biennial should be held in 2022, and the opening of the museum should be in 2020; the exhibition should focus on “the advancement of the widest range of contemporary art.”\n\nThe British government announced on Wednesday that it expects to raise an additional £1.2 billion for the arts through a series of tax increases and spending cuts in its next parliament, which will run from March 2019 to March 2021. According to The Guardian, the government expects to take the first steps toward reversing the $2 trillion economic damage caused by the coronavirus, which is spread by close contacts, such as coughing or sneezing, and will outline its environmental and health-focused goals for the 2020–21 fiscal year in a public statement on Friday.Leading members of Britain’s arts community, including the Royal Shakespeare Company, the National Poetry Library, and the National Galleries of Scotland, are urging the government to prioritize the promotion of works by British-born artists and prioritize rescuing the cultural sector from the financial ruin caused by Covid-19.Since the coronavirus outbreak began in Wuhan in December of 2015, the UK has spent $8.9 billion on revamping its public health system—including expanding its use", "The next Biennial should be held in 2022. At the time of the announcement, Orient Gallery director Henry Giles said that the exhibition was currently on view, “through the opportunity of a new exhibition format.” The festival, which was founded by William Gass in 1985 and takes place in Venice every three years, has been plagued by financial problems and criticisms for its financial backing of artists; Giles has denied the accusations.The Israeli government has responded to the crisis by targeting Palestinian individuals who are active in the arts and has blamed the crisis on the exhibition. Prime Minister Benjamin Netanyahu said: “This is a great tragedy for the artists who were killed in Gaza last summer. They were constructing for their future generations a cultural landscape that is open and vibrant and full of life and vitality. They were building a future for their families. And it is this future that is being destroyed.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of seventy-six works by eighty-eight contemporary artists and collectors in an exhibition organized by the institution in honor of the institution’s 150th anniversary this June. Curated by David Zwirner, the show, “The Future", "The next Biennial should be held in 2021. The exhibition will be hosted by the National Museum of Singapore (NMS) and will be comprised of twenty-four works by eighty-eight artists from forty-eight countries.  An opening ceremony will be held on January 7 and the event will run through February 7. NMS director Tim M.L. Tan told the Art Newspaper that the museum was reluctant to cancel the event, which was established in 1996 as a platform for the exchange of contemporary art. “I think it is important to have a way of life in the city that is sustainable,” Tan said. “I have always believed in the power of culture to affect people’s lives. I am really excited about this year’s biennial, and am confident the next edition will be even better.” The NMS has not yet commented on the future of the exhibition.\n\n\nThe Royal Academy of Arts (RA) in London has appointed Rosemarie Juergens, who previously served as a curator at the National Gallery of Art, as its next president. Juergens will succeed Mark Warawa, who retired in March 2019 after eighteen years at the institution", "The next Biennial should be the exhibition “Triennale: Introduction',” which will take a combination of contemporary art and historical research, and will open on September 24. A second exhibition, “Biennial: Third Wave,” will open in the fall of 2020. The work of fifteen artists from thirteen countries will be presented in two sections, “Introduction ” and “Third Wave ”, in the fall of 2021.\n\n\nArtist-owned and curated spaces are being targeted in an attempt to rein in the rising tide of anti-democratic legislation being introduced in the United States. On Wednesday, August 5, Washington state became the latest state to introduce legislation restricting the activities of civic, nonprofit, and self-described “non-political” arts institutions. The legislation, dubbed the Anti-Deficiency, Anti-Discrimination, and Anti-Discrimination Act, or ADADA, was co-sponsored by five members of the Washington State Legislature: Olympia J. Fujii, Mike Bell, Tim Burgess, Mike Ross, and Christine Gregoire. The legislation has yet to be enacted into law.According to the introduction of the legislation, which was authored by state senator Fran Pavley, the legislation would", "The next Biennial should happen in 2021–22. “It’s been a long road, but I’ve come through the worst of it,” said Guggenheim executive director Claire Blesch. “With your visionary leadership, we are confident that this will be a landmark year.”\n\n\nThe Museum of Modern Art (MoMA) in New York has released a statement about a new federal rule that will require museums that receive federal funding to reduce the amount of money they receive from the controversial controversial fast-track trade promotion authority. The rule, which was submitted by Senator Amy Klobuchar (D-MN) and is expected to be finalized by the end of the month, has led to protests from environmental and preservation groups and has also drawn criticism from some in the arts industry for being too restrictive.“The new National Endowment for the Arts guidelines will make it extremely difficult for cultural organizations to reduce or even eliminate their carbon footprint,” said museum director James Steward. “Museums are an integral part of our nation’s history, and we will continue to thrive by serving audiences through exhibition design, education, and programming. The new guidelines will make it extremely difficult", "The next Biennial should take place in 2020.\n\n\nThe Institute of Contemporary Arts (ICA), London, has named Sonea Ayran as its next director. The appointment was made amid the coronavirus outbreak, which has forced the closure of several venues in the UK and several internationally. Ayran will take the helm of the institute in January 2021. “I know that when I take up this new role at the ICA, I will have a strong and dedicated team of artists and staff to ensure that we deliver a truly exceptional programme for the next biennial,” said Ayran. “I am incredibly excited to be bringing over twenty-five years of experience to this exciting and challenging project, and to work with the talented team at the ICA to transform the ICA into a thriving and internationally visible arts institution. I will deliver a bold new vision for the ICA to meet the needs of contemporary life, and to enable the ICA to become part of the future.”Ayran joined the ICA in 1999 as a curator. Two years later, he and his wife, Farsalinos, opened the new space, which is now home to more than 1,000 artists and", "The next Biennial should be held in 2019.  Sara Serota, President of the ART Biennales Foundation, commented: “The new exhibition format, a new system for distribution, and the new theme are all exciting developments. I am really looking forward to working with the board and artists to see how the new exhibition format and the new theme can provide a powerful platform for the exhibition of our work in a way that will allow artists to share their visions and experiences with a broader audience. The biennial is a critical step in the way of our future collaboration and collaboration with our international community.” \n\n\nThe English Museum in Rome has announced that Guy Reeves has been appointed director of the museum. He succeeds David Nolan, who was hired by the institution as director of cultural heritage and public engagement in April. Reeves succeeds Tom Tung, who has been the director of the building and grounds at the museum for twenty-nine years, and will take up the post in June. During his tenure, the museum has expanded its collection, renovated the building, and added more than eight hundred galleries and more than six thousand objects. Reeves also oversaw the exhibition of nearly four hundred works in 2017.“Guy Reeves has been instrumental", "The next Biennial should be held at the Museum of Modern Art in New York in 2021, and the next will be at the Museo de Arte Contemporáneo in Santiago, Chile, in 2024. The institution intends to present a new exhibition of works by artists whose work is currently on display in the Biennial, which will be inaugurated by a retrospective of the work of the artist Cristian C. Martinez.The Biennial is part of a larger plan to return to Mexico City, where the institution is based, the Museum of Modern Art, the Vassar College Museum of Art, and the Museo de Arte Contemporáneo. The plan also includes the relocation of the Museum of the Modern Arts, which will be relocated to the Dorado in Madrid, and the construction of a new community center for the museum.\n\n\nThe Pérez Artístico in Madrid, Spain, has announced that the seventy-third edition of the Basel Art Biennale, which was canceled due to the coronavirus pandemic, will now take place in the city from March 23 to March 26, 2020. The event will be held at the new Museo de Arte Contemporáne", "The next Biennial should be held at the Health Sciences Centre in central London from March 15 to March 17, 2020. The exhibition, entitled Life After Death, will feature seventy-three works by thirty-three artists. The theme is Life After Life: From the Black and the White and the Brown, and will be presented by Dr Mahdia Mukherjee, the artist who inspired the exhibition. The exhibition will be inaugurated by a presentation of two paintings by Muriel Obalas, or the Death of a Young Girl, 1946–1947, at the Biennial. The opening of the Biennial, which is housed in an old post-office, coincides with the opening of the Centre for Advanced Studies in Art History, London, which is seven hundred miles away. During the first week of March, the five-story building will be transformed into a gallery and will host a series of exhibitions, performances, and other special events. The Biennial will also feature a new exhibition, titled Sono Mori: Closer to the Truth, at the Museum of Contemporary Art in London. It will also welcome visitors from March 16 through March 22, 2020. The 2019 edition, titled", "The next Biennial should be held in 2020.\n\n\nAs the world mourns the loss of more than twelve thousand lives at the hands of the coronavirus, and more than three hundred health officials in the United States are calling for new restrictions on travel, London has announced that from January 6th to January 7th it will offer free entry to and stay in the UK for visitors from six of the ten countries where the coronavirus was first reported in the UK, France, Germany, and Italy. The next Biennial should be held in 2020.As the world mourns the loss of more than twelve thousand lives at the hands of the coronavirus, and more than three hundred health officials in the United States are calling for new restrictions on travel, London has announced that it will offer free entry to and stay in the UK for visitors from six of the ten countries where the coronavirus was first reported in the UK, France, Germany, and Italy. Starting January 6, visitors will be able to travel to the UK from six countries: the US, US Virgin Islands, US Northern Territories, the US Palatinate, and the US District of Columbia. The UK’s primary airports will remain shuttered, and nonessential stores and shops", "The next Biennial should take place in the summer of 2020. “This means that it will take place in the autumn of 2020, and, in the autumn of 2021, and, in the autumn of 2022, and so on,” said the exhibition curator Katja Günther. “This is a remarkable time to be alive. To be able to organize such a large-scale exhibition in such a short period of time is unprecedented.” The project, which was sparked by the outbreak of Covid-19 in the US in late December, has filmed all of its production locations, and was based in Berlin, Dusseldorf, and Dusseldorf-Vierhaus—the city of the Düsseldorf cathedral. The biennial will take place in the city’s historic Sprecher Bauhaus, which opened in 1920, and will run throughout the spring of 2021. Commenting on the project, Kathrin Baumann, the exhibition’s director, said: “It is a rare thing to have a project that is truly self-organized. In a world where so many curators and producers are so busy, and so much", "The next Biennial should be hosted at the Pérez Art Museum in Madrid in 2022. “The Festival of the Arts will continue to be a platform for contemporary art, extending the reach of contemporary and contemporary art,” Marta Dallé, director of the Museo de Pintura in Madrid, said.\n\n\nThe 2019 edition of the Asian Biennial, curated by Hong Kong–based curator Mark Sully, was canceled due to concerns over the coronavirus. The exhibition was supposed to leave Beijing in March, but has since been rescheduled. Organizers are still investigating whether the coronavirus, which was first identified in the United States in 1976, will return to China and are looking into whether the groundswell of support for the Hong Kong government’s campaign to bring the coronavirus to Hong Kong has changed public opinion.Several artists, including Alison Pill, Kate McKinnon, and Emily Dickinson, have pledged to boycott the upcoming edition of the Asian Biennial, which will be held at the Palais de Tokyo in Paris from March 13 to March 20, 2020. “I refuse to participate in your exhibition,” wrote Alan S. Levine in a letter on March 7 to the organizers of the", "The next Biennial should move to the nearby town of Arles, France, in 2021, and will host a monograph on the Second World War that will showcase the work of the biennial’s international artists.\n\n\nThe twentieth edition of the Sydney Biennial, titled “A Moment of Truth,” has announced the list of seventy-eight artists whose works will be featured in the festival’s twenty-third edition, entitled “The Past and the Future,” taking place in the Sydney Opera House from June 7 to June 10, 2020. The event will bring together seventy-eight contemporary artists who have worked or are currently working in Australia.“Since our inception in 2005, the Sydney Biennial has been a model for how to address contemporary concerns,” said Deborah R. Shipman, the festival’s executive director. “The subjects presented in this year’s edition are rich in humanistic questions and reflect the breadth and depth of our international community. We congratulate all the artists featured in the exhibition who have chosen to participate in this year’s event and look forward to seeing you all soon.”The full list of participating artists is as follows:Adam MiroffA", "The next Biennial should take place in 2022 and will be curated by Yale University Art Museum curator Tim Burton and  Yale Architecture and Design professor Lorenzo Fusi.  The 2019 event, titled Art and Performance, was held in the museum from October 23 to October 24 and garnered more than 1,500 visitors.  The next edition, which will be held in 2022, is still being conceptualized and will be hosted by the Art Institute of Chicago.\n\n\nJohn Le Carré, a New York–born, Paris–based, and Los Angeles–based artist, has died at age seventy-three.Born in Paris in 1947, Le Carré moved to the United States at age sixteen, signing up for a summer internment program at the Art Institute of Chicago (now the USC Art Museum). After graduating in the early 1960s, Le Carré relocated to Los Angeles, where he began his career as an independent artist. Le Carré returned to New York in 1971 and embarked on a long-term project, constructing a massive, twelve-thousand-foot-tall bronze sculpture, The Cross, which performs a pivotal role in The Body and the Sea, and is represented by the", "The next Biennial should be held at the National Museum of Art, Washington, DC; the Museum of Modern Art, New York; and the Museum of Contemporary Art, San Francisco.  The full list of participating artists is as follows:The Venice Architecture+Design Biennial, 2019: Gallery List (New York: Nelson-Atkins Museum of Art), New York: Nelson-Atkins Museum of Art, New York: Nelson-Atkins Museum of Art, New York: Nelson-Atkins Museum of Art, New York: Nelson-Atkins Museum of Art, New York: Nelson-Atkins Museum of Art, New York: Nelson-Atkins Museum of Art, New York: Nelson-Atkins Museum of Art, New York: Nelson-Atkins Museum of Art, New York: Nelson-Atkins Museum of Art, New York: Nelson-Atkins Museum of Art, New York: Nelson-Atkins Museum of Art, New York: Nelson-Atkins Museum of Art, New York: Nelson-Atkins Museum of Art, New York: Nelson-Atkins", "The next Biennial should be held in 2022, as the tournament enters its fifth year of operation.\n\n\nThe Baltimore Museum of Art (BMA) announced today that it has awarded $1.3 million in grants for artist-led projects, including the development of new exhibitions and the acquisition of works.The BMA has awarded $1.2 million to individual artists since the exhibition process began in 2016. The biennial’s 2017 Grant Program, which was inaugurated with $500,000 from the Michael W. and Catherine J. DeGarmon Foundation, saw its largest increase in funds to date with the addition of a $500,000 grant from the John and Catherine DeGarmon Foundation.The biennial’s inaugural grants were made in support of the exhibition “My Body: Art and the Body in the Late Eighteenth and Early Nineteenth Century” (2017–18), “Diana Al-Hadid and the Body in the Early Twentieth Century” (2017–18), “The Victorian Era: Reframing Black Art” (2015–16), “Rediscovery” (2014), “The Painter’s Heart: The Lives and Works of Richard A", "The next Biennial should be held in 2020\u0097the date being set by the organizers\u0097and will unveil a new Art Gallery Exhibition and a new program designed to engage with contemporary art. The inaugural exhibition will be curated by Abu Dhabi-based artist Ahmad al-Qasimi.Al-Qasimi, who is currently based in New York, will create an exhibition of works by sixteen artists from the Arabian Peninsula. The show will draw from his previous biennials in France, Italy, and the United Kingdom. The next edition of the Dubai Biennial will take place in 2022.\n\n\nThe London-based nonprofit the National Poetry Library will suspend its annual fundraiser, which has raised over $1 million for the organization over the course of its twenty-four-year history, until September 30. The move follows an outcry from UK politicians, arts professionals, and individuals who were promised prizes if the proceeds were donated to the library. Titled National Poetry Week, the event, which opened on September 12 and runs through September 18, has faced backlash from politicians, who claim the money will be diverted to fighting terrorism and will instead go toward fighting the Covid-19 pandemic. Among the organizations that have spoken out against the event are", "The next Biennial should open in 2021 under its own name and will be inaugurated by a biennial of works by artists of the African diaspora, \"Master of the Arts: i n America,\" which will be held at the Art Institute of Chicago in 2021. The biennial will also present a retrospective of a work by an African American artist and curator.Significantly, the Biennial will not include works by any of the artists who won the grand prize in 2019, including Issa Rae, Tawanda Jones, and Amy Davis, nor will it include a selection of works by the African diaspora artists nominated by the Biennial. However, the biennial will be dedicated to the struggle for liberation from colonial rule in Africa and the United States, and will host a number of programming initiatives designed to engage with contemporary issues such as LGBTQ rights, climate justice, and Indigenous rights.“We are deeply grateful for the encouragement and support of the artists, the communities, and organizations who have extended an invitation to the Biennial. Far from neglecting them, we are also eager to build on their experience and expertise and to showcase their work in the event of their death,” said Dave Callison, director of the Art Institute. “The", "The next Biennial should be held in Berlin in 2021.\n\n\nThe New York–based curator Susanne Voss has been appointed director of the Metropolitan Museum of Art (MoMA) in New York. Voss joins the museum from the experimental gallery M-1, where she helped create the experimental venue Centerpoint, which was turned into a heart-shaped sculpture garden. Voss serves as a professor of fine arts education at the School of the Art Institute of Chicago and a faculty member at the New School in New York.The Met stopped accepting new visitors to the institution in September 2019, citing the ongoing health crisis in Syria. The museum also announced that it would temporarily close for a week in August, thereby suspending all performances and other programming in the museum. In a statement, the museum said that the decision to temporarily suspend programming was made to protect the health of museum staff and visitors.“We wanted to make it safer for our visitors to MoMA and ensure they had the means to make their way through our exhibition halls,” Voss told the New York Times. “But more importantly, we were trying to figure out ways to create a space where people could be together and have a conversation that was meaningful in both its themes of death", "The next Biennial should include a performance by a group of leading artists in the creative arts and humanities. This year’s event will be held at the Kleistalian Museum in Berlin, which has been transformed into a public space incorporating a gallery, a multimedia arts space, and a library. The biennial will be organized by the Kleistalian Cultural Center in partnership with the Free University of Berlin (UFB) and the Wissenschaftstelle Berlin (Wieden- und Wissenschaftstelle).The Wunderkammer Art Museum in West Berlin will host the third edition of the Wunderkammer Kunstbau on March 4–7. The exhibition will consist of twenty-four works by twenty-six artists. The first Wunderkammer exhibition was staged at the Zürich Art Museum in 2011 and features works by twenty-three artists. Its second edition at the Kunsthalle Basel in Switzerland in 2016 brought together work by twenty-six artists.The biennial’s winner, Alessandro Balsom, was selected for the third edition of the Wunderkammer Kunstbau, which will take place at the Kunsthalle Basel in Basel", "The next Biennial should have been held in 2020, but the organizers decided to postpone its opening, citing a shortage of funds. Rather than returning to the drawing board, the organisers have decided to make drastic changes to the venue, by introducing a biennial-size sculpture garden, which will be surrounded by a landscaped pavilion, called a castle. The new pavilion will house four hundred works, including works from the exhibition, which opened on September 16 and runs until December 18.The exhibition, titled Goldsmiths, was commissioned by Goldsmiths, the London School of Economics (LSE), and the National Museum of Scotland, and will be staged in a building designed by British firm Grafton Design. The first David Lewis Gibson exhibition, entitled Love, Beauty, and Death—which also takes place in a castle in the park, and features works from the artist’s studio in London—will take place in the park in 2022.The construction of the pavilion, which is expected to cost £6 million, is being overseen by the sculptor Anna Atkins, who is seeking £4 million for the project, and the LSE. The two partners behind the project, Stuart Little and Jason Mitzevich, are also working on", "The next Biennial should take place in 2021. It will also host a museum exhibition in 2022. The full list of participating museums is as follows:Art Histórias de Barcelona (Art História de Barcelona)“Art História: Avanto Grazia (2018)”\n\nThe City of San Francisco (CFC) has approved a $6.95 billion contract with the Swiss company, Saara, to defend San Francisco’s historic Masonic Temple against the growing threat of a possible takeover. “Our museum is not in a position to withstand the unique challenges that we will face as the City’s cultural and cultural asset,” Mayor Gavin Newsom said in a statement. “Now more than ever, it is critical that the CFC and San Francisco come together to protect our treasures and to make the City of San Francisco and the Bay Area a better place for future generations.”Saara’s CEO Gunther Oetzi—who purchased the building where the monument is located in 2009—is also facing a legal challenge from a group of citizens who want the property sold. The citizens have filed a lawsuit in federal court in San Francisco, which are challenging the sale of", "The next Biennial should begin in August 2020. The full list of participating artists is as follows: Artists and groups Artists and groups in association with the Biennials Director José De Angelis, Architecture and Design’s Director Victor Muñoz, Architecture and Prints Artists Joëlle Béchaud, Author and Artist(s) in association with the director of the Institute of Visual Arts, Édouard Vuillard, (France) Artists and groups in association with the director of Interdisciplinary Studies in Paris, Pierre-Olivier-Olivier Prouvé, (France) Artists and groups in association with the director of the Épine de Lyon, Catherine Montlaur, (France) Artists and groups in association with the director of the Institute of Contemporary Art, Leclair A. Fils, (France) Artists and groups in association with the director of the Art Institute in Zurich, Hans-Ulrich Fuchs, (Germany) Artists and groups in association with the director of the Art Museum Zurich, Irmana Haiduk, (Germany) Artists and groups in association with", "The next Biennial should begin in the Spring of 2021 and conclude in the Summer of 2022. “With the completion of the programme, the exhibition will be able to advance and further the work of women artists, and will be able to present a more balanced picture of the contemporary world,” said exhibition director Phyllis Peña. “We are truly thrilled to see the work of the artists represented in this exhibition. They are dynamic, imaginative, and beautifully composed, and I am truly honored to be a part of their journey.”\n\n\nThe fourteenth edition of the Pérez Artística in Madrid, organized by the Spanish ministry of culture, has announced that it will reopen on January 19, 2021. The new date was chosen to coincide with the reopening of the Pérez Artística, which was inaugurated by Pablo Picasso and has staged more than 160 exhibitions since its closure in 1992.The institution, which was inaugurated by former mayor José Marti and the Pérez Artística Association in 2002, will officially open in Madrid on January 20, 2021. Following its reopening, the ministry will host a celebration for the occasion in the city of Paraíba, where", "The next Biennial should have a new exhibition planned for 2020, but the decision to postpone the event was made because of the worsening situation in Syria, the Middle East, and South Asia. In the coming months, the museum will also work to create a new series of exhibitions focusing on the preservation of early modern art in France. The new biennial will be announced soon. \n\n\nThe Museum of Contemporary Art (MoCA), San Francisco, has appointed David Rodrigues as its new executive director. He succeeds Leslie Lovellette, who has been the museum’s director since 2014, and will take up his new post on April 3.“Over the last year, David’s energy and passion for curating and producing new art has led us to a moment of transformation,” said director and CEO Andrea Bruguera. “We are grateful for his dedication and vision and are excited to welcome him into the MoCA family.”The museum has made a number of notable acquisitions in the last few years. It acquired the works of José Ortega y Gasset, Herbert Szeemann, and Robert Irwin during its acquisition of the three works by the late Mexican artist Juan César Chávez", "The next Biennial should take place in 2021, with the express aim of reopening the Museum in the autumn.The institution is currently closed until at least mid-January due to Covid-19.\n\n\nThe Sultan of Brunei, Crown Prince Mohammad bin Rashid, has urged the United Kingdom to reverse its decision to leave the European Union and return to its former member state, stating that the move will only lead to greater instability in the region.In an interview published by the UK’s The Times on January 6, the monarch said that the decision has seriously damaged the bilateral relationship between the UK and Brunei. “One of the reasons why we’ve done this is because we believe we’re a stable nation that’s able to withstand this,” he said. Rashid claimed that the UK’s decision to leave the EU has led to the collapse of the UK’s relationship with the country, which is currently negotiating a trade deal that would see it lose out on an estimated $5 billion a year in revenue. He also claimed that the economic fallout from the decision could be felt for the next two to three years, and that the UK’s Commonwealth Games participation could be", "The next Biennial should include a discussion of the history of the exhibition, and the narratives told through the exhibition, and should begin with a critical assessment of the work. The selection committee will then determine whether the work fulfills the curatorial mandate and whether it presents an opportunity for the exhibition to express critical reflections on contemporary issues. The selection committee also hopes that the exhibition will respond to the current state of contemporary art. The exhibition will be curated by Cecilia Alemani, head of the department of contemporary art, at the Biennial of Essen.\n\n\nThe Reitód Gallery in New York has acquired the property of the late fashion designer Alvin Rodrigues, who was a staple of the avant-garde New York fashion scene. Known for his lavishly detailed designs, which often incorporated fabrics such as silk, leather, and rubber, Rodrigues’s work was frequently given away by aeon to budding fashion designers.“Alvin Rodrigues was one of the first men to design in the fashion industry, and he influenced many early avant-garde designers who followed,” designer David A. Marcus told the Art Newspaper. “His influence on the avant-garde designers is immense. He was a giant", "The next Biennial should be held in 2021. The 2019 exhibition was held at the National Gallery of Art in Washington, DC. The exhibition was curated by Tuuzin Möller and features above and paleoart from the Middle East, Europe, and Asia.\n\n\nThe Dutch government plans to spend an estimated $6.8 billion to overhaul the country’s rail and maritime infrastructure by 2022, a €6 billion boost from the current level of €3.8 billion. Delays in construction and the construction of new rail and maritime links have made rebuilding in times of crisis more difficult, while a number of major shipping routes are still at risk of collapse.In an attempt to address the challenges posed by climate change, the Dutch government is also upgrading its electrical grid and expanding energy efficiency standards. The blueprint, which outlines how the Netherlands should respond to climate change by 2050, will also involve the construction of more than 1,500 kilometers of new roads, the upgrading of transportation infrastructure, and the restructuring of the country’s water and wastewater management systems.The government’s Plan B—a $3.9 billion emergency fund for small businesses and individuals that is expected to be activated in October—is only half of the $", "The next Biennial should take place in 2020. The new venue will be hosted by the Musee Montmartial in Paris and will be inaugurated by a show of work by the artist Zoë Burton. The event will include an exhibition and lecture led by Nada Southall, director of the Museum of Modern Art, and will be hosted by Leonardo DiCaprio. The show will focus on Burton’s works Zoë and Sam, 2003–2005, as well as her project for the 2010 Venice Biennale, Number 6, which was curated by Joël and Kim Willem de Kooning. The first year of the Biennale will run from March 18 to March 22, 2020. The 2019 event, called The Future is Here, came in a time when many issues were at risk from climate change: the release of a film by Danish director Lars von Trier about the Greenland ice sheet, the relocation of a work by Italian sculptor Stefano Bisolotti and the scrapping of a landmark environmental agreement. The lecture series will also examine the legacy of the artist and Bakunin, a socialist who lived", "The next Biennial should take place in the city from March 21 to March 23, 2021. The first iteration will be staged in the capital city, with the exhibition marking the first time that the Malaysia pavilion has been staged outside of Kuala Lumpur.  The theme of the 2020 edition, “Beyond Beauty,” is a synonym for reference of sorts, and will address the relevance of the body in modern life. The exhibition will also include the work of fourteen emerging and established artists.Artworld.com “Artworld.com is thrilled to present the first edition of the biennial in Tokyo,” said Michiko Oda, the publisher of Artworld.com. “Takashi Hoshine, Atsuko Takayama, and Nao Takeda, among others, will present their work for the exhibition. They will be among the first to present their work on the Tokyo Biennial. The exhibition will be hosted by the modern art museum Tate Modern and will be organized as a platform for reflection and reflection on art and nature in Japan.”Under the new exhibition program, Japan’s National Museum of Fine Arts will stage new works by artists such as Aajinder Sachdev", "The next Biennial should, in the words of Ambassador Richard LePage, “focus on the themes of crisis and recovery.” Last year, the festival was forced to move three times, including once for security reasons. The next edition of the event, “Forty Years of Biennial,” will take place at Portland State University, Portland, Maine, and will run from April 16 to April 22.The festival will also be hosted in the United States, Canada, and Mexico. The opening event, “Forty Years of American Cinema” (2014), will be held at the University of Minnesota. The June 12 event will be hosted at the New Museum in New York. The United Kingdom will also host a biennial, “The Art of the Party,” in June 2020, and the biennial will consider themes of family, community, history, and the future, with a particular focus on the theme of “Fathers.” The event will also be curated by British director Jim Broadbent and will be staged by David Mitchell.The 2019 edition of the Venice Biennale, titled “One Hundred Years of Biennial,” featured 60 new works by 20 artists and was curated by", "The next Biennial should be held in 2020. In a statement, the organizers said: “The US has never been so densely populated and integrated with one another as it is now. We are committed to working with local communities to better understand and appreciate one another, and to sharing experiences and thoughts and values that create a more just, just, and beautiful world.”\n\n\nArtnews reports that the 2018 edition of Art Basel Hong Kong, which takes place in the United States from May 10 to May 20, will be canceled amid the coronavirus epidemic. The event, which was scheduled to run this weekend, was canceled due to the coronavirus epidemic, which has affected Hong Kong as well as the United States.The announcement means that the fair’s May 14–May 17 edition will no longer be held. The Hong Kong pavilion will be moved to a different location and the exhibition will be rescheduled for the third edition of the fair, which will be held in Nanjing from May 21 to May 24.The Hong Kong pavilion will be moved to a new location and the exhibition will be rescheduled for the third edition of the Hong Kong pavilion, which will be held in Hong Kong from May 22 to May", "The next Biennial should be held in the fall of 2020.\n\n\nThe Rachel Carson Biennial at the Smithsonian American Art Museum (SAAM) has been postponed by a year, to February 2021, following the death of the institution’s president, Deborah Carson. The move is believed to be one of the largest curatorial shifts in the museum’s sixty-five-year history, and has raised questions over whether the institution will be able to reopen, given the ongoing health crisis. The 2019 edition, “The Destroyer,” drew a mixed audience, with critics saying that the exhibition lacked the urgency and impact of the biennial’s previous iterations. The 2019 exhibition featured art from the Carson Collection, which comprises works from the artist’s earlier decades, as well as works by artists and activists that were more recent.The biennial was organized by the panelists themselves, including Caleb Chiu and Hui Cao, among others who spoke at a press briefing before the exhibition’s October 22 opening; the artist Tracey Parson; and artist Larry Achiampong, who was a guest artist for the biennial.\n\n\nThe Foundation for Contemporary Art (FCA) announced today that it has received a", "The next Biennial should include a review of the Selected Art from the first Biennial. One hundred works by forty-two artists will be presented and the biennial will also include a presentation of works for the first time. The art of the biennial will be curated by Diana Alsham, vice chair of the Board of Directors of the Museum of Modern Art. The event is also being organized as part of the museum’s commitment to the preservation and promotion of African artistic traditions through programming, exhibitions, and conservation. The Biennial will mark the twentieth anniversary of the institution. The full list of exhibitors is as follows:Bulbar Museum of Art, New York: “The Color of Light: Art and Color in the Black Atlantic” (Norton Simon Museum, New York):  “Ebon Ambassadors: The Color of Blood” (Philadelphia Museum of Art, PA): “Ebon Galleries: Color and Meaning” (New York: Gallery of Modern Art, 2019)Art of the Event.COMECOA, Lima, Peru: The full program of biennials will be announced soon.  Intersect Art Museum, New York: Live from", "The next Biennial should be held on November 28–December 30, 2020.\n\n\nThe Solomon R. Guggenheim Museum in New York City has named the twenty-eight artists participating in its biennial “Awards of the Artist’s Lifetime.” The seventy-six-year-old institution was selected to commemorate its 150th anniversary with a retrospective of work by the artist Harry A. Saltzman, a former instigator of the group show “The Age of Electric Light” and one of the founding members of the Brooklyn-based collective Death Cab for Cutie, in 2019. The biennial’s next edition will take place in January 2021. The biennial’s five winners\u0097Marlo Thomas, Nari Ward, Charles Atkins, Laura Owens, and Alice Cooper\u0097will be presented with a lifetime achievement award in 2020.“After a full year of curating and presenting the exhibitions, I’m proud to present to you the first exhibition on the twenty-eight artists who have won the Lifetime Achievement Award,” said Jared Diamond, the biennial’s curator. “Each of these artists has had a profound impact on the course of modern art as well as", "The next Biennial should focus on the full range of contemporary Art. The institution hopes to present, to date, a series of exhibitions that reflect both the breadth of its holdings and the institutional interest in the gallery.”Next year will mark the ten-year anniversary of the opening of Biennial Malta, which was established in 2009 and encompasses eighteen galleries around the world. The Biennial is one of the largest exhibitions organized by a single institution in Europe and the second-most expensive in the world.\n\n\nThe Museum of Modern Art (MoMA) in New York City has announced that it will begin accepting visitors' art in August. The institution also revealed that it will begin accepting artworks from the exhibition “Diana Alighi: The Art of the Unseen” at the Museum of Modern Art in partnership with the Pérez Art Museum in Miami Beach. It is not yet clear how the works will be displayed.Following the exhibition, the museum will present the first public exhibition of work by Diana Alighi’s Open Heart, her first public exhibition at the museum in seventeen years, and will host an event of the same name in conjunction with the opening of a new exhibition of work by Charles Andrew Pegorchak’", "The next Biennial should be held in the spring of 2021. “We are extremely excited to be opening our new partnership with the famous collection of the Dürer—the Dürer House—in Lucerne, Switzerland, with its collection of 17th-century portraits by Franz Kline and Joachim Neugroschel,” said Aki Suwa, the curator of the new exhibition, “The Dark Room.” This exhibition will include the first-ever works from the collection of the Dürer, featuring works by artists such as Hans Christian Andersen, Franz Kline, and Erich Fromm, and will be presented by the Dürer Museum. The new exhibition is part of the Dürer’s campaign to promote the work of contemporary artists. The campaign included the opening of the first Biennial of Modern Art in Oslo in 2017.\n\n\nThe Southeast Asian country of Laos has decided to suspend its next edition of the Golden Lion, which was set to take place in November 2022, citing the ongoing conflict in Syria as the reason. The decision was made on Wednesday, May 28, and was made in a letter signed by the government of the predominantly Buddhist country and the International Committee for the Reconstruction", "The next Biennial should be announced in the coming months. \n\n\nThe Museum of Fine Arts (MFA) in Boston has released the list of fifty-eight artists who have received the 2018 $25,000 Discovery Artist Grant. The initiative was launched by the MFA in 2015 to increase the visibility of emerging and established artists in Boston. William & Mary Fine Arts Center director Kathleen McEntee announced the fifty-eight recipients in a statement on Friday. The artists will each receive $5,000 in support of their general operating expenses, as well as a total of $25,000.“This year’s grant cycle is one of our strongest yet and we are incredibly proud to be able to support forty-six artists with this year’s grant cycle,” said Roberta Smith, the MFA’s chief curator and director of curatorial affairs. “We have received a tremendous outpouring of support from curators, artists, philanthropists, schools, and foundations as we move through the process of selecting grant recipients. We are grateful to our community for taking the time to consider the artists who are exceptional and recognizing their talent.”\n\n\nThe Smithsonian National Museum of African Art in Washington, DC", "The next Biennial should take place in 2021, but the dates are still up in the air. The National Gallery in London has already announced its 2021 project, which will focus on “pioneering new developments in art and design.” According to the London Times, the institution will begin construction this spring, with a team of sixty artists and designers working in collaboration with the architect and landscape designer Kiyomi Teraoka.The inaugural exhibition, “Pace: The Politics of Performance,” will showcase work from twenty-four artists, including Markus Borthwick, David Chipperfield, Paolo Catellani, Maia Catellani, and Ed Moses. Curated by Joachim Neugroschel, director of the Düsseldorf-based Institute for International Design, the exhibition will also focus on the role of the body in the performance world, with a delegation comprising the Lebanese artist Walid Raad, the French sculptor Jean-Michel Basquiat, and the Nigerian artist and activist Siti Almaimi. The biennial will take place in the Düsseldorf town of Düsseldorf-Stuttgart, Germany, and will run for", "The next Biennial should focus on the history of health care in the United States, focusing on the relationship between health care and social change, and should invite health policy experts, academics, and activists from around the world to discuss and work together.The biennial will also include a redesign of the museum. The current building, which is in dire need of an overhaul, is currently being renovated. The redesign includes the construction of a new auditorium, an expanded gallery, and an additional level of the museum. It also includes the addition of a theatre and lecture rooms, along with the construction of a new public courtyard. The museum will be renamed in honor of the current staff members and their achievements.“This is a new chapter in our history, and the architecture of the museum is being reconceived to reflect this,” said Larry Fink, president of the Fink Foundation, in a statement. “We will continue to work with the community and the leadership team to ensure that the Fink Museum is the perfect fit for the city of New York, and to shape the museum in ways that benefit our future generations and the city we love.”\n\n\nThe National Museum of Women in the Arts (MoMA) in Washington, DC, has", "The next Biennial should take place in the year 2021. Spain’s National Galleries, which would not comment on the future of the exhibition, said: “Over the years, we tried to present contemporary exhibitions in Spain and, in the process, have been privileged to present some of the best exhibitions Spain has ever produced. We have never stopped pursuing an international platform, and we never plan to stop. I believe that the future of the exhibition will be determined by the quality of the shows being presented and by the new exchanges of ideas that will open up in the future.”The museum also revealed that the museum’s collection of contemporary art will be made accessible online following the institution’s reopening. The exhibition will be divided into three online regions, which will be able to offer different viewing experiences to different audiences: a digital version for the public, a physical version for museum members only, and a digital edition for students. In addition, the exhibition will also have a mobile version that will be able to be accessed by mobile devices.The newly created digital region “Toda Mundial” will launch in the summer of 2021 and will be hosted by the biennial’s inaugural exhibition “Toda por el", "The next Biennial should be held in the spring of 2022.  The future of the exhibition is now up to the artists.\n\n\nGeneva Art & Art Museum (Geneva) in Switzerland has appointed Markus Grosch, the curator of contemporary art, as its next director. Grosch comes to the institution from the Zurich-based company Kassel-based artist-run organization Foam. The organization has been at the forefront of the global movement to defund museums and cut off funding to the institution. While the museum has been working to secure its future as a major cultural destination, it faces an uncertain future as a result of the decline of the global economy and the ensuing crisis. In a statement, the museum said: “Geneva has been the scene of significant cultural and economic growth and social progress. We are now witnessing the full impact of this, and its transformation into a truly international city. We are at the point where we are re-entering a new phase, when the museum becomes an essential platform for dialogue between East and West and between East and South. We are delighted to be able to welcome Mark to the team at the museum.”Since Grosch’s appointment, the Zurich-based", "The next Biennial should be held in 2021.  The next San Diego Biennial should be held in 2022. The next San Francisco Biennial should be held in 2023.The next American International Art Museum (AIA) Biennial will be held in 2021.The next Boston Art and Architecture Biennial will be held in 2021.The next Baltimore Art and Architecture Biennial will be held in 2021. The next Seattle Art Museum Art History Museum (SAAM) Art History Museum will be held in 2021.The next Portland Art Museum Art History Museum (PAMM), which will re-open in 2021, will be held in 2021. The next Pittsburgh Art Museum Art History Museum (PMA) Art History Museum will be held in 2021.The next Chicago Art Institute Art Museum (CIMAM) will be held in 2021. The next Smithsonian American Art Museum (SAAM) will be hosted by the University of Chicago in 2021.The next Chicago History Museum (CHML) will host a biennial on the history and development of the city in 2021. “I am excited to announce that the next Biennial will be held at the Museum of Contemporary Art Chicago in 2021,” said Elizabeth Bernad, the board chair", "The next Biennial should aim to present a new collection of works by artists working across the globe, and should include works across time and geography. The event will take place from January 18 to February 23, 2019 at the Museum of Modern Art. MCA has previously held its annual biennial in San Francisco in the spring of 2019. The museum also staged its first event in the United States, which ran from October 27 to October 28, 2020, and its first event in Europe, which ran from March 14 to March 16, 2021.\n\n\nAuction house Bénédicte Hardy & Partners has announced that it will suspend sales of works by the Los Angeles–based artist Matisse & Picasso, which were scheduled for the first and second halves of this year. The gallery first announced the news on Thursday, February 18, following a leak that revealed the works would be removed from its website no later than March 10.The announcement came after a group of six artists were awarded the Venice Bali Prize for their works for the exhibition “Ateliers d” (“Ateliers d’Aloia”), which opened in June 2020. The six works, which were selected by the Bali-born artist", "The next Biennial should be held in 2020, with the next in 2021.\n\n\nThe Institute of Contemporary Arts (ICA) in Geneva announced today that it has received a gift of 350 artworks from the Zu-Antrea Collection, the private collection of Antonio César Zanarini. The donation includes works dating from the early nineteenth century, a collection of works from the late nineteenth century, and a collection dating from the twentieth century.The museum received the works from Zanarini in 2017, following a three-year bidding process, and is currently working through the acquisition process, which is expected to be completed by September. In addition, the institution has released a statement about the donation, which reads:The gift, which comprises works dating from the late nineteenth century and from the late nineteenth century and far beyond, was made by collector and collector François Zu-Antrea, who has represented the Nari-4 series, whose works are currently on display in the exhibition “Nari,” curated by Elisabeth Bode. It is the first time the collection has been given the status of a “classic” work.“We are extremely pleased to receive this collection, which represents a significant departure in style from the", "The next Biennial should take place in 2020, the year of the goddess Ygritte. During the exhibition, the exhibition of selected works by artists such as Pierre-Xavier Huyghe, Jules-François Leclerc, and Simone Leigh will be celebrated.\n\n\nThe museum’s collection has been severely damaged in a fire that broke out in a storage area on the sixth floor of the museum on April 25. The cause of the fire, which is still under investigation, is under investigation.The fire, which was extinguished by firefighters on April 26, occurred in the guest room, which is part of the museum, and the building’s roof. According to the museum, the fire was contained by the building’s roof and walls, and the building’s electrical system. The museum witnessed the building’s electrical system shutting down shortly before the fire began.The firemen who extinguished the blaze, which was extinguished by the building’s already-down heat, said it was not unusual for the building to be occupied by guests. The guest room is adjacent to the museum’s main building and provides access to the museum. The firemen said that the roof collapsed shortly after they", "The next Biennial should take place in the Netherlands in the autumn of 2021. “The new edition will be about the most contemporary exhibitions in the world, focused on contemporary art from a contemporary point of view,” said Thomas de Grood, Director of the Biennial. The biennial will be hosted by the Amsterdam Museum of Art, which is now preparing to reopen in the spring of 2021. Its new complex will occupy around 1,850 square feet of the ground-floor and will contain twenty-four rotating exhibitions, including the first show devoted to the hard-edge work of painter Francis Alÿs. The Biennial will also welcome artists from Abu Dhabi, the United Arab Emirates, and Sweden. “The Biennials are a new kind of institution,” said Hannes Smits, the President of the Netherlands. “They offer galleries and curators a new way of working and presenting art, and at the same time offer an opportunity for individuals to work together.”\n\n\nThe Boston-based nonprofit Historic Boston has appointed Lena M. Hicks as its next executive director. Hicks comes to the organization from the City of Boston, where she serves as a senior city planner and works as a vice president", "The next Biennial should take place in the spring of 2020. The location for the exhibition would be determined by the city of Biennials. Its theme would be “Loneliness.” The show would consist of “NIRIN” and “SHINE,” two works that depict the same subject, but different ways of looking, and would take place on the island of Corfu near the town of Codreanu, in the Adriatic, in April and May 2020. The event would also be a “wake-up call.” The piece will be accompanied by a new exhibition, “NIRIN,” which will open at the Biennials on September 29, 2020. The Biennials were cofounded by Irina DiGiovanni, a renowned sculptor and cofounder of the Italian architectural group Finola, and Stefano Cipolletta, a director of the Palazzo Bianco in Venice. DiGiovanni and Cipolletta were given a commission from DiMasi in 2011 and 2013, respectively. In the 2015 exhibition “The Landscape of Art,” the two collaborated with Šelena Obren", "The next Biennial should focus on “Prospect: From Hope to Fear”\u0097a term coined by the late British artist and philosopher Douglas Rushkoff\u0097and should aim to re-create the “spirit of the time,” a theme constantly used to indict contemporary art and the current political climate. With its focus on the ’translife of consciousness,” the exhibition will be a “spiritual continuation of the work of Francis Cornell,” Joyce Thomas, and others.The show’s organizers contend that the exhibition will draw in “millions’ of visitors,” and cite the extraordinary recent success of the biennial at the Metropolitan Museum of Art in New York as a model. The exhibition will travel to the Museum of Modern Art, which recently executed a major renovation and expansion of its former grounds; the Metropolitan Museum of Art in New York; and the Los Angeles County Museum of Art (LACC). The Los Angeles County Museum of Art (LACMA) originally announced that it would not hold the exhibition, but will now showcase the work in a large-scale exhibition that begins on October 18 and runs through January 4, 2022.“We’re excited to", "The next Biennial should be held in 2020.”While the museum is planning to move the exhibition space to a new space in the city’s Department of Arts and Culture, the institution is also facing growing pressure to close the doors of the museum. On Thursday, August 18, Mayor Randall Woodfin announced that the city would pay $750,000 to keep the Biennial’s doors shut. The money would also go toward securing the remaining twenty-two years of the museum’s lease, which was signed in 2001. The museum management said that the decision to foreclose was not related to the coronavirus outbreak.“The decision to not move forward with the installation of the exhibition was made in the interest of the staff and the city of Bristol. The exhibition will continue to be on view with the assistance of the Biennial’s new permanent home in the coming months, the Biennial Art Gallery in the City Centre, which is expected to open in the summer of 2021,” MCA director Nicholas Cullinan told the Art Newspaper. \n\n\nThe City of Pittsburgh has awarded a total of $1.4 million to thirty-six local, regional, and state arts and cultural organizations. Among the organizations", "The next Biennial should be held in 2022 and will be led by the former director of the San Francisco Museum of Art, Barbara Kruger.\n\n\nThe Toronto-based artist Ruth Garland has announced that she is planning to leave the city to return to her hometown of Croydon, England, to continue her work. Garland, who has staged solo exhibitions at the National Museum of Canada, the Serpentine Galleries, and the Serpentine Galleries, will continue her residency at the Royal Academy of Arts (RA) in London and the Royal Institute of British Architects (RIA) in London. The institution is currently working on a new visual arts master plan for the city. “I am thrilled to return to Croydon, England, to continue my work as a curator and to further develop my studio and exhibition schedule at the RIA, where I’ve had the privilege to collaborate with some of the most talented contemporary artists of our time,” Garland said.A curator since 1980, Garland has exhibited her work at venues such as the Centre Pompidou in Paris, the Hirshhorn Museum, and the Museum of Fine Arts in St. Louis; the Museum of Modern Art, Los Angeles; and Tate Britain. Her work", "The next Biennial should take place in 2020. The exhibition will be an extension of the festival, which will now take place in the heart of the city, in the old Versailles Palace, and will be led by an entirely new artist-in-residence. It will be led by Catherine and Jonas-Emmanuel Ghent, who will serve as the festival’s directors.“Over the years, we have focused most of our attention on the Mondrian–Brechings Gallery, where I have had many years of artistic collaboration with Maud-Henri Bott, and on the Saatchi Gallery in Paris. We have also been keen to present the exhibition ‘The Power of Place’ in the heart of Paris. We’ve always been aware of the importance of conserving art, always thinking that a full exhibition of work in one place was a good idea.”\n\n\nThe Pérez Art Museum Miami (PAMM) is planning to open a new arts and culture hub at the historic Art Museum on the Riverwalk in Miami Beach, Florida, in 2022, reports the Miami Herald. The Pérez Art Museum is one of seven archaeological and historical sites in the city that will be revitalized", "The next Biennial should be held in the spring of 2021. The biennial will incorporate a wide range of new and experimental works, ranging from the classical to the contemporary, and will at its heart address the issues of the contemporary, the contemporary, and the future. In addition, the exhibition will introduce a new concept for the exhibition, which will be called the “Future of Art” and will take up topics such as the influx of digital technology into culture and the integration of art and society.\n\n\nThe eleventh edition of the Istanbul Biennale, entitled “Taksim,” has released its list of participating artists and galleries. The biennial, which is organized by the Istanbul Art Museum and the University of Technology, is hosting a selection of works by thirty-seven artists and galleries. Over the course of eighteen months, the exhibition will present twenty-six new works and thirty-five works previously selected for the biennial.Elena Andreeva, the director of the Museums Association of the Republic of Azerbaijan, has announced that twenty-two works, selected for the exhibition in the past eighteen months, will be presented this year. The works, which were submitted by twenty-two artists and galleries, are \n\n", "The next Biennial should include a lecture by Leslie Ashby (1923–2008). Ashby will present an account of her experiences with the experimental art of the experimental media and the experimental practice. The theme of the event will be “Art and the Media: Intuitive Design and the Camera.”The biennial will be the eleventh edition of the New York Biennial, which will take place at Rockefeller Center from March 14 to March 17. The 2019 edition, which is still being researched and curated, will be held at the Moscone Center in San Francisco. For the 2020 edition, which will be staged at the New Museum in New York and the Oxford Union in Oxford, England, the artists will be the same as in 2019. However, the 2020 event will include a number of new elements such as a new exhibition “Reframing the Narratives” (March 23–April 11), a statement by artist Alexa O’Leary, and a virtual reality installation by artist/director Roger Nunberg. “In a time when we are increasingly disconnected from our physical world, in a time when we are increasingly disconnected from our social worlds, in a time when we are increasingly disconnected from our spiritual worlds, we", "The next Biennial should be held in late June or early July. As it currently stands, the biennial will feature six works on display, including work by curators Robert Irwin (2018) and Cristina Palma (2015), as well as four virtual tours of the museum.The full list of participating artists is as follows:Richard Avedon (2017)Richard Avedon: I Am 2017Richard Avedon: The Day We All Live 2017Richard Avedon: Laundromat 2017Richard Avedon: Picturesque 2017Richard Avedon: Tiny House 2016Richard Avedon: The Weight of My Life 2016Richard Avedon: The Hour I SnappedJanuary/February Berenice Abbott (2017)January/February Berenice Abbott: 2017Richard Avedon: 2017Richard Avedon: 2014Richard Avedon: 2018Richard Avedon: 2019Anouk Baross (2013)Anouk Baross: 2017Anouk Baross: 2017Anouk Baross: 2018Anouk Baross: 2019  & March Berenice Abbott (2009)Anouk Baross: 2018Artists in the group:Arch Masc", "The next Biennial should be in the spring of 2020, and the fourth in February 2021.  Museum director Jeffrey K. Ellison said: “We are excited to embrace the innovative and collaborative spirit of the workshop, which has become a quintessential part of the museum’s mission. We continue to evolve the platform to connect more people with the incredible artworks of our time, and are dedicating our future to the creation of new opportunities for communication and interaction.”Los Angeles County Museum of Art (LACMA), which celebrated its sixtieth anniversary this year, is also collaborating with museums across the country to expand digital learning experiences by introducing new programs such as the Digital Workshop, which launched in 2016 and has been live-streamed on YouTube more than 1.2 million times. The initiative, funded by the Los Angeles County Metropolitan Government (LAGMA), the City of Los Angeles, and Google, will allow the public to explore a collection of over one hundred thousand works by contemporary American artists, including Diane Arbus, Jonathan Bland, Aaron Echo, Laura Owens, Tanya Bonakdar, Neal Davis, and F. W. Murnau.“The Digital Workshop will allow Los Angeles County residents to", "The next Biennial should be held the same year as the first, in 2022. The museum will also announce its design for a fourth Biennial of Irish Art, which will take place in 2021. The final exhibition, “The Art of Life,” will open in 2021.\n\n\nThe Smithsonian’s National Museum of African Art (NMA) in Washington, DC, has received a gift of five hundred photographs by the late American photographer and activist Dennis Wilford. The gift, which was donated in 2006 by a group of artists and collectors led by collector and photographer Rodney Jerrett, comes amid the NMA’s ongoing effort to expand its holdings of American photography.A selection of the photographs will be presented at an upcoming meeting of the Association of Art Museum Administrators (AAMA) in Minneapolis. The exhibition, titled “America: A Photojournal,” will examine the American photographic record through the lens of Wilford’s work, which comprises more than 1,300 photographs.“This gift reaffirms the vision of NMA and its founding fathers to present the winning work of Dennis Wilford in a way that will honor his legacy and inspire future generations,” AAMA president and CEO Vanessa Hayden", "The next Biennial should be held at the Museum of Modern Art (MoMA) in September 2021. The announcement was made on the occasion of the biennial’s 150th anniversary. The 2020 edition will be hosted by curator and curator-at-large Anna Atkins, who will return as head of the exhibition. The event will also be accompanied by a new book, The Roads of Memory, written by the artist and producer Virginia Madeline, and a comprehensive exhibition of works by the artist Karl Kappner, which will mark the opening of a new museum in Berlin.The biennial’s inaugural edition, which ran from October 16 to October 22, 1947, was a platform for the artist to examine his work to a wider audience and engage with the topics of memory, memory politics, and memory sciences. It also provided a forum in which Kappner could begin to create Unseen, a series of installations, photographs, and paintings that will be exhibited in the exhibition “The Congo Gallery;” a forthcoming event curated by Kappner for the theme “Photography and Memory Politics” at the Berlin Biennale (2019) and the artist’s first exhibition at the Leica Center in New York", "The next Biennial should have a theme that addresses the challenges and opportunities of a post-collapse world. I believe we can achieve this in the upcoming exhibition ‘New York: A Retrospective.’ Such an exhibition would include works by key artists of the twenty-first century, such as Richard Learoyd, Mark di Suvero, and Jim Rohn, who will represent their respective cities in the fifty-third edition of the biennial.”The 2019 exhibition was curated by Amanda King and will be on view March 16–March 20. This year’s event will be organized by Ann St. Denis, who has served as the artistic director of the Biennial since 2015, and will take place at Rockefeller Center in New York and will run through May 21.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has launched a new initiative that will help cultural businesses and nonprofit organizations reduce the environmental impact of their operations. The program, dubbed “Be Green Here,” will give businesses and organizations a set of guidelines on how to reduce their energy use, improve their energy efficiency, and utilize green materials and technologies.The guidelines can be found on the city’s website and can be downloaded in Excel format", "The next Biennial should be held in 2020. Honorees include Stanley Black, Adam Clayton, and Rebecca Watson. “In Memory of Martin Luther King Jr.,” a biennial for African Americans, was awarded in 2017. The 2018 edition, “In Memory of Black Women,” featured performances, art, and films on women’s issues. In 2020, the theme for the biennial should be “unapologetic reflection on the art of race and its impact on race relations.”\n\n\nThe Jerusalem Biennale will not be held in the city next year, and will instead hold a “springboard” for new academic work on the city. Its new board of directors announced that it has appointed Stephen Hahn as director, and Osan Eid as chair. He succeeds Orit Staudt, who resigned in August 2019 to continue working as director of the Museum of the Jewish People.“This is a historic moment, a moment of great inspiration, and a moment of great challenge,” said Hahn. “It is especially challenging, as I move into a new chapter as director of the Museum of the Jewish People. And it’s", "The next Biennial should take place in the autumn of 2021.\n\n\nThe Egyptian artist Nima Nabi has been awarded the Florence Prize for his installation Breaking the Silence, 2018–2019, which was staged at the Museo d’Arte Moderno in Florence and won the prize for best work in a single category. Nabi, a Palestinian-born Egyptian artist who also works as a sculptor, filmmaker, and activist, was presented with the award by the prize jury on Monday, which also awarded the prize to the Egyptian-born writer Nima Nabi for his contribution to the “Arab Spring.”Nabi’s latest work, “Breaking the Silence,” which is part of a series called “Planes,” is an open-concept installation that unfolds like a poem and invites the viewer to imagine the experiences of a group of strangers as they pass by in a plane. The open-concept art project, which was inspired by Nabi’s own experiences, is part of an ongoing series examining the meaning and function of language. Nabi first created the work in 2015 as part of his “Modest Equation” exhibition, which was relocated to a different venue for its fourth", "The next Biennial should take place at the Museum of the City of New York in 2021. Titled Bethnal Green, it will take place in the city’s Central Park, and will be inaugurated by a group exhibition of works by American artists. The event will highlight the role of the artist in shaping the history of New York and will feature the first-ever performances by living artists.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has acquired more than eight hundred works by twenty-six artists, including Ean Barlow, David H. Martin, Adam DeCharnley, Billie Chu, Denzel Washington, Jorge Luis Borges, Susan Joseph, Sara Maudling, and Suzan-Lori Parks. The acquisition includes works by artists such as Edelan Oghojian, Vincent van Gogh, Michelangelo Antonioni, Alex Katz, Alberto Burri, Benedict Williams, and Peter Maier.“The acquisition of these works by this Hirshhorn team shows our commitment to the work of the Hirshhorn's artists,” said"]