["The next Biennial should be held in 2022, and an announcement of the date should be made by the institution.The museum has also announced that it will be reconfigured to include an exhibition dedicated to the works of the late French colonialist architect Pierre-Auguste Renoir. The rearrangement, which will take place in the space where Renoir’s work, The Abode of Light (1905), is currently on display, will be completed by 2021. Both Renoir’s work and that of his contemporaries like Cézanne, Picasso, and Rembrandt will be included in the biennial, which will be organized as a sequel to the previous iteration, the sixth, which took place in 2002.\n\n\nThe Museum of Modern Art (MoMA) in New York has hired the artist and educator Kiki Smith as its new curator. Smith comes to the institution from the nonprofit organization ArtPlace, which she founded in 1994 to connect local artists with major museum collections. She will be responsible for developing programming, curating, and holding events, which will help generate interest in work by artists whose work can be found in the collections of MoMA and the Louvre.“Kiki Smith’s curation of modern", "The next Biennial should be held at the National Museum of Arts, London, in 2020. An exhibition of sculptures by the same artist will be staged at the Museum of Modern Art, New York, in 2021. The year 2030 will mark the thirtieth anniversary of the publication of the first issue of Artforum, the magazine in which the biennial was first organized. The last year of the seventy-six year old biennial will be devoted to “art and politics.”  The London-based biennial was founded in 2015 by the artist and political activist Owen Paterson and the Italian-born filmmaker Fabio Cattelan. In an effort to respond to the current political climate, Paterson and Cattelan decided to go into exile from Italy in order to travel to Morocco and Tunisia. They are currently in Qatar, where they will continue their work.“This exhibition is not about an attempt to re-litigate the past but rather, about re-examining the future,” Paterson told the Art Newspaper. “What is required now is a renewed and bolder vision, one that is open to all and committed to the creation of a more just and equitable world.”\n\n", "The next Biennial should take place in 2021.\n\n\nFrench artist Philippe Vuillard, whose sculptural works grapple with questions of beauty and climate change, has died at age seventy-two. After moving to New York City in the early 1960s and spending time in Paris, Vuillard’s work was included in the first Biennial of French Artists (BFA) in Manhattan in 1965, the first in New York in 1966, and the first in London in 1997. Vuillard’s work has been exhibited at the Cambridge Art Museum, the SculptureCenter in Pasadena, the Los Angeles County Museum of Art, the Museum of Modern Art, the Metropolitan Museum of Art, the Noguchi Museum in New York, the Museum of Contemporary Art in London, the Martin Museum in Paris, and the Museum of Contemporary Art Paris.His most recent exhibition at the Museum of Modern Art, which celebrated its seventeenth anniversary last year, was “Acts: The Visual Arts in Modern Life,” which opened on August 8 and ran through September 20. Vuillard’s work is currently on display in “Pleasure of Change” (2017), an exhibition organized by Peter Zumthor, at the Museum of", "The next Biennial should take place at the historic town of Jumeirah in Saudi Arabia, the sixth iteration of the event, which will take place in March 2022, is currently running on a shoestring budget and has faced several setbacks. The Saudi Arabian Ministry of Tourism and Antiquities says the event, which was launched in 2018, will still not be able to secure the necessary funding to start producing works as planned.According to the London Review of Books, the Saudi Arabian pavilion will boast a collection of seventy-five works and will be accompanied by a new literary festival, the Saudi Arabian Book Festival (SABC), and the Saudi Arabian Film Festival (SAFF), which was launched in 2018.The London-based charity Art and Desert, which has been supporting the event, said: “The Kingdom of Saudi Arabia is looking to the future with great optimism. The Kingdom’s Art, Architecture, and Design Department has already proposed an exciting new event for 2022, the Art of the Future 2030, and the promotional campaign for Art in the City 2020 has begun. The Kingdom intends to be a major player in the international arena for art in 2020. We will continue to monitor developments closely and continue to push for a positive outcome for the Kingdom", "The next Biennial should be announced by the end of April. The event will then be open to the public for twenty-four hours a day, seven days a week, with select groups of artists and curators from the UK, US, and Europe.The exhibition will take place in the historic Winchester House, in Winchester, in the city of England, from March 18 to March 21. It will be hosted by British director Pippa Williamson, American director Nielson Adams, and Lithuanian director Maria Loukas.Esther Wilkes, the biennial’s artistic director, said: “It is an incredible honor and joy to have been invited to present this year’s Biennial at the National Arts Centre. It has been a long-term dream of mine to present a biennial at the National Museum of Art, and it is truly a fantastic opportunity to do so. I look forward to working with my colleagues to create a new and exciting exhibition for the National Arts Centre.”\n\n\nThe Diller Scofidio + Renfro–designed Burj Khalifa, a massive mixed-use complex in Dubai, is planning to build a $330 million replica of the 19th-century medieval city, which is being", "The next Biennial should include a discussion of “the role of art and design in changing the face of the city.”It will also feature a selection of works by the artists known for challenging traditional conceptions of aesthetics and for demonstrating the power of art and design in the contemporary world. The artists selected for the exhibition include Pina Bochereau, Helène Berger, Philip C. Huang, Yoshiaki Inoue, and Wangechi Mutu, and will run until March 29. The exhibition will be on view at the Biennial until March 29.\n\n\nThe German city of Hamburg, which has been battered by a series of deadly explosions for weeks, has released the list of seventy-two artists who will participate in the upcoming edition of Hamburg’s Deutsches Kunsthistorisches Museum (DKM) Berlin. Titled “Deutsche Welle,” the show will take up themes of photography, performance, performance, sculpture, and design. The organizers’ decision to invite the city’s collection, which comprises more than five thousand works, stems from a question posed by curator and writer Annemarie Kühn in a preview of the show on December 14: “Is it", "The next Biennial should be scheduled for the end of the year and will be curated by the artist. The theme is “Purity of Vision” and the work will be presented by artist-in-residence and visiting artist-in-residence, Erick and Lisa Seder, who are both based in New York. The exhibition will be led by the curator of photography Raymond Mlada.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Alison Watson as its next director. Watson joined the institution from the Chicago Museum of Art, where she has served as interim director since March 2019. “Alison is an extraordinary leader who has built a strong and valuable record for the MFA as a leader in the field of design,” said board chairman Loring Randolph. “She has inherited an institution that is facing many challenges and remains committed to creating new opportunities for curating, teaching, and exhibiting contemporary art. We’re excited to work with her to shape the future for the MFA.”Watson comes to the museum from the New Art Institute (NIA), where she was director of exhibitions and curatorial programs. During her tenure at the institute, she completed a", "The next Biennial should take place in 2022. The announcement follows Artforum’s Panama City preview, which includes a selection of work on display in a new exhibition of work by fourteen artists in an exhibition in the capital next year.\n\n\nThe British Museum in London has appointed Samantha Black, who served as director of the National Galleries of Scotland from April 2018 to November 2019, as its new deputy director for curatorial affairs. She succeeds Michael Gove, who was appointed director of the National Gallery in London in January 2019, and will take up the post at the institution on August 1.“The appointment of the talented and enthusiastic Samantha Black is an exciting time for the museum,” said Mark Taveras, director of the National Gallery and world heritage complex. “Samantha brings a wealth of experience and knowledge to the museum as we continue to transform our collection to reflect the historical and contemporary heritage of the place where she is based.” A scholar of contemporary art and performance, Black has previously held positions at the Institute of Contemporary Arts, London; the Tate, London; and the Metropolitan Museum of Art, where she was a curator of contemporary art.Commenting on her new role, Black said: “Throughout my career", "The next Biennial should take place in the city in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) has appointed Jennifer Teets as its next director. Teets comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as deputy director since 2015. She succeeds Marta Alÿs, who departed in the summer of 2019 to head the Los Angeles Department of Cultural Affairs, and will assume her responsibilities in October.“We are thrilled to welcome Jennifer to the CMA’s team,” Marc Glimcher, chair of the board of trustees, said in a statement. “Her background and expertise, as well as her vision to build on the museum’s long-standing achievements, make her uniquely qualified for this exciting and challenging role.”In addition to her work at LACMA and on the Los Angeles City Council, Teets has run for governor in California twice, for Los Angeles mayor twice, and for the California Senate. She also served as the vice chair of the board of trustees of the Museum of Contemporary Art in San Francisco and as deputy director of the museum’s new building, the David K. Jacobs Theater, and as a member", "The next Biennial should be held in the spring of 2019 and will focus on the development of a new collection of the artists who are best known for their studio practices. “The Biennial is not a museum, but a platform for the work of the artists who are shaping our present and the future. It is their work that we live and breathe,” said Biennial director Martha Wintour.The Artists’ Workshop will take place at the Art Institute of Chicago (AIC) in Chicago from May 18 to May 19 and will have a total capacity of 150 participating artists. The event will be presented by the Art Gallery of Ontario (AGO) in London from May 19 to May 20 and will be co-organized by Kathleen O’Connell, co-founder of the Brooklyn-based nonprofit Art Market, and Gael Lechowicz.The Artist’s Forum will host its inaugural edition, “A Word From ‘Art,’ at the Art Institute of Chicago on May 20. The event will be hosted by Martha Wintour and curated by Kirsten Allein, with Brenda Mullican, Mark Pellington, and Frances Morris.“I’m", "The next Biennial should take place in 2020 at the Kunsthalle Basel, Germany. The full list of participating artists is as follows:The exhibition will feature new works by artists from sixty-five countries, including the UK, China, China, and France. In addition, the biennial will highlight the work of artists whose work is currently on display in the exhibition.The biennial will include selections from the collection of Sianne Alexander, McKenzie Alexander, William Moulton, Tania M. Nava, José Manuel Pérez-Santiago, and Leonardo Arsht. The first Biennial of New York City will take place at the Schwartz-Paul Rubens Museum in New York on September 25. The second Biennial of Istanbul will take place at the Kolmenajin Museum in Turkey on October 3. The third and fourth Biennials of Venice and Venice, respectively, will be held in the city of Venice in 2020. The 2020 edition of the Oakland Art Museum will be hosted by the California-based nonprofit arts organization ACE. To reserve a seat in the biennial, visit http://www.oaklandart", "The next Biennial should be held on October 20, 2020. The 2020 iteration of the event will consist of two exhibitions: “Art and the Body” (January 21–February 13) and “Pain and the Body” (February 15–February 19).\n\n\nThe Museum of Modern Art (MoMA) in New York has created two new positions in its professional gallery and will direct the next iteration of the show. The museum also revealed that it will be taking the exhibition off-site next month. The move was made to avoid disrupting its February exhibition, “Polar Express: The Art and Science of Polarization.”The institution had previously announced that it would take the show off-site again in March. “After careful consideration, we felt that the best way forward for Polar Express” was to focus on a ‘post-gallery’ experience,” said M&P Global CEO John Guggenheim. “In the words of M&P president Leo Stephanopoulos: ‘A new way to think about art.’ That’s what we’ve done and we’re going to continue to do. We’re", "The next Biennial should be held in December. “I’m sure that Biennials are an important and timely event in shaping the future direction of the National Museum,” Cannès president Catherine Croft said in a statement. “My colleagues and I are working with an international team to consider the best possible space to host a great exhibition in the spring of 2020. We will present a new version of the museum in the autumn of 2020.”\n\n\nThe Art Newspaper has reported that the Israel Museum in Jerusalem is planning to move its filming of the 1967 Six-Day War—the conflict that saw Israel capture the territory of the West Bank from Egypt in a 2008 victory—to the Museum of the History of Performing Arts, marking the centenary of the outbreak of the conflict.According to the publication, the move will allow the Israeli Museum to reflect on the anniversary in greater detail and will also allow the institution to “better appreciate the impact the conflict had on the region and its people.” The move is part of a larger plan for the institution to re-engage with the Palestinian people that was announced in April. The first phase of the re-engagement will see the institution open a new", "The next Biennial should take place in 2021.The exhibition will be organized as follows: 1. Rencontres Allemans (Allemans Gallery, Paris)2. Gesamtoye and Kupchak (Exhibition of Modern Art, CUNY)3. Shirley Truitt’s (Washburn Gallery, New York)4. James Turrell’s (Washburn Gallery, New York)5. The Children’s Museum of Philadelphia (ArchitectureCenter, Philadelphia)6. Contemporary Art at the American University of Beirut (American University of Beirut)7. Martha Keely’s (Martha Keely Fine Arts, New York)8. Lafarides, Art and Politics, (Martha Keely Fine Arts, New York)9. Mimeograph Prize (Museum of Modern Art, New York)10. Mayer Foundation / Artists’ Workshop in New York (Mayer Foundation, New York)11. MIDWESTAKCHUK (Museums and Cultural Sites) in Chisinau (Russia)12. Kasmin,", "The next Biennial should be held in 2020. “I am very excited that we have the opportunity to showcase this unique artwork in the Museum of Modern Art,” said Warren Kanders, the director of the Biennial. “The process of inclusion and collaboration is fundamental to the mission of the Biennial, and I look forward to working with the artist to develop new subjects for the exhibition.”The winner of the 2019 Biennial Award, which is presented by the American Foundation for the Arts (AFA), was Gregory LaTori, whose first solo exhibition at the museum was the museum’s first, “Jesus Christ and the Man in the Moon.” The jury’s choice of the work for the 2020 biennial was made in part by the artist’s request. He received the award in recognition of his work for the exhibition, “The Revolution of Everyday Life,” which is on view in the exhibition “The Bicentennial of John Oliver” until October 21.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it plans to open two new locations, one in Harlem and one in the Bronx, in 2020. A museum spokesperson said the new", "The next Biennial should be held in the summer of 2022. The Art Newspaper reports that the first edition will be at the Musée d’Orsay, the home of Camille Blatrix, Michelangelo Antonioni, Max Beckmann, and Pierre-Auguste Renoir. For the twentieth edition, the actor Shirley Temple will direct and will produce the film Michael Clayton: Paradise City, based on the memoirs of the late British director Michael Clayton. The theme of the twenty-fourth edition, “Sister Stories,” will be “Acts of Sisterhood.”The film festival will be held at the Musée d’Orsay from November 5–11, 2022. \n\n\nThe European Court of Human Rights has ruled in favor of the Museum of Contemporary Art (MoCA) in Rome, Italy, in a case that has the potential to have major repercussions for cultural organizations across the continent. The landmark ruling could ultimately lead to fines and even prison sentences for institutions that ignore exclusionary policies and promote events that aren’t in line with the court’s definition of “pro-European.”“The court", "The next Biennial should have been held at the Max Beckman Museum of Art, which is currently under construction on the campus of the University of California, Los Angeles, in 2021. The festival will feature works by forty artists, including a collaboration with Andre Ellul, the artist who created the first digital painting exhibition in the United States, the World Science Fiction Festival, which will celebrate the 100th anniversary of the exclusion of African American artists from the prestigious exhibition, the Rosenthal Prize.The biennial will also have a larger public-facing, more accessible format, as it intends to incorporate more contemporary works. It will offer programming that addresses themes of place, people, and the natural world, and will focus on themes of the Black Lives Matter movement. The program will also include a new exhibition and mural by the artist/designer Haig Worthy.“The Biennial will make the most of the large amount of work on display in the exhibition space, which will further integrate the biennial into the local community,” said Elizabeth Harris, president of the University of California, Los Angeles. “The new facility is a world-class contemporary art museum with an exciting history. We are excited to work with the Katz to ensure the biennial is a", "The next Biennial should be held in 2020.”After the reopening of the Biennale in Helsinki in 2015, the group behind the exhibition, the Helsinki Museum of Art (LTK), decided to move the event to the city of Kiassel, the capital of the Russian Federation. The museum—which has been closed since March due to the Covid-19 pandemic—was forced to cancel two exhibitions due to the pandemic, and a third exhibition opened in Astana, Russia, but was never closed.\n\n\nNew York artist John Martin, known for creating works that challenge European and American conceptions of history through the exploration of the nature of the self, designed space to display a new collection of his art. The exhibition “Out of Time” will be on view at the Whitney Museum of American Art through October 5.“I have been obsessed with making works that show time as a spatial and not a temporal thing,” Martin said in an interview with Artforum. “I am trying to create space for the possibility that the development of the body and of the self, of the body as a whole, can be a future in itself.”Martin began the exhibition with an assemblage of pieces that", "The next Biennial should be held in 2020. The question of how to present an exhibition has been debated for over twenty years. The question of how to organize an exhibition has been debated for over twenty years. But in the last fifteen years, a new era of art has emerged. The exhibition has changed and evolved as the demand for new works has increased. The exhibition has undergone a revival in recent years, with the first Biennial exhibitions organized by the Guggenheim on the Guggenheim in 2006 and 2011. The exhibition also underwent a major renovation in 2016, when it was reorganized as a modern museum. The program for the biennial will be the same as that for the twenty-fifth Biennial. In order to better understand the challenges ahead, the museum will continue to work with artists from the Guggenheim’s collection and will present exhibition programs in the future. Pace will serve as the organizing principle of the biennial, and the second part of the program will be created in collaboration with the Guggenheim’s collection. The third part of the program will be a selection of new works by artists whose work is currently included in the exhibition “From Time to Time.” The", "The next Biennial should be held in 2021.\n\n\nAllison Wirth, the artist-run nonprofit that supported artists and organizations through the construction and renovation of art spaces in New York City, has been awarded a $75,000 grant from the Museum of Modern Art (MoMA) in New York City. The grant, which was gifted to the nonprofit by the Rockefeller Brothers Fund, was established in support of projects that will enable artists to create new work spaces that are accessible to the general public.“We are thrilled to have Allison Wirth and the Rockefeller Brothers Fund supporting our work and our mission to serve the community through our art space,” said Derek deCose, president of the Mitchell Foundation. “This grant gives artists and arts organizations the opportunity to build upon the work of Allison Wirth and the late Norman and Margot Rockefeller, and to continue to support the artistic and cultural aspirations of Central Park.”The grant will provide funding for the construction of two new work spaces in the arts precinct of the Museum of Modern Art. One of the spaces will be dedicated to artists and their projects and the other will be a meeting and community space. The nonprofit will also receive a $50,000 federal grant for cultural revitalization and", "The next Biennial should be in Marrakech, Morocco, in October 2020; the oldest exhibition in the world; and the final installment in the series of shows that began in 1994.“The Biennial is a stand-alone project,” Michelle Aitken, the director of the Biennial at the Museum of Contemporary Art, Los Angeles, told the Art Newspaper. “It’s a project that’s been in the works for twelve years, and we’ve been working towards it for twelve years. When we’re able to announce our intention to move forward with the show, this is a transformational moment for the Biennial and its future.”The biennial’s creator, Mark Sutton, said: “It is a very exciting time to be working in a different medium. I’m looking forward to being able to utilize the power of art and design to address issues of our time. And it’s my intention to create a show that will address the pathologies of our world and shape the future environment in a meaningful way; one that will foster a sense of community, a shared experience with others who are interested in moving into the future.”The biennial", "The next Biennial should take place sometime this fall. The exhibition was presented at the Venice Biennale in June 2018.\n\n\nThe International Committee of Museums (ICOM) has announced that it is reopening the biennial, which was canceled due to the Covid-19 pandemic, to December 2020. The reopening, which would have taken place in late June, was postponed due to the coronavirus.ICOM makes the announcement with the announcement of the twenty-second edition of the Palais de Tokyo in Paris.“We are extending the opening date of the exhibition to December 2020 to coincide with the opening of the new exhibition ‘Resistance’ at the Palais de Tokyo,” reads a statement issued by the ICAM. “The opening of the exhibition will be a clarion call for resistance,” the statement reads. The opening of the exhibition, titled “Intifada,” was a theme of the inaugural ICAM edition in Helsinki. The inaugural exhibition was organized by the ICAM and supported the reopening of the city’s old subway system, the modernization of the city, the construction of a new cultural center, and the revitalization of the Pont", "The next Biennial should aim to make the photographs accessible to a much wider audience by letting them be shared not only on Facebook but also on Flickr and other sites. The final edition of the show will be presented in May 2020. The 2019 event, which had its opening at the Museo de Arte Contemporáneo, in Buenos Aires, featured work by twenty-four artists, including Diego Rivera, Agustín Pérez-Carrasco, Mario Tamaño, Tejal Shah, and Alfredo Martínez.A selection of works by the same artists will be presented in the 2020 edition at the Museo de Arte Contemporáneo.\n\n\nAn eight-foot-tall bronze statue of Edward Colston, a slave trader, that was built to commemorate the abolitionist and slave marketer David Robert Bennington, who was executed in Georgia on March 13 for his role in the deadly 2014 incident, has been removed from display at the Museum of Art in Boston.The caustic monument, titled David Robert Bennington: A Slave Trader, was installed in 1990 to commemorate the seventy-three-year-old icon because of its staunch advocacy for the civil rights and anti-sla", "The next Biennial should be held in 2020 and be based on a new and innovative platform that will focus on the theme of the biennial, Autobiography, as a means to explore the changing ways that memory and the environment can be used to organise and shape the future. The twenty-third Biennial in Denmark is currently on-going and will follow its theme of Memory and Environments. “The Biennial is a platform for the exchange of ideas and ideas about memory,” said Lutz Bont, chair of the board of directors of the Bjerggæværns Museum. If the Biennial is successful in presenting a new and interesting instrument for the exhibition, its exhibition will be moved to the Bjerggæværns Museum and will resume in 2022. \n\n\nThe New York City Department of Cultural Affairs (DCLA) is suing the Metropolitan Museum of Art over a $500 million expansion of its building in the city, which is currently undergoing a $300 million renovation that includes the construction of a conference center and a museum for the arts. The expansion, which is being financed with $168 million from the MCA, will bring the Met’s collection to the new", "The next Biennial should begin in September 2020.  Currently, the exhibition is on view at the museum until October 28. Following the exhibition, Artforum will publish an issue exploring the themes of the forthcoming exhibition, which will focus on art and the relationship between art and the human body. The final project of the exhibition will be “Life After Death,” a group show for which artist Valentino Furste will create a “posthuman” world.“The new exhibition will provide a broad introduction to the work of the six selected artists, whose practice spans from the deep past to present day, and will include a discussion with Herbert Sze and John Ahearn, the two participants of Biennial 2,” said Biennial director Anna J. Olsztejn in a statement. The exhibition will open on March 14 and run through September 27. The first show is titled “American Art, Modernism and Death,” which is organized by the Museum of Fine Arts, Houston. It is the second show of its kind in the United States. The second shows work by artists such as William Sitz, Norman Rockwell, and Henry Luce. The third and final show", "The next Biennial should take place in 2021. The 2019 edition, organized by the Museum of Fine Arts in Boston, has yet to be relocated.\n\n\nThe exhibitionist-historical revival that has been brewing in Japan for the past fifteen years, as the country expands its network of museums and galleries in an effort to become China’s number one destination for contemporary art, has been dealt a severe blow by an earthquake and tsunami. According to the Japan Times, the epicentre of the disaster was located in the city of Kumamoto, where the exhibition came under heavy construction in April.The museum, which is being built in conjunction with a proposed ¥46-billion ($43.7-million) expansion of the so-called 'Art of the Japanese Landscape,” was already forced to cancel three shows, including a new “New History of Japan,” in June 2019 and a special exhibition “Tales of a Japanese Girl,” in November 2020, amid concerns over the spread of Covid-19. Its next project, an exhibition dedicated to the art of Imai-maru and featuring more than three hundred works by thirty-two Japanese artists, was also postponed.The Kumamoto Museum of Art, which", "The next Biennial should include a 'bioscientific survey of the history of science fiction and fantasy literature, as well as an examination of the relationship between science fiction and contemporary art. ”André Klein, chair of the department of art history, said: “The biennial will be a celebration of a vibrant, yet highly idiosyncratic, history of art, one that will take account of the most recent and most experimental advances in exploration and theory. The new biennial will include a new narrative and a new format, both of which have the potential to introduce new questions and challenges to what it means to be an avant-garde contemporary art historian.”\n\n\nThe Tate in London announced today that it is reopening on March 21 following a £14 million expansion, which added more than 2,500 square feet of exhibition space, an auditorium, an education and outreach building, and more galleries and research spaces. The renovation, which also saw the construction of a new terrace and new galleries, also included the addition of a restaurant, a cafe, a bookstore, and a visitor accommodation and reception area.The refurbished Tate’s new entrance at the Henry Jackson, the Henry V, and the Henry VI—the", "The next Biennial should take place in 2020 and will be hosted by the Museu de Arte Contemporáneo de Barcelona, in collaboration with the Instituts für Bildung und Geschichte Berlin.\n\n\nWhile the United Kingdom is working on securing a date for its next general election, Brexit opponents have launched a new campaign called Vote Leave. The group’s website simply reads: “Vote Leave.” The website also features a countdown clock; a map of the United Kingdom; and a countdown to when the UK will leave the European Union.The countdown clock shows that Britain’s vote to leave the European Union will take place on Thursday, June 8. The remaining members of the European Union—Hungary, Poland, and Romania—will reconvene in Brussels on June 11 to discuss the terms of Brexit. If no deal is reached by June 29, Britain will be forced to cancel the scheduled departure of its citizens from Europe on June 29 and will have to start a new campaign for reopening the EU.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to expand its arts and culture department with a few hundred more positions. The museum anticipates adding between three and five thousand", "The next Biennial should be held at the end of June 2020. The exhibition will consist of three sections: the first, entitled “Beyond the Frame,” is devoted to the theory of painting. The second section, entitled “Humor and Romance,” will consist of three drawings by the artist. The final section, titled “Telling Stories,” will consist of one long text.The Biennial is supported by the Swedish Royal Academy of Arts, the Royal Swedish Academy of Fine Art, and the Swedish Ministry of Culture.\n\n\nThe National Gallery of Scotland has announced that it plans to open a new three-storey building on its campus in September 2020. The new venue will be named the National Museum of Scottish Art and will offer three exhibitions a year. The first exhibition, “Reconstruction: Progress and Decline” will be held at the museum from September 16 to September 18 and the second “Homework on Life: Some Constructions” will be staged in October 2020.It will be located in the city of Inverness, near the Scottish capital, and will offer space for the institution’s annual Scottish Gathering, which aims to connect contemporary art with local indigenous artists. The", "The next Biennial should open in 2022.\n\n\nThe Museum of Contemporary Art (MCA) in New York is planning to open a large-scale, two-dimensional sculpture and installation park in the city. The park, which will be located on the museum’s upper floors, will be called Cascadia, and will be inaugurated by the Japanese artist Ik-Sung Kim’s performance Cascadia: The Precious Treasure of a Thousand Islands, 2019.The announcement comes amid the ongoing negotiations between the MCA and the city of New York over the park’s future. According to the New York Times, the MCA will probably raise an additional $200 million for the park by 2020. The city is also attempting to secure more than $600 million for the project. Last week, the Metropolitan Museum of Art in New York announced plans to create a new, larger place for the museum in a district of the museum called West Village. While the announcement of the new space was made in anticipation of the city’s redevelopment plan, the site of the park is currently undergoing construction. In addition to the sculpture park, the project is also part of MCA’s ongoing plan to create a new urban", "The next Biennial should be the fiftieth, and the theme should be “art as an instrument for liberation.” The fifty-fifth will take place in West Palm Beach, Florida, next February.\n\n\nThe Museum of Contemporary Art (MoCA), which was forced to cancel a number of exhibitions following a fire that broke out in a commercial space in downtown Los Angeles on Friday, January 14, is working with the Los Angeles County Fire Department (LACFD) to examine whether the building’s electrical system is operational and will determine whether the premises should be evacuated. The World War II–themed museum, which was scheduled to reopen on Monday, January 21, has not yet received any visitors. According to the Los Angeles Times, the cause of the fire is under investigation. While the cause of the fire is unknown, judging from the debris left by the blaze, the building appears to have been poorly lit. The firemen have not yet determined the cause of the fire, but believe it was suspiciously high on propane gas. The building is owned by the Italian billionaire and philanthropist Pierluigi Collodi, whose company BF Enterprises is the company that owns the major brands LMCA, Elle, and Lanvin.According", "The next Biennial should take place in Rome in mid-June, and will be the first in the city since the outbreak of the disease in the region.\n\nThe Coronavirus In-Depth (COVID-19) initiative, which aims to educate the public about the global health crisis by hosting thirty-three exhibitions, has released its latest figures, and they show that the global death toll from the coronavirus has reached twenty-six. Globally, coronavirus infections are now the leading cause of death, and coronavirus-related hospital admissions are currently the leading cause of death.The new figures are from the latest edition of the Coronavirus in-Depth, which was held in October 2018. The survey included interviews with more than 2,400 people across twenty-four countries—the United States, Canada, Mexico, France, Germany, Italy, and the United Kingdom—and involved the development and dissemination of more than 5,600 videos, podcasts, and audio recordings.The findings, which were compiled from interviews, news reports, and other sources, paint a dire picture for the many countries that have yet to announce their plans to phase out coal- and gas-fired power plants, or to fully phase out the fossil", "The next Biennial should be held in 2022, and the last in 2020. The series will conclude in 2021.\n\n\nAtlas Obelisk in Athens, Greece, has released a new action figure of the city, the city of the ancient Roman town of Μarabas, which is located in the Caspian Sea between Russia and Turkey. The venue for the exhibition, Art of Life, was inspired by the city of the same name. Created by the Museum of the History of the Future (MOH), the show is dedicated to the life of a human being, the body, the environment, and the soul.The show is divided into 32 categories, including: “Ephemeral Body” (2011), “The Environment’s Body” (2015), “The Soul of the Body” (2018), “The Body of Christ’s Son’s Blood” (2019), and “The Soul of an Angel’s Flower” (2018). The show also features a virtual reality exhibit dedicated to the life of an artist. The first show in the series, “The Life of a Vegetable,” will open at the museum on November 12.\n\n", "The next Biennial should take place in August 2021, at the Museum of Fine Arts, Boston, in the United States, and will be hosted by José Antonio Campos, director of the Museo de Arte Contemporáneo, in partnership with the company Serpa Nacional, and will run for twelve weeks. The theme of the 2020 edition will be “Sicilia y el Chupacamé” and will be “Romance of the Absurd.” The twenty-six artists who will participate in the exhibition are: Alexandre Breton (France), Laura Haddock (Australia), Luca di Lampedusa (Italy), Jorge Ferré (Italy), David Frank (United States), Joachim Georges (Germany), Mario Gonzalez (Spain), Paul Giunta (Italy), Jorge Luis Borges (Spain), Wangechi Mutu (South Africa), Maria Michelle and Diego Maggio (Italy), Dorothea Moss (United States), Benoît Mondal (France), David Salah (United Kingdom), Wael Mughra (United Arab Emirates), Yelena Š", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it will begin a campaign to raise $1 billion for its construction and operations, including equipment and staffing. The funding goal is a serious investment into the institution’s future. “The future of MoCA is at stake,” said museum director Dan Robbins. “We have been working for more than a year to deliver on the promise of our new building and to inspire and educate Los Angeles residents. It is now our duty as board members and board members’ to sustain MoCA through the construction of the museum’s new building, and to shape the future of the museum through the preservation of the museum’s collection and collection experiences. From the moment we announced our plan, we have been working with City Council-designated architect Donald Goldberg and the city’s department of urban design to produce a building that will reflect MoCA’s mission, design, and design details to ensure that this is an institution that can be a catalyst for social change and a site for community engagement.”The campaign will require the restoration of the museum’s former facility, which is", "The next Biennial should be commencing in November 2021. This year’s theme is “The Body: From the Body to the Body,” and the exhibition will focus on the body in intimate settings such as the intimate spaces of museums and hospitals. The inaugural edition, “Body Politics: From the Body to the Body” (2019), included a special exhibition titled “Body Politics: From the Body to the Body” (2019).The 2018 Biennial featured forty-four works by thirty-nine artists, produced by artists and institutions from forty-six countries. This year’s edition, curated by William H. Gass and Laura Owens, was initially announced as “The World We Live In” but will follow a different theme and will include the work of a different group of artists. The exhibition will be held at the American Folk Art Museum in Los Angeles through November 13.\n\n\nThe Gustav Klimt Foundation in New York has released a statement regarding the museum’s decision to remove an exhibition of work by the German artist Klimt (1905–1975). The Berlin-based foundation announced on Monday that it “will not participate in, authorize, or participate in any", "The next Biennial should be in 2020, and the first in 2021.The next Art of the Party will be in 2022. In addition to the usual programming, the upcoming exhibition will include a number of exhibitions, including “Urban Boys: Fashion and the Limits of Modernity” (2019); “Rethinking the Film: Art and Criticism in the Post-War Era” (2019) and “The Logic of the Cinema” (2019–20).“I want to thank everyone for their continued interest in the program,” Lutz Bezold, director of the Länderbund, said. “The exhibition is an important milestone for the museum, and the exhibition will bring much-needed attention to the program. I am proud to center an exhibition dedicated to the history of cinema in Germany, and to invite the world to the museum.”\n\n\nInstitutional Review Board member and longtime art critic for New York’s Museum of Modern Art (MoMA) Jim Steinberg has announced that he intends to resign from the governing body in January 2021 to pursue new creative projects and to launch a foundation dedicated to the art of the twenty-first century. Steinberg’s foundation", "The next Biennial should be held in 2020, and the final will be held in 2021. The biennial will run from October 13 to November 3, 2020, and will feature work by thirty-eight artists. The exhibition will also include a memorial ceremony for the fifty-six who have died in the Holocaust, and the closing of a new exhibition of work by the Swiss artist Wolfgang Hahn. The museum will photograph the exhibition, and the final installation will be a retrospective of Hahn’s work.\n\n\nThe Lyon and Paris Biennials have announced that they plan to cancel their respective biennials in 2021 and 2022. The biennial, which was originally scheduled for the French city of Lyon, also announced that it would postpone the exhibition “Elyse and Henri” in January 2022, and moved the event to the Alpes-Maritimes. The announcement follows the publication of a new report by the French architect and urbanographer Christian Klee, which states that the “hope for renewal” of the biennial had significantly decreased by September 2019, and that the event was now “at a standstill.”Since the canceled event would have taken place in April 2021, the dates of its", "The next Biennial should be held sometime in the first half of 2020, and some of the work that has already been published previously, such as the second half of the exhibition “The Future Is Not What You’ve Imagined,” will be presented again. “We are convinced that the best way forward for the Biennial is to continue as is, without any change, and to have a new exhibition coming up,” said Kathrin Faber, director of the Biennale. Faber added that there are currently plans to redesign the museum. The new design, which will be revealed in May, will bring the Biennial’s entire collection closer to the museum’s main building. The redesign will also improve accessibility and enhance the Biennale’s programming, with the goal of making the exhibition feel more like a “friendship.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Mary Ellen Venters as its next executive director. Venters comes to the institution from the Metropolitan Museum of Art, where she has served as director of planning for the past six years. During her tenure, she has collaborated with MoMA on more than two hundred events,", "The next Biennial should take place in 2021. Renewed criticism of ABVP for its role in violence against women has been made in the wake of the gang-rape of a student in Delhi. A petition by students of Delhi University (DU) demanded that the exhibition be canceled until it cancelled the exhibition “The Vagrants: Double Standards,” which they said glorified the rape of women. The exhibition was actually canceled due to the outbreak of the H1N1 virus, but the backlash against it has led many to question whether the show should go ahead as planned.The controversy surrounding the exhibition, titled “The Vagrants,” dates back to March 22, 2019, when the organizers decided to remove the exhibit “What is feminism?” from its permanent collection. The exhibition was originally curated by former artist-in-residence Harna Chakrabarti and is now based at the Art Gallery in London.  Among the works in the exhibition were works by the exiled feminist activist Janata Dal-USU, which argued that the movement was “not about liberation, but about control over the life and body of a woman’s body.” Standing in for Dal-USU", "The next Biennial should be this fall, the organizers inform the New York–based artist and activist, who is currently incarcerated at HMP Northland. “I’m not sure what we’re going to do,” he said. “I’m not sure what we’re going to do to people, to the planet, to each other, to our governments. I don’t think we can survive this.”\n\n\nThe Institute of Contemporary Arts (ICA) in London announced that Gabor Matías, an artist whose powerful drawings and installations emphasize the physical and emotional complexities of life, has been appointed director. In his first role as director, Matías will lead the ICA through an exhibition that will take up the theme of “The human body and the body parts it can transform,” the body and the image, and the body and the environment, in order to shape the future direction of the institute.“With a sense of humor and a creative spirit that is uniquely his, Gabor forms a pioneer role in the development of a strong and influential independent voice in visual art and is a symbol of the vitality of artistic freedom in a world where austerity and crisis are", "The next Biennial should take place in five years, according to more than a dozen city-appointed members of the community, and will be hosted by the city’s administrative council at a time, in the future, that suits the community.“The city was really looking at a five-year timeline for the redevelopment of its cathedral,” said Antoinette LeBlanc, a former City Council member and the chair of the city’s Cultural Affairs and Development Committee (CADC). “Now it is turning around and saying, ‘What do we need to do in the next five years?’ That is an important step.”Culture minister Anne Fontana added: “The next edition will be about the future. It will be about collaborating with our partners, about how we move forward and about how we engage with our communities. That’s what the City of San José is about; that’s what our city’s cultural institutions were built to be about.”\n\n\nThe Philadelphia Museum of Art (PMA) has hired Jennifer Porritt as its new director. The sixty-six-year-old former director of development and sustainability for the Philadelphia-based nonprofit", "The next Biennial should be 'The Architecture of Life: From Architecture to Landscape' or “The Use of Light in Art in the Modern World”—the first of the seven works to be presented by the director in the coming months. Naima J. Keith, the chair of the curator’s team, said that the upcoming exhibition will mark the first time the director has presented a work in the pavilion of the Aichi Triennale. The exhibition will run from February 11 to February 14, 2020.The museum is currently working on a redesign of the building, which will be made up of a new reception hall, a café, a museum, and a library. The work is currently being carried out by architect Shizuka Takeda, who designed the building for the contemporary art space ART+ with Katsuhiko Hasegawa.\n\n\nThe Hong Kong Biennale has announced that it will cancel the 2020 edition, which was originally set to take place in the country’s capital from March 17 to March 19. The exhibition was going to take place at the Hong Kong Art Museum (HAM) from March 16 to March 19, but was pushed back a week due to the Covid-19 pand", "The next Biennial should take place in 2020, and the first in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it will hold its next general meeting in May. The announcement follows a meeting between MoCA director Nicholas Negrete and the American Federation of Arts (AFA) in New York in April. “We are thrilled, excited, and inspired by the AFA’s commitment to advancing the fullest possible range of contemporary art by building on the expertise and initiatives of its founding members,” said Brian Cullinan, chair of the AFA’s board of directors. “We thank Nicholas and the entire staff and board for their work in bringing us this year’s extraordinary show. We are proud to support their work, and to support the work of our members and allies, in continuing to engage with and advance the work of our founding members in order to create an environment for a better future.”The meeting will be held at the museum’s new home on South Orange Boulevard in downtown Los Angeles, and will comprise an open forum and a question-and-answer session. Participants will be announced in the coming weeks. In the meantime, an open", "The next Biennial should focus on the human experience, the environment, and art through an international community-driven approach that will engage with and explore themes that have shaped the contemporary biennial. A host of exhibition partners and visionaries will participate in the exhibition, which is slated to run from May 5 to May 8, 2021. The twenty-seventh edition of the biennial, “On the Body,” will be staged at the Museum of Modern Art in New York from April 3 to April 5, 2022. \n\n\nThe British Museum in London has confirmed that it will not be able to reopen to the public until at least the end of June. The institution says that the delay is due to the coronavirus, which has yet to be contained, and that it expects the health crisis to last for months to come.The British Museum says that it has already allocated $443,000 from its general fund to help offset the financial impact of the coronavirus, which has been linked to at least 194 deaths worldwide and has the potential to become much worse. The money is being used to help the museum cope with the coronavirus outbreak.The British Council has also pledged to match the £108 million that the museum has raised so far through", "The next Biennial should be held in February 2020.The first Biennial, titled My Body, was held in Seoul in February 2019; the second in July 2020. The event concluded with a performance by the experimental American dance troupe the Rumpus. The biennial was preceded by a book festival in September 2019 and a special exhibition in October 2019. The next edition of the Biennial will be held in January 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) has been awarded a $2 million check by the National Endowment for the Arts (NEA). The check was made in support of the institution’s ongoing work to create a new “Cultural Heritage Corridor” in the city, which delineates the “true potential of the arts. It also comes on the heels of a $1 million grant from the NEA that also supports the construction of a new elliptical-shaped gallery in the city.The NEA’s grant is one of several that have made LA County an environmental icon. In addition to the check, in September 2020 the institution received $1.5 million from the New York City Department of Cultural Affairs (CAB), which pledged to", "The next Biennial should include a “classical-style” presentation of the work of artist Mark Giordano, who died last year at the age of ninety-two; a three-day event in collaboration with the Los Angeles County Museum of Art; and an exhibition of works by artists such as Charles Gayle, John Ostrander, and Maurizio Cattelan.“I’m looking forward to working with the Los Angeles County Museum of Art and the city of Los Angeles to see what they’ve got in the works of Michael O’Connell, and to seeing what we can do with their collection,” said David. “This is an exciting time to welcome artists to New Orleans. Our city is home to some of the most important works of art of our time and we’re committed to working with the artists to make their city even more vibrant.”\n\n\nThe Greek Ministry of Culture is planning to welcome more than four hundred artists and art workers to Athens in the coming months. The ministry’s Culture and Tourism Committee announced that sixty-nine artists and arts workers will soon be able to visit the ancient city, the site of the ancient Athenian capital, and", "The next Biennial should be held in early 2020.\n\n\n\n\n\n\nNancy Sinatra, one of the most celebrated American photographers of the twentieth century, died on August 26 at age ninety-two at her home in Los Angeles. Known for her acclaimed series of portraits of the American aesthetic, she was also a prolific writer, recording more than six hundred essays and short stories in the process.Born in New York in 1943, Sinatra moved to California with her parents in the 1950s. In 1957, at age eighteen, she married photographer Irving Berlin and began the internationally acclaimed series “Born in LA.” Through the photography, she introduced herself to the burgeoning California art world and became an influential voice in the region’s art-world, helping establish the contemporary art-traveling city of Santa Barbara and launching several art-traveling companies, including Art Traveler, Traveling Picture, and Art Traveler Plus. She continued her writing and photography projects throughout the ’60s and ’70s, producing work for such major California magazines as Artforum, the Village Voice, and Artforum Plus.In 1978, she enrolled in the University of Southern California (USC) and became a founding member of the school’", "The next Biennial should be held in 2022, and the first festival in 2025. Indeed, the artist-run space Art Basel is currently working with the UK government to create a new platform for exhibitions, presenting works with the help of a new digital platform, Art in the City, that will draw approximately 1.2 million visitors from March 21 to March 23, 2021. The news comes following the news that the Biennale of Los Angeles, which was set to run from March 17 to March 18, 2020, has been pushed back by one week. “The Los Angeles Architecture Biennial was set to run from March 31 to March 31, 2020, and the Los Angeles Downtown Biennial was also rescheduled,” the organizers of the large-scale event said in a statement. “We regret that this has come as a disappointment to many of you, and hope that you will forgive us if we do not present the third edition of the Los Angeles Architecture Biennial—and the Los Angeles Downtown Biennial—at this year’s event.”The most recent iteration of the annual event, which focuses on urbanism, philosophy, architecture, and design, was staged at the Los Angeles County Museum of Art (L", "The next Biennial should take place in 2020, and the first in 2022. \n\n\nThe National Gallery of Art in Washington, DC, has decided to postpone the next year-long exhibition “The Future Is Present: Futurism and the Modern World” due to the Covid-19 pandemic. The exhibition, which will be held in March 2020, was rescheduled for March 21–March 23, 2020.The event was originally scheduled for March 29–March 30, 2020. The postponement is believed to be in part due to a lack of funds: in March, the center received $166,000 from the federal government’s $2 trillion–per-year stimulus package, and the National Endowment for the Arts had already allocated $100,000 for the three-day event.The announcement of the postponement, which was made on Twitter, follows a report from Artnet that found a decline in visitors to National Geographic’s new headquarters in Washington, DC, as a result of the Covid-19 crisis. The museum, which recently completed the renovation of its former space, is seeking a $30 million boost in funding to continue its expansion, which was completed in 2017.The National Museum of Women", "The next Biennial should be held in 2021 and the first in 2022, respectively. The first exhibition will feature the work of twenty artists including Jamie Crewe, Rob Jones, and David Hockney.The biennial will take place at the Victoria and Albert Museum (V&A) in London from March 25 to March 27, 2021 and will run for twelve months. In addition, sixteen other artists will be invited to return to the museum for a biennial of their work. The twelve winners, drawn from a shortlist formed by the public, will each receive $75,000. The twenty-one runners-up will each receive $50,000.The twenty-six exhibitors who will receive commissions for the biennial include, but are not limited to Anselm Kiefer, David Lipschutz, Bradley Manning, Cara Cohen, Cara Ordway, Linda Lewis, Laurie Nachminovski, Linda Thomas, Lilah Tyrell, Lionel Shauny, Lukaszko Zielinski, Lydia Zielinski, Welch, and Wenzel Wirth.\n\n\nThe Museum of", "The next Biennial should be held in Tokyo in 2022. The British architect and theorist Richard Neutra has also joined the inaugural group of architects, and will design the exhibition “Architecture and Design in Three Acts” at the exhibition space. The exhibition will include the works of seventy-four artists and will be curated by Brenda Myers, director of the London-based Tate and the London-based independent studio the Black Cube. “Our new mission is to create opportunities for new/different approaches to architecture and design, to help the public think through the history of architecture and design, and to help them make sense of the past,” said Nicholas Hoult, director of the Black Cube, in a statement.Last year, the biennial received a significant boost when the British government allowed the Tate to reopen in a significant manner. Under pressure from the LGBTQ community, the Tate agreed to remove two of the works, the matte paintings from the early 20th century and the Richard Ince–designed building in the 1960s, in an attempt to give the biennial a greater public presence.\n\n\nThe London-based cultural nonprofit the Literary Fund, which has partnered with museums and other cultural institutions to preserve and present works by Audrey", "The next Biennial should be held in 2020. “The Tate is committed to the protection of the existing and future of the Tate’s collection, and its exhibitions and research programs, and I look forward to working with the TUMA team to deliver on this,” said Eric Dodds, chief executive of Tate.\n\n\nThe Louvre in Paris has received a gift of twenty-three works by the late French artist Michel Houellebecq, who is survived by his son Mathieu and daughter-in-law Naama. The collection comprises works by Kalaile Bonsu, Benjamin Britten, Pierre-Auguste Renoir, Michelangelo Antonioni, Henri Matisse, Robert Mapplethorpe, Douglas Wheeler, and Henri-Georges Seurat, among others. The museum also unveiled a new Olivier Rouman Chair, which is dedicated to the late Italian architect and theorist Ermanno Meri, and a new lithographic work, “Ascetic” (1947), by the French artist Henri-Georges Seurat. The Louvre also recently unveiled its first collection of major works by Jacques Pereira—an early contemporary with his Seurat/Houellebecq name—a", "The next Biennial should be held in 2021.\n\n\nThe Kunsthalle Basel in Switzerland has announced that the sixteen artists who were invited to participate in its upcoming edition have withdrawn from the event, which is currently on view until February 23. In a statement, the Kunsthalle said: “The exhibition was intensively and directly organized in accordance with the theme of its second edition. In order to proceed with a good view of the program for the first time, the artists had to adapt themselves to a new environment.”The artists who withdrew from the fair include Adam Brodsky, Lina Macintyre, María Berrío, Andrew Chery, Pia Camil, Carl Deender, and Luca Paladini.The fate of the event remains in question after the fair announced that it will temporarily close to the public in March. The announcement came on the heels of the announcement that the exhibition would not be staged in May. The organizers cited the health of the artists and the fair’s participants as the reason for the cancellation.In a statement published by the Kunsthalle, the artists commented: “We are deeply grateful that everybody is enjoying the exhibition and we are confident that the show will resume in", "The next Biennial should be held in the US in 2021. The next Art of the Future will be held in the US in 2021. The Art of the Future conference will be held both in New York and Los Angeles.“We are thrilled to continue to collaborate with artists and the world-class museums in New York and Los Angeles and remain uniquely positioned as an international platform for their work,” said Monica Passantino, director of the Manhattan Museum of Art. The institution opened to the public in 2016, and has since attracted more than 5 million visitors, most of them on foot.\n\n\nIn an effort to slow the spread of Covid-19, the United Kingdom has introduced public health measures including limit flights, limit travel to and from work, and quarantine people traveling within a two-hour radius of where the virus is circulating. On Friday, the government announced its intent to tighten up on air travel, and on Saturday, more than thirty flights were grounded in the UK, including some major international hubs such as London, Manchester, Glasgow, and Southampton. While the UK is currently carrying out a massive campaign to educate the public about the virus, the number of people infected is expected to spike once the weather warms up. According", "The next Biennial should be held at the new institution in late June.\n\n\nThe National Gallery of Canada is expanding its collection with more than two hundred works by prominent contemporary artists. The institution acquired the works from the estate of the late Toronto dealer Robert Irwin, who amassed a vast collection of works by the late American experimental photographer Robert Irwin. The new holdings include works by Max Ernst, Alain Guiraud, Hans-Georg Maassen, and the late Italian sculptor Giacomo Beccaria, and will present the work of Guiraud, Ernst, Maassen, and Ernst and Moritz Sager, among others. Guiraud’s collection comprises more than 1,300 works and includes photographs, paintings, sculptures, collages, prints, and drawings as well as original negatives and lithographs.The National Gallery of Canada has long been considered one of the most important cultural institutions in Canada. Guided by an executive committee consisting of former director Marcel de Trockel, the institution opened up a new $78 million building in 2006 to house its collection and has since expanded its collection by more than eight hundred works. The institution is also working to return more than three hundred works to its former home in Montreal, which it has", "The next Biennial should be held in 2022. \n\n\nThe Museum of Fine Arts (MFA) in Houston has received $2.5 million from the American Federation of Arts (AFA), the Charles and Lucille King Family Foundation, the Jane and James Ike Foundation, and the Stephen F. King Family Foundation to support a new collection and preservation initiative. The funds will allow the museum to create a new permanent collection of works by artists such as Pierre-Auguste Renoir, Gustav Klimt, and Renata Martinelli, and will serve as a roadmap for the conservation of the institution’s collection. “We are grateful for the generous support of our donors, who have given us the opportunity to develop a new curatorial and curatorial-historical program for the museum,” said Michael W. Hunsdon, chairman of the museum’s board of directors. “We are committed to the King Family Foundation’s artists and their legacy, and carefully consider the value of the works in our Heritage Center, the King Family Collection, and the permanent collection. We will continue to do our work for the King Family, and serve as a vehicle for their legacy, through exhibitions, collections", "The next Biennial should take place in 2023.\n\n\nThe University of Edinburgh’s Institute of Art was informed on Monday that it has been given permission to start construction on its new £119 million Arts and Culture Centre, which will be situated in a former factory building on the campus of the university, as early as 2021.The news comes amid a period of transition for the institution as it tries to navigate its way through a restructuring of its collection, which is currently undergoing expansion, and continues to rebalance its exhibitions and concerts to meet the changing needs of a growing student body.“The Centre will offer a range of cultural and social activities and will be home to the University’s largest and most ambitious exhibition space,” said Elizabeth Anagnos, the chair of the university’s executive leadership. “This will be a defining moment for the institution as it embarks on its journey to create a new chapter in its rich and inspiring history. We are humbled and delighted by the opportunity to present the world’s most outstanding art at a time when the university is reopening and can’t wait to start the renovations.”The Centre will be inaugurated by the upcoming exhibition “The Central Role", "The next Biennial should be held in 2022\n\nThe Budget for the 2020–2021 Budget for Biennial is currently being negotiated by the MPs. If the association agrees on the budget, the dates and the locations of the show will be decided by the parliament. If the two sides cannot agree on a budget, the event will be postponed.The Parliament member from the Democratic Party, Maria Ljubljana, said: “This is a once-in-a-generation opportunity to draw in the entire country and bring together the world’s most beautiful cities in a spectacular setting. The UK’s architectural heritage is at stake and we must act now to protect it.”\n\n\nThe northern Italian town of Pastaza, which has been ravaged by the ongoing fire and floods of the Tavola region, has announced that it is preparing to reopen as early as April 20. The town of about two thousand people has been evacuated and is trapped in a holding pattern due to the coronavirus, which has already infected more than 2,800 people and caused 3,000 deaths. The only way in which people will be able to leave is by air, and the only way to leave is by land, as the only", "The next Biennial should be held in 2021. \n\n\nThe largest international contemporary art fair in Japan is gearing up for another edition, this time focusing on Japanese art, with the announcement of the 2020 edition in Osaka. The 2020 edition will take place at Tokyo DisneySea from April 21 to April 25 and will feature more than 200 galleries, art historians, and other curators from twelve countries: Italy, France, Germany, Italy, Japan, the United Kingdom, and Sweden.The 2020 edition will be hosted by the Yokohama Art Museum and organized by Tokyo DisneySea, which is currently undergoing a major expansion. The expansion will increase the exhibition space by 1,600 square feet, and the fair will include an additional ninety-six seats. The 2020 theme is “Art of the Modern Age” and the 2020 pavilion will be dedicated to Art of the Modern Age. The 2019 edition featured works by forty-three international artists.The 2020 edition will include works by fifty-one Japanese and fifty-one international artists from fourteen countries: China, Japan, Korea, Malaysia, New Zealand, Peru, and Russia. “This is a defining moment in the history of art,” said Takashi Kawamura, director of Tokyo Disney", "The next Biennial should be held in 2022.The programme, which celebrates the life and work of the twentieth-century British artist-activist, will be curated by the Biennial’s artistic director, Jamileh Alkhafaji, and will take place in Algiers’s Al Madinah castle. Alkhafaji will serve as the artistic director of the fifth edition of the Biennial, Almaden Biennale, which will take place at the same location in 2022.“The Biennial represents a long-overdue moment of renewal,” Alkhafaji said. “Since its inception, the Biennial has been a platform for artists to build their artistic identities and build their own visibility, thus producing a lifeworld for art and culture. It can no longer be ignored. We hope that the next edition of the Biennial will contribute to the ongoing work of the artist and inspire others.”The event will run from March 22 to March 24. The first round of the biennial will be on March 5–7, the second on March 11–13, and the third on March 19–March 21.\n\n\nThe Noguchi Museum in New York has received a", "The next Biennial should consider the role of the archive in the process of digitization, preservation, and access, and its potential to engage with the public, both as a resource and as a source of knowledge.\n\n\nThe Friedrich Kohler Collection in Berlin has announced that its holdings will be made available as part of a major renovation project that will be completed in the spring of 2020. As part of the Künstler Kunsthalle Berlin (KUNSTB), the collection will be reconfigured as part of a major expansion and renovation project that will also include the acquisition of more than 1,600 works from the collection.The Kunsthalle will also renovate the site of the Kunsthaus, which is currently undergoing a major expansion, and the gallery will host a series of exhibitions on a new digital platform. The Kunsthaus will open in the new space in the Künstballe Kunstbau (KUNSTB) in April. The Kunsthaus in the Künstballe will also present a new exhibition of work by artists such as Wolfgang Paalen, Hildegarde Pinder, and Urs Fischer in April. KUNSTB will be renamed KUNSTBhaus and will", "The next Biennial should be held in 2020.  “We are pleased to see that the new owners of the building, the Prince Alwaleed Foundation, have retained the vision of the past for the collection and the future of the exhibition,” said Kate Snow, director of OGG. The opening of the exhibition will be on October 25 and will run until December 8. The biennial will focus on the life and work of Tunisian artist and activist Ali Baba and will feature works by thirty-four artists and twenty-nine galleries.Also participating in the exhibition are the first-ever works by Syrian artists Rashid and Wael Ghobash; works by Yemeni artists Ali Ayad and Ahmad Al-Hamdan; and a selection of photographs by Morocco-based artist Hisham al-Hashemi.“The contemporary art of the Saudi Arabian Peninsula is changing rapidly, and we are eager to provide a platform to this change,” said Riyadh-based artist and curator Hisham al-Hashemi. “Arab artists are faced with considerable challenges as countries such as Egypt and Morocco push back against their country’s artists’ rights, privileging commercial interests over artistic freedom. Ali Bab", "The next Biennial should be in March 2021.The announcement follows the finalization of a $1.5 billion renovation project, designed to usher in a new era for the museum, which was scheduled to open in 1968, that was halted in 2015 over a lack of funds. The redesign was led by the Italian firm Giammarpelli and is being carried out by the Italian firm Dini+Lange, which has previously designed the Mare di Avignano, the Girardini, and the Marrakech palazzo. More information about the renovation project and a full list of participants will be released in March 2020.\n\n\nThe Egyptian Museum of Art (EMAM) in Cairo has received a gift of more than six thousand artifacts from the Egyptian ruler Anwar Sadat. In a ceremony held on January 20, the institution received a pair of bronze statues that were dating from the reign of the late king and were dedicated to his wife, Gamal Abdel Nasser. The artifacts, which were donated by the Egyptian government in honor of the twentieth anniversary of the inauguration of the nation's first museum, were gifted to the museum by Sadat in gratitude for his work in building the museum.According to the New York Times", "The next Biennial should take place at the Künstlerhaus in Vienna, the Künstlerhaus, and the Fürstkerkalerie. The third Biennial will be held at Kuijs, the Fürstkerkalerie, and the Nationalgalerie in Vienna. The fourth will be held at the Nationalgalerie in Berlin. The fifth will be held at the Museum of Modern Art in New York. The new Künstlerhaus will open in April 2021. The Nationalgalerie will open in March 2022 with the exhibition of the artist’s London-based group exhibition The Y-Light Group Show.  The Künstlerhaus will open in March 2022 with the exhibition of the group exhibition The Sledge. The Nationalgalerie will open in March 2022 with the exhibition of the artist’s work The Magician, from his latest project, After the Mistle, at the Kunsthalle Basel. The opening is part of a wider strategy for the Kreuzberg institution that will involve an increase in the exhibition calendar, the reinstallation of its collection, and the acceleration of the museum’s expansion. The Kre", "The next Biennial should be titled “Beyond Shakespeare” and will be held in late spring.\n\nThe Leonardo Center in Florence is holding a special exhibition of works by Italian artists, which was originally slated for March 31, 2020, and has postponed the event to March 31, 2021. The exhibition, entitled “Fabio Martini: My Life and Work,” has been rescheduled for March 31, 2021.The Milan-based artist, who is known for his large-scale murals, has been called the “father of modernism” and has been featured in numerous groups and solo exhibitions, including the Venice Biennale (2016) and the Thes Art Biennale (2015). His work will now be exhibited at the Milan Museum of Art and the Palazzo Cortina in Venice in March 2021.“I have always been fascinated by the painting of water, its ability to adapt and become a living thing,” Martini said in a statement. “My early paintings, which are based on watercolor, were already inspired by the rivers in my hometown, where I grew up. I moved to Milan in the late 1980s to pursue my artistic interests, and later I painted", "The next Biennial should take place in 2021.\n\n\nThe Shandong Museum of Art in China has announced that it will suspend its exhibition, “A Celebration of Life and Art”\u0097a program that was scheduled to run from March 12 to March 22\u0097and instead focus on creating a new exhibition, “A Celebration of Life and Art: Art and Life of the Sinuous Century.”The Shandong Art Museum was created in 1986 in Shandong, Wuhan, China. Since its inception, it has staged seventy-nine exhibitions and has hosted over one hundred thousand visitors.The institution announced that it is planning to suspend the exhibition and its programming until March 31. The decision has been made after a review of the biennial, which will be moved to a new location in 2020, and has been made in order to “concentrate more on the creativity of the present and less on the future.”Commenting on the decision, Shandong Art Museum director Wang Wei told the Art Newspaper, “The main reason behind the move is the exhibition that will be held at the Shandong Art Museum in 2020,” according to Artnet. He added that the Shandong Art", "The next Biennial should be a celebration of the people of Port-au-Prince, whose vibrant, multiracial communities have sustained the city of Port-au-Prince and the United States as a whole. The theme should be “Portraits,” a designation that signifies the rich and diverse visual traditions of the people of the country. The event’s inaugural edition was held in September 2019.The 2018 edition saw a total of 122 works from ninety-nine artists chosen by the biennial’s board of directors. The full list of participating artists is as follows:Amanda Alves-Alves (Brazil)Addameerai (Australia)Scandinavian/Caucasian (Sweden)Celine Aiguil (France)Cindy Giard (France)Cindy Jones (Australia)Cindy Li (Australia)Andrea Lobo (Brazil)Adrienne Alemani (Italy)Aruna M. Trivedi (Italy)Thea Phillips (Australia)Beth R. Antilla (Italy)Berenice Abbot (UK)Bennie G. Andrews (UK)Bennett Gifford (Australia)Bertrand Barbour (UK)B", "The next Biennial should be held in 2021. The museum will decide on a theme in early July.Museum director Michele Tosi said: “We are now in the process of establishing an effective strategic plan and plan for the future of the Biennials and our ambitious Festival. Our vision is to create a new way of thinking about art and collaboration between Barcelona and Madrid through a combination of new and innovative works in collaboration with our partners and the global community.” \n\n\nThe late Israeli writer Yair Hochner, whose art was influenced by a variety of influences, including Vivian Le Guin, Zadie Smith, Pierre-Auguste Renoir, and Edvard Munch, has died at the age of eighty-five.Born in Jerusalem in 1942, Hochner moved to Paris at age sixteen and graduated from the prestigious Ecole Polytechnique in 1949, only two years after his arrival in Israel. He enrolled at the Institut française d’Arles in Arles, France, but left the philosophy and art-world for the United States in 1957 after learning that the institution was the birthplace of Picasso, Munch, and (since disappeared) Rembrandt. He continued his studies in", "The next Biennial should start in the autumn and would launch with the exhibition in 2022. The exhibition would be hosted by the city of Milan and the Milan-based organization, Dietrich Bahn, who in October 2018 was appointed as the new director general of the city of Milan. Deborah and I would serve as the artistic directors’ new board of trustees. We were also invited to lead the exhibition in 2020 but declined because we didn’t believe we were ready. It was only when we were contacted by Stefano Dalla Bultema, the Italian deputy culture minister and the chairman of the Bultema Group, that we were finally given the opportunity to lead this year’s exhibition.We once again thank all of our partners for their collaboration and support during the two years of the exhibition. \n\n\nAs the number of people infected with the coronavirus continues to rise, more organizations are launching initiatives to help the global community stay safe and healthy. The World Health Organization (WHO) estimates that more than 11 million cases of the virus have occurred in the countries of China, India, and Pakistan. The coronavirus has also been found in Nepal, Cambodia, Indonesia, Mexico, and Peru. While coronav", "The next Biennial should be themed “Living Worlds,” and will be held at the Christ Church, the Universität Münster, and the Universität Bonn in 2020. In the meantime, the exhibition will continue to be hosted by the Museum Freie Kunstverein Berlin (MFB), where it is currently on display from February 28 to March 3, and will also be staged in the cities of Düsseldorf and Essen from March 18 to March 21.The exhibition’s curator, Klaus‐Dieter Groh, said: “The theme of the exhibition is ‘living things.’ And the way we develop the exhibition is through the interplay of curating, theory, experiments, and research. The upcoming years will bring us ever closer to living systems, and one of our main goals is to create a real live sculpture environment on the body. The exhibition will also present a new version of the work in the coming months.”\n\n\nThe woodworking and painting department of the London School of Economics (LSE) announced today the launch of its advancement fund for artists, art workers, designers, and writers. Launching in October 2020,", "The next Biennial should be held at Tangerashindra in Kochi, India, in 2021. The theme of the next edition is “Life After Death” and the theme of the next edition is “Life After Death”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has appointed Rebecca A. Nisbett as its next director. She succeeds Elizabeth Clarke, who left the agency in April 2019 to become deputy director of the Metropolitan Museum of Art, and takes up her new post in October.“Rebecca has demonstrated a remarkable track record of innovation and leadership as a curator and educator, championing the work of underrecognized and underrecognized artists and creating transformative experiences for audiences across the city, state, and country,” said Carolyn Trotman, chair of the department of cultural affairs. “Her background and expertise in contemporary art and her demonstrated commitment to the arts and community ensure she will continue to advance the DCLA’s mission as a championing contemporary art as a vital vehicle for social change.”The agency was founded in 1986 as the brainchild of Thomas K. Higgins, the founder of Higgins & Higgins, and his wife, Paula. Higgins & Higgins is a", "The next Biennial should take place in 2021, and the exhibition should focus on the interrelationships between mathematics, politics, and the body.The artistic director of the Biennial, Johanna Andre, said: “My generation has become very well known internationally, and I want the next one to be a celebration of life and its capabilities. We have created an exhibition that represents the best of contemporary art and we are honored to be the first to present it here in Berlin. I am incredibly proud to be the Paris-based artist that created the exhibition.”The museum, which has a current list price of $5.3 million, is currently undergoing a $40 million redevelopment project. The renovation, which is expected to take four to five months, will involve the removal of the pavé and the construction of a new exhibition space. The program will include more than 100 works by artists from the biennial as well as works by other biennials and “post-biennial” artists.\n\n\nThe Museum of the City of New York (MoCA), the Museum of Modern Art (MoMA), and the Whitney Museum of American Art have withdrawn from the 2019 Whitney Biennial in New York City, which was canceled amid the pandemic", "The next Biennial should focus on the history of contemporary art and the lessons learned from its achievement, reflecting the emergence of a new, global discourse about art in the twenty-first century.”\n\n\nThe Museum of Fine Arts (MFA) in Boston is preparing to open its new headquarters in Cambridge, Massachusetts, later this month. The museum will employ more than a hundred people, including fifty artists from the MFA Modern Art Collection, and will boast a twenty-four-car garage. The Massachusetts-based company that owns the MFA, the Massachusetts Museum of Contemporary Art, and the National Gallery of Art (NGA), announced that it will engineer the building of the museum’s pavilion, a 4,000-square-foot space that will be located in the building’s basement, to withstand the rigorous demands of a construction project, which has been completed in part thanks to a $43.5 million federal grant.The project, known as the pavilion 2, was completed in March and is expected to be complete by the end of the month. The building, which will house the museum’s permanent collection, the institution’s archives, and the cultural center’s concert venues, is being constructed in", "The next Biennial should kick off in October 2021 and be open to the public. The theme will be “The Future Is Present.” The 2020 edition was organized by the New York–based nonprofit the St. Louis Art Museum; the Riga Art Museum, Latvia; and the University of Bristol.\n\n\nThe London-based dealer who sold the work of the British artist Bechdel from the artist’s collection to the Museum of Modern Art (MoMA) in New York for $12 million in 2015 has apologized for misleading buyers and claims that it was a “techne” work, not one of his. The museum confirmed that the piece is not from the artist’s collection, but said that it “regretted its use in the exhibition.”A statement by the dealer, who is currently involved in a legal dispute with MoMA over the sale, reads: “The exhibition was not ‘technology’ but ‘the future.’ This was aimed squarely at the contemporary and, for the first time, it failed. The show had great potential but failed because of the exhibition.”The museum uses a new institutional model, which allows a museum to secure a work’", "The next Biennial should be on August 18–August 20, 2020. \nIwona Pindell, president and CEO of the Hamburg-based independent organization Artforum, said: “At a time when art museums are being forced to close due to the coronavirus, and museums are facing an ever-shrinking world, it is essential that galleries continue to thrive. This will only be possible through a strategy of creative collaboration between museum directors and artists.”\n\n\nA group of artists and arts workers in Leeds who refused to leave their homes and workplaces on Saturday, June 9, in protest of the Covid-19 pandemic have been banned from the city next year. The artists’ decision to join an international campaign in support of the local economy led to an action in support of the arts at the British Museum (BMA) on Tuesday, June 13.“The arts are the backbone of Leeds’s economy and we have a responsibility to support them,” BMA director Brook Andrew said in a statement. “By refusing to cooperate with the coronavirus, the artists are saying that this is not an emergency, but a crisis that needs managing.”The arts workers’ decision to join", "The next Biennial should take place in 2021.\n\n\nThe Galleria\n\nThe Galleria di Bocca in Venice, Italy, closed for a third year following a fire that broke out in an appliance factory on December 9, 2017.The fire, which was triggered by a malfunction of a large-capacity gas-fired oven, was extinguished by the Italian city of Venice on January 6, but the building, which houses 20,000 objects, suffered structural damage and remains closed today.“We are deeply concerned about the future of the building, and our team members have been working nonstop to prepare for the possibility that the building will reopen,” said director Carlotta Galli.  Galli added that the renovation of the building, which was completed in 2017, had already taken place, and that the construction of the exhibition space was not affected. The building, which was renovated by Italian State-owned firm ADAG, came under fire for its lack of fire-detection systems and ventilation systems after a fire in a large apartment building, which was also built into the same complex, occurred on December 14, 2017. The building, which houses 140 people, was converted into a temporary exhibition space for the exhibition “‘", "The next Biennial should be held in 2020, and the next will be in 2022. The first exhibition, “The Mummies in Cairo,” was staged in 1927. After the Egyptian revolution, the exhibition moved to a new site in 1929, and it was staged in Cairo until 1968. The Cairo Art Biennial, announced last year, would focus on the city’s complex “circulation of the Nile.” The British Museum in London announced a new commissioning of a biennial of Mughal art in October. Both the British and the Egyptian pavilionees are participating in the 2020 edition. The exhibition, titled “Mughal Art and the Modern World,” will be held at the British Museum until December 20, 2020.\n\n\nThe Rubell Foundation, which supports the efforts of artists and architects in the United States to create new works of art, has awarded $100,000 in grants to thirty-five artists. The recipients are Mayank Agnihotri, Apastyaa Agnihotri, Alia Camil, Alex Chiu, Mora Caja, Joseph Holbrook, Sara Cwynar, and Enoch Weiss.Agnih", "The next Biennial should be held at the Museum of Modern Art in New York in 2020, and the show should be presented in 2021. The 2020 event will feature work by seventy artists.\n\n\nThe National Gallery in London has welcomed artist-in-residence Frank Gehry and his wife, Barbara, to the institution. The couple will begin their three-month residency in September, following a September launch of Gehry’s new museum-format installation, “The Train,” which will inaugurate the Museum of Modern Art (MoMA) in May.The Gehrys first completed a solo exhibition at the institution in 2019, a survey of the works of another Gehry-born artist, Kathleen Hanna, in the May/June 2020 issue of Artforum. The work, titled “The Train,” is a multi-layered installation composed of new and used materials and comprises a film of the London Underground, the High Line, and the Houses of Parliament. Both Gehry and Hanna became entangled in the city in their careers. In 2020, the couple will be joined by Hanna’s daughter and by another Gehry-born artist, Amalia Carr, to create “Frank Gehry 2.0,", "The next Biennial should focus on the work of the artist-in-residence, who is currently serving a twenty-month sentence at the San Quentin State Prison in California. “I think that the next Biennial should focus on the work of the artist-in-residence, who is currently serving a twenty-month sentence at the San Quentin State Prison in California,” said art director Robert DeLong. The institution previously held two inaugural editions, which focused on the work of Nari Ward and Amy Sherwood-Suss. The first, “Nari Ward,” in 1969, featured a selection of work by Ward, while the latter, “Amy Sherwood-Suss,” in 2011, featured a performance by the pair. The 2020 edition will be held at the Brooklyn Museum, on the Lower East Side, and will feature work by thirty-one artists, including Tina Jacob, Bernardo Paz, Jes Fan, and Yelena Jumeljeva. The 2019 edition, “The Body,” was staged in Berlin, Paris, New York, and San Francisco.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released", "The next Biennial should focus on the history of the city’s tri-state area, and then trace its development in terms of the works that have been completed and the activities that have been organized. In the past, the city of New York has organized annual exhibitions in the city’s art galleries as an effort to highlight the work of local artists, but this year’s triennial will be different: it will be an attempt to address the city’s cultural landscape as a whole.The announcement came on the heels of the city’s announcement that it would spend $1 billion to reorganize its transportation infrastructure to make the city more resilient to the effects of climate change. The city also announced that it will begin phasing out fossil fuels from its power plants and move to a renewable energy model. In addition, it will invest more than $500 million into public arts and cultural spaces, and will launch a revitalization plan called New Yorkers for the Arts.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Sarah McInerney as its next executive director. McInerney comes to the institution from the Walt Whitman Foundation, where she has served as deputy director since 2015. She succeeds Sarah Schroth", "The next Biennial should take place in 2021. The 2019 edition, titled Lula: The Architect of the Impossible, was staged at the Art Institute of Chicago and premiered on PBS.\n\n\nThe Smithsonian’s National Museum of African Art (NMA) in Washington, DC, has received a gift of sixty-five works from the African American collection housed in a former Methodist church in the city of Birmingham, Alabama. The donation includes works by seventy-seven artists, including Abdi Abdirahman, James A. Porter, and Michel Foucault.The works were donated to the institution by a group that called itself the Heritage Fund, a multi-million-dollar group that empowers African American artists through grants and fundraising. The organization was founded by Roberta Smith, the founder of the Birmingham-based arts company the Creative Artists Agency, and her husband, Thomas Smith. The partners were also the primary donors of more than ninety works, including works by artists such as Dorothy & Anezike, Aaron Caspi, and Michael Clement.The group established the NMA in 2008 to increase the visibility of African American art and to encourage greater understanding of the history of African art through the collection", "The next Biennial should take place in the spring of 2020 and would be organized as a platform for exchange and collaboration between artists and scholars in different disciplines of art. The inaugural exhibition, “The Third Wave,” will showcase work by thirty-seven artists.The year 2020 will mark the 150th anniversary of the Swiss artist Maurice Maar. The exhibition will open with the painting of a strange-looking woman, a result of Maar’s experiments with light and shadow, and will feature the work of thirty-seven artists. “The artist’s vision is to present an exhibition which addresses the very nature of man as he exists today and which engages with the concepts of time, space, motion, movement, the body, the environment, and the environment’s own qualities,” said Valentin Delat, director of the Swiss Ministry of Culture. “The construction of the exhibition is a test for the artist, for him as an individual, for the museum, for the profession as a whole, for society as a whole, and for the whole world.”\n\n\nThe American Federation of Art is raising funds for the creation of an endowment to help support the artistic and cultural careers of the", "The next Biennial should be held in the city next spring, after the celebrations of the birthday of the city’s founder, Karl Luegge. The event will take place in the new building of the city’s department of cultural and creative activities, which is currently being renovated.The biennial will also feature music, art, and performances. The theme for the inaugural edition was “The Dada Museum,” and the program will focus on the creation of new materials, including new art. The first exhibition will be “The Experimental Dada,” which will run from March 20 to March 22. The second will be “The Struggle of the Instrument,” which will be presented by the artist Nan Goldin, who was imprisoned for her part in the 1989 murder of Edward H. Alexander, and will open on May 14.The exhibition is being organized by the Los Angeles County Museum of Art (LACMA), the Los Angeles County Museum of Art (LACMA) and Warner Bros. and will span three decades. The exhibition’s curators, Willy de Villiers and Rosemarie C. Imhof, are two of the five invited to design the pavilion. The 2018", "The next Biennial should take place in 2022. The date of the final exhibition has yet to be decided. Prior to the project, Katja Suttner, artistic director of the Berlin Biennale, was awarded the Deutsche Katze diademark. \n\n\nThe Noguchi-Bosch Foundation in New York has awarded a $1 million grant to the University of Michigan in Ann Arbor, via its Noguchi-Bosch Legacy Fund, in recognition of its contribution to advancing art in the United States in the past ten years. The organization works in partnership with the artists and institutions identified in the grant, which was awarded to the foundation in 2018, and is an arm of the artist-in-residence program founded by Noguchi-Bosch collaborator Bruce Ahenake. Together they raise funds for the Noguchi-Bosch Legacy Fund in support of the legacy artists who have signed the foundation’s annual pledge of $1,000 each.“We are honored to announce that this year’s Noguchi-Bosch Legacy Fund grant will be made in support of future generations of Noguchi-Bosch Legacy Fund artists,” said Bruce Ahen", "The next Biennial should be held in the spring of 2020.  “I’m deeply impressed by the thoughtful and deliberate leadership that Museums England gave to the development of the new Biennial,” said Lord Hutton. “If the Biennial has taught us anything it is this: that we can develop and transform our communities and environments to meet the changing needs and needs of modernity. That is what we are going to do in the coming years. I am delighted to be a part of the next one.”Earlier this year, Lord Hutton announced that he would step down from the board of the Royal Society of Arts in September 2020 to return to his home in Chelmsford, England. Lord Hutton will serve as a special advisor to the new trustees until the end of the next Parliament.\n\n\nNadia Essoy, the twenty-nine-year-old British artist and documentary filmmaker whose work grapples with questions of identity, migration, and the self, died in Mosul, Iraq, on December 17 at the age of twenty-eight. Her death was confirmed by her parents, Adam and Nia. The family confirmed that the cause was “narcissistic.”Born in", "The next Biennial should focus on the production of works by women artists and should be organized around a theme of ‘women’s rights’\u0097this should be a way of connecting with the art and culture of the contemporary United States. The museum should also begin a dialogue with scholars and other cultural producers, particularly those from the Pacific Northwest and South, to gain their knowledge and to help them understand the current global situation.\n\n\nThe forty-third edition of the Berlin Biennale has announced that it will move the exhibition from September to October. The news comes after the exhibition, billed as a “spiritual journey,” was canceled last month by the German government after it announced plans to hold it later this month.The event, which was co-organized by the FEL, the German cooperation group for arts institutions, and the Berliner Straße, was supposed to take place in September. The cancellation prompted the FEL to organize a protest in the city of Mannheim, which has hosted the show since 2010, and in March, when the exhibition was still scheduled to open, a police action was held outside of the exhibition space. The Berlin Art Week in May and the German pavilion at the Venice Biennale", "The next Biennial should have taken place in the spring of 2020. However, the process of organizing a biennial has proven to be a challenging one for the city, which was also struggling to refine a new, more comprehensive public health plan in the aftermath of the pandemic.The city’s next board meeting will take place on October 18.\n\n\nThe Smithsonian’s National Museum of African Art (NMAA) in Washington, DC, has received a gift of twenty-five works by twenty-three artists, including the late French masters René Magritte and Georges Aposté (both of whom were featured in a 2015 exhibition organized by the institution), from the artist’s estate. The institution also revealed that it received two rare works by the late Egyptian director Salah Davidou (R as well as a painting by the Egyptian artist Naguib Mahfoujali) from the artist’s collection during a 2015 tour of the museum.“The gift of the works comes at a critical juncture in the museum’s history, commemorating the twenty-fifth anniversary of our Institute of Art, and at a critical juncture in the history of our institution, when it is undergoing a serious restructuring,�", "The next Biennial should be held in the year 2024, the event’s artistic director, Alain Guiraud, told the Art Newspaper.The two-hour exhibition “involves hundreds of portraits by contemporary artists\u0097one of them by a French Muslim.” The exhibition will also include works by artists from the Arabian Peninsula, Australia, France, and the United Arab Emirates.Guiraud also revealed that the event will be hosted by biennial organizers. Due to the current emergency, the exhibition will be banned from September 27 to November 8.\n\n\nThe   Armenian Art Museums (AAM), which had announced its intention to close its doors indefinitely in the wake of the country’s March 15 election, has now acknowledged that the move is not in the interests of the majority of the participating artists and that it will reopening the museum once more, this time with a new curatorial team, in May 2020.The decision came after the AAM’s board president, Andrej Kuznetsov, and the institution’s executive board unanimously decided to suspend their campaign pledge until a new government was formed following the March 30 election. The move has allowed the AAM to reorganize its exhibition program, which was", "The next Biennial should be held in April 2020.<|endoftext|>Physicist Stephen Hawking, who famously quipped that if he could only have one life, a billionth as big as our sun, would live to see the next day, has died. At the age of seventy-eight, the Canadian-born, Massachusetts-based physicist and atheist was still alive when the first satellite of the Large Hadron Collider, the CERN laboratory in Geneva, Switzerland, unexpectedly shut down in 2010, and he was forced to travel to New York to be with his loved ones.Despite his efforts to extend his life by taking up painting and reading, Hawking has since 2010 been confined to a wheelchair due to chronic obstructive pulmonary disease. While he was able to travel to and from the CERN facility, he has since revealed that he is unable to resume his normal activities.In an interview with the New York Times this month, Hawking said that he is putting his hopes in the CERN machine, which is due to be fully operational by the end of the year. “I haven’t got any idea what the future holds,” he said. “I will just keep trying, just try to survive. I don’t want to die.�", "The next Biennial should take place in 2021. The first iteration of the event will also be taught by domestic artists, and will be curated by the artist-in-residence, American artist and curator Tarek Atoui. The organizers noted that the new structure would allow them more time to experiment with different methods of exhibition, modeling, and installation and would strengthen the Biennial’s interdisciplinary relationship with the university.“I want to thank the university for inviting me to the city of Los Angeles,” Atoui said. “I’m really excited to show you guys in the desert. It’s going to be hard work, but I’m ready.”The art works will be curated by senior curator of modern and contemporary art, Julián Zugazagoitia. Zugazagoitia will also head the Biennial Project, which he began in 2018, and will provide guidance in developing and executing the program.\n\n\nThe San José Museum of Art in California has appointed Carol Anagnos as director of the soon-to-open Art of the Party, a new residency program that will connect contemporary and contemporary art with local, national, and international artists, and will offer", "The next Biennial should include the first major re-envisioning of the 'Victorian' Revival in London. The third and final exhibition should draw from the collections of the Tate and the National Gallery. 'It is important that we remain committed to doing our very best to re-create the original spirit and originality of our collection, both as a cultural heritage and as a city, while ensuring that our collection lives on in the minds and the hearts of future generations, and is among one of the most important collections in the world,” wrote Edward Enninful, director of the Tate, in a statement.  For the past ten years, the Tate has been working with the National Galleries of Scotland on the creation of a new site for the Tate’s collection in Edinburgh, and with the Scottish National Museum, the University of Edinburgh, and the National Museum for Scotland, the National Museum of Scotland, and the National Maritime Museum, to create a new collection space for the collection. In the announcement of the program, Tate director Maria Balshaw said: “I am delighted to announce that we will return to the seaside town of Inverness to host the next Biennial. A tribute to the talent", "The next Biennial should be a 'journey of self-exploration and reflection.' [It] will feature a selection of work that was created by no longer than twenty artists from the last ten years and will be organized as a group presentation for a maximum of sixty people. The first day of the biennial will be October 7 and the last day of the biennial will be October 11.The exhibition will feature a selection of works created by lesser known and established artists, as well as works by artists whose work currently resides in the collections of several institutions, including the Metropolitan Museum of Art, New York; the Museum of Modern Art, New York; the Yale Center for the Arts, New Haven, Connecticut; the National Gallery of Art, Washington, DC; and the Los Angeles County Museum of Art (LACMA), Los Angeles.Nicole Giunta, director of the Harris Foundation, said: “The first Biennial is an important and timely step in opening up new doors and making new connections between the world of art and the world of people. The Museum of Modern Art has shown that it is committed to supporting the work of our artists for fifty years, and we are excited to see how they present their work in the coming months.”", "The next Biennial should have a new exhibition dedicated to the memory of Nathalie Haag, a German artist who was one of the first to use photographs to memorialize the inter-state conflict in Palestine. Her work has since been collected by the Istanbul Biennial, the Minneapolis International, and other international institutions.The Arts Council has announced its plans for its next edition, “The Path,” which will take place in Milan, in 2020. Titled “The Way is a Lonely Journey,” the exhibition will offer an “unified overview of contemporary life.” The first show will examine the “path of a stranger”, a New York–based artist, whose exhibition was selected for its “fearlessness” and “to challenge the social, political, and spiritual constructs of a stranger.” The second show will explore the “spirituality and the body”\u0097a question that has received substantial artistic attention in recent years\u0097and will also include ten works by Yehoshua Benai and ten works by Nina Hsu. Nina Hsu’s photographs are haunting and beautiful and capture the spirit of the place. The works are not meant", "The next Biennial should be on the Greek island of Lesbos from February 21 to February 26. The 2017 edition, which was hosted at the Palais de Tokyo in Paris, was cancelled at the last minute by the Pavilion d'études de Paris, which has an exclusive contract with the French Ministry of Culture.The next two iterations of the Museum Palace Biennial in Rome and the Barbican in London will go on as planned, but will be held in the evenings. Paris’s Odeon show, which recently announced a change of plans, will also continue as normal, with the exception of the installation of the work “La Marseillaise,” which is a tribute to the victims of the terrorist attacks on Paris on Friday, November 13.The Art Newspaper reports that the show’s director, Agnes Martin, said: “We will continue with our normal operations. In the meantime, we are working with the authorities to plan the best possible future for the exhibition. In the meantime, we express our sympathy to the families of the victims who have lost loved ones and share their grief.”According to AFP, the last of the four attackers who killed 129 people in a shooting spree at the Bataclan theater in", "The next Biennial should draw forty-nine artists, including a number from under-represented areas of the world. The committee will decide on the artists' proposals by March 13 and have a shortlist of fifteen artists selected by June 20. The artists chosen for the exhibition will be announced by September.The Biennale is also planning to stage a number of exhibitions in major cities across the country—New Delhi, Mumbai, Hyderabad, and Bangalore—as part of a campaign to raise $20 million for flood and sanitation relief. The first event, entitled 'One Family, One Flood,” will be held in Mumbai from September 13 to September 20. The second exhibition, titled “Shared Miracles,” will be held in Bangalore from September 20 to September 22. The full list of participating artists can be found here. \n\n\n\n\n\nBillionaire collector and philanthropist Richard Lenski, who in recent years has been the lead philanthropist in the making of artworks by many of the most famous artists of the twentieth century—Frank Gehry, Robert Irwin, and Ken Russell—has died at age seventy-nine at his home in New York City.Born Richard Telling, in Nashville, Tennessee, in", "The next Biennial should take place in 2019, and the twenty-fourth at the twenty-fifth edition in 2021. The future of the three-day event is also being closely watched. The museum is currently working on a new exhibition format and a new schedule. The same year the exhibition will be staged, the curators, Carsten Hoppe, and Wolfgang Stöcker, will collaborate on a new book.\n\n\nThe World Monuments Fund (WMF) has launched a new initiative that will partner with media and arts organizations to preserve more than 2,300 cultural heritage sites throughout the world. The initiative, called the Monument Defender Project, will offer media and arts organizations the opportunity to keep and use cultural heritage sites that are being designated for conservation through the 2020s and 2021’s biennials.Under the program’s new partnership with the Wikimedia Foundation, sites will be designated through a series of online consultations, which will last for two weeks, in early June. The sites will then be given a conservation design that accurately reflects their historical and cultural significance, such as by including a road, a library, a cemetery, or a tomb. The first round of construction will take place in 2020. The second will take", "The next Biennial should also be set up to give a free public tour of the museum.  The festival will be held on the 14th of April and will be organised in partnership with the Paris-based artist and curator Yoko Astash. Hollande rue Gilles Pignat will also receive a free biennial, alongside the Paris-based arts organization Boucheries dans Leclerc.Commenting on the partnership, Boucheries dans Leclerc said: It is a great honor to be the first to present the two works in a new and unique way. In order to enrich and create a new narrative for Paris’s art, we will invite the artist to the city in order to exhibit the works in the museum’s collection. This exhibition will not only feature the exhibition, but will also be a reflection of Paris’s identity and culture. Our strategy for the exhibition is to create a space for architecture and design, showing the work of the best Parisian artists always in a unique setting, in a way which will be accessible by everyone.We hope that the exhibition will stimulate and inspire the Parisian public to create a new kind of Paris, a city of arts and culture, a", "The next Biennial should be held in 2020, when the museum will be preparing for an expansion. The museum has been closed since March 14.\n\n\nThe Istituto del Museo della Artista (IMAM) in Naples, Italy, has received a gift of twenty-six works from the collection of the artist John Muir, the founder of the Sierra Club, from the estate of Luigi Fontana, the legendary Italian architect who designed the building of the Sierra Madre. The donation includes works by artists including Alberto Barbera, Domenico Cattelan, Carlo Cipolletta, and Gio Ponti.“For nearly forty years, John Muir has been the main source of inspiration for the many architects who have shaped the Istituto del Museo into a magnificent structure,” said the estate’s president, Graziano Cipolletta. “For more than a century, his works have been particularly important for those who were inspired by them. Today the Istituto receives the work of John Muir, one of the most important architects of his generation. His genius opened doors to new ideas that have not previously been thought of. We are eternally grateful to", "The next Biennial should take place in the summer of 2021. He said that the show will be “taking place across two city neighborhoods in the heart of the city’s art district, and will be centred around a collection of contemporary artwork made by the artists whose work is featured in the exhibition.” He also noted that the exhibition will be anchored by a series of interviews with the artists featured in the show.The artist’s list is as follows: Alysha Agha, Surya Agha, Babima Bhatt, Baghdad Abdi, Binraj Khandewala, Bindu Akram, Bindu Cheema, Bindu Dutta, Bindu Dutt, Bindu Giri, Bindu Rana, Bindu Sicha, Bindu Tawakon, Bindu Gaya, Bindu Jain, Bindu Khandewala, Bindu Kumar, Bindu Kumar , Bindu Kukat, Bindu Mukerjee, Bindu Mukerjee, Bindu Mukeshwar, Bindu Mukeshwar, Bindu", "The next Biennial should be Frist Art Museum, Los Angeles, in September 2020.  The 2019 exhibition was an exhibition of the work of Adrienne Edwards and post-Guggenheim Museum curator Paul Gallico, and featured work by twenty-six artists.\n\n\nThe Whitney Museum of American Art in New York has received a gift of more than five thousand photographs by John Nolte, the influential American journalist, painter, and activist who challenged the United States’ official accounts of World War II. Founded in 1892 as the home of Nolte’s late friend and mentor, the institution now holds the collection of his widow, Jane Nolte White.“John Nolte’s photographs embody the strangest, most daunting, and most powerful narratives of American photography,” said Whitney director David Warner. “Their undeniable ability to draw us into intimate and sometimes surreal worlds—plotted with such vivid and inventive intimacy that we are moved to care for their fragile, interlinking narratives.”Nolte’s early works were collected by his longtime collaborator, the late photographer Michael Winslow. Nolte’s first show at the Whitney was an exhibition of his", "The next Biennial should be held in 2020. Since the exhibition will be held across the city with an immersive experience, the biennial’s design will adapt to reflect the city’s diverse cultural traditions. The new venue will be named after Riemann’s grave, and the exhibition will take place in the Prenzlauer Berg, the fifth-grade modernist school in Frankfurt. The new exhibition will be called Art and the City. The new site for the exhibition will be on the ground floor of the former Prussian arts building, and the exhibition will be held in the basement. The new exhibition space will be located in the same building as the former Prussian Cultural Center.\n\n\nThe Metropolitan Museum of Art (the museum), which launched a year-long fundraising initiative to save the Kahn Gallery in New York and its neighboring buildings in December 2017, has received $19.6 million from the Andrew W. Mellon Foundation. The $6.8 million is part of a $100 million advance grant, which was made last October, and is for the design and construction of an additional Kahn Gallery space on the building’s current campus. The grant", "The next Biennial should take place in 2020. When asked about a possible 2020 edition, Guggenheim director Michael Wasser said: “We are working hard to present an outstanding collection of the work of American art, and any decisions regarding the future of the exhibition are complex and require a complete analysis of the museum’s portfolio.”Nominated for the 2020 Pulitzer Prize, the exhibition will be presented by the biennial’s curators, David K. Sass and Rebecca Rönnskog, with the exhibition opening on June 12.\n\n\nThe Helen Frankenthaler Foundation in Chicago has awarded $1.3 million to twenty-three artists who collectively represent the culture of the Helen Frankenthaler Collection. The announcement marks an expansion of the foundation’s Helen Frankenthaler Fellowships, which have supported cultural exchange between the Helen Frankenthaler Foundation and artists since 2011. The foundation also established the Helen Frankenthaler Fellowship, which offers annual awards of $500 to $750 to artists who demonstrate an affinity with the Helen Frankenthaler Collection and whose work is on view in the exhibition “When Art Lives,”” which opens on February 19. The fellowship runs through May 29.“", "The next Biennial should be held in the winter of 2020. \n\n\nThe Baltimore Museum of Art (BMA) has appointed Quentin Black as its new director. Black, who has served at the institution for nearly five years, succeeds Peter W. Zimmermann, who retired in June 2019 after more than twenty-five years at the helm of the museum. He succeeds Michelle Crawford, who has served as director of the museum since 2015, and will take up the post in January 2021.“Quentin Black’s leadership and vision for the BMA make him a formidable leader for the institution,” said Mary O. James, the museum’s interim director and chief curator. “It’s an honor to be a part of his extraordinary legacy and I thank him for his tremendous work in advancing the museum’s mission. I am eager to work with him and see what he has in store for the BMA.”Black has served as the director of the Sargent’s Daughters, the Black Arts Museum, and the Baltimore Museum of Art, where he has worked since 2011, and recently chaired the board of trustees of the Baltimore Travelers’ Association. He also previously served as executive director", "The next Biennial should be held in 2020.\n\n\nThe Carnegie Museum of Art (CMA) in Pittsburgh is planning to shutter its first full-scale exhibition devoted to the life and work of John Cage. The project, titled “Body and Soul: Art and Culture in Cage” and curated by curator Allison McCaffrey, will be featured in a ten-year retrospective of the artist at the museum.“I’ve long been a fan of John Cage,” said museum director Joseph Zornowski. “As a curator I’ve worked extensively with my colleague and fellow curators Allison and Nicolai to create a show that will showcase the extraordinary range of his work. John Cage is a classicist who uses his practice to investigate the relationship between painting and sculpture, between performance and sound, between visual art and sculpture. It’s my job to present the work in the show, to suggest the way the art is presented, to act as a point of departure for the way the art should be experienced. I’ve been counting on Allison and Nicolai to create a show that engages with Cage’s vision and the way he practices art. I’ve long been a fan of John Cage", "The next Biennial should be a celebration of the exhibition “Untitled: The Biennial of the City of New York” (2019) and the pavilion of its inaugural exhibition “Adam’s Body: Contemporary Art from 1930 to 1969” (2018). The theme of the second exhibition should be “Perception: The Art of Man” (2019). \n\n\nThe Metropolitan Museum of Art (the museum) in New York has announced that it is launching a new public arts initiative. Called the Met Center for Contemporary Art, the initiative will partner with local community partners to present new works in partnership with private collectors. The first exhibition will open on September 25 and run through February 26, 2020.According to the artist-run project page for the initiative, “The Met Center for Contemporary Art is a public museum that represents the intersection of modern art and contemporary technology. It has served as a platform for a wide-range of exhibitions and programming that has produced more than $1 billion in direct spending to the museum.” The museum plans to redirect $9 million from its current construction budget toward the initiative, which will consist of a series of programming that will–among other things–attempt to understand the art of the twenty", "The next Biennial should be a biennial of the artist’s life, not a biennial of his work,” said Arturo Gatti, director of the Museo Biennale and founder of the museum. “The biennial of the artist’s life will be an intensive exploration of his life, its place, its politics, its history, and its impact on the artist, in an environment of interdisciplinary inquiry.”\n\n\nInternational Consortium of Museums and Collections (ICOM) announced today that it has awarded $3.9 billion in grants to more than 223,000 institutions around the world. Founded in 1988 by Dr. Peter H. Dutton, chairman of the Royal Institute of British Architects (RIBA), the organization supports projects that foster interdisciplinary research, support the creation of new scholarship and exhibitions, and develop a broader understanding of contemporary art. “For more than a decade, ICOM has supported institutions by fostering a shared vision of art as a way of life,” said Dr. Dutton. “ICOM’s awardees are among the most broadly diverse in the world, and represent a diversity of artistic and cultural backgrounds. We are deeply grateful to all the", "The next Biennial should focus on the emergence and history of the black polymath, a term coined by African American scholar E. L. Doctorow to describe a group of intellectuals and artists whose work touched on themes of race, evolution, and economic and political systems. \n\nThe British Academy has announced that it plans to create an endowment to secure the future of the Tate’s iconic collection of African art. The organization plans to distribute $1.5 million to the Tate’s trustees in recognition of their services to Britain and to the African diaspora.“We are all deeply moved by the work of the Tate’s artists and their impact on our cultural landscape, and by their enduring dedication to diversity and intergenerational understanding,” said Bradley Stokes, the academy’s director. “As a country we are committed to supporting their artists and fostering their legacy. But we must also consider the impact that the arts may have on our societies and on our own future.”The funds will be distributed by Bradley Stokes, the academy’s senior director for arts and cultural affairs, and Catherine Hampton, the academy’s director of arts. Hampton confirmed that", "The next Biennial should be held in 2021. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Kate Fowle as its next executive director. Fowle succeeds Amy Sherman, who retired in May after eighteen years at the institution, and will take up the post in January 2021.“We are thrilled to continue to evolve and improve as a museum with a strong collection of contemporary art that is devoted to the exhibition of artists in the greatest number possible, with a strong, diverse and diverse range of artists at our institution,” said Fowle. “Kate’s proven track record in working with MoMA to bring both a collection of artists and a museum at a time when MoMA is at the forefront of the movement to revitalize contemporary art speaks to her ability to bring both worlds together to the museum.”Fowle has served as an interim leader of the museum since May 2018 and has been a member of the curatorial staff since 2006. During her tenure at the institution, she collaborated with museum director Anthony Mazza in transforming the museum into a platform for experimentation with new media and digital technologies, and she oversaw the development of MoMA’s current programs, including the exhibition �", "The next Biennial should take place in 2020 and will introduce the public to the work of the artists who have served as an inspiration and an inspiration to me, both as a teacher and as a scholar.”\n\n\nThe Museums Association (MA), the United Kingdom’s major professional body for museum professionals, announced today that it will introduce new incentives for museums and research groups to encourage the conservation and conservation-focused use of donated works. The organization will award £15,000 to organizations that create or maintain collections that are at least eighty years old; $20,000 to organizations that conserve at least twenty-two works by twenty-three artists; and $30,000 to organizations that conserve works worth at least $50,000.The scheme is part of a wide-ranging plan to address the UK’s impending financial crisis and help to prevent the loss of millions of works to the Black Death, a pandemic that killed an estimated four million people in England and Wales in the years between 1650 and 1668. The strategy is part of a comprehensive UK strategy to protect cultural heritage, developed in cooperation with stakeholders, including the British Association of Composers, Authors, Librarians, and Publishers (BACP), and is slated to", "The next Biennial should take place in 2021, and the third will be held in 2023. The first two exhibitions, “REVOLUTION: ASTRONAUTS IN THE PRESENT'', a selection of new work and a retrospective of the French artist Luzia Tonkonová, were jointly curated by MoMA and the actor Michael Douglas. The third edition of the exhibition, titled “THE STRANGE ABBEY,” was curated by the American Adam Curtis and will be held at the Museum of Modern Art in New York in 2021. The 2018 edition of the three-day event, “BIRTH: ART, LIFE, and DEATH,” was held at the Museum of Modern Art in New York in 2017. \n\n\nThe Museum of Modern Art (MoMA) in New York is planning to create more than two hundred new full- and part-time jobs in the arts through its new initiative, “art for the office,” which will involve the organization of exhibitions, residencies, classes, and projects. The new positions will be offered by September 1.“As global economic issues such as climate change become more complex and threatening, at a time when arts", "The next Biennial should be a New York–based institution that celebrates the work of artists who have made significant contributions to the cultural and political life of New York City. We hope that this opportunity will give the biennial a new lease of life and that it will continue to thrive under our artistic leadership. We are grateful to our donors, partners, and supporters for their understanding and confidence in our vision to present an exhibition that reflects the rich and inspiring legacy of one of our greatest artists. We will continue to push for new forms of expression and new ways of seeing the city through the Biennial.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has hired Simon Jordan as its new associate curator of contemporary art. Jordan comes to the institution from the Los Angeles County Museum of Art (LACMA), where he serves as a curator of contemporary art. He succeeds Andrea Dorsch, who was promoted to director of curatorial affairs and curator of contemporary art at LACMA in April.“Simon brings an extraordinary breadth of experience to our curatorial team, and is already well-versed in the development of contemporary art,” said director Chris Siefert. “Simon brings a new perspective with which we can and", "The next Biennial should be held in 2022–19.\n\n\nMilan-based, New York–based, and Los Angeles–based artist Rina Abad has won the $70,000 Artist Award in the United Kingdom. The £50,000 prize is one of the largest prizes given to an American artist. Details about the award will become available in the weeks leading up to the event, which will highlight the work of thirty-two artists in the spring of 2020.Abad was selected as the recipient of the award for her first solo exhibition at the New Museum in New York in January. It was also nominated for the 2019 Whitney Biennial, which was won by the Minneapolis-based artist Deana Lawson, and the 2019 San Francisco International, which was won by the Chicago-based artist Minyoon Kim. The 2018 prize, which was won by the Los Angeles–based artist Thomas Dolores, was also awarded to Abad. The 2019 prize, which was honor-bound for the artist, was awarded by the Los Angeles County Museum of Art and was awarded in conjunction with the Los Angeles Arts and Culture Festival.\n\n\nFollowing the discovery of a mass grave containing the remains of at least five hundred prisoners, hundreds of", "The next Biennial should be announced in October 2020, and the first exhibition should take place in December 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Daniel O. Rowland as its next director. He succeeds Michael L. Bowman, who retired in March 2019 after six years at the institution.“Daniel will be a visionary leader in the development of MoCA’s public art program as we embark upon an ambitious new renovation and expansion, and will be crucial in helping us realize the vision of the new museum,” Bowman said in a statement. “It’s a hugely exciting time to welcome Daniel to MoCA. Through his leadership and vision, he has the opportunity to shape our next twenty years of exhibitions and programs in a way that will strengthen and extend our public engagement and public education programs.”Rowland comes to the museum from the Museum of Contemporary Art (MoCA), which he began in 1999 as a curatorial assistant. He has served as deputy director of curatorial affairs at MoCA, where he helped organize “Plum of the North,” 2009, and “The Promise of Doris: Making the Modern Body,” 2012, as", "The next Biennial should be held in November 2020. The theme of the 2020 edition is “Early Life and Its Relation to the Present.” The festival will also honor the contributions of the late artist and curator H.M. Adolph von Rundstedt, who created the show “Father, Son, and Spirit” (1902), which featured the artist’s work and artworks, and will be hosted by the Stockholm School of Music and the Los Angeles County Museum of Art.\n\n\nA coalition of artist-run collectives in the United Kingdom are suing the government to prevent the deportation of an undocumented migrant, whom they allege was tortured and died in police custody after he allegedly tried to stab a police officer during a high-speed chase in Leicester on July 3. The defendants are claiming that the man, who was held in custody for almost three hours and died of his injuries two days later, was unlawfully detained and died of his injuries—the lawsuit is still pending.The nineteen-person alliance is asking the High Court for an emergency injunction to prevent the police from detaining or attempting to detain the man, named by the artist-run organization PEN International as a member of the group M.A.R.", "The next Biennial should be held in 2021. The experiment will include a selection of works by over seventy artists and will open with a reception at the Museum of Denmark on February 28. The exhibition will also feature works by artists from the UK and the US.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Susan Botts, who has served as director of the school since 2011, and Michael Bernard as interim directors. The news comes on the heels of the school’s announcement that it will begin a three-month \"spring cleaning\" cycle, which will last throughout March. The move follows an uptick in Covid-19-related hospitalizations nationwide and a sharp drop in attendance at classes, exhibitions, and other events.In a statement, the institution said: “Throughout my ten years as director of the school I have championed and protected MoCA’s artistic mission through strong, collaborative partnerships with local, regional, and national arts institutions. It has been a great honor and joy to work with my colleagues and students.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, California, has appointed Christopher Knight as its next director. Knight comes to the institution from the Los Angeles County Museum", "The next Biennial should focus on the interconnections between art and the cultural and social processes of the Third World, and on the development of a more inclusive understanding of the arts and their social, political, and economic power.” The 2020 event will take place at a temporary site at the Museum of Contemporary Art, Los Angeles, and will run through March 23.\n\n\nThe Chicago Architecture Center (CAC) has appointed Joan Uke-Elliott as its next executive director. Uke-Elliott comes to the organization from the Hirshhorn Museum and Sculpture Garden, where she has served as the associate curator of contemporary art since 2007. During her tenure, she curated “The Runaways,” a 2018 exhibition featuring work by seventy-four artists, including Christo, Hernán Cortés, Amy Hepler, and Harvey Korman, and “Don’t Stop Me Now,” an exhibition featuring more than sixty new works by artists.“Joan comes from a powerful and influential family, an architecting family that has shaped the CAC into an institution that is at the heart of Chicago’s creative ecosystem,” said CAC director Anna Kuzma. �", "The next Biennial should mark the beginning of a new stage of our relationship with our national museums. This should be an opportunity to recommit to our shared vision for the future, to carefully consider how we can share that vision and to be empowered to make it a reality.” The museum, which is also planning to expand its campus in the city of Biarritz, will announce the new locations for its new events and exhibitions, which are also scheduled to take place in 2021 and 2023. \n\n\nThe British Council has released a new set of guidelines for the development of new artistic and cultural projects, which will be presented by the British Museum and the National Poetry Library, in an attempt to encourage the creation of new works by UK-based artists.The guidelines, written by the Council for the Arts and the National Poetry Library, address how artists should approach the proposal for a new national museum of poetry, a project originally launched by Prime Minister Boris Johnson in 2017, and how the government should work with the artists to ensure the institution “plays its part in ensuring that new poetry and a new museum of poetry are conceived, conceived, and built together.”The guidelines were developed following a consultation held in early 2019 and were released on", "The next Biennial should be held at the Museum of Contemporary Art Atlanta in March 2020 and will comprise biennial presentations of works in both the exhibition and the collection; wall installations that receive no further presentation in the museum; and. . . . a new public gathering space. The seventy-fourth edition of the Venice Biennale will also include a new documentary film by director Daniel H. Weiss. The show will be presented in association with the Venice Architecture Biennale, which will be held in March 2021.The Venice Architecture Biennale is the most highly regarded architecture biennial in Europe. It was selected for its exhibition “The Future of Architecture” at the Venice Architecture Biennale in 2009 and for its exhibition “Changdai: The Future of Art” in 2007. The sixty-ninth Venice Architecture Biennale, which opened on September 21, 2010, featured the works of thirty-three artists and was the first to feature the work of a woman. Deana Lawson-Rivas’s first work for this year’s event was Teller: The Future of Art. The work, an exhibition of seven works, was curated by Nino Gambino and was on display at the gallery�", "The next Biennial should be held in the second half of 2018. The theme of the exhibition will be “Life and art as a dynamic and flexible system,” and the program will be divided into two parts: “epilogue,” which will address themes of time, and “ultimate bounty,” which will culminate in a discussion about the ‘ultimate form,’ the work of art.\n\n\nArt historian, curator, and scholar Jack Donaghy, who served as director of the Oxford Art Museum (OAM) between 2007 and 2012, has died at age seventy-one. In lieu of a formal memorial, the museum has raised more than $3 million in support of Donaghy’s research and scholarship.Born in London in 1946, Donaghy first studied at the Woodburn Art School in the 1970s. He then returned to Oxford, where he studied with Alex Blank, Sofja Bleskup, and Bartolomeo, who all taught at OAM by the 1980s. Donaghy eventually returned to the UK in 1981, where he continued to work as a curator. OAM director John Boulton said: “Jack was an extraordinary curator who shaped", "The next Biennial should focus on “the intersections of art and politics,” she said. “October means that we are going to present a platform for the very best ideas and artists.”Dreamer, the largest art project in the world, is moving forward with its 2019 spring exhibition, “Diana Al-Hadid: Science or Fiction” at the Museum of Modern Art in New York, despite the absence of the artist. LAXART, a new project of the Museum of Contemporary Art LA, is also planning to stage an exhibition commemorating the 50th anniversary of the Los Angeles County Museum of Art as part of its new partnership with the city of Los Angeles.Los Angeles City Councilman Mitch Englander, who represents the district of South Los Angeles and is a supporter of the museum’s local arts and culture committee, said: “I’m really excited that Dreamer is making this difficult decision in order to continue to support the local arts, and to help make the city’s arts ecosystem work for everyone.”\n\n\nThe Department of Arts, Heritage, and Culture (DAC) in London announced today that the much anticipated Feminine Arts Legacy: Women’s", "The next Biennial should take place in the city in 2022.\n\n\nThe cluster of UCCA institutions in Naples—the CNA Museum of Art, the Italian Academy of Fine Arts, the Institute of Modern Art, the Museo de Arte Contemporáneo in Venice, and the Art Institute of Chicago—has appointed Keith DeSimone as its next director. DeSimone comes to the institution from the prestigious University of Naples, where he has been the director of education and research since 2016. He succeeds Filippo Marini, who retired following nearly four years at the helm of the museum, and will take up the post on August 4.“Keith has built an institution that contributes to and enhances the creative, historical, and aesthetic lives of the greater Naples region,” said Filippo Boni, the director of the CNA. “I’m looking forward to working with Keith to establish an institution of the highest artistic, historical, and intellectual quality that can offer the creative and academic communities of Naples and beyond an unforgettable exhibition, program, and the cultural life of Italy.”The institution is currently working on a new project, “The Museum of Modern Art in Naples,” which will", "The next Biennial should be launched in the autumn of 2022. The first exhibition will be set up at the newly renovated Museum di Siena and will feature works by thirty artists, including Terino, Suzan-Lori Parks, Leo Wu, and Simon Corwin, as well as a selection of contemporary art from the Hong Kong and Shanghai Biennials.The new pavilion will also be a platform for the development of the biennial’s collection program. The inaugural exhibition “Helvetica: The New Art of the Pacific Rim” will open on October 2 and will feature photographs by Renzo Piano, Beatrice Tavani, John Andrews, and Paul Gauguin. The exhibit will be followed by “Boundless: Contemporary Art in the Global South” in the spring of 2021 and “Renaissance in Motion” in the autumn of 2020.After the inaugural exhibition, the biennial will move to the Palazzo di Pinacoteca in Venice for an eight-week run, in order to prepare for its second edition, which will be held at the Pinacoteca di Beppo in Milan, in November.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has hired", "The next Biennial should be held at the Museo de Cultura Bienal, in the old Municipal Palace in Madrid, in twenty-eight years. Museums are also working on revitalizing historically important sites in their cities, so that they can be visited by visitors from elsewhere in the world. Last year, the Museo de Arte Contemporáneo in Madrid commissioned four drawing-based projects by photographer Íñigo Rocha. One of the works, a series titled Pueblo Modernos (Huelva Modernos), takes place in a modernist, avant-garde museum while a second works on paper, Pueblo Modernas y los Angeles (Paloamerican Modern Art), is a work that explores the relationship between nature and its surroundings. The Museo de Arte Contemporáneo in Madrid is planning to bring Puerto Rican artist Rafael Palma’s Palea (Puerto Rico) to the UK, where it will be exhibited in an exhibition at the National Gallery of Art, London, in 2022. Piedra’s work was chosen for its unique blend of Cubist, industrial, and Post-Cubist architecture", "The next Biennial should take place in 2020, and the first event in 2021. In 2019, the show was marred by festival organizers’ initial mis-steps (see here for more) and the festival was canceled for two weeks. In 2018, the festival was awarded a lifetime achievement award from the New York Academy of Arts. The Biennial will return to Lamont this fall. Additional Art Archives\n\nThe National Gallery of Scotland has announced that the institution will be taken over by the Kincardine Arts Centre, which already runs a branch in Glasgow. The Kincardine Arts Centre’s board of trustees has voted to appoint Kincardine trustee James Kincardine as the new chairman of the institution. “We are very grateful to James for his long and distinguished career in the arts and for his outstanding leadership of the National Gallery of Scotland,” said Neil Hamilton, chairman of the Kincardine Arts Centre board of trustees. Kincardine will succeed David Kilgarrand, who will leave the museum in August.Kincardine, who was appointed deputy director of the Kincardine in November 2016, is the founder of the consultancy firm Kincardine", "The next Biennial should focus on black and indigenous narratives and how they are reshaping art and the cultural landscape. The first will focus on material culture through the lens of new media. The second will introduce a new cohort of artists from various backgrounds. The third will consider the role of performance and performance culture in the art world. The fourth will examine the role of hybrid and hybrid cultures in the art world. The fifth will return to the African diaspora and examine the relationship between contemporary art and African art. The sixth will examine the work of African artists living in South Asia and the Americas, and will have a special focus on how the history of African art can be incorporated into contemporary art.The seventh will celebrate the legacy of the late Njideka Akunyili, who passed away in 2017. The exhibition will be inaugurated by an exhibition of Akunyili’s work, which was on display in her Studio Museum’s inaugural exhibition “Infinity Plus: Embodied Spirit and the African Dream” in partnership with the Museum of Modern Art, the Art Institute of Chicago, and the Kempe Foundation.\n\n\nThe Museum of Modern Art (MoMA) in New York has issued an apology to", "The next Biennial should take place at the same venue next year. The first will be on September 10, 2019. Bijan will be presented by SFMoMA and will be hosted by artist-in-residence Lisanne Boudreau. Boudreau will work alongside the artist-in-residence, Nusrat Ghani, during the exhibition. The second will be on September 12, 2020. The third will be in February 2021. The fourth will be sometime in the month of June. The fifth will be on August 27, 2021. The sixth will coincide with the eighty-fifth Venice Biennale. The seventh and eighth will be in September 2019 and November 2020, respectively. The artist-in-residence will assist the biennial in creating a new exhibition space. The eighth biennial will be held at the San Francisco Museum of Modern Art in November and will take place at the San Francisco Opera House in May. The ninety-ninth will be held at the San Francisco Museum of Modern Art in May 2021 and will be on October 26, 2021. The biennial will move from its current location in the Bayview, where it has been since 2011, and", "The next Biennial should be held in the city in 2022. It is also planning to develop a new platform that will host programming specifically for the city, such as art exhibitions and concerts. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (LA), has added three new members to its board of trustees: photographer and filmmaker Andrea Moudaprene, whose work is currently housed in the National Museum of African Art in Washington, DC; artist and curator Roberta Jacoby, whose work is currently on display in the Studio Museum in Harlem; and artist and thinker Angela Meinecke, who has produced works that examine the power of photography in the form of a photographic memory.Meinecke, who is based in Los Angeles and lives in New York, will become the first director of the Museum of Contemporary Art (MoCA), where she will oversee curation and development, and will assume her responsibilities on December 1.“We are thrilled that Andrea has been selected to serve as director,” said museum director Pradeep Singh. “Her trajectory over the past decade has been exemplary and she brings diverse experience, expertise, and a deep understanding of contemporary art. Her appointment marks an exciting moment in MoCA’s"]