["The next Biennial should be held in 2022.\n\n\nIn the wake of the devastating explosion that took place on the grounds of the Museum of Modern Art (MoMA) in New York on Wednesday, September 11, 2024, which leveled the building and leveled the entire block below, the arts and cultural sector in the city is preparing for a financial loss.According to the New York Times, the Federal Communications Commission (FCC) is preparing to fine MoMA $2 million for violating the 2015 Net Neutrality Order by rerouting traffic on radio, TV, and digital media, and for failing to classify mobile devices as common carriers.The commission also found that MoMA and Apple, which jointly own the company that runs the museum, violated the 1996 Telecommunications Act, which prohibits discrimination against certain types of content. The fines could total as much as $5 million. The commission says it will consider the fines before deciding whether to take further action. Apple is appealing the decision.\n\n\nThe Cleveland Museum of Art (CMA) has received a gift of more than 1,600 works by artists such as Orson Welles and Mark Rothko, as well as a selection of rare works by Pierre-Auguste Renoir and Henri Rousseau, among others", "The next Biennial should take place in the year 2022. The invitation to the festival came from the French Minister of Culture, Manuel Valls, who appointed Lévy Gorvy as the exhibit director.Lévy Gorvy has been involved in a legal battle with the French Ministry of Culture since the exhibition “10,000 buildings” (2019) was opened at the Graff Collection in Paris in November 2019. According to the New York Times, the ministry claimed that the work was “unlawful” and “tempt[s] to change the law.” The ministry withdrew the invitation to the biennial in February 2020, but invited the exhibition to take place in 2022. The ministry also announced that it would pay the organizers a total of $7.5 million for the event, but they argued that it was not necessary to pay them since they were already reimbursed through 2019. \n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has received a $5 million donation from the Flemish-American artist and designer Steen Gendal. Gendal will donate $2.5 million to the institution and its collection, which comprises a series of contemporary sculptures and installations", "The next Biennial should commence as soon as possible, as soon as possible, and should present at least thirteen works by artists whose work is currently in the collection. In the meantime, the museum will create new opportunities to engage with and present new works by local and internationally acclaimed artists through a wide range of programming, including its Summer of Art series and the biennial of international artists.\n\n\nThe Museum of Modern Art (MoMA) in New York has named Loring Randolph as its next executive director. Randolph comes to the institution from the Museum of Modern Art, which she helmed from March 2019 to March 2020. During her tenure, she expanded the museum’s collection by more than two hundred works and introduced new exhibitions.“I’ve been fascinated with Loring’s vision for the museum since I first met her years ago, and how her curatorial and development teams have transformed the museum into a singular institution that celebrates the work of contemporary artists, never stops to consider their history and their future, and embraces the impact and impact of art on our lives,” said director Marc Glimcher. “Having Loring as our next executive director reflects MoMA’s transformation from a museum focused on collections and exhibitions", "The next Biennial should explore the relationship between the contemporary and the historical, between the contemporary and the artist, between the contemporary and the city, between the contemporary and the countryside. This should include the construction of a dialogue between the museum and the city and between the museum and the city as a whole, and between the museum and the city and the city as a whole. The museum should explore the significance of the museum in the lives of the people it serves, and should continue to perform in the city of Bucharest. We need the museum as a cultural focal point. It is in the people's interest for museums to explore their own histories and to take part in the cultural and social development of the city. It is in the interest of the museum and of the city to be encouraged and strengthened by the history of the city.\n\n\nThe museum in the Romanian capital, Bucharest, has received a donation of thirty-six artifacts from the collections of the Diaspora in the city. The donation includes artworks dating back to the nineteenth century, including pieces by the Polish-born artist Irma Bichot, whose early art was inspired by the “Bucharest Spring” (1932–33), as well as pieces by colonial", "The next Biennial should take place at the NYU School of Arts in 2021, and hopefully the 2019 will come to an end this year. \n\n\nCultural historian and curator Kristina Alvarez is suing the New York Museum of Modern Art (NYMoMA) in an attempt to secure the return of the nearly four hundred works she says were stolen from the institution in 2016.The plaintiffs are seeking at least $2 million in compensatory damages and punitive damages. In a complaint filed in Manhattan Supreme Court on March 27, the plaintiff claims that the institution failed to inform the plaintiff of its rights and failed to honor a promise made to pay for the art that was removed from the museum.“I have been a victim of museum misconduct for years,” Alvarez told Artnet News. “In order to hold the museum accountable, it must take immediate and meaningful action to remove the stolen works, and then institute proper and transparent procedures to protect the stolen art. I am asking it to do this now, without delay, and in compliance with the law.”The complaint claims that the museum did not inform the plaintiffs that it had the legal authority to remove the works’ objects and that it failed to take the necessary corrective action. It also claims that", "The next Biennial should be held in 2020. An open call for proposals will take place on November 5–6, 2020. The biennial will include a selection of works by thirty artists who are currently based in the United States. The winner will be chosen by a panel of judges made up of Alderman Antonio Reynoso, María Berrada, and Alexandra Zarraga. The biennial will be divided into three parts\u0097a shortlisting process, a two-day exhibition, and a residency. The first part will run from November 20–24, 2020, and will feature a selection of works by twenty-eight artists. The second part will run from March 7–April 2, 2020, and will feature a selection of works by forty-four artists. The third part, based on a theme of preservation and engagement, will be held from May 3–May 9, 2020, and will feature work by fifty artists.\n\n\nThe Royal Academy of Arts (RA) in London has become the latest British institution to commission a new work by French conceptual artist Georges Apostème. The commission was made by the architect, designer, and curator Anès Alighier and was", "The next Biennial should include a study of the reproduction of violence and the relationship between the artist and the body, a discussion of the cultural and social impact of violence on artists, and a discussion of the biennial as an instrument for political change.”The proposal states that “in order to protect and celebrate the exhibition’s legacy, the Biennial should be transformed into a museum dedicated to the exhibition, where the exhibition’s exhibition hall, exhibition platforms, and curator’s studios can be restored, with the exception of the artwork, which is to be organized as a collection.” The first edition of the exhibition was staged at the Museum of Contemporary Art, Los Angeles (MCA), in 2011 and was picked up by the MCA for a second iteration in 2017, with the show moving back to New York in 2018.\n\n\nThe Boston-based nonprofit Artadia announced today that it will award $3.5 million to ten artists and ten nonprofit organizations that have demonstrated artistic excellence and will be recognized by the museum as part of its 2021–2023 cycle. The grant recipients are Annamaria Albani, a West Coast–based artist, whose work is featured in the upcoming exhibition “Art", "The next Biennial should be held in the city perhaps in 2021, the date of our 120th Anniversary. We have work to do and need your support to do it.”\n\n\nThe National Geographic Society in Washington, DC, has issued a statement regarding the recent wave of unrest and violence linked to the US presidential election, describing it as “unprecedented” and saying it is working with law enforcement agencies to “establish a shared understanding that should put politics aside, and do what is best for America.”“The political atmosphere has never been so volatile and uncertain,” reads the statement, which was issued by the National Geographic Society’s board of directors and obtained by the Washington Post in collaboration with an open records request. The statement condemns the spread of misinformation and fear in an attempt to delegitimize the election results in an effort to undermine the will of the American people. It also asserts that the recent protests are an extension of efforts to undermine the democratic process and the rights of all people, that they are “destabilizing” the civil rights and voting rights movements, and that the recent unrest is an attempt by extremists to use civil unrest to advance their radical agendas.The statement concludes with a", "The next Biennial should be held at the Museum of Modern Art, in New York, in 2021.\n\n\nThe Ateneo Art Museum (Ateneo) in Tokyo announced that it plans to move the fifty-six-thousand-piece exhibition “Zen Aspects of Art” from its site in the Ateneo Shimbun, the local newspaper reports. The announcement was made on October 28, the same day that the show was scheduled to open at the museum. The installation, which will be accompanied by a new book, “Zen Aspects: Japanese Art from the 1970s to Now”, will explore how the museum has sought to incorporate Zen Buddhism into its programming in order to broaden its audience.The new exhibition will feature twenty-two works that were on display at the show’s inaugural edition in September, as well as pieces from the newly opened Zen Garden in the city of Nagoya. The exhibition will also include “Rin,” a new work by artist Nara Motsu, a collaboration between M.I.A. and ARTnews, and will run alongside the show “Satoshi: A Visual History.” The exhibition will also present three new works", "The next Biennial should be held in 2021. Artforum’s March 2019 issue also features an excerpt from the recently published novel City of Dreams, a coming-of-age narrative about a group of post-Soviet artists whose work addresses the effects of war and corruption on a small village in the Russian republic of Sakhalin.\n\n\nThe Museums Association (MA), an international association of British and international contemporary artists, has announced that Emma Harrison will become its first executive director. Harrison currently serves as a curator at the Museum of Modern Art (MoMA) in New York; was director of the Los Angeles County Museum of Art (LACMA); and is a member of the board of trustees of the Tate, the London-based arts institution. “Emma has built a strong and enduring reputation as a leader in the cultural sector who understands the power of art to transform lives and she brings a wealth of experience to our board. Her curatorial approach and ability to build bridges across disciplines and disciplines within the arts will be crucial in our work to support the museum in our mission to provide a platform for the visionary visionaries of our time,” said board chairman Mary Ann Peacock.Harrison first joined the board of", "The next Biennial should be held within the next twelve months. The first edition of the prestigious event, which has been hosted by the local arts center since 2011, was closed on February 27, due to the Covid-19 pandemic.The organizers of the event have said that the new dates for the event will coincide with the second and third biennials, which will take place in the same locations as the first and second editions. In addition to the exploration of new ideas and the reinstallation of the Biennial, the two-year cycle will also introduce new exhibitions, residencies, and residencies of the various artists participating in the festival. \n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is planning to break ground next week for the opening of a new frieze exhibition, “Untitled: A Legacy of Art,” that will highlight work by more than fifty artists. The show will be curated by Mira Dury, who will represent the United States at the Venice Biennale; Alexis Antonio, the curator of photography at the Museum of Modern Art in New York; and Peter Szymczyk, the director of the Museum of Modern Art in New York.“This", "The next Biennial should be staged in the autumn of 2022. “The museum will always have a special place in my heart for its progressive and interdisciplinary collection, and I look forward to working with the new and existing staff in the hopes of achieving a new exhibition.”\n\n\nThe United Kingdom is preparing to leave the European Union. The government announced on Tuesday that it is planning to leave the European Economic Area (EEA), a customs union between the United Kingdom and the European Union, in a referendum planned for March 8. The vote will decide whether the UK should leave the EEA and return to the EU.The government’s Brexit Secretary, David Davis, said that the decision “shakes things up a notch.” However, the aide told The Guardian that it is not a real change in position, but a delay in making a decision that will be followed by a period of consultation with the public. “We’re not there yet, but we’re getting there,” Davis said. The government must still publish its Brexit bill and set out its negotiating objectives.\n\n\nThe Royal Academy of Arts (RA) in London has appointed Mel Chin as its new director. Chin will take up the post", "The next Biennial should be held in 2020. \n Paris’s Dijon-le-Grand, which is located in the city of Aix-le-France, has announced that it will not be taking part in this year’s edition. The announcement follows the United Kingdom’s decision to put an end to its Commonwealth Games after more than five years, and the United States’ decision to pull its best-selling book series from shelves.The French government has stated that it will “work through the issues” and “explore all possible solutions.” The organizers of the 2020 edition of the Dijon-le-Grand Triennale have stated that they are “under no illusions about the challenges ahead.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it will cease operations at sixteen cultural sites in the city, including the Museum of the City of New York and the Metropolitan Museum of Art, during the coronavirus pandemic. The sites were selected from a pool of twenty-six cultural institutions based on their cultural identity, economic importance, and the cultural needs of New Yorkers.“The decision to cease operations at these museums is a", "The next Biennial should be held in 2021.\n\n\nThe Seattle Art Museum and Botanical Garden (SAM) has received a gift of more than five hundred photographs by the late Danish photographer Berit Moritz. The institution received the works from the local Danish community in Seattle, and it has invited the New York–based artist to create a new series of portraits inspired by the photographs.“Berit Moritz: Photographs” is the first of the new series and will be shown at the museum next month. The exhibition will also introduce a new group exhibition, “Berg Moritz: Photographs” at the museum, which has been closed since November 2019 due to the Covid-19 pandemic. The New York–based artist will be given the opportunity to create more than 200 photographs from the series in 2020.The gift includes more than one hundred photographs, including many that were taken during the photographer’s lifetime, and is included in the upcoming “New York and Seattle Art of the 1980s,” which will open in January 2020. It is organized as part of the museum’s collection of photographs, “Berit Moritz: Photographs” will be opened in the spring of 2021.", "The next Biennial should be held in 2022. A commission chaired by Gilbert was chosen for the project in February 2019.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it has created more than 16,000 new positions for cultural workers in its cultural sector. Among the newly hired are 343 cultural workers who are employed in the financial, commercial, and media sectors. The positions are part of a $4 billion cultural transformation strategy unveiled by Mayor Bill de Blasio in January and outlined in a $2 trillion cultural plan that also includes the construction of new City-owned museums and the preservation of public art.Among the initiatives that will be undertaken in the next five years are the commissioning of new programming and the expansion of the current staff of cultural preservation staff through the hiring of part-time, full-time, and full-time positions; the establishment of cultural partnerships with local, state, and regional government entities; and the development of educational initiatives and the creation of new training opportunities.“The cultural sector is critical to our cultural economy and our community and contributes $4.5 billion to the economy,” said cultural secretary Lonnie G. B. Banks. “To help ensure a robust cultural workforce for our neighborhoods and", "The next Biennial should take place in 2020. Among the ambitious projects it will undertake is to create a new public realm in the city, which will be built in partnership with the city’s residents. The new park will be inaugurated by an exhibition of the work of contemporary artists that will be followed by a symposium on the city and its residents, entitled “30 years of biennialism.”\n\n\nThe National Geographic Society (NGS) has launched an initiative to increase the diversity of its board of directors by increasing the representation of women. The announcement comes amid the ongoing investigation into recent sexual harassment and assault allegations against Matt Lauer and Elizabeth Sherman, the hosts of NBC’s Today Show, respectively.“The board was elected following a review that included a thorough and collaborative process that included a rigorous public hearing, a code of ethics, and a vote of confidence,” said trustee and CEO Charles Katzenstein. “In order to advance our goal of increasing the diversity of our board, I believe it is important and necessary to review the composition of our board. At a time when the landscape of American journalism and culture has radically changed, and our society is still reeling from the impact of Covid-19,", "The next Biennial should be held in the spring of 2020.\n\n\nTerror Groups and Terrorist Incidents in France: The French government has launched an investigation into the possible involvement of foreign militants in the recent spate of deadly attacks across France, a French daily reported, after a man armed with a knife terrorized the Saint-Denis shopping district in Paris on Sunday, March 19.The man, who was shot by a civilian, also reached for a gun that was legally owned by the armed police officer who shot the terrorist, who was armed with an ax and had a knife at the time, the New York Times reported. The police have arrested a number of people in relation to the attack, and details about what led to the confrontation are still sketchy. The Paris prosecutor�s office said that the suspect was mentally disturbed and had a background of violent extremism.The incident occurred shortly after a suicide bombing at the Stade de France, the site of the ancient French-American War, that killed at least 120 people. The attacker, who used a device made by Islamic State, was also killed by the police, which later discovered that the weapon he used was a knife, and the twenty-four-year-old woman who was with him was arrested", "The next Biennial should take place in 2021. For the past ten years, Ai and Tate have collaborated on a series of exhibitions devoted to the work of heavily influenced artists, ranging from Michael Ondaatje to Enrico Castellani. The 2020 edition will be curated by Daniel Baumann, who has helmed the museum since 1988 and will take place in West London. “In the years ahead, we will continue to engage with artists and their practices, both through exhibitions and through writing and publishing,” said Ai. The series aims to explore how art and design can be understood as operating as ‘helper’s, helping us to move forward by providing a space for the creative process.”\n\n\nThe Greater Reston Arts Center (GRAFCITY) in Virginia City, Virginia, has received a gift of twenty-five works by six Memphis-based artists, including Jaiden Byrd, Daria Carter, Karina DeSousa, and Jude Dewar. The works were donated by artist-in-residence Kristine Fletcher, who recently completed a major renovation project at the arts center; the museum’s director, Matthew Lewis; and the artists.“The gift of these works", "The next Biennial should be held at the same venue.”Colin Finn, the director of the Biennial, said: “The Centenary Exhibition in 1975, which we were asked to bring to London in 1974, lived up to its name. The exhibition was full of lively and striking works and the project was a joyful celebration of two decades of art. We hope that our new role will bring greater opportunities for engagement with the work of our predecessors. It is a huge honour to present ‘Un-Culture’” to our colleagues and visitors at the Biennial in 2019 and to be able to host the exhibition again in 2021.”\n\n\nThe Museum of Contemporary Art (MoCA) Los Angeles has named Loring Randolph the twenty-second director of the Pacific Standard Time Museum of Art in Long Beach. Randolph will assume her post in March 2020 and will work in conjunction with curator and architect Jane Barlow, the museum’s former chief curator and architect, and director Rebecca Sherrill.“Loring’s leadership, breadth of experience, and ability to collaborate with and support artists and collectors worldwide is unsurpassed,” said Sherrill. “Her ability", "The next Biennial should be held in the spring of 2022. A new exhibition of work by the artists chosen by the Biennial Committee will be presented before the biennial in the autumn of 2022. The 2022 event will take place at the newly created Museum of Contemporary Art (MoCA).\n\n\nAfter the British Museum in London installed a controversial #BlackLivesMatter mural\u0097which depicts a group of young black people sitting in an empty room, surrounded by boxes, in an attempt to highlight the Black Lives Matter movement\u0097on its wall this week, Claire Pope, the director of the London–based nonprofit Black Futures, issued the following statement: “I am deeply concerned. Black Futures strongly objects to the installation, installation, and display of this mural in any capacity, and believes that the Museum should have consulted with the local community prior to allowing the work to be installed by Black Futures and Black artists in London. We strongly believe that the Museum should have endorsed and provided a platform for Black artists to engage with the issues of race and social justice, and we wish the Museum well in its ongoing work and planning.”The mural was created by Black artists Sadiq Abdullah and Nia Naidu and was commissioned", "The next Biennial should be on the United States’ role in the world, with a specific focus on the United States’ role in the twentieth century, and should be accompanied by a retrospective for the eighteenth Biennial of the American Folk Art Museum.”\n\n\nThe Venice Architecture Biennial (VAB), which kicked off on January 3 in Venice and runs until February 11, has released the list of seventy-six nominees for its upcoming edition. Among the works on display are works by thirty-eight artists, including Amelie and Arseny Yemchuk, Kiki Smith, A. J. Hornig, and Jane Panayiotou, and a selection of French and Italian contemporary artworks.Among the sixteen artists who have exhibited at VAB are Arnaud Brandao, Claudine Baille, Christine Casals, Mòria Danese, Rachida Diop, and Svetlana Kavala, and, for the first time, Bianca Cattelan. In this year’s edition, twelve works were selected from the Venice Documenta Collection; the others were chosen from the collection of Karel Knudsen.Joel C. Ellenbogen, who curated", "The next Biennial should be held at the end of November, but discussions about its dates are ongoing.\n\n\nThe Hirshhorn Museum in Washington, DC, has announced that Aaron Siskind has been appointed as its next CEO and CEO of the subsidiary Tacita and Jonathan Siskind Foundation. Siskind and his family are partners in a Washington, DC–based foundation that works with the National Endowment for the Arts to support emerging and established artists and arts professionals.“Aaron Siskind is an internationally acclaimed and highly respected curator whose deep experience and expertise in supporting artists and their work will ensure that the museum’s growing collection reflects the Siskind legacy, and continues to thrive,” said David Wolfe, director of the Siskind Museum.Siskind is currently a curator at the Museum of Modern Art (MoMA), where he has served as the chief curator since 2011. In 2018, he was awarded a MacArthur Fellowship. Siskind, who was born in New York, is the son of Alfred Siskind, a New York textile magnate, and his first wife, Los Angeles–born actress Katia Siskind.“Aaron Siskind is a man", "The next Biennial should be held in 2022. Thu, Feb 25, 2020, at 7 PM, Fondazione Biennale\n by Anna-Sophia Mercer Architects and Kohn Gallery will present their twenty-third installment, “Tobacco and the Modern World,” in the summer of 2021. The exhibition will be followed in 2022 by “PROCESSIONAL ART,” which will be staged in March and March 2022, respectively. The 2020 edition of the exhibition comprises 60 works, which are divided into seven categories: animation, performance, sculpture, photography, installation, video, and performance art.“The central idea of the exhibition is to show how an art-making process, in which we are still ignorant about the full range of possibilities, can become a new kind of landscape,” wrote Kohn Gallery director Marta Kudacki in a statement. “From the picturesque pinnacles of fibrous glass, to the contemporary sculptures of Mark Rothko, Lisa Željko, and Klaus Schirmer, and to the most speculative works on music and film, we hope that this year’s exhibition will prove a record of artmaking", "The next Biennial should be held in 2024. It will also receive funding from the National Endowment for the Arts.\n\n\nA group of American artists, including Robert Irwin, Paul Gauguin, David H. Dyer, Thomas Heatherton, Thomas Joshua Tree, and Frank Gehry, have withdrawn their support of the Republican Congress’s tax-cut bill, which is expected to be unveiled on Thursday, and are urging fellow creatives to do the same. “We ask that you remember that the bill is a bipartisan effort and that your colleagues on both sides of the aisle are truly committed to lowering taxes for ordinary Americans, and not to score political points by making deals or by using the budgetary cliffs to score political points,” reads a letter penned by the group, Coalition for Tax Reform. “We hope that you will consider carefully and act in solidarity with the artists who are withdrawing their support from the bill. We hope that this letter will be a powerful signal for our colleagues who are still committed to supporting the bill and that we can work together to ensure that we have a bill that truly provides relief to hard-working middle-class families across America.”The letter concludes with the statement, “We, the undersigned", "The next Biennial should bring together artists and non-artists. Members of the Exhibition team will present a selection of works at a time. The first show will be at the Art Institute of Chicago’s new home in the historic West Congress building in March 2020. The second will be at the Art Institute of Chicago in March 2021. The third biennial will be held in 2022.\n\n\nThe São Paulo Art Foundation (SPFA) announced today that José Alfredo Martins has been named its new director of sustainability. Martins comes to SPFA from Madrid, where he has served as the director of sustainability at Santander Bank, the Royal Bank of Scotland, since September 2017. He succeeds João Moutinho, who has served as SPFA’s interim director of sustainability for the past twelve months, and will take up the post in March 2021.“The change at SPFA is not only about the recognition of a new vision for sustainability, it is about an appreciation of the impact that sustainability has on people and the environment,” said Martins. “The future of sustainability is now and the future of art is now. I am very excited by the prospect of leading São Paulo Art Foundation and participating in the", "The next Biennial should be held at least twelve months after the conclusion of the third Biennial. The first Biennial was held in 2019. The second Biennial was held in 2021. The third Biennial was held in 2025. The fourth Biennial was held in 1987. The fifth Biennial was held in 1981. The sixth Biennial was held in 1982. The seventh Biennial was held in 1985. The eighth Biennial was held in 1988. The ninth Biennial was held in 2000. The tenth Biennial was held in 1993. The eleventh Biennial was held in 2004. The twelfth Biennial was held in 2008. The thirteenth and Fourteenth Biennials, respectively, were held in 1988 and 2009. The seventeenth and Eighteenth Biennials, respectively, were held in 2013 and 2017. The twentieth and Twenty-Second Biennials, respectively, were held in 2018 and “20.” All fourteen of these biennials will be hosted at the Museum of Fine Arts, Boston, from March 14 through March 16, 2020. The next phase of the Museum’s $1.2 billion renovation project, which was completed", "The next Biennial should be held on the theme of the daily life of the body, in the spirit of the current exhibition “Celebrity Biennials: Art and Consumption in America” at the Museum of Contemporary Art (MoCA) Los Angeles. In the months leading up to the visit, the institution was working on a new performance series called “Celebration Week” and an online forum where visitors and artists could share experiences and ideas. An open call for proposals for the 2019 event was held on October 3, and the jury selected a selection of twenty-five proposals. The show, which will run through December 31, will focus on the themes of life, death, and material objects. “The inaugural Biennial, organized and curated by the Museum of Contemporary Art, Los Angeles, was a success,” said Roberta Smith-Dorsey, chair of the jury. “It was a joint effort between the curators, the artists, and the staff, and we are excited to see what the next iteration of Celebration Week will look like.”\n\n\nThe Museum of Contemporary Art (MoCA) in New York announced today that it has received a gift of thirty-two works", "The next Biennial should be held in 2020, but the initiative will only be launched if the MFA’s board approves a new contract. According to the New York Times, the board has already cut the budget of the biennial by $1 million since the majority of the funds will be used to cover the cost of the artworks. The MFA’s board plans to hold a special meeting on October 29 to vote on whether to extend the current contract, but the announcement of a new contract has yet to be made. After the board makes its decision, the contract will be implemented by the MFA’s board of trustees until November 30, 2020.“We are grateful to the board of trustees for taking the necessary action in light of the upcoming contract cycle, and for their consideration of our proposal,” said Steven G. Pate, director of the MFA. Commenting on the board’s decision, Peter Schaffner, president of the MFA, said: “Our commitment to the community has always been to the MFA. We know the MFA will remain a force to be reckoned with in the coming years. The MFA’s acquisition of works by artists such as Ter", "The next Biennial should be held in 2022.\n\n\nLos Angeles’s Metropolitan Museum of Art (MCA), the Museum of Contemporary Art (LA MoCA), and the Los Angeles County Museum of Art (LACCA) have announced the launch of the Museum of Modern Art (MoMA), located at 1240 South California Street, as the next iteration of the Art of the Party. The museum will invite visitors to an exhibition of work by seventy-five artists and collectives, including Andrea Dwork, Andreas Eggert, Eccentric Dreamers, Frank Gehry, Lucio Fontana, and Louise Bourgeois, to celebrate the opening of its new building, an extension of the museum’s current campus.“The Met is thrilled to be able to celebrate the opening of MoMA with an exhibition featuring seventy-five works by artists who have worked in the arts or have lived and worked in the city of Los Angeles for many years,” said Mary Anne Carter, director of the Met and longtime MoMA curator. “This is a remarkable collection, and we are confident that it will excite and educate visitors to the Met.”The inaugural exhibition, “A Conversation with Bruno Latour", "The next Biennial should be the first time the museum will have an Indigenous artist-designed exhibition space. “We had hoped to have the opportunity to create a new exhibition space designed by an Indigenous artist at some point in our future plans, but unfortunately the current space is too small and requires too much renovation for the museum,” said Paolo Schettino, director of the Museo de Arte Moderno in Venice.The institution has also been working to upgrade the existing exhibition galleries with new works by artists such as Renata Cervetto and Tala Cervetto, the latter of whom designed an exhibition space for the first exhibition in the museum in 2003. The renovation, which also involved the re-constructing of the exhibition spaces, the main building, and the grounds, will cost around €66 million.In the coming months, the museum is planning to open a new special exhibition on contemporary art with works by Mariano Tostitos and Nancy Spector, a new feature on the history of modernism with works by OM PA GRADY, and an event on the Spanish colonialist Espacio de Bellas Artes.\n\n\nThe Museum of Flight has appointed Rachael Barlow as its", "The next Biennial should be held in 2021.” If the work is chosen, the museum will receive $25,000, but only if the exhibition is held in the United States and is considered eligible under Section 303 of the 1964 Civil Rights Act. The Biennial will be hosted in the museum’s Centennial History Room, which will include two displays dedicated to American Gothic architecture, a wall-sized view of the Chicago River, and a sculpture garden.The announcement of the 2019 Biennial marks the culmination of a decade of work by the 119-year-old architect, who received his undergraduate degree from the University of Chicago in 1977. Over the years, he has created more than eighty sculptures, including the monumental work The American Gothic: A Retrospective, 2013, which was exhibited at the Art Institute of Chicago in 2014, and Invisibles: American Art from the 1920s to the Present, 2019, which was presented at the Art Institute of Chicago in 2018.\n\n\nThe Museum of Fine Arts (MA) in Boston has received a gift of more than 1,300 works by four-fifths of a century-old Polish master Władek Marek, including a massive double-booked edition of his", "The next Biennial should be a celebration of our vital role in shaping the future of the city, from our preservation to our future creation. We must ensure that the next thirteen years are spent in action, not reflection. We must continue to innovate and experiment, and we must do so with or without your blessing. The new Board of Biennial Directors is composed of Arturo Rosales, Carsten Haerlich, Teresa Catellani, and Juan Tamalolo. The full list of participants is as follows: 1. San Francisco’s Metropolitan Museum of Art: 2. New York’s Museum of Modern Art: 3. London’s Tate: 4. New York’s Metropolitan Museum of Art: 5. New York’s Museum of Modern Art: 6. New York’s Metropolitan Museum of Art: 7. Boston: 8. New York: 9. New York: 10. New York: 11. New York: 12. New York: 13. New York: 14. New York: 15. New York: 16. New York:", "The next Biennial should take place in 2021.\n\n+-----------------+\n\nThe Maritime & Lakes Gallery in London, which was set up in 2015 by Richard Mayhew to showcase new work by British artists, is relocating to the United Kingdom. It will be inaugurated by a group show, “New Perspectives: British Art in the Eighteenth Century” (2019), and will be led by curator, artist, and scholar Julie Fogle.Fogle, who has curated shows at the Maritime Gallery, the Palace Art Museum, the Royal Academy of Arts, and the Tate, will also lead a new stage and a new exhibition at the Maritime Gallery. Since the institution is slated to lose revenue as it moves from its original location in the city, the Museum of Contemporary Art (MCA) in London has hired artist-in-residence Max Halper to run the ferry terminal at the port of Dover, and the institution is also negotiating with the port to establish a new exhibition space in the vessel.“The Maritime Gallery is thrilled to welcome Richard Mayhew’s group, ‘The Maritime & Lakes,’ and is working closely with the museum to ensure its long-term future. We are confident that this new partnership", "The next Biennial should focus on “intellectual and social capital,” said Arturo Olmedo, the director of the Museo de Cultura Artes. “The festival’s theme, ‘from plant to tree, embodies a deep and timeless appreciation of the beauty, intelligence, and strength of the world around us.”The upcoming edition of the Biennial will take place in the city of Guadalajara, Mexico, from August 21 to August 27. New artists and new projects will be presented by artists and their collaborators in various forms, including video, photography, sculpture, installation, performance, and performance-based work.\n\n\nA major new study by the Museum of Fine Arts (MA) in Boston has found that, in the eight years since the museum opened, attendance has increased by 213 percent across all its venues. The exhibition, “From '70 to 2016: A Visual History,” which features work by more than sixty contemporary artists, was curated by artist-in-residence William Winograd and will close this fall. In the next issue of Artforum, Susan Thomas and Alex Lichtenstein look at the recent resurgence of interest in the history of art in the United States", "The next Biennial should be held at the same time as the first, and will organize a selection of works that explore the theme of “life and memory.”The statement continued: “We know that there are many people who are deeply disturbed by the show of violence in the name of art. We hope that the next Biennial will give them some comfort in these dark times.” The announcement of the dates for the city’s 150th anniversary celebration coincides with a wave of anti-capital punishment protests sweeping the globe in the days leading up to Monday’s historic ruling by Argentina’s Congress to repeal the country’s constitution. The country was then plunged into a constitutional crisis. In an attempt to placate the country’s opposition, President Mauricio Macri announced that no new elections would be held and promised to step down in January 2021.The National Forum for Culture and Arts in Buenos Aires issued a statement condemning the decision, calling it a “serious mistake.” “The future of Argentina’s democracy is at stake,” the statement reads.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it is preparing to welcome visitors back to", "The next Biennial should be in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $50,000 donation from the Charles and Lucille King Family Foundation in support of its $500,000 2019 curation and 2019 showfund award. The donation—which also came from a group of prominent Massachusetts philanthropists—is the largest gift made to the institution since the collision-damaged arts center was founded by the couple in 1975.After a six-month review period, the foundation awarded the $50,000 to the MFA’s Museum of Fine Arts (MFA) division. Margot King, the foundation’s president and CEO, said: “We are honored to receive this gift from the Charles and Lucille King Family Foundation, which will go toward supporting our curatorial and artistic programs for two years. We are grateful to the King family for their generous support of the museum since its inception and we look forward to sharing the Kents’ vision for the museum with their children and grandchildren.”\n\n\nThe French Ministry of Culture announced this week that it plans to establish a new museum dedicated to the works of the French surrealist and the first", "The next Biennial should focus on “Intersectionality: Using Art to De-Stir the Body.” The next will commemorate the twenty-fifth iteration of the London and New York Biennials, which will take place between September and November 2021. The 2019 edition featured work by nine artists, including Ema Agoston, Mark-Paul Kreutz, and Jenny Holzer.\n\n\nThe Tenement Museum in Harlem (TEM) is moving its inaugural exhibition, “The Structures of Life: The Tenement, 1961–1965,” to February 20, 2022. The museum is canceling the show, which would have featured new works by thirty-six artists, including David Kahane, Alex Katz, and David Salle, and is asking that it be moved from March 21 to March 26, 2022. It is also pushing back the debut of the exhibition by a month, from March 19 to March 22.“We are thrilled that we are able to present the exhibition at this critical moment in its history,” said James Cuno, the museum’s director. “The show will celebrate the work of new and established artists in a way that honors the themes of the year and the themes of", "The next Biennial should be held in 2021.\n\n\nA group of artists who are battling to save a 17,000-work collection of Chinese folk art that has sat in storage for years in Beijing are now suing the authorities to have the work returned. The artists claim that the authorities are infringing on their intellectual property rights by seizing the works without their consent and are demanding that the authorities return the works within a month. “The lawsuit is about the collection, its preservation, and its return, not about the objects itself,” said painting historian and curator Hu Jie, who spearheaded the effort to have the works returned. “On the one hand, I really like the idea of a full restitution. On the other hand, I don’t want to see any part of the collection, its contents, or its return to China.”The activists’ lawsuit names the Beijing Municipal Administration (BMA) and the Beijing Fine Arts Museum as defendants. It claims that a BMA official gave the activists a heads-up about the upcoming demolition of the Wangfujing-1 artworks in late July and that the BMA failed to act in accordance with its own policies. The activists claim that the demolition violated a new", "The next Biennial should take place in 2021, and the final in 2022. Currently Biennials in Los Angeles, New York, and San Francisco have the opportunity to award $13 million each, though the final year of the event has yet to be determined. For the first time ever, the final two episodes of the biennial will be presented by the same two Coachella Valley artists.The biennial, which was established by the contemporary fashion label L.A.-based artist and filmmaker Marc Anthony, is funded through a combination of gifts and donations from the public; individuals; companies; and artists. The artists who are collaborating with the New York institution are Hernán Díaz and Christina Pérez. The New York–based artist will also receive $20,000 in prize money. Also performing at the biennial is Sara Cwynar, an Albuquerque, New Mexico–based artist whose work focuses on the intersections and complexities of race, gender, and gender roles; Juan Carlos Hernandez, a Colombian documentary filmmaker based in Los Angeles; and Julie Ros, a New York–based artist whose work explores women and the body.Other artists who have been selected to participate in the New York fair are Jorge Jiménez,", "The next Biennial should include a presentation of the works of Jean-Luc Godard, which will be followed by a discussion of the new exhibition “The Art of Building,” which will be staged in the same building as the exhibition. The second exhibition will be an exploration of the movements of the earth and the moon by the American artist and explorer Robert A.M. Peale. The third biennial will showcase the work of the Japanese artist, thinker, and scientist Masahiro Fujiwara. The final exhibition will be a performance by Hannah Wilke.The 2018 event featured work by Gavin Brown, Alicja Kapp, and Marta Deladova, among others. The first Biennial, “Burbank: Rebirth of an American City,” curated by Stan Jin, opened in the spring of 2019. The third biennial, “Burbank: Stories from the Earth,” opened in the fall of 2020.\n\n\nThe Smithsonian Folk Art Museum (FAM) in Washington, DC, announced today that Marta deladova has been selected to represent the United States at the Fifty-Ninth Venice Biennale, which will take place in May in May", "The next Biennial should open in 2021 and will focus on “contemporary art and politics, ancient and modern art, and the development of conceptual and physical art.”The ten-day event will begin with a reception, which will be followed by a concert in the building, followed by “Avant-Garde and Modernism” (2019), “Contemporary Art in the Age of Confucius,” and “Avant-Garde and the Chinese Art of Art of the Eighteen Immortals” (2019–2020). The exhibition “Avant-Garde” will feature forty mid- and late-20th-century Chinese artists, including Wang Wei (1962–) and Shang Gao (1957–); and its next iteration will be held in 2022.\n\n\nThe Tate’s board has announced that director Maria Balshaw has been appointed as the new chair of the board of trustees. She will take up the position at its London headquarters on January 31.“The appointment brings an exciting new dimension to Tate as it continues to grow and develop,” said board chair Ann Goodman. “Maria brings with her an extensive experience in running a large", "The next Biennial should be held in 2020 and the first in 2021. The twenty-second edition will be staged at the same venue as the previous one, in the same city, and will be hosted by the same curators. “The Biennial is about much more than the collection or exhibition of works,” remarked curator Madeleine Knapp. “The Biennial is about years of work by artists in the public and private collections. It is about the biennial as an institution and about the way in which art and architecture can shape, enhance, and resolve complex social, political, and environmental issues.”\n\n\nThe Santiago Bernabéu Museum of Art (SABA), the Bolivian capital’s national museum of contemporary art, is expanding its online viewing rooms and introducing new initiatives to support the growing number of artists who rely on its galleries to raise their wages. As part of a new partnership between the institution and a group founded by Pablo Picasso, the museum is launching a new portal dedicated to art-making and a digital platform that will act as a hub for artists. The initiative is part of its ongoing project to adapt its exhibition programming to the needs of a changing market and to promote greater access to", "The next Biennial should take place at the Grand Palais in Paris in December 2020, and the forty-fifth will take place at the Museum of Modern Art in New York in March 2021. The museum will also be closed until April 20, 2020, but will reopen on May 30, 2020. The forty-third will be held at the Musée National Picasso à Paris (MPC) in Paris from May 23 – May 28, 2020, and will incorporate the biennial’s theme, “the body, the soul, and spirit,” in its opening ceremony on May 2.The exhibition will also include photographs by Louise Bourgeois, Jean-Pierre Huyghe, and René Magritte; a sculpture by Jean-Michel Basquiat; and a concert recording, “The Body in Satisfaction,” by the late French composer Rômé Sartre, which will open at the Palais de Tokyo in Paris on January 31, 2021.Media outlets have reported that the proposed new exhibition, “The Body and the Soul: 60 Years of Biennial at the Museum of Modern Art,” will draw from the museum’s collection of more than 1,200 works", "The next Biennial should be held in two years and it may even be this year, said Peng Li, the deputy director of the Beijing-based Centre for Contemporary Art.Echoing the city of New York, the exhibition will explore the body and the body language as well as the interaction of the arts and the body. Through an interdisciplinary approach, the exhibition will focus on the interdependence of the arts and the body.“We have made great efforts to use the most contemporary art and cultural traditions, which are carefully selected, to explore how the body can be used to promote spirituality and wellness, but we hope that this exhibition will be a good way to kickstart the new generation of artists who are interested in the Body and the Body Language,” said Zhang Yaxuan, the director of the Beijing Gallery of Contemporary Art.\n\n\nThe November 2017 issue of Dengeki Bunko’s Bunko Shimbun magazine announced on Monday that Matsuya Fujimoto has been promoted to the role of director of the September 2018 edition of the magazine. Fujimoto will take up the post on November 17. Previously, he was head of the November issue of Dengeki Suntory magazine. In February 2019, Fuj", "The next Biennial should take place at the Museum of Contemporary Art (MCA), San Francisco, in October 2020. The exhibition will be hosted by the artist-run curatorial program, the Contemporary Arts Lab (CAL), and the museum itself.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a huge gift from the National Trust for Scotland. The £8 million ($10 million) donation includes the restoration of the building and all of its contents and includes the first works by Joan Miró, which were on display as part of a major exhibition at the institution in 2017.According to the Scottish Times, the gift, which was made during a ceremony in London on October 28, will also include new materials that will enable the institution to better display the work of Scottish artist and educator Ruth Rendall. The work will be added to the existing sculpture garden on the museum’s campus.Rendall, who first met Miró through her work and became an artist-in-residence in 2018, was commissioned to paint a mural for the institution’s new building in 2020 and the project was completed in 2017.“I am thrilled to have received this magnificent gift that will allow LACMA to become a truly", "The next Biennial should take place at the Italian Cultural Centre in Venice in 2022. Ottavio Battista, the Italian director of the Palazzo della Scala, and Pier Luigi Bocconi, the architect of the Palazzo della Scala, have jointly proposed a triennial of deconstructions, 10,000 paintings, and a collection of sculptures, and Francesca Cercielli, the founder of the Florence-based artist-run nonprofit Museo Cercielli, is pushing for a full-scale exhibition in Italy.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it will re-open to the public on August 16. The exhibition, titled The Museum of Modern Art (MoMA), will be open to the public from 11 AM to 4 PM, and will be closed from August 14 to August 17.The institution will also gradually reconfigure its exterior and interior in order to better accommodate the exhibition. According to curator and art historian Janice G. Evans, the museum is trying to include more of the museum’s collection inside it, so that the collection can be accessible to visitors from both the outside and inside. In order to accommodate the work of more artists, MoMA", "The next Biennial should take the form of an exhibition of contemporary art, especially American contemporary art, with the focus on the development of the artist-as-human and the strengthening of the artistic environment. The theme of the exhibition should be the socialization and development of the mind and the body through art.”The 2019 edition of the Biennial, which was organized in partnership with the Museum of Contemporary Art (MCA), Los Angeles, will receive a grant of $1 million from the MCA’s Endowment Fund, which is managed by the MCA\u0097the museum is currently attempting to raise $4.5 million to rebuild the city’s original National Portrait Gallery. The institution will also award $500,000 in free grants for artists and small business owners.The MCA will also provide $500,000 in free prizes to artists and small business owners in Beverly Hills. The funds will be distributed in partnership with the local community through a program called the Beverly Belle and the Beverly Branch. The program was launched by MCA director Robert Mapplethorpe and will run through November 7.Among the projects that will be organized in the city are a new free arts and culture destination in the city’s North Hollywood", "The next Biennial should be held in the autumn, and the first was set to take place in 2019. The exhibition will see a significant change to its programming and will be fully funded by the city of Helsinki, with the help of the city council. The organisers are hoping that the event will draw up to three million visitors. Guided tours of the site will also be offered in the coming months.\n\n\nThe Honourable Tadeusz Musik, president of Poland, has announced that the country will offer the UNESCO World Heritage site of Wroclaw the opportunity to host a biennial exhibition in 2020 as part of a deal that will see the two countries collaborate on the “inaugural” exhibition in Wroclaw. The partnership will also enable Wroclaw to host a series of lectures, workshops, and other events at the interdisciplinary museum.The announcement follows the two countries’ recent agreements on the theme of the exhibition. The first, announced last October, saw the Polish pavilion at the Venice Biennale pick up the pieces from the former Soviet region of Belarus, a move that the country hopes will encourage the region to create new works. The second, announced last April, involved the Polish pavilion at the", "The next Biennial should kick off on September 28 and will then last through March 12. Front Row: An Exhibition of New Art from the Contemporary Arts 2020 will take place next year.The show will present work by artists and organizations that have participated in the Berlin Biennial in the past and will address topics including the relevance of contemporary art, the role of art in social change, and the importance of art in politics. The 2020 theme is “Reclaiming the Humanities: Art, History, and the Struggle for Democracy” and will be curated by Anton Kern, who is currently working on a book on the biennial. Front Row: The Future is Now by Emma Lazarus will be presented by Elizabeth Alexander, who is currently working on a novel about the biennial, and will be released in early 2021.Written by Jonathan Kaplan and directed by John Crowley, Front Row: An Exhibition of New Art will be on view at the Museum of Contemporary Art Berlin until October 5. “The German Biennial is an international phenomenon that has played a crucial part in shaping the course of modernism and art in Europe and the world as well as transforming the museum’s collection and collection-making along the way,” said Marcel G", "The next Biennial should be held in August 2020, and the first in June 2021.\n\n\nThe Pérez Art Museum in Mexico City has received a donation of fifty paintings\u0097including paintings by Pablo Picasso, Nude with a View, and The Spanish Pavilion for the Pérez Art Museum—that were previously on display in the exhibition “Pablo Picasso: Paintings from the Pérez, Mexico” between 2007 and 2012. The works were purchased by museum director Francisco Queiroz.The gift, which was made by the collector Maria Teresa Castellanos, was made in memory of her friend and fellow Pérez Art Museum curator Luis Alejandro Castellanos, whose association with the museum led to the acquisition of works by Pablo Picasso, Nude with a View, and Spanish pavilion winner Agustín Arruda.The works will be inaugurated with an exhibition of works that were formerly on loan to the institution from the Picasso & Arruda family in 2005. Prior to the donation, Queiroz and her husband, Francisco Pérez, were involved in the development of the Picasso Collection in Las Cruces, Mexico; the Pérez Arts Center in Mexico City; and", "The next Biennial should be held in the spring of 2020. “The future of the Art Museum is at stake,” said David Nelson, chair of the board. “We are committed to working with the board to develop an innovative and long-term strategy that will ensure the museum is around for future generations.”The upcoming biennial will feature shows from the newly acquired holdings, including “Pale Horses: American Art and the Vietnam War,” which will examine American art and Vietnam and the Vietnam War, and “The Instructor,” a show examining the instructional role of art in the classroom. The work is slated to open at the museum in the autumn.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that it has received a gift of two hundred photographs by American artist and theorist Stanley Olson. The donation, made by the artist and collector William Blakey, comes in the form of a series of works, which will be presented in a solo exhibition at the museum next month.The works, which were acquired by the collector in 2014 as part of an international show organized by the artist\u0097the first in the United States since 1973\u0097are part of a series of works that", "The next Biennial should take place in 2021 and is scheduled for October 11–October 13.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Rina Rocha, the director of the Los Angeles County Museum of Art (LACMA), as its next director. Rocha previously served as deputy director of the Los Angeles County Museum of Art (LACMA) from 2017 to 2018.“With her raft of projects for the museum and international collaborations, Rocha is poised to improve upon and extend LACMA’s legacy as a major cultural institution,” said museum director Michael Govan. “Her new role allows LACMA to have a strong voice in the global conversation about its critical role in the creation of the regional and national cultures of California.”Rocha’s first major public project as director will be to establish a new museum-wide initiative to support the Los Angeles community. The initiative will bring together local activists, artists, and other cultural producers to create a major retrospective of the pioneering work of African American artists in 2020. The project will feature the work of seventy artists, including Carl Young, James A. Russell, LeRoy Davis, Akoma Omog", "The next Biennial should be held in 2020. The exhibition will feature the work of sixty artists, including Elijah Aaronson, Gertrude Carvalho, and Alighiero Cattelan, who have been selected among the top ten students of the year 2020 by the next Biennial. The institution will also exhibit works by the artists who will participate in the exhibition in 2020, including Eva Morales, Laura Pagac, and Zoya Rochat. The exhibition is an extension of the Museum’s programme of projects and exhibitions in partnership with the Beijing Biennale, which celebrates the city and its cultural heritage, and will be held in conjunction with the Chinese New Year festival.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has announced that it is now accepting donations of artworks, furniture, and other items in need of repair or restoration. The new initiative, launched in February 2017, was inspired, according to director and CEO Deborah Adams, by the restoration work that was already underway at the institution. “The work of the MFA community is central to transforming the institution into a museum that can become a model for the city and the country, as we recommit to serving our community and our environment,", "The next Biennial should be held in the spring of 2022, with the exhibition marking the fifteenth anniversary of the creation of the Biennale de Lyon. The first edition of the exhibition was held at the Museo Nacional in Lisbon in 2013.The biennial will be organized as the philosopher-dissident Michel Foucault envisioned it and will reflect the complexity of the contemporary world, Foucault’s view that “has opened up a new field of existence in which language, language, and society may now be analyzed and treated as a whole.” The exhibition will be curated by Alexandra Maragos, who is currently the director of the Institute for Contemporary Art in Vienna and the head of the Centre for Art and Restorative Practices at the University of Vienna.Other highlights of the show are a reinterpretation of the history of the exhibition “In the Beginning” (2007–2009), a new series of exhibitions dedicated to the work of Mies Van der Rohe, a German conceptual artist who died last year at the age of eighty-three, and the return of the forty-eight-foot-long replica of the iconic 'Tucchin Tank” in the exhibition “Theater of Operations: The", "The next Biennial should be held in 2020. The select committee made the announcement after conducting an inquiry into the institution’s academic and cultural history with the aim of determining the tenor’s future. The committee also considered the array of artistic activities that might be carried out by the institution, including the installation of works by artists such as Nathalie Abbott, Hélio Oiticica, and Susana Pilar Real, among others, and the potential for conducting programming in the building.“The Biennial is a uniquely American institution,” said committee chair Mark B. Rubenstein. “Innovation is central to the vitality of American art and its ability to connect with the public. The Biennial is an extension of our mission to foster a more humane and inclusive world through art. We appreciate the work of the artists, and we hope that they will continue to be the nucleus of our own program, as we continue to support them and our mission with biennial funds.”\n\n\nLennon family members are suing the museum in Montana over a racist display that touched off protests and unrest in the state last fall, reports the Art Newspaper. The suit, which was filed by the Annunaki", "The next Biennial should commence in the autumn, 2020. \n\n\n\nThe Tate and the British Council announced today that Gerry Mather will be the artist-in-residence at Tate Britain in 2020. Mather, who is currently conducting research for a new book on the life and works of American painter Albert Oehlen, will be based at the museum for two years. Tate chief executive Maria Balshaw said the commissioning of Mather to represent the UK in the upcoming exhibition “is a milestone for Tate’s curating team. He has been a champion of American art since the late 1980s, when he first visited the Tate in his hometown of Leeds, and has made countless artworks, commissions, and exhibitions.”Mather, a British resident of the US who immigrated to the UK in 1985, will be based at Tate Britain for two years, ending his residency in 2022. His next exhibition, “Paleontology: From the Greeks to the Moderns” (2019–20), is on view until December 20. The commission, which was led by Michael Fernandes, is scheduled to run from March 19 to March 19, 2020.“When the jury returned its verdict on", "The next Biennial should be in 2021. Artforum has contacted J. Paul Getty and the Getty Trust for a comment. \n\n\nThe Montreal Museum of Fine Arts (MMA) in Canada has received a gift of seventy-six paintings, sculptures, prints, maps, photographs, audio and video works, and other artifacts from the Japanese artist Takashi Takeda. The gift includes two works by Takashi Takeda’s wife, the Japanese artist Ai Ai Ai, as well as several paintings by other artists, including Galerina Leoni and Jigar Shah.“The museum is grateful to the artist and to the museum for the extraordinary generosity of the Japanese artist Ai Ai Ai and for the generous gift of these works, which are essential to understanding the life and work of Takashi Takeda,” said museum director Hubert Leclerc. “We are thrilled that this extraordinary gift will open new paths for contemporary and contemporary art in Japan.”The gift includes a number of works by Takeda that are currently on display in the exhibition “Takashi Takeda: On the Surface of Things” (2019–2020). He is currently the subject of a retrospective at the Fuj", "The next Biennial should be held in 2021 and will be comprised of fifteen artists from twenty-six countries and territories\u0097including Brazil, Chile, Mexico, Peru, and Venezuela\u0097and will host an exhibition of contemporary art from thirty-six countries and regions.\n\n\nThe Hong Kong-based artist Kai Wai-chi, who often draws from his personal experiences to study and make sculptures with his own two hands, has died at age eighty-three. His work has been exhibited at the Hong Kong Museum of Art, the Museum of Modern Art, the Beijing Gallery of Modern Art, the Nanjing Biennale, and the Hong Kong Art Museum.Born in 1949 in Hong Kong, Wai-chi studied at the University of New South Wales in Canberra, before training at the Art School of New South Wales in Melbourne. He began his art practice in 1969, when he was ten years old, and has since exhibited work at museums such as the Art Gallery of Sydney and the Art Institute of Chicago. He has also been featured in feature-length films and documentaries, including The Grapes of Wrath (1981), which was produced by the Academy of Motion Pictures and based on the life of Henry C. Farquhar, and The Watercolors", "The next Biennial should be held in the city in 2021. “The whole idea is to have an international exhibition about the history of the Biennial, but we do not have a space for it in the city,” photographer Ciarán Donnelly told the New York Times. “I believe it is the duty of the city to organize an exhibition about the history of the Biennial.”The exhibition, titled “The World as a Whole: From the Egyptian Revolution to the Present,” will be on view in the exhibition “The Future of Art in the City of Light” (2019), a partnership between the city and the International Committee for the Architecture of Modern Life (ICAAM), from October 27 to November 21. The ICAAM show will be followed by a curated exhibition of work by the artists featured in the exhibition, which will be inaugurated by Marc-Olivier Haag and Léa Chedid, at the ICAAM from November 26 to December 8.The Biennial has faced many challenges over the years. In 2013, the city opted to cancel the event due to fears that the exhibition “will undermine the city’s efforts to attract new visitors.�", "The next Biennial should take place in the city of Algiers from February 14 to February 16. The institution will be inaugurated by a new collection of more than 3,500 works by forty artists from Africa, the African diaspora, and the Middle East and will be led by curator Balthazar Aliyuja. The exhibition will be organized in collaboration with the Institut Pasteur, with the participation of twenty-two artists from Africa, the African diaspora, and the Middle East. The exhibition will take place in conjunction with the Biennial de l'Amitologie, which will extend the theme of the inaugural edition to March 27.\n\n\nThe British Museum (BMI) in London has received a $125,000 donation from the estate of the late British director Tony Hall. The gift includes a bronze statue of Hall, who died in March 2019, and his wife, Susan, who were among the many whose work influenced the museum’s development. The gift was made in honor of their eighty-fifth anniversary and comes amid a period of significant change for the BMI.The institution was granted an exemption from the closure imposed by the government after the coronavirus was first reported in Britain in December", "The next Biennial should be held in 2022, and the next one in 2020. “The question of how to create new space for the collection of the historical works of our own country is a sensitive one for Russia,” said Vladimir Astakhov, chairman of the state arts foundation Rosatom. “We will take our time in planning, but I think the most important thing for us is that the collection will be stored in a museum with a positive historical and cultural orientation.” As part of the agreement between the two countries, the National Gallery of Art in Moscow will be renamed and a new collection of more than thirty hundred works organized under the aegis of the state-owned Rosatom will be inaugurated.The Tula Museum of Art in Moscow also announced that it is collaborating with the state-owned state-funded arts and culture organization Rosatom to preserve and present the photographs of the 1917 revolution in the country. The photographs, which were taken by photographer Sergei Eisenstein, will be on display at the museum in a retrospective of his work “The Tula Triennale” in early 2020.The Tula’s collaboration with Rosatom was announced in a letter by the National Museum of Modern Art in", "The next Biennial should take place sometime in 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it awarded $11 million in grants to more than twenty artists. The ten finalists chosen for the biennial’s $10,000 Artists Grant were Pace, Camille Blatty, Nicholas Bonetti, Rachel Ezra, Jello Bava, and Kelly Rowland. The institution will award the individual awards of up to $2,000.The twenty-five projects that were selected for the grant cycle were: Camille Blatty, New York, NY: Laundromat, 2015’s exhibition\n\nCamille Blatty, New York: Suspended Animation, 2015’s exhibition\n\nHayford Croft, Manchester: Museum of Modern Art, London: Running Time, 2016’s exhibition\n\nTina Glass, New York: The Lights, 2018’s exhibition\n\nBenoit Blatty, New York: The Body and Space, 2019’s exhibition\n\nSarah Bloodworth, New York: The Salt of the Earth, 2019’s exhibition\n\nAdam", "The next Biennial should take place at the Institute of Contemporary Art, Dublin in 2021. \n\n\nThe National Gallery in London has appointed Adele Cromwell as the next director of the National Museum of Scotland. Cromwell comes to the institution from the National Museum of Art, which she has helmed since 2013. Previously, she was the director of the National Museum of Contemporary Art, Birmingham, from 2016 to 2017. She succeeds Catherine Crosthall, who departed the institution in the summer of 2019, and will take up the post on January 3, 2021.“Adele is a seasoned leader in the National Museum of Scotland, and has led the museum through the challenging times and transformative experiences of its transformation from museum to university campus, and into the international hub of contemporary art,” said National Museum Scotland director Anne-Marie Russell. “Her broad experience and commitment to the museum make her uniquely qualified to lead the National Museum through this unprecedented and challenging period. We are incredibly proud of her achievements and legacy, and are eager to see where she takes us next.” Commenting on her appointment, Cromwell said: “I’m delighted to be joining the National Museum of Scotland as director. The museum’s", "The next Biennial should mark the centenary of the outbreak of the first outbreak in Europe, which occurred in Württemberg, in December of 1943, and will create a forum for dialogue, reflection, and exchange between the two countries. The exhibition will showcase contemporary art from Germany and around the world, and will include the works of artists such as Peter Cook, Naima J. Keith, Thomas Kienholz, Minna Robles, Joseph Schmitz, and John Simon Guggenheim.The theme of the exhibition is “Leben and a Thousand Other Things.” The exhibition will take place on the 2022–2023 biennial, “Lebenszeitung and a Thousand Other Things,” which will be held in the city of Frankfurt. Last year, the biennial was criticized for excluding artists who were not German citizens. “The exclusion of artists is a form of discrimination,” Wolfgang Teyssen, chair of the special exhibition committee, told the Art Newspaper. He added that the fact that the thirty-three artists who won the prize last year were not German citizens, and the fact that the biennial included many artists who are not even living in Germany,", "The next Biennial should include a selection of artworks that have had significant advances and reappearances. “We hope this announcement will help to clarify the different positions and make the next exhibition a successful exhibition,” said the European commission president, José Manuel Barroso. “Each and every one of us is here to express our admiration for the artist-centers and for the curators who have built the Biennale for Barcelona. We hope that this will be the moment when they begin to consider us as projects.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than five thousand photographs by the Italian artist Gio Ponti, who died in Rome in 1962, and is preparing to present the remainder of his series to the public in 2019. The gift includes more than twenty-five hundred photographs by the artist that were previously undated, and are titled After the Fall, The Gladiators, and Isla. When the artist died, he asked that the photographs be studied by his son, Giovanni, who was only thirteen at the time. The school of photography and sculpture that Ponti inspired, the Piazza San Marco, also in Italy, is preparing to", "The next Biennial should be held in the year 2030. The museum’s current exhibition, “Spiral Gully” (2019), will be moved to different venues, including a new exhibition, “Beyond Greer Glimpses: Art and the Late Great Depression.” Associate director Elizabeth Pearlman said: “When we think about what a vibrant world is, what a vibrant future should be, it’s hard not to think of the past. It’s hard not to think of the great social movements and movements for freedom. It’s hard not to think of the millions of people around the world who were killed by Communism. And it’s even harder not to think of the enormous challenges that remain.”\n\n\nThe Library of Congress has appointed John T. Cooper, the librarian of the Nashville Museum of Art, to be the next director of the museum. Cooper currently serves as director of the National Gallery of Art in Washington, DC.He succeeds Margaret Pratt, who left the museum in May 2019 to head the Los Angeles County Museum of Art, and will assume his duties in a 50-50 majority vote. During his tenure, Cooper will oversee the", "The next Biennial should be held in 2021. According to Artsnet, the festival will be managed by the National Gallery of Art and will be hosted by Biennial Partners the Baltimore Museum of Art and the National Gallery of Art in Washington, DC. The event will be hosted by William C. Johnson Gallery of Art in the city of Akron, Ohio; Grand Rapids Museum of Art in Michigan; and the Charles Egan Gallery in the Charles Egan, Jr. Gallery of Art in New York. This year’s event will be hosted at the Museum of Fine Arts in Houston. In celebration of its centennial anniversary, the National Gallery of Art, which will now be known as the National Museum of American Art, will hold a retrospective of the artist’s work at the Grand Rapids Museum of Art in Michigan next month.  The Charles Egan Gallery of Art will also stage a retrospective of work by the artist at the Museum of Contemporary Art Detroit in October 2020. The Charles Egan Collection, which consists of two buildings—the estate and the Charles Egan Museum—will open in 2021. The estate will also feature a new exhibition of works by the artist at the Grand Rapids Museum of Art. The Charles Egan Collection�", "The next Biennial should be held in May 2021. The exhibition, titled After the Fall: Landscapes of the American Southwest, will be curated by Katya Slav and will take up the theme 'Landscapes of the American Southwest,” The Arts Aspects of the Fall, 2018. Museum of Contemporary Art, Los Angeles: Originally scheduled for March 2019, the exhibition is now slated for April 2021. The Museum of Contemporary Art Greater Houston: Originally scheduled for May 2021, the exhibition is now slated for April 2021. Museum of Contemporary Art Los Angeles: Originally scheduled for March 2020, the exhibition is now scheduled for April 2021. Museum of Contemporary Art Los Angeles: Originally scheduled for March 2021, the exhibition is now scheduled for April 2021.  Museum of Contemporary Art, NY: Originally scheduled for December 2020, the exhibition is now scheduled for May 2021. Museum of Modern Art, New York: Originally scheduled for October 2020, the exhibition is now scheduled for April 2021. Norton Simon Museum, Boston: Originally scheduled for March 2019, the exhibition is now scheduled for April 2021. New York Academy of Art, New York: ", "The next Biennial should be held in 2020.   Source: Artforum May/2016 issue Artforum May/2016 issue  Artforum May/2016 issue  Artforum May/2016 issue  Artforum May/2016 issue  Artforum May/2016 issue  Artforum May/2016 issue  Artforum May/2016 issue  Artforum May/2016 issue  Artforum May/2016 issue  Artforum May/2016 issue  Artforum May/2016 issue  Artforum May/2016 issue  Artforum May/2016 issue  Artforum May/2016 issue   Artforum May/2016 issue  Artforum May/2016 issue  Artforum May/2016 issue  Artforum May/2016 issue   Artforum May/2016 issue  Artforum May/2016 issue  Artforum May/2016 issue  Artforum May/2016 issue   Artforum May/2016 issue  Artforum May/2016 issue  Artforum May/2016 issue  Artforum May/2016 issue  Artforum May/2016 issue   Artforum May/2016 issue  Artforum May/", "The next Biennial should take place at the Haus der Kunst in Frankfurt in August 2022, and the completion of the exhibition will take place in the spring of 2023. The next edition will be held in the German city of Kassel in June 2020. In an interview with the Art Newspaper, Müntefer said: “I’m very excited to continue this project with the people of Kassel. I think we can create a new dynamic for the exhibition to reflect the spirit of the city of Kassel.”\n\n\nThe museum in Paris where the show TF1 was held has announced that it plans to open a new year with a retrospective of French artist Auguste Renoir’s Déjà Vu, which was a centerpiece of the exhibition’s monthlong run from March to May 2017. The exhibition opened at the Paris Museum of Fine Arts on May 4, 2017, and the new date for the show is August 10.\n\nRenoir was born in the town of Place de la République and studied at the Institut d'Art Contemporain (Paris) and the Aix-Marseille Academy of Fine Arts (Marseille). He moved to Paris in", "The next Biennial should be held in mid-October. As the January event approaches , the Tokyo Metropolitan Government announced on October 29 that it will hold the next exhibition in August. \n\nThe British dance company the Luminary will acknowledge thousands of mourners at its Edinburgh Festival on October 27 with a new event that pays tribute to the victims of the 2010 British-led military coup in Turkey. The event will feature thirty-four works by the artists who were imprisoned, tortured, or killed during the attempted putsch, and will be held at the River Clyde in the heart of the Scottish city.The event will be hosted by British artist Cori Hooper, whose work will be lit by artist-in-residence Hildegarde’s intimate flame, the Scottish-born and American writer A.O. Scott, and will be co-curated by the Irish choreographer Ged Kearney, the artist-in-residence of the artist-in-residence program, and the dramaturg Hannah Wilke, and will run through the end of the month. The London-based musician Khalid Mahmood, whose work spans music and the arts and is often used as a model for the work of contemporary artists, will also", "The next Biennial should be held in 2021, said director Michael Govan. The museum will launch a digital platform for visitors and an online community that will provide a platform for events and discussions. The next edition, which is being organized around the themes of vulnerability and community, will be held in Helsinki. In a statement, the museum said: “Together we will overcome. We will protect each other. We will thrive. We will love each other. We will live together. And we will make memories. And when all is lost, when we are all so close to each other and so far apart, when we are all so alone, when we are so afraid, when we are all so alone, when we cry out for help, when we cry out for compassion, when we cry out for understanding.” It added: “We will not let this happen. We will not let this happen by accident. We will not let this happen by design. We will not let this happen by chance. We will not let this happen by design, we will not let this happen by accident, we will not let this happen by design. We will not let this happen by design and we will not let this happen by accident.”The", "The next Biennial should feature a new selection of works by Antony Gormley, and will continue to present the work of female artists. The first exhibition at the new location will open in the spring of 2021.\n\n\nShortly after the devastating fires in Brooklyn and Manhattan on April 19, 2018, the Allen Memorial Arts Center in Santa Monica, California, shuttered its doors permanently. The center hosted a number of exhibitions and concerts, including the first exhibition of work by the artist-in-residence, the multi-talented Roxanne Weems, and the show “Up Close,” which featured work by the Los Angeles–based artist-photographer Jason Cipollett.It was also the second institution to temporarily close permanently due to the fires. In April, the Allen relocated from its original location in the former Brooklyn Navy Yard to a new renovated space in the St. Mark’s Episcopal Church in East Hampton, which is slated to open next month. While the center will remain closed until at least June 30, the museum will continue to host programming in its environs, with the exception of early spring and summer. The institution also plans to continue to house its collection in its current space in the building.In a statement", "The next Biennial should take place in 2020. In the meantime, the Workshop Podium is currently accepting applications for the 2019–20 season, and is accepting nominations for the 2018–19 season.\n\n\nThe Institute of Contemporary Arts (ICA) in London will open this week with a series of exhibitions that will highlight the work of female artists. Titled “Alison Krauss” and curated by the British artist Joi Ito, the shows will explore the role of women in the arts in an “indifferent and hostile” contemporary society, and will take place at the Institute’s new home on Queen Elizabeth Street in central London from April 13 through April 21. “We are delighted to be opening this season with an exhibition that will reflect the strength and commitment of the ICA team,” said ICA director Gemma Fuller. “The series will present works by women and men, artists and non-artists and will be inspired by Krauss’s own journeys. It will also explore the intersection of art and politics, news, artmaking, art history, and art history.”The first show is “The Power of Women” (2019), a collaboration with Ara Nes", "The next Biennial should take place in 2020. The theme for the 2019 edition was “Post-Industrial Revolution.” The exhibition, entitled “Post-Industrial Revolution: Avant Garde and Modern Art” was curated by Victor Vasarely and featured work by a group including Marc-Olivier Monnier (London), Ondine Meegley (New York), and Carol Martino (New York). \n\n\nThe Dutch Ministry of Culture has approved a new law that will allow the government to fine museums $150,000 for each day a museum fails to register to receive foreign visitors. The amount of the fine will be determined by the Dutch Museum Association (DLV), which represents the interests of the country’s museums. According to the New York Times, the bill will also establish a new fund that will be used for “mobilization of the museum’s collections and exhibitions, and for the acquisition of cultural objects.”The legislation, which has yet to be ratified by the Dutch parliament, was written in response to a series of incidents that took place in March 2019 between Dutch nationals and refugees at the Amsterdam-Bremerhaven airport (BH", "The next Biennial should focus on the history of the exhibition and produce a full account of the exhibition. The future of the exhibition is currently under debate. In a letter published by the Biennial, the organisers write: The following year, the exhibition will mark the first time a museum has ever exhibited a project of this scale and scale and scale. The project will include the exhibition “In Situ,” a survey of the residence of the late Lebanese artist Walid Raad, and “In Situ: a Collection of Modernist Art” a joint project with the Paris-based organization the Staatliche Kunstverein Herzog & de Meuron. The show will also be divided into three parts, each lasting twelve months. The first part, “Kunstverein,” will focus on the experimental artist-run spaces of the late 1990s and early 2000s. The second part, “In Situ,” will take a closer look at works of the late nineteenth and early twentieth centuries and will present the first retrospective of work by the late artist-activist Hélène Béchard. The third part, “In Situ: Al", "The next Biennial should be held in 2021. It has been said that this year was the worst since the Museum’s departure from the district. The past year has been spent working through and rewriting the Museum’s programming, and the future is uncertain.In an attempt to reduce the strain on the staff, the Museum is planning to hold a number of mini-Marts in various locations throughout its grounds throughout the year. These events will become part of the programming that the Museum has traditionally been known for. The first event will be the Museum’s annual Biennial Jingle Ball, which will take place on Saturday, March 3, 2020. The second event, a free public screening of the film The Black Dahlia, will follow, and the third will be a biennial presentation of works by the late artist Charles Darwin.The Museum will also be hosting a number of other events throughout the year, including a biennial reception for the work of the late British architect and thinker Graham Atkins, a presentation of work by the London-based artist Hilma Alsop, and a preview of a new biennial exhibition. The 2020 event will see the work of more than fifty artists, including Timur Albright, L", "The next Biennial should take place at an alternate location. The gallery will announce the new venue and the date and will present the exhibition in the autumn of 2020.\n\n\nOolite Arts, a Hong Kong–based nonprofit, has received $169,871 from the Christie’s Foundation in support of its arts and culture initiatives in China. The organization, which launched in Hong Kong in 2012, has pledged $125,500 to amplify its upcoming exhibition “United States Artists in China” (May 18–June 3), which will feature work by ninety-nine artists from twenty-four countries. The series also aims to draw attention to the region’s artists. The foundation is accepting donations of works and art from artists as part of its “United States Artists in China” series.“Oolite Arts is honored to be able to announce a major gift from the Christie’s Foundation in support of cultural and community initiatives in China. The next edition of United States Artists in China will bring the artists of twenty-four countries together. The fund also intends to support the work of a new group of local artists collaborating in Hong Kong that was established in partnership with the museum. The project will be curated by David Sch", "The next Biennial should be held in 2020.\n\n\nThe Metropolitan Museum of Art in New York has added more than thirty artists to its roster, bringing the total number of New York galleries to fifty. The new members are Sara Cwynar, Evie Adams, Stewart Brand, Anthony Chiang, Andrew Durbin, Harry Callahan, and Bill DeSantis, who will each receive a prize at the museum for their work. The museum established the five-year awards in 1996 as a way of creating a diversity of opportunities for artistic experimentation, requiring galleries to collaborate with the Metropolitan Museum of Art to produce works that are currently on view in the museum.Over the years, the museum has awarded more than $2 million to more than sixty artists. Among the artists chosen for the prize are Sylvia Aitken, who will receive a retrospective at the Met in 2021; Melanie Chester, who will receive a solo show at the Met in 2021; and Daniel H. Lacy, who will be presented with a Lifetime Achievement Award at the Met in 2022. The fifty winners are:1. George Aitken, The Met....................................................................................................................................2. Sara Cwynar, The Met.....................................................................................................................", "The next Biennial should take place at the Museo de Cultura Artes (MCA), Mexico City, in 2021.  The biennial will focus on the legacy of Pablo Picasso and will include the exhibition of every work in the collection, which has been in the collection since 1987. The museum is planning to open its new location in 2018.\n\n\nThe Chinese collector, artist, and educator Liu Yiqian, better known by his Chinese-English name, Liu Wenliang, has been named the fourth recipient of the Felix Prize, an annual award given by the Chinese Academy of Fine Arts (CAFA) in Beijing. Liu Wenliang was nominated for his exhibition “The Vastness of Space” at the museum and was chosen by a committee comprising Liu Xiaoming, Liu Yin, Liu Wenliang’s wife; Zhuangxiao Yang, a professor at the Chinese Academy of Fine Arts; and Liu Yue, a curator at the Contemporary Art Museum Shanghai.The award ceremony took place at the Museum of Fine Arts, Beijing. Liu Wenliang will receive a total of $30,000.\n\n\nArt Basel Hong Kong, which pulled the plug on an exhibition set to open in the United", "The next Biennial should take place at the Stedelijk Museum, Amsterdam, in November 2020. The museum will host a retrospective of work by Louise Bourgeois, a curator at the König Galerie, the Strand, and the Stedelijk Museum in March 2021. This year’s event, “The Damned Art: from the Modernists to the Present,” also features work by artists such as Robert Irwin, Nari Ward, and Christopher Wool.\n\n\nThe Hudson Institute in New York has released the results of a survey of art historians that it commissioned and commissioned the work of artists, organizations, and collectors. The survey, “Art Historians” was commissioned by the Museum of Modern Art (MoMA) to assess the intellectual, aesthetic, and organizational quality of a collection of fifty-five works by forty-three artists who have no longer been around but are still active in the art world.The scholars were selected through an open-call process that invited twenty-two artists to participate and that received funding from the Hudson Institute. The institution also received $2,000 from the William and Flora Hewlett Foundation for their 2019 survey, “Art Historians: A Collection of Art and Ideas", "The next Biennial should take place in March 2021.\n\n\nThe Museum of Fine Arts (MA) in Boston has announced that the thirty-third edition of the Museum of Modern Art (MoMA) will take place at the Museum of Contemporary Art (MoCA) in May 2021. The theme, “Beyond the Limits of Modernism” will be curated by the curators Tilda Swinton and Adrian Wojnar. Swinton, curator of the exhibition “The Future of Art: From Modernism to the Future of Art” (2017–18), and Wojnar, who curated “Das Exzeugen” (2017) and “Frank Gehry: The Future of Human Art” (2015), will focus on the legacy of the German industrialist and architect Herbert Bayer, whose work, which has been expertly documented by Swinton and Wojnar, is considered the defining work of the twentieth century.Swinton and Wojnar will be presenting the exhibition “Bayer: Beyond the Limits of Modernism” at the Museum of Modern Art this May. The exhibition will be on view in the museum for twenty consecutive days, from May 21 to May 24. \n\n\nThe Smithsonian", "The next Biennial should take place in the spring of 2021.\n\n\nArt Basel Shanghai later this month will kick off an overhaul of its 2018 edition with three months of programming that aims to enhance its global reputation through an in-person, online experience. The move follows the warnings of some curators and art-world executives that the redesign was insufficient following the pandemic. “The future of art and design is at stake,” said Alex Pentland, Art Basel’s global director. “We think it’s important to have a platform for curating and exhibiting in a different way, so that we can understand the new reality better, to develop our programs in a way that is also sustainable and practical for our future exhibitions and events.”The Shanghai exhibition will feature work by eighty‐one international artists, twenty‐two from Asia, and twenty‐two from Europe, and will run from March 27 to March 29. The full list of participating artists is as follows:Adrienne Edwards, Australia/New ZealandCara DeSousa, AustraliaGiancarlo Cacciatore, ItalySherry Ooi, TurkeyMarina Fortin, New ZealandCosmin Duma,", "The next Biennial should focus on how the cultural and spiritual capital of the region can be rejuvenated through the cultivation of local knowledge and the sharing of ideas, as well as the creative potential of the city. We believe that the upcoming exhibition should be a model for the forthcoming Art and Spirit Biennial.”The 2018/2019 edition of the Biennial was about seventy-five years old, and the theme of the event was “Unleashing the Power of Spirit and Nature”\u0097a reference to a biennial held in Brazil in 1964. The exhibition featured more than seventy works by seventy-five artists and was organized by the Brazilian National Council for Culture (CONCA), with the support of the Ministry of Culture.The Biennial’s director, João Pires, told Artnet that he felt the exhibition was “perfect for the future of art in the city.” The work of the curators and artists was catalogued in the exhibition’s catalogue as well as on the exhibition’s website and on a series of videos that the show's creators went on to create. The exhibition came to an end with the exhibition of a new work by the artist Antonio Pena, whose work featured in the seventy", "The next Biennial should be held in 2021. \n\nThe 10,000-work exhibition “The Future Is Present: Ghent and the Visionaries of Modern Art” will return to the city next year. According to the San Francisco Chronicle, the artist-run exhibition, which focuses on the power of art to affect present and future, is free to the public and has drastically lowered its own initial price since it was inaugurated in 2009. Its contemporary version of the exhibition, “The Empty Spaces,” will open in 2021. The exhibition also revealed that it is planning to set up a fund for artists in the city. An additional $300,000 has been allocated for projects already underway.Since the festival will take place in the city’s Standaardsstraße, located near the city’s central train station, and is slated to run from September 7 to September 10, it will also be open to the public from September 12 to September 13.The new partnership between the institution and Frieze was announced last December as part of a cultural exchange initiative that aims to encourage collaboration and coordination between the art world and the arts in the German city. The goal of the Eventsbuch", "The next Biennial should focus on the ongoing work of artists in the field, and should include a selection of work that has yet to be exhibited. The 2020 event will be held in the capital of the Gulf State of Bahrain, and will be hosted by the Bahrain Art Foundation (Bafbal), the Bahrain Institute, the National Artist’s Group, and the Bahrain Museum.The biennial will be organized in the same manner as the Fifth Biennial, but will focus more on the social and cultural impact of artworks and will be centered around the theme “Culture in the Age of Extremes.” The 2020 biennial will be preceded by three editions, each taking place over a three-year period, in 2021, 2022, and 2022, respectively.“The new BIFA will be a center for the furtherance of art and culture in Bahrain,” the Bahrain Museum said in a statement. “The seventeenth edition will be a worldwide platform for the artists featured in the exhibition. The twenty-fourth edition will be a celebration of twenty-five years of the Bahraini artistic scene, and the twenty-fifth and twenty-sixth editions will be visions of art and artists in the twenty-first and twenty-second", "The next Biennial should be held in 2022. \n\n\nThe New Museum in New York has announced that it has received a donation of fifty-six works from the artist and philanthropist Mary Ellen Mark. The works, which are currently on display in the museum’s new exhibition “Telling Stories,” will travel to the Los Angeles County Museum of Art (LACMA) to be curated by Mark. The commissioning of the five-hundred-work exhibition was a collaboration between Mark and artist Mark Spalter. The show, which will be located in the museum’s new building, will explore the historical and cultural significance of Mark’s work through the medium of a series of experimental performances and performances-based installations, which will explore the lived histories of African Americans and Latinx and Black communities.“This donation is a significant step in the museum’s history of contributing to the well-being of Black and Latinx communities and our communities of color,” said Mary Ellen Mark, executive director of the Helen C. Mark Foundation. “This work of art is a testament to the visionary vision and dedication of Helen C. Mark, and her vision to advance the legacy of the Helen C. Mark", "The next Biennial should take place in 2020. The next Art Basel is scheduled to be held in December 2021. Cannes Mondial has been reopened. “We will not be surprised by this unprecedented weather,” said the show’s artistic director, Agustín Arruda. “In fact, we have already begun to plan for this year’s third edition. Mass is on our agenda, and we know that the theme of this year’s exhibition is The Future We Want. With the cooperation of all the relevant partners, we are working hard to ensure that the art of the exhibition is as relevant as possible.”While the park is currently closed due to the Covid-19 pandemic, the new exhibition venue will host events, performances, screenings, and other programming in an effort to draw visitors back to the theme park. It will also be the site of a new exhibition.Artforum reports that the pavilion will open with a walkway that will lead visitors through the park’s exhibition spaces. The pavilion’s works will be presented through a series of multi-colored glass cubes. The pavilion’s opening ceremony will take place on", "The next Biennial should take place at the Institut de biennial as soon as possible, in order to ensure the public a fair and a show of the work in its entirety.\n\n\nTwo days after the Paris Art Week triennial of works by French conceptualist Aline Brouwers was cancelled, the French cultural ministry announced it would suspend all new grants and other financial support to the institution. The announcement came two days after an exhibition of her work, Aline Brouwers: Next, was also scrapped.The cancellation of the exhibitions, which were scheduled to run from October 22 to October 25, was made on the same day as the country’s reopening from a three-month shutdown due to Covid-19. Since France still hasn’t fully recovered from the pandemic, the national museum system has been operating on a programming level through June 11.“Aline Brouwers: Next is a reflection of the exhibition that was scheduled to open at the Museum of Modern Art in Paris on March 12, 2021, but was moved to the Museum of Modern Art instead due to the Covid-19 crisis,” the ministry said in a statement. “In order to avoid any doubt regarding the", "The next Biennial should be in the fall of 2020. The next edition, which was held at the Art Institute of Chicago in January 2021, was canceled due to the Covid-19 pandemic.  The 2019 exhibition was organized by biennial director Yoko Taro and will be reworked into a show focused on climate change and the future of the planet.The show, titled Sustainability, will present the works of seventy-seven artists, including David H. Dobbins, Douglas Gordon, Alex Kupchak, Pilar Corse, and Panache Pape. The artist-run organization the Satellite Science Center at the University of California, Berkeley, will host an exhibition of work by the artists in 2022. \n\n\nIn a move that has left New York City Mayor Bill de Blasio reeling, the city attorney general is launching an investigation into whether private prisons are breaking the law by holding people in their custody for too long. Deputy Attorney General Kenneth Thompson, who has led the prosecution of various cases of overcrowding and abuse in New York City’s jails for more than a decade, announced that the state will open an extrajudicial center to provide legal representation to people who are held in city-run facilities.In a", "The next Biennial should be hosted at the Museo de Arte Contemporáneo in Mexico City, which will begin hosting in 2021; the San Francisco Museum of Modern Art in California, which is currently slated to open in 2020; and the Museum of Modern Art, New York, which will hold its first exhibition in 2020 at the Architectural Alliance, a New York–based nonprofit.\n\n\nAmerican artist Melissa Leahy has been awarded the National Association of Art Museum Directors’ Lifetime Achievement Award for her work in the creation of the Automat, a temporary public art installation made from approximately 250 salvaged vehicles at the Museum of Arts and Design (MoAD) in Washington, DC. The installation, which celebrates the institution’s Centennial, was staged at the Metropolitan Museum of Art in New York on February 5, 1957.In the short-lived series “Automat” (1957–58), the artist created a series of movable sculptures that moved through time. The sculptures reveal the artist’s thoughts on the history of art through the lens of a 1958 instructional video. The film shows the automat’s construction and its eventual displacement by a larger sculptural object, the Automat", "The next Biennial should be held two years from now. The January 2020 edition of the Biennial will be held at the Milan Architecture Biennale, which is currently undergoing a renovation and is currently closed.The new title of the 2019 edition of the Biennial, “Art and Culture,” will be rebranded as the “Art and Culture, 2020.” The title of the 2020 edition will be “Beyond Objects,” and the theme will be “transhumanism and the future.”The new location for the exhibition is the city of Milan, which is currently undergoing a $100 million expansion and will inaugurate the event in 2020. “The Art and Culture, 2020 will be an exploration of the possibilities of art and culture as a transhumanist project: a project in which the art of the future is shaped by present realities, and where the art of the past is transformed by future possibilities,” said Lucio Cipolletta, chairman of the exhibition and the Milan-based artist-run organization CIPOL. \n\n\nThe Lebanese-born artist Tarek Atoui has been named the winner of the Prix d’Art Moderne de Lyon (", "The next Biennial should take place under the same roof as the current exhibition. The idea is to make the show as accessible as possible, with the same resources and the same contents.” The first exhibition currently on view is Museum of Modern Art (MoMA) in New York City, which is reopening this weekend and will reopen next week. \n\n\nThe Haus der Kunst, Berlin (HDK), has announced its representation of the Polish artist Wojciech Marczak. The artist will run a solo exhibition at the institution in the spring of 2020. The exhibition is titled “On the Rake,” and will consist of three ten-minute works, titled Borodowań, Kolome Wojciech, and The Black Wagon.A four-thousand-work collection, the first part of the exhibition debuted at the Berlin Film Festival last month and is slated to run concurrently with the Berlin Biennale.The artist will be represented by the Berlin-based collective über LaBarge in the spring of 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that its selection of works by the late sculpt", "The next Biennial should be held in the spring of 2020. \n\n\nThe City of New York has released the list of 100 artists who will participate in the Art of the Future: A Retrospective, which will run from March 25 to March 29. The exhibition will feature 50 works by 80 artists who have died since the exhibition’s first edition in 1979 and will be staged at Rockefeller Center, the Museum of the City of New York, and the Museum of Modern Art. The artists chosen for the project are: Renzo Piano (Italy), Frank Gehry (United States), Thomas Krens (Germany), Gerald Kwan (United Kingdom), Mario Modigliani (Italy), Yuri Noguchi (Japan), and William S. Burroughs (United States).The exhibition will be organized as a collection of works that were presented by 100 artists in Los Angeles between 1980 and 2019. The artists selected for the project are A. H. Nesmith (United States), Christo, Pedro, Antonia, Julia Carpenter (Germany), Sue Williams (United States), César Chávez (Mexico), Beatriz Díaz (Spain), Judith Hoffman (United States", "The next Biennial should be held in 2022. A new exhibition of work by the artists featured in the twenty-eighth edition of the Biennial will be held in the spring of 2022.\n\n\nThe Tate’s chief executive, Hisham Onyewuenyi, has defended the museum’s decision to remove a controversial work by artist Hussein Motta from its exhibition “Innocence of Muslims.” The controversial work, titled a “yes, sir, no, and perhaps postmortem” and a “metaphor for everything that is unsavory,” is currently one of several works by Motta that have been withdrawn from future events. In a letter sent to the public on November 18, Motta expressed his “deep disappointment” at the decision, which he says the Tate has made without consultation with him or his heirs.He also claims that the decision was made without his knowledge or consent: “I am deeply offended that this was an act of censorship without my knowledge or consent” Motta wrote.As he addressed the issues raised by the work in an interview with Artforum last month, Onyewuenyi said: “I was", "The next Biennial should be held in 2020, with its first exhibition, “Unseen: Contemporary Art at the Stages and Provinces of Christchurch,” and its gallery opening in 2021. The exhibit “Unseen’s 7th Voyage to the Stages” is on view through February 21.\n\n\nThe Sydney Institute of Art (SIA) has welcomed four new members to its board of trustees, including artist-activists and philanthropists John and Clare Siewert, who are currently trustees of the museum, and Pilar de Alvear, who cofounded the renowned Sydney-based art shop the gallery Monti & Co. They will become trustees for the first time in April, in support of the museum’s forthcoming twenty-fifth edition, “A Place of Unity: Contemporary Art in Sydney 1912–1927.”Inaugurating the museum is a new exhibition of work by the late Australian political economist, James Coates, “The Communist Solution: The Rise and Fall of the Australian Communist Party” (April 14–April 21). The show will showcase newly salvaged documents, including diaries, correspondence, and other materials that shed light on the rise and fall", "The next Biennial should take place sometime in 2022. The auction house will present the first edition of the Vienna Biennial, which will feature nearly forty works by thirty artists including Hans Christian Andersen, Anna Atkins, Claude Monet, and Pierre-Auguste Renoir. The upcoming exhibition will be held in the museum’s former location in the Deutsches Museum in Berlin and will be organized as a cooperative between the participating artists and the institute in 2020.The future exhibition will include a group show of works by the Vienna-based artist Rineke Dijkstra, a cofounder of the Dutch-based creative organization Østaktik (creative collective), and a solo exhibition of work by the Austrian painter Georges Seurat. The collection will also include works by Renoir, Andersen, Monet, and various other artists in the König-Reimer series.The new exhibition will be inaugurated by a new work by the Austrian artist Olga Altındev. In the upcoming exhibition, Altındev will present a new work by the German artist Markus Kassel. The selection of the works will be based on an international list of sixty-eight artists submitted by the König-Reimer series", "The next Biennial should celebrate the work of female artists. The event should take place in the Lygian Museum of Art in Skopje, the first museum of female artists in the former Soviet republic.  The exhibition is slated to open in 2020.\n\n\nSinger-songwriter Phyllis Jean-Baptiste, who famously battled racism and sexism in her music, has died at age ninety-one at her home in New York from breast cancer. The Welsh-born, French-American artist was named in an American questionnaire sent to the US Congress in 1965 by civil rights leader Medgar Evers, who was assassinated a year later. “I have always been interested in the human experience, in the contradictions of race, gender, religion and sexual preference,” Jean-Baptiste said in a 2017 interview. “The question I was asking was: What is the basis of all this? I was asking not about a future but about a past which no longer exists.”Born in New York in 1932, Jean-Baptiste grew up in a Jewish family in Paris and then in a religious, Roman Catholic home in Brooklyn. She studied with Joan Mitchell, and later became a member of the band La B", "The next Biennial should be staged in September 2021, with five pavilions and will be hosted by the Geffen Museum of Art in California. The event will be held at the Los Angeles County Museum of Art (LACMA) from September 16 to September 19, 2021. Tacita Hampton, the chair of the 2020 Biennial team, said: “We are excited to showcase the work of the year 2020 to a new audience. The exhibition will engage with themes of Southern California, including the Gold Rush, the AIDS crisis, and the civil rights movement in a way that honors and reflects the Biennials’ commitment to excellence and sustainability.”The 2020 edition will be organized as a “series of interrelated projects,” with a total running time of 90 minutes. The biennial will feature works by artists such as Paul Gauguin, Otto Hahn, and Anita Blake, as well as two biennials that are not represented in the upcoming biennial, the artist-designed residence and the multimedia work “Rebel Rebel.” The exhibition’s work is available for purchase by the public.\n\n\nOn Tuesday, the New York City Department of Cultural Affairs announced that it is", "The next Biennial should take place in 2021, and the first exhibition in the gallery’s new space, the Aquarium, will open in 2022. It will be inaugurated by the artist Chris Ofili’s Tearoom, which will also open in 2020 and will run for a month. \n\n\nThe following artists will receive special scholarships to the 2018–19 academic year:\n\n\nGina Bech, Adriana Bosch, Ulla and Luis Coronas, Uma Dutt, Nara Gelb, Suzan-Lori Ann Miller, Michelle McNamara, and Aung San Su. The awardees are nominated by a committee comprising Caccia Renaldi, director of the Biennial of New York, and artist-in-residence Stephanie Hsu. The full list of awardees is as follows:Sara A. (Austria)Cannuario Ensuep (Spain)Adriana Bosch (Italy)Dalil Khosla (India)Cheryl K. (United States)Nils Lauter (Norway)Lélia Li (Canada)Laura Mackey (Ireland)Vivian M. (Australia)Samantha Macgregor", "The next Biennial should be held in 2020. During the event, the artists will continue to engage with the museum in a variety of ways. The exhibition will consist of twelve exhibitions, including a public tour of the museum; a lecture series that will highlight the work of the Biennials; and a special exhibition of work by selected artists that will be inaugurated by artist Zaha Hadid. The biennial will also include a second edition, the Biennial of Proust, in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a comprehensive $150 million donation from the Warren B. Kanders Charitable Foundation in support of the construction of the museum’s new headquarters. The gift includes the construction of the museum’s new New York City headquarters, which will be located in the shadow of the Lincoln Center, and the restoration of the museum’s former home on East Twenty-Fourth Street, which is currently undergoing a $150 million expansion. The gift also includes $125 million for the construction of the new building’s galleries, including the new Willem de Kooning–designed galleries.The gift was made in recognition of MoMA’s history of supporting artists, including artists", "The next Biennial should take place in the city in 2020, but the date has not yet been set. The next iteration of the '70s–themed exhibition, which was scheduled to run from March 13 to March 16, will now be hosted by the Philbrook Museum and Gardens, the Museum of Modern Art, and the Metropolitan Museum of Art.\n\n\nThe Center for Contemporary Art (CAA) in New York announced today that it has been gifted a total of $5.5 million, including an additional $800,000 in support of the acquisition of works from its holdings. The $5.5 million amount is more than double the $1 million that the city of New York contributed in support of the renovation of the former CAA offices and the establishment of the MIA’s new digital platform and exhibition, “Playground.”“CAA is thrilled to receive this additional $5.5 million from New York City, which is dedicated to the preservation and promotion of contemporary art,” said Paul Mpagi Sepuya, director of CAA. “This is a critical time for CAA and the city as we embark on this transformative project, as we prepare to present the museum’s next exhibition", "The next Biennial should be held in the spring of 2020, with a new exhibition every two years.  The Biennial will include new works by artists such as Marc-Antoine Beaudoin, Hannah Clarke, and Dusan Slonek.  The 2019 exhibition was held at the Solomon R. Guggenheim Museum in New York. \n\n\nThe Pérez Art Museum in Mexico City is planning to open its second branch in the country in 2020. The museum will begin welcoming visitors in January 2021 and will operate three exhibition spaces, the Pérez Art Museum Foundation, the Pérez Art Museum in the city of Santa Fe, and two other locations. Its grand opening event will take place in February 2021.The Pérez Art Museum Foundation will be the new home for the museum’s exhibits. The institution will be inaugurated with a 180,000-square-foot exhibition of the work of Chilean artist Luis Buñuel. The event will include the opening of a new public art program, “Luis Buñuel: The Art of Expression” and a new virtual reality experience.Inaugurating the primary exhibition will be an exhibition of the works of the Pérez Art Museum�", "The next Biennial should be held in the city in 2021, the Art Newspaper reports. To date, the studio’s exhibition “The Future Is Not What It Used To Be” has delighted the gallery.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Avery Dorsch curatorial assistant, Meredith Chiappe. He joins the institution from the Getty, where he has worked for the past two years as a curatorial fellow. Dorsch previously served as a curator at the Museum of Modern Art (MoMA) in New York. He also worked as a consultant for the Getty for more than a decade.“We are thrilled to welcome Avery to the MoCA team,” said museum director Anne McNamara. “Avery’s expertise and passion for museum curatorial practice make him uniquely qualified to lead our digital department and our future exhibitions.”Dorsch will begin his new role on March 16. While at the museum, he will collaborate with senior staff on the exhibition “The Double Life: Modern Art and the Collaborative State” (2019) and will curate the exhibition “Spontaneously,” which will begin in September and run concurrently", "The next Biennial should take place in 2019.\n\nBy submitting your art, you acknowledge and agree that the work is yours and that neither you nor the artist will be liable for any damages whatsoever arising out of the use of the work, or the use of the copyrighted material included in it.\n\n\nThe Guggenheim Museum announced today that it has awarded Michael Komagata a Lifetime Achievement Award for his role in bringing the legendary Italian studio to New York City and the West Village in New York City. Komagata, who died last year, was helming the museum’s Modern Art and Design (MOAD) project when the museum opened in the Catskills in 1997. The program was based around the museum’s collection of work by Italian postwar and contemporary artists, and featured several works by the American avant-garde, including Marcuse, Diana, and Walter de Maria.Other recipients of the lifetime achievement award include Jacob and Edythe Hogan, the founders of the Los Angeles County Museum of Art, and the creators of the California-born, New York–based nonprofit the Museum of Contemporary Art Los Angeles. Both the former and the latter received the award in 2017, and the museum’s founding", "The next Biennial should take place at the Museo de Artes Plásticas, in Mexico City, in 2021. The show, titled “Yo papel es mi titulo,” will be centered on the themes of memory and the body and will add a new chapter to the show, which has previously focused on photography and sculpture.\n\n\nAt the 24 Hour Film Festival in Hong Kong on Monday, December 14, the promotion of Australian filmmaker Adam Curtis’s new documentary “Arts and Culture: From the Archives,” a look back at the art and culture of Australia’s archives, appeared to be a success. Curtis, who is currently shooting the movie “Hope,” about an Australian philosopher who was imprisoned for alleged terrorism sympathies, had been invited to the festival to promote “Arts and Culture: From the Archives,” a documentary about an Australian researcher who was contracted to dig up the country’s archives in order to establish a center for Australian art and culture in the United Kingdom.The center, called the Australian Art Archive, was established by the Australian government in partnership with the National Art Museum in Canberra and will host more than one thousand works by", "The next Biennial should aim to present a unified and accessible exhibition, which should explore the exhibitionist experience in the United States through a historical and contemporary lens. It should reflect a convergence of genres and address subjects that are historically and culturally significant. This year’s event will be held at the new museum’s new headquarters, the new Masterpiece Building, on the first floor of which is a 100,000-piece collection and administered by renowned curators, Peter Kahn and Emily Uhl.The biennial’s inaugural exhibition, “The Electric Dream House,” will showcase fifty original paintings by D. H. Lawrence, Robert Mapplethorpe, and Roman Polanski\u0097representing twenty-nine artists from eighty-five countries\u0097and will inaugurate a new museum dedicated to the works of Renzo Piano. The museum will also feature original works by the French Impressionists Georges Apostu and Henri Poincaré.The French art critic, philosopher, and writer, Sébastien Fédération, was appointed as the inaugural director of the new institution in April. He will lead the Biennial through the 2020 exhibition season, which will take place in the autumn. At stake", "The next Biennial should be held in 2022, and the event’s theme should be “Life and its Emotions,” according to a statement by the Art Fund. The body also confirmed that it plans to create a new twenty-year theme for the event.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has announced that it is reopening to the public on January 24, 2020, following a $500 million expansion project. The new $1.2 billion museum will boast an additional exhibition space, a community center, and the first permanent public location for the work of the artist-run nonprofit incubator the Contemporary Artists Office (C.A.O.O.), which currently houses forty-three artists.“We are reopening to the public for a variety of reasons, but primarily because of the impact of the C.A.O.O. on the artists and their creative projects,” said MoCA director Monica C. Bienstock. “We are not just reopening to the general public, but to the artists who work here. Their work and our own are inseparable. We hope that the new MoCA will continue to inspire and delight as we reimagine the future of", "The next Biennial should be held in the winter of 2021–2022. The theme of the exhibition should be “Livelihood and Culture.” The event should also include an exhibition of the work of artists in collaboration with the sustainable artist space DesignFromScenography, which will be hosted by architects such as SKIM, Gensler, Foster + Partners, and Zaha Hadid, and will be co-organized by Nara Haddad, the curator of arts and design, and Yoko Takeda, the director of the Tokyo Metropolitan Museum of Art.Hirshhorn Museum chief James Basu said: “This is a time of great change for art. We are grateful to the world for rallying around this theme and these artists and their visions. We are also grateful to the trustees for understanding the urgent need to address climate change and for making this choice. We believe that the future of the Biennial will be enhanced by exploring how art and design can serve as a powerful instrument for social progress and climate justice.”The Biennial will also be hosted in Hong Kong, in collaboration with a selection of local and international artists, and will be organized as a global platform for dialogue and collaboration. The exhibition will", "The next Biennial should be titled “Constructivism and Love:” and should be held at the San Francisco Museum of Modern Art in November 2021. The nineteenth iteration of the exhibition will open at the National Gallery of Art in Washington, DC, in December 2019. The twenty-third iteration will open at the Hammer Museum of Art in Los Angeles in December 2021.\n\n\nThe Frankfurt Art Week (FAW) announced today the fifty-two artists and collectives who were shortlisted for the 2019 Golden Lion, which was established by a group of German and Austrian artists in honor of its first winner, Kjetil Jakobsson, who died in 2006. The inaugural biennial will open in March 2020.Awardees are listed below.The biennial will be held at the Karlsplatz—a grand, open-air museum in central Berlin—as part of the German pavilion at the Fifty-Ninth Venice Biennale in May 2019, and will span two and a half years. The biennial will celebrate the history of contemporary art and its role in shaping the course of German art, which was a major component of its pavilion.The biennial will include interviews with seventy-four artists, including two dozen", "The next Biennial should be held in 2020.\n\n\nMore than 150 artists, including Hal Foster, Billy Gaitskill, Ralph Hill, Peter Hujar, and Ed Ruscha, as well as academics, activists, and scholars have signed an open letter screaming that the Paris Climate March be postponed and instead be held in London, New York, and other major cities of the United Kingdom. “We, the undersigned, protest the continuous reduction of the climate crisis through the global emission of greenhouse gases,” reads the letter, which is addressed to the governments of Paris, Britain, and the European Union, and is dated March 22.“We protest at the Paris Climate Summit, the UCCA (Union of Concerned Coca-Cola), the Group of Seven (G7), the Shell, the European Commission, the United States Department of Energy, the Department of Energy International, the Royal Society of Edinburgh, the Royal Academy of Arts, the Institute of Contemporary Arts, the BBC, the Royal Shakespeare Company, and the Royal Shakespeare Company. We protest at the United Nations Framework Convention on Climate Change (UNFCCC), at the World Conference on Women in Lima, and at the COP21 Conference in Paris. We protest at", "The next Biennial should be held in 2021. The first will be held in the northeast of the country in the city of Ciboney, in the town of Kilmarnock, in the county of East Lothian. The second will be held in the city of Aberdeen, in the city of Inverness, and will be staged in 2023. The third and fourth will be held in the city of Glasgow and will be staged in 2028 and 2035. The fifth will be held in the city of Minsk and will be staged in 2031. The sixteenth will be hosted in the city of St. Petersburg (Pst. Petersburg is one of the many cities that have expressed interest in hosting the 2020 edition) and will be staged in 2033. The seventeenth biennial will be held in the capital city of the Russian Federation, Moscow, in 2021. The heretoforeunseen Biennial, which was announced as a joint initiative between the Russian Ministry of Culture and the Russian Academy of Sciences, was simply titled [МНовыдов с национия]. The show will include works by thirty-", "The next Biennial should be held in the spring of 2021. Trisha Brown, chair of the committee, said: “We are pleased to support the Biennial for Art and the future of Detroit as it continues to thrive under the leadership of its visionary and passionate curators.”\n\n\nIn an attempt to prevent further deterioration of the already fragile economic situation in the city, the Detroit Institute of Arts (DIA) has decided to postpone the annual Heart of Detroit celebration, originally slated for June 30 to July 11. The event—which will be held at the Museum of Contemporary Art (MoCA), Detroit, and will run from March 23 to March 26—is being held as part of a larger campaign to raise $75 million for the DIA’s $50 million arts facility.According to the Detroit Free Press, the celebration drew a limited number of invited artists from a pool of seventy-five that had applied via the institution’s website, and was held at a time when the DIA’s coffers were least able to support the annual expenditure of $75 million. Participating artists will receive $3,000 for their works and $5,000 for their projects. The museum has also committed to providing $500,", "The next Biennial should take place in 2020.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than 2,400 photographs by the late American photographer and theorist Walter De Maria, who curated a series of group, solo, and group shows at the institution in the early 1970s. The donation includes more than 200 slides by the artist and more than 150 photographs that were later distributed through the institution’s Walter de Maria: A Biennial Project, a permanent collection exhibition series that reflected the artist’s interdisciplinary practice.“We are deeply honored to have been able to contribute to the collection of this remarkable collection of works from a man who was known both for his vision and for his persistence in bringing them to light,” said David H. Koch, chair of the museum’s board of trustees. “The gift of these rare photographs represents a great deal of work by one of the great American photographers, and one of the great American archivists. We are grateful to the MFA and to the board of trustees for this opportunity to present the works of Walter De Maria and to the general public for the last forty years.”In addition to the photographs, the gift", "The next Biennial should preview the themes of the 2019 edition, titled “Roots and Ends: Art and the Body in Contemporary Art” and will be held at the Museum of Modern Art, New York, from February 23 to February 27, 2020.\n\n\nBergen Maar Modern and Contemporary Art (BMMA) in New York has received a major $25 million donation from Steve Hurley, cochair of the board of trustees of the Museum of Modern Art, in support of its upcoming cohort of exhibitions. The donation comes after the institution made a major commitment to artistic programs during its last iteration, “10/11/2019, as well as the 50th anniversary of the institution.”Hurley, the founder and chief curator of the museum, said: “The next five years mark an exciting stage of the museum’s history as we expand our live contemporary art collection and engage with audiences in new and exciting ways. The board of trustees’ approval of these generous gifts allows us to proceed with confidence. We are grateful for the support and encouragement of the museum’s staff and our dedicated donors, and especially of the exhibition team, the artists, and our guests.”Commenting on the", "The next Biennial should comprise a selection of work on the power of the soul in its relationship with the body, the environment, and the body in general, alongside a selection of contemporary works by and about artists. Some of these artists are selected by the board of trustees, along with the curator, to whom are entrusted the responsibility of presenting the Third Biennial.Janet M. Frayda, chair of the board of trustees, said: “With the passing of the past three years, the Biennial has grown in stature and prestige with the city and the world. In addition, the biennial is a great example of curating and presenting art, which is a prerequisite for the City to become a leader in the field. The board is proud to support the Biennial with a substantial donation.”The building of the Biennial in the city’s historic city hall is estimated to cost $33 million.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed Bradley Lee Bochner, the first black curator to helm the institution, as its new artistic director. Bochner joins MoCA from the Metropolitan Museum of Art, where he has been a member of the curatorial staff since 1993. He succeeds Timur", "The next Biennial should be in December 2020. “It is not possible to create a new history with Peking University in less than twenty years,” Zhang told the South China Morning Post. “I am sure that the new Studio Museum will be better able to present the history of Chinese art in a more timely manner. We believe that the biennial will enhance the identity of the museum. We also hope that the museum will establish new partnerships with universities and other cultural institutions across China, particularly in regions where the museum is not yet located.”Over the past decade, Zhang has developed a career as a curator and writer on Chinese art. He has authored or co-edited several books on art, including The Seminar: Chinese Art and the Art of the Modern World (2016), Art of the Modern World II (2018), Chinese Art and the Art of the Twenty-First Century (2018), and Return of the Art of the Modern World (2014). The works in these publications were chosen as part of a project organized by the gallery of the same name.\n\n\nThe Guggenheim Museum in New York is pushing back the opening of its new exhibition “Art-of-the-Year:", "The next Biennial should take place in 2020.\n\n\nThe London-based arts organization the Independent, which has been heavily criticized by many artists and arts organizations for its 2015 decision to pull a full-scale Pride parade in London in protest of London’s continued membership of the European Union, is withdrawing the award. Mr. Oliver Lewis, the director of the Independent, told the Art Newspaper: “We are very proud of our partnership with Pride, but the decision to withdraw the award is not surprising. This was a strategic decision taken in light of the events of the last twelve months. The Independent is committed to promoting independent, local, and independent-supported artists in partnership with Pride.”The organization’s decision to cancel the annual award, which celebrates the contributions of independent artists in the UK, follows several other controversies over the past twelve months. In June, the Independent retracted a statement it had made to the Royal Shakespeare Company about a statement made by British actor Russell Brand, who called for the UK to leave the European Union. The move led many in the arts world to call for the revocation of the award, which was established after a monument for British foreign workers was unveiled in Westminster Abbey in 1983 in memory of the thousands of", "The next Biennial should be held in 2021. \n\n\nThe Metropolitan Museum of Art (MoA) in New York is planning a major renovation of its former location in the heart of Little Italy. The museum will transition to a new model that will incorporate hundreds of thousands of works from the collection in a move that could reshape the face of New York City’s art world and economy. The renovation will involve the dismantling of the museum’s collection of twentieth-century artists and will also include the construction of an eight-thousand-piece-capacity version of the museum that will accommodate as many visitors as possible.Among the work that will be moved are works by Laura Donnelley, Frank Stella, Andrea Bocelli, Edward Hopper, and George Moschino, as well as works by artists such as Ralph McQuarrie, Mark Rothko, and Ed Moses. The museum will also incorporate a new photo-essay room and a larger public plaza. Its collection of European art will undergo a major facelift, and the institution will record the movements of the sun, moon, and stars during the event.MoA director Maria Balshaw said: “This is an incredibly exciting time for the Met. While", "The next Biennial should be held in Helsinki in 2022. \"An important exhibition for the full range of contemporary art created in the last twenty years in Helsinki, a city that has been a major focus of the García Márquez Foundation for twenty-five years, will be staged in the city in 2021. “We have been discussing this for a long time, and it is my firm intention to carry out an exhibition of the artworks of the last twenty years in Helsinki,” said Artistic Director James Grant. “We are still in the very early stages of the project, so it is too soon to say how it will look and feel, but I am confident that it will deliver a truly unique exhibition.”The artists behind the project include Maile Uytani, Eija Olgason, Ingo Mökk (Junta), and Katja Hoppe (Illustrations)among others. The full list of participating artists can be found on the Foundation’s website.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has received a gift of three works by the artist and activist Kate Edwards. The museum also announced that it has established a Kate Edwards Leadership Award for leadership development,", "The next Biennial should take place in 2022. There have been suggestions for a new format, which might involve an extended exhibition, but the 2018 edition featured a number of works by key figures and was staged at a time when the cultural sector was still in a period of rapid growth. According to Artnet, the artists who have been invited to the 2019 edition include a number of prominent figures, including Wolfgang Osterloh, Franz Kline, Simón Bolle, and Diane Arbus.This year’s event has been described as “a moment of disconnection,” and has been criticized by some as “an exhibition of the decade.”  The first arts biennial in the new project, which was launched by the German federal government in 2016 in the city of Konstanz, was set up by the Konstanz-Berlin Cultural Foundation (Gess) with the support of the German state, which will provide €300,000 of the total costs. The local government of Konstanz will receive another €100,000 from the federal government and €150,000 from the Gess, which will each guarantee another €100,000.\n\n\nThe New York City Department", "The next Biennial should be held at the Aarhus University of Arts, the Copenhagen Art Museum, and the Aarhus Art Museum. The 2019 edition of the event will be the first since 2016 to take place at the Copenhagen Art Museum. The institution will also temporarily shut down to celebrate the reopening of the museum. The 2019 edition will be the last in the city of Aarhus, which will remain closed through March 20, 2020. The 2019 event will be held in the newly renovated and expanded Museum of Modern Art (MOM), the newly renovated and expanded Kunsthalle Aarhus, and the newly renovated and expanded København, among other venues. The 2019 edition was curated by Karina Rosch, the director of the exhibition house, Gallery 20 Years, and featured work by forty-two artists. The 2019 event was organized as part of the Danish National Biennial, which is organized as follows: The National Museum of Denmark is one of the oldest and most prestigious institutions in Denmark and serves as the primary home for Danish national treasures. The institution is located in the city of Aarhus, on the coast of the København and is a UNESCO World Heritage Site.", "The next Biennial should be held at a location other than the Museum of Modern Art, to avoid overcrowding. The museum currently has two pavilions, one at least sixty feet and one at least forty feet tall. The other pavilions, built in the 1960s, are currently being renovated. The museum will also likely invite more than a hundred artists to the museum in the upcoming years, a move that will likely draw in more than one hundred thousand people, and hopes to open in 2020. “When the museum opens in 2022, it will be a true museum of contemporary art, which has never been more relevant,” said Gay Art and Architecture editor Robin Liddell. “An exhibition of the artists who have made the museum’s past, a living museum, an important museum of contemporary art, and a museum of art of contemporary culture in a city.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it is expanding its board of directors to eleven members. Laura DeSousa, cochair of the museum’s development team, will serve as chair, while Tracy Chapman, director of the Los Angeles County Museum of Art, will serve", "The next Biennial should take place at the New Museum in New York, the Museum of Modern Art, in New York, the Metropolitan Museum of Art, in New York, the Whitney Museum of American Art in New York, and the Metropolitan Opera House in New York. The 2020 edition will be staged as part of the NYC–based nonprofit organization NYC Biennial, which represents the interests of new and existing artists in the city. The 2020 edition, curated by Amanda Conrady, will feature New York–based artist Jeremy Deller, whose work explores themes of identity, migration, and the nature of art, and will open at the Museum of Modern Art on September 28. Nymphinga, the nonprofit that runs the event, has announced that the 2020 event will be held in the city’s Central Park from September 22 to September 26.According to Artnews, the 2020 event’s themes include the possibilities of art, the relationship between art and nature, and symbolism, and will take place in an open space that can be accessed by all. The 2018 inaugural edition of Park Avenue Biennial, curated by John Akomfrah, featured young and", "The next Biennial should examine the ways in which artists are reappropriating and reshaping the domestic landscape through urban fabric, creating new dilemmas for the exhibition. Leading the way would be Sara Sattar, whose practice explores the social, political, and spiritual dimensions of the urban fabric. “Biennialism is a great curiosity to me,” said the artist. “I am fascinated by the way it is able to move, to expand, to move in unexpected ways. It is a wonderful and timely time to be a curator. ”Sattar’s exhibition “Come to Me,” exceeds the seven-year mark of the exhibition, and will be staged at the artist’s house in Dubai from January 23 to March 7, 2022.The exhibition will feature around fifty works by sixty artists, including Emily Hall, Andrew Schiff, Alex Hernández, Audrey Klein, Joe Löwenbruns, Marc-Antoine Merlé, and Marthelyn Rochat, as well as a selection of works by American and European artists such as Douglas Wheeler, Sarah Polley, and John Sze.\n\n\nThe Metropolitan Museum of Art in New York has received", "The next Biennial should be held in late July. The exhibition is not listed on the National Geographic calendar.\n\n\nThe Museum of Modern Art (MoMA), the Metropolitan Museum of Art, and the Whitney Museum of American Art in New York have agreed to merge. The announcement comes after months of tension between the institutions. MoMA and the Metropolitan initially announced in December 2019 that they would not merge, and in March of 2020, they merged with the South American museum of culture in Bogotá. The move marked the culmination of years of internal debate and conflict between the two institutions, which have been embroiled in a legal battle over royalties owed to a Polynesian artist who died in 1923 at the hands of the Japanese during World War II.According to the New York Times, the Met confirmed in a statement that the merger will not result in a fiscal impact on the museums, but will instead rely on the museum’s holdings and other assets for commercial purposes. The museum will retain its current staff and will continue to operate at a reduced capacity as long as the artist is identified as the beneficiary of a $50 million appropriation, which is expected to be made in the next few years.“MoMA’s decision to award monies to", "The next Biennial should take place in the autumn of 2020, when the biennial will mark its fiftieth anniversary. The exhibition will also be staged in a re-edited version of Art Deco, founded by Pablo Picasso and George Moschino, and will be organized in collaboration with the DeKalb Museum of Art, the Brooklyn Museum, the Metropolitan Museum of Art, the Rockefeller Center, and the Metropolitan Opera.\n\n\nThe FOSMAC Foundation in Kuala Lumpur, Malaysia, announced today that a new artist-led initiative, called the FOSMAC Artist-Led Portal, will host the artist-led exhibition in its first iteration at the FOSMAC Kuala Lumpur Gallery on November 12–16. This exhibition will be organized according to the artist-led model pioneered by the FOSMAC in New Delhi, India, in the 1970s and is slated to run for a period of ten weeks.The initiative, which aims to provide a public space within FOSMAC to engage with contemporary art while providing an alternative to museums, is modeled after a similar collaboration between artist and FOSMAC curators Nirvana Abbashir and Prakash Saravanija in the city of Kota Bharu in India", "The next Biennial should draw up to twelve thousand visitors from twenty-six countries and territories and will be held in late December to early January. In order to avoid overcrowding, the exhibition will run as a multi-day event. While the show will be centered around the theme of death and the body, “We will be able to celebrate our own mortality, our future selves, and the future of our planet,” the exhibition will also feature works by artists such as Mitch Albom, George Gervais, and Karl Pilkington.Tao Makarek, the president and CEO of the Exhibitionist and Artist Relief Fund (FAAR), said: “This is truly an unprecedented and unprecedented year for the arts. We are feeling the impact of a global pandemic now, and in a world where there are now more online threats than ever before, it is even more important than ever that we remain connected and energized to support the arts and their inspiring work.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of more than seventy works by thirty-six artists performing new and previously untitled contemporary artworks for its upcoming exhibition “VOYAGE,” opening January 16."]