["The next Biennial should be held at least five years after the conclusion of the current exhibition. The theme of this year’s exhibition is “Theology with a History.” The exhibition will take up themes of the past, present, and future, with entries emphasizing themes that are embedded in biblical texts, such as the Incarnation, Creation, and Creation in Christ. The exhibition will also explore the intimate relationship between the museum and the city of Venice, which has been the site of many cultural offerings over the years.“This exhibition is a response to the current artistic climate in the city,” said Stefano Cattelan, president of the Venice Biennale, and general director of the Venice Architecture Biennale. “We are striving to present a show that reflects that of a city, and precisely the city that aims to express the most important aspects of the city with a history of its own. The biennial is a platform for this project and for the development of the city’s artistic and architectural life, with an objective of bringing it together.”The exhibition will be curated by Andrea Doria, the curator of contemporary art at the Museo Oeste, in partnership with artist and critic Giuseppe", "The next Biennial should be held in 2022. In a statement, the Paris-based organization said: “We felt it was our responsibility to re-create the right conditions for the exhibition of Biennials in Paris. The proposed 2019 exhibition was chosen for its ambition, the breadth of its programme, its team, its commitment to diversity, and its ability to create a new kind of exhibition.” The biennial, titled Titu Le Pic, will be held at the Place de la République through 2021.  The full list of participating artists for the 2020 event is as follows:\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Alexandra Lawrence as its next executive director. Lawrence succeeds Sara Spero, who has served as interim director since July 2019 and accused of sexually harassing a museum staffer, and will take up the post on October 6.“We’re thrilled that Alexandra will be the next director of MoCA,” said Tom Fazio, chair of the museum’s board of trustees. “Her deep experience and enthusiasm for MoCA and the contemporary art community make her a strong fit for this role. Her leadership of", "The next Biennial should be held in October 2020. The 2019 edition held titles such as The Paracel Garden, The Enchanted Forest, and The Three Sisters. The project also included a residency program for young artists. The 2019 triennale was sponsored by the Italian Ministry of Culture.  Organizers said that the exhibition was inspired by the work of Italian architect and thinker Giacomo Becchetti and the reverence that the architect felt for the barest elements of nature, which he called the physical 'texts. Curated by Lluvia Dino, artistic director of the Helsinki Biennial, the exhibition was organized in collaboration with the architect and sculptor Lenka Bielsa.The pavilion will sit in the museum’s new space designed by architect Alexi Marais, formerly of New York’s New Museum. Titled The Life & Death of a Tree, the exhibition will examine the relationship between trees and human existence. Marais and his team will highlight the artist’s own work, which is housed in the exhibition, and will present an exhibition of the artist’s work by the artist Louise Bourgeois. “", "The next Biennial should be held in the second half of the year, in December 2019. Barcelona will be the capital of the first European Biennial. The inaugural event was held at the Palazzo Reale, in Venice, in 1999. Since its inception, the Biennale has proved to be a seminal event in the history of art. The sixteen artists participating in the first edition included Arnaldo Bojoletti, Pedro Clement Vincent, Ziad Jarrah, Maira Terretta, David H. Koch, and Louis Vuitton.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has become the latest institution to announce that it will no longer participate in the controversial $2.5 billion Cinéma biennial, which was organized by the São Paulo-based nonprofit Artesat and was scheduled to run from March 17 to March 19, 2020. The event was meant to commemorate the Brazilian artist Agatha Christie’s work and to address the city’s late Brazilian president Joseph Roca’s vision to create a permanent collection of the artist’s work.The announcement was made on the heels of MoCA’s decision to remove more than two hundred", "The next Biennial should take place in the United States, which is currently slated to end in November. The exhibit will be dedicated to the life and works of biennialist Beverly Dodd, and will run from November 16 through March 19, 2020. \n\nThe Museum of the City of New York (MoC) is continuing to organize its first-run TV-movie screenings, which have been suspended since March due to the coronavirus. The institution announced on Thursday that it will run two more screenings in November and December, with a final screening on September 21—the first day of the biennial.“The first screening will focus on the works of the late artist and educator William S. Burroughs at the Museum of Modern Art, and will feature selections from the artist’s archive,” MoC director Matthew Teitelbaum said. The biennial also revealed that it will hold a second screening of a selection of Burroughs’s films in November 2020.“The biennial’s inaugural edition, ‘10,000 Man,’ premiered at the Museum of Modern Art in 2008. The fifth and final film, ‘All in a Day’s Eye,’ which was", "The next Biennial should take place at the Art Institute of Chicago in 2021.The 2019 edition, titled “My First Film,” included “Architecture and Design” and “White Noise.” It was created with the help of artists such as Anna Atkins and Aishwarya Panani and was shown at the Art Institute of Chicago.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Richard Gibson as its next director. Gibson comes to the institution from the Museum of Modern Art (MoMA) in New York, where he has served as deputy director and chief curator since 2016. He will assume his responsibilities in January 2020.“Richard’s new position at MoMA is an incredible honor and testament to the extraordinary work of our distinguished staff, to the museum’s rich and dedicated supporters, and to the museum’s architecture and design selection,” said MoMA director Adam D. Weinberg. “We are thrilled to welcome Richard to our community and to continue to innovate and experiment with new storytelling through our work, and to continue to present a compelling collection of modern and contemporary art.” Gibson previously served as a curator at the Museum of Modern Art,", "The next Biennial should focus on Marx’s Capital, which is currently on display in the exhibition “Capital: The Unknown History,” from September 24 to September 26, 2020. This section of the exhibition will focus on the theme “The Unknown History,” and the artist will illustrate his and the museum’s efforts to learn about the origin of capital through painting, drawing, and sculptural works. The exhibition will also include a selection of “Cultural Probes,” a series of portraits of artists that will be presented by the artist in collaboration with a selected group of biennials in October 2020. In addition, a selection of “Adam and Eve” will be presented by Adam and Eve Salomon in November 2020.\n\n\nThe National Galleries of Scotland and the Royal Museum of Scotland in Edinburgh have announced a partnership to create a new cultural and conservation legacy museum that will promote the arts across the United Kingdom. The collaboration, which will take place in a partnership between the institutions, will introduce a new £100 million National Museum for Scotland and will begin with the establishment of the National Gallery of Scotland, an expansion of the National Museum for Scotland in Edinburgh.“This is a very", "The next Biennial should focus on the ideas of democracy, sovereignty, and art itself, and will launch in the city in March 2021.\n\n\nNew York’s Metropolitan Museum of Art has received a $2 million donation from the Rockefeller Brothers Fund, the non-profit organization established in 1987 by Charles and David Rockefeller. The gift brings the total amount raised by the family to $4 billion. The Metropolitan Museum of Art will use the funds to expand the museum’s collection by at least $150 million, build new galleries, and create new public programming. The new collection will also introduce more than 3,000 works of art.\n\n\nThe European Space Art Association (ESSA), a Berlin-based nonprofit dedicated to promoting and protecting the art of space, has released guidelines for the exhibition and public exhibition of works within the confines of German cities. The guidelines, which were drafted by the German government and signed by interior minister Joachim Gauck, outline how Berlin art museums and other cultural institutions with more than 1,500 works in storage in an attempt to encourage the storage of artworks in museums.“We are pleased that the government has initiated a thorough and targeted plan to prevent the exhibition and display of artworks in storage in", "The next Biennial should be held in 2020, and the first exhibitions will be set to open in 2021.\n\n\nHannah Arends, a curator and the founder of the New York–based troupe B.I.C., has been named the winner of the $50,000 Kimmel Prize this year. The organization announced the honor last month. “Hannah Arends creates experimental, performance, and performance-based work that draws inspiration from and addresses the central questions of contemporary life, and that responds to the concerns and concerns of the contemporary world,” said Leo DePace, director and CEO of the Kimmel Foundation. “In collaboration with her colleagues and the entire team at B.I.C., she has created a new kind of residency program, a space for the production of work that is grounded in imagination, experimentation, and experimentation in the form of a level of public art. The honor is particularly meaningful in light of Hannah’s recent departure from her position as curator to pursue other interests, and in recognition of her legacy as a curator, a teacher, and an important cultural asset to the city of New York.” “Hannah Arends’s public art is a challenge to", "The next Biennial should take place in the summer of 2021, and the twenty-eighth and twenty-ninth should be held the same year. Recent work by members of the exhibition’s program has included new exhibitions, projects, and screenings that focus on intersectional and interdisciplinary work. The 2019 event, “Feasibility Studies: Constructivist, Instrumentalist, and Instrumental” featured work by artists such as Dev Patel, Sabine Hirsch, and Iñigo Paz. The event will return to the Museum of Biennial Studies in 2020.\n\n\nThe University of the Arts (UFA) in Boston has received a gift of $1.5 million from the Peter and Lillian Gish family. The gift includes artworks by Sally and Peter Gish, the founders of the eponymous family. The gift also includes new artwork by the Gishs for the 2015–16 season, “The Gas Stage: The Last Stage,” and a selection of works by the Gishs for the 2020–21 season, “The Moral Arc: The Gishs” and “The New Depression.”Awarded annually to a UFA graduate, the gift also includes coursework", "The next Biennial should be the longest exhibition of postwar architecture’s history, featuring work by more than fifteen artists, and will open in 2020. The fourth iteration of the Biennial will be held in 2022 and will be curated by architect and educator João Martins.\n\n\nThe wealthy Swedish citizen and his son Kirill of the Russian-born artist Sergey Gusev, who was a professor at the Moscow State Academy of Arts before he was assassinated in Moscow in December 2015, have been indicted by a federal grand jury on charges of fraud and money laundering, reports The Guardian. The indictment, which was unsealed on Wednesday, December 20, 2020, names Alexander Simonyan, the grandson of the late Soviet architect N.Y. Arkhipov, as the defendant. Both the defendant and the grandson were named in a separate indictment unsealed by the same court last month. The Sonnabend, Germany-based company that employed the pair in London and New York, was indicted on charges of money laundering and tax fraud, as well as conspiracy to defraud the United States, and was supposed to be tried this month.Nillegals and undocumented workers are often implicated in the construction industry, which relies heavily on them to create jobs", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid in December 2020, and should include a documentary by curator Marta Rodríguez-Yardena, whose work explores issues of trans-cultural transmission and the historical memory of women, children, and people from underprivileged backgrounds. The exhibition should also include a selection of works by international artists.\n\n\nGermany’s Federal Association of Art Museum Directors (BAM) has withdrawn from a proposed sale of the newly renovated Frankfurter Telekomuseum in Berlin, labelled one of the best preserved ancient art sites in Europe by the state of Hesse, which commissioned the institution in 2015. The $4.7 million undertaking, which involved the restoration of a three-story building that had housed the museum since 1921, was in the process of being completed when it collapsed in March 2019.The collapse of the building, which had recently been completed, led to the subsequent rehabilitation of the entire building and the relocation of the museum’s permanent collection, which consists of paintings, architecture, and sculptures from the former grounds of the ancient city of Neuarlautzen, to its current home, in the former Peterzschhaus,", "The next Biennial should be held in the shadow of the new Museum of Contemporary Art (MoCA), which will open in 2023. In response to the announcement, a spokesperson for the political party told the Art Newspaper that the party is still 'evaluating the terms of the bid and will give its answer in due course.”\n\n\nThe National Galleries of Scotland announced on Thursday that it has been purchased by Maricann Group, which plans to turn the institution into a global communications hub. The acquisition was made through an open tender process, and the sale price was around $2.6 billion. The sale includes the National Gallery of Scotland’s archives, collections, and archives as well as the National Curator’s Guild and the National Society of Arts Scotland.The National Galleries of Scotland (NGA) was founded in Edinburgh in 1817. It opened in the city in 1820 and has since grown to become one of the largest arts institutions in Scotland. The institution also has a permanent collection of over 5,000 works and has recently announced plans to open a new office in Glasgow.The National Galleries of Scotland’s new headquarters will be built in the city’s historic Taities, a former cotton", "The next Biennial should be held in January 2019. The third biennial, Frist Art Museum, in Melbourne, has yet to announce a date.\n\n\nThe Museum of Art, New York (MoA) has announced that Terrence Malick is collaborating with the University of Cambridge to create a new series of paintings and sculptures that address contemporary issues such as climate change and urban life. Collaboration between the two institutions is part of MoA’s long-term strategy to rethink the role of the museum in the twenty-first century.“The MoA’s new series is an extension of our long-term vision for the museum, which is to be resolutely informed by and informed by the spirit of its history,” said museum director Drew Davis. “It is a new direction, but one that builds on the legacy of artists such as Jules and Paul Gauguin, and that shows an understanding of the role of art work in responding to the new environment.”The new works will be based in Cambridge and will be made possible through funds from the RIHL Foundation, which is supported by the RIHL Foundation and the Rockefeller Foundation. More information about the partnership can be found on the MoA’", "The next Biennial should be held at the Aspen Museum of Art in Colorado Springs in March 2020. The 2019 event’s website refers to the year 2099. The date and the venue were released by artist Konstanz, who is known for his experimental and sometimes overtly political installations, which address subjects such as the role of art in politics and the transformation of art into a tool to advance social justice issues. In an interview for Artforum in 1999, Konstanz said: “The question of the future of art and the art that is created today is a very difficult one. The art that is currently on display here is very fragmentary, but it may become much more as the years roll on. If the future of art is to be founded on individual and collective creativity and self-organization, it must be founded on a strong ethical mentality. Art has the power to change the world, to heal and to liberate us, and the problems that we face are enormous. The future of art is therefore very much in our hands.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has hired Kate Posenhagen as its new senior curator of modern and contemporary art. Posenhagen", "The next Biennial should focus on the lessons learned from the past three decades and on the work of contemporary artists, with an emphasis on their contributions to the promotion of indigenous art. The theme of the Fifth Biennial is “A Conversation,” and its opening reception will take place on November 18.The exhibition will include work by contemporary artists including Google, Siong-Theng, and Hsin-Chien Hsu, and will showcase the work of twenty-nine artists who have participated in the exhibition in some form over the past twelve years. The exhibition will also debut a new book of photography and work by the award-winning artist and filmmaker Yasmina Ahmed, which will be presented by the Los Angeles–based organization LACMA.In addition to the biennial, LACMA has added a new platform for artists, whose works have been chosen by LACMA curators, in the form of an online residency program. The residency program will run for twelve weeks and will feature two weeks of exhibitions. The residency artists are as follows:Lily Aldridge, a.k.a.: The Restless, 1981, which was presented at the Los Angeles County Museum of Art in 1975, and The Place of the Heart", "The next Biennial should be held in 2020. \n\n\nThe California Academy of Sciences (CalArts) in Pasadena announced that it plans to cancel the 2020 edition of its \"Art of the Exhibition,\" a biennial that introduces contemporary art and visual art by major international artists such as Alexander Calder, Klaus von Till, and David Mead, because of the coronavirus. The move follows the cancellation of the 2019 edition, which featured work by the Los Angeles–based collective Naama Kanaele, whose work often addresses issues such as climate change and capitalism, and the exhibition “We Care,” which was organized by the experimental and experimental group the Body Project in partnership with Kari Strom and the Kerstin Stiftung in Berlin.The end of the exhibition coincides with the year of the Chinese calendar, which begins on December 24. On Sunday, the Chinese artist Ai Weiwei—a leading proponent of the art of the year—credited the cancellation to the coronavirus. “The cancellation of the 2019 California Art of the Year is an ethical and moral responsibility,” he said. “It is a moral duty, and it is a responsibility owed to the public.” The artist has since been awarded", "The next Biennial should be held in the spring of 2021, and the twenty-third Biennial will be held in the fall of 2022. The twenty-eighth will be held in Spring 2020, and the twenty-ninth will be held in Fall 2020.The artists who have won the Diamand-Stokes Prize, which is awarded annually to a British artist who has made significant contributions to their country, include Nancy Ashenden, Mark Brooks, Henry Davis, and John Darby. Since its inception in 1978, the prize has been awarded to forty-five artists from five continents.\n\n\nThe New York–based nonprofit Artadia, which supports artists and their causes through grants, events, and scholarships, has laid off sixty-eight staff members at its Fifth Avenue location in Manhattan. The news comes amid Artadia’s ongoing effort to hold the companies responsible for the factory’s pollution-causing megacities accountable for moving their factories, and to push for stricter air quality controls.The New York City Department of Environmental Conservation (CADC) confirmed that sixty-eight people were laid off. Seventy-three of the seventy-nine positions at the facility were held by casual employees, with the", "The next Biennial should be held in 2021. “It’s our duty as curators to look to the future, and to reflect upon the past,” said the retrospective’s director, Anne-Marie Salazar. “We hope that this exhibition, and the next one, which is already being organized, will serve as a moment for everyone to reflect upon their lives and their work and to reflect upon the world in which we live.” The biennial will be organized in partnership with the Departamento de Cultura Arts and the Museo de Arte Contemporáneo de Madrid.\n\n\nThe National Gallery in London is planning to cut more than one hundred jobs and lay off hundreds more as part of an attempt to reduce the size of the institution and reduce its workload as part of a £140 million restructuring.The plan, announced on Wednesday, October 16, is part of a £76 million funding package that also includes the reopening of several of the institution’s buildings in an effort to reduce costs and improve its efficiency. The nineteen-acre St Martin’s Place, which sits in the heart of the city, will reopen in March of 2022; the National Gallery of", "The next Biennial should take place in 2020. \n\nAdvertisement\n\n\nThe Cooper-Hewitt, New York–based nonprofit Visual AIDS has launched a new series of performances, performances, and other events to help raise funds for the AIDS Healthcare Foundation (AIDSF), the Gay and Lesbian Community Center (GLCC), and other organizations that work in support of the global fight against the virus. The seventh edition of the National AIDS Festival, which will take place at the Smithsonian’s National Museum of American Art in Washington, DC, will feature performances by artists such as Jay-Z, Beyoncé, Jessie James Vincent, Tom Jones, and Bruce Springsteen; comedies by artists such as Jay-Z and Sarah Silverman; and a number of documentaries that explore the challenges and opportunities of living with HIV/AIDS.“We are thrilled to continue the work of the National AIDS Festival and the National Gay and Lesbian Museum, which have been so successful in raising funds for our community, and are grateful for the support of our many partners,” said Cooper-Hewitt chair Cynthia Gormley. “The National Gay and Lesbian Museum has been instrumental in driving the conversation about the importance of supporting LGBTQ+ cultural organizations and artists through", "The next Biennial should be held in 2020 and will have a budget of $50 million.\n\n\nOver the course of the last twenty years, the Museum of Modern Art (MoMA) in New York has unleashed a string of initiatives designed to improve the way it views and presents art. “We are championing greater collaboration and transparency between artists and curators, and we are learning to listen to and embrace the creative power of our surroundings,” director Klaus Biesenbach said. The institute is also working to create a new global platform that will connect MoMA with the new museum’s new campus in the Hudson Yards neighborhood of Manhattan.Incorporating new photography and photography infrastructure that was developed at the Saint Louis Art Gallery in Missouri, the new museum will be designed by the firm Gensler, which has offices in Chicago and New York. The institute will include a studio, an auditorium, and a gallery that will be integrated into the existing structure. The project is part of MoMA’s ongoing efforts to reshape its surrounding landscape in order to better reflect its changing cultural and social landscape. The project is part of a larger plan to reconfigure the city through the construction of new buildings and the transformation of public spaces", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has received a $100 million donation from the Fisherman’s Fund. The gift includes $75 million for the completion of a ten-year, $50 million capital campaign, and $35 million for the construction of a new Palazzo Bernabei that will bring the museum’s collection to the Fisherman’s Museum of Art in the future.The donation, made by David Fisher, the founder of Fisherman’s Fund, follows the completion of a $70 million fundraising campaign that was launched by the museum in January 2019. The campaign raised $47 million to complete the construction of the new museum, which opened in March 2019 and consists of two buildings, a museum and an outdoor amphitheater. The new building will be named after the late collector and will house the museum’s collections and a performance space.The new museum was completed in April of 2019, following an expansion of the Fisherman’s Museum of Art, which is currently under construction. The new building is designed by Gensler. The new design includes the addition of a conservatory, studios, a", "The next Biennial should take place in either 2019 or 2020, according to the Art Newspaper. “We will keep you updated as we learn more,” said Franziska von der Leyen, the Biennial’s director. The auction house also confirmed that the exhibition will not be canceled and that the selection will be presented in the first show of the new project, “The Lessons of Life,” next year. The auction house will host the exhibition at its new venue MAMCO in Shanghai next month.The Italian pavilion in the upcoming edition of the Biennale will be revealed on September 25.\n\n\nNew York’s Solomon R. Guggenheim Museum will soon have more than 1,500 works by twenty-six artists in its collection. The institution announced today that it will begin leasing artworks by the artists Marianne Boesky, David H. Lawrence, Carol Ann Horne, and Edie Sedgwick. The exhibition, “Beyond Good and Evil: Art and the Perils of Power,” will open on December 7.“The Guggenheim has long been recognized as one of the most prestigious institutions in the country,” said", "The next Biennial should be staged in 2021; Arts District, 2019; and the first exhibition in the new contemporary art collage format, 2020. Artists such as Yinka Shonibare, Nara Victoria, and Thaddaeus Ropac are among the first to be assigned the public role of the new artist-in-residence, whose title will consist of a residence in the artist’s studio. “I’m a huge admirer of Thaddaeus Ropac’s work,” said Paul Ha, artistic director of the Biennial. “I’m looking forward to collaborating with her and seeing her new work in an exhibition that recognizes her significance and challenges conventional notions of art and the body.”The 2018 Art Basel Hong Kong fête, which was organized by the German luxury goods brand LÜpomfret, was canceled at the last minute due to safety concerns. The next edition of the fair, which will take place in Hong Kong from March 11 to March 20, 2020, will only run from April 9 to April 14. “It is very difficult to imagine a better venue for a contemporary art fair than Hong Kong,”", "The next Biennial should be in 2021. Following the 2020 show, the institute will hold a general assembly, which will take place in the autumn, and will then begin planning for the 2021 edition. The theme of the biennial, “Hope and Resistance,” will be similar to that of the first edition, with a new exhibition of work by the artists featured in the earlier show. The biennial will be organized as a “party.” The exact date and location of the event will be announced. The twenty-third edition of the Biennial will take place in the New Museum in New York from October 2 to October 15. The 2019 edition featured work by twenty-four artists, including Hiroshima Kawasaki, Shirley James O’Grady, John Akomfrah, Andras Stamaty, Tamara Hoffman-Wallach, and Wayne Koestenbaum.\n\n\nThe Museum of Fine Arts (MoFA) in Boston has appointed James A. Corey as its next executive director. Corey comes to the museum from the Widespread Panic label, which he cofounded in 1984. He succeeds Bob Dylan, who has served as executive director since 2015", "The next Biennial should take place in the Seagulls Islands, off the southeast coast of New Zealand, in the autumn of 2020.  In March 2021, the next exhibition will focus on the islander experience in a contemporary setting, and a “new narrative of art from the Pacific region.” The conclusion of the first exhibition will be celebrated with the exhibition “Pacific Century,” which will be held in the Seagulls Islands in the spring of 2022. The twenty-five-year-old museum, which was founded in the capital city of Wellington, has received financial support from the TMO Foundation in support of the construction of the new museum. The New Zealand Foundation for the Arts (NZFA); John Ahearn, the former president of the National Party; and the TMO Foundation have pledged $21 million to the new institution, which will be constructed in the heart of downtown Auckland. The TMO Foundation’s board chair, Peter Armbrill, said: “We’re delighted to support the new exhibition, the New Zealand Museum of Art, the National Museum of Women in the Arts, and the Māori Museum of Art. We hope this will be the occasion", "The next Biennial should be in the spring of 2021 and will be curated by the collective and the artist.  The next Sundance Film Festival will be held in the fall of 2024 and will be hosted by the collective. The next USA-Southwestern Art Awards will be held in December of 2021 and will be hosted by both the artist and the museum. The next Biennial of the American International Group will be held in November of 2022 and will be led by the artist.  The next American Museum of Natural History Biennial will be held in December of 2022 and will be hosted by the artist. The next Art of the American Home Biennials will be held in January of 2022 and will be hosted by the artist. The next Art of the American Home Biennials will be held in January of 2022 and will be hosted by the artist. The next Art of the American Home Exhibition will be held in the spring of 2022. The next Art of the American Home Exhibition will be held in the spring of 2022. The next Art of the American Home Exhibition will be held in the spring of 2022. The next Art of the American Home Exhibition will be held in the spring of 2022.The next Art of the American", "The next Biennial should take place in the autumn of 2020. The festival will also host an exhibition of works by artists who have won the prestigious Prix-François Périer, the inaugural Prize for the Arts, and will host an academic seminar on the impact of new techniques and approaches in the creation of art. Last year, the festival held the first Biennial of modern Arabic art in the Arab world, “Anwar Ibrahim” (2019), and is currently developing the second, “Alice Karst” (2019–20).\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of 4,400 rare photographs by Robert Mapplethorpe, a biennialist who often used his personal collection to amplify contemporary concerns about economic inequality and social injustice. The work, which is housed in the collections of the M.I.A. and the MFA, will soon be on display in a major retrospective of the artist and will be presented by the MFA at the institution in the fall of 2020.The gift, which was made by Mia Kalmar Gallery, the Los Angeles–based collective known for its activism and for its work exploring the intersection of culture and politics, contains", "The next Biennial should take place in 2020. “The future of the institution is at risk,” said Sergei Mironov, head of the museum. “We cannot allow ourselves to be complacent.”The museum has set a goal of $100,000 for the new exhibition spaces to be completed by 2021. If the goal is not met, the institution will temporarily close until it meets the goal.\n\n\nThe National Endowment for the Arts (NEA) in Washington, DC, has released guidelines for the use of social media by the federal government in the event of a pandemic. The guidelines—which were released on September 1, but were first published by the Art Newspaper—state that the agency will use its Twitter account, @NEA, and Facebook to communicate with the public about resources, to provide updates regarding employees, and to promote awareness of policies related to the pandemic.“This is an emergency situation and we need you to help us sort through the facts and to organize to protect your loved ones and communities,” said NEA director and CEO Rebecca Wilkins. “As we work to address the facts of our emergency, we need you to stay connected to the agency and our work.", "The next Biennial should be held at the museum’s branch in Manhattan, New York (see below), on the first floor of the new and expanded Metropolitan Museum of Art. During the exhibition a selection of the artist’s works will be presented in one-hour episodes, curated by curator Martha Wiets.\n\n\nThe city of Chicago is trying to cut more than $900 million from its $2.4 trillion budget by canceling the construction of two new luxury high-rise apartment buildings slated to be built in the city’s Logan Square neighborhood. The $1.2 billion renovation of the city’s Art Institute of Chicago (IIC) will also be canceled, and the newly opened Chicago Architecture Center will not reopen.“We’re canceling the next building, but we’re also accelerating the reopening of the other two buildings,” Mayor Rahm Emanuel said on a recent conference call. “The difference is a lot less than a million dollars.”The decision to accelerate the reopening of the two buildings in the city’s Windy Hill neighborhood has prompted Chicago architect Dan DiMicco, the former chief of the Chicago Architecture Center, to create a new website, Art", "The next Biennial should be held at the Centre de Recherche Pompidou in Paris in 2020. The theme of this year’s exhibition was “Delirium: The Brain and the Mind in the Age of Mechanical Reproduction”\u0097a term coined by the French economist Bernard Au�thier to describe the post-Marxist upheaval in the art world that has led to the current intellectual and cultural climate. “The exhibition was inspired by a group of artists who were living and working in a different reality\u0097both in the art world and in their everyday lives. They are the artists of post-1989, who were, for the first time, able to present an exhibition in the center of Paris on the many studies they were doing,” said Georges Laurent, the curator in charge of the exhibition.In the exhibition “Elle sont légends,” a group of artists were represented, including Mathieu Brâle, Knut Hägg, Seamus Heaney, and Zineb Sedara. The exhibition also featured Monir Shah, and Lazare Benedetti, who are currently collaborating to create a installation that will be comprised of", "The next Biennial should be held in 2021.\n\n\nThe city of New York is planning to expand its use of public art by more than one hundredfold by 2020. Through a new program, the city will donate twenty-four hundred works of art from participating artists to the National Council on the Arts, which will then begin a public survey of the selections, known as a biennial inventory, and the sixty-six works will enter the public collections of thirteen local, state, and regional public museums.The new public art initiative, which will be piloted across the city’s eleven boroughs, will begin with a selection of works by thirty-six artists, including Andy Warhol, Warhol & Co., Beaux, Groupe of Men, John LaSalle, and Marc Chagall, and will culminate with a survey of seventy-six works by eighty artists. In addition to the artists whose works will enter the biennial, fifty-six works by city-selected artists will also be featured in the upcoming biennial exhibition, “The Nation’s Capital: The Art of New York.”The program will invite the public to recognize, survey, and respond to its selections through an online survey that will begin", "The next Biennial should be held in 2020, and the 2021 edition will be held in 2021. The museum has already committed to future years with the new exhibition, “Theater of Operations: The Gulf Wars 1991–2011,” which will showcase the work of twenty-three contemporary artists.\n\n\nThe Carnegie Museum of Art (CMA) in Pittsburgh has appointed Helen Ewing as its next director and chief curator, effective immediately. Ewing comes to the CMA from the Metropolitan Museum of Art, where she has served as deputy director and chief curator since April 2019.“Helen is a superb curator who has brought an innovative, and in many ways unprecedented, vision to the CMA,” said David Salpeter, chair of the CMA’s board of trustees. “More than two hundred exhibitions have been commissioned and curated under her leadership, and she has grown the museum’s reputation as an important cultural resource for a new generation of Pittsburgharians through her exhibitions, educational programming, and curatorial projects.”Ewing rises to the post after leading the Met, where she was an associate curator at the Whitney Museum of American Art from 2003 to 2009, spearheading the field’s expansion into the", "The next Biennial should be held at least five years from now, and should include works that are of the same quality as those previously exhibited\u0097at least three hundred works over the next two decades.In a statement provided to Artforum, Artnet, and the Art Newspaper, the biennial organizers said: “The theme of the upcoming exhibition ‘Art in the Age of Mechanical Reproduction’ is simple: mechanism. Its art is not just of the endless machinery of industrialism, but also of how machines make possible the industrial revolution, of how machines are part of our lives, and of how machines are about us. We are honored to be able to collaborate with the wonderful teams and artists of the BIM to realize this vision.”\n\n\nArthur C. Clarke, the American physicist, biochemist, and mathematician, died on December 25 at the age of seventy-four. Clarke was born in New York City in 1940. After graduating from the University of Chicago in 1958, Clarke and some of his classmates formed the experimental group the Bohrs-Bostwick Experiment to examine the relationship between matter and antimatter. Clarke worked as a lecturer at the University of California, Berkeley, and as an independent researcher until 1965, when", "The next Biennial should take place in 2021, according to the 2019 edition\u0097at the Fondazione Bienal in Milan, which is a Maurizio Cattaneo-designed building which sits on a site in the city of Turin. The theme of the museum is “Evolution of a Shadow,” and the exhibition will be centered around the idea of evolution and the evolution of consciousness.The future of the institution is unclear, as the museum closed in 2017. In the spring of 2018, the organizing committee announced that the next event would take place in 2025. During the last exhibition, “Evo,” the museum opened its doors to the public, and the director, Roberto Cipolletta, spoke of it as “a new beginning.” He also said that the museum’s acquisition program is entirely new, and that the future of the institution is currently undecided.  The new arrangement between the institution and the designers is said to involve the participating artists working under the supervision of the curators, and will take place during the museum’s initial public opening in 2021, and the closing of the institution in 2050.\n\n\nThe French Ministry of Culture has approved a", "The next Biennial should take place in 2020, at a date yet to be announced.\n\n\nThe Princeton University Art Museum (PUMM) has appointed Kate Knapp as its next curator. Knapp will be responsible for developing and exhibiting an exhibition series that will draw from the collection of the museum’s collections of art and architecture, as well as the collections of individuals who have shaped the institution’s mission. Among the artists selected for the 2020 “From Scratch” exhibition series are Ed Moses, Rebecca Black, David H. Koch, and Yinka Shonibare. Knapp will also work with the PUMM’s sculptures to engage with the institution’s collection in order to present an exhibition of works that explore the PUMM’s ongoing commitment to art.“Kate’s aim is to create a curator’s role that is both broad and deep. The PUMM has a rich history of engaging with ideas, relationships, and people that make up the museum, and she will be crucial in bringing that history to life for the future generations of visitors to the museum,” said Frank Black, the PUMM’s director. The PUMM currently", "The next Biennial should take place in California in 2022. The exhibition comprises approximately twenty works by ninety artists who are currently represented by biennial organisers. The 2020 winners were selected by a committee comprising Nick Bostrom, Michael Sanders, David Kao, Juan Atkins, and Léa Aube.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has named Jared Cruz-Kasowitz its new deputy director of curatorial affairs and chief curator of contemporary art. Cruz-Kasowitz joins the Hirshhorn from the Center for American Art in New York, where he has served as deputy director for the past three years. During his tenure, he has organized more than twenty-two exhibitions, including “Claudia Claiborne: A Visual History” (2019); “Katsu Noda: Art in the Time of the Human Revolution” (2018); and “Katsu Noda: The Remaking of the World” (2016).During his tenure, Cruz-Kasowitz helped organize the exhibition “Claudia Claiborne: A Visual History” (2019), an exhibition of more than sixty works by contemporary artist Marcel Proust; “Myths of", "The next Biennial should kick off in December 2020 and is slated to run for four months. The 2022 edition will be held at the Museo de Arte Contemporáneo in Madrid.\n\n\nThe Barbican Center for the Arts (BCA), the Carlyle Foundation, and the Carnegie Foundation in Pittsburgh have joined forces to establish the $50,000 Facebook Funding Challenge, a new initiative that will give $1 million of each institution’s endowment funds to artistic and cultural institutions across the United Kingdom. “We wanted to establish a platform that would give local and international galleries, visual artists, and arts professionals the ability to raise funds to support their operations, as a way of encouraging them to continue to thrive and to provide support for artists, curators, writers, artists’ families, and small businesses,” said Carlyle Foundation president and CEO Susan Browne. The partnership was announced on Monday, December 5, at the London Film Festival. The initiative was created after British Prime Minister Boris Johnson announced plans to create a new £12 billion fund to support creative industries and small arts institutions in the United Kingdom. The fund will be managed by the Barbican Foundation and the Carlyle Foundation and", "The next Biennial should be held in December 2020, and the first in March 2021. \"The new year brings with it a new set of challenges and new opportunities, but we are determined to make the most of them, and to deliver an exhibition that reflects the spirit of the year, and the year of the biennial, and the year of the city, and the year of the city, and the year of the biennial, and the year of the city, and the biennial, and the years of the city, and the biennial, and the biennial, and the years of the city, and the biennial, and the years of the city, and the biennial, and the years of the city, and the biennial, and the years of the city, and the biennial, and the years of the city, and the biennial, and the years of the city, and the biennial, and the years of the city, and the biennial, and the years of the city, and the biennial, and the years of the city, and the biennial, and the years of the city, and the biennial, and the years of the city, and the biennial, and the years of the city", "The next Biennial should be in 2021. \n\nOn Saturday, the European Commission unveiled the twenty-fifth edition of the Palais de Tokyo, which will take place in the Italian town of Palaiseau from January 10 to January 15, 2021. The project, dubbed Next Gen, was created with $6.5 billion from the 29 members of the European Union. Organizers’ decision to move the event five times around the world has been criticized as a political stunt and as an attempt to push the agenda of the Commission. The event will also feature the work of hundreds of artists, designers, filmmakers, and designers from twenty-eight countries and will run over four hundred days and six nights.  The event will take place in the Palais de Tokyo in Paris, the Palazzo San Marco in Venice, and the Palazzo Modena in Milan. The thirty-five-minute-long video installation “The Night Journey” will include the works of Kate Andersen, Thomas Algernon, Nils Stærk, Lene Fjell, and Karlheinz Stockhausen. The video will be made possible with funds from the new Commission for Culture and Innovation, the European", "The next Biennial should begin in February 2020 and conclude in March 2021. Gabrielle Bacal, director of the Portico, and who was in charge of the exhibition “Feminine in Egypt,” said: “This is a moment of truth and we must confront it in all of its complexity, with the hope of forging new paths for the future exhibitions.”The exhibition will now be inaugurated by a new selection of works by the Egyptian artists who create work in relation to feminism and the struggle for gender equality. It will then present the story of the first female minister of women’s affairs in Egypt, Gire El-Khazzani. The exhibition will conclude with a conversation with the Egyptian artist Talaat Ibrahim. The full list of participants in the exhibition is as follows: 1. Egyptian Artists\n\n2. Nina Ait-Hadid, Art in Egypt, 2018\n\n\nNina Ait-Hadid, Art in Egypt, 2018 1:72  Nina Ait-Hadid, Art in Egypt, 2018. 2:52  Nina Ait-Hadid, Art in Egypt, 2018. 3:51  ", "The next Biennial should take place in the waters of the Kiang River in Wuhan, China, in 2020, and will be hosted by the Wuhan Institute of Contemporary Art (WIC) in Wuhan.\n\n\nBritish artist Lord Sainsbury, whose rich and often surrealist practice encompassed abstract and geometric forms, has died at the age of ninety-nine. In his work, which explores the relationship between light and sound, Sainsbury often drew on photography and visual arts to make his sculptures.Born in London in 1928, Sainsbury began his career as a critic of the 1960s British art. He wrote for the Illustrated Observer, the Guardian, and the Art Newspaper, among other publications, for a number of years, and inspired his own work through numerous photographs. Sainsbury went on to publish numerous other art books, which were initially published under his own name, but were eventually adapted by his son, Simon. In 1981, Sainsbury and Simon were asked to model for a British pavilion at the Venice Biennale, which they did not attend. His work was subsequently included in the annual exhibition “The Art of Manliness: The Power of Photography and Visual Arts,” which opened in", "The next Biennial should be held in the coming months, with the theme 'Sustainability: A Creative Journey'. For the first time, a selection of works should be presented by artists of different nationalities, with the aim of reflecting the diversity of the contemporary art world. A special exhibition of work by Yoshitomo Miki and Kazuko Mori will be inaugurated on November 26. The catalogue will be accompanied by an exhibition of paintings by the same artists at the Museum of Modern Art (MoMA) in New York in December.The announcement follows the reopening on November 11 of the landmark institution, which celebrates the legacy of the American architect Robert Foster and was inaugurated by his son, Foster, in 1984. The Foster Foundation, which received $10 million from the late billionaire Kenneth Ford, has donated $10 million to the museum in the next three years. The gift was made by Ford, who served on the museum’s board of trustees through March 2019, to Museum Modern, which will use the funds to help establish a new Biennial for Architecture.Museum Modern will stage the inaugural exhibition, titled Sustainability, at the same time as the Museum of Modern Art�", "The next Biennial should be announced soon, but will not have a date yet. The next Art Basel is scheduled for 2021, and the 2020 edition will be held in the spring. This story is still developing.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to move forward with construction of a new $120 million Hayward museum, formerly known as the Whitney Museum of American Art, which is slated to open in the spring of 2022. The fifth issue of the hugely influential MoCA’s journal, Art in America, was published on Thursday, and the news is not good.“The announcement of the current plan for the Hayward Museum (which is a direct continuation of the project begun by the Whitney) is a disappointment,” the museum’s board chair, Paul Østbye, told the Los Angeles Times. “It’s been a long time coming, but we are now at a crossroads. We must choose carefully, and we will, and we have chosen wisely.”The Whitney has been working on a new facility for nearly two decades, and in 2007, it revealed plans for a $120 million Hayward museum. The Whitney moved forward with", "The next Biennial should take place in 2020. “Throughout its history, the Biennial has been a platform for the exhibition of work by artists representing a broad range of artistic narratives,” said Vincent van de Wijngaard, the chairman of the biennial. “The fact that we are now in the twenty-first century and having a new exhibition organized in its historical location should give us the opportunity to plan for the future.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than eighty works by Los Angeles–based artists, including David Baldacci, Carol Aichele, and Pierre-Auguste Renoir. The gift was made by Joan and Joe DiMartino, whose Los Angeles–based gallery, DiMartino Gallery, has represented a number of notable artists in recent years, including Christopher Wool, Mark di Suvero, and Nadine Mazzucato.The donation also includes a selection of works by artists such as Robert Irwin, Angela Pappano, and Tanya Savitzky, and a selection of photographs by Robert Irwin. This year’s museum edition of “The Aviary,” which is currently on view until November", "The next Biennial should be held at the National Museum in Athens in 2021. The next iteration of the Athenian Biennial will be held at the Panthéon in Athens in 2022. The second edition of the London Biennale will be held at Stratford-on-Avon in 2022. The third edition, to be held in Lisbon, will take place in 2021. Italian artist and architect Gio Ponti has been selected as the next Pirelli World Headquarters. He will assume the position in January 2022. Ponti, born in Turin in 1966, is one of the architects behind the modernist Pirelli World Headquarters in Milan. He is a member of the Pirelli Group. “On my journey to work with the area of Italian design, I have witnessed the revival of originality and the emergence of new directions,” said Ponti. “Italy is a country with an extraordinarily rich history and culture, making it ripe for modernism. The Pirelli Group helps to preserve this heritage and this region in a way that can benefit both the museum and the city of Milan.”The Pirelli Group is currently working on a new initiative for the exhibition “Feminine", "The next Biennial should take place in the spring of 2021. The next edition will be held at the historic Old Town in Bristol. We look forward to welcoming you back to the museum.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) is planning to establish a new $15 million fund to support artists who are facing financial hardship due to the coronavirus pandemic. The fund will be created by merging the existing $5 million Art Fund and the $15 million Artist Relief Fund.“I’ve long believed that artists were the backbone of museums,” said SFMoMA director Marc Straus. “With the closure of the museum and the loss of the Art Fund, we’re faced with a choice: create a new fund for artists or let the existing fund remain intact. We chose to maintain the funds for artists, and the new fund will provide relief to artists facing financial hardship as a result of the coronavirus.”The fund will be administered by the artists’ association, the SFMoMA Arts & Cultures Committee, and SFMoMA’s board of directors. The fund will be organized as follows:The fund will receive $500,000 from the Art Fund and $", "The next Biennial should be announced by the end of the year, and the full list of participating artists is as follows:Abbey Art MuseumBoston: 2017-18A.I.R., Inc. Albany: 2016-17A.H. Anderson Gallery of Photography, Inc. Albany: 2016-17A. Marvin Museum of Art, Inc.A.M.A. Center for the Arts, University of Michigan, Ann Arbor: 2016-17B.T. Boone Fine Arts Center, Cincinnati: 2016-17B.W. and I.M. Chao Center for the Arts, University of Texas at Arlington: 2016-17B.W. Manuel Center for the Arts, University of Texas at Arlington: 2016-17C.P.A.R.A.N. Center for the Arts, University of Texas at Arlington: 2016-17C.S.B. Manuel Center for the Arts, University of Texas at Arlington: 2016-17C.Y.A.G.N. Center for the Arts, University of Texas at Arlington: 2016-17D.A. Nelson Center for the Arts at the University of Texas at Arlington: 2016-17D", "The next Biennial should be held sometime in the first half of 2020, and an exhibition of works by artists such as John Galliano, Roald Hoffmann, Walter de Maria, and Szymon Mier. The full list of participating artists can be found on the FRIED Art Foundation’s website. An open call for proposals will be held for the designs and the works to be exhibited in the autumn of 2020.\n\n\nThe São Paulo Bienal, Brazil’s Ministry of Culture, has announced that it will take the first steps toward privatizing the nation’s national museum complex, the Centro de Arte de São Paulo (MASP). The move follows the announcement of plans to turn the museum into a coworking space and to expand the institution’s collection by twenty-six works, including fifteen modern and contemporary artworks, as well as a collection of nineteenth-century Brazilian artists.“The establishment of the São Paulo Bienal as a coworking space is a first step towards realizing the ambitious studio project of the Institute of Contemporary Arts (A.C.), which has been in the works for ten years,” said museum director Paula de Almeida. �", "The next Biennial should focus on returning to the fold, Milijan, and on the history of contemporary art in Central India, and on how cultural institutions such as museums and art galleries are needed to meet the growing challenges of urban life, Milijan has said. Over the last two decades, the organization has organized close to two hundred exhibitions, including a series of exhibitions titled The Black Years (2015–16), marking the Blackest Year in the History of Art.In order to encourage a return to the fold, the university is also preparing to host a series of exhibitions by contemporary artists as part of its “Centre for Contemporary Art” in the campus. The first show, titled Live from Mumbai (2016), will launch on the campus in October. The second, titled Fifteen Years of Art (2017), will be staged in the city in November.In a letter dated November 3, Milijan city director Eswar Ganesan wrote that the city is “working hard to open as many opportunities and support for cultural activities as possible.” He added that the institution is striving to continue to operate as a “smart city” and that the city “does not want to lose the spirit", "The next Biennial should be held in 2020. \n\n\nThe National Gallery of Art in Washington, DC, has announced its representation of John Akomfrah. Born in 1958 in Dayton, Ohio, the American photographer, who often uses his body to construct his subjects, often photographs his subjects in the form of living organisms in his studio. His work is now exhibited throughout the United Kingdom, including at the Richard Neutra–designed Tate Modern in London, the Museum of Modern Art, and the Metropolitan Museum of Art. Akomfrah’s legacy includes the mostly unnoticed work Blue Supermarine (1983–83), a series of eighty photographs, many of them commercial shoots, that were published by Akomfrah in 1981, and the first exhibition at the National Gallery of Art, “Between the World and Me” (1999–2001). His fourth exhibition, “John Akomfrah,” is currently on view at the Henry Luce, the Museum of Modern Art, and the Whitney Museum of American Art. A selection of his photographs is currently on view at the National Gallery of Art.In a 2017 Artforum feature, Akomfrah said: “My first exhibition in USA", "The next Biennial should be held in the fall of 2020. The institution will also continue to host exhibitions, lectures, and other programming while it stays closed and will sponsor a number of artists as it prepares to reopen in December.The announcement of the redesign was made in partnership with the county of Santa Barbara and the artist-run nonprofit organisation Artadia, which is dedicated to the defense of the work of artists. The team behind the project, whose name means \"new beginning\", included architects Katsuya Kondo, Satoru Usui, and Toshio Nishimura. The nonprofit received $6.5 million from the city of Santa Barbara and the County in support of its redesign.\n\n\n\n\n\nThe Producers Guild of America (PGA) announced today that it has received a gift of twenty-eight works by seventy-one American artists. The gift, which totaled $1.75 million, was made to the organization by the John D. and Catherine T. MacArthur Foundation in collaboration with the artists who were beneficiaries of a grant of $1.5 million that was announced last month.“These works are a great reflection of the creative spirit of America, and are treasured possessions of PGA,” said Paul Mpagi", "The next Biennial should be in 2022, the year of a new series of exhibitions celebrating the biennial’s twenty-fifth anniversary, titled “The Next Five Years.” The theme of the event, titled “The New York Trilogy,” is that of the city’s redevelopment, and the biennial will be organized as a series of collective performances with the artists. The dates for the inaugural show, which was held in 2016, are now TBA.In a statement, the Biennial said: “Art is a universal language. It can express emotion, it can articulate knowledge, and it can transform lives through the appropriation of cultural symbols and histories. We are honored to be working with Michael Rosenblum, Jacqueline Mitchell, and Erik Satie to create a show that reflects the strength, vitality, and poetry of New York.”\n\n\nQatar’s National Arts and Culture Museum (NAM) announced on Friday that it plans to reopen to the public on September 23, following a $125 million expansion and renovation that will also include the installation of more than two hundred new works. Although the institution is still on track to reopen as planned, the date will be adjusted based on when the museum", "The next Biennial should be held in 2022, and the second in 2021.\n\n\nThe Environmental Protection Agency (EPA) has awarded a $7.5 million contract to a British firm to clean up the site of a planned protest against the Brexit vote, the London uprising against austerity, and the Trump administration. The contract, awarded by the agency to Deep Green, was for a series of activities designed to draw attention to environmental justice and environmental extremism.Activists hoping to hold a demonstration against Brexit on June 23 at Trafalgar Square have called for demonstrations to be held on Oxford Street, the Royal Festival Hall, and in Trafalgar Square on September 24. The day after the demonstration, the UK is expected to leave the European Union. In an attempt to calm tensions between the protesters and the police, the government is allowing the London Assembly to move to a stadium in Whitechapel, with the announcement that the park, which will be named after the late monarch, will be renamed after the Queen.The contract—which will run for two years and will pay Deep Green nearly $5 million—was awarded to the firm on October 4. Deep Green was contacted by the EPA to assist in the clean-up of the ExCel exhibit in London,", "The next Biennial should be in 2020. The next edition will be part of the São Paulo Bienal, and will take place in the old Valsalva Palace. The next edition will be marked by the exhibitions \"Wang Shouqi, ” \"Imran Ahmad, ” and “Karen Armstrong” in collaboration with Luiz Ribas, and will be held in the Brazilian capital.The next edition of the Biennial will be organized under the theme “The Site of Things.” The exhibition will also include the first shows of works by Chinese artists that are not represented in the United States, and will include a retrospective of Wang Wei and the exhibition “Unguisa: A Retrospective.” The 2019 and 2018 editions of the event were curated by Pia Camil, and the previous two editions of the event were co-organized by Joao Pedro da Silva and Joao Paulo Gomes da Silva.“We are delighted to announce that both this year’s edition and next year’s will take place in Brazil,” said Joao Pedro da Silva, president of the Biennale of London. “The recent solid announcement that", "The next Biennial should be held in 2020. The first biennial, American Renaissance, took place in the United States in 1916 and had almost no U.S. participants. Its twenty-ninth edition, for which thirty-one artists were invited, closed on May 23, 2020, with David Desmond-Hellman‎ and LaToya Chaudhri’s exhibition “Lumia: An American Biennial” opening on June 13. The next Biennial will take place in 2021. The Biennial of Living Arts will be held in 2021. The Art and Peace Theme Park will be reworked into a series of local cultural hubs. The theme park, which is housed in a former coal-mining industrial complex in the city of Blaggan, will host events and activities in the form of exhibitions and events.The fourth edition of the UCCA will expand on the theme of the event with a new exhibition, “Lights, Camera, and Textures,” which will mark the opening of the museum. The first show, “Telling Stories: The Art of Light” was organized by the artist Natalia Kornilovskaya. The seventh edition", "The next Biennial should be held in 2020, and the biennial will be renamed after the first woman to win the Nobel Prize. Inaugurating the event will be a presentation of works by the new categories of artist and thinker. “I’ve long assumed that the deconstruction of art, especially the deconstruction of the most abstract and refined forms of art, was the epiphany that the prize was really about,” said Bey. “But lately, I’ve felt a little bit of trepidation about the implications of the word deconstruction.” In an attempt to clarify the new definition of the term, Bey argued that the “deconstruction of art is an act of removing all the presentation of the art, and putting it into a different format, of constructing it anew within a different historical and linguistic context.”In an interview with the Art Newspaper, Bey elaborated on her remarks: “I’ve always said that what we’re seeing is a reconstruction of the past. A reconstruction of the past through the lens of a certain idea and visual language. The reconstruction of the past through the lens of the Orientalist, postmodern, and postcolonial. And", "The next Biennial should be set up soon to accommodate the demand.  We also need to do more to encourage the exhibition of work closely associated with an institution’s director, like Robert Rauschenberg. The artist was a friend of Emanuel’s and gave Emanuel a lot of encouragement in his early years as director. He urged Emanuel to develop his own vision for the exhibition and to focus on the work of his own artists, not on works from other galleries. The question now is to see whether Emanuel can continue to inspire and to use the art of his time to raise the questions of what a new, more democratic model of art might look like. \n\n\nThe National Gallery in London has appointed Christina Hoyer as its new director. Hoyer comes to the institution from the National Foundation for the Arts (NFAA), where she has been the chief executive since 2013. She succeeds Christopher Le Brun, who retired in February 2019 after a decade at the helm of the gallery.“We are incredibly excited to welcome her to the National Gallery and to see how she will shape our exhibition programme and our relationship with our audiences in the coming months,” said Martin Jack, director of the National Foundation for the Arts. “", "The next Biennial should be held at the Institute of Contemporary Art, Mumbai, in December 2022. \n“This is a moment of great transformation for humanity, and for the world,” said Tomá́ Barba, president of the Association of Art Museum Directors, in a statement. “We are deeply concerned about the setbacks and disappointments that have beset the exhibition process and its creators in the hope that they will now realize their dream of a biennial for Brazil.”One of the obstacles preventing the exhibition of the work of the exhibition’s creators is the construction of a new exhibition space for the exhibition, which is scheduled to run from January 20 to February 13, 2022. The second obstacle is the endangered status of the exhibition’s artists, who are currently facing a possible two-and-a-half-year jail term for their alleged involvement in a theft ring that targeted small galleries in Sumatra.\n\n\nThe Chicago Architecture Center (CAC) has received a gift of twenty-five works by local Chicago-based artists in support of the Center’s $1.2 million renovation and expansion project. The donation includes works by twenty-three artists from the city", "The next Biennial should be held in the spring of 2020. Wang, who is known for her research into contemporary art and design, has organized exhibitions at the Museum of Modern Art in Hong Kong (2015), the San Francisco Museum of Modern Art (2015), the Museum of Contemporary Art Shanghai (2014), and the Acropolis Museum of Art in Athens (2015). She is currently collaborating with Anton Kern, Kyung-Kyung Park, and others on a new exhibition at the Nanjing Biennial in China. The exhibition will include the work of contemporary artists under the influence of psychedelics and will be premiered by director Duane Murray. The Biennial will also hold a special exhibition of the work of Chinese artists that will be staged by the Institute of Contemporary Art Beijing (ICBC). It will be inaugurated by a new installation by the Chinese artist Zhang Yan, who is known for his paintings that explore themes such as the emergence and control of water during the Cultural Revolution, and will be followed by a series of performances and performances-driven events. “We are delighted to present the first Biennial to the Chinese people,” said Biennial director Connie St. John. “The first exhibition is a true reflection of the incredible", "The next Biennial should focus on the history of the art in the commission and on the creation of the Artistic Experience (A.E.), an international exhibition that will be hosted by the Tate and curated by the museum. The installation of the work “will be a pilgrimage for the senses,” said the museum. “The artist will visit the museum once a year to work on the theme ‘Art in the World.’”Zoë McArthur, director of the Biennial, said: “We are thrilled to have the opportunity to present a new generation of works by renowned contemporary artists in the exhibition ‘the future of art: space for reflection and dialogue.”\n\n\nThe Chinese artist Wang Lijun has been awarded a $7.5 million prize at the Venice Biennale for his sculptural work The Butterfly Cloak, which was commissioned by the artist after he contracted the coronavirus in 2007. The work, which was erected in the southern Chinese city of Wuhan, was completed in 2015 but never opened. The exhibition’s previous winner, the American artist Wolfgang Paalen, received the prize in 2014.The traditional Chinese tale of The Butterfly Cloak—Wang Lij", "The next Biennial should be held at the National Museum of the American Indian (NMHAI) in Seattle and should open in 2021.\n\n\nThe Metropolitan Museum of Art in New York has welcomed two new members to its curatorial staff: artist-in-residence Shih Chieh, who has been working on a solo exhibition at the museum for the last three years, and curator-in-residence Hao Ji. Together, they will be responsible for spearheading the museum’s exhibition programs.“In the wake of the devastating fire that began at the Authority’s former campus in January 2019, the Met has made the difficult decision to reduce the museum’s annual operating budget by $3.5 million,” said director Jonathan Johnson. “While this restructuring will certainly impact the exhibition programming, the Met’s curatorial team’s work for the coming months will be centered on the museum’s newly renovated galleries, its plans for the future, and the future of the museum.”The Met recently completed a $450 million expansion, known as the Metroku, at the building adjacent to the Museum of Modern Art, where the museum will soon have two new galleries:", "The next Biennial should be held in 2020. The museum said: “The upcoming edition of the Biennial will comprise of the first international presentations of works by artists and thinkers whose work explores themes of the body, the soul, and the body’s relationship with the environment. The exhibition will also feature some of the most ambitious projects that have ever been undertaken by the museum.”\n\n\nOver the last few years, the Corn Exchange in San Antonio, Texas, has been a hub for artists and creatives from around the world. The institution is currently home to more than five hundred works by more than seventy artists and has been a collaborative project of the Corn Exchange for over twenty years. The 2017 edition featured the work of thirty-five artists from twenty-five countries, including Ethiopia, France, Greece, Italy, Norway, and Spain. The exhibition also marked the institution’s centennial, which marked its founding in 1989.“The Exchange is so important to the creative lives of many people in the Bay Area and beyond,” said Corn Exchange director Thomas J. Smith. “The exhibition showcased new artists, local and international, and fostered the exchange of ideas and experiences. It also introduced many visitors to", "The next Biennial should be held in 2021.\n\n\nThe Museum of Exposition and Design (MAD) in New York has appointed Jean-Michel Kahn as its next director. In a statement, the institution said: “Jean-Michel Kahn has been instrumental in transforming MAD into a formidable contemporary art institution. His curatorial and leadership qualities allow him to thrive in the challenging new world of contemporary art.” Kahn comes to MAD from the Brooklyn Museum, where he has served as a curator of contemporary art since 2017. He succeeds Laurie Anderson, who was hired as director of the Brooklyn Museum in 2019, and will begin in his new role in January.“In his new role, Jean-Michel will work with a talented and dedicated group of artists, who will create exciting new experiences as part of a new national program that begins in 2020,” said MAD director Max Hollein. “On behalf of the board of trustees, I’m thrilled to be working with Jean-Michel and the entire team. We have a long history with Jean-Michel, and he is a gifted curator and educator who creates exciting and compelling exhibitions in a way that is both playful and rigorous. He will continue to expand and innovate", "The next Biennial should focus on the history of the Brooklyn Museum and its relationship with the city of New York.  The 2020 edition of the biennial is currently underway, and will take place at the Brooklyn Museum from March 8 to March 12, 2021.\n\n\nThe Whitney Museum of American Art in New York recently named Domenick Iannone as its next executive director. Iannone will be responsible for cultivating the institution’s vision and vision for the Whitney, a move that will culminate in the opening of the museum’s first exhibition, “Beyond Beauty: Art and Beauty in Modern Life” in September 2020.“This is a moment of great change for the museum’s collection and its mission, and I’m eager to lead the way for our new synagogues, new exhibitions, new events, and new audiences,” said Iannone. According to the New York Times, the institution and its board of trustees have already allocated $35 million to renovate the museum, which has an active collection of more than 3,000 works, and are currently working on revising the museum’s mission statements to reflect the museum’s changes. The board plans to vote", "The next Biennial should be held in early 2020. \n\n\nThe Museum of Contemporary Art (MCA), New York, has announced that it will reopen to the public on Saturday, August 25, following a major refurbishment and expansion, as part of the city’s revitalization plan. The project, organized by the MCA in partnership with the city, included the construction of a new library, a new art museum, and a new public space.“The city’s revitalization plan provides critical tools to support MCA’s mission of supporting contemporary art in the city, and we are thrilled to be able to begin this work as part of the city’s revitalization plan,” said MCA director and CEO Todd Yellin.  \n\n\nThe Museum of Modern Art (MoMA) in New York has released the relevant curatorial notes from its upcoming exhibition “Putting the Pieces Together,” which will focus on the construction and decoration of the Tate’s famous “Tutos” (Tutelæ) sculpture series. The exhibition will open on Thursday, August 22, and runs until September 11. The notes are as follows:For the first time in the museum�", "The next Biennial should take place in 2021, with the opening of the exhibition “Déjà Vu: Scenes from a Biennial,” a collaboration with a number of international artists. The 2019 edition, which opened at the Louvre in Paris on January 13, featured the work of twenty artists, including Pierre-Auguste Renoir, Franz Klaasen, Michelangelo Antonioni, and Adam Saúl.\n\n\nTeacher evaluation website Glassdoor has released the results of its annual Teacher Interviews Poll, and the results are in. Nearly 1,300 teachers from fifty-nine states and the District of Columbia participated in the survey, which was conducted May 27–May 30 through the California-based company Glassdoor. The survey evaluated forty-eight students from twenty-six schools across the United States. The top three candidates in each school: Aria Iaroslavsky (New York), Amanda Marx (New York), and Edward Anastasia (New York). The survey also revealed that fifty-eight percent of teachers believe that having their students work in partnership with them will improve their students’ teaching outcomes.“Teachers are working alongside students in class and in classrooms across the country to improve student learning,�", "The next Biennial should take place in the spring of 2020. The 2020 project, titled Grande Biennial, will include the work of more than 300 contemporary artists, including Damien Hirst, Arne Glimcher, Jean-Luc Pontik, and Oto Ojo, as well as from Japan and Korea. The creators of the exhibition, which was organized by the Centre Pompidou in Paris, will collaborate with the French Ministry of Culture and the Department of Culture and Sport, the National Department for Culture and Sport, and the Institut Nationale des Arts et des Lettres, Paris; with the Institut Française d’Oréal in Rome; and with the Institut Partenaire de Lyon. The Biennial will also include performances, residencies, workshops, and presentations. The 2020 event will be held at the National Gallery, London, and will be hosted by the Institut de France (France) in the spring of 2022.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Ellen A. Bradley as its next executive director. Bradley comes to the museum from the Museum of Modern Art (MoMA), where she has served", "The next Biennial should focus on the intimate details of the actual exhibition, rather than the abstract surfaces. The exhibition should aim to reflect the complex inter-relationships between art and culture and should consider the interconnected histories of contemporary art and culture. In addition, the next Biennial should take place in New York and should include a “Living Museum®' as the site of the fourth iteration of this year’s theme, ‘Future Families.”\n\n\nThe museum in the capital city of Saudi Arabia, Riyadh, has launched a campaign to raise $100 million to modernize the institution after it was battered by a series of attacks by extremists in the Middle East in April. Saudi King Salman ordered the construction of a new royal palace in the capital in 2018, but the project was stalled when construction workers were attacked by an armed group that claimed to be linked to the Saudi government. The kingdom’s antiquities museum, AlUla, was also damaged by an explosive device in March. The attack left dozens of people dead and hundreds injured. The kingdom’s Cultural Heritage Department, the Ministry of Tourism, and the Saudi Arabian National Museum of Fine Arts all remain closed.The Saudi Arabian Museum of Arts and Design (", "The next Biennial should be a moving image show with a focus on the psychological effects of radiation and how these manifest in our everyday lives. An open-air sculpture garden will be constructed at Noguchi Plaza. The next edition of the biennial’s “Warm Home,” curated by artist Jon Kabat, will explore the effects of radiation on children in the children’s homes. The next show of work by artist Kiki Smith will focus on the effects and health risks posed by radiation. The twentieth edition of “Spaces,” curated by photographer Kurt Wechsler, will explore the physical and mental health hazards posed by radiation. The twenty-fourth edition of “The Power of Light,” curated by artist David H. Koch and coedited by David F. Williams, will take place at the new Vogels-Dasenal Center for the Arts in Cologne.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced on Thursday that it is preparing to welcome visitors back to the institution once more this weekend after it shuttered on March 23 due to the coronavirus. The reopening of the museum will take place on April 4.“The MFA in", "The next Biennial should be held sometime this year.\n\n\nTania Bruguera, the director of the Art in Motion (AIM) Foundation in New York, has announced that her organization will suspend its upcoming event, scheduled for February 3–February 4, due to concerns surrounding Covid-19. The move has been made in order to allow the museums more time to prepare for the pandemic. “We are acutely aware of the urgency around Covid-19,” Bruguera told the Art Newspaper. “We had been preparing for this for some time, and while we are grateful for the support of the world, we believe the time has come for us to move forward.”AIM’s board chair Michael L. Cohen thanked the museum for its work in supporting the foundation, and also noted that AIM will continue to move forward with its annual four-day exhibition, which had been scheduled for February 9–March 2. The seventy-fifth edition of the Whitney Biennial will take place at the Whitney Museum of American Art in New York on May 5–May 6.\n\n\nThe MOMA Foundation, a nonprofit organization devoted to preserving and revitalizing the northern half of the Detroit Institute", "The next Biennial should take place in 2022, and the first event in 2020. The 2021 edition will be held at the Art Institute of Chicago (AIC), and it will be hosted by Rebecca L. Jordan, the director of the Art Institute of Chicago. The 2019 event, which was led by Lisa M. Fox and Drew Karpf, was canceled in April after ten public members withdrew their support. The 2019 event was also supposed to be the last in the city.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that Ashkan Soltan has been selected as the next director of the museum. Soltan will assume his post in January 2020. Soltan currently serves as a professor of history and the director of exhibitions at the Middle East Museum in Doha, Qatar. He was appointed director of the museum in November 2015, after a sixteen-year tenure with the institution. Soltan’s appointment is the culmination of a ten-year, $44 million campaign that began when MoMA director Daniel H. Weiss asked him to lead the institution through a critical period in its history. During his tenure, he oversaw the reinstallation of the museum in 2016 and helped the institution realize its dream of redevelop", "The next Biennial should be held in 2020, and the date should be decided by the International Council of Museums (ICOM), a United Nations body comprised of representatives from twenty-six countries.Artforum has asked the ICONS how it plans to meet the 2019 deadline and has not heard back. \n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of approximately thirty artworks by artist Hilda Alejandra, including a work by Simone Leigh, which will be restored to the institution next year, and is planning to install them in an exhibition that will open in the fall.“As we work to restore the museum, we are grateful to the Kimball family and the Kimball Art Foundation for this generous gift,” said director Matthew Kimball. “The Kimballs have been generous in recognizing our growing need for new artistic projects as we work to create a new chapter in our rich collection. We are excited to require the Kimballs’ help to guide us through this undertaking and are confident that the gift will help the museum to realize the mission of the restoration of the James A. Farley Collection.”The donation includes several works that were donated by the Kimball family in the late 1990", "The next Biennial should be held in 2022, and the first in 2020.” The architects were asked to propose a new exhibition format that would center around the theme “the future of man and the cosmos.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Christina Baumann as its next executive director. Baumann will take the helm of the institution from Laura Mulrooney, who has been appointed interim director, on January 28.“We’re excited to welcome Christina into the leadership team,” said Mark L. Wallach, chair of the board of trustees. “Her track record of developing innovative and compelling new exhibitions and programs and building relationships with artists and institutions around the world speaks for her ability to prioritize the needs of artists and the greater community.”Since Mulrooney’s departure on January 14, the museum has been working to address the legacy of the late director Lawrence Weiner. Baumann will take up the post on January 29. Commenting on her new role, Baumann said: “The Board of Trustees’ success in attracting and retaining talented curators and organizers is a tribute to the staff, board, and the newly elected board of", "The next Biennial should be in December 2020. \n\n\nThe New York City Department of Cultural Affairs (DCLA) is planning to shutter the Brooklyn Museum in early 2020 to make way for the renovation of the museum’s three-building footprint and the expansion of its public realm. The announcement follows months of negotiations between the institution and developer LLOYD LLOYD & Co., which is proposing to construct a fifty-story mixed-use complex in the boroughs.Amid the ongoing protests prompted by the bust of the Confederate monument, Mayor Bill de Blasio announced last month that the city’s cultural institutions will remain closed through March 29, 2020. The museums are scheduled to reopen on June 8.Although the city’s cultural institutions were not cited in the decision, the demolition of the monuments will likely provoke further protests and calls for their removal. Among the most vocal supporters of the controversial monuments are the workers who erected them, many of whom were white, and the thousands who attended Friday’s rally in defense of social justice.The workers who dismantled the controversial statues are facing criminal charges. A city investigation is ongoing. In a statement to the Art Newspaper, the city’s cultural affairs administrator, Daniel H. Weiss, said", "The next Biennial should take place in 2020. The design team is currently hard at work on a new trailer for the exhibition.Singer-songwriter and producer Tara Donovan is suing the Metropolitan Museum of Art in New York over a painting by David Adjay, a Philadelphia native who first drew her inspiration from Graham and Blake, and who has staged exhibitions at the Museum of Modern Art and the Whitney Museum of American Art in New York.  Donovan claims that the Met botched its handling of the dispute by not providing her with the copyright notice she requested—thus allowing the artist to sell the work without her permission. The lawsuit asks for $7.5 million in damages. The Canterbury Art Gallery in New Zealand has agreed to sell a work by the late artist Peter Sellars to the British Museum for an undisclosed sum. The purchase, which will be made in partnership with the British Museum, is expected to be completed by the end of the year. Singer-songwriter-producer and composer Jermaine Clement is suing the Metropolitan Museum of Art in New York over a work’s appearance in a 1996 exhibition. In a lawsuit filed on January 3, 2018, the New York native claims that the institution failed to properly warn her that", "The next Biennial should be held at the Museum of Contemporary Art Los Angeles (MCA LA), the Los Angeles County Museum of Art (LACC), and the Phoenix Art Museum. The 2020 edition will feature exhibitions by fifty-one artists, including Peter Kremer, Avital Bachelet, Jean-Michel Basquiat, and Renata Forti. The next edition of the Biennial will be held at the Saatchi Gallery in Venice, the Tate in London, and the Pérez Art Museum in Mexico City. In the event that the seventy-third edition of the Biennial becomes a total loss, the winning artists will be given the opportunity to transform a large portion of the structure of the event into a museum, where they will have the opportunity to display their works. The artist who receives the most votes at the biennial will receive $10,000. The winner will be announced in October 2020.\n\n\nThe Hong Kong–based nonprofit Artsport has received the \"Order of the Hong Kong Nebula\" award, which honors the best contemporary art exhibitions in the Amazon region. Curated by model-designer and curator Ming Chiu, the show will present a selection of the city’s", "The next Biennial should focus on the intersection between aesthetics and the native environment through the public art installation, exhibition, and performance of a certain artist: if you like this artist, you should like him, too.”The 2019 edition, titled “Exhilarating Faces,” was founded in collaboration with the Los Angeles–based, nonprofit organization Artadia and curated by artist-in-residence Jenny Waldman. The project will take place in the Pacific Palisades, a prime example of the Central California coastline. The installation, a collaboration between artist and the New York–based contemporary painter Peter Berman, will be the first commissioned work by the artist-in-residence.“I’ve always been drawn to the Pacific Coast,” Berman told In These Times. “Peter Berman’s work is such an extraordinary example of what can be. It’s a masterpiece, a work of art of an artist who was always striving to make his art work in bodies that could be.”The biennial will focus on the body “as an active topic,” Berman said. “As an open-ended work, his body allows us to see both the art and the artworks", "The next Biennial should be held in 2021. The deadline for the 2019 edition was May 31. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has added three new artists to its curatorial team: Shimon Alpher, who will curate a retrospective of his work for the institution in 2021, and Herbert A. Diemer, who will curate a second retrospective in 2022. They are among fifteen new hires that will help shape the upcoming eleven-year tour of the museum.“With the addition of these talented and dedicated professionals, we are committed to supporting the extraordinary work of our curators,” said curator and deputy director Margaret Mulligan. “They have the knowledge, skills, and energy to push our curatorial practice to our limits and make extraordinary exhibitions that are sure to delight and engage audiences of all ages.”Alpher and Diemer, who were hired to work closely with curator Susana Leon and deputy director Anna Wintour, are slated to begin their new roles in the fall. Previous curators at the museum include Sumitomo Hirano and Olivier Messager, whose work will be included in a new exhibition titled “First Fruits.” The show will also include works by", "The next Biennial should be announced by the end of the year.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released its list of twenty-six artists who have donated their art to date to the museum, with the first exhibition at the institution scheduled to open in March 2020. Titled “The Silent War,” and set to open at the museum on April 8, 2019, the exhibition will also feature works created by American artists who have been killed in Iraq.The artists are:Salah Abou-Rahme, Black, Gaza, United StatesAbuja A.D., Riga, LatviaAbdel Karim Al-Hasawi, Los Angeles, CaliforniaAbdel Karim Al-Hasawi: Through a Black Hole (Pentel, Germany)Abdel Karim Al-Jubeir, Doha, QatarAbdel Sattar, New Delhi, IndiaAbdel Sattar: Die, Die, Die (Pentel, Germany)Abdel Sattar: Elusive Light (Pentel, Germany)Abdel Sattar: In the Shadow of the Sun (Pentel, Germany)Abdul Sattar: The Shadow of the Sun (P", "The next Biennial should take place in 2023 and the venue will be selected by the Council of the Arts and the Mayor’s office. After the award ceremony, the city will present the $100,000 Biennial Award to the artist or Konstantin Petrovich, the director of the artists’ studio in Saint Petersburg.\n\n\nThe Metropolitan Museum of Art (the museum) announced today that the museum will attempt to save the critically endangered Mahalia Coyne, who has resided in the museum’s permanent collection since 1990. The artist, whose works are housed in the collections of the Metropolitan Museum of Art and the Getty, has been fighting to have her work returned since 2006 and continues to pursue a legal action in an attempt to secure her return.The museum has previously attempted to secure the artist’s return through legal means, but the case was ultimately dismissed due to the court’s ruling in favor of the Getty. The court also ruled in favor of the Getty in a different legal dispute involving David McAllister, who has a work in the museum’s collections, and in another case involving Peter Zumthor, who has had other works in the collection returned but is appealing the decision.Following the museum", "The next Biennial should take place in 2020 and will include the first public exhibitions of work by the group of twenty-five artists who are represented in the exhibition, which will feature works by forty-eight artists in three categories: artistic production, historical narrative, and iconography. The exhibition will also include a public program of performances, performances, and screenings, concerts, lectures, workshops, and other events. The inaugural exhibition, “The Limits of Form,” was organized by the Baltimore-based Jad Fairbury Foundation and ran from March 3 to March 7, 2020. The Museum of Contemporary Art (MoCA), which is also dedicated to the study of modern and contemporary art, plans to hold the exhibition in an enlarged version in 2020.\n\n\nThe J. Paul Getty Trust in Los Angeles announced today that it has awarded the Los Angeles County Museum of Art (LACMA) $3 million in aid in support of its 2020 fiscal year. The $14.5 million gift includes $2.5 million for the permanent endowment and $2.5 million for the acquisition of land for the institution’s new home in the historic Tualatin neighborhood of Los Angeles.“LACMA is a wonderful institution that has", "The next Biennial should aim to focus on the development of more diverse and public-oriented exhibitions that reflect the spirit of the Barcelona 2020, which was held in May 2020 and featured work by twenty-nine artists. The budget for the 2020 edition will be €3.9 million. The theme for the biennial will be “The future of life, the world and everything in it.” The exhibition will feature work by twenty-three artists and will run for ten weeks. The full list of artists participating in the event is as follows: Adam BasheerAdam ClaytonAdam DziewiorAdam FornanderAdam GlanzmanAdam Hoegh-GuldbergAdam LambertAdam MatherAdam ParraAdam WirthAdam YerginAdam Zahn-WangAdam Zahn-Wang GalleryAdam Zahn-Wang Gallery George KingGeorge OehlenGeorge PeeleGeorge PresseRichard AlpertRichard MartinezRichard VassalloSharon StrausSharon StoneSteven HellersteinUnidentified FemaleCreative TimeLillian AlighierÇa SaavedraLina SammelasPersonal WritingsLinda StahlCara TrifiroCara ZankelCarmen OstermanDiane Uy", "The next Biennial should be held in 2021, and the next will be in 2023. The museum will have a permanent branch in New York City in 2021 and the Los Angeles branch in 2023. The museum’s current exhibition program, which is curated by artist-in-residence Leonor Carucci, will be extended to two additional years. The next edition of the Venice Biennale will take place in Italy in March 2021.\n\n\nThe Lewis-Dorey Foundation has named Anne-Marie Bond as its next president. She succeeds Kathryn Lewis-Dorey, who has been the foundation’s president and CEO for eleven years.“Throughout her twenty-six-year tenure, Anne-Marie has shown remarkable leadership in transforming the foundation into an advocate for artists, innovators and designers across the globe,” said Jay D. Allen, director of the Lewis-Dorey Foundation. “Over the years, she has expanded the scope of the foundation’s work by bringing the art world and design closer to her and making the foundation more accessible to the wider art world.”Previously, Bond served as a board member of the National Geographic Society, where she worked as the foundation’s", "The next Biennial should focus on the origins of art, art history, and art history, both in the contemporary culture and in the past, and should invite the public to experience and participate in the exhibition. The biennial should celebrate the life of a great artist, including the work of the greatest of the modern era, El Greco; and should invite the public to look at the work of a great artist through the eyes of an artist.” The second exhibition, “The Other Side,” will focus on the interrelationships between art and other forms of art, including art from the past and art from the future, and will be curated by László Nemes. The third exhibition, “Ivan Albright,” will be on the history of the artist and his projects, and will be curated by Gunnar Balmaseda. The fourth exhibition, “The Sleepwalkers,” will feature works by thirty-seven Canadian artists and their storytellers and will open at the New Art Gallery in Vancouver.The fifth exhibition, “The Ex-Cinematographer,” will invite work by four artists: Erica Borthwick, Hélène Brisebois", "The next Biennial should take place in 2022. Lederle will continue to serve as president until the event’s 2021 iteration.\n\n\nThe Art Newspaper has announced the twenty-third annual Venice Biennale, which will take place from March 22 to March 28. The exhibition will be hosted by Panama’s National Museum of Art (MNA), which is currently undergoing a $1.4 billion renovation and will open on March 16. Inaugurating the museum are a selection of works from the upcoming exhibition “After the Fall: From the Sculpture of Salvador Dalí to the Power of the Internet,” which will open in October and run concurrently with the event, and “A/W: Just Cause,” which will feature works by thirty-six artists\u0097including Tanya Bonakdar, Fatosu Tsereteli, and Guadalupe Rosales\u0097between March 22 and March 28.“Inaugurating the National Museum of Art, the National Gallery and the National Galleries of Art, and the National Museum of Contemporary Fine Arts, Panama, in the Capital, the National Museum of Contemporary Art and Contemporary Art, Mexico City, the National Museum of Contemporary Art,", "The next Biennial should be held in 2020, when the festival will move to the new 5,500-seat venue at the Urban Institute in Downtown Miami Beach, which will celebrate its centenary this spring and will be inaugurated by artist-in-residence Brandon Flowers.The new format will integrate the biennial's main exhibition into its Contemporary Art and Design (CAD) section, which will feature the work of forty artists, and will welcome a new theme, \"Ethnographic Histories,\" in 2020. At this year’s fest, the topic was “Gang Related: How the Roles of Race, Sex, and Race Relations Affect Art.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released the results of its inaugural survey of the most influential artists of the twentieth and twenty-first centuries, which was held in collaboration with the Art Institute of Chicago (ICA) and was held in partnership with the Art of Diversity and Inclusion, a newly launched organization dedicated to promoting diversity and inclusion in the art world. The survey, titled “The Next Five Years,” was organized and led by Tina Fad , director of art at MoCA; she was assisted by", "The next Biennial should take place at a location that has been selected by the jury—whether that be the Museum of Modern Art, the National Museum of Women in the Arts, or the Brooklyn Museum.\n\n\nThe Smithsonian Design Museum in Washington, DC, has received a gift of more than five hundred photographs by American architect Frank Lloyd Wright. The museum acquired the works from Wright’s estate, and the donation includes approximately twenty-four lithographs and one print from Wright’s storied career. The works were donated to the institution by American P.A.I.A., a nonprofit organization dedicated to promoting Lloyd Wright’s legacy through the acquisition of art, and are housed in the Wright Collection.“The donation of these works is a great testament to Wright’s influence on American art and architecture and is a great tribute to the Wright children and their parents, as well as to the thousands of people who have admired and admired these works over the years,” said Smithsonian director Mary Anne Carter. The works, which were donated by American P.A.I.A., were established in partnership with Wright’s sons, Michael and David, and were acquired by the organization from the estate after Michael was denied a position", "The next Biennial should take place in the spring of 2022.\n\n\nThe Royal Academy of Arts (RA), London, has announced that it is planning to begin a new triennial of contemporary art in the UK next year. The initiative, which will be led by director Hamish Anderson, is the brainchild of three artists: the South African-born, India-based artist Bénédicte Savignac, and the Italian-born, Paris-based artist Stefano Poggi.The exhibition will be curated by director Tracy Chapman, with support from director Ewan Goodwin, and will aim to provide an interdisciplinary perspective on the history of art through the work of contemporary artists. The exhibition will also include a traveling retrospective of the works of twenty-nine artists, including Diane Arbus, Ateliers Antoine, Anne Fontana, Alejandro Campanello, and Yinka Shonibare.“The new RA biennial opens up a new way of looking at modern art and what is possible,” said Anderson. “By focusing on the same themes across narratives, we hope that this exhibition will serve as a new way of thinking about contemporary art from different angles. It will also be a chance to see the", "The next Biennial should take place in 2022. To date, the event has not been held in person, but will be televised online. To mark the occasion, the two-hundred-and-seventh edition of the exhibition will showcase new works by twenty-eight artists, including Marcel Proust, Kiki Smith, Jean-Michel Basquiat, and Jasper Johns. This edition will also feature new works by artists whose work is currently on display in the exhibition.The Biennial will be held in Leipzig, Germany. It will comprise two stops, one in Frankfurt and one in Munich, and will be held in conjunction with the seventy-fifth and seventy-eighth editions of the exhibition, which will run concurrently in both cities. The theme of the two exhibitions is “The Making of Modernism” and “Ghetto Art” and will be inspired by the exhibition “Ghetto: Avant-Garde” (2015–16) and the photographer Thomas Harris.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of 92 works by forty-eight artists, including artists such as Mario Exo, Alejandro Campanella, and Robert Irwin, and is planning", "The next Biennial should be held in 2020. The institution has previously stated that all future editions of the exhibition will be staged at the Lehmann Maupin in London. \n\nThe Louisiana Museum of Art in New Orleans has received a $50,000 donation from Bill and Melinda Gates. The couple established the foundation in 2003 to carry out research into the origins of the gift that has since given the institution $30 million to develop the Biennial. The gift includes a gift of more than one thousand works on paper, plus works on paper, acrylic, and lithography, and will allow the museum to build a new building that will house fifty thousand items from the Guggenheim’s holdings, including fifteen thousand pieces from the collection of Cecilia Cipolletta.Sue Bonoff, the organization’s executive director, said: “The gift will enable the Louisiana Museum of Art to become a critical repository for important art from around the world. We are excited to see how this new space will complement the museum’s existing collection, which includes the art of animals, plants, and minerals. We look forward to working with the family of the late collector Domen", "The next Biennial should be held in 2019 and will likely be helmed by the eminent French architect Jean-Luc Dieudonné. The theme of the exhibition will be “It’s not enough to build a house, you need to also live in it.” The first exhibition organized by the new institution will be “Paradise Lost,” which will run in the museum from March 12–March 15, 2020. The second exhibition, “The New American Century: American Art from the 1960s to the Present,” will be staged at the Smithsonian American Art Museum in 2021. The third exhibition, “Gross Domestic Product,” will be presented by the American Institute of Art in 2021. The museum will be inaugurated with a new exhibition, “The American Dream,” in March 2021.The museum, which was founded in 1910 by artist Charles Darwin, donated $10 million to the institution in 2018. The amount was enough to secure its future and support the restoration of the museum’s building and grounds. The president of the museum, Henry Luce, awarded the institution the $500,000 Grant for Restoration of an Abandoned Building.\n\n\nA portrait of", "The next Biennial should focus on the history of art in California and will introduce a new theme, “The Past, Present, and Future of Art” The ceremony will take place at the San Francisco Museum of Modern Art (SFMoMA), which is also moving for its first exhibition of work by women artists since the 1970s. The exhibition will include works by Regina Benitez, Jorrita Bronfenbrenner, Sue McLaren, and Nancy Wurtz.The architects will create an immersive, moving work called “Away from the Waves” , which will be housed in a three-story glass building that will be housed in the building’s current campus. The installation will feature work by three women artists: Rosalind Roth, Alice Oxtoby, and Malala Yousafzai.Roth, Oxtoby, and McLaren will each receive $25,000. The winner will be announced at a later date.\n\n\nEbony & Hudson, the New York City-based arts organization that was founded by Eric Ebony, Susan Hudson, and Arthur Knepper, has announced that it will no longer continue promoting artists whose work was created before the 1960s", "The next Biennial should celebrate the founding of the German Institute for International and Comparative Art (Dip. Frei. Bagenkau), which is located in Lower Saxony and was established in 1959. The museum opened in the former St. Paul's Cathedral in 1966 and the same building became the institute’s residence in 1976. The first exhibition of artists selected for the museum’s First Exhibition was “Alice In Wonderland” (1963), a retrospective of Leonard Cohen’s first European solo exhibition, and the art of David Hockney. The museum has also staged exhibitions of work by artists including Ursula von Rydingsvard, Anton Kern, and Robert Irwin.\n\n\nAfter a $15 million restoration and $5.2 million renovation, the Richard Prince Sculpture Garden at the Museum of Arts and Design (MAAD) in New York has welcomed a new home for its collection of 150 works\u0097which includes works by contemporary artists such as John Akomfrah, William Kentridge, and Lichtenstein Kütter. Designed by Gensler Architecture in collaboration with New York–based architects Peter Hewitt and Tony Lewis, the garden will feature an exhibition hall, a gallery,", "The next Biennial should take place in 2021 and will be co-organized by the city and the museums. It will be held simultaneously in both cities, between September 3 and September 7, 2021.The exhibition will be organized in three stages:The first phase will introduce the concept of the medium to an international audience, as exemplified by the work of artist Arsht Werner; the second phase will present works by seventy-two artists, including Takashi Kawamura, Jane Pan, Shunsuke Kikuchi, and Pia Camil; and the final stage will feature works by the artist Kwame Kwei. In the first half, the exhibition will highlight the work of seven new artists: Ashok Bhandari, A.J. Al-Saadi, Dusan Lekgaya, Gunnar Mork, and Arsht Werner. The second half of the exhibition will include work by a variety of artists from the world over.The exhibition will also celebrate the city’s 150th anniversary in 2021 with a series of events, including the opening of the city’s first museum of art, an artist’s studio, and a public sculpture garden.The city’s cultural heritage district, designated for cultural", "The next Biennial should take place in 2020 and will be a “modern re-creation of the exhibition,” a statement by organizers said. The exhibition, titled “Avant-Garde at Art’s Edge,” will include works by thirty-three artists in chronological order, including Elisée Amélard, Paul Gauguin, Clement Vergennes, and Jacques-Louis David. The concluding chapter of the exhibition will be a “prequel” to the show.“On the eve of the twenty-fifth edition of the Avant-Garde in Montreal, we are excited to announce that our 2019 biennial will return to the city of Saint-Hyacinthe, as well as to the artist-run space and artist-run museum, the Microscope, in the city of Toronto. This year’s edition will feature work by twenty-three artists, including Joseph Beuys, David Columbo, David Cézanne, Ileana Diaz, Hauser & Wirth, Robert Mapplethorpe, Kenneth Noland, Robert Morris, Robert Mille, and Rainer Maria Fedoroff.”\n\n\nThe Museum of Fine Arts (MFA", "The next Biennial should be held in the second half of 2020.Hassan Noroof, the chairman of Salahaddin Daallo Group, said: “We will continue to support and encourage artists in developing countries to create in our facilities in search of new audiences. Their work will be included in the Biennial for the Visual Arts, the International Festival for Audio-Visual Arts, and the Shanghai Art Festival.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it will open a six-acre, 270,000-square-foot, three-story, fully restored neo-gothic Revival Revival Revival house in the city in 2021. The city government approved the $1.6 billion expansion of the museum, which opened in 1989, in December 2019 and set the building’s completion date for 2021.The renovation, called the Modern Revival Project, brought about two hundred new works by sixty-six artists and is the largest undertaking in its seventy-five-year history. The complete renovation project will include the construction of a new 65,000-square-foot entrance in the building, the creation of a new plaza on the ground floor, the restoration of the museum’s historic stained", "The next Biennial should be in 2020 and will be curated by Shira Berlin-Wechsler.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed David Levine as its next director. He will take the helm of the institution from Cindy Sherman, who retired in February 2019 after eighteen years at the helm of the Metropolitan Museum of Art.“Throughout his seventeen-year tenure at MoMA, David has demonstrated exceptional talent, vision, and commitment to curating new and cutting edge work,” said Marc Glimcher, chair of the board of trustees. “In addition to his extensive experience working with artists, David is a leader, motivator, and communicator who has led museums in both New York and Washington, DC, to unprecedented heights. He will be essential to MoMA’s continued success and legacy.”In addition to his work as a curator, Levine has served as the artistic director of the Solomon R. Guggenheim Museum, and as a curator at the Henry Luce Museum in New York. He also cofounded the MoMA Art and Architecture Competition, the New York Museum of Modern Art’s 'Art of the Party,' the Metropolitan Museum of Art’s", "The next Biennial should take place in 2020, and the board has set a deadline of March 31 to submit a new design for the exhibition, which will feature a selection of works by forty-one artists spanning the twentieth and twenty-first centuries.\n\n\nThe German government has revised its asylum law in an attempt to lessen the country’s migration crisis. The move is part of an attempt to address concerns over the nation’s future membership of the European Union and is expected to be implemented in March. It also deals with the influx of refugees from conflicts in Syria and Afghanistan and is seen as a way to placate conservative voters.Gabriela Alexander, the secretary of the state for the interior, said that the government would implement a number of initiatives to limit the flow of refugees across Germany. She said that refugees would no longer be able to enter the country from Austria or Switzerland unless their travel documents were being temporarily suspended. Refugees will also no longer be able to travel to Berlin or other cities within the state of North Rhine-Westphalia (NRW), and travel between the state and other states will be made possible only by plane.Alexander also outlined how the government would set up a system whereby refugees could apply for asylum in Germany. Under", "The next Biennial should be held in 2020, and Westbank and Davis will present the first two exhibitions of the new museum, titled “Heart of a Nation” and “Astro City.”The commissioning of the new museum was a collaboration between Williams and Davis. “We’ve been collaborating since 2009, when we released the first edition of the show on the museum’s new space on West 10th Street,” said curator and cofounder of the museum Seth Gjorne, who was instrumental in finding a site for the exhibition. “With new groundswell of support from our city, state, and federal governments, we’re poised to create an immersive experience for visitors to our institution across the city, with new installations and exhibitions as we reimagine the former West Village address.”The new museum will be located at 528 West Seventy-Fourth Street, between Seventy-Third and Seventy-Fifth Streets, in Manhattan, and will be inaugurated by an exhibition of work by twenty-six artists, including Chris Albrecht, James Blagdon, and Rineke Dijkstra, as well as a solo exhibition of work by artist and activist Susanne", "The next Biennial should be held at the new location in 2021. 2014 was one of the first years in which the new museum, which will boast 1,200 works by contemporary artists and will boast a ground-breaking new sculpture garden, the Biennial Pavilion, and the first Künstlerhaus, the Künstlerhaus Herzog & de Meuron, with its first exhibition in the museum in the summer of 2020.The museum’s director, Hans-Ulrich Biemann, said: “The renovation of the Künstlerhaus and the new design of the museum is a great challenge for us. But we are convinced that the result will achieve the ideal balance between spirit and content in the right way.”\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has received a major blow to its refurbishment plans this week following a report that found substantial structural damage occurred at the institution as it was still undergoing an expansion. The New York Times reports that a panel of engineers from Bechtel, the French developer of the museum’s expansion project, evaluated the building in 2017 and concluded that the museum was in danger of collapse. “When Bechtel received", "The next Biennial should aim to include a consideration of “how art and culture can be a force for social good,” and will be held at the Museum of Modern Art (MoMA) in New York from March 11 to March 12.\n\n\nThe Exhibition of the First International Exhibition on Contemporary Art in the United Kingdom (FIFO) has announced that it will not be hosting the twenty-third edition of its Triennale in Leicester, England, in 2021. The announcement follows a tumultuous year for the fair, in which it was forced to cancel the event due to concerns arising from Covid-19; the fifteenth edition in Milan, which was pushed back due to the pandemic; and the twenty-fifth in London, which was canceled after a fire broke out in the exhibition space. The third edition of FIFO, which ran from June 21 to June 24, was also canceled. The event, which was originally scheduled for October 21 to October 25, was rescheduled for December 15 to January 3, 2021, but was rescheduled for the 25th Anniversary of the Royal Shakespeare Company, which made its debut on February 16.The cancellation of the three events, which have been dubbed “mini-events", "The next Biennial should focus on a combination of procedural and conceptual issues, with a view to exploring the specific interconnections between the visual arts and the natural sciences. The theme should be an attempt to redefine the relationship between visual arts and the natural sciences. The exhibition should highlight the current challenges and opportunities that lie ahead for the visual arts and the arts in general.”\n\n\nThe London-based conservation charity Pembrokeshire Council is launching a new initiative to help the region’s arts and cultural heritage. David Cameron, the British prime minister, recently pledged £10 billion ($12 billion) for the regeneration of the area around Whitechapel Gallery, which was the home of artist and intellectual Fabian Niebuhr (1938–1958), and the Tate, where Sir David Attenborough (1932–1963) and other British leaders are currently staging a major reopening exhibition. David Harress, the director of Tate Britain, said: “We are all very proud to play a part in helping to shape the future of our local communities. We hope that this initiative can prove a useful next step.”\n\n\nThe Boniface Mather Museum of Art in Atlanta has issued", "The next Biennial should open in 2020. For now, however, the Museum of Contemporary Art Los Angeles (MCA) has announced that it is working on a new series of tours, titled the Short Film Biennial, that will run from May 23–May 27. The first show, titled Shelter (2011), is currently on view in the Museum of Contemporary Art San Diego.\n\n\nThe Museum of Contemporary Art San Francisco (MCA SF) has appointed Jeannette Oosterhoff as its next director and CEO. She succeeds Christina Rosales, who departed in the summer of 2021 to head the Whitney Museum of American Art, and will assume her responsibilities on March 2.“In recent years, Jeannette has built a strong reputation for excellence in the field of contemporary art,” MCA SF director Ravi Sinha said in a statement. “Her commitment to supporting artists and fostering interdisciplinary dialogue is apparent in her work with the MCA SF, which has worked hard to integrate contemporary art into its programming to advance cultural exchange and collaboration.”Since joining the institution in 2015, Oosterhoff has fostered a more diverse collection and the development of its curatorial and research teams, promoted the creation of", "The next Biennial should take place in the spring of 2020, and the opening of the museum will take place in the summer of 2021. Camille Charpentier, a curator at the Stedelijk Museum in Amsterdam who survived the bombing and the pandemic, is also a cofounder of the institution, which is situated in a former steelworks in the city of Almere, in the Netherlands. Charpentier, who was among the first to organize a “town hall” in a central location in Amsterdam, was murdered by a man named Sabine Verheyden-Sauten in the early hours of January 5, 2020. The manhunt for the perpetrator is still ongoing. It is believed that the arsonist is responsible for the deaths of the thirty-four people who were injured in the fire that broke out in a master bedroom suite of the building. The fire department initially extinguished the blaze in the apartment, but it was not extinguished properly. The building—which has a capacity for just sixteen people and is located close to the Amsterdam Art Biennale—has been restored, and is currently undergoing a $500 million renovation.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Sarah Bernhardt as its next director", "The next Biennial should be held in the fourth quarter of 2020. Finalists for the 2020 prize include the city of Madrid (2019), the Bechtel Group (2019), and the New York Philharmonic (2019).The 2019 prize jury comprised Christopher Jacobs; Niki Verschuren, artistic director of the Metropolitan Museum of Art; Jaime Vergne, director of SALT; William Zwirner, president of the London School of Economics; and Michael Janke, director of the Grant Museum in New York. The 2018 prize jury comprised Naima J. Keith, L.A. County Museum of Art curator; David Wolkowitz, chair of the department of new media and performance art at the Berklee College of Music; and Linda Thomas, cofounder of the New York–based nonprofit the Crystal Bridges Collective.\n\n\nOn Monday, the Armenian president, Serzh Sargsyan, issued a decree revoking the citizenship of four American citizens, including David H. Koch, who is widely considered the richest man in America and is the chairman and CEO of Koch Industries, and who were named by Sargsyan as having violated the country’s laws by", "The next Biennial should take place in 2020. “In the meantime, the first theme for this year’s exhibition is ‘the environment.’ The theme of the biennial is ‘togetherness.’ The theme will be ‘the future of our planet.’”João Hoesa, the inaugural president of the Biennale of Brazil, said: “I thank the many artists and curators who have chosen to participate in this year’s exhibition. I am thrilled that they have found the opportunity to showcase their work as part of the extraordinary exhibition program that has been launched by the Museu de Arte de São Paulo, the Brazilian Association of Curators, the foundation, the artists and curators, and the city of São Paulo.”\n\n\nThe Italian artist Stefano Camondi, who is known for his semi-autobiographical sculptures that experiment with human relationships, has died at the age of seventy-two. The many works that explore relationships between painter, sculptor, poet, and activist, as well as between people and the natural world, are often considered as a work of social activism. Born in Corfu, Italy, in 1931, Camond", "The next Biennial should be held at least twice a year, with the first being in the spring. “The question of what biennial can be is an issue that today we are still a ways away from discussing, and at this point, has never been systematically assessed,” said Maarten de Bruijn, the director of the Biennale de Noten, in a joint statement with the other four directors of the event, Christo and Carmel de Grieme. De Bruijn explained that the Biennale de Noten is currently investigating the feasibility of a two-year biennial, and that the next edition, slated for 2020, will be held at least twice a year. “This is not a new question, as it has been discussed for centuries, but it has never been prioritised or defined, and it is one that we are now in the process of determining, which is a question of what can be.”\n\n\nThe exhibition “The Concrete Work of Art” will return to Tate Britain in London next year with a reopening on September 9, the museum announced on Tuesday. The retrospective, which explores the evolving relationship between art and water, will run concurrently with the Tate’", "The next Biennial should be held in the spring of 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Mira Nessem as its new senior curator of European art. Nessem comes to the institution from the Getty. Previously, the Pennsylvania native worked at the Denver Art Museum in Colorado Springs, where she helped organize the exhibition “The Future Is Present,” which opened in October 2018 and was the first major retrospective of postwar German art. She will assume her new role in March 2020.“I’ve been following Mira’s career for nearly fifteen years,” said museum director Sarah Fiorito. “Her eight-year tenure at MoCA was the most successful decade of her career, and her tenure as a curator was the most ambitious. Her curatorial projects include ‘Càrupa,’a huge multidisciplinary project at MoCA that introduced European art to the United States and the world; a comprehensive and ambitious retrospective of Italian art; and ‘The Submarine,” an exhibition that explored the relationship between modernist painting and the Mexican coast.”Nessem will be responsible for developing and presenting the biennial’s exhibitions", "The next Biennial should take place in 2021.The exhibition will have an exhibition-like format that will integrate performance, installation, performance-based programs, a digital platform, and digital editing. It will also feature works by emerging and established artists. The theme of the biennial will be “Flow and Form,” a term coined by James Atlee, one of the creators of the conceptual art movement and the founder of the Inherit co-op.\n\n\nThe National Galleries of Scotland announced that, in a move that will remove more than 1,500 items from the institution and affect all aspects of its operations, the National Maritime Museum (NM) in Edinburgh (and possibly in the United Kingdom as well) will become a “public space for sharing images, videos, books, artworks, audio and text.” The move is part of a wider plan to shift the museum’s collection away from film and to allow it more autonomy from the Royal Shakespeare Company.“The move is part of a wider plan to shift the museum’s collection away from film and to allow it more autonomy from the Royal Shakespeare Company,” said director Ross Murray. “It also sees the creation of a new inter-inst", "The next Biennial should take place in the spring of 2020, and an exact date and location will be announced after the festival has completed its winter programming. The event will be hosted at the exhibition space LACMA in the former Museum of Modern Art and will be supported by an endowment from the Guggenheim.The 2017 edition of the biennial featured artists such as Angela Ahrendts, Kiki Smith, and Laura Owens. The 2019 edition, titled Art of Life, explored the relationships between art and life, the environment, and life itself. The full list of exhibitors is as follows:In the exhibition, which was organized by John Yau, the executive director of the Association for Contemporary Art and Design, the exhibition was divided into two sections: “Art of Life”\u0097a collection of paintings, sculptures, photographs, and works on paper\u0097and “Art of Destruction”\u0097a collection of works that were made with destructive devices. The exhibition was launched with a question: “How can we as a community, as a society, fight climate change” and raised a number of important issues including: How do we prepare for the impacts of climate change? And what can be done about", "The next Biennial should be held some time in 2021. This is the first time the museum has hosted a collection show since 2002.\n\n\nThe Canadian Museum of Fine Arts (CMFA) in Toronto has received a $5 million donation from the Matthew and Viola Wall Gallery in Toronto. The gift includes the current exhibition “The Concise History of Modern Painters” and the upcoming exhibition “Painting in the Age of American Visualism”. The gift also includes a collection of paintings by painter Emma Bonin that have never been presented before and an exhibition of the works of artist Robert Irwin.“We are thrilled to welcome the Wall Collection's contributions to the museum, to the gallery, and to the city of Toronto,” said director and CEO Mira Dorsen. The gift was made in recognition of the museum’s continuing dedication to the collection and mission of contemporary art. The gift comes at a pivotal time for the museum as it plans to undergo a $150 million expansion, which will also include the construction of a new 12,000-square-foot building. In addition, it will begin a major facelift, which will also include the reinstallation of the gallery’s collection of works", "The next Biennial should be held at the Institute of Contemporary Arts in London in 2022. A series of exhibitions organized by the ICA in the United States should open in the not-too-distant future.The German city of Freiburg said it is prepared to host eight biennial exhibitions in 2020, but only if the ICA’s participation is extended. Further negotiations are supposed to take place between the organization and the city of Freiburg this week.“The ICA is committed to bringing exciting exhibitions to Berlin and we are already working with our city government, city council, and other cultural bodies, to increase the number of exhibitions in the coming years,” the organization said in a statement. “The exhibition series ‘between the artist and the viewer’s journey, as well as the exhibition space itself, is of crucial importance for the future development of our cities, and the ICA Berlin is eager to participate in the city’s strategy for transforming our city.”\n\n\nAs the number of Americans killed by gun violence continues to rise, and in the case of the first time ever, the country has witnessed a mass killing with more than one hundred people killed in a single incident, lawmakers are", "The next Biennial should be held in 2020. “We have been working towards this for a number of years, and we have managed to make significant progress, but we have much more to do,” said curator Anna Comas. “The current exhibition is a long way from reaching our goal of raising $150,000, and the exhibition, like all our exhibitions, will be a challenge to see through.” The next edition of the Tretyakov Biennial will take place at the New Museum in New York in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has assigned seventeen artists to its next-level group. Their exhibitions will take place in conjunction with the museum’s upcoming release of Museum of Modern Art (MoMA) “Sensations from a Young Age: The Art of the Late 1960s” and “Scandinavian Art in the 1970s” and will run concurrently with the opening of the retrospective exhibition “The Male Gaze: The B-Side” at the National Gallery of Art in Washington, DC, in the spring of 2020.“The Biennials are the last generation of artists who have not been marginalized,", "The next Biennial should be held in 2020 at the end of the thirty-fifth biennial, titled “Feminine Fashion.” The show will focus on the theories and practices of the late Italian designer Adna Di Francesco, whose runway shows often grappled with themes such as feminism, domesticity, and the role of women in society, and will include works by artists other than the six finalists.Judged by the jury members, who are made up of Valentino Fusi, the editor of Italian fashion photography magazine Tuttocolce; Stefano Fusi, the director of the Italian fashion photography studio AGAM; and Stefano Magnoli, a journalist and the creator of the magazine Sopatino’s exhibition “Instagram, Instagram, Instagram” created the exhibition. The jury also comprised Andrea Dallù, Lucio Catellani, Marcella Lippi, and Florian Mayer; and the winner was announced on Wednesday, March 8.“We are very happy with the exhibition,” Valentino Fusi said. “It was the best exhibition the biennial has ever presented. The selection committee was also very anxious to present a work from", "The next Biennial should launch in 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced that it will hold a second edition of the annual event, which was originally scheduled for March 15–March 19, 2020. The event will be hosted by LACMA at the Los Angeles County Museum of Art (LACMA), which is currently undergoing a $400 million expansion, in the spring of 2021. The event will feature a mix of new works by over sixty artists and curators and will be organized as a biennial, with overall curatorial and development projects by the LA-based artist-run organization the Los Angeles Alliance for the Arts (LA-ALB), as well as a residency program focused on the arts.LA-ALB announced the residency program, which will focus on the arts and culture, in a statement on Thursday. The residency program will begin this spring and will run for eighteen months. “Our decision to launch the residency program is an extension of our ongoing commitment to supporting our artists and curators, whose work embodies and reshapes our lives and the lives of our communities,” said LA-ALB president and CEO Becky Quick. “The LA Alliance for the Arts is proud to", "The next Biennial should be held at the Schloss Abbotl in Vienna, the Chaumont-le-Fleuriel in Paris, the Grand Galerie de Tijdschaf, the Haus der Kunst im Neue Galerie in Berlin, the Galerie des Presse in New York and the Galerie Rügenstiftung in Zurich. The event will also be staged in Hong Kong, Mexico City, the Riviera Maya, Los Angeles, New York, and San Francisco. The 2019 biennial will mark the thirteenth edition of the Deutsche Art Museum Hamburg, which has been closed since March 13 due to the Covid-19 pandemic. \n\n\nThe Museum of Contemporary Art (MoCA) Los Angeles has added two new members to its board of trustees: artist Adrian Piper, who will serve on the board until November 2020, and art historian and curator David Salle, who will begin his tenure in November 2021. In addition to his current position at the museum, Piper serves as a trustee of the Carlyle Group, the parent company of the Carriageworks organization, and in March 2018, he cofounded the David Salle Foundation. Together, they have pledged $5 million to support the", "The next Biennial should begin as soon as possible and will be held in the spring of 2021. “We are thrilled to be working with Richard and the team from the Chicago Institute of Art to present an exhibition that celebrates the rich history of the Biennial, and of Chicago as a whole,” said biennial director Jaye Howard-Adams. \n\n\nThe Foundation for Contemporary Art (FCA), a New York–based nonprofit, announced today that it is reopening its doors in June. The organization will hold two biennials, “Tender Is a Warm Gun” (March 27–March 31) and “Spiral Gaze” (March 29–March 31), both of which will be on view in conjunction with the opening of the Foundation’s new space, the Museum of Contemporary Art, Cleveland, in June. “The Foundation’s longtime mission is to advance the work of contemporary artists through a commitment to critically engage with and to support their processes,” said David Guggenheim, chair of the board of directors. “These two biennials will honor both the visionary accomplishments of the biennial’s past and present artists and present the Foundation�", "The next Biennial should be held in 2021.\n\n\nThe National Gallery of Scotland has taken a monumental step in supporting the local arts by appointing artist-in-residence Paul Mapp as its next director. Mapp, who has been appointed by the National Union of Journalists and Arts Secretary Jo Cox, will serve in his role until the end of the year.“He has been a passionate supporter of the National Galleries for more than thirty years and is committed to supporting their talented staff and visitors through a strong and vibrant future,” National Secretary Stewart Regan said. “His passion, intelligence and creativity for the National Galleries is reflected in his appointment, and we are confident that he will continue to develop and improve the National Gallery for Scotland as a great champion of the arts.”The National Galleries’ work has been featured in the twenty-six editions of this event, which have been held at the National Gallery in London since 1992. The first edition, held in 2015, was a collaboration between artist-in-residence Sianne Abbot, who served as a model for the work for the exhibition. The second edition, held in 2019, was a collaboration between the National Poetry Library, the National Po", "The next Biennial should be held at the UC Berkeley Art Museum, in the spring of 2022. There will also be a redesign of the museum in the spring of 2022 and a new exhibition in the fall of 2022. The design change was made in response to the fact that the museum has been closed since March 11, 2019, due to Covid-19.The museum’s building will also undergo a $15 million facelift, which will include the installation of new galleries, a library, and other public spaces and will also include the construction of a new visitor entrance directly to the museum. The redesign will embrace an ‎enriched, contemporary, and contemporary-­modern aesthetic, which is unique to the museum. The renovation will also include the reopening of the adjacent UC Berkeley campus, which is scheduled to reopen in the spring of 2021.Both the Biennial of Modern Art and the museum’s permanent collection will remain closed until the redesign is completed.  “The redesign will not only enhance the unique character of the museum, but it will create new opportunities for the museum to continue to grow and for the community to connect with Art and Art History,” said museum director Nicholas Bochereau. “I", "The next Biennial should open in 2022 and will be hosted at the Museo de Arte Contemporáneo (MAS) in Madrid. \n\n\nThe American Ballet Theater (ABT) in New York has appointed Marilyn Sexton as its next director. Sexton comes to the institution from the American Ballet Theater, where she has served as director throughout the last seventeen years. Under her leadership, ABT has grown from a company of six to a thirty-nine-person company with multiple locations across New York and New England. Sexton will take up her new post in April. “Marilyn is the perfect person to lead the next iteration of the American Ballet,” said Arne Glimcher, the company’s artistic director and CEO. “She has the vision to think big and build an entirely new brand, and she has the ability to think and act in concert. She has the skills to think with and for the artists and she has the energy and enthusiasm to think big and change the world.”\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Lynda Barry as its new director and CEO. Barry joins the institution from the Metropolitan", "The next Biennial should focus on the history of the exhibition, and will be open in the newly renovated Smithsonian American Art Museum in Washington, DC, from March 21 to March 23. The exhibition will include new works by artists whose work has been previously shown at the Biennials; a selection from the Biennials’ collection; and an exhibition that will feature works of newer and older artists.The biennial will be led by Gwyneth Paltrow, the founder of the eponymous fashion label Paltrow + Heald, which is headquartered in New York. Paltrow, who has collaborated with the biennial since it was founded in 2006, will serve as the director of the exhibition. The programme will be curated by Tina Agapen, who has served as the director of the Leipzig Center for Contemporary Art (LCA) in Germany since 2012, and will be inaugurated by a presentation of work by Yinka Shonibare, a Japanese artist whose work was recognized in the biennial’s inaugural edition in 2017.\n\n\nThe Italian government approved a €120 million ($130 million) bailout package for the embattled private collector (and former Ferrari factory boss) Luca di Montezemolo on Monday, adding", "The next Biennial should take place in London in 2021; the next in the US in 2022; and the last one in 2020. The theme of this year’s event will be “Dreams of the Body,” and the artistic team behind the exhibition will be the same as the last, which was curated by London-based artist Aya-Maria Ahmet. The five-day event, which will be held at the Royal Festival Hall, will draw more than 100,000 visitors to London.\n\n\nA group of artists and scholars who were barred from the Cannes Film Festival for their participation in the 2017 edition due to the coronavirus epidemic are suing the smaller festival for discrimination, theft, and breach of contract. The lawsuit, which was filed by the artists and academics Thrice, Tomás Levi, and Léáása Garcia, claims that the organizers did not provide them with the necessary financial support in case of the shuttered edition. “The defendants systematically and deliberately discriminated against the artists and scholars in order to impede their participation in the twenty-fifth edition of the FIM Biennial in May, 2018, and the one-hundred and tw", "The next Biennial should be held on June 18–June 22. \n\n\nThe National Endowment for the Arts (NEA) announced today that it will award $25 million to fifty arts and cultural organizations as part of a special grant program—the National Endowment for the Arts (NEA) “supports the fundamental goal of reopening the economy by revamping the tax code and reopening the tax-exempt arts and cultural institutions.”The grantees are the following:• The Diandra Photography Club in Malwani, Nigeria• Dreamland Photography Club in Seattle, Washington• The Mpagi Maru Museum of Art in Nairobi“Imbecile Artisiam (LEAF) in Nairobi, Kenya• The Mpagi Maru Museum of Art“Imbecile Artisiam: Inferno” and “Inferno II: The Eternal Threat,” in Nairobi, Kenya• Mana Contemporary in New York, New York• The Mpagi Maru Museum of Art“Inferno III: The End of the Affair,” in Nairobi, Kenya• Mana Contemporary in New York, New York", "The next Biennial should take place at the National Gallery of Art in Washington, DC, in 2021. The biennial is still being planned by the National Gallery of Art in New York, and the Metropolitan Museum of Art in the United States. The Metropolitan Museum of Art and the Smithsonian American Art Museum in Washington, DC, are also working on creating new permutations of the horse and the American Southwest, respectively. \n\n\nXavier Hufkens, the French team behind the legendary Bottega Veneta, has announced that it will not return to Paris for its sixth edition next year. The announcement followed the news that the event’s organizers would have to reduce the size of the venue by 25 percent in order to keep the exhibition afloat.The announcement follows a two-year campaign that has seen the artist’s works featured in the show and in book form, as well as in the exhibition “Feminine in Paris,” which will run concurrently with the 2020 edition. The exhibition was meant to draw a distinction between the two cities, and was inspired by a photograph of French artist Jules-Anne Cousteau, who was the model for the seventeenth-century female protagonist Le Corbusier’s", "The next Biennial should take place at the Victorian Institute of Art, London, 2020. The 2020 event will feature works by twenty-eight artists and will take place at the Maritime Gallery, London, from August 15 to August 16. The 2019 event will mark the 100th anniversary of the British Museum and will be staged at the Smithsonian American Art Museum, Washington, DC, from August 14 to August 16.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a major donation of more than five hundred works by private collectors, including Marlo Pascual and Roy Lichtenstein, from the estate of the late financier Bernard L. Madoff. The gift includes nearly three hundred works by artists including Luis Buñuel, Pierre-Auguste Renoir, and Pierre-Auguste Huyghe, and includes works that were digitized and authenticated by the dealers.The works, from the Madoff Collection, are part of a major gift made by the late philanthropist in honor of the former CEO of the New York–based investment firm Apollo Management, Bernard L. Madoff, Jr., who passed away in March 2019. According to the New York Times, the company installed a special scanner in his", "The next Biennial should take the form of a multi-level collaboration between the two institutions, creating works that address the contemporary issues that shape our lives. The biennial will invite works that are not currently on display in museum settings, through a process of inclusion, collaboration, and transparency. The exhibition will feature the work of forty-eight artists, including the artists whose work will be included in the exhibition, and will be inaugurated by the Icelandic artist Birgitta Littman’s work The Second City. The exhibition will be presented by the Düsseldorf-based artist Georges Apostel, who also curated “The Skeleton of Our World,” a show that explored the history of African art in Germany after World War II. It will also feature performances by the artists involved and will be supported by a Düsseldorf-based public arts organization, BILD. The inaugural Exhibition of African Art (AOA) will welcome fifty-five artists in January.\n\n\nThe United States is preparing to welcome two dozen foreign artists to the Capitol in 2019, with the tentative opening of the biennial scheduled for March 20–March 22. The announcement coincides with a number of events that will take", "The next Biennial should start with a public lecture by Kiki Smith, curator of contemporary art at the Museum of Modern Art, New York; the Noga Foundation, New York; and the New Museum, New York. The exhibition will then continue with the artist-run residency program, the first phase of which will be held in the city of New York from March 23 to March 29. The second phase, which is still being organized, will take place in the city of Rochester from March 27 to March 28.The festival has also announced that the 2020 edition will be staged at the Detroit Institute of Arts (DIA), where it will be joined by a selection of works by artists from around the world. Titled “Unseen: Contemporary Art at Detroit,” the exhibition will center around the themes of memory and the fragility of the present, as well as the role of artists in shaping public discourse and public space. The show will also include a book by the artist and curator Helen Frank, as well as an exclusive installation by Kiki Smith.“It is a great honor and pleasure to bring together artists from around the world for this year’s edition of the Detroit Biennial,” said Kiki Smith. “This"]