["The next Biennial should be held in 2020.\n\n\nThe Institute of Contemporary Art (ICA) in Milan has received a $50,000 donation from the French government. It is the first time the Italian government has provided funding for a international show in the country. The gift was made in recognition of the institution’s contribution to the “fight against racism and xenophobia” and its role in the fight against fascism in Italy, which was founded by Alexandre Breton in 1911.While the prize jury awarded the award to the Institute of Contemporary Art (ICA) for its exhibition “Racism and Xenophobia: Art and Politics in the Age of Resistance” at the 2017 Venice Biennale, the French government decided to supplement the award with $100,000. The sum of the two awards was announced by François Hollande, the president of France, on November 13. Hollande also announced the launch of the “Election of Our Time” initiative, which will provide financial and technical support to political parties and candidates in the runup to France’s presidential election next month.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received $50 million in federal stimulus", "The next Biennial should be held at least twice a year, and should include at least thirty works by artists participating in the exhibition.  What about the museum’s collection? Where is the biennial housed?  The Museum of Contemporary Art-- Los Angeles (MCA) has been approached about opening a biennial at its headquarters in downtown Los Angeles, but has not yet decided. A conference on the exhibition will be held at the Museum of Contemporary Art in Chicago in March 2020. American painter and sculptor Arthur Andrianomearisano, whose work combines ceramics and architecture in a complex geometric form, died in New York City in 1942. The public is invited to attend the first Biennial at the Museum of Modern Art (MoMA) in New York on February 27–March 2, 2020.\n\n\nThe Metropolitan Museum of Art in New York has announced that it is opening two new centers of artistic endeavor, the Asia-Pacific Art Archives (APAC) and the Metropolitan Museum of Art, in Manhattan. The centers will be inaugurated with a solo presentations of work by artists and collectors from the Pacific Rim. The first exhibition, “Pacific Rim: Asian Art”", "The next Biennial should be held in 2021. The Art Newspaper predicts that the redesign will also address the exhibition space’s energy needs, and that the future of the Biennial will be decided by the artist-run, nonprofit venue, and not by the organizers. “Art is alive and well in Pittsburgh,” Joshua Helmer, the Biennial’s architect, told the Art Newspaper. “We are always actively working to improve the space, to make it better and better. We wanted to make sure the new building and its environment would feel rich and special.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has received a $5 million donation from the estate of Olaus’s late president, Adolfo Olaus. The gift was made in remembrance of the president’s legacy and to thank the DCLA for its first-ever annual gift grant. Olaus’s estate donated the funds for the honors in memory of his wife, Elizabeth Olaus.“The DCLA was a gift of a new dream to Olaus and his family,” said Elizabeth. “At a time when the institution was grappling with the impact of its collapsed health-care system", "The next Biennial should be held in the summer of 2021, the institution said. “The decision to cancel the event was not unexpected, as the exhibition was already already under consideration,” said Adriano Catellani, the director of the Museo de Arte Contemporáneo Brasileira (MASB), Rio de Janeiro. “The Biennial is not a formulaic event, but a project that was born out of a real and urgent need. The Festival is a way to be together with friends and to be active together with new ideas. It is about theatre of the future, about being together and about being alive.” On the upcoming exhibition: Brazilian artist Dario Bilello, who created highly abstract works that address issues of energy, the body, and grief, will present his first exhibition in the capital. The exhibition, titled “Re-Reconstructing Modern Life,” will offer a view of Bilello’s artistic practice through the lens of the Brazilian 1976–1985, when he lived and worked in the city of São Paulo. The show will include works by seventy-five artists, including Adriana Chaudhari, Roberto De Sol", "The next Biennial should be held in the Chinese city of Nanjing on September 10–September 15. The exhibition will screen the work of more than seventy artists, including Madrid’s María Berrada, Netherlands’s Maren Büttner, France’s Hannah Appleby, Italy’s Sara Cuno, and Italian artist María De Cesaris. The show will also feature work by more than fifty other international artists.\n\n\nThe French government has approved a $6.5 billion aid package for France’s arts, which is already among the largest gifts France has ever made to the United States. The new $6.5 billion package will provide an additional $2 billion for the French diaspora, as well as a number of initiatives that were stalled as a result of President Emmanuel Macron’s promise to reduce France’s role in NATO.“With this fresh initiative, the French government aims to restore France’s role as a beacon of cultural cooperation between the United States and France,” said French Culture Minister Franck Riester, who discussed the package in an interview with the New York", "The next Biennial should be held in 2020, with a new exhibition to be presented in 2021. The exhibition will be inaugurated with the exhibition “On the Light,” an exhibition that will draw from the works of both artists and takes its inspiration from early masterpieces. The show will thus not only showcase the work of both artists, but will also reflect on the relationship between light and lightness, the modes of perception, and the creative process.“I think it’s important that the themes of the exhibition reflect the themes of the city. I think both the exhibition and the exhibition will be dedicated to an exploration of the themes of light and lightness,” said architect Yinka Shonibare, the director of the New Museum in Tokyo. The opening of the exhibition will take place on November 6, 2020.\n\n\nThe Paris-based nonprofit Artspace has launched a new initiative called the Paris Plan. The program will provide thousands of arts professionals and cultural workers working in the capital with direct financial support in the form of loans as well as help them prepare for and apply for grants. The funds will be disbursed over a period of ten years, beginning in 2020, and will serve as a supplement to the Parisian", "The next Biennial should take place in the town of Bari, Italy, in September 2019. The next iteration of the Twenty-Ninth Venice Biennale will take place in May 2020.\n\n\nThe Contemporary Arts Museum Houston (CAMH) has appointed Kelly Rindt as its new executive director. Rindt comes to the museum from the Des Moines Museum of Art (DMA); where, from January 1, 2019 to March 30, 2020, she will work as an independent curator for the museum.“Kelly is an innovator and a champion of emerging artists and their work,” said director Mira D. Barrow. “Her passion and dedication to artists and their work is infectious, and we’re eager to support her as she continues to expand and advance the DMA’s curatorial mission.”Rindt comes to the museum from the Wolfsonian-Florida International University (FIU) in Miami Beach, Florida, where she has served as the director since 2016. Previously, she was the founding curator of the American Prints Museum and as the recipient of the 2014-15 Sheldon Cooper and William Shatner Award for Excellence in Prints.Commenting on her new role,", "The next Biennial should be held between March 14 and March 16, 2020. The year 2020 will also mark the centenary of the founding of the London Foundation for the Arts (LFA), which was inaugurated by Sir Henry Moore and his colleagues in the space of just eighteen months.The platform will showcase the work of several hundred artists, including a collection by contemporary artist Ben Horowitz, the first to work with a human computer; a selection from the artist’s vast archive, including works by such artists as Lumi Tan, which will be included in the exhibition “The Art of Meditation”; and works by artists such as Damien Hirst and Ursula von Rydingsvard. The exhibition will also include an immersive film, a virtual reality, and a sculpture show.\n\n\nOn Friday, the Toronto Art Gallery (TAA) announced that artist and curator Kit Chang has been selected as its next board president. Chang, whose work explores the role of artists in shaping social movements and the role of the gallery in the city, will lead the board for eleven months. Chang, who works primarily in the form of sculptural installations and installations and designed books, films, and television programs, will take up the post in January 2021", "The next Biennial should take place in 2019, and the 2019 edition will feature the works of forty-three artists from sixteen countries. The 2020 edition will be curated by Hao Tam and will open on the fourth floor of the Museum of Contemporary Art (MoCA), New York, on September 24.The 2020 event will be hosted by the Pan-American Foundation in partnership with the Metropolitan Museum of Art and the Whitney Museum of American Art. The 2020 edition, which will be followed by a final exhibition in December 2020, is being curated by Nora Jacobson, who previously served as the inaugural director of the Art Institute of Chicago’s collections of artists such as Keira D. Fontana, Joan Miró, and Joan Miro, and will be presented by the artist and curator.“The Metropolitan Museum of Art has a rich legacy of exhibitions and scholarship in its interactive collection—a legacy rooted in a commitment to create and engage with works by artists from the Americas and Central America, as well as from the European Middle East, Africa, and South Asia,” said Beth Savitt, director of the Metropolitan Museum of Art. “This biennial presents the opportunity for a new generation of artists to explore and reimagine the work of these", "The next Biennial should be staged in 2021.\n\n\nThe Seattle Asian Art Museum (SAAM) has named Tamara Greenfield as its next executive director. Greenfield comes to the institution from the Museum of Fine Arts (MFA), where she has served as director since 2012. During her tenure at the MFA, she has organized six exhibitions, including “The Story of Art” (2019) and “Who Is the American Dream?” (2015) and helped the institution raise $48 million for its expansion, the Museum of Art, Seattle, and the Puget Sound Art Museum, Tacoma.Greenfield succeeds Carolyn Visitor, who retired in March 2019 after twenty-nine years at the helm of the museum. “Following a thorough search, we were impressed by the breadth and depth of Tamara’s experience and passion for Asian art and the potential for her to further elevate the reputation of the Seattle Asian Art Museum as a major force in the field,” said Alix Rowland-Hanes, the museum’s executive director. “Our board agreed that she was the right person for the position, but she still has a long road ahead of her.”Commenting on her appointment", "The next Biennial should go ahead as planned, but with new materials and a new theme. It will be held at the Museum of Contemporary Art, Boston, from January 16 to February 22, 2021.“We are thrilled to collaborate with Boston and are working closely with the city, the county, and the state to ensure the festival has a successful and safe return for visitors to the city,” said museum director Heather Lee. “It is already a hallmark of the Museum of Contemporary Art in Boston to host an exhibition of the work of a contemporary artist, and it will continue to be so in 2021. The biennial will also continue to inspire and provide a platform for the work of local, internationally acclaimed artists in 2021.”The 2021 edition of the Biennial will be the first by artist-activist and educator Laurie Anderson. The artist-activist and educator was selected from a shortlist by a public panel that included Jack Conte, artistic director of the Contemporary Art Museum Boston; Aditya Bhalla, director of the LACMA Theater; and David Karp, chair of the arts department at Harvard University. The panel selected her from a pool of eleven finalists.Commenting on her selection, Anderson said: “It", "The next Biennial should focus on the work of emerging and established artists under the influence of experimental art practices in China and Europe. The exhibition should take place in Beijing from November 17 to November 20, 2020. The new exhibition will be curated by the artist-run Chinese contemporary art space Fung Yue and will focus on the art of the Chinese diaspora in Europe, the United States, and China. “The exhibition will reflect the gatherings and the ancient practices of the Chinese art community in the West and will incorporate the visual arts, sculpture, and painting,” said Zhang Yijun, the founder of Fung Yue. The exhibition will be organized in a way that will allow the artists to work and play in both Beijing and Guangzhou, and will have a staff of twelve. The organizers are not saying when the exhibition will open, but it will be around October 20.The programme for the exhibition has yet to be announced.\n\n\nIn what may be considered the most ambitious project of its kind, the Institute of Contemporary Art (ICA) at the University of Pennsylvania announced on Wednesday that it is revamping its exhibition space in honor of Black History Month, opening it in the auditorium of the university for the first time in 2019", "The next Biennial should take place in 2020.\n\nArts Council England (ACE)’s executive director, Tom Finkelpearl, said: “Arts and culture are at the heart of what makes the UK tick, and we are determined to make the biennial an even better place by delivering a more diverse, creative and accessible Royal Shakespeare Company and an exciting adaptation of the National Poetry Month.\n\n\nThe Association of Arts Museums (AAM) has welcomed Kirsty Browne to its board of trustees. Browne, a former chair of the Board of Trustees and now the current director of the London-based nonprofit Art Gallery Without Borders, will become the second former deputy director of the British Museum to become a member. During her tenure at the museum, Browne oversaw the development of the museum’s collection-focused programming, the establishment of the museum’s new Center for Contemporary Art, the expansion of its contemporary-art museum collection, and the establishment of its new research and research-focused model.“It is a pleasure to welcome Kirsty to the AAM board of trustees,” said board president Professor John Mackay. “From working collaboratively with artists to championing craft and the arts to", "The next Biennial should open in 2021. Bao is a pseudonym for Chen Bao, a university professor from Beijing whose work investigates the relationship between art and politics. He has presented his work at the Art and Technology Museum (ATM), Beijing, the National Museum of Fine Arts in Beijing, the Art Museum of History in Beijing, the National Museum of Contemporary Art in Beijing, the Beijing Center for Contemporary Art, the Contemporary Art Museum Beijing, and the Beijing Museum of Fine Arts.\n\n\nThe Art Newspaper reports that the Tate’s board is considering reducing the current six-figure salary of head of arts department Oscar Murillo by $1 million in an attempt to mitigate the financial impact of Covid-19. The move follows the announcement last week that the museum was planning to close indefinitely and that it expects to soon be forced to close its three-storied building, which houses the Tate’s collection, in London.According to the Art Newspaper, the museum’s current staff were only offered a two-week contract, which stipulates that they work two-thirds of the week and receive six days off each week. As a result, the union representing the museum’s workers is asking for a 15 percent pay cut.", "The next Biennial should take place in 2022.\n\n\nThe Montblanc Foundation in Berlin has removed a statue of Joan of Arc, a woman who saved six thousand Jewish women during the Holocaust, in its home city following a fierce campaign led by the city’s art historian, Bernd Rosengren, who collected more than forty thousand signatures in support of the controversial relocation of the work.The foundation announced on Tuesday that it had decided to remove the statue of the medieval French noblewoman from its site in the city’s Obersalzberg district. The decision was made in the wake of the June 12 terrorist attack on an office building housed in the historic Galerie Roland Barthes in Paris, which killed a number of people and injured dozens more.The foundation cited the recent hostage crisis in Lebanon as a reason for the move, and said that it chose to remove the statue as a “service to history.”In an open letter published by Bernd Rosengren on June 17, he wrote: “In light of the attacks on the cultural heritage of France, the United Kingdom, Italy and Germany, and the attacks on freedom of the arts in general, the city of Essen, Germany, where the Montblanc", "The next Biennial should take place in the fall of 2020. If this is the case, the 2019 edition would have been completed by March 2022. “The Art of Normal Life,” an exhibition curated by the San Francisco Museum of Modern Art, was the first to offer insights into how to live a normal life through art,” the Biennial said in a statement. \n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Jen Gunter as its next chief curator of modern and contemporary art. She will be responsible for managing the museum’s collections, exhibitions, and education programs, which include programming for the museum’s school of painting, and is expected to begin in November.“Jen has shown exceptional leadership in developing and maintaining the museum’s collection through a series of transformative initiatives, including spearheading the acquisition of a new work by the artist Hélio Oiticica, which arrived at the museum from the DeSoto Collection, and expanding our digital presence through commissioned works by artists including Tim Minchin, Lisa Lovenberg, and Tobias Madison,” said director Daniel H. Weiss. “In addition, she has been instrumental in broadening the museum’s", "The next Biennial should take place in 2022. The institution will be given eight years to prepare for the event, and will be given the option of staging the event again in 2021. The restoration project is ambitious, encompassing both the building of the museum and the preservation of the collection. The Biennial of the Americas, organized by the artist-run International Center for the Visual Arts (ICAVA) in Santa Fe, New Mexico, also received an additional four years from the artist-run institution. The showpiece of the project is the eighty-year-old building, which is now home to the Mexico City Museum of Art, the Caracas Museum of Art, and the Los Angeles County Museum of Art (LACMA). The artist-run institution, which is currently being transformed into a cultural hub, is widely regarded as one of the world's great cultural institutions, and its collection comprises some of the most important works by Pablo Picasso, Jean-Michel Basquiat, Robert Irwin, and Pierre-Auguste Renoir. The Los Angeles County Museum of Art (LACMA), a former home of the Los Angeles County Museum of Art (LACMA), a former home of the Los Angeles County Museum of Art, and", "The next Biennial should be in 2021. Its first iteration will be staged at the new museum in 2022.“We are very pleased with the performance of the 2020 exhibition, “Titel: Avant-Garde” and the exhibition “NIRIN: Early Art” in 2019,“both of which were selected as the best performances in 2018,” said director Yuki Takahashi. “We would like to see the biennial return to the themes of the work and exhibition and of the exhibition, and to reflect on the biennial as a whole, through a process of preservation.”The work of Hiromasa Goto and Olu Olu, the artists whose paintings explore the process of creation in the form of a series of painted images, is currently exhibited in the form of a book in the exhibition “Ridley Scott:  Artistic Experience” (2019). In the exhibition “Montreal in Motion: ‘Ridley Scott’s Paintings,” the work of the two artists is recreated with the help of Ridley Scott’s collaborators and is released under the creative commons license CC0, allowing the public to", "The next Biennial should have a theme of health, the environment, and migration; should continue its work of reparation and reparation of the past; should celebrate the contributions of the more than 2,600 survivors of the Holocaust in the exhibition and the record of the exhibition; and finally, should include a retrospective of the work of Ernst Lubitsch, a German sculptor, whose body and works are on view until the end of June.\n\n\nThe Dresden Art Museum has appointed Markus Wolf as its next director. Wolf, who has helmed the institution since 2013, took the helm from the late Wolfgang Kallmann, who was succeeded by curator Helmut Marko as director of the Palazzo d'Arte, in July.Wolf began his tenure as director in 2012, when José María Aziz, then the director of the Museum Freienstalt, was still director of the Museum Freienstalt. He has since overseen the acquisition and renovation of the museum, which is currently being renovated by architect Frank Gehry and is expected to open in the summer of 2021.Wolf also currently serves as the director of the Museum of Modern Art in Cologne, Germany. In a statement, the museum said that he has been appointed for a two", "The next Biennial should take place at the Stedelijk Museum in Amsterdam in December 2020 and will feature around seventy artists from twenty-six countries. The ten artists chosen for the exhibition will be announced in February 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has announced that it is reopening to the public on August 27. The institution has been closed since March 13 because of Covid-19, and plans to temporarily shut down in order to allow the coronavirus to subside. Its regular August run will resume on August 24, with a price increase for museumgoers of $20.The grand opening coincides with the opening of the new museum “This Is Not a Museum,” directed by Matthew Lieberman, which features fifty works by forty-three artists. The show is curated by Nicole Ault, curatorial director of the Museum of Modern Art.\n\n\nThe Estée Lauder Companies (EL) and L Brands, the global cosmetics and beauty giant that has controlled the women’s fashion industry for more than forty years, have agreed to merge. The merger will create a new $2.3 billion business that will include the cosmetics and beauty industry’s largest and most prestigious awards. The announcement marks", "The next Biennial should be a celebration of the creative process, the artist and the world, and I am eager to see what will be on display.”\n\n\nThe FremantleMedia Group (FMG), a media and publishing company based in Brisbane, Australia, has announced it is terminating its relationship with the embattled Australian Competition and Consumer Commission (ACCC), following a series of regulatory breaches that have seen the site shuttered. The company’s relationship with the commission, which was set up by the former Labor government in an attempt to rein in the lucrative international arms trade, began with a demand that it “implement a range of significant actions to protect consumers’ interests” in a report commissioned by the newspaper publisher in December 2015. The report, “Restoring a Competitive Edge: A Strategy for Digital Competition and Consumer Protection” and the public consultation that followed called for action to “encourage a more competitive and effective marketplace for Australian publications, and support the development of a digital library of Australian art.”An open letter from the company’s former executives, dated April 3, outlines the company’s concerns with the report and the recommendations in it, which it says have led to the commission concluding that", "The next Biennial should celebrate the work of the ever-expanding body of Spanish modernism, which often embraces and rejects linear narratives. The 2019 edition will take place at the Museo de Arte Contemporáneo, Madrid; the museum was founded by José Luis García Vidí and Casenaria Cervetto in 1966. The sixth edition of the Exhibition of Modern Art in Los Angeles will present work by thirty-six artists in 2020. “A great many of the institutions that we want to see in the future are now on the chopping block,” Pablo Picasso said of the fifty-three institutions in his Final Proposal for the Exhibition of Modern Art, signed in the form of a letter in 1949, in a Artforum issue dated February 2019.  Since its inception in 1958, the biennial has organized more than seventy exhibitions and has drawn more than six million visitors.\n\n\nThe Danish artist Lars Behnke, whose surreal sculptures combine cinema, film noir, and animation, has died at age eighty-three. “Lars Behnke: Films,” an exhibition organized by the Danish Institute of Film Studies in Copenhagen, opened at the Museum of", "The next Biennial should be held in 2021. The Art Newspaper reports that, after an open call for proposals, the jury comprising artist Arnoud, curator Domenico Cattelan, and curators Filippo Cipolletta and Tania Bruguera, chose the forty-nine-minute video installation Artforum: Promises I Can't Keep. The short film unfolds in a series of interrelated narratives, one of which follows two characters as they travel through an urban environment.The International Council of Museums (ICA), an international nonprofit organization, is also preparing to welcome visitors to its new headquarters in Rome in 2021. The ICA’s board of directors, which comprises ten to forty artists, has announced that it will allocate $6.9 million of its $10 million capital budget to the project, which will begin in 2021 and run for twelve years. The announcement follows numerous design exhibitions that have been staged in various locations around Rome, including the Ettore del Castello in Turin and the Via di Rivoli, which will be inaugurated by the exhibition “Rome: Works,” which will be joined by a public performance and a symposium. The curators are calling for", "The next Biennial should be organized in the city next spring, in the spring of 2020. The museum does not expect the construction of an exhibition space in the new building to begin until the first quarter of 2021.“I’m delighted that the new Biennial will be a vehicle for organizing and displaying the work of around thirty artists, including László Fálì, Ron Gorchov, Péter Færdes, Henrik Ibsen, Øystell Sjögren, and Mikael Sjögren, as well as for holding a series of exhibitions and residencies,” said Bjorn Borg, the director of the Museum of Contemporary Art Stockholm. Commenting on the exhibition, Bjorn Borg said: “The new exhibition will be a hybrid between a festival and a public art project, a collaboration between artists and the public, and we will continue to evolve the exhibition with a view to presenting the next exhibition in 2020.”\n\n\nThe American painter Peter Frankenthaler, who inspired countless others to experiment with painting and sound, died on Monday at age eighty-eight. He was born in New York City and moved to the small town of Bethlehem, Pennsylvania,", "The next Biennial should aim to include projects with an international feel and a scientific approach to art history. It should be particularly relevant to the South Asian diaspora, which has historically been marginalized by the museum’s curatorial team.” \n\n\nThe Museum of Fine Arts (MMFA) in Houston, Texas, has announced its representation of the pioneering American artist and activist Elizabeth Cady Stanton. Born in New York City in 1941, Stanton grew up in Texas, studied at the University of North Texas, and eventually relocated to her childhood home in Dallas. She founded and served as the chair of the Department of Arts at the Museum of Fine Arts from 1965 to 1972 and created a series of sculptures, murals, and installations that are celebrated in the museum’s collection.“Cady Stanton is an important painter whose work has challenged the boundaries of modern craft, undermining the representations of the sublime in art and artmaking,” said museum director Rachel LeCompte. “Her work is foundational and inspires us to reflect on the ways our world is constituted.”Stanton’s work is currently included in the museum’s “Shining Gates” series, an exhibition of early work that opened", "The next Biennial should be held in 2021, and one of the most important themes will be the human body. The next will be a collection of works that address issues of health, wellness, and social justice.\n\nThe Mullican Gallery in London released the full list of the thirty-one artists who will be featured in this year’s iteration of the London Biennial, which will take place at the Royal Festival Hall from September 13 to September 17. Titled “New Art and Body: Exhibitions Since 1960” and curated by Haroon Mirza, the ninth edition of the event will highlight work by thirty-six artists, including Andrew Higgs, Ana Mendieta, Arsht Farsi, Sabrina Schor, Suzanne Somers, and Ulrike von Grunewald.“We are delighted that the artists featured in the new London exhibition will join us in the Royal Festival Hall for this year’s event,” said Haroon Mirza. “We have renowned curators in the group of Dreyfuss, Ben Chery, Ava Gardner, Catherine Sturtz, and Amanda Stroud, and the list is long. We are honored to be able to present them", "The next Biennial should take place in the spring of 2020 and will be preceded by a biennial in the autumn. The exhibition will begin with a special exhibition focusing on the history of contemporary art and will conclude with a talk by a different artist.“Art was at the heart of the movement,” said Ella FitzGerald, who is currently curating the seventeenth edition of the biennial. “The next iteration will allow us to continue to move in a unified way, exploring the history of modern and contemporary art through the lens of the surreal.”\n\n\nThe Metropolitan Museum of Art in New York has appointed Elizabeth Alexander as its new executive director. Alexander comes to the institution from the Museum of Modern Art (MoMA), where she has served as deputy director since 2018. She succeeds Judith Allen, who departed in the spring of 2019 to head the Museum of Modern Art in New York, and will take up the post on July 1.“Elizabeth is a seasoned leader who has been instrumental in bringing the Met’s exhibitions, programs, and fundraising to unprecedented heights,” said Peter Gartenfeld, the institution’s interim director. “Her leadership and track record in meeting challenges and delivering results speak to", "The next Biennial should open in 2020.  The museum has also been working to attract more visitors to the museum with its new interactive experiences, which include the creation of a biennial on the history of the American novel, the first being the biennial on the art of going to the movies. The institution has also been working to add more rooms to its existing collection by adding new works. Museum director Jason Schwartzman told the New York Times that the museum would like to see its collection expand to include more works by artists of African descent, as well as more works by women and people of color.\n\n\nIn a landmark ruling published yesterday, the European Court of Human Rights declared the arrest of artist Nino Ferrari, who was held at the Milan Art Museum for six weeks last month, illegal. The verdict means that authorities have to pay €62,000 ($68,000) to the collections of the Milanese artist. The case concerns a temporary detention order issued by the country’s Federal Office for the Protection of Democracy and Justice (Bic), which detained Ferrari for two weeks in February 2019 for “obstructing the work of a public official,” a crime that can carry a maximum sentence of two years in prison.", "The next Biennial should be held in 2020, with the first exhibition scheduled to open in 2021. The festival will also host a reopening exhibition in November 2020.\n\n\nThe New Art Dealers Alliance (NADA), a New York–based coalition of arts workers, artists, and collectors who are fighting for increased benefits in the face of rising health care costs, has released the results of its first survey of the 2017 New York Creative Artists Biennial, titled The Artist’s Revolution: How the Arts Worked to Save Lives, and What We Can Do About It. Led by NADA president and CEO Daniel H. Weiss, who serves as the founder of the New York–based nonprofit Market Basket, the survey surveyed more than one hundred New York–based artists who were affiliated with or represented the Brooklyn-based nonprofit Make-a-Wish. The findings, which were compiled by Weiss and biennial curator Kiki Smith, constitute the foundation of NADA’s proposal for a two-year biennial that will take New York City’s art, culture, and design industries through a series of exhibitions, residencies, and fundraising events.In its second proposal, which was published last week,", "The next Biennial should aim to re-examine the meaning of the term 'new art', and we believe that the best way to do this is through a critical examination of the ways in which new art is made and presented. We believe that this will be a catalyst for a new dialogue about the art of the twenty-first century.”The year 2020 will mark the twentieth anniversary of the opening of the museum, which opened in Künstlerhaus b.c. 1867 in Berlin and was converted into a modern art museum by the Renaissance architect Friedrich Schlegel. The museum now boasts an area of 1.2 million square feet and will be inaugurated by an exhibition of work by the artist-activists Zürich Triennale.\n\n\nThe National Gallery in London has hired Paul Mpagi Sepuya, a British-based independent curator, as its next director. He succeeds Rinella de Angelis, who departed the institution in March 2019 to head the free-to-art space the Portico, and will begin his position in July. “Paul has won numerous awards and has been a champion of art for more than thirty years,” said museum director Hamish Hamilton. “He", "The next Biennial should be held in the fall of 2022, and the first show in the spring of 2023.\n\n\nThe Royal Academy of Arts (RA) in London has appointed Anne Bonham as its next president and CEO. The 47-year-old, who has served as president of the academy since 2015, succeeds David H. Lammy, who departed after six months following a controversy over a painting by the artist Thomas Heatherwick that was on display in the exhibition “For Love” at the institution last year. The museum is currently closed for a period of sixty days as it implements a major renovation to its grounds.Following a public inquiry, Bonham was found to have acted appropriately by the museum and has been given a mandate to run the RA for a period of eighteen months. Bonham’s term is to begin in May.“We are looking forward to working with Anne and having her leading our artists, our staff and our community,” said Matthew Price, director of the RA. “We believe her leadership qualities, business acumen and vision for the RA and the museum make her the ideal person to lead the RA in the future.”\n\n\nThe Museum of Modern Art (MoMA", "The next Biennial should take place in September 2020, to be held in Tanger, Norway, and will initially focus on the exhibition of work by a selection of seventy-two artists and their famous collaborators. The event will conclude with an extensive reception featuring performances, readings, and presentations by seventy-five artists and their collaborators, and will be hosted at Biennale Centro de Artes Plásticas in Madrid.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Sean O. Herndon as its next director and chief curator. Herndon will lead the museum through its ten-year major redesign project in partnership with the local and state government of Boston, which began this fall. Its full design and reinstallation schedule is as follows:Oct. 28–Nov. 1: The Greenpoint Museum of Art, Brooklyn, NYOct. 29–Nov. 4: The Museum of Contemporary Art, ChicagoOct. 11–Nov. 14: The Museum of Contemporary Art, New YorkOct. 21–Nov. 24: The Prudential Center, New YorkOct. 27–Oct. 29: The Museum of Contemporary Art, New YorkOct. 31–Nov. 7: The William J. Donovan Building,", "The next Biennial should be on January 21, 2020. “It is important for us to work with the institution to ensure a good presentation of the latest work in the latest exhibition and to serve as a reference point for exhibitions that are not focused on contemporary artistic practice,” said Basma Alsheikh, chair of the Art Council and the board of directors of ALDI. “The new exhibition series should reflect the current trajectory of contemporary art. It should use the theme of the Biennale to investigate the various strands of contemporary art and offer a way out for our curators to engage with the biennial to analyze and present the most important works of contemporary art at the Biennale.”\n\n\nThe Royal Academy of Arts (RA) in London announced today that the first installation of new work by designer Isamu Noguchi will open at the institution in 2020. The show, titled Noguchi in a Box, will be on view until December 28, 2020.The installation, which was made in collaboration with the London-based artist and curator Louise Newson, will be held in the gallery’s recently renovated garden. Noguchi, who has exhibited his works internationally since the 1970s, is one", "The next Biennial should take place in the spring of 2021.\n\nThe Knight Foundation has appointed Simon Baron as the next chair of its board. Baron has served as director of the New Art Museum in London since 2013 and has overseen the museum’s fundraising, development, and maintenance activities since 2015. “Simon Baron is a formidable and highly successful curator, and has created innumerable fantastic events, both in his home city and worldwide, for the museum,” said Bradley Piper, the foundation’s president and CEO. “He is an avid collector and has built up a dedicated following as a curator for whom the Arts and Heritage Foundation is grateful for his dedication and warmth and his ability to inspire.”Baron’s first major project will be “The Great Rembrandt Project,” which will measure the trajectory of the artist’s work from one of his paintings to a digital work, inspired by the artist’s famous notebook, and will launch in 2020. The digital work, called ‘The Man with the Golden Pen,’ will be presented by the Kunsthalle Basel in collaboration with the Kitina Institute for the Arts and the Museum Trieste in Genoa.", "The next Biennial should be held in 2021. \n\n\nThe Pérez Art Museum Miami (PAMM) has welcomed Colm Bond to its collection. The museum’s director and CEO, Jose Luis Araya, stated that the institution welcomes Bond to the collection. “Bond’s work is a new and important chapter in the Pérez’s collection history, and we’re excited to host him and his expressive style at the Pérez,” Araya said. The institution has also introduced new programs to further foster the museum’s collection. The exhibition “Pillar of the Arts” is now on view at the Pérez, and the institution will stage a biennial of works by Pablo Picasso, Jacques-Henri Léger, Nude with Black Eyes, and Maurice Barozzi in the spring of 2021.In addition to celebrating the museum’s one-hundredth anniversary, PAMM also announced that it has expanded its collection by 12,000 works and has added more than 3,000 works to its collection. The museum will present three new exhibitions this fall. The first is “Pursuit of Art: The Collection", "The next Biennial should be held in 2022.\n\n\nFrance’s culture ministry has released a long-awaited schedule for the 2020 edition of the Cannes Film Festival. Titled “Cannes 2016,” the document will feature 153 films, including four new entries which are scheduled to hit France’s six national film festivals, beginning on May 9. The exhibition will take place in the city of Cannes, France’s sixth largest, which hosts the event every year. The dates for the event’s twenty-fifth edition, which will be held in 2022, are also set to be unveiled.“We are delighted to be able to announce the twenty-fifth edition of Cannes with such confidence and freedom,” said Brigitte Zico, the minister of culture. “We know we need to present a strong show for Cannes, for Cannes Mobile, and for Cannes Mobile’s audience. And the new dates and the new platforms are ideal for Cannes, for Cannes Mobile, and for Cannes Mobile.”According to Le Figaro, the festival will be “staged on the same site as last year’s event, except that this year’s edition is being staged at a", "The next Biennial should take place in 2020 and will be curated by two of the greatest contemporary artists of the twentieth century, Hans-Ulrich Obrist and Ellsworth Kelly. As a result, the dates of the exhibition have been moved to February 27 and March 17. Literature Partner: In the Concert Hall, London. Art Partner: The Incentive Fund, London and Hong Kong. Awards: Artists Prize, Artforum Awards, Artforum New York, Artforum New York, August 2019. The Boar and the Bird, London. The Buffalo, London. Veterans’ Opinions: The exhibition is an extension of the work of the American Art Museum (AAM), New York. In 1972, the American Museum of Natural History (A.M.S.) in New York commissioned Sylvia Morrow’s German Expressionist’s The Tuskegee Sykes Experience, which was staged at the A.M.S. in New York prior to its move to the A.M.S. in Philadelphia. The show’s opening in 1974, the year after the experiment with the elephant, led to much controversy. In", "The next Biennial should be held in 2022. The 2016 event, “The Inevitable,” marked the 100th anniversary of the Biennial, and marked the first time the event was held in the United States.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Michaela Margolis as its interim director. She succeeds Mary C. Hylton as director of the museum in November.“The board of directors has decided to appoint Michaela as the next director of the MFA,” said board president Colin Campbell. “I’m thrilled that this is the case and look forward to working with her to further the vision and excellence of the MFA.”A specialist in early twentieth-century American art, Margolis was hired to lead the museum in January 2019. She has served as interim director of the museum since March 2019, and has been an assistant curator since July. During her tenure, she curated the exhibition “The Anatomy of a Cultures,” which premiered in January and drew nearly four hundred participants, and curated “The Color of Life,” an exhibition that included works by African American artists such as Billy Brown, Charles Drew, and Rosal", "The next Biennial should take place in 2022.\n\n\nArt-lovers across the globe are mourning the sudden passing of American artist Erma Bombeck. The eighty-four-year-old died in her home in Brooklyn on December 7 after a long and courageous illness that has afflicted her and her family for more than a decade.Born and raised in New York City, Bombeck studied at the School of the Art Institute of Chicago, the Art of Arts, and Harvard University. In the late '50s she relocated to Los Angeles to pursue a career as an artist-producer, but the city soon became too much to handle, and she settled down in New Jersey. She continued her art-making and her musical endeavors in the early 2000s, but she stopped producing work in 2008, when she was eighty-five years old.Her work has been collected by a number of major museums, including the Museum of Modern Art and the Metropolitan Museum of Art, and she is regarded as one of the earliest practitioners of avant-garde American art, having worked with Dave Hullfish and Alfred Stieglitz, among others, in the late '50s and early '60s. She has had solo exhibitions at the Whitney Museum of American Art", "The next Biennial should embrace the themes of the past year and the city’s hardscrabble past as well as build upon the City’s long-standing commitment to the arts.”\n\n\nThe National Endowment for the Arts (NEA) has released the list of the seventy-three artists who will receive a $500,000 grant in support of the 2020–21 fiscal year. The grantees are arranged in descending order of their artistic achievement and are:HELEN HARVEY (New York) (2013–14) (2014)Salman Khan (New York) (2017)George Pérez (New York) (2017)Michelangelo Antonioni (New York) (2017)Wangechi Mutu (New York) (2017)David Mitchell (New York) (2018)Alfred Koons (New York) (2018)Nina Turner (New York) (2018)Yale Horseshoe (New York) (2018)Timur J. Robbins (New York) (2018)Sarah Sze (New York) (2018)Germaine de Villiers (New York) (2018", "The next Biennial should be held in 2021, with the long-awaited premiere in 2022. The 2019 edition, titled Briana, was hosted by Honda in Rome and curated by João Goulão. The biennial was cofounded by the renowned Brazilian architect Hélio Oiticica, whose designs have been exhibited in various international exhibitions including the Venice Biennale and the Museum Freier Kunst-Münster.\n\n\nThe National Galleries of Scotland (NGA) has appointed John McAllister as the new director. In his new role, which is three years in length, McAllister will assume the helm from Jenny Hill, who has led the institution for almost twenty years. McAllister will assume the helm from former director Peter Sutherland, who has led the NGA for thirty-six years. He succeeds Natalie Desmarais, who has served as NGA’s director since 2009, when it relocated to a new home in the National Museum in Edinburgh.“Peter has consistently demonstrated a deep and longstanding commitment to the arts and its collection over the past twelve years, and I’m confident that he will continue to deliver the NGA’s", "The next Biennial should take place in the city in 2023. In a letter addressed to the organizers of the event, Dara Al-Hadid, director of the Watershed, said: “We are excited that the city’s Arts Council has recognized our role as a vital and necessary resource for the many communities that we serve. We look forward to working with the city’s staff and the public to further strengthen the Watershed’s role as a cultural hub and a platform for the city’s creative and academic communities.”\n\n\nThe Toronto-based Canadian artist and educator, who has taught at several of the country’s major universities, and whose work draws from the Black Lives Matter movement and feminist movements in addition to her own experiences as a Black trans* and queer person, has died at age eighty-nine.Born in Toronto in 1947, Al-Hadid studied at the University of Toronto, at the University of Manitoba, and at the University of Toronto, at which she continued her art-making studies. She had written about the environmental crises facing the planet in her previous books, The Watermelon Society: An Environmental History (University of Toronto Press, 1999) and Black Julie:", "The next Biennial should be held at least once a year, with the possibility of a biennial being staged as needed. The exhibition should continue to be hosted by the Biennials at the Palace Art and the Palazzo della Scala in Venice, which was damaged by a devastating fire in 2017, and will continue to be organised by LACMA in collaboration with the Venice Architecture Biennials.\n\n\nThe Los Angeles County Museum of Art (LACMA) is planning to spend $4 million to $6 million to preserve and restore the former Cathedral of the Nativity in Los Angeles. The cathedral, which has been the site of several major public works projects, including the renovation of the former City Hall in 2009 and the rebuilding of the cathedral in 2015, underwent a $500 million expansion and renovation in 2017.The renovation of the cathedral will involve the removal of the Nativity scene and the installation of a new work by contemporary artists such as Alexander Kahane, David Kordansky, and Olga Olins. LACMA is also expected to reopen the cathedral in the summer of 2020. In a statement, LACMA said: “The renovations to the cathedral were not without expense but, over the course of this decade, LAC", "The next Biennial should be cancelled and the ten-month program should be replaced by a yearlong program that consists of a series of exhibitions that engage in a year-long residency residency program in a selected location.      While the ongoing work of artist-run spaces and the biennial are important and essential, we believe that a new model that focuses on the visual arts and social justice needs to be developed. The exhibition ’s legacy cannot be established on an exhibition about ’s participation in a riot.”The exhibition ’s biennial’s double-feature “Roots of Rage: Uprising,” released in November 2019, did not include the work of the participants. The exhibition was organized as part of the \"Roots of Resistance\" campaign and was part of a series that drew from the “Uprising” exhibition on the Black Lives Matter movement, “Uprising: The Bronx,” which was mounted at the Museum of Modern Art in New York in 2016.The work of Rindy Graham, Cara Mitchell, and Dola Scott was presented at the 2019 Biennial. Both Graham and Mitchell are Black, and Graham is the founder", "The next Biennial should take place in the spring of 2021 and will be organized in the same way as the current edition, with the addition of a new exhibition. The full list of the theme for the seventeenth edition is as follows: Art and Society - 27th edition (2019) Art and 'Sociology’s Suspended: 2017–18 Art and Society: 2017–18 Art and Society: 2016–17 Art and Society: 2016–17 Artists and States: 2016–17 Artists and States: 2011–12 Artists and States: 2010–11 Artists and States: 2006–08 Artists and States: 2006–08 Artists and States: 2006–08 Artists and States: 2016-17 Artists and States: 2014–15 Artists and States: 2013–14 Artists and States: 2014–15 Artists and States: 2009–10 Artists and States: 2008-10 Artists and States: 2009–10  Artists and States: 2007-2008  Artists and States: ", "The next Biennial should be on the UCCA campus sometime in 2020. The exhibition will focus on the possibility and the means by which biennial spaces can be regenerated to promote diverse artistic, social, and cultural practices.“What we are seeing now is a revolution in art from the very beginning,” said Catherine Throckmorton, director of the UCCA Art Museum. “First, with regard to the exhibition, which is now more than thirty years old, as I said at the launch of the exhibition, the exhibition was conceived as an experiment in experimental art, a way to start from scratch and achieve an entirely new level of impact. The exhibition has had an enormous impact on the established art world, which is deeply indebted to the biennial as an opportunity to re-create the art of the future by rethinking the subject matter.”Other major exhibitions at the museum include “Owen G and the Art of Life” (2015), which was on view from September 5 to September 9; “The Spirit of Place: Art from the UCCA” (2017), featuring work by Sarah Sze (1936–1953) and a solo exhibition by Norman Foster (1939–2011);", "The next Biennial should be held in 2020.\n\n\nArt historian Susanne Vielmetter is launching a new scholarship program at the Museum of Modern Art (MoMA) in New York that will focus on the legacy of the artist-in-residence, who has served as a museum asset since the 1980s and has been an integral part of the museum’s development.Created with the support of artist-in-residence Ronald Kessler, the museum’s 'Beyond the Cage Fellowship' will offer $100,000 to institutions interested in hosting a residency at the museum. The first iteration of the program, which will include up to six artists and will be led by curator and architecture critic Jane Panetta, is scheduled for spring 2020. It will culminate with a retrospective that will take place in March 2021 and will be led by artist-in-residence Christopher Wool.Inaugurating the program will be MoMA’s installation of the artist’s work at the institution, which will be on view until January 5, 2021. The piece will be part of an exhibition of work by fifty-two artists and will be mounted in the museum’s The Batcave, a former steelworks that opened to", "The next Biennial should, in the words of the organisers, be an 'open celebration of the work of all the artists in the exhibition, and the public.”  After a three-month campaign, the Biennial will return to the Museums in Berlin next fall.\n\n\nThe University of Illinois at Chicago (UIC) announced today that it will begin allowing visitors to its campus in Lincoln Park, the neighborhood of the university, to pay with the proceeds of the sale of works, which will be given to local arts organizations, in a move that will be in line with the university’s new $15 an hour minimum wage policy.The policy change—which will take effect in April—was announced by UIC president Barbara A. Naulke. “This is a pivotal moment for our city,” Naulke said in a statement. “It is a time when we reaffirm the values and the mission of the renovated and expanded UIC, and it is a time when we strengthen our relationships with our neighbors and the greater Chicago community.”Under the new policy, as many as five hundred works can be purchased per academic year, with the majority of proceeds going to local arts organizations. The policy also", "The next Biennial should take place at the newly established space created by the city of Barcelona, and will begin with a presentation of works by the Library of Congress and the National Museum of Contemporary Art. There will also be a performance by the Barcelona-born, New York–based artist Marcel Proust, creator of the conceptual artwork The Loft, and an open-air sculpture garden.The initiative is part of the city’s 2020 Vision Barcelona–set out to build a modern, sustainable, and affirming cityscape for Barcelona. The 2019 edition of the exhibition was held in the city of Almería, in the province of the same name. The event showcased work by more than 60 international artists.\n\n\nAmerican painter C. L. Augusten Baugh, whose work was informed by an interest in the natural world, a love of music, and a fascination with the nature of the human body, died last week at age eighty-six.Known for his vivid, close-up photochromatic paintings of naked human figures, which move between the surreal and the surrealistic, the artist also painted landscapes and other landscapes of his own imaginative making in the late 1940s and 1950s. Events that shaped his art in the decades leading up to", "The next Biennial should be held in 2022, and the design of the exhibition will be guided by the guidelines established by the Council for Contemporary Arts (CCA), which is chaired by Roslan Moulitsas, the director of the prestigious contemporary art exhibition for China, Art in China (CICA). “The exhibition will be based on the themes of the collection, the gallery, and the Palazzo delle Papesse,” writes Dario Crotti. This is the eighth year the exhibition has been staged. Last year it was relocated from Rome to the Palazzo delle Papesse, which is located near the town of Bologna, Italy. The exhibition was acclaimed for its exhibition-like setting, the exhibition “An Exhibition of Contemporary Art,” which featured work by more than sixty artists, and for its curatorial excellence. The design for the exhibition was also significantly influenced by the former cultural center, the former sprawling venue of the Palazzo di Bico di Beppo, and the former Central Library of Art of Beppo.“I always have been interested in the history of the place and its collection,” said Moulitsas, who has been involved in the redesign", "The next Biennial should also be held in 2020, and the first in 2022.  Prominent cultural figures have joined artist-activists in raising concerns about the effects of the coronavirus and the work of the already-awarded-prize-winning Charlotte Posen, whose monumental sculpture The Vervain was dedicated to the artist in March. An open letter to the festival’s creative council reads: “We are writing to express our serious concerns over the rapid spread of Covid-19, and its potential to exacerbate social, economic, and political tensions. We believe that the selection of the 2019 biennial to New York City in collaboration with Benjamin Meshell, which consciously looked to a future in which Covid-19 was contained, will be harmful to the event’s already-challenging vision of a global community to respond to climate change.”Artforum has reached out to the organizers of the 2019 Art Basel (Art7) New York fair for a statement. The fair is scheduled for March 22–March 25, 2020.\n\n\nThe National Galleries of Scotland announced today that it will no longer participate in the annual art fair ExCel, which has taken place at the National Museum", "The next Biennial should be held at least once a year. The event will be open to the public from March 21 to March 28, 2020. Each year, the museum’s curators curate a new exhibition on the theme “This Life for Other Worlds.” The theme will be chosen by the Biennial’s administrative board and will be presented to the public at a special exhibition slated to open at the museum on April 9.“I’ve been following the biennial for years and years and years and years,” museum director and CEO John MacGregor told the New York Times. “It’s gotten to the point where I’m surprised every day I go to the museum that people are still coming back. I’m sure they’re going to the Museum of Modern Art [New York], the Museum of Modern Art in New York, and the Museum of Modern Art in London.” The museum also recently celebrated its ninetieth anniversary with a special exhibition of work by ninety-nine artists.The 2017 event featured work by forty-one artists and was organized as part of the foundation’s Long Island–born, New York–based artist residency", "The next Biennial should take place in Tbilisi in December 2020.\n\n\nThe Italian architect, sculptor, and educator Gianfranco Rosi has been selected as the winner of the first edition of the Venice Architecture Biennale, which is being held at the Palazzo Prada in Venice from November 26 to December 29.Rosi, who is also a professor of the history of art at the School of the Art Institute of Chicago, will receive a total of $6 million in support of his proposal to create a new type of exhibition space for the art, architecture, and design world in the Palazzo Prada. The exhibition will draw from contemporary art and architecture to present works by artists such as Ai Weiwei and Vincent van Gogh. The institution will also be dedicated to retrospective exhibitions of work by artists that have had the exhibition featured previously, such as Alejandro Cesarco, Mirko Martinelli, Alessandro Varejão, and Riccardo Dallulli. The program was inaugurated with the exhibition of work by Anton Kern, whose body of work includes pieces such as the 3-D sculptures Temptations (2011) and Paintings (2015).This year�", "The next Biennial should take place in the spring of 2020 and will be open to the public. The theme will be “CULTURE AND LIFE,” an allusion to a recent issue of Artforum titled “ACE AND LIFE”\u0097a celebration of the thirty-fifth edition of the Venice Biennale.The theme will be a continuation of the theme of the recent exhibition “BODY & FORM,” which opened at the Venice Biennale on October 1\u0097which was originally staged at the Museum of Modern Art in New York. The new exhibition will feature seven new works, all of which were created by the artist's family and will be presented in a series of presentations of “gendered imagery,” which will be followed by a reopening of the museum\u0097which will reopen in the spring of 2021\u0097in the summer of 2020.The 2019 edition of the biennial, “Tacita Dean: The Shadow of the Body,” showcased the work of eighty-one artists and featured the work of more than 160 artists. The exhibition was attended by sixty-four curators and featured the work of fourteen artists. The exhibition was also the first on the newly reopened site", "The next Biennial should be held in 2020.  \n\n\nMore than 1,500 scholars and arts professionals are calling for the United Kingdom to suspend its general election schedule and return the spotlight to the arts and cultural sector, which has been the mainstay of the Brexit vote. “The political crisis has already had an impact: the number of people working in the arts and cultural sector is projected to fall by 2.1 percent in the year 2020, and the UK is projected to lose an additional £2.9 billion to the impact of the Covid-19 virus, as many as 142,000 jobs are at risk, and the government’s flagship arts and creativity plan, the London Declaration, is already having an impact,” reads a statement from the signatories. “We call on the government to cease all disruption to the creative and cultural economy, and focus on delivering long-term economic recovery to the UK’s creative and cultural sector workers. We call on the government to deliver on its promise to return the arts and cultural sector to balance the budget for the common good and to invest in the sector. We call on the government to reverse the hard Brexit–backpedaling and invest in the UK’s creative and", "The next Biennial should take place at the UCLA Solomon R. Guggenheim Museum in New York City, and the exhibition should premiere in the spring of 2021. The 2020 edition, “Theater of Operations: The Gulf Wars” has been expanded to include the reconstruction of the consequences of the civil wars in Iraq and Syria.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it will take the first steps towards reopening the Metropolitan Museum of Art, which recently announced it will close permanently in 2022 due to the ongoing economic crisis in the region. The institution became the latest major cultural institution to announce plans to shutter permanently in the wake of the pandemic. The announcement follows a series of actions by NYC’s cultural businesses, including the Metropolitan Museum of Art, the Whitney Museum of American Art, and the Brooklyn Museum, as well as by city council members, including Kristin Comer, Jimmy Van Bramer, Jimmy Van Bramer Jr., Jimmy Van Bramer’s son, and David Yurcich, to promote the reopening of the city’s cultural sector.According to the New York Times, the Metropolitan Museum of Art is planning to reopen in early 2020 following a $1 billion", "The next Biennial should be held in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York is expanding its partnership with K12, the world-renowned American preschool designed by the DuPont family, and is constructing a new eight-acre educational center. The initiative is part of a comprehensive redevelopment plan for the institution unveiled in 2017, which included the construction of a new building and playground, the renovation of the school’s campus, the expansion of its museum hours, and the addition of new exhibitions, events, and public spaces. The $1.2 billion renovation will also include the addition of a new courtyard and landscaping project that will ultimately draw 20,000 visitors annually.K12 began designing the new $8,000-per-week K12 Academy in 2012. The institution opened the facility in 2019, and the K12 Academy won the $85 million People’s Choice Award in 2019. The new project will also include the construction of a new visitor experience, and will feature more than 1,000 classrooms, a film library, a performance studio, and a community center.The two institutions will collaborate once again in 2020, and MoMA will construct a new pavilion and amphitheater that will sit adjacent", "The next Biennial should be held in 2020. “The Mediterranean region is facing a crisis of climate change,” said Flutu, who will direct the Exhibition of Contemporary Art in the City of Venice from March 2021 until December 2022. “Its climate is changing, and its climate inhabitants are adapting. We are witnessing more extreme weather events and floods, and altering the climate of our oceans. It is not only an ecological but also a political issue.”In response to the upcoming event, the Venice Architecture Biennale Foundation issued the following statement: The biennial will be reaching its conclusion in December 2021. Benedicta is planning to extend this year’s exhibition and to continue its work in other ways. The foundation and the artist are cooperating with various international organizations and institutions to ensure the exhibition can be hosted in future years. The Venice Architecture Biennale Foundation is grateful to the artist for her extraordinary and outstanding contribution to the art and architecture of Venice, and for her cooperation in the Biennial.\n\n\nThe Beverly Hills Museum of Art (BHMA) has received a $1.5 million donation from the Los Angeles–based, Los Angeles–based arts philanthropist Pamela Crawford. In a gift that will enable the", "The next Biennial should take place in 2020 and will feature the full range of work from the newly established partnership between the museum and the Los Angeles County Museum of Art.The partnership’s first exhibition, “The Unseen,” will open at the museum in March 2020. In its second exhibition, “The House,” the show will begin in May 2020 and will showcase the work of those who have chosen to remain anonymous. The first Modernist Constructive-Works exhibition in Costa Mesa will open in September 2020.The newly established partnership will feature some thirty-one works by artists who have been nominated for the 2020 Pulitzer Prize, including John Akomfrah, Joseph Beuys, Tanya Galinauskas, Greg Fischer, Michael Haus, Marion Applegate, and Harriet Moulton. The biennial will premiere at the LA County Museum of Art in May 2020 and will be followed by the 2020 edition of the Booker Prize.Commenting on the partnership, Michael L. Haer, artistic director of the LA County Museum of Art and the 2010 recipient of the Pulitzer, said: “We know that Los Angeles County is a leading contemporary art destination and we are excited to partner with the CA Museum of Art and", "The next Biennial should take place in 2020.\n\n\nHannah Dorschel, the director of the Bénédicte de Montaigne, in Paris, is seeking the resignation of the museum’s director, Régis Caland, who was recently promoted to the role of director of the Fondazione Prada. During his tenure, which ran from March 2019 to March 2021, the museum underwent major renovations, relocated the works of two hundred artists, and inaugurated a new exhibition space. During his tenure, the institution also published works by fifteen multinational artists, including Damien Hirst, Pierre-Auguste Renoir, and Jorrit van de Wijngaard.“A great success of the program has been the growth of the number of artists represented in the collection, and this has been achieved in large measure through the appointment of new members, since the Fondazione Prada is a museum of the contemporary and has always privileged the exploration of the most recent developments in art,” said director Anna-Sophie Lenoir. “The board of directors expresses its gratitude to the board of directors for their cooperation in the design and implementation of the program and will be pleased to hear from any", "The next Biennial should take place in November 2020, and the date for the 2020 event will be announced at a later date. “The digital era has brought with it new challenges and opportunities, and it is essential for the art of photography to adapt to these,” said Tomkins. “As you undertake your work, you will find that it is a joy to be at the forefront of technological progress and innovation and to be able to create with the latest in technology.” The art of photography fellowship program is one of many initiatives that support the work of photographers in the United Kingdom. The European Press Photo Awards, which honors emerging and established photographers in Europe, will be awarded this month.\n\n\nThe Toronto Art Gallery (TAG) has released the list of twenty-three artists who will receive a retrospective at the institution in the fall of 2020. Among the artists chosen for the exhibition, which will be curated by Agustín Baraya, are Mario Gregotti, Chiara Meneguzzo, and Stefan Léger, as well as Franz Klima, Tin Raja, and Yoshitaka Masuda. The twenty-four artists who were invited to participate in the show are", "The next Biennial should be up by March 2021, and the first by September 2021. This exhibition will be dedicated to the work of the biennial’s design by the artist SÜlǐlm Çelik. The architecture of the exhibition should be inspired by the exhibition’s theme, “Design and Architecture,” which is grounded in the themes of the century. The exhibition’s director, Alexander Funtchev, commented: “We were inspired by the work of the artists who have lived their lives in a certain way: from rural backgrounds, from the urban spaces. We try to present their work in a way that can be meaningful to the spectators. We want to give them a sense of place in the exhibition.”\n\n\nThe Turner Prize, which honors American artists in the twentieth century, has announced that the 2019 iteration will be staged at the Palazzo San Marco in Venice. The biennial will feature twenty-five works by artists whose work is currently on display at the institution—including Lauren Cohan, Robert Irwin, Raymond Boisjoly, Justin Hurwitz, and Jon Pertin—as well as a selection of works that are a part of the �", "The next Biennial should include the exhibition “The Robots of Death: The Digital Revolution,” an exhibition that will feature the work of fifteen artists, including Ivan Serpa, Stephen Hawking, and Anish Kapoor, and will be organized as a “table of contents” that will be followed by a “planetarium of the mind.”\n\n\nThe 2017 Whitney Biennial in Los Angeles, which was canceled in March due to the Covid-19 pandemic, has announced that it will reschedule the event in March of 2020. The announcement comes on the heels of the announcement that it will push back the twenty-fifth edition of the biennial by a month. “We are thrilled with the trajectory that the series has taken and are confident that the March date will bring plenty of excitement and surprise,” said biennial director Joa Hickman. “We look forward to presenting our biennial in March of 2020, as always featuring the work of the extraordinary and inspiring artists whose work embodies a moment of transformation and moment of wonders.”In addition to the economic downturn, the biennial and its sponsors have been facing financial trouble. The Whitney has announced that it is currently in the process of restructuring its", "The next Biennial should be held at the Varanasi Art Gallery in December 2020.\n\nAfter the completion of the exhibition, a new artist-led project titled the “Siddharth Diwas” will present an exhibition of the sculpture works by the artist in a “historical moment.”\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Kathryn Hwang as its new deputy director. She will be responsible for coordinating the museum’s curatorial, research, and programming, and will come to the institution from the Metropolitan Museum of Art, where she has worked as a deputy curator since 2015.“Kathryn has been instrumental in shaping the Museum of Modern Art’s curatorial and research priorities since her arrival in 2007, and has added a new dimension to the work of the museum’s art collection, exhibitions, and programs,” said museum director Daniel H. Weiss. “Her work will help us continue to expand and shape the Museum’s collection, exhibitions, and programs in a way that reflects the ongoing vision of John Ashbery and David Kovic.”While at MoCA, Hwang developed the MFA’s first program focused", "The next Biennial should be held in September 2020.The first Biennial, hosted by the National Museum of Contemporary Art in Berlin, was held in June 2019. Presented by the German government and curated by the German artist Markus Lüpertz, 'Anarchists ‘ Prejudice’s Art: German Art of the 1930s’s” was the opening prize at the 2019 edition.\n\n\nThe National Gallery in London has released a set of guidelines for the proper care and use of works by Edward Hopper\u0097a key figure in the development of abstraction and the radical social and political theory of art that shapes the contemporary art landscape\u0097in an effort to raise awareness of the risks posed by the potentially addictive drug Ecstasy.The guidelines, which were first published by Artforum and were inspired by the high-profile overdose death of British artist Paul McCartney in 2010, urge museums to 'use common sense and good judgement,” and urge visitors to “read carefully and act sensibly.” According to the New York Times, the guidelines were developed through conversations with experts, including academics, health professionals, and pharmacists. In an attempt to address the concerns of experts, the guidelines’ author, Professor Clare", "The next Biennial should be in 2022. Adnan Manu, the director of the Museo de Arte Contemporáneo in Lisbon, who was appointed in the new entity in order to better promote the work of the institution, said: “The new contract will become the platform for the programme to become a global story, centering on the human story, in various ways.” He added that the biennial will be “part of a long-term strategic plan for the museum. It is a process, a roadmap, a means of rethinking the museum’s history. We are still in the beginning stages and there is much that needs to be done before we reach the international space. We are very much looking forward to the next one,” Manu said.\n\n\nArtist-run organizations and artists’ collective installations such as Disposable Worlds, which creates works incorporating objects such as glass, wood, and paper, and workshops that address issues of location, energy, and memory, are being targeted by a new coalition of arts and cultural workers led by a group of artists and filmmakers known as Artists United—a coalition of five New York–based artists: Mavis Staples, Andrea Giunta", "The next Biennial should focus on the work of women artists from Central and South America, including Anthema Paz, Céline Ait-Solà, Sérgio Parra, and Monica Trigosa, and should include a selection of the work of African artists. \n\n\nThe Redfern Art Gallery in Melbourne has been acquired by the Chinese government-backed Chinese state-run enterprise CCCC Group, which announced plans to build a $500 million museum in the city in February 2019. The proposed venue, which will overlook the mainland and is slated to open in 2022, is part of a massive expansion of the capital city’s cultural complex, which is currently being funded by the Chinese government, Western universities, and private donors.“We are thrilled by the news of this acquisition and its potential to make a real difference to the Redfern Art Gallery and the broader Melbourne community,” said Alex Hawkes, the Redfern Art Gallery’s director. “This acquisition offers a unique and exciting opportunity to build upon the success of the CCCC-designed Redfern Art Gallery, which has been hailed as a groundbreaking design and innovation project by the premier architectural and design magazines.”CCC", "The next Biennial should take place in 2020.\n\nThe National Gallery of Art in Washington, DC, has temporarily closed its doors as of Tuesday, March 23, due to concerns about Covid-19. The museum, which has had a limited presence of the virus in the area for more than a year, said in a statement that it is working with the Centers for Disease Control and Prevention (CDC) on a plan to reopen in early to mid-May. The institution has also been working with local, state, and federal health officials to determine the best way to distribute the novel coronavirus.Following a week of social distancing and precautionary measures, the museum reopened on Friday, March 27, with a public viewing room filled with works by fifty artists. The Biennial of American Painting, a five-day, free event, ran March 19 to March 21. The show featured work by fifty artists, including Frank Gehry, Robert Irwin, Glenn Ligon, and Roger Crisp, among others from New York, Los Angeles, and New Jersey.The National Gallery of Art’s director, Tonya Brown, said: “The risk of Covid-19 is real, but it’s not life-threatening.", "The next Biennial should take place in the year 2020. The biennial will be held in the city’s old Museum of Fine Arts building, at 523 West Twenty-Sixth Street. The biennial will include exhibitions and events that will be organized in such a way as to be accessible to all.\n\n\nThe Met, which has been closed since October 31, 2019, has released a set of guidelines for how it should curb violence against women and children. The guidelines were released by the museum in conjunction with a three-part public art campaign that asked seven thousand people to display a “gender balance” sign during a demonstration in front of the museum on Wednesday, October 28.The campaign was inspired by a similar one held in New York City on December 17, 2019, and was led by the group P.A.I.N. (Prescription Addiction Intervention Now). The twenty-six-hour event drew an estimated one hundred participants. The Met’s guidelines for the engagement with the public are as follows:1) “Show a balance between the two genders.”2) “Show a mix of both genders represented in a sensitive and delicate way.”3) “Show a combination of both", "The next Biennial should take place in 2020, and two other expeditions will be staged in 2021 and 2022.  The Salone di Biennale’s agenda for the next two years is as follows: To review the work of the most significant artists, including Separate Editorial Team and João Paulo de Castro; and To develop programmatic tools and collaborations with one hundred galleries and nonprofit organizations. The next Biennial will be held in the summer of 2022. The first exhibition, “Adding Up” (2019), will explore the history of the relationship between art and mathematics and will be staged in the summer of 2022. The next exhibition, “Theory and Mathematics” (2019), will be held in the autumn of 2022. “Theory and Mathematics” will be organized as a collection of six exhibitions. “Theory and Mathematics” will be a combination of biennial exhibitions and a lecture series modeled on a lecture course organized in a laboratory in the university. The show will feature the work of José Carlos Campos, Giancarlo Cipolletta, Ana de Mello, and Nathan Finney.The exhibition will be organized as a platform for José Carlos Campos", "The next Biennial should take place in 2018. Kees said that the exhibition will be “designed as a platform for exchanging ideas, a reflection of our times, and a way for us to connect and have intimate encounters with each other and the world,” after which the biennial will return to St. Louis.\n\n\nA new exhibition organized by the National Ballet of Canada has revealed that a 2018 production centered on the life and work of Canadian painter and sculptor Louise Bourgeois will address contemporary issues of race and gender, likely focusing on women. The show, titled “Louise Bourgeois: Gender and the American Body” and curated by Ed Moses, will be on view in the exhibition “Racism in Art” in July 2020.“The new work will be a reflection of the themes of the coming months and years,” said Marni Fraser, director of the National Ballet. The theme for the show was “Sensuality and the Body in Art,” which, she said, is a “love letter to the work of Louise Bourgeois.”Bourgeois, who died in 1993, was a pioneering artist who influenced many of the first artists who were known for", "The next Biennial should focus on the history of women’s art and the cultural influences of women’s liberation and feminism. Among the themes for the event are “The Body and Culture: Analysing the Body in Art and in Body Art” and “What We Eat: Food and Health.” The biennial will present an exhibition of work by twenty-two artists, including HIRON, YELA, and MATTHEWS, and will take up the themes of food, nutrition, and health and the body in various ways.\n\n\nThe Smithsonian’s National Museum of Women in the Arts (MMWA) has received a $5 million donation from the Charles and Lucille King Family Foundation. The gift is one of the largest ever made by the foundation and the largest gift to the institution from a single family. The King family’s contribution also comes on the heels of a gift made in 2003 by the Richard and Lucille King Family Foundation for the Museum of Women in the Arts. The gift includes the construction of the Museum of Women in the Arts’ headquarters, which is currently under construction at the newly opened and expanded museum.The donation is also notable for its scope, making up for", "The next Biennial should focus on the relationship between art and politics. “We must not forget about art and journalism,” said Thomas B. Kelly, president of the Center for Art History and the Museum of Modern Art. “The next edition will focus on the role of art in shaping the public’s understanding of history and politics.”The 2017 edition, “Rebel Without a Cause: Art and the Spanish Civil War” (2019), featured works by artists such as César González, Miguel de Castro, and Raphaela Arruda. For the first time, the festival will honor a female winner of the National Medal. “In an age of political insensitivity and social polarization, an exhibition honoring women’s work is a powerful symbol of our democracy and recognition of their contributions is essential,” said Cecilia Otero, president of the Centro de Arte Contemporáneo y Participación, the artistic and cultural arm of the National Democratic Party (PDP), which will host the 2019 edition. The twenty-nine other countries, including China, Iran, and Russia, are not represented.\n\n\nAn advertisement for an upcoming retrospective of The Body in", "The next Biennial should open in 2021. \n\n\nAfter a local K-12 school in Atlanta stopped a yearlong celebration of its centenary last month amid protests from educators, the city council and some local students, the city council voted to suspend the school’s annual gala, which was canceled after the school suspended all activities through June due to a COVID-19-related inconvenience.“We are deeply disappointed that this was the case,” Atlanta Mayor Kasim Reed said in a statement on Wednesday. “This was a school that was already in the process of working through difficult issues. We made a decision to suspend the annual gala in order to make a change in the school’s culture and educational mission. I believe that there were other responsible options that would have been explored, but we chose not to take them.”The school canceled the event after it received more than 1,500 emails and calls from parents, students, teachers, staffers, and others expressing disappointment in the school’s decision as well as in the city’s response to the coronavirus—Reed said the school was committed to ensuring the health of all students and staff. After the school suspended all activities, the", "The next Biennial should focus on issues of legacy, issues of meaning, issues of symbolism, and will include an interview with the artist, a show of works, a presentation of works, a virtual reality experience, and a book. “I feel a great responsibility to push forward the legacy of this exhibition,” said Borges. “It is a legacy of the artist, who, in this century, has been the subject of a great deal of criticism. It is also a legacy of the exhibit, which was organized by a very constrained technical budget.”\n\n\nThe Museum of Modern Art (MoMA) in New York recently unveiled a new mural that addresses the legacy of the current institution’s design, a retrospective of work by the New York–based collective Blumhouse, and an exhibition featuring works by forty-nine artists from forty-three countries. The retrospective, “Letters from a Lifetime,” will run from March 19 to March 21, 2020. The exhibition is organized by the New Museum and the New York–based collective Blumhouse, and will travel from the Art Institute of Chicago (ICA) to the Walter de Maria Art Museum in New York and will focus on letters and personal messages written", "The next Biennial should be staged in Prague in 2022, and the show will be based in a new museum. The biennial will be presented in two parts: a performance and a museum-based exhibition. The Biennial Art Museums of the Czech Republic’ newest project will be to revamp its current pavilion. The pavilion now consists of six exhibition spaces, but Mladiča Kupka, the director of the Škoda Museum of Art and Design, said that the pavilion will be transformed into a “creative, cultural and social space for contemporary art.”In an attempt to expand the exhibition’s reach, the Biennial will once again host a number of artworks and will be given the opportunity to present new works in the works of a number of artists. Among the artists who will be represented at the upcoming event are Marko Kranitzky, Jojof Ostapenko, Chris Lee, Anna Hlobo, and Hlobo, among others.\n\n\nThe National Museum of Fine Arts (NMFA) in Seattle has appointed Shannon M. Harnwell as its new deputy director. Harnwell comes to the museum from the Washington, DC–based nonprofit", "The next Biennial should focus on integrating art historical and contemporary, on city planning and urban planning practices, on the design of gallery and museum spaces, and on the integration of art and design in urban cultures of the city and its surrounding regions. It should also present a collection of work by the artists who are best known for their use of urban settings and locations.”\n\n\nHONG KONG (China) – The Chinese city of Nanjing, which was mired in its worst industrial disaster in decades, was preparing to reopen on Saturday with a rally of over 1,500 people in support of unfettered capitalism and the environment, the New York Times reports.The event was organized by the State Administration of Cultural Heritage, which carried out a thorough reopening of the city in December and is now working on revamping the city’s art district, the Museum of Contemporary Art, Nanjing, which opened on March 8.“After an extensive review of the project, the State Administration of Cultural Heritage has decided that we are on the right track,” said Wang Bing, head of the agency, which was created in 2018 to oversee the transformation of the city. “It will be a truly international city of Nanjing’s", "The next Biennial should be held in either 2020 or 2021. A statement from the museum said that the decision to postpone the event was not related to the coronavirus. According to the Art Newspaper, a report commissioned by the museum found that 56 percent of visitors to the museum are currently infected with the virus. However, the majority of people who are not infected do not show symptoms until after they have come into contact with people who have been exposed to the virus.The museum has taken a number of precautions to prevent the spread of the virus: Last year, it closed its entire exhibition space and shuttered all of its other locations, including the conservatories. It also closed the museums in Vienna and Graz, and moved the rest of its work to a different location, in an attempt to remain out of reach of the virus. In addition, it turned off air-conditioning in the buildings so that the staff and visitors would not be forced to stay up all night drinking hot chocolate. In an attempt to contain the virus, the institution opened up its museums in two other locations, in the capital city of Vienna and in a remote mountainous region of the Austrian Alps, on January 23, 2021.\n\n\nThe Institute of Contemporary Art (ICA) in Istanbul", "The next Biennial should be held in 2021 and the 2019 edition should be completed in 2024. In an interview with Tate Britain, the exhibition said: “Hannah’s work is an important contribution to our understanding of the dramatic transition from a prehistoric environment to modern art and to our own lives. We are delighted to see how she is utilising the stage to further her own artistic interests in this area.”\n\n\nThe Center for the Study of Gifted and Talented, a New York institution that opened in 1980 and has since expanded to include a number of galleries, will begin the process of moving from its complex in Manhattan to an outdoor space in Gowanus, Brooklyn. The New York Times reports that the center will begin the move on August 9.According to Genevieve Brunner, the director of the Center, the move will be a “dramatic development.” “It will allow us to take our exhibition program to a new level,” Brunner said. “The question is how.” Brunner cited the transformation of German Gallery in the City of New York with the renovation and expansion of the Richard Diebenkorn Collection as a model for the center’s move. While", "The next Biennial should take place in January 2021, the same year the first exhibition will open.\n\n\nThe Center for Contemporary Arts (CCA) in Seattle and the Museum of Fine Arts in Portland have announced that they are no longer renewing the contracts of two of the three remaining employees on staff in the Center for Contemporary Arts (CCA) as a collective of artists and activists prepare to protest the institution’s contract renewal in February 2020. The employees, who were employed by the CCA as part of a collective called the Seattle/Portland Group, were not informed of their termination until earlier this month.The Center for Contemporary Arts (CCA) has already faced backlash over the decision to terminate the two-year contract of employees working at the museum. The three workers were employed by the CCA as part of a contract that expired in December 2019. The CCA’s newly formed board of directors voted 10-1 in favor of terminating the contract, which allows the museum to keep the employees employed through 2022. The board made its decision after the museum informed the workers that it was planning to move forward with its planned reopening, but only after it completed renovations to the institution.“We believe the board made the right decision in terminating", "The next Biennial should be held in the coming months. The twenty-sixth will be held in the first half of 2020. \n\n\nThe Museum of Modern Art (MoMA) in New York has instituted new guidelines for the display of works by artists whose work has recently been acquired by the institution, including works that have recently been exhibited or released by major contemporary galleries.The guidelines, which were released on Wednesday, January 5, have three parts: Setting the scene, facilitating dialogue and encouraging collaboration, and demonstrating ability to present the work. The museum will now only order the work from a gallery if the owner has the permission of the artist. The owner must also agree to the use of the works in a way that isn't commercial, and the works must be of a work that was exhibited or released by the museum.“We are committed to supporting the work of our own artists, and those of our own generation, and the gallery is a great platform for this work,” said Paul Teitelbaum, director of MoMA. “In this case, it was the artist Frederich Maier, whose delicate and meditative work captures the complex relationship between the self and the world.”The guidelines state that the work", "The next Biennial should take place in Mexico City. The first edition of the exhibition, “The Work in Progress,” was held in London from 2008 to 2012. In 2012, the Prize team was chosen to organize a new edition of the exhibition in Mexico City. The theme of “The Work in Progress” was the philosophy of the exhibition, the art that it represented, and the work of the exhibition.During the exhibition, between sixty and seventy artists had the opportunity to present work. Eleven of the twenty-four participating artists were already working in Mexico and five of whom had never set foot in the country.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that the institution will welcome visitors back to the institution in the second half of the year following a $500 million reopening campaign. Inaugurating the building’s reopening will be the remodeling of the museum’s signature Public Gardens, the museum’s largest public gathering place. The renovation will also expand the museum’s collection and enhance its public amenities, including the Painted Garden, the Contemporary Art Museum, and Gardenia, and will introduce new public viewing platforms and enhanced public programming.�", "The next Biennial should be held in 2021. The group will comprise a panel of experts, a chief curator, and a curator who will present on the history of modern art in and through the city of Seoul, as well as biennial exhibitions focusing on contemporary art and architecture.Korean artist Kim Seo-kyung will be represented by the Willys Museum in Seoul, which has staged several of his work since it opened in 2008. His first solo exhibition at the institution was in 2016. He will be featured in the next Biennial, which will be held in 2021, when the museum will also be transformed into a biennial exhibition space.The Seoul Art Museum has announced that it will collaborate with the University of London to create a new exhibition dedicated to the history of modern art. The exhibition will be named The Story of Modern Art, and will be curated by Arthur Waley. In addition to a running time of ninety minutes, the show will feature works by seventy-five artists and will feature the works of seventy-five artists from sixty-five countries. “The Story of Modern Art is the project of a committee of scholars, curators, and artists. It will be a real celebration of seventy-five years since the museum opened and", "The next Biennial should be held at the New Art Museum in Abu Dhabi, the Netherlands. The 2020 iteration of the event will focus on topics such as sustainability, politics, and architecture. The next edition of the Kunsthal Helsinki will open in August.\n\n\nThe Fine Arts Museums (FAIM) in London and the National Galleries of Scotland have announced that they have reached an agreement that will see the closure of their doors for a period of seventy-five days in 2020. Under the terms of the agreement, the FAIM and the National Galleries will remain closed until at least July 31. The closure will be based on a series of provisions of the UK’s Brexit agreement with the EU, including the establishment of a single UK-wide account for arts and culture that will be managed by the same body that will manage the annual exhibition and grant-based fundraising.“The joint declaration marks a new chapter in our relationship with the UK Government and Treasury, which has been one of the pillars of FAIM’s success for more than twenty years,” said Jeremy Deller, chief executive of the National Galleries. “This year, we have put forward a set of proposals to renew our relationship with the", "The next Biennial should be held in the fall of 2020.The exhibition will include works by fifty-three artists and collectives in the year 2020–17, including a selection of works by forty-two artists from the year before, as well as works by seventy-four contemporary artists from the year before. The next exhibition, “Theater of Sculpture: Art in the Age of Mechanical Reproduction” (2019), will take up the themes of the gallery’s previous events and its upcoming twelve-hour “Cinema of Light” event.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has awarded the thirty-six-year-old artist and educator Michael Kander a $2.5 million contract for the next two years. Kander’s contract is the largest non-executive grant the museum has ever made to an artist, surpassing the $1.5 million Alexander Calder’s work for 1968.The contract is one of a number of multimillion-dollar gifts the museum has made to artists over the years. The Kander Prize was established in 2017 to honor the artist and educator. Kander was selected for his “Technological Self-Portrait", "The next Biennial should focus on “Theophany in the Making: Art and Social Movement in the Late Soviet Period,” and the third on “Tacit Contact: Painting and the Dynamics of Violence” and “Sophie’s Choice,” which are slated to open next month. Both exhibitions will be hosted by the Brooklyn-based nonprofit Center for Art and Social Research, which will host both shows across the country. “We are thrilled to reflect upon the history of art in America through the voice and vision of the thirty-eight artists and curators who have participated in the Prize,” said Victor Schrager, director of the prize and the prize jury. “By presenting a yearlong program of projects that engage contemporary issues, the award also highlights the vital contributions of artists in the field to a more just, inclusive, and harmonious world.”The seventy-three-year-old prize’s executive director, Jana Chyka, added: “Theophany’s Choice was a chance for the prize to present contemporary art, rather than a selection of contemporary art, in a meaningful way, to a new audience, and to celebrate the seventy-three", "The next Biennial should be up in the autumn. \n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to shutter its doors for a period of ninety days after hosting only six exhibitions scheduled to open this fall.The eight-week closure is part of an effort to reduce the environmental impact of its operations and to make the museum’s collection more sustainable. The institution previously cut its greenhouse gas emissions by 15 percent and said it would be able to produce enough energy to last the entire month of November without shutting down. “This is a critical time to make a real difference,” said Arthur Tsai, the MFA’s director and chief executive. “We are making the most of a challenging economic climate,” he added, “but we must not let it become one of the most expensive ways to visit art.”Since the September 11 attacks on the US, the museum has been working on a series of projects to revise its collection, including a redesign that will include more work by newer and established artists and a redesign of the collection gallery that will include more galleries. It also said it will invest more in education and training.The closing of the institution is part of an effort to", "The next Biennial should be in the autumn of 2021. The selection committee said: “The exhibition will present a range of works that explore the interconnections between human and natural architecture, while embracing the mind and spirit in complex and interlinked projects.”The first exhibition of such a “New York show” is currently underway at the Museum of Modern Art in the City of New York. Titled “The Architectural Story of Life,” the exhibition will feature approximately twenty thousand photographs of living and historic architectural works, arranged chronologically. The exhibition is currently on view through March 21.Commenting on Tate’s selection, Joseph Lane, director of Tate Britain, said: “Tate is delighted to be hosting the first exhibition of the new year, and to have been selected as the ideal venue for this important event. The exhibition will be divided into two sections, ‘The Architecture of Life’ and ‘The Architectural Story of Life. The first section will present the work of some eighty artists, and feature new exhibitions and programming that will celebrate the year with a truly unique experience. The second section will feature the work of contemporary artists and will reflect on the year ahead through a combination of visual art", "The next Biennial should be held in the autumn of 2022.\n\nThe Swedish government has suspended its controversial plan to hold another biennial in the spring of 2048, reports Dagens Nyheter. The move follows President Stefan Lög, who called for a redesign of Sweden’s capital, Stockholm, and the country’s National Museum of Modern Art, an extension of the Royal Academy of Arts, and the local government’s decision to cancel the spring 2020 event.“Sweden has always been a country of immigrants and of people from a different culture, a country of immigrants and immigrants from different cultures,” Stefan Lög said at a press conference. “It is now as important as ever to welcome you and to do everything we can to help you and to think of you as a part of the future Sweden.”The Swedish National Council voted unanimously in favor of the government’s decision to pull the plug on the event in March, and the country’s Culture Ministry also issued a statement stating that the museum had been carefully studying the schedule and had not made a final decision. However, following a consultation with the public, the organization decided to postpone the event until at least September.“We", "The next Biennial should take place in 2020. \n\n\nThe English Heritage Foundation (EHF) in London announced the design of a new £9 million facility for the conservation and restoration of work from the late nineteenth century. Located in the city, the small space will be called the Center for the Study of the Exhibitions in the Exhibition Hall, and will be led by the EHF. The center will also host programming that engages with the museum’s collection, exhibitions, and exhibitions, such as the Bicentennial of Modern Art and the EHF’s Artist-in-Residence Program.Inaugurating the center will be a dedicated museum dedicated to the exhibition of the work of a particular artist, and the museum’s collection. The new building will also include an exhibition space for exhibitions and other programming that were staged outside of London and will be able to host a number of exhibitions, including a retrospective of the work of William Eggleston in 2017 and a new exhibition curated by Peter Hujar.The center will be divided into two buildings, the Museum of the Exhibition, which will house the collection, and a new Research and Research Center. The center will also house other space for the conservation and study of", "The next Biennial should be held in 2022. The Biennale de Lyon, which covered thirty-six cities and towns in France from May to October 2018, will resume in March 2022. \n\n\nThe Museum of Contemporary Art (MoCA), Boston, has appointed Sarah Schechter as its next director. Schechter comes to the institution from the Massachusetts Museum of Contemporary Art (MoCA), where she has served as interim director since March 2019. She succeeds Charles King, who departed in March 2019 to become director of the Cleveland Museum of Art, and will take up the post in April.“We are thrilled to welcome Sarah to our team,” said assistant director Martha Steiner. “Sarah has been instrumental in helping MoCA become a more internationally recognized institution, and has developed an impressive record of supporting the work of artists within the country’s arts community. We are confident that she will continue to further our efforts to build on the museum’s legacy as a champion of art during this challenging time.”Previously, Schechter served as associate curator of modern and contemporary art at the New Museum in New York from 2009 to 2013, where she worked on exhibitions, created public programming, and organized numerous talks and events", "The next Biennial should be held in 2020, the commission said.\n\n\nOn March 23, the Museum of Modern Art (MoMA) in New York announced that it was instituting a $50,000 fund for the financial loss of life and injury incurred as a result of Covid-19, the novel coronavirus. The fund is part of a $1 billion package of efforts to mitigate health risks from the virus.In addition to a fund for direct financial losses, MoMA has committed to providing four million square feet of its holdings in the museum’s Diller Scofidio + Renfro–designed building on West Twenty-Second Street to the medical examiner\u0097a move that will save the artist’s estate more than $1 million, and will donate $1 million to one of the organizations assisting in the investigation of the mysterious death of Pablo Picasso. “The risk of loss of art is real, and we are taking it seriously,” said museum director Christopher Ward. “The compensation package for the artists is enormous, and the already established work that the artists have done to help raise awareness of this risk is remarkable. We are deeply grateful for their contributions and look forward to continuing to", "The next Biennial should be hosted in 2019.\n\n\nOn Friday, the French Ministry of Culture published a statement declaring the opening of the biennial Astana 2020, a joint venture between the Ministry of Culture and the Government-owned French Ministry of Culture, as a success. The announcement marked the first time the two bodies celebrated a single day since the event’s original opening in May 2004. The announcement concluded a two-and-a-half-year project that examined the history of the two cities, the city of Astana, and the region, which includes Kiasma, Novosibirsk, and Novosvayk.“The project completed in two years and with the opening of this exhibition, the French Ministry of Culture is counting itself lucky to have shared the same experience as the participants in the exhibition, which was made in the country of Kazakhstan, in a way that made the experience of the exhibition possible,” said Louise LaPierre, director of the museum.The ministry’s project in collaboration with the French artist and researcher, Edouard Prouvé, was sparked by a question he posed at the forty-fifth Venice Biennale: “Do we need a new history in our memories", "The next Biennial should be held in 2020, with the exhibition marking the fifteenth anniversary of the event. The museum is also planning to add two new works to its collection, one of which will be a new sculpture by artist Marc-Olivier Gassée. The other will be a new exhibition on the legacy of the late French painter Auguste Renoir.“The Biennale is one of the most important milestones in cultural history. To commemorate it and to use its power as a vehicle for critical reflection and artistic experimentation, the museum will present the next edition of the biennial in 2021,” said Olafur Eliasson, director of the museum. \n\n\nThe Metropolitan Museum of Art, the Museum of Modern Art, and the Whitney Museum of American Art in New York have announced that they will jointly work to preserve the works of American and European contemporary artists, including Simone Leigh, Tommie Smith, and Johannes Frank, and will work together to advance the museum’s collection of the artist’s works. The museum will finance the work preservation initiative through a $125,000 grant it received from the James D. and Catherine L. Knight Family Art Museum Charitable Foundation.In a statement, both institutions", "The next Biennial should take place in the month of June 2020 at the Museum of Contemporary Art San Francisco. The theme for the 2019 edition was “The Future of Art.”In a letter dated June 16 from the museum’s director, Deborah Fogarty, the institution wrote: “The biennial will be about the future of art through a rethinking of how we think about new art. We will focus on new ideas and new ways of seeing, new ways of seeing how art interacts with other art, and new ways of transforming art into other works.”The exhibition “drew from the themes of art history and philosophy to reflect an increasingly critical consciousness about the origins and future of art.” Among the artists chosen for the exhibition were Monica Johnson, Alex Katz, Nineteen Sixties Marfa, Peter Hujar, Bettina Kirkegaard, and Katja Kapp, for whom the Los Angeles–based artist designed a piece for the exhibition. The first show of its kind, the exhibition will be on view through May 9.The biennial will also feature the first solo exhibitions of work by American painters such as Daniel Burnham, Thomas Campbell, and Vincent van Gogh, as well as", "The next Biennial should be held in 2020.\n\n\nThe Egyptian Museum in Cairo is planning to move the exhibition “The Birth of a Nation” from its temporary exhibition space in the Beit El-Khoury, the Beit El-Hadid neighborhood of Cairo, to its new home in the North Cairo Museum, which will open in the next few months. The exhibition, which will feature work by ninety-four artists from fifteen different periods of Egyptian art history, including the 8th Dynasty (4th–6th century BCE), was first staged at the museum in 1924 and closed in 1977.Based on the work of the late Egyptian director Muroft al-Jumaili, who was partnered with the Kala Masrada Foundation and the Beit El-Hadid group, “The Birth of a Nation” will be curated by Ali Abdel Nabi, a founding member of the second stage of the 2015 Egyptian Festival of the Arts, which was held in Alexandria this past April. The twenty-third edition of the event will be held in Algiers in the spring of 2021.The institution has been working with the Kala Masrada Foundation since 2014 to create a new biennial, The Birth of a", "The next Biennial should focus on the European Boy and Girl Culture, the work of migrants, and how this culture is produced and transmitted from generation to generation. The second should focus on how the art of the future will be made locally and will be presented in a biennial format. The third will be on the relationship between artists and the biennial and the biennial.”A total of thirty-eight artists are represented in the exhibition, which will begin in 2021 and run for twelve years. The theme for the first edition, the African Museum of Art and Art of the Moving Image, was “The Place of Women in Art.” In order to meet the demands of a changing world, the exhibition will present the work of eighty-four artists and will be curated by Antonia Catellani, who will also serve as artistic director of the Museo de Arte Contemporáneo in Rome; Claudio Bruni, the artistic director of the Museo de Arte Contemporáneo di Cinéma, Italy; and Annette Caccia, the artistic director of the Museum di Grazie di Beppo, Italy.\n\n\nThe Pérez Art Museum in Miami Beach and the Miami Beach", "The next Biennial should take place in 2020. The project has had its share of controversy, however, with some critics admonishing Museums England to do more to address long-standing racial tensions within its own ranks. The Royal Shakespeare Company is already working on a series of exhibitions dedicated to celebrating black and minority ethnic performers, and the National Poetry Collection is planning to host a lecture series on black history.\n\n\nThe British Film Institute (BFI) in London has commissioned artist-run non-profit organization Moment to create a new “indefinite residency” program that will provide additional financial support and career opportunities to under-recognized artists. The initiative comes amid a global campaign to raise awareness and alleviate income inequality through the creation of new public works.It will commission the organization from Belfast-based artist-activists, BlackRock, and will fund sixty-nine hours of studio time each month for an indeterminate residency program. The funds will be shared equally between the BFI and the artist-run nonprofit, with ten percent going to the BFI and fifty percent going to the artist.“We are hugely excited to work with artist-run organizations to introduce a new kind of grant,” said", "The next Biennial should begin in March 2020 and conclude in June 2021, with a view to a twenty-fifth edition being staged at the new institution in 2022.The decision to move the event had been in the works for some time but was delayed following the coronavirus pandemic. Since the biennial was originally scheduled to convene in February 2021, the museum had been forced to move the event online, postpone its 2020 edition, and cancel a future edition. The move has also been controversial with some critics, who say the museum has been trying to reduce the exhibition and are accusing the institution of withholding important information.The controversy has led to demonstrations at the institution and in Berlin and has led to dozens of complaints to the museum. The exhibition has also been the subject of several books, which have been translated into English and the Italian languages, and films which have been screened by various international critics.The new museum’s director, Birgitta Bertotti, said the complex is now capable of hosting a twenty-fifth edition of the exhibition. It will take place at the museum’s new building on the DNA’s campus, a $55 million renovation project that will be completed in 2020. In a statement, Bertotti said: “", "The next Biennial should be held in the spring of 2021. The fair, led by artistic director Mariko Silver, will run from January 17 to February 20. \n\n\nThe Los Angeles County Museum of Art (LACMA) has unveiled a new initiative that will allow visitors to the museum to create works of art by browsing through its collection through a virtual reality (VR) experience. The program, called the Virtual Reality Art Museum, will allow visitors to create virtual works by browsing through works in its collection with the assistance of educational professionals working as part of a six-week residency program.“The Virtual Reality Art Museum will enable LA’s curators to see and interact with the works in LACMA’s collection in a way that is uniquely their own,” said LACMA director James Gandolfini. “It’s a new kind of exhibition that is collaborative and open. We’re not trying to come up with new and different ways of exhibiting works. We hope visitors will find the immersive experience of the Virtual Reality Art Museum to be a model for how we can collaborate and explore the art world in a way that makes sense for the LA museum.”The program will run from March 13", "The next Biennial should be in 2021. The theme of the next edition will be “Art and Change: Towards an Ethnographic Theory of Art.” The next Biennial will be curated by Kounsaku, and will take up the theme from the memoirs of Nancy Drew. The next Biennial will be held in Tokyo, and will be organized by the Tokyo Metropolitan Museum of Art. The next Biennial will be held in the US, and will be curated by the San Francisco Museum of Modern Art. Organizers have yet to decide whether the next iteration of the event will take place in the US, the UK, or both.\n\n\nThe Museum of Fine Arts (MFA) in Boston is keeping a narrow eye on the fate of its long-standing arts center, in an effort to prevent the reopening of its former home on Beacon Street, which was completed in 1984 and filled to capacity in 1993. In an attempt to influence the redevelopment of the arts district, the museum has spent the last five years working with a local firm to develop a master plan for the former site of the Contemporary Arts, which includes a public green space, a major performance venue, and an art museum.According to the", "The next Biennial should include a selection of works created by ten artists (Berlin, New York, Los Angeles, Portland, Seattle, and Shanghai), a selection of works by twenty-six lesser-known or unknown artists (MCH Group, Rosalind Batchelor, Delia Bocci, and Jean Luc Melle), and a presentation of work by forty-four artists (Tian Han, Wang Meng, Wencheng Chen, and Wanliang Cao).The 2017 biennial was held in Beijing from September 6 to September 12. The exhibition was organized by the Beijing Biennale Foundation (BBA), a nonprofit organization that was created to foster international exchange, promote a positive image of China in the international art world, and foster the exchange of curiosities between China and the United States. The exhibition was cofounded by artist Wang Xishuo and Wang Zhichang, artists from the Xishuo group, and Zhang Yaxuan, a curator and scholar who is credited with coining the term Xishuo-Zhang Yaxuan Contemporary Contemporary Art. The exhibition, titled “Xishuo-Zhang Yaxuan: Contemporary Art from China,” was curated by Wang", "The next Biennial should begin on Monday, April 3, 2020. The exhibition will include works by Nia and Jarecki and will run for ten weeks. “The Biennial for the Silhouettes of a Painted Room: Leo and Erma Biennial, 2019, will present a new work by Nia and Jarecki and will run for fifteen weeks, beginning on January 7, 2020,” said Kirsten Wieder, director of the Biennial. “We are extremely excited to be able to present this work in the Bauhaus, and to continue to present and develop innovative and thought-provoking experimental artworks emphasizing the connections between ideas and material relationships.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Kate Hoberman as interim director. She will serve as interim director for the arts and humanities until a successor is appointed.Hoberman comes to the institution from the Boston Cultural and Media Center (BCCM), where she has been the interim director since June 2019. During her tenure, she has promoted the school’s collection and education programs, expanded its collection and exhibition program, and launched the Museum of Arts", "The next Biennial should be announced by the end of May. The second should be announced by the end of June. The first will be announced in early July. Kunstmuseum Stuttgart, Germany—The Kunstmuseum Stuttgart (Kunstmuseum Stuttgart) is currently closed due to the Covid-19 pandemic and will reopen in August. The exhibition, “The Body of Art: Art and Performance in the Twentieth Century” will close on September 28. The museum also revealed that it will not be providing visitors with any additional information regarding its reopening other than to say that it is committed to reopening as soon as the “radicals”—i.e., the artists and activists who had participated in last year’s Geldsecher Ball—regain their freedom of movement.The Kunstmuseum Stuttgart, which was founded by collector Lutz Bacher in 1984 and has an average gallery capacity of 5,000 visitors a day, has received over $79 million from the city of Hannover in support of its reopening. Since the institution does not have a permanent tenant, city authorities have given the Küner", "The next Biennial should take place on February 22 at 16-18 West Forty-Third Street in Manhattan. The next iteration of the show will take place at the Museum of Modern Art in a year-round center in the city in 2022.The announcement of Manhattan’s pavilion for the 2020 edition of the biennial was made at a biennial preview at the Metropolitan Museum of Art in New York on February 13. The pavilion will receive a total of $25 million from the New York and New Jersey governments. “Next year will mark the thirty-sixth anniversary of the opening of the Biennial of American Paintings,” said Joseph Kosika, director and chief curator of the Metropolitan Museum of Art. “We’re in the process of planning for the future, and we’re confident that the new partnership between the Biennial Foundation and the Museum will deliver a spectacular exhibition.”\n\n\nThe Carnegie Museum of Art in Pittsburgh has received a gift of more than 2,600 works by American painter Charles Burress, whose experimental, often surrealist, and often stylized medium combines fashion, technology, and social systems in a matter of months and may be the last work by the artist left in the", "The next Biennial should be held in 2021, and the eighteen-month production cycle should be extended to 2020. “The success of this exhibition has been a long-term aspiration of the museum,” Lehmann Maupin, the director of the Düsseldorf Museum of Art, told the Art Newspaper. “We have had the pleasure of supporting and collaborating with many artists and designers over the years, and now we are nearing the end with the reopening of the museum. It is an honour to be able to take part in such a vibrant, vibrant city.” The exhibition will celebrate the city’s history with a selection of sixty-five works by twenty-five artists, including David Hockney, Carol Russell, Elizabeth Peyton, Jonas Sinn, Ursula von Rydingsvard, Vito Acconci, Philip Glass, and Jeffrey Gibson, and will present activities and programming that engage with issues such as climate change and the interconnectedness of the world, as well as a selection of works by contemporary artists whose work focuses on social justice, economic opportunity, and environmental sustainability.\n\n\nThe Center for Contemporary Art (CCA) in New York announced today that it plans to close", "The next Biennial should be announced by the end of the week.  The exhibition will begin with a presentation of works by the period’s leading contemporary artists, including Yuki Mokgai, Yoko Ono, and Sergei Tarkovsky, and will be followed by discussions with key figures in key stages of their careers. “We at Tangerine are delighted to be able to unveil ‘The Biennial of Yoko Ono’s Art’s Edge,” which will open in March 2020. Designed by Yoko Ono and commissioned by the artist to coincide with the artist’s eighty-fifth birthday, the exhibition will feature the artist’s best work to date, as well as biennial‐style installations by twenty lesser-known artists.The inaugural exhibition, “The Biennial of Yoko Ono” was organized as part of the artist’s special month of March 2019, and took place at the artist’s home in Tokyo. In honor of the occasion, Tangerine will donate $1 million to the Michael and Susan Guggenheim Foundation for the Arts, as well as $500 million to arts and cultural organizations, in support of", "The next Biennial should be held in the fourth quarter of 2019.The full list of participating artists is as follows:Frank de Boer, Den Haag, BelgiumHans von Tillmans, GermanyAmara Hajek, BelgiumLiu Yuelan, ChinaMina Liao, ChinaYishu Lu, ChinaTia Luo, ChinaSu Xiaodan, ChinaErin Mulder, ChinaLiu Xiaoming, ChinaArtsadia Pons, China\n\nThe Metropolitan Museum of Art in New York has appointed director Terence D. Donovan as its next leader. Donovan comes to the institution from the museum’s curatorial team in Beijing, where he has served as deputy director since 2017. He succeeds Gideon R. Browne, who has served as director of the Metropolitan Museum of Art since 2009, and will take up the post in August.“I’m thrilled to be a part of the Met’s story,” Donovan said in a statement. “The project we’ve been working on for the last decade has made a real difference in the lives of countless artists and has pushed the boundaries of art and design. I’m eager to continue this work and push boundaries", "The next Biennial should be held at the Makart Museum in the city of Kassel in December 2020, and the first exhibition should open in March 2021. “This is a monumental moment for the museum,” said Monika. “With the completion of this project it will become possible to permanently mark the Polish-American art of the twentieth century. I am eager to see how this exhibition will unfold in the coming years.”\n\n\nThe Metropolitan Museum of Art in New York has appointed Laura Mulvey as its next director. She will be responsible for overseeing the museum’s production, exhibition, and public programming, which has been heavily impacted by the coronavirus, in the months leading up to the pandemic. Mulvey comes to the Met from the Museum of Modern Art in New York, where she quickly rose to become the museum’s acting director. She will succeed director Daniel H. Weiss after he departed to become director of the Museum of Modern Art (MoMA) in the fall of 2022.“Laura brings with her more than twenty-five years of experience in the field, including as the curator and head of the Daniel H. Weiss Collection, which includes work by many of the late museum’", "The next Biennial should be held sometime in the second half of the year. The next edition will consist of two main galleries, a large-scale installation by the artist and a dialogue between the artist and collector. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has appointed Steven Schoonmaker to be its next director. He succeeds Martha Schubert, who stepped down after ten years to become chair of the Metropolitan Museum of Art in New York, where he has served in his current post for eleven years.“Steven’s historic history of leadership and strategic vision for our cultural sector makes him a perfect fit for the role of DCLA,” said Mayor Bill de Blasio. “In addition to his proven ability to translate his own vision into action, Steven brings to the agency a wealth of experience in strategic planning, public engagement, and institutional strategy. DCLA has been and will continue to be a strong voice in the city’s cultural life, and his appointment reaffirms its importance in New York City.”Schoonmaker comes to the DCLA from the Museum of Modern Art, where he was a founding curator and taught at the institution for more than fifteen years. He was also a founding curator at", "The next Biennial should take place in 2021. The announcement was made on Thursday, May 3, the day that the exhibition was originally scheduled to open. Sakho said that the decision to cancel the show was not made lightly and that the decision had been made in the long term, but for the short term, it was necessary. He said that the show’s production team and institutional partners closely followed the guidelines set by the Art Newspaper, which urged authors to engage in “constant negotiation” to ensure that the exhibition would be able to present a full program.The series will now return as planned in 2021, with the new title “Beyond the Frame.” This year’s exhibition, which was organized by the Neo-Gothic museum in Venice, marked the museum’s centenary.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released new guidelines on how it will handle protests and unrest following the November 15 reopening of the Tate Modern, and they suggest that organizers of future demonstrations be prepared to use tear gas and rubber bullets.The guidelines, which were issued by the police department on Saturday, January 7, assured activists that the MCA will “", "The next Biennial should be held in the capital city of the Republic of Moldova, Luhansk. The theme of the exhibition will be “The future of the city of Luhansk,” which will involve the restoration of the old city and will take place between May 18 and May 22. The tour will include twenty-six exhibitions, including solo exhibitions at the Autonomous Museum of Contemporary Art in Belgrade (Alo-Alo), the Museum of Modern Art in Belgrade, and the National Gallery in Moscow.A new exhibition will be planned for April 4–May 7, 2020. The exhibition will be organized in the form of an intermission, which will be followed by a tour of the National Gallery in Moscow.\n\n\nThe National Geographic Society’s developing strategy for revamping its image in the wake of the pandemic has shifted dramatically, with a new research program designed to engage more directly with the public about its future and a new website designed to engage with a larger global audience. The new project, which will be led by the artist-in-residence David H. Koch and will run from May 16 through May 20, will attempt to reimagine how people will find and experience images through a new", "The next Biennial should be held in 2022. The proposed date for the exhibition was also earlier revised by the organizers from late 2019 to mid-2020. The event would have been hosted by the Baghdad Art Museum and the Art Institute of Chicago. According to the Art Newspaper, the venue would have opened in 2025. The exhibition would have featured works created by fifty-six Iraqi artists, including Muhammad Ali, Saad al-Hadithi, and Ahmad al-Khudairi, as well as five pieces by American artists: Robert Irwin’s The Truth About Life, 1968, 1961, and American Artist, 1963.\n\n\nThe 2018 edition of Art Dubai, organized by Abu Dhabi-based institution Art Dubai, has announced that the event will now take place from March 7 to March 14 in the United Arab Emirates. The fair, which was originally scheduled for March 5 to March 7, has since been postponed to March 13.Dubai: Art Dubai’s inaugural event has also been postponed. The first edition, which was to take place March 5 to March 7, 2018, has been rescheduled to March 13 to March 17.“We are extremely proud of the events that have transpired over the past", "The next Biennial should take place in the spring of 2021. A new exhibition of works by the artists involved in “The Gathering: The Creative Life and Death of Art” will be presented at the institution in the summer of 2021.\n\n\nThe Metropolitan Museum of Art in New York has decided to give retired sculptor Yoko Ono a new commission, which will involve her reassembling a collection of twenty-one works by the late British painter John Galliano. The commission, which was created as part of a new exhibition titled “Galliano: The Essential,” will be presented at the museum on April 23 and will run through May 20. Galliano’s works will also return to the museum for a special exhibition that will address his work in the autumn of 2021.The institution said that the commission was a “great honor” and “presents a great opportunity to support the work of a fantastic and valuable friend,” Galliano’s son, John Galliano Jr., who passed away in 2017. Galliano’s nephew Travis Galliano, who served as the commission’s commissioning designer, will be the lead artist in the sculpture show. The show is being organized by the", "The next Biennial should be held in the Spring of 2020 or the Summer of 2020. The 2020 iteration will be made possible with support from the Schäfer Foundation, the Max Hetzler Foundation, and the CAY/CAY Foundation.\n\n\nThe Smithsonian American Art Museum (SAM) in Washington, DC, has released the list of twenty-seven artists who will participate in the next edition of the National Museum Biennial, a free event that will run until March 23 and will feature work by forty-six artists across forty-eight cities and ten states. The 2020 event is named after the landmark 1965 painting by Jean Dubuffet, 'The Sculpture of a Woman,” which depicts the torso of an American Civil War soldier, and was created by a group of thirty-three artists.The twenty-one artists chosen to participate in the exhibition were selected through a public competition held in April 2019. The seventy-two-person jury comprised John Mather, president and CEO of the Mather Center for American Art; Michael Premack, director of the Alison Poole Museum of Art in Nashville; artist and Bipartisan Policy Center (BPC) cofounder Ralph Gertrude Adams; and artist", "The next Biennial should take place in 2021. The 2019 Exhibition was held at the Bachmann-Wechsler Museum in Munich, the Württembergischer Rech, and Kunsthalle Marienbad, and was inaugurated by Merry the Great and Nea the Great, respectively.  The 2020 edition will be held at the Museum Ludwig, the Krefeld Cultural Center, and the Museum Velen, and will be curated by Michael Maier.Nominated for the honor are artists like Dara Lindy, Harry Callahan, and Michael Whitefield. The list of curators is as follows:Timur Skoglund, Culture and Design and Design: Architecture and Design, Architecture and Design Culture, Architecture and Design: Minimalism, Architecture and Design: Architecture in Materiality, Architecture and Design: “Theoretical Modernism” and Architecture in the Age of Stalin, Architecture and Design: “Girard: Futurism, the Modernism, and the Futurism”Alexandre M. Pérez, Architecture and Design: “New Forms of Reality” Aijaz Sayeed, Architect", "The next Biennial should be held in September 2020. Additional information about the 2020 event can be found on the Biennial’s website. The 2019 edition, titled “Between the Sun and the Moon,” was held at the São Paulo Bienal, Brazil, an old mill that is home to some of the oldest continuously operating art galleries in Brazil. Featured artists were Gerald Forneaux, Juliana Cerda, and João Camargo, and the exhibition was organized as an “intersection of art and architecture,” with the rotating discography of Pablo Picasso and Isamu Noguchi.The 2019 edition of the São Paulo Biennial attracted an impressive group of sixty artists, including Barbara Talbot, Janelle Goddard, John Michael Greer, Rirkrit Tiravanija, and Alessandro Veronesi. “This Biennial was created by the great artists of Sao Paulo, and I am honored to participate in its twenty-fifth edition,” said Brazilian artist Marcelo Coelho, whose work was included in the exhibition. “A very important work by the Brazilian artist, Pablo Picasso, in the exhibition at São Paulo Biennial was", "The next Biennial should be held in 2020. The event will also be held at the Hogwarts School of Witchcraft and Wizardry.\n\n\nThe Bolshoi Ballet in Moscow is planning to scrap a performance, titled The Circulars, that was scheduled to open this week and has been scheduled to run through November 27. During the work’s nine-month run, the Russian troupe produced contemporary plays that were presented in  and opened pieces that were inspired by excerpts from the novel The Circulars, by Alexander Solzhenitsyn, a Soviet exile.Dressed in a full bodysuit, the Duma deputy artistic director, Alexei Klimov, announced on Tuesday that the four-hour-long piece, titled The Circulars, had been canceled and that the production would return to Moscow for another performance this week. The works were selected for the exhibition in recognition of their contributions to contemporary art and the Bolshoi’s interest in the work of non-Russian artists. The decision to cancel the show coincides with a wave of anti-government protests sweeping across Russia as the country’s artists and intellectuals are targeted by the country’s conservative government. The", "The next Biennial should take place in 2020. Biennials are a way of life for many communities and are considered a milestone in a community. The exhibition will be hosted by the Museum of Contemporary Art (MCA) in New York and will feature work by seventy artists from fifty countries.Curator Michael Kors told the Art Newspaper that the 2019 festival was “a departure from the classic presentations.” He added that the pavilion will be “updated to reflect the latest and most ambitious developments in contemporary art.” Kors is the founder of Kors Kastner Gallery and is the former director of the New Art Museum St. Louis.Kors Kastner Gallery and the Metropolitan Museum of Art (the museum) have long sought to increase the museum’s institutional presence in order to serve the local community. Under the initiative “Radical Intents,” the museum will present fifty works by forty artists in the United States, Russia, and Mexico City in 2020. The first exhibition will be “Radical Intentions,” curated by Nari Ward and her collaborators and opening at the MCA in 2021.\n\n\nThe Brooklyn-based nonprofit art center Art in General Pty. Ltd., which has", "The next Biennial should take place in the coming months.   New York: The year of the Italian pavilion will close in 2024.  The Beverly Biennial is currently on hiatus.  Coachella Valley Music and Arts Festival: Originally scheduled for March 20–March 25, the tenth edition will now take place in 2021.  The Bronx Art Museum: Originally scheduled for March 13–March 16, the museum will now open on July 12–July 15, 2020.  Chicago: Originally scheduled for March 21–March 25, the museum will now re-open on March 19–March 21, 2021.  Chicago: Originally scheduled for March 20–March 25, the museum will now begin operations on March 21, 2021.  Dallas: Originally scheduled for March 21–March 24, the museum’s ’s new home will open on July 11, 2020. Dubai: Originally scheduled for March 13–March 16, the new museum will be inaugurated on March 17, 2021. Dubai: Originally scheduled for March 20–March 26, the new venue will inaugurate on March 31, 2021. LA Art and Architecture Biennial: ", "The next Biennial should take place at the Indian Institute of Tropical Medicine in Chennai, which will also stage a new exhibition of work by artists whose works were included in the first show. The National Gallery of Art, Washington, DC, has appointed Debbie Rutter as its next chief curator. Rutter comes to the institution from the Katsura Museum in Abu Dhabi, where she has worked as an associate curator since 2011. Rutter succeeds Lena Bush, who retired in July 2019 after a decade at the museum. Bush will now assume the role of chief curator and will oversee the artistic program of the museum; Rutter will continue to serve as executive director of the BHMA, which is located on the third floor of the Smithsonian American Art Museum in Washington, DC, and was established in 1921.“Lena was instrumental in creating the BHMA as a global repository of the history of American art, and has been an inspiration for us all as we continue to explore the possibilities of archiving and storing important collections in the institution,” said Jodi Throckmorton, director of the BHMA. “We are thrilled by her accomplishments as a curator and her enthusiasm for", "The next Biennial should be held in 2021 to mark the centenary of the founding of the Biennial de Desarrolles at Paris’s Les Réserves, which opened in 1917. The exhibition’s director, Elisabeth Wienstra, said: “The goal of the Biennale is to create a new kind of memory of the twentieth century. The new platform will allow us to reexamine the history of art, to reexamine the present, to re-examine the future. . . . The new exhibition will be a moment for reflection, a moment of belonging. It will introduce a new kind of intellectual and artistic life to Paris.”\n\n\nThe Museum of Contemporary Art (MCA) Singapore has announced that it will offer free admission in November 2021 to the works of Singapore-born and internationally-credited artist Lee Tse, whose vibrant, interdisciplinary, and work-in-progress paintings capture the spirit of the capital city. The program will also feature paintings by contemporary artists whose work was inspired by events and places in Singapore, such as Ting Chiu and Nam Yuen, as well as works by lesser known artists whose work reflects the urban landscape of the city.In November", "The next Biennial should be held at the University of Antwerp (UVA) in the Netherlands. The exhibition will be supported with a grant from the Deutsche Deutsche Forschungsgemeinschaft (D.F.G.), with the new design of the pavilion.Dr. Tuemann hopes that the pavilion will inspire young visitors to think about the history of art and its possible connection to their own lives. He writes: “Young people can get lost in the museum, which is that old-fashioned,, but vital, institution for all of us, the gallery. So my hope is that the new pavilion will be an example for young people. It will show them the works that are currently on display and encourage them to see them again.”\n\n\nHeadquartered in New York, the Museum of Modern Art (MoMA) has appointed Mark B. Lundy as its next director. Lundy will be responsible for overseeing and, in coordination with the curators, developing the museum’s collection of contemporary art and its collection of photography, film, and drawing. He succeeds David H. Koch, who announced in June that he plans to depart the institution in February 2020 and return to private practice.", "The next Biennial should take place in Hong Kong in 2021. The theme of the following year should be “The Need for Beauty.” The inaugural exhibition, “The Art of Handmade Objects,” will be held in the capital city of Hong Kong in September 2021. The exhibition will include new and original works by thirty artists, including Brenda Allan, Rini Chaudhari, and Anish Kapoor. The fifteen candidates for the prestigious $10,000 prize will be announced in December 2020.\n\n\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has awarded $3.25 million to forty-two artists who were shortlisted for the 2019 David C. Driskell Award. The Hirshhorn’s David Driskell Award honors an artist who has inspired, empowered, or has challenged the careers of thirty-three contemporary and influential artists over a five-year period. The Hirshhorn’s previous recipients include Harry Callahan, Alice Aycock, and Robert Irwin.“The David C. Driskell Award is an opportunity to celebrate and recognize the remarkable achievements of thirty-three artists in their twenty-fifth year of eligibility, and we are especially pleased to recognize the", "The next Biennial should include works by more than forty artists who are currently or have been active in the city of Sao Paulo. The final exhibition will open in December 2020 and will showcase the exhibition “Única Nascimento” (End of an Age) that will open at the Museum of Contemporary Art in Lisbon in January 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to create at least five thousand new jobs at its Washington, DC, outpost in an attempt to stem the city’s ongoing job crisis. The museum will announce the launch of the new $10.5 million Cultural Impact Fund, which will support new cultural endeavors and provide up to $500,000 a year to help cultural organizations facing immediate financial problems, on Wednesday.The donation will also allow MoMA to open a new 750,000-square-foot space in the 7,000-square-foot museum to house the collection of one-hundred and fifty artworks from the collection of the collection of the late collector Henri Matisse. Founder David Danziger said: “We are thrilled to open a new, dedicated space for the art of the twentieth century. The future of this museum is deeply connected", "The next Biennial should be held in 2022. An update to the theme of the exhibition will be presented in 2021. The Biennial will be held at the Grand Palais, Paris, and will be followed by an open-air exhibition in London in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $25,000 donation from the Richard and Helen DeVos Foundation. The gift comes amid the ongoing crisis affecting the institution as it works to restructure its collection, which includes works by every artist in the United States and the world, and is one of the largest donations ever made by a family-owned arts organization. The foundation was founded in 1992 by the late arts philanthropist Richard and Helen DeVos, who was a major supporter of the Los Angeles County Museum of Art (LACMA), which is now undergoing a $450 million expansion project completed in 2017. The gift is one of several investments made by the family in the wake of the Covid-19 pandemic. Other foundations that have supported the project are the John and Hilda Mayer Foundation and the Grady Memorial Foundation, as well as the Alexandra and John B. King Family Foundation, the Beck Family Foundation, the David Rockefeller Foundation, and the", "The next Biennial should be announced as soon as possible. “It is essential that we implement immediate and effective action to protect the vulnerable and prevent the spread of Covid-19,” the panel said, adding that it will take a second round of assessments in January 2020 and a final decision in March 2020.If the Art Newspaper reports the following stories:● Bali Nine, “Bali Ten,” January 21, 2019, 20182. Efforts are underway to mitigate the coronavirus outbreak in Indonesia by increasing the social distancing of people, eliminating travel to and from crowded places, and providing more social support services, but the situation is not under control. The Center for Disease Control and Prevention (CDC) in the United States issued a global emergency declaration for January 2019, and the World Health Organization (WHO) reported the number of new cases worldwide to be at 965 on Monday. In the United States, the number of cases jumped to 127 on Sunday, January 18, with the coronavirus reaching its highest count in five weeks. Authorities in California declared a state of emergency and are preparing for a crisis. In the UK, where there have been more than 2,600 deaths from the virus", "The next Biennial should take place in 2021.   The exhibition, titled “Art and the Politics of Love” (2017), was curated by Rania Baidu, who was previously a curator at the TBGA and the New Art Museum in Beijing; Øystein Sargent, who has also been a curator at the Museum of Fine Arts, Shanghai; and Yuki Kondo, the director of Tate Modern Tokyo. The 2019 show, titled “Feminine” (2015), featured work by fifty-two artists and was displayed in the Museum of Contemporary Art, Japan.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has received a gift from the City of Los Angeles for its longtime collection of works by outlaw band The Band, whose members include Greg Kurstin, Robert De Niro, and John Glenn. The donation includes twenty-six works by artists who were part of the group’s seminal 1970s incarnation, The Band, and will be moved to Los Angeles, where they will soon be restored to the collection.The gift is the latest in a series of cultural efforts to preserve the legacy of Kurt Cobain, whose untimely death led to months of protests and riots"]