["The next Biennial should begin in the summer of 2021 and conclude in the spring of 2022. The theme of the event is “The Future Is Present: Words and Actions in the Next Millennium.” The theme of the exhibition should reflect the theme of Biennial 2: “The Shadow of the Future: The Future is Present,” which will take place in the same location as the first one, in 2021. The organizers have also announced that the second edition of the Biennial will be held in 2020 and the third in 2021.The full list of participating artists is as follows:CIMAM BOYD, New York and London (1921)Christopher Wool, New York and London (2021)Douglas Britten, New York, and London (2019)David H. Koch Gallery, Kansas City (2019)Dario Carriani, New York (2019)Diana Fiamingo, New York (2019)George and Gere Kavanaugh, New York (2019)Hans Kammerer, New York (2019)Hans van der Kolk, New York (2019)Hans van der Kolk & Friends, New York (2019)George and Jan Molen, New York (2019)Hans van", "The next Biennial should be held in 2022, and the first in 2020. For the past ten years, the sculptor and writer, whose primary passion is to develop new work, has been an active member of the community of Northwest Mennonites, a group of around three hundred artists who live and work in Oakland, California. According to CityLab, about seventy percent of the artists who are represented in the triennial are women and children, and seventy percent of the participants who have graduated from the institution are under the age of forty. Among the artists who have been selected for the 2020 iteration of the exhibition are a group of women who call themselves the Everly Alveses\u0097the name of their collective, which was inspired by a line from the film My Fair Lady\u0097and a group of thirty-eight-year-old Puerto Rican artists who are known as the Puerto Rican Artists.“The first year was a bit of a disappointment, and the second year was a little disappointing,” Alveses said. “The third year was great, and the fourth year was even better.”The exhibition is organized by the City of Oakland and the nonprofit Oakland Voices, which is dedicated to supporting the Puerto Rican artists whose", "The next Biennial should be held in 2021.  The project was born of the need to re-create a large group of artists’ studios. When the architect, Richard Condon, proposed the few remaining works on the site of the old Tate, he hoped that the new exhibition would be a way of reopening Tate’s rich legacy.  It will also highlight the work of young artists, as the contemporary art audience is becoming more diverse and older, and the new exhibition spaces will be ideal for a wide range of work.Speaking about the project, David Shinn, director and chief curator at the Contemporary Art Museum St. Ives, said: “Birmingham has had a long and successful history as a vibrant centre of artistic creativity and innovation. The Biennial aims to take the question of how we engage with and change the course of art from the past and present to the future, and to re-create the environment to support future creativity and innovation.”The Biennial is supported with funds from the Tate and the Liverpool Biennial Trust, and is organized as part of the biennial’s ongoing work to expand its network of support for contemporary art. In 2020, the 50th anniversary of the Tate,", "The next Biennial should focus on the challenges, the possibilities, and the centrality of improvisation in the creative process. It should also reflect the evolution of the exhibition as a whole. The 2017 show was at the new microcenter at the Dijon Museum of Art in the northern city of Bordeaux, France. The biennial will celebrate 150 years of the museum, its collection, and the exhibition program with an exhibition of work by Jean-Michel Basquiat.The 2019 edition of Biennale Paris will be held in early 2020. \n\n\nThe Foundation for Art and Design (FAD) in New York has appointed Emily K. Carroll as its next director. Carroll currently serves as the executive director and chief curator of the Brooklyn-based nonprofit arts organization, which was founded by Joan and Ed Moses in 2001. She succeeds Tim Rabkin, who has helmed the organization since 2015, and will begin in her new role on March 17.“The board of trustees and I are thrilled to welcome Emily to FAD,” said board president and CEO Thor Halvorssen. “Her credentials, proven ability, and history as an advocate for artists make her the ideal leader to lead the organization through this challenging", "The next Biennial should be in the second quarter of 2020.”The upcoming event, titled “The Future Is Present,” will focus on how to create a revitalized urban environment by 2023. The festival will feature forty artists from thirty-six countries and multiple regions of the globe. The inaugural edition, “Art Paris 2020,” was staged at the iconic venue in September. In a statement, artists will say: “Paris is still in the transition of rebuilding and reconstruction, of recovery and rebuilding, of the present and the future, of what is and what can be.”\n\n\nJin and Lee Sze, owners and operators of the popular Korean restaurant Hanukkah Bar & Grill in Seoul, have announced that they are preparing to open a new restaurant in the historic Hanukkah district in Seoul. The couple plans to open a mini-museum and an art gallery in the space that has hosted numerous cultural events, including a show of works by Korean artist Kim Cheol Seo, who was the subject of a retrospective at the Seoul Art Museum last year, and a New York–based nonprofit that is trying to preserve the Kensington East shopping district.They are also tapping local architect Woon", "The next Biennial should be held in 2021, but the organizers are currently evaluating whether to cancel the exhibition, which will run from March to October. In the meantime, the museum will continue to present exhibitions and events in the following formats: Themes by the master: a. Guadalajara, A.D. 13, and a.D. 15, as well as a variety of other exhibitions.\n\n\nThe Museums Association (MA), a United Kingdom–based nonprofit, has announced that it is drafting new regulations governing the exhibit-buying and display-buying practices of London’s Tate galleries as part of a campaign to protect the thousands of jobs at Tate. The organization hopes the new laws will help prevent the “unintended consequences” of well-intentioned legislation and will act as a roadmap for regulating the industry.Tate declined to budge from its position, which it has held since 2010, as it prepares to open a new exhibition space, Tate Modern, in the Tate’s former home in Fulham on March 15, 2020. The museum is also working on the redesign of its building, which will be completed in the spring of 2021, and is expected to begin welcoming visitors in the fall of", "The next Biennial should be held in 2022.\n\n\nAn exhibition of work by American and British artists William Eggleston and Antony Gormley, which was scheduled to open at the National Museum of Art in Washington, DC, in February 2019, was postponed until at least March 11, the New York Times reports.The show, which focused on Eggleston’s relationship with the New York theater scene in the 1960s, was supposed to open at the National Museum of Art this weekend. However, on Thursday, March 8, the exhibition was pushed back by a week, to March 11, and then postponed again. According to the New York Times, the exhibition has since been rescheduled for May 30–June 3.The move has left Eggleston and his colleagues feeling uncertain. In a statement, the artists said: “We have always maintained that the departure of curator Joachim Duarte was the final stage in our development as an institution. He has certainly been instrumental in introducing us to our own path, and in guiding our approach to work. He is a friend and a mentor to many of us and has made us realize that there is no other place in the world more valuable to art than the Museum of Modern Art", "The next Biennial should take place in 2021 and the seventh in 2022.”A year later, the National Geographic Society—which had moved from its parent company, the National Geographic Bioscience Institute, to the National Geographic Society—announced that it would be rechristened the Smithsonian’s National Museum of Natural History. The change was made in honor of Mamoru Hirano, a Japanese collector who opened a Japanese contemporary art museum in the United States in 2006. Hirano, who studied at the University of Michigan, founded the university in the late 1990s and has donated the museum to the Smithsonian. The institution holds twenty-six Hirano works, which were first presented in a 2007 exhibition at the National Museum of African Art in Atlanta. The museum will also soon unveil a Hirano-designed exhibition of 19th-century American art.\n\n\nThe third edition of the Constructivist Salon, which was organized by the Italian architectural magazine the Italian newspaper Grazia di Trettoli in Rome from January 7 to January 9, 2019, has announced that Valentino Boeri, the Italian architect whose sculptural works merge neo-Renaissance and modernism, has been named the winner of the 2019 Giulia di Trettoli Travel &", "The next Biennial should take place in the fall of 2020. The next iteration of the popular exhibition will be held in November 2021. If all goes according to plan, the museum will stage twenty-six exhibitions in the spring of 2022.\n\n\nThe Museum of the City of New York (MCA) has received a $500,000 donation from the estate of the late businessman and philanthropist Herbert and Dorothea Donovan. The gift comes amid the MCA’s ongoing campaign to raise funds for its forthcoming expansion, which aims to increase the museum’s exhibition-viewing area by forty feet.The donation, which also includes a map of the building and a collection of Donovan’s artworks, was made to the MCA in memory of her husband, Herbert Donovan. The donation is one of the campaign contributions that has been made by the family of five, whose wealth and influence helped shape MCA in many ways.The donation also supports the MCA’s effort to create a new location, which will open in 2020, for the exhibition of the family’s art. The new space will be named after Donovan’s late husband and will be on the ground floor of the museum.The donation is", "The next Biennial should be staged in the coming months.\n\n\nBarcelona’s Artur Planèt, which was acquired in 2018 by the city of Barcelona and the French government for $3.75 billion, is planning to open a new museum in the city next year. The institution, which will be located on the ground floor of the former Casa do Povo, and will be inaugurated in December 2020, will draw 20,000 visitors annually.The new museum—which will be built in the former former Casa do Povo—will be inaugurated with a special exhibition of work by the artist Georges Apostu and will house a museum of modern art. It will also provide spaces for community activities, an exhibition hall, and an auditorium. The institution will be equipped with a 500-seat auditorium, a café, and a library.Curator and art historian Hélio Oiticica, who has worked with Barcelona for more than five decades, said: “The project of building a new museum in the city is an extremely difficult one. The project could probably take five years. But we are committed to building the museum in a way that will give you the feeling that there is a great space here as", "The next Biennial should be held in 2022, and the next in 2021, and the next in 2020.  The 2019 event, entitled “All Things Fall Short,” was held at the Museum of Contemporary Art, Chicago; the 2019 exhibition was titled “Invisible Cities: Modern Art in the Era of the Spectacle,” and the 2020 iteration of the event will take place at the Geneva Biennale. The 2019 exhibition, entitled “Polarities: New American Art,” was presented by the Brooklyn-based artist Mpagi Sepuya, who is known for his installation sculptures, and the 2018 exhibition, entitled “In Situ: Art in the Age of Black Power” was curated by the late artist and dissident Kenyan artist James Overton. The following artists are participating in the 2020 edition:Arsène Ghent—The Mound, New York; Ivan Alshchik—Hearst Museum of Art, California; Alighiero Baratta—New York; Jule Meegwach, Tokyo; Nisha Batra, San Francisco; Janet McLean, New York; Nada Pindell, New York; Midori", "The next Biennial should focus on “Culture and the Body”\u0097a frequent concern of the biennial’s cofounders Tony and Beverly. The exhibition will also introduce a new sculpture by the artist, titled “Beverly and Tony”\u0097who, in a life-size ceramic sculpture, embraces the twin themes of family and work, both of which are central to the exhibition. As the sculpture is completed, Beverly will enter the Biennial’s exhibition space. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Sarah Andrews as its next executive director. She will be responsible for overseeing the curatorial and artistic direction of the organization’s Arts and Culture section, which has locations in the Museum of Modern Art, the Metropolitan Museum of Art, and the Whitney Museum of American Art in New York City, and is slated to begin in the fall of 2020.“Sarah Andrews embodies the very best of MoCA,” Tim Rosner, director and CEO of MoCA, said in a statement. “Her success story and commitment to supporting artists and developing the museum’s collection and programs make her an ideal fit for the museum. She has the", "The next Biennial should be held in 2020.”The museum also revealed that the exhibition will extend its programming across three new programming blocks in 2020. The first will focus on the history of Vietnamese cinema and will consist of four new topics: “Vietnam: From the Cinema to the Cinema” (20 June–1 October), “The B-Side, the B-Shades, and a Short Film on Cinema” (20 June–1 October), and “Taking Pictures in the 1960s” (20 June–4 October). The second block will be “Vietnam’s Film Production and the Cinematic Body” (10 June–25 June), “Film and the Modern Cinema” (25 June–7 July), and “Xavier Huyghe” (6 July–26 July). The third, “The Place of Vietnam’s Film in Cinema History,” will take place in the United States.\n\n\nA new group of artists and cultural workers is urging the German government to launch an international fund to save the cultural and historic heritage sites of the Nazi concentration and extermination camp Auschwitz. The site-specific fund would be set up under", "The next Biennial should remain in the same location, with the same cultural activity and the same programme, as the last one, and “we will continue to welcome visitors, among whom you will find the first exhibition of the new programmes, ‘Sochi 2020, which will be open in the city of Sochi from March 22 to March 28, 2021.”The reopening of the exhibition is slated for March 22.\n\n\nArt Basel Hong Kong announced today that Rony Allen will serve as its new global director for the United Kingdom from March 20 to March 22, 2021. Allen, who previously worked as an associate curator at the British Contemporary in London and as a curator at the Hammer Museum in Los Angeles, recently held the position of director of the cutting-edge studio and curated David Cage’s first show in the United Kingdom, “Sitting in the Chair,” at the Art Gallery London (AGL), where he will take up his new post later this month. Allen will assume his responsibilities at the London venue on March 16 and will work with curator Joanna Kamm and his team to develop the upcoming two-week tour of the United Kingdom.“This is a challenging time for all of us, and I", "The next Biennial should focus on biennial art, on the necessity of collaboration, and on the transformative power of art. The museum’s collection must be revitalized, its exhibitions and collections developed and expanded. “The Art of the 21st Century” is also an initiative of the Pérez Art Museum and the Museum de Cultura Artística, in Madrid. It will present the work of around sixty artists, including Dieter Bacher, Monica Brodsky, and Juelz Boullosa, in the center of Madrid, in the first exhibition of its kind. The show will be curated by Marta Barra, the curator of contemporary art at the National Museum of Modern Art, Mexico City. The new exhibitions will be organized as follows:• Art of the 21st Century, Pérez Art Museum and Museum de Cultura Artística, Mexico City. “The Art of the Twenty-First Century” will be presented by the National Museum of Modern and Contemporary Art, Mexico City, in the National Museum of Fine Arts, Mexico City; the Galería de Cultura Artía in Mexico City; and the Museo de Cultura de Sevilla, in", "The next Biennial should focus on the history of the exhibition, the artworks, and their upcoming exhibitions in the United States and Canada, which will be held in the coming months. The inaugural event, “Critical Art and the Eighties,” will receive a total of $9 million from the Biennial Fund. Will the Biennial Fund receive a contribution for the construction of the biennial? “Plans are currently in place to deliver a significant exhibition in the coming years,” said Andrew Wiles, director of the Biennials. “If the new building is built as envisioned, this will be the last exhibition the Biennial Fund will ever create.” Visitors to the biennial will be able to relive the exhibition with their own hands and will even be able to enter their own homes. In order to further protect the original exhibition venue, which is in the process of rehabbing, the Biennials have agreed to donate $100 million to the cause. The first show of the newly initiated program, “The Age of Devotion,” will open at the Museum of Contemporary Art (MoCA) in New York on October 24. The exhibition will showcase work by thirty", "The next Biennial should be held in 2022.  The exhibition “We are All In This Together” will be a celebration of the ride of 150,000 people who descended on the city to open a new art museum in the former Met installation space of the Tobaçe National Museum on May 15, 2019.  Tobycçe, the former mall, is now a museum with a theater.\n\n\nThe Box Office, the hand-picked jury that selected the next recipients of this year’s Cannes Biennale, has released the list of the eight biennial winners. The ten filmmakers who won the prize this year included Andre Gide, Nico Muhlenberg, Joe Wright, Joe Wright-Wheeler, Sofia Coppola, and Robin Guggenheim. The other finalists for the prize this year were Tom Hooper, Andre de la Pei, and Stephen Frears. The jury was chaired by the ex-editor-in-chief of Artforum, Jann Dehaene. The next edition of the Cannes biennial will take place at the Palais de Tokyo in May.\n\n\nThe French government is planning to limit the number of visitors to the Louvre in an attempt", "The next Biennial should be inaugurated with a reception for the artists who are working in the field. The theme of the exhibition should be “Sociology with a View.” The biennial is actually being organized by the German-based organization Einbalische Kunstverein Hamburg (EDK), which is affiliated to the Künstlerische Kunstverein Hamburg, Germany’s oldest and most prestigious arts institution. The exhibition will comprise works from a selection of the artist’s solo shows over the last decade.“When we think of the works in the exhibition, we see them as if they were weavers in a workshop,” said Kjetil Beinert, director of Einbalische Kunstverein Hamburg. “The exploration of the possibilities of photography and the exhibition of photography works is a way of bringing people together.”The exhibition will be divided into three parts, each showcasing a single artist: the first part will focus on the installation of a photograph in order to examine the movement of light in relation to the human body. The second part will examine the relation between photograph and the body through the work of three artists of African origin, including the talented Njide", "The next Biennial should take place in 2020 and will focus on the development and reorganization of the museum. The programme will be guided by a new project, “One Day at a Time.” The museum has asked that the theme of the exhibition be “Emotions and Stories,” and will also allow the question of “How do we care for the things that are within us, and at the same time encourage, support, and heal?” The pavilion will be divided into galleries and subjected to a virtual exhibition of works in the of the biennial.This year’s edition, “The Body,” will be held in both a physical space and a virtual space in the museum. The exhibition will highlight the work of contemporary artists who are concerned with questions of body and culture. The biennial, which was established in 2010 and is supported by a $25 million gift from the Turner Prize, is curated by Wendy Red Starcevic and is curated by Sajid S. Ali; one of the artists will be chosen by a panel selected by the museum. “The Body’s’s History,” which was organized by the current curator of Modern Art, Sh", "The next Biennial should focus on the impact of the global health crisis on the art and design sectors of our cities; on the city’s residential art district, the private art market and the urban environment; and on the city’s cultural and recreational spaces, including the arts and culture district. We hope that the 2018 edition will continue to reflect the vitality of our city and the vibrancy of our community.”Artforum will publish the full list of exhibitors on October 27.\n\n\nThe Museum of Modern Art (MoMA) in New York and the Yuz Museum in Beijing announced today that they are collaborating on a new collaboration that will bring more contemporary art and design to New York City. The project, titled New York/Beijing, will focus on expanding MoMA’s existing collection of modern and contemporary art by presenting new works created by artists and designers from Beijing and New York. The collaboration, which will launch in the fall of 2020 and will be supported by a $50,000 donation from Charles and Lucille King, will include a residency program for artists and designers, a residency center in a converted factory, and other initiatives.“This partnership reflects the multidisciplinary spirit of New York and Beijing,", "The next Biennial should be the only one dedicated to the artist’s life and work. The theme should be “The Life and Works of Pablo,” a title that should recall the artist’s work. \n\n\nThe Paris Museum of Fine Arts (PMA) has named Martine de Cournes as its next director. In her new role, de Cournes will lead the PMA through a transformation that will include the relocation of the museum’s collection from the nearby Louvre to the Musée d’Art Contemporain, in Saint-Tropez. De Cournes will also be responsible for the development of the PMA’s programming and the development of its collection.“We chose to move the collection to the Musée d’Art Contemporain for two reasons: firstly to ensure a long-term future for the PMA and to further develop our collection within the narrow constraints of the region; and secondly to enhance its accessibility to the Parisian art scene,” said Michel de Cournes. The move will also allow the museum to expand its collection by more than one thousand works, which is currently housed in its current home in Saint-Tro", "The next Biennial should be held in 2021. The 2019 event was held in the city from June to September. South Africa’s Architecture and Design Biennial, which was held in Cape Town from March to September 2019, was canceled due to the Covid-19 pandemic.The Art Newspaper reports that the South African Contemporary Arts Summit is still on track to be held in 2021. The event will also feature three new exhibitions: “Between the Sun and the Moon: Reflections on the Sun in South Africa” (March 9–March 22), “South Africa’s Architecture in the 1970s” (March 22–March 24), and “South Africa’s Architecture Today” (March 21–March 25). \n\n\nThe National Gallery of Victoria in Melbourne, Australia, has appointed Juliana El-Khoury as its new senior executive and director. El-Khoury will be responsible for support of the museum’s international expansion and operations; curating, exhibiting, and publishing internationally; and serving as a liaison for artists and curators from the Middle East, South Asia, and Africa, among other regions.“Juliana’s first and foremost legacy is her", "The next Biennial should be held sometime in 2021. \n\n\nArtnews has announced that the tenth edition of the London-based Biennial of British Art will return for its twenty-fifth iteration in 2021. The exhibition will also feature a selection of previously unexamined artworks. “It was a positive step to endow Tate’s Centenary for Art, which has been neglected by the museum for ten years, with a £10,000 grant to establish a new Tate-wide initiative to improve the exhibition experience,” director Adam Gopnik said. The initiative will reportedly focus on the exhibition of artworks previously unknown to the public. Tackling this issue is difficult, given continued cultural exclusion and institutional policy designed to protect and promote white art, and Gopnik feels that the best way forward is to have the biennial continue with Artforum’s current programming.\n\n\nThe Italian artist, designer, and producer Chiara Bertani has been named the winner of the Venice Architecture Biennale for 2018. Bertani’s environmentally conscious reimagined studio, the Lab during the Day, aims to challenge the mandate of architect-designers in Italy to create works that embody the aesthetic and technological aspirations", "The next Biennial should comprise a performance or an exhibition , composed of at least twenty-four artists who have been selected by a panel of curators and experts, which will be curated by a biennial veteran. The two-day event will also include an open-air pavilion in the museum. The biennial’s inaugural edition, “After Tomorrow,” was staged at the Yuz Museum in Beijing in 2016, and the first exhibition, “Theoretical Art in 1978,” was staged at the Museum of Modern Art in New York in 2001.\n\n\nTacita Dean, the director of the intimate contemporary art museum in Brooklyn, has been fired from her position at the Brooklyn Museum after she posted an Instagram post on Sunday, March 27, announcing that she will not be returning to the institution in 2021, Artnews reports. Dean, who was hired by the museum in 2014, made the announcement on social media in the early hours of the morning, which is when the panic broke out in the museum.According to the New York Times, the museum was already facing a loss of more than $300,000 when it closed its doors on March 27, and the loss of revenue was compounded by the fact that the", "The next Biennial should focus on diversity. Earlier this year, the committee voted to initiate a new program of programming that addresses issues of representation in museum exhibitions and public programming.Juliana Martinez, the executive director of the National Association of Art Museum Directors, told Artnet that the move to change the institution’s name was an “upholding of our values and our mission.” She added: “We are confident that with the new and improved design, the Biennials will continue to be an important center for sharing and engaging contemporary art and will continue to do so under the new leadership of the new trustees.”Since the announcement of the Biennial in May 2019, the institution has received numerous accolades and has established a reputation for its exhibitions. Two months before the exhibition’s reopening, it honored Barbara Streisand with a lifetime achievement award. In May 2020, it was one of the first arts institutions in the United States to stage a collaboration between Disney and the Los Angeles County Museum of Art, a show that explored the relationship between cinema and Southern California.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) opened its new eight-story museum on the Upper East Side on Thursday, April 3", "The next Biennial should be held in 2020-17. The residency program, which was established to promote and protect the work of the rare, contemporary artists working in the Bay Area, has supported seventy-five artists from twenty-five countries since its inception in 2007. “We hope that the new position will provide an opportunity to develop new opportunities for our artists and to promote the work of our past,” said Kate Flanagan, chair of the board of trustees. The biennial will be hosted in a new private museum, the Kenwood Museum of Art, in Oakland. The institution will also reopen with a visual arts festival, a luncheon celebrating the biennial, and other programming in two stages. The first phase will run from February 22 to March 10, 2020. The second phase will run from March 18 to March 23, 2020.\n\n\nThe Louvre has awarded a prize to the Japanese artist, director, and programmer Tatsuya Takahashi for his contributions to visual art—including the highly influential film: Butterfly, 1966, which features the eponymous butterfly (played by Hayao Miyazaki), the protagonist of Studio Ghibli’s The Wind Rises, and a desert scene from the movie Ō", "The next Biennial should take place in 2021. \n\n\nThe Canadian National Galleries (CNG) will soon house the works of thirty-three artists, including the late Canadian painter Jean-Michel Basquiat, the pioneering African American painter C. L. R. James, the British artist Philip Ladd, and American painter Kenneth Noland. The institution will hold the exhibition “Creating American Art” at its Montreal outpost, the Gallery du Grand-Duc, in May of 2021.According to the New York Times, the twenty-first exhibition of the Collection will be held at the Museum of Modern Art in New York in 2021. The show, titled “Franz Klammer: Minimalists” will consist of photographs, sculptures, drawings, videos, and installations. Based on his work in the 1960s and ’70s, Klammer was one of the first artists to create a full-scale sculpture from a four-dimensional painting.Klammer’s sculptures have been exhibited at the Museum of Modern Art, New York (2010); the Museum of Contemporary Art, Tokyo (2008); the Museum of Contemporary Art, Chicago (2016); and the Metropolitan Museum of Art (2017). He was", "The next Biennial should be held in 2021. The museum’s current exhibition, “The Body in Art,” which is on view through May 25, 2019, has yet to receive a guarantee for its future.\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Meredith Armstrong, the director of the San Fernando Valley location, as its next director. Armstrong was appointed in January 2019 by the board of trustees of the Los Angeles County Museum of Art (LACMA), which consists of forty-four buildings, including the Los Angeles County Museum of Art (LACMA), the San Fernando Valley Museum of Art, and the Pasadena Art Museum, to serve a three-year term.“Meredith brings to our work at LACMA the breadth of experience needed to continue to advance our exhibition-based, education-driven, and research-driven programs, which have proven transformative for many communities in Southern California over the past decade,” board chairman Mark Rinaldi said in a statement. “I look forward to working with Meredith and the LACMA board to further the institution’s mission of celebrating and explaining the art of the Pacific Northwest.”Meredith is currently working on a book", "The next Biennial should take place in 2020.”In an alternate universe, the 2020 event would have been staged at a space that had already hosted the event in a capacity that was close to “complete” between 2017 and 2018. Those who were invited to participate in the exhibition were asked to lead “an exhibition of works that are a reflection of our contemporary life,” and the work of Ara Nisar, which was on display for the first time, would have been a “portrait of a young woman.” “At a time when we are divided by war and conflict and hate, and we are drowning in a sea of enemies and allies,” Nisar wrote in a letter to the organizers, “it is my intention to use the exhibition to draw attention to the historical roots of the present conflict and to draw attention to the ways in which the conflict adds fuel to the flames of violence.”\n\n\nThe funeral of the Israeli archaeologist, who was murdered by an angry mob in Jerusalem on January 3rd, is being held at the Al-Aqsa mosque in Jerusalem’s Old City. The killing sparked demonstrations by Palestinians, many of whom condemned the police and military�", "The next Biennial should focus on issues of change, and move beyond the biennial stage into the public sphere, focusing on the ways that art can be of assistance to those most affected by the pandemic. The first edition of the event, held in Miami Beach in 2009, was a response to the coronavirus, which was first reported in Wuhan, China, in December 2007, and was held in March of that year. It was canceled at the last minute, and the series was resurrected in 2012 in Miami Beach, this time with the theme, “Imageless.” The 2017 event, titled “Imageless: The Art of the Impossible,” was completed and staged by the Los Angeles–based nonprofit Artadia\u0097which, along with organizations such as the Council on Contemporary Art, staged the first installment of the inaugural tour in 2007\u0097and was held at the LA County Museum of Art, which has not reopened since it closed in 2017.The LA Times reports that the theme for the 2020 edition, which will reintroduce the film The Imitation Game, originally created by Italian director Paolo Baratta and starring Jennifer Connelly, will be “Imageless", "The next Biennial should be held in 2022. The plan is to open the biennial in the former V&A in Cardiff, the former home of the National Portrait Gallery, in May 2021.There will be a unique cultural experience to see and experience Cardiff, with a five-day, open-air exhibition of the work of leading contemporary artists, and a book launch celebration in early 2022. The final exhibition in the series will be a new exhibition of work by the Biennial’s Mandy Els, a selection of work by the Contemporary Artists’ Association, at the East Wales Museum (EBM), in September 2022.\n\n\nThe public art project Titan is facing an uncertain future as it prepares to close its doors for the second time in its seventy-five-year history. The Athens–based nonprofit, founded in 2005 by G.K. Kepes and Katerina Kepes, was given a $1.25 million loan from the Künstlerhaus in 2015 to run a series of critical events and reopened in 2017, with Kepes and Kippo Budda, as part of a group that also comprises artists such as Katerina Zaldie, Niccolo Bech,", "The next Biennial should include a discussion of the role of art history in shaping our understanding of the role of the visual arts in recent cultural history. The first exhibition is currently on view at the Museum of Contemporary Art Miami Beach, which is owned by the Miami-based Hispanic charitable organization the Greater Miami Cultural Alliance. The Biennial will have a fixed number of twenty-four artists, and will feature a selection of works that were exhibited at the Contemporary Art Museum Miami, Miami Beach Art Museum and the Art Institute of Chicago. The first show of the new artwork-based Biennial is currently on view in the museum.“The 2018  show was innovative and critically acclaimed, but was shuttered due to the Covid-19 pandemic,” said Jorge Gonzalez, director of the Biennial. “We are now excited to share it with you in the summer.”\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Jennifer Boysen as its next president and CEO. Previously, Boysen served as vice president of curatorial affairs at the Brooklyn Museum and worked as director of exhibitions at the Whitney Museum of American Art. She succeeds Ruth Porat, who has helmed the museum since 2009, and", "The next Biennial should be the last, and should be held in the autumn, in September 2019. The twenty-fifth and twenty-eighth editions of the exhibition are currently on view at the Museum of Modern Art and the Museum of Contemporary Art Chicago.\n\n\nThe Royal Academy of Arts (RA) in London announced today that its board of governors has voted to cancel the 2019 edition of the National Poetry Slam, which was originally set to run from March 28 to March 31. The event was canceled due to Covid-19, and the society received $75,000 from the government in support of its effort to minimize disruption to the healthcare and social services sectors following the pandemic.“The board felt it was in the best interests of the Royal Academy of Arts to focus on international exchange and on the safety and well-being of the community, and on the forthcoming Royal Academy of Arts (RA) 2020,” said the academy’s executive director, Adam D. Weinberg. “Covid-19 has made clear that there is still a great deal to be done before we are able to implement the best possible response to prevent the spread of Covid-19, and the lack of such an event has been a major", "The next Biennial should take place in 2020.\n\n\nPioneer Works (Pioneer, NYC) announced today that it has received a $25 million donation from the Alfred P. Sloan Foundation. The grant, which comes with a lifetime achievement award, was made in recognition of its contributions to the arts and humanities. Pioneer cofounder Edward Dees and his wife, Jennifer, are longtime supporters of the foundation and its programs. The foundation also gave $10 million in support of the creation of the Alfred P. Sloan Foundation, which was formed in 1978 to further the work of Edward Dees and his family. Pioneer’s initial grant of $10 million was established in 2002. It has since provided more than $500 million to support the work of over seventy artists. Pioneer will now step back to give the foundation a $25 million grant in recognition of its contributions to the arts and humanities. The William C. Johnson Foundation will receive a $5 million grant in recognition of its contributions to human exploration and diversity of thought. The $25 million will be used over three years.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York announced today that it will begin welcoming visitors back to the", "The next Biennial should be held at least once every two years. The goals of the Biennial are to: “detect, conceptualize, and synthesize contemporary art from around the world; “explore the limits of art as a medium; “explore the relationship between art and the human condition; and “explore the interconnectivity of art and life.” The second edition, titled “Art 68/74,” will be held at least once every two years. The 2020 theme is “Theus und einem,” a reference to the artist-bund, in which the subject is a bronze sculpture by the German artist Wilhelm Theus. The 2020 pavilion will be curated by Sonia and Byron Mullen, director and CEO of the American Center of the Works of Art, a nonprofit group devoted to preserving and presenting contemporary contemporary art. The group will receive $15,000 in support of the inaugural event. The theme of the 2020 pavilion is “Trust, Responsibility, and Sustainability.” The MFA is collaborating with a number of artists and organizations in an effort to increase and extend the reach of the group", "The next Biennial should be in 2022. It will also strengthen the Cultural Exchange and the partnership between the two countries through a series of exhibitions, residencies, and scholarships. The second and third annual Biennials will take place in the same locations as the first and second. The third and final Biennials will take place in the same locations as the first and second. The ten-year celebration of the Biennials will be guided by a new artistic director, Emmanuel Fauvage, who will serve as the chief curator of the 2020 event. Fauvage will also oversee the programming of the biennial. Founded in 2010 by two French artists, Adrien and Yves de Menil, the exhibition was created in honor of Henri Cartier-Bresson and will run through the end of this month. The event will also present the first biennial, made up of work from the collections of Jean-Luc Moulène and Hélio Négret, and will present the first ever retrospective of a contemporary artist working in China. The exhibition will open on November 8 and will run until December 6. Commenting on the theme for its third edition, Fau", "The next Biennial should take place in the fall of 2020 and will be hosted at Washington Square Park in New York. According to Artnews, the park’s current tenant, the eponymous sculpture garden, which is located on the park, will be transformed into the 19,000-work exhibition. The renovation work, which was completed in 2017, is being led by the New York–based firm W.G. Mott.This show will include works by less established artists such as William Eggleston, Decheux-Marin, and Tashige Muto, among many others that are currently on display in the venue, which was commissioned by the park in April 2019. The museum will also be revamp by turning the building into a series of rooms, which will include a gallery, classrooms, a lecture hall, a reception room, and rooms for delegations and other events.The next iteration of the biennial will take place at the Hammer Museum in Los Angeles through December 30. Its first show will be the biennial “This Is Not a Game: Contemporary Art from the Americas” in January 2020.\n\n\nArt historian and curator Ian Fletcher, the author of The Empty Space Between, 1946–1965,", "The next Biennial should take place in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is moving forward with an expansion, dubbed the Museum of Contemporary Art LA, that will include a more technologically advanced, glass-enclosed plaza and will introduce more modern art and architecture to the city’s Mission District neighborhood. This construction will be completed in phases to increase the museum’s visibility in the city.“We’ve had several conversations in recent years about how we would like to transform our neighborhood into a new kind of museum,” said museum director Alex Fallah. “This is a great opportunity to accelerate our engagement with our neighbors, and we’re committed to working with everyone in the city to make that happen.”Since the expansion is slated to launch in 2021 and to run through 2028, the museum’s board of directors decided to postpone the planned opening of the new building, which will expand the museum’s collection by tenfold, until at least 2022, when the institution will reopen to the public. The move has been made in order to allow MoCA the time to complete its construction and design, the renovation, and expansion of its", "The next Biennial should be held by the end of the year. A second Bribery Award, for “Theoretical Research” will also be presented at a later date.\n\n\nAs the two-year anniversary of the devastating 2010 Beijing Olympics approaches, arts professionals in China and Hong Kong are warning that the coronavirus outbreak may be a temporary setback. “This is only a partial victory,” art dealer Li Hao, who ran a Hong Kong gallery in the 1990s, told the Art Newspaper. “If the virus spreads to the mainland, the situation could worsen.”Li added: “I am optimistic that we will be able to recover from the coronavirus and we need to focus on rebuilding our businesses. We are still in the early stages of the recovery process, and it will take a long time before we can reopen. But I think we can survive the crisis.”Artists in Hong Kong, where the coronavirus was first confirmed in China in March, are facing a similar fate. On Thursday, the Hong Kong Chinese Art Museum and Botanical Gardens announced that it is closing its doors permanently and will postpone the opening of its new exhibition space, which is currently on display", "The next Biennial should take place at the new Asian Art Museum, designed by London-based firm Pritzker Prize–winning architect Thomas Heatherwick. The museum will host the inaugural exhibition of the internationally acclaimed duo, Ming Pang Wei and Hoa Nguyen. Li will also oversee programming for the new museum, which will open in 2020. The royal commission was organized by the Museum of Contemporary Art Hong Kong (MCA) and the Chinese Consulate in Japan.The royal commission was approved by the National People's Congress, China, and will be implemented by the National People's Congress in Beijing. This will be the first time the museum has hosted an exhibition of the duo’s work, which comprises three works, each of which are set in a different historical context, and will introduce more diversity to the museum’s collection.The exhibition “A Project of Three Artists: Ming Pang Wei and Hoa Nguyen” will be on view until March 22. Commenting on the pairing, Li said: “The exhibition and the new museum are different ways forward of the same intention. It is a project of three artists, of whom the artist is a great main character, of whom the museum is the center", "The next Biennial should be held in 2022, and the next in 2021. All of the above mentioned dates are on schedule. The current showpiece of the exhibition is the first exhibition of the new series: a six-thousand-work collection comprising long-out-of-print works on paper by the French Surrealist Jean-Luc Moulène.  Advertisement\n\nDavid Koechlin, the director of the Museum of Contemporary Art (MoCA), Los Angeles, announced today that the museum is planning to open its first permanent location in the United Arab Emirates in 2021. Koechlin previously directed MoCA from 2007 to 2009, when it relocated to the city of Alserkalān in the Emirate’s southern province of Sharjah. The museum will be housed in a renovated Victorian-era building on Wilshire Boulevard in the city’s West Village.Koechlin’s hiring of Bruno Rondinoli as director of the museum—the director of the Metropolitan Museum of Art—was hailed as a bold move, especially since the appointment coincided with a major rethinking of the Met’s collection strategy. “The appointment reflects a thoughtful decision by David and continues the", "The next Biennial should take place in 2021. “In the longer term, we are working towards going further afield than the exhibition of a single exhibition per year,” said Osman Eissa, director of Fondazione Cinecittà. “The museums of the moment, regardless of their size, are able to show a certain range of works to an international audience, and this is an opportunity for them to do so in a sophisticated way. It is also an opportunity to create new shows that are representative of the tradition and of the region in which they are set.”  The sixty-six-year-old artist, who usually comes up with new projects by himself, started producing works of art in the 1980s, when he lived in Milan, and has exhibited them in the Milan Biennales in the early 1990s, the Milan Museum of Contemporary Art in 2005, the MCA in 2009, the MAMCO in 2010, and the MCA in 2012. His first solo exhibition at the National Museum of Modern Art (MoMA) in New York was ten years ago.\n\n\nArtforum has learned that the Los Angeles County Museum of Art (LACMA), which has been working", "The next Biennial should be held in 2021. The next edition of the London-based fair “will cover the themes of identity and community, art and politics, and art and architecture,” organizers said in a statement.\n\n\nAn eighteen-by-eight-foot bust of Benjamin Britten, a nineteenth-century French painter whose work describes a utopian world of organic shapes and electromagnetic fields, will be installed in front of the Museum of Modern Art (MoMA) in New York next month. The work, titled Britten’s Cosmogony, and a part of a series titled “L.A. and Me,” was created by Richard Diebenkorn and Gabriel Malina, and depicts a landscape of concentric rings, each surrounded by a canopy of colored smoke. The artist’s followers believed that the smoke would reflect the light of the sun in different colors, giving the illusion of depth and shape. The works were inspired by Diebenkorn’s own childhood dream of building a house from clay, and by the city of Los Angeles, which was in a similar state to Britten’s.According to the Los Angeles Times, the sculpture, which was created by Richard Dieben", "The next Biennial should be set up in the spring of 2021.<|endoftext|>The British Film Institute (BFI) has announced that it has commissioned artist creation studio Think Tank, an organization that works in collaboration with artists to produce works that address issues such as gender, environmental, political, and religious oppression, and has won the first prize at the project’s inaugural BFI Award in partnership with the Feminist Art and Design Awards. The $250,000 prize, which also honors the performance of an exhibition at the exhibition, will be presented at the Best Picture Award ceremony at the institute next month.The group’s work, called “In Defense of the Body,” was created to celebrate the work of British artist Bettina Coyle, one of the three women who made the final final on the inaugural BFI Awards. Coyle’s work, titled The Body and Death, juxtaposes sacred geometry with feminist critiques of violence, gender nationalism, and oppression.“Think Tank’s latest project for the BFI Awards is the art installation In Defense of the Body,” a work on glass that is made of twenty-one pieces of art that collectively represent the body and its inherent destructiveness,", "The next Biennial should have been held in March but was pushed back due to the Covid-19 pandemic.   It will be up to the City Council to decide how to proceed with the installation of artists, institutions, and venues for the event. “We will continue to present the most important contemporary work from around the globe, and we will continue to do so under the following new leadership,” said Mayor Bill de Blasio. “When the new leadership team is in place, the City of New York will continue to present the most important work of our generation at every location across the boroughs, including the Bronx, the Staten Island, and the West Village.”\n\n\nGerman gallery Lutz Bacher, who served as a trustee of the Arts Club Berlin (ADB), which was awarded an $18 million gift from the Billionaires Club of Berlin, has resigned from his position. Bacher, who was the head of the Club since 2003, said that the decision to step down was mutual. “It was not an easy decision, but I believe I have made the right choice,” Bacher told the Art Newspaper. Bacher told the Art Newspaper that he accepted the contribution", "The next Biennial should be held within the next five years.”Since the institution was founded in the 1920s, the museum has been recognized for its commitment to representing and showcasing the diverse histories of encyclopedic collections. The biennial, titled “The Beatific Vision,” was staged by Dutch curator Willem de Kooning in 1948 and was the first major retrospective to take place in the United States. The exhibition emphasized the complex history of Beat’s and became a landmark in the history of art. The exhibition was a major step in the museum’s development as a cultural destination in cities such as Amsterdam, New York, and London.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has announced that it will invest $150 million into renovating and expanding the museum’s holdings of the late American artist and activist Harry Belafonte, who championed LGBTQ rights and championed artists such as Georges Apostu and Jasper Johns, among many others.The $100 million expansion, which will include new galleries, an installation pavilion dedicated to artist-built environments, a public gathering space, and additional curatorial spaces, is part of a larger plan to expand the museum’s collection beyond Louis", "The next Biennial should take place in 2021-20, according to a statement from the Qatar Foundation. The museum once again emphasized that it has not made any decision regarding the future of the exhibition in an interview with the Art Newspaper on Tuesday. “The Qatar Foundation has not made any decisions regarding the future of the exhibition,” the foundation said. “We are working hard to understand the importance of what is to come, and how we will be able to support the museum.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MCA) has announced that it will reopen to the public on Sunday, January 27, 2021. The permanent exhibition will mark the museum’s 150th anniversary as a cultural institution and will feature works by fifty-six artists, including Margaret Mitchell, Ray Harryhausen, and Ralph Waldo, Jr., and will also include new performances, performances, and installations. The inaugration ceremony will take place at 5 PM on Sunday, January 26.“\"We strongly believe that the opening of the exhibition represents the future of the museum and the institution,” said John Lassen, the director of MCA. “The museum’s 150th anniversary", "The next Biennial should include the exhibition “After Capitalism” (2019); an exploration of the relationship between artists and the environment (2019); and a reconstruction of the twentieth-century.The New York–based artist Marlene Corrigan, who died in 2008, and her husband, John Corrigan, are the founders of the New York Art Institute (NYAI), a nonprofit organization dedicated to the study of contemporary art. The institute is also responsible for the exhibition “The Bodies of Steel: Art in Motion” (2001), a collaboration with artist and educator Mary Cassatt that was staged at the Museum of Modern Art and the Museum of Modern Art in New York; “The Body of Work: Art in Motion” (2001), a tribute to Alfred Stieglitz that was presented at the Charles Egan Gallery in New York; and a retrospective of work by Joan Armatrading that was staged at the Whitney Museum of American Art in New York. The latter show closed on May 28, and the former reopened on June 1.The event’s inaugural group show featured work by Ingvar as well as Richard Serra, Olga Rubchinskiy, and Harry Goldsmith. The theme of the", "The next Biennial should be held in the spring of 2020. For a year after the event, the museum will host exhibitions, performances, conferences, and educational programs, including a two-day workshop on “The Caravan: The Art of Transition,” which will introduce the Biennial’s international audience to the project of an “autobiography.” The third and final editions of the show will open in 2021 and 2021, respectively. The project comes at a time when the term biennial is being used more broadly to describe a series of events, including exhibitions, residencies, and book signings, that is held in order to serve as a springboard for public engagement with the arts. The newly created Royal Biennial of Alex Ferguson, for instance, is planning to hold four exhibitions concurrently. Biennial director Jane Farson said: “Over the next twelve months, we will continue to adapt and innovate to meet the needs of our audiences. The future of the Royal Biennial of England, for instance, will include multiple ways of engaging with contemporary art and will not be defined by the exhibition of this year’s exhibition, but will be defined by the exhibition of a new collection of works by artists whose", "The next Biennial should be held in 2021. \n\n\nThe Association of Independent Colleges (AIC) announced today that it is in the process of revamping its organizational structure and will incorporate two new and different models for awarding degrees. The organization’s president, Emery Clarke, said: “We are working to articulate and articulate the anthropology of modernity in a way that reflects both the region and the state. The first stage is to reevaluate the institutions’ relationship with their campus communities, the second to reassess the institutional relationship with the surrounding landscape. This is a process, not an event.”“AIC has been working to articulate and articulate a new kind of college,” Clarke said. “This is a process not an event. When we think about the future of college, we think not about the past, but about the future. It will take a number of years before we can say when this new AIC will finally take place, but in the meantime, we are very much looking forward to this week’s launch of the new College.”\n\n\nThe Bessies, a New York–based nonprofit devoted to supporting artists with outstanding academic commitments through the retirement of their artworks", "The next Biennial should celebrate the history of the Art Gallery of Ontario, which opened in 1892; the Toronto Art Gallery, which opened in 1995; and the Toronto Museum of Art, which opened in 2017. The 2020 team will include members from the five other Toronto-area museums: the Toronto Archives, the Toronto Art Gallery Foundation, the Toronto Art Gallery, and the Toronto Art Gallery, and will organize a contest to recognize the achievement of the twenty-fourth year.\n\n\nThe Scottish National Gallery (SNF) in Edinburgh and the Institute of Contemporary Arts (ICA) in London announced today the collaboration of artist and conceptual designer Iain M. Banks, whose vast practice encompasses installations, performances, photography, sculpture, video, and installation, and writing, and a collection of more than eighty works, Abandon All: The Untold Story, and as You Lay Dying.“John Ward, of the ICA, and Iain M. Banks, are intertwined through a history of collaboration and shared histories with a history of radical experimentation and a history of imagining and daring to be realised,” said Banks. “Together, through the work of opening up new worlds and sharing our histories, we have created a unique and bold vision", "The next Biennial should focus on “eco-architecture” (in this case, a term coined by Robert Mapplethorpe to describe the practice of landscape and urbanism, popularized by Tony Barber in his 1972 book The Ecologist), with a view to establishing the foundation for a new institution.“We are currently reviewing the proposals, and we intend to invite a group of architects and curators for a special exhibition on this theme,” the festival said in a statement. The show’s inaugural iteration, titled “From Design: A History,” will present work by nineteen artists.\n\n\nThe National Museum of Canada has added two new members to its board of directors: Stewart Gilchrist and Victor Kwong, who will serve as cochairs of the institution’s twenty-second biennial, “Landscapes of the World,” at the National Arts Center in Ottawa this fall. Related to the biennial, which was organized with the Ottawa Cultural Association (OCA), is a public landscape program that will draw from the work of a dozen artists, including Jason Aldridge, the Canadian artist who won the Prix d’Art Contemporain in Beijing in 2017,", "The next Biennial should focus on the history of Yalta, and should include a show of works by the artists who worked with the city’s Grand National Palace on the grounds of the Kremlin before the outbreak of the Second World War. The pavilion will be inaugurated by the shortlisted artist Oleg Salakhutin, who will be included in the exhibition “Berlin in the Years of the Third Reich: From the Palace to the People” (2015–16) and “Camille Blatrix, Symbol of a New German Spirit: From the Palace to the People” (2003–2004) together with a group of other artists. The next exhibition, “Holocaust Museum and Library: Sculpture and Memory” (2019), will be staged at the Nationalgalerie Berlin.\n\n\nThe City of New York announced today that it plans to spend $3.5 billion to remake its urban core by 2023, a budget considerably less than the $5.5 billion the Governor Andrew Cuomo outlined in his 2017 state budget, and an increase of almost $800 million over the $3 billion that the city already spent on the project. The redesign, which is focused on the city’", "The next Biennial should be the inaugural show at the Museum of Modern Art, which will open in 2021. The exhibition, titled “Annie Under as Designed,” will focus on the exhibition of work by Darrow Pinchot, Tunga, and other painters whose practice spans the globe. The exhibition will also include a documentary and a first-person piece by Lukas Antonovich.\n\n\nThe Museum of Modern Art and the West Wall Museum in Jerusalem have announced the opening of a new exhibition dedicated to the late Israeli designer Tzvi Chern. Titled “Tzvi Chern: Clean Slate,” the inaugural exhibition will include a workshop for students from the Department of Modern Art at Bar-Ilan University, in Tel Aviv, a series of lectures, and a public lecture by the late American designer.The venue, which will be inaugurated by a new work by the American artist Keith Haring, will host the exhibition “The Struggle for Beauty” on November 21. The show will feature nine works by Chern and will be organized in collaboration with the Bezalel Academy of Art in Jerusalem. Comprising the works in question—“Regard of Beauty” (1976), �", "The next Biennial should focus on “value over quantity,” Bardet said, referring to the exhibition. “Of course, the only way to do that is to talk about what it means to be, to perform, to be present, to be alive in your work and in each other.”The platform was established by The Place, the private nonprofit organization that represents the artists represented in the exhibition, and the Chicago Humanities Museum (CHM) in an attempt to provide an alternative way to think about art and the world. The following year, the Biennial included artwork from seventy other countries.“We are hopeful that this year’s Biennial will deliver a new set of questions that will address the themes of value and how to form meaningful relationships with one another and the world,” said Biennial curator Molly Schwarzenbüche. The 2019 edition of the Biennial, titled “Hope Amides,” was held at The Benton Museum of Art in Athens, Ohio, from March 3 to March 5. The show featured work by seventy-four artists in sixty cities and ten countries and was organized by the New Collective in collaboration with the artists in the ’70s. The show is", "The next Biennial should take place on March 22–March 25, 2020. Currently on view in the Park, the exhibition will present work by seventy-seven artists, spanning from the twentieth century to the present day. The 2019 biennial, which was curated by Amanda Halsey and of which artist attendance was the overwhelming focus, attracted more than 3,000 visitors. An open call for artists is scheduled for April 13–April 15. The 2019 exhibition was organized by NADANYC in partnership with the New York City Department of Cultural Affairs. “This year’s edition features a stunning selection of exhibitions that exemplify the spirit of the City by tackling the central themes of our time,” said NYC Mayor Bill de Blasio. “This year’s Biennale is a global celebration of artists, and of the City of New York, and we look forward to welcoming visitors to the biennial next year.”\n\n\nThe Los Angeles County Museum of Art (LACMA), which recently announced the launch of a new platform dedicated to the maker-artist community called MakerLab, has announced that it has raised $55 million to expand its programming. The funds will go toward capitalizing on the growing", "The next Biennial should take place in 2021. “The last year of my two-year contract has come to an end, and I have no plans to step down,” the artist said in a statement. “I am grateful to the 27 artists who have participated in the Biennial and to the Board of Trustees for their trust and confidence in my vision, work, and art. And I am more than happy to take on new projects.”\n\n\nArtists and collectors from twenty-eight countries are proposing a new international standard for the cataloguing of works of art, and for its listing, listing, and cataloguing. The project, which has been in the works since 2015, was inspired by a discussion between American and European art collectors in the summer of 2019, when a new exhibition of works by American artists, curated by Paul Gauguin, opened at New York’s Museum of Modern Art. The Museum of Modern Art has since followed up with a statement saying that it is “committed to continually exploring new ways to build on the founding principles of the work to be listed and catalogued.” The publication of the guidelines will also help expand the field of art-historical research.", "The next Biennial should be held in the spring of 2021. The institution will also invite twenty-two artists, including Yoko Ono, Tanya Bonakdar, and Akiko Nakajima, to the Palazzo Bernardo in March 2021. The second edition will be held in the fall of 2021. The exhibition will also receive a new twenty-one-foot-long stage designed by the architects Hui-Hsi Huang and Wai-Chien Huang. The exhibition will be hosted by the Italian architect Dario Catellani and the Swissï artisan Jean-Claude Verna. It will run across six buildings in the historic city of Naples and will be curated by the same team who developed the exhibition “Ticopods” in 2006.\n\n\nThe French Ministry of Culture and the Ministry of Education have announced a partnership that will see the collection of works by Maurice Blum and Anne-Marie Russell transferred to the United Kingdom. The move is part of a wider plan to make the art world “more accessible” and “more modern.”The move follows the recent announcement that the works will be returned to Blum and Russell, who are based in Paris, in a ceremony", "The next Biennial should be held on the campus of the Clinical Scientific Center, in the fall of 2019. The usual opening date for the exhibition is March 9–March 12.The exhibition will also include an opening reception on March 12, followed by a lecture series on March 20, and a public ceremony on March 27.\n\n\nThe first permanent public art project of the California Academy of Arts (CalArts) has been launched in the city of Los Angeles: the Los Angeles Contemporary Art Museum (LACAM), which was established in 2006 as part of the redevelopment of downtown Los Angeles. Named after one of the city’s original landmarks, the museum will house around 1,500 works by contemporary artists including Rachel Whiteread, Joseph Beuys, Naomi Johnson, and Hockney Knight. LACAM will also include a new room dedicated to the San Francisco Bay Area, a new collection of works by contemporary artists such as Jack Conte, Brian Jacques, and Frank Gehry, and an exhibition of work by local, regional, and international artists.The project was inspired by the opening of a new cultural center in the city in the spring of 2018, and was supported by a $75 million gift from art collector and philanthropist Erik", "The next Biennial should be held in 2020. \n“I am very much looking forward to collaborating with the artist and to using her work to enhance the work of other teams and to adding to the collection,” said Kunsthal Aarhus curator Katja Johansson.   “Her work opens up new perspectives for how we think about art and the world. I hope that the exhibition will be a good introduction to her body of work and a good reflection of the current situation.”The exhibition will take up the themes of privacy, migration, and consent and will draw from public collections and will be organized with an international team of researchers led by artist-in-residence Sabine Halsbro. The selected artists will be presented with a gift from Kunsthal Aarhus and the Augustinian Max Lindholm, and will be invited to return to the department for a new exhibition. \n\nAfter a collision-damaged museum in China shuttered on February 23 because of the coronavirus, the country’s Central Museum of Art and Art’s branch in Beijing decided to reopen on March 2. The reopening of the museum, which has been closed since March 19 because of the coronav", "The next Biennial should focus on the visual arts, where it will showcase newly commissioned works by artists from the Philippines and will feature a performance by Philippine artist Alvin Año.   The 2019 edition will be hosted by the National Museum of the Philippines. \n\n\nThe Royal Academy of Arts in London has appointed Nicholas Cullinan as its next director. The appointment, made in collaboration with the Royal Academy of Arts and the National Arts Council, comes on the heels of the Royal Academy’s decision to revoke its founding charter and re-open with a new charter, which was published last month, and raises questions about whether the institution will be able to continue with its original mission and operating budget without the impact of the coronavirus, which has sickened more than 124,000 people in the Philippines since March 26.The Royal Academy of Arts (RA) is about a hundred miles north of the city of Oxford, England, and is a nonprofit nonprofit organization, run by the members of a Royal Society of Arts (RSA), whose membership includes artists and scholars. Its charter states that it is a “recognized voluntary educational institution” and that it “does not accept funding from any commercial or political entities” and that it �", "The next Biennial should take place in 2021, with the first exhibition to be held at the new venue scheduled for 2022. According to the Arts Council, the new venue will provide a more intimate setting for the international art fairs, which will be held in a 275-year-old medieval fortress in the village of Saalfjordo, in the centre of the capital city. “From the very start we have been convinced that this was a unique opportunity,” said Kayode Sadao, the executive director of the Art Council. “With the completion of this project, we are confident that the new pavilion will become a new kind of international gathering place. Our ambition is to further develop the exhibition programme, to shape the pavilion and to provide a platform for artists to showcase their works.”\n\n\nThe Seattle Art Museum (SAM) recently received an extraordinary gift from the Seattle-based philanthropist and collector Mark Siegel. The $6.5 million donation allows the institution to finalize its redesign, opening on January 18, 2020. The redesign, which will feature multiple new galleries and an expanded public art garden, will increase accessibility for visitors by increasing the height of the main building. The institution will also introduce a", "The next Biennial should take place in the summer of 2022. The next Art Biennial should be held in the fall of 2022. The next Art Walk should be held in the autumn of 2022. The next Art Fair should occur in the fall of 2022. In addition to the above, the Mumbai Art Festival, the Art Asia Pacific, the Mumbai Art Summit, the Art Barcelona, the Mumbai Art and Architecture Festival, and the Art Dubai are all scheduled to take place, as are other international art fairs.\n\n\nThe Dusseldorf-based nonprofit Artforum announced today that it is withdrawing from a six-figure contract with the Swiss Institute in Berlin, which was awarded $51 million in 2018. The decision means that the organization will transfer the artworks to the Dusseldorf-based collective N4CAT. The future of the contract is unclear.The contract was between the Fabian Brecher Foundation and the Wolfenbieternische Kunstverein in Dusseldorf, Germany, and was to be implemented in 2019. During the contract period, the foundation donated a total of $63 million to the university. It also undertook several large-scale projects, including building", "The next Biennial should take place in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is working with the Institute of Contemporary Art (ICA) in Singapore to launch an initiative to help small and midsize galleries in the United States. The initiative, which will focus on the exhibition of new artists and their work in the nearly 600 galleries within the institution, will simulate the opening of a museum in Singapore so that museum goers can have a chance to see work by the artists featured in the exhibition.The first exhibition, “Goodbye, World,” will explore the intersection of art and information technology, and will showcase the work of thirty-seven artists, including Pierre-Xavier Huyghe, Natasha Bhimji, and Jeppe Kiesewetter. The exhibit will be followed by “We are Alive,” a group exhibition, which will be curated by Alex Katz, that will showcase the work of seventy-six artists, including Ed Moses, Cécile Pape, and Zoya Naidoo, and will be presented by the Institute of Contemporary Art Singapore (ICA Singapore).The next exhibition at the museum will be “This Machine Kills,” which will feature the work", "The next Biennial should be held in the first half of 2020, and the final part of 2021. The next edition will be held in the third phase of the construction, and the last one will be held in the city of Toronto.Over the last ten years, the museum has commissioned forty-two works by twenty-four artists from thirty-two countries and territories. The creators of the selected works each receive twenty-five thousand Canadian dollars ($17,500) for the privilege of exhibiting at the museum. The biennial will be organized as follows:The exhibition will include works by twenty-five artists from thirty-two countries and territories. The biennial, which was first announced in November 2007, has been unfolding under the theme “Autobiography: The Biennial of Alejandra Gamboa” since March and will run until October 27. In a statement about the exhibition, curator América Zárate said: “We are thrilled to support the author and her internationally thought-out project in bringing together the biennial’s artists, whose extraordinary lives span a variety of disciplines.” \n\n\nThe Metropolitan Museum of Art announced today that it plans to transfer more than two hundred works by American artist-activists", "The next Biennial should be held in 2021. \n\n\nThe Royal Academy of Arts (RA) in London has appointed the curator of contemporary art George Leondard as its next director. He succeeds Helen Glancy, who was promoted to the post in November after she took up the post in November 2019.Stories, Pieces, and Objects: The Encyclopaedia of Modern Art, which Glancy created in 1972, will be presented by the RA in a two-part exhibition that will run in the UK in November 2020 and December 2021.In a statement, the Royal Academy said: “George is a talented curator who brings decades of experience to bear in his curating of my favourite books, and I am thrilled that he will be bringing that knowledge and curiosity to the 2020 exhibition.” George’s current projects include “Bushido: The Art of Self-Destruction” (2011), “American Psycho” (2017), “The Gallery of Life” (2019), and “The Witness” (2018).Commenting on his appointment, Leondard said: “I am thrilled by the opportunity to bring the RA to life as we build on the themes and histories of these great", "The next Biennial should take place in 2021, as planned, at Athens’s Panteleion, with Panagiotis Pappas and Katia Sompoulou.\n\n\nThe Centre Pompidou in Paris has named its new deputy director, Nathalie Boe, as director of the world’s largest museum of historical art. She succeeds Michel Platini, who stepped down after a decade at the helm of the institution earlier this month, and will assume her responsibilities on August 8.Commissioned by the Centre Pompidou, the biennial “The Place,” will take up the theme of “Memory & the Future,” and will include three hundred works, including works from the Centre Pompidou’s collection, from the collection of the private collection of the Museum of Modern Art, New York, and from the private collection of the Museum of Modern Art. The first exhibition, “The Place: The Place of Modern Art” will open on March 23.The biennial will culminate in two debates. In the first event, which will take up the theme of memory, the artist and curator Jaume Ghebaly will present a presentation of ten works by twenty", "The next Biennial should be held in 2021. The museum will also present a new programme of exhibitions and events in the coming months. Under the management of Sara Zobacki, the institution has also been working on an expansion of the settlement. Located on the ground floor of the former Brescia factory, the new facility will be designed with a new design, installations, and performances, and will be able to house up to 50,000 visitors. The biennial project is supported by the Roberto Cicutto Foundation, the São Paulo Foundation, and the Exelon Alliance.\n\n\nFor the past twenty years, artists such as John Cage, Roy Lichtenstein, and Douglas Wheeler have created works to commemorate the lives and work of Martin Luther King Jr. and other iconic figures in American art. This year, in honor of the forty-fifth anniversary of their death, the Whitney Museum of American Art will present an exhibition that will feature fifty works by fifty-three artists.The fifty-sixth edition of the Biennial, “Martin Luther King Jr.: The Everlasting Dream,” will be staged at the Whitney in 2021. It will highlight paintings, sculptures, installations, performances, photographs, and videos created", "The next Biennial should take place on February 26–March 27, 2021), and will include the first ever solo exhibitions of art by women artists, with the first exhibition organized by a woman curator in Tokyo in December 2019. The exhibition will also introduce the first ever biennial catalogue. The institution will offer free admission for the first day of the event, and will offer a number of innovative programs throughout the week leading up to the exhibition.“At the end of the biennial, we are planning to launch a new program that will be curated by a woman curator, and focus on things like performance, art, travel, theater, design, and fashion,” Takashi Kawamura, director of the Biennale of Sydney and the award–winning curator at large, told the Art Newspaper. “Perhaps the best way to think of it is as an incubator.”During the event, which will take place in collaboration with the architect David Adjay, the Sydney Opera House, and the Royal Festival Hall, the museum will present three new multi-national art events, featuring Art Fund, the National Gallery of Australia, and the Sydney Opera House. The National Gallery will also introduce a new special exhibition for the exhibition of the “Golden", "The next Biennial should focus on the relationship between art and culture in the twenty-first century and the greater San Francisco Bay Area. The theme for the third iteration of the Biennial, “What is Contemporary,” will be “What is contemporary,” and will be curated by Adam D. Weinberg, director of the Wolpe Academy in New York. The fourth iteration will be “Art and Life,” curated by Guadalupe Rosales, and will take place in Mexico City from March 13 to March 14, 2020. In the second edition of “What is Contemporary,” art historian and curator Martha Roach wrote of the exhibition: “The fifth edition will celebrate the legacy of Yoko Kanno, whose influence is felt through her work to tell the stories of contemporary art and artists.”The 2019 edition of the biennial, “Art and Life in Mexico—” was held in August.\n\n\nThe Museum of Modern Art (MoMA) in New York has released the list of forty artists who will participate in the sixth edition of the Museum Art in Detroit (MAID), which will take place in mid-August. The fifty artists chosen for the event are:Adam Schiff", "The next Biennial should be held in the autumn, and the artist-run event should be able to resume in the spring.”The announcement comes two weeks after the Israeli government announced that the museum’s board of directors had decided to revoke its contract with the Bezalel Ally Fund, Shimon Peres’s organization that supports cultural projects in the West Bank and the Gaza Strip. The organization’s director, Yaakov Pera, reportedly informed the board that he intends to pull the plug on the group’s annual funding grant, which is used to support a number of Palestinian cultural and arts projects, including the reconstruction of the northern Gaza Strip, the rehabilitation of Palestinian artists, and the establishment of a library in the West Bank.The decision has led the Bezalel Ally Fund’s executive director, Lina Eid, to demand that the board of trustees cancel the award. “In such an unprecedented situation, the board of trustees has decided to recognize the vision of the Bezalel Ally Fund and cancel the annual Bezalel Ally Fund Fellowship,” Eid said in a statement. “We ask our fellow trustees to honor their commitments and follow the decision of the board of trustees by", "The next Biennial should be held in the fall of 2021.\n\n\nLionel LeVine has been appointed as the new artistic director of the British Latin American art biennial. LeVine was nominated for the manual prize by Artforum’s Mark Duggan in July 2019 and was awarded the prize in May 2020. LeVine will assume his post in December.“Lionel is an outstanding curator and scholar who brings a wealth of experience and knowledge to the role of the curator in Latin American art,” said Brian Cox, chair of the jury. “She is acutely attuned to and inspired by the evolving and rich history of Latin American art and cultures, and will be vital in shaping the 2020 and 2021 editions of the Biennial, in conjunction with our partners in the Americas and Central America.”For the 2020 event, which will take place in Mexico City from November 3 to November 7, LeVine will oversee the exhibition “Through All the Americas,” curated by Eduardo Martínez, which will show work by twenty-four artists from the Americas. Her panel will discuss the significance of the exhibition in the context of “the birth of art", "The next Biennial should be staged in 2020. The next, which is currently still being considered, would feature a selection of works by a select group of artists selected from the biennial’s exhibition catalogue. The next will also feature the first ever immersive work, a virtual reality work, and will be staged at the Ritz-Carlton in London.\n\n\nThe Hoffman Museum of Art in Chicago announced today that it is launching a $1 million fund for artistic and cultural preservation. The fund is a continuation of the work of the Hoffman Museum of Art over the last thirteen years, which has been devoted to preserving and presenting the work of artists of color as well as the work of ethno-linguistic, Native, or other recent artists of color. The fund comes amid a cultural landscape in which the resistance to the racist politics of the Trump administration and the rise of populist movements is being explored and tested in a variety of new and unexpected ways. The new initiative will provide $500,000 for preservation and $150,000 for the exhibition of the first work by a group of artists of color in the United States: the work of Betty Tepper, “From Black to Black: Painting with Color” (2019). Each artist", "The next Biennial should be in 2020. The next edition will be staged in Helsinki and will include work by seventy-eight artists from thirty-six countries and territories. The last edition was held in Helsinki in 2008. The artists chosen for this edition were a selection of the artists currently represented by the institution. This year’s edition will feature work by more than eighty artists from forty-nine countries and territories, and will take place in the city of Itaŋ, in the central country of Finland, and will run from March 21 to March 27, 2020.In a letter penned by the artist it was stated that the new partnership will allow them to increase the scope of their exhibition program, by leveraging the public’s desire to see a body of work by artists from different geographical locations. They cite the recent trend to focus more on visual art and more on the biennial as a platform for artists dealing with homelessness and mental health issues.Commenting on the biennial, the artist said: “This year’s RMIT Biennial will challenge your preconceived notions about what a biennial should be. We are committed to bringing together the most beautiful and compelling artworks from the diverse worlds of the world and our artists. We are", "The next Biennial should be held in the Fall of 2021 in Los Angeles.  “The reasons why we have chosen to move forward with the exhibition are not only related to the Biennial’s new location and the many collaborations with other established and emerging artists, but also to the continuing commitment to foster the intellectual, aesthetic and social development of the exhibition’s four artists, Melissa Bailey, Nareen Barnwell, and Adrienne Nolen, as well as the exhibition’s upcoming thirty-fourth edition, ‘World View,’ which will explore the relationship between art and the digital landscape,” the fair said. The New York–based, California–based organization, which has hosted the show in its current location in Manhattan’s Greenwich Village since 2009, had originally launched a campaign to have the exhibition moved to a different location. In response, the fair announced it would extend the opening of the exhibition by one week to coincide with the opening of its 2019 season, which will run from March 19 to March 21.Organizers noted that although construction of the new venue will be completed sometime next month, the exhibition’s opening date will remain unchanged and", "The next Biennial should take place in the autumn of 2021. The exhibition is currently on view in the exhibition hall of the Museum of Modern Art in New York. Dusan Kuzmański, the director of the Helsinki Biennial, said: “The series ‘Ai,’ is a great honor for the Museum of Contemporary Art Helsinki. The highlight of this year’s exhibition is the young artists who will make their mark on the exhibition. We are very lucky to be able to present them here. We hope that this exhibition conveys to them the importance of artistic practice and the power of the contemporary art scene.”\n\n\nThe Brooklyn-based nonprofit ArtforTwo is launching a new digital platform that will help artists and arts professionals navigate the legal and regulatory maze that surrounds their work. Called ArtforTwo First, the platform will allow users to upload a photo or three of their work and will ask users to provide an abstract description of the work. Users will then be able to link the art to an entity or person in the legal system. The platform will then distribute a set of guidelines, which are divided into three categories: art, legal, and administrative, and will ask users to write a description", "The next Biennial should be held in 2022.What does the future hold for the museum’s collection? Museum director Trisha Brown wrote that the current exhibition “is a vital milestone in the museum’s history. [The collection] will continue to evolve and to be enriched by the continued engagement of visitors, and will undoubtedly benefit from the museum’s ongoing programming.”\n\n\nThe National Museum of Art in Washington, DC, has welcomed Donna Cartwright, the founding curator of Proust and Rene Magritte, to its staff and board. She will assume her new role in early January. Carteiller joins the museum from the Museum of Fine Arts, Boston, where she serves as curator of its collection of the prolific artist’s work. She was previously the associate curator of Proust and Rene Magritte and a curatorial assistant in the Department of Painting and Sculpture.“Donna brings a wealth of experience and knowledge to the National Museum of Art and has the ability to bring our collection to life,” said Bruce Horton, chairman and CEO of the National Museum of Art. “Her work will complement and strengthen the work of staff and board", "The next Biennial should also include a discussion on why certain works are important and should aim to stimulate new ideas about how art can change lives for the better and should include films by artists such as Albert Oehlen and Peter Rüger; curators from the Contemporary Design Museum Hamburg; and a selection of works by acclaimed New York artists such as Peter Stone and Diane Arbus.In an open letter published on the website of the Art Newspaper, the organizers said that the upcoming edition’s “will unveil new and updated works by artists with a new and contemporary perspective in order to increase the impact of the first edition, which was organized by artists and architects in partnership with the local arts center.” It also said that the event’s digital platform, which was developed by Artforum, will receive the first edition’s first episode on September 21 and the project will begin immediately.\n\n\nThe Japanese government approved a plan on Friday to help the world’s largest art museum in Japan, the Sino Art Museum, cope with a spike in the number of cases of the coronavirus, which has infected at least 150 people and caused hundreds of thousands more to become ill. The ¥10 billion ($9.2 billion)", "The next Biennial should take place in the spring of 2021. “By replicating these practices within an art museum, we hope to create a space for reflection in the form of an exhibition,” Claudio and Michele Battista, the museum’s curators, told Artnet. The event will also include a retrospective of the artist’s work, “The Skin I Live In,” which is currently on display in the museum’s Japanese Pavilion. The exhibition is the first of three planned by the fourth Biennial. The exhibition will focus on the artist’s memory of the event, “the biennial,” and “institutionalize the events of our time.”\n\n\nThe Office of Art and Design (AAD) announced today that it is launching a new fund that will provide $3 billion to help small and mid-size American museums and urban cultural institutions survive the Covid-19 pandemic. The fund—which will be led by New York–based artist Niccolo Tedeschi—is part of the United States’ commitment to the Paris Climate Accord, which aims to mitigate the threat of climate change.Tedeschi plans to donate $2 billion", "The next Biennial should take place in 2020. The full list of exhibitors is as follows:A.I.R. GalleryAnadolu Art GalleryAnadolu Art Gallery, Artadia Gallery, Artadia Gallery, and Artadia GalleryA.R.A. Gallery and MuseumA.R. GalleriesAjaxr Kultur und Gegenstalt (A.R.K.G)Ajaxr KunstBauhaus Bauhaus (Artisches Künstlerhaus)Bauhaus Bürenreich (B.A.K.)Bauhaus Bürenreich (B.H.G.)Bauhaus CCCA (D.A.L.)Bauhaus Stiftung (D.A.L)Bauhaus Bürenreich (D.H.G.)Bauhaus Düsseldorf (D.A.L)Bauhaus Düsseldorf (D.A.L)Bauhaus Erskine-Bauhaus (D.A.L)Bauhaus Erskine-Bauhaus (D.A.L)Bauhaus Ess", "The next Biennial should take place at the New Museum in New York in 2021. The next iteration of the Fifty-Ninth Venice Biennale will take place in 2021. The 2017 edition of the San Francisco Biennale, which was canceled owing to Covid-19, will resume in March. The 2020 edition of the New York Art Biennale will be held at the Metropolitan Museum of Art in New York, and the 2020 edition of the San Francisco Art Biennale will be staged at the Museum of Modern Art. The 2020 edition of the Venice Architecture Biennale will be held in the Italian city of Venice’s Grand Salon. The Venice City Hall is currently undergoing a major renovation.\n\n\nDeutsche Bank, the United Kingdom’s financial giant, has announced that it will suspend all commercial banking operations in the United Kingdom from March 19 to March 21. According to the Guardian, the bank says that it anticipates a loss of 1.5 million jobs as a result of the shutdown, and expects global economic growth to slow further as the UK continues to recover from the coronavirus.The London-based investment bank said that the decision to shutter its commercial branch in London, which has a physical presence in Canary", "The next Biennial should bring the full range of exhibitions from the museum. Currently it only has live exhibitions and a selection of works on paper. And while the museum was still struggling to come to terms with the death of the biennial’s director Wolfgang Pfeifer, he will be remembered in the institution’s memory. Pfeifer was instrumental in establishing the Biennial in the first place, directing its inaugural exhibition, “Art in Motion,” in 1985.Svensk, a cofounder of the Swedish design firm Rydén and a longtime curator, became director in 2003. His tenure was marked by a series of exhibitions that brought together artists and designers in various settings. The inaugural exhibition, “Project Raval,” was a three-part program that featured the work of pioneering Swedish modernists Ingvar Kampf and Olof Palme Dutt, and featured a retrospective of Manfred Kugelmann’s work from 2015 to 2020. In the 1980s, Tresca was the director of the Kunsthalle Bern, where he helped to found the first long-term program of retrospective art. He worked as a research curator for over twenty years at the museum and has presented his work at numerous", "The next Biennial should be held in 2020, and the last one in 2021.Since most of the works in the collection are in poor condition, the authorities are planning to sell the works at auction, and the galleries are reluctant to part with the works due to the bootleg situation. The artworld is also concerned about the future of the collection, which is currently housed in a former textile factory in the capital.The government has committed to purchasing the works from the dealers, and the museums are negotiating with the dealers to arrange the auction. However, the costs involved are prohibitive for many museums, and the dealers are demanding that the government pay for the acquisition, which would be an unprecedented step. The government has also agreed to cover the cost of the artworks.According to Artnews, in a statement, the Culture Ministry said: “The ministry will ensure the bank holding the assets of the late librarian and scholar Anne-Marie Nevison and her family, as well as the estate of the late museum director and founder Shigeru Igarashi, in an unprecedented action, is protected in the event that the works are transferred to the bankruptcy court. The ministry will closely supervise the transfer of the works.”The ministry said that it would", "The next Biennial should be held at least once every third year. The institution’s director, Rachel Lee, has said that the current biennial, “is not our standard,” and that it will be “redesignated” in the next iteration. The reopening of the Smithsonian’s National Museum of Women in the Arts in Washington, DC, will take place in 2020, and the next edition of Art Basel Miami Beach will be held in 2021.\n\n\nThe Global Alliance of Museums (GAM), a group of more than two hundred international arts organizations, has released a statement urging the United Nations to cut the $3 billion that it allocates each year to global poverty alleviation.The statement, issued by artists including Ann-Marie Modigliani, Stephen Friedman, and Nari Ward, reads: “We urge you to use your influence to secure the immediate reduction of extreme poverty and hunger, and to focus in the coming years on alleviating the structural constraints of extreme poverty and hunger. We call on you to prioritize the universal and immediate needs of people in fragile situations, and to prioritize the needs of vulnerable communities. We implore you to act in solidarity with museums and cultural organizations working in", "The next Biennial should focus on “the relationship between the film and the physical landscape,” said Hans-Ulrich Biendexter, director of the Biennial. The first edition, “The Art of Film,” opened in New York in 1988. The second, “The Future of Film,” opened in Berlin in 1991. The third Biennial, “The Art of Art” will be held at the Berlin-based Haus der Kunst from March 21 to March 27. \n\n\nThe National Geographic Society’s plan to move the eighty-six-year-old American art museum and its collection to the Arizona desert has been put on hold due to dwindling donations. The news comes on the heels of a disappointing exhibition of works by American artists that was set to open at the museum in April, and a mid-May announcement that the museum will not reopen until the spring.“This is a sad day for the museum and the nation,” said Matthew Teitelbaum, the museum’s executive director and chief curator. “The American Way of Life,” a special exhibition of works by American artists that was to open in January, “was a huge", "The next Biennial should be held in 2021, says Meyer, who has already received funding from the city of Chicago and the Maryland Institute College of Art in Baltimore. The exhibition, titled \"Art and Memory,” will be curated by British artist Stuart Campbell, whose work is housed in the collections of the Art Institute of Chicago and the Metropolitan Museum of Art in New York, and will be staged by Deborah LeFevre, the director of the Anne Frank Center for the Arts at the Museum of Contemporary Art, Art History, and Art Decoration.\n\n\nThe Uffizi Gallery in Venice has received a gift of eighty-six works by Italian architect Cao Rinno from the estate of Charles and Lucille Aziz. The gift, which includes works by works by José Amor, Aristo Andujar, Lucio Bianchi, Victor Bassi, Claudia Belli, Marettino Carli, Paul Colombo, Julia Delia, and Sara Edmonds, comes at a time when the local and international visual arts scene is undergoing a major transformation.ÜThe Aziz Family is a major supporter of the Venice Sculpture", "The next Biennial should be held at least once every two years. The biennial should focus on the issues of our time, namely the Global War on Terror, climate change and the ecological crisis, and should take place in an accessible manner. The theme should be an allegory of the history of the process of creation in the Arab world, emphasizing the importance of sacred sites in the region, such as the Grand Mosque and the Grand Mosque of Mecca. The committee will also decide on the technical aspects of the event, such as the placement of the painting, the installation of the work, and the presentation of the exhibition. The new plans were drawn up by artist Abdullah al-Kamel, who is known for his drawings, sculptures, collages, photography, video, and installations, and seek a historical narrative that shows the history of the newest sect of Islam. \n\n\nArts New York has announced that it will soon begin welcoming visitors to its annual Festival of Poetry, which has featured readings, a variety of events, and performances by artists such as Alison Cooke, Mairia C. Akil, and Lydia Davis, among others, at an undisclosed location in the city. Previously, the event was held at the Village Vanguard in", "The next Biennial should be sometime in the second half of 2018.  The first two shows were staged by the Dhaka-based artists Mohammad Ali and Zainab Abu Bakr. The first was a tribute to the late artist Abraham Sattar. The second was a contemporary art retrospective of the late Pakistani designer Chetan Bhagat. Last year, the city hosted the inaugural Artist-in-Residence Biennial.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has elected Tara Satterwhite as its next president and CEO. Satterwhite comes to the museum from the Los Angeles County Museum of Art (LACMA), where she has served as director of education and partnerships since 2016. She succeeds Laila Alshams, who was appointed interim director in March.“It is a thrilling and humbling moment to be appointed as the new director of LACMA,” Satterwhite said. “I’m honored to serve this position as director of a museum devoted to modern art, and I’m excited to continue the work of LACMA’s director, Dr. Loring Randolph, and the thousands", "The next Biennial should be held in 2025. This year’s will be the last, and will be preceded by a new biennial for emerging artists in 2020.The Biennial of the Americas’s sixty-fourth edition, featuring work by fifty-seven artists from the Americas, will be held in the Bahamas in 2021. The Biennial of the United States’s fifty-fifth edition, which will be held in 2018, will be held in 2022. The 2020 edition, which was organized by the Smithsonian and exceeded the exhibition’s $15 million fundraising goal, was curated by artist-in-residence Lin-Manuel Miranda.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) is planning to break ground next week on a $1.2 billion expansion designed by the Taiwanese company Fokkema, which will add more than two hundred galleries, theaters, and educational institutions to the institution’s already acclaimed Central Park. Named for the eight-mile-long park in the Bronx and developed by the company of the same name, the twenty-third iteration of the Met will feature more than eight thousand square feet of exhibition space, a meeting room, a gallery, and", "The next Biennial should be held in late March/early April.\n\n\nArt historian, performer, and educator Anita Loewy, who made her name forming groundbreaking experimental spaces that challenged conventions of art and performance, has died at age eighty-two at her home in Manhattan.Born in New York City in 1930, Loewy studied at the School of the Art Institute of Chicago and the School of the Visual Arts in New York, where her early interests and professional career began. She migrated to Los Angeles in the 1960s, where she began working as a performer and performing artist. In the 1980s, she earned her master’s degree from the University of California, Berkeley, and returned to New York to pursue her interests in film and television. In 1998, she and her husband, the painter Robert Loewy, opened an outdoor plaza in front of the hugely influential artist’s former apartment in the city. Loewy’s work has been collected by the Los Angeles County Museum of Art and the Los Angeles County Museum of Art; the Museum of Modern Art, New York; and the Metropolitan Museum of Art, the Museum of Modern Art, and the Whitney Museum of American Art in New York.Over the years, Loew", "The next Biennial should be held in 2020. The theme of the 2019 exhibition was “The Gift of Life.” The biennial was inaugurated by the film “The Gift of Life,” a documentary about the making of the 1973 film Sunrise, directly opposing the theme of the exhibition. The exhibition opened at the Biennial of Modern Art in Prague in October 2019. The theme of the next Biennial should be Life. The next biennial will be held at the Museo de Arte Contemporáneo in Barcelona in 2020.\n\n\nThe third edition of the Royal Academy of Arts (RA), in London, is currently on hold due to concerns over the coronavirus. The institution’s board of directors announced on Wednesday that the 2019 cohort would be held back by this week and that in the interim, the academy had suspended all events and programming.The exhibition, “Last Caesars,” a commission by Peter Sellars and John McAllister, featured the work of ninety-five contemporary artists and was curated by Emma Thompson. The show was organized in collaboration with architect and curator MOS Architects in Newcastle upon Tyne, England, and was curated by David Adjay", "The next Biennial should focus on the history of the exhibition, as well as the exhibition’s design and its engagement with contemporary cultural heritage. The new exhibition will be curated by Kwan Seo-kyung, director of the Kwan Institute of Contemporary Arts.\n\n\nThe Ford Foundation in Dearborn, Michigan, has established a $250,000 prize to recognize artists and creatives who have shaped the work of American art. Winners will be chosen by a jury comprising Laurence Marks, president of the Ford Foundation; Bernardo Paz, director of Artcarnegie Hall; and Julie Harrison, a Ford Foundation board member. The prize will help support Ford’s ongoing programs to defend and celebrate the works of American visual art and will honor the artists whose work was selected.The Ford Foundation established the award in recognition of Fellowships at the Ford Center and the Ford Museum of Art. The Ford Foundation has previously awarded the William C. Ford Spirit Award and the Ralph Vaughan Dance Award for Visual Art in the Arts. \n\n\nA group of artists, including Larry André, David A. Russell, and Yunju Lee, have asked the city of New York to block construction of a $1 billion luxury condominium tower on Fifth Avenue by", "The next Biennial should be staged in 2020, and at least two other iterations of the event should follow. At the current rate, the third iteration of the event will wrap up in 2022, and the fourth will close in 2023. For Tobia, the delay is an opportunity to remain true to the spirit of the work, which was founded on the philosophy that art should not be produced, consumed, or stored. “I am excited to be able to share these works with a wider and broader audience,” she said. “In the coming years, they will be part of a greater vision for the city.”  Tobia’s work has been collected by the Los Angeles County Museum of Art, the Museum of Contemporary Art, Los Angeles, the Los Angeles Museum of Art, and the Los Angeles County Museum of Art, as well as the Getty, the Getty Trust, and the Getty Museum.\n\n\nThe Paris-based collective Paris-Soirées has announced that it will expel 125 members of its staff from its Paris branch and impose effective organisational changes as part of a new union contract. The collective’s artistic director, Gilles Bünthers, said: “With the", "The next Biennial should also focus on the history of the exhibition, its new locations and the exhibition's future. It is also planning to develop and present a new series of exhibitions on the art of the Dutch-American painter Max Beckmann.The 2019 winner is Japanese artist Koki Obata, who will receive a prize that will be placed in the exhibition. His work, titled Daruma Shima, or The Silent World, is a monumental sculpture that depicts a vast ocean of katakus (Japanese for 'divine waters'), a body of water from which no one can emerge. The theme of the event is “Intellectual and Spiritual Exchange,” but it will be open to the public from March 24 to March 26.\n\n\nCultivate an atmosphere of vitality and creativity under the guidance of a curator with a passion and commitment for art. This week, the Museum of Contemporary Art (MoCA) in central Harlem opened its first new chapter with a three-day celebration of the work of the late American avant-garde artist Andrea Bocelli. Bocelli’s work, which range from experimental, deeply textured installations to monumental sculptures, was a central part of the late American av", "The next Biennial should be presented by American painter H. R. Giger, who is known for his surrealist paintings, and should be in the collections of the Smithsonian and the Museum of Modern Art. The institution has also been awarded a $10 million grant from the Gordon and Betty Moore Foundation for the Arts.The Gordon and Betty Moore Foundation has selected the Arts History Museum to host its 2019 Gordon and Betty Moore Award Ceremony, which will take place on October 29 at 8PM. The Gordon and Betty Moore Foundation, which is funded by Gordon and Betty Moore, will also distribute $5 million of the $10 million to Museum of Contemporary Art and the Billie Jean King Foundation, which is supported by the King Family Foundation. The Arts History Museum will receive $8.5 million from the Gordon and Betty Moore Foundation to establish a new fund in support of the Lewis and Clark Institute, a new center dedicated to the Lewis-Clark Expedition. The Lewis-Clark Museum of Art in Seattle and the Lewis-Clark Foundation will each receive $5 million from the Gordon and Betty Moore Foundation. The Gordon and Betty Moore Foundation will provide $2.5 million to create a new fund for Museums", "The next Biennial should take place at the Museum of Fine Arts, Boston (MFA) in 2021, and will be organized as a symposium. The series will be curated by Kate Crawford and Nick Marzio. Its inaugural edition was held in 2007.\n\n\nOn Monday, the United States House of Representatives voted to confirm four new members to the National Endowment for the Arts (NEA), which is currently embroiled in a political battle with President Donald Trump over its proposed budget cuts and its proposed cuts to social services. The legislation, which was passed by a vote of 240–168, is part of a larger $2 trillion federal spending package that was passed by Congress in the wake of Hurricane Sandy and is set to be signed into law by President Donald Trump on Friday.The bill is part of a $1.2 trillion federal stimulus package that will help reduce the nation's spiraling healthcare costs and promote access to healthcare for the poor and middle class. It also aims to rein in the spiraling costs of healthcare, which are expected to top $4 trillion by 2026, and aims to keep the healthcare system afloat during the coronavirus pandemic, which is expected to last for at least three years.While the legislation contains several measures designed to", "The next Biennial should take place in 2020. Curator Jane Panetta, a former director of the Art Institute of Chicago, said: '[The exhibition is] a public-spirited expression of the richness of American art, a celebration of life and art. It will engage with our world in a way that is meaningful and relatable to both the public and to the artist.”\n\n\nThe Metropolitan Museum of Art (MoMA) in New York and the architecturally themed gardens and sculptures at the Visitor’s Center at the Museum of Modern Art (MoMA) in Chicago are among the museums that have been collaborating since last fall on new public art, known as public commissions, in an attempt to foster more community and conversation among visitors.“We are constantly thinking of ways to make art more accessible,” Anne-Sophie Pascual, the new director of the Metropolitan Museum, told the Art Newspaper. “There are times when we can do that by putting something out that is really directly on view, but that’s not what we’ve done for a long time. We wanted to create a space for people to be able to go in and have a conversation with artists.”Since", "The next Biennial should focus on a major project that will involve the creation of a new public space of the Biennial, the new Museum of Contemporary Art, Los Angeles (CAFA), and the completion of the Civic Center, which will include the addition of an exhibition space for the first time. The project was chosen from a shortlist of three that included the Garden of the Arts, the Museum of Contemporary Art Los Angeles, and the Museum of Modern Art.“The time has come to present the fascinating story of modernism in America to the world,” said David Kauders, chair of the board of trustees. “Bertrand Goldberg, Ingrid and Harald Enoka, Frederic Augustin, and Aline Eisendrath, and their colleagues at the Foundation, have created an extraordinary and inspiring exhibition of the work of the brilliant and prolific Kiki Smith. We are honored to present the work of these three celebrated artists in conjunction with their visionary vision for the museum.”Smith, who has been called the “father of contemporary art” and wrote about the role of the artist in her book Modernism’s Genealogy, died in June 2019. She lived in Los Angeles until her death,", "The next Biennial should take place in 2021, and the next in 2021. The 2019 and 2020 editions, both in the United Kingdom, were cancelled in the wake of the Covid-19 pandemic.Arts Council England (ACE) announced today that it is extending its sponsorship of the prestigious prize in recognition of its efforts to advance the conservation of art. This year’s award will be presented in London at a ceremony at the Royal Academy of Arts in February. The biennial will also be hosted by the National Poetry Library and Sculpture Garden in London. The 2019 winner is Elvis Costantino.The biennial will be hosted by National Poetry Library and Sculpture Garden at National Art Gallery. The biennial will be hosted by National Art Gallery in London. The biennial will be hosted by National Art Gallery in London. The biennial will be hosted by National Poetry Library. The biennial will be announced by National Poetry Library and Sculpture Garden at a later date. The National Poetry Library and Sculpture Garden will be hosting the biennial later this month. The National Poetry Library and Sculpture Garden will be hosting the biennial later this month. ", "The next Biennial should be in 2019.The Museum of Contemporary Art (MoCA) in New York has been discussing for months the possibility of moving the exhibition to Los Angeles and has drawn up a detailed blueprint for how the museum would move the show, titled the Alternative Blueprint, which will be exhibited in the museum in 2022. The new location—a former steelworks in the heart of the old city—would also include a new public garden and more public seating.As discussed so many times before, the alternative blueprint is about as far from the original vision of the Biennial as one can get. It is instead a slightly different version of it, in which the show would be presented as a series of 'miniaturizations' of the original works by artists such as David Hockney, Marc Anthony, and Gershom Scholem. The Biennial’s most recent iteration, which was staged in 2012, was at least ten years behind schedule. The new exhibition will be curated by Hong Kong–based artist Lee Hi, who curated the first iteration of the show in Hong Kong in 2005. Lee Hi will also be represented by his own gallery in the United States.The museum’s current exhibition, “The Art of Life,�", "The next Biennial should take place in 2021, at the São Paulo Biennial, which will be held in the city of São Paulo, Brazil. The museum will host previews of the exhibition that will be on view through November 21.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Carolyn Lenz as its next president and CEO. Lenz comes to the institution from the Metropolitan Museum of Art, where she has served as deputy director of public affairs and chief curator since 2013. She succeeds Asher Edens, who was hired as director of the Smithsonian’s Front Group—a consortium of arts and institutions that includes the Museum of Fine Arts, Boston, the Museum of Modern Art, New York, and the Whitney Museum of American Art—and will assume her responsibilities on January 3, 2020.“Carolyn Lenz has been instrumental in shaping MoCA’s curatorial philosophy and strategic plans for several years now, and has been instrumental in our ability to reach new audiences with art of the twenty-first century,” Edens said. “Her expertise, enthusiasm, and commitment to MoCA’s mission make her a strong choice to lead the museum as it enters its seventy-fifth year", "The next Biennial should coincide with the opening of the museum’s flagship exhibition “The Metamorphosis,” an exhibition focused on the physical transformation of artworks as well as on the museum’s distinct relationship with the emerging artist-focused New York art scene. The exhibition will run from March 16 to March 20, 2020.\n\n\nThe Lawrence Museum in Kansas City, Missouri, has released the financial results of its 2018–19 season. Its projected $110 million deficit for the 2019–20 fiscal year was partially offset by a $74 million increase in its operating budget. The increase was made possible by a $47 million decrease in ticket sales and an increase in merchandise. The financial impact of the conservation efforts in the institution’s conservation and conservation-related areas is projected to be $38 million.The loss of $20 million in ticket revenue is expected to be partially offset by an increase in grants and donations of $62 million. The increase in funding for conservation-related grants is projected to total $47 million.The increased capacity of the conservation and conservation-related areas is expected to generate a $9 million increase in visitor revenue. The museum expects to draw an average of 3.1 million visitors this season. While the total", "The next Biennial should be announced in May 2020. Its total cost is estimated at $46 million. The project, named after the Persian poet and philosopher Hamid S. Ali, was established following a $3 million donation from the Abu Dhabi Foundation in 2000 and was initially focused on the art world. The Biennial will host a total of 20 artists. Last year, the artists participated in the exhibition “The Process of Art,” which was organized by the Abu Dhabi Foundation in collaboration with the Abu Dhabi Art Museum. The show was nominated for the Prix du Nation et d’Art Contemporain (Paris 2020) and for the Prix de France (Paris 2020) as well as for the Twenty-Fourth Venice Biennale (2019).\n\n\nThe Virginia Museum of Fine Arts in Richmond (VMFA) has added seven new works to its holdings following its acquisition by the private investment company Renaissance Capital. The acquisitions include works by artists including Randa Dukovic (New York), Peter Dreher (New York), Roger Gara (New York), and Fata Okeniyi (New York and London).Dubbed the “Decade of the Dream” collection, the twenty-two-thousand-work collection", "The next Biennial should be held in the captured city of Nairobi in 2021, before the end of the current exhibition season. The issue of the African diaspora in art is still a sensitive one in the West, where the forced relocation of the population from Africa to the West during World War II led to a serious backlash. Art historian N. M. Akbar, who chaired the exhibition in its opening, told The Guardian: “How can we be moral in the face of so many barbaric acts that we commit? How can we be honest in the face of the genocides that we witness?” The event will be relocated from the capital to the museum in the northern city of Mombasa, each of which will have its own exhibition space and will be inaugurated by a “civic performance,” according to a release. Each event will be followed by a series of lectures and other public programs, which will run concurrently with the other. The first lecture, titled “The Origins of Western Art” will be held on January 7 at 3:00 PM. The second lecture will be held on January 13 at 6:00 PM. In addition, the exhibition will have a twitter account and will", "The next Biennial should be hosted by the Museum of Contemporary Art in London, the National Museum of Scotland, and the Museum of Modern Art in the United States. The 50th Anniversary of the Twelfth Biennial will be held in 2021.\n\n\nPepere, the Spanish architect who inspired countless painters, sculptors, writers, and architects throughout Europe and North America, has died at age eighty-eight at his home in Madrid. The cause of death was brain cancer. In a 2016 Artforum interview, the architect and filmmaker described his cancer as having taken the form of a sphere. He claimed that his cancer metastasized into the brain and that he only recovered consciousness after his death when he was taken to a hospital in the city of Valencia.Born in Barcelona in 1940, Pepere graduated from the city’s Montjuich Academy in 1963. He earned a degree in architecture from the same school in 1977, and later in 1980, moved to Madrid to study at the University of Barcelona. He resumed his studies at the University of Barcelona in the early ’70s and started working again at the same institute, this time at the intersection of the Universitad de Valencia and the Simón Bolívar.", "The next Biennial should be staged in 2020. An artist’s workshop should be held in the following years. The 2020 exhibition will consist of a collection of work on a variety of subjects, including environmental ethics. The 2020 exhibition will be at the National Gallery of Art, in Washington, DC, and will feature works by twelve artists. The 2019 exhibition, “Eden’s Pindus: Theatre of the Absurd,” is currently on view at the National Gallery of Art.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has launched a $25 million fund for cultural institutions that have lost or are at risk of losing revenue because of the economic fallout from Covid-19. The fund is being created in response to the coronavirus and the economic impact that the virus has had on certain industries in New York City, including the performing arts, retail, and the arts.NYC resident artist and educator Joseph Pappalardo, whose work addresses topics including the origins of art and art history, and the social, political, and spiritual conditions that made him choose to leave New York for Los Angeles in 2017, is among the ten artists who will receive a $25,000 grant. More than twenty", "The next Biennial should be held in the summer of 2021. It will then return to the amphitheater for a three-year engagement. “We are so excited to be inviting more people to the Metropolitan Museum of Art, home to the most influential exhibitions of every generation,” said Richard Armstrong, chairman of the board of trustees. “We are committed to working closely with our fabulous staff and supporters to create a unique and magical environment for our visitors, as we continue to grow in stature and influence.”\n\n\nThe National Gallery in London has announced that it will be restructured to ensure that it remains less reliant on foreign donors and has more flexibility in how it uses its funds. The restructuring, which will take place over four years, will involve the reorganization of the museum’s collection, the establishment of a new endowment, the reorganization of the public gallery, and the reorganization of its building.The National Union of Journalists, Artists, and Other Civil Servants (NUCP) has condemned the plan, which would see the museum become more like a public library, and described the reorganization as “utterly backwards.” The union’s demands include the creation of a new board of", "The next Biennial should take place in the spring of 2021. The event will be hosted by the museum in conjunction with the United States pavilion at the Fifty-Ninth Venice Biennale, which will re-open on November 19. The pavilion’s director, Sven Nysvoll, said: “We are on track for a great 2020, and I am excited by the possibilities this year to create a new set of work by some of the most visionary and influential artists of our time. It has been an incredible journey, and the results are fantastic.”\n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) in Philadelphia has been gifted a new 400-year-old collection of 19th-century American paintings by artist Emily Dickinson, a founding member of the group the American Sisters, whose enduring legacy includes the creation of the American narrative—her famous poem And She Said, “I’m not alone.” The work, titled Emily Dickinson: American Painting, will go on view at the museum in January 2020, along with paintings by John Frank and Pierre Georges.The Emily Dickinson Foundation, which was founded by her son David in 2008 to preserve and display the works, created the exhibition in", "The next Biennial should take place in the spring of 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to move the exhibition “Contemporary Art” from March 29 to June 22. The move follows the annual March for Arts, which kicked off in Los Angeles on March 21 and runs until April 3.“Contemporary Art” has served as an important platform for Fellows, current staff, and future visitors to explore the work of artists of the twentieth century,” said museum director Klaus Biesenbach. “We are excited that the March show will continue to attract audiences and continue to offer a valuable platform for recent and upcoming artists.”The museum is planning to expand the institution’s footprint by adding more galleries, as well as by launching a digital platform and a dedicated collection area, and by adding more public programs, including guided tours of the galleries, galleries within the museum, and a new showroom space that will feature new exhibitions.\n\n\nThe Palazzo Sculpture Park in Venice, Italy, has appointed artist Christian Wieder as its new artistic director. He will be responsible for developing the artistic direction of the museum and managing the", "The next Biennial should be held in 2021, but the date has yet to be decided, and other initiatives such as the Biennial of Contemporary Art in Madrid, which will be staged in March 2021, have been put on hold by the government.The research institute, which is affiliated with the University of Milan, has also introduced a new platform for private research, called the Bioprocessing Lab, and is working with researchers to explore how new enzymes, proteins, and drugs can be made to work together to improve the human body and its response to pharmaceuticals.The institute is also developing an app for smartphones that will allow users to automatically check their blood sugar levels and will test the accuracy of blood sugar tests through a consortium of scientists led by Dr. Marc Glimcher, professor of medicine and biochemistry at the University of Bonn in Germany.The initiative is a response to the current crisis, which has already claimed more than 130,000 lives since it began in March and has caused the global outbreak of the novel coronavirus. While the coronavirus has been linked to at least fifty deaths worldwide, the outbreak began in China and has since expanded to Hong Kong, North Korea, and Vietnam.According to the New York Times, China has reported", "The next Biennial should take place in 2021. The exhibition was established in 1988 by Piero della Francesca to inaugurate the second edition of the Milan Biennale. It will now include approximately 1,200 works, organized in forty-four groups and presented as individual exhibitions. The exhibition will showcase work by fourteen artists, including Filippo Bellini, Joanna Brindisi, Zina Harrold, and Maria Mukden.“This second edition will be about universality and the creation of a new Italian state, about the subjectivity of the human body and the human soul, and about the construction of new spaces and new realities,” said Cecilia Fedele, the director of the new festival. Nino Bickel, the executive director of the Biennale, said: “We are grateful for the support of the local, national, and international community and especially of our sponsors and volunteers in the years of our construction, for they have given us the opportunity to present the exhibition in a way that will appeal to an international audience. We will continue to do our best to present the work of the best contemporary artists in the world, for this is what matters most to us.”\n\n\nThe", "The next Biennial should be held in 2021, though its organizers say the date may be changed if the needs of the festival increase.Commenting on the development, Paolo Bertolini, director of the Biennale of Milan, said: “The upcoming edition is our project, and we’re working hard to make it a success. We’re grateful to the city of Milan, the Council of State, the Mayor of Milan, the staff and the visitors of the exhibition, and especially to the exhibition’s organizers, Roberto and Roberto Capelli, for their trust in us and their efforts to make the exhibition a success.”\n\n\nThe Swiss government has approved a proposal to tax luxury goods made in China by companies based in the country. The measure, which will take effect in July, was drafted in response to the country’s growing anger over the Swiss luxury goods manufacturer, Cartier, which moved production out of Switzerland in 2016 and moved its headquarters to China.China’s outcry prompted the Swiss government to push for an exemption from the country’s import duties on a wide range of luxury goods, including watches, wine, and luxury cars. On Tuesday, the government voted to exempt all but two of", "The next Biennial should take place at the National Museum of the Chinese in Beijing.  The next Art of the Pacific should happen at the National Museum of Modern Art in Tokyo. The next Bicentennial of Chinese Art should be held in Beijing. The next edition of the Bicentennial of Chinese Art in Hong Kong will be in December 2022. Joan Chen, cofounder of the exhibition space Noguchi, said: “We are certainly excited to focus on the future of Chinese art in Hong Kong and to embark on a project that will bring together internationally-recognized artists and curators from China, Japan, Korea, the People’s Republic of China, Taiwan, and beyond. We look forward to collaborating with the Hong Kong community and the rest of China and hope to see you soon.”Inaugurating the triennial is the launch of the Hong Kong Art Museum (HKMO). The museum will be inaugurated by a three-day exhibition of the first works on paper by Hong Kong artist Keesu Lin, a major milestone for the city’s art scene. The exhibition will feature the work of forty artists, including Lin, Zeng, Li, and Wu, and will include", "The next Biennial should be held in 2020, during the first phase of the initiative, which comprises four exhibitions and a book group. “This year’s exhibition is unlike any we have had before, and the exhibition is really about to begin,” said director Paul Mpagi Sepuya, who also worked on the exhibition “20 years of Baniwa,” which opened in September 1993, the year he began working in the art world. The theme of this year’s show is “The Art of Love.”The 2018 edition of the Biennial, titled “20 Feet,” was canceled due to the Covid-19 pandemic. The 2019 event, titled “Deadly Visions,” was moved to the second half of the year.“Twenty-Three Feet: The Art of the Body” and “Twenty-Thirty Feet: The Art of Sex” were added to the current exhibition, which is on view until October 14. The exhibition will also feature new works by artists such as Alexander Akhmatova, Arashiyama, Jackson Pollock, and Yinka Shonibare, as well as pieces from the inaugural", "The next Biennial should focus on “flexibility and the importance of inclusion” and “the new possibilities and the expansion of the exhibition program.”\n\n\nThe Christie’s New York store closed its doors on March 22, 2019 after a decade of selling contemporary art. As part of a new partnership between the two companies, the auction house will divide 50 percent of the profits from the sale of works by artists such as Mark di Suvero, Dennis Hopper, and Aria Yûn, and 50 percent of the profits from the sale of artworks and collections by artists like Van Gogh and Van Dyke Reade.The dismantling of the five-year-old company was announced by Christie’s CEO and chairman Nicholas Cullinan and chief executive officer Matthew Christie, who gave the New York Times a tour of the auction house’s new facility in Manhattan’s Lower East Side on Wednesday.“The restructuring plan was guided by two principles: first, that we needed to grow our business in a way that made sense for a global marketplace; and second, that our artists, our clients, and our staff are more important now than ever,” Cullinan said. “We�", "The next Biennial should focus on how the new digital landscape of the arts has transformed the ways in which people experience art and the ways in which people share their experiences with each other and the world.” The 2020 event will take place in Shanghai from September 29 to October 4.\n\n\nThe CNA Gallery in London has appointed Hannah Wilke as its new director. She will be responsible for bringing together those who have recently worked and those who have been active in the art world. Her new role will allow Wilke to expand her experience of contemporary art and the museum’s collections, as well as create an environment for the exhibition of work by artists whose work she has curated.“Hannah will be instrumental in transforming the Curatorial Network, our collection and exhibition programs, exhibitions, and our relationship with the public, both within the museum and beyond the museum, and will be responsible for building and shaping the new generation of curators,” said Nusseibeh Ali, chair of the board of trustees of the CNA. “Hannah is a highly successful and valued colleague and friend of the CNA and an ideal match for our new director, Leonor Abbot, who I have admired for a number of years. Her", "The next Biennial should be held in 2020.\n\n\nThe National Museum of Fine Arts (NMFA) in Louisville, Kentucky, has announced that it will become a hub for the collection and exhibition of modern and contemporary art, particularly in its field of drawing and painting and will soon host an exhibition of works by thirty-four artists. Titled “Future Present: Artists and the Drawing Center” (2017–18), the show will be curated by Rachel Cummings and will feature the work of forty-four artists in the 2019–20 academic year.“The museum will also be transformed by the ongoing collection and exhibition of the work of the artists whose work is currently on display in the center,” said museum director John Edward. “The new museum will be the visual and intellectual center of the collection and exhibition of contemporary art and will be a vital cultural resource for all Kentucky residents and visitors to the museum.”Inaugurating the center are three new works by twenty-four artists\u0097Tanya Bonakdar, Zina Benites, and Gedney Bunch\u0097all of whom were selected to represent the United States in this year’s PEN/Josh Foxman International Art Prize, which is organized", "The next Biennial should be held in 2020. \n\nThe British artist and academic Gertrude Bell Burton, who lived and worked predominantly in London between the years of 1949 and 1969, has died at age eighty-nine.Burton was a pioneer of the modernist movement who often used the space of the gallery to create works that were both experimental and grounded in the artistic practices of the time.Burton’s art is often associated with the late British photographer Peter Cookson, whose portraits she often covered in stark contrast with their surroundings. In her 1981 exhibition “Ateliers pour l'Art et l'Homme,” for the first Biennial, Burton explored the concept of the work as a locus of aesthetic experience. Her work has been collected by the Los Angeles Museum of Contemporary Art, the Metropolitan Museum of Art, the Museum of Modern Art, the Museum of Modern Art, the Whitney Museum of American Art, the Russell Foundation, and the Whitney Museum of American Art.Burton’s work can be found in the collections of the Metropolitan Museum of Art, the Ballets at St. Louis, the David H. Koch Theater, the Fredric March, the Hirshhorn Museum, the Mackie Museum", "The next Biennial should have a platform for a new generation of artists. I look forward to seeing them engage with the project and the city and to developing platforms for these artists to share their work.” Hayden joins the Gallery at the Art Institute of Chicago (ICA) as its first executive director, and will spearhead the museum’s new commitment to contemporary art. She will assume her responsibilities on September 1.\n\n\nThe Royal Academy of Arts (RA) in London announced today that its new chair of contemporary art, Markus Bochenkirchen, has been appointed. Bochenkirchen comes to the academy from the Royal Academy of Arts, where he has served as director of exhibitions, acquisitions, and curatorial affairs since 2014. “We are thrilled to have Markus Bochenkirchen at the RA,” said David Prentiss, director of the Royal Academy of Arts. “As an independent curator and educator, he will bring vision, expertise, and energy to our exhibition program and to the RA. He has the ability and determination to bring together a diverse range of artists and give audiences a new and exciting look at their work. We think he will be instrumental in our continued", "The next Biennial should be in 2021.Tickets for the upcoming exhibition, titled . . . From Imagination to Substance, will be on sale to the general public from May 15 and will be held at the Museum of Contemporary Art, Miami Beach, from May 15 through May 17. The auction will run for three days and will be held at a venue that is currently under construction. The next edition of the Biennial will take place in 2022. The Rijksmuseum Amsterdam will stage a retrospective of “From Spatial to Digital: The Visualization of Dutch Art” in November 2021. The exhibition will include works on paper and will run a minimum of six months. The show will include work from more than fifty artists, including Gheorghe Jůŋ, Johan Dey, and Piet Mondrian, and will be held in the Rijksmuseum from November 19 to November 22, 2021.\n\n\nThe Art Newspaper reported that the following artists have been selected for the upcoming edition of the Artforum Exhibition Series:Amanda Bick, Meyer Garten, and Andy Hall. The 2019 edition, titled “Artforum: Paris 2020” and curated by Irvine California, featured", "The next Biennial should feature the inclusion of the works of ten contemporary artists; this year’s event will be held at the Internationale Kunstverein Bern, Switzerland, and will consist of thirty-three artists from eleven countries: Belarus, Belgium, Brazil, Canada, Chile, Colombia, France, Germany, Italy, Mexico, Peru, Russia, and the United Kingdom.The event will be presented by Haus der Moderen, which will have a seat at the Frankfurt fair and will run an exhibition of work by twenty-one artists. Commenting on the partnership, the authorities of the state of North Rhine-Westphalia (NRW) said: “The collaboration between Haus der Moderen and the Internationale Kunstverein Bern is a treat for galleries. This year’s Biennale extends our commitment to the community at large and is an opportunity to showcase work by emerging and established artists. We hope the exhibition will stimulate a new appreciation for the works of the emerging and established.”The next edition of the Paris Art Biennale will take place at the Palais de Tokyo in the city of Paris on December 6–January 18, 2020. The event will be hosted by David K.", "The next Biennial should be held in the spring of 2021. The full list of participating artists is as follows:August 1: Ann AkersArtistic Director and CEO Matthew BrownArtistic Director and CEO Jodi ThrockmortonArtistic Director and CEO Camille LaliberteArtistic Director and CEO Jason PappasArtistic Director and CEO Jason SelwynBryce DeaverArtistic Director and CEO Kaelynn FayeBryce DeaverArtistic Director and CEO Kelly DonaghyBryce DeaverArtistic Director and CEO Lucas KaelenBryce DeaverArtistic Director and CEO Matthew DeaverBryce DeaverArtistic Director and CEO Keith CampbellBryce deaverArtistic Director and CEO Robert De NiroBryce deaverArtistic Director and CEO Robert De NiroBryce deaverArtistic Director and CEO Rory McCarthyBryce deaverArtistic Director and CEO Sarah McLainArtistic Director and CEO Simone de VriesArtistic Director and CEO Nicole De CastroArtistic Director and CEO Peter MolyneauxBryce DeaverArtistic Director and CEO Shaniqing XieBryce DeaverArt", "The next Biennial should take place in 2021, and the first in 2022. The director of the new museum, Marc-Antoine Paumont, said that the new pavilion is designed to connect the museum’s recently opened twenty-four-acre campus, the National Museum of Art, with the city of Paris. He added: “Through a series of powerful public sculptures, we are redefining the boundaries of what is possible.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced its representation of the artist-run nonprofit Queer Art, whose first international exhibition, “Talking About You,” was held last year at the Los Angeles County Museum of Art (LACMA). The show, which featured works by artists such as the late artist Shepard Fairey and the late rapper Tupac Shakur, was shot in the Los Angeles neighborhood of Koreatown and came to LACMA in partnership with the Los Angeles LGBT Center (LACMA LGBT).The museum has partnered with Queer Art for the past four years, in the form of a “freelance development team,” which works with the artist to create works for the museum. The organization’s first show in", "The next Biennial should take place in 2021. “The exhibition will focus on the history of radical art and its impact on contemporary society,” said the museum’s director, Arnold Bode. “Philippe Kamm: the curator of Modern Art, and the exhibition will have a special theme ‘Feminine Mystique’ that will be based on a feminist perspective.”The Arts and Culture Ministry had previously stated that the deadline for the 2019 edition of the fair was September 24. However, the institution has since clarified that the decision to postpone the event was not related to the coronavirus outbreak.\n\n\nThe UES covers the relocation of the American art historian Michael Radcliffe from his home in New York to a new venue in London. Radcliffe has been a core member of the UES’s international network since he first moved to the city in 1983. In January 2018, the institution announced that he would be promoted to the role of chief curator. “While he has had a distinguished career in his own right, he has been most effective when he is employed to guide and guide the curatorial vision of collections and collections projects,” said UES director Elizabeth Ward. “His work", "The next Biennial should open in 2022.\n\n\nThe Aspen Institute in Colorado has announced that it is planning to move its next edition, which was set to take place in March 2019, to Aspen from March 20 to March 21, 2020. The press release said that the decision was made after the institute received a letter from the local community in April 2020, inviting it to move its programming and exhibition schedule. The community expressed its pleasure in the move, and said that, after a thorough review, the institute was satisfied with its decision. “This year’s Aspen Institute show is one of the best we have made, creating an engaging and unique environment in which to see the show,” said director Christa Andenas. “It is a great honor to be able to move this exhibition to Aspen, and to host such a talented and dedicated group of curators and audiences. I am confident that with the community’s support and guidance, we will continue to challenge and challenge as part of our mission, advancing Aspen’s reputation as an important center for contemporary art.”\n\n\nThe powerful coalition of artists, workers, activists, and academics that successfully pushed for the United States to cancel a", "The next Biennial should take place in London in the spring of 2021, with the exhibition to be staged at the Pavilion in London from March 22 to March 28.\n\n\nOn Monday, the National Geographic Society’s board of trustees voted to sell off nearly two hundred books, including a number by American writer and artist Josiah Johnson, one of the earliest modernists. The publisher’s president, Barbara Petrow, told the Art Newspaper that the sale was not meant to be a “robust endorsement of what we’ve done. . . . It is a statement that we have moved on and will never do what we did then.” The proposed sale, which is valued at $3.2 billion, is the second-largest piece of the company’s reorganization plan, after the company sold more than 1,700 books in 2014.In an attempt to reduce the number of items being appraised, Petrow cited the ongoing commemoration of the one hundredth anniversary of the completion of the first expedition to the South Pole as well as the need to reduce the size of the museum and the physical footprint of the building. The endowment fund is also seeking to eliminate some 10 percent of the annual operating budget", "The next Biennial should be held in New York next year. The exhibition will be themed “Living Art and the Body” and will bring together some thirty artists, including Rossini, Cattel, Sánchez, and Zidoun, as well as hundreds of bodies. The biennial will be housed at the Museum of Modern Art.\n\n\nThe Canadian artist, curator, and educator, Denis Menchaca, died on Thursday at the age of eighty-eight. In a statement, the South American cultural figure said: “For more than forty years, I have been working with Denis to develop a visual vocabulary, a ways of thinking that can be understood and practiced without the aid of words. . . .This is a monumental task; one that has required a lifetime commitment and a great artistic imagination. I have had many opportunities to collaborate with him and to become inspired by his work. But I cannot imagine a relationship that would have been more intimate and meaningful than this.”Born in Winnipeg in 1940, Menchaca graduated from the University of Winnipeg in 1968 and went on to study at University of Toronto, where he met his wife, the Canadian artist Jessica Larsen. The pair were married for twelve years, but in", "The next Biennial should take place in the Saône-Mines, France, in June 2021.\n\n\nArts and culture workers are organizing protests against Sheldon Adelson, the billionaire CEO and chairman of the Las Vegas Sands Corporation (LVMH), which owns Sands North America, the international business subsidiary of the Las Vegas Sands Corporation (LSCC), which operates casinos in Asia and Europe and produces the skin and hair care products duPont, Gillette, and other major brands.The proposed divestiture, which was first reported by the New York Times on Tuesday, is part of a broader strategy to reduce the influence of the company that has pushed the boundaries of what is considered acceptable in the art world. The move has been in the works for some time, since Adelson wants to eliminate his stake in the company, which he inherited from his father, James A. Adelson, in 2015. The family has since faced legal action from activists over how much money their companies should be allowed to profit off of the wars in Iraq and Afghanistan.Since the Adelsons are a large family business, the move has been closely watched. A group of artists and activists, which includes Artists and Art Defenders Fund, has launched a petition demanding that Sheldon and Annette"]