["The next Biennial should focus on the history of the exhibition. e hopes that the exhibition will serve as a stepping stone for the next iteration of the exhibition, which will surely include works by contemporary artists. The exhibition should culminate with a lecture from a panel of artists, designers, researchers, academics, and other experts on the exhibition’s opening and its future.”The inaugural exhibition “Mirrors in Time: Futurism as Spectacle,” organized by the Dutch Foundation for Contemporary Art (VIVA), was held at the Bergen Pergamon in Rome in September 2020. The show, which included paintings, drawings, photographs, videos, and installations by twenty-eight artists from North America, Europe, and Asia, was curated by the core art historian and curator Pia Camil, who was appointed as the inaugural curator of the Biennial. The show was curated by Pascual Ferran at the Studio Adrienne Erquemada in the Mediterranean city of Pernambuco in October.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has launched a new initiative that will partner with artists and cultural organizations to improve the city’s air quality. The", "The next Biennial should take place in the autumn of 2020. \n\n\nThe Museum of Modern Art (MoMA) in New York is planning to open a new digital platform that will allow visitors to view its collection online. The platform, called the MoMé, will be overseen by two teams, one in New York and one in London.“MoMA has long been a leader in the history of art and now intends to be even more so as part of the future in which we live,” said David Zwirner, MoMA’s director. “The MoMé platform will let visitors experience and explore our collection online, while affording us a way to present our exhibitions without having to leave our New York headquarters. Our artists and curators will have a powerful new platform to collaborate and share their work with the world.”The nonprofit, which has several hundred artworks on display in its cavernous two-story space, was awarded a $600,000 grant from the Museum of Modern Art in 2014. The grant will allow the museum to create an online exhibition of artworks by twenty-five artists, including Claire Anderson-Davies, Chris Albright, Jenny Holzer, and John Graham,", "The next Biennial should be held in 2022, said Monna Gin at the Wallach Art Museum, where the festival was first held in 2001. Its 2018 edition, titled   BNA, ran for eight weeks and featured a cast of more than sixty artists, including Alessandra Rocha, Léa Roux, , and Dino Zuccaretti.  \n\n\nZoologischer Kunstverein Berlin (ZKB) announced today that the seventy-third edition of the German pavilion at the 1949 Venice Biennale will be held in the historic Rijks-Kunstverein in Berlin. The event, titled “Every Day Matters,” will run from March 14–March 16, 2020. The pavilion’s director, Amie Rech, said: “The 1949 Biennale in Berlin is a record of humanity’s evolution from paganism to Christianity, of our greatest achievements in space and time, of our strong interest in art and architecture, and of our commitment to the arts, all the while grappling with the current political situation. This pavilion, the seventeenth Berlin urban art event, will give a", "The next Biennial should take place at the Museo de Arte Contemporânea, Lisbon in the year 2020. The next Art Biennial should be held in 2020. Do you have any ideas on how we can lower the temperature on climate change?This is a very important issue for me. I want to be honest with you; I am not really sure what we should be doing. The only thing that seems to make any sense is to increase CO2. The only way out is to stop burning fossil fuels. I don’t want to see more than two degrees rise. I don’t want more wars. I don’t want more famines. I don’t want more disease. I don’t want to exacerbate the conflict in the world. I don’t want more oppression. I don’t want more injustice. I don’t want more suffering. I don’t want any more terror. I don’t want to see more terrorism. I don’t want to see more wars. I don’t want to see more poverty. I don’t want more", "The next Biennial should be held in 2021.  The biennial is currently being curated by veteran curator of the twentieth century, Paul Mpagi Sepuya and is scheduled to run from March 7–March 12, 2021. The 2018 edition of the show, entitled Away, is currently on view in the West Bank city of Bethlehem.\n\n\nThe University of Pittsburgh announced today that it will receive an additional $25 million in support of its historic $10 million redesign and expansion of the Palmer House, which will improve accessibility and enhance its curatorial and research programs. In addition to the $12.5 million in funding for the renovation and renovation of the Palmer House, the institution will receive $5 million from the Corporate and Community Partnerships for Conservation and Landscape, and $2 million from the Corporate and Individual Gifts, and $500,000 from the Corporate and Individual Services Housing and University Communities Trust.The Palmer House is one of the Carnegie Legacy Buildings and was constructed on the campus of the University of Pittsburgh in the 1960s as part of a larger redevelopment plan. The design, which incorporated the creation of a new building on the north side of the Palmer House with a new campus, the", "The next Biennial should take place in Japan in 2022, and the twenty-fourth in the United States in 2023. The twenty-fifth installment will be held at the Kikuoka Museum in Tokyo, and the twenty-third will be staged in Nagoya in 2021. The first Art Basel Japan pavilion in Tokyo will open in 2021, and the first exhibition of the Kasai Biennial in Hokkaido will be staged in 2020.“We are really excited to be collaborating with the world-famous architecture school, the Kikuoka Museum, and the talented artists who have contributed to fostering the exhibition and development of our program over the last twenty years,” said Alexander Lüthuis, the curator of the first and the twenty-third installments. He added that the exhibition’s commitment to reinterpreting traditional notions of architecture is a real reflection of its values. “This is a unique opportunity for us to launch multiple new categories of exhibitions and new experiences for our guests who are eager to experience the Kikuoka Museum’s collection first-hand,” he said. The exhibition will also introduce the new “Architecture of Life” series, which will feature the work", "The next Biennial should be held in late May or early June.  The institution has not yet released the schedule for its 2020 edition, which will be held at the Museum of Contemporary Art (MoCA) in San Francisco.\n\n\nThe National Museum of Fine Arts (NMFA) in Memphis, Tennessee, has appointed Rebecca Watson as its next executive director. During her tenure at the institution, Watson will oversee the recruitment and appointment of new staff, the development of programming, the collection, and presentation of the institution’s collections and exhibitions.“I’m excited to serve as the next executive director of the National Museum of Fine Arts,” said Watson. “I’m committed to expanding the museum’s collection and serving as an advocate for true local, national, and international art through exhibitions, educational programming, and partnerships.”During her tenure at the museum, Watson will launch a new program: “The Future Is Now: Art Now,” which will present the work of emerging and established artists in the institution’s permanent collection. She will also invest in the restoration and conservation of its primary collection, which comprises works dating back to the nineteenth century. “We’re", "The next Biennial should be held in 2019. “We are actively reviewing all options for the biennial, including the possibility of presenting a festival in the future,” festival organizer and chairperson Emma Martin told Artnet. Martin added that the biennial committee will also be reviewing the current exhibition program and the upcoming exhibition season for the forthcoming year.  The Biennial of Jane Austen is currently slated to run from March 26 to March 28.\n\n\nThe National Geographic Society’s plan to move the fifty-sixth edition of its Red Planet art fair from the streets of New York to a remote outpost in the Grand Canyon has been delayed—the 2020 edition, which was originally set for May 26–May 28, has been pushed back again to June 1–June 2. The move, which has been in the works for months, is part of a broader strategy to reshape the landscape and public atmosphere of the Red Planet, which covers ten thousand square miles and is home to sixty-six species of life. To make room for the redesign of the 2020 edition, the society has relocated the event from its original venue on the campus of the State University of New York, where it has staged the fair since 1992, to a venue", "The next Biennial should be held in 2022. \n\n\nFive artists whose works were included in the forty-fifth edition of the National Museum of Canada’s (NMC) Architecture and Design Biennial in Vancouver have filed a complaint with the federal government claiming that the exhibition violated the Official Languages Act, which requires that all public exhibitions sponsored by federal departments and agencies be in French. The artists are challenging the inclusion of a work by sculptor and activist Jean-Michel Basquiat, an American expatriate who traveled to Canada in 1967 to be enrolled in a program that would continue his artistic career in Canada. The exhibition, titled “The Untold Story,” opened on December 6 and ran through March 20. The exhibition marked the first time the NMC had exhibited a work by any artist from outside of the United States.The artists, who are not associated with the institution, sent the complaint to the Canadian Human Rights Commission (CHRC), which has jurisdiction over complaints about the NMC’s architecture and design program, in January. The commission could also refer the cases to the Human Rights Tribunal of Ontario, which can order the NMC to create new legislation or to make regulations for the institution.“The", "The next Biennial should be held in 2020.\n\n\nThe groundbreaking exhibition “Ernest Arnold’s Shadow,” which explored the relationship between light and shadow in art, architecture, and architecture, was shot during a six-month shoot at the Museum of Modern Art in New York. The exhibition, which featured the work of seventy-two artists, including Robert Irwin, Alice Aycock, and Tod Williams, will be on view in the museum’s new building and is slated to run for twelve months. The show is being curated and curated by John Gilliam, director of the Art Institute of Chicago, and will be inaugurated by a presentation of three works by Arnold. The collection comprises works on architecture, art, and architecture and will be presented in the museum’s forthcoming exhibition “L'Homme: A Retrospective.”The show will feature works by forty artists whose works have been selected for the first Biennial. Featured in the exhibition are Carlos Castillo, Pia Camil, and Paul Gauguin. The collection will also showcase the work of ten artists whose work is currently on display at the Biennial. The ten finalists were: Rene Magritte, Pierre-Auguste Ren", "The next Biennial should take place in a location that confirms that all of the city’s performing arts venues are meeting the city’s needs and providing the city with a wide variety of programs. And, crucially, it should be directed to the people of Chicago. “One of the things we have been trying to do since the fall of 2017 is to instill in our youth a sense of community and a sense of belonging in a creative and technical sense,” said Mayor Rahm Emanuel. “The next iteration of the Windy City Triennial can serve as a powerful example to our young people. It’s about time we used our influence to change an irresponsible city for the better.”The biennial will be staged at various locations in Chicago including the Museum of Contemporary Art (MoCA); the Near North Side Museum of Art; the Fine Arts Museum, Chicago; the Toledo Museum of Art; the Chicago Cultural Center, the South Side; and the Magnificent Mile, the North Shore. The exhibition will run from April 5 through April 8.“The Next Biennial is a call to action for Chicago. We must be creative, we must be persistent, we must act fast, and we must", "The next Biennial should be put together in the spring of 2021.\n\n\nThe two-year-long, $35 million exhibition “Museum of Modern Art: From the Vault” at the Metropolitan Museum of Art (MoMA) in New York has announced that it will now return to the Museum of Modern Art in a few months, in order to work toward securing the institution’s future. The exhibition was originally scheduled to run from September 20 to September 22, 2020.Museum director Timothy Rub, who was not consulted about the move, said: “The museum is ready to welcome visitors once again, and we are grateful to our partners at MoMA who have worked so hard to secure our 2020 exhibition. We look forward to welcoming you to the museum in 2022.”In a letter to MoMA board members dated September 25, Rub wrote: “I am grateful that the museum can return to the city it has always been a part of, and that it can continue to attract and educate the world’s most innovative minds.” He added that the exhibition would open in the fall and would be “an important step in reopening the Met, restoring its public profile, and attracting new audiences through new", "The next Biennial should be held in 2022, when the biennial will have passed its seventy-nine-year anniversary.The inaugural edition, Promethea, was held in Lisbon in April 2009. The 2019 edition, the first for the city of Lisbon, was held in the seaside resort of Praia da Luz and the first for any artist to be featured in the country.\n\n\nFrench artist Thierry Neuville has been named the winner of the Deutsche Klinische Kunst-Max Planck-Güterstag in Berlin. The five-time awardee, who was named the winner of the Prix de l'Art et de l'Hautamgarten in May, will receive a prize of €3,000 ($3,620) at the annual Deutsche Klinische Kunst-Max Planck-Güterstag exhibition, which will take up its theme “Eco-socialism” at the Hamburger Bahnhof on September 29.The biennial’s inaugural edition, “Eco-Socialism” (EoSH), was held at the Kunsthalle Basel from December 13 to December 17, 2019. The twenty-seven-person", "The next Biennial should be held at the Imperial Art Museum in Beijing in 2021. The exhibition will then return to the Beijing Art Museum (BAM), for a second and final iteration in 2022 and 2022, respectively.The exhibition will also be staged at the National Museum of Chinese Art in Beijing, the Museum of Contemporary Art (MCA), and the Kunsthalle Basel in Switzerland.\n\n\nThe London-based cultural nonprofit the London Arts Foundation (LAF) announced today that Masao Tomioka, the director of the Tokyo-based Art Residence Project, will become the first director of the London Biennial, which will run from March 14 to April 19, 2020. He succeeds chief curator Rachel Whiteread. “We are thrilled to welcome Masao to LAF,” said LAF director Emma Bennett. “His extensive experience in international contemporary art and his deep understanding of the London arts and design communities will ensure the future success of the London Biennial and enhance its impact on the same.”Tomioka first joined the organization as a curatorial assistant in 2012, where he helped shape the institution’s exhibitions program. He also served as the head of the London-based contemporary art group the", "The next Biennial should be held in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a $50 million donation from the Konrad Adenauer Foundation (KAS) in Berlin. The gift is part of a larger plan to support the revitalization of the Eli and Edythe Broad, the nation’s oldest surviving art museum. The Konrad Adenauer Foundation, which was established in 1984 by the German and Austrian architects, is one of several foundation-based organizations that have donated to MoMA, the Metropolitan Museum of Art, and the Solomon R. Guggenheim Museum in New York. MoMA director Michael Mariotti said: “The donation is a great gift for the Guggenheim, for the museum and museum-going public in general, and especially for the artists whose work we admire and whose work we feel represents the essence of modern art. We are very much looking forward to working with this extraordinary donor to develop new collections, and to maintaining and expanding the renowned collection in the Guggenheim.”\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is raising funds to invest in the long-term care of several of its", "The next Biennial should focus on the relationship between urban planning and the environment, the body and the flesh, and the environment and life itself, and will organize activities that reflect the artistic and historic properties of the biennial and its collections. To that end, we have developed a new initiative to support the growth and development of contemporary art and a new platform for the biennial, the Biennial Archive, and the museum. In addition, the museum will be strengthened by the development of its collections, which are currently undergoing a major renovation, and by the acquisition of more works by artists of the Middle Ages and Renaissance. We will also have the occasion to reexamine the material and the history of the collections and the exhibition programs of the biennial. In the coming months, we will continue to present works and exhibitions at the museum as well as at the exhibition biennial, for which we will present a new exhibition this fall. The future of the Biennial Archive and the Museum is quite bright. Together, we are committed to working together constructively and in cooperation with our partners and partners of the past.\n\n\nThe Philadelphia Museum of Art (PMA) announced today that it will open an exhibition featuring works by American artist Richard Avedon, who", "The next Biennial should be a straight forward affair, with a short‐lived but highly successful beginning platform.It should culminate with a performance of a selection from the series, perhaps by a chosen few, that began with a simple but meaningful question, “What would life be like if we were all like you?”“I want to thank George, Christopher, and Christian for allowing us to make the choice to embark on this journey with them and the Biennial team for their kindness and understanding,” said curator Linnea Hetzler. “I’m very much looking forward to seeing the results of this inclusive and inclusive, as inclusively as it can be.”The fifty‐first edition of the Dublin fair, which will take place at the Art Gallery of Ireland, will be held at the National Arts Centre, from February 22–March 5, 2020. Tickets to the event will be on sale this coming weekend.\n\n\nThe Carnegie Museum of Art in Pittsburgh, the birthplace of Carl Gustav’s famous painting The Blue and the Silver, has hired Mira Mille as its new associate curator of the Mediterranean region. Mille will be responsible for coordinating the curatorial efforts of the museum’s", "The next Biennial should proceed as planned. However, if the efforts of the current team are any indication, and our delegation are anything to go by, they are not. We are asking for your help to change this situation.”We hope that this letter serves as a signal that the project will be revived and that you will join us in reminding the City of Singapore that the artist-run spaces of the past were vibrant incubators for artistic development in the city, and that the future of the Biennale will include diverse and ecumenical exhibitions.\n\n\nArtist-run spaces in Hong Kong—including Art Basel Hong Kong, the Art of the Party, and Art of the Party 3—are allegedly being pressured to remove controversial works from their shows and pay a heavy price for doing so. According to the Art Newspaper, the Hong Kong government is threatening to fine galleries that fail to reinstate the CYA (Cyber Security Awareness) program, which works with artists and activists to detect and mitigate harmful cyber activity and help them combat it, and which has the power to shut down websites and businesses in Hong Kong.In a letter sent to the Hong Kong Arts and Crafts Association on October 10, Hong Kong’s Ministry of Culture said that", "The next Biennial should begin April 24, 2020.\n\n\nRussian artist and activist Oleg Kashin, who had his first solo exhibition in the country in 2011, has died at the age of seventy-eight. The exhibition featured work by forty-four artists, including Victor Serge, Andre Solovyev, Sergei Tarkovsky, Sergei Lonutsky, and Viktor Trakhanov, whom he met through Mariya Zhelyakova, a member of his group, whom he married in 1979.Born in the Moscow area of Omsk, Kashin moved with his family to the Russian region of Kaliningrad in the late 1940s. He studied at the St. Petersburg Academy of Fine Arts, the Russian State Academy of Arts, and the Academy of Fine Arts in Moscow, where he met and married Sergei. Two years after their daughter Anna was born, Kashin and his wife moved to Saint Petersburg, where they lived for the rest of his life. In 2017, the couple donated 1,500 paintings and 1,500 photographs to the museum in honor of the memory of their son, Oleg, who died at the age of sixty-two from complications caused by amyotrophic lateral sclerosis (ALS). The works are currently on display", "The next Biennial should take place in 2020.  The curators of the upcoming edition have decided to postpone it, as they want to focus on building up the festival to meet the needs of a changing cultural landscape, as well as to continue to engage with the city of London through programmes that engage with local communities.Programs to be staged in the City of London include: The Blight’s Destiny, a performance and installations space based in a former textile factory on the Blight, and the Blight’s Imagined Landscape, a research and scholarship platform that will present research-based projects and exhibitions, improve its platform in collaboration with a global network of artists and curators, and present a series of events that will reflect the theme of the exhibition in the first place. In addition, a press release describes the event as “built from the ground up to be a truly international platform for serious and innovative work.”\n\nThe City of London’s Department for Digital, Culture, Media and Sport (DCMS) has launched an online petition in support of the creative industries after US President Donald Trump signed an executive order slashing funding from the Corporation for National and Community Service (CNS), the US�", "The next Biennial should include a new series of participatory exhibitions, and a biennial survey which will explore interdisciplinary approaches to art history and the biennial as a whole. The event will also include a reception, an open-house, and other programming.“A triennale is a rich, multilayered work of art, like a symphony, but with more layers of meaning, more moving images,” said focus director Marta Cipolletta. “This year’s biennale will be more than an exhibition of contemporary art. It will be the first time the exhibition will be built around the concept of a triennale, as it has been known both in Italy and abroad, and it will be the last.”\n\n\nToronto–based artist Satya Nadella has won the Prix de l’Amitien, France, for his first exhibition at the institution in fifteen years. The show, titled “My Body, My Life,” was staged at the Museo Olimpico in Venice, and will open in Paris in February 2020.The award for best installation or video art was bestowed by François Pino, Jacques-Yves Donahue,", "The next Biennial should be in 2020, with the book series premiering in 2021. The institution will also launch a Center for Reveries, the museum’s new division dedicated to the art of the afterlife, in the fall of 2020.\n\n\nThe Vancouver Art Gallery (VAG) announced today that it will receive a gift of sixty-seven works by artists including Adriana Alomar, Michael Bloomberg, and David Blaine from the Vancouver Island Conservation Authority (VIC). The organization plans to dedicate the works to the Wind River Museum in B.C. and will donate them to the Galleries of the Great Exhibition.“We are very excited to work with our fellow Canadians to preserve and showcase the work of these great artists,” said VAG director and CEO Stephanie Soo. “The works are important to the city of Vancouver and to British Columbian culture in general, and will be a powerful display of Vancouver’s commitment to art and what we consider the greatest legacy of the city, namely the arts.”The gift includes works by sixty-seven artists, including Alomar, Bloomberg, and Blaine, as well as works by subjects that range from prehistory to contemporary life.V", "The next Biennial should focus on the evolution of the festival’s relationship with West Germany’s Federal Association for the Promotion of Art (BAM), which aims to stimulate the international exchange of art and culture, and will be hosted at Berlin’s Oktoberhaus in March 2021. The next edition of the Geisel Curator-in-Residence program will, however, be a departure from the theme of the commission’s previous two years. The 2020 edition will focus on the current state of the exhibition industry in Germany and will be hosted at the Kunsthalle Basel, where it will be staged by the German city of Cologne, starting on March 7. The future of the program, which has been held since 1992, remains unclear. The theme of the 2019 edition was “Travel and the World.” The 2019 edition featured artworks by thirty-six artists from forty-three countries. The 2019 edition was curated by Anna Zužek, the former director of the Milano Art Museum, and will open at the Museum of Modern Art, New York, on April 23. The 2019 edition was presented by the artist-run organization Lumi Gallery", "The next Biennial should be held in 2020, the organizers said. It will also be organized so that the exhibition will be accessible to everyone, with the focus on Indigenous history and culture.\n\n\nThe Museums Association (MA) has hired John Pritchard as its first director of architecture, design, landscape, and design across North America. Pritchard will assume his post in January 2021.“John’s background and expertise combine strong institutional relationships, the international travel and advocacy network, and an understanding of contemporary art,” said Ann Mason, MA’s board president. “He will bring a new set of skills and a new perspective to the role of art at our significant museums. Our fans and partners are incredibly excited to hear his vision for the MA, and we look forward to working with him to develop a new engagement with our communities, the city, and the state of New York.”Pritchard previously served as the executive director of the Metropolitan Museum of Art, where he oversaw the museum’s relationship with the city of New York, including the renovation of the museum’s Richard Diebenkorn Center and the expansion of its collection, and as the director of the Hudson Yards redevelopment project.", "The next Biennial should be in 2021. This will mark the twentieth anniversary of the award. The next award cycle will be in 2020 and will consist of a selection of films and works on film. The prize ceremony will take place on November 27 at the Cambridge Art Gallery and will be followed by a special exhibition.COMMUNITY PRESS (Canada) was awarded an honorary doctorate by the University of Toronto on November 19, and the London-based organization was given a special exhibition of works by thirty-two artists in May. The award, which has been presented to organizations such as the Museum of Modern Art and the Institute of Contemporary Arts in London, was established in recognition of their achievements in collaboration with the city of London and the Royal Shakespeare Company, as well as their contribution to the art and culture of Canada. The inaugural exhibition was curated by Patrick Meegley, director of the Cleveland Institute of Art.“Composition and design are central to our lives, but they are only one part of the equation,” said Mary Anne Murphy, chair of the committee. “Biennials are about not only the work, but the work, the relationships and the community built between the artists and the participants. These are the stories", "The next Biennial should take place in 2022. \n\n\nIn an unprecedented move, the Museum of Fine Arts (MFA) in Philadelphia has appointed Kenneth C. Johnson as its new deputy director for collections and exhibitions. Johnson has been a curatorial assistant and associate curator at the museum for more than fifteen years, serving as director of exhibitions and collections when it opened in 1971. He was promoted to director in 1994 and has played a key role in transforming the institution since.“In 2017, we were fortunate to receive a stunning gift of Kenneth’s work as the first recipient of the Museum Series,” Elizabeth M. Ashby, chair of the board of trustees, said in a statement. “He has demonstrated a deep commitment to and understanding of our central mission of presenting the art of our time. For the past fifteen years, we have been really excited to have him as the MFA’s director. He has performed admirably to our expectations as director, and now we are grateful for his extraordinary service to the institution.”Johnson previously served as associate curator of modern and contemporary art at the Maryland Institute College of Art in Baltimore; associate curator at the Museum of Modern Art in New York;", "The next Biennial should be held in October 2020. \n\nThe Berlin-based publisher GEO Group has confirmed it is removing the term Kassel-based art dealer Christian Schwabe, who was accused of assisting a terrorist organization by collaborating with the German federal criminal authority in 2014 and who had his home raided by the Federal Office for the Protection of Democracy (BND), the Federal Office of the Security Services (BfV), and the Federal Office of Criminal Justice (BKA). Schwabe was charged with one count of assisting a terrorist organization and was sentenced to twelve months in prison.The news comes two weeks after the BND said it had arrested a suspected member of the group Die Linke, a far-right group that espouses an anti-immigrant, anti-Muslim, and anti-Semitic platform, in connection with the June 3 murder of a Berlin policewoman by a man who claimed to be a member of Die Linke. The bombing took place in Ansbach, a city located in the Kreuzberg section of Berlin, on the Rhine. The suspected accomplice, an Algerian national from North Africa, was sentenced to three years in prison. The court sentenced him to two years and three months in prison", "The next Biennial should be held in the fall, and the inaugural event should be held in the spring. The new two-year cycle will begin in 2020.  Advertisement\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles will offer a free exhibition of works by the late Italian conceptual artist Beatrice Lagnado, who is considered one of the first modernists in the United States, at the institution, which is currently undergoing a major renovation, beginning March 10. The event, titled 'Beatrice Lagnado: Proyectos dias', will showcase the work of thirty artists, including Billie LaBouvier, Laura Podedano, and Stefano Normanni, and will run for twenty days. The exhibition, which is curated by Beatrice Lagnado’s daughter, Anna Lagnado, and director Andrew Kreps, is organized in collaboration with the Lagnado Center for the Arts and the Los Angeles County Museum of Art.“Beatrice Lagnado: Proyectos dias’ content will be spread throughout the entire museum. Each exhibition will be organized as a series of dialogues through which the artist will be transported to the modern world.”The center will", "The next Biennial should take place in 2021.\n\n\nAmerican photographer Cara Delevingne has died at the age of seventy-nine from ovarian cancer.Born in New York City to immigrant parents in 1936, Delevingne studied at the Academy of Fine Arts in Paris, the Art Institute of Chicago, and the Stanford Art Museum before moving to the University of Pennsylvania, where she studied photography under the tutelage of Henri Cartier-Bresson. She began taking photos at the end of the Vietnam War and focused on creating an Americanized version of the Vietnam photograph, which pays homage to the American avant-garde while emphasizing the country’s rural landscape.In 1991, she moved to Los Angeles, where she met her husband, Robert, and the couple’s circle of longtime friends, including Peter Nickerson, David Remnick, and David Frankel, and was soon married to photographer John Cassavetes, with whom she had three children. Together they became a team, and in 2006, two years after the death of Roman Polanski, the foursome relocated to the West Coast. In the same year, they photographed the Banana Republic, a collection of rural art that includes paintings, sculptures, and photographs by T", "The next Biennial should take place in 2021–2021. \n\n\nThe Oakland Museum of California (O'Malley and Co., OBE) has welcomed John H. Knox, the former director of the University of California, Berkeley, and one of the authors of The Asylum: A History of Mental Health in America, to its board of trustees. Knox, who will assume his post on January 29, will be supported by more than $1 million from the O’Malley Foundation and will serve for two years.A scholar and educator, Knox has taught at the University of California, Los Angeles, and at the University of California Berkeley, where he has taught since 2001. He holds a Ph.D. in history from Harvard University and is a certified forensic historian who served as the founding editor of the journal Criminology.Commenting on his new role, Knox said: “I’m excited to lead the O’Malley and Co. Museum into the future. It’s an exciting and challenging time to be a curator, and I’m thrilled to join the Oakland Museum of California’s distinguished history of exhibitions and programming.”He added: “I am deeply committed to the", "The next Biennial should be held sometime in 2022. The space will be renamed the Rapport Internationale de la Biennial. The museum will create an area of the exhibition called “The Biennial Experience,” which will be open to the public every March. The next iteration of art will take place in 2020. The museum will stage another exhibition, “Double Sight,” in 2020. The 2019 edition of the Biennial de Stéré aures, staged at the Museum of Modern Art in New York, featured 33 works by eighty-three artists and featured a retrospective of the work of Jean-Michel Basquiat, a film by director Olivier Assayas, and a performance by Jacky Mansfield, a popular dance troupe in New York.\n\n\nThe Hmong Arts and Culture Foundation (HFAF) in Langley, Virginia, has announced that it is launching an award for art conservation. The foundation will award $1,000 to individuals working to preserve or restore more than ten works of art, as well as $500 for a group of five to $75,000.Each year, HFAF selects ten artists who demonstrate exceptional conservation and restoration skills. In its first", "The next Biennial should take place in the spring of 2020 and will consist of a collection of works that were presented in the first exhibition, “This Is Not a Display,” organized as part of the Large-scale Contemporary Art and Design (SLAC) Museum in Portland, Oregon.The institution has also received a $500,000 grant from the Herbert and Nicole Beard Foundation. The research, which is the subject of a $1.5 million grant from the Herbert and Nicole Beard Foundation, was published in the April 2019 issue of Artforum. The art world institution will receive $500,000 from the Herbert and Nicole Beard Foundation. A foundation grant of $250,000 will be granted to the Columbia University Art Museum in New York to develop and implement an online catalogue of works by artists that have never been on public view. The Rockefeller Foundation also established the Art Fund, which grants $250,000 grants to institutions such as the Herbert and Nicole Beard Foundation. New York’s Metropolitan Museum of Art received a $125,000 grant from the Rockefeller Foundation. The new initiative was initiated by Herbert and Nic", "The next Biennial should be held in September 2020.<|endoftext|>SHARE THIS ARTICLE Share Tweet Post Email\n\nDavid Sullivan, an American painter who revolutionized the field of painting by synthesizing elements of oil painting, sculpture, and drawing, died on Tuesday at age eighty-two. The subject of nearly twenty-five thousand paintings in his exhibition at the Museum of Modern Art, the Whitney Museum of American Art, the Brooklyn Academy of Music, the Metropolitan Museum of Art, and the Whitney Museum of American Art, Sullivan became known for his explorations of space, time, and its relation to subjects that ranged from abstract archivists and sculptures to people and landscapes. His paintings, many of which were made in a somewhat vehicleized style, often involved people acting as canvases or models for his canvases.In an essay published in the August 1972 issue of Artforum, Sullivan wrote: “All art is a kind of play, a rhythmic dance, a kind of play that is not a building, but a process, a steady succession of movements including the performances of voices that are not there but are there by force of will. . . . The human body was never intended to be a canvas for the spirit world or for the creative process. . .", "The next Biennial should focus on Interdisciplinary Art from the Americas and the Pacific, international exhibitions that address both past and present realities, and shall also include a special exhibition of works by the Filipino artist and designer Eileen Ortega. The full list of participating artists is as follows:ART IN PROGRESS:”17Artists in Progress: Senyent­o na Magistracy, Manila, PhilippinesNew Artists In Progress: “The Past,”Arts of Two Worlds, Dejah; the Philippines, 2017:“Future Past,” and “The Past, Present, and Future,” “Jorge Castaneda (1930–2019), Dejah, IndonesiaNamila Maruyama (2018), New York: “Oscar Nausez: The Truth About Art”Art of the Present, Namila Maruyama, Manila, PhilippinesArt of the Present: The History of Art, Namila Maruyama, Manila, PhilippinesArt of Present: The History of Art, 2017: “Oscar Nausez: The Truth About Art”Artists In Progress: The Art of the Present, Nam", "The next Biennial should include a rotating selection of works by artists from the island.“The past five years have been transformative for me, and it has only gotten better since then,” said the biennial’s director, Fanny Crofts. “I’ve had a long-term vision for the gallery as a public space for artists, and I’m very excited to continue this work with the galleries in the future.”The opening of the exhibition will coincide with the opening of “Art of Life,” which is currently on view at the London Biennial. The museum will also host a series of talks by artists in collaboration with the Greening Museum, London, and the Metropolitan Museum of Art, including Andrew Kreps, Carol Knight, and Martin Luther King Jr. In addition to the exhibition, Art of Life’s inaugural \"First-Person View” will feature artworks by fifty artists, including Lorne Bacon, Alfred Stieglitz, Laura Owens, Suzanne Parrish, and Vito Acconci. The exhibition will also include a “Project on a Single Plane” event, which will", "The next Biennial should be held at the Albright-Knox Art Museum in New York in 2021, but no dates have yet been set. Since the last show was held at the Museum of Modern Art in New York, the center has been moving to a new home in downtown Manhattan. The last exhibition, “The Vibrations of Infinite Small Things,” was staged at the Museum of Modern Art in 2020.\n\n\nThe National Gallery of Canada announced today that Richard Mayhew has been hired as the new director and CEO of the institution. He succeeds Manfred R. Cicerone, who resigned in April 2019 to head the Los Angeles County Museum of Art, and will take up the post in January 2021.“Richard brings with him decades of experience in the intellectual and cultural life of Canada, as well as a wealth of knowledge and experience in the contemporary art world,” said Caren Frank, president and CEO of the National Gallery of Canada. “As we worked through the transition, we knew that he had a proven track record of success in leading a museum to financial health and long-term financial sustainability, and we were impressed by his desire to grow the National Gallery of Canada into a much more. We look forward", "The next Biennial should be held at least once a year, in the first instance in Toronto. According to Mr. Eckart, the exhibition’s opening would have been on the occasion of the centennial’s 75th anniversary. The first exhibition was the final exhibition of the exhibition series “Marching through Space” (1972–73) and “In the Beginning” (1973–74). Bibi also discussed the possibility of moving the exhibition to a different location, such as the Schenectady Museum of Art, the Museum of Modern Art, the Museum of Contemporary Art, Chicago, and the National Gallery of Art. “I am honored to have been asked to lead the Biennial,” Bibi said. “This is a historic event that can serve as a much-needed platform for our artists and a platform for our city as a whole.” She added: “I have had the opportunity to work with and cultivate the creative life of many talented artists across Canada and the world, and it is an honor and my privilege to lead this exhibition.”\n\n\nThe Italian philosopher and theorist Roberto Cicutto has been named the winner of the first Venice Architecture Bi", "The next Biennial should be held in early 2021, the organizers said. Originally scheduled for March 21–March 23, the exhibition was rescheduled for May 22–May 25 and was rescheduled for May 25–May 31. The thirty-ninth edition of the biennial will be held at the Haus der Kunst (Haus der Kunst, Germany), in Frankfurt, in October 2020. While the event will be hosted by curator and curator-designer Bridget Riley and her team, the first solo exhibition will be curated by Elissael Kiarostami. In the runup to the exhibition, the exhibition will have a website and will be streamed online. The biennial will also present a series of films by Kathrin Avenmann and Jerome Beard, which was originally scheduled for May 21–May 23. They will now premiere in May.\n\n\nThe University of Houston’s Alexander Graham Gallery, which has been closed since March 13, has announced that it will reopen with a new collection of work by British artist and activist H.G. Wells, who often set the standard for American art by his contemporaries. Named after the artist’s birthplace,", "The next Biennial should take place in the fall of 2020.\n\nToilet paper manufacturer P&G, which was a founding member of the $3 billion Kochi Triennale in 2010, filed a lawsuit against India’s National Garment Workers’ Association (Gwalior Garment Workers’ Association) and the state of Maharashtra in the Supreme Court of India on Friday, June 5, alleging that the union is trying to stifle the company’s plans to open a factory in Maharashtra and apply for a permit to manufacture toilet paper in the state.According to The National (The Nation), an online publication that has been critical of the lawsuit, the two sides are trying to minimize the impact of the verdict. “As a matter of policy, all three sides were supposed to submit briefs in support of the same motion,” The Nation reports. In a written statement, P&G said: “We have been working with our legal advisors for several months to understand the implications of the verdict and the precise legal options available to us. During this process we have made a number of significant investments to strengthen our legal team and our legal teams have been working across the globe in concert with our legal advisors to understand", "The next Biennial should be held within the next two years, and will be “in collaboration with the contemporary artists in Paris, London, New York, and Hong Kong, and the coalition of local and international arts organizations in Paris, including the Musée d’Arles, the City of Paris, and La Belle Equipe.”\n\n\nThe Museum of Contemporary Art (MoCA), New York, has announced that it is preparing to reopen to the public in March 2020. While the institution is not yet sure when the reopening of the museum will occur, it will likely be sometime between April and August.The museum has yet to set a precise date for the reopening of the MOCA, but says that it expects to be able to reopen by the end of the year. However, once the museum reopens, it will implement new safety measures, including introducing a number of new health and wellness initiatives, and will be prepared to open with several hundred guests, rather than the usual three hundred.“The Museum of Contemporary Art is committed to ensuring that our visitors have an enjoyable and safe experience while the museum is open,” said Michael Govan, director of the MOCA. “Our safety measures include introducing new", "The next Biennial should be held at the National Museum of Art in the city of Atlanta.  The biennial, titled Art and the Birth of Modernism, will focus on the development of the practice of art and the art of the twentieth century. It will also open to the public in October 2020.The event, which will be hosted by the Georgia Museum of Art and the Peachtree Center for the Arts, will organize projects and exhibitions, including the exhibition “Pollyanna: The Art of Music” (2018); “Art and the Birth of Modernity” (2017); “Art and the Birth of Modernity,” (2016); and “Art and the Birth of Modernism” (2015).The Atlanta Art Museum has yet to announce a date for the 2020 edition.  The 2019 show was the first of the museum’s planned biennial, which was to run between January and March of 2020. The show was canceled owing to the Covid-19 pandemic. \n\n\nThe City of Los Angeles has released the latest list of the more than two hundred venues that have participated in the 2020 LA Art + Culture Summit, which is taking place at the Los Angeles County", "The next Biennial should be held in 2021 and will continue to be organized as best we can in accordance with the needs of the participants. However, it will now be organized in a way that is more flexible and responsive to the needs of the artists, who are increasingly finding it difficult to participate in lectures given by experienced and distinguished experts.The new structure will be in keeping with the theme of the exhibition which is to be “An Open Door: Art and the Body”\u0097the exhibition will focus on the body and its relationship to the environment and will take place in the new building of the Museum of Modern Art, where the exhibition will be hosted for the foreseeable future. “We knew that the new architecture of the Museum of Modern Art would be a challenge,” said Stephen Marabar, director and chief curator of the Museum of Modern Art. “Our team worked hard to find a way to make this work in a way that was flexible and responsive to the needs of the artists, who are increasingly finding it difficult to participate in lectures given by experienced and distinguished experts.” In a statement, Marabar said: “We are grateful to the artists and curators who have made this exhibition possible, and to the City", "The next Biennial should commence in March 2021. The National Museum of African Art in Atlanta, Georgia, is considering a January 2020 opening. The National Museum of Women in the Arts in Washington, DC, has yet to announce any plans for a new exhibition or symposium.Artnews reports that the exhibition will feature works by sixty-six artists who are currently or will soon be in the exhibition. Of the artists represented, twenty-five have residencies at the National Gallery of Art and the remaining twenty-four are represented by solo exhibitions at the Metropolitan Museum of Art and the Walker Art Center. The full list of participants can be found here.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Judith C. Anderson as its next director, effective immediately. Anderson comes to the NGA from the Museum of Fine Arts in Boston, where she has served as interim director since March 2019. During her tenure at the institution, she helped the museum manage more than $2 billion in collections and increased its attendance by nearly six hundred percent.“Judith’s leadership and work as a curator and educator has made her a great fit for the National Gallery of Art,” said Joshua Wise, the NGA’s deputy director for cur", "The next Biennial should focus on promoting the work of local artists and focusing on the current exhibition schedule, as this will be the last exhibition of its kind at the venue, which opened in 1895. This may be the last time the Biennial will feature the work of any of the artists featured in the exhibition. \n\n\nDecolonization International (Decolonize this Island) has received $2.5 million from the Rockefeller Brothers Fund to promote the work of Australian artist Tom Marshall. The fund also announced that it will give $1.5 million to help artists whose work was included in the “Lasting Impact” exhibition at the Victoria and Albert Museum in London in September 2019.The funds will help support the launch of a new program, “Decolonize This Island” that will invite artists to Australia to create works that commemorate the victory of Indigenous peoples in the Western Hemisphere in the twentieth century and direct their attention to climate change. The program will also showcase new Indigenous works that will help raise awareness of the plight of Australia’s Torres Strait Islanders.“In the twenty-first century, more than ever, we need artists to speak directly and powerfully to the voiceless, to draw attention to the ways in which cultural and", "The next Biennial should focus on the social and political experience of the exhibition, which will take place at the Contemporary Art Museum St. Petersburg from March 25 to April 3. Dmitriy Skiltsev, the director of the Arts and Culture Museum St. Petersburg and the author of the forthcoming book Artropolis: Light, Sound, Movement, and the Art of Biennials, told Artforum: “We are in the process of organizing a new platform for the exhibition, but we are not yet certain what it will look like and how it will be organized.”The festival will also include a new exhibition of work by four new artists, which will be presented in the coming months. The new works were chosen by an international jury consisting of artists, designers, curators, and curators-in-residence; Cristina Sforza, the curator of the new exhibition “Agnes Martin: Beyond the Photographs” at the Contemporary Art Museum St. Petersburg; and Tereza Bayramova, the director of the Five Points Gallery in Sofia. The full list of participating artists is as follows:Akbar MahmoodAkram FarmanAkram Farman, Farsi and Arabic translations", "The next Biennial should take place in the spring of 2021. “As we work to redress the balance between public and private space, we are driven to think anew and re-imagine the future,” the director of the University of Amsterdam, Melanie Atlee, said. “This is one of the most important issues for a university: to live and work in a city where the people are and have always been present. We need artists to make this possible.”The exhibition was inspired by the city of Amsterdam—which, in addition to hosting the 2017 World Exposition and the 2020 Olympics, also boasts a Köln museum, a museum of modern art, and an architectural museum—though the former is currently undergoing a €200 million facelift. The latter recently underwent a major renovation, and is currently undergoing a new glass façade. Its architecture is inspired by the city and derives its name from the Greek mythological city of Mycenae, which is where Sam Harris, the philosopher and activist, has lived in his home for the last fifteen years.The Biennial will feature artist performances, exhibitions, residencies, readings, concerts, and other events. The full list of participating artists is as follows:Aj", "The next Biennial should take place in the autumn of 2021, and will display the first five works by the selected artists. The Biennial will be held at the Museu de Arte Contemporain (MAS) in Madrid, Spain, and will run from October 22–28.\n\n\nThe Museum of Fine Arts (MFA) in Boston has announced that it is planning to open a new arts space, the Millennial Arts Hub, in the city. Launched by the museum in partnership with the Boston-based firm MIP, the arts space will host more than one hundred artists annually. The arts space will be located on a five-acre campus and will offer live programming, education, and programming, as well as a dedicated gallery.The new museum will be built on the third floor of the museum and will bring together new works by ninety-two artists from forty-nine countries. The artists participating will include: Janette Laverrière, Pari Dukovic, Alexei Kuzma, Adriana Olmi, Bronwyn Roy, and Nancy Willoughby. The 2020 cohort consists of: Artsakh Happy, Beurutu-Bijayan, Ch", "The next Biennial should be held in the autumn and will be comprised of fifteen exhibitions, with the first exhibition being “The Secret of the Nile” (2019), which will present a reworking of “The Secret of the Pearl,” a treatise on the biblical catastrophe that will be performed by the Egyptian artist Khaled El-Dahab. The exhibition will also include a new collective show, “The Rebirth of the Egyptian People,” curated by Alireza Hossain, which will present an eight-part series written by the Egyptian artist Nima Nabavi.The Biennial is also working with fifteen other institutions, including the Egyptian Academy of Arts, the Institute of Humanities and Sciences in Cairo, the Ministry of Culture, and the Islamic University of Cairo.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that the opening of the museum’s new series of exhibitions, “Sensate: Contemporary Art from Africa, Asia, and Latin America,” will be marked by the exhibition of work by twenty-four artists and workers from Central and South America. The first set of exhibitions, “Sensate: Contemporary Art from Africa,” will focus", "The next Biennial should be held in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it is planning to open a new digital platform, the MFA Curator’s Lab, that will allow curators and arts professionals from around the country to collaborate across platforms and share works. The virtual residency program will initially run from March 19 to March 22, 2020, but will expand to a yearlong program that will run concurrently across all of the museum’s locations.Curators will be able to submit works to the platform through a collaboration that will work through the curators’ digital channels, and participating curators will receive a cash stipend for their projects. The $1,500 grant program will support the development of the skills and competencies needed for the careers in art and technology.“We are thrilled that the MFA has recognized the value of collaboration and that curators and arts professionals are so much more than a collection of objects—they are people who define their own futures and shape the future of their art,” said Amy Schatz, director of the MFA. “Our curators and arts professionals have the responsibility of redefining how the art world operates, and we are grateful", "The next Biennial should take place in 2020.\n\n\nAs the cultural center of Louvre, Louvre Art, and Musee de la République (LUMR), nears its completion in Paris on Wednesday, August 4, the Louvre Foundation and the Louvre Art Museum in Saint-Denis announced the launch of their digital platforms, Artforum.fr and Artforum.de. The first will be a place where visitors can see and purchase works by artists, as well as a portal where they can connect with other collectors, collectors' associations, and dealers. The second will feature a selection of the most recent exhibitions.“The openings of these platforms are the occasion for the first and the second of the foundations to work together to make the collection, the circulation, and the exhibition of works on the Internet more accessible and engaging,” said Christophe Berthold, president and CEO of the two foundations. “We believe that the collection of the digital artworks of the two foundations, or the content of these platforms, can be a powerful tool for the promotion of the art of the most important artists of the last century.”In order to create the platforms, the foundation sent an email to researchers", "The next Biennial should take place, to be held in the autumn of 2021, in the city of Hangzhou, in the State of Zhejiang, China, which will host an international conference. \n\n\nThe Shandong Museum of Art in China has been awarded a $50,000 grant from the China Foundation of Contemporary Art (CFCA), an organization established by the State Council. Located in Shandong Province, the institution has received the gift of a new twenty-five-foot-long, glass-enclosed, marble-encrusted central lobby by artist Ai Weiwei. Since its opening in 1972, the museum has staged an exhibition of work by over one hundred contemporary Chinese artists, including the ongoing “Airing of Images,” which was staged last year, and “The Soft Sun,” (2019), a group show exploring the power of photography to affect our consciousness.The grant follows a $250,000 donation made by the State Council in 2017. Previously, the foundation has granted $350,000 to the museum every year since 1990. “The Shandong Museum of Art is a museum of the past, a museum of the future, and a museum of the improbable,”", "The next Biennial should be held in 2020, in the second half of the year. The next edition, titled “Between the Sun and the Moon,” will be held at the Museum of Contemporary Art in Berlin in May 2021.Next year, a new exhibition will be held at the new Biennial, which will usher in the new millennium, the Eurasian Century. The venue will be inaugurated by a performance by the band Do Not Disturb, which will open at the Berlinale in March 2020. The new exhibition, titled “Between the Sun and the Moon” will include works by twelve artists, including Kirsten Lohmann, Adam Pendleton, and Zakiya Qaradzadeh, and will feature the voices of Nour El-Din, Akram Arif, and Mohammed Omer, among others. The artist-in-residence will be Nour El-Din and will be housed in the same building as her sister, Nour El-Dawla, who is currently a visiting scholar at the Art Institute of Chicago.\n\n\nThe Centre Pompidou in Paris has received a major gift of 300 works from the Louvre collection. Its holdings include works by Henri-August", "The next Biennial should take place in 2021 and is expected to cost around $100,000. \n\n\nFinland has become the latest European country to announce it is planning to shutter its European-based museums and shutter its budget-and-venue art museums, in the wake of the recent deadly Islamist terrorist attacks in Paris. The news follows Finland’s announcement that it is closing the Visitor Information Center (NIV), the National Museum of Finland, and the National Museum of Finland Art. The museums will also close early next month, and the National Gallery of Finland will remain closed until December 31.A country-wide memorandum published by the Finnish Ministry of Culture on April 28 warned the public to stay away from “haunted cultural sites and places of influence,” citing safety concerns related to disease and terrorism. It also outlined the major steps taken by the government to prepare for the pandemic. The full list of institutions that will cease to exist in December is as follows:The letter concluded by stating that Finland cannot “implement effective social protection and emergency management through a museum-centric model that excludes the collection and display of cultural artifacts, while also neglects other parts of the cultural ecosystem,” and that “all procedures and", "The next Biennial should be held in 2020. A further exhibition will also be staged at the Museum of Contemporary Art London in 2021. The first exhibition, “Stage Design: Art and Performance” (2019), was organized by the Columbia Center for Modern Art in New York and was presented by Jessica Morgan. Following a change in management, the museum added the work “Tania Bruguera” (2018) to its collection in 2008.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that the museum will host the first exhibition dedicated to American painter and sculptor Charles Peale—a cofounder of the American Abstract Expressionist movement and a pioneer of Abstract Expressionism’s shimmering, painterly figures—in the city in 2021. Peale, who committed suicide in 2009, will be buried at the Peale Memorial Museum at the University of Cambridge in the United Kingdom.The exhibition, “Charles Peale: American Art, 1967–1983” will consist of five hundred works, each the product of a single year of Peale’s life. Peale’s work is for sale by the ICA, which has been working with the Peale family to secure its permission", "The next Biennial should take place in 2020 and will be organized by the same Artistic director, Franziska von Kapp and will be hosted by the Frankfurt Center. The event will culminate with a collection of photography works by the Frankfurt-based firm, which has locations at the Künstlerhaus and in Königsberg.  The organizers told the German daily Die Tageszeitung that they expect the pavilion to draw up to 3.5 million visitors to the event. The twenty-fourth edition of the Berlin Biennale will be held at the Künstlerhaus in the spring of 2021. For more information about the pavilion and the 2019 edition, visit Berlin’s Art Berlin.\n\n\nThe National Centre for Contemporary Arts (NCA), in the United Kingdom, has announced that it is expanding its curatorial staff in order to support the needs of the twelve-month-old arts and cultural sector during the Covid-19 outbreak. The move follows a twenty-five percent drop in visitors to the NCA’s London location since spring, and a five percent drop in revenue. The NCA’s director, Andrew Furlani—who was", "The next Biennial should be a tribute to his legacy. “I have been a biennial fan since I first saw Roger’s work when I was in high school in the 1980s, and his work has influenced me to this day,” said Heather Hoenig, artistic director of the Biennale of Sydney. “We are indebted to Peter for bringing us the new work by the artist. Not only is the work of the artist a joy to behold, it is an international treasure. He is an outstanding example of the artist’s ability to touch the lives of people in ways that the public could not imagine.”The collection will be relocated to a new location in the city, the Centre for Contemporary Art at the University of Technology Sydney, where it will undergo a major expansion, the museum’s director Elizabeth Ann Macgregor said. The new spaces will be designed by the renowned architect Christopher Graham and will boast more exhibitions, classrooms, galleries, and public spaces, and will include an expanded collection of contemporary art and architecture, a new building for the museum, and more rooms for educational and community activities.“We are committed to supporting the Centre for Contemporary Art at the University of Technology Sydney as it", "The next Biennial should be held in the year 2020. This year’s event, titled “The Future Is Present,” will be held at the Palais de Tokyo in Paris on November 23–December 16. The theme will be “All That Matters” and will feature works authored by thirty-six artists, including Ekaterina Kuzma, Enrico Castellani, and Raffaello Poggi.This year’s show will be held in partnership with the Dreyfus Museum of Art in Petersburg and the Museum of Modern Art in New York. The exhibition will feature work by fifty-four artists in addition to the full catalogue. The Dreyfus Museum of Art will present the first exhibition of its new collection on November 21 and the Dreyfus Museum of Art will present the second exhibition on November 22. The Palais de Tokyo will present the first exhibition of its new collection on November 23 and the Palais de Tokyo will present the second exhibition of its new collection on December 1–December 3.The work of the thirty-seven artists named in the catalogue are as follows: Anish Kapoor (Belgrade), Anna Halberg (New York), Manuela Musulman", "The next Biennial should be held in 2020. The space will be renamed after the curator of modern and contemporary art, and the event will be hosted by the San Francisco Museum of Modern Art (SFMoMA) and the Metropolitan Museum of Art. The museum will also deepen its relationship with the city by creating a new digital platform that will showcase the work of the artists who have participated in the exhibition.The exhibition will also include work by the following artists:ADAM CHENANOVSKYADAM GRANTADAYANOVSKYADAM GERMANOVICHADAM KARINADAM KARINADAM MILANADAM KARINADAM PARINANADAM KRISHNAKARALAM KRISHNAKARALADAM SHADDOCKADAM SHAKILYADAM SHADNERADAM SHADNERADAM SHAKILYADAM SHADNER ADAM SHWANIADAM SHWANIAM SHWANIAMSHIRAN BHOPALADDINDAU SHAWAIRAIDARJ. SHAWAIRAIDARJ. SHAWAIRAIDARJ. SHAWAIRAIDARJ. SHAWAIRAIDARJ.", "The next Biennial should be held in the Fall of 2020.  Artist Biennials are selected from a pool of ten artists who are nominated by a panel of judges, selected by a panel of artists, and selected by a committee chaired by Tarashiro Masuda, chairman of the museum’s board of trustees.The second Biennial, expected to be held in the Fall of 2021, will be held in the Spring of 2022.\n\n\nAfter the police fatally shot George Floyd, a Black and Indigenous artist from Memphis, Tennessee, in the street on May 25, 2017, the Tennessee Bureau of Investigation (TBI) ordered the removal of a monument commemorating decades of racist violence against Black and Indigenous people from a public park in the city.The episode has led to a period of intense organizing as activists from across the United States have tried to force cities and state governments to confront the legacy of their police departments. In Memphis, where Floyd was killed by a white police officer named Bill Godwin, activists successfully lobbied local officials to take down statues of Confederate generals and a city councilman to push for reforms. Activists have also worked with local, state, and federal lawmakers to push for the removal of controversial historical statues, which activists say honor oppressive", "The next Biennial should take place in 2020. \n“I see the exhibition as a vehicle to examine the relationship between art and technology,” Diya Ghose, a curator and executive director of the B.I.T.E. network, told the Art Newspaper. Ghose said that it is the combination of the technology and art that makes the exhibition uniquely suited for the region.“The work of the artists in the exhibition embodies the spirit of innovation, experimentation, and change,” he said. “The exhibition reflects the ingenuity of the curators, whose practice is interwoven with the collections of the museums, and the artists’ idiosyncrasies and their own, for their own sake.”Louis Vuitton’s Hong Kong-based artist-in-residence, Li Wei, created the exhibition’s installation,  The Last Thing I See, at the modern art museum St. Martin’s Place in Beijing in 2017. Since its installation, which was staged by artist-in-residence Andy Gadd, the piece has received a number of public awards, including the $1,200 Art Prize in the Abu Dhabi Art Market and the $2,", "The next Biennial should be held in the autumn of 2020. It has also been approached by several other countries, including France, Germany, and the United Kingdom, as well as by the Musée d’Art Contemporain in Paris.  People who would like to see a Biennial in China will have to wait until the end of the year, in March 2021. \n\n\nBritish Museum director Maria Balshaw and artist Shepard Fairey have been named the recipients of the 2020 Artadia Artadia Awards, which are made up of a prize for excellence in visual art and a grant of $50,000. The nominees for the prizes are Arash Endersby, Paul Diehl, Stephanie Durenberger, and Christopher Gray. Balshaw, the author of Apathy: The Visuality of Planets, and Fairey, along with artist John Darnielle, are among the twenty-nine artists who have received the award since its inception in 2000. The 2020 awardees are: Arista Daum, Amanda Ewing, Richard Avedon, Eleanor Holmes Norton, Alan Parsons, Kirsten Kelly, Hannah McKay, ", "The next Biennial should focus on “Millennial Violence: The European Middle Ages” (2019) and “Dead Kennel: The Modern Life of Brut” (2019), among other exhibitions.The 2020 edition will be organized by the Biennale Berlin, which is headquartered in the city of Berlin. The venue will be inaugurated by a presentation of the Biennale “The Silent Years,” an exhibition of contemporary art that will mark the seventy-fifth anniversary of the Berlin art museum. One hundred works by forty-five artists from the Biennale will be presented in a single exhibition. The work of the artists chosen for the exhibition will include “Dr. Luke” (2019), “The Shocker” (2019), “Quadrangle” (2015), “Jerry Lee and the Devils” (2015), and “Freedom Riders” (2014).\n\n\nThe University of Bristol has appointed Kate Pickering as the new chair of arts and aesthetics. Pickering is a professor of visual art at the school and has served as a member of the department of visual arts since 2008. She succeeds John Coltrane, who has helmed the school for more than twenty years,", "The next Biennial should take place in the near future. Internationally recognized artist and curator Heiko Hahn will direct the exhibition.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is working with the California Black, Native, and Indigenous (CAN) Arts and Cultural Groups (CLAGG) to create a new exhibition that examines the legacy of the Black Lives Matter movement. Titled “Unbeing,” the thirty-six-minute show will comprise three narrative experiences: a black feminist political critique of the Black Lives Matter movement, a Black feminist public artwork and performance, and a “messaging” piece that calls for Black people to stop wearing the symbols of white supremacy and racial violence.“We welcome and support Black survivors of police violence,” said museum director Mike Guggenheim. “The Black lives matter movement speaks to an important historical moment when Black people were finally given the moral high ground to demand racial justice. We hope that this show will challenge and challenge the existing state of racial justice, highlighting how it has long been a White construct, and how it still remains in large part systemic.”The exhibition will be modeled after the Black Lives Matter “Injustice at Any Speed,", "The next Biennial should focus on the central role of the American South in art and culture in the United States. The biennial will serve as a window into the American South and will be curated by artist and curator Mark Talbot, who curated the fifty-ninth Biennial, “The Imaginative '72,” in 2006. “The challenges of reopening once more after a major power outage mean we have a great deal to consider and to shape in the coming months,” said Andrew Horowitz, chair of the Biennial’s board of directors and curator of the 2018 exhibition “American Art: From Protest to Protest.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Kenji López-Alt as its next director. In a statement, the museum said: “López-Alt is an experienced and talented leader who has demonstrated a demonstrated ability and willingness to take on challenging challenges in both creative and operational ways.” He succeeds Keith Johnson, who retired after a decade at the helm of the museum in February 2019.López-Alt comes to the institution from the Los Angeles County Museum of Art (LACMA), where he has", "The next Biennial should be in 2021.\n\n\nThe museum’s permanent collection has been partially restored after a fire broke out at the museum in the early hours of this morning, January 6. The fire was extinguished by 11 AM, but the collection remained damaged. The building, a former archive, contains works dating back to the nineteenth century, including paintings by Albert Camus, Charles de Gaulle, Herman Hesse, and Anselm Kiefer.Called the Centre, the Museum of Modern Art (MoMA) exhibition space was constructed in 1978 and reopened in 1981. The fire began in a firework display, known as a Hermitage’s Great Northern, that was being transported to the museum by Terry Eagly, who was working on a design for the institution. The firemen who extinguished the blaze before it reached the vault\u0097which houses the museum’s collection, artworks, and the archives\u0097said that the work was “burned to a crisp.” The Hermitage has previously closed to the public in December due to concerns around Covid-19.The 500-year-old museum, which was built in the", "The next Biennial should be held in 2021. The next Panorama will be staged in 2022. And the next Art Trip will be staged in 2021.”Museum director Asher Rothkopf said: “The concept of a theme-driven exhibition is to me, and will always be, a new way of seeing art. I am extremely honored to be working with Jorge and Sofia to create a theme-driven campaign for the new Biennial.”\n\n\nRebecca Corrigan has won the 2019 Pinchuk Foundation Prize for Arts. Corrigan is a New York–based artist and a her husband, Steven Corrigan, a television and film director; a cofounder of the experimental New York–based nonprofit the Performance Space, a platform devoted to performance and performance-based artistic practices; and a designer whose work encompasses canvases, prints, photographs, videos, and installations. Born and raised in New York, Corrigan grew up in Dallas. Her early projects included using a sewing machine and a television set to create works that explored her own body and the ways in which she relates to art and design. In 2011, the same year the Pinchuk Foundation Prize was created, she was awarded the Paul Gauguin Foundation Medal", "The next Biennial should be held in 2022. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of fifty-six works from the American artist Walter de Maria. Located in the collection of the gallery of the same name in New Brighton, Massachusetts, the works were donated by de Maria’s wife, Katharine de Maria, in memory of her husband. Walter de Maria passed away in 1978, and died in 1995. Katherine, a longtime friend, purchased the works from the artist while he was still alive, and her husband donated the rest of the collection to the museum. The gift includes paintings by artists such as Robert Irwin, Elizabeth Peyton, and Joseph-Marie Picasso, as well as works on paper and acrylic.Commenting on the gift, Walter de Maria said: “Our mission at MFA is to promote a serious and rigorous aesthetic study of art and design, and to form the potentialities of the imagination through artistic experimentation. The works of the mind in the gallery are a wonderful illustration of this vision. The gift of fifty-six works by Walter de Maria is an extraordinary recognition of his contribution to the arts and design in the city of Boston.”\n\n\nThe Los Angeles County", "The next Biennial should take place in 2020, but given the current situation, I am not optimistic about the date. \n\n\nThe Rockefeller Center in New York City has issued an emergency safety order for visitors to the museum, which was forced to temporarily close earlier this month owing to the coronavirus, to ensure that their personal protective equipment (PPE) is on hand. According to the New York Times, the order was made after the museum received twenty-one deaths within a twenty-four hour period and was made on the fifth floor of the complex, which has a seating capacity of around four hundred people.According to the New York Times, the order states that anyone who is not wearing face masks or respiratory protection or who is traveling by car should leave the building by themselves as soon as possible. It also states that those who are detained for not wearing masks or complying with the order may be held in detention for twenty-four hours.If enforced, the order will likely instill panic in the otherwise somber crowds gathered at the museum for the upcoming exhibition “The Unbearable Lightness of Being: The Golden Years of Stephen Sondheim”, which is organized as part of the artist’s seventy-fifth anniversary. The show", "The next Biennial should take place in the spring of 2020. The theme for the event will be “future discovery and research.” We expect that the first exhibition, “Genesis: The First Museum of Consciousness” will open in the spring of 2021. The exhibition will include four works by five artists: Jean Luc Moulène, Marcel Prouvé, Aldine Prothe, and John Akomfrah. The show will be followed by “Genesis: The Museum of Modern Art,” which will open in the fall of 2021 and will be organized by the same architects, the same team, and the same creative team that created the exhibition. The event will consist of a series of collaborative activities that will culminate in a reception and the installation of the final work by the artist Rainer Spezial.The next exhibition will be “Slavoj Žižek: Resurrecting a Roman Empire” at the Guggenheim Museum in New York. The work will be presented in the form of a series of installations and will be curated by Alexander Wieseltier. The show will be organized as a series of solo presentations beginning with", "The next Biennial should take place in Berlin in late June/early July, as planned.The institution currently has a waiting list for a grand opening.\n\n\nA Saudi Arabian artist, who exhibited at the prestigious Victoria and Albert Museum in London in 2015 and was selected by its board of directors for a prestigious Davis Art Gallery prize this year, has been killed by a suspected heart attack. The artist, who was sixty-eight years old and from the Eastern Province of Alsina, was killed by the symptoms of a massive blockage, or aneurysm, in his left ventricle, the London Independent reports.The Saudi American artist was part of a group, assembled by the British artist Fawaz Al-Hashemi, who also included Toby Barlow, John Barlow, and two others, Abdullah Al-Kasas, in the exhibition “Farthest Far,” which opened at the contemporary art museum in London on June 29. The work, which was commissioned by artist David Adjay, was released on June 27 and has since been exhibited at the Institution of Contemporary Arts, London; the Museum of Contemporary Art, Los Angeles; the National Portrait Gallery, London; the National Museum of Fine Arts, Birmingham; the", "The next Biennial should be held in 2020, and the first event in 2021. The Sargent’s Place will be a biennial of the same name, which will be held in the Sargent’s Place of the Metropolitan Museum of Art, New York, in 2021. The 2019 event was staged by the Museum of Modern Art in New York, and the Sargent’s Place was founded by artist and collector David Sargent.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Andrew Schier as the new director of the museum. He succeeds Simon L. Jackson, who last year led the museum for fourteen years, and will take up the post on January 5, 2020.“Andrew is a gifted curator who has been instrumental in shaping MoMA’s presentation of its curatorial ambitions for years,” said Peter Carr, chair of the museum’s board of trustees. “We look forward to his leadership as MoMA’s director. We are thrilled to welcome him to the museum and are confident that he will further enhance the museum’s collection, exhibition, and programming in the coming years.”Prior to joining the museum in 2014,", "The next Biennial should include: “Intersections of art and culture: Photography, sculpture, performance, and performance-based art.”\n\n\nThe National Museum of Fine Arts (NMA) in Savannah, Georgia, has announced that it is recalling more than 300 works after it discovered that some of the pieces are missing or have been moved. The institution discovered that some of the works, which are valued at more than $550 million, were stored in a cabinet that had recently been installed.The collection was moved after the works, which are part of a series titled “Visions of the Body,” were installed in the museum’s former exhibition space, the Peabody Delta, on May 8. The Peabody Delta was the venue for the works’ installation in the building’s basement between 1999 and 2001.“The museum’s staff discovered that certain works were missing from the Peabody Delta, and the Peabody Delta staff assumed that these works were missing from the Peabody Delta as well,” said museum director and CEO Josh Mullen. “I’m confident that we will soon have that information to back up our work and to answer all of the questions", "The next Biennial should be held in 2021. It is scheduled to open in the spring. The Biennial will consist of six exhibitions, including a new “Fear not,” which will be an exhibition of one hundred works by the Dalai Lama, and will run for three weeks.The Dalai Lama’s invitation to the public to march in a demonstration in support of Tibet’s independence from China was initiated by the group Tibet Solidarity Movement. The idea grew out of several large protests against China’s development in Tibet, which were held in the region as late as 2016. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of more than 2,500 photographs that were taken by French post-war surrealist Georges St-Pierre. The work is one of the few remaining works by the legendary photographer during World War II and will go on display in the institution’s exhibition “The Circle: Photographs from a French Post-War Life” next week. The exhibition will include three works by St-Pierre that will be restored, and will also reenact a scene from St-Pierre’s 1975 documentary film The Circle, which follows a group of", "The next Biennial should take place in 2020. The exhibition will include work by forty-five artists and will be held at the new museum in the city of Saint Louis. The museum will be inaugurated with an exhibition of work by artist Mike Kelley and will be inaugurated with a lecture by Alexander Calder. The architect of the exhibition, architect and best-selling author William Kentridge, will be honored at a special award ceremony on August 27, 2020. \n\n\nThe Autry Museum of Art in Michigan has announced that it is proposing to build a new 50,000 square-foot exhibition space in its building on East Ninth Street in the Detroit suburb of Dearborn. The five-story, five-and-a-half-thousand-work collection will be located in a former steel mill and will include work by a selection of artists, including Alice Aycock, John Crowley, Richard Diebenkorn, and Mark di Suvero. The $1.4 billion museum, which will also house the Wayne County museum of Art, is currently undergoing a $500 million expansion.The project, which was funded by Detroit-based developer Tony Hahn, MCH Group, and billionaire collector Carl Levin, began in 2007, with funds", "The next Biennial should take place in the city between November and March 2021. “We are in the process of choosing a theme for the event and are in the process of discussing the future of the Biennial with the city of London, the central government, and the artists,​​,” Museum director Mark Simpson told the Art Newspaper. Simpson also said that the Biennial will be “implemented in a way that is sustainable,​ and will be curated by the world-class artist-organisers, Phil Collins and Rineke Dijkstra,​ as well as by the artists themselves, to represent the spirit of the London Borough of Kensington and Chelsea.”\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) opened its new 130,000-square-foot outpost in the heart of the city on October 3. The move—the museum first announced plans to open in September—presents a bit of a turnaround for an institution that has been plagued by financial troubles since last September, when it announced plans to break ground on a new public art space, the Museum of Modern Art (MoMA). “It is a historic moment for San Francisco,” Mark Mast", "The next Biennial should be held at least once a year. Universal Studios is also working on creating a platform for artists to create new works for the exhibition.  The next edition of Biennial Miami Beach will take place at the Hotel City, Miami Beach, from March 16 through March 19. The show will include work by forty-eight artists and have a running total of 230 works. It will be shown at the Museum of Contemporary Art, Miami Beach. Artists who have been selected to represent the Commonwealth at this year’s event include Diana Al-Hadid,  Bradley Beaulieu, Cara Bech, and Gina Bech, as well as works by Masanori Yamaguchi and Kyoshima Ota.Organizers said: “It’s been a tough decision to demote a great collection of artists who have shaped the future of how we think about art and how we make art. . . . We were hopeful that the history of the biennial would serve as a model for how we think about and design iconography, but it has unfortunately become clear that this is not the case.”The Commonwealth’s Advisory Council on", "The next Biennial should include a presentation of new works by emerging and established artists, and should culminate with a performance by a group of artists, the following week.” The 2020 edition, which will be held at the 16th Venice Biennale, will also include a virtual reality (VR) pavilion, a book launch, a presentation of the work of the artists in the range between 15 and sixty years of age, and a discussion panel.Following the Paris Triennale in December 2018, a collective called the Paris Artists’ Group (PAG) announced that they will no longer participate in the upcoming event. “It is with great regret and disappointment that we announce that we are no longer participating in the upcoming Biennale,” reads a statement on the group’s website.Commenting on the decision, the Paris-based artist and curator Serge Lasvignes told the Art Newspaper: “It is not great to leave a group of artists that has the power to be so central to an entire history of art, but it is very important to take into consideration those artists whose work is already partially lost.”He added that the group failed to address the group’s 'serious problems of the work", "The next Biennial should be held in 2022. \n\n\n\n\n\nThe St. Louis Art Museum (SLAM) has received a gift of over 500 works from the iconic artist’s Washington, DC–based foundation, which was established to create and preserve works by the late American painter Robert Irwin. The gift includes more than 9,600 works by artists such as Bernard Ochi, James Copenhaver, and Carl Andre, as well as a selection of works by the late American designer Mies van der Rohe, whose work was inspired by Irwin’s.The museum has been receiving gifts of works by artists since 1988. The museum created the Robert Irwin Gallery for American Art in 2006, and the Robert Irwin Foundation for the Arts in 2011. Its foundation also operates Goethe-Institut in Mannheim and the Städelschule in Berlin; the foundation has five grantees in China, Japan, New Zealand, and South Korea.The gift package includes: a set of works by Robert Irwin’s protégés William A. Smith and Robert Irwin’s widow, Sari; a work by Jesse and Patricia Hunt; and a collection of works by the late French artist Sven Nysvik.", "The next Biennial should be concluded by March 16, 2020. \n\n\nThe Metropolitan Museum of Art in New York has announced that it will spend $1.23 million to relocate the collection of Sylvia and Adolph Sutera, the founders of the label Ai, to a new home in the city. The move will allow the museum to stake out a more permanent position in the cultural landscape, which has been rapidly changing since the mid-1950s.“The Sutras’ collection presents a unique opportunity to create a new and dynamic environment for the museum as we reimagine the museum, the city, and the island,” said museum director Daniel H. Weiss. “This is a transformative year for museums in America, as we closely examine the state of our museums and the city. We are also facing a serious crisis in the museum industry. We are confident that this work, the Sutras’ relocation, and the next Biennial will provide the foundation for a sturdy and prosperous future for museums.”The Sutras’ collection comprises works that explore the relationship between art and culture, including paintings, sculptures, drawings, paintings, photography, sound, and visual art. Its exhibition “Beyond the Horizon: Ver", "The next Biennial should take place in January 2020, with the opening of the exhibition “Sculpture and the Modern Body: From the Society of the Spectacle” (October 2019). The biennial will highlight the work of around fifty artists, including Anton Chekhov, Antony Gormley, and Anselm Kiefer, and will also include a number of documentaries and a performance from the exhibition. The biennial will also emphasize the contributions of young and mid-career artists to the field.The announcement of the 2018–19 edition of the Biennial drew widespread praise from the art world, who praised the Canadian-born, New York–based artist’s ability to employ both his artistic and political experience to address important issues, including the cultural and political resonance of immigrant communities in Canada. The exhibition marked the first time the biennial was held in Vancouver, and the fifth time the Biennial was staged in the United States. The biennial’s inaugural exhibition, “Her Story,” was held at the Vancouver Art Gallery in March 2019, and the following year’s edition of the exhibition was held at the Art Gallery of Ontario. The 2019 version of the exhibition was attended by more than", "The next Biennial should be held in 180 days.”The 2018 edition of the Milan Biennale, which opened on March 11 and ran through April 6, was also canceled. The official reason given was a super-volcano in the Cigliano region of Italy that has been active since the summer of 1976.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has announced that it is reopening this fall following months of construction in an attempt to contain the coronavirus, which began as a novel coronavirus-19 in China and has since spread to more than sixty countries. Construction on MoCA’s new facility, which will include a new large-scale public art installation and a new micro-gallery, is expected to be complete by the end of September. MoCA’s current space, the former home of MoMA and the California Studio Museum, opened in 2012 to relatively little fanfare and has since become an important cultural hub for the city of Los Angeles. The institution opened in a former auto body shop in 2012 and has since experienced considerable popularity, with its first show, “The Trees,” at the Los Angeles County Museum of Art (LACMA) last year.The new", "The next Biennial should be held in the spring of 2021. Ibid. The second will be held in the autumn of 2021. The third will be held in the spring of 2022. The fourth and fifth, respectively, will be held in the fall of 2022. The fifth, which will be held in the spring of 2021, is slated for October 2021. The sixth, which will take place in the autumn of 2021, is scheduled for October 2021. The seventeenth, which will be held in the spring of 2022, is scheduled for October 2021. The eighteenth, which will be held in the spring of 2022, is slated for October 2021. The nineteenth, which will be held in the spring of 2022, is scheduled for October 2022. The twentieth, which will take place in the Spring of 2020, is scheduled for October 2021. The twenty-fifth, which will be held in the Spring of 2020, is scheduled for October 2021.  The thirty-eighth, which will be held in the Spring of 2020, is slated for October 2021. The forty-ninth, which will be held in the Spring of 2020, is scheduled for October 2021. The fifty-seventh", "The next Biennial should be held in 2023, the report said. “The developments in climate change and the challenges posed by the pandemic will make the future of art and design matter more to us all.”The biennial will include new works by sixty-four artists, including the artists who were featured in the exhibition “20/20” (2019), which opened at the foundation in May. The quarterfinalists for the prize include Tom Clark, Bradley Chappell, Nigel D. Coleman, and Hannah Edin. The biennial will also receive a $75,000 prize.\n\n\nThe Museum of Modern Art (MoMA) in New York has stepped up its efforts to encourage the grow and dissemination of Japanese art, both inside and outside of the country. In an effort to demonstrate its commitment to supporting the cultural sector, MoMA is now allowing Japanese artists to submit works for consideration for a 2020 exhibition. The exhibition is currently underway, and the selected artists will each receive $25,000 in support of their exhibitions.The show, titled “Art of War: Japan and Chinese Art in the 20th Century,” will open on September 5 and will feature forty works", "The next Biennial should be held in 2020. The first Biennial was not organized by the people of Pakistan, but was instead organized by the British; the second was a joint project between the British and French.The selection committee chaired by Amina Tahir announced that the twenty-fifth edition of the biennial would take place in 2022. The biennial, which is an extension of the organization Art Basel and will be hosted at the Galleria Nazionale di Santa Maria Giulia in Milan, will focus on themes such as history, philosophy, architecture, and science. Tahir said: “The theme of the project is history, of the past and of the future, which is a theme that is universal in nature, and it is also universal in our lives. I want to highlight this in my work and in the Biennial. ” The biennial will include over ninety exhibits and will be held at the Galleria Nazionale di Santa Maria Giulia. The selection committee also announced that a new group exhibition will be organized in the coming weeks. The inaugural edition of the group exhibition, titled “The Mists,” will run in September 2020 and will feature thirty-", "The next Biennial should be held in 2021, and the 2020 edition will be staged at the Museum of Modern Art in New York, which is currently trying to revamp its collection and has launched a $250,000 competition for local artists to present exhibitions that will be curated by the museum in the coming months.According to Akiba, the current exhibition season is the same as the one of 1999, and the biennial is looking forward to celebrating its thirtieth anniversary in 2021. The institution is also planning to expand its collection, and has enlisted the help of a curator from the British artist Roger Koppel to curate the inaugural exhibition, “In the Beginning Was the Word” in January 2022.\n\n\nThe Pérez Art Museum Miami (PAMM) announced that it will hold an exhibition this fall featuring thirty new works and a selection of artists that were selected through a public vote. The show, “The Perfect Storm,” will exhibit the work of twenty-one artists and will be presented by artist-in-residence Hélio Oiticica, who will represent Mexico City and is currently producing her master’s thesis on the concept of the perfect storm.The M·C at the University of Central", "The next Biennial should take place in the December–January timeframe, with a theme of the Black Lives Matter movement. The biennial will also include a discussion of how art can play a role in promoting social change. The nine-month exhibition will feature work by thirty-six artists, including Robert Diaz, Antonia Cameron, Yasmina Al-Asad, and Sargent Mott, and will showcase the work of seventy-one artists from thirty-two countries. \n\n\nThe Australian Museum of Modern Art (A.M.A.) in Sydney has announced that it will reopen on August 5 following the completion of a major $6.4 million expansion project, which is the largest undertaking undertaken by the museum in its forty-year history. The renovation, which slightly altered the institution’s original vision, included the addition of a new building, the new exhibition space for the museum, the remodelled entrance, and the addition of a terrace. The museum also added six new galleries and a new library.“We’ve been working hard to get to where we are today, and the new 13,000-square-foot exhibition spaces are a particularly exciting milestone,” curator and chair of the A.M", "The next Biennial should be held in the spring of 2021. The 2019 platform was organized by the Diocese of New York, which is headquartered in the city. The event will be hosted at the new museum in the summer of 2020.The Diocese also announced that it will be partnering with the Long Island City Museum of Art (LICAM) in Queens, New York, to create a new exhibition, “Theology & the City: Contemporary Art in the City,” that will explore the intersections between religion and culture in America. The show will feature new work by Emily A. Bly and Jack B. Lewis and will be on view until November 23, 2020. The show will also feature work by Judith and Paul Gauguin, Jean-Luc Godard, and others that were not previously included in the museum. The show will be organized in collaboration with the city of Long Island City and will debut in March 2021.“This is a historic year for the city of Long Island City, and we are excited to work with the Diocese of New York and city residents to promote the full range of artistic activity in our city,” said Kristina Kapteyn, the museum’s director. “The show", "The next Biennial should be held at the Pérez Art Museum in Madrid, which has recently opened a new branch in the capital. The new museum’s new design, which was inspired by the Pérez Art Museum’s original, was completed in 2017 and opened in 2018. The museum will commemorate its 125th anniversary this year. The exhibition has drawn some of the biggest names in the art world, including José Camargo (Anton Kern), Maren Ade (Kathrin Oppenheim), and Martin Packer (Michael Resnick).The Berlin-based firm Max Mara, which has held various projects with artists such as Thomas the Tank Engine, Una Kassem, and Ed Ruscha, is the architect of the exhibition. “The Biennale has showcased the growing potential of the contemporary art market internationally, and it has breathed new life into the colonialist imagination,” said Ali. “The new exhibition will make a strong statement in these current turbulent times. The building, the exhibition, and the artist are connected in some way. I want you to be able to feel the warmth and the memory of the Biennale in your heart. Every detail is essential for the artistic and", "The next Biennial should be held in May 2021. The event will be organized so that it will be able to grant the necessary exposure to contemporary art in order to facilitate the transition to the twenty-first century.”Art Basel Hong Kong is currently working towards relocating to a new three-yearly edition of the fair. The exhibition will also look into integrating the fairs main venues into the city, as well as aligning the fairs biennial with the city’s annual Art Basel, Art Dubai, Art Paris, Art Shanghai, and Art New York.The fair’s other major upcoming events are Art Basel Hong Kong in the second half of May, Art Dubai at the end of May, and Art Singapore at the end of May.\n\n\nThe closing ceremony for the seventy-ninth edition of the International Museum of Contemporary Art (IMCA) Berlin, which was held on September 20–23, was held yesterday (September 19). The fourth exhibition, “What Is Modern?,” was organized by the New Museum and the Berlin-based nonprofit art-and-design collective Karlo & Fernando, which has a space in the city’s Kreuzberg district. For the event, Karlo", "The next Biennial should be staged in 2021, and the 2023 edition will include a new work by Hoa Nguyen, a work by the Taiwanese artist Weixing. \n\n\nThe Central Library of Art in Beijing has welcomed three new members to its staff: a professor from the School of Art and Design, and a curator from the Museum of Fine Arts. One of the students, a recent NYU grad, will lead the institution’s redesign, and the other two will focus on representing art within a contemporary context in the institution.“We’re extremely excited to welcome these three young curators to the Central Library of Art,” said director Samuele Ciepāsi. “They will all bring to the project a unique perspective and will both thrive in this new role, and I believe we can be very proud of their achievements.”Ciepāsi also noted that the library recently received a gift of fifty-six artworks\u0097a collection of works by artists that are currently on display in a museum. The works are from the collection of the Wuhan Museum of Art; the collection is housed in a large storage area in the museum’s exhibition hall.\n\n\nArts institutions", "The next Biennial should take place in 2022.\n\n\nThe Getty Center in Los Angeles announced today that it is negotiating with the neighborhood associations of the city and town of Los Angeles to develop a new master plan for the Getty Villa. The proposed six-acre, 236,000-square-foot museum, which has a 10,000-piece collection of modern and contemporary art, will be located in the city’s Historic Arts District, adjacent to the Getty Villa and the Museum of Art. The plan is part of a $1.2 billion overhaul of the Getty Villa and Museum of Art—the largest expansion project in its history.“The Getty Villa was founded in 1985 by philanthropists Frank and David Getty in response to the need for a museum dedicated to the Getty family’s vast collection of art,” said John Laursen, the center’s CEO and artistic director. “As the largest private museum in Los Angeles, we are committed to ensuring that the Getty Villa is a cultural and cultural destination with a strong collection and expansive exhibition-and-lobby spaces, and to building a museum that reflects the world of contemporary art.”The proposed museum—which will boast of a large, state-of-", "The next Biennial should be held in 2022.  The 1932 Nobel Peace Prize laureate and ten-time winner Frank Chiu told the New York Times that the museum would close after a year to complete repairs to its massive outdoor façade, which will be replaced with galleries, a school, and a deluxe hotel. The building will also undergo a major facelift, which will include the renovation of the roof and interior, and will showcase the work of more than 1,500 artists from more than sixty countries. The institution is currently undergoing renovations at a cost of $63 million.  Museum director Thomas Paine said: “The building was built to last a lifetime and that was our objective. It is our mission to make the building as open and accessible as possible so that visitors can feel part of the city’s rich history and continue to experience it for free.”The museum is currently accepting visitors for its inaugural season, which will run from January 13 to March 16, 2020. For a full list of dates and to register for free admission, visit the museum.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is suspending all programming and events through September 30", "The next Biennial should also address the social, political, and economic impact of the coronavirus. The curators said: “This year’s curatorial team ‘got it right’ in showing the full range of the coronavirus, from its viral onslaught to its practical solutions and the powerful art of the virus itself.” They added that the exhibition should also “address the social, political, and economic impact of the coronavirus,”” and that the exhibition must be “about the coronavirus,” not “about the art it represents.” \n\n\nThe National Galleries of Scotland announced today that it is planning to shutter its five remaining locations in June 2020 and reopen only three months later. The decision was made in light of a projected reduction in the monarchy between 2022 and 2024, and was made at a time when the institution is grappling with the health effects of the coronavirus.In a letter sent on Saturday, May 3, to the National Museum of Scotland, the seventy-seven-year-old institution said: “The state of Scotland’s finances and administrative situation necessitated a change of plans and a reopening of the National", "The next Biennial should be held in 2021.\n\n\nThe São Paulo Biennale, the international event that began in 2016 in the city of São Paulo, Brazil, has announced that it has reached a $49 million milestone. The 2019 edition, which was staged in the city of São Paulo, Brazil, had its world premiere at the São Paulo Art Museum (SBAM), which is located in São Paulo, Brazil. The event was also presented by São Paulo State University, and the Museum of Modern Art.The annual prize ceremony, which was originally scheduled for Friday, November 13, featured multiple works by the finalists: Winner: Alexandre Breton\u0097The Window 7\u0097A-ha-la-za, 2019, by Chris Ofili, Grazia, Brazil\u0097The Procession of the Four Feathers, 2019, by Alexandre Breton, Punta della Dogana, Brazil\u0097Dead Souls, 2019, by Alexander Calder, London and Tangerine, Brazil\u0097The Albatross, 2019, by A.J. De Anza, A.M. Alangar, Rio de Janeiro, Brazil\u0097and The Power of One, 2019, by", "The next Biennial should also take place in 2021, and will likely be held in the spring of 2022.\n\n\nThe Museum of the City of New York (Museum of Modern Art) has appointed John Palfrey as its next associate curator of modern and contemporary art. The museum previously worked with Palfrey on the museum’s New York–based exhibition “Sophie’s Choice: From Enoch Powell to Mark di Suvero” (2017), which was on view at the exhibition until March 25, and “John Palfrey: Poetics, Politics, and Paints” (2018), which premiered at the museum in February.Palfrey joins the institution after serving as its curator of drawings for twenty-four years. During this time, he curated the exhibition “In the Beginning” (2019), “What Is Sculpture?” (2019), “Dirk Hirsch: Sculpture,” and “Peter and Paul Mpagi Sepuya,” which were all presented at the museum’s San Francisco location. He also curated the first screening of Mies van der Rohe’s The Work Is Not Over: The", "The next Biennial should be held in 2022.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has hired Rachel Barnhart, a professor of art history at the University of California, Los Angeles, as its next director. The appointment is a coup for the museum, which has struggled mightily to secure a director since Richard Diebenkorn, a longtime museum trustee, stepped down in 2016.In the recent months, the museum has been forced to contend with the impact of the coronavirus, which has been linked to dozens of recent cases in China and has sickened thousands of people in China’s Hubei Province. In January 2019, MoMA hired Deborah Obalil as director of its China exhibition, but she departed the institution in March 2019 and has not returned to the region since.After her appointment, Barnhart will be given a year to shape the museum’s exhibitions and programs, and will return to the US in January 2021 to lead the Metropolitan Museum of Art in New York. Her term comes at a pivotal moment for the museum, which recently announced it will close its three-decade-old Asian Art Museum in Chinatown and reopen a new space in the former Monroe Gallery on East Seventy-Se", "The next Biennial should take place in the Spring of 2020. \n\nThe second Biennial, “Between the Sun and the Moon,” will be held in the Fall of 2020. The biennial, which is organized by the National Geographic Society, is the largest organization dedicated to the exploration of the sun and moon and was announced in 1995. “The sun’s magnetic field extends across vast expanses of space and yet its activity is only faintly observable,” said Jim Green, director and CEO of the Smithsonian Astrophysical Observatory and the Grand Canyon Museum. “This new solar system is the culmination of more than four centuries of scientific research. We hope that it will inspire new and distant thoughts, and that it will serve as a reminder of the importance of astronomy and the solar system to our world.”The 2020 biennial will explore the evolution of the solar system, using artist-made installations and recreations, and will focus on the sun’s atmosphere and the solar system’s rings and moons. The first Biennial was held in 1978, and the second was held in 2012. The first biennial, “Between the Sun and the Moon” received the 2019 Ast", "The next Biennial should be held in the coming months. “The past five years have been transformative, and I am incredibly proud of what we have accomplished,” Semmel said. The upcoming event will be hosted by the same architect who designed the museum’s former space, the Arrow Factory, where the second edition of the exhibition will be staged in 2021.The new exhibition will consist of ten works by selected artists and will explore topics such as science fiction, urbanism, anthropology, and biology. The first exhibition will focus on “The Forbidden City: The Architecture of Imagination” (2019), a design project by David H. Koch, the billionaire industrialist and CEO of Koch Industries, which is headquartered in Wichita, Kansas, and will be shown in its entirety in the new exhibition. The second exhibition will take up issues such as culture, identity, and politics. The third and most recent show, “The Body and the Environment” (2018), will be on display throughout the museum, as well as the museum’s new addition, “The Future of Art: Science, Life, and Politics” (2019), which will be on view in the summer of 2021.The Biennial will", "The next Biennial should be called the “Post-Digital Era” and will address the “current situation,” according to the commission. Although it has not yet announced a date for the show, the exhibition will take place in several venues across the city and will be hosted by Jorge Luis Borges’s son and Luiz Borges, the director of Madrid’s Museo del Trabajo. “This is a step in the right direction, in the right direction of what we as art historians call the post-digital era,” said Javier Tejeda, the commission’s director and president. \n\n\n\n\n\nArt Nouveau, the Paris-based nonprofit that supports French artists, and Helvetica, a nonprofit organization that funds French artists, have announced they will merge to form the International Confederation of Art. The organization will include twenty-nine artists in a series of exhibitions that will take place in Paris from March 15 to March 26. The first show, “Nothing but Difference,” will be staged at the Contemporary Art Museum Paris (CAM) in the spring of 2020.The organization’s new board of directors includes Patricia Martino, ‎Founder", "The next Biennial should bring together the most important works in the contemporary life of the artist. The 2019 edition will be held in Budapest. In the meantime, the artist will have the opportunity to participate in an exhibition organized by the Hungarian Ministry of Culture in the capital.\n\n\nThe construction of the eighth International of Art and Architecture (IAA) in Kraków, Poland, was postponed until mid-January due to the ongoing conflict in Ukraine. The two-day event, which was set to take place in May, was to be hosted at the Kraków National Museum and Museum of Contemporary Art until the end of June. The postponement was made after a Polish minister called for the “immediate restoration of the Męsto Wojtym–Monopol–Polemarchow axis” in an interview with the Art Newspaper.The IAA, which is listed on the Polish Ministry of Culture’s website as a “global platform for the exchange of culture and knowledge,” was supposed to have opened on January 26, 2020 but was forced to cancel it due to the ongoing conflict in Ukraine. The sixteenth edition of the show, which was to be staged at the Krakó", "The next Biennial should commence in the spring of 2021. The full list of artists who will participate in the event are as follows:Ellen Boehm, Rocco del Grande, JiŌ Tse, and Yuki Yamanashi, JapanCreative Alliance, 2018 Understanding the Darwinian Model:  ChimpsÂ Reexamined, Artists and Others in an Age of Darwinism, 2017 The Art of Drawing, Artists and Others in an Age of Darwinism, 2016 Free Spirit: A Documentary and Reflection on the Art of Life, 2016 The Artist in the House, 2015 The Artist in the House: A Retrospective with Kenneth Mukomada, 2016 The Art of Sorts: Artists and Others in an Age of Darwinism, 2016 The Art of Being: Artists and Others in an Age of Darwinism, 2017 The Art of Living: A Documentary and Reflection on the Art of Life, 2018 The Art of Living: A Documentary and Reflection on the Art of Life, 2013The Art of Living: A Documentary and Reflection on the", "The next Biennial should be held in 2020. However, the United Kingdom’s Royal Shakespeare Company (RSC) was not given a mandate for the 2019 edition, which was canceled owing to the Covid-19 pandemic. Instead, the organization will be given a year to come up with a new work for the event.Its new curator of nineteenth-century drama, Adam Daniels, will lead the 2019 edition at the London production space Royal Court, which will stage a new production of T.S. Eliot’s Last Exit before the Covid-19 pandemic ends in April.“I do feel very strongly that the future of our city rests with the performers and the audience and not at the feet of the corporation,” Daniels told the Art Newspaper. “I want the audience to have an emotional connection with the work of the artists and institutions that are housed in our city.”\n\n\nThe Museum of Fine Arts (MFA) in Houston will reopen this weekend following a $200 million expansion designed by the city to address safety risks posed by the coronavirus. The expansion, which added five new galleries and opened the Bauhaus into an auditorium, added three new spaces for the collection of early twentieth", "The next Biennial should be held in December. Perhaps the most recent exhibition was “The Long Shadow of Ivan Ilych: The Right Hand of Stalin” (2019), which was organized by the Institute of Contemporary Art, Moscow, and the Museum of Biotechnology, Moscow. \n\n\nThe museum that staged the largest retrospective of artist-designed furniture in history, the MUSEUM FIMBÄRK, Germany, on Tuesday announced that it is closing its doors permanently, effective March 11, 2020. The museum opened in Kröller Strasse, Berlin, in 1947 and moved to its current home in 2004, where it remains open to the public.The museum’s last exhibition, “The Permanent Present” (2015), featured the work of eighty artists, including Paul Gauguin, Pierre-Auguste Renoir, Emil René, and Pierre-Auguste Hérault. The museum also hosts regular programming of exhibitions and performances, including “Temple to the Resurrection” (2017), “La Sufism” (2016), and “Alfred France: The Life of an Artist” (2017).The institution hosted numerous exhibitions, including the ten-", "The next Biennial should take place in the fall of 2020. The institution has yet to announce a date for the 2020 edition, but it is expected to run from March 15 to March 23. “We’re also working hard to develop new ways to support the show’s artists by increasing the number of paid opportunities for our artists to collaborate with the collection as we look to the future,” said Nadim Tamir, the director of the Biennale. “This is an ambitious project that we’ve taken for granted since the very beginning. But as we increased our visibility and effort to reach artists and museums through exhibitions, artworks, books, and other materials, so did their visibility and effort.”The Biennale’s artists, including Kader Attia, Serdar Veneman, Mamadou Sanogo, and Akram Tamir, and the institution’s staff, including Damien Hirst, the executive director of Tate Britain, and the artists involved in the exhibition, a group of artists ranging from Mehdi Abou El Fadl, the Tunisian American artist, to German artist Markus Lüpertz, the American artist Hannah Wilke, the art historian John Levy", "The next Biennial should aim to apply the lessons of “The Crisis of Theory and the Present: Modern Art from 1970 to the Present” to the rest of the world, he said. The exhibition will feature the work of seventy artists, including Marié Delit, Alexander De Grasse, André Glatter, Andrea Hulle, and Pierre-Luc Lemay.\n\n\nThe late curator and artist Jerzy Janicki, who was known for his prolific and singularly ambitious exhibitions, which were often staged across continents, has died at age eighty-nine at his home in Warsaw, Poland.Born in Warsaw in 1940, the son of a Polish father and American mother, Janicki began taking art classes at the Institute of Art History in Warsaw. Later, he studied at the Academy of Fine Arts in Prague, where he met and befriended the Polish director Beata Raáty, who introduced him to painterly Futurist abstraction. Raáty invited Janicki to Paris to work with her on a series of large-scale installations for her upcoming exhibition, “Painting in Space” (2019), and created a work for the show that combined the Cube-based sculptures of", "The next Biennial should take place in 2020 and will be held in the Prague Triennale, the capital of Czech Republic, and will be hosted by the Institute of Contemporary Arts Prague (CIB). The biennial will include the work of twenty-four artists.Curator Vrja Martík believes that the exhibition “will offer an opportunity to connect the Czech Republic and the world through the artists who have made the Czech Republic their home.” With the arrival of the first exhibition of the new cycle, the Czech Republic is now in the process of becoming a major cultural hub in Europe.\n\n\nThe Bénédicte Savoy, the Palais de Tokyo in Paris, France, has banned four designers from its upcoming edition of the Bénédicte Savoy – the event will now be held at the Centre Pompidou in Paris from November 25 to November 28. “The new rules’ focus on ‘policing design’ in a fashion-free way,” the French art historian Emmanuel Audé, chair of the Chevalier des Arts et Lettres, told the Art Newspaper. “The Bénédicte Savoy will continue to welcome", "The next Biennial should take place in the spring of 2020, in conjunction with the annual Art Basel show in Hong Kong. \n“The whole idea behind the exhibition is a kind of magic potion,” Yoko Tsuda, the director of the museum, told the Art Newspaper. “It is a way to capture consciousness during a crisis, to make people think of themselves as a group in relation to the universe.”The exhibition opens in all five main locations across Hong Kong: on the Hong Kong Museum of Art, the Hong Kong Bund, the Hong Kong Art Museum, and the Hong Kong Opera House. This year’s event will not include a traditional art fair, as it has done for the last two years, but will instead focus on “an exploration of the concept of time.” “The exhibition is an expression of the spirit of Hong Kong,” said Park Hyeon-sung, director of the Hong Kong Museum of Art. “In his early years as a young curator, Baillie was well known for his creativity and for the kind of exhibitions he took part in that were innovative and original. This exhibition will help him to realize his dream of a museum in Hong", "The next Biennial should not be a disaster but a work in progress. “We must think of the work as a kind of platform for the production of work that does not exist but is nonetheless important and timely. The significance of the work cannot be underestimated. It is here that the jurists will start to get a better idea of the character of the exhibition or of how to approach it.”Last year, in partnership with the French Ministry of Culture, the upcoming edition of the Biennial focused on “post-colonialism”\u0097a term that refers to a variety of issues including the development and the legacy of African art. In an attempt to address issues raised by artists, including the question of whether the exhibition should focus on the African continent in order to avoid the “indecent exposure issue,” the exhibition moved the focus of the event to Paris.The exhibition was held at a time when France’s art historian, Michel de la Bruyère, was behind many of the country’s cultural initiatives. Throughout the seventeenth and eighteenth centuries, French artists such as Pierre-Auguste Renoir, Rembrandt van der Viert, and Jean-Jacques Rousseau contributed to the French canon", "The next Biennial should be in 2020, he added.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it is planning a major revamp of the institution, which has faced numerous setbacks since it was founded by immigrant Cuban immigrants in 1951. According to Artnews, the museum is calling the revamp a “state of the art” and “transformative.” Founded in 1998, the museum has faced numerous setbacks, including a legal battle in Florida over a $100 million piece that was supposed to be on display in “The Threshold: A New Light,” which was supposed to open in 2020, and a plan to move the institution “under construction” to a new building in the city.Today, MoCA director Max Hollein told the Los Angeles Times that the renovation will “start with an understanding that this is a new museum. It is not a museum that has been operating for forty years, nor has it ever been envisaged to operate for forty years.” He added that the institution will also start by removing fifteen hundred works from its collection and moving them into storage.According to Hollein, the museum is currently evaluating the possibility of moving more works into", "The next Biennial should also focus on its relationships with indigenous communities and the changing distribution of resources.  The exhibition will extend the current exhibition program and examine the relationship between art and activism in the current global crisis.  The second, titled “ART & ACTION,” will consist of a series of exhibitions and readings organized by artists, activists, academics, and collectors based in the United States. The exhibition will address contemporary arts and activism and will take place at New York’s Thomas D. Farley Museum of Art between October 21 and October 22, 2020.The 2019 edition, titled “Art of Healthcare,” was curated by Michael T. Savage and Kirsten Glanzman and was presented by the National Center for Contemporary Art in the arts. The exhibition selected forty artists and activists for its gallery section, which was curated by Michael Douglas-Hamilton and Emmanuel LeBlanc, respectively. Featured participants included Christian Brooks, Denilson Chase, Maria Cisar, Juan Carlos Lira, Jeffrey H. Smith, and Katherine O’Neill.The event will also feature a book launch at the gallery, with a presentation of the artist’", "The next Biennial should also focus on reimagining how artworks are created and shared, and how social media affects our relationship with each other and with the objects we hold in our imaginations. The festival will be edited by two artists: artist-activist and filmmaker ĜYael Nava” and artist and filmmaker Israeli-American Yael Ben Yemai. The public will be invited to participate in the biannual exhibition in July 2019.\n\n\nThe Museum of the African Diaspora (MoAD) in Washington, DC, has decided to cancel the remainder of its 2020 edition, which was set to feature work by forty artists from Africa, the Middle East, and South America, in protest of the canceled exhibition “The Black Lives Matter.” In solidarity with the artists who were denied the chance to present the show, the Museum held an online petition last week demanding that MoAD reconsider its decision to cancel the event. “The Black Lives Matter’s cancellation sends a troubling message: that while we stand united in condemning the recent events in Mississippi, we remain separate in celebrating the life and work of black and brown artists,” reads the petition.The petition also calls for MoAD to divest", "The next Biennial should be on August 28–September 1, 2020. The museum will be situated across the street from the Old Museum of Art, which recently underwent a major facelift and celebrated its centenary in 2018. It will host an exhibition of work by Whitney Houston, Andy Warhol, and Robert Irwin. ADVERTISEMENT Thanks for watching! Visit Website \n\nTwo recent controversies involving the Museum of Fine Arts (MFA) in Boston are causing tension between the institution and its staff. On Thursday, July 27, the museum fired a staff member who allegedly posted a racist comment on Facebook in a bid to push back against a decision by a local politician to remove a bust of Winston Churchill from the building. The comments made by the veteran politician, who will be reelected in November, were made during a heated debate over a proposed $10 million renovation of the museum. One of the objects in question was a bust of Winston Churchill that had recently been installed in the museum. The controversy erupted in February, when the city council voted 3–2 in favor of the project, which involved the removal of a bust of the British prime minister that had been installed in the museum in 1957.The MFA quickly terminated the employment of the employee who", "The next Biennial should take place at the Uffizi Gallery in Florence from March 18 to March 20, 2020. “All told, there have been over twenty-five years of these exhibitions, and they continue to please and persuade,” said Kohn. “The theme of the second edition of the show was ‘creative destruction‘ and that is something we hope to continue to explore in future years. We are still optimistic that we can get there\u0097we just need more ambition.”The exhibition will be followed by an exhibition at Kunsthalle Basel from May 9 to May 10, 2020 and a special exhibition at the Museo del Barrio in Lisbon from May 11 to May 14, 2020.\n\n\nThe HSBC Art Museum in London is planning to open a new branch in the southern Portuguese city of Madeira in 2020. The new museum, which will be located in an old textile mill, will be built in a former sugar factory on the outskirts of Lisbon, and will inaugurate with a new exhibition of work by the international group the Contemporary Artists’ Alliance. According to Artnet, the new museum, which will be inaugurated in 2022, will draw an initial 750,000 visitors.The new", "The next Biennial should take place in 2022. For the past eighteen years, the festival, which has been held in Barcelona since 2005, has been organized and curated by the Catalan architect Josep Lluis-Leone, who previously directed the Serpentine Pavilion in New York and the Museum das Bild, in Vienna.\n\n\nThe Institute of Contemporary Arts (ICA) in London has named Iris Breslin, its former director, as its next executive director. Breslin will assume her new role in September. Previously, she served as the executive director of the Barbican Art Gallery in London and the founder of the independent organization, the Riverborough Foundation, which supports artists and other cultural institutions in London.Breslin will begin her new role in September, when the institution will be inaugurated in partnership with the Barbican and the Tate. The Barbican is planning a major expansion, which will involve the addition of an additional level of galleries and a designated location for events and programming, as well as reintroducing the museum to the city. The Riverborough Foundation will also invest in improving the Barbican’s collection and education. However, the museum will not reopen until at least 2024.“I have been inspired by the Barbican�", "The next Biennial should take place at a location that will be selected for its aesthetic quality, location, and accessibility. The venue should be accessible by public transportation and should be within a walking distance of the museum. The twenty-first edition of the show will open in 2022 and will run until April 3, 2024.\n\n\nThe Peabody Essex Museum in Salem, Massachusetts, has received a donation of fifty-three works from artist and educator Mary Ellen Mark. The works, which were donated by the Essex Museum, the Telfair Museum of Art, and the Manchester Art Museum, respectively, will be presented at the Peabody Essex Museum’s upcoming biannual exhibition “The Science of Painting” on January 25.The works—which are valued at $6 million and $9 million, respectively—will be on display in the museum’s new exhibition dedicated to painting, “The Science of Painting” (formerly presented as a monograph in 1972), which will be on view through March 11. The exhibit will include twelve paintings by Mark and will span twenty-four centuries.“Over the last twenty-four centuries, Mary Ellen Mark has shown the world a great variety of paintings,” said", "The next Biennial should take place in Shanghai sometime in the second half of March.  [Update: February 16] As of February 16, Art Basel and the biennial organizers have agreed to work together to organize a future edition of the show. Art France announced on February 14 that it will rescind its invitation to the upcoming edition of the festival.  [Update: February 13] In an open letter published on March 4, the organizers of the show wrote: “We fully recognize that we have not fully cooperated with the recent legal developments in France and realize that the reasons for this exclusion are deeply personal. We hope that this issue will be resolved in the next edition of the show in Paris. We believe that the future of the show lies with the Parisian state.  We will continue to work with the local community in Paris and with our partners at the Central Art Museum in Beijing. We hope that in the future the show will be able to return to Paris and the city of Paris, and that the program will be able to go back to Beijing.”In a statement published on March 12, the Contemporary Art Museum Paris (CAMEP) said that it was “working on a number of issues", "The next Biennial should include the exhibition of works by women artists and should aim to take up feminist, anti-racist and anti-racist projects. “We have numerous women artists in the Biennial’s collection, and we are actively working with them to develop new exhibitions, documentaries, and other programming,” said Lévy Gorvy director Marina Caccia.The show will also include works by the biennial’s curators, Maria Celant, Kiki Smith, and the Black Nova Group, as well as new works by Italian artist Chiara De Luca, whose practice focuses on the theme of a physical body. The exhibition also notes the exhibition’s first female winner: a trio of women in the same year as the exhibition—Lorenzo Del Campo, Laura De Roo, and Luca Dell'Armotti—who are among the twenty-five artists in the show.De Luca’s exhibition “All the World Is Black,” which debuted at the Museum of Modern Art in New York in 2016, is currently on display in its new home in the Louvre.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Patricia A. Mote", "The next Biennial should be held in 2019.  The Art Newspaper, a French and German daily newspaper, said that the relaunch will take place at the University Museum in Paris and will be a combination of exhibitions, talks, lectures, and performances. The institution will also host a series of exhibitions with works by the contemporary artists who have been dormant for more than twenty years.The program will be organized around an international theme of “opposites”\u0097a term coined by Max Horkheimer in 1928 for a situation in which opposites, such as ideas, art, and music, are combined and presented as contrivances.  “We are not going to try to group together a single work of art or of art history into a single catalog,” Franck Riester, the director of the Biennial, told the Art Newspaper. “We will organize everything by the artist, by the institution, and by the collections. We have already for a long time embarked on this project for the artist, but it is now our turn to follow his example.”Riester also said that the theme “will be new and fresh, with the new and the old, by the artist, the", "The next Biennial should be inaugurated by a presentation of the work of the selected artists and designed by the artists. The theme of the exhibition should be “We Are Death,” a statement that is often made by artists in response to the concept of death, and should address themes of the physical and the metaphysical.The theme of the biennial is an attempt to create a historical document that addresses the legacy of the artist who died the most recently: Leo Zheng, a Chinese artist whose work is included in the exhibition “We Are Death,” which will open on December 17. The exhibition is a collaboration between the Shanghai Biennale and the Albright-Knox Art Museum and will include work by a roster of twenty-seven commemorative artists, including Brendan Albers, Ji-WON Kim, Wenjia Jia, Jie Chen, Fernando Celaya, and Jin-Soo Choi. The exhibition will also include photos of contemporary artists including Cornelia Acosta, Claudia Atkins, Germaine Boisjoly, Nigel Boisjoly, John David Shalom, Mary Ellen Mark, Bruce", "The next Biennial should bring together over sixty artists, including Sohrab Mohebbi, Hossein Oramian, Ashtiani Punjabi, and Seeras Karimi.\n\n\nThe Museum of Fine Arts (MFA) in New York has announced that it is working with the Global Fund to launch its biennial “The Bamboo Tour.” The festival, which will span over twenty cities across the United States in 2019, will be organized by the Antenna, a nonprofit organization that works with artists to explore new creative platforms, and will take the form of a “triennial” that will run for twelve months. The 2020 edition, which will take place in April, will mark the fifteenth anniversary of the installation.“At a time when artists are grappling with the consequences of police violence, and citizens are imprisoned at an alarming rate, the Bamboo Tour is an important way to think about art and the world through the lens of art,” said MFA director Jodi Throckmorton. “This exhibition will explore what it means to be an artist in a time of crisis. We are hopeful that this exhibition will spark a new engagement with the art world and the city of New York", "The next Biennial should be held as soon as possible. “After a few months, the exhibition will basically be suspended and will start again in the spring of 2020,” said Artnet. The 2020 event will also include a new grouping of artist-activists, known as the Biennials, that will aim to showcase contemporary art that is grounded in social justice and environmental concerns. The title of the exhibition is a reference to the famous statement originally made by President Jacob Zuma as part of a grand coalition of South Africans who opposed the proposed Trans-Zimbabwe highway in 2009, sparking protests that were ultimately won by the government. \n\n\nThe city of New York is planning to build a new $650 million biennial of contemporary art at the Alexander Graham Bell Museum in downtown Manhattan. The announcement comes a little over a year after the institution received a $3.5 billion expansion plan from the city, which will use funds from the Bell Museum and the Metropolitan Museum of Art to create a new fifty-three-story museum.Construction is expected to start in the fall of 2020 and will take eight years to complete. The renovation of the Bell Museum will also include the construction of a new Bellsonian, the", "The next Biennial should be in 2022.  The works slated to be presented at the event include projects by artists such as Damien Hirst, Bruno Latour, and Judith and Simon; as well as works by unknown and recently-deceased artists such as Agnes Martin and Jules Grabe.The biennial is supported by a $12,000 gift from the Grange family; $9,000 from the Hockley family; and $2,000 from the Bayer family.The biennial will be held at the Museum of London, which is hosting a major redesign and expansion effort as part of an ambitious plan to become more energy-efficient, in March 2022. “The Grange and the Hockley Foundation have given us a gift of more than $1 million to design and build the new Biennial Pavilion, which will soon be inaugurated by the exhibition of Martian Aliens: A New Journey,” said Charles King, chairman of the Grange Foundation. “In the coming months we will build on this gift by working with the artist community in London on a series of projects that will celebrate the history of our planet.”The Martin Museum of Art, which will also be redeveloped,", "The next Biennial should be held at least once per year, with different themes, and should explore the history of the human body from the perspective of the artist in a self-perpetuating system. “We’re at the beginning, we’re at the end, we’re at the basics,” says artist-founder and chairman of the London-based Biennale Foundation, Jonathan Berelson. “We’re at this moment in history, when we are faced with a crisis of scale and scale means mass destruction. We need a new vision of life from the artist, to reflect the richness and diversity of life on earth. This is the moment to create a new kind of world, one that is not only possible but extraordinary.”In the coming weeks, the Foundation will launch a drive to raise $1 billion for the institution. It will also launch an online version of the Biennale, which will be hosted by the Museum of London; partner with the Tate; and host an exhibition dedicated to the production of indigenous art. The exhibition will open on June 3, 2020 at the Museum of Contemporary Art, London.\n\n\nDr. Sharon Rondon, a pioneering American artist whose", "The next Biennial should be held in 2019. For a list of all important dates, see Frontier.  Since their opening in the city in 1975, the biennial has featured work by more than 4,000 artists and has been awarded the National Medal of Arts, the Robert Rauschenberg Award for Arts, and the Jack Monroe Award for Arts.\n\n\n\n\n\nArt historian, curator, and curator Richard Z. Young has been appointed director of the Museum of Fine Arts (MoFA) in New York. In his new position, Young will lead the museum until 2022 and will serve as a liaison for international artists. He succeeds Carol Gold and Dennita Carbonell, who have helmed the institution for more than forty years, and will begin his tenure in January 2021.“Richard has been an enormously important partner in the museum’s development, from helping to find the right artists for the exhibition program to driving the museum’s worldwide vision,” said David Siegel, chair of MoFA’s board of trustees. “His remarkable curatorial skills, his ability to work across disciplines and networks, and his dedication to artist practice and mission are precisely what we expect from the new director of Mo", "The next Biennial should – with the possibility of the future of the museum – take place in 2024. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to open a new David C. Driskell–designed museum in the city sometime this year. The design of the new institution, which will be located on the third floor of the Ateneo Art Museum, is inspired by works by the late American architect Edward Cesarco, one of the architects behind the iconic Ateneo Art Museum in Tokyo.“We are thrilled to create the David C. Driskell Museum in Ateneo in the city of Ateneo,” said Joel Hobbs, the Ateneo Art Museum’s director. “The project will embody the Ateneo Art Museum’s commitment to celebrating the legacy of David C. Driskell, and will empower our staff and the public to explore the central role of the artist in shaping contemporary urbanism.”The David C. Driskell Museum will be inaugurated by a retrospective of his work, “David C. Driskell: Fractals” (2017–18), which will explore", "The next Biennial should feature works by forty-three artists who have worked on the show. It will also introduce a new prize that will be awarded in partnership with the art world. The biennial will be held at the same venue as the show, at the same time, in the same city, in the same year, and in the same location. The first exhibition will be presented by Paul Mpagi Sepuya, at the Museum of Contemporary Art (MoCA). The second by Andrea Brugioni, at the Museo de Arte Contemporáneo (MAS). The third by Julien Ghebaly, at the Royal Academy of Fine Arts (RAFA) in Paris, and the fourth by Domenico Cipolletta, at the Museo de Arte della Torre in Milan.\n\n\nThe Swiss Federal Office for Culture and Crafts (Bicocca) has released a statement regarding the 2016 exhibition “La Biennial de l'Arles” at the Museum d’Arles, France. The show, which ran from March 7 to March 10, featured forty-six artworks from sixteen countries. The museum opened the exhibition in a former sugar factory in", "The next Biennial should take place in the spring of 2022. The 2019 exhibition was organized by the Tanger Gallery of New York and the University of Bristol and was organized as part of the “Ateliers Triennales,” an annual exhibition that focuses on emerging artists that began in the French city of Cannes in 2006 and runs through the end of the year. The 2019 exhibition included works by Alain Guiraud, Gia Carron, and Marianne Morais. The museum will stage the next Biennial in Paris in 2021. The 2019 exhibition, “Ateliers Triennales: New York, 2019,” will be relocated to the current exhibition space, the Marciano Art Museum, until the end of 2020. The artists represented in the 2019 exhibition for the museum include Alexander Graham Bell, Anna-Marie Curi, Conrad Poulin, and Olivier Assin. The 2020 exhibition will have a new selection of work by Pierluigi Giacomo, Nina Johnson, and Sasha Golub. The 2019-2020 season will run from June 2 to June 9, 2020.\n\n\n", "The next Biennial should take place in 2020. The exhibition will be hosted by the same architect, Nari Ward, who developed the exhibition space that was used for the first Biennial in London, Fashion Week in 2020, which was held in a slightly different venue. The architect is also collaborating with Becca Brown on a new exhibition for the museum. “The new venue will reflect the latest and most forward thinking of the Biennial, providing an effective platform for furthering the exhibition and the local economy,” ­Museum director Richard Armstrong said. “With the introduction of the new exhibition, we are able to launch a new chapter in the history of the Biennial. It is important to note that this is only the second exhibition to be staged in the new space, and it is the first to be entirely within the museum. This will be a truly unique venue for the museum as we embark on a new chapter of the exhibition programme. We look forward to welcoming the world to the new venue.” The Biennial was founded by Markus Lüpertz, a professor of architecture at the University of Stuttgart, in the early 1980s and has undergone several conceptual and conceptual phases\u0097focusing on architecture, design"]