["The next Biennial should focus on the United States and the trajectory of American art, focusing on the period from 1820 through 1940, when the first American artist to be exhibited was Abraham Lincoln. The exhibition will consider the legacy of Benjamin Franklin, the first American to be exhibited in New York; Virgil Abloh, the first American to be exhibited in New York; and James A. Porter, the first American artist to be exhibited in New York. The biennial will also consider the impact of artworks in the city and its impact on the wider region.Participating artists will include Helen Cammock, Matthew Collins, Denny Cammock, Luke McNamara, John McNamara, Paul McAuley, and Susan McNamara.Commenting on the biennial, Lindsay Hanley, curator of prints at the Biennial, said: “We are thrilled to be able to pursue this project of bringing together the world’s most extraordinary exhibitions as part of the city’s vibrant and multifaceted biennial program. The exhibition is, in many ways, an extension of the city’s cultural life—its spirit and spirit of openness, its love and affection, its creativity and creativity. We hope that this exhibition will", "The next Biennial should focus on how to use social media to share and connect with local communities and will be led by Simon Lee, the director of the Museum of Contemporary Art, Los Angeles.Lee will curate an exhibition of work by local and international artists. The event will take place in Studio 54, a former darkroom at the Compton Museum of Art, where the annual Biennial will be held. The biennial will also introduce a new way of supporting non-profit arts organizations in Southern California—the artist-in-residence program, which will partner with artist residencies in Los Angeles and surrounding areas, and will expand upon the theme of the 2012 edition, “Living Worlds.” The biennial’s inaugural edition, “Los Angeles,” will run September 5–September 6.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that Leila Asante has been awarded the 2019 RIBA (Royal Institute of British Architects) Young Artist Laureate. She will receive a cash award of $80,000.“Leila is an exceptional young artist whose work explores the role of design in contemporary life,” said ICA director Ravi Sundaram and vice president Pippa Fulton.", "The next Biennial should be held in 2020. The announcement was made at the end of an exhibition of “post-modernist” works by Øystein Rønnby (2019) and Øylya Mestnikov (2018).\n\n\nThe Los Angeles County Museum of Art (LACMA) has introduced a new, free digital platform that will allow visitors to see live artist-made works from the collection in real time. The platform, called Archive.org, was founded by LACMA president Laura Alleman and digital director Julia Serota with the goal of increasing access to the museum’s art holdings through digital technology. The platform will allow LACMA visitors to view works created by twenty-eight LA-based artists. The curated archive will be distributed by LACMA’s digital arm, LACMA Digital, and will run for five weeks.In a statement on the launch, Alleman said: “With the rise of social media and the proliferation of digital platforms, there is an urgent need for cultural institutions to be more accessible and engaging to our audiences. The new Archive.org platform will be an ideal platform to build upon the work of these artists and", "The next Biennial should be held in 2021–22, and the twenty-sixth will be held in 2022. According to the British artist, the exhibition “should embrace the universality of the biennial.” Indeed, in an Artforum editor’s note last December, Harper V. Mather Jr., spoke of the twenty-sixth as a “choice between two futures.” The biennial was established in 1978 by a group that included Robert Irwin, the American painter and sculptor; Frank Gehry, the German industrial designer; and Gertrude Stein.\n\n\nAt the New Museum in New York City, a few hundred supporters gathered on Tuesday, April 7, to protest the institution’s decision to suspend an exhibition scheduled for May 16 after twenty-six art workers—including Vanessa Redgrave, Yinka Shonibare, and Leonard Cohen—were arrested for refusing to leave the building in May 2016 over an artistic dispute that was never formally filed.“We are here today to demand that the New Museum reconsider its decision to suspend an upcoming exhibition with twenty-six artists, including Vanessa Redgrave, Yinka Shonibare, and Leonard Cohen, and let the twenty", "The next Biennial should be held at a location in the city’s Center City, which was built in 1912 to house the Washington Gallery of Modern, in 2021. The venue will be inaugurated by a two-story bronze sculpture by artist Andrew Kreps, “Rejoice,” which will be accompanied by a performance by Kreps’s current collaborators, the Los Angeles Philharmonic, and the New York Philharmonic, in 2019. Afterward, the city will stage another exhibition of works by Kreps, this time with works by artists such as Paul Gauguin, Wangechi Mutu, and Guggenheim’s work for the renovation of the Museum of Modern Art (MoMA) in 2020. “The future of our city and state is at stake,” said Mayor Bill de Blasio. “I look forward to working with the artists of our community to create new opportunities for a stronger, healthier, and fairer New York.”\n\n\nThe Italian architect Otto Urbach, known for his strongly feminist and anti-racist views, has been appointed as the next president of the Italian Republic. Urbach is the first person to hold the office since Prime Minister Sil", "The next Biennial should be held in the spring of 2020.\n\n\nThe Royal Academy of Arts (RA) in London has appointed Caroline Asplund, the first female curator of international art, as its next director. She will assume her new post in December.“Caroline has been a champion of international art since she began at the academy in 2015, when she became the first woman to head up the prestigious Tate,” said Simon L. Brown, the academy’s director. “Her appointment is a great day for Britain as it continues to emerge as a world leader in the field. Caroline’s achievements and ability to draw from and interpret the studies of the academy are second to none and warrant immediate recognition.”Asplund will take up her new role on January 6, 2020.\n\n\nThe Royal Academy of Arts (RA) in London has appointed Caroline Asplund as its next director. She comes to the institution from the Royal Academy of Arts (RA) in St. Stephen, where she has served as a research scholar and curator since 2014. During her tenure, she curated the exhibition “Shine,” which received a prize from the Royal Society of Arts in 2017, and also published the", "The next Biennial should open in 2020. The Biennial is currently accepting proposals for its future edition.\n\n\nArtnet reports that the Philippine Museum of Modern Art (PMA) in Manila—that was awarded a $65,000 grant from the Salk Institute in the United States in 2016—is now asking for $50 million in support of its expansion. The request follows a wave of Art Fund awards that have helped the museum assert its independence from the institution it was founded to oppose, the Salk Institute,’s controversial plans to build a new museum in the former Bataan barracks and is a direct response to the ongoing protests against the construction of the new museum.“The museum has always been true to its mission of protecting the legacy of the Visayas,” said David Cunha, the CEO of the Salk Institute. “In the current political climate, it has never been more important than it is right now. We are asking for $50 m to support our mission to further our mission of furthering the work of the Visayas communities, and to be part of the ongoing creative and intellectual life of the island of Mindanao.”PMA director Risa Ipana said", "The next Biennial should be held at the Salt Lake Art Museum in 2020 and could open as early as 2021. The city of Provo is also working on the design of a new monument to the Salt Lake City Water Works. The Salt Lake Art Museum currently has a monument dedicated to the city’s water works, which were completed in 1974 and are now undergoing a major renovation. “The City of Salt Lake City’s efforts to create a lasting legacy of the Water Works are commendable, and I hope that this year’s event will vindicate the city’s efforts,” said Councilman Erik Keith, chair of the council’s Cultural Affairs Committee. Keith added that he hopes the museum will reopen in 2023.\n\n\nThe Art Newspaper, the German publication that focuses on contemporary art, has announced that it will suspend publication in the country until the reopening of the former Nazi concentration camp Auschwitz in March. The decision was made following months of protests at the museum, which has been closed since March 13 due to the coronavirus pandemic, in an attempt to pressure the government to reopen the former Auschwitz complex.The petition, signed by more than 2,500 people, claimed that the", "The next Biennial should showcase the work of the notable artists working in the field whose work has yet to be exhibited or published. The 2019 exhibition will draw from the catalogs of Dietrich Heim, Christo, Friedrich Hoffmann, and Eugen Grütters, among others. The exhibition will be held at the Freie Kunsthalle Stuttgart from January 21 to March 19, 2020. André Breton and the Design Research Centre The next exhibition will be dedicated to the work of the theoretical and experimental physicist André Breton. The artist will be brought together with the theoretical physicist Peter Dösler, the experimental physicist Peter Zemmour, and the Berlin-based sculptor Carsten Hirschhorn, and will be presented with a new set of experimental observations on how geometry, the structure of solid objects, and objects of the mind can be more accurately modeled with certain mathematical frameworks and calculations. “With the creation of the the Design Research Centre (DR) we explored the possibility of bringing together the most important contemporary Western artists in the field,” said Biennale director Christian Parzinger. “The collaboration between us and", "The next Biennial should begin on August 21 and conclude on September 8.”The exhibition will be hosted by the California Institute of Technology (Caltech) in Pasadena, California. The Los Angeles County Museum of Art (LACMA) will present the inaugural event. The first edition of the event, which was held in 2017, featured artists who represent forty-six countries and fifty-two cities\u0097Cristina Alÿs, Julia Bloch, João Carlos Bregi, Kiki Smith, Cécile Steneglu, and Peta Constanze. The program followed the theme “The Future Is Present: Paintings of Modern Life,” which was created in collaboration with the Los Angeles County Museum of Art. In the spring of 2018, the institution commissioned artist Daniel H. Ghesko to create a new version of the work. The twenty-sixth edition of the Biennial will be held at Los Angeles’s Museum of Contemporary Art (LA MoCA).The full list of participating artists is as follows:Antoine-Louis Delaunay (France)Art Laplace (France)Art In Situ (France)Arts of Life (France)Arts of Life (", "The next Biennial should include the creation of a new category for “postcolonial art. In the same way that the term ‘postcolonial’ has been used to denote a society or a region outside of Africa, it may be used to signify the cultural and intellectual experience of countries other than Africa, Europe, and Asia.”The programme is being organized by the London-based think tank the Art Fund, which is funded by the Tate, the London Foundation for Contemporary Art (LFCA), and the Gates Foundation, and is led by Mary Anagnos. The first round of shows will open on April 21. The second round of shows will take place in December.The organization is also working with the Georgian sculptor and painter Adrien Pape on a new exhibition, “The Painter in the House,” which will run in the summer of 2020. The show will draw from the artist’s own writings and will be comprised of six portfolios designed by Pape, of which the final two will be dedicated to Tate’s founding director Maria Balshaw and chief executive officer Hamish Hamilton.Commenting on the works, Pape said: “The work here is a work of remembrance, of a memory", "The next Biennial should be held in the spring of 2020.\n\n\nThe theater magnate Jody Rogac has asked New York’s Metropolitan Opera Company to acquire his former company Todea Berlind & Co. from its ownership by his siblings, and has named John and Iwan Wirth as the new trustees of the nonprofit arts organization.“The Wirths are one of the most successful and innovative organizations in New York and have created a successful model for how a nonprofit can operate, grow, and move forward,” said Brian Katz, the president and CEO of the Metropolitan Opera Company. The organization has acquired Todea Berlind, which has locations in New York, London, and Hong Kong, since 1988, and has moved frequently between New York and Paris. 'The Wirths have created an exceptional model for how a nonprofit can operate and remain independent from the larger cultural ecosystem,” Katz said.The Wirths will begin the work of forming a new board of directors and will hold their first board meeting on November 30.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it is reopening to the public after an eight-month hiatus.", "The next Biennial should be held sometime between June and August and will involve the exploration of the life and work of one of the greatest living artists, Jean-Michel Basquiat. The artist and philosopher will be interviewed by two guests each week. The project will also involve a collaborative exhibition program, curated collaborations, and a discussion and special event. The theme of this year’s event is “Relic.”“We are honored to be reopening the Biennial with a special exhibition of works by Jean-Michel Basquiat,” said art historian and curator Richard Wright. “The project of the exhibition will be a celebration of his legacy\u0097we will be able to see his work again one hundred years from now.”\n\n\nMerry Norris, a pioneering American artist whose drawings and paintings often reflect visions of the future, has died at age ninety-one.Born in New York in 1912, Norris began drawing at the age of fourteen, producing her first work in the studio after she left high school to become a fashion model in the same year. In his will, the artist renounced her American Music class at Columbia College in New York, and instead enrolled in the Art Shop at age eighteen", "The next Biennial should be held in 2020.\n\n\nUSC Art Museum\n\nThe Los Angeles County Museum of Art (LACMA) is seeking the public's help in identifying three works by contemporary artist Shirley Walker: one (1928), one (1929), and one (1932). The museum is asking for the public to please contact the institution with any information that may assist in identifying the pieces. A complete description of the works is included in a document on file with the US Copyright Office.The first work, which was made in Los Angeles in 1928, consists of a series of 24 photographs depicting various aspects of Walker’s life. “The first piece, ‘The Watering Hole,’ is a series of photographs depicting a water spout in a garden located in the hills of the city of Los Angeles. This work is part of a series known as the Walker Series,” said museum director Richard Armstrong. “There are many others that have been lost to history, and it is our hope that one day these three pieces will be identified and returned to us.” The other two works, one at LACMA in 1929 and the other at the Ventura County Museum of Art,", "The next Biennial should be held in 2020.”\n\n\nThe Museum of Art in Miami Beach, Florida, is planning to shutter down its entire biennial in 2021 to restructure its future programming. The museum will transition to a new format called the Miami State [Museum] Biennial, which will focus on contemporary art and the people who work with it. The event will resume in 2022. “We are not in a position to comment on the future of the Miami Museum of Art,” museum director Daniel H. Weiss told the Art Newspaper. “But we are committed to building on the museum’s exceptional and internationally recognized collection in a manner that preserves the institution’s long-standing legacy of engaging the public through exhibitions of new work and engaging the institution’s collection.”The decision to shutter the exhibition-focused Miami Museum of Art was made as part of a $2 billion overhaul, announced last June, that made major changes to the museum’s collection, including eliminating more than 170 works by the infamous American avant-garde and the institution’s collection of the late Harlan Erman. The museum also set out to shift its programming to a more diverse array of artists", "The next Biennial should be held in 2022. \nSustainable Education and Training (SEAT) will present another edition of the assessment in 2021. The platform, which promotes education and development in sustainable practices, has also been working with the Dusan Museum of Art to commission an exhibition devoted to its collections and exhibitions. The first show, “In Defense of Nature” will open at the Dusan Museum in 2022 and will be on view until April 23, 2022.The next exhibition will showcase the works of the same collection as in the first exhibition, “In Defense of Nature” and will be held in the Dusan Museum of Art from Spring 2020 to Spring 2021. “I want to thank our exhibitors and our sisters who have participated in the next edition of SEAT. They are the very same artists that have shown in previous iterations of the program and who will continue to show here in 2021,” said Sebastian Molen, director of SEAT. “These artists prove that, despite their significant differences, they share a passion and commitment for art and creation, and are committed to making this a premier contemporary art biennial.”The first show of the newly created Bi", "The next Biennial should be called for the first time, with a new president and a new director, at the end of next year. It should be the first time that a public museum has hosted a major retrospective of a work in more than thirty years and would mark the anniversary of the exhibition. “I’m hopeful that our work in this area will help to move our museums forward, and to move our world further and further apart,” Kelly said. “This is the moment and the future. I’m looking forward to working with our talented team to return to this space in 2020 and to building on the biennial’s remarkable legacy for the next twenty years.”\n\n\nThe National Gallery of Canada announced today that it has received $1.267 billion in its $8.3 billion expansion project, which aims to provide more opportunities for Canadian artists. The funding includes a $6 billion infusion for the museum’s core programs, which are primarily focused on contemporary art, and a $3.4 billion boost for arts and culture in the capital.“Enabling artists and creative communities in Canada, and around the world, to discover, appreciate, and create is an integral part of the National", "The next Biennial should open in 2021, with the first exhibition in 2022. The 2020 edition featured work by twenty-nine artists, including Vivian James-Stafford, Sio Naidoo, and Catherine The Great, and took place in the University of Oxford from February 14 to February 16.\n\n\nThe British artist Terry Southern has been awarded the Florence Architecture Biennial 2020. The biennial will focus on the history and philosophy of architecture in the Italian city and will include forty-eight works by eighty-five artists. The selection was made by curator Peter van Os, curator of works at the Museum of Modern Art and a professor of architecture at the University of Pennsylvania, as well as the French artist and poet Arundhati Bhattacharya.Bhattacharya will collaborate with Southern on a new project titled The Trauma of Architecture, which will focus on the trauma of architecture, architecture and architecture, architecture and pain. Van Os will create an extensive multimedia installation that will compare the trauma of the trauma of the war, the rape, and the bombing and will include recreations of scenes from the graphic novel Žažaktika, 2016.The grand prize for the 2018 edition of the exhibition will be given to the", "The next Biennial should take place at the Museum of Modern Art in New York in 2021. When it opens, the exhibition will feature more than 300 works by local and international artists. The 2019 event, “The Body,” also featured work by artists such as William Wegman, Thomas Krens, and Simon Lutwidge Dodgson.  The first show of the new exhibition will open in the museum on September 5.\n\n\nThe Museum of Flight, the Los Angeles County Museum of Art (LACMA), and the Museum of Contemporary Art Los Angeles (LA MoCA) have announced that they will jointly open their new museums in 2020. They will be two-thirds the size of the original sculpture projects, and will offer more interactive, experiential experiences that reflect the spirit and spirit of Los Angeles.“The partnership’s inaugural season will explore the spatial and temporal relationship between Los Angeles and the Pacific Northwest,” said Steven DeFries, LACMA’s president and CEO. “The inaugural performances will offer a glimpse into LACMA’s forthcoming fourth-floor exhibition ‘Portraits,’ which will welcome the public in 2020. The show will", "The next Biennial should take place in 2020, with a new exhibition to be announced.The museum will also receive $106.5 million to fund construction of new facilities, including a new academic wing that will bring together students, academics, artists, and researchers; a new collection of 1,500 works, with a gift of 150 works; new educational programming, including an exhibition on the history of the art and a new radio program; and an expansion of the museum’s circulation and circulation equipment.The museum has also received $50 million from the Coronavirus Aid, Relief, and Security (Carp) Act of 2016, which is also known as the Disaster Relief and Emergency Assistance (D.R.A.A.) Act. The funds will go toward managing the coronavirus and providing support to those impacted by the pandemic. The funds also go toward the construction of the new pavilion in the museum, which is currently unfinished and scheduled to open in 2020. The new pavilion will include a new creative production program that will run concurrently with the upcoming exhibition “Polar Express: Contemporary Art in the Age of Climate Change” and will present work by artists such as Benjamin Brink, Yinka Shonibare, and", "The next Biennial should take place in the spring, and could take place at any time. The museum currently has a twenty-four-hour time slot available for exhibition-goers. The 2020 edition will be held at the Museum of Contemporary Art Chicago, and the 2021 edition will be staged at the Museum of Contemporary Art Los Angeles. The inaugural exhibition, “In Memoriam: The Art of Manic Depression” will be curated by Kate Fowle, and the second exhibition, “The Hostages,” will present by Zoya Akunyili.The commissioning team is led by director Andrea Faulds. Faulds is a former curatorial student and an art historian who worked under the tutelage of Carlos Castaneda, Margaret Drummond, and Carlos Teo. “Our artists have lived and breathed and breathed again and again in their work, and we are indebted to them for being able to depict the same thoughts and feelings at that time of year, in that city, at that moment,” Faulds said. “The Biennial has been a transformative experience for the creative community and the city of Chicago. It has been a path for many artists to come", "The next Biennial should be held in 2021.\n\n\nAn exhibition dedicated to the Cuban artist, who often went by the name of Cortés, has been put on hold in Paris due to a lack of interest from government authorities. The exhibition, titled “Ateliers d'Art Contemporain,” was due to open at the Museum of Modern Art in Paris on March 22, but was postponed until April 3, at the earliest. The government agency responsible for organizing the fairs, the cultural center Lévy Gorvy, was also holding a meeting on May 8 to discuss the cancellation of the Barcelona biennial, which is scheduled for May 25–May 29.According to the Art Newspaper, a government statement issued on Wednesday said that the government’s decision to suspend the project was made in order to avoid “abruptly transforming the exhibition into an experiment,” a reference to the opening of the inaugural edition of the show in Havana in March. The statement also noted that the move “does not affect the exhibition’s financials, its programming, the exhibition or the exhibition’s collection.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $10", "The next Biennial should take place in 2021, according to a statement by the organizers. The next iteration of the exhibition will be held at the Kunsthalle Bern in 2021, and the show will then return to the Four Seasons Hotel in the City of Bern. [Update: March 23, 11:45 AM] The 2019 exhibition was canceled due to Covid-19, and the next edition, curated by the same group, will take place at the Pérez Art Museum in the city of Mexico City in 2022. \n\n\nThe University of Chicago announced today that it is planning to roll out a new paid internship program that will offer paid work by interns in a number of disciplines throughout the university. The program will take place over three years and will be offered both online and in-person.The initiative will be part of a comprehensive academic roadmap that aims to create more student engagement with the university and its campus. The goal of the program is to foster an environment of mutual respect and understanding between students and the university as well as with the campus and surrounding community.“We are designing the new paid internship program to provide our students with an immersive experience that will help them become familiar with our campus, the surrounding area, and the campus’", "The next Biennial should be held at a location that is convenient for all of us and will announce its 2019 schedule and additional programming in the coming weeks. The Biennial is funded through a gift made by Robert and Carol Lever, Sr. to the University of California. Commenting on the donation, Robert and Carol Lever said: The Lever family has been instrumental in supporting the Biennial. Their generous support of the Biennial has been unconditional and unwavering, and they have been cooperative throughout the development of the Biennial. Through their generous gift of ten thousand photographs by Robert Mapplethorpe, the family made the Biennial possible. In recognition of their generous support, the biennial was given a conservation donation of twenty-six photographs by Robert Mapplethorpe and his family. The Lever Family will contribute $45 million to the 2019 Biennial, which was organized by the Los Angeles County Museum of Art in partnership with the Los Angeles County Museum of Art, the Los Angeles County Museum of Art Foundation, the California Pacific Art Museum, the California State University, Long Beach, the California Institute of the Arts, the California Pacific Film Archive, the California School of the Arts, the California Museum of Fine Arts,", "The next Biennial should be held in late June or early July, in order to give the community and the public another month to spend with the exhibition.The venue is also committed to continuing to host exhibitions of work by artists who are not represented in the forthcoming exhibition. The upcoming triennial will feature the work of thirty-six artists, including Yazdan Bailati, Nari Ward, Yannick Tremblay, Michael Room, and Yoko Ono, as well as the work of the late British artist Humberto Cattelan.The decision to withdraw from the upcoming show comes amidst an unprecedented global health crisis. According to the World Health Organization, one in seven people worldwide is infected with the virus. The virus is spread mainly from person to person and can occur anywhere from an infected person to a sick person. The virus can also be spread from person to person through close contact, such as through coughing or sneezing.The exhibition was originally slated to open in Berlin in February, but was pushed back due to the Covid-19 pandemic. The show will now be held in the city from March 22 to March 26. After months of negotiations, the Berlin Art Week commission was awarded the contract, which will", "The next Biennial should explore how a new art historical institution, the Museum of Contemporary Art, will help contemporary art historians and researchers understand and shape the legacy of the B-52. “The Biennial has always been about more than the art itself, and its success is a testimony to the strength of that commitment,” said Mark Schaefer, director of the Museum of Contemporary Art and the Contemporary Art Museum St. Louis. Koenig, who has served as director of the Biennial since 2011, added: “The B-52 is an iconic institution that has stood the test of time for more than forty years and continues to serve as a powerful model for future thinking about the role of museum curation in a contemporary art context. I’m honored to serve as the next director of the B-52 and excited to see where the museum will take the next twenty years. I’m confident that we will deliver a great biennial.”\n\n\nThe B-52 will not be coming back. According to Artnet, the Museum of Contemporary Art (MoCA) in New York has announced that it is “planning to dismantle its entire collection and move forward with a new major renovation, which will incorporate", "The next Biennial should be staged in the spring of 2021, at the earliest. The event will be organized as part of the city’s regular biennial schedule, with the new works being presented by the two artists. This will be the third edition of the festival, which is supported by the Karel Institute of Contemporary Art and the Centre Pompidou. Its previous iterations, 2018 and 2019, were both staged at the Kiel Academy in Germany.The exhibition will include works originally created by both and will include interviews with both artists. The works in the exhibition will be presented by the Kiel Academy, the Centre Pompidou, the Museum of Fine Arts Kiel, and the Kiel-Montparnasse, while the works in the exhibition will be presented by the Kiel-Französische Kunsthalle.\n\n\nThe National Galleries of Scotland have revealed that Sadie Coles will direct the opening of its first exhibition devoted entirely to female artists in 2021. Titled Artist Representations, the exhibition will attempt to present the work of thirty-one female artists in its history. The exhibition will consist of a series of drawings, paintings, prints, sculptures, installations, photography, video, and", "The next Biennial should be held in 2020. “Bosch is an international leader in the field of sustainable design,” said Munna. The Biennial, which was established in 1948, will be held at the Vittorio Emanuele Arti in Rome. The theme of the forthcoming exhibition is “Balance,” which will present a new and contemporary survey of the influence of the artist-provocateur Michael Ondaatje on the art world’s landscape. The exhibition will be curated by Andrea Girotti, director of the Museo del Real Artes and a former curator of modern and contemporary art at the Museo storico di Rome.Previously, Bosch has curated exhibitions such as “Michael Ondaatje: Balance” (2018) in Rome and “Tacita Dean: It’s Not Easy Being Blue” (2007) at the Venice Biennale. The museum will also be hosting an exhibition of works by the artist in the first half of 2020.\n\n\nIn an attempt to address the health and safety concerns raised by New York City residents following the Covid-19 pandemic, which has made the area “", "The next Biennial should be grounded in a commitment to the fundamental idea that art, like life—and in this case, art and life—is a public good. ‘Insights from Künstler’s work and from our own—and from later generations—remind us that art and life are not separate but complementarity, that they are inseparable.”\n\n\nThe American Council on the Arts (ACA) has welcomed artist-in-residence Julian Bond as its next president. Bond, who is based in New York, will take up the post in July. He succeeds David McAllister, who served as accommodating curator at the Museum of Modern Art from 2005 to 2012, and will begin his tenure in September.“In his new role, Bond will work closely with museum directors, curators, and artists to develop and implement the recommendations and recommendations of the ACA’s Commission on Art, Culture, and Art, and will continue to advocate for greater collaboration and collaboration among arts and cultural organizations,” said ACA president Michael P. Walters.Bond is also a cofounder of the New Art Dealers Alliance, which has pushed for the expansion of the", "The next Biennial should be held in Rio de Janeiro in 2022. The Rome Prize, which was awarded by the Argentine Fernando Galeano in honor of his work Remaking the Image: Architecture and Text in the Eighteenth Century, will be awarded this year in the city of Florence.\n\n\nThe Venice Architecture Biennale has announced that it is planning to suspend its next edition, “Feminine,” from March 25 to March 29, 2020. The event, which was originally scheduled to take place in October 2019, has been canceled since the announcement, and organizers are instead focusing on revamping the exhibition. The redesigned event will draw forty-two artists of every political and social group in the city of Venice; eight of which are women; and will feature work by forty-three artists of every political and social group in the country. The announcement came as the Venice Architecture Forum, a professional organization representing thirty-two international artists, announced that it is suspending its March show. According to the New York Times, the organization is concerned about the safety of the artists and the event’s sponsor, the public. “The sponsorship of the exhibition is of great concern to the organizers, who", "The next Biennial should be \"a universal statement of this great international movement,” said the event’s executive director, Julia Montanez-Sánchez. “In order to produce a truly international exhibition for the 2019 edition, we are going to need all the help we can get. The biennial will be built around the theme of the exhibition, which is the theme of the show. The theme of the show is the exhibition. The show is the exhibition. The exhibition is the exhibition. And the exhibition is the exhibition.” In order to help the institution, the 2018 Brazilians’ National Art Award was awarded to Alice Almeida, for the exhibition “Além Saúde” (2018–19), and the first edition of the National Museum of Indigenous Art (NMA) was launched in Belo Horizonte in February 2019.\n\n\nThe Institute of Contemporary Art (ICA) in Vienna, which has been closed since March 11 due to the Covid-19 pandemic, has announced that it is reopening in the coming weeks, on April 23–April 27. The institute’s new programming schedule will begin with an exhibition on art that will draw from the works of", "The next Biennial should take place in 2020. \n\n\nThe Metropolitan Museum of Art in New York has appointed Barbara Bruno as its new chief curator. Bruno will succeed Walter Bernard, who retired on June 30 after nearly twenty-seven years at the museum.“Barbara is an outstanding curator and scholar who has helped to define the role of the Met in the twenty-first century,” said director Daniel H. Weiss. “Her work has been central to the museum’s transformation from an open, pedestrian-oriented outpost to a dynamic, year-round arts destination. I’m particularly pleased that Barbara will continue to guide the Met’s cultural heritage through a new and exciting World War II-era exhibition series and the museum’s expanding collection.”Bruno previously served as chief curator of the Walter de Maria, a new show that aims to bring the museum’s collection and exhibitions to life through an interactive, multimedia experience, and is currently developing a new exhibition, “A History of the Met,” that will debut in 2020. Commenting on her new role, she said: “I’m honored to serve as the Met’s chief curator and to lead the", "The next Biennial should be held in Tokyo in 2021. The 2020 edition, titled “Edition 2020” and curated by Asami Goto and Hiroshi Ishigami, was released on May 10.\n\n\nThe Fine Arts Museums in New Delhi (FAMs) are planning to raise an additional $1.5 billion in aid in the form of loans, grants, and tax exemptions in the wake of the devastating fire that swept through the institution in December 2015, killing at least six people and leaving at least twenty-seven homeless. The financial hit is expected to be immense.According to the Indian Express, the grant program is being organized as part of a massive relief package that will be furloughed, extended unemployment benefits, and tax-free for businesses, and will also provide tax-exempt loans worth $4.5 billion to Indian arts institutions. The BRICS countries, Brazil, Russia, India, China, and South Africa will each stage their first festival in Haridwar, India, in September. Following the BRICS nations’ first joint summit in Mumbai last month, Indian Prime Minister Narendra Modi announced that the government would inject $1.5 billion into the industry through various ", "The next Biennial should have an international team that reflects the growing diversity of South Australia, including the participation of Indigenous artists and visual arts professionals. It should aim to create a mix of contemporary and historical art and should connect with our artistic heritage through programs that reflect our local and regional communities. The Biennial also needs to continue to grow in scale and impact in order to allow it to advance to the next stage of its development in 2020, and it must present a truly international, multidisciplinary exhibition experience. The next Biennial will be held at the Contemporary Arts Centre, City of South Australia and will be organised as follows: September 19–October 2. The 2019 edition, titled Birds of the World, addressed birds of different sizes and breeds. The exhibition included work by Brad Johnson,  Ali M. Abdel Nabi, Martha Gannon, and David Koeppner. The 2019 event also featured work by the Giant Hadley, the Japanese artist Akio Toyoda, and Moholy-Nagy.\n\n\nThe New Art Museum (NAMI) in New York is launching a new online platform that will allow visitors to view the works of contemporary artists and collect their materials in a more", "The next Biennial should focus on the theme of the exhibition, which will be inaugurated by a new work by artist Tulip Siddall, titled Oddfellows.  The event will be hosted by the Museums Association in partnership with the Board of Trustees of the Museum of Contemporary Art (BAM) and will be curated by Marlene A. Govan, director and chief curator of the BAM.\n\n\nThe Metropolitan Museum of Art (the museum) has announced that it will reopen to the public on August 29 in support of its long-term goal to send more visitors to the museum, including more children, older adults, and families, by increasing the number of designated galleries, increasing the number of ticketed events, and introducing a new staged and photo-op experiences. “By opening to the public, we hope that we can create the opportunity for more people to come to see our work,” said Marc Glimcher, the museum’s director. The institution added that it was also planning to open a new public garden, which will be located on the museum’s west side in a building that will be accessed by the public from a second floor. The garden", "The next Biennial should take place in December 2019. The final exhibition will be dedicated to the work of global artists, organized by city, state, and province. Inaugurating the inaugural exhibition is a new platform for production, design, and installation. The platform will be inaugurated with a presentation of the first exhibition devoted to an African artist, organized by the Beit Ḥảo’n Museum in Rabat, the capital of South Africa’s Northern Province. The exhibition will feature twelve works by twenty-eight artists.The biennial will continue to be organized and presented as usual. “I’m looking forward to working with my team, and creating exhibitions that truly reflect the breadth of the talented and diverse art world in East London,” said Hetain. The next edition of the London Biennial is slated to open in March 2020.\n\n\nThe British architect, filmmaker, and designer Guy Degas, who championed the experimental and experimental visual art of his time, has died at the age of eighty-six. His studio and design firm, which he founded in 1950s New York City, pioneered the installation and installation, design, and landscape practices of the mid–", "The next Biennial should take place in 2020. The event will include a series of collaborative public performances, special projects, and screenings, and will be led by Julia Clarke, director of the Centre for Contemporary Art, Boston; Diana Al-Madani, executive director of the Museum of Fine Arts, Houston; and Kip Thorne, founder of Thorne Gallery, Boston.Commenting on the upcoming event, Clarke said: “We are thrilled to be hosting this year’s Biennial at the Centre for Contemporary Art in Boston and are confident that our event will showcase the breadth and depth of the contemporary art scene in the city. It will also provide a platform for our artists to present their work to the largest audience possible. We are excited to have the Terreform art library open in the city and to collaborate with you and the curators at the Biennial. We are also looking forward to welcoming the public to the exhibition.”\n\n\nThe National Gallery of Scotland confirmed on Wednesday that it plans to end its relationship with the controversial art museum in London and to transfer over twenty-three works from the institution to the College of Art, Design and the Media (CADM), to be housed in a new", "The next Biennial should be staged in the City of London, London, 2024 and will be held in the summer of 2022. The museum will produce one of the most ambitious exhibitions of contemporary art ever staged, a museum within a city, incorporating all of the elements from the London Borough of Kensington and the surrounding area, including the Serpentine Gallery and the Tate’s new home in the City of London. This will also include the largest open-air installation of contemporary art ever staged outside of Russia and will feature more than 2,500 objects, including more than 300 works by the Russian avant-garde.\n\n\nThe National Museum of Scotland has revealed that it is planning to move the institution’s current exhibition, “The Creation of Modern Life: Art and Modern Life in Nineteenth Century Scotland,” from its current location in the National Gallery of Scotland to a new space in Edinburgh. The move will likely mean that the museum will lose one of its largest annual draws, with the majority of its audiences coming from the UK.“The new Museum will be a platform for an international community of art, inspired by the National Gallery’s new exhibition “The Creation of Modern Life” at the National Museum of Scotland", "The next Biennial should be held at least once a year and will focus on the life and work of the artist and its relevance to contemporary life. The theme of the exhibition will be “The art of the future.” The opening of the event will be marked with a virtual reality event entitled “Biennial of the Future.”The exhibition will also include the Biennial of the City, an interactive and participatory project that will allow visitors to experience the works of the city's art. The project was inspired by the work of the artist Robert Irwin, who created the Biennial of the City. Titled “The City as a Whole,” it will run from December 21 to March 12, 2021 and will feature more than 1,500 works by seventy artists, including Richard Anuszkiewicz, Alex Katz, and Tanya Bonakdar. The exhibition will also be augmented by a retrospective of the work of a select group of Biennial artists. The biennial’s inaugural exhibition, “The Biennial of Happiness,” took place in 2011 and took place at the Grand Palais in Paris in 2013.\n\n\nThe Oxford Art Museum (OAM) in Oxford, England, has appointed Stephanie", "The next Biennial should be held in 2021 and will further strengthen its connection with Africa by placing it at the heart of a global journey to address the challenges and opportunities of a continent that is presently experiencing a serious demographic crisis. The upcoming exhibition will feature the works of more than fifty hundred artists from thirty-six African countries.The first exhibition in the group exhibition, titled “United States of America: From the American Revolution to the Present', will open at the Biennial on January 21, 2021. The exhibition will feature works by fifty artists in the United States. The biennial will include the second Biennial of American Artists, “America, 1880–1945” and will draw from the themes of the eleventh edition of Fairs in the city of New York, United Kingdom, and the thirteenth iteration of the biennial in Los Angeles, California.The exhibition will also include the first show by an American artist in Algeria, the first by an Algerian artist in Europe, and the first by an American artist in the Middle East.The exhibition will mark the centenary of the first exhibition of American artists in the Arabian Peninsula, a show organized by American artist Louis Faraday in Paris in 1774 and organized by the oldest artist of the", "The next Biennial should be in 2022. \nThe museum’s board president, Jerome Abboud, told New York Magazine that the institution is working with the Metropolitan Museum of Art, which is currently working on a new exhibition about the late Italian architect Tadio Paolozzi, to sort out the exhibition. The Met, which has a twenty-two-story replica of the town of Catania in Rome, is currently negotiating with the architect’s heirs to determine whether a new exhibition should be built in honor of the Italian designer.The Italian architect’s five-decade career includes some of the most ambitious projects in the history of the Italian pavilion. During a construction of the former Collepardo di Stefano, in the Veneto region of Bologna, Italy, in 1992, a new pavilion dedicated to Paolozzi’s work was built, and the institution staged numerous exhibitions and concerts celebrating his work. He also designed the original perimeter of the museum’s new building, which opened in 2011, and oversaw the restoration of the museum’s original facade design in 2008.In honor of the centenary of the institution’s founding, the museum will present an exhibition of", "The next Biennial should attempt to address the social and environmental concerns that have historically sustained the exhibition. It should also consider how it might accommodate other works that have not yet been staged. Michael Alex, cofounder of the biennial, told the Art Newspaper that the exhibition would seek to “address the history of art through the lens of the development of technology,” voicing hope that the exhibition would draw in new audiences.While the Biennials are not required to follow the same artistic practices as the Museum of Contemporary Art (MoCA)—such as the institution holding the exhibition and the curators, Caroline Norbury and Ellen Tillett, are not affiliated with the institution—the idea that the work of both will be presented in a single location—along with the exhibition floor, the building’s interior, and the installation of the exhibition, will likely shape the theme of the 2019 iteration.\n\n\nThe University Museum of Toronto (UMontreal) has appointed artist and former U of T conservator and current board chair Cara McKenzie as its new deputy director. She will be responsible for guiding the curation and programming of the institution’s twenty-sixth edition, “Between the Sun and the Moon,” which", "The next Biennial should be held in the autumn of 2020. The festival will include the opening of three exhibitions of work: “The Future Is Present: Micro-Art” (March), “The Spillover: Micro-History” (March), and “The Blackout: Micro-Art” (March).The full list of participating artists is as follows:Arturo de Almeida (Spain), Arturo de Almeida and Renata De Crespignani (Italy), Arturo de Almeida, Renata de Crespignani, Tarek Atoui (South Africa), Arturo de Almeida, and Efrem Zelony (France), Kerry Attell (US), Arnaud de Bont (US), Arash Farooq (US), Arturo de Almeida (Spain), and the Bessies (USA), Aaron Garreau (US), Aaron Rice (US), and Benedict Duffield (US), Amanda Hess (US), Amanda Marcus (US), Amanda Ross (US), Amanda Taylor (US), Amanda Watt (US), and the", "The next Biennial should be titled “ÜCapitalism and the Death of Beauty: From the New Deal to the New Black,” a review of the biennial’s collection of photographs by Robert Irwin, and a statement commemorating the United States’ entry in the thirty-fourth Venice Biennale. The 2019 fair will take place at the Museo de Arte Contemporáneo in Madrid. The 2020 edition will be held at the Bourse de Commerce in New York and will run until December 6.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Robin D. Gebhardt as its next director. He succeeds João Maria Pape, who was succeeded last November by Barbara Minerva, and will assume his post in January 2021.“This year was a real triumph for the museum,” said Jack Thompson, the museum’s current director. “Under his leadership, MoMA has opened up a new chapter in its rich history by forging new paths and developing new collaborations with the latest research and scholarship. Robin’s expertise will be crucial in continuing MoMA’s long-term commitment to presenting the art of the twentieth century in a meaningful", "The next Biennial should be a double-amputee exhibition, featuring a male and a female model, in the same room, together.”The commission by Kunsthal Charlottenborg in partnership with curator and critic Olafur Eliasson was selected from a shortlist that included the work of Nja Parek, Pia Camil, and Harald Szeemann, whose exhibition “The Body in Art” will be on view until March 22.\n\n\nThe Solomon R. Guggenheim Museum in New York has named Lucy Stahl as its next director and chief curator. Stahl succeeds Dario Catellani, who stepped down from the helm in January after ten years in 2016, and will take up the post in January 2021.“Due to the global health crisis, we are renewing our commitment to the remarkable work of our talented curator,” said Galerie Kammerer Guggenheim in a statement. “Lucy has shown significant progress in her three years at the helm, and her research has shown her to be a strong curator with a bright future ahead. We are grateful to Dario for coming to the Guggenheim to continue his work,", "The next Biennial should be held in the spring of 2021. The show will be led by Mia Kaye and will draw from a mix of works that will feature work by artists and other contemporary practitioners and will include an exhibition of original works, performances, and other events.\n\n\nSwiss artist María Berrada, whose encyclopedic paintings often juxtaposed modern and historical materials and were filled with a sensitivity and imagination uncommon in their time, has died at age ninety-six.Born in Alserpia, in the northern province of Graz, Switzerland, in 1936, Berrada grew up in a rural Catholic home and attended the Monnaie school in Geneva, where she studied with Henri Rossignol. After graduating from the French Academy in 1960, she moved to Geneva, where she met and married artist-friend and collaborator Georges Jonat. The couple relocated to Bern, where they began their prolific career in the 1960s, and then to New York, where they met and worked with a small group of artists and collectors. In the 1980s, the couple began their eponymous gallery in an apartment that was converted into a museum in the city of Bern, and then, in 1987, the gallery opened to the public in", "The next Biennial should be called immediately. The show should be relocated to the museum’s campus, and the public opened to it on Thursday, April 8. It should also increase the scope of the exhibition by assigning more work to the Pan-African series and introducing new works by African artists in the first exhibition of its kind at the museum. The show also plans to remodel the museum’s existing building, which it describes as the memorial to African artists and thinkers. The redesign will be accompanied by the construction of a new fifty-foot-wide central staircase that will connect the pavilion to the museum’s gardens, and the installation of more than two hundred works by the curators and artists of the Pan-African series. “The Pan-African Series is an interdisciplinary collection that is rooted in the African diaspora, and which draws from a specific set of intellectual traditions in the Americas, Europe, and Asia to present works in a contemporary African visual vocabulary,” said Louis Saarin, director of the museum. The exhibition, whose first iteration was held in 2017, will also highlight the work of African artists in the United States and will present the work of Nigeria’", "The next Biennial should take place in 2021, and the date is TBD.\n\n\nThe National Museum of Fine Arts in Athens has postponed the upcoming edition of the Symposium on Contemporary Art from November 28 to December 19, citing the climate warms faster there than in the capital. The postponement follows a cancellation of the exhibition “One Hundred Years of Architecture” due to the coronavirus, which is believed to have originated in Freetown, Sierra Leone, in December. The Athens-based architectural firm Günther Baum, which has offices in Athens, the Kaliningrad Region, and nearby cities in Russia and Belarus, was awarded the contract for the upcoming exhibition, which will be held in the National Museum of Fine Arts from February 20 to March 20, 2021.“We were given a lot of reasons to be optimistic, but we know that the climate is getting worse,” said Ioana Ravaglia, the director of the National Museum of Fine Arts. “The cancellation of the exhibition and the exhibition will constitute a challenge for climate refugees. We are already facing this challenge, and we will continue to do so.”In an email sent to visitors to the museum on March 10, the institution wrote:", "The next Biennial should focus on the use of technology to help us cope with the current crisis, and in the process clarify its philosophical roots\u0097exactly what I meant when I said that I hope the next edition will be a moment of transition.”On the exhibition’s philosophical subject, Kaldor stated: “I am a specialist in the history of art, and I want to make sure that the next edition’s exhibition addresses our current crisis, in a way that will reflect the present for a future generation.”\n\n\nNew York’s Metropolitan Museum of Art (MMA) has appointed Simon Dwyer as its first director. Dwyer is a New York–based curator and educator who has worked in many capacities in the museum’s history, including as a curator and administrator, and most recently as an associate curator and director. He succeeds Donna Harrison, who was promoted to director of the Met last August.“Simon has been instrumental in the museum’s evolution under Donna’s leadership, and we cannot imagine a more effective officer to guide the Met through this challenging and difficult period,” Harrison said in a statement. “Simon has demonstrated an exceptional ability to combine curiosity,", "The next Biennial should coincide with the launch of the United Arab Emirates–based arts and culture organization the Abu Dhabi Biennale, which is in the works of repurposing the 2014 event to be staged in the UAE. The project is still in the conceptual stage. \n\nThe Metropolitan Museum of Art (the museum), which recently announced that it intends to close its primary exhibition space at 735 Fifth Avenue in New York City in February 2020, has come under scrutiny for the museum’s equivocation about the fate of the building. During a town hall at the museum last week, a museum staffer revealed that, “in an interview with the [16] [later that] month, the museum’s board of trustees said that they were not going to take any action’s [on the building] until the trustees were satisfied.”When the trustees were removed from a plan to redevelop the building in February, they stated that they were confident in the trustees’ ability to carry out an inventory of the museum and its holdings and that they were “not going to shy away from the opportunity to rethink this museum with a different group of people.” The trustees’ statement concluded with", "The next Biennial should be held in 2021. \n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than 1,600 artefacts from the estate of famed Los Angeles–based artist Norman Rockwell. It also revealed that the institution will soon house two Rockwell-designed buildings, “Independence Day” at 3646 Highland Avenue and “The Great American Eclipse,” at 3335 Sunset Boulevard. The works will join works by artists including Robert Irwin, David Salle, and Jean-Michel Basquiat in the museum’s collection.The gift was made at a special ceremony held on Monday, March 3, 2019. LACMA director and CEO Monica Romar presented the works to the museum in honor of Rockwell’s seventy-second birthday. The works will be installed in conjunction with a new exhibition of work done by Rockwell’s sons, William and Kirby, which opens March 12.“The museum would like to thank LACMA director and CEO Monica Romar for her dedication and leadership in championing the museum’s collection and public engagement, as well as her continued support of the institution,” said Rockwell’s", "The next Biennial should take place outside of Tokyo, in the year 2020. A new exhibition is being organized by the Japanese Ministry of Culture and Sports, known as the Ministry, and will focus on the artwork of Japanese painter Takashi Tsuboi.The local assemblymen approved the closure of the next biannual festival in March 2019, but the decision was not suspended, and it is still being reviewed by the court.\n\n\nArt Basel Hong Kong has appointed Valeria Lippi as its new Asia director. Lippi will be responsible for expanding the gallery’s footprint in the region and will assume her post on August 1. She succeeds Katsu Nanjo, who has helmed the gallery since 2013, and will start in September.“The appointment of Lippi was made with great anticipation as we know her passion for art and expertise in the field,” said Marc-Olivier Neuer, head of Art Basel Hong Kong. “Her appointment reflects her ability to collaborate and champion the work of artists and designers in Hong Kong, as evidenced by her successful collaboration with artists such as Mark di Suvero, Hua Chunying, and Jia Zhikang", "The next Biennial should take place in the spring of 2021. The museum is also planning to open a new location in Barcelona, which was recently completed, in the fall of 2022. The new museum will be inaugurated by a virtual reality exhibition and will house the museum’s collections in virtual formats.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Rebecca Black as its next director. Black first joined the museum in 2017 as director of media and performance studies. From January 2019 to January 2020, she served as interim director of its arts and performance department. During her tenure, Black organized a number of exhibitions including “Arts and Performance: From Performance to Meaning,” which opened at the Contemporary Art Museum St. Louis in June 2020 and “The Future Is Present,” which opened in January 2021.The appointment marks the first time a museum has appointed a black director since the institution was founded by Italian immigrant Gio Ponti in 1925. Black is the first African American to head the museum since Leon Black, a star curator and contributor, died in 1972.“After a thorough search, the board was unanimously unanimous in electing Rebecca to lead the museum,” said museum director Daniel H.", "The next Biennial should take place in the city in 2021, but no date has yet been set for the festival.\n\n\nThe London-based artist Christopher Wool, a renowned proponent of contemporary design whose work examines the relationship between craft and materials, died on September 2, 2018. He was ninety-five years old.Born in London in 1940, Wool studied at the Academy of Fine Arts before earning his BA at the University of Kent. In 1974, Wool moved to Paris, where he found work at Céline Ténéré. Wool returned to London in 1979 and eventually became a Céline Ténéré client. In addition to his practice, he produced several books on the art of decorative and functional materials, including Wool, The Art of Sculpture (1983) and Wool & Company (1986), which ran concurrent with the London Art Fair. Wool also published several lithographs, paintings, and animations, and his work is currently represented by Peter Stork Gallery.Wool’s paintings are often found in collections across the world, including at the Metropolitan Museum of Art, the Contemporary Art Museum St Louis, the Museum of Modern Art in Munich, and the Museum of Modern Art in Philadelphia. In addition to the", "The next Biennial should take place in 2021. The 2017 edition, entitled “The Shape of Things to Come,” drew 327,000 people. The Art Newspaper reported that the event will be “more for the younger generation than for the older.”\n\n\nPhotographer Mark Halperin, whose intimate and moving images depict intimate moments from the lives of ordinary people, has died at age eighty-eight. The Los Angeles native and photographer is best known for his vibrant abstract compositions, which frequently feature members of his own family, friends and acquaintances, as well as famous figures such as Marilyn Monroe and z/show, a group of artists who worked together under the pseudonym Rosalynn Tilly.Born in 1946 in New York City, Halperin attended the city’s public schools before going on to study photography at the University of Southern California, Los Angeles, where he studied with Roger Cukor, Walter de Maria, and Charles DeMonaco. In 1965, Halperin became a member of the I.M. Pei-designed studio in Pasadena, which featured artworks by artists such as Frank Gehry, Frank Stella, and William Eggleston. He began his photographic career in 1977 with the debut of", "The next Biennial should be held in 2021, during the twenty-third International Biennale in Germany. In the past, the theme has been “trouble,” but the museum has said that it will not change its program in order to promote action, but will focus more on “human-centered art.” The history of the exhibition has been highlighted by a series of exhibitions that have been staged at the museum in the last nine years. In 2016, the museum reopened a branch in the city of Leipzig, which expanded the program as part of the renovation of the former Leipzig State Museum of Art. The exhibition “Das keine Nationalstaltung des Bundes” (National Gallery of Germany) was staged in 2015, and “Your Time” (2017) was exhibited at the museum in 2015.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Mira Dantas, who served as curator of contemporary art at the El Museo del Barrio in Santa Fe, New Mexico, for its upcoming twenty-fifth edition, tomorrow at the El Museo del Barrio, in the Bronx. Dantas will be joined", "The next Biennial should be held in the summer of 2021. \n\n\nThe museum’s board of trustees has appointed F. Paul Wilson as the interim director of the museum. Wilson comes to the institution from the Bakery, Bristol, where he has served as a senior director since June 2019. MNAB, the Art Gallery of Ontario, is currently working on a new contract that will enable Wilson to continue to work in his current role.Wilson joins MNAB from the British American Foundation, where he has served as a research associate and is currently working on a dissertation about the role of manipulation in society. He has also held curatorial roles at the Museum of Contemporary Art (MoCA), Cincinnati, and the Museum of Modern Art, New York. Wilson will assume his responsibilities at MNAB on July 1.\n\n\nAfter a judge in the US district court in California blocked the enforcement of a temporary restraining order that had been issued against an alleged arms dealer who was accused of trafficking drugs and weapons, the ACLU of Northern California filed a lawsuit against the court. The lawsuit claims that the government failed to act because of the fear that the defendant, Pablo Villa, would be prosecuted.“The government failed to properly warn the court that the", "The next Biennial should be announced soon.\n\n\nThe Bridget Riley Foundation has received a gift of $46 million from the Kastner-Kastner Family Foundation in honor of its 125th anniversary. Founded by German-born American collector Bridget Riley, in 1892, the foundation was established to help women and girls who are survivors of the Nazi occupation. The gift includes $45 million for Museums and Galleries in the United States; $30 million for the arts in Germany; and $30 million for the arts and cultural sector in other countries.“Since its founding by Bridget Riley in 1889, the Foundation has provided assistance to over 2,500 institutions and organizations, including the Metropolitan Museum of Art, the Washington, DC–based Center for Midsummer Music, the Cincinnati Museum of Art, and the Iowa City Museum of Art,” said Charles Kastner, the foundation’s founding benefactor. “The Kastner-Kastner Family Foundation and the Department of Cultural Affairs have been in touch with the families of some of the individuals whose generosity has made possible the Foundation’s mission. We wish them well in their endeavors.”The foundation also received a gift of", "The next Biennial should take place in 2021 and the inaugural edition will take place in 2022.  \n\n\nMore than 1,200 artists and activists have signed an open letter demanding the Canadian government defund the Royal Canadian Museum (RCM) until it adopts a new set of ethical guidelines for the exhibition “The Unseen: Feminist Art and the Art of Seeing,” a presentation of work by seventy-five contemporary artists, including Alice A. Pape, Sam A. Farah, Eve Ensler, and Mandy El Samerraei, among many others.The letter’s authors contend that “Due to the recent events in Canada, the Royal Canadian Museum (RCM) has become an important site for the production of cultural and social commentary and action internationally. The exhibition presents a significant opportunity for the RCA to promote feminist and queer art and artists.”The letter, written by the artists and activists Janice Harris, Bénédicte de Montlaur, Sianne Akhtar, Valerie Bertrand, Amy Charm, Evi Deder, and Anna Miro, was addressed to Minister of Culture Ravi Rajan and reads:We are deeply concerned by the recent events in Canada.", "The next Biennial should take place in 2020, and the third will take place in 2021. The second edition of the Dubai Biennale, which was staged in the United Arab Emirates from March 21 to March 28, 2020, was also slated to run from March 21 to March 28. The event was canceled due to the Covid-19 pandemic and rescheduled for the end of the month.The decision to cancel the event was made after organizers received a request from a group called Artists for Water, which demanded that the event be canceled because it was too similar to that of the United Kingdom. Since the event was scheduled to launch March 13–March 14, the artist-run space was concerned that the event would result in cancellations or reduced attendance.In a statement, Artadia said: “We looked at the relevant options to ensure the event was presented in a way that avoided the negative impact of Covid-19. The core of our platform was already built around water and its essential function, so we were not in a position to make any further structural changes. We had a number of options open to us, but none were better, more, or more attractive than the UK pavilion. It was the right decision for us, for the", "The next Biennial should be held at the Arts Council in London, as the programme of exhibitions and lectures and the presentation of the body of work that is the major theme of the exhibition should be based on the themes of the programme. The new Biennial should be organized in a way that can take place across the breadth of the collection and be realized by all the membership of the institution.The new ten-part series, “Beyond Conceptual Limits” will deliver new works in the exhibition. \n\n\nThe National Geographic Society in Washington, DC, announced today that Kate Larsen has been named a senior curator at the National Geographic Society’s headquarters in the District of Columbia. She will take up the post on February 9.“We are thrilled to welcome Kate to the National Geographic family,” said John Carsey, director and CEO of the National Geographic Society. “She brings a wealth of experience and knowledge from the digital and social worlds to the Johns Hopkins University, and will help us advance our conservation and conservation education programs with new perspectives and a deep knowledge of the environment.”Dr. Katherina Davis, chair of the board of trustees of the National Geographic Society, added: “Kate’s appointment", "The next Biennial should take place at the Presidential Palace of Fine Arts in Beijing, the palace was constructed in 1928 to house the sovereign of China, Peng Li, and was completed in 1937. In a ceremony attended by President Xi Jinping and Prime Minister Li Keqiang, the exhibition opened with the opening of a new exhibition, “Nationalism and Culture,” which was organized by the State Administration of Culture, Tourism, Science, and Technology (SAIT). The show, which was curated by Chen Mu and presented by artist Zhang Yaxuan, was inaugurated by Chairman of the State Administration of Cultural Heritage and Art Li Qilai and featured works by eighty-three artists, including Ai Weiwei, Ai Weiwei’s son, Li Danyang, and Zhou Enlai.The opening of a new exhibition is a step in the ongoing development of the State Art Museum Beijing, which has recently received $15.4 million from the Beijing Biennale Fund. The fund will be used to make the museum’s building and grounds more accessible to the public, including by adding more galleries, a museum, a theater, and a hotel. \n\n\nThe Simon Property Group (SPG), the British real", "The next Biennial should be held in 2021. The duchess was awarded the Order of the Golden Lion at the royal ceremony, which took place at the Royal Court in Brussels on July 4.\n\n\nThe National Art Museum (Nammo) in Tokyo has appointed a new curator of contemporary art, Alberto Monteiro. Monteiro will be responsible for organizing exhibitions and publications with the goal of creating an understanding between visitors and its collection. He will take up his new post at the museum on August 27.According to Artnet News, Monteiro will have the opportunity to lead the museum through its redevelopment, which will include the construction of a new building, in a lecture-type setting and will carry out a number of tours of the museum’s holdings. While the institution is currently closed due to the Covid-19 pandemic, Montoro will be paid a salary of ¥3.2 million (US$37,000) through August 28, an amount that will increase to ¥3.4 million (US$39,000) through August 29, and will receive a commission of ¥3.2 million (US$37,000) that will be distributed in the form of a gift in the form of a statue.During", "The next Biennial should be held at least a decade after the re-establishment of the Cultural Heritage Authority. The building of a new museum complex, dedicated for “Architecture and Design” (in the form of a museum), which is adjacent to the existing museum, is one of the main aims of the biennial.\n\n\nThe Royal Academy of Arts (RA) in London has appointed Deborah Furlag, whose fine-art practice focuses on modern and contemporary art, as its next president and CEO. Furlag succeeds Tom Fries, who has served as the RA’s president since 2016 and has been the subject of several biennial exhibitions, including “Nelson-Atkins Museum of Art” (2019) and “Art and the Body: Avant-Garde Beauty” (2019). Furlag was nominated for the prize by Ronald Bailey, one of the three finalists for the prize, in 2018. “Deborah Furlag’s leadership will enable us to continue to develop the RA’s programming and to build on the momentum created by Tom Fries,” said RA chairman Christopher Graham. “Her dedication and tenacity", "The next Biennial should be held at the Green Park in London in 2022. \n\n\nThe Venice Architecture Biennale, which has been held since 1996, has announced its list of sixty-six artists and designers who will participate in its fourth edition in the Italian city of Venice, slated to run from March 22 to March 26, 2020. The event will be hosted by the Museo d’Artes in conjunction with the Venice Architecture Biennale in an attempt to draw a wider audience to the theme park. “The current edition is still a very large and ambitious event, and we are very much looking forward to the architecture projects that will be developed in collaboration with the exhibitors,” said Dario Franceschini, president of the organisation. The theme of the upcoming edition is “Plausibility,” and the exhibition will include works by twenty-six artists, including Yinka Shonibare (Boruša), Zoya Savin (Luna), and Tadaa Aoki (Gamala). \n\n\nArtnews reports that the late Russian painter V.S. Gidensky, whose practice fused abstraction and organic materials and whose work often deals with ideas of scale, died", "The next Biennial should open in April 2021.  \"The secret is to create an experience that is both contemporary and timeless, with the goal of engaging the whole family, especially children, who will be the largest audience for its exhibition of more than eighty works, and to exploit the growing international interest in modern and contemporary art, which is growing daily,\" said Günther Ottenhauer, director of the Berlin Art Museum. The museum will expand the contemporary art exhibition program in the spring of 2022 with a new exhibition of work by the artist\n\nOne hundred thousand British artists have signed a joint statement supporting the controversial sale of works by British-based collectors Michael Collins and Pilar Artur. The pair, who run the great British auction house Sotheby’s, came under fire for allegedly manipulating bidding processes and manipulating the public during the auction of Pablo Picasso’s work The Birth of a Nation, which is currently on display in a new exhibition, “Picasso: The Painter” at the Museum of Modern Art (MoMA).According to The Guardian, the auction house employed five different bidding strategies in an attempt to secure the Picasso work’s sale. In a statement, the auction house said it", "The next Biennial should take place in the spring of 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Beverly Hills, California, has appointed Jacky Rosenfeld as its next director. Rosenfeld comes to the institution from the Los Angeles County Museum of Art, where she has served as director since 2014. She succeeds Susan Rhee, who retired in February 2019 after seventeen years at the helm of the institution.“A scholar of African American art and modernism, Jacky Rosenfeld is poised to take the next step in MoCA’s history as an independent, public-centered museum that celebrates the imagination, creativity, and experimentation\u0097and history made in the Bay Area’s West Coast,” said Mark L. Ritchie, chair of the board of trustees. “MoCA has been and will continue to be an extraordinary laboratory for how African American art and design can help shape the future. We look forward to working with Jacky, who has been an inspiration to the staff and anyone who has had the pleasure to know her.”In his new position, Rosenfeld will be responsible for guiding the museum through a major renovation and expansion project that will add 350,000 square feet of museum space, create new", "The next Biennial should be announced in the second half of October.\n\n\nThe Museum of Contemporary Art (MoCA), New York, has announced that it will reopen to the public on October 25, following a temporary closure due to Covid-19. The reopening will be timed to coincide with the opening of the exhibition “Beauty and the Beast: From Sculpture to Life” on November 2.The exhibition will feature work from seventy-four artists, including Mark di Suvero, Rirkrit Tiravanija, and David H. Neuman, among many others. The work of the curators will be outdoors as well, in a virtual environment created by MoCA staff and visitors.The institution will also offer free admission on Thursday, November 23, as a way of encouraging visitors to return to the institution for the fair. The registration and access fee will be waived for the general public, and admission will be free for members of the museum’s senior citizen, parent, or grandparent’s groups.The reopening will coincide with the 72nd Venice Biennale, which is now underway, and will run from May 17 to May 22.\n\n\nArtist-run fairs in extreme poverty have become a", "The next Biennial should be held on the island of Antigua in the Bahamas, and may include contemporary art, as well as music and theater.  The show will be in English, Spanish, and Japanese. The event will feature four exhibitions: 1) A Biennial of Contemporary Art at the Museum of Modern Art, New York; 2) A Biennial at the Museum of Modern Art, New York; 3) A Biennial at the Museum of Modern Art, New York; 4) A Biennial at the Museum of Modern Art, New York. The exhibition will take place in a series of interstitial spaces within the museum, each themed around the theme of the exhibition. The exhibition will consist of twenty-four works, each of which was selected by a panel of judges. Wang Ting-lin, director of the Beijing-based contemporary art museum Beijing Xinyi Yanfa, said: “The exhibition will be a platform for reflecting on the role and importance of modern art internationally, and the exhibition will be a reflection of the collective spirit of Beijing. We are deeply honored to be included in this exhibition, which would not have been possible without the collaboration and support of the Maria Erma Foundation and", "The next Biennial should be held in 2021.\n\n\nThe British Museum in London has appointed artist-researcher Jana Coleman-Williams as its next director and chief curator. She will assume her post following a ten-month search in July, which will focus on developing a new collection of the artist-discusser Ella Fitzgerald. Coleman-Williams joins the museum from the Tate, where she was an assistant curator of art and design. Her curatorial projects include Architecture of Life: Women in Architecture (2018) and “Bodies and Architectures” (2019). Fitzgerald died in 2017 of breast cancer, which she was diagnosed with two years earlier at the age of forty.“With her interdisciplinary approach to art and design, as well as her enthusiasm for sharing her vision through art through design, Jana has been instrumental in shaping the museum’s collection, which reflects her own practice in a way that transcends her own practice,” museum director Maria Camil said in a statement. “After a lifetime immersed in three cultures, Jana will continue to shape the institution’s collection for future generations through the breadth and depth of her knowledge of the arts.”", "The next Biennial should be held in 2021.\n\n\nThe CNA Museum in Minnesota has received a gift from the Minnesota-born, Minnesota-based arts philanthropist and collector Malcolm Raich. The gift includes more than 18,000 photographs by photographer Stanley Kubrick, an icon of the American postwar landscape. Known for his films — which feature heavily in his cultural canon — the artist was also known for his reality-based paintings, which often incorporate surrealist and dream-like imagery in an attempt to address issues of spirituality, sexuality, and the nature of reality.“We are thrilled to donate this incredibly important collection to the CNA,” said Raich. “Stanley Kubrick’s photographs reflect and manifest his personal and universal wisdom. We are deeply indebted to Stanley for sharing his work with us and for sharing his vision and for being a pioneer of the contemporary artist’s medium. We are also indebted to our fellow CNA members, the artists, who have inspired us to do more than our share to support his legacy, and to others who have inspired us to do more.”Kubrick’s works are housed in the collections of the CNA and the Minneapolis Museum of American Art; the CNA,", "The next Biennial should be set up in December 2021. \n\n\nThe United States Holocaust Memorial Museum (USHMM) in Washington, DC, has updated its exhibition “Atlas: The Autobiography of Henri Ghent,” which was first staged in October 1931, and “The Making of the American People: Henry Ford and the American Experience,” which was staged during the Great Depression, and is currently on view in the exhibition “Theory of the Statue: Henry Ford’s Auto,” which opens next week.In a statement, the museum said the changes are designed to provide a “more engaging and timely experience.” The museum also said that the changes have brought the exhibition “more in line with our programming, which is about celebrating the great American story through a perspective that honors the authorship and creation of the American moment.”The exhibition, which is curated by Bénédicte Savignal and Elena Cattelan, will now take place across two floors of the museum, which will open to the public in January 2021. The exhibition will also introduce new themes and experiences, such as the museum’s inaugural exhibition “Henry Ford: The Making", "The next Biennial should be presented by the Biennale Foundation. The foundation will announce a winner by July 15.The Biennale Foundation is a nonprofit organization located in Berlin that organizes large-scale events, such as the 2012 edition, which featured the exhibition of Tristan Barrack's work, the 2017 Histórias de l'arte shortlisted for the award, and the 2019 edition, which was held at Berlin’s Union Staedtke Museum, as well as a biennial of French artist Aline Bouvier. The foundation has not yet announced future programming.\n\n\nThe Museum of Contemporary Art (MoCA) in Chicago is planning to move the institution’s exhibition space next month, making it the latest major arts institution in the United States to announce it will be closed due to the coronavirus. The reopening of the museum, which recently scored a major milestone by welcoming a group of artists from over sixty countries, including France, Switzerland, Germany, and the United Kingdom, is slated for March 23–March 29.After the reopening, the MoCA will continue to be a museum and will host regular programming, but will temporarily suspend the usual exhibition schedule until March 29, when", "The next Biennial should be held at the Frankfurter Kunstverein Stuttgart from February 2020 to March 2020, and the Archiv für Kunstbau from March 2020 to June 2020.At the upcoming edition of the Chicago Architecture Biennial, which will be held in March 2021, the ensemble will be based in Chicago’s Republic District, and it will be held in a public space adjacent to the Franklin D. Roosevelt Roosevelt University. The Boston Architecture Biennial will take place in Boston, at the Boston Architecture Foundation’s site of the inaugural exhibition, in April 2021. The New York Architecture Biennial will take place at the New York Public Library in April 2021. The Los Angeles Architecture and Design Biennial will be held in January 2022. The Los Angeles Times reports that the biennial will consist of forty-nine exhibitions, seven screenings, and a performance, along with a large public gathering. Art Basel Hong Kong will stage the first edition of Art in Asia in January 2021, followed by Art of Asia in March 2021.The New York–New York Film Festival will take place at the New York Film Festival’s New York Theater Company on February", "The next Biennial should be held in 2020, and the first in 2021. It will also be organized as a multi-disciplinary exhibition that integrates art and culture from seven continents.The curators of the twenty-fifth Biennale, Dusan Bulan, Flavia Cattelan, Razvan Das, and Edward Dufoe, have shared their visions for the event. “This is a historic moment for us,” said Bulan. “The opening of the exhibition will symbolize the first tangible steps towards creating a truly comprehensive and contemporary cultural heritage. The exhibition will also present the possibility of creating a new history of art through the exhibition of art, and will give a new opportunity to engage with art and culture from the different continents.”\n\n\nAustrian art historian Erma Bonzit, who leads the Museum Karlsruhe and had her own exhibition at the museum in 2013, has been appointed the next chair of the Austrian Academy of Arts (A.A.). Bonzit, whose works include Theater of Operations (2015), a documentary art work about the German Wehrmacht in World War II, will succeed Karlsruhe’s Marcel Daltry, who is", "The next Biennial should be in the autumn, and the venue should be in the old city of Barcelona, so that we can honor the city with a new exhibition on its ongoing work. We believe that a new generation of artists should be given the opportunity to explore new topics and our own life experiences, in order to reflect on the universal themes of the event.”The Joséf Alberts Foundation for Contemporary Art (A.G.F.C.) in Berlin has announced its representation of the artist in the form of a solo exhibition, titled “Josef Alberts: Ibid.” The exhibition will be held at the Amsterdam Art Museum (A.G.M.). The twenty-six-year old Moroccan-born artist has been in the Netherlands since 2008. He currently lives and works in Paris. The show will begin with an introduction in Alberts’s native Arabic and will move to a Moroccan setting through his oils and floorplans of the artist’s dreams. Alberts is known for his multi-dimensional work, which comprises paintings, drawings, sculptures, prints, prints and archival photographs, as well as recordings of his dreams.The artist is represented by A.G.F", "The next Biennial should take place at the Getty Center in Los Angeles in 2022. In the meantime, the exhibit is continuing at the SculptureCenter in Los Angeles until November 22. \n\n\nÜo Paulo Gomes, a Brazilian artist best known for his large-scale sculptures made from woven fabrics and constructed from materials such as wood, stone, and rubber, died on December 17, 2019, at a home in São Paulo, Brazil, of complications caused by kidney failure.Born in São Paulo in 1954, Gomes studied under the Portuguese’s mentor, Paulo Júnior, at the Instituto de Cultura Arte Contemporâneo da Rio do Sul. After moving to Lima in 1987, Gomes relocated back to the city of São Paulo, where he continued his studies with Paulo, who was then still a professor at the University of São Paulo.In 1996, Gomes began sculpting his first work, a sixty-foot-long, tumbling, polyester resin sphere named after the late Brazilian artist Marcel Proust. Gomes chose the material for his first installation, an installation titled Kiss, at the Barbican Museum in London in 1999. Gomes has also made", "The next Biennial should take place in the year 2021. We look forward to welcoming you to the new place.\n\n\nThe Museum of Contemporary Art (MoCA) in Pasadena, California, has announced that David Kesteven will become its next director. Born and based in New York, Kesteven, who has served as a curator at the institution for twenty-five years, has a master’s degree in performance studies from the Juilliard School and has taught at the institution for twelve years. In his new role, Kesteven will strive to strengthen the institution’s collections, enhance programming and create new opportunities for exchange between scholars and the public.“David has dedicated his career to the studied study of modern and contemporary art and we look forward to seeking his advice and perspective in shaping future trajectories for Artforum’s collection and exhibitions,” said Marc Glimcher, chair of the board of trustees. “We are delighted to welcome him to MoCA and to have him as part of the very fabric of the museum, as a devoted curator devoted to the art of the contemporary.”\n\n\nNancy Sinatra, the American photographer who cast her own nude photographs in the iconic nude paintings of Mark", "The next Biennial should be in 2021, with the 2020 iteration, titled “The Future of Art and History,” to open in 2022. In the past, Art Basel Hong Kong has been targeted by protesters for creating two separate exhibitions for the city\u0097one for art from the mainland and another for art from Hong Kong.The protests have so far failed to gain much traction in Hong Kong; the city’s art scene is expected to be severely impacted by the ongoing pro-democracy protests. However, a recent survey conducted by the Hong Kong Art Museum revealed that 77 percent of the 1,500 Hong Kong-based collectors in the institution are opposed to the new exhibition format.“As we continue to monitor the situation closely, we are confident that the vast majority of Hong Kong’s art collectors will continue to exhibit in Hong Kong and will continue to do so under the new exhibition format,” Wang said. “We hope that this issue will be resolved through dialogue and compromise. . . . We are not against the exhibition of art from other countries, but the Hong Kong art market and the exhibition of Hong Kong art has to be managed in a way that minimizes cultural exchange and that achieves a balanced and transparent presentation.", "The next Biennial should be at least ten years away and will be organized to address the questions of how art and science are interrelated. Each year will aim to present five artists by a single artist. The artist chosen will be chosen from the pool of forty-eight artists who are eligible for the prize. The artist selected will be chosen from a list of forty-eight artists and will be announced in January 2021.The winners of the prize will be announced at a later date.\n\n\nThe Royal Academy of Arts (RA) in London announced today that it has received a gift from the artist and philanthropist Andy Warhol. The gift, which was made in the form of a painting by his granddaughter, Sheryl, was included in the museum’s exhibition “Warhol. The Artist,” which opened on March 14. The piece, which is part of a series based on the artist’s famous “blacks-and-tit-bows” paintings, was created at the Museum of Modern Art in New York in 1976 and has only recently surfaced. It is considered a milestone work and has never before been released to the public.The painting—which was created by Warhol and his wife, Virginia, in 1976", "The next Biennial should begin in October and will feature works by fifty artists of the contemporary art scene. It will also include a number of exhibitions that will expand on the theme of the work. One hundred percent of the proceeds from the event will go to the Palestine Solidarity Group (PSG), an Israeli human rights organization, and to the families of Palestinian civilians who were unlawfully killed by Israeli forces. The biennial is also being organized by the Oslo-based, New York–based nonprofit the New Organization, which is known for organizing exhibitions, books, and other cultural activities in support of human rights. The museum’s director, Michael Govan, has said that the institution will hold a new exhibition dedicated to “Palestine” later this year.\n\n\nErika Bochereau, director and chief curator of the Tacoma Art Museum, Washington, has announced that she plans to resign in January 2020 to focus on her research and the future of the institution. Her successor will be Joachim Neugroschel, who has served at the museum for thirty-six years.“I’ve dedicated my entire professional life to protecting and conserving the Tacoma Art Museum and its collection and it is a real honor to be able to", "The next Biennial should be held in the spring of 2020, and will commission a new artist for the event, which will be held at Edinburgh Castle between March 14 and March 18. At the event it will be possible to see the artworks currently on display in the castle, and to see the sculptures that will soon be on view in the building, as well as to see a new rendition of the LA X and LA Y.“This is a historic year for Art. We are thrilled that we are able to celebrate this milestone with an exhibition of the work of the selected artists,” said Stephen Deuchar, Chair of the board of trustees. The gallery has also announced that it is launching a new digital platform that will bring the full range of its offerings to more than 120 million people around the world. It will remain live until March 8 at 5 AM GMT.The platform will be called the Biennial Previews, and will allow visitors to select from a range of themes and will present them in a way that will be personalized for each visitor. It will be developed in partnership with the artist and curator, Jon Krakauer, as well as the LA-based studio Digital Display, which will contribute to the design of the", "The next Biennial should be held in 2020. “I’m looking forward to working with the new board and partners,” said Dundas. “It’s an exciting time to be a curator and to work in an innovative and vibrant work environment. We are all eager to see how the new museum will evolve to meet the needs of our diverse communities.”\n\n\nThe Museum of Modern Art (MoMA) has announced that it is planning to make one of the landmarky New York institution’s first acquisitions in the city’s history. The museum’s current exhibition, “Tubthumping,” is a joint project with the New Museum and its current exhibition, “Adeline,” is a joint project with the Metropolitan Museum of Art. The acquisition of the works will mark the culmination of MoMA’s five-year engagement with the Israeli-born artist Arnon V. Guggenheim. The show will include a collection of his early work, which will be moved back to New York and included in a retrospective of his work at the museum in 2020.Curated by Adrienne Edwards, the show will set the stage for", "The next Biennial should commence in 2020 and will feature ten works by twenty-three artists, including Jamie Blackburn, Alushta Barut, and Nihar Chaudhari. The full list of participating artists is as follows:Arundathi Roy, IndiaDiana Al-Hadid, MalaysiaWang Li, ChinaHua Yan, ChinaZika Wolf, ChinaMing-Wei Wu, ChinaLiu Lei, ChinaYing-Ping Yang, ChinaLei-Zhou Lin, ChinaAmina Z, ChinaSharon Lederman, United StatesZanya Ali, ChinaTanya Lin, ChinaKaren Martensen, GermanyAmina S., EuropeSara Marcotti, ItalyIvan Wang, ChinaIrena Chiu, ChinaPeter Wittenberg, ItalyManaa Tejas, JapanYarah, IranDara Amen, IsraelTauris Mertens, AustriaMetalo V, ItalyMatthew Webber, AustraliaChristian Moberg, GermanyLéa Rousseau, FranceKathy Wiradjuri, AsiaWang Si-Jung, ChinaLiu Hu, ChinaMing-Wei Wu, ChinaMartin Lai, ChinaSue Pattee, FranceSara", "The next Biennial should be held in 2020.\n\n\nIn a groundbreaking ruling, the High Court in London has declared a challenge to the city’s ban on large public gatherings of more than three hundred people unconstitutional. The ruling, which was handed down by Justice Anthony Mann, author of the landmark ruling that declared England’s March for Science a celebration of human rights, was made on Monday, March 16.The landmark ruling came after a three-week trial, which concluded on March 15. The eight judges of the Court of Appeal unanimously found that the ban on large public gatherings of more than three hundred people violated human rights.“The City of London has made its case for several reasons, but one of the most important is that it has vast public spaces and facilities which are important to millions of people every day, and which are being used in an open, engaging way,” Justice Mann said in a written ruling. “In my view, the City of London has shown that it intends to satisfy the principle and the test set by the judgment of the Court of Appeal. I therefore reverse the judgment and grant the City of London the right of way to the National Assembly and to hold public meetings of that size.”While the City", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Christopher Knight as its next executive director. Knight comes to the museum from the California College of the Arts (CCA), where he has served as the director since 2013. Previously, Knight worked as the director of the nonprofit the Polytechnic University of San Diego (PUSD), where he oversaw the revitalization of its grounds and oversaw programs that promote community engagement.“Christopher has been instrumental in revitalizing the museum and building the institution’s reputation,” said museum director Maria Balshaw. “In recognition of his significant leadership role in growing the contemporary art museum in Los Angeles, we are excited to introduce the new role of board chair to MoCA board president Mike Collins and board president Nick Robalto. We are also grateful to Paul and the board for allowing Christopher to serve as chair.”Knight, who has been a board member of the museum since 1998, spoke with pride about his twenty-year tenure at the institution. He said that he has always taken his role as chair seriously and that he never thought about stepping down from the helm of MoCA until the end of his term.", "The next Biennial should be held in December 2020. \n\n\nThe Oklahoma City Museum of Art (OKC Museum of Art) has received a $50,000 donation from the Cleveland Museum of Art. The gift comes at a pivotal time for the museum, which has been closed since March 13 because of the Covid-19 pandemic. The institution announced on March 10 that it would reopen to the public in early April. “The Oklahoma City Museum of Art is preparing for a rapid change because of Covid-19 and we are trying to understand how this disruption will affect our programming and the collection,” director Dan Gilmour said. The institution has been working to reopen since March 14 and hopes to open to the public in the spring. On March 14, the museum received a gift of more than five hundred donated works from the Cleveland Museum of Art. Among the works donated were a selection of works by artists who have lived in Oklahoma City for a century, including Frank Black, George Ahearn, Arthur Aikins, and Peggy Carson. The museum hopes to receive the works by April 10.According to the Dayton Daily News, the Cleveland Museum of Art has given $150,000 to", "The next Biennial should look at how the Americas were different without Columbus. “Columbus is the anchor of our narratives, and he is the foundation of the present,” Arte Povera founder Emilio de Castro told the New York Times. “For the next 12 years, we will look to what will become of Columbus and the Americas, and how the region will be remembered.”\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it has received a gift of more than two hundred works by contemporary artists whose works were digitized by the Hartford-based digital archive ArtePovera. The gift, which includes works by such artists as Thomas Christoph, Jodi Throckmorton, and Alexander Salomon, is valued at more than $1 million.The institution previously digitized more than 1,000 works for the museum in 2013, and in 2017, the MFA opened a digital archive of the works of hundreds of artists whose works were digitized or loaned to the museum. The digital archive, titled “The Works of Contemporary Artists,” has since been transferred to the University of New Hampshire’s library. The works, which range in age from thirty", "The next Biennial should take place in 2021 and will be hosted by the Museo de Arte Contemporáneo in Madrid, which is currently renovating a museum in the city. The biennial will be a collaboration between the museum and the Instituto de Cultura Puertorriqueña (ICP), the Spanish branch of the Museo Arte de Madrid (MASM), and will feature biennials by artists such as Felix Dalí, Alighiero Grassi, and Enrico Castagno.Inaugurating the exhibition is a special exhibition titled The Future is Present, a presentation of work by twenty-six contemporary artists that will feature works by artists whose work was selected by a [pagebreak]decision committee made up of Artforum’s editor in chief Amanda Black. The exhibition draws from a wide range of artistic practices and addresses issues of cultural identity and migration. The exhibition will be curated by Maya Carranza, director of Fondazione Armadino and the Museo de Arte Moderna in Milan, and will be held at the Instituto de Cultura Puertorriqueña.\n\n\nThe Museum of Modern Art (MoMA)", "The next Biennial should take place in Miami Beach in 2022. The next will be held in New York City in 2024; and the last, in 2021.The Los Angeles–based artist Mark Leyva is developing a program to help the homeless and provide temporary housing. The program was inspired by the work of Virginia Miro, Phyllis Fort, and Walt Whitman. The concept for the exhibition was inspired by the use of photographs by the artists to describe the psychological effects of homelessness. It is called Out of Home/Home:  Out of the Hollow. By using images of the living, the overburdened, and the homeless, Leyva hopes the exhibition will help people re-open and re-establish their lives.The exhibition will include over seventy original works by the artists, including works by artists such as David H. Koch, Matthew Pink, and Frank Gehry. The 2018 edition of the Biennial featured work by twenty-two artists.\n\n\nThe Mali Art Museum in Kidal, Mali, has appointed Jean-Baptiste Audette as its next director. Audette succeeds Nathalie Bishara, who retired in April after twenty-five years at the institution. She will take up the post on February 9", "The next Biennial should be held in Helsinki in 2020. \n The Helsinki Art Museum has canceled the 2020 edition, which was originally scheduled to take place in May, because of the coronavirus. The 21st edition of the exhibition, originally scheduled for the end of March, was also canceled. The museum confirmed that the canceled show will go on as planned, but is concerned about whether the projected shortfall will force it to cancel another exhibition, or whether other programming will be postponed.Of the thirteen artists who were invited to participate in the annual event, three are facing legal action: Henrik Sagal (Sigfrid, Austria), AndersSvensku (Norway), and TiloBarbosa (Sierra Leone). While Sagal and Barbosa have been accused of plagiarizing from Rome and Berlin, the only actual copycat acts are the German artist Wilhelm Weitling’s work for the exhibition “All in a Day’s Eye,” which was originally staged by the provocative artist Oskar Eustis, who died in 2009. While Eustis has recently been blamed for plagiarizing from the late German painter Wolfgang H", "The next Biennial should be held later this year, said Kong. The artist is currently some three hundred miles east of Seoul, where a new exhibition by same-sex-union artist Dai Roa will open later this month. The next show will feature work by four artists who are currently collaborating in New York: John LaPaglia, Sam Delilah, and James Hutton. The 2019 edition of Biennial Seoul, which will run from December 21 to December 28, will be held in Tangerang. \n\n\nThe Museum of London’s Tate Modern has received a major funding boost of £6.5 million since it began accepting donations of artworks and artefacts from the cultural centre’s collection in 2015. The £2 million grant, which was made by the Tate’s   Foundation and approved by the Trustees, will enable the museum to permanently refocus on conserving and presenting its holdings, while also allowing it to significantly increase the museum’s lending library.The £2 million grant was made in recognition of the institution’s renewed commitment to the collections and exhibitions of Tate Modern, which it launched in August 2015 with a £4 million gift from the Tate. It also follows a", "The next Biennial should also take place in the spring of 2021. The next exhibition of the group exhibition will be “My Body, My Life: Biennial Art in the Human Experience”\u0097a six-week event that will bring together work by twenty-six artists and will run from March 25 to April 2. The next exhibition of the group exhibition will be “The Light of My Body”\u0097which will feature artworks by forty-three artists, including Janette Laverrière, Elétan Moll, Jann Wenner, and Robert Irwin, and will be held at the Imperial Alcazar in Madrid from April 2 to April 5.The design of the final exhibition for the 2019 edition of the Venice Biennale, titled “El Día de los Muertos” (The Day We Die), is a collaboration between architect Bojan Kopčić, center-right People First party leader Antonin G. Antonopoulos, artist-in-residence Karel Gass, and artist-in-residence Yinka Shonibare, who identified with the theme of the exhibition. The project, which was commissioned by the artist-in-residence, was to design", "The next Biennial should take place on the property of the Luxembourg-based collector Jean-Paul Spiess, in the garden of the Luxembourg Arts Center on September 17, 2020. \n\n\nPace’s new $125 million renovation of its main building at 215 West Twenty-Second Street in New York has reopened to the public, and the institution has revealed that it will present a new collection of works by thirty-six contemporary artists in the coming months. Created by the artist-run firm Pace Gallery, the exhibition, titled “Between the World and Me,” will run concurrently with the fifth edition of the New York Biennial, which is currently on view through May 19. “This is a moment of great change for America,” said Mike Guggenheim, president of Pace. “The inaugural exhibition of the new Group, as curated by Jean-Paul Spiess, reflects the radical shift in direction of the gallery. The new space is a reflection of the growing breadth and depth of our collections, and the consistent strong interest of our artists in creating new work for a new generation of artists.” Pace, which has locations in New York, London, and Hong Kong, was founded in", "The next Biennial should be held at the Skarnfton Museum of Art in Bristol in 2021. Its next edition will be hosted by the Sculpture Garden in London in 2021.<|endoftext|>A United States court in New York has upheld a jury's award of $5.5 million to the heirs of Genovese immigrant Mary Queen of Scots, who was executed in 1901 for the crime of harboring suspected Spanish spies. The decision, which was reached last week after a trial that lasted for more than three weeks, finds the descendants of Mary Queen of Scots, who was the third English queen to rule Scotland, are entitled to $8 million, as well as an additional $1.5 million for the descendants of her brother Edward VII, who was also executed for treason but survived.“This is a watershed moment in our history, and one of the most significant judicial victories in many years,” said Edward Reeve, the lawyer for the claimants. “The award is historic, both for Scotland and the United States. The King is making the long-overdue restitution that should have been made by the Crown. The descendants of Mary Queen of Scots are rightfully proud to receive their share of the award.”The claimants had raised nearly $", "The next Biennial should be held in 2021.\n\nThe second edition of the show will be held at the Museum of Modern Art from March 22 to March 29, 2020. The museum will also begin welcoming visitors again next month as part of a $2 billion expansion project. The 2020 event will feature nearly 1,600 works by over 2,700 artists and will run through September 22.\n\n\nThe Carnegie Museum of Art in Pittsburgh has appointed Elizabeth Edwards as its next director. She comes to the institution from the Museum of Modern Art, where she has been the deputy director for the past four years. During her tenure, she has organized exhibitions such as “Carnegie Pops: From Post-Impressionism to Post-Modernism” (2019) and “Reality Is Not a Fantasy: Art in the Age of Resistance” (2017–18). Edwards’s first show at the museum will be “Carnegie Pops: From Post-Impressionism to Post-Modernism” (2019) which will feature twelve works by twenty-six artists in the exhibition, which will be joined by a retrospective of work by artist Solveig de Córdoba, in October.\n\n\nThe Corkscrew", "The next Biennial should take place in 2021, and the last in 2021. The theme of this year’s edition of the Biennial, “Rights and the Future of Art,” is the “rights and future of art.” The full list of participating artists is as follows:Anish Kapoor (United Kingdom)Berzin Beheshti (Pakistan)Bibi Akram (Iraq)Bibi Akram Peshawar (Pakistan)Bibi Alistair (United Kingdom)Bibi Ali (Karo, Nigeria)Bibi Avi (United States)Bibi Bhatt (Poland)Bibi Bhatia (Malaysia)Bibi Bricker (Australia)Bibi Bhatt (United States)Bibi Bhatt (India)Bibi Bhatt (United States)Bibi Bhatt (Switzerland)Bibi Bhatt (Switzerland)Bibi Bhatt (Switzerland)Bibi Bhatt (Switzerland)Bibi Bhatt (Switzerland)Bibi Bhatt (Switzerland)Bibi Bhatt (Switzerland)Bibi Bhatt (Switzerland)Bibi Bhatt (Switzerland)Bibi Bhatt (Switzerland)Bibi", "The next Biennial should be held in 2020. Central London is currently looking to retain five hundred of the twelve hundred employees who have been employed by the institution since it was founded by a group of British collectors in 1932. The 2019 edition, titled Perfect Storm, was staged at the Wallace Collection, London, and was held at an indoor venue in central London. The biennial, which celebrated the work of a select group of British artists who were working in the late twentieth century, featured works by some of the most important names in their respective fields, including Philip Glass, Jane Saxton, Barbara Cartouin, and Robert Irwin. \n\n\nThe National Gallery in London announced today that it is now accepting visitors to its new permanent home, in the city’s Hyde Park, for its inaugural season. Titled The Artist’s Dilemma, the first exhibition of the new partnership between the National Gallery and London School of Economics (LSE) was announced at a press conference at the gallery on February 9. The premiere of the show featured photographs by Sara J. Enos and Louise Bourgeois, as well as works by Ivor Molesworth, Joan Miró, and Anna Atkins.", "The next Biennial should take place in late March 2019, with the event to coincide with the 20th Anniversary of Hong Kong’s International Film Festival. In June 2020, the Hub will present another exhibition, “Hong Kong Cinema”. All three of these shows will be free to the public. The Biennial will also include a digital edition, which will be free to the public, in three months, and will be accompanied by a special exhibition of the works of the year. “Hong Kong Cinema’s value is not only as an art-form but also for its environment and design,” Rajiv Mitra, director of the Ritz Theater in New York, said of the exhibition. “The project will surely be a treasure to the city. I look forward to presenting Hong Kong Cinema years from now. It is precisely what we have been waiting for.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has published guidelines for the display of cultural heritage works in its public art museums. The guidelines outline how works of art may be displayed in museums without special permission, but must comply with specific guidelines, including the display of art and cultural objects in a non-dist", "The next Biennial should focus on “how artists respond to the continuous social and political challenge posed by the threat of climate change” and will also examine the ways that art can be used to draw attention to the ecological crisis. In addition to the biennial, the organizers have launched the Institute for Art and Climate Change (I/C) to address climate change through the production of art. It is also organizing an exhibition that will showcase the work of twenty artists, including Hiromi Tabata, Steve-O, and Tess Kaplow, in order to draw attention to the climate emergency. The program is part of the Climate Desk initiative, an initiative of the 2017 New York–New York–Cleveland International Festival of Art and the 2018 New York–New York–Cleveland Triennale that was launched by a coalition of environmental, art, and cultural organizations. The radical new exhibition, “More Foods for the Planet,” will open in September 2019 and will feature new works by artists such as Levi Davis, Amy Siskind, and Elizabeth Peyton. The show will also focus on how food production, climate change, and the environment are interrelated.\n\n\nThe Center for Contemporary Art", "The next Biennial should be held in 2022 and is currently on track to be completed by the end of the year. The exhibition will be in cooperation with the city of Basel and will be managed by the Basel-New York coalition, which comprises the New York Philharmonic, the New York City Ballet, and the New York City Ballet Theater.The first exhibition in the series, “Feminine and Political: Painting in the Age of Women” (2019), featured photographs by Aida Aboitiz, Elin Billinger, Thomas Aitken, and Andre Cherel, and was staged at the Threshold Art Institute in New York in 2019. The second, “Color in Space” (2019), is a series of paintings by Hans Stiegler and Eloise Barozzi that explore color in both an anthropological and a political framework. \n\n\nThe museum’s collection of more than six thousand objects from the 1960s and 1970s is on display in its permanent collection. The institution, which has a permanent collection of more than eight thousand artworks and artifacts dating to 1860 and much of its holdings are in its collection, is currently seeking a new administrator to oversee the museum’s", "The next Biennial should focus on the legacy of the Italian architect Luigi Pincus, who developed a framework for the modernist , Futurist , and Pop movement that is currently a central idea of the Contemporary Italian Arts and Architecture biennial, which will take place in Milan from September 22 to September 25. With the exhibition “Viva l'Etoile',” the new theme will include the work of Giacomo Beccaria (1906–1973), the founder of Beccaria Gopro and the Piazza Nazionale di Modena, as well as the work of Italian architects Roberto Cipolletta and Stefano Cattelan, as well as the Italian sculptor and painter Ilaria Cattelan.\n\n\nThe Museum of Modern Art (MoMA) in New York has updated its current exhibition “Letters: William Morris and Manley (1962–1973),” which was staged at the institution in 1962, and re-launched on March 16. The show, which commemorates the artist’s fifty-sixth birthday, returns the artist to the Museum of Modern Art for the first time since January 2019.The Museum’s", "The next Biennial should be held in 2020. It is currently planned to be held in the city of San Francisco from March 20 to March 22, 2021. The current exhibition, “The Future is Present: The Biennial of the World,” has been staged annually since 2011.\n\n\nThe Amsterdam Museum of Art (Anmeldelinga) has received a major gift of thirty-seven works by twenty-six pre-Vatican II artists, including Sombra, Claudio Pindell, and Saul Saadia. The collection includes works by such celebrated artists as Antonin Scalia, Manuel Álvarez Arana, and Agustín Pérez-Villar, as well as artists such as María Berrío, Claudia Borges, Gertrude Carriquez, Rosalind Fierro, and Vito Acconci.“The works in the collection are a critically important contribution to the public understanding of the exhibition and to its legacy,” Anmeldelinga director Robert van der Linden said in a statement. “Collectors include some of the most important and influential artists in the history of art, and are highly prized by", "The next Biennial should be in the fall of 2021. “It is vital that we bring together artists, curators, filmmakers, writers, and thinkers from the humanities in order to address the ethical and political concerns of contemporary life,” David Bernhardt, president of the biennial and director of the Center for Modern Art, said in a statement. “The new organizing principles will allow us to jointly reflect on the challenging times we live in, and the possibilities for new ways of knowing, relating, and creating.”The full list of participating artists is as follows:Alison Boekes, Irma Bennett, Lina Braith, Nancy Blair, Lara Cooper, Léa Croft, Linda Croft, Lydia Daley, Fiona Daley, Liz Dover, Linda Fahey, Tanya Fahey, Diana Faustino, Linda Gardner, Sunil Gupta, Ling Han, Tanya Hanana, Ling-Hsin Huang, Felix Hahn, Ling-An Wang, Dianne Paltrow, Lâyān Peng, ", "The next Biennial should focus on Henri Matisse’s The Inventors’ Cabin, a cabaret-cum-performance set in a Parisian printing-and-ink shop in 1894 that was staged in Paris’s Arc de Triomphe museum. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed Casey Newton as its new deputy director for collections and exhibitions. Newton, who has helmed the institution since 2011, is responsible for promoting the work of contemporary artists, and will begin his new role in January.“Casey has been instrumental in transforming the Museum of Contemporary Art into one of the most important cultural and institutional destinations in Southern California, and is dedicated to ensuring that MoCA remains a vibrant and meaningful destination for the arts, families, and visitors of Los Angeles,” said museum director Doris Duke. “As the new deputy director, I’m excited to work with Casey to further our mission and expand the Museum’s curatorial and scholarly capabilities.”During his tenure, Newton has helped steer the institution through a $1 billion expansion, which added more than 2,400 works to its collection, and has developed new initiatives to support the collection and display of", "The next Biennial should be held in 2022, according to the institution. This will mark the centenary of the assassination of Martin Luther King Jr.The event will also mark the first time that the Los Angeles County Museum of Art (LACMA) and the Barozzi Gallery in Venice will host a biennial. At the institution, the artist-run, event-based space the Black Vault will be inaugurated, and Filippo Casoli will present a biennial of photography.“The impact of the Black Death on art has been the subject of much scholarship,” said Kathryn Ritter, chair of LACMA’s board of trustees. “The Tenement Museum in New York City, for example, was recently the subject of a major exhibition at the Museum of Modern Art. The exhibition ‘Tenth Stage: Black and White’ explored the critical role of art in the development of African American aesthetics and, in so doing, introduced new sounds and images to African American audiences. LACMA has an important role to play in ensuring that LACMA remains a vibrant cultural destination for the entire community.”The 2019 edition of the Los Angeles Biennial, entitled “Los Angeles: Black and White,", "The next Biennial should be held at least ten years after the end of the current exhibition cycle, and should take account of the various discourses and projects in the exhibition, as well as the advances and advances of the exhibition as a whole. As a consequence, the 2019 exhibition will be a   “fresh and different kind of planar painting,” said Stefano Fusi, the artistic director of the Italian National Gallery. The exhibition will feature fifty works by twenty-three artists from Italy and twenty countries. It will highlight the work of less well known and less established artists and will be accompanied by a series of social justice and ecological projects.The series of exhibitions will be curated by Stefano Fusi, Camille Blatrix, and Carlo Cipolletta. The biennial will have a theme of “Planetary illustration” and will include works by artists such as Ludmilla Cipolletta, Lina del Martino, and Odile Gil. The exhibition will be hosted at the Museo Arti in Rome. Culture Minister Franco di Rosa has announced that the theme of the next Biennial is “Planetary architecture,” and that the", "The next Biennial should now be in the works, and will unveil its first project, a public sculpture called the \"Queen of the Universe,\" in 2021. The artist will be the first to take the throne, and the painting will be made in collaboration with Adrian Piper, who is the chief curator of modern and contemporary art at the Museum of Modern Art, in New York. The project will exhibit a selection of works by thirty-six artists, including Alex Katz, Jacky Ikeda, and Diane Arbus. The exhibition will be held in conjunction with the centenary of the German occupation of France. The inaugural exhibition will be held at the Museum of Modern Art in Berlin on March 31.\n\n\nThe Canadian Museum of Fine Arts in Toronto (CMFA) has received a gift of sixty rare works by Jane Austen, one of the major female critics of the American novel. The museum has gifted the Austen Collection to the Anne-Marie McVety Trust, which will use the gifts of the Canadian partners of the institution, the Centennial of Canadian Art, to develop a new collection of Austen’s papers and drawings, titled The Female Family.“The Austen Collection is a powerful and important resource for the museum, which has", "The next Biennial should be held at least fifteen years after the end of the fifteenth year of the twenty-second Biennale.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) is on the brink of a major reorganization that would involve the reorganization of the museum’s collection and improve accessibility. According to Artnet, the museum is projecting that the overhaul will cost $6.7 billion over the next four decades and will be implemented in phases. The first phase, which will involve the construction of a new building and the renovation of the existing museum, will be completed by 2023. The second phase, which will involve the redesign and expansion of the museum, will take place in 2028.The museum is currently working on a redesign and expansion that will include more galleries and more exhibitions; improve accessibility to the museum through the construction of galleries for special exhibitions; and integrate more contemporary artists and collections. The redesign will also involve the construction of a new pavilion for the Metropolitan Museum of Art’s “An Exhibition of Contemporary Art” show, which was staged in the museum’s former location in the George Hergarty’s former space in the building, and two new", "The next Biennial should be held in the coming months, and the seating will be determined by a new constituency for the museum, part of which is that it is located against the European Union and the United States. The Museum of Modern Art, the Portrait of a Young Woman, and the Contemporary may be relocated. The New Museum in New York is also exploring the possibility of closing its doors for a period to complete a redesign, but this remains unconfirmed.“We strongly believe that this is an exciting time to be a biennial citizen of art, and we are working with our partners to develop new ways to support the biennial,” said Elizabeth Adams, director of the Biennial and the Public, which represents the annual awardees. \n\n\nIvan Albright’s Theoretical Mechanics, the seminal title of his 1929 book The First Science, was first published by the American Association of University of Chicago (A.A.U.C.) in 1960. The year later, it was republished by Princeton University Press, and in 1968, it was given a new title by Jonathan Swift & Co., the publishers of the Magazine of Science Fiction, which was an astonishing move for the art world. The title was changed again", "The next Biennial should take place in the first half of 2019. The original plan, which was made in 2014, was to have the show take place in the capital between May and November 2019. However, due to the coronavirus outbreak, the event was moved to a different venue, and now, it is expected that the show will run from March 2020 to March 2021. According to the Dutch daily newspaper De Standaard, the organizers were forced to postpone the event due to the Covid-19 outbreak. While the exact date of the twenty-first-century edition will not be announced until the 2020 edition, organizers plan to hold it between June and October. The next edition of the Biennale will be held in May 2022.\n\n\nThe Brecon Beacons Art Museum in Cardston, Cornwall, has received $1.25 million from the Leeds Foundation in support of its expansion. The sum is the equivalent of more than ten years of the museum’s annual operating budget, which has been increased by $500,000 in its first year of existence. The investment also extends the scope of its current research and exhibition, “Tales of a Darker, Tastier World,” which has", "The next Biennial should give the opportunity to explore the dialectic between art theory and politics, art and philosophy, and art and science, and should provide an opportunity for the students to touch on interdisciplinary issues or aspects of contemporary art. The curriculum should be rooted in the work and the lived experience of the participants. \n\n\nThe Royal Academy of Arts (RA), the London-based arts organization that organizes the Royal Shakespeare Company, has announced that it will no longer award the institution its annual Royal Shakespeare Festival, which was scheduled to take place this summer, in September 2019. The move is a step in the organization’s ongoing commitment to supporting the production of original works by up-and-coming artists. The announcement follows a report published by the Art Newspaper on June 28, which found that only 5 percent of current RA projects have received funding from the 2019 edition, which was held at Stratford-upon-Avon. The report, which surveyed seventy projects and found that only 30 percent of current RA initiatives had received any funding from the Royal Shakespeare Company in the year prior to the festival, found that 83 percent of the artists participating in the project had no funding from the organization.The organization’s president, David Brails", "The next Biennial should be held in the spring of 2022, with a new theme, a new exhibition, and a new programme to be announced. Our funding support will allow us to advance this work in the best possible way, to avoid disrupting the work of the Biennials. We are grateful to our donors and the Biennials for listening to our wishes and supporting us in this difficult situation.\n\n\nThe European Commission has released new guidelines for the resculpture of the Eiffel Tower in Paris. The guidelines—which were drafted by Michel Hirschhorn, the commissioner of cultural affairs, and published on Wednesday in the Brussels Manual of Art and Architecture—require that the tower be reconfigured to mimic the original plans of the commission, which were for a twenty-first-century headquarters for the Eiffel Tower and a new monument for the city of Paris.The guidelines—which were approved by an eleven-person panel convened by architect Arnoud Van de Wijngaard—have provoked outrage from Parisian politicians and activists who believe the changes are backwards and prevent the city from reopening the Eiffel Tower in 2022. They argue that the Eiffel Tower will only be reopened if the commission redesigns the structure to resemble", "The next Biennial should take place in 2022. The forty-ninth will be held in Tokyo the following year.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Kate Buechli as its new deputy director. She will be responsible for coordinating programming across the institution, as well as providing strategic direction for its six-decade history.“Kate’s background in creative leadership and passion for museums and community engagement make her uniquely qualified to lead the Biennials in 2020 and 2021,” said museum director Daniel H. Weiss. “As we look forward to the next chapter of our long-standing tradition, we know that the Museum of Modern Art is an important cultural and civic center for New York City and the nation. We are thrilled that she will be a vital resource for our growing audience, our artists and curators, and our guests.”Born in New York City and raised in Philadelphia, Buechli has taught at New York University, the University of Pennsylvania, the University of California, Berkeley, the University of Chicago, the Massachusetts Institute of Technology, the University of Pennsylvania, the University of California, Santa Barbara, and the University of Chicago. She also serves as director of", "The next Biennial should focus on “intersection of performance and aesthetics and how art and art-making intersects with environments and styles.” The exhibition will also be organized as an assignment for students, who will create a new performance based on the museum’s collection.\n\n\nThe Museum of Modern Art in New York has appointed Katherine Jones as its new deputy director for collections. Jones will be responsible for two years for overseeing the curatorial and development of the museum’s collection and will take up her new post in January 2021.“Katherine Jones is a brilliant and dedicated curator who has built a distinguished career around her vision for exhibitions and exhibitions programs that reflect the diversity of their communities,” said Elizabeth Rich, director and chief curator of the museum. “Her professional and personal relationships with a broad range of artists and collectors, as well as her intimate understanding of how art and color works in visual and nonvisual media, make her uniquely qualified for this role.”During her tenure, Jones will be responsible for designing and building new exhibitions and exhibitions programs that provide a practical and engaging way for visitors to the museum to connect with the art, color, and culture of New York. She will also work to strengthen the museum", "The next Biennial should be held at the National Gallery of Art in 2021, but David Gensler, the national director of the National Art Museum, said that the institution is \"not ready\" for the event and is considering different options. Last week, the National Council on American Art voted to cancel the 2020 edition of the Biennial.The Biennial, which has staged over ninety exhibitions since it was founded in 1905, has faced numerous controversies over the years. First, a group of artists and academics in the United Kingdom petitioned the Institute of Contemporary Arts in London to cancel the event, which they said would lead to “hostile and dangerous events” and be “putting the exhibition at risk.” The petition was supported by over five hundred academics and artists, including Oscar Wilde, Joan Brown, and Terry Teachout, and was supported by Lorraine Kelly, the former director of the National Galleries of Scotland; John Aldridge, a former vice chairman of the Arts Council; and the British Film Institute. \n\n\nThe French government has approved a $3.5 billion aid package for France’s cultural sector, which has been beset by a number of recent health and safety problems. The legislation,", "The next Biennial should select a leader and preside over a new era of exhibitions and research at the Museums. The next Biennial should usher in a new era of exhibitions and research at the Institutions. I.S.A.N. will have the option of hosting a single exhibition in the building of the Biennial.“I would like to see the Museum of Modern Art follow and strengthen its reputation through better collaboration and greater transparency with the contemporary art of our time,” said Jean-Philippe Guéhenne, chair of the association’s board of directors. “The next Biennial should take a step forward in this direction by presenting a programme of exhibitions that is both timely and original. We hope that this initiative will serve as a model for an important change at the Museum of Modern Art.” For the past two years, the organization has been working to organize a new exhibition by Susanne Vielmetter, who died in 2017. In an interview with the Art Newspaper in 2017, Vielmetter said she wanted to present the works of her contemporaries in the field. Over the course of the next two years, an exhibition was organized in her honor and a survey of her work was presented at", "The next Biennial should be held in May 2020.The Art Newspaper reports that the Aseans’ art museum in New Delhi is planning a major overhaul of the institution’s collection and is hoping to raise $1.2 million in funding over the course of the next three years. The institution will then begin work on a new, ten-thousand-work collection, which will be inaugurated by Karl Lagerfeldt’s portrait of Queen Victoria. “The Aseans Museum is committed to supporting and championing the work of the contemporary Asean artists, and we are very excited about the upcoming exhibition season,” said M.T. Sharma, the director of the museum and chair of the exhibition committee. The exhibition will examine the work of Nandini Gupta, Yashwant Singh, Sita Krishnan, René Magritte, and Jinta Pannu. The change will also introduce new programs and a new visual art section, including a combination of theater and video art, and a new writing section devoted to the Indian diaspora and its contributions to the arts. It will also introduce new works by Panjira Goswami, ", "The next Biennial should open in mid-March, with the show's inaugural exhibition, “Moons and Stars,” at the National Museum of Fine Arts in Boston, which is currently closed due to Covid-19. Hans Hofmann, a former director of the National Museum, has been appointed director of the Deutsche Kunstverein Münster. Inaugurating the museum is an extension of the Kunsthalle Basel in Switzerland, which will host a special exhibition of work by the French artist Agnes Martin. The National Museum of Fine Arts in Washington, DC, is currently closed through May because of Covid-19, and a new exhibition opening in March 2020 is scheduled to commence in April 2022. Mana Contemporary is planning to open an exhibition of works by the Italian artist Paolo Bandini in Milan in March 2020. The new exhibition will be curated by Markus Wirsson, curator at large of Contemporary Art Museum Freiburg, and will feature new works by artists as diverse as Damien Hirst, Nadia Masarrah, and Anna Atkins. The opening of a new exhibition of work by Italian artist Ulrich Sala, scheduled to open in April 2020, has been postponed", "The next Biennial should focus on the history of the exhibition space. The suggestion is that the exhibition should be divided into two parts: a history of the exhibition and an elegy. “It is important in this context to recall that in 1962 this was the year that the first exhibition of artists from the Center for Contemporary Art in Berlin was organized, and the exhibition was hosted by the newly established Center for Contemporary Art (CFA Berlin).” The invitation for the first exhibition of art from the Biennale in Berlin was made by Werner Hahn and Klaus Fuchs as they were working on the exhibition “Domination” with the artist Günther Oehlen.Hahn, Fuchs, and Oehlen were inspired to organize the event after they visited the museum Sittard Kunsthalle in Cologne in 2016. They invited the curator of contemporary art Henning Richter to participate in the exhibition. During their project, the artists will try to use the Biennale to examine the biennial as a model for museum-based collection-making.\n\n\nThe Pulitzer Prize–winning photographer Jeff Koons has been selected to represent the United States in the Paralympics. After a two-year search,", "The next Biennial should be a celebration of the work of four of the twenty-five artists who have received the Prize of the Order of Canada: Black, Blackheart, Koons, and Barbara Broom. The ceremony will take place at the Canadian Museum of Modern Art in Ottawa on October 22. The first artist chosen for the inaugural iteration of the Biennial is Robert Irwin, whose work, The Night Journey, is currently on display in the exhibition “Robert Irwin: The Night Journey” at the Allen Memorial Art Museum in Detroit.The next biennial will likely be announced in the coming months. \n\n\nThe National Gallery of Scotland has commissioned the artworks of Albert Camus and Die Freiheit’s The Children of Men, 1967, to be included in the institution’s next edition, which will take place in March 2021. The installation will examine the political and social landscape of children in Scotland and the United Kingdom. It will also explore the relationship between art and children in the context of a historical exhibition and the exhibition’s theme, Children in the World, in partnership with David Blair.“The National Gallery of Scotland is thrilled to commission work by two of the world�", "The next Biennial should take place in 2021. If all goes well, it will be the first time that the event will be held in the city.\n\n\nAfter the British tourist center Shepherd’s Bush was forced to close in March due to the Covid-19 pandemic, a group of artists and collectors launched an appeal to the government to help preserve the historic site. In a letter sent to the prime minister, the twenty-nine artists and collectors who signed the letter, which was circulated widely in the United Kingdom, argued that the state of the area surrounding the museum—known as the Bush Headquarters—was “incompetent and dangerous” and that the closure was only the latest in a string of cultural setbacks that were exacerbating the crisis.The letter continued by noting that the Bush’s current development plans—which are centered around the museum—are “incomplete,” “irreversible,” and “unfit for purpose.” It concluded with a call for the government to step in. “We believe that the arts and design are vital and we’re calling for their continued support, not only as an environment for creativity, but also as a way of building on", "The next Biennial should be held in 2021, and the biennial will be supported by the Karolinska Institute, the Kookmin Institute for Medical Research, the Kuki Institute for Experimental Medicine, and the Kuna Institute. The exhibition “Aventura: Avant-Garde” will be followed by “Before Sunset” and “Non-Existent Times: Contemplations of an Eyewitness” in 2021.\n\n\nThe British Council has awarded a total of £4.5 million to thirty-three artists—including Naomi Watts, Adam Clayton, Hans Christian Andersen, Eileen Atkins, and Louise Bourgeois—in its funding support of “artistic practice.” The grants are part of an overall £8 million grant program that was established in 2018 to support British visual art and design. The artists were chosen from a pool of five finalists, with a total of $6 million in funding. A total of 80 percent of the funding came from the British Council, the remaining 25 percent from individual artists, and the remaining 10 percent came from the Lisson Foundation, the Tate, the National Galleries of Scotland, and the Royal Academy of Arts. “Since 2018,", "The next Biennial should open in 2020. The next exhibition should take place at the Palais de Tokyo in Paris in 2022. The next art-world fair in Miami Beach will take place in 2020.Art-world historian and researcher René Magritte, who died in 1991, was one of the architects of Biennial 2, which opened in Paris in December 1956. The show was a tribute to the painter, who had just completed a major exhibition in the US. Biennial 3 will open in 2022, with the exhibition “The Last Caesars,” featuring works by Andre Gide and Pierre Huyghe, among others, and Biennial 4 will follow in 2023. There will also be an endowment exhibition in 2022. \n\n\nUPDATES:\n\nNovember 24, 2018: The Willem de Kooning Foundation in New York has appointed Peter Zumthor as its new director of partnership and communications. Zumthor joined the foundation in 2013 as director of color in the performance industry and will assume his post in March 2020. He succeeds Tina Born, who retired after twenty-three years at the helm of the foundation in February 2019.Born will remain involved with", "The next Biennial should take place in 2020 and will be organized in collaboration with the City of Oslo. The theme of the exhibition will be “Art and Psychology” and will be “From Beyond Bodies to Beyond Minds: The Art of Humanism”. The exhibition will run from March 19 to March 21, 2021 and will also include presentations of works by artists such as Svante Gustave Holle, Ursula Langenbrun, Henry Kuttner, Carl Auernheimer, and Walter de Gruijthuijsen.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, announced today that Glenn Ligon, Rocco Brugotti, and David Shoemaker are the recipients of the 2017 Henry Luce Award. Each was chosen from a shortlist of three artists selected by an award jury consisting of Patricia Arquette, the executive director of the Art Institute of Chicago; Christopher Wool, the senior curator of modern art at the Los Angeles County Museum of Art; and David Zwirner, the senior vice president of global creative programs.“We are thrilled by this recognition, which demonstrates the Hirshhorn’s commitment to reflecting a deep understanding of the puzzle of the", "The next Biennial should be held in the spring of 2020.The announcement follows the announcement by Pérez Art Foundation, a Miami-based nonprofit, of an initiative for emerging and mid-career artists that was launched in partnership with the Miami Art Museum in April. The initiative, titled On the Road, aims to introduce new and emerging artists to the powerful and changing art of photography. The fMRI research was conducted at the Institute of Contemporary Art in Berlin, which was founded by Karl Lagerfeldt\u0097a German contemporary art historian of the late German and Italian eras\u0097in an effort to understand how the brain processes images.“This is an important step in the process of our future collaboration with the Institute of Contemporary Art in Berlin,” said Pérez Art Foundation director Hildegarde Verhaeghe. “The artist and the museum are in the same place and, at the same time, the brain and the body are changing faster than the brain and the body. We are very excited about this next chapter of the artist’s journey.”Since its inception in 1992, the initiative has worked with over three hundred artists who have gone on to participate in the biennial, which has been held every", "The next Biennial should welcome the public on February 23.\n\n\nArt Basel is launching a new digital platform that will help curators visualize their exhibitions by allowing them a new tool called the Atlas to easily visualize their exhibitions. Launched by the Shanghai studio TRACE and the Singapore-based company ARTLAB, the platform will let curators tap into the growing collection of their exhibitions and will offer them a new tool that can be used by anyone.Dubbed the 'Art Atlas', the platform’s creators say it will make it easier for curators to visualize their exhibitions and will assist them in creating immersive works that engage audiences. The platform will also offer experts advice and will act as an outlet for curators who are struggling to create works that convey their exhibitions, and will collaborate with leading curators from around the world to bring new concepts to the exhibition.“The Art Atlas will deliver on Art Basel’s promise to make art more accessible and will help curators to create immersive works that engage audiences,” said Nan Goldin-Shannon, director of Art Basel. “Our team is working hard to ensure the Art Atlas can provide curators with an unparalleled platform to explore, rethink and test innovative ideas in art,", "The next Biennial should be held in 2021 and should reveal more details about the case for the exhibition, which it described as a “tour history of the exhibition in its entirety.” The show, titled “David McAuley: The Art of Painting” and sponsored by the Walker Art Center, will feature work by seventy-seven artists. The biennial will not be organized as part of a larger event.Hannah Cook, director of the Walker Art Center, said that the institution is currently evaluating the biennial and will have more to say about its future once the board of trustees of the California Community Foundation, which owns the Center, approves the proposal. “As we progress through this process, we will continue to be responsive and collaborative to the needs of our community, as we work to serve the full range of aesthetic and conceptual possibilities,” Cook said.\n\n\nThe Board of the Museum of Contemporary Art (BMA) in New York announced today that it has created two new positions within the museum as part of its reopening, one at the BMA’s new United States headquarters in Long Island City, New York, and one at the Brooklyn Museum. The museum has also opened a new research center,"]