["The next Biennial should be in March 2020, but I sincerely hope that the project will be completed by March 2021.It will give the museum an opportunity to achieve a more accurate and comprehensive representation of the exhibitions that have been staged, as well as to include the most important works from the collection in exhibitions that will be organized in a more intelligent way.I am also deeply pleased to be able to play a part in the future of the Biennial, as I have been an organiser since its inception. The museum is one of the most important cultural institutions in the city and the city of London is a vital platform for our artistic and cultural activities.Since the Biennials will be a joint project between the local authorities and the Museum of London, it will benefit enormously from the Museum’s expertise and knowledge. I look forward to developing a strategy for the future of the museum that will benefit both the museum and the community.The dates of the inaugural exhibition are as follows:October 29: The Biennial, LondonOctober 29: The Biennial, LondonOctober 31: The Biennials, LondonNovember 2: The Biennials, LondonDecember 8: The Biennials, LondonJanuary 18: The Biennials, London", "The next Biennial should take place in December 2020 and will organize a new exhibition through the same institution as the first one. In an internet interview with Artnet, the organizer of the biennial, Oksana Chuhrou, said: “We have always wanted to create more immersive exhibitions, not only for Biennials, but also for local audiences. This is what we have done for twenty years, in cooperation with the local and international artists.”The next edition of the Museum Biennials will be held at the Geffen Contemporary Art Museum Munich from October 20 to October 26. The first exhibition will feature works by more than seventy artists and will explore the themes of the biennial, “Forms as Forms,” which will be curated by Sabine Halsmann, the director of the Museum Salzburg. In the second exhibition, titled “New Forms,” the biennial’s creative director, Ott de Grood, will present his first solo exhibition since his departure from the institution in 2019. The third exhibition will be a collaboration between the Museum Salzburg and the artist-run creative project the Rebecca Group, which will present two works by the artist Jan and will have a total running price of", "The next Biennial should be held in 2021.\n\n\nThe National Gallery in London announced today that Maria Pistoletti has been appointed as its new chief executive and director, effective immediately. Pistortti will be responsible for leading the gallery through its transition to a new leadership, led by Amanda Holden, and will take up her new post in January. “Pistortti’s appointment represents an exciting new chapter at the National Gallery, which we are all very proud of,” said Neil Blair, chairman of the board of trustees and a former director of the gallery. “It’s a particularly exciting time for the gallery as it enters a new chapter, one that will enable it to re-emerge as an important international centre for art. It’s also a time of great change for the gallery, which is preparing for its first renovation in twenty-five years with the launch of the National Gallery Fund. We are all excited to see where this new vision will take the gallery.Maria’s role as chief executive and director will be heavily influenced by her history as a leading arts administrator and advocate for research-based solutions for the collection, presentation and conservation of art. During her tenure at the National Gallery,", "The next Biennial should take place in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced that it has received a gift from the artist Chris Burnham: a fifteen-foot-tall bronze sculpture by Burnham that will be placed at the center of the museum’s new exhibition, “Art on Paper,” as part of the museum’s renovation of the building. The work, which was created on one side of the facility, will be reflective of the museum’s new format: five exhibitions will be presented in a single year.“Chris Burnham is an international artist whose work explores themes of memory, memory of art, memory of the past, memory of cities, and memory of the future,” said Lisa Pemberton, chair of the institution’s board of trustees. “As part of the renovation, he put forth the idea to create a sculpture that relates to the theme of our new exhibition. The result is a sculpture that is both wildly original and profoundly moving.” The work, titled “Cultural Memory,” was created in 1988 by Burnham, who is known for his collages and interpretive paintings that are meticulously documented", "The next Biennial should take place in the spring of 2020. The inaugural exhibition, “Greater Self,” will be the last, and will be organized as a collective project with the collaboration of the entire team at the museum. The program will be inaugurated by the exhibition “The Process of Creation:” and will run for twelve months.The biennial will be divided into a series of narratives, each involving a single artist. The first half of the biennial will focused on the artist’s transfigurations and their relation to creation; the second half will be about the artist’s ongoing presence in the body politic and its relation to the cultural sphere in a contemporary setting.The exhibition “The Body,” will feature work by more than thirty artists, including Wolfgang Paalen, Pierre Léger, Tarek Atoui, and Nari Warda, and will open on November 18, 2020. Titled “The Body,” is curated by artist and biennial contributor Lutz Bacher; the work of the rest of the group is curated by the artist and curator Wolfgang Schäfer; and the exhibition’s inaugural exhibition, “The Essential Self,”", "The next Biennial should focus on how the ongoing and unprecedented global health crisis might be interwoven into and reflected in the permanent collections of the institution. It should also consider the unique role of biennials in guiding cultural and social development, and in facilitating intercultural exchange and in providing a platform for critical reflection.”The 2020 exhibition will be curated by Olivier Fofana, the former director of the Biennale d'Honneur (2011), and will exhibit the work of twenty-nine artists, including Mairead Corrigan, Tina Bittman, and Ela Cipolletta, who will share their visions of how the environment can be changed to benefit and uplift society. Among the works on display are “Culture and Life in the Middle East: Aya Alireza” (2014), an installation by Alireza, with the work and the original works of each participant being placed into exhibitions by the Biennale; and “Dina Ertürk” (2011), a live performance by Ertürk, a Turkish artist, and the pilgrim Abdullah Özalp, which was staged in Istanbul to mark the seventy-fifth anniversary of the Turkish Republic", "The next Biennial should be held in 2020 and the next is currently scheduled for 2021. \n\n\nIn a new report released by the Museum of Fine Arts Detroit, the Museum Board of Trustees voted to increase the museum’s annual operating budget by $2 million. The increase was made in light of the museum’s expected $3.5 million decrease in funding as a result of the Covid-19 pandemic.“While the board is pleased with the results of the financial year 2020, we recognize that this represents a significant increase over the $1.5 million requested for the previous two years,” said Board Chair Matt Carter. “We believe this is a significant step toward meeting the needs of our community and are confident that it will result in an‎ improved financial outlook for the institution.”The board also agreed to extend the institution’s lease for an additional twenty years, to 2022. The extension will also allow the museum to open on the Michigan west side in 2021. The museum currently has a twenty-three-story lease at the Woodward Building, which is slated to be demolished in 2026.\n\n\nThe American Ballet Theater (BALT) in New York has ordered the return", "The next Biennial should be held in 2022. The schedule is as follows:January 3–January 8: Midsummer Night Celebration, London.March 13–March 21: Hors d’Allemand, Paris.March 22–March 29: Marvelous Britain, London.March 29–March 31: 2017 Arts and Design Biennial, Brighton.March 31–March 3: The Arts and Design Biennial, London.March 3–March 5: The Arts and Design Biennial, London.March 5–March 8: 2017 Arts and Design Shortlisted, London.March 6–March 12: The Arts and Design Shortlisted, London.March 12–March 14: 2017 Arts and Design Arts and Design Shortlisted, London.March 14–March 13: 2017 Art and Design Shortlisted, London. March 14–March 16: Art and Design Arts and Design Shortlisted, London. March 16–March 18: 2017 Art and Design Arts and Design Shortlisted, London.March 16–March 19: 2017 Art and Design Shortlisted, London. March 12–March 14: 2017 Art", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) has released most of its membership dues for the 2019/2020 academic year, and the institution has received a total of $80 million from the sale of works since Queen Elizabeth II stepped down from the throne in February 2019.The sale of works is the mainstay of the museum’s annual fundraising campaign, which also includes the purchase of works by artists such as Robert Irwin and Carlos- Carlos Ezquerra, the latter of whom will be included in a new exhibition dedicated to the late British photographer. The work of American artist D. H. Lawrence also made its debut at the institution last fall.The proceeds from the sales are divided among museums and charitable organizations that benefit from the sales, which often feature works by artists whose works are on display in special exhibition halls that are open to the public. One-third of the proceeds were donated to the National Gallery of Art; the other-third to the Tate and the National Portrait Gallery. The institution also received a $6 million donation from the family of American artist Jack Durand, who passed away in November 2019 at the age of eighty-eight.\n\n\nThe Soufan Group, which owns the", "The next Biennial should be held in 2020.\n\n\nThe Berlin Architectural Biennale is facing another controversy over a controversial painting that was included in the exhibition’s first edition, “Theater of Operations: The Gulf Wars 1991–2011,” which opened on March 4. In the work, entitled Assassination, 2014, the artist depicts the aftermath of the Gulf Wars and their aftermaths, as well as the ongoing crisis in Gaza.The controversy over the piece comes as the committee overseeing the upcoming edition of the Berlin Art Triennale, which will take place from September 16 to September 18, begins its search for a new location for the event, which has been moving forward at a rapid pace due to the coronavirus outbreak. The art-world gathering, which has already faced protests from some artists who are boycotting the event, is currently being held at the Nationalgalerie in Berlin.While the artistic doors of the venues are still closed for the better part of a week, the German parliament has approved a temporary extension of the exhibition, which is currently on hold because of the Covid-19 outbreak. According to the Art Newspaper, the parliament passed a law on Monday allowing the exhibition to proceed as planned. The law also", "The next Biennial should take place in 2020.\n\nA number of museums have announced that they will not participate in the 2020 event, which has been canceled since March due to the Covid-19 pandemic. Among the institutions that have canceled next year’s event are the Museum of Fine Arts, Houston, which announced that it would hold an exhibition “in the not-too-distant future,” and the Metropolitan Museum of Art, which has yet to make a decision about how it will proceed with the event.“The Met is not yet able to determine the timeline for the exhibition, which will take up the theme of the museum’s renovation work, ‘The Met,’” and will need the cooperation of the participating institutions to complete the project,” the museum said in a statement. “We deeply appreciate the opportunity to answer the question ‘What is the Met’s relationship with the city and, more importantly, with the people of Chicago, as it relates to the renovation of the Met?”The Met also announced on Thursday that it is reviewing the role of the Met Board of Directors in its reorganization. The review was sparked by the city’s request for", "The next Biennial should focus on the dynamics of migration and the construction of identity in public spaces across Paris, and should be presented in March 2021. \n\n\nThe MFA in London has received a gift of more than 2,000 works from the French-American artist Agnès Villebon. The gilt-blond American painter, whose American-born mother was the founder of the American publishing house MCA, also donated one thousand works from her own collection to the center. The sum is a record for the institution, which recently celebrated its fifteenth year with a retrospective of the artist’s work titled Villebon: A Retrospective (2019).The gift includes paintings by Villebon’s mother, Rosalind Villebon, as well as works by her own daughter, Jean-Michel Villebon, and her son, Claudel Villebon, as well as reprints of the artist’s works, including her Abraham Lincoln: Blood Meridian (2018), a collage of ten paintings by the artist’s deceased daughter, Mary Villebon, and her granddaughter, Claudel Villebon. In addition, the museum received a rare set of the artist’s", "The next Biennial should be announced by May 2020 and will be attended by an audience of 3000.\n\n\nThe Los Angeles County Museum of Art (LACMA) has released its list of twenty-eight artists whose work will be featured in “The Art of Painting: From Studio to Studio” (2019), its follow-up exhibition that opened in the museum on November 24. Titled “Human Form,” the exhibition will be revised and expanded by artist-in-residence Wayne Koestenbaum and will be led by David Adjay, who has served as a guest artist in LACMA since 2013.“The Art of Painting” was founded by David Adjay and Mary Beth Clancy after their daughter, Sari, gave birth to their son, Adam, in 2008. Their work is housed in the collections of the Los Angeles County Museum of Art (LACMA), the Los Angeles County Museum of Art (LACMA), the Los Angeles County Museum of Art (LACMA), and the Metropolitan Museum of Art. Adam and Sari Clancy are the founders of the duo duo duo Pia and Ipe Quarles, which specializes in painting on paper. Pia and Ipe Qu", "The next Biennial should feature new work from the artist-run committee. The select panel has yet to reveal the theme. As a result, the 2019 edition will have a more contemporary vision by focusing on issues that are more timely—such as climate change and health—than previous iterations. In a statement, the exhibition said: “The future of our planet and our species hangs in the balance. It is our job as curators, as creatives, as organizers, and as human beings to shape that future.”The museum will also recast the museum’s current collection in order to increase its exhibition space and to create an exhibition of the artist’s work on view in the exhibition “Exhibition: The Americano,” which will open in the museum on January 30, 2020. The artist-run committee comprises Mada De Nardo, director of the Museum of Contemporary Art, Philadelphia; illustrator, writer, and curator Kiki Smith; and Tania DeSousa, the founder of Nerve Media. DeNardo said the project was inspired by the opening of an exhibition at the Museum of Contemporary Art, Los Angeles, in 2001—a retrospective of the work of Kiki", "The next Biennial should have been held in the spring of 2020. However, due to the coronavirus outbreak, the festival was postponed until the end of March. Speaking at a press conference, Herman Van Tilborgh, chairman of the Dutch pavilion, said: “We are extremely disappointed. To be honest, we expected better from the organisers this year. The performance will be missed by all who have been invited to the exhibition.” He added that, in the meantime, the festival will continue as planned, with the same production values, and will deliver an exhibition of the works of the biennial’s artists. The works featured in the exhibition are as follows:\n\n\nThe National Geographic Society’s upcoming exhibition “In the Face of Evil,” which will feature war and peace art from a selection of fifty artists, has been canceled because of concerns over the coronavirus. The September 6 exhibition, which was initially supposed to run from September 7 to September 10, has since been rescheduled and will now be held at the National Museum of Art in Washington, DC.The cancellation has forced a change of plans for several galleries and museums. “The exhibition was originally scheduled to open in August", "The next Biennial should plan to focus on a specific theme, such as the history of the Russian city of Borodino © Aleksey Piont, GFK, 2016. The next one should focus on a singular work or an artist, such as Hrvoje Zverev’s The Red Room, 2017. The next one should focus on the exhibition of a single work, such as the work by Flemish artist Simon Hoult, which was exhibited at the Venice Biennale in 1999.\n\n\nThe Philadelphia Museum of Art (PMA) has received a stunning gift of more than a thousand artworks and artifacts from the Tilton Museum of Art in West Philadelphia. The gift includes a rare set of Pompeii’s monumental sculptures, one of the largest collections of the ancient Italian city, and a collection of early modern paintings in the United States.The Pompeii Art Museum and the Tilton Museum have been collaborating on this project, which will span multiple campuses, since 2016. The gift includes a rare set of Pompeii’s monumental sculptures, one of the largest collections of the ancient Italian city, and a collection of early modern paintings in the United States.“The Pompeii Art Museum and the", "The next Biennial should be up and running by the end of the year. If all goes according to plan, the exhibition will stretch to October 29. If it doesn't, December 2020 will see the first phase of the biennial, entitled \"We Are Not Machines. And We Are Not Enough. ”\n\n\nLos Angeles’s Asian Art Museum (LA MoMA) has removed a work by Japanese artist Yoichi Masuda from its exhibition “Aspects of the Dream,” due to the institution’s association with a Japanese war criminal. The museum’s director, Barbara Morrill, announced the news in a statement on the museum’s website on Thursday, March 7.According to her, the museum decided to remove the work after concluding that “[Masuda’s] sculptures degraded the memory of the 9/11 victims and made their voices unrecognizable.” She also said that “[Masuda] does not represent a contemporary presence in art and he does not reflect the values and the path of LA MoMA.”The museum initially gave the artist three weeks to remove the work. However, on Friday, March 8, the museum retracted its", "The next Biennial should be held in 2020.The next year, the institution will hold a special exhibition of work on paper and sculpture, with a particular focus on the history of the medium, led by a select group of international and local artists, entitled “The Future is Paper” (artistic program 2018).  “The Future is Paper” will be open to the public from May 28 to May 29, 2020, with a preview offering at the end of May.\n\n\nAfter a year of fundraising, the New York City Department of Cultural Affairs (DCLA) has announced a $500,000 grant to the Museum of Modern Art to commission a new work by artist Grace Potter. The commission, which was first announced this spring, will be a forty-eight-foot-by-eight-foot image of the novelist Betty Bernadotte’s Cecilia Bernadotte: A Shade in Time, a show about the influence of the artist’s nude drawings, which are often considered the earliest works she produced.Curated by John Giorno and featuring work by more than sixty artists—including Cliff Richard, Hélio Olmi, and Olu Ochotipa—the exhibition will", "The next Biennial should be held in 2022 and the tenth in 2020. The first cycle will feature fourteen artists, and the second, which will take place in 2021, will feature twenty-two artists. Artforum will announce more information about the program at a later date.\n\n\nThe Asian Art Museum (AAMD) in Beijing has received a gift of seventy-nine works by seventy-nine artists from a group that includes artists from Japan, China, Korea, Taiwan, and the United States. The museum has also purchased sixty artworks by thirty-two artists.The gift includes works by thirty-eight artists from twenty-seven countries, including Thailand, Korea, China, Japan, and Russia. The works acquired by the institution include works by Ailishakhani, Guadalcanal (Mexico), Dandong Shi (China), Stuarts (India), and Tanjung (Taiwan).The gift also includes ten manuscripts by the East Indian painter Manal Kata, whose work is a part of a series that includes works by Hong Kong artist Kim Sook-sung, the Chinese-born, Brooklyn-based artist Zhou Enli, and the Japanese photographer Tsuda Nagao. The museum will display these works in the institution�", "The next Biennial should be held in Dubai as soon as possible. The exhibition will feature works by ten artists from twelve countries and will be held at the Dubai Art Museum (DAM), the UAE’s national museum, from November 27 to December 3 and at the Sharjah Art Foundation, the UAE from December 3 to December 10. “This year’s exhibition is the largest exhibition of its kind at the museum, and represents a new chapter in our history,” said Abu Elissa, the director of DAM. “The exhibition was developed and designed by our curators, Nima Arsht and Uwe Wegen, and is inspired by the international nature of contemporary life, a theme that will be central for our 2015 exhibition. We are extremely excited to open the exhibition and see all of our artists’ work in person.”\n\n\nThe Metropolitan Museum of Art (MoA) in New York is set to reopen next week following a $30 million expansion in both volume and scale. The $500 million expansion, which will also improve accessibility, adds more than 4,300 square feet of exhibition space to the museum, which opened on the sixth floor of the historic Rockefeller Center in 2015.The Met", "The next Biennial should be held in the coming months. In an attempt to create a new set of contemporary exhibitions that would be more accessible to the general public, the institution will be retrofitted with a new glass-enclosed pavilion designed by the renowned Italian architect Dario Catellani, which will be inaugurated in September 2019.The curated exhibition “The Breakaway Pieces” will be on view for thirty days only, from May 2 to May 6, 2020, at the end of a ten-month construction and renovation cycle. The exhibition, which is based on the works of thirty-six artists, will culminate with the performance of a new work by the artist-in-residence, María Berrada, who is currently a third-year student at the Museum of Modern Art. The work, entitled The Chain of Reconciliation, will focus on the history of art and the construction of authoritarian regimes.“We are so excited to see how the Biennial will evolve and to continue to present innovative and challenging exhibitions that reflect the passions and creativity of the diverse artists whose works are included in this year’s exhibition series,” said Mark Delucchi, director of the Museum of Modern Art.\n\n", "The next Biennial should be held in 2020, the European space said, and a second edition in 2021. It is also planning to stage a biennial in Los Angeles in 2021, and a second edition in the city in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) New York has announced that Gerald Kander will be the next director. Kander joins the institution from the Metropolitan Museum of Art (MoCA) in New York, where he has served as a curator of contemporary art since 2007. He will assume his responsibilities on December 16.“While Kander is known for his ambitious curatorial projects, his own personal artistic practice, and his long-held ambition to bring new art to the museum, his tenure also marks a moment of transformation for the museum,” said Kristina F. Kallman, executive director of the museum. “He has the opportunity to shape the museum’s future through a visionary and forward-thinking approach to contemporary art.”Kander was nominated for a MacArthur \"Genius\" Grant earlier this year, and was awarded his first at-the-time MacArthur Fellowship in June. Previously, Kander worked as a curatorial assistant at the Museum of Contemporary Art in San Francisco,", "The next Biennial should take place in April 2021. \n\n\nThe Shandong Biennial of Arts and Design (SBAD) in China has announced that it will return to the Shandong Art Museum in Beijing in April 2020. The decision was made after it received a proposal from the original organizers of the museum, who were eager to continue hosting events and exhibiting works from the exhibition, which was held at the museum from March 29 to March 31, 2019, and was organized in partnership with the public.The exhibition included work by some 70 artists from eight countries and 13 countries outside of China. The exhibition was also marked by the exchange of works between the artist and French curator Jules-Anne Dubois. Dubois acquired the works from the Shandong Art Museum in 2015 and arranged them for the show, which gained its first international participation in the exhibition in 2013. “We highly commended the Shandong Art Museum for its dedication and creativity in supporting this exhibition with our Exhibition series and our exhibition program, and in supporting the exhibition by conducting the international exhibition at the same location in 2016,” said Park Chan-kyong, the president of the Shandong Art Museum. Commenting on the", "The next Biennial should be held at Venice in 2021. The project will then move to the city of Venice, where it will attempt to grow from a collection of approximately 2,500 works to a larger collection and will begin organizing exhibitions from the collection's archive.The exhibition will be housed in the Museo de Arte Contemporáneo (MAS) in Milan. The exhibition will also feature the works of modern and contemporary artists such as Yinka Shonibare, Raye Smith, and Marc-Antoine Verne, among others. The Biennial will be organized as follows: The exhibition will showcase the work of 100 artists from the collection, including Yoshitomo Sanada, Renata Castellani, Andrea Giunta, Benedict Ghebaly, and Tomás González.The exhibition will also feature the work of forty-eight artists from the collection, including Eric Fischl, Louise Bourgeois, Thee Jorgensen, Susan Sijoux, and Marta Kudacki.\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles is working with the Los Angeles County Museum of Art", "The next Biennial should take place in 2020 and the first one in 2021. The selection committee comprises Sara Fischer, director of the Museum Freiburg in Germany; Thomas Frieden, director of the Neue Galerie Kunsthaus Berlin; María Berrada, director of the Retreat in the Alps in Argentina; Kazimir Kording, director of the Institute of Contemporary Art, Prague; and Arne M. Štębik, director of the Lemaire Museum, in Budapest. The 2019 edition in Prague (Dusan Jakubowicz) was staged by the Prague–based ensemble Kiel-Wenckl, which also represented the Czech Republic. \n\n\nThe National Museum of the African Diaspora (MoAD) in Washington, DC, has named Ruth M. Johnson the next director. Johnson succeeds Charles A. Barber, who retired in May after seventeen years at the helm of the institution. She succeeds Barbara Singer, who has served as director of the Smithsonian American Art Museum since 2009, and will take up the post in January 2020.“We are extremely excited to welcome Ruth on to the staff and board of MoAD,” Barber said in a", "The next Biennial should be an extension of the theme “Human Nature.” The exhibition will include works by forty-five artists in a series that will address themes of man-made and natural catastrophes such as the risks of climate change, the history of the disease, and the effects of drugs and violence.“The new edition of the Biennial will not only benefit from the talented and eclectic team of curators and artists working together across the disciplines of art, architecture, design, photography, performance, performance and installation, but will also be a celebration of the vitality and creative potential of all our arts and professions,” said Tanya Stepp, director of the Venice Biennale.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is planning to raise $1 billion for its renovation and expansion plans as it continues to lose money on the construction of its new $650 million headquarters. The announcement follows artnet’s report that showed MoMA in an article titled “MoMA: The Big Move.” The article argues that the museum is moving beyond its original goal of opening a new $1 billion museum and instead is focusing on developing a new series of exhibitions and public", "The next Biennial should begin in early 2021, with a Design Fund exhibition slated to open in early 2022. The London-based organization was founded by Alexander Calder, the British architect ‎Neurotica’s founder, and philanthropist Alan Williams, in 1994 to promote the work of British and American artists. In the same year, the British artist Frank Gehry unveiled his first public work, an unfinished seventeenth-century Georgian chapel, in New York.In a letter dated March 3, 2018, Cherono wrote: “The Biennial has been the driving force behind a new kind of art and design in England. I have been privileged to work with and oversee both of them. I have never felt more involved in the creative process in my life. They have been my heroes since I began designing, and I continue to design. I have always found that engagement in the art world was the only constant in my life.”\n\n\nThe Art Newspaper, a British daily newspaper founded in London in 1976, has been taken over by a group of artists and activists led by artist Shimon Black. They allege that the newspaper has repeatedly published a pro-Palestinian bias and has been pressured to alter articles in support of", "The next Biennial should be staged at the Museum of Modern Art, New York, in 2021. \n\n\nThe Metropolitan Museum of Art in New York announced today that it plans to remove all fifty-two works by Richard Diebenkorn, the German-born, Swiss-born American painter who rose to prominence in the late 1960s and early 1970s, from its collection. The move was prompted by a catalog of works that was published by the museum in 2016.In a statement, the Met said: “With regret, we are removing these works from public view. They are not in a position to argue for their continued exhibition. The work could be repaired, in fact it may already be the case, but its presence is a reminder of the fragility of the art world and the precariousness of the art market.”The decision to remove the works from the museum was made in collaboration with the Los Angeles County Museum of Art (LACMA). LACMA director Elizabeth Miller said: “This is the right thing to do. The work is no longer relevant to the museum. We cannot risk the future of the collection by showing this work, which is a classic, reappraisal of what art can be.”The", "The next Biennial should be initiated in 2020 and will be held at the Museum of Contemporary Art, Boston. The theme will be “The Crossroads of Cultures: Representations and Alias in Oscar Niemeyer” The show will include work by forty-six artists, including Robert Lopez, Lucio Fontana, and Igmar Berg, and will be staged in the form of a documentary. The exhibition will also include a new form of active collaboration between the museum and local organizers in an effort to provide a forum for dialogue and reflection on contemporary issues. The collaboration will feature a new installation and fifty-four photographs by forty-three artists.Speaking about the collaboration, Andrew Kann, the executive director of the Modern Art Museum, said: “Today we are pleased to launch the biennial The Crossroads of Cultures: Representations and Alias. The exhibition will present the work of forty-six artists in an effort to show the global effects of Oscar Niemeyer’s work. We are also delighted to introduce the new collaborative platform The Narrative, which will allow the artists to create a narrative around their work.”\n\n\nThe Metropolitan Museum of Art in New York has received a $1 million donation", "The next Biennial should coincide with the opening of the new museum. The project will be led by curator Karin Starkmann and will be designed by the Danish designer Petra Gade. The new museum will be inaugurated with a public exhibition of works by Evelyn Bradley. The exhibition will include works from the exhibition “Affects of Light,” which runs through January 27, 2020. The show will also present a selection of Peterson’s works from the collection of New York’s Flemish Galleries.\n\n\nThe Eastman Museum of Art in New York has received a gift of twenty-nine workstations by American artist Edgar Rice Burroughs, a pioneer of American painting and a major influence on the American avant-garde. The gift includes four hundred works by the artist in a double set dating from the mid-sixties. The works were donated by a group of donors who called themselves the 'Edgar Rice Burroughs for Art Fund.”According to the New York Times, the foundation is promoting the work of the artist as a “golden standard.” Founded in 2008 by the artist’s son, Michael, and his wife, Sue, the foundation received a", "The next Biennial should take place in 2020 and will be hosted at a location yet to be determined.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Denise Ochoa as its new curator of modern and contemporary art. Ochoa currently serves as curator and director of the $4 billion museum, which is located in the former Manchester United football club’s old home, the Manchester Exhibition and Conference Centre (MECC), and has helmed the museum since 2015.“Denise is a curator and scholar with a passion for art and people, and a passion for supporting artists,” said Elizabeth A. Wolfram, chair of the board of trustees. “We look forward to working with her in support of the museum’s transdisciplinary program and in supporting the museum’s mission to explore, question, and expand the role of art and ideas in modern and contemporary life.”Prior to joining the MFA, Ochoa was a curator at the Museum of Contemporary Art, Los Angeles (LA MoCA); curator at the Museum of Modern Art, Chicago (MMA); associate curator at the Museum of Contemporary Art, New York (MCA); and curator at the Museum of Contemporary Art", "The next Biennial should focus on the evolution of a new kind of critical distance between art and politics. We must continue to demand that the policies and institutions that shape our lives be shaped by art, that the debates about art be taken seriously, and that the work be shared with the public. We can and must do more.”\n\n\nThe Institute of Contemporary Arts (ICA) in London has announced that it will close indefinitely due to the coronavirus. The institute’s new chairman, Robert Whittlesey, said that the closure will “put the future of the ICA in jeopardy.” In a statement, he said: “ICA has been working with the team and board for almost two weeks to assess the current situation and arrive at a decision that is in the best interests of the ICA and the wider art world. ICA will shortly be reopened with a new team, new board members and new members.”Whittlesey added that the decision to close the museum was made following consultations with the board of trustees and staff, as well as with the ICA’s current board, which comprises five representatives from the museums and five representatives from the ICA’s membership.Whittles", "The next Biennial should take place in 2020. The 2020 edition will comprise three chapters, entitled A Future Free of Pain, Casualties of War, and Blood on the Sky. The following year, Bamako, Bamako, and Bamako 2.0 will be staged in the same cities.“I am delighted to welcome the next generation of artists to the gallery. The Biennial of Forms will be a platform to raise awareness, celebration, and inspiration for the many cutting-edge artists who have made a difference in the fight against cancer,” said Monja Böhm, artistic director of the Biennial of Forms and curator of the exhibition “A Future Free of Pain” at the gallery. In addition to the next Biennial of Forms, the museum will also stage the exhibition “A Future Without Pain” in January 2021, with David H. Koch, the CEO of Koch Industries, and the artist Tarek Atou, and will stage the film “Pan and The Family,” in March 2022, and the exhibition “Shah Rukh Khan: the Art of Illusion” in June 2022. In order to secure the", "The next Biennial should take the theme 'The Last Days of our World,” which the museum has been working on for nearly six years with a budget of $8 million. The theme is a reference to the final days of the twentieth century. The US-based, international nonprofit Artforum is funding the $1.2 million programme, which will assemble the work of around ninety artists, including Masouda Akram, Janine Gibson, and Valerie Morgan, among others.The annual event, which was launched in 1993 by Barbara Walters and John Simon Guggenheim, has been staged in fifteen cities across the United States and Europe. The twenty-fourth iteration of the exhibition will return to the Mall of Americas in Miami Beach in March 2020.\n\n\nThe museum where artist Shepard Fairey is housed after he was fatally stabbed by a private security guard in New York on Friday is facing a legal complaint from the estate of the late British painter Noel Gill, who was eight years his junior. The estate alleges that the New York Police Department (NYPD) used excessive force when it arrested the artist at the Javits Center on May 29, following a dispute with a security guard over a ticket.The estate also alleges that the NYPD failed to secure the", "The next Biennial should be held in the US next year, and this year’s edition will feature works by seventy-nine artists from eighteen countries, including Japan, Korea, and France. The 2020 theme is “Opportunities for Transformation.”\n\n\nThe Metropolitan Museum of Art in New York has received a gift of forty-four works from a group of collectors that included work by artists such as Louise Bourgeois, Pierre-Auguste Renoir, and Gioncarlo, among others whose works are currently on display in the museum’s new launch center. The gift includes thirteen works by Pierre-Auguste Renoir, a French artist whose works have been on display for the last twelve years; a work by the late Mexican painter León Rosales; and a work by the late American painter Walter deGook.Other works in the collection are works by Annie Clayton, Kin-Man Tsu, and other American artists whose works are currently on display, and a collection of works by J. M. Barrie and Mark Rothko. The museum also revealed that it plans to build a new exhibition space, dubbed the Village Gallery, in the museum’s former space in the Roesler Building, near Central Park,", "The next Biennial should—according to the organizers—take place in the semi-autonomous region of Tajikistan in the Central Asian nation. Tajikistan, which was recognized by the United States in 1993, has been experiencing severe food shortages since March, leaving many in the country without enough food to eat. The biennial is being organized with the help of a team comprising scholars, artists, journalists, legal experts, and other experts drawn from a pool of more than 3,500. The selection committee comprises two members who are appointed by the president and a group of independent experts. The chairman of the selection committee, A.J. Skubin, is a professor at Harvard University and a former director of the Baker Center for International Affairs. The deputy chairman of the selection committee, Zoran Djordjevic, is a lawyer who specializes in international law and international trade. The official selection committee consists of two members from the country, a representative of the president, and two Tatars, for a total of six representatives.Following a tense and tumultuous selection process that lasted for almost a year, the first exhibition, “In Memory of the Victims of Soviet Communism,” will open on December 2. The show, which will feature artworks", "The next Biennial should not be held in 2020, according to Milledreamer, who said that the event’s organizers are “hostile to creativity and critical thinking.”\n\nThe Art Newspaper reports that a group of artists have complained to the Dutch parliament about the country’s plan to cancel the fifty-eighth edition of the Biennale de Lyon, scheduled to run from March 20 to March 22, 2020. According to the New York Times, the lawmakers are concerned that the move will hurt the artistic community and that the decision has already faced backlash from artists.“We need to find a balance between protecting the artistic mission and supporting the creative process,” said Justice Minister Koen Geldhof, who cochairs the coalition of left-wing parties that supports the Biennale’s cancellation. The government is currently debating whether to extend the deadline for the event, which would have opened in March, or to postpone it further.If the government backs off on the date for the cancelled event, which will take place in March 2021, there will be further political fallout for the Biennale. The event’s organizers, the Meret Oppenheim Cultural Foundation, have warned that the cancellation will harm", "The next Biennial should take place in 2020. With a budget of $69 million, the event will invite contributions from visual art, design, film, and literature. The 2019 event, titled “Moderns/Futures,” drew 51,000 visitors, and was staged in the French capital.\n\n\nThe European Union has unveiled new guidelines for the production of films and other works on social media. The document will help streamline the digital landscape so that it can be more easily implemented by businesses and individuals across the 28-nation bloc. The guidelines, which were drafted by EU cultural ministers and drawn from a list of ten options, outline the technical and social guidelines for how the institutions should handle complaints about content on social media.The guidelines were developed by the European Digital Society (EDS), an intergovernmental group that comprises representatives from the European Commission, the European Parliament, the Council of Europe, and the European Court of Auditors. EDS cofounder Stefan Wüthli, who was appointed as chair of the group by German Chancellor Angela Merkel in October 2018, said: “We have created a very detailed set of guidelines that will ensure organizations and individuals have the necessary tools to fight fake news and the spread of malicious rumors.�", "The next Biennial should have been held in 2021, but was instead canceled due to the Covid-19 pandemic.“The decision to cancel the 2019 edition was not made lightly,” said director R.A. Rahman. “We at the Art Gallery of Ontario take seriously any possibility of a disruption to the exhibition and its programs. The real question is: do we want to do more to protect the work that we are trying to sell?” The Biennials are charged with preserving the collection of the museum, which is currently closed until March 13, and staging exhibitions that draw attention to contemporary art and contemporary life. The 2019 event will be held at the Guggenheim in New York and will also be presented at the Museums and Collections of Ontario in Toronto and at the Metropolitan Museum of Art in New York. \n\n\nThe Dutch Ministry of Foreign Affairs announced today that it has suspended all new intergovernmental agreements with the Norwegian Government of Culture and has removed three items from its list of \"unacceptable practices.\" The ministry also said that it had revoked the Norwegian citizenship of a Norwegian artist and that the Norwegian government has put forward three requests for the removal of the Norwegian artist Lars Østby. These requests", "The next Biennial should take place in the year 2021.   This article was written by Andras Pokorny, a student of the Academy.  The views expressed in this article are the authors’ own and do not necessarily reflect those of the University.\n\n\nThe Museum of Arts and Design (MAD) in New York has appointed Rebecca Gauvreau as its next executive director. Gauvreau comes to the museum from the Brooklyn Museum, where she has served as senior curator and director of exhibitions since 2007, and will assume her role on February 7. She succeeds Wangechi Mutu, who retired after eight years in February 2019.“We’re thrilled by Rebecca’s appointment, and excited to work with her,” said museum director Daniel H. Weiss. “We have a deep and passionate connection with the world of fashion, and having her at MAD brings a new perspective and a fresh perspective to the museum, making it a perfect fit for Rebecca’s expertise and passion. We’re confident that she will make MAD a stronger institution for the many artists and designers at its core, and continue to deliver compelling exhibitions and programs that present innovative, challenging ideas.", "The next Biennial should take place in 2020. The fifty-ninth will be staged in 2022. This year’s event will be produced by Max Hetzler, Hollis Taggart, and Mona Hatoum, and will be hosted by San Francisco’s City Hall, with support from the San Francisco Museum of Modern Art and the San Francisco Opera. The biennial will be presented by the architects in partnership with the city of San Francisco and will include new conceptual and visual works by forty artists from twenty-two countries, all of whom will participate in the biennial.The full list of participating artists is as follows: Aldo Sella (Italy). Theater artist, writer, and curator. Milan, Italy: Heather Alberts (Germany). Heather Alberts (Germany)’s new modern sculpture, Wir sind die Bedrägen, (Langefossil), Berlin: Heather Alberts (Germany), too.Art historian, critic, and curator. Berlin, Germany: Available March 14. Austria.   Michael Abrons Abrons (Germany), Barcelona: In the performance of a", "The next Biennial should be held at the National Museum of Scotland, which will be inaugurated in 2021 and will host the first exhibition of works from the show during the event.\n\n\nArtist Chad Hugo has received a major award from the LaGuardia Foundation in New York in recognition this year for his work The Big Short. The annual $25,000 gong shows support for the work and for the artists who are making important contributions to exhibitions and writing.The foundation named the artist a MacArthur Fellow in the Arts in 2018 and honored him for his work Heaven and Earth, 2008–2019. The work consists of five panels, each depicting a different aspect of the Earth, which are arranged in a grid. Each panel has a cylinder-shaped structure that is encased in a plastic shell. The work is the fourth “One Man Panel” in the exhibition. “The work is about the film The Big Short, which depicts a young artist who sets out on a mission to save his art and the art of art by him, and his quest to find a way to open a gallery for his art,” said Isa Nussbaum, the foundation’s chair. “The work opens up a conversation", "The next Biennial should aim to bring the project back to life by re-visiting the exhibition space, measuring how it will affect the local community, and hosting public events to help the project reach its target of 10,000 tickets sold.\n\n\nThe City of Sydney’s Arts Council announced today that it has established a new $1.5 billion fund to support the long-term care of Australia’s cultural heritage, and that funds will flow in part through a three-year grant program, with the first three rounds of funding being announced last week.The City Council’s Cultural Heritage Fund is being created from the $4.1 billion currently allocated to Australia’s arts and cultural sector by the State Government’s “Building Communities for Australia” (BCAA) program, which was established in 2020 to address a shortfall of $1.3 billion in the budget for arts and cultural facilities across Australia. The Arts Council will administer the funds through a program of community engagement and collaboration that will give $300,000 to small and mid-size local authority arts and cultural organisations each year. The first round of grants will begin in the January–March 2021 basis", "The next Biennial should take place in the Spring of 2020 and will be hosted by the City of Boston and the Museum of Fine Arts (FMA).  The next edition will feature a staging of the first exhibition, “Photographs of Life,” to coincide with the American Civil War. “This is a historic moment,” said FMA director Matthew Teitelbaum. “The City of Boston is setting an example for how community engagement can expand and deepen the legacy of a museum. We are eager to see what future holds for the Biennial.”\n\n\nFilipinos who were detained by Immigration and Customs Enforcement (I.C.E.) in the United States for allegedly attempting to board a flight to Mexico in order to join the drug war were given a reprieve this week after a judge ruled that they were not criminally responsible when they were arrested last May. In a ruling that was reported by the New York Times on Friday, District Court Judge Claudia Wilken said that the six men and three women, who were arrested after a Border Patrol agent spotted the men in a photo-op in the United States on May 4, were not guilty of any crime because they were not acting in concert", "The next Biennial should be held in 2021, and the 2020 edition will be hosted by the Museo de Arte Contemporáneo, Madrid, in March 2021.In December 2019, the Madrid-based organization the Institute of Contemporary Art (ICA) announced that it was planning to move its exhibition, “Cinecittà: Una Porta,” from the Museo de Arte Contemporáneo to the Museo de Valencia, Valencia, where it would be available to the public. José Pérez-Ruiz, the director of the Museo de Arte Contemporáneo, said that the institute had asked the Spanish Culture Ministry for permission to move the show from Madrid to Valencia because of the “provision of cultural, artistic, scientific and historical objectives.”According to the Spanish daily newspaper ABC, the move is part of a larger plan to loosen restrictions in Spain, which has seen a sharp increase in anti-government protests in recent months. The changes announced today will likely lead to protests in the capital, and further afield, in the provinces of Catalonia, Valencia, and Murcia.President José Mujica has previously stated that he wants the government to take", "The next Biennial should be in December 2020. The last was in September of 2019. The next Associations Internationale de Mediterranéa (AIM), in October 2021, will take place in March 2022. The next Art Basel Hong Kong Expo, slated for March 21–March 22, 2022, will be held in November 2022. The last exhibition was held in October 2020. In October, Paris’s Art Basel announced that it would postpone its 2020 edition by two months, citing the possible introduction of the pandemic. The organization stated that it would release an update on the progress of its upcoming event in January 2022.  As of December 2017, the number of cases in France was approximately 150, with an estimated death toll of more than 1,000. François Pépin, a former director of the French Ministry of Culture, said: “There are no solutions to this crisis other than political, scientific, economic, and social. At a minimum, we need global health cooperation. We must invest in the poorest countries and the least developed countries, and accelerate aid. This is the only way of ensuring that we emerge as the global health leader.”\n\n\n", "The next Biennial should be on November 16, with the exhibition opening on December 6.  Arts curator Jan-Otto Gass will organize a presentation of work by twenty-one artists, including Dorothea Rockburn, Craig Neal, William Wegman, Willem de Kooning, and Nancy Tung, in January 2020.Artforum will have more details soon.\n\n\nThe Museum of Fine Arts (MA) in Boston announced today that it is expanding its workforce through a hiring freeze and hiring round. The move comes on the heels of the institution’s announcement that it is delaying the opening of its new location, the Museum of Fine Arts Boston, until April 21. “In the interest of supporting our talented and dedicated staff and ensuring a smooth transition to our new home, we’ve decided to reduce the size of our team during the hiring freeze, and we’ll be hiring a few hundred people during this time,” said John McEnroe, director of MA. “The hiring freeze also helps us prepare for an unprecedented year of exhibitions and programming, as we continue to support our core staff through an unprecedented global health crisis.”The hiring freeze, which runs through May", "The next Biennial should be held in the year 2020. \nWe hope that our work will be useful to you. We are excited by the prospect of sharing our art with you. Sincerely,\nThomas Hirschhorn, M.D.\n“The reason why so many people have not migrated to Europe is that it is not a continent that is concerned with their well-being. It is a continent that is concerned with its kind. It is concerned with how to take care of the planet. It is concerned with how to produce food and material for its citizens. It is concerned with how to exploit the natural resources of the continent.”\n\n\nThe London-based charity Médecins Sans Frontières (MSF) has issued a public appeal for information on the whereabouts of a group of workers who were kidnapped by gunmen on a motorbike in the French capital on Tuesday night. The group was on their way to the headquarters of French president Emmanuel Macron and his conservative Democratic Party when they were kidnapped by three armed men, one of them wielding a knife, in the northern city of Toulouse.According to a statement on its website, the group was stopped by a white van and transported to a nearby Saint-Malo", "The next Biennial should be held at least once a year. The next Art Biennial should be held at least once a year. The next Art Theater Biennial should be held at least once a year. The next Art Museum\u0097or Art Museum Theater\u0097should be held at least once a year. The next Art Biennial should be held at least once a year. The next Art Festival should be held at least once a year. The next Arts Festival should be held at least once a year. The next Arts Awards should be held at least once a year. The next Art Writers Circle Awards should be held at least once a year. The next Art Fairs should be held at least twice a year.The next Art Museum Tours should be held at least once a year.The next Art Carried Art Show should be held at least twice a year. The next Art Museum Tradeshow, and the next Art Museum Triennial should be held at least once a year. The next Art Museum Exhibition will be held at least twice a year. The next Art Museum Workshop, and the next Art Museum Exhibition should be held at least once a year. The next Art Museum Awards should be held at least", "The next Biennial should take place in the city, The Dia Artis Foundation, in April 2019. The museum would then move to a new venue in the same building in May 2020, and the Dia Artis Foundation would stay in the same location through the fifty-eighth edition in May 2021. Meanwhile, an exhibition of works by the artist founded by the collector Xavier Uribe-Vega in the Dia Artis Foundation would open in the Dia Artis Foundation in May 2024. The artist, who is also known by the stage name Nara Barba, is widely known for her bold and sculptural public works, which often involve urban elements such as metal and glass.\n\n\nThe Paisley Art Museum in Oxfordshire, England, has appointed Holly Hendry, who has served as director of the institution since 2013, as its new deputy director of exhibitions and research and curatorial affairs. Hendry will be responsible for the development and oversight of the museum’s collection of contemporary art, as well as for managing its collection and exhibition program in partnership with the staff. Since the Paisley opened in 2018, it has staged more than sixty exhibitions, including the retrospective “Between the Sun and the Moon” (", "The next Biennial should be held in 2021, says director Günther von Cram, and “the final edition will be the longest and most ambitious. With the invitation to the city of Berlin, the present exhibition will become a new narrative of the city, set in a new era, and will embody the Biennial’s spirit.” The 2020 edition of the exhibition will be on view in Berlin from September 24 to September 28, with the event’s first edition at the Museum of Modern Art in New York in 2021 to be staged in 2022.\n\n\nThe International Centre for the Study of Modern Art (ICSA) in Vienna has announced that it is expanding its curatorial team. In addition to supporting the work of its existing curators, ICA will add five new artists to its roster, including three new members of the long-running non-fiction British-French artist-art historian, Charles Cassel, and his collaborator Jean-François Holleman, who will be joined by ICA’s director, Marina Mero, at the opening of the new exhibition “Société Moderno” on October 7.“In their work the both artists embody the spirit and", "The next Biennial should take place in 2020. The first exhibition, Cecilia Artemova: The Honeymoon Years (2019), will open in Moscow in 2021. The project will also include the re-creation of the first paintings by the contemporary artist Gheorghe Moghaddam in his studio by the artist’s granddaughter, Lina, on the occasion of the artist’s birthday. The next exhibition, Art and Decoration: Feminine and Male Art in the 1960s (2019), will open in New York in 2021. As part of the same project, the museum will also create a new exhibition dedicated to the Composition of Modern and Contemporary Art in the West. The first show, “Prospect: Art and the Modern World” will open in the West Berlin Biennial in September 2020 and will be followed by “Factories,” “Oddities,” and “Women’s Art: The Ghetto and the Modern World” in September 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has announced that Katja Epstein, who has served as director of the museum since 2013, will be promoted to director.", "The next Biennial should be followed by a major retrospective, “Theatrical Biennial,” which will focus on the work of international artists in the exhibition. The biennial will commence in May 2020 and will reflect the increasing significance of the arts in shaping and providing inspiration for contemporary life. In recent years, the exhibition has featured the work of artists such as Yinka Shonibare, Ai Weiwei, Mierlej, Renata Cattelan, and Chang Kukai.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Adam Weinberg as its next director. Weinberg, who has served in the position for eleven years, succeeds David DiLorenzo, who retired after eleven years in April. “Adam and I share deep respect for David DiLorenzo and the National Gallery,” said DiLorenzo. “We are eager and honored to work with Adam to expand on his legacy and to continue to develop the gallery’s collection and programming.”In the new role, Weinberg will be responsible for guiding the National Gallery’s collection strategy and for building the institution’s collection by integrating its collection of art, architecture, design", "The next Biennial should take place in December 2021, and the exhibition should be inaugurated by a live performance by the Canadian folk troupe the Canadian Ballet.\n\n\nGraduate students at the Metropolitan Museum of Art in New York are protesting after the institution terminated their contracts, ostensibly over their participation in a controversial art-world workshop, after the institution failed to meet stipulations set by the students for the event, which was held at the Museum of Arts and Design in New York in October 2017.The protest follows scenes from the October 2017 event, titled “Sensations: Art in Motion” and entitled “What is the Difference?”\u0097a public performance that drew 10,000 people\u0097which were staged by the Danish-born artist Lars Vilks, who studies at the University of Copenhagen, and the artist Apichatpong Weerasura, who lives in Los Angeles. When the artists were asked by Design Week to present their work for the exhibition, they opted to leave it unfinished.According to Artnet, the artists were not given a reason for the decision.“The’s were forced to create works that either weren’t possible or weren’t urgent,” Mark", "The next Biennial should be held in 2022, and the first in 2020.\n\n\nThe Museum of Fine Arts (MFA) in New Orleans has appointed Mary Roach as its next director. Roach comes to the institution from the Metropolitan Museum of Art, where she has served as deputy director and chief curator since 2015. In her new role, she will be responsible for leading the Southeast Louisiana arts community through the coronavirus pandemic.“With the coronavirus pandemic in full swing, the MFA’s mission is to provide a platform for the visual arts, to support the creative endeavors of our talented staff, and to provide a secure and affordable home for our collections and exhibitions,” said Elizabeth Khan, chair of the board of trustees. “In order to facilitate the museum’s ongoing vision of the world through the arts, and to serve the residents of our community, I’m excited to see how this year’s [MFA] exhibition shows a new set of treasures about the world.”The full list of trustees is as follows:Fred D. and Jimmie Duncan. 2001. Fred and I used to run a local arts center in the suburbs of New Orleans, but we", "The next Biennial should take place in the spring of 2022. [Update: October 25, 2022] The sixth edition of the Basel Architecture Biennial, which was originally scheduled for March 22–March 31, 2022, has been pushed back to June 20–June 21, 2022. The event is now slated to take place in the spring of 2020.  A special exhibition titled “Art of the Imagination” will also be staged at the biennial.Traditionally held at the city of Basel, the exhibition will now be hosted at the Art Museum Zurich in the city of Bern. It is expected that the first show of the new theme, titled “Practical Art” will open in the spring of 2021, and the last show of the former theme, titled “The Architecture of Dreams,” will close in the fall of 2021.[Update: October 26, 2022] The Venice Architecture Biennial has announced that it will be held in the Italian city from March 8–March 11, 2022. The event’s inaugural edition, “The Architecture of Dreams,” opened on January 30, 2019 and ran until January 30, 2020. The second edition, “Art of the", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles will become the latest major American institution to announce its retirement of its iconic steel-and-glass building, the Museum of Contemporary Art (MoCA), in 2020. The announcement came on the heels of the announcement that the Museum of Modern Art (MoMA) in New York City would continue to operate, albeit with a smaller staff, under a new agreement that will see the institution’s current exhibition space in the building, the former residence of the Stedelijk Museum, rebranded as the Museum of Contemporary Art.The announcement coincides with the reopening of the new Museum of Contemporary Art Los Angeles, which will boast a four-story glass-enclosed museum showcasing the work of twenty artists over the course of forty years. The museum’s inaugural exhibition, “The Subversive” (2019–20), was curated by Peter Zumthor and Richard Avedon and opened on September 4. The second show, “The Complete Works of Alighiero Cattelan” (2019–20), is slated to reopen in February 2020, with the latter exhibition opening November 28.Inaugur", "The next Biennial should focus on the history of art and architecture, and should embody the spirit of the city. The theme should be “organic,” and the theme should “be about urban life,” Moskowitz said. The 2019 edition has yet to be announced.\n\n\nThe Museum of Modern Art (MoMA) in New York has named Pippa Arsht director of the biennial, “Unseen: Art, Politics, and the Struggle for Civil Rights,” which is set to run from March 21 to March 22, 2020. Arsht will replace Donna Harrison, who retired last month after seven years at the institution. “With her deep history and knowledge of MoMA and its extraordinary collection, she has brought to the institution a new sense of optimism and purpose,” said Mark Goldman, director of the biennial. “I’m proud to welcome her to the Museum of Modern Art as director and to continue to support MoMA’s mission to present the art of the twentieth century in an approachable, engaging way.” Arsht currently serves as an associate curator at the Museum of Modern Art. She has taught at the institution since", "The next Biennial should be titled “Beyond the Frame: Post-images, 1915–1937,” and will take place in the city of Nanjing, China, from March 14 to March 16, 2020. The exhibition will showcase the work of seventy-three artists, including Renzo Piano, Emil Bacher, Ed Ruscha, Gitta von Humboldt, and Franz Klee.Commenting on the upcoming exhibition, Zhang Jianlan, the director of the Nanjing Biennial, said: “This is one of the most important issues for us as a contemporary art historian to confront. We want the exhibition to be an introduction to post-1945 art and to provide a platform for the artists to reflect on their own art and the world. We hope that the exhibition will be a point of departure for future generations of art historians.”\n\n\nThe British Museum in London and the London School of Economics in London announced today that they are planning to merge their operations. The news comes amid the ongoing debate over museum consolidation, and comes as the institution prepares to welcome visitors to its new site, the British Museum, in January 2021. A new director will assume the helm from Kate Moss, who will retire in January 2021 after ten", "The next Biennial should be held in 2020, but the fact that almost no one has given the institution a lot of thought is troubling. “Frank Gehry has always been about loft, about the idea of a kind of exposed, organic space,” Mythila Pal Singh, the director and chief curator of the Delhi Biennials, told the Art Newspaper. An edited version of the new exhibition will open at the Delhi Art Gallery (DAG) on November 16, 2020. The curated exhibition “Loft is the Future,” will also be staged at the Mall of India in Mumbai, the National Gallery of Art in Washington, DC, the Art Institute of Chicago, the Art the Madrid Biennials, and the Art Museum of Liverpool.Curated by Nandita Roy, the curator of contemporary art at the Art Gallery of Ontario, the exhibition will feature work by seventy-seven artists and will run for ninety days. The first round of shows will be held at the Art Gallery of Ontario in Toronto from March 13 to March 15, 2020 and the second at the Art Institute of Chicago from March 15 to March 19, 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (LA)", "The next Biennial should take place in Rio de Janeiro in 2021. The second, in 2022, will be held in Stockholm. The third, in 2024, will be staged in Berlin. The fourth, in 2024, will be staged in New Delhi. The fifth, in 2022, will be staged in Tokyo. The last is almost certain to be held in 2021. The next edition will be staged in the city of Santa Cruz, in the state of Santa Maria in Brazil. The city of Santa Cruz recently held a mega-show of work by Moët Hennesy, Hildegarde, and other South American artists. The show opened in February and ran until March.  The museum is trying to raise $9 million for the event, which will consist of a series of screenings and lectures by contemporary artists on topics such as sustainability, art, politics, and history. The event was established in 1986 by Heinrich Böll, who became interested in the culture and history of South America after he moved from Sweden to Buenos Aires. In 1999, the museum acquired the rights to stage the first exhibition of works by Calder Gomes, who created the artworks The Betrayal of Málaga", "The next Biennial should be held at the museum as soon as possible. The museum will be closed until March 19, 2019. The institution will remain closed until March 20, 2019. \n\n\nIn a ruling announced on Thursday, France announced that it repealed a law that severely restricts the rights of French artists and private collectors through a series of technicalities that have been characterized by an economic blockade of the arts and a restriction of artistic freedom. The abolishment of the State Production Order (SOP), a piece of legislation that has been in place since the 2011 riots, has been met with protests from those who believe that the law was passed to limit political freedoms.The law, which made fighting terrorism and organized crime a state priority, has since been used to justify a massive crackdown on protesters. The government is currently working on revising the penal code so that it can be enforced with less resistance, and the penalty for terrorism offenses is also being slashed from three years in prison to one month. While the ban on protests was criticized by human-rights activists and artists, it has been broadly supported by France’s president, Emmanuel Macron, who declared that the new regulations would leave the country “in a good state of health.”The changes to", "The next Biennial should take place at the Seattle Art Museum in 2020.\n\n\nArtwork by the Seattle-based collective Trixie Blu, which was formed in 2012 to support the city’s artists, has won a major $10 million MacArthur Genius Grant from the MacArthur Foundation. The grant, which comes with an unrestricted $5,000 cash prize, was awarded to the visual arts collective for its Visual Art Project (VAP)’s first project, a public artwork that expands upon the five-person group’s practice of working with and collecting works of art, called the Reading Room. The project is part of a larger curatorial agenda that aims to confront and expand language of art and collectivity.“Our project using the Reading Room as a platform for exploration and inquiry is a reflection of the interactions between artists and the broader world,” said Trixie Blu cofounder and director Trixie Blu. “Our work inaugurates the reader\u0097and reading room\u0097as an intentional and compassionate space for art, our practices, and the community.”The grant also includes funding to continue developing and implementing the VAP series, which has been described as a “new kind of therapy", "The next Biennial should be held later this year.\n\nThe Ballet in the City of Angels, which will stage the first-ever Walther Rundschweiz biennial in the city in April 2020, has announced that it plans to postpone the event, which was originally scheduled for February 21–February 24, 2020, due to concerns about Covid-19. It is now planning for a March 14–March 16 event.The 2019 edition, which was led by Lorraine O’Grady, featured twenty-two artists. The 2019 event was live-streamed and closed to the public for thirty days following the pandemic. Current performances are expected to run from March 11–March 13.The event will now take place from March 13 to March 16, 2020.\n\n\nThe National Gallery in London has appointed Richard Aldridge as its new director, effective immediately. Aldridge, who is thirty-six years old, succeeds Tim Marlow, who was assistant director of the institution from June 2018 to November 2020 and oversaw its expansion from six new buildings to eight, and is the first to take the helm from Sir David Mitchell.“Richard has been an integral member of the National Gallery since he took", "The next Biennial should have a new exhibition format, and I will be publishing a new book to accompany the exhibition, the first of its kind, in the Fall. I am interested in the ways in which the exhibition can address issues of faith and the history of the exhibition.”The work, entitled “The Revocation of the Ten Commandments,” was commissioned by the institution in 2015 and is based on a deliberate reconquest of the Ten Commandments, which came to Jerusalem in 1833.**In the exhibition, the artist evokes the Biblical story of the exodus of the Israelites from Egypt and traces the journey of the Israelites through the desert to Canaan, where God revealed Himself to Moses. While the theme of “The Veil,” the last work in the show, was a religious moment for the organizers, the 'The Veil’s failure to engage with the issue of faith was a source of concern.Responding to the exhibition, Aliya Gul, a curator at the site, said: “The history of the exhibition is an open book for scholars. The Prophet (peace be upon him) said that this work is the curtain that separates the truth from the lies. It is a way for us to", "The next Biennial should be held in the autumn of 2021. The studio of artist and curator Yotam Ott and choreographer Anna Prodger will prepare the theme, which will be based on a personal relationship between the two, and the artist, whose work has been placed in the public collections of the Museums Berlin and Museum Düsseldorf. While the exhibition will be a retrospective, a performance, and an installation, it will also comprise a memoir, a selection of artworks by the artist, and a discussion with the artist.The artist’s full statement:\n\n\nIt’s been a serious and exciting decade for art and I’m thrilled to be able to share that experience with my fellow artists and audiences at the South by Southwest (SXSW) in Austin, Texas. After a thorough search, I chose Pennsy Ligure, whose work explores the relationship between consciousness and the body and the possibilities of the human body. I’m also thrilled to be collaborating with the DiS and the Deltas, as both institutions represent art at its most optimal and compelling. My work has been exhibited at the Museum of Modern Art in New York, the Museum of Contemporary Art in Los Angeles, the Museum", "The next Biennial should focus on deconstructing the contemporary, and now more than ever, on the power of nature in our lives. We must recommit ourselves to the care and feeding of nature and to the formation of our own horizons. We must recommit ourselves to the development of radical ecologies of life that embody the richness of our shallow environmental biographies. And we must recommit ourselves to the struggle to create new and better ways of being.”In addition to the biennial, the organization has announced that it will establish an open-studio space in the city where artists can work in collaboration with local communities. The initiative will also offer programming that integrates environmental and design elements in a number of artistic activities, including an installation by artist and designer Humberto de Alvear, which will be on view for the first time at the exhibition until October 7. “This is a moment of great change for the world,” said Matt Brown, CEO of the Biennial and chairman of the New York–based firm Brown + Partners. “We are thrilled to defend the principles of the award, and to create new experiences that unpack the theme of the exhibition.”\n\n\n\n\n\n\nHISTORICAL", "The next Biennial should be held in 2020 and will take place in the city’s Fotografiska, a former Meerkatte Kultur, in Kiel, Germany. The Board of Directors of the Biennial Museum in Vienna also approved a new contract with the artist-run café chain Stella Mata and the European Space Museum Vienna.\n\n\nThe New Museum in New York announced today that it is teaming up with the Daughters of the American Revolution (DARV), a group of American women who have championed the cause of women’s rights, to create a new collection of women’s rights art that will be organized in partnership with the Daughters. The new exhibition will feature paintings, sculptures, photographs, and videos that examine the ways in which women’s rights have contributed to social progress, and will be hosted by the New Museum in the spring of 2021.“In the current political and social climate, the Daughters’ contribution to advancing the cause of women’s rights is vital,” said Sarah Schroth, director of the New Museum. “As the Nation’s Museum of Women, the federal government’s policy on women’s rights", "The next Biennial should be held at the Hotel das Neue in Berlin in the spring of 2020; the first Tucson Arts and Design Biennial will be held at the Museum of Contemporary Art in Tucson in the fall of 2020.\n\n\nVolkswagen Group and the Sackler family have agreed to jointly develop a new set of environmental standards for the automotive industry. The new standards will address how the company intends to move forward with its plans to sell new electric and hybrid vehicles in the 2020s.The news comes a few days after the two families announced that they were establishing a new foundation to advance the environmental protection of automotive technology and its development. The goal is to increase the visibility of environmental concerns by connecting the company to the public. According to the New York Times, the foundation will promote the interests of smaller companies in order to help them scale back on production. According to the Wall Street Journal, the foundation will also be tasked with helping the automotive industry better understand the climate crisis and will partner with academic institutions and non-governmental organizations to help them understand and mitigate greenhouse gases.The news comes amid growing concern in the United States and Europe over the impact of the coronavirus. On Tuesday, the European Union announced it will begin phasing", "The next Biennial should take place in the spring of 2021.The announcement comes on the heels of London’s decision to cancel the 2020 edition of the Great Exhibition, which had been scheduled for March 28–March 31, and to move the event online. The announcement of the cancellation was made by the Royal Shakespeare Company (RSCo), which represents the role of the United Kingdom’s national theatre company, the Royal Shakespeare Company, in England. The decision to postpone the event next spring was made in part because of concerns that the pandemic would hurt box office revenue. “We are acutely aware that the decision to postpone the fest is not in the best interests of the Royal Shakespeare Company,” reads a statement by the company. “We ask that everyone, including our audiences, feel safe and reassured in their travel plans. We thank our staff for their work in helping us to understand the impact of the Covid-19 pandemic and we thank our guests for their enthusiasm and engagement.” \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MCA), announced today that it is currently working on upgrades to its existing footprint as part of a $10 million renovation project. The project, which is part", "The next Biennial should examine the intersection of art and politics. “Contemporary art has long been perceived as a vehicle for social change, but its success has been contingent on the development of political power,” said Jean-Philippe Berger, chair of the museum’s department of art history. “But how can a museum, which has been established as a platform for the work of a few (including Jean-Luc Méliès), and which was founded as a center for the artistic production of a few (including Damien Hirst), maintain an aesthetic identity as important as its collection?”Regarding the future of the collection, Berger said: “We are determined to move into a new era of exhibition-making, exhibition programming, exhibitions, and exhibitions. We are determined to take our place alongside the great French masters of modern and contemporary art, whose work we want to share with our audiences.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has named Jane Russell as its next director. In her new position, which was created by the board of directors of the arts nonprofit, Russell will assume her responsibilities when the museum reopens in October 2020. Previously, the museum has served as an incubator", "The next Biennial should be held at the local museum. The exhibition “must also take into account the impact of the recent earthquake and tsunami in Japan,” the Arts Council writes. “This is especially relevant in a city near the epicenters of the current crisis.”The bid was made by the Gems Institute in Kyoto, the Japan Art Museum, the National Museum of Fine Arts, and the Mitsukoshi Museum in Tokyo. The International Council of Cultural Heritage is hosting this year’s iteration of the Biennial in the United States, and it will stage the seventh edition in the city of Los Angeles in 2021.\n\n\nThe Smithsonian’s National Museum of American Art (NMAA) in Washington, DC, has received a gift of sixty-eight works by Italian architect Cui Xiaoming, a Chinese American who was commissioned to design a new building for the institution in 2015. The gift includes seven architectural plans for the museum, including a redesign that includes the building’s exterior and interior.“Inaugurating a new chapter in the museum’s history, ‘Cui Xiaoming’s new design integrates the core institution’s architectural history with a contemporary contemporary vision,�", "The next Biennial should be held in 2022. The Art Newspaper reports that the next iteration of the exhibition will be hosted by the Royal Academy of Arts in London and will be curated by John Akomfrah, who was appointed as the new director of the West London Biennial in February.The new exhibition will feature work by more than 400 artists in a series that will begin with a focus on colour and move into the body of the artist and will take up themes of power, history, and the body—the theme of the third part of the exhibition will be the psychological impact of drugs. The exhibition will run for twelve weeks, from February 21 to March 11, 2022.The organizers have said that the event is meant to reflect the spirit and progress of the contemporary British art, and the British art world, but also to reflect the country's economic and political moment. They said that the new exhibition will invite artists to work within the constraints of their studios and that the new format will not interfere with the legacy exhibitions, which are slated to take up the themes of the first and second halves of the exhibition. The reopening of the exhibition coincides with the UK’s 150th anniversary and will coincide with the official reopening of Tate Britain, which will", "The next Biennial should take place in 2020, and the date for the final exhibition has yet to be chosen. The museum will also be remodeled in order to increase the exhibition space and is currently working on an overhaul of the building.The plan was inspired by the landmark exhibition “The Planet in Space: Art and the Modern Environment” (2019) by British artist Richard Avedon. In the exhibition, which was staged at the Museum of Modern Art in New York, the artist created a space in the museum where the artist could store his works, which were on display for six weeks. The space would have opened up to the public in 2021, but the exhibition was canceled due to Covid-19. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Brittany Casteel as its next director. The California native has been a curatorial assistant at the museum for more than a year and most recently served as a consultant for a retrospective of work by the late Israeli-American artist Matthew Heineman, “All Out War,” in 2017.“We were thrilled to welcome her to the institution,” said Mark Doty, director of the museum. “Bristle began her", "The next Biennial should be in 2020.   On a practical level, the organizers said that the museum would not be closed permanently, but will continue to work on exhibitions and projects that could be disrupted by the pandemic. The institution also revealed that it plans to reopen with fellows from the next Biennial, which will take place in 2021, but only if the condition that keeps the institution closed for more than eight weeks is met. In a letter published by the board of trustees of the Centre for Contemporary Art in London, the trustees wrote: “The current situation necessitates an immediate reopening of the Centre, as we know what it will be like when the dust settles. We hope that everyone will be able to return to the Centre on Tuesday, November 25, 2020. If you are unable to travel to your home city or region on Tuesday, we suggest that you consider returning to London in early November for a few days of celebration. We know many of you will want to see the works of your favourite artists and hear their voices again, and will be able to do so on Saturday, November 27, 2020. However, we will keep you updated with any additional developments as they become known. As always, we are here", "The next Biennial should be held in 2021 and will be directed by Michèle Bennouil-Chateaubriand. \n\n\nZoë Quinn, who created the experimental and experimental art of Yinka Yinka, has died at age eighty-nine. With her husband, the experimental artist François Truffaut, and a small group of collaborators, Quinn turned her back on the mainstream. Instead, in the late 1960s and early 1970s, she and her collaborators explored the idea of “interweaving of rhythms, rhythms of light, light of sound, and sound of light” in paintings, drawings, sculptures, installations, and performances. “In his art, Pablo Picasso reveals his own existence as the result of a long-term process, a process which takes the form of an assemblage of sounds,” Quinn wrote in a 2015 retrospective exhibition at the Museum of Modern Art in New York. “This process is the only thing that provides the basis for the entire universe.”Born in New York City in 1932, Quinn, a Jewish immigrant from Russia, grew up immersed in American culture, with her family and numerous musical and visual arts teachers\u0097her father was a radio and television", "The next Biennial should take place in 2020 and will be hosted by the Künstlerhaus in Paris. The format will be a collaboration between two or more galleries in the same city, with the theme centered on the artist’s practice. The theme will be curated by a panel of artists from the Biennial, which will be composed of Peter Motta, Claudia Motta, and Carolina Rojas.The panel will convene from February 12 to February 15 at Künstlerhaus. The exhibition will be held on the premises; the hostel will be restored and a new Biennial will take place at the Künstlerhaus. The opening of the exhibition will coincide with the opening of the exhibition “Pathetique: The Surreal Painting of the Surreal.” Coinciding with the opening of the exhibition will be the opening of the exhibition “The Collapse of Modern Art” at the Museum of Modern Art. The exhibition will also include the first show of work on paper by artist/sjoerd de Jong. In addition, a Travel Showcase, “The Art of Travel,” will open at the Aac", "The next Biennial should take place in the spring of 2021. A spokesperson for the London-based, nonprofit organization told the Art Newspaper that the commissioning of the exhibition was part of its commitment to supporting contemporary art and to 'provide a new platform for exploring the ideas, works, and performances of the generations that have come before us.”The London-based institution, which also staged a retrospective of the artist’s work in 2017, announced that it will now do a fourth edition of the event. The decision to hold the event in May was taken after a three-year review, led by James Cuno, director of London’s Tate Modern, and Graham Cluley, artistic director of the Salford Museum. In his influential report, “The Future of Art” (2018), Cluley called for a “more radical and inclusive” return of the exhibition. The show will now take place at the Metropolitan Pavilion, the British Museum, the Tate, and the London Gallery of Contemporary Art (LACMA), with the artistic director of London, David Adjay, as well as the curators of previous biennials, Sianne Cunningham, Chris de Burgh, Johanna", "The next Biennial should be held in 2021.\n\n\nThe Carnegie Museum of Art in Pittsburgh has added five new works to its permanent collection, bringing the total number of works in the museum’s collection to twenty-eight. A selection of twentieth-century paintings was also added to the institution’s collection, along with paintings by Pierre and Paul Picasso, Edward Hopper, Frederick Seitz, and William S. Burroughs. The works were selected from a pool of twenty artists that included John Akomfrah, Gertrude Stein, Cyril LaBouvier, and Frank Stella.The additions follow the opening of “The Hellbound,” a curated exhibition of work by twenty-four artists, in the museum’s newly remodeled and expanded endowment building. In its new home, the museum houses an exhibition that celebrates the twentieth-century African American experience. The exhibition is curated by the Black Arts Foundation and the Pittsburgh Cultural Center and is organized by the Black Arts Foundation, the Black Arts Council, and the Black Arts Supporters League.The exhibition was founded by Tracy Duke, the longtime director of the Pittsburgh Cultural Center, and her husband, John Duke, who created the work of Simone Leigh, Mary Oliver", "The next Biennial should be held in 2021 and will be hosted at the Hungarian National Museum. The charity will also establish a new award of one hundred fifty thousand for Hungarian artists and seven hundred thousand for cultural organizations in support of the participation of artist groups and the promotion of cultural diversity. The Erdoğan Removals of Art and Architecture Award will be introduced in 2020.The Turkish government has cut the budgets of forty-six cultural organizations and is preparing for the largest anti-terror operation since the country gained independence from the Ottoman Empire in 1923. The Art Newspaper reports that the government is planning to demolish more than twenty-five historical sites in the Istanbul region. The Cultural Center of Turkey (TİK) and the Museum of Turkish Heritage (MİT) in Ankara are facing several lawsuits over the destruction of works by Turkish artists and art workers. Government officials claim that the hundreds of Kurdish cultural figures who were executed in a mass purge carried out before the attempted coup in 2016 are being rehabilitated via mass evictions and the demolition of historical monuments.According to the Art Newspaper, the government is planning to use the funds raised from the annual awards to demolish forty-six sites in the Anatolian province of Çatalh", "The next Biennial should take place in Amsterdam in the spring of 2022.\n\n\nThe Museum of Chinese in America (MCA) in New York has welcomed four new members to the board of trustees: Michael Tung, a Hong Kong native who serves as the board president; Hsin-Chih Chiu, a Shanghai native who is also a founder of the company SONY Video Arts; and Yiorgos Karagiannakis, an American artist and filmmaker, who is based in Beijing.“The museum is grateful to the partners who have contributed to the success of the museum’s inaugural season,” said museum director Joseph Carey. “MCA is truly at the forefront of transforming how we think about and understand the history of American cinema\u0097and this year’s exhibition is a great example of this vital work.”In addition to presenting the first exhibition specifically dedicated to the Asian Pacific Pacific, this year’s exhibition also included the exhibition “Audition: American Cinema” (2015), which explored the visual art of American cinema\u0097and of the filmmakers who chose to focus on the Pacific. The exhibition also featured a number of previously unexamined materials, including a pre-", "The next Biennial should draw from the same perspective. The themes and the institutions will be aligned and will reflect the spirit of the biennial, but we will welcome new ideas and critical perspectives, while still honoring our own traditions.”\n\n\nThe University of Chicago announced today that the university will donate more than four hundred works by forty-five artists to the city of Chicago. The works will be divided into two categories: historical and contemporary and will be freely available for free to the public. The work will be organized into two parts: a historical part, which will give an overview of an artist’s work, and a contemporary part, which will focus on a specific historical moment.“For more than five decades, the university has collaborated with Chicago artists to present a series of exhibitions and workshops that address both the past and the future, drawing from the intellectual and artistic heritage of Chicago’s artists to explore themes such as the legacy of Chicago’s African American artists, or the current struggles of Chicago’s women artists,” said Mark Dimin, chair of the university’s advisory board and president of the university. After the University of Chicago Foundation provided $3 million to the city of Chicago’s High", "The next Biennial should be held in 2020, with a new exhibition being organised by the National Museum of Contemporary Art Chicago. “We are preparing to present a new collection of works by artists who are not currently represented in the collection, similarly to what we did for the twentieth-century,” Biennial president Harald Szeemann said in a statement. “We are also making a concerted effort to become a more global community of curators and makers, and of audiences, and will continue to do so.”The exhibition, titled “Away from the Real,” will run concurrently with the show of works by the sub-Caucasian artist Nusseibehart Riverzhdiev, who is best known for creating works that are inspired by his experiences in the region, the Archangels, and the Fertile Crescent. The exhibition will be held at the same venue as the first show of work by the artist in June 2020.Commenting on the new partnership, Kasmin CEO Mira-Ann Gant said: “Kasmin has long considered the Archangels as the central location for the Museum of Modern Art. . . . We are proud to support Kas", "The next Biennial should include a dialogue between the artist and the museum. “The future of art lies with the public,” said Jodi Throckmorton, director of the Foundation for Contemporary Art and the former chief curator of the American Picasso Biennial, in a statement. “This is the golden age of American art, and it is ripe for further growth and renewal.”\n\n\nThe Institute for Contemporary Art (ICA) of Chicago (ICA) has received a $50 million donation from the Jonathan and Charlotte King Family Fund. The $8.5 million gift will fund the next iteration of the museum’s “Fifty Years of African Art” series, which will follow the works of forty-five artists and their families and will open to the public in 2021. The foundation’s president, Jonathan King, said: “We’re thrilled about this gift, because it will help the ICA continue to advance our unique mission, which is to define and celebrate African art. We believe the next iteration of this series will be a landmark in the history of art.”The King Fund also announced a new five-year grant cycle, which will prioritize projects that address racial inequities and", "The next Biennial should be held in 2021. \n\n\nThe Paris-based foundation Le Monde announced today that it is launching a new initiative, called the Impact Fund, in partnership with the French Ministry of Culture and the Institut National de la République.Launched in partnership with the institutions Arts-Ouest-Université (Arts-Ouest-Université) and Paris-Palais de Tokyo (Paris Palais), the fund will distribute $170,000 each year to French art. The grants will be made through an agreement with the French Ministry of Culture, which will administer the grants through a committee chaired by Culture Minister Franck Riester, who will select five winners and distribute the funds to the five institutions.Established by artist Gilbert Frigo, the Impact Fund was created in order to encourage the distribution of arts and culture across France. The initiative was inspired by Frigo’s desire to support the French representation in the upcoming Art Basel Paris in 2022. After an agreement was signed with the French Ministry of Culture, Frigo was awarded a $50,000 grant in support of his proposal. Frigo said that the impact fund “grew", "The next Biennial should also attempt to address the repatriation of the bodies of those who died of hunger in prisons. The exhibition “Laughing Gas: The Politics of Smack-Smack” will focus on the history of North American anti-death penalty activism, the impact of riot control and the death penalty in California, and will also include a show that will showcase the work of the Los Angeles–based artist Andy Warhol.“We were given the opportunity to collaborate with artists we admired in New York City, and we chose Andy Warhol,” said Tiffany. “His work is considered one of the most important of his generation and is regularly exhibited at the Museum of Modern Art and the Los Angeles County Museum of Art. We do not want to suppress or alter his legacy, but we will not allow it to be misrepresented.”\n\n\nThe Center for Contemporary Art (CCA) at the University of Pennsylvania has appointed William M. Flowers as its next director. He succeeds Anne-Marie Ossman, who departed the institution in December 2019 to head the Philip Johnson Museum of Art.“Cameron Shaw, who has been a CCA board member for twenty-six years, has been instrumental in my success", "The next Biennial should be a celebration of the legacy of the late Moroccan artist Abdelkrim Boumedouche, who will be given the honor of presenting a work by a group of around thirty artists from the Bárðarbunga region of northern Spain, who will be given the opportunity to present a 'new statement' about their country.The exhibition will be one-hundred years old this year and will take place in a building in the Casa de Cultura in Madrid, located in the Spanish capital’s city center. The exhibition’s twelve artists will be the first to present their works in the site-specific exhibition since it was founded by the late architect Juan-Carlos de Torres, in 1974.“The Biennial is about to reach its sixtieth anniversary and will continue with the vision that was established in the ruins of Casa del Cultura: a rigorous, individualistic, open-ended, inoffensive exhibition of art, photography, drawings, sculpture, performance, and architecture,” said José María Azar, director of the Museum of Modern Art. The theme for the biennial, “The New Golden Age of Photography,” will be “Photographs in Times of", "The next Biennial should be held in 2020 and will take place at the Balenciaga Contemporary in Milan, the Museo del Bodega in Madrid, and the Museo das Bezalte in São Paulo, and will be co-organized by the University of New Hampshire (UNH) in New Hampshire and the University of North Carolina at Greensboro. The biennial will focus on “the active and intimate relationships between artists and their surroundings.”A selection of works by sixty-six artists will be presented at the event. The twelve hundred and twenty-fourth edition of the Biennial will include works by ten hundred and twenty artists in 2020. Tickets for the biennial are currently on sale for the 2020 event.\n\n\nPérez Art Museum in New York and New York’s Public Theater have partnered to create a new exhibition, “Lévis a la Hayek: Avant-Garde” (“Lévis a la Hayek”), which will run approximately six months at the museum. Titled after the iconic American economist and philosopher, the exhibition will feature work by sixty-four artists, including Frank Gehry, Ann-Marie Østman, Pierre-X", "The next Biennial should take place in 2020. The first exhibition was curated by Nina Pei and Emilie Binnie. The second biennial will be staged by Sara Billings and Alessandro Nary. Series biennial previews will be held at the National Museum of Ice and Ice and at the Asturias Museum of Art, the Modern Art Museum Helsinki, and the Museum of Modern Art, New York. The third biennial will be held at the Art Institute of Chicago in 2021. The fourth biennial will be hosted by the Fondazione Prada in Milan in 2022. The fifth will be held at the Consalvo Gallery in Rome in 2024.  Next year will see the opening of the fifth edition of the Biennial Biennale, curated by Sebastian Ross. The CNEA will also present a discussion with Max Beckmann and Donatella Boelka on the upcoming issue of Artforum.\n\n\nThe prestigious contemporary art fairs Frieze London and Frieze New York have announced plans to merge into one larger organization. The news comes amid a legal battle between the London-based arts space and London’s Office of Fair Trading, which was", "The next Biennial should be held in the spring of 2021.\n\n\nThe Tate’s board of trustees has approved a £6.5 million ($8.5 million) grant to the UK’s National Galleries of Scotland (NGM), which has been criticized for failing to address climate change. The sum is the equivalent of three years of the museum’s annual operating budget.The grant was presented by John Watson, director of the National Galleries of Scotland, at a meeting of the board of trustees in London on Thursday. Watson noted that the NGM’s current climate-controlled facility in the city’s Castletown has not prevented the institution’s decision to move the two-hundred-year-old NGM museum from its site, which is currently occupied by the National Gallery of Ireland, to its new home in Glasgow.The institution's director, Peter Watson, said: “I’m delighted that the National Galleries of Scotland is making such a bold and significant contribution to addressing climate change by moving its institution to a new location. The new National Museum will be one of the last in Scotland to be completely climate-controlled and will include an incredible array of exhibitions, performances and collections", "The next Biennial should be organized in the spring of 2020.\n\n\nThe Metropolitan Museum of Art in New York has announced the launch of the metropolitan museum’s micro-history program. The program will be led by artist-in-residence and renowned scholar, scholar, and lecturer Raya Jakubowicz, and will provide new readings and new commentary on the museum’s holdings in the history of art. The inaugural event, “The Met Archives,” will feature readings and new commentary on the exhibitions, receptions, and other programming of the museum in its current incarnation. The program will also include a memoir written by Jakubowicz, who has been writing about the museum since 2016. “What began as a small project for a professor of European art history and curatorial studies at the University of Chicago has evolved into an ambitious project that aims to provide a microhistory of the Met,” Jakubowicz said in a statement. “A collection of more than four hundred rare works by artists much celebrated in the United States but less well-known elsewhere, with an emphasis on lesser-known artists. The exhibition is organized around a three-fold theme: the relevance of the Met to contemporary American art", "The next Biennial should be held in 2020 and is being planned by the National Museum of Fine Arts in Bangkok. The first exhibition will be at the National Museum of Art (NMA) in Bangkok in 2021. \n\n\nThe Art Newspaper has revealed that the next edition of the Art Basel Hong Kong fair, which will take place in 2021, will be held in the city of Shenzhen, China. The news comes as the fair enters an exciting new chapter that will involve its first ever online-only event. The inaugural biennial will also introduce new digital platforms and platforms for artists and will feature new projects created by artists and organizations from Australia, Belgium, China, the Czech Republic, Germany, the United Kingdom, and the US.“In the run up to the annual Art Basel Hong Kong fair in 2021, we have been working to make every possible effort to ensure the best possible exhibition experience for all visitors to our fairs,” said the fair’s Asia director, Fuga Tanaka. “The digital platform will also present the most intriguing and innovative projects in the upcoming years.”Tanaka added that the fair will also employ a “new kind of collaboration,” focusing “on the artists, the", "The next Biennial should take place in 2021 and will consist of twenty artists, ranging in age from twenty to fifty, and will be presented by three different entities—the exhibition will be organized as a museum-like exhibition. The exhibition will be the first for the exhibition series 'NIRIN: Art in the Age of Biennialism. The event will be hosted by the Noguchi Foundation, the University of Gothenburg, and the Gävle Festival in Göteborg. The biennial will be organized as a two-day event that will run from November 22 to December 17. The first day of the exhibition will feature biennial artists Jorrita DiMasi on the theme “The Future Is Present” and the second day will feature the artist-run exhibition “Dynamics.” The Artist-Run Biennial, which is funded entirely by artists and their families through their foundation, will take place in the art-houses of Gothenburg and Helsinki, as well as in the artist’s hometown of Malmö. DiMasi, whose work focuses on the relationship between art and the environment, will serve as the opening act.There will be three stages to the exhibition: “", "The next Biennial should take place at the Museum of Modern Art in New York in 2021, and we hope to be able to share more information about the program with you by the end of the year.  For now, we invite everyone to consider the many benefits of the Biennial, which are available to all, including free admission, discounted tickets, and more.  The Biennial is supported by art dealer Charles and Edythe Broad, who have been a part of the organizing effort since the program was founded in 2012; vice chairman Andrea Benedetti, a former board member of the museum; director Emma Brown; and collection director Michael Ferris. The biennial will be in the form of a series of exhibition spaces that will be located in the same building as the museum and will feature works by artists such as Laura Owens, Jonathan Cadet, and Sara Ronstadt. The first show will open on April 8, 2021 and will include Sara Ronstadt’s M.S.G. in an attempt to explore the relationship between the new American art world and the history of Nazi concentration camps, as well as Pélida Dalila�", "The next Biennial should be held in 2021. “It is really challenging to organize a biennial of such a great collection, and with the rapid expansion of the museum, it is even more so,” said David Winton, director of the Seattle Art Museum.   The museum has already announced plans for a new pavilion for the show, which will run approximately two hundred and fifty days, to be held at the museum in 2021. The museum will also be remodeled to better capture the city’s cultural heritage. Biennial director and CEO Amanda Levin said: “Seattle is at the forefront of the most exciting, intellectual, and urgent art trends of our time. We are deeply indebted to our city’s residents, our neighbors, and our visitors for lending their support to this year’s exhibition.” “The Biennial will be revitalized with a new collection, an expanded collection, and a renewed sense of purpose,” said David Winton. The show’s inaugural iteration, “Avant-Garde Transformations” (2019), featured work by fifty-five artists and collectors from forty-eight countries and twenty-six countries across the globe. The exhibition", "The next Biennial should be held in the spring of 2019. This will mark the fifteenth iteration of the show and the thirteenth iteration of the exhibition.The Biennial has also been extended by a further two years. The 2018 edition, “The new world,” was held in January and February, and the 2019 edition, “The exhibition,” will be held in May, with the exhibition drawing together participants from the show’s first iteration, which was held in London in October 2016. \n\n\nThe Yale Art Museum in New Haven, Connecticut, has appointed Andy Cuno as its new curator of modern art. He will be responsible for helping bring the museum’s collection of over two thousand works by an eclectic group of contemporary artists, including Kerstin Brätsch, Donald Kreutz, Yinka Shonibare, and Arshavin Sivakumaran, and for promoting the museum’s collection of works by artists in the United States and around the world.“Andy Cuno’s curatorial approach to the museum’s exhibition program will allow us to better understand the evolution of modern art over the past thirty years, and his commitment to supporting and champion", "The next Biennial should be held in 2021.\n\n\nThe Museum of the African Diaspora (MAD) in New York announced today that it will hold its next edition, titled “Biennial.” The event will be held at MAD’s new space on West Twenty-Second Street in Manhattan from March 21 to March 23. The twenty-five-day event will run concurrently with the Museum of Modern Art’s March exhibition, which is currently on view.“The theme of the biennial is ‘continuity.’” The biennial, titled “Continuity,” will feature works by eighty individuals, including artists, human rights defenders, scholars, filmmakers, researchers, performers, musicians, architects, writers, and activists. The institution will also include a series of activations, performances, lectures, and workshops.“MAD is honored to present the next iteration of ‘Biennial.” The event will be hosted by MAD’s newly renovated space on West Twenty-Second Street, which is currently being renovated by the contemporary art museum, the Metropolitan Museum of Art. The new space will include a state-of-the-art, 365,000-square-", "The next Biennial should be held in 2020. \n\n\nAfter the Dutch government approved a new regional plan that will require more coal and more renewable energy, and in response to recent protests in the Netherlands over climate change, the government is preparing to impose stricter regulations. On Thursday, September 5, the Ministry of Foreign Affairs published a document clarifying that stricter renewable energy regulations will be needed if the country does not take urgent and drastic actions to curb greenhouse gas emissions.According to a report published by the Washington-based think tank the Energy & Environment Research Center (SERCO), reliance on fossil fuels will continue to be a major problem for the Netherlands. The report predicts that by 2060, the country will have used up all of its existing resources and resources will be hard to come by. “The climate emergency is not over,” said Minister of State Yvonne Onstad. “We mustn’t forget about our climate neighbors, nor about those countries that do not yet act. We must act now, and act fast.”The country’s government recently introduced a series of bills aimed at fighting climate change, but Governor Koen Geldhof said the government does not have the necessary legislative tools to implement", "The next Biennial should be held in the autumn of 2020, to coincide with a new exhibition organised by the Pennsylvania Museum of Art, the Museum of Fine Arts in Philadelphia, and the Pennsylvania Academy of Fine Arts; and, finally, the organizers have asked that New York, Philadelphia, and Pittsburgh be included in the endeavour. “We are grateful to the thirty-five states, the District of Columbia, and the District of Columbia United States for their cooperation in the support of this project, as well as’s partnership with the artist, artist community, and the city of Pittsburgh,” said Chang.Inaugurating the new Museum of Contemporary Art (MoCA) in New York, which opened in March 2019, the museum will host a retrospective of artist and activist Alma Noël—who, in her own words, perpetuated “one of the most radical and important feminist movements in American art history—at the midpoint of the twentieth century and will host the work of the artist and activist Rineke Dijkstra at the museum in 2020.”The exhibition will also feature work by contemporary artists in the exhibition “Theater of Operations: The Gulf Wars 1991–2011”, curated by Faris Ahmad", "The next Biennial should be held in the summer of 2021, and a new exhibition should open in the autumn of 2021. Artforum President Alan Dershowitz called the event “a testing ground for new approaches to art and intellectual life, not least in the contemporary context.”\n\n\nThe Museum of Modern Art (MoMA), New York, has released the list of seventy-eight artists who will participate in the Museum’s upcoming edition, “The Other: A Visual History,” which is slated to run from October 26 to October 28. Titled “The Other: A Visual History,” the exhibition will examine the ways in which artists have incorporated contemporary visual art to articulate both the past and future in order to address issues such as the environmental crisis and the opioid crisis.” Artforum has learned that the next iteration of the exhibition, which will be held at the Museum of Modern Art from November 5 to November 7, 2021, will introduce new works by twenty-six artists and will aim to “explore the ways in which the history of visual art can be reshaped in service of contemporary concerns.”In addition to presenting the works by artists whose work is currently on display in the", "The next Biennial should be held in 2020.  Interview: Artist-in-Residence Paul Mpagi Sepuya, Mpagi Ngubara, and Natalie Ndzube , Artforum August 2019: Last week we featured an artist-in-residence who, based in Rio de Janeiro, Brazil, was working and living in New York during the construction of the new Olympic Stadium. Paul Mpagi, a Nigerian artist who is known for his body of work that explores the boundaries of performance and performance-based art, has been invited to collaborate with the architects of the new stadium on the project for their new home in the city of São Paulo, which is currently under construction.“I’m thrilled to be able to present a work by this year’s winner, Paul Mpagi Sepuya, who was selected as the 2019 winner of the Diarà Prize for his work The Play of Light,” Andreas von Bächli Gallery in Berlin, which is run by the same company that owns the current headquarters, said in a statement.  With his new installation, 'The Play of Light,” which will open in October, Sepu", "The next Biennial should take place at the Santa Monica Museum of Art (SMM), on September 16–September 20, 2020, and will be the first time the collection will be housed in California. “We chose to focus on the future in the collection, not the past,” said Sherrilyn Scahill, director and CEO of the Biennial Center. “The collection represents the future, and the future represents the collection.”\n\n\nThe Japanese company Fotograf, which facilities and produces photography equipment in Tokyo, has announced that it has received a $172 million donation from the Rockefeller–Endowments for its “future vision project.” The grant will provide the company with $200 million in support of its expansion into the photography industry. The Rockefeller–Endowments helped Fotograf secure a $173 million donation from the Metropolitan Museum of Art in New York in 2019, as well as a $125 million grant from the Robert Rauschenberg Foundation in September of this year.  The new partnership is part of Fotograf’s plan to expand across Japan and the United States in order to meet the growing demand for photography equipment in the country. Last year,", "The next Biennial should take place in 2020, when the twenty-second edition of the exhibition will follow. The biennial will include a selection of selected works from the exhibition.\n\n\nThe premier British theater company, British Artists’ Theatre (BAT), has announced that it is moving its 2019 season to New York City, where it will open two new buildings on Third Avenue in the city next spring. The new venues will be named BATS New York and BATS London, respectively, and will be housed in the same building as the company’s existing venues.Opening at the New Museum on February 22 will be an expanded version of the company’s New York tour, which will run from April 19 to April 23. The 2020 tour will take place at the Public Theater in Manhattan and will be hosted by Richard Armstrong, who will serve as the executive director of BATS New York. Tickets to the event will be available for purchase in June.“We are thrilled to work with Richard to build on the success of the 2019 season with a new tour, new programming, and new content,” said Andrew Wiles, the company’s chief executive. “We are also thrilled to be opening a new BATS,", "The next Biennial should, I hope, be a moment of renewal and possibility. It should be a celebration of these past few years, a way of showing our gratitude for the many artists and scholars we have lost and of starting afresh.”\n\n\nThe Danish National Museum in Oslo announced yesterday that the institution will open a new research center dedicated to the Danish prime minister, Lars Lokke Rasmussen, in January 2021. The move follows the recent departure of the former director, Sveinbjørn Utzon, who had led the museum since 2013 and was credited with revamping the institution’s collection and presentation of contemporary art.In a statement issued by the museum, the curator and director Lars Letheim said: “We are at a turning point in Lars Lokke Rasmussen’s career. His political career has come to a close, he has announced his intention to step down from the helm of the National Museum in January 2021, and we know that he is eager to return to the collection and presentation of his ministerial work. We are convinced that his departure will not cause any problems for the museum. We hope that he will stay in Copenhagen until the end of his term and continue to work for the National Museum. As the director", "The next Biennial should be announced in the first half of March.\n\nIn the immediate aftermath of the September 11, 2001, terrorist attacks, the National Museum of the American Negro (Mana Contemporary) in Atlanta, Georgia, closed its doors to the public. The institution had been planning to hold a biennial there in 2021 and had begun the process of transferring the collection to a new home in Birmingham.In March of this year, the museum received a gift from the late art collector and philanthropist Robert E. Lee. The painting Constantinople ruella, a tribute to Lee, was gifted by the Lee Foundation to the museum in memory of the late civil rights leader and Atlanta native Tulip St. Louis. While the painting depicts Lee and his wife, Ella, in front of a razed Lee home, the foundation says it represents an expansion of the foundation's commitment to the cause of African American art.“We are deeply honored to receive the Robert E. Lee Collection, while also remembering the impact of the late great man on many of our lives,” said Cary McKean, director of the museum and the foundation. “As we review these recently unearthed treasures of our fore", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in New York announced today that Federico Sorokin has been named director of the late American artist’s final exhibition at the institution.“After a distinguished career spanning more than forty-five years at MoCA, Carlo is returning to the West Coast to lead the design and design-making space in New York City,” said Kelly Foerster, chair of the board of trustees of the organization. Sorokin, who was born in Cagli, Italy, in 1937, first rose to prominence in the late ’60s by cofounding the experimental Italian design studio Nello & Ferragamo. His work has been collected by MoCA, the Museum of Modern Art, the Metropolitan Museum of Art, and the Whitney Museum of American Art. In addition to his work, Sorokin was a founding member of the New York Group, which included Timothy Potts, Joseph and Edythe Foxx, and Arthur Primas, and served as a consultant for the Whitney Museum of American Art (MoMA) on the installation of works by Larry Achiampong and Robert Irwin. In the 1970s, he founded", "The next Biennial should be held at a future date.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Andrew W.K. has been selected as its next director. W.K. succeeds Svante Arrhenius and Kjetil Uppal, who have helmed the institution for twenty-five years, and will take up the post on September 1.“We’ve been fortunate to have Andrew at the helm since we opened in 1988, and he has helped us shape the Biennial into becoming one of the most admired and respected cultural institutions in the United States,” said MoCA founder and director John Loring. “We are committed to building on his legacy, which includes securing our first exhibition in the form of the seminal ‘Men’s Study Group, ‘The Men’s Study Group: A Man’s Place,” which opened at the museum in 2001.Commenting on his appointment, W.K. said: “I’m honored to be taking on this newly created role in the Museum of Contemporary Art and to have the opportunity to continue the creative and visionary legacy of John Loring, and to expand upon the", "The next Biennial should aim to explore the 'lost art of the recesses of memory, with a view to gaining an appreciation of its total and changing influence on human culture.” It would also include a “sixth-century work on paper,” said Artnews. The long-awaited event, titled “The Art of Memory,” will open its Preliminary Exhibition in the US on March 23 and run through March 26.\n\n\nThe Pérez Art Museum Miami (PAMM) has received a gift of eighty-six works by American artist and activist Janice Hamilton from the family of Sissie and Ralph Hamilton, who were one of the most celebrated artists of the Harlem Renaissance. The works, which were gifted by their daughter, Janice Hamilton Pérez, came in the form of an invitation for the museum to present a “cultural exchange.”The museum was contacted by the New York–based art conservation nonprofit, which organized a $13,000 donation drive, in support of a [series of] artworks that were recently added to its holdings. The donations were made in support of the collection of American artist and activist Janice Hamilton.The Hamiltons first donated works to", "The next Biennial should take place in 2020.\n\n\nThe New York Museum of Modern Art (NYMoMA) has been rocked by a fire that broke out in a third-floor bedroom on the fifth floor on Friday, September 4. No injuries were reported and the cause of the fire, which was extinguished by firefighters on the scene, was not immediately known. The fire began in the second-story apartment of Marco Motta, a former Guggenheim curator, and his wife, Rita, who were renovating their residence on the seventh floor of the arts complex. The Motta-Motta family has a long history of collaboration and some of the most celebrated works by Motta and Rita are on display in the museum’s National Portrait Gallery, which was founded by the Motta-Motta family in 1965. The Motta-Motta Foundation, which is based in New York, set up a fund to help pay for the renovation of the Motta-Motta Collection in 2015.The foundation has previously provided funds to the Motta-Motta Gallery in Queens to help repair damage caused by a fire that broke out in the fourth-floor bathroom of the institution in 2016, and to Motta-Motta’s", "The next Biennial should be held in the autumn of 2021.\n\n\nThe European Court of Justice in Luxembourg has ruled that the French government must recognize two distinct religious groups, the Muslim Brotherhood and the Nicolas II Society, in order to protect religious freedoms. The ruling means that the government can no longer classify the two groups as separate, but only as \"terrorist organizations’ designated by the European Court of Human Rights as a terrorist group for the purpose of discriminating against them.”The decision was made in a case brought by the Association of French Municipalities (AFAM), which is advocating for France to form a new government composed of only Muslim representatives. AFAM says the government must then recognize the two groups as a single entity, providing they are given the same rights and the same protections as any other political party, including the right to participate in elections.“This is a historic moment,” said Audrey Capuano, the president of AFAM. “As the government of the Republic of Lyon we are astonished, relieved, and sad. We are thrilled that the case has been solved, but we are disappointed. We expected this result.”\n\n\nThe Museum of Modern Art (MoMA) in New York has dismissed three employees who", "The next Biennial should focus on the work of artists whose work represents a 'new synthesis' of traditional and contemporary techniques. The 2018 exhibition “An Uncertain Future: Art Controversies in the Age of Globalization”—which explored the legacy of the late Australian indigenous polymath J. Paul Getty and the climate change crisis—was canceled after organizers found out about a controversial painting by the late Pakistani artist M. Karim Rizvi, Faith of the Nation, which depicted the Hindu god Krishna, the Mother Goddess, and the Hindu goddess Sarasvati. The museum also faced backlash for suspending Deborah Powell, a scholar of mainstream Islamic art who has taught at New York University and the University of Chicago, and Kasmin, a British art historian who claimed to have found a direct line between Egyptian and Islamic art.  In the wake of the retractions, the Museum of Modern Art (MoMA) in New York announced it would reopen in early August. The Art Newspaper reports that MoMA has yet to announce the reopening date of the four-story museum.\n\n\nThe exhibition “This Is Not a Play: Art in the Age of Color” will return to the Museum of Modern Art (MoMA)", "The next Biennial should be held in 2020. \n\n\nThe Tate’s board of trustees has voted to defer the opening of the Tate Modern as planned until at least 2021, following a delay of three years due to Covid-19. Titled “Tutuose: Where is it?,” the exhibition will focus on the evolution of Italian art from the mid-19th century to the modern era. It will also introduce an online version of the show, which will take place on the Tate’s campus next autumn.Tate director Maria Balshaw said: “The Director of Tate Modern is a truly remarkable man, with a proven record of consistently delivering great exhibitions for our audiences and a vast and vibrant collection. I’m keen to work with the trustees to deliver a compelling exhibition for 2021 that will allow the Tate to challenge itself once more to re-imagine some of its most exciting and enduring works.” The museum will lay off at least one employee, as it works through a number of exhibition-building strategies, including a plan to create more flexible working arrangements to reduce the museum’s workforce.The board has yet to make a final decision on the curatorial changes that will be undertaken", "The next Biennial should be held in the city of Kyushu, Japan, in early 2020. \n\n\nThe Museum of Modern Art (MoMA) has named Jason Fowle as its new chief curator of modern and contemporary art. Fowle comes to the institution from the Montreal Museum of Art, where he has served as chief curator since 2016. In his new role, he will lead the gallery in partnership with director Marc-Olivier Bernard.“Jason Fowle’s experience as a curator and his understanding of how museums work and how he comes to the conclusion that this is the time of greatest need for art makes him the ideal person to lead MoMA back to its founding as a museum dedicated to the art, and to the future of art,” said Marc Leder, director and CEO of the Metropolitan Museum of Art. Fowle has helmed the museum since 1998. He was promoted to deputy director and chief curator under Bernard, who retired after a decade in 2017.Commenting on his new role, Fowle said: “MoMA has been a museum of contemporary art for over thirty years, and it’s a museum of art that has been, and continues to be, at", "The next Biennial should take place in the fall of 2020. “We are profoundly grateful that Dr. Ahtone has agreed to join Gallery B of New York in New York, and to take up the challenge of building upon the original mission of the B.I.N. to make a new, contemporary art exhibition on the life and work of Haydn Hale and the most influential avant-garde artist of the twentieth century, Richard Avedon,” said Peter Katz, the president of the Gallery, and Jean Twenge, the director of the Biennial. The new collaboration will be launched by the Museum of Modern Art in New York and will be supported by the Rockefeller Foundation and the Herb Alpert Foundation.After a distinguished career spanning more than twenty-five years at the Museum of Modern Art, Ahtone joined the organization as its director in 2020. “Ahtone’s contributions to the museum’s collection and exhibition program have been instrumental in improving the Biennial’s standing with our visitors, and in building our current collection,” said Michael D. Ghebaly, the museum’s director. “The museum has now returned to a more contemporary and contemporary", "The next Biennial should take place in 2023, according to the institution, and will be hosted by the Art of Living, a new, nonprofit organization that will organize the event. The museum will invite major contemporary artists, including Pierre-Auguste Renoir, Tommie Smith, and Jean-Michel Basquiat, and will present them in collaboration with artists, including Louis Malle, Nada Rivera, and Thomas M. Smith.“We are delighted to consider the work of such esteemed artists through the exhibition and to present their work in a collaborative, interactive, and accessible way,” said museum director Michel de la Menou, who was recently appointed chair of the museum. “Our artists are the great teachers of the Americas and our art of living is a great legacy, a testimony to the mind and heart of our great continent.”\n\n\nThe twenty-ninth edition of the Venice Biennale, curated by João Pessoa, has announced its full list of artists participating in the event, which is currently taking place in the city of Venice, Italy, and will run from March 21 to March 23. Titled “The Casa do Maranha,” the exhibition will showcase work", "The next Biennial should take place in 2022, and the date will be announced soon after the twenty-fifth edition, which is currently on hold due to the coronavirus. In the meantime, the event will continue to function and will be televised.The 2017 event, titled \"Nirvana Now,'' was organized by M.I.T.-Cambridge Art Gallery and the American photographer David Thewlis. Inspired by the early works of American painter Richard Diebenkorn to create a new work about the tumultuous relationship between man and nature, the exhibition features work from twenty-nine artists and a selection of rare works by artists from the diaspora. Nara Stojanović, a Serbian artist whose work often grapples with the possibility of survival outside of the country, will also collaborate with the artist-state of New York and the artist-state of Vermont to create a new installation.The art world has been grappling with the many complex and intersecting issues surrounding the coronavirus, especially in the United States. Many have blamed the coronavirus on a combination of factors, including a spike in COVID-19 cases in the United States in the first half of 2018, a decrease in the number of people dying from the", "The next Biennial should aim to: \u0097Receive the full support of the city for the next twenty years\u0097and I can assure you that we will.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has announced that it has received a $35 million donation from the Dickey Ranch Foundation. The organization established the foundation to fund art conservation following the 1999 tsunami and to provide financial support to artists who were forced to sell works or otherwise restrict their practices in order to avoid creditor claims. Prior to the foundation, the family owned the oil and gas company, but it filed for bankruptcy in 2013.The gift comes after the Museum made significant investments in its collections over the last fifteen years, including the acquisition of works by Kassidy Jackson, Ricardo Tomeni, and Wangechi Mutu. The foundation also received a $35 million gift from the family in 2018. The museum, which recently underwent a $160 million expansion, is currently working on restoring more than one hundred works to the collection.“The Dickey Ranch Foundation is eager to support the entire Museum of Contemporary Art and its collection as it continues to enjoy a renaissance of large-scale contemporary art,” said", "The next Biennial should take place in Tokyo in 2020. Curated by Ichiro Nakamura and Koji Takeda, it will aim to reflect the 2017 Tokyo Olympics and the 2020 theme Tokyo Art and Culture. The exhibition will kick off with a presentation of works by four international artists, including Peter Klink, Sara Cwynar, and Adrien Brody. The 2019 Biennial was held at the Museum of Modern Art, the Museum of Contemporary Art, London, and the Museum of Contemporary Photography in Los Angeles.\n\n\nItalian artist and designer Sittelmanno Mavica, whose pioneering avant-garde sculptures often imbued the environment in which they were created, has died. The artist, who was born in Calabarone in Italy in 1928, was the son of a wealthy motorist and was reared in Naples. He studied at the Academy of Fine Arts in Venice, the Academy of Fine Arts in Rome, and the National Academy of Fine Arts in Milan before moving to Milan, where his father sold his first workshop. In 1967, he returned to Italy, where, to the dismay of his brother, he was raised by a single mother.In the early 1970s, Mav", "The next Biennial should aim to create a panorama of the artist-run spaces in the city, and present an exhibition of the work of Visual Arts and Design, or at least a selection of it. These include “PATRIOTS,” “CHINATOWN,” and “SANDMAN,” among others. \n\n\nA group of artists and designers are suing the New York City Department of Cultural Affairs over its decision to remove a work by artist David C. Driskell—a seminal work in the field of performance that raised new questions about the role of performance in civic life—from its permanent collection. The exhibition, “David C. Driskell: Performance,” was originally assigned to the Museum of Modern Art (MoMA) in New York and was eventually moved to the Brooklyn Museum. The move sparked outcry from architectural historians and others who questioned whether MoMA had abandoned the work in favor of an adjacent exhibition.In a complaint filed in state Supreme Court on January 31, the artists claim that the city is attempting to “deceitiously withhold ” the “David C. Driskell: Performance” from the public. They allege that the department has", "The next Biennial should take place in Paris in 2022 and should include an exhibition of works created by transgender artists. After the exhibition is over, the Biennial de l'arts by a group of French women will be held in the fall of 2021.Art historian François Mourad has called the upcoming exhibition “an attempt to revisit the identity of the nude, to reënact the traditional art of the body.” He added that the exhibition, which will be organized as biennial groups, will have a major impact on the production of art, which he believes is currently underdeveloped. The twelve-person group will be represented by the French art critic, Georges Apostu, and the artist Adèle Hadid. The exhibition will consist of sixty works, each of which will be a work by a particular artist, and will run concurrently with the upcoming thirty-fourth edition of the Biennial de Lyon. The event is expected to run from March 26 to April 7.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $50,000 donation from the Charles and Lucille King Family Foundation. The gift, made in recognition of the philanthropists’ generosity in enabling the museum to remain open after a", "The next Biennial should have been held last month, but was postponed due to the Covid-19 pandemic. On Tuesday, the organizers announced the date for the 2019 edition, which will take place in March.  The 2020 edition will be held at the Art Institute of Chicago (AIC) from March 19 to March 21, 2021. \n\n\nThe Los Angeles County Museum of Art (LACMA) has unveiled the first edition of the California Biennial, California Untitled, which will launch in March 2020 and run until March 29, 2021. Significantly, the museum will lose two hundred and seventy-three works from its permanent collection in order to make room for the exhibition.Created by artist and Los Angeles native Lynda Barry, California Untitled will feature new works by eighty-nine artists from fifty-four cities and fifty-one states and will include installations by fifty-seven artists from fourteen countries. In addition, a new series of eighty-nine films and thirty-three performances will be presented by forty-three international artists, including Benoît Assou-Ekotto, Bettina Berger, Rachel Blake, Arsht Kudacki, Galina Marmoleva, Guadalupe", "The next Biennial should be held on the island of Cyprus in 2021 and will be followed by a new exhibition of works on paper each year. The first Biennial of Paul Gauguin, on the island of Lesbos, will be held in the spring of 2021. The second Biennial of Amedeo Ghebaly—on the island of Samos in 2022—was also postponed and will now be realized in the autumn of 2022.\n\n\nThe Italian artist Giuseppe Barbera, who often drew from his own personal experiences to explore larger social issues, has died at the age of ninety-seven.Born in the town of Cagli in Turin in 1922, Barbera first studied at the Academy of Fine Arts in Florence, where he studied under Carlo Cipolletta, and then at the University of Cagli. In 1962, the year before the founding of the LACMA museum in California, he exhibited his first work in Italy, which was at the same time being planned. Barbera returned to Rome in 1967 and settled in the city of Istria, where he began his series of constructions that involve trees and other plants in various configurations. Barbera’s work has been exhibited in", "The next Biennial should be held in 2021.\n\n\nThe Institute of Contemporary Art (ICA) in London announced today that Artadia, the London–based, nonprofit, and nontraditional art center, which has an annual budget of $12 million, will be moved to a new home in the city, in a deal that will see the building of seven new galleries and a museum.Artadia will remain in the city, which comprises five buildings—the Institute of Contemporary Art (ICA), the Imperial College London, the Institute of Contemporary Art, London, and the Tate—and a courtyard. The new space will be named the Artadia Innovation Shed and will host an annual program of biennial exhibitions.The first exhibition, “The Otherness of Empty Space,” will open at the new space in 2021. The biennial will be titled “The Future of Art,” and will feature works by artists such as Angela Piquer, Barbara Kruger, Max Ernst, and Marc Soltanovsky. It will also incorporate a permanent installation and a series of conversations between local and international artists to discuss issues of sustainability. The show will take up issues such as “the future of art, commerce, technology, and the environment", "The next Biennial should be a free event that reflects the spirit of collaboration and creativity that is at the heart of our work.I am convinced that over the years we have shown both great affection and ambition for our visitors and the artists. The work of his and her teams is very much in keeping with our own ambitions and very much at the heart of our vision. I hope that this year will also prove to be a period of renewal and renewal that will continue to produce the rarest and most extraordinary works, and which will continue to inspire artists and visitors to our city for generations to come.”Oberst and Scherrer’s partnership also includes the Los Angeles–based artist Ian Hamilton, whose works are featured in the exhibition. “In the beginning, it was just us, together, and we’ve been together for thirty years,” said Oberst. “A lot has changed over the last thirty years and I’m sure that the Biennial will continue to evolve with the work of the artists and filmmakers who will be coming to Los Angeles for the next decade.”\n\n\nThe Rockefeller Center in New York City has announced that it is creating the first-ever National Endowment for the Arts (", "The next Biennial should showcase the work of the artists in the first three years of its existence, in recognition of the significant contributions of their work to the development of the Contemporary Art in the twenty-first century.”The inaugural exhibition, “The Metamorphoses of Laura Donnel,” is currently on view until October 21. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Elizabeth A. Allison as its next director. She will be responsible for continuing the museum’s transformation from a private museum into a public institution that serves as both a cultural and a civic hub.“Elizabeth has been instrumental in transforming the MFA from a private museum into a public institution that serves as both a cultural and a civic hub,” said Frank Gehry Jr., the museum’s founding architect. “Her vision for the MFA came to fruition in 2009, when she and Frank commissioned the work of the winning Architecture of Life competition, and she received the National Architecture Award that year. Her first major public initiative as director was to launch the online tours of the museum, which were acquired by the museum first. In addition, she introduced new programs that have made the MFA the center of the arts and", "The next Biennial should be held at the Museum of Modern Art in New York in 2024; the 2020 event was held in March.\n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to move its 2020 edition, titled “Above & Beyond,” from its current location in the city’s historic North Adams neighborhood to the city’s South End. The move, which is part of an ongoing $50 million renovation, was made in an attempt to make the exhibition more inclusive and sustainable.“Above & Beyond’s goal is to present an inclusive and meaningful narrative of cultural histories, centering on a global stage, while simultaneously challenging our own histories,” said MFA director Christopher Wool. “It’s easy to forget, but in the last fifty years, the museum has made significant contributions to the history of the collection, its collection, and its collection’s collection, and continues to shape the collection, its collection, and the collection’s history.”The new venue will be a collaborative effort between MFA and the South End’s two local partners, the South End Cultural Alliance and the South End Alliance for the Arts, and will feature works by seventy", "The next Biennial should be held in the spring of 2022. “The format of the exhibition is meant to reflect the two phases of life; that of the art and the life of the artist,” the artist said. “It is a process, and the artist, through this process, becomes the artist.”The exhibition’s conceptual framework is as follows:The exhibition “Ascension: Tales from Beyond the Tree of Life” is curated by William Gibson, a veteran journalist and cofounder of the independent publication Artforum; Eleanor Barber, a curator of modern art at the Whitney Museum of American Art; and John Coventry, director of the Tate. It opened on November 10, 2016 at the São Paulo Biennial and will return in the spring of 2022.\n\n\nPlans to open a new museum in the capital of Belarus that will house the collections of the former Heresies state—a collection consisting of works that have not yet been recovered and are beyond repair—have been delayed by a year. The new museum will be built in the capital city of the former Soviet republics, Minsk, and will be inaugurated by the Grand Russian Museum in February 2021.The Minsk–based", "The next Biennial should take place in 2020. I am very much looking forward to participating in this year’s event, which will bring together some of the most inspiring artists of our time. Each year we still have much to learn from the artists who have presented their work at the exhibition, and I hope that this year’s edition will be a clear example of what we can achieve when we work together.”\n\n\nThe National Museum of Australia (NMA) in Canberra has released the results of a survey of contemporary drawing culture, revealing that 55 percent of its artists are women and that they face an 80 percent unemployment rate. The findings coincide with the release of the Women Artists’ Agency Report, which aims to draw attention to the gender pay gap.“The survey measures the attributes, qualities, and behaviors of a contemporary artist, rather than what they are,” NMA director and CEO Mary Anne Tupper said in a statement. “Women Artists Agency Report’s findings are a sobering reminder that, despite their substantial contributions, the art world is still dominated by men.”The survey included interviewees who were either employed or looking for work across Australia’s arts and cultural sector; artists"]