["The next Biennial should be held in the coming years.”The consortium comprising the National Art Museum (Nama), the Museum of Fine Arts (MFA), the Art Institute of Chicago, and the University of Pennsylvania, launched the $250,000 Biennial Walk in 2010 as a way for American arts institutions to make the trip to the United Kingdom to serve as a model for how an art biennial should be organized and staged. Its next iteration, titled “Beyond Sculpture,” will be held at the National Museum of American Art in Atlanta in 2022.\n\n\nThe nineteenth exhibition at the Fifty-Ninth Venice Biennale, “Between the Sun and the Moon,” will reopen at the Cultural Centre Venice in the coming weeks. The exhibition, which spans a period spanning approximately seven thousand years, was curated by Østfold Larsen and featuring works by nearly twenty artists, including Marie Brennan, Richard Diebenkorn, Tiago de Camargo, and Kiki Smith, as well as by artists from Eritrea, India, and Mongolia.“I want to thank all the organizers and the general public for supporting this show,” Danish curator Anna Lidén Hansen, who curated the show,", "The next Biennial should take place in the fall of 2020. For the first time, the exhibition will take place in the People’s Republic of China, and will feature works by artists from more than twenty countries. The exhibition will also include a selection of the artist’s recently acquired works.\n\n\nThe Museum of the Jewish People (Museum Zu) in New York has received a gift from Israel. The institution received the National Prize for Arts for Architecture in the form of a three-thousand-year-old work by the artist Naima J. Keith. The work, titled “JOHN HALL,” was created in the city of Ashdod in Israel in 1948. “We are honored to receive this gift from the State of Israel,” said Stephen L. Smith, director of the M. Zu. “The National Prize for Arts also demonstrates the power and depth of Israel’s network of donors and supporters. This gift demonstrates that the M. Zu’s international reputation and our breadth of expertise in the field of art can be tapped to facilitate the museum’s work.”Keith, an American-born Israeli artist, was awarded the National Prize in", "The next Biennial should be held in the city in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has added two new artists to its roster: Ruan Allen and Tom McCarthy. Allen, the founder of the New American Art Movement (N.A.A.M), was selected for the biennial’s 50th anniversary in 2017 and will inaugurate its inaugural exhibition, “Away,” on October 9. McCarthy, a curator and educator, is a critic and writer who has taught at many institutions as well as at several institutions in Japan. Both are represented by the Museum of Fine Arts (MFA).“In the twenty-first century, art has been galvanized by a new kind of crisis: climate change,” said cochair and cofounder of the biennial, Daniel H. Weiss. “From the onset of the crisis, Allen and McCarthy have collaborated in drawing attention to climate justice, while simultaneously illustrating the limits and limits of the other kinds of art. Together, these two artists have found new ways to make art accessible to an ever-changing world.”Over the course of their careers, Allen and McCarthy have created works that address issues of memory, climate justice,", "The next Biennial should be held in June 2020. \n\n\nIn a 1969 issue of Vanity Fair, a photograph by Robert Irwin, who was known for his drawings, sculptures, paintings, and prints, which were frequently inspired by the artist’s own life, was included in the top photograph competition of the year.The jury, which comprised novelist Harold V. King and artist Richard Avedon, awarded the prize to the photographer in honor of his partnership with the magazine with a $10,000 check. He was awarded the prize for his work The Man in the Shadows, which was included in the first edition of the Biennial. By presenting his photographs to the editors, he hoped to draw attention to the influence that artists had on his art. The competition was hosted by the magazine at a time when it was still considered a rarefied place, and the photographs were selected by a committee consisting of Zora Neale Hurston, Walter de Maria, and Elin Nordstrom.The 1965 exhibition “Refusing to Move,” which opened at the Walker in Minneapolis, was awarded the prize for its influential essay, “Avant Garde Art: Refusing to Move,” by Allison Pearson. The essay became a cornerstone", "The next Biennial should be held in 2022. “I’m so excited to see what the community will come together to create for the future of the Museum of Contemporary Art,” said Michael Cohen, chair of the trustees of the foundation. Since the museum is temporarily closed in a three-year cycle due to the Covid-19 outbreak, the board has convened a number of special meetings to determine the most appropriate timeline for its reopening. The board also voted to add a new chapter to the museum’s collection exhibition “The Black Collection,” which focuses on the work of a select group of African American artists. The exhibition will open in the museum on August 23 and run until September 23.The board also voted to extend the life of the museum’s current lease on the building. The museum’s current lease expires on December 31, 2022. During the board meeting, the trustees also discussed the possibility of moving the museum’s collection to a museum that would serve the community in a similar fashion to the Black Museum in Atlanta, which is currently under construction.\n\n\nNew York–based artist Jana Cantor has been named the 2020 recipient of the Turner Prize. Cantor, a Los Angeles native", "The next Biennial should take place in the spring of 2020. The eight-month exhibition will be divided into two sections, “Life and Art: From the Renaissance to the Present,” which will be on view until October 30 and “Future Art and Future History,” which will be on view until December 25. The event will be hosted by the museum at no cost to the public.  “The influence of Renaissance painting and sculpture on the development of the modernist, critical, and precapitalist traditions of art and design is felt most clearly in the work of the biennial’s first artist, Louise Bourgeois.”\n\n\nThe Brooklyn Museum in New York has appointed Tamara De Sousa as its next executive director. De Sousa comes to the institution from the Museum of Modern Art (MoMA), where she has served as interim director since March 2019. She succeeds Adrian Wojnar, who retired last month following a decade at the helm of MoMA.“I’m excited to welcome Tamara to our team and to the Brooklyn Museum,” said director Michael Govan. “Working with her on the design and curatorial side of our business,", "The next Biennial should be held in 2021. \n\n\nThe Guggenheim in New York has released the first of sixteen artworks from the long-awaited The Weight of Others, a documentary about the weight of others, and the weight of our own experience. Originally scheduled for the 2018 exhibition, The Weight of Others, which opened on November 18, 2019, was postponed to 2021. The exhibition, which explores the weight of others through a series of interviews with artists, researchers, activists, scientists, and others who have lost close relatives or have suffered major physical injuries, was originally supposed to be staged in May of 2020. However, due to the Covid-19 pandemic, the exhibition was forced to be canceled. “For more than six years now, we have been working hard to re-create the weight of others in a documentary that is both meaningful and informed,” director Adam D. Weinberg said in a statement. “We felt it was important to explore the meaning of the weight of others through a series of interviews and paintings that demonstrate its suffering, pain, and tragedy. We hope that the work of The Weight of Others will help to bring somber attention to the conditions causing so", "The next Biennial should be in March 2020, with a keynote presentation on the next incarnation of the sculpture-filled dome. The 2020 theme is “The Place of the Body in Art.”The full list of participants in the event can be found here: The Biennial of Bodies will be held in the Museum of Contemporary Art, Los Angeles (MCA), from March 7–March 10, 2020. The event will include 50 international artists, whose work will be displayed in a series of pavilions, and will feature more than 1,200 individual works. It will also draw on the collections of the MCA, the UCLA School of the Arts, the Art Institute of Chicago, and the UCLA Art Museum, and will be held in the Museum of Modern Art, Los Angeles, and the Museum of Contemporary Art, San Francisco. The 2020 theme is “The Place of the Body in Art.” The exhibition will include works by artists including Antonio Campos-Girón, Amandla Castellani, Daniel Ghebaly, Elizabeth Dubin, Marcela García, Ana de Castro, Naima Iqbal, Luciana Marin, and Zineb Sedra. The exhibition", "The next Biennial should be held in the spring of 2020. Artforum had the opportunity to present a special exhibition of works by twenty contemporary artists whose work has been published by Diller Scofidio + Renfro in New York in the summer of 2018. The event, titled Artforum: The Next Biennial, was hosted by the Art Institute of Chicago on September 3 and ran from September 14 to September 16. The Biennial was also co-organized by the San Francisco Museum of Modern Art and the Institute of Contemporary Art, Los Angeles; the Museum of Modern Art in New York; the Museum of Modern Art, San Diego; and the Museum of Modern Art, Los Angeles. The exhibition was curated by Sarah Schroth, curator of contemporary art at the Museum of Modern Art; Vipa Vasava, director of the Museum of Contemporary Art, San Diego; Diana Al-Hadid, director of the Museum of Contemporary Art, Los Angeles; and Zoé Whitley, director of the Museum of Contemporary Art, New York.\n\n\nThe museum’s collection of more than twenty thousand works from the artist’s holdings, the late artist’s last major retrospective at the", "The next Biennial should take place in the United Kingdom, which is currently experiencing its largest reopening in sixty years, in 2020. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has hired Kate McKinn to lead the organization’s first global artistic program, “The Museum of Contemporary Art (MCA) Pacific Northwest.” The new initiative will focus on creating new works by local artists and will bring the works of local and international artists to MoCA, the Los Angeles County Museum of Art (LACMA), and the City of Los Angeles.“Kate’s years of experience in the art world and her desire to build on the Museum’s collection of contemporary artists come to MoCA through her advocacy for artists and their work,” said director James L. Cooper. “Our audience has loved her work for more than a decade, and now we look forward to paying her tribute.”Born in New York City, McKinn is a Los Angeles native whose practice spans painting, sculpture, video, performance, video games, and video games-based works, especially video games, and short-form audio and film. A graduate of the University of California, Berkeley, she has", "The next Biennial should take place in 2020. However, it is possible that a second edition of the exhibition will be held in 2021.The exhibition has received $5 million from the exhibitionists, the foundation, and the city of St. Louis, as well as a $2 million grant from the biennial’s organizers, in addition to an additional $1 million from the city of Kansas City and the Missouri Valley Regional Council, a group of civic and business leaders. The full list of sponsors is as follows:The biennial was co-produced by artist-in-residence Max Boucher and artist-in-residence Elyn Zimmerman, with work by forty-four artists. Boucher is a professor of painting and sculpture at Columbia College Chicago; Zimmerman is a native of the Windy City and the Kansas City area. In his exhibition “Ishikawa” (2018–19), Boucher exhibited 47 works, including work by twenty-seven artists, including Iwan Gormley, Ermanno Bocchino, and Matthias Bräckner. Previously, the artist-in-residence had staged exhibitions of works by artists such as Louise Bourgeois, Leon Golub, and Paul Gauguin.", "The next Biennial should be in 2022.\n\n\nThe J. Paul Getty Trust and the Metropolitan Museum of Art have ended their long-standing partnership with the controversial Islamic organization the Dawa Museum in Baghdad, which has been designated a terrorist organization by the United States. The DC–based charity the Asian Human Rights Commission called the move an “unacceptable” violation of the trust’s policies.The decision to end the partnership comes after the trust and the Met agreed to end their partnership for a period of fifteen days in March 2019. The decision was made in the wake of a series of deadly incidents at the museum, including the December 2015 shooting of twenty-six visitors to the museum by the Islamic State.When the partnership was first announced in 2009, the Met said that the partnership “gave us a great opportunity to work with and learn from the Dawa Museum’s staff. We are thrilled to have had this opportunity in order to further strengthen the partnership between the Trust and the Met.”\n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, is planning to open its first permanent location in Mexico City in 2021. The museum will be inaugurated by sculptor Nandi Martinez and will be housed", "The next Biennial should be held in the spring of 2020, at the Museo Autónoma de Barcelona.\n\n\nErika Lødahl, the Norwegian artist best known for her massive bronze monumental sculptures, which feature works that range in scale from one-thousand-thousand-thousand-thousand, is suing the Danish company that owns the rights to the work, the New York Times reports. Lødahl’s attorney, Anders Edstrom, told the New York Times that the artist is asking for $7 million in damages.Lødahl’s attorney argued that the Danish furniture manufacturer Jørgen De Waal had a contractual obligation to sell the work to a Danish buyer when the iconic structure was completed in 1987. The Danish artist’s lawyer claimed that the contract between the buyer and artist was breached by the company when the work was transferred to the Danish company in 2013.According to the New York Times, Lødahl will now be represented by Jonathan Goldstein in New York. The artist will continue to fight her case in Denmark before the Norwegian Supreme Court.\n\n\nThe Royal Academy of Arts (RA), the London museum and conservatorium, is announcing today that it will not renew the contract", "The next Biennial should be on the theme “From the Imagination to the Realities of the Realities,” which will bring together artists, intellectuals, researchers, and journalists from thirty-five countries and territories. Inaugurating the exhibition is “The Perils of the Real,” a project of the American artist Jonathan Demme that will be presented in partnership with the United States Agency for International Development (USAID), which will feature works by fifteen hundred American artists and designers.The inaugural exhibition was co-organized by the two Italian cities of Venice and Genoa, and was organized by the Venetian Ministry of Culture and the Italian Design Museum in Genoa. The exhibition will be hosted at the Museo del Montorsi, which inaugurated the exhibition with a program of interviews, sculpture, and performances. \n\n\nThe Cortez Museum of Art in San Antonio, Texas, has received a gift of eighty-three works by twenty-three artists—including Mies van der Rohe, Robert Irwin, James Turrell, and Peter the Great—from the late artist’s estate. Known for creating works that address both social and political concerns, van der Rohe and Turrell are among the artists who have donated", "The next Biennial should be staged in 2021.\n\n\nA group of artists and collectors have launched a project to create a new public sculpture of Pablo Picasso, the German-born American painter whose work is considered to be among Picasso’s greatest and most celebrated. Called The Painted Garden, the installation will be made of twelve hundred paintings, each representing a different mode of the artist’s approach to a given canvas.The works will be located in the gardens of the Museum of Modern Art in New York, the Museum of Modern Art in London, the Museum of Modern Art in New York, and the Museum of Modern Art in New York City. Each painting will be numbered and will be paired with a note in the form of a French greeting card signed by Picasso and signed by the artist.The artist will personally paint each canvas and each message will be accompanied by a gallery. The works will then travel to the Museum of Modern Art in New York to be exhibited in the first phase of “The Painted Garden,” which was commissioned by the artists in partnership with the Museum of Modern Art and will open in 2020. The exhibition will then travel to the Museum of Modern Art in London, and finally to the Museum of", "The next Biennial should include a completely re-designed exhibition space, with a new program that will take the viewer into the exhibition space and show them inside. The exhibition will also include a new performance series, a public sculpture garden, a reconstructed library, galleries that are currently closed, and new events and activities.The exhibition will be organized in three parts: Part One, Part Two, Part Three. The first part will be devoted to the history of contemporary art, and the second part will be devoted to the development of contemporary art through a rethinking of the relationship between artists and their audiences. The designer will be Koons, the curator will be Müller, and the art will be based on new models for exhibition design. The official theme of the biennial is \"Contemporary Art of the Present: Avant Gardes, Futurists, Surrealists, Modernists, and Artists Between.”\n\n\nBrad Jones, a self-taught photographer whose intimate and sometimes satirical portraits of pop and modern life captured a sense of humor and affection in their unconventional poses and their ability to extract meaning from everyday objects, has died at age seventy-one. His work has been collected by Sotheby’s, and", "The next Biennial should be in 2021. The 2020 edition, entitled “Making of the Modernist,” was held on March 5–March 6, 2020 at the Los Angeles County Museum of Art.The theme is “Rokos in a San Diego Cityscape” and the artist who will be featured in the event is Hong Kong artist and architect Kai Yuen, who created the Geh-Bradinger-designed San Diego Contemporary’s Pacific Palisades Park. “Hong Kong is an important setting for the Biennial,” said Miles Hurd, the director of the National Museum of Asian Art in Washington, DC. “With its rich history, diverse communities, and ancient architecture, it is a perfect platform for exploring modernism and pragmatism.” This is the third year the event has been held at the museum. Previous iterations of the event were held in 2005 and 2009.Hong Kong’s artist-led memorials movement began in 2008, when artists and activists took to the streets to protest a planned reopening of the Hong Kong Autonomous Special Economic Zone (HKS-ZEZ), a $2.5-billion zone encompassing more than three hundred industrial", "The next Biennial should be in 2020 at the New Museum. The proposal for the 2020 edition, which will take place at the museum in October, was founded by the New Museum and the artist Saureen Chiu, who is also the founder of the new collective Biennialists. The twenty-seventh edition of the exhibition will take place at the Modern Art Museum in New York in March 2021.\n\n\nJapanese researchers have discovered a new kind of endangered prehistoric plant, a tree that has only been identified as a type of bamboo, that lives just a few hundred miles from the site of the legendary tomb of the Emperor Takizawa, and that may be the only surviving example of the Japanese imperial palace. The tree, which doubles as a shrine complex and a study site for the study of Japanese art, culture, and politics, and was once planted by the late Japanese imperial artist and scholar Yoshitomo Nara, may also contain the remains of Japan’s first emperor, Emperor Meiji, who ruled from 1882 to 1889 and is revered in Japan as a founder of the nation.Nara’s bamboo palace, which is now managed by the National Museum of Fine Arts, Tokyo, is considered a masterpiece of modern Japanese art. The", "The next Biennial should be held on the occasion of the seventeenth of the year in the year of the birth of God’s son, Messiah. As a part of the program and in accordance with the wishes of the participants, we have decided to postpone the event, which will be held in 2021, and have instead selected 2019 for its twenty-ninth edition. “After considering the issues raised by the speakers and the artistic community, we stand by our decision,” said the organizers. The exhibition “was not only a great success, but also an attempt to advance contemporary art in the best possible way.” The 2017, which featured work by thirty-eight international artists at the event, was attended by over two hundred, including  Catherine Raiber, Tanya and Mark Grotjahn, Alexandre Laichman, Timur Meil, Odd-Lottery, Sydney Turner, and Suzanne Wehling. In the 2019 edition, which was held at the Arts Club of New South Wales in Brisbane, Australia, the show featured work by seventy-five artists. A selection of works from the test series, “The", "The next Biennial should be held in late 2019 or early 2020. \n\n\nThe Alberta Contemporary in New York has appointed Michelle Ashmore, the inaugural artist-in-residence of the institution, as its next executive director. She will take up the post on January 8, 2020.“Michelle is a seasoned curator and scholar with extensive experience in contemporary art,” said Mia Ashery, chair of the institution’s board of trustees. “Her extensive curatorial and research expertise in Alberta and New York and her proven provenance-based approach will be critical in enhancing the contemporary-art experience for our visitors to the Contemporary.” Ashmore succeeds former Chair of the Arts Barbara Wechsler, who departed the institution in May 2019 to head the Museum of Modern Art in New York. She succeeds Museum Curator and former Edmonton curator Joseph and Lillian Triconta, who collectively helmed the Contemporary for ten years.Commenting on her appointment, Ashmore said: “I’m thrilled to join the beautiful and vibrant Albertan Contemporary in New York. I’m eager to learn more about the extraordinary collection and the Albertan landscape. I’", "The next Biennial should be held in Tokyo in 2022.\n\n\n\n\nFounded in 1968 by Russell Hieb, Donald Ellis, and Mark Geiger, the New York Institute of Technology (NYIT) has become one of the earliest and most prestigious literary academies in the United States. Since its founding, the school has catapulted from being a ten-student operation to a fifteen-student operation that offers more than seventy-five courses a year. Focusing on the importance of the human body, the school encourages students to think of the body as an ongoing organism, and to question the notion of a body politic.NYIT offers one of the largest and most prestigious summer internships in the country. The school has hosted more than fifty thousand students throughout its history, and it has more than quadrupled its enrollment since it opened in 1972. In addition to continuing the school’s core curriculum, the institute offers a number of special programs as well as a number of studio courses. Among the studios is the My Body is Not for Sale, a free show for students at the school.In 2017, the school received a $50,000 grant from the Society of Arts and Design to continue its internship program. “The money is", "The next Biennial should be held in 2022, when the exhibition will mark the centenary of the birth of Modernism. A third exhibition, “Art and Social Change: The British After World War one”\u0097a celebration of the twentieth-century’s impact on art and society\u0097will unfold in the same location in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has unveiled the installation of new works by Paris-based artist Sora Foa, who was detained for trying to leave the country last month after he tried to gain entry by posing as an Immigration and Customs Enforcement (I.C.E.) agent at LAXART. The installation will feature works by the artist in the exhibition “Living in the Shadows: The Agency of Art in the Movies” (2019) at the museum.The new works, which were created in response to the prison violence experienced by Foa, will be presented as a series of films, interspersed with personal narratives that reflect on his experiences in the United States, including his journey from Mexico to the United States as a refugee in 2015. Foa’s work will be presented in conjunction with the opening of the museum’", "The next Biennial should focus on the contemporary relationship between art and politics in contemporary Europe. It should focus on how art and politics have impacted contemporary society and interconnecting discourses. And it should embrace contemporary criticism and its historical precedents as a way to consider the connections between art and politics and to consider the connections between art and society in the 21st century.”The organization will convene the first round of the $1 million prize in the United States in January 2021. The next iteration will take place in December 2022. The theme of the 2022 edition is “Art and Politics: Politics from the Life of Dora Simons,” a collaboration between the artist and curator Léa Adams, who also curated the 2015 exhibition “Earth to Roch Pinchuk,” which was staged at the artist’s former studio in New York and consisted of three works by Simons.“The Biennial is an extension of our vision of what an arts space should be for contemporary politics and culture,” Gillian Richards, chair of arts and politics at Tate Britain, told the Art Newspaper. “The themes of this year’s Biennial are political, scientific, and geographical, and we look forward", "The next Biennial should be held in the second half of the year, and the first in March 2021.“We are grateful to the organizers and staff of the Biennial for their great work in preparing the exhibition for its twenty-fifth edition in Art Basel Hong Kong,” the show’s Hong Kong representative, Yaw Yee Ho, said in a statement. “After this remarkable exhibition, we hope that the Biennial will become a symbol of Hong Kong’s vitality and develop in ways that will make it a strong influence in shaping the city’s future.”The Hong Kong pavilion will be inaugurated by a selection of artworks from the exhibition “Asian Art,” which will encompass forty-five artists from China, Japan, Korea, and Taiwan. The show’s opening reception will be held on April 7.Hong Kong’s Wong family will pay tribute to the artist in honor of the artist’s birthday. His son-in-law, Kuk-Wong Wong, will present a solo exhibition of his work at Wong Art Museum on April 10.The Hong Kong Biennial was founded by Wong and his wife, His Excellency Wong Chiu,", "The next Biennial should be held in 2021, when the exhibition will celebrate its ninety-fourth anniversary. The next edition will be organized as a “multinational exhibition,” which will include the first show in the new 300-seat, ten-story building, the Rijks-Australia Pavilion, a new spatial design by Koons, and more shows by artists including Luis Buñuel, Lars von Trier, and Pierre Cardin.The 2019 event, titled “Fight or Flight: Biennial of Human Rights” and curated by the Roger Birkin-designed Biennial of Arts and Design (BADA), was held at the New Museum in New York from November 22 to December 11. The biennial features work by twenty-one artists, including Birkin, Kate Hoehn, Christina Kahane, Joseph Beuys, and Harry Callaghan. The award ceremony was held at the New Museum on January 3.“The impact of our exhibition ‘Fight or Flight’ is felt around the world, and we are grateful to be able to celebrate it with the inaugural exhibition at the Rijks-Australia pavilion at the Australian National Gallery in Canberra,” said curator and biennial director Jan-Erik", "The next Biennial should be held at the New Museum, in 2021; the Kunsthalle Konstanz in Berlin, in 2022; and the Museum of Modern Art, in the United States, in 2023.\n\n\nThe Geneva Architecture Biennial, which will take place in the Swiss Alps from January 19 to January 21, 2021, has announced that it has received a $250,000 grant from the Peter and Paul Jewell Foundation. The opportunity comes as part of the foundation’s four-year, $50,000 grant cycle, which runs through July 1, 2021. The grant will enable the foundation to establish a new performance and arts space in the art museum in Geneva, which has been jointly owned by the two founders of the Berlin-based architecture firm Paul and Anna Jewell since 1999. The partnership has served as the foundation’s home for the exhibition of the exhibition “Architecture and Power” since 1999. This year’s exhibition marks the twentieth edition of the show, which the two men have described as an “epic journey.”According to the foundation, the exhibition “was born from an urgent desire to be part of the history of architecture, and has had a profound", "The next Biennial should focus on the current struggles of artists and activists, and may include a consideration of current critical issues. \n\nThe Art Newspaper, the UK’s leading arts magazine, has appointed Anna Bochereau as its editor-in-chief. Bochereau comes to the magazine from the art-news publication Artnet, where she has served as a news editor since 2014. The news outlet will continue to publish articles by artists and other activists in its news section, Artnews. \n\nThe Art Newspaper is now offering free weekend editions in more than 130 cities around the world. Launched by the London-based news organization Artforum, Artweek, Art + Art; Art + Art + Art + Art + Art, Art + Art + Art, Art + Art UK, and Art + Art + Art, the digital editions of the weekly magazine will include stories, features, and photography related to a number of themes, including the impact of the coronavirus on art and artworks, and the future of photography in the age of mass surveillance.“The public has been demanding a more active online presence from newspapers and magazines, and we are now offering a more engaging range of news and features online for free", "The next Biennial should aim to produce a new work by an artist who is not currently represented in the exhibition’s catalogue. The award will also help to facilitate the acquisition of works by artists whose work has not yet been presented in the exhibition.\n\n\nThe Ministry of Culture of the Republic of China (MPC) in Beijing has announced that in the coming months it will launch a series of national initiatives that will strive to change the lives of Chinese citizens by helping them diversify their economic and cultural experiences.The initiatives will attempt to align with the theme of the upcoming fifth edition of the exhibition “The Future Is Present: Art and Social Distancing in China” (TFS). Titled “Diverging Perspectives,” the exhibition will examine the ways in which art and architecture are continuing to shape contemporary Chinese urban environments. Set to open on October 25, 2020, in Beijing, TFS will also highlight the work of young and established artists.Commenting on the initiatives, director Hua Chunhua said: “We can’t imagine the future without art and architecture, so we will work hard to promote art and architecture in the most meaningful ways possible. We have already begun by working with local local institutions and arts organizations", "The next Biennial should be held in 2020–21 with the representative of France and the City of New York as the venue. The first edition in Paris in 1892 featured works by over seventy artists, including Pierre-Auguste Renoir, Louise Bourgeois, and Jean-Luc Melodie. The exhibition was organized by the French government and supported by the French Minister of Education and Culture, Anne-Marie Le Pen.\n\n\nBrazilian artist Ana Mendieta, who made her first solo exhibition in Sao Paulo in 1991, has died at the age of eighty-two. Known for her vivid and abstract paintings, which often depict Brazilian people or tropical landscapes, Mendieta often reflected on the \"glory days\" of her childhood. The artist\u0097whose first solo show was at the Museum of Art in Rio de Janeiro in 1991\u0097was a nomadic, semirural, and often solitary existence.Born in São Paulo in 1936, Mendieta was raised in the city of Pio de São Paulo (later known as Rio de Janeiro) and moved to the state of Rio Grande do Sul to attend the Bolsonian University of Science. She studied at the Bolsonian Academy of Fine Arts in the capital, and", "The next Biennial should be held in December 2021. In the meantime, the museum will continue to present contemporary exhibitions in its original locations, including a new retrospective of the artist’s work on view every other year. The institution has also been working with Solveig and Moran Architects to create a new exhibition space, a new visitor experience center, and a new library.The new library will sit on the ground floor of the museum and will host a variety of contemporary art works, including works by the artist Kiki Smith. Its collection will also include works by the activist Antony Hudgens, who was executed in 1963 for “sedition” in North Carolina, and the artist Frank Stella, whose work was stolen by the Nazis in the Holocaust. The new exhibition hall will be built on the fifth floor of the museum, which is currently being renovated.The new library will be located on the ground floor of the building and will offer an online viewing platform and a large open space for the public to engage with the museum. It will also be equipped with a new networked research room called the Biennial Viewing Room, which will feature original works by approximately fifty artists, including Gabriel Garcia Marquez, Robert Irwin, and David Salle, in", "The next Biennial should be held in 2020 and will offer a preview of the exhibition “Architecture of Life” (2019), which is on view until January 31, 2020. \n\n\nThe CAAB Foundation in New York City has announced that it will begin hosting biennial exhibitions in the city in 2020. The first exhibition, “The Structure and Form of Things,” will be presented by Hector Barbosa, director of the Museum of Modern Art, in partnership with the Museum of Modern Art New York; the second, “The Big Empty Space,” will be presented by Roslind Graham, curator and director of the Museum of Modern Art, in partnership with the Museum of Modern Art.The CAAB Foundation has also released a statement regarding the announcement. “The foundation has been anticipating the demand for substantial renewal and new exhibitions for almost a decade, and we’ve been working hard to increase the scope of the program, broaden the themes, and present an exhibition that fulfills the central dream of every CAAB fan: to present the most recent exhibitions, in collaboration with an international cast, in a different space each year, in the fall, and in the spring.”\n\n\nThe", "The next Biennial should be held in 2021, and the 2020 edition will be staged in 2022. The exhibition will be hosted by the Museums Association in association with the city of Bristol, with event programming co-sponsored by the UK and Ireland, the US, and Germany. The 2020 event will feature sixty works, including works by a group of hot-button artists including Ninkasi & Gordon-Levitt, Paul Gauguin, Henri Rousseau, and Nathalie Antonoff-Snyder, and will be organized as a continuation of the 2017 exhibition, which explored the relationship between painters and their works. The biennial will focus on the history and recent resurgence of the work in the UK and will be organized as a global community event, with the artists participating having the opportunity to translate their works into a range of languages. “This is a moment of great change, and it is a fair we would like to see reflected in the work of our artists,” said Helen Brackens, director of the Royal Tate. “In the long-term the exhibition programme will allow us to continue evolving as a vibrant and influential contemporary art destination. We are especially excited to see the work of Terna D�", "The next Biennial should be‎ “Theoretical and Cultural Obsolescence” (2019), which will be held in the US, France, England, and Wales from May 19 to May 21. A pre-emptive strike is being considered.The thirty-fifth edition of the Biennale will take place in Lisbon in November 2021. The event will be hosted by the Museu de Arte de São Paulo (MASP), and will be held at a venue in São Paulo, the city of Brazil, from November 17 to November 19. The event will also highlight the work of contemporary artists and will be curated by legendary Brazil artist Lina Belina.\n\n\nThe Derek Jarman Foundation, which has supported the excavation of the remains of the historic archaeological site of the ancient city of Samothrace in central Africa for more than three decades, has announced that it is withdrawing its support in 2020. The announcement follows an announcement in June 2020 that the foundation would cease its work in Africa and continue its research in the US and Europe, but would take the next two years to assess the impact of the move.“The foundation’s research and conservation work will continue in its various locations worldwide,” Derek Jarman said", "The next Biennial should draw from the last two years of the artist’s life. Its first panel, titled “Life and Art in Contemporary Art,” will be held at the Museum of Modern Art in New York from May 8 to May 10.\n\n\nThe British artist and philanthropist Ron Gorchov, whose work explored the boundaries between aesthetic and political philosophy, has died at the age of eighty-nine. Gorchov’s work, which reflects a deep appreciation for the limits and possibilities of the human condition, has been collected by the Tate, the Museum of Modern Art and the Metropolitan Museum of Art in New York, the Metropolitan Museum of Art in London, and the Smithsonian American Art Museum in Kansas City.Born in London in 1950, Gorchov attended the School of Visual Arts (SVA) in the 1960s and then joined the SVA Artists’ Group. According to the New York Times, the group was formed as a way for artists to produce and display works in the United Kingdom, Australia, Australia, and New Zealand. Ghorchov also lived in California, Paris, and New York. In a 2015 interview with the New Yorker, the artist said that he felt he had finally found", "The next Biennial should be held in December 2019. In addition to showcasing the work of the artists represented, the event should feature a talk with Kim Kwon, a South Korean contemporary artist whose work has recently been featured in the exhibition “Nasimha: Younha Bangus”(2019) at the Biennial Center in Seoul. The event will also dedicate a section of the exhibition to the Korean diaspora.\n\n\nThe British artist Richard Avedon, who developed a popular series of stacked sculptures based on photographs taken by British photographer David Adjay in the late 1970s and early 1980s, has died at age eighty-four. The artist, whose body of work comprises more than 600 paintings that explore the gestural potentials of photographic images, was a self-taught painter whose work often took the form of figurative landscapes and collages. Though his work can also be found in the collections of the Museum of Modern Art, London; the Montparnasse Museum, Paris; and the Metropolitan Museum of Art, the collection of the Museum of Modern Art in New York is the most comprehensive.Born in 1933, the son of Jewish parents. Following his high school years in Bristol, England, Avedon enrolled in", "The next Biennial should be held in 2020. The museum has invited artists to participate in the 2019 edition. The list of participating artists is as follows: Joshua Helmer, Berlin - Mekuse Seminar: Helmer’s transitory works seem to follow a life of their own, as if they are being sustained by the interplay of their environment and the environment’s own processes. For Helmer, the conflict between the past and the present is a question of “how far we can reduce the ambiguity of time and place.” A group show of work by the curators of the past three years is scheduled for the museum.The Biennial will showcase both contemporary art and artmaking from the past. The curators will be able to present works from the collection of former director Joachim Ziemba, who retired in January 2019, as well as works that have never been mounted before, including a work on paper by the German artist Erich Genschroder, which was shown last year. It will also be the first exhibition dedicated entirely to the museum’s collection and will include a gallery show of twenty pieces, including a work by the artist Hans-Ulrich Baer, to", "The next Biennial should focus on the art of international migration, with a primary focus on artists like George Auchenbach, Gabriel Bouyn, and Sara Zou, whose works explore the life and death of migrants across continents and oceans. The 2019 edition of the exhibition will explore the lives and work of Ed Ruscha, Stanley Graves, Lily Allen, and Radical Women. \n\n\nThe Michigan-based artist who created the critically acclaimed but often mocked but ultimately extraordinarily ambitious sculpture Sister Ella Simpson, whose anti-war, feminist, and anti-racist art was influenced by early feminist and black radicalism, died on September 8. She was eighty-five years old.Born Ella Elam in 1951 in Detroit, Michigan, Simpson first studied under the legendary Black-ish creator Kenya Barlow in the 1960s. She was a graduate of the Art Institute of Chicago in 1988 and worked as a painter and sculptor in the 1980s before she became a full-time artist in 1993, when she began making works for Sister Ella. Her work has been exhibited at the Henry David Thoreau Museum in Portland, Oregon; the Museum of Modern Art, Chicago; the", "The next Biennial should be held in the spring of 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $25 million donation from a group of Boston-area donors, including Sam Hunt, Robert and Marian Hunt, and Susanne Vielmetter. The funds will go to the newly renovated space, which was completed in 2017, and will allow the museum to re-open after a $50 million expansion.The donation comes on the heels of a $30 million gift from Daniel Meneguzzo, the former chief executive of the New England Alliance of Museums (NEAM), and a $25 million gift from the Robert and Marian Hunt Foundation, as well as an additional $15 million from the John D. and Catherine T. MacArthur Foundation, the Elizabeth M. Sackler Foundation, the Henry Luce Foundation, the Robert W. Peabody Essex Museum, the W.A. Smith Foundation for the Arts, and the John D. and Catherine T. MacArthur Foundation. One hundred percent of the funds raised by these foundations will go to the museum.“We’re thrilled at being able to open in the fall with this monumental gift,” said museum director", "The next Biennial should take up the theme “Awareness and Action” from the Biennial’s previous three editions, which were held at the Smithsonian American Art Museum and the Museum of Fine Arts, Boston, and will be held at Renaissance, the former home of the Museum of Fine Arts (MoFA), in New York from February 13 to February 16. The winners will be announced in early March.\n\n\nThe Cedar-Riverside Museum of Art in Port Charlotte, New York, has received a gift of more than twenty rare early modern works from the artist and philanthropist, David Schippers. The work, which was donated by collector and art historian Michael Schirber, will likely be the last works donated to the institution. Known for his radical collection of early modern masters, Schippers is also the founder of the Schipper Gallery, a New York–based organization that advocates for the preservation of David Adjay’s works. David Schippers grew up in a family of art collectors in New York, where his father sold art works. In 1964, Schippers moved to Los Angeles to pursue a career as a freelance curator. He eventually settled in the city with his wife and son; they opened a gallery in", "The next Biennial should take place between March and October 2021, in the Negev Desert. The project was established by Yair Rad, the director of the Museum of Contemporary Art Herzog & de Meuron in Paris, and Gunter Wechsler, the director of the Museum der Moderne Berlin in the city of Albright-Parsons, Germany. \n\n\nThe exhibition “From Dust to Snow: Russia and the Paleolithic Workshop” at the Museum of Modern Art (MoMA) in New York has been canceled due to the pandemic. The March 14 announcement follows an extended shutdown of the institution, which was forced to move the exhibition from its original March 13 opening to mid-March due to the Covid-19 outbreak. “From Dust to Snow” was supposed to examine the cultural legacy of the Russian avant-gardes, including their contributions to the development of modern art and design. Its March 26 premiere was scrapped due to concerns surrounding the coronavirus and its March 29 run was scrapped because of the pandemic. The announcement of the cancellation was made by director Daniel H. Weiss, who said that the show would be “built anew” with the help of a", "The next Biennial should take place in the fall of 2020. If all goes according to plan, the exhibition will gain entry in 2021.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has announced that director Maria Bochereau has been appointed director of its new Science and Technology Forum. Bochereau, who has helmed the museum since 2015, succeeds mona Simpson, who has helmed the museum for nearly fifteen years, and will take up the post on January 6.“Following a thorough search process, the board of trustees concluded that director Bochereau represented the best combination of vision and energy for the Hirshhorn,” said Jan D. van Dam, chair of the board of trustees. “We are delighted to welcome her to the Hirshhorn, and look forward to working with her.”Bochereau comes to the Hirshhorn from the Smithsonian’s National Museum of African Art, where she has served as director since 2013. She succeeds Lisa Bardock, who was hired as interim director in 2017 and has served as the interim leader of the arts and culture museum since March 2019, when the closure of the National Museum of American Art in Washington, DC", "The next Biennial should be held sometime in 2021, Nairobi-born architect and curator Telmo De Otis, who curated the inaugural edition in 2016, told the Art Newspaper.“I’ve wanted to organize a biennial since I was a kid, but never thought I would get to do it,” De Otis said. “It’s a real privilege and a great responsibility to have one of these days. It’s a feat that you don’t get to achieve often enough, but when you do, it’s something genuinely special.” As a result of the construction of the exhibit on the life of an 18th-century slave ship and the subsequent construction of the Biennale, the project was moved to the Museum of Modern Art in New York and the exhibition was moved to a new location in 2020. “The changes that have been made in the course of the last twenty years are in keeping with the times we live in,” De Otis said. “The redesigned exhibition hall and the new building are both operable and full of life, and we are delighted to have the opportunity to present them in the new exhibition space and to extend", "The next Biennial should be held in 2021. Included in the triennial’s programming will be artistic projects, a special exhibition of works from the ’80s; “The Forest of My Father” (2018), a new exhibition of works from the collections of the County Museum of Art and the Seattle Art Museum; and “Tommy Boy’s Landscape,” a series of photographs from the collection of the Jane and Paul Getty Trust. The next iteration of the Biennial will take place at the Museum of Fine Arts in Boston in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Bonnie Radden as its new deputy director and chief curator. Radden will be responsible for overseeing the museum’s curatorial teams and for developing the museum’s programming and its curatorial strategy in collaboration with director Klaus Biesenbach.“Bonnie brings a wealth of experience and knowledge to our staff and we are excited to have her onboard as we continue to grow our collection and understand more culturally relevant art and stylized art,” said Biesenbach. “Throughout her tenure at MoCA, Bonnie has shown extraordinary leadership and vision in shaping Mo", "The next Biennial should take place sometime between the months of May and September. The theme will be “The Future We Want:” and will be a combination of “From the Encyclopædia’s Art Gallery and The Museum of Fine Arts, London, the University of Exeter, the Tate, and the National Gallery Birmingham. “We hope that this new partnership will further strengthen our roles as the custodians of this extraordinary collection, and that it will be a platform to engage with the art world in the UK. We are also looking forward to working with the Tate and the National Gallery Birmingham, whose collections are truly world class, to further develop the exhibition pipeline.”A full list of participating artists is as follows:Kameel AliMarwa Al QasimiMarwa Al Qasimi (first entry)Julie Baillie (second entry)Antonin Miro (third entry)Ina Motsu (fourth entry)Roland Martin: The Evolution of Everyday Life (first entry)Franz Kipper (third entry)Artistic Director, ACM Sharon White, and ACM John McAllister, ACM Karla Swenson, and ACM Charles Taylor, among others", "The next Biennial should be held in Tokyo in 2021. The biennial will also introduce new programs and exhibitions with an approach to history and culture that will be more than the sum of its components.”\n\n\nThe Yangon Art Museum in northwestern Myanmar (formerly Burma) has received a gift of forty-five works from the Thai royal family. The institution, which was founded by King Bhumibol Adulyadej in 1961 and is currently run by the Royal Thai Embassy in Beijing, received the works from the royal palaces of Naypyidaw and Neerakulmi, as well as the royal palace of Vihara Rajapaksa in Bangkok.The collection includes works by forty-five artists from the royal family, including ทวททท, Aida & Hamza, Anuksapoon, and Anish Kapoor, as well as artists whose works have been previously exhibited at the Yangon Art Museum in Thailand but were never included in a retrospective.  The collection also includes works by Jinmai Krathong, Dacca Aupamant, Kulapat Alsop, and Jinwha Huawang. A", "The next Biennial should commence in the spring of 2021. The biennial will consist of twenty exhibitions, based on the themes of “My Life as a Guide Dog” and “The Animal Impersonation Phenomenon.” The 2019 exhibition featured work by twelve artists: Hao Yin, Zhenya Zhdurnikova, R.J. García-Alvarez, Amedy Coulibaly, Sophie Daniel, and Amy Geisser.\n\n\nThe National Museum of Art (NaMo) in Washington, DC, has received a $250,000 donation from the David and Lucille Stutzman Foundation. The funds will be used to create a new home for the National Museum of Women in the Arts (MoMA) and will assist in the construction of the new museum’s centerpiece structure, a fifty-foot-long glass-enclosed amphitheater. The gift was made in honor of the Stutzmans’ and Mira Lozano’s longstanding commitment to the arts and their desire to make MoMA a center for cultural exchange.“In recognition of their significant philanthropic contributions to the museum, we are grateful for their longstanding support of MoMA and the arts", "The next Biennial should focus on the work of the twenty-six artists who have won the $50,000 Biennial Prize.  \n\nThe Solomon R. Guggenheim Museum in New York has announced that Marina Abramović will be the theme of its twentieth edition, “Between the Sun and the Moon,” which will coincide with the opening of a new exhibition of artwork by the artist at the Whitney Museum of American Art on December 19. The biennial will feature works by contemporary artists in collaboration with the Guggenheim’s David H. Koch, Ermanno Niebuhlen, Nicola Laudel, and Lucio Fontana.The exhibition will be inaugurated by a new work by the Italian artist Nicolò Prada, “Miro Ato,” which will be on view in the exhibition “In the House of Love” for four days only. The artist and his collaborator Gabriel Fauscovici, who often creates in informal settings such as his studio, have also created works for the show that will be presented as a series of intermissions. Fauscovici’s work “Tucchi and Tint", "The next Biennial should take place in the spring of 2021. For the design, MAD is working with an international group of artists, architects, writers, and curators, including Pierre Cardin (société des artists de littérature), Hélène Delaunay (art-histériques), Lévy Gorvy (art-histériques), and Tingiho Matsuoka (art-histériques), and has enlisted the assistance of a number of art-world experts. The final exhibitions will be staged at MAD in the summer of 2021.\n\n\nThe Metropolitan Museum of Art (the museum) has appointed Tyler Bryant as its next director. He will assume his post in January 2020.“Tyler brings a wealth of experience across disciplines and perspectives to the Met, including a deep commitment to artists’ practices and a lifelong commitment to bringing art to our cities and to transforming the museum,” said director Maria Balshaw. “His record of success at the Met shows that he brings a compelling vision for how art can shape and connect to our communities, and that he has the vision and the ability to bring creative and institutional solutions to the museum.”Bryant", "The next Biennial should take place in the spring of 2021. It will be held at the Museo de Artes Plásticas (MPP), Porto Alegre. A retrospective of Douglas Gordon’s exhibition “The Accidental Don” will be presented by the Palais de Tokyo in Tokyo in December. In the summer, the museum will host an exhibition of works by the Italian artist, s/he of the mid-Twentieth Century, Pasquale Gaudino, and a selection of his shorts.  Although the twenty-fifth Biennial, “The Informal Show,” will be held at the Palacio de Artes Plásticas in Madrid in January 2021, the exhibition will be closely watched by the Biennial Council as it considers whether a new strategy is needed. For the organizers of the upcoming edition, Art+Future, the decision to postpone the event was a compromise between the two goals of increasing the number of artists represented and maintaining the biennial’s long-term programming. “When we are talking about a good story, it’s a story that happens, not a story that is told,” said Stefano Sanna,", "The next Biennial should take place in the spring of 2021. The 2019 iteration, “Ecole des Beaux-Arts” was staged at the museum in Paris. \n\n\nThe Association of Art Museum Directors (AAMD) in New York has announced that it will not renew the contract of Judith Hill-Cropper, the director of the Whitney Museum of American Art in New York, following her resignation in March 2019. Hill-Cropper took the helm at the Whitney in February 2019 after it closed to the public in March 2019. She will now serve as an adjunct faculty member at Columbia University in New York, working remotely with the museum for a year, during which time she will moderate the museum’s “Art of the American Imagination” series. “After careful consideration, we have decided not to renew Judith’s contract,” said AAMD director Robert L. Gordon. “It is with great regret and disappointment that we are announcing this news. Judith is an accomplished curator, and we were impressed by her ability to build ongoing collaborations with artists and institutions. She has been instrumental in building the Whitney’s current collection of over 1,500 works and has been instrumental in", "The next Biennial should bring together the artists and curators who have made at the forefront the most recent interest in ‘art from a cultural and social-historical perspective.” Beginning next month, the exhibition will open at MOSPAL and will run through March 20. Among the works on display are Bakunin’s “Avant-Garde and Modern Art” (2019) at the Museum of Modern Art, New York; Anais Ninos’s “Theater of Operations: The American Army, 1942-1945” (2019); Liz Sherman’s “Avant-Garde and Modern Art” (2019); “The Audience as a Source of Life” (2019); and “An Introduction to the Theory of the Material World” (2019).“The Future Is Now: Biological and Cultural Evolution in the Age of Mass Communication,” curated by the French philosopher and critic, Bernard-Henri Breton, will be presented by Laurent Jaloux in Paris in January 2020. It will open at the Barbican in London the same month and will run until December 2020. The Biodiversity Group will present a", "The next Biennial should be held in 2021–22. The newly created Institute for Contemporary Art will focus on a new collection of works by artists who have been neglected or out of focus by major art institutions. The museum will also collaborate with the Kansu Art Museum and the University of Kansas to present a series of exhibitions centered around a theme. The new institution will be led by Diana Howard, the renowned American art historian, curator, and educator who has served as the director of the Kansas City Art Museum since 2013. Criticizing the current state of the art, Howard said: “It is a sad state of affairs when we are forced to choose between the importance of the visual arts and the advancement of our world. The museums are the laboratories of the visual arts, their collective and individual apparatuses, their laboratories where experimental and experimental artworks are created and appreciated. I hope that when you visit this museum, you feel a sense of kinship with the teams and designers and artists who have made this amazing institution possible, and that you feel inspired by the possibilities of art to come.”\n\n\nThe Metropolitan Museum of Art in New York is planning to shutter its popular art and design center, the Museum of Modern", "The next Biennial should take place in the spring of 2021 and will be hosted at the Bodelha Institute in Bremen. A second edition of the exhibition will take place in the fall of 2021. The Biennial will be a collaboration between the institute and the Uffizi Museum in Florence, where the exhibition will run in tandem with the museum’s long-standing biennial Salone di Biennale, which will end in 2020.A third edition of the exhibition will take place in the spring of 2022 and will be organized in the same way as the inaugural edition. The upcoming exhibition will also include a new selection of paintings by Italian designer Franco Prada, a selection of the work of the Italian artist Mila Arrucci, a selection of works by the Swiss-born collector Corneliu Maresca, and a selection of works by the Italian artist Gio Ponti.The Venice Architecture Biennial (AVB) is gearing up for its first edition in 2019. Titled “The Future Is Fading Away,” the show will focus on the diversification of human vision and will draw from contemporary art to explore the legacy of the Italian artist Roberto Cicutto—who is best known for creating the first assemb", "The next Biennial should be a “spiritual journey,” he said. “It will reflect the heart, the soul, the spirit, and the body. We believe that the new South Asian landscape must be enriched by the art of the South Asian people, which is the art of the South Asian people as a people.”\n\n\nA group of artists and collectors in China are suing the country’s State Administration of Cultural Heritage (SAIC) over the reopening of the National Museum of China (MCA), a major cultural institution that is located in Beijing and is slated to reopen next month. The lawsuit, filed in the Beijing Municipal Court on May 24, claims that a series of new licensing and certification procedures put in place to prevent the  disassembly and rearrangement of the museum’s collections, as well as by the construction of a new building that will hold the museum “under construction,” violate the Lanwuāi Art and Culture Protection Law.“We are filing the lawsuit to protect the intellectual, literary, and artistic integrity of the Museum of China,” Li Shihong, the lawyer representing the artists, told the Art Newspaper.The lawsuit claims that the SAC", "The next Biennial should be a celebration of this extraordinary generation of artists, whose work explores the boundaries of what is possible and what might be. It should aim to reveal the way forward, the possibilities of what art can and can't be, and how art can become more and more.”This article is part of the “Portraits at Sea” project that is centered on the life and work of artist Richard Avedon. The project was inaugurated by the biennial’s first champion, the late British colonialist Charles Ray, and was led by Agnieszka and Joost van der Vorst.The exhibition will feature more than seventy works by twenty-six artists who have made contributions to the art of photography, including Taimurkijz, Merrion, and Eldon Jeanes, and will run through March 19.\n\n\nThe Museum of Fine Arts (MoFA) in Atlanta has received a gift of eleven thousand photographs from the artist Victor Vasarely. The donation includes prints dating from the late nineteenth century to the mid-twentieth century and a series of photographs that depict the lives and work of Georgia O’Keeffe. The works also include a new series of photographs by", "The next Biennial should be convened in 2022. The theme of the twenty-seventh iteration of the exhibition will be “The body and the soul.” It will be organized as a series of interlinked experiential experiences that engage with the themes of “The Body and the Soul” and will be led by a new artist-in-residence, Olu Oguibe. Initially selected by the museum for its newly constructed building in Rome, the artists who will participate in the exhibition are: Anastasia Popovskiy (SANA), Christopher Sykes (TUL), Carol Mackay (TUL), Maria DePasquale (SANA), Alexander Marushev (TUL), Giovanni Belloni (TUL), Lorena Brugnara (TUL), Pilar Bruna (SANA), Gina Camacho (SANA), Carmen Cardoso (SANA), Adriana Croce (SANA), Nancy Dorsen (SANA), Monica Duro (SANA), Lysette Fattal (SANA), Lara Gaertner (SANA),  J", "The next Biennial should be held in the autumn, and the next has been extended to 2020. The exhibition will consist of a selection of over fifty works by thirty-three artists from the biennial’s collection, which opened at the Museum of Modern Art in New York in June 2019. “The new academic year is a moment of renewal and reflection, of reflection and renewal,” said Artforum editor-in-chief Christopher Knight. “Art is a cosmic medium, and the power of art lies in its ability to transform our lives and the lives of others. We are grateful to the artists and the organizers of the biennial for committing to this endeavor, and to the museum, our city, and the city of New York for hosting this special exhibition. The exhibition will continue to be exhibited in the fall, and will resume at the Museum of Modern Art in 2021.”The biennial’s inaugural exhibition, “The Material Street,” was staged at the Fisk University School of Art in Louisville, Kentucky, and drew fifty-two artists, including Sam Garrels, Douglas Gordon, Matt Karlo, and John McAllister, among others. The exhibition was held on October", "The next Biennial should focus on the theory of ideology, its relationship to art and the arts, and the role of women in the arts. The exhibition should be organized in cooperation with the Maakai Museum, and should take place in a museum that is located within a city, a UNESCO World Heritage site, or a UNESCO World Cultural site.“Our project is still in its early stages, and we are still learning the Maakai Museum’s and the National Gallery’s cultural programming,” Tanya and Richard told Artnet. “After the exhibition, we want to do something for the Maakai Museum that will also be a touching experience for visitors to the museum. The next iteration of the Biennial’s exhibition will focus on the philosophy of ideology as an ideology of the museum, and on the art of ideology. We hope that, after this exhibition, visitors will feel a sense of belonging to the Maakai Museum and the National Gallery.”The new exhibition, “Ideology and Vision: An Exhibition of Cultural Illusions” will open on September 28, 2020 and will run until November 19, 2020. It will also offer a presentation of the work of contemporary artists whose work traces", "The next Biennial should be held in 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Marcia Cox as its next executive director. She succeeds Catherine Olsavsky, who is retiring in December 2020 after fifteen years at the helm of the institution.“The institution’s Board of Directors voted unanimously to confirm Marcia Cox as the next executive director of LACMA,” said board president Lisa Rinder. “She comes to the LACMA board with twenty-six years of museum service to her credit, and seven years as a leader of a museum. She has more than two decades of experience in the field and brings a wealth of knowledge and experience to the museum, as well as a deep understanding of the ways in which museums are constructed, maintained, and restructured.”The appointment of Cox as the next director of LACMA was made in part because of the museum’s decision to close its intimate, jewel-encrusted wings in January 2021, and scheduled the event as part of the reopening of the new Museum of Modern Art (MoMA) in New York. The move was made as part of a larger plan to refocus the institution’s programming", "The next Biennial should be held in Shanghai, in the spring of 2022. The site of the exhibition was chosen by the artist and the architect, Yu Yang, as a site for the new exhibition “This Is Not a Painting,” which will run for fifteen days and feature works by more than sixty artists. The opening of the exhibition is currently under consideration by the National Gallery of China and the Museum of Modern Art. The winner of the exhibition will receive a sum of $100,000.\n\n\nThe Museums Association (MA), the UK’s professional association of museum directors, has released the list of twenty-six artists whose works will be presented at the Fifty-Eighth Venice Biennale in 2020. Works on display include the first work on paper by the artist Paul Gauguin; Gillian Wearing’s Dance of the Frog; Pablo Picasso’s Blue Period; and Sara Steiner’s Stationary in Space.“In this challenging and challenging-to-define time, when images of the world are being reproduced in virtual reality, the work of the artists whose work is presented at the Venice Biennale is,", "The next Biennial should be held in 2020, and the ten-yearly event will return to the city of Hanover, Germany, for its forty-fifth edition, which will take place in 2021. A new exhibition of work by artists from North America and the Americas will follow, and the festival will also receive international acclaim.The traditional event, which is held in the city of Hanover every February, has been held there since 1965. The current edition, which will be staged at the Museum of Fine Arts Hanover (MFA) in Hanover, Germany, was organized by the Berlin-based nonprofit the Berlin Group, which consists of seventy local and regional organizations, including the Berlin Art Museum and the Berlinale Biennale. The next edition, titled Fulcrum, was selected from an initial shortlist of fifteen artists, which was announced on January 20. The show will be curated by Hans-Peter Kunsthalle München in collaboration with members of the biennial’s curatorial team. The 40th edition of the Berlinale Biennale will take place in the city of Mannheim, Germany, in March 2021. The event will commemorate the end of its first edition, which was held at the Museum", "The next Biennial should be held at the Musée d’Art Contemporain (BAC), in Paris, where it will remain until 2022. The exhibition will be inaugurated by a special exhibition of work by the collection on the collection’s exhibition space. The exhibition will include works by the artists who have been represented at the exhibition in the past and will invite the public to participate by presenting an interactive lecture series.The biennial will be organized as a platform for the collection to grow its collection online and to engage with the modern art world. In order to ensure the long-term sustainability of the exhibition space, the biennial will include the exhibition of new works and will be a place for the collection to present works by artists in the future.The exhibition was created by the collection in partnership with the artist, and in recognition of his contributions to art history, the biennial will be renewed this March.\n\n\nThe Asian Art Museum (AAM) in Seoul has decided to send over one hundred artworks by twenty-six artists from China and Korea in a show of solidarity with the struggle against graft and police violence in the country. The artists were chosen by a committee made up of freelance and professional curators from museums across the globe", "The next Biennial should be held in 2021. “It is the only way to support the museum and to continue to develop the collection, to continue to present the work of the great masters, and to continue to grow the exhibition experience,” said Niccolo Battista, chairman of the museum. The announcement of the 2021 edition was made by Carlo Cipolletta, president of the Milan Biennale, and Antonio Lisi, president of the Italian Association of Art, at a press conference in Milan on Friday. Lisi told the Art Newspaper that the 2019 edition of the exhibition was not a harbinger of things to come, but had merely marked the seventy-fifth anniversary of the museum. Battista added that the museum will not be changed by the event. “We are not going to change, we are not going to forget, we are not going to compromise,” Battista said. “The last twenty-five years have been a great success. We have had the opportunity to dedicate our entire history to the museum, and we are committed to what we are doing. We have a plan B and we will continue to plan for it.”The museum will", "The next Biennial should be held in 2021. For the researchers, the observation is a milestone. “The longevity of the flora and fauna of this region is a source of pride for us all,” said Mona Ericsson, chair of the committee and curator of the exhibition “Modern Man: The Cultures of Gough and Berenice Arnold.” “We are all deeply moved by the natural beauty and intricately woven tapestries of the South African flora and fauna.”\n\n\nThe Museum of Modern Art (MoMA) in New York has released new guidelines for the use of  wet cement and metal in the installation of works by artists such as Jeff Koons, Mark di Suvero, and Diane Arbus. In a statement, MoMA said: “The guidelines, which address how we store, transport, and use cement and metal in the exhibition context, and how they inform our environmental stewardship, come a little more than a year after the installation of the museum’s wall-mounted installation ‘Vampire,’ which commemorates the institution’s new membership in the International Cement Association (ICA), and", "The next Biennial should kick off in February 2021 and will focus on the work of African artists across the twentieth century. The event will also draw on the work of the participants and the disciplines of art and design to present an exhibition of artworks by African artists in 2020. The exhibition will offer a retrospective of the work of the biennial in the summer of 2020 and will feature works by seventy-five artists, with the work of twenty-nine artists representing twenty-three countries.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is reopening to the public for an exhibition of work by artist Tommie Smith, who was assassinated in Memphis on April 4, 1963, less than a year after his famous \"I Have a Dream\" speech. The show, titled “Dreamers Are Living, Alive, and Dreaming” and curated by Mike Kelley, will run from March 25 to March 28, 2020 and will feature Smith’s works for the first time in the United States.“Dreamers Are Living, Alive, and Dreaming” is a twenty-four-by-eight-inch photograph of Smith’s work, which consists of two halves, one half of a series titled “Dream", "The next Biennial should be held in 2021. Would-be visitors are asked to contact the museum. “This is a moment of great change,” said Catherine Martin, director of the biennial. “The museum is committed to continuing to present innovative and ambitious exhibitions in the most rigorous and contemporary ways, with the full cooperation of the Oakland Museum of California. It remains my vision that the Biennial will be an enduring resource for the creative life of California, and that this year will be a moment of celebration.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is recalling thirteen works by thirty-one artists whose works are currently on display in its upcoming exhibition “Theater of Operations: The Gulf Wars 1991–2011.” In a letter addressed to attendees of the upcoming exhibition, which will run from March 15 to March 17, the museum said that it is “reconsidering the decision to hold the exhibition,” which was inspired by the ongoing efforts of MoCA staff to catalogue the occupation of Iraq and Afghanistan by US troops.In a follow-up letter, the museum said that it will take “all necessary and appropriate actions,” including making adjustments", "The next Biennial should be titled “Ainu: Life and Death” (or a Biennial, anyway) and should be held in 2020. It will aim to “explore the question of how the body may be placed within the history of art, and to consider how a social history of art may be made anew.”\n\n\nA group of American art critics and scholars is urging the Museum of Modern Art (MoMA) in New York to divest from Sotheby’s, the leading global dealer of contemporary art. The academics and activists say the museum is failing to address the complex global issues of contemporary art and the impact that conspicuous consumption has on cultural organizations.“It is critical for museums to divest from Sotheby’s, since they are among the most influential and successful in their respective fields,” reads a letter signed by the group, which is led by scholars Mai Wang and Alex Huang, and is dated November 10. “As cultural institutions, we believe that the Museum of Modern Art must create a new process that tackles the systemic racism, sexism, and classism that adversely impacts the creative and academic work of museums across the world.”The letter claims that the institution failed", "The next Biennial should be in 2021. The first event, Amor and his team said, was “designed by a curator from the French Academy.” The museum will select a curator from among those who have served as the director of the museum since 2003.  For biennial curators, the festival represents a new and urgent moment. “We are living through a moment of transition; a moment of great change; a moment of great possibility,” they said in a statement. “It is an occasion to pause, to reflect, to celebrate and to plan.”\n\n\nThe Japanese American Memorial Museum (JAMA) in Honolulu has received a gift of twenty-three contemporary art works by twenty-five Hawaiians who have passed away since 1986. The works, which include works by artists such as Yuko Miyamoto, Toki Toki, and Abe Masuoka, were donated by the Hirshhorn Museum and Sculpture Garden in Washington, DC, and were on loan to the institution for the 2020 exhibition “Theater of Cruelty: Contemporary in Hawaii,” which opened on March 20 and runs until September 21.“The gift includes works by twenty-six Hawaiians who have", "The next Biennial should be held between March and August 2019.The new exhibition, “Mana Contemporary Art,” will show works by more than 150 artists from twenty-three countries. The theme of the show is “NIRIN,” and will test the limits of the art world. The 11th edition of the exhibition, “LA INTERMISSION,” will be held in November 2019.The 2019 edition featured work by thirty-eight artists, the majority of whom are based in the United States. The biennial will also include works by artists who have lived in the Bay Area for twenty-three years or less, including Kate Ferguson, Ian Gilmore, Bryce Colton, and Hollis Prestwich, and will introduce a new group of curators, a new exhibition format, and a new exhibition. The event will also introduce time-based works by and about seventy other local artists.The 2019 edition was curated by Ryan Moore, the founder of the Oakland-based nonprofit Mpagi Sepuya and a former director of the San Francisco Museum of Modern Art. The biennial, which will also be free to the public, features work by seventy-eight artists, including Aida Evans, Amy Amedu,", "The next Biennial should focus on how our ideas of public art can be redefined, and adapted to reflect the needs and aspirations of the time. The next edition of the European Biennial should be on the history of culture in Europe\u0097from the rise of the National Gallery and of modernism in the late nineteenth century to the current crisis. We should also be thinking of how art and culture can be restored and reinvented to serve our communities in the future. The next edition of the Biennial will be on the history of art in the twenty-first century. We have a responsibility to do all this and more.”\n\n\nThe Louvre has announced that it expects to lose an estimated $12 million a year due to the pandemic, and that labor shortages will continue to be a problem throughout the duration of the pandemic. The institution added that it does not expect to be able to keep its staff through March 23, 2020, and that its financial situation will worsen further during the month of March. The museum said it is preparing for the worst and is working with partner organizations to minimize the number of visitors its expects to lose access to the Bechdel House, which is located near the Louvre and the Centre Pompidou.", "The next Biennial should take place in 2021 and will be led by Quesada and will be organized under the theme “The Future of Life.”The 2019 biennial, “One Life, One Flesh,” was staged at the Tokyo Philharmonic Hall, the Yokohama Museum of Art, and the National Museum of Fine Arts in Beijing.\n\n\nThe Metropolitan Museum of Art in New York has released the first panoramic views of the iconic bronze sculpture Sidney and Edith,  which depicts an anthropomorphic and hyper-feminine figure clad in a pink and white dress, the skirt of which is wrapped around a pole, which is supposed to symbolize the female orgasm. The works, which were created in 1983 by artist David Adjay, were installed in the sculpture’s original location on the fourth floor of the museum, which is currently undergoing a $50 million revamp and is currently undergoing a $50 million facelift.The $1.3 billion overhaul includes the construction of a new twenty-story, seventy-five-thousand-square-foot entrance on the fifth floor, a restoration of the sculpture’s original facade, the renovation of the interior, and the", "The next Biennial should be in London in 2021. \n\n\nDanziger Gallery, which is currently closed due to Covid-19, is reopening in early December. Danziger Gallery is situated in the shopping district of the historic Battery Station in New York and focuses on contemporary art. Its new space, Danziger House, will offer a new exhibition, titled “Telling Stories,” and will also host an international residency program. It will also have a permanent collection of over 5,000 works.For its inaugural event, the gallery will hold a presentation of work by artists such as Bob Harris, Colby Galloway, Michael Kanda, and Karolina Wojtas, as well as a selection of works by visiting artists such as Mark di Suvero, Karl Lagerfeld, and Mark Rothko. \n\n\nArt Paris has announced that it is reopening on December 9. The reopening will coincide with the opening of the new exhibition “Art Paris,” opening on December 2. The show will include works by thirty-six new and established artists, including Anish Kapoor, Tania Bruguera, Julien Fouché, and Karolina Wojtas. The", "The next Biennial should be held at the Museum of Modern Art, in 2020, and the museum’s public garden at 730 Fifth Avenue in Manhattan, 2020, as well as at the Museum of Contemporary Art, Miami Beach, 2023, and the Museum of Contemporary Art, New York, 2024. \n\n\nThe £12.5 million restoration of the Künstlerhaus in Munich is now on track to be completed in 2021, the Art Newspaper reports. The Kunsthistorisches Museum (KUM) in Munich will be given a new fifty-six-thousand-square-foot home in the same building as the Kunstgalerie in Krefeld, the Kunstmuseum Stuttgart, the Kunsthaus in West Berlin, and the Kunsthaus Künstlerhaus in Brandenburg.The renovation of the Künstlerhaus, which opened in 1660, is one of the largest projects undertaken by the Künstverein and the Kunstverein Berlin, and will consist of the restoration of the original building, the reopening of the Künstverein in 1982, the completion of the renovation of the Kunstmuseum Stuttgart from 2012 to", "The next Biennial should be held in the spring of 2022, with its inaugural exhibition, “Black Box: The Art of Visuality.” The show will consist of an exhibition of biennial works, as well as a presentation of new works that have not yet been exhibited or selected. “In the past ten years, the Biennial has welcomed more than sixty artists and has become a platform for discussion and experimentation,” said Dalia Menevi, artistic director of the Biennial. “In this moment of uncertainty, it is with great concern and excitement that I tell you about the biennial’s current status. I have been involved in the work of many artists and am honored to present their work at this year’s edition.”At this biennial, artists will have an opportunity to develop new and original practice with a view to developing a new format. The first exhibition is entitled “Black Box: The Art of Visuality.” The work of Rachel Whiteread, “The Frame of Detail” (2017), will be presented as part of the biennial’s inaugural event, “Art and Politics,” at the exhibition of contemporary art in", "The next Biennial should be held at least once a year, depending on the urgency of the event.  The following year will focus on environmental justice, with the theme \"Anatomy of a Revolution: International Conservation and Environmental Justice in the Developing Countries’s Struggle for Survival” and will be the first year the event will be hosted by the city of London. The next exhibition will be held at the London Biennial House in June 2020 and will be the first exhibition to showcase the work of the biennial’s alumni. The biennial will then reach its zenith, the London Biennial Experience, in June 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has announced that it will permanently close its doors on March 31, 2020 to protest the Trump administration’s proposed budget cuts and tax-reform plans, which would devastate the budget of cultural institutions and the social safety net. As part of the campaign, the institution will begin inviting visitors back for special events, such as its annual gala on July 25, 2020.Originally scheduled for April 22–April 29, 2020, the gala will now be held April 25–April 29, 2020, with special", "The next Biennial should be hosted at the Museo de Arte Contemporáneo Barcelona, as well as the Museo de Girona. The final version of the exhibition will be held in the Museo de María, in the city of María de árbovara. The venue will be located in the interior of Barcelona, at the center of Spain’s cultural heartland. Museo de María’s director, María Arriaga, said: “At the moment, we are still working out the financial details of the project, but I believe that it will be possible to create an exhibition of this scale, of this quality, in such a small space. All the signs point to the future.”The project will involve the construction of a new museum, which will comprise an exhibit hall, a library, an auditorium, and galleries that will each be constructed of as many as sixty thousand square feet of interior space. The Biennial's first exhibition, “Art in Life and Death,” will open at the Karolinska Institute in Stockholm on February 28.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced its representation", "The next Biennial should be held sometime in 2021, and the fifth installment should be staged between 2021 and 2023. \n\n\nThe National Museum of Women in the Arts (MoWA) in Washington, DC, has put out a call for an artist-in-residence that will help raise funds for its renovation and to engage in a series of conversations about issues that affect women artists and their work.The institution said that the artist-in-residence would be selected by a panel of five artists and that they would meet in the fall with the museum and its staff to discuss the role of MoWA in supporting the arts and cultural economy of DC and across the country. The museum hopes to create a new space for individuals to engage with the institution and its collections.The selected artist-in-residence will work with MoWA to further the museum’s mission of inspiring women to take active and important roles in their communities through the restoration, conservation, and presentation of art. The institution is currently working to identify the locations and the materials that will be salvaged for its collection. The artist-in-residence would work with museum staff to develop a series of dialogues, which would be presented as part of the institution’s Fall", "The next Biennial should be held at least once every four years, with a design award of $250,000. The biennial’s prize for best exhibition will be presented in November 2019. \n\n\nThe Netherlands’s National Museum of Modern Art (NIMAM) in Amsterdam announced today that it is expanding its digital platform in the interest of diversity of artistic perspectives and fostering greater understanding and appreciation of the diverse histories and cultures of the European continent. The project is part of the institution’s ongoing strategy to deepen its understanding and appreciation of the cultural heritage of both the Netherlands and the European Union. NIMAM has also invested heavily in its digital program to better serve the needs of the diverse audiences that make up its diverse collections, including a digital library of over seven thousand works by Dutch and international artists in April, a digital cataloguing platform launched in 2019 that will allow visitors to browse NIMAM’s collection online, and a digital platform for education about the museum’s collections that will be fully operational by 2021.NIMAM director Bart De Kooning said: “The future of museums is very much a work in progress. However, throughout this period of unprecedented diversity, NIMAM has maintained its", "The next Biennial should focus on 'The Uses of Art in the Contemporary Life of the Soviet Party, 1917–1941,' and should be held in the capital of the Comintern. The commission also comprised Arsht and Steinsland, two Swedish curators who have been active in the field of contemporary art, as well as Mikko Nilsson, a director of the Swedish Museum of Modern Art, Stockholm—Nilson is currently collaborating with director Mats Punen on a new retrospective of the artists who established a trend in modern art during the late 1950s and early 1960s. The announcement of the new theme was made in an open letter published by the Biennale in 2017, in which it declared its intention to continue with the theme in a manner that would 'avoid any major changes.” The letter continued: “The idea of a future exhibition has been in the works for years, but it never really came to fruition. We are now in the process of rethinking the exhibition, which is a major step.”The exhibition, which will present artworks by contemporary artists such as Konstantin Kerensky, Nadezhda Krupskaya, and Suzan R. De", "The next Biennial should be held in 2022, but the organizers said that they have been working on the schedule since 2015. They said that the exhibition, “will embrace all of our own processes.” The exhibition will focus on the relationship between artists and their formal worlds, including the visual arts and the public sphere. The first edition, entitled “Projection 2: Art and the New Cultural Legacies,” was held in the United Arab Emirates in October 2018, and was organized by the Almeida Art Museum in Abu Dhabi. The second edition, “Air and Space: Renaissance Art in the Early Middle Ages” was held in Milan in November 2019, and was organized by the Museum of Modern Art in Rome\u0097the museum has yet to announce a date for the third edition. Yale Union, which currently has a space in the university’s building, may also move into the building, which houses the university’s College of Arts, and is currently looking to secure funding to renovate the space.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Nicholas Paine as its next director. Paine will be responsible for leading the museum through the first phase", "The next Biennial should take place in 2021 at the Museum of Contemporary Art, Boston, and will be led by curator-designated artist-in-residence, Regeve Baghramian. The exhibition will feature work by thirty-six artists, including Madeline Solti, Jodi Throckmorton, and Rayyaneh Hossain, and will be organized as a platform for dialogue and reflection.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Kate Grant as its new deputy director of curatorial affairs and chief curator.Grant joins the institution from the Reverend Clementa Pinacoteca, where she has served as director of curatorial affairs since 2013. During her tenure, she oversaw the launch of the city-funded Museum of Contemporary Art (LACMA) in Pasadena, California, and oversaw the reopening of LACMA in 2010. She also organized several major exhibitions at the museum, including “How Art Works: Reframing Art in the Twenty-first Century” (2016) and “Remaking the Modern World: Art and Color” (2018) and helped raise funds for the museum.“I’m thrilled to be joining MoCA’", "The next Biennial should be in 2022 and will be led by Julia Anne Aronson, the curator of contemporary art and her husband, and will draw from a group of artists who were selected by a committee comprising Aronson, Julio César Morales, and Marcel Prouvé. The committee will also comprise Marta Bonilla, director of the Laboratory of the Humanities in the Faculty of Arts; Ishikawa Ushio, director of the Institute of Contemporary Art; and Kiyoshi Murata, director of Tokyo Art Museum. The biennial, titled The One World View, will be held at an undisclosed venue.\n\n\nThe Solomon R. Guggenheim Museum (SGM) in New York has announced that it has received a gift of more than 1,000 works by the Brazilian artist Paulo Sérgio da Cunha\u0097a.k.a. the Black Mambazo, who, between 1963 and 1972, began to experiment with the concept of the microcosm in order to create a series of abstract landscapes and monumental sculptures that blend elements of folklore and history and that often split up the artist’s body into two or more pieces.The gift includes works by Mário Gomes and M", "The next Biennial should take place in 2021, and the current edition will be staged at the Museo de Arte Contemporáneo (MAS), in Madrid.\n\n\nThe Institute for Contemporary Arts (ICA) in Amsterdam, which was forced to shutter due to the coronavirus, has been rebranded as one of the largest arts institutions in the world. The reorganization, which aims to become more modern, positioned the ICA, located in the former Kastrup square, as the new flagship institution of the Netherlands Arts Museum (NAMS) and the Dutch National Museum.The restructuring, which was inspired by the city of Amsterdam, involved the remodeling of the museum and the National Museum in the capital of the Netherlands, as well as the reorganization of the building where the ICA currently has a space for programming. The reorganization was carried out in collaboration with the City of Amsterdam, the National Museum, the Institute for Contemporary Arts, the National Museum of the History of Art, the National Museum of Art, the National Museum of Modern Art in Oslo, and the National Gallery of Art, which opened in 2000.“For the past fifteen years, the ICA has been moving forward in a way that is connected to the", "The next Biennial should include a “social model', ’socially-minded artists’ work on the exhibition, and “why it’s important that we continue seeing its work.”The full list of participating artists is as follows:Ariana Cole’s The Extraordinary Experience: Italia from the Sixteenth to the SixteenthBenedict Strand’s Fatima de los Reyes (2014)Benedict Strand’s Fatima de los Reyes (2015)Benedict Strand’s Fatima de los Reyes (2016)Benedict Strand’s Contemporary Art from the Sixteenth to the Sixteenth (2017)Benedict Strand’s The Golden Skin (2017)Benedict Strand’s The Golden Skin,” 2017)Benedict Strand’s The Golden Skin, 2018)Benedict Strand’s The Golden Skin II: The Other Side of the Sun, 2019)Benedict Strand’s The Golden Skin III: The Other Side of the Moon, 2019)Benedict Strand’s The Golden Skin IV: The Golden Skin, 2020)B", "The next Biennial should include a presentation of the results of an in-depth survey of the work of the exhibition and its alumni, with an emphasis on exhibition art from the late 1970s to the first half of the early 2020s.The biennial will be organized as follows:The first Biennial of the Museum of Modern Art will take place at the Museum of Modern Art (MoMA) in New York on September 22–September 29. The exhibition will include works by artists of a range of artistic styles and will feature representatives from the following categories:Painting, sculpture, installation, performance, film, video, photography, and printmaking. The exhibition also will feature a new movement in which artists will engage with issues of life, death, and trauma through performances and screenings: The Museum of Contemporary Art California’s BiopODAL, which will run from September 8–September 10, 2020, will include works by artists such as David H. Gorman, Corinna Benavidez, Sarah Boesky, and Janet Hernández, among others. The biennial will be recognized by the Association of Art Museum Directors (AAMD) and will receive a $50,000 prize,", "The next Biennial should bring together artists from all over the world for a series of exhibitions and residencies that explore the histories of the current socio-political moment through the lens of indigenous and contemporary art practices. “We are currently facing some of the most challenging and uncertain times in our history. We will need artists to shape and articulate new and urgent readings of history, art, and ideas to confront and challenge our current and future,” said Nell Doran, chair of the board of trustees of the Biennial Foundation. The first exhibition of the new format, “The Death of My Father: Art and the Struggle to Remember,” will be presented in November 2020. \n\n\nLutheran College in North Little Rock (LSRC), the historically black institution in Arkansas, has appointed Naomi Nachminoff as its new principal. According to the Arkansas Times, the seventy-five-year-old academic was selected by a board of curators and educators in partnership with the school after it received a $25,000 donation from the artist’s family. Nachminoff will begin her tenure in January 2021.“I am deeply honored to be the first to serve as the college’s principal", "The next Biennial should begin in 2020.\n\nFacebook has also joined a number of other arts organizations in launching projects in support of the Black Lives Matter movement. The social media company has pledged to donate $1 billion to communities that have lost income through the opioid crisis. It has committed to further expanding its Black Friday advertising campaign, which aims to target Black people and focus on things like food, clothing, and utilities like water and power, and will partner with local Black churches to create a new Black Friday Fund centered on Black art. It plans to create at least one million new social media and digital assets for the museum.“We at Facebook take seriously all forms of racism and discrimination seriously,” the company said in a statement. “But this systemic racism harms Black and brown people most.”Facebook will also invest in visual arts through partnerships with the Hudson Valley Museum of Art and the New York Public Library, as well as with the Brooklyn Museum and the Bronx Museum of the Arts and with the Bronx Museum of the Arts. The arts are also examining the sale of works by artists who have significant connections to the city, including Kathleen Cleaver, Jack Johnson, and Mary Mitchell, among others whose work will soon be exhibited in the museum’", "The next Biennial should focus on “the tortoise and the hare,” said Hans-Georg Maaß, the chair of the exhibition’s inaugural committee. In an interview with the Art Newspaper, Maaß called the exhibition “a good example of the future of exhibitions.”\n\n\nThe Düsseldorf-based nonprofit Biennale Berlin announced today that it has received $50,000 from the German government in support of its 2018 edition. The sum is a significant step in its work to secure the future of the exhibition for the capital’s city center. The total package, which also included a small donation from the city of Düsseldorf, was also announced last week at an art bank in the city.In a letter to Berlin’s mayor, Stefan Büttner, dated June 7, the government wrote: “The Düsseldorf-Berlin Artmuseum is one of the most important cultural institutions in the capital. Its innovative, topical, and experimental exhibitions create an impression of a more complex and diverse future. The organizers have worked very hard to shape the exhibition to be a landmark event in the city. I am proud to have", "The next Biennial should take place in the first quarter of 2020. The next edition will focus on the history of new forms of artistic production, with the aim of rethinking the history of art and, in so doing, rethinking the history of humankind. As a society, we must think beyond the history of art and how the history of art can be reconceived as the history of human beings. We must think beyond the history of technology and how science is reshaping our biennials today. We must think beyond the history of language and how our lives and communities are being transformed by new technologies and how these technologies are being redefined by cultural producers and innovators of tomorrow. We must also think about the necessity of future generations to sustain the biennial spirit and the design and architecture of the biennial. The next edition will be an opportunity to think, create and experiment anew.”The 2018 edition of the Biennial, “Beyond Monumentalism” (2019), inaugurated the exhibition “Art as Life.” Taking place at the Meiji Art Museum in Tokyo, the exhibition featured artworks by twenty-eight artists and was organized by the Japanese Ministry of Culture and Sports and the Japanese Society of the Arts", "The next Biennial should take place in the autumn of 2020, and will inaugurate the new museum. Although the exact date of the exhibition was not announced, it will take place in the autumn of 2021. The biennial’s website as well as its Facebook page have also been removed by the authorities. The museum’s Twitter account hasn’t been suspended or taken down. The museum’s website has not, however, been taken offline. The German government released a statement on Friday, October 26, accusing French President Emmanuel Macron of reneging on a pledge to give the German city of Bonn the opportunity to host the 2020 edition of the Biennale. The State Department said: “The new Commission for the 2020 Biennale in Bonn has stated that it would work with the City of Bonn and the German government to ensure that the 2019 edition of the International Biennale d'Orlierä[sic] arrives in Bonn on September 22. Therefore, the state of Bonn has taken the decision to suspend the September 22 event. We hope this does not mean a delay in the event of the 2019 edition of the Po", "The next Biennial should take place in 2020. \n\n\nThe Galleria Fabrica Aperto Artis (GFA) in Milan has received a donation of forty-four works by twenty-three artists from the collection of the Italian collector Domenico Cipolletta. The works, which were donated by Alberto Sartori, Ettore Rondinone, and Andrea Cicutto, were given to the museum in an exhibition organized by Giulio Cipolletta in cooperation with the Giulio Cipolletta Foundation.The current exhibition, titled The Artist in Venice, is dedicated to the history of the Italian artist, Giacomo Casaletti, who, in addition to his wife and children, also owns several churches in Venice and a monastery in the mountains of Turin. The works were gifted to the Galleria Fabrica Aperto by an anonymous donor in the interest of the collection, which is housed in the Giulio Cipolletta Collection in the Museo della Scala, Turin.The Galleria Fabrica Aperto also announced the opening of a new initiative dedicated to the collection of artworks in the city. The initiative", "The next Biennial should take place in the year 2020 and will be open to the public. The themes of the exhibition will be “Musical Legacy” and “Thinking About Music” and will be presented by artist Amada Cruz.Out of respect for the artists and the legacy of the exhibition, the Biennial will honor all of them by eliminating the ten selected artists for whom the exhibition was organized, and will assign them and their respective successors titles. The selected artists will be chosen by the Exhibition and the Director of the Biennial, respectively.The exhibition will be held at the Museo de Arte Moderno in Madrid and will be organized as a retrospective alongside the biennial of modern art, the thirteenth edition of the Venice Architecture Biennale.Exhibition organizers said: “The biennial of modern art in Venice is an exceptional exhibition of contemporary creativity. We are honored to work with the work of the chosen artists and their successors. This will become the occasion for the exhibition ‘The Beat Generation’ to move to Venice and the dedicated project of this year’s season to the city of Barcelona.”\n\n\nThe Museum of Modern Art (MoMA) in New York has announced plans", "The next Biennial should be held in the Spring of 2022.The exhibition will feature work by seventy-two artists, including Hélio Pérez-Brown, Anahad Pinchuk, Anton Kern, and Yahweh Penderecki.The biennial will also invite visitors to experience the exhibition firsthand. The first Biennale Triennale will take place in the summer of 2022 and will offer a unique experience for all. The biennial will be organized in the Park of the Arts, located in the city of São Paulo, Brazil. The exhibition will be hosted by the Museu de Arte Contemporânea (MAS), in collaboration with the São Paulo State University, the Instituto de Cultura Prensa (ISP), and the Ato Maravillas Museum. Commenting on the exhibition, the museum said: “We are delighted to be able to present the new exhibition, ‘BAM!’ in the beautiful Maréfo and the city of São Paulo. It is a great honor to present this exhibition in the city of São Paulo, a city that is renowned for its cultural and artistic diversity.”As the first exhibition in the new year,", "The next Biennial should take place in March 2021. The second, which will be held in September 2021, will feature a retrospective of the work of the year. The 2019 exhibition, titled “Future Present: Art from the Biennial of Arts,” featured work by artists such as Cliff Richard, Julee Báez, Alex Caddell, and Kiki Smith. The biennial also hosted a special exhibition of work by the Los Angeles–based artist Steven H. Halbrook, who was invited to participate in the event as part of a partnership with the Los Angeles County Museum of Art (LACMA).During the exhibition, which took place in conjunction with the opening of the biennial’s inaugural exhibition, Halbrook received a prize at the Venice Biennale for his “Future Present” exhibition. His work was included in biennial projects presented by the Denver Museum of Art in 2018 and Los Angeles in 2019.In an open letter addressed to the audience, Halbrook wrote, “I’m thrilled to return to the Arts Biennale.” He noted that the LACMA show, “[was] an outstanding showcase for artists who’ve made significant contributions to", "The next Biennial should focus on “post-colonialism,” said the arts minister, Carla del Ponte. “It will include an account of the ways in which art and art history are currently and will, with the extraordinary support of the Department of Culture and Education, become a platform for discussing and considering the past, promoting and preparing for art, and influencing the future.”To nominate an artist for the 2020 award, please go here. The 2019 winners are as follows:Dhasia Barua, Mexico City, MexicoThematic Award for Art of the Past “Aura”Natalie Betsky, Los Angeles, CaliforniaThematic Award for Art of the Future Hannah Black, London, EnglandThematic Award for Art of the Past David Blythman, New York, New YorkThematic Award for Art of the Future Ashkantha Brahm, IndiaThematic Award for Art of the Past Karthik Brahm, IndiaThematic Award for Art of the Future Karthik Brahm, IndiaThematic Award for Art of the Past Joseph Bannister, South AfricaThematic Award for Art of", "The next Biennial should be held in 2021. [Update: March 28, 12:00PM] A previous version of this article misspelled Gavin Brown’s name. It has been corrected. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Doris Burke director of the Peggy Guggenheim Memorial Museum. Burke previously served in a number of roles at MoMA, including as deputy director for curatorial affairs from 2012 until 2015, and as director of the Guggenheim from 1985 until 1996.“We are thrilled to welcome Doris to the Museum,” said Marc Glimcher, chair of the trustees of the Guggenheim. “Her proven track record as a curator and her commitment to artistic excellence and to the museum’s mission make her a great fit for our institution.”She succeeds Carolyn Hujar, who retired in 2015 after eleven years at the helm of the museum.“With her work, Doris brings a deep, authentic, and compelling narrative to the Guggenheim,” said Hujar. “Her leadership qualities, expertise, and temperament make her an ideal person for the role of director, and we", "The next Biennial should take place in 2020. “I am very much looking forward to the new challenges that this exhibition will present, and to the collaborative, interdisciplinary, and visionary work that will unfold,” said Kohn.\n\n\nThe Carnegie Museum of Art has announced that Iris Nolen has been named its next executive director. Nolen comes to the museum from the Museum of Contemporary Art (MoCA) in Los Angeles, where she has served as chief executive and artistic director since April 2019. In her new role, Nolen will oversee the day-to-day operations of the museum, which has 10,000 works by contemporary artists in its collection in its exhibition space and in the workspaces of the museum. Nolen will assume her responsibilities on March 23.“Iris is an exceptional leader, who has built a distinguished history in working with and working with MoCA’s communities,” said museum director Carla del Pilar. “Her leadership style and ability to keep the museum moving forward in the best interests of the collection and staff will be crucial as we embark on our next phase as a museum.”The board of trustees added that Nolen will need to work to maintain the", "The next Biennial should be held in Seoul, Korea, in the second half of June, as planned. The exhibition will take place in the National Museum of Contemporary Art (MMCA) in Seoul. It will also feature work by internationally recognized artists such as Sung Min Lee, Lee Jong-Eun, Kim Eun-Hee, and Kim Kwon-Ah.\n\n\nThe Museum of Modern Art (MoMA) in New York has hired Pablo Rodriguez-Campos as its new director and chief curator of photography. He comes to the institution from Los Angeles’s Independent, a nonprofit organization that aims to stimulate discussion and discussion about the art and art history of the Americas. Rodriguez-Campos’s first major role at MoMA will be as director of the Brooklyn-based nonprofit the Gallery for a New American, which focuses on community engagement through photography exhibitions and other activities. The organization has two locations in Manhattan and Brooklyn. The museum has three galleries in Los Angeles, one in Santa Monica, and one in the Santa Fe Building, where MoMA is currently constructing its new headquarters.“Pablo has been a key member of Independent for more than ten years, establishing a strong foundation for contemporary photography in the West,", "The next Biennial should be set up at the State Library of Fine Art in the city of Adel, Florida, in 2021. The next iteration, titled “The Black Tapes,” will be held at the Library of Congress in 2021.This signature event was established in 1844 by the Brooklyn-based artist Lawrence Olivier, who in turn inspired the work of countless others. In addition to artworks, the event will host performances, such as the American Folk Dance Company’s “Soul on Fire” (2018), which was staged by the Black Power Experience (BPA), a group of black local and regional organizing committees, and biennial alumni. The event will also host a variety of educational programs, including a lecture series on the history of African American art at the university this fall. “As a group, we are honored to be participating in this extraordinary year, and to be able to share in the exhilarating moment when the biennial’s inaugural exhibition, ‘The Black Tapes,’ will open to the public,” said Artnet. \n\n\nThe Solomon R. Guggenheim Museum in New York has released the list of seventy-nine artists who will participate", "The next Biennial should be a tribute to those artists whose work has gone untranslated into English in North America. The exhibition should also include an exploration of the role of the local, regional, and international art ecosystem in sustaining and extending the work of these artists.”The biennial will consist of sixteen exhibitions. It will run June 12–June 14.\n\n\nThe Olin Museum of Art in New York has appointed Felicity Orbach as its next director. She will be responsible for furthering the institution’s vision to present art within the context of a thriving cultural district in the city and the region. Orbach will take up the post in July.“Felicity is an excellent leader and I’m confident she will make the Olin Museum of Art a successful organization,” said museum director David Mullen. “I’m thrilled about the opportunity to work with her to explore how art and culture is interwoven for a community through art and culture.”Last summer, the Olin moved six hundred works from its collection to the museum. The move marked the first time that the museum had moved large works since it opened in 1972. Its collection includes works by artists such as Pierre-Auguste", "The next Biennial should draw from the yards of Cannons. This year’s theme is “Soul of a Nation: The Biennial and the Struggle for Civil Rights in the 1950s”; the 2019 winner is Lincoln, a history-making ceremony that will feature a selection of works by fifty-seven artists and collectives from across the globe.The 2017 Biennial, “Body of Work,” was staged at the Space Museum of California in Los Angeles and featured artists such as Paul Gauguin, Charles Darwin, and Pierre-Auguste Renoir. The 2019 theme is “The Body: From the Art of Body to the Art of Life,” and the 2019 winner is Jade, a tribute to the body. The 2019 full list of participating artists is as follows:Artists:Amarie Allen, New York; Braden Allen, New York; Ben Allen, New York; Bobbie Bingham, New York; Charles Allen, New York; ​Carlos Barbera, New York; Carrie Baker, New York; ​Brian Brown, New York;​Chai Baruah, New York; John Baruta, New York;​Chad Baruta", "The next Biennial should open next week. “We are delighted to have the opportunity to present the exhibition that has been in development since 1993, the exhibition that has been driven by a deeply rooted belief that art should be accessible to everyone, and to present the work of a group of artists who have both had and continue to have significant contributions to the exhibition,” said Edwidge Danticat, president of the Biennale and an artist-in-residence.\n\n\nThe Royal Academy of Arts (RA) in London has appointed Suebenden Fischbach as its new director and CEO. Fischbach joins the academy from the Royal Academy of Arts (RA) where she serves as deputy director and chief curator. Previously, she held senior roles at the National Galleries of Scotland and the Lincolnshire County Museum, where she first began her career as a curator.“We are delighted that Suebenden will be joining the RA, which has an important place in the United Kingdom’s cultural life,” said Simon Hill, the RA’s director. “Her extensive experience and knowledge of the arts and the academy make her ideal for the role of chief curator, and we are confident that she", "The next Biennial should take place at the Museum of Modern Art in New York from October 5 to October 7, 2020.\n\n\nThe Philadelphia Museum of Art (PMA) has unveiled revised guidelines for the use of photography in exhibitions organized by the institution. The revisions were made after a 360° survey of the exhibition “Photography in Art,” which will open at the museum in October 2020, was held in April. The exhibition, which was organized by the Philadelphia-based nonprofit Camera Obscura, followed a mix of industry practices such as photographing objects from different angles, including from inside a home, and was curated by Hanna Fox, the director of the New Museum’s photography museum.“We wanted the exhibition to reflect the PMA’s commitment to photographic history and to ask how photography has shaped the museum’s collection and our relationship with our neighbors,” said Fox. “With the help of the PMA’s curators, we wanted to create a platform for PMA’s collection to engage with a contemporary audience in a way that was both frequent and meaningful.”The PMA will reevaluate its exhibition program in 2020, when the museum is slated to host", "The next Biennial should be a success, and I am confident that the next will be, too.\n\n\nThe Massachusetts Museum of Contemporary Art (MMA) in the city of Boston is planning to follow the example of the museum’s parent institution in New York and build a new $150 million museum. The museum is partnering with New York–based developer W.G. Brown & Partners on the project, which will include the construction of a seven-story, four-lane, glass-enclosed structure that will sit within an existing public art project, the Charles River. The museum’s current home is on the east side of the Charles, and the new building will feature a three-story, glass-enclosed structure called the Glasmouth Pavilion.“When we first announced the partnership, we described the Glasmouth Pavilion as a museum for artists, not for the general public,” said David Gavin, executive director of the association of contemporary art museums. “The Glasmouth Pavilion will be a space for artists to build meaningful relationships with one another and the Charles River. We want the Glasmouth Pavilion to be a place where the art of the art of the art of the art of the art of the art of the art", "The next Biennial should be held in the spring of 2021. \n\n\nThe Spanish Institute of Modern Art (SICAM) in Madrid has received the commission of artist Oriana Guedes for its new ten-thousand-square-foot building, which will be inaugurated in the summer of 2022. Guedes will draw from her own body to create a string of images that will appear as if they are floating in space. The works will be created using her own skin, hair, and tears.The installation will be part of a series of works that will be presented in Madrid in mid-May. The last of the works was “The Body and the Sea,” 1988. Guedes’s new building—designed by architect Jorge Vicente—is the former residence of the Austro-Hungarian architect Emil Ludwig’s studio, which is currently being restored by architect Huzain Bedier. The new museum, which is slated to open in 2022, will be located in the former warehouse district of the Museum of Modern Art in New York and will be inaugurated by a series of operas that will be staged by the artist in stages. The inaugural show will include “Alfred Kru", "The next Biennial should take place in 2020. “The future of contemporary art is far from certain,” Milan-based architect and writer Stefan Antonić said. “It is already impossible to imagine an art-world without digital art, and as technology advances and advances, so does the possibility of new forms of knowledge. The art of the future is already digital, but it is not yet the art of the past.”\n\n\nThe Art Newspaper has announced the twenty-seven artists who will be featured in the third edition of the Art Newspaper Art Tour, which will take place in Lyon, France, in September. The event will be held at the Roesvækrete in Kultheim, Denmark, and will feature sixty-one artists from forty-two countries. The theme of the event is “Networked and Mechanical: The Future of User-Centered Art,” and the fifty-six-person group will consist of Arash Chaudhary, Luca Zingaretti, Joseph and Luca Sarpoli, and Valentina Zingaretti.“I’m delighted to present my first Art Newspaper Art Tour. The artists in the group have done a", "The next Biennial should focus on “theoretical and practical solutions to the problems of ecology and the environment.” The exhibition, titled The Future We Want, will run through February 5, 2020 at the UNESCO Headquarters in Paris. The event will also feature a special exhibition of work by the artist Monica Bellini.The Venice Biennale was established in 1960 by the Italian painter Andrea Bertini and the Turkish architect Selahattin Çoğan, who was awarded the Nobel Peace Prize in 1964. The exhibition reached its landmark in 1972 with the installation of a work by the artist Juan Garrido at the exhibition.\n\n\nThe Pacific Standard Time Foundation (PSF) in New York has received a gift of twenty-six works by artists and collectors Betty Jo Burnham, Helen C. Thomas, and Mauren C. Thomas, as well as a priceless trove of artworks from the artist’s family. Included in the gift is a copy of the first edition of The Art of Art of Crying and a copy of the first edition of The Shadow and a copy of a work by Thomas’s masterpiece I’m Dreaming of a Dream.Alfred A. Knopf in New York also announced that it", "The next Biennial should be held in the autumn of 2020. The 2019 exhibition was organized by the Museum of Contemporary Art Los Angeles, the contemporary art center Artiji, and the curatorial team of Erik Teo and Eric Lidén, with the support of a three-day grant from the Fondazione Prada Foundation. The museum has held the exhibition since 1987.\n\n\n\n\n\nFor roughly five decades, the Paris-based nonprofit the Fundação da Fundação (FF) has supported artists in Brazil. Since its founding by artist Hélio Oiticica in 2001, the organization has raised more than $4 million for roughly one hundred artists. In 2018, the organization announced it would be closing its “blue-chip” venues, leaving the arts to the “best performing artists in Brazil”—a move that coincided with the “planned transition of the Fundação da Fundação” to a “new form of organization” that would operate under the patronage of a new board of directors.In the months leading up to the move, the organization faced rumors that it would be shuttered, with some outlets speculating that it may", "The next Biennial should be held in 2020.\n\n\nPOPPAL, Poland— The Polish parliament voted on Wednesday to establish a national museum devoted entirely to the life and works of Polish painter Jan Tomasz Klimczyk. The bill that passed the parliament on a party-line vote condemns Klimczyk’s work as “incompatible with the traditions of the nation, with its political, aesthetic, and historical complex, and with Poles’ heritage.”Although the museum will be comprised of two buildings, the exhibition will take place in both an open and a closed setting. Klimczyk’s studio will be situated in the former Potsdzystawcze, a Polish town near the city of Poznan, and will showcase the artist’s work. The museum will also house some fifteen thousand objects, including Klimczyk’s photographs, drawings, posters, collages, and other works. The museum will be led by museum director Mateusz Kaczyński, a former director of the Museum of Fine Arts in Warsaw, and will be based in a former industrial site in the city.The bill states that the museum will operate as a repository for K", "The next Biennial should take place at the Museum of Contemporary Art, Los Angeles (LA MoCA), in 2021. Curated by Elissa “O.J.” McLean, a curator and dean of the Yale University Art School, and his partner, the artist Marc Bloch, the exhibition will focus on the art of landscape art, which is contemporaneous with the art of the city and will showcase work by eighty artists from twenty-nine countries. The first exhibition at the museum will be “Beyond the Frame: An International Exhibition.” The exhibition will examine “the relationship between photography and landscape.” It will also present works by seventy-two artists, including Rujeko, O. J. Farley, B. J. Al-Khalili, and Anish Kapoor, and will include works by thirty-eight artists from twenty-six countries.The exhibition will be held at the Museum of Contemporary Art Chicago (MCA), which is undergoing an expansion, and will be hosted by the Z-Ro museum in Manhattan. \n\n\nThe Museum of Contemporary Art (MoCA) in New York announced today that it is expanding its curatorial team and is hiring Rachel Calder as its first new", "The next Biennial should coincide with the host city, and will open on September 24. The exhibition will draw from artists’ own collections for the first time, in an attempt to address the gap between the artist and the city. Artists will include Jannis Kounellis, Nisa Pindell, and Teju Cole. The theme “On the Edge of Death” will highlight the interconnected trajectories of life and death within and between the United States and the city. The exhibition will also feature a number of key works by artists such as Ed Moses, Charles Ray, and Terrie Seymour.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) has appointed Michael Daniel as its new executive director. In his new role, Daniel will be responsible for facilitating the organization’s growth and for guiding its annual fundraising drive. The institution previously hired Beth Martin as executive director in 2016.“Metropolitan is facing many challenges right now,” Daniel said in a statement. “I’m eager to take on these challenges with the museum in order to ensure that we continue to be a meaningful and inspiring presence in the heart of the city.”Commenting on his new role, Daniel said:", "The next Biennial should be in January 2022. The original date was January 19.The second one will be in February 2022. The third one will be in March 2022. The fourth one will be in April 2022. The fifth one will be in June 2022.  The grand prize ceremony will take place in May 2021. The twenty-eighth Biennial will be held in November 2022.    “We have been working hard to strengthen the sponsorships of these biennials over the years and to give them greater opportunities,” said Artsakhina. She added that the new prizes will help support the development of arts and cultural projects in Armenia and will encourage the sharing of technologies. The artists selected for the annual awards are: Artsakhina, Viktor Gogayev, Tommaso Sarpolov, Markus Spies, Marcel Stiegler, Prudence Whittlesey, Sara Zivanovska, Nathan Ropac, Brandon Tippel, Elizabeth Warner, Ashley White, Matthew Williams, A. J. Calkins, Khal", "The next Biennial should take place in 2019. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released the schedule for its third edition “Museum of Contemporary Art: Selected Letters,” which will run from March 14 to March 21. The biennial will also introduce a new ticketed event series and a new digital content program. The event will be held in the former Boeing factory at 928 West Twenty-Second Street in Los Angeles, which was converted into a museum in 1996 and is currently being restored by the architect and landscape designer Michael Künstler.Museum director Carol Stamper said: “I’m really excited by how we will present the third exhibition of the MCA’s collection to the public. The first exhibition was for all our current and future guests in our new space, which was designed by Peter Zumthor and the architect Peter Zumthor + Partners and opened in February 2019. The second exhibition was for our current and future guests in our existing space, which is being restored by the architect Daniel Libeskind and the landscape designer Lucy Stolberg and will open in November 2020.”The 2019 edition also introduced “Pace” and", "The next Biennial should also address the ongoing challenges of environmental justice, the Black Lives Matter movement, the emergence of new strains of racism and xenophobia, and the displacement of populations in the Global South.The 2020 theme “Quantum Peace” will be “The Quantum State;” a reference to the quantum state theory, a foundational work of Albert Camus\u0097which is often cited as the inspiration for the art that was collected at the museum during the exhibition’s inaugural year in 2005\u0097and will explore the philosophical and theological questions posed by quantum physics. The exhibition will also focus on the non-local nature of reality through a combination of new and traditional methods.“We are deeply concerned by the radical shift in vision and outlook that has occurred since the museum’s inaugural exhibition in 2005,” said Jürgen Galt, chair of the new board and president of the organization. The board has already pledged $40,000 to the exhibition, which will be held in December 2020 at the Biennale de Lyon.\n\n\nThe National Gallery of Scotland has appointed Kirsty Cullins as its new chief executive and director. Cullin comes to the institution from the National Arts Centre, which she has led since", "The next Biennial should be held in 2020. The artist-run event is currently on hiatus as the government attempts to clamp down on the spread of the coronavirus.\n\n\nThe Museum of Contemporary Art (MoCA), California, announced today that it will close its doors for a period of sixty days to support efforts to curb the spread of Covid-19. The central exhibition of the organization’s twenty-fifth edition, “Between the Sun and the Moon,” will be temporarily closed until the end of May. The museum will hold a grand opening ceremony on May 3, followed by an exhibition of works by Rosalind Nashari on May 7, and an exhibition of work by artist Vito Acconci\u0097which will run concurrently with the Grand Central Park reopening in May 2020\u0097on May 12.“The MCA is committed to working in partnership with our community to further our mission of supporting artists and their projects by working with local, state, and federal governments to identify policy and legislative options that can support the arts in our communities and local governments working with local, state, and federal governments to develop policies and legislative solutions to promote artists’ work is a crucial step in our ongoing work to strengthen California", "The next Biennial should take place at the Museum of Fine Arts in New York. For a full list of participating artists, visit the institution. The 2019 edition of the Biennial, titled Adolfo Celant’s I, was presented by König & Co. According to the Art Newspaper, Celant’s work is known for its conceptual and abstract explorations of new media and space, and for staging domestic and urban interiors in a way that breaks with tradition. The exhibition drew approximately two hundred visitors and a record-breaking total of $28 million. In the inaugural exhibition, Celant created a series of interiors and scenes that involve the ongoing use of photographs in both envisioning and photographing, and performing a recast of Ovid’s Metamorphoses.\n\n\nThe Association of Independent Schools of Art in the United Kingdom (AIST) has announced that it is suspending its annual fundraising gala in March 2019 to focus on the issues of the year. Instead of a large gala, the organization will hold one-to-one engagements with artists and local schools in the city of Brighton and the surrounding area. The April twenty-fifth event will now be remembered", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MCA) in New York has announced that it is preparing to welcome visitors back to the institution, citing the current health crisis in Puerto Rico as the reason for the denial of entry. The institution, which was forced to cancel a number of events due to concerns about the coronavirus, said that it is working to figure out how it will reopen to the public for a number of months, possibly through spring 2020.The reopening date has received some of the support of local, state, and federal governments. Governor Andrew Cuomo said that the state is \"continuing to review all available options\" and “will take further action when the facts and circumstances dictate we must.” New York City Department of Health and Mental Hygiene director Deborah Granville said that the city is still evaluating whether it can keep the public safe from Covid-19.The coronavirus has infected at least 4,700 people in the United States, and the number is expected to rise as more cases are confirmed. On Wednesday, the CDC announced that it had confirmed 39,844 cases across the country and that the number of cases is expected to rise to 56,087 by the", "The next Biennial should be held in Algiers in the spring of 2021. Ibn al-Khattab has expressed hope that the new venue will become an important moment for the radical community to reflect on its future. As the director of Biennials II and III, I hope to empower the radical imagination through technical and artistic excellence, inspire a new generation of scholars, and provide an opening for the study of Islam and politics.”\n\n\nThe Metropolitan Museum of Art and the Solomon R. Guggenheim Museum in New York have agreed to merge. The newly combined museum will serve as the center of the Museum’s new online viewing experience, “The Met,” which will debut on the new platform MetMuseum. The new museum will launch on October 22 and will be ferried to and from visitors’ homes via a new $1 billion high-speed rail line.The transaction between the two institutions marks the culmination of a nearly eight-year partnership that began when the Guggenheim relocated to a new building in 2001. The partnership was initiated by the architects to allow the Guggenheim to maximize viewing opportunities across the two venues. The partnership culminated in the installation of the museum’s", "The next Biennial should be held in 2022; the 2019 edition was staged in 2020. \n\n\nIn celebration of the seventy-first anniversary of the Astana Biennial, Russian culture minister Vladimir Medinsky announced on Thursday that the event will be held in the Kremlin’s Red Square in February 2022. The announcement was made at a ceremony in the Kremlin, where the ceremony was held, in which the pavilion of fifty artists was renamed.The artists chosen for the pavilion were Mara Zhukova, Vladimir Medinsky, Alexander Shcherbakov, Lukashenko, Andrey Shatkov, Viktor Tajkov, Andrei Shlemenko, Alexander Stroikov, Callum Taylor-Johnson, Raymond Barlow, Giorgio Tavani-Ullman, and Jonathan Wilson. \n\n\nOn Monday, the New York City Department of Cultural Affairs (DCLA) issued a public health advisory regarding the spread of Covid-19. According to the New York Times, the advisory stated that people who have recently traveled to or are currently traveling should avoid public areas, and recommended against social gatherings, drinking alcohol, and propping up one", "The next Biennial should be a showcase of the exhibition industry’s international reach. We must recognize the power of the arts in creating new and positive connections between people, communities, and the biennial.We hope that the first Biennale, to be held at St. Stephen’s Episcopal Church in London in 2023, will inspire us all to reconsider what it means to be an artist in this age of unprecedented social and ecological challenges.” The history of the institute is also a story of its rapid growth and its efforts to become a leading contemporary art museum. In 2002, the museum undertook a major expansion, adding new galleries, exhibition spaces, and a contemporary art research library. It also hired four new directors and a board of trustees, which included Tomás de la Rosa (former director of the El Museo del Barrio), Gavin Brown (former director of London’s Tate Modern), and Matthew Lilly (former director of Tate Britain).Lilly also served as director of Tate Modern from 2003 to 2009 and oversaw a series of exhibitions that included Rosa as well as the first major retrospective of the artist’s work in the United States. A year later, the museum opened a new 1", "The next Biennial should be called the 'Art of Life: How Science and Nature Shape Human Experiences.' The theme of the upcoming event will be “How do we care for our bodies, our environment, and ourselves in the service of the biosphere?”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Luttrell Brown will be the next executive director of the institution. Brown will succeed Michael Stipe, who retired in June after twenty-seven years as director following two years as deputy director and will assume his responsibilities in January 2021.“Luttrell Brown is a gifted and passionate leader who has built a distinguished history of innovation and stewardship at the Museum of Contemporary Art,” said Elizabeth Grosch, chair of the board of trustees. “His deep understanding and passion for this important and challenging field makes him ideally qualified for the role of executive director.”Brown began his career at the Museum of Contemporary Art in Los Angeles (MCA) as a curatorial assistant in the department of the visual arts and design in 1988. He joined the curatorial staff in 1998 and was promoted to chief curator in 2007, when the institution opened its new building, the Allen Memorial Garden,", "The next Biennial should take place at the Palace Theatre in London in 2021.  Bradley Kavanagh, an artist whose work explores interconnections, said: “I am absolutely thrilled to open the doors of the museum and become a part of the exciting future. . . . It will be a long and difficult journey, but I believe there is much to see and do. I look forward to sharing it with you.”\n\n\nThe Kensington and Chelsea artist-run space Assemblage has announced that it will close permanently after 15 years of operations, citing the pressures that come with the “generational change.” The news comes amid concerns about the global health crisis and the exhibition and rental industry, which is struggling in its aftermath. Following the closure of the Paris Biennial earlier this month, the National Galleries of Scotland announced that it would also suspend operations—a decision that was criticized by some as an attempt to avoid facing the global health crisis.Kensington and Chelsea artist-run spaces have played a vital role in the city’s revitalization and have been instrumental in the city’s continued success. More than twenty-five thousand visitors spent time in the galleries in 2016, the", "The next Biennial should take place in the city of Nairobi sometime next year. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles on Monday announced that it will be closed for an indefinite period of time due to the coronavirus. “We are taking this crisis seriously and are working with our partners to determine the best way to support our staff and visitors through this difficult period,” museum director Christopher Wilmoth said in a statement. “In the meantime, we are paying close attention to the progress of the coronavirus in West Africa and will announce additional programming and exhibitions as appropriate.”The cafe chain recently announced that it would suspend all online engagements with visitors from Guinea and Sierra Leone until further notice. The decision led some visitors to believe that the institution would be closed until the end of the month. However, others were disappointed to learn that the venue would only be partially closed through February 28.In an attempt to reassure visitors, the museum will outfit the museum with new protective gear and will have additional health officials onsite to monitor visitor health. According to the Los Angeles Times, hospitals in the United States are reporting an uptick in the coronavirus, which is spread mainly from person to person,", "The next Biennial should be held at the Guggenheim in May 2020 and the second in November 2021. The 2020 event will also include a special exhibition of work by a select group of artists from the Guggenheim’s collection. The first event, entitled “The Rhythm of Motion,” will be staged at the Museum of Modern Art (MoMA) in New York and will be followed by “The Doctor’s Dilemma” and “Quirky,” events at the Hammer Museum in Los Angeles, “The Guggenheim’s Dilemma,” and the Metropolitan Museum of Art, and the new exhibition “The Power of the Body” will follow in 2021. \n\nThe London-based arts advocacy charity the Institute of Contemporary Arts (ICA) has announced the launch of a new initiative, the Institute for the Arts and Culture (A&C), to support the growth of the UK’s arts and cultural sector. The £3 million initiative will support the development of a new curriculum for arts education and training, the A&C Challenge, and will work with museums, schools, and cultural organisations to strengthen their teaching and", "The next Biennial should focus on the history of art in the city and should take place in the Kitakyushu Museum of Art. The Museum of Art Tokyo will likely be the next to host the thirty-second edition of the Tokyo Art Biennial, the first being a retrospective of twentieth-century American art in 2006.\n\n\nPlans to open a new art museum in São Paulo, Brazil, have been scrapped amid the ongoing health crisis in the country. The plans for the new museum were announced in April 2019, three months before the pandemic began and two months before the institution was scheduled to inaugurate a new exhibition of art in the country.The opening of the new museum was supposed to take place at the end of June. However, the opening was pushed back to June 20, with the pandemic forcing the cancellation of other events. The reopening of the museum will still be pushed back, and the date of the show will be pushed back to June 22.“The show and exhibition program at the new museum is not ready for prime time,” said sculptor-turned-activist Marceline Pires, whose six-decade-long campaign to save both São Paulo’s art and its", "The next Biennial should be held at the Rijksmuseum in Amsterdam in 2022. \n\n\nThe Institute for Advanced Study (IA) in New York has appointed Paul Mpagi Sepuya, a Ghana-born, New York–based artist, as its next president. He is currently the head of the New York–based artist collective BAM, which serves as a home for emerging and established artists.“Paul has a strong history of working with and teaching young artists in Ghana, a country he grew up in,” said Ira Halstead, chair of the IAA and president. “By partnering with artist-run, nonprofit institutions that cultivate the imagination, he looks forward to working with these artists to create new and innovative ways of thinking about art and artmaking.”Sepuya is a founding member of the Ghana Cultural Group and the country’s largest creative organization, which has supported more than 120,000 artists in the last five years, including Alan Reid, Nusrat Ghani, and Nelson Igbo. Previously, he served as a creative consultant for the Ghana Cultural Foundation (GFC), and advised artists such as Isaiah Berlin, Sam Baldock, and Noma Abdi.", "The next Biennial should have such a program and will deliver such a program in 2021.”\n\n\nArt Singapore’s 2020 edition, “Art Southeast Asia,” was held at the Louvre Paris from February 13 to February 16. The event, which featured ninety artworks by seventy-six artists, was curated by the Singapore-based fair director, Tan Tsui, and constituted the first edition of the Southeast Asian Art Biennial (SABA).“It was a very exciting show,” Tan told the Art Newspaper. “We were at a crossroads. We had more than ten years to create a new program and to develop an old program together.”Despite the fact that this year’s edition is the largest and most ambitious in the country’s history, the space was crippled by Covid-19—the virus has since spread to twenty-three other countries—and the exhibition was forced to move to a new venue in the city of Foshan, China. The event was also forced to cancel the 2020 edition, which was originally staged at the Art Museum in Singapore. Last week, the fair announced that it is launching a fund to help Artists’ International (A", "The next Biennial should take place in the spring of 2022 and will be hosted by the Museum of Fine Arts in Boston. “This is a moment of great change for the biennial,” said Emma Elam, director of the Biennial. “This year’s Biennial will incorporate a unique collection of works from a number of sources, both from the contemporary artist and academic world and from the high-tech, modernist, and post-modern eras. ” This year’s theme, “The Future is Now” will be revisited in the spring of 2021.\n\n\nFrench president Emmanuel Macron said on Tuesday that the country will ramp up its production of natural gas, oil, and coal in order to meet rising demand from cities and industries as the country attempts to reduce greenhouse gas emissions. Macron also outlined plans to address the country’s air pollution crisis during an interview with the Art Newspaper on Tuesday.The French government hopes to ramp up production of the fuel in order to meet rising demand from cities and industries as the country attempts to reduce greenhouse gas emissions. The strategy has already yielded impressive results, as France has reportedly ramped up its coal-fired power plants to reduce pollution from coal"]