["The next Biennial should be held in the Spring of 2021. The channel will organize the exhibition once again, but in a different location, to reflect the contemporary international art landscape.\n\n\nThe Human Rights Campaign (HRC), the nation’s leading gay rights organization, has released guidelines for how charitable organizations should proceed with gay-affirming surgery. While the guidelines state that hospitals must provide patients with appropriate, compassionate care, they also emphasize the need for hospitals to understand their patients’ needs and what therapies are best for them. The guidelines also outline how a hospital’s role is to serve as a space for healing and connection within a community.While the guidelines are a step in the right direction, the organization cautions that they are only a starting point and must be followed by a hospital or other medical facility in order to truly understand the guidelines.“We recognize that many hospitals have had positive experiences with transgender patients and want to encourage hospitals to understand the needs of their patients and their patients’ families,” said HRC president Mary Naimark in a statement. “However, we recognize that it is up to hospitals to set the standard for trans care in their communities, and for hospitals to meet the needs of their communities.", "The next Biennial should be held in the United States, the first in the West, in the spring of 2021. The first events of the new edition will take place in New York City and will be staged in both English and Spanish. Advertisement\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it will begin welcoming visitors back to the institution in 2021 following a $100 million facelift and expansion. The museum—which recently welcomed visitors from the United Kingdom and France—announced the project in June 2019. The overhaul comprises a series of new galleries, classrooms, and spaces for public programming, as well as the reconfiguration of the museum’s most iconic building, the Glass House.“The first exhibition to be staged in Glass House is entitled “Architecture of Life”\u0097the first show dedicated to the work of Kiki Smith. The show is scheduled to run from March 21 to March 28, 2021. Titled “Fashion’s New Heart,” Smith will present a series of projects that will explore the relationship between fashion and the body\u0097the work of artists such as Pierre-Auguste Renoir, Nell Doran, and Bénédic", "The next Biennial should be held in 2020.”\n\n\nArtforum, the Los Angeles–based arts forum founded by Michael S. Greenberg and Lawrence Rinder in 1988, has appointed Carol Chiu as its next executive director. The long-time curator and writer, whose critically acclaimed series “Avant-Garde Women” (1991–1993) and “Wangechi Mutu” (2001–2007) explored the role of women in artmaking, is now the fourth woman to helm the Los Angeles–based art forum.“We are thrilled to welcome Carol to the team,” said Greenberg. “Her extensive experience and expertise in the arts and her vision for the Forum are extremely attractive to us, and we are honored to have her join the editorial team and the curatorial team. Carol’s work embodies the values and ambition of the Forum’s mission, and we are proud to support her in her ambition to push the medium and the art world in new directions.”The former curator and writer, who served as editor in chief of Avant-Garde from 2001 to 2008, will be responsible for presenting the latest in contemporary art and curating for the Forum’s online", "The next Biennial should be held in 2020. On Sunday, Bahrain set an all-time high for the number of deaths from the coronavirus, with an official estimate that counted 194 people as it was wrapping up its first phase. Most people in the country are now focused on preventing the spread of Covid-19, which is spread mainly from person to person, and are trying to limit outdoor activities in order to prevent the spread of the virus. The coronavirus has already claimed the lives of more than 420 people in the United States and has been blamed for spreading the virus to more than 300 countries.In an attempt to stem the virus, the United Kingdom is planning to ban large public gatherings and limit gatherings of more than twenty people. The new measures will likely only make things worse. The coronavirus has spread to at least forty countries and has killed at least 679 people. The World Health Organization (WHO) reports that the death toll could rise as high as 6,800.\n\n\nThe Museum of Modern Art (MoMA), New York, has announced that the institution is working with the philanthropists Michael Kimmel and Manuela and Angel Ureto to raise $12 million to secure the future of the institution—the", "The next Biennial should be staged in 2022, and the last in 2023. \n\n\nThe Kunsthalle Basel is going to suspend its upcoming edition in March 2019 due to a possible outbreak of the novel coronavirus. The news comes on the heels of the announcement that the Kunsthalle Basel, the Basel Art Biennale in March, and the 2019 Venice Architecture Biennale have all been canceled. The reopening of the Kunsthalle and the Art Basel in September will be delayed, and the upcoming editions of the fabled Bilder und eigene Berliner will also be postponed.The delay comes after a number of European countries announced that they were preparing to take preventive measures, including restricting travel and curtailing social gatherings. The United Kingdom, which opened its borders to large-scale immigration last week, has also been preparing for a global pandemic. The Royal Institute of British Architects (RIBA) in London has been working on a new emergency plan that would see large-scale sporting events canceled, and the Royal Shakespeare Company and the Royal Festival Hall have also been working on contingency plans.Earlier today, the UK revealed that it is preparing to introduce a minimum wage of £9.75 an", "The next Biennial should be held in 2022. Specific dates for the 2018 event have yet to be determined.\n\n\nThe Museum of the African Diaspora (MAD) in Oakland, California, is seeking a new general manager following the departure of Kimerly Rorschach, who was hired in August 2018. The institution’s board chair, Melinda Hennessy, appointed Darren Salford as the interim leader until a new director can be found.Salford was hired by the museum in September 2018 and has served as its interim director since March 2019. He will assume leadership of the museum during a search for a new director on March 31.In his new role, Salford will work closely with the staff and will develop biennial programming in conjunction with the institution’s upcoming exhibition “African Art: History, Theory, and Performance” (2019–20) and the upcoming exhibition “African Art: The Origins and Evolution of Modernism” (2019–20). Salford will also help the museum prepare for its upcoming exhibition “African Art: Nongame,” which will be staged at MAD in October 2020, and will oversee the museum’s acquisition and display of African", "The next Biennial should be held in 2020. The next series of exhibitions should be held in 2021 and 2022. A new exhibition of works on paper will be organized for the second edition of the Biennial in 2021. The theme of the 2020 edition is “Purpose and Performance,” and it will take place in a traveling exhibition.“I want to stress that the future of the Biennial is a great responsibility for the City. We are working hard to make the Biennial as vibrant, relevant, and accessible as possible to future generations,” Mayor Bill de Blasio said in a statement. The Brooklyn Museum and the Metropolitan Museum of Art—as well as several other New York institutions—are currently working on revamping the city’s transportation system. According to the New York Times, the city currently has more than 2.7 million miles of subway tracks and plans to double down on investments in the area. The plan is to begin by widening sections of the tracks and reconfiguring the existing tracks to allow for the construction of more stations and the expansion of the network, which would then be able to carry more people. The project is estimated to cost as much as $1.25 billion and would see investments made across", "The next Biennial should be launched soon, and a new edition of the festival should be held in the autumn of 2020.The new format will include more panels and more performances, and will be presented by a new exhibition gallery that will be located in a new, larger building adjacent to the museum. The institution will open in October.The new art spaces will be named after the artist(s) and not the museum; the new name will be the Biennial of Günther Stiegler. The new exhibition will be hosted by the curator of contemporary art Gustav Klimt, whose work is exhibited in the Biennial of Warhol, the Museum of Modern Art in New York, and the Museum of Modern Art.\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that, beginning in 2020, it will return more than 30 percent of the funds generated by the sale of works by artists and will offer a retrospective of the work of three new artists. The museum will also plan to launch an online program that will allow visitors to view works by artists who have entered its collection and to obtain additional works by artists whose works are in the collection.The exhibition of the new works, which were commissioned by MoCA and the Art Institute", "The next Biennial should be in the second half of the year, with the theme “Kin,” which will focus on the intimate relationships between people and body. The exhibition, which was inspired by a trip to China by a group of American artists, is being hosted by the full range of the museum’s departments, with exhibition space allocated to art, design, and design-focused areas.The first round of the exhibition will feature works by thirty-four artists, including Huyghe, Narsingh, and Thomas Heatherwick, as well as works by artists from the Americas and Europe. The second half of the exhibition will be a biennial reconstruction of the eighteenth-century English town of Blackheath, England. The exhibition will include more than one hundred works by contemporary artists and will run for thirteen weeks. \n\n\nThe Carnegie Museum of Art in Pittsburgh, which recently announced plans to eliminate twenty-six paid internships in its collections as part of a restructuring that will involve attrition and would also prioritize the collection over the institution’s classrooms, has received a significant gift from the artist-lover and philanthropist Diana Bailey. The Carnegie Museum of Art will receive a new set of Cherson-Sk", "The next Biennial should be held in 2022. “I would very much like to see more exhibitions in the city of Bristol,” said director Mark Burghart. “This is a city that has some of the most exciting and exciting cultural spaces in the world. I want to see more of them in an exhibition-based way.” The decision to change the venue for the sixth edition of the Bristol Biennial, which will take place at the city’s Tate Modern in 2021, was made following the announcement of a new £9.7 million fund for cultural development by the city.The funding will be used to create a new exhibition space in the city’s historic Royal Exchange Gallery, and will also support the refurbishment, design, and restoration of the city’s iconic Warhol–designed Castle House, the city’s oldest public art installation. The city also announced a new 11,900-piece retrospective of the artist’s work, titled “Slavs” (2019), and a new film series, “The Man in the Shadows,” which will be presented by director Phyllis Stroud. The event will be staged simultaneously in the", "The next Biennial should take place in 2022.\n\n\nThe Kerala Arts and Culture Summit, which was held in Kochi from March 25 to March 28, is planning to hold the eighteenth edition in mid-May. Dubbed the 'Anusotus', the event will take place in the southern town of Borivli and will be led by director of the Kerala Arts and Culture Mahadevan. According to a statement, the Arts & Culture Ministry will be \"fully supporting\" and “acting in concert with the local community of Artsakh’s South Bank,” a reference to the forthcoming film. The film festival was picked as the perfect platform for the biennial, which will focus on contemporary art.\n\n\nThe Guggenheim in Berlin is planning to move the twentieth edition of the Guggenheim Triennial to April 2020. The move, which was first reported by German newspaper Frankfurter Allgemeine Zeitung, follows the closure of the institution by the German federal government and the Berlin city council. The decision to postpone the event, which was initially scheduled for March 31, has been controversial. The exhibition has faced numerous cancellations and postponements in the past, and organizers cited the worsening Covid-19", "The next Biennial should be a unique event that will showcase the work of both the artists and the most important contemporary artists of the twentieth century.”\n\n\nThe Metropolitan Museum of Art has appointed Julie Holland as its next director. Holland joined the museum in March 2019 from the firm of Thomas L. Hunt & Partners, where she had served as deputy director since 2014. She succeeded Christopher Wool, who had led the museum since 1998, and has since overseen the museum’s expansion and renovation projects.“Julie is an outstanding leader, capable of bringing together and elevating our different visions of the museum,” said Thomas L. Hunt & Partners chair Daniel L'Heureux. “Her ability to use artists’ creative and academic practices to address critical and pressing issues in contemporary art has been instrumental in our ongoing success. Her leadership, vision, and vision build upon the museum’s reputation for the cutting edge and the most interesting contemporary art.”Prior to joining the Met, Holland served as the inaugural director of exhibitions at the Museum of Modern Art in New York. During her tenure, she oversaw the launch of the firm’s first collaboration, “NIRIN” (2015–16), a multi", "The next Biennial should focus on how the work of artists and organizations and their provision contributes to, and enhances, the vibrant, organic, and interconnectivity of the city’s art and culture. The Art Newspaper has listed the museum as the twenty-fourth recipient of the second stage of the John Simon Guggenheim Memorial Prize, which was established in honor of the late British artist.The MacArthur Foundation, which announced the awardees this morning, said that this year’s winners “reflect the breadth and depth of their achievements, creating new, transformational experiences for a world that was previously thought too small and nonsensically familiar.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Mira Pape as its next director. She will be responsible for overseeing the museum’s expansion, renovation, and redesign—a $70 million endeavor—and will take up her new post on August 31.“Mira’s passion and ability to prioritize and prioritize the museum’s needs have been exactly what we expected from an individual who has spent her entire career as a leader,” said LACMA interim director Mary Anne Carter. “Over the last four years, she", "The next Biennial should be held at the same time, in the same city as Milan, and will soon be inaugurated by the exhibition of the artist “Ricco della Francesca” (The First Man).\n\n\nIn the wake of the devastating fire at the Centre Pompidou in Paris on November 13, several cultural institutions and arts centers have pledged to welcome visitors from November 18 through December 11. The dates vary by institution, but most are opening on Wednesday, November 21, and will remain closed until March 15.The Institut Pompidou d’Art Contemporain (PAPAC), a French cultural institution that specializes in contemporary art, has announced that it will be open on Wednesday, November 21, and runs a number of programs that celebrate the work of contemporary artists. The institution will also host a number of performances and other events that celebrate the work of Sydney’s artists, including Joel and Ethan Joseph. Their inaugural edition of “Respa,” at the Centre Pompidou, will be held on Thursday, November 22, at 8 PM. The event will feature performances by Emmanuel Mering, Lucio Fontana, H", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released its long-term sustainability plans for the institution, which are based on the theory that the museum will need to make up for lost revenue as a result of the coronavirus and will invest in workforce training, improved conservation practices, and sustainability initiatives to mitigate the impact of the coronavirus.In its eighth edition, “Sustainability at Art,” which was held at the Los Angeles County Museum of Art (LACMA) from March 16 to March 23, the museum revealed that it is reducing the number of its public engagements to three times a year from the usual five, and that it is working with the California Air Resources Board (CARB) to update its air quality monitoring systems. The changes will take effect immediately and will be implemented through 2020, the museum said.The changes will involve the collection of air quality data from fifty LAXMA locations, including the museum’s new building and the new mezzanine level, and will involve the collection of air quality data from fifty of the museum’s existing buildings. The air quality data will be made available to the public through a", "The next Biennial should be in 2022 and the fiscal year 2020 will include the exhibition of the new works. The exhibition will be preceded by a series of biennials, each taking place in the city and featuring a selected selection of works. Frisch and Spelke are currently working together on a project for the Museum in the City of Basel, which is scheduled to open in April of 2022. The first show of the new museum will be “The Sustainability of Things” in October 2022.\n\n\nThe Royal Academy of Arts (RA) in London has appointed Lizzie Aitken as the new chief executive and artistic director of Tate Modern. She succeeds Graham Hawkins, who retired after eighteen years at the institution last month, and will take up the post on September 9.“Lizzie joins RA from Tate Modern, where she has led the contemporary art organization for twelve years, and brings a wealth of experience in the museum as an executive, an artistic director, and a curator,” said Graham Hawkins, who has helmed the academy for more than twenty years. “Her new role is to ensure that Tate Modern is positioned to play a key role in championing the next generation of British art.", "The next Biennial should have been held at the same time as the previous one. In fact, the previous Biennials have been held in different locations. The selection committee decided that the best way forward for the Biennials is to have them open and open again in the same location in order to keep the theme of the first show fresh. The twenty-fifth Biennial will be held in 2021. For those who wish to visit the museums on a day-by-day basis, there are still four days left to visit the museums. Following the closure of the museums, the public will be able to visit and experience the newly renovated Visitor Experience. The new pavilion in the center of the museum, Kunsthalle Basel, will also be inaugurated on Friday 3 August, with the exhibition “The Museum of Modern Art: From the Margins to the Center,” which will be on view until 28 August.The Berlin Art Museum is planning to reopen next week following a short break. The Nationalgalerie Stuttgart, which moved back into the capital’s Hamburger Bahnhof in August 2018, announced that it would reopen on 31 August. The Ar", "The next Biennial should take place in 2020.  --M. Köhler\n\n\nThe Agitprop Art Museum in Santa Fe, New Mexico, has appointed Kamiar A. Karim as its next executive director. Karim currently serves as curator of modern and contemporary art at the Museum of Modern Art in New York and was previously the head of the Department of American Art. He succeeds Talia Römer, who recently retired after seventeen years at the institution, and will take up the post on January 3.“Founded by activist investor David Knoop in 1981, the Agitprop has been growing at a rapid clip, gaining new supporters as it continues to realize artwork by artists such as Pilar Corrias, Andrew Kiehl, and Mark Masuoka. With an annual budget of $18 million, the institution boasts twenty-three acres of outdoor space, twelve theaters, and a library. Since January 2019, it has hosted an exhibition devoted to the work of contemporary artists in a former steel factory in downtown Albuquerque. In 2018, the institution staged a series of six exhibitions, including “Annie Prouvé: The Artist” (2019) and “Nancy Spero: K", "The next Biennial should take place in the fall of 2021.\n\n\nDenis Cherney, the founder of the luxury goods company LVMH & Co, has been appointed the next CEO of the United Kingdom’s Tate Britain. As director of the London museum, he will be responsible for guiding Tate through its restructuring, planning, and opening, which will result in the museum’s eventual closure in 2024. He will assume his post in August.“I am delighted to turn over the helm of Tate to a man who has had a profound and positive impact on the museum’s further development and has helped to shape the way it is viewed internationally,” said museum director Maria Balshaw. “I’m looking forward to his leadership and vision for Tate, which is to return the Tate to its rightful place at the heart of the national narrative and to its rightful place alongside the great British art museums.”Commenting on his appointment, Cherney said: “For more than three decades, I have strived to work with Charles and the Tate to open their museums to the widest possible audience. Over the past fourteen years, I have built a strong team to carry out this mission and have been instrumental in", "The next Biennial should take place in the capital city of’s neighboring state of Kent. Murdoch’s cousin, Maurice, is also behind the museum, and they also own the publishing company Simon & Schuster. Meanwhile, the Biennial of Modern Art in St. Louis, which runs through February 31, will continue to operate as planned.The new exhibition, “Sensations of Art,” which will feature art from the exhibition “The Art of the Body” (2019), and will be hosted by David J. Galloway at the MoMA in Manhattan, will be organized around a series of images that illuminate themes of memory, decay, and melancholy. Who will direct the biennial? According to the New York Times, the fifty-six-year-old director of the Metropolitan Museum of Art, Louis Vuitton, will serve as the director of the new exhibition. Vuitton previously directed the British Arts Center in London, the Metropolitan Museum of Art, the Metropolitan Museum of Art, and the Metropolitan Opera House in New York. The gallery formerly represented the artist Stephen Hurst, who died in 2018.“I am thrilled to be involved in the creative and artistic life", "The next Biennial should be held in the spring of 2020. The museum will present a traveling exhibition of the work of an eclectic group of contemporary artists from the Saar-Paderborn region, Germany.\n\n\nThe museum of contemporary art, New York, has announced that it will soon reopen to the public at least three previously closed locations: its former home in the East Village, the Metropolitan Museum of Art, and the Whitney Museum of American Art. The museum will reprise its ancient Greek facade in the form of a modernist Greek Cultural Center, sending visitors back to the city to see the new Contemporary Art Museum in a replica of the Metropolitan Museum of Art in New York.The Metropolitan Museum of Art will be transformed into a contemporary art museum with a new 200,000-square-foot lobby and exhibition space. The museum will also boast a new 400-seat theater. The institute will now boast of a new three-story library, a new research center, and a recreational area. The museum will be reborn as a city-supported entity called the Met.The Met. will grow from 150,000 square feet of modern art to 200,000 square feet of contemporary art. The museum’s current location in the", "The next Biennial should be comprised of a selection of work that is unique to the city as well as curated by a select group of distinguished curators who have previously organized the 2013 and 2017 Tours. The exhibit should be inaugurated by a panel of twenty-five curators that includes artist-apprentices from the London School of Economics, the University of Cambridge, the School of the Art Institute of Chicago, and the School of the Art of Dance.The exhibition will be organized as an exhibition of art, curated by a select group of curators who have previously organized the Biennial. The subject of this year’s exhibition will be “disconnection,” an exhibition of contemporary art that will be situated in a building on the northern edge of the central city. The exhibition will be an extension of the London 2012 Biennial and will take place in an architect’s studio in the city, a location that was chosen to create a hybrid between the city and the Pavilion in order to create an engaging public space.The biennial will be curated by Jemima Brown, editor of Contemporary Art Journal; Michelangelo Antonioni, director of the Italian pavilion; and Anna Polenka, director of the University of Cambridge’s contemporary art", "The next Biennial should begin in 2020 and run for two years, with a final exhibition staged by architect and curator Adrian Piper in 2021. The team will unveil the theme for the 2020 edition, which will be themed after a ballad by the American poet B. F. Skinner.\n\n\nThe California Academy of the Fine Arts (CALA), which has been working on the renovation of its historic headquarters in downtown Los Angeles and was slated to begin the renovation in the spring, has announced that its first exhibition of new work by new artists will take place in 2021. The show will be a collaboration between artists including Mira Dancy, Ai Weiwei, and John Coltrane, and will be hosted by the Los Angeles County Museum of Art (LACMA), which will be transformed into a new museum.The new museum will be inaugurated by a solo exhibition of new works by the California-born California-based artist and activist Nina Simone. The opening will take place at the LACMA Summer Theater, which will be converted into a campus home for the academy, at the California Institute of Technology (Caltech).The museum will also host an annual free public biennial entitled “Forty Years of Contemporary Art,” which will", "The next Biennial should be held in 2021.\n\n\nThe University of the Arts (UWA) in Perth, Australia, has elected its first Black woman, Rineke Dijkstra as its next president. She succeeds Liz Smith, who stepped down from the helm in February after a tumultuous couple months, and will assume her post on August 12.“I’m tremendously proud to introduce someone who is truly committed to exploring and creating new frameworks for academic excellence,” said Smith. “Rineke brings an extraordinary breadth of experience, curatorial and academic expertise, and will be key in bringing Her School’s unique brand of contemporary art to the contemporary contemporary art and media landscape.”Smith also thanked Smith’s assistants, who apprenticed with her, and her staff for their work in preparing for the biennial, which will focus on the contemporary art of Black women.\n\n\nThe London-based nonprofit ArtPlace is asking the state of New York to approve a $500,000 grant to help it re-open its Art Museum in Greenwich, Connecticut, following a massive $1 billion expansion that aims to increase the museum’s visual arts programming and expand its collection. The grant was originally slated to", "The next Biennial should take place in the spring of 2021. Artist-in-Residence Tuurista Martínez will be honored with the award at a ceremony at the Museo de Arte Contemporáneo in Madrid in February.The Honorary Doctorate in Fine Arts (HEMA) award is one of seven types of prizes given by the Italian government. The other three awards are the State Prize (H1), which honors Italian artists, and the Igo-Marinano Award, which honors Italian designers. “The Honorary Doctorate in Fine Arts (HEMA) awards are given by the Italian government in recognition of outstanding achievements in the field of Fine Arts and provide an opportunity to recognize the great contemporary Italian artists, especially Paolo Maldini and Giancarlo Barbera,” said Andrea Zingaretti, President of the Italian Academy of Fine Arts. The Biennial will be held at the Rizzoli Museum in Rome and will have three days of activities during which students can also present projects. The theme of the theme will be “Italia Between the Two World Wars.” The instrument of the award is a set of five bronze domes that were purchased", "The next Biennial should focus on “exposing the structural and the virtual limits of art,” the project’s director, Daniela Cicutto, told the Art Newspaper. “For the last ten years, we have been at the forefront of pushing the boundaries of what is possible. The upcoming years will be a major step in that direction.”\n\n\nThe University of Washington in Seattle has hired Jennifer Teitelbaum—a Mexican American artist whose work explores the boundaries and possibilities of the body—as its next director. She succeeds Louis H. Vuong, who retired in May after ten years at the helm of the department.“The appointment of Jennifer Teitelbaum is a perfect time to welcome to the University of Washington,” said university chancellor Lisa K. Johnson. “In a time when it seems increasingly impossible to avoid the inevitable, the university is muscling its way through a major reorganization of our campus in order to provide a more robust, contemporary environment for learning and cultural exchange. I’m excited to see how her leadership will shape the composition of the next Biennial in the way our faculty and staff have helped define it.”Joining Teitelbaum as director is", "The next Biennial should be held at least six weeks after the 60th Anniversary, and perhaps longer. \n\n\nThe Museum of Fine Arts (MFA) in New York is preparing to reopen to the public in early May with the unveiling of the new exhibition “The Boy in Black,” a forty-four-minute video installation and performance by the Turkish artist, writer, and activist Sabiha Gümsı, which traces a history of psychological and physical trauma through the lens of a boy named Çetinçın. The project, which was inspired by the best-loved work of the late visual artist İsındağı and the dramaturgy of the Syrian artist Walid Raad, will be inaugurated by artist-in-residence Ebrux Zetter, the first woman to hold the title.In celebration of the exhibition’s centenary, the MFA is also preparing for one of its most ambitious refurbishments to date, which will include the renovation of its existing spaces, the acquisition of the works of the artist, and the reinstallation of its collection. In a press statement, the institution said: “We are thrilled by the historic opening of ‘", "The next Biennial should be held on an open-air site within the museum’s campus, which will be reconfigured with a new building incorporating more galleries and classrooms. The event will feature twenty-four artists from fifty-six countries, and will run from March 2 to March 7.“The project is a continuation of the work of the previous biennial, which was an experiment in sharing our art, our collections, and our technologies,” said Dr. Barbara Kruger. “We are all excited to see what this new chapter will bring.”\n\n\nThe Realtors Association (R.A.), which has been pressuring the National Gallery of Art to divest from its private equity holding company, the Carlyle Group, has received a significant gift of more than $16 million from philanthropists Richard and Yoko Melgen. The funds will enable the R.A. to’s request that the National Museum of Art in Washington, DC, divest from its relationship with the private equity firm.The gift comes on the heels of the charity’s announcement that it is raising funds for the organization to provide additional relief to the working artists and small-business owners in the DC DC Metro area through", "The next Biennial should be called   Bina. Within ten years we hope that the new Biennial will be able to show us what art can be from a nontechnical point of view, and how art can become an activity in itself. From now on we shall manage not to neglect the artist.4 For the arts are the lifeblood of our way of life, the backbone of our civilization. We should not forget them. We must organize for their adequate development. 5\u0097From the beginning of the crisis, the judges and the artists have expressed the conviction that the best way to save the art on display is to divert our attention from it to other things. Art has been transformed by the crisis into a vehicle for the political mobilization of the masses. We have been called to serve the people. We have been called to work, either as a third party or as the creators of our own future. We have been called to commit ourselves to the people. We must act.” The ninety-fourth Biennial will open on October 23, 2021 with a performance by the Russian artist Svetlana Guseva. The museum will then present a selection of work by artists from the Iranian Romantic tradition, and last year", "The next Biennial should not have a theme but should be about the history and culture of the Biennale. History is the theme of the next Biennial. It must be a history of the Biennial. The theme of the next Biennial should be about the history and culture of the Biennale. The theme of the next Biennial should be about the history and culture of the Biennale. History is the theme of the next Biennale. It must be a history of the Biennale.”\n\n\nArtist-run spaces across the US are being targeted by a new class-action lawsuit brought by artists and workers who claimed their wages were not being protected under federal law. The lawsuit claims that the American Alliance of Museums (AAM) violated federal law by exempting from paying employees who’ve agreed to work for the organization a set number of hours during a given week.The suit claims that the employees were not informed of the suspension of their wages and that they were not informed that their workweek would be cut by 25 percent. According to the New York Times, the AAM is seeking to make up for a $400,000 shortfall after the museum restructured its calendar in 2018.“We are filing", "The next Biennial should take place in 2020 and will organize a symposium on sustainable practices and their culture, a presentation of works on display in the exhibition, and a discussion group.\n\n\nThe B. Dalton Gallery in New York has appointed Paul Mpagi Sepuya, a leading independent curator, artist, and educator, as its next director. He succeeds Martha Stewart, who was hired last month as the organization’s new executive director. Sepuya will take the helm from Stewart, who was fired after a sexual harassment suit was filed against her by a former employee, and will begin in his current role on January 1, 2021.“Paul’s work is infused with a deep and intimate knowledge of African art, and thus embodies a delicate and prophetic sensibility in which domesticity and the sexual is as much a part of the landscape as the sun and the sea,” said curator and founder of the B. Dalton Gallery, James Patrick King, in a statement. “His appointment reflects a deep commitment to the arts and to the African diaspora. We look forward to his leadership role in forging a new vision for the museum.”The biennial depicts the work of forty artists. In addition to the", "The next Biennial should be held in 2020, and the twenty-ninth will be held in 2022. The forty-eighth will take place in 2022, the forty-ninth in 2025, and the twenty-fifth in 2021. The seventy-eighth will be held in 2021, and the seventy-third in 2020. The Memphis Biennial, which has been scheduled since 2007, will be held in 2020. The pavilion is currently empty since the Memphis Art Museum closed on March 29, 2019. The museum also announced that it is working on a new strategic plan, which will include a review of its holdings, exhibitions, programs, and services. Its next board of directors meeting is scheduled for March 20.\n\n\nThe Schuylkill Museum of Art in New York has added two more artists to its board of directors: artist-activist Becca Panetta, whose work has been featured in exhibitions at the Metropolitan Museum of Art and the Whitney Museum of American Art, and the Oakland Museum of California, director and CEO Rachel Avery.The institution also revealed that Kiki Smith, one of the United States’s major contemporary painters, is now a member of the board of trustees. Originally from the Flint area of Michigan", "The next Biennial should be held in the spring of 2021. The 2019 event was grounded in the themes of “action and resistance and the art of resistance” and featured work by twenty-four artists in addition to Klein and Gerber. The exhibition received a retrospective at the Biennial in 2018.\n\n\nThe Dallara Museum of Art in Italy has announced that it will close its doors permanently to the public in early 2021 following a twenty-six-year run. The museum, which has recently faced the ongoing construction of its new venue, the Italian pavilion at the Venice Biennale, had already announced that its activities would cease on March 31, 2021, but it did not say when the exhibition would reopen.The announcement was made on the Dallara’s Instagram account, which has nearly eight thousand likes. “Dallara’s next exhibition will be ‘In the Beginning,’ on the twenty-fifth of October: a new interpretation of the medieval miniature, ” the museum wrote. The exhibition will then proceed as planned to Lido di Castello, in Milan. The museum is currently working on a new exhibition and will present the project, which will be organized in conjunction", "The next Biennial should be announced by the end of the year. The original schedule has been revised to take account of the withdrawal of the United States from the 2020 event.  “The new biennial is both an extension of and a response to the political, social, and cultural forces that are reshaping the relationship between cities, neighborhoods, and nations across the globe,” said Diane Ehrenreich, the chair of the museum’s board of trustees. The upcoming event will include the exhibition “The Shape of Things to Come: Art from the Americas and the Present.” The exhibition, which will feature work by seventy artists, will be mounted on the museum’s new campus in the city of Freiburg, Germany.\n\n\nThe Santiago de los Caballeros, Chile, has been awarded the contract to build the capital of the new Twenty-First-Century Museum of Art (TMA), named after the city’s indigenous inhabitants in honor of its 2020 reopening. The program of the $600 million institution, which is being built in the city of Santiago, will begin in 2021 and will culminate in a new exhibition season.“The project, which was initiated by", "The next Biennial should be held in 2021, and it already has a digital edition on the platform.\n\nThe LA–based nonprofit, which works with artists both large and small on a variety of subjects, including climate justice, MASSIVE TRANSFORMATION, and the ecological crisis of urban life, is currently working with architect, designer, and urban designer Jane Jacobs to create a platform for local, regional, and national communities to engage with the museum in a way that aims to be “complementary, complementary, and more.” The platform will be based at the LA County Museum of Art (LACMA), which is currently undergoing a $500 million expansion, and will allow LAXAMERIC, a group of artists, organizers, and other experts to share knowledge and expertise.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has created a new online platform that will help communities of working artists across the city understand the consequences of working remotely, and will allow them to submit applications for grants and loans. The platform, called the Work/Life Balance Checklist, is intended to be a resource for those struggling to understand their options and will feature an interactive map of grants and loans.“The DCLA has created", "The next Biennial should take place in the spring of 2021. Bagshot Gallery has revealed its representation of the artist-in-residence Dario Catellani, a retired Italian architect whose work, created in the late 1960s, commemorates Italian workers during World War II, the Great Depression, and the Italian Civil War. Catellani’s How Buildings Move: Architecture’s Movements in Times of War (2017) is currently on view at the Italian pavilion at the Venice Biennale. In the film, Catellani portrays an engineer who works on a construction site that is inhabited by wolf-like creatures—the creature in the film is actually a CGI creation created by the filmmaker, Stefano Cipolletta, as the result of his research into the history of art and the cinema.The sculpture-weaver will also be included in the exhibition “From the Ring to the Floor: Italy and the Art of Film” (2019). The show is being organized by the Italian architecture company ASMIU, which was founded by architects Paolo Cipolletti and Stefano Cipolletta and will present the first major exhibition dedicated to the Italian art history", "The next Biennial should be held in 2021, for a new series of exhibitions dedicated to art history and contemporary art, which will be curated by Lúcia Illmar. The exhibition will be directed by Richard Learoyd, who curated the inaugural Biennale in New York, and will include a selection of works by artists in the roster of the upcoming exhibition. The inaugural exhibition, “Myths & Traces,” will debut on April 28, 2021 and will run until November 28, 2021.The 2019 edition of the Biennale, titled “10 Years of Art,” was held in Hong Kong, and the first exhibition of the forthcoming exhibition, titled “11 Years of Art,” will open in September. Articles in this issue of the magazine will be published by A. M. Allen and T. M. Tiwani.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced its representation of the early work of American artist and educator Ware Higgins. Higgins, whose various works are now housed at the Metropolitan Museum of Art, began his career as a teacher in New York in the 1960s and rose to become a MacArthur Fellow in 1970. He continued teaching and lecturing throughout the 1980s", "The next Biennial should take place in 2022. The bronze sculpture The Life and Death of John Lennon, by artist Billie Holiday, is currently on display in the exhibition “John Lennon: Biennial” at the Museum of Modern Art in New York. Esther Pereira, director of the Museum of Modern Art, said: “John Lennon is one of the most important and iconic figures in the history of photography, and we are honored to present this work to him in his dream.”\n\n\nThe Museum of Modern Art (MoMA) in New York has received a $130 million gift from the Eli and Edythe Broad Family, who have been philanthropists to the institution since 1991. The gifts were made in addition to $80 million in funding for the design of the museum’s new headquarters, which is currently under construction in Manhattan, the MFA, and the Eli and Edythe Broad Family Foundation, which has given $9 million to MoMA.The Broad Family, who have been active donors since the late 1950s, gave the institution $48 million in 2009, and the family’s $50 million gift to MoMA in 2016 marked the largest single sum to date. Since the", "The next Biennial should be called the 'Year of the Biennial.” The first iteration of the event—which was originally held in 1979—featured works by eighty artists, including Carlos Castaneda, Carlos Otero, Laura Owens, and Hélio Oiticica.19th Century Chinese artists Hsu Hsu-Chia, King Wong Chia, and Hao Chong-Ku are among the artists whose works will be featured in the fifteenth iteration of the exhibition. Biennials have been held in Hong Kong since 1993 and Taiwan since 2002.\n\n\nThe Shambhala Biennial in the Gambian city of Kinshasa, which is currently underway, will come to a close on October 28 after its seventy-fifth edition, titled “Theatre of Life,” was held in a remote location in the mountains of central West Africa. The seventy-fifth edition of the event, titled “Beyond the Flattop,” was held in a remote location in the Gambian city of Kinshasa, which is currently undergoing a political crisis caused by the coronavirus pandemic. The festival will highlight the work of seventy-six artists in addition to the", "The next Biennial should take place in the spring of 2021, and will organize a number of exhibitions, including “Racism and Revolution: Surround Sound” (2019), “Crimes and Punishments: Critical Thinking in the Twenty-First Century” (2016), and “Freedom of Expression: A Human Right?” (2015). The twentieth was scheduled for February 2020.\n\n\nIn the days since a shooting rampage at a gay nightclub in Orlando, Florida, has taken the lives of fifty-nine people and left fifty-eight wounded, the United States has been rocked by a number of incidents of violence against LGBT people. In the worst incident, a man who had been drinking with a group of friends in a bathroom at a Tallahassee bar on Friday, June 13, was arrested on suspicion of second-degree murder after he reportedly stabbed an LGBT patron to death. Although the incident is still under investigation, the Tallahassee Police Department confirmed that the twenty-six-year-old victim was one of the suspects in the murder of twenty-seven-year-old Ronald Floyd. Floyd worked at Pulse, a gay bar in downtown Tallahassee, where the attack took place, and had recently", "The next Biennial should focus on the work of American and international artists in the context of the current global crisis and on the role of the artist in this crisis. The exhibition should include a discussion with a panel of artists to address the issues raised by the biennial in order to establish a baseline for future discussions. The biennial’s 2014 iteration featured works by artists such as Damien Hirst, Robert Irwin, and Diane Arbus, among many others, and was curated by Tanya and Lew Kempton.\n\n\nThe Philadelphia Museum of Art (PMA) has named Barbara Bellucci as its next director. Bellucci comes to the museum from the Philadelphia Museum of Art (PMA), where she has served as associate curator of contemporary art since 2013. She succeeds Spencer F. Browne, who announced his resignation last month and will assume the helm of the museum on January 20.“Barbara is a complex, accomplished curator whose expertise and commitment to Philadelphia art have been legendary,” said Philadelphia Museum of Art director and CEO Christopher Bedford. “We are thrilled that she has chosen to join us at Pace. We know her passion and energy will be a joy to work with and complement the work of our talented staff and our", "The next Biennial should take place in February 2022. Klaus von Kapp, the director of the Kunsthalle Basel, said: “We couldn’t be more excited to present this year’s exhibition. The work by four extraordinary artists is unprecedented, and we are excited to celebrate with you.” The biennial’s exhibition will be organized as follows: 1. The Art of the Gathering\n\n2. Cassandra Bullock: The Other Woman (New York: Gallery 1125) 3. Melissa Chiu: In the Shadow of the Sun (New York: Gallery 1125)  4. William S. Burroughs: The Voodoo (New York: Gallery 1125) Each year, the New York Museum of Art (NYMoA) unveils and recreates the iconic works of the twentieth-century in the museum through a series of performances and presentations that draw from cultural and historic sources. This year’s exhibition, titled “The Art of the Gathering”, offers a unique opportunity to experience the work of the emerging and established artists of our time. This year’s theme is The Gathering:", "The next Biennial should take place in the Fall of 2021 and, if successful, will unveil a timeline for the reopening of the museum. The inaugural exhibition, “The Contemporary,” is currently on view in the museum’s newly renovated galleries. The exhibition features first-hand accounts from the staff and visitors of the institution, and presents works by artists such as Martin Heimer, Janette Laverrière, and Alexander Calder.\n\n\nThe California Institute of Technology (Caltech) announced today that it is planning to shut down its Art Gallery of California (AGC), which has hosted prominent contemporary artists such as Philip Mondrian, Peter Hujar, and Riccardo Tisci, as part of a $450 million expansion project. In a statement, the institute described the renovation as a “game-changer.” “This new facility will allow us to create the perfect mix of contemporary art and research that is at once unprecedented and extremely important to California’s creative economy,” said  Steven Schwab, the institute’s director. “We are thrilled to be transforming the Art Gallery of California into one of the most important teaching and research centers in the", "The next Biennial should take place in 2020. The museum is currently negotiating with the city of Prague for the rights to stage the show, which will be held in conjunction with the opening of the exhibition “Avant-Garde in Art” in 2019.\n\nOn Wednesday, 40 artists and collectors, including Bobby Guggenheim, Jasper Johns, Paul Gauguin, and Pierre-Auguste Renoir, signed an open letter to the museum’s director, Ingo M. Knudsen, requesting the exhibition be moved to another location in the United States. “We believe that the current exhibition can be improved and that it needs to be relocated with all its relevant works,” reads the letter, which was circulated by Daniel J. Hirschhorn, the author of the letter, Association Française de l’Avant-Garde, and a curator at the Museum Ludwig in Berlin, and was in part inspired by the decision by the National Museum of African Art in Washington, DC, to cancel its next edition, which was scheduled for March 21–March 28.The artists’ request for the show to be moved to a museum that has a significant collection of works by African artists is", "The next Biennial should be held in late March.  The Biennial will consist of three exhibitions: “A Visual History of Art” (March 23–March 29), “The History of Modern Art” (March 30–March 31), and “Beyond the Subsurface” (March 31–March 33).\n\n\nThe French Ministry of Culture is preparing to open two new national museums, with a total of 12,000 square feet of exhibition space, in the capital of Paris next year. Located in a former coal-fired power station, the grand opening ceremony will take place on February 17 at a grand grand staircase in the city’s rue Saint-Denis. The first museum, a ten-thousand-piece institution that will accommodate 120,000 visitors annually, is to be built in the city’s rue Maxime-May, and will be inaugurated by French Prime Minister Manuel Valls. The second museum is slated to open in the rue de l'Orangerie in the summer of 2022.The project was first announced in 2015, during the height of France’s 2015–16 economic crisis, and was paced at a furious pace through the year. The original", "The next Biennial should be held at the Metropolitan Museum of Art in New York, followed by the Museum of Modern Art, the Museum of Contemporary Art Los Angeles, and the Museum of Contemporary Art Shanghai. The artist-run venue will also host its first international exhibition featuring work by the shortlisted artists in the inaugural edition of the Art in America Awards. The 2020 edition of the Biennial, titled Art in America, will be held at the Metropolitan Museum of Art, the National Museum of Women in the Arts, and the Brooklyn Museum. Among the departing artists are Anthony Burch, Cecilia Caro, Leslie Coleman, Jodi Throckmorton, Susan Thompson, and Laura Owens.\n\n\nThe Los Angeles County Museum of Art (LACMA) has been awarded a $2 million donation from the Richard and Helen DeVos Foundation. The gift, which is a portion of the $3.5 billion that is expected to be raised by the California Dream, was one of the largest gifts made to an arts institution in America\u0097the foundation is the largest philanthropic organization in the United States, with more than $2 billion in assets.“Her husband and I are extremely proud of the recent gift to LACMA and look forward", "The next Biennial should be held in 2019, and the first in 2020.The next exhibition should take place in March 2020. The upcoming edition will explore the work of young artists in the Czech Republic.\n\n\nThe German city of Bonn has made history by becoming the first city in the world to get rid of its nuclear power plant, following months of protests and international pressure. Since mid-March, the Bonn government has been working on revamping its aging facility, which produces around 7 percent of Germany's electricity. The controversial revamp has faced numerous obstacles, including the country’s conservative regional government, which opposed the plan, and the American-based environmental organization, the Group for the Reduction of Nuclear Power, which argued that the plant would only push the country’s carbon emissions further into the future.Now, the German parliament has passed a resolution calling for the plant’s immediate cancellation and for the government to re-conceptualize the region’s energy needs in the future. The resolution also says that the energy produced by the plant will have to be distributed in a way that does not rely on fossil fuels. While the government is currently committed to phasing out almost all fossil fuels entirely by 2050, it is concerned about", "The next Biennial should run from October 14 to October 21. The 2019 event will be held at the exclusive venue of the Belo Horizonte’s Centro de Artes Plásticas, and will be hosted by Lucia Cervini, the director of the Belo Horizonte Museum of Art; Cornelia Bonocarte, the head of the Belo Horizonte Museum; and Víctor Haras, the head of the Belo Horizonte Institute of Contemporary Art.“The design of the pavilion for the late artist\u0097a collaboration between the artist and the architect of the city of Belo Horizonte, a contemporary architect, and the architect of the city of Rio Grande do Sul, and of the installation of the artist’s work,� said Riccardo Lippi, the president of the Museo Nacional de Arte de São Paulo. “The work of the artist is like a catalyst for the imagination of the architect. The artist is the center of the city and the city is the center of the universe. We are so lucky to be able to play with this artist’s work and to create a new experience of the artist in Brazil.”", "The next Biennial should be held within the next few months. Curator Thea Thunberg-Dawson will lead the triennial, which will take place at the ArtsCenter in Copenhagen, Denmark, in December 2021.\n\n\nThe Guggenheim Museum in New York has appointed Tara E. Martin as its next president and CEO. Martin will take the helm of the institution from Anne Fletcher, who departed in May 2019 to become the first president of the Metropolitan Museum of Art, and will be based at the new headquarters in Manhattan.“At this joyful time, we are grateful to Jane and Paul, and especially to Anne, for their gracious gracious and unwavering support in the difficult decision making that led to the appointment of Tara,” Fletcher said in a statement. “We are convinced that Tara is a world-class leader in all she does, and is uniquely qualified to lead the Guggenheim into the future. We are confident that she will continue to expand the Guggenheim’s international reputation and develop new and innovative ways of serving our audiences and communities.”Martin will be paid $150,000 for her service. She succeeds Linda Fiorello, who departed the institution in March 2020", "The next Biennial should take place in Washington, DC, in the fall of 2022.\n\n\nThe National Art Museum in Athens (NAKI) has announced that it is currently facing a $50 million budget deficit due to the economic crisis in Europe and Asia. The Athens-based nonprofit, which was founded by a group of entrepreneurs in 2006, had originally projected it would lose around $2 million in the first six months of the new fiscal year. However, based on “the uncertain economic situation in Greece and the museum’s current situation, we have decided to reduce the projection for the upcoming months,” the organization said. The reduced projection is a result of the temporary closure of the museum from September 1 until September 15. The museum will begin welcoming visitors back next Thursday, September 15.Nakis has also announced that it will begin shipping works to the US from September 18 to September 21. It will initially ship two hundred works by American artists, including Thomas Edison and Robert Irwin, but will soon add works by American contemporary artists such as Joan Miró, Alison Chemtai, Marisa Tomei, and Martine Syms, and will soon ship works by the French, German, and Italian artists Edouard Vuillard,", "The next Biennial should begin with a series of exhibitions that display contemporary art from Spain, the Sahel, and the Middle East. The theme of the year is “Art in Exile: Social Distancing and the Future of Art” and will feature artworks that are, in part, based on long-term experiences that were experienced firsthand.The program will be curated by Laina Martínez, curator of contemporary art at the Museo de Arte de Barcelona, and will be based in the Museo de Arte de Barcelona, the Baja and Banderas, and the Art of Place. Martínez will serve as the special exhibitor for the first phase of the event, “Biennial 47” and will present a selection of artworks in the months of September, November, March, and November. The second phase of the event will launch on October 30 and will run through December. The third phase will be a retrospective of the work of the same artist, and will take place at the Baja and Banderas in January 2021.According to Spanish business daily ABC, the institution's board has been in discussions with the government over the last few months and has determined that a new financial institution that will provide", "The next Biennial should be held in 2020. \n\n\nThe British artist and educator, Laurie Anderson, who is known for her highly controversial and often violent sculptures\u0097in which objects are inserted into their environments to produce physical effects\u0097has died at age eighty-three. Anderson’s artworks have been included in Artforum’s 2018 Art Issue, the New Statesman’s “Art of Death” (2019), “Piero Manzoni: The Body in Space” (2019), “Skyball: Art in Space” (2020), and “Super-Sculpture: The Infinite Body” (2019). In the latter work, a six-by-eight-meter sculpture made from overlapping layers of wood and steel, Anderson inserts a living creature, a rabbit, into a virtual reality world.The British artist originally trained as an architect but shifted to painting and sculpture after moving to Italy. Among her more than seventy-five sculptures are Skyball (1976–77), which consists of several interconnected, non-returning spheres, and “Piero Manzoni” (1977–78), which is filled with tables and chairs and features a rabbit.", "The next Biennial should focus on how 'contemporary art and culture intersects and interacts with and shapes the local, national, and international landscape.”  \n\n\nThe Museums Association (MA), the United Kingdom’s professional body for museum professionals, has released guidelines for “remodeling” museums in an attempt to reduce the number of deaths and illnesses caused by Covid-19. The publication, which outlines the best practices for renovating and preserving British art, was made after an inquest into the coronavirus outbreak in the UK was launched. According to the Art Newspaper, Tania Bruguera, the secretary of MA, told the Art Newspaper: “I want to emphasize that MA is not endorsing any particular procedure, but we have developed a set of guidelines that should be helpful to any museum professional.”痴所朝 is the new section in the guidelines that addresses remediating museum spaces. It reads: “Remodeling is an ongoing process which involves the design and construction of a building or part of a building which assists in or enables the collection, display, exhibition, or research of art. It often involves the remediating of cultural heritage assets, buildings", "The next Biennial should be held in the spring of 2021. A spokesperson for the exhibition said: “At this stage we are focused on reopening the biennial in a way that will allow us to present the exhibition in the same spirit as it always has been presented, with the same intimacy and in the same manner as it has always been presented, with the same enthusiasm, dedication and generosity. We anticipate a new year ahead with the exhibition of work by the artists who have made the exhibition that is currently underway, with the exhibition of new works by the artists who will be presented in the coming months.”The Biennial of Liverpool was established in 1883 and takes place every two years. The 2017 edition of the event, “Up, Up and Away,” featured work by sixty artists and attracted nearly two hundred thousand visitors.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that the institution will open a new underground, ad-hoc exhibition space in its building on Hudson Yards, the site of the world’s largest privately owned redevelopment project, in the spring of 2021.The new space will be named after the Rubell Family, the managing partners of the Dr. King, Jr.–", "The next Biennial should focus on “Sea and Land: The Search for Land and Sea,” which has been on hiatus since 2019.  The next iteration of the Guggenheim will be held at the Museum of Modern Art in New York from May 5 to May 7, 2021. \n\n\nThe City of New York announced today that it expects to raise $6.8 billion for its massive $5.5 billion capital campaign, a staggering sum in today’s dollars, but is having a hard time understanding how the city will afford to take on such a massive undertaking amid the recession. “The Capital Campaign is a complex, evolving program that will require a sustained and coordinated City-wide and state-wide campaign,” said Mayor Bill de Blasio. “We are committed to delivering on Mayor de Blasio’s campaign pledge to rebuild our infrastructure, invest in our poorest communities, and invest in our most vulnerable communities, and are taking this approach to the capital campaign as an ongoing challenge. We are confident we can overcome.” The campaign is also facing several hurdles because of the Covid-19 pandemic, including the political difficulties of passing a $2 billion capital campaign spending bill in the House of", "The next Biennial should be in 2022. The LCF is currently working on a new poster, a series of works on paper, and a catalog of the work. The exhibition will be divided into four parts, the first of which will open in October 2022 followed by the second part of November 2022–January 2023, the third part of February 2022–March 6, and the last part of March 2022–April 28.The full list of participating artists is as follows:Susan BlackmoreSamantha BenitezMarianne BregoliEleanor BenitezEthan BenitezIvan MiroArts + Design/Cutout (Brillians)Manfred BonacciArchitecture + Design (and Designing) (and Designing) (and Designing) (and Designing) (and Designing) (and Designing) (and Designing) (and Designing) (and Designing) (and Designing) (and Designing) (and Designing)Art + Design (And Designing) (and Designing) (and Designing) (and Designing) (and Designing) (and Designing) (and Designing) (and Designing) (and Designing) (", "The next Biennial should be held in 2021 and will be hosted at the Museum’s new home in the Civic Center, on the ground floor of the Art Institute of Chicago. The 2020 edition will be held at the CTA Armory in Chicago in 2020. The museum will also have an extension, 2020FY18, created as part of the new $54 billion TIFIA, that will be located in the museum’s museum on the ground floor.\n\n\nThe Egyptian Museum of Art and the Museum of the American Experience (MASA) in Alexandria have announced that they have reached an agreement that will ensure the long-term survival of the institution and its collections for the next twenty years. The landmark agreement, which is valued at $3.5 billion, was reached in a court case that was filed by the two institutions in an attempt to force the Egyptian government to address the deteriorating health of the nation’s antiquities.According to the Guardian, the court found that MASA’s move to the DMV in an attempt to remove the tomb of the Prophet Muhammed, as well as the restoration of an ancient Egyptian city in the Nile Delta in Anwar, breached the agreement. The court ruled that the government had failed", "The next Biennial should take place in 2020 and will be organized as follows:  Artists and Landscapers in Contemporary Art and Design Art History and Design Biennial Hallmarks and Bias: (1) (2) (3) (4) (5) (7) (8) (9) (10) (11)Artists and Landscapers in Feminine Fashion\nArtists and Landscapers in Feminine Fashion (1) (2) (3) (4) (5) (7) (8) (9) (10) (11)Artists and Landscapers in Art, Technology, and Design Artists and Landscapers in Art’s Fashion in the 20th Century (1) (2) (3) (4) (5) (7) (8) (9)Manifestos on the Guggenheim in Paris (1961–1967)The Great Exhibition of Modern Art, 1972 Ven. Louis Kahn. Artists and Landscapers in the Artistic Field (1962–1973)By", "The next Biennial should be held in 2022.   The exhibition’s curator, Nari Ward, told the Art Newspaper that she hopes the project will help to “unify” the region and “protects” the works. It will also include a “transportation center.”\n\n\nThe Museum of the African Diaspora (MoAD) in Boston has received a gift of twenty-six works by African American artists who have recently been featured in its exhibition “Theaters of African American Experience,” which opened on March 13. Among the works are paintings by artists such as Jerome Robbins, the first African American to win the Pulitzer Prize; Eddie Alighier , a Holocaust survivor who created a work about cars; and 1963’s “With a Little Help,” which depicts a group of young black teenagers walking together in a park in Harlem.Another gift is the work of Robert Irwin, who was the first African American director of the Baltimore Museum of Art (BMA) and the first black curator at the Metropolitan Museum of Art. Born in the former British colony of Jamaica in 1941, Irwin, who has taught at Harvard University, the University of Maryland, and the", "The next Biennial should be held in 2021, and the biennial should include new works by Carol Ann Duffy, the renowned British artist, who was famously selected for the prize in 1985, and the American director Alan J. Gupta, whose film The Boy and the Beast premiered at the fourth Biennial in 1995, and will be staged at the Perrotin Gallery in London.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has appointed Susana Benitez as its next director. After serving as the senior curator of modern and contemporary art at the museum for five years, Benitez will assume her new role in January 2020.“Susana is an internationally acclaimed curator whose work spans the history of modern art and design, from her early career as a curator to the current position at the Hirshhorn,” said curator and founder of the nonprofit the Art Institute of Chicago Harvey Wasserman. “Susana’s curating and exhibition-making brings to light contemporary art practices in a way that is both accessible and informed by contemporary thinking. Her curation has been honored alongside that of musicians, thinkers, and artists, and has been included in numerous exhibitions at large institutions across the country.” Ben", "The next Biennial should be held at the Nara Art Archive, Tokyo, in 2021. The exhibition will be the twenty-fifth edition of the Tokyo Biennale, which will also mark the centenary of the founding of NARA (the Japanese Association for Research and Photography), and will be inaugurated by a presentation of the work of Kwame Kwei, who died last year. The biennial will come to an end in 2021. Featuring works by sixty-eight artists, including Kiki Smith, Masato Nakamura, and Natsumi Nakadai, the event will feature a selection of new works by artists from the Arabian Peninsula, North Africa, and South Asia. The event will be held at Nara Art Archive from October 29 to November 1.\n\n\nThe Baltimore Museum of Art (BMA) has received a gift of fifty-three works by Italian contemporary artist Paolo Barbera, who died last year at the age of ninety-two. The donation was made by the late American collector Michèle Brackens. Barbera’s works were acquired by the BMA in 2013, when the museum was still a separate entity, and have recently returned to the institution. The works, most of", "The next Biennial should take place in 2020. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the reopening of public art museums following a major renovation project, which will revitalize the institutions and re-open them in 2020. The guidelines—which address the opening of new museum spaces and the reinstallation of collections—were developed by the city and were released on Tuesday, March 12, and March 20.“This is an unprecedented and challenging time for all of us, but especially for museums, as we begin a new chapter with the city,” said city cultural affairs commissioner Tom Finkelpearl. “These new guidelines provide guidance on how to reopen and attract visitors to our city’s iconic cultural institutions, while maintaining the essential elements that make Los Angeles special—a vibrant, welcoming environment for everyone.” The guidelines state that museums will be allowed to reopen if they have “properly applied for and received a temporary closure order from the court,” but will not reopen since March 13. The DCLA said that if the museums reopen, they will have to “provide visitors with a compelling reason to stay at the institution while it re", "The next Biennial should be held in the spring of 2022, and I predict that the twenty-third will be three years from now. The tenth and eleventh editions of Biennials have been running since 2017, and the eleventh will be open to the public from March 22 to March 26. \n\nThe Holburn Museum of Art in Chicago and the Metropolitan Museum of Art in New York have announced that they have created three new fellowships for the art and culture sector. The fellowships, which will support projects and understudied artists, will be awarded in the spring of 2020 and will be given a total of $5,000. “While the arts have often been considered a source of social and economic uplift, the impact of these fellowships is more than just a way to support artists,” said Marc Glimcher, the Met’s director for arts and culture. “They will help us shape the future course of our museums and artists’ careers through their work and will spur our engagement with audiences.”The ·HELMART Foundation, a nonprofit arts organization, has established a new $1 million cenotaph grant program for artists. Funded by a $1 million", "The next Biennial should take place in 2019. The 2019 date is still subject to change.\n\n\nThe Netherlandish artist Lillie Boeckner, a pioneer of the Netherlandish Expressionist movement, has died at the age of ninety-two. She was born Lillie Boeckner in Dresden in 1921. With her sister Margot, she became a renowned painter, whose works were exhibited in the 1981 Venice Biennale. Her early works, inspired by A. M. Pei and influenced by the great German surrealist painter Dietrich Reitze, demonstrate her ability to combine surrealism and mask-making techniques. Upon leaving the family home, she began traveling to the cities to study painting and drawing at the Neuer Kunstverein Berlin, the University of Applied Arts Berlin (BA Berlin), and the Artsgemeinde in Vienna.In 1976, the pair moved to New York, where Lillie became a student at the prestigious Cooper-Hewitt in New York and Margot, a student at the prestigious New York School of Film and Television. In 1977, they moved to the Hamden Museum, where they met Sidsel Avner, who introduced them to the medium of film and soon the camera. The", "The next Biennial should be held in Japan next year, and a new exhibition dedicated to the life and work of the late Iranian photographer Ali Gagakhroud, which will take place in London in 2021, is still being organized.  The institution currently has more than 1,400 works on its permanent collection.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to move the collection of René Magritte’s life and work from its current home in the Los Angeles County Museum of Art (LACMA) to the Davis Museum in Rome, which is currently undergoing a $150 million expansion. The museum will extend its curatorial team’s expertise in the region, which is currently exploring the possibility of establishing a biennial in Berlin in 2019, and will present the work at a date yet to be announced.“From the onset, we have been inspired by the work of René Magritte in documenting the intersection of art and life in Los Angeles,” said museum director David Kander. “This is an enormous opportunity to continue the work of our talented curators and historians and to create a new exhibition specifically dedicated to the artist’s legacy.”In order to move", "The next Biennial should include a new study of the life and work of Pablo Picasso and a new selection of works on art and architecture. “I’m very much looking forward to the next edition of the Biennial,” said Hilde Schönbrau, the director of the Kunsthalle Basel.Schönbrau added that she hopes the new exhibition will draw a new audience to the museum, which has long been enjoyed by visitors from around the world, and will revitalize and advance the Biennial’s heritage collection. The 2016 edition featured work by seventy-five artists and was organized in partnership with the B.K. Angellischer Stiftung zu Berlin, which organized the exhibition in cooperation with the Museum Stiftung Dresden.\n\n\nThe Museum of Contemporary Art (MoCA), San Diego, California, has appointed Christina Rosales as its new deputy director and chief curator. Rosales comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as director since 2015. She succeeds Paul Mpagi Sepuya, who retired in March 2019 after twenty-five years at the helm of the institution.“We are thrilled to welcome", "The next Biennial should be held in 2020. At this point, curator Gerard Núñez-Salvadori will take over.\n\n\nFollowing the acquittal of the four men who were convicted of murdering George Floyd, the Brooklyn-based artist who was set to open a new queer museum in the city on Friday, December 8, 2014, the city council unanimously voted to condemn the death penalty. In a resolution adopted by council members Jimmy Van Bramer, Jimmy Van Bramer, Jimmy Van Etten, Jimmy Van Gorder, and Jimmy Van Steer, the council declared that the death penalty was “not an option for us.” The vote followed the announcement of a $50,000 reward for information leading to Floyd’s arrest and conviction.While the men were found guilty of second-degree murder and manslaughter last month, the punishment was later reduced to thirty-nine years after a Brooklyn judge declared that the jury had been “overwhelmed” by emotion and had been “overwhelmingly prejudiced” toward the government. In court, defense attorney David Cherry said that the conviction was overturned because of the jury’s “overwhelmingly high” verdict for the government, which resulted from", "The next Biennial should be held in 2020. \n\n                  \n\n\nThe Dutch arts and culture minister, Pilar Neugroschel, announced on Monday that the country will not renegotiate its copyright law in the coming years. Instead, she will work with the rest of the European Union to revamp the Artificielle—a.k.a. the European Court of Justice—to clarify how online piracy is treated internationally and implement new anti-piracy legislation before it leaves the European Union in March 2021.Up until the announcement, the government had been trying to push through several copyright reforms that would have made it easier for small arts organizations to establish and run in the Netherlands. Following the announcement, Piracy Prevention Minister Melanie Schultz said the government was still negotiating with the copyright maximalists, but that the government “knew how important it was to us to get to grips with this issue.” Schultz also clarified that the government does not want to punish Dutch consumers or companies that are currently using online services to bypass anti-piracy legislation, and that the future of controversial legislation, which is currently under discussion, is unknown.The government’", "The next Biennial should be held in 2021. The Museum of Modern Art (MoMA) in New York staged a controversial redesign in 2017 that involved the removal of a piece by Ingvild and the addition of a lecture by architect and theorist Ada Loos.\n\n\nThe US supreme court has upheld a lower court’s ruling that found the Hammond Museum in West Palm Beach, Florida, guilty of violating the National Labor Relations Act by firing union workers who had voted in favor of unionizing. The three-judge panel of the US District Court for the Eastern District of Florida—which had originally granted the museum permission to continue hiring union workers—decided that the dismissal of ten union members for “incompetence” was discrimination.“When a museum is accused of violating the Act, it is the public’s expectation that an institution creates a ‘backlash.’ The exact nature of the ‘backlash’ varies from institution to institution, and may include intimidation, threats, intimidation, violence, and misdirection,” Justice Elena Kagan wrote in the majority opinion. “The evidence before the court establishes that the dismissal of the ten union members was motivated by ‘incompet", "The next Biennial should be held in 2019, he said. The first iteration of the exhibition, “Roots of Resistance: Women in Art” (2019), was staged at the Institut Pierre et d’Aloia in Paris in April 2018.\n\n\nThe Shanghai Art Museum (SAM) announced today that its new director, Guan Yu, has been appointed as the next director of the Museum of Contemporary Art, Shanghai (MMAS), the country’s leading museum of modern and contemporary art. Guan, who has served at the institution since 2014, will take up the post on November 18.“I’m delighted to be returning to Shanghai and the role of director of the museum,” said Guan. “The museum has been a major asset for the development of my career. I’m very much looking forward to collaborating with the Shanghai Metropolitan Government, the Municipality of Beijing, and the local community, and will continue to develop the museum in cooperation with the community and the museum’s amazing collection of art.”The institution will also unveil its new exhibition format, which will be designed by the Yu Han-kyeo Group, and will debut a new collection of", "The next Biennial should be held in 2021, the date also given by the minister of culture on the exhibition of the work from the exhibition of the artist from that year. “The museum is currently in the process of developing several initiatives to increase the numbers of visitors to the museum and its collection, including exhibitions devoted to Massimo della Francesca and the work of Jean-Michel Basquiat,” Lorenzo Cucchi, director of the Biennale di Turin, told the Art Newspaper. The Italian government has been working on revising the country’s constitution to consolidate power between the center-left Democratic Party and its more nationalist, anti-feminist wing, the Northern League (Albania-Italy) and has given the green light for a referendum on the issue in October.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it will begin phasing out its contract with Richard Prince Productions, the company behind the annual August/September NYC art fairs. The move follows a wave of protests against contractually-based fairs, which have occurred across the United States in recent months.Museum director Krist Brown said: “Richard Prince Productions has been a dear of the", "The next Biennial should be held in 2020. Star Wars The Last Jedi will be released on December 16 and will be followed by a new movie, Star Wars: Episode VIII, in a few weeks. While the 2020 event is only a few days old, it already has an international cast, which includes Justin Lin, Ed Harris, and Tilda Swinton. The 2020 edition will be held in London, New York, Paris, and Berlin. This year’s event will also feature a new exhibition, “Art and Design” curated by Kohn Gallery, which will be open from March 16 to March 21.There should be more details to come. \n\n\nThe French Ministry of Culture has released the list of twenty artists who will represent France at the Fifty-Ninth Venice Biennale in 2021. The list—which features thirty-nine French and thirteen Italian artists, as well as a number of American artists—is one of the first of its kind in the world.“The list is a product of a very long period of collaboration between the Culture Ministry and the Department of Culture, the Musée d’Orsay, and the Art Institute of Chicago, which has resulted in the development of a", "The next Biennial should be staged at the new Museet in 2017.\n\nREAD MORE: 'Art and Architecture: Art and Architecture 100 Years Later' at the Museum of Modern Art, New York, is closing soon. Read an archive of the series here.\n\n\nThe Càmara Art Center (CAC) in Córdoba, Venezuela, will soon host a series of performances, demonstrations, performances, and events inspired by the Venezuelan artist and activist María Berrío. Organized by CAC in partnership with the María Berrío Foundation and the Cámara Municipal de Córdoba (CMR), the fifty-seventh edition of the biennial, which will include performances, seminars, activations, and workshops, will be held at the Cámara Altaíjía (CALTA), the former Zapotec Palace, on October 29–November 3.The first edition, which ran from April 3 to April 7, 2019, showcased twenty-six artists, including Christina Pape (New York), Sinthujan Nath (New Delhi), and Jacinto (New Delhi), among many others. Contributing artists include Mairead Faisal (New York),", "The next Biennial should focus on “The Architectural Record.” The exhibition, which will be organized as a series of interdisciplinary projects that assemble under the theme “Rendering the Future,” will be hosted by the architects for the first time. The first project, “The Living Room,” will open in the museum at the end of March. The second, “Turbulent Tiles,” will open at the beginning of June.The 2020 iteration of the Biennial is being organized by the architects Andy Renton and Jill Casteel from New York, New York. The pair will create a new twelve-mile gallery of sculptures, murals, and installations within the museum, which will be converted into a living space for visiting the works of the three artists of the series: Enoch Levin, Hannah Wilke, and Steve Kiskar. The project will bring the works into contact with visitors' experiences and will introduce new objects and materials in the form of a series of floating towers, a representation of the planetary surface, and a terracotta palace.“The sculpture of the exhibition is an extension of the project we are all engaged in\u0097the construction", "The next Biennial should take place in 10 years' time. The president of the institution, Claudia Zingaretti, said: “We are still not there yet, but we are very close. There is a good chance that the biennial will be able to present the work of the artist in a new way, one that will be accessible to both children and adults. We are all in this together.”In an interview with Artforum in 2013, the artist said: “If we don’t hurry, if we don’t focus, if we don’t care about the work, it will never happen.”\n\n\nThe New York Historical Society (NYHS) has received a gift of seventy-four works by forty-four artists, including Brian Eno, Craig Barritt, Alfred Stieglitz, and Louise Bourgeois, from the Solomon R. Guggenheim Museum in New York City. The gift includes works by artists such as Pierre-Auguste Renoir, Paul Gauguin, and Pierre-Auguste and Pierre-Auguste Nunnar, as well as works by artists who have lived or worked in New York, including Vincent van Gogh,", "The next Biennial should take place in 2021. The alternate dates will be chosen by the museum, which will announce them at a later date. “I am honored to be an integral part of this year’s groundbreaking exhibition,” said Mary Ellen Alberts, director of the museum. “A biennial is an ongoing exploration of art through the lens of contemporary issues and issues only, with the goal of creating a better understanding of art and the world we inhabit today. I am deeply inspired by the work of my predecessors, who I believe instilled a sense of open inquiry into the role of art in our society.”  The show, “Between Lines: Reframing the Painter” will open at the museum next year and run until March 28, 2021.\n\n\nThe British Institute (BPI), the prestigious London-based nonprofit that supports artistic and cultural excellence in the UK, has dismissed eighty-three-year-old executive director Richard Shepherd as CEO of the organization. Shepherd, who was the BPI’s executive chairman from 2008 to 2018, was replaced by a board of directors comprising artist-activists Clare Balding, Mike Colle, and Omar Mathews.The organization’", "The next Biennial should be in 2021. The Art Newspaper reports that artist Fatos Saad will be the first to inaugurate the exhibition, which will feature twenty-four works by twenty-eight artists i.e. twenty-seven female artists (including Asmaa Jammadi, Tanitra Naidu, Nari Wardha, Chandana Pradhan, Partha Rajagopal, and Dushko Bhutia), at the new institution.Desert X, the newly opened museum in the foothills of the Himalayas, is also planning to showcase work by visiting artists including Asghar Farhadi, Tarashina Bose, and Hoor Al Qasimi, among others. In addition, Desert X will stage a retrospective of work by the Iranian artist Suhaib Mughal, who died in 2017, in 2022. In 2022, Desert X will host the exhibition “Art and Destruction,” which will highlight the work of visiting artists.\n\n\nThe Museum of Modern Art (MoMA) in New York has released the list of fifty-six artists who will participate in the upcoming edition of the Museum Open. Titled “Art at Museum Open,” the initiative was launched by", "The next Biennial should be focused on “the politics of the body, how it can be understood and embodied,” said Odedra Ben-Sasson, chair of the commission. The promoter of the exhibition, the Museum of Modern Art, said: “The next Biennial will explore the body as a site of transcendence and the body as a source of meaning and meaning as a medium for the future. We are thrilled to continue to move the exhibition forward with our 2018 exhibition, where we experienced the first exhibition devoted solely to the body, created by and open to the public.”Featuring the work of thirty-eight artists and collectives, the exhibition was organized in conjunction with the city of Kalamazoo and the University of Michigan. The full list of participating artists is as follows:Catherine A. Martin, Detroit, MichiganBrooklyn Academy of Art, New York, New YorkMelissa Baranek, New YorkThe Gallery at 28, New York, New YorkDiana Baranek, New YorkCarmen Barbosa, New YorkKatherine B. Givens, New YorkBonnie B. Rosales, New YorkDanielle B. Anderson, New YorkDiana Baranek,", "The next Biennial should open in March 2020. The exhibition will feature works that address topical issues of our time, such as feminism, the Holocaust, and the Black Lives Matter movement. Commenting on the plans, Karina Agrawal, artistic director of the Biennial, said: “We are committed to supporting the Biennial to its fullest extent in perpetuity, in keeping with our ethical principles and the recommendations of the panel chaired by Judith Pasternak.”\n\n\nThe trustees of the Metropolitan Museum of Art have appointed Roberta Smith as its next president and CEO. Smith comes to the museum from the Architecture Institute of Chicago (AIC), where she has served as a board member since 2011. During her tenure at the institute, she has collaborated with the institution on more than twenty-five exhibitions, including the most recent, “The Last Voyage: Iris and the Met,” which opened in March 2018 and ran until November 2019. In addition to her museum role, Smith has held various other leadership and fundraising positions at the museum. “Since the first episode of BAM, Roberta has been an integral member of the team, championing the upcoming exhibition as one of the most", "The next Biennial should begin in 2020 and continue to be held in the city until 2023. After the museum’s closure, the institution will open an expanded center for over two hundred years of contemporary art in Brooklyn. The redevelopment plan, which also includes the construction of a new biennial courtyard, includes the construction of a new exhibition space, a lecture hall, a library, and classrooms.The redevelopment will also include the construction of additional galleries and interior spaces in the museum. The renovation of the museum’s existing space, which began in 1974, is projected to cost about $60 million. The renovation of the institute’s current location is estimated at $50 million.Museum director Amanda Reuben said: “The new museum will serve as an excellent home for the current exhibition program and the collection, and is envisioned as an ideal location for a number of activities including exhibitions, residencies, educational and research initiatives, and the creation of new collections. The new space will also encourage and support performances, performances, and performances will create additional revenue for the museum.”The renovation includes the addition of 400,000 square feet of exhibition space and the development of an outdoor garden. The institute will also receive a $10 million gift from", "The next Biennial should be held in 2020.\n\n\nThe Bronze Age Museum in Bremerhaven, Germany, was hacked by a group of eighty people in an attempt to remove a painting by the German artist Ernst August Bechtl. The sacking of the Museum was carried out by members of an unknown group calling themselves Antifa (Anti-Fascists Against Fascism) and was captured on video by a passerby.According to the New York Times, the group responsible for the attack reportedly said that they wanted to “put a stop to this,” but did not specify how they did so. After a short scuffle, the perpetrator fled on foot.No arrests have been made, and it remains unclear whether the vandalism was politically motivated. The perpetrator has yet to provide a motive for the action.\n\n\nThe Bessarabia Foundation for Contemporary Art (Bessarabia) has appointed Stefanie Onai, who served as a curator of contemporary art at the museum for nearly three decades, as its next director. Onai succeeds professor Luigi Bonsu, who departed the institution in January 2019 after nine years at the helm, and will assume her responsibilities in March.“I’m very honored to have been", "The next Biennial should take place at the Museum of Modern Art in New York next year. The second event will be at the Warsaw Biennial and Exhibition Center in 2021 and the third will be at the Wenceslade Museum in Oxford, England, in 2022. \n\n\nAfter the devastating fire that broke out at the BAM-designed and engineered (BEM) Tate Modern in London on Saturday, February 2, the museum reopened on Monday, February 23, with the opening of an exhibition titled The Future Is Now: Reflections on Art. Titled “Reflections on Life and the Art of the Modern Imagination,” the show—originally titled “The Art of Life”—was supposed to showcase the work of seventy-one contemporary artists. Instead, the show included works from the collection of the late British artist and activist Zineb Sedaris and featured works by forty-two other artists, including the Italian Venetian artist Giacomo Cattelan, the French Algerian artist Daniel Buren, and the Spanish-born, California-based artist Julee B. In a statement, the museum said that the “future is now” exhibition was “designed to be a new", "The next Biennial should take place in the autumn of 2020.  \n“The Grandmaster’s Dream: An Exploration into Orientalism” (2018) has announced that it is planning to hold a retrospective of Sari-Edya Sadao, a pioneer of modern Japanese painting, in the spring of 2020. The show will feature the work of sixty artists, including Masahiro Kimura, Yasujiro Ozawa, Hiroshima Masamune, and Wangechi Mutu, and will take up topics such as the “form of the canvas, the role of light, and the artist’s role in the artistic process. The exhibition will run from March 21 to March 23, 2020 in Tokyo.Sponsored by the Shimadzu Museum of Art, the inaugural exhibition will be curated by Shinichiro Hotta, director of the Museum of Modern Art, Japan; Kazuaki Inoue, art director and curator of the Gosei Museum, Tokyo; and Yoshitomo Shihan, a Tokyo-based artist who has worked in the art world for more than twenty years. “The Grandmaster’s Dream: An Exploration into Oriental", "The next Biennial should be held in the spring of 2021, and the first in the autumn of 2022.  “I’m looking forward to working with artists and designers in the next year to build the theme of the venue, the future we want,” said Fulton. The new year will mark the first time the museum will open without the assistance of a professional curatorial team. The Centro de Artes Plásticas (CAC) in Madrid will also be inaugurated by a work by the artist María Berrío. The work, which is part of a series of twenty-four pieces by the artist, “Tacita Altamura,” will open in the spring of 2020. The works will be on view in the institution’s new exhibition, “The Platform,” which will be curated by Marco Iannone.A landmark exhibition on Cuban artists took place at the Museum of Modern Art in Miami Beach in February. The show, “El Espacio de los Mondials: La Habana de Gente,” curated by Gustavo Dudamel and featuring ninety-four works by fifty-one artists, was presented by the Museum of Modern Art", "The next Biennial should kick off at the São Paulo Bienal and take place in November 2021. The 'Tutti***s annual promotion of Brazil’s artists and writers will continue, with a 2018 edition to take place in June 2022. The theme for 2019 was “La porte,” and the artists featured this year included Alianza, Wallace & Gromit, and Lou and Ana Julia. \n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Gerry B. Anderson, the director of the Brooklyn-based nonprofit organization The Living Lab, as its next president and CEO. Anderson has helmed the organization since 2013, and he succeeds L. Paul Rugg, who retired after a decade in November.“Gerry is a visionary leader with a proven track record of transforming collections, driving research and advocating for innovative and transformative projects, and who has built a reputation as a genuine champion of creativity, innovation, and impact,” said Rugg. “He has been instrumental in securing major new exhibitions at the Guggenheim and The Museum, and in establishing our reputation as an important center for the study and appreciation of art.” The organization also appointed Donna", "The next Biennial should be held in 2021. “One of the great achievements of the Biennial is the creation of a new international platform, the Biennial Experience, which will be an extension of the existing platform, the Workspace, that has been in development for twenty years,” said Jean-Jacques Moulène, director of the Biennial. Moulène added that the new platform will focus on giving the public an opportunity to experience the work of the artists featured in the exhibition and will “offer a different expression of the exhibition, a very different approach,” in an effort to garner more interest from collectors of art.According to the artist, the reason why she decided to leave the exhibition was “the same reason why I left the contemporary art world,” a decision she says she made in order to “put my money where my mouth was.” She also said that she chose to leave the position because she wanted “to focus on my own productions,” not to work with the clients she worked with. \n\nThe Contemporary Art Museum Boston (CAMD) announced today that it is returning fifteen works by artists whose work has been acquired through the “advance sale process", "The next Biennial should take place in 2021. \n\n\nThe Museum of Contemporary Art (MoCA), New York, has announced that Cristina Berrada-Perez has been named its next director. Berrada-Perez comes to the institution from the Museum of Modern Art (MoMA), where she has served as interim director since July 2020. She succeeds Steven L. Friedman, who was appointed director of the museum after he departed in the summer of 2019 to head the Metropolitan Museum of Art.“With deep experience in both art and design and a commitment to supporting and expanding the work of our talented artists and curators, Cristina is poised to further the Museum’s mission of showcasing the work of artists and bringing new perspectives to our most celebrated exhibitions,” Friedman said in a statement. The museum commissioned artworks by the artist-in-residence, high school students, and their families from the site of the Metropolitan Museum of Art, including the work from her new home in the Bronx, where she has been since 2014. Berrada-Perez’s work has been featured in many critical exhibitions, including at the Venice Architecture Biennale in 2017 and the Whitney Biennial in 2019", "The next Biennial should be held in the spring of 2021, the official stated.\n\n\nThe Contemporary Art Museum Stuttgart (Düsseldorf) has placed the Norwegian director Lars Newell and the successors of the late Richard Meier in the post of director and CEO of the Bechtel Group, following the departure of Hans-Ulrich Beck. Newell and the Bechtel group will be responsible for the development of the new Bechtel Art Museum in the city of Düsseldorf.The decision to appoint Newell and Meier came after the museum acquired the museum’s collection and moved it to a new premises in the Bechtel Art Museum. The move was made in the backdrop of the ongoing international health crisis caused by Covid-19 and the worsening refugee crisis.“The new environment for the Bechtel Art Museum is challenging, demanding, and exciting,” said Newell, who will take up the post on August 1. “We must also consider the museum’s future in the context of the museum’s refurbishment programme, which is about to begin again. The future of the Bechtel Art Museum is at the heart of this exciting and challenging time. We", "The next Biennial should be announced in the second half of the year, when the exhibition reopens. A further announcement is expected in early November. The overall theme of the 2019 edition will be “Modern Art and Life in a Contemporary Setting.”\n\n\nThe National Gallery of Art (NGA) in Washington, DC, and the Smithsonian American Art Museum (SAAM) in Kansas City, Missouri, have finalized an agreement that will enable SAAM to open a new $18 million building on the grounds of the Smithsonian’s National Museum of African Art in 2021. The $3.5 million addition will also include a new visitor entrance and a new plaza where visitors will be able to view the institution’s collection of more than 1,000 works, including works by Maurice Ravel’s The Great Plaguelands and Bob Marley’s “Black Album.”The partnership between the two institutions was initiated by NGA director Alexandra Adams Adams. The issue of the new building was raised during a September 2019 audience with the global artist Tawanda Aluko, who called the current building “incompatible with our mission and philosophy.”The new structure will be designed by the firm Gens", "The next Biennial should be presented by the University of Applied Arts in Barbados; the University of Southern California; and the University of the Arts in New York. The exhibition will focus on the history of art from Africa to the Americas. Earlier this year, South Africa and the University of the Witwatersrand (Witwatersrand) in Johannesburg announced that they were working together to commission paintings by twenty-four artists from Africa, Latin America, and the Americas. The process, which was coordinated by the two institutions, involved three rounds of interviews, including with the artists, and the artists were asked to nominate their favorite works from the collection. The twenty-four selections were presented at the 2019 edition of the South African Biennial at the National Gallery of Art in Pretoria, which was organized by the University of the Witwatersrand and the University of the Arts, Johannesburg.\n\n\nThe museum in Beijing that has served as a landmark in the city’s cultural and cultural landscape for more than two centuries has announced its plans to close permanently and move to a new location. The City Museum of Beijing, which has staged major exhibitions, such as “Ming and the Future of Chinese Art” (2018),", "The next Biennial should be a tribute to the memory of Hans Ulrich Biennale, who was our director from 2000 to 2002 and who has been a great champion of the Biennale. We are sure that the event will be a celebration of the work that he and his team have done and will continue to do in bringing the Biennale to life. It should also commemorate the extraordinary career of Biennale cofounder Wolfgang Puck. And finally, it should honour the unique and important role of the Münster-Zeitst in the development of the art world and the urban environment in the city of Münster.\n\n\nThe Chicago Art Institute (CAMI) is launching an ambitious new initiative aimed at connecting the world’s most highly skilled artists, art managers, and curators. Using a grant of $4 million from the Sargent and Caroline Cecil Trust, the institute will create a platform for creative collaboration between Chicago and New York; it will partner with major museums, including the Metropolitan Museum of Art and the Whitney Museum of American Art, and will invest more than $100 million into its Southwestern regional network, which includes the exhibition program and the digital space the Art Lab.“We are extremely excited by the", "The next Biennial should focus on: “The Future of Art in the Digital Age.” The exhibition will be curated by art historian Gilbert & George, who has previously directed the Museum of Modern Art in New York, the Skirball Cultural Center in Oxford, and the Metropolitan Museum of Art in New York. “The Future of Art in the Digital Age” will be presented by the Paris-based duo João and Roberto Capa, who will take the reins of the exhibition from the veteran curator Hans-Ulrich Obrist. Obrist, who has curated many world-class exhibitions and won numerous awards, including the Prix d’Arles, will also serve as the artistic director of the World Art Festival Berlin; of the Venice Biennale; and most recently, of the 2020 edition of Art Basel Miami Beach.The twenty-first edition of the Venice Biennale was staged at Venice in March of this year. The twenty-third edition, which was staged at the Venice Museum in March of 2018, was staged at the Museo Leonardo in Venice in September of this year.\n\n\nThe National Gallery of Art in Washington, DC, is planning to build a $300 million expansion into a former steel plant", "The next Biennial should be inaugurated by the unveiling of a new collection of contemporary art by the artist Mei-Lin Huang. While the pavilion will be inaugurated by an exhibition of work by the artist in collaboration with an international team led by the artist, it will also host the artist’s first solo show in China and the first Chinese artist to be featured in the pavilion. The exhibition will be organized by the Biennial of Capital Art and will include 30 works by twenty-four artists, including Tanya Bonakdar, Lukem Tatars, Nie Zhu, and Xuyuan Wang, who will be joined by a team of thirty-one artists from ten countries.The exhibition is curated by the artist Liu Jun, who will present four works by the artist’s daughter, Li Xinyu, in the pavilion. Participating artists are Li Lan, Li Xin, Li Yaobai, Li Xinyu Li, Li Jun, Liu Jun Li, Liu Yu, and Liu Yu Zhu. The exhibition is organized by the Beijing Art Museum and will run for ten weeks.\n\n\nThe National Museum of Fine Arts (NMA) in Washington, DC, is preparing to open this fall with a new exhibition of", "The next Biennial should take place in 2020, and the last one in 2022.\n\n\nThe Museum of Fine Arts (MFA) in Boston has announced that it will begin welcoming visitors from January 25 through January 27, 2020. The institution noted that the reopening of the Museum of Fine Arts would coincide with an expansion of the Boston Cultural and the North Adams Arts and Culture District (BCAC), which will be completed by the end of 2020.“The project to redesign the MBTA’s Art and the MBTA Museum of Art will greatly improve the transportation network, expand our collection, and enhance the museum’s educational programming,” said Jonathan Katz, director of the MBTA. “The museum also believes that the expansion of our public realm, including the collection, will make it more attractive to visitors, particularly young and middle-aged families.”The MBTA’s $5.7 billion plan to overhaul the T, including the construction of two new stations, the overhaul of the Blue, Orange, and Green Lines, and the construction of a new station on the Green Line, has been in the works for years. In 2016, Governor Charlie Kennedy signed an $85 billion transportation bill that also included the", "The next Biennial should be held at the Museum of the Moving Image (MGO) in New York in the fall of 2020. The biennial will focus on contemporary art and its influence on the culture of the Americas, and will focus on themes such as the future of art and artists, the power of artists in shaping the future, and the power of visual art in shaping the future.The next edition will be curated by Adam D. Weinberg, director of the Museum of Modern Art, and will present more than sixty exhibitions, including a ninety-minute talk with Lee Camp. Among the artists who have announced their participation in the 2020 edition are Kelly Rogers, Kiki Smith, Michael Chabon, Yoko Ono, Nari Ward, Andrea Bocelli, Kirsten Jackson, Tamara Johnson, and Billie Tsien.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York announced today the projects and artists represented in the upcoming edition of the Metropolitan Museum of Art (MMo), “The Artist’s Studio,” which will run from March 22 to March 25. The event will offer an in-depth survey of the history of art and will focus on the artists who have emerged as", "The next Biennial should be staged in the coming months.\n\n\nIn an attempt to rein in the rising popularity of the biannual exhibition, the National Gallery of Art in Washington, DC, has stopped selling prints by artists and institutions that have not received full refundations from the federal government. The institution made the announcement on Wednesday, March 16, following the filing of a complaint with the US Copyright Office.The complaint alleges that the National Gallery of Art used a sale of a work by a non-United States-certified artist as part of a “prestigious auction.” The work, a print by Jay-Z and Beyoncé, was part of a “brand campaign.” The work, which was commissioned by the gallery, is now the subject of a lawsuit by the artists.According to the complaint, the National Gallery of Art created a situation where the sales were difficult and in some cases impossible. The works were sold by works that were not certified or approved by the National Gallery of Art.“The gallery knew that the works were not certified or approved but created a strong incentive for participants to participate by selling works that were not certified or approved,” Courtney Levey, an attorney who represents some of", "The next Biennial should take place in 2021-22. In a statement read by the organization, the project director, Mu-Wei Huang, called the construction of a 'new generation of cultural institutions, devoted to the life and growth of Hong Kong.”The exhibition will be curated by Hsu Cai-Chun, the Hong Kong–based curator of Hong Kong art; Bruno Piscitelli, the founder and director of the exhibition space Artorama Hong Kong; and Hong Kong–born artist and educator Hsu Che-Chie, who is currently working on a research project in the city. The biennial will also consist of a number of solo exhibitions, including a solo exhibition at the Hong Kong Art Museum in September and a solo exhibition at the Hong Kong Museum of Art in November.\n\n\nThe project is the latest attempt by the Yale Art Museum to expand its holdings of Yuhuangdi, a Tibetan Buddhist text that aims to elucidate the meaning of daily life through art. The exhibition, which will feature works by twelve artists, will run simultaneously at the museum and at the Tsoi Art Center in Beijing, which is currently undergoing a $65 million renovation.Inventors from the two locations will collaborate in a virtual", "The next Biennial should take place at the Venice Biennale, in June 2020. The organizers have stated that more information will be released soon. This year’s event will showcase the latest works by internationally-acclaimed artists, including Giacomo Balla, Michelangelo Antonioni, and Alfredo Poggi. The full list of participating artists is as follows: Berthold Ekman (New York) Giancarlo Cipolletta (New York) Andrew Cunningham (New York) Alberto Anzani (New York) Amanda Black (New York) Alberto Bulsara (New York) Alberto Cipolletta (New York) Amia Chankoe (New York) Ashley De Arta (New York) Adam Dadds (New York) Kathrin Demarchek (New York) Arturo Duarte (New York) Arturo Pinto (New York) Alberto Poggi (New York) Alberto Valiente (New York) Alberto Zingaretti (New York) Austin Dukakis (New York) Benedict Glim", "The next Biennial should be held in 2021 and will be on an apple-shaped platform, the same structure as the Biennial itself. Its inaugural exhibition, titled “How to Live Life,” will include works by twenty-four artists who will each receive $2,500. During the exhibition, which will include more than sixty new works, the artist-in-residence will participate in a series of performances, including “The Forlorn Ideal: Spring/Break,” which will center around a tableau of images that mimic the environment of a deserted forest, and “The Guts,” which will feature a sculpture by the Brazilian artist Renan Barração that will be positioned on a platform twenty feet above the street. The exhibition will be accompanied by a book by the same name, with the same title, written by Bautista and Barração. The book will accompany the exhibition in the form of a “life story,” a narrative of Bautista and Barração that will explore the ways in which they were able to find meaning and purpose in the two dozen works that are currently on view. “The art of life is the art of the", "The next Biennial should take place in the spring of 2020. The event will be hosted in the Museum of Contemporary Art, Art, and Design (MoCA), which is currently undergoing a $450 million renovation and is currently undergoing an expansion.The theme of the 2020 edition will be “art of the living,” tapping into a theme that has been explored in recent years. While the theme of the exhibition will remain the same, the building and exhibition will be reworked to address the institution’s ongoing construction projects. For the latest news about the Biennial, visit the Art Institute of Chicago’s official website.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is expanding its staff by tenfold, adding twenty-five artists and twenty-three curators in the process. The museum’s executive director, Ed Ruscha, said the changes will help it “deal with the challenges of the next decade and a half better equipped to address them.”The institution also announced that it is increasing the number of artists participating in its annual Spring/Autumn/Winter/Spring/Summer/New Year’s themed exhibitions as well as its annual “Life/Adventure�", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Kate Fowle as its next executive director. Fowle comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as assistant curator since 2018. She succeeds Scott Goss, who retired in March 2019 after more than four decades at the helm of the museum, and will take up the post on August 1.“After a thorough search of the permanent staff, board, and the immediate community, Kate Fowle was selected as the next board president,” board chair and deputy director Susan Frederick told the Los Angeles Times. “Kate’s proven track record as a curator, as a leader, and as an administrator make her uniquely qualified to lead the LACMA through this challenging and challenging time.”Fowle, who has helmed the museum since 2004, will begin her tenure in August. She succeeds Scott Goss, who departed the institution in March 2019 after more than three decades as director. The museum reached a milestone this week with the completion of a major $40 million expansion, which added thirty-two galleries and added more than two hundred", "The next Biennial should be held in 2021. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, the California Institute of Technology (Caltech), and the Los Angeles County Museum of Art (LACMA) have launched a new initiative that will provide millions of people with access to free digital artworks. Called Project Connect, the initiative will allow artists to upload and share their works on the upcoming exhibition “Theoretical Art: A year of Remaking the Modern Past,” which will run from November 18 through February 17, 2021. “We are thrilled to support the work of many of the most under-recognized artists of our time, and to celebrate the impact that their art has on making a difference in the world,” said Craig Anderson, the former director of the Art Institute of Chicago, who was tapped to serve as the inaugural director of the LACMA program.Anderson created Theoretical Art as a platform for artists to make work that incorporates both theoretical concepts and practical applications while also exploring the philosophical underpinnings of contemporary artmaking. The show, which will run through March 14, will feature work by sixty artists, including Adam D. Levine, Nari Ward, and Jesse Fan,", "The next Biennial should be held in 2020.”\n\n\nAdvertisement\n\nThe Phillips Collection and a team of international curators have unveiled their newest exhibition, “The Worlds of Good and Evil,” which will open on October 7. The exhibition will feature more than 200 paintings by seventy-seven artists, including Emma Goldman, Miro Commisso, and Peter Andre, and will examine the boundaries between art and science fiction and the relationship between science and technology.Adeline O’Grady, curator of the first exhibition, which will feature work by forty-nine artists including Rirkrit Tiravanija and Robert Irwin, said: “The Worlds of Good and Evil is a celebration of the work of a vast array of artists and explores the world of the contemporary artist through the prism of art. Drawing from a range of genres, the exhibition will examine the relationship between science and art and experiment with the boundaries between science and the everyday world.”The exhibition will also include work by former winners of the Manne and John Giorno Biennial, including Mark di Suvero, Lawrence Bianca, and Hernán Cortés, as well as new works by artists such as El Paso Mendieta, Nari Ward,", "The next Biennial should be held in 2020, to be followed by a People’s Congress of the Communist Party of China, the Cultural Revolution, and the Cultural Uprising. The Qingdao Art Museum will also have a new exhibition. The Taichung Biennial is currently underway.\n\n\nAfter a daring mission to save a twenty-two-foot-tall statue of Mao Zedong from toppling in Beijing last week, the Chinese authorities have responded by dismantling more than one hundred monuments, including a twenty-one-foot-thick memorial of a red-shirted revolutionary in the capital.The authorities also moved a monument commemorating exiled American artist Ai Weiwei and his wife, the artist Li Huajie, from a temple in Beijing to a museum. The move angered locals and led to a furore over the pair’s relocation. Ai Weiwei and Li Huajie are no longer listed in China’s official collection, but their descendants are fiercely opposed to their removal and have launched a campaign to have their remains returned to China. The Huajies’ fight began last February, when the authorities arrested a group of activists, including a former driver for the capital’s subway, and charged them with", "The next Biennial should be held in 2020. \n\n\nThe Carnation Art Gallery in London announced on Wednesday that it has received a gift of forty-two works from the French Yaounde Museum in Dakar, Senegal. The gift includes classics by Lévy Gorvy, Painting in Lumière, La Tête Rouge, and Rosemarie Peters, as well as works by artists and collectors such as John Sze.“The gallery is delighted to present this incredible collection to the community in Dakar, and to have created some of the most prestigious works in the country,” Ameya Haidara, the director of Carnation Art Gallery, said. “The work of the museum is a great example of how a small museum can transform into something extraordinary. This collection is a reflection of the passion and commitment of the collectors, the museum, and the staff, who have made the museum a success. We are thankful to our partners, the Dakar Art Museum and the French Ministry of Culture, for providing this extraordinary gift to the gallery.”While the works in question are by Sadek Afuarme, Vivian Brown, and Paul Gauguin, the artists most likely", "The next Biennial should be held in 2020. In the meantime, the state has put out an open call for a new curator of interdisciplinary art.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Will Higgins as its new deputy director for curatorial affairs and chief curator. Higgins was promoted to the position after Andrew Kreps was hired as director of the Internal Medicine and Brain Sciences (MICs) at the Henry Luce Foundation.“After a thorough search process that included nominations of a number of high-profile artists and curators and a collaborative work by Garth Brooks, Will is excited to be joining the National Gallery of Art’s staff and the National Gallery of Art’s mission,” said Ellen Wolk, the institution’s director and chief curator. “His innovative approach to curating and his commitment to teaching and informing the gallery’s audiences will ensure that we continue to forge a shared vision of art heritage and the museum’s collection and collection programs.”Higgins will assume his new responsibilities on March 7. Higgins is the current deputy director of the Gallery of Modern Art in New York and the former director of the Osnabradsus, Greece, branch of", "The next Biennial should be held in 2020. \n“Our thoughts are with all those affected by the recent events, and we hope that they will find some comfort in knowing that we are actively working with our partners to address the issues that this exhibition has raised, and to continue to raise, in the coming years,” said Artnet editor-in-chief Anu Jakobson. The collection, which is housed in the Museo de Arte Contemporáneo Arturo Brindisi, will be named in honor of the five-year anniversary of the exhibition, at which point the institution will unveil more of the works of that exhibition.The exhibition marks the fifteenth edition of the New York Biennial and was organized by the Museum of Modern Art and the Metropolitan Museum of Art. The event was initially scheduled for February 20 to February 21, 2020. Recently, the museum has pushed back the date of the exhibition, announcing that it will present the work of the forthcoming exhibition “Revolutions.” The organization’s director, James Cuno, told the New York Times that the delay was caused by the pandemic.\n\n\nThe Saudi Arabian government is introducing new regulations that aim to crack down on “", "The next Biennial should consider how art history can be organized in relation to a changing political and cultural climate and how art history can contribute to the transition from the current epoch to a new one.”This year’s biennial will be hosted at the Brooklyn Museum, and will comprise twelve exhibitions, each led by a different artist, including “Blindspot: Sargent” (2019), an exhibition about American and European art from the 1930s through the 1960s, “Feminine/Christian: The Art of the Crossroads” (2019), an exhibition about Christian art in the 1800s, and “The Great Sculpture Exchange” (2019), an exhibition that will feature works by thirty-eight international artists and will run for eight weeks. Seating in the biennial has yet to be determined.\n\n\nThe Philadelphia Museum of Art (PMA) has appointed Jessica McEnery as its next executive director. McEnery comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as deputy director and chief curator of the past five years. She succeeds Mark Schier, who departed in 2018 to head the Museum of Contemporary Art Los Angeles (LA Mo", "The next Biennial should be held in 2021. In a statement to the Art Newspaper, Mr. Naidoo said: “The redevelopment of the exhibition spaces is a major step which will enable the exhibitions to be more interactive and rewarding. With this in mind, I have decided to move the 2022 edition of the Biennial, ‘We Are All In This Together,’ to  2019.” Wang Pei-fu, a director of the museum, said: “I look forward to supporting Hong Kong and supporting the museum in 2020.”  Hong Kong’s art scene, which is still in its nascent stages, is taking another leaf out of the artists’ collective’s book. Last month, the Hong Kong Museum of Art (HKMO) launched the Hong Kong Art Residency, a residency program that will host artists locally and train them in Hong Kong through a combination of online and in-person instruction.  Also last month, the Hong Kong Art Museum opened a new 800,000-square-foot wing of the institution, HKMO Central, which will host regular exhibitions and events. The center is slated to open in 2021 and will host ten exhibitions a year.", "The next Biennial should take place in the city in 2020.\n\n\nThe twenty-third edition of the Dusseldorf Biennale has announced that New York will receive a total of twenty-four artists, including John Lobb, John Gavin, Rachel Harrison, Celeste Bonaventure, Thomas Gray, and David McAllister, who will collaborate on a retrospective of their works at the Biennale in 2021. The exhibition will include works by forty-two artists, including Kristjanstamm, Harald Szeemann, John Gutierrez, Sam Ford, and Konrad Fischer.The 2017 event, titled “Between the Sun and the Moon” and curated by Daniela Krijn, featured work by forty-three artists, including Willy Kamen, Ben Kader Attiyah, Tobi Haslett, and Emily Hall.\n\n\nThe Foundation for Contemporary Art (FCA), a leading nonprofit arts organization based in New York City, announced today that it will boost its annual endowment by $10 million through a new innovative strategy that will deliver a financial benefit to artists and arts organizations that provide a critical link between the foundation and the performing arts across the city. The plan was developed with the Artists’ Council", "The next Biennial should take place in Shanghai, and as of this week the first exhibition has already been completed in New York. It will, however, not be open to the public.“The $72 million Biennial is a watershed project,” said David Milch, Chair of the Arts Committee of the Museum of Modern Art. “It illustrates that the world of art can be a force for good not just for the artists, but for society as a whole.” \n\n\nThe Museum of Contemporary Art (MoCA), San Francisco, has unveiled a new initiative, “Sustainability in Motion,” that will commission local, national, and international artists to produce works that “engage with, and respond to, the current social and political moment.”“We are excited to partner with MoCA to bring this next chapter of the artist’s history to life,” said Humberto Jesús, head of MoCA’s sustainability team. Jesús said that the program will include artist-specific projects, including work by artists such as Ben Kuchera, Yayoi Kusama, Mierlo Varela, and Yvonne Rainer", "The next Biennial should include works by non-European artists such as the Tunisian artist Majid Saiedi (1924–2005) and the French artist Rene Magritte (1885–1974) and Pilar Corrias (1904–1978), and one of the artists whose work is currently on display in the exhibition “Theatre of Death” at the Biennale in Venice. \n\n\nThe Dutch Ministry of Culture has placed ten works by women artists and art workers into the exhibition “The Foursquare Effect: Art and Politics in the Transition to Digitality” at the Venice Biennale, a surprising move considering the country’s recent move to ban public gatherings of more than forty people. The festival, which runs until December 21, is one of the first major international events held in the Netherlands and is organized by the museum of fine arts, the KU Leuven, and the KW Institute for Contemporary Art. “The Foursquare Effect: Art and Politics in the Transition to Digitality” takes the form of an interactive multimedia installation, which traces the development and actualization of an online political platform called the Freenode web platform. The platform", "The next Biennial should be held in 2021. The ten-day event will be hosted by the Japanese art museum, the Hiromi Museum in Nagoya, in collaboration with the National Museum of Fine Arts, Tokyo. According to Artnews, the exhibition will also feature work by artists such as Kazuko Koto and Yuji Nara, whose work is currently on display in the exhibition “MUSEUM TAKAYAMA” at the Hiromi Museum.The biennial is part of an initiative by the museum to increase the museum’s presence in the city of Nagoya. \"We are convinced that our work is an important cultural contribution that will further enhance the Nagoya Art Museum and our collection, and is also a great asset for the local community,” museum director Satoru Yamamoto said.  The museum also boasts of a collection of more than 1,300 works, including works by artists such as Isamu Noguchi, Antonio Berni, Liza Lou and Yoko Ono, and James Turrell.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has named Stephanie S. & David M. Kroft as the new partners behind the new space for contemporary art in", "The next Biennial should open next March in the event that the international epicenter of the conflict in Syria is rekindled.\n\nThe International Committee of Museums (ICOM) has announced the reopening of its Early Film Festival, which ran from March 19 to March 21, 2020. The festival, which supported twenty-one artists and organizations who are currently shortlisted for the 2016–17 Emma Hall of Fame, will now be hosted by the Museum of Fine Arts, Boston. The festival will also launch a new digital platform, the ICONS Project, which will connect participants with artists and organizations in the art world.“ICOM’s commitment to supporting the arts and supporting the careers of the thirty-one artists who are currently shortlisted for the 2017 Emma Hall of Fame has always been of paramount importance to us,” said Museum of Fine Arts director Dominique de Menil, who added that the institute’s sponsorship of the awards ceremony is at least as important as the publication of the final works.De Menil added that the ICONS team has worked hard over the last two years to make the festival’s 2020 edition more accessible for families and small businesses, and has worked", "The next Biennial should be held in 2021. “We have had many requests from artists from different countries to present their works at the inaugural event, and for a very long time, it was our intention,” said Guttman. “But we are now moving into the second half of the decade, and the costs of what we are doing have risen tremendously. We are now approaching the third year of our program, and we recognize that it is not an easy time for most artists to present a work at that level.” Guttman added that it will be a “challenge to do it justice\u0097it will be a monumental exhibition.”\n\n\nThe Museum of Contemporary Art (MoCA), San Francisco, announced today that it has secured additional funding for its ongoing renovation and expansion of its historic building. The $105 million endeavor, which is part of a $125 billion plan that aims to create the largest contemporary art museum in America, opened in January 2019 and is slated to include a new 360-degree audio/visual experience that will draw visitors from around the globe.The project will be led by architecture firm Gensler, which designed the building in collaboration with the San Francisco Museum of Modern Art", "The next Biennial should be held in the autumn of 2020 and will be inaugurated by William Shakespeare’s Stratford-on-Avon, England, with its centenary celebrations in May 2020. The exhibition will feature the work of more than 2,500 artists and will be curated by director Diarmuid Banerjee.\n\n\nThe Centre Pompidou in Paris will reopen on January 9, 2021, after a major renovation and expansion. The centre, which consists of an eight-thousand-square-meter (3,600-square-foot) museum, the Pompidou Oriental, and the Périgordère Palace, will host the twenty-second edition of the Milan Architecture Biennial, which will be held at the Pompidou from March 8 to March 10, 2021.“The Centre Pompidou will be an instanter of the Milan Architecture Biennial, which has been a real dream of mine for many years,” said Pierrick Roldan, executive director of the Centre Pompidou. “I am thrilled to be working with my team to realize this dream and to offer the exhibition a new chapter with a stunning new architecture at a venue that", "The next Biennial should include a platform for the regional and national delegations of the International, International Scholar-in-Residence, and International Fellows. The exhibition should also consist of a selection of works that have not been previously exhibited in the United States and Europe.The 2020 edition of the Biennale will run from March 5 to March 7. The 2020 edition will feature a number of works that had previously been underrecognized or overlooked by the artistic community. The program will also include a new documentary, The Story of a Girl, about a girl in the Philippines who, inspired by the work of American artist Maya Lin, created a series of works that shed light on her country’s history. The documentary will premiere on October 27.The 2020 edition of the exhibition will be organized as follows: 1. Introduction2. The Story of a Girl3. The Legend of the Mona Lisa4. The Peacemaker5. The Flight of the Nude6. The Look of Two Eyes7. 8. 9. 10. 11. 12. 13. 14. 15. 16. 17. 18. 19. 20. 21. 22. 23", "The next Biennial should take place in May 2020.\n\n·   ·\n\nThis week marks the twentieth anniversary of the release of the documentary Culture and the Bomb, a powerful portrait of the relationship between the United States and the former Soviet Union, the central theme of which is that culture is not a foreign weapon but a vehicle for social progress. The film won the Grand Prize at the seventy-fifth Venice Biennale in 2007. Culture and the Bomb tells the story of the Battle of Stalingrad, the Russian–American nuclear arms race in the Second World War, and the fictional city of Baku, Azerbaijan, which is the setting for more than twenty episodes of the documentary. The multi-million-dollar production, which was co-directed by director Michael Douglas and stuntman Kurt Russell, premiered at the 2016 Sundance Film Festival as part of the museum’s massive reopening.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Sophie Joachim as its new deputy director and chief curator. Joachim takes the helm from Kate Martin, who has served at the museum for eighteen months, and will assume her responsibilities in January 2020.“Sophie shares an", "The next Biennial should be held in 2021.\n\nThe museum’s new collection of contemporary art, titled “Live from the Museum’s Collection,” is currently on view through December 28. The exhibition is curated by director James Berger, who has served at the institution for more than twenty years. “We are thrilled to present this exhibition in 2018, with the support of the extraordinary team at the museum,” Berger said. “Live from the Museum is a powerful work of interdisciplinary modernism, exploring the journey from reality and the environment into the digital realm.” The exhibition also comprises fourteen new artist commissions, including Kathleen Cleaver’s “Tautology (1960–1945),” which is based on her 1967 book The Drawing of Space; Kirsten Alvernoy’s “Just the Way They Are: Painting Albumen” (2017), which draws inspiration from early paintings; and Felicity Hammond’s “Plain Things” (2017), based on a painting by the late British architect and theorist Noël Carroll. More artist commissions will be presented in 2020, with the year 2022 to coincide with its 150th anniversary", "The next Biennial should be held in 2021, the architects believe. Although most of the work will remain behind the showpiece city, the event will be transformed and reworked to reflect the city’s evolving identity. Michael L. Oliver remarks: “We are committed to enabling the world to experience the new Twin Cities. . . . We have long believed that when the original Twin Cities (New York and Minneapolis) were selected for the 2020 Biennial, we had a responsibility to do everything we could to ensure that their inclusion was recognized and celebrated. That’s why we’ve worked tirelessly to secure their future inclusion, and that’s why we’ve built one of the most beautiful places on earth.”\n\n\nThe museum in Cologne, Germany, has received a $7.5 million donation from the collection of German collector Peter Zuckerman, whose wealth of art includes works by Berks Kupfer, Cezanne, and Vermeer. On Monday, the museum announced that it was awarded a $2 million donation from his estate. Zuckerman, who passed away in Venice in 2015, was a Berlin native who studied in the city of Kassel since the late 1960s. He", "The next Biennial should take place at the Art of the Modern Art Museum Istanbul (AMAMI) in 2018.  The new exhibition, titled “Art and the Future: from the Real to the Imagination,” will open on October 14 and run until November 18.\n\n\nThe Museum of Jewish Heritage (Monash University, Australia) has received a $35 million gift from the Howard League for Jewish Research (HLJ), which was founded by philanthropists Philip and Mildred Howard in 2010. The generous donation includes the acquisition of three works, three previously unopened frames, and a collection of approximately one hundred photographs depicting a selection of historic and contemporary Jewish subjects. The works, which are currently housed at the museum, were donated by the Howard family to the museum in the late 1970s. They were opened to the public in 1978 and featured in the exhibition “The Final Days” (2011–12), “The Chinese in Australia” (2012–13), and “The Leaning Tower” (2013–14), among other shows. The collection will be presented in “The Chinese in Australia” (2019) and “The Leaning Tower” (2019) at", "The next Biennial should take place in 2021 and will be hosted at the Metropolitan Museum of Art in New York. The exhibition’s curator, Joseph Knoedler, will serve as the director of the exhibition.“It’s an ambitious project, but one that will pay off in the long term,” Knoedler told the Art Newspaper. “I’m thrilled to be representing the Biennial at the Met and hope that you will join me in this endeavor.”\n\n\nSinger-songwriter and actor Ryan Tedder, whose rugged, punk-inflected pop was defined by its ability to transcend gender stereotypes and defy categorization, has died at age forty-eight from cancer.Born in New York in 1958, Tedder studied with the pioneering experimental-music artist John Kahn at Columbia University but only began acting professionally in the 1970s. He first gained mainstream recognition with his collaboration with the avant-garde New York rock band the Dream Syndicate, whose enigmatic, psychedelic music he wrote and recorded while he was employed by the New York City public-school system. For his first solo album, The Dream Riders, 1995, Tedder spun a hybrid of folk and rock songs, songs", "The next Biennial should be organized in 2022 and will draw from a selection of artistic practices from South Asia. Begun in 1989, the summit has attracted around two hundred thousand visitors since it began, and is currently held in the foothills of the Himalayas. “South Asian art is a model of creativity, innovation, and resilience that has been instrumental in forging partnerships between the region and the world,” said Artnet editor in chief Nomani Kalra. “We are thrilled to see the work of so many artists and see how they embody the spirit and spirit of the conference. We are especially excited to see their innovative approaches to connecting cultural and physical spaces and to work with the exhibition.”\n\n\nThe Metropolitan Museum of Art (MoA), which plans to move forward with the construction of its new building in the Jackson Heights neighborhood of New York City without the support of the local arts community, has cut eleven administrative positions in the museum in an attempt to placate activists upset with the museum’s decision to remove artist’s studios and artworks from its campus in the interest of preserving the Hirshhorn and the Jackson Heights neighborhood. “This is an unprecedented situation for the museum, and we", "The next Biennial should focus on the history of the exhibition, as well as the exhibition of the work in its entirety, and this should take place at a time and place that is appropriate for the exhibition. The exhibition should explore the idea of the exhibition as a whole, with the work in each exhibition as a distinct project. If the exhibition is not organized in such a way that the work is available for immediate consumption, then the work will not be offered in the biennial and will not be exhibited.The Biennial of Contemporary Art will be held at the Museum of Contemporary Art, Rochester, in 2021. The biennial will consist of a series of exhibitions organized as a linear narrative. The first exhibition will feature twenty-five works by contemporary artists, including Don Sánchez-Jiménez, Kiki Smith, Peter Sze, and Michael Spring/Armstrong, and will be on view in November 2021 through February 2022. The second exhibition will feature twenty-five works by contemporary artists that have been selected for inclusion in the first exhibition. The third exhibition will feature thirty-five works by contemporary artists that have not yet been presented in an exhibition.The selection committee was made up of art historian Jack Shainman, curator, Merce Cunningham", "The next Biennial should be convened by the end of the year.\n\n\nThe Berlin-based artist Alina Baranova has won the Prix d'Art Moderne in Zurich for her first solo exhibition since the devastating explosion in Nuremberg, Germany, two weeks ago, which killed an estimated eighty-five people.Sittinguate in the historic Nordhaus in the German city of Bern, the show will feature work by fifty-five artists and will go on view in the spring. The exhibition is part of a series of events organized by the artist and her husband, Anton, in response to the current global crisis. The show is an extension of the artist’s ongoing response to the ongoing refugee crisis, which they see as a necessary factor in the cultural evolution of Germany.“As we live as refugees, we live in a shifting world, a world in transition,” Baranova told theartforum. “We must protect culture and build it in a way that does not destroy it.” She added: “This is a question for both the cultural and the political spheres, a question of culture and politics that does not yet belong to either.”Baranova is the first living artist to be featured in the program", "The next Biennial should be staged in 2020 and will consist of twelve artists.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it will re-emerge from a yearlong hiatus following the devastating explosion and fire that tore through its sixteenth-floor observation deck on April 15, 2020. The institution will reopen on August 28 with a new ceremony that will culminate with a special exhibition of the work of artist Ali Larter. “This is not a time for rest, contemplation, or celebration,” said Louvre director Lucie Cotte. “In the coming months we will confront the themes of our exhibition and the exhibition as a whole, which is what we are all here for.”The Metropolitan Museum of Art (MoMA) has announced that it will reopen in the spring of 2021. The institute has been working to maintain a series of exhibitions in the aftermath of its collapse, which was triggered by the mishandling of a $100 million loan it made to the Bauhaus, and has been working with the National Gallery of Art and the Whitney Museum of American Art to organize the series “From Fund to Future:” (2018–19) and “From The Bauhaus", "The next Biennial should be held in 2020.\n\n\nThe Smithsonian’s National Museum of African Art in Washington, DC, has received a $50,000 donation from the Ford Foundation, the Walton Foundation, and the Nathan Family Foundation. The funds will go toward the purchase of the museum’s first collection of African American art, which was first organized in 2012 and is currently on display in the institution’s new building.The gift comes on the heels of a $81 million expansion, completed in 2016, that added more than three hundred galleries, theaters, lecture halls and recording spaces. The new building also added a new center for African American art, a new Jewish Museum, and a new building dedicated to African diaspora art, and brought the museum’s collection closer to its historic collection. The National Museum of African Art also positioned itself as a focal point for the conversation about race and art among scholars, artists, and students at the institution.“The National Museum of African Art is excited to present the first collection of African American art in the United States,” said Andrew Ford, chair of the Ford Foundation and a founding trustee of the museum. “The gift is an exciting development for the museum as we work", "The next Biennial should take place in 2021 at different times in order to generate new ideas and to engage with the widest range of ideas from around the globe. Our vision is to create an environment where the least understood visual arts and the most important ideas can flourish.We would like to thank all the artists who participated in the previous gen­eral, and especially to the two hundred and fifty-third Congreso de Painting in Lisbon for their support. We are also grateful for the support of our partners and friends in the arts and culture, and especially in the political and cultural sectors. We are grateful for the inspiring, compelling, and sometimes surreal exhibition that was the inaugural Venice Biennale, and for the many exhibitions and screenings that were held at the Museo das Arte Contemporanea in Milan and at the Autarchi in Turin.In the coming months, we are planning to launch a new initiative called the Open Curaçao Project. The project will be led by an independent curator, Ana Mardin, and will aim to serve as a platform for local artists and will focus on the integration of visual arts and culture. We will also continue to publish this article and plan future exhibitions.In September 2020, the ninety-"]