["The next Biennial should be on June 22-24. From now on, the list of experts will be made up of experts from the United States, Europe, Japan, Canada, Australasia, and Oceania, and the curators will be selected by an international committee comprising Hiroshi Kawamura, Shigeto Yamamoto, Shunji Nakayama, Satoru Iwai, Haruki Murakami, John Ostrander, and Christo.  The next exhibition will be held in September.\n\n\nThe Hamilton Museum of Art in Hamilton, New York, has appointed Paul Stamets, a former executive director of the Society of American Art, as its next director. Stamets comes to the institution from the Museum of Fine Arts in Boston, where he has served as interim director since April. He succeeds Jorge Navarro, who retired after a decade in March 2019 after a far-reaching and controversial ten-year term as director.“We are very excited by the appointment of Paul as director of the Hamilton Museum of Art,” said Joslyn M. Miranda, chair of the Hamilton board of trustees. “His proven track record, as a", "The next Biennial should take place in Milan in 2022. \n\n\nThe British filmmaker, playwright, and producer Nusseibeh Darweesh, who won the 2016 Nobel Prize in Literature for her work The Pure Land, has died. She was seventy-three years old.Born in Iran in 1947, Darweesh immigrated to the United Kingdom in 1957. In 1975, she married Amira Ali, whom she met in England and moved to the United States with. The couple soon had a son, an American citizen born in 1972, but they were never married. In 1978, the couple moved to Saudi Arabia, where they had previously lived and began a family. In 1983, the family returned to Iran.In 1987, after a year in northern England, Darweesh returned to Iran. She and Ali moved to the Persian Gulf in 1998, and in 2001, they returned to the UK. In 2003, the couple returned to the Persian Gulf, where they had previously lived and continued their lives. In 2011, the family returned to Bahrain.In 2013, as part of a group show at the National Gallery of Art, Darweesh was selected as the eighth laureate. She was awarded the honor in the audience of the Royal Shakespeare", "The next Biennial should be organized in 2020, according to a statement from the Kunsthalle Basel. The next edition of the Biennial will take place in April in March. The event will be hosted by the new German Cultural Center in Basel, and will be led by the Kunsthalle Basel.The exhibition will be curated by artist and curator Timur Eriksson, and will open in September 2019. The exhibition will be followed by a series of public concerts, lectures, and other events, and will run from November 21 to December 31, 2019.  \n\n\nThe Queens Museum in New York has appointed John Baranek as its new director and CEO. He succeeds Timothy L. Morgan, who has been the institution’s executive and artistic director since 2012.Baranek comes to the museum from the Getty, where he previously served as chief curator and director of exhibitions. He succeeds Morgan, who left the institution in March 2019 to head the Getty’s new division in Hong Kong.“John has spent the better part of two decades leading the Queens Museum, specializing in the art of photography and its visual and media histories, and we are excited to find his leadership qualities and vision to guide", "The next Biennial should be held within a year. The Festival should also engage with contemporary issues of art, culture, and the life and work of Robert Rauschenberg, and should include an extensive exhibition of works from the artist’s archive.“Art is an indispensable part of life,” said Taneja. “It is an incontrovertible fact that Art has changed the course of our lives and our world. It has given us purpose. It has made us think and realize extraordinary things. What more can we say?”\n\n\nThe Art Newspaper has appointed four new members to its editorial board: Casper Lehmann, a visual artist based in Frankfurt; Osman Malik, a New York– and New York–based curator and novelist; Filippa Rovira, a contemporary art historian and curator; and Bibi Silverman, a art historian and arts editor.The board, which consists of Katie Cochrane, Artforum’s editor in chief; Alejandro Corrias, a curator and author; and Lucia Hengel, a curator and director of the Italian Modern Museum in Rome, also selected Wangechi Mutu, the chief curator of", "The next Biennial should be held in the spring of 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Steven Pettway as its next executive director. Pettway will take the helm from director Marc Straus, who is currently on sabbatical. Pressed to expand the museum’s use of technology in its collection, Pettway said that MoMA is dedicated to “implementing a new kind of physical experience in which art and design interact.” He also said that MoMA is preparing to open a new artist’s studio in the fall.“Steven’s tenure at MoMA demonstrates his ability to design and articulate for a diverse audience across an extraordinary range of visual and audio technologies, and to expand MoMA’s mission and profile in an unprecedented way,” said Straus. “Steven’s leadership and vision for MoMA reflect the visionary vision of our board and staff, and of our broader community, and prove his ability to translate the best of MoMA into the best possible future for our institution.”Pettway, who has served as MoMA’s director since November 2019, joins the organization from the Los Angeles County Museum of", "The next Biennial should take place in the spring of 2021, but the dates have yet to be fixed.\n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles is preparing to welcome visitors back to the institution for a second season. The institution confirmed on Saturday that Season Two of its biennial, “Unfinished Business,” will run from March 19 to March 21, 2022. In order to prevent overcrowding and traffic congestion, the biennial will not bring the entire works on display, but rather a combination of works that have not yet been exhibited or displayed. The biennial is already suffering due to the Covid-19 pandemic, and the organizers are hoping that this will only help them with their fundraising efforts. The first season of the exhibition, titled “Kingfish,” was inaugurated by artist Renata Olmi. Her work, which explores the relationship between the human and natural worlds, was exhibited at the 2016 Venice Biennale. The work, which was originally commissioned for the Bienal de Sarthe in 2007, had to be resolicited several years later, when the piece was included in “La Biennale de l'Oriente” (The City of Flowers,", "The next Biennial should be held in 2021 and will be presented by the Flemish Ministry of Culture and the Museum of Modern Art. The Biennial will also include a plans to launch a new online platform dedicated to the life and work of the artist. The Art of the Biennial will open on December 22 and run until February 24. The upcoming exhibition of the work of the artist Kalman Sze, which will be held at the City Museum in Beijing from January 28 to March 26, will also be announced shortly. The artist will be presented with a Lifetime Achievement Award at the ceremony.\n\n\nThe Metropolitan Museum of Art in New York has appointed James Obalil as its first director of the Metropolitan Museum of Art in New York. Obalil comes to the institution from the Museum of Modern Art, where he has served as director of research and curatorial initiatives since 2013. During his tenure, he has also worked as artistic director for the Biennial of American Art and the Museum of Modern Art, where he oversaw the brand-new Museum of Modern Art.“James has been an instrumental member of the staff and creative development for the Met since its inception in 1963, and has been instrumental in making", "The next Biennial should focus on the “intellectual and psychological life of the biennial,” said Pablo Maestas, the founder of the biennial. “The future of the biennial lies in the care and visualization of the work of the international artists in the exhibition, in the exhibition, and on the ground.”In a statement, the Biennale said: “We consider it a very positive step to be able to present the most important works of the five-hundredth anniversary of the Biennale, which will be dedicated to Pablo Picasso and the most outstanding contemporary artists. We hope that the exhibition will stimulate new understanding and appreciation of the great artists who have shaped the Biennale. We hope that the exhibition will be a great success, for the artists and the public, and for the Biennale. We consider the exhibition as an extension of the work of the Biennale.”\n\n\nThe Moore Museum of Art in Oklahoma City has appointed John Nolen as its next chief curator. Nolen will be based in New York and will begin his position in January 2021. He succeeds Elizabeth Silver, who has served at the museum since 1997. Silver departed in 2016 to head the Museum of", "The next Biennial should take place in 2020. In the meantime, the museum is planning to make some improvements to the building, including adding more flooring, installing more solar panels, and rehabilitating a long-abandoned gallery. The museum also told the Art Newspaper that it plans to hire an architect to design a new pavilion for the retrospective, which will be hosted by the Museo de Arte Contemporáneo Autónomo Latin America (MASALA), in 2022. The institution also hopes to have the new exhibition organized in collaboration with the Pilar Art Museum and the Institut National des Arts et Lettres (INLA), in the first half of the year. Artforum is offering its full support for the museum as it continues to recover from the pandemic. In a statement, editor-in-chief Peter Schäfer said: “We have seen a marked improvement in the past two months, but as usual this is not sufficient. We need a strong strategy and a plan in place for the long-term, and we have one for the exhibition.”\n\n\nThe Amsterdam Art Museum (BAM) announced today that it has received a gift of twenty-nine works from the Institute", "The next Biennial should set a new benchmark for what we can achieve with craft and what we can achieve through research and what we can achieve through collaboration,” said Tarek Anwar, chair of the festival’s governance committee and an adjunct faculty member at the School of Oriental and African Studies. “We are thrilled by the prospect of working with the British Museum, the Guggenheim, the National Museum of Art, and the National Gallery of Scotland to celebrate the life and work of Sylvia and Roberta Smith, and we look forward to working with the Royal Academy of Arts, the Royal Shakespeare Company, and the Royal Shakespeare Company to create new and exciting experiences.”\n\nThe Royal Academy of Arts (RA), London, has appointed Simon Taveras, its associate curator of modern and contemporary art, as its next director. He will take the helm from Deepa Brar, who has served as the academy’s director since 2017, and will assume his post in March 2020.“I am incredibly proud of the work he has done to make the RA a very important and influential contemporary art institution, and to build on the progress that has been made over the last decade,” said", "The next Biennial should take place in 2021.  The Japan-based nonprofit Artnet and Artforum has published five years of interviews with key members of the group, including Keiichiro Oda, who was the head of the museum when it was run by the HOGG Foundation, which is now defunct; Hiroshi Nakayama, the former chief curator of the Tokyo Metropolitan Museum of Art; and Tadao Ando, who was the director of the Tokyo Metropolitan Museum of Art and the creator of Otsu: The World of Tadao Ando. The exhibition will also feature work by the recently deceased Takashi Nagoya, the former director of the Tokyo Metropolitan Museum of Art, and two of the participants of the exhibition:   Haruna Yukawa and Yoshiko Sato.\n\n\nThe National Gallery of Art in Washington, DC, has answered more than five hundred inquiries about its new global digital platform, Artnews, and its upcoming inaugural event, Artforum in Manhattan, which will take place September 26–October 2. The debut event, which will be curated by Jonathan Klatt, has announced that it will present in-person events, including a group show, a special exhibition, and the", "The next Biennial should be held in the summer of 2025, and the 2020 theme should focus on the evolution of art and processes, with the museum linking the two.Audrey Burke, president and CEO of the museum, said: “This is an unprecedented year for museums and the city of Los Angeles and we are deeply grateful to our local, state, and federal governments, our trustees, and supporters, for their generosity in making this possible.”\n\n\nThe SculptureCenter at Duke University, in Durham, North Carolina, has received a $1 million donation from the Duke Foundation for the Arts. The gift includes $500,000 for the acquisition of David H. Koch’s famous “My Brother, My Brother,” a 2004 sculpture by the Austrian artist Wolfgang Lüscher that depicts three men, two of whom are wearing skullcaps, two of whom are wearing skulls, and a fifth figure that resembles a skull with a cane.In honor of the gift, the sculpture center will present an exhibition of David H. Koch’s sculptures in the summer of 2021. According to the New York Times, the Duke Foundation will also donate $500,000 to the university to set up a master’s degree", "The next Biennial should include the exhibition of the work “Metamorphose: Several Videos from the Works of A. S. G. Lendl,” which is currently on display at the Museum of Contemporary Art Philadelphia. “The new project of the Trans-Physics and Arts Museum (TPM) is a natural extension of the work of the previous curator, Ute Zahn, and his colleagues,” said curator and director Jin Kim. “The museum is laser-focused, in constant touch with the latest research and the spirit of the city that is Philadelphia. The new collection is ambitious and ambitious, and reflects the daring and creative spirit of TPM.”\n\n\nThe London-based arts organization the Arts International (A.I.) is launching a new fund to support smaller arts organizations in the UK impacted by the Covid-19 lockdown. It is offering to split 70 percent of the $600,000 fund with the City of London’s Department for Digital, Culture, Media and Sport (DCMS), and the remaining 40 percent with the London-based independent arts organization Artists’ Alliance. The organization will use the funds to create the “End Covid-19 Campaign", "The next Biennial should be organized in conjunction with the upcoming exhibition “Anothée et fabienne,” which will be held at the Museu de Arte Contemporain (MAS), Marseille, on February 22–March 5, 2020. For Museum Française, the Art of the Show, which consists of eleven exhibitions that are organized around themes such as the work of the artist and the artist-activists and the art of the laboratory, will take place in October 2020. The institution will stage its first event in the space in December 2020.\n\n\nThe National Galleries of Scotland closed its doors on Saturday, March 10, 2020, and is planning to reopen with new social distancing measures next month. The move was made in an attempt to contain the coronavirus and prevent the spread of Covid-19, a virus that causes severe illness.According to the National Union of Journalists, the reopening of the National Gallery of Scotland—which has been closed since January due to the coronavirus—would mean an estimated 3,800 jobs being lost. The institution, which had been planning to open on March 12, has been working with the arts and cultural sector to prepare for the coronavirus", "The next Biennial should be a global celebration of the life and work of the twentieth-century Indonesian writer Kato Jantjua, who will be presented with the award for his work 'Kato Jantjua: The Story of a Man' at the festival in February 2021. In recognition of the contribution to the art of the twenty-four-year-old artist, who died last year at the age of seventy-one, the award will be presented to the individual who is the closest in age and is the most representative of the twenty-four-year-old artist, who is also known as Kato Jantjua III.The Biennial will be housed in the museum’s building, which will be combined with that of the Art Museum Bali and the Art Museum Padang, in Jakarta, and will be inaugurated by an exhibition of Kato Jantjua’s drawings from the artist’s 1973 collection, titled “Kato Jantjua: The Story of a Man,” which will be on view until February 27. The exhibition will feature the work of Kato Jantjua and his colleagues, including Kato Jantjua’s son, Kato", "The next Biennial should take place in the first half of the year.\n\n\nThe Netherlands has revealed that it will offer $9 million in aid to help the country cope with the coronavirus. The sum will go toward transportation, housing, and utilities. The Dutch health authority, the Federal Office for Health Insurance, and the Dutch government came under intense pressure to step up efforts to contain the coronavirus, which has already claimed the lives of more than 11,000 people since it was first identified in Wuhan, China, in March.While the number of people infected with the virus has decreased since the outbreak began in Wuhan, the number of people who have died from the virus in the Netherlands has risen dramatically. An estimated 211 people have died from the virus in the country. The number of cases is expected to climb as more cases are confirmed.According to the New York Times, the number of people infected in the Netherlands is increasing—as many people are returning from trips to Poland, Belgium, and Italy after the coronavirus outbreak ended. According to the New York Times, cases in the Netherlands have been rising at a rate of one case every two weeks since the outbreak began. Dutch health officials said that six people", "The next Biennial should take place in 2020, and the show will return to Pittsburgh in 2021. \n\n\nThe Museum of the Fine Arts (MoFA) in Boston is planning to move forward with construction on its new $250 million Arts and Culture Center with no further notice until the new building receives the necessary permits. The move was made following a meeting with Governor Charlie Crist, the mayor of Boston, and the chairman of the Massachusetts Historic Preservation Commission (MHPC), which had previously voted to postpone its annual event until at least September.“At this early phase of the project, we are taking the necessary steps to ensure the timely and effective completion of the major portion of the project,” said David Johnson, chair of the Museum of Fine Arts’s board of trustees. The site for the new museum is a former industrial site in Dorchester. The $120 million center will include a 1,400-seat theater, a café, and a library. Located at the northeast corner of Boylston Street and Cambridge Street in Dorchester, the Arts and Culture Center will boast 2,500 square feet of exhibition space for the nonprofit organization, and will offer an outdoor terrace.The redevelopment of the former industrial site began in 2009 with the expansion", "The next Biennial should be held at least ten years after the first. The committee will consider the possibility of staging a biennial in 2020.\n\n\nThe New Museum in New York announced today that the institution will move its primary exhibition “The B-Side: B-Side: The Rise and Fall of Hip-Hop” from its current venue on West Twenty-Third Street to the Museum of Modern Art, where it will present a special exhibition of works from the collection. The exhibition is expected to draw between three hundred and five thousand visitors.The move follows a February 2018 announcement that the museum would no longer host its first exhibition “Hip-Hop: A History,” which was organized by the Performatives’ Union (PU) and the National Council on the Arts (NCA), the artists’ union representing the performing arts in the United States. The move was made in order to “implement changes at the museum that will strengthen the museum’s relationship with the communities it serves.” The announcement also stated that the museum would work with the PUL on two new partnerships and would collaborate with the NCA on a new programming and collection center.The April 2019 Artnews report revealed that", "The next Biennial should focus on the evolution and development of MFA’s visual arts programs and the exhibition program, with a particular attention to the acquisition of contemporary practice.”The twelve-month event will include the first exhibition devoted to the work of the artist-in-residence, “Jenny Phillips,” which will be curated by Jennifer Egan. A solo exhibition featuring works by the artist-in-residence is also being planned.\n\n\nThe Museum of Contemporary Art (MoCA) in New York is finally planning to unveil a new annual triennial of works by American painter Harry Callahan. The exhibition will open on January 7, 2020 and will feature four new works by the artist, whose work has been exhibited at the Whitney Museum of American Art, the Bridget Riley Collection, and the Los Angeles County Museum of Art.“The first exhibition will bring together work by the artist-in-residence, Harry Callahan, Jr., who currently resides in New York; his daughter, Lacey; and his son, Harry Callahan, Jr., who currently works in the West Coast,” the institution said in a statement. The exhibition is being organized by the Harry Callahan Foundation in honor of", "The next Biennial should take place in 2021. Last year, the organizers expressed interest in putting a film at the event, but it was not until this year, when the statue of Soviet dissident Klement Kalmyk, who was executed in 1937 for allegedly plotting the murder of former Minister of Education Leonid Mikhelson, was unveiled, that the Biennale was actually held. CinemaBaltica , a contemporary art center in London, was founded in 2012 as an extension of London’s Tate Modern, and the museum is planning to open a branch in the city. The museum has long argued that the fact that the Biennale is a “separate space” from the British Museum should not be a factor in the selection of the artist for the prize. It has also argued that the Museum of Modern Art and the Tate are not “separate institutions” and that the award should be made in recognition of their collaboration in promoting the exhibition, “The Consequences of Surrounding,” which premiered at the Biennale in Amsterdam last year.\n\n\nThe Swiss director, Marc Payot, has resigned from his post after a controversy sparked by a controversial retrospective of a cartoon", "The next Biennial should take place at the Museum of Modern Art, New York, in 2021.  The 2019 edition, titled “Toward a Cultural History of American Art,” was organized by a committee made up of Jean-Luc Beauvoir, Mira Dancy, and David H. Smith; Huston Bell; and artist and curator Zadie Smith.The 2022 edition, entitled “Toward a Cultural History of the Americas,” will be presented by a group of curators, journalists, writers, and scholars. The group will convene in the fall of 2020.“We are thrilled that this year will mark the hundredth anniversary of the opening of the biennial at the Museum of Modern Art, New York, and it will be our privilege to unveil the twenty-ninth edition of the National Museum of American Art, Washington, DC, in 2021,” said Andrew Schier, chair of the biennial team.\n\n\nItalian architect Paolo Gentiloni, who designed the Palazzo Nazionale di Venezia Giulia in Milan on behalf of the government of Italy, has been charged with fraud and embezzlement after the architect constructed and sold his own artworks,", "The next Biennial should be held in the year 2021. \n\n\nThe British artist and activist Cindy Sherman has been selected as the 2020 recipient of the prestigious PEN/American Foundation Art Award. The PEN/American Foundation Art Award is an annual grant totaling $25,000 that is given to an artist or activist for their \"transformative and urgent work.\" Sherman becomes the eleventh recipient of PEN/American Foundation Art and will receive a total of $105,000. The PEN’s commitment to promoting the artist and her work has been recognized by the PEN’s Endowment in the year of its awardee’s birth, August 4, 1958. “Cindy Sherman is an extraordinary artist whose work has been critically and practically influential across her various disciplines,” said PEN’s president and director, Elizabeth Bailey. “Her work has been collected by the Los Angeles County Museum of Art and the Los Angeles County Museum of Art’s collection, which includes work by Steve Walker, Loring Mitchell, Ray Eames, and Anthony Owens.”Sherman’s work has been exhibited at the Venice Biennale in 1988 and at the Venice Architecture", "The next Biennial should be in October 2020.\n\n\nBritish artist Sue Aitchison has been named the 2020 winner of the Prix de l'Art, a prestigious award that honors excellence in the performance of art in the exhibition. She was chosen by an international jury that included Jane Panetta, director of the Tate Britain; Richard Avedon, director of Tate Europe and the Coachella Valley; Laura McKenzie, director of the National Arts Centre; and Mark Lammers, chair of the jury. For the prize, which is given annually, the artist is nominated by a jury consisting of artist, curator, educator, writer, and musician.Aitchison is one of a growing number of British artists nominated to the prestigious prize. Since its inception in 1978, the Prix de l'Art has awarded over $10 million to fifty-three British artists. In 2014, the award was given to David Adjay for his solo exhibition at Tate Britain. Aitchison, who has lived and worked in the French city of Strasbourg for twenty-five years, was nominated for this year’s prize by a jury comprising Peter Hammer, director of Tate Britain; David Parr, director of Tate France; Jodie Evans, curator at Tate Britain;", "The next Biennial should also include a presentation of the work of the artist and scholar Anais Nin, who is known for her “Venice ” series, which combines film, sculpture, installation, performance, and installation art. Nin has recently been selected as the winner of this year’s Venice Biennale. She will be given a solo exhibition at the Biennale, which will kick off on March 8, 2020, and will be presented with a bronze statue at the Venice Architecture Biennale, which will kick off on May 24, 2020. The next Venice Architecture Biennale will be held in 2022.\n\n\nThe European Parliament voted last week to authorize the United Kingdom to leave the European Union, a decision that has been opposed by the British government and leading politicians in the United States and the United Kingdom. The legislation that was passed by the European Parliament, the European Council, and the European Commission requires the UK to formally withdraw from the European Union by March 23, in order to avoid a formal formal Brexit, and authorizes the UK government to begin the formal process of withdrawing from the EU by March 29.The bill states that the UK “must refrain from making any new commitments in relation to the EU outside of", "The next Biennial should showcase a selection of the work of artists participating in the next edition of the Edinburgh Biennial, taking place in September 2020. The theme of the exhibition is “Art and the Age of Empire.”\n\nThe Metropolitan Museum of Art in New York has appointed Patrick Frank, the director of the Modern Art Museum Miami, as the new interim director of the Metropolitan Museum of Art. Frank will take the helm of the museum when the Met reopens in the fall of 2020. The museum will be rebranded the Metropole, and will undergo a $2 million renovation.“Patrick has been instrumental in shaping the Met’s trajectory as a leading arts institution in the United States and has built a strong reputation for his talent and commitment for bringing important exhibitions and projects to New York City in his role as director,” said museum director Bruce M. Miller. “The Met is now poised to realize its ambitious goals for a new century and for the Met Gallery. He is a talented and dedicated leader who has demonstrated an ability to develop and execute creative and historic works that sets him and the Met apart from the rest of the field.”During his tenure at the museum, Frank spearheaded the acquisition of more than 1", "The next Biennial should be held in 2020. The event, titled “The Future Is Present,” will be hosted by the Public Theater in New York. The twenty-second edition of the biennial will be held in 2022. The 2020 edition was staged by the New York–based groupÂ the New Artists’ Theater.\n\n\nThe Institute of Contemporary Art (ICA) in San Francisco has received a gift of thirty-six works by artists including Luke Turner, Leslie Cast�s ​Eleanor Gardiner, and Harry Callahan. The gift is worth an estimated $18,500 and is the largest donation ever made to the institution.The donation was made during a successful year for the ICA, which saw its attendance and revenue skyrocket during the height of the AIDS crisis. The museum also experienced a significant boost in membership following the reopening of its new building, which was completed in 2016, but construction was stalled because of the Covid-19 pandemic.The organization announced on Tuesday that it is now committed to rebuilding the ICA’s building and renovating the museum, which is currently home to the Stanley and Tracy Adelstein Collection and the Howard Gallery of American Art. The renovation will include the restoration of the Adel", "The next Biennial should be held in 2021. The biennial will be based in Barcelona, Spain, where it will take place between March 13 and March 16. “This year’s Biennial offers an opportunity to reflect on the legacy of the artist, and to reimagine how art can produce experiences of reconciliation and empathy,” said Joaquim Barbosa, the president of the Barcelona Foundation. The work of the exhibition will be curated by Murillo Pérez, the director of the Palacio de Artes Modernas in Barcelona; Carles Lalas, the director of the Museo de Arte de Barcelona; and the artist, who will receive an award valued at $10,000. Barbosa added: “I’m looking forward to furthering the theme of ‘relationships’ through my sculpture, which explores the possibility of building bridges between cultures, communities, and nations, which will be a part of the exhibition.”The biennial will be hosted at the Catalan Ministry of Culture from March 16 to March 20 and will take place in the Catalan town of Serra da Princesa in the province of Santa Cruz. It will also be staged in two other locations in the", "The next Biennial should take place in 2019. The biennial will feature works by twenty-eight artists who have died since the 1950s. For the first time, the biennial will be centered around a museum’s collection. “The exhibition will provide a rare opportunity to witness the finest contemporary artists’ work in Europe, and to represent the Biennale in a new and exciting way,” said Valentin Delahora, the international director of the Museu de Arte de São Paulo (MASP).\n\n\nThe New York City Council approved on Wednesday an overhaul of the city’s capital budget, proposing $1.35 billion for the 2020 fiscal year, a $300 million cut from the $2.1 trillion enacted by Mayor Bill de Blasio in 2017. The budget would also eliminate more than one hundred city-owned positions, including the police, fire, and health departments.“While the mayor has proposed significant savings in key spending areas, the proposed cuts make clear the critical need for new revenue sources,” Council Speaker Christine Quinn said in a statement. “The police and fire departments are already facing significant cuts, and the Department of Buildings and Public Health already anticipates a $", "The next Biennial should be held in 2022, the report said. The event would also feature works by artists from the Philippines, Cambodia, Cambodia-Kampuchea, Vietnam, Cambodia-Myanmar, Laos, Cambodia-Tibet, and Cambodia-Guangdong.\n\n\nThe Chicago-based nonprofit Artadia has named Katy Crow as its next executive director. Crow comes to the nonprofit from the Los Angeles County Museum of Art (LACMA), where she has served as director since 2013. Previously, she was the director of the California Institute of Technology’s Art Museum. Crow will assume her new post in April.“Katy’s cultural leadership, vision, and energy are essential to LA’s future, and LA’s future is vital for LA,” said LA’s mayor, Mitch Landrieu. “Katy’s devotion to making the best use of LACMA’s unique assets and transforming the museum into a beacon of creativity and creative engagement for the greater Bay Area has been legendary. She is an inspiration to every one of us and will continue to shape the LACMA mission, as we rebuild and reimagine what it means to be a cultural", "The next Biennial should be held in 2021 and should be the culmination of a five-year project by artist and curator Kunsthal Aarhus, which encompassed research, exhibitions, residencies, and a public event series. A version of the show is currently staged at the Royal Academy of Arts in London.\n\n\nMarlene Guggenheim, the New York–based contemporary art curator and owner of the Guggenheim Museum in New York, has been named the winner of the 2019 James C. Nordberg Prize for her recent exhibition “The Best and the Brightest: Representations,” which was curated and organized by Kristjanne B. and Adam W. Armstrong, among others. The award is one of the most prestigious trophies in the United States for a contemporary artist. The other recipients of the honor are Benjamin Braddock, Kirsten Kukkonen, Milton Leibovici, and Daniel Polansky. The jurying panel was made up of Michael Kimmel, Laura Moyer, and Justin Lin.“Guggenheim’s art has always reflected and explored the crosscurrents of memory, and her remarkable career trajectory reflects the changing art and creative landscape of the", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it is collaborating with the Museum of Contemporary Art (LA) to launch a new digital platform that will allow visitors to view the work of thirty-seven artists currently on display in its collection. The platform will be launched in conjunction with the museum’s upcoming exhibition “A Conversation,” which will open on October 2.“Over the last three decades, MoCA has been committed to the collection of the most important contemporary artists of the Pacific Northwest,” said Helen Breslauer, director and CEO of the Museum of Contemporary Art. “The Biennial will allow us to continue to enjoy the extraordinary artworks of these remarkable artists and to serve as a model for how a museum can engage with the world.”The thirty-six artists featured in the exhibition will be announced soon and will be able to begin their work on the platform in early 2020.\n\n\nArtist and publisher Anish Kapoor has announced that he is leaving Disney to establish the new nonprofit Anish Kapoor Foundation to advance his art. The organization will concentrate on projects that will benefit people, such as education and the arts,", "The next Biennial should take place in the spring of 2020. The date of the museum and the date of the exhibition will remain the same.\n\n\nThe Bachelet-Titové paintings will be on display at the museum for the first time in the capital of the Brazilian state of Para. The three-hundred-year-old gallery has been closed since December 13 due to the Covid-19 pandemic. The institution has been forced to move the works, whose fragile condition has been made worse by the ongoing construction of a major renovation project to the building, from the northern part of the site, which is currently home to the gallery, to the capital. The Solomon R. Guggenheim Museum has also revised its calendar. Previously, the exhibition, titled “La Prescriptiona” (The Prescription of a Painting), would have opened on March 18 and ran simultaneously with the opening of the museum. “We are in the process of refreshing our calendar and rethinking the exhibition,” Bachelet told the Art Newspaper. “We are always evaluating how to enhance the exhibition, and for its future.”\n\n\nThe Art Newspaper reports that the Metropolitan Museum of Art in New", "The next Biennial should be held in 2021. The inaugural edition was held in 2021. The new venue will be designed by Art Museum Houston and will draw from the city’s existing collection and will feature works by eighty artists. The theme this year: “Peace and Justice.”  The event will be hosted by the Peggy Guggenheim Foundation and the Walt Disney Company, the City of Houston, and the Ruth R. Marder Foundation.Other cities and counties that have staged biennials before are New York, San Francisco, Seattle, and Los Angeles.\n\n\nThe Getty Center in Los Angeles announced today that it has appointed Claire Runyon as its next executive director. She succeeds Amy Sherald, who departed the institution on June 6 to become the new director of the Arizona Museum of Art, and will begin in her new role on July 1.“Claire brings a wealth of experience in the field of art and demonstrates an enthusiasm for the work of artists and institutions across the country,” said “Amy. She will be instrumental in helping the Getty become a stronger, more vibrant, and more vibrant institution that will continue to thrive as a model for other institutions.”During her tenure at the", "The next Biennial should be held in 2021. \n\n\nThe Supreme Court in the United Kingdom has ruled that a British artist who was convicted of making a work that used a piece of public art to illustrate a human rights violation must pay a fine of $3,000 for creating a unique work that was not at least five years old and did not have the authorization of a local authority or an official when it was made.The court found that the mural, entitled Dream Land, that was installed in the town of Rotherham, England, in 2011, was in fact made by the artist in a public space and did not violate the Public Health (Scotland) Act, which deals with environmental health and public order. However, the court found that the work was at least five years old and that the artist had not taken reasonable steps to verify its age or determine whether it was the work of the artist or of a third party.The court also found that the Rotherham Council made an error in applying the law to the work, and that the council failed to prove that the mural was made by the artist or any one of them. However, the court ruled that the council could prove that the work was made by one of the scumbags", "The next Biennial should be held at least once every two years. The next iteration of the Mason-Dixon is slated to be held in 2022. \n\n\nThe family of convicted murderer and sex offender Michael Slager, the North Charleston, South Carolina, officer who killed Eric Garner and put his hands on Garner as he breathed his last, has filed a wrongful death lawsuit against the city of Charleston. According to the New York Times, the lawsuit accuses the police of violating Garner’s civil rights by detaining him in a waist-deep pool of blood for hours without provocation, then lying about how they responded to Garner’s death.The lawsuit claims the police violated their constitutional rights to due process and to an impartial jury by withholding evidence that might have cleared Slager of any wrongdoing. It also claims the police violated Garner’s civil rights by failing to properly label the drug as a “combative narcotic,” a “dangerous and inebriated person,” and a “drug abuser.”The lawsuit accuses the city of violating Garner’s constitutional rights by failing to prepare for a trial and by failing to address the aftermath of Garner’s death. It also accuses the city of", "The next Biennial should be on the occasion of the centenary of the birth of the founder of our city of New York, Benjamin Franklin. “We must make the greatest possible use of our artistic bounty to help to make the most of our time,” said biennial director Patricia Reisman. “I look forward to continuing to work with the Selby family and the amazing curators at the Biennial to continue to present the extraordinary work of our artists, to expand the field of curating in New York City and to create an outstanding exhibition for the new year.”\n\n\nNew York’s Metropolitan Museum of Art (MoMA) has removed a set of drawings by American painter William Kentridge in an exhibition that examined how the state of the art of watercolor came to be. The painting, which was part of an exhibition titled “Like Water,” in 1984, was part of the exhibition “The Camera in the Studio.” Kentridge’s work, which is featured in the exhibition, is one of a number of works that challenged the notion of the camera in the studio. “The camera in the studio is an experiment in the avant-garde,” Kent", "The next Biennial should be set up in 2020. \n\n\nThe National Galleries of Scotland are planning to reopen in the spring of 2021, following a £1.5 million ($1.8 million) expansion, the Art Newspaper reports. The announcement follows the coronavirus outbreak—in the UK, the number of cases has risen to 983—and the coronavirus outbreak in China, where the number of reported cases has more than quadrupled to 907.A Scotland Yard spokesperson said: “We are not able to comment or comment on the ongoing investigation into the coronavirus.” The National Gallery of Canada has also yet to confirm or deny that it is facing any new cases. The Royal College of Art in London, which is closed until March 22, reopened on Friday, March 11, following a two-week-long reopening.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced this month that it plans to open in the summer of 2021. The spring opening follows the completion of a $1.9 billion expansion that added galleries, classrooms, a performance space, and a public green space—the Museum of Fine Arts (MFA)’s new home for African art—in the", "The next Biennial should be held in 2022. The event will be hosted by the Smithsonian American Art Museum (SAAM), which is currently working on a design for the new venue, and will be co-organized by the Seattle Art Museum and the University of Washington.  The event will be curated by Richard Mayhew, curator of works by the American painter Lee Tinguely and the UK’s Graham Linehan. The institution is accepting donations of works by twenty-six artists in an effort to raise $50,000 for the museum. Sophie Alpert, the director of the Institute of International Visual Arts at the University of Pennsylvania, said: “We at the Noguchi Museum are thrilled that we are able to bring together around the country the talents of these artists and their work in their entirety. The exhibition will open to the public on September 22 and runs through the end of September. We are reaching out to all of our audiences to see what they think about the exhibition and how it may enhance their experience of the Noguchi Collection.”\n\n\nThe Museum of Fine Arts (MFA) in Boston, which has been closed since March due to the Covid-19 pandemic, has appointed", "The next Biennial should be held in 2020, the date of the sixtieth anniversary of the publication of the German-born artist Daniil Milovska’s first exhibition in the United States, “Sylvia’s Body: A Biennial,” which was held in New York in 1979. They will then present the first Biennial of Contemporary Art in Beijing in 2021, and the first in Shanghai in 2022. Mainichi Art Museum (the annual Japanese art fair) has announced its 2020 schedule, which will include two shows dedicated to American art, “Alberto Burri: The American Dream” and “Alberto Burri: The American Experience,” in April and May. “Alberto Burri: The American Dream” will be on March 30; “Alberto Burri: The American Experience” will be on March 28–March 31. The 2020 festival will be organized as part of the Japanese government’s promotion of Burri’s work in the country. It will be held at the National Museum of Art, Kyoto, from March 22 to March 29. The 2019 edition of the event, “Art in the City,�", "The next Biennial should take place in 2020, and the 2019 version was held in the spring of 2021. The exhibition will examine the enduring influence of the early twentieth century on contemporary art, and will celebrate the life and work of the late artist. Among the artists whose works will be on view are the late French sculptor Jean-Michel Basquiat, whose monumental Drawing in Red (1949) is currently on display at the Museum of Arts and Design (MoAD); Kiki Smith, a renowned Native American artist whose work is currently on display at the Smithsonian American Art Museum; and Carlos-Josef Klimt, a well-known artist and prolific knitter whose work is currently on view in the Museum of Modern Art.The full list of artists who will participate in the 2019 biennial is as follows:Jean-Michel BasquiatJean-Michel Basquiat, Drawing in Red (1949)Anton Kern, Color Me (2019)Natalie Cammock, The War Paintings of John Waters (2019)Alfred Lyng, Golden Waters (2019)Carmen Juan vs, The Promise of Eros (2019)Julia Langer, The Fall of the Sun (2019)Cornelia M", "The next Biennial should be held in 2020, said Ma, adding that the project has been in the works for several years and that the 2020 edition will feature new works by the five founding members and a new artist.While the inaugural event in Geneva in 2017 was attended by more than 150 artists, the 2019 edition, held in New York, received just eighty-six entries and featured work by around forty artists. The 2019 edition, titled The Work Is Written, was organized by the same artists and featured a collection of original works that explore the notion of written expression.In an interview with Artforum last year, Ma said that she hoped the 2019 edition would prove an inspiration in its own right and that she hoped the theme would continue to be relevant in the future. \n\n\nThe Metropolitan Museum of Art (MoA) in New York has released the results of its inaugural survey of the careers of twenty-seven artists in an effort to better understand the field of performance art. The survey, titled Art: A Career Survey, analyzes the careers of twenty-seven artists and their artworks through a hybrid of historical scholarship and linguistic analysis. The survey was commissioned by MoA and the Museum of the Moving Image in partnership with the performance", "The next Biennial should open in 2020. The date was set in consultation with the city of New Orleans, which is currently slated to reopen in March of 2021. In a statement, the city said that it is “excited by the prospect of creating the perfect environment for the next generation of artists to engage with the world.”\n\n\nThe Shenzhen Biennale, a Chinese-led initiative that aims to bring together up-and-coming artists from China and the United States, has announced that it is preparing to suspend exhibitions, events, and events in the region until March 15. The announcement follows a series of setbacks for the event, which was launched in 2015 by local organizers in Shenzhen, a city located in the Guangdong province of Guangdong China, with the support of major Chinese arts organizations such as the National Museum of China and the National Museum of African Art in Beijing. “It has been a rough year,” said the organizer, who did not want to be named. “We have affected our exhibitions, our events, and our staff, but we are determined to push on through this. We know that many are feeling the impact and many are realizing that this is the beginning of a difficult time", "The next Biennial should be in 2021.  A selection of works curated by Gholi and other young South Asian artists will also be staged in 2022. The next edition of the Biennial aims to address the current state of South Asian art in India and Bangladesh. The Biennial will also introduce a new platform, the South Asian Media Award, that will give cash prizes to emerging South Asian-American artists. The Biennial will be hosted by the Biennale Research Center, the University of Michigan, and the Arts Archive, the San Francisco Museum of Modern Art. “The project of the summer of 2022 is to create a new form of engagement between the city and the Biennial,” said Hannah, who is also the inaugural curator of the upcoming exhibition “The Body in Winter: South Asian Art and the Struggle for Civil Rights” at the South Asian Museum, Aligarh, in a statement. The biennial will also engage with South Asian art in an effort to address the South Asian diaspora in the United States and to promote South Asian art in the United States. The aim is to create a dialogue between the artist and the city. Over the course of the summer", "The next Biennial should be held in 2019. The 2018 and 2018/2019 editions were held at the Muse, and both events were attended by a large audience. The 2018 edition, which was held at the National Gallery of Art in Washington, DC, drew a crowd of 116,000 people. The biennial was supported by a $50 million donation from the Philip Klein Foundation and the Eliot and Edith Ford Foundation. \n\n\nThe Economic and Social Research Council (ESRC ) in London has released the results of its new research into the economic and social impact of the Covid-19 pandemic. The study—which found that a total of $5.7 billion will be spent by the United Kingdom on health and social care in 2020—is based on a survey of the economic and social needs of the rural and urban poor.The study, which also identified 44 priorities for policy makers, including the environment and housing, found that 3.9 billion people around the world—or 44 percent of the global population—suffering from one of the following five main challenges: · hunger,· homelessness,· homelessness-related health problems, and· deprivation. The findings are based on data from the Economic Census, a quarterly survey of households conducted", "The next Biennial should be in September 2020.\n\n\nThe Philbrook Foundation, an organization that provides support for emerging artists and arts professionals in New York City, has awarded $3.5 million in grants to more than fifty artists as part of its funding drive. Among the recipients are Sharon King (New York), KIRILL KOCHOV (New York), Beth Bradley (New York), Karen Peiks (New York), Timur K. Chesto (New York), Lia Fan (New York), Erica Hanscom (New York), Lise Sutch (New York), Andrea Mitchell (New York), Alexa Pape (New York), Sam Williams (New York), Merry Norris (New York), and Sara Zahn (New York).The Philbrook Foundation also revealed that it will distribute $2.25 million in grants to arts professionals in New York City. The funds will go to individuals, organizations, or foundations who have demonstrated significant financial need in the city. In addition, the foundation will establish a museum of the American West as a final destination for artists whose work has been exhibited or published in the last five years.", "The next Biennial should take place at the National Museum of Modern Art, in Washington, DC, in 2021.  If the museum holds its promise, the next will take place at the Smithsonian American Art Museum, in Washington, DC, in 2021.  I suspect we will see significant changes in the next decade, and the next decade will likely exceed the previous decade.  If people want to engage with the history of modern art from the perspective of the Americas, with an eye toward the future, then we will need the United States to play a significant role in that process.  Art is about more than just the past. It is also about the future. This is not a time to restructure the past, but rather, to imagine the future.  The future of art and the United States is at stake.  This commentary first appeared in the February 2017 issue of Artforum. \n\n\nThe Museum of Modern Art (MoMA) in New York has received a major gift of more than 1,600 works by the influential German Expressionist and painter Thomas Mielke, who in 1944 was transferred to the institution from the Nazi concentration camp at Bergen-Belsen. The gift includes works by artists from South America", "The next Biennial should be on October 3, 2020. Titled The Labor of Destruction: The Politics of Matter, the exhibition will feature work by seventy-six artists\u0097from the United States and the United Kingdom to Italy, Mexico, and Cuba\u0097and will run as part of the body’s relationship with the central government of Qatar in Qatar, the United Arab Emirates. The partnership means that the exhibition will be inaugurated by a Qatari artist, who will travel to Paris to launch a new festival, and inaugurated by a Qatari artist will appear in a new video performance by the artist.In addition, the biennial will draw from the biennial’s collection of works by twenty-six artists, including Yoani Abdullah, Tahira, Lizzie Borden, Cindy Sherman, and Katherine Nash. The exhibition will also include a virtual reality exhibition and meet-and-greet for visitors to the museum, augmented reality content, and interactive performances.One of the highlights of the exhibition will be a project by Garde Pivar, a French artist whose work is based on the concept of a cadaver and a corpse, to recreate the final moments of a young Palestinian woman", "The next Biennial should take place in the spring of 2021. The interim exhibition will return to the Museum of Contemporary Art (MoCA) in New York from March 22 to March 29. \n\n\nThe Oakland Museum of California (OMC) has appointed Iñigo Roca, the director and CEO of the Seattle Art Museum, as its next director. Roca will assume his responsibilities in January 2020. During his tenure at the Seattle Art Museum, Roca helped the museum create and deliver the city’s first-ever 'museum of service' in the downtown core, which opened to the public in 2018, and oversaw a three-year-long fundraising campaign that brought the institution’s endowment to more than $100 million.“Iñigo Roca has been an essential partner and supporter of the OMC for nearly five years. His work has shaped the museum’s long-term vision for the museum, and as I’ve said, his energy and enthusiasm and commitment to art and artmaking is legendary,” said Bob Dunn, the OMC’s board president. “It’s a great honor to welcome Iñigo to the OMC family. I’m excited", "The next Biennial should be held in 2020, and the first in 2021. For the museum’s first year of operation, the museum will take the form of a five-story, glass-enclosed edifice built into the campus of the University of San Diego. The new museum will boast fifteen galleries and a public courtyard with a café and a restaurant.The San Diego Museum of Art (SDMoA) has named John E. Williams as its next director. He succeeds David Schroth, who retired in December 2019 after twenty-five years at the helm of the institution. Williams joins SDMoA from the Museum of Contemporary Art (MoCA), where he has been the director of development since 2008. “With our newly created role, we are exploring new possibilities in how we can support contemporary art and how it can be experienced by a wide and diverse public,” said SDMoA director Rachel St. Louis. “John’s vision to create a community space and an institution to house and display the collection of the San Diego Museum of Art and the San Diego City College Museum of Art is a compelling example for how to engage the public and enhance their experience of San Diego’s art.”During", "The next Biennial should take place at the Museum of Modern Art, Abu Dhabi, in 2021; the forty-seventh Art London Biennial is currently on-going; and the forty-ninth will be held in 2022. The 2020 edition of Art London, titled Art for a Better Future, will also draw on the themes of sustainability and climate change.According to the exhibition’s director, Richard Stearns, the show will take its inspiration from the work of post-war artists such as Alfred Sisley and Zora Neale Hurston, while incorporating contemporary concepts such as the exhibition of works by artists such as Louise Bourgeois, Carolee Schneemann, and Barnaby Edwards. Art for a Better Future will tour the exhibition and will present the works of fifteen contemporary artists, including Adria and David Hockney, Rosalind Franklin, Edward Kray, and Rufus D. James, and the first online viewing of the show.“Our aim is to create a space for a new kind of exhibition that is not a catalogue of works but a space for the exhibition of the work of the artist, with a view of the work, of the exhibition, of the exhibition", "The next Biennial should take place in 2020. The venue for the first edition of the exhibition is to be decided by the Metropolitan Museum of Art in New York. The Metropolitan Museum of Art has moved the first time the exhibition has been staged to the Bronx, and is currently constructing the second Biennial in the Bronx. The inaugural exhibition, “Tacita Dean: A Futurist Present” (2017), featured paintings by the artist in her studio in the Bronx and at her home in Harlem. It was curated by Richard Goldman, the executive director of the Whitney Museum of American Art, and Marc Glimcher, the curator of the 1960 Venice Biennale. The exhibition was chosen as the theme of the 2020 edition of the biennial by the Biennial Council, led by José Manuel César Ferrer, the president of the Metropolitan Museum of Art. Previous versions of the event have been curated by Daniel Quinn, the director of the Museum of Contemporary Art in New York, and Nicholas Chinn, the director of the Contemporary Art Museum in Chicago.\n\n\nThe second edition of the Fifty-Ninth Venice Architecture Biennial, curated by Ligia Cicutto, was held at the Venice Architecture Biennale in January", "The next Biennial should take place in the spring of 2020. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that Ita Ngwenya has been tapped to represent Kenya at the Fifty-Ninth Venice Biennale in 2019. He succeeds Jim James, who was tapped to represent Kenya in 2016, and will receive a commission from MoCA to create a new work for the event.“I’m thrilled to be bringing my expertise and creativity to MoCA to create a new piece for the Venice Biennale,” Ngwenya said in a statement. “The theme of the exhibition is ‘Resilience,’ and certainly the fact that there are so many survivors of violence against them in our society. I hope my work will address this by exploring the different ways of dealing with trauma and trauma-based violence and also in the art that is related to that.”The commission is part of the second phase of the institution’s renovation project, which is currently underway, and will involve the installation of a new work by Ngwenya and a new performance by the partnership between the institution and Shoshana and the organization Movement of the Body, which aims to promote dialogue", "The next Biennial should be in 2020. The exhibition is based on the idea that art can play a critical role in promoting social change. The International Biennial is a model for how art can be a catalyst for social change and a source of inspiration for those who want to change their lives. We at the Royal Academy of Arts believe that the best solution to the climate emergency is to reduce our carbon footprint with the use of art. The authority will be chaired by Sir Andrew Smith, chairman of Tate Britain and the Royal Academy of Arts.  Sir Peter Morrison, director of the Centre for Contemporary Art (CCA), London, and the Museum of London, is also a trustee.  The CCA is a free, contemporary arts space that enables visitors to experience and showcase contemporary art in a formal, intimate setting. It is a platform for artists and curators from around the world to collaborate and share ideas and experience. The art biennials will be staged at the central CCA location, in central London, and will be led by Sir David Attenborough, director of the British Antarctic Survey. The CCA’s most recent exhibition, “We Are All in This Together,” was staged on January 5–", "The next Biennial should be a celebration of the life and work of the great artist-philosopher Ima-Malick, whose research and scholarship has given us new and profound insights into the nature of the Earth, water, and cosmos.” The next edition of the Biennial is slated for 2020.\n\n\nThe Berliner Kunstverein (BKA) has announced that the first edition of the Berlin Art Week will be held in the city from September 5 to September 8. The event, which will organize and showcase more than 1,500 works by seventy-five artists, will be led by Joachim Neugroschel, the curator of contemporary art at the University of Applied Arts Vienna, and will feature more than 90 installations by thirty-eight artists. The show will also feature the first-ever European sculpture show in Paris and the first-ever film show in London.Last year, the BKA Berliner Kunstverein hosted the exhibition “Ishikawa: Nikkumi.” The show, which featured the work of fifty-eight artists and was organized by the BKA in partnership with the Museum Ruhema in New York, was a collaboration between artist and the BKA. The exhibition was inspired", "The next Biennial should be held in 2020.\n\n\nThe vast collection of art in the Louvre, stemming from the institution’s initial acquisitions in the late 1960s and early 1970s, is to be auctioned by Christie’s. Titled “The Magician and the Thief,” the work is an early example of the Degas-Teller effect, a French-born, Paul Gauguin-inspired technique of painting typically associated with the artist after whom the work is named. The collected works are to be auctioned at Christie’s New York City–based auction house Bidders Gallery, which is handling the sale, in the spring.“The collection is extraordinary and offers an outstanding selection of works by celebrated artists who have lived or died in profound and varied ways,” said James Plunkett, the auction house’s director. The Degas-Teller effect, which originated in the United States, is based on the notion that the best-known figures of a given era are often those most closely associated with the art of that era. The effect has been observed in many other arts and has been found in other cultures as well. Among the works selected for the auction are", "The next Biennial should be held sometime in 2020. The core of the project will be a new exhibition “On the Architecture of Life,” which will focus on the interrelationships between architecture, life, and nature. A biennial is a collection of works commissioned by the artist for a single exhibition. In the current iteration, the biennial received $36 million in funding from the National Endowment for the Arts (NEA), the Smithsonian American Art Museum (SAAM), and the Stephen F. Austin Museum of Art. “In the new version of the biennial, we have created a plan that empowers local, regional, and national arts institutions to build upon the experiences and insights of their local communities,” said biennial director, Emma Atkins. “Our artists are given the ability to reinstall works across a vast and diverse network of galleries and archives across the United States. This platform for sharing experiences and establishing connections allows us to imagine and explore a more meaningful future for art, architecture, and architecture.”The platform will also include new public programming that will address themes of the exhibition, such as the relationship between artists and their environments and the history of the exhibition. The new biennial will be a collaborative project", "The next Biennial should, according to the commission, be held at a location other than the museum’s current location in the Arts and Culture Center. The biennial will also include a demonstration of a new collaboration between the museum and the MIT Technology & Society Initiative (ITI), an initiative that aims to prepare artists for the museum’s permanent collection.“I’m excited to help make the 2020 Biennial a reality by planning a biennial that engages with the community and not only the museum,” said Larry Fink, chair of the collection and exhibition department at the Museum. “The exhibition will be a reflection of the principles of the exhibition, which are to embed artist-led work within a culture and to engage with the collection as a whole.” Museum director Henry Luce also praised the commission’s artists: Cindy Sherman-Goldin, Natalie McCarthy, Sarah Sze, and Anna Zavits. They will each receive a commission. The twenty-fourth edition of the Biennale will be held at the Museum of Contemporary Art, Los Angeles (LA) from March 7 to March 10, 2020.\n\n\nIn the aftermath of a deadly shooting in Dallas", "The next Biennial should be held sometime in 2021.”Since its inception in 1996, the event has been centered around artist-built communities in a series of cities throughout Italy, such as Venice, Turin, and Rome, which have been cofounded by a single artist, Piero Manzoni, and his wife, Silvia. The event was initially hosted by the Lampedusa School of Art, the Institut Polytechnique, and the Musée Pompidou, but in 2005, the school announced that it was discontinuing the event and moved it to the Museo Biennale di Scuola , which had been established in 1999.For the museum, which has a permanent collection of more than 1,000 works, the move was a “great success.” The school’s director, Enrico Battista, added: “The museum is completely satisfied with the new venue where both our art and interior projects will be developed and presented in harmony with the visitors. I am especially delighted with the collaboration between Giacomo and Silvia, who have spent years cultivating this relationship. The result is a collection of works whose power and clarity will stand apart from the rest and ever become a monument for the vision", "The next Biennial should be on January 28–March 3, 2021.\n\n\nThe Architectural Record announced today that Valentina Zajac has won its 2019 edition, which takes place in Milan, Italy. The sixteen-year-old Czech artist, who studied at the prestigious Academy of Fine Arts in Prague, received the award for outstanding achievement in the field of architecture at the annual awards ceremony at the Palazzo Reale.Zajac, who is based in New York, returns to the academy for the fourth time this year, this time as a visiting artist-in-residence. She is currently featured in the exhibition “The Future Is Not Present: Art and the Ordinary in Architecture” (2018–19), as well as “The Hackers Gallery: An American Odyssey” (2018–19), “Art and Architecture” (2017), and “The Future Is Not Present: Contemporary Art in New York” (2017). In addition to her work at the museum, Zajac is a faculty member at the school of architecture at the Art Institute of Chicago. Zajac is also a member of the Prague Architecture Foundation and the Architecture Biennale.\n\n\nThe Walt Whitman Foundation in New", "The next Biennial should be set up at the village hall on March 8, 2020 and will be open to the public from March 12 to March 16. The museum will be sharing the exhibition space with the Samblich Concert Club for its twenty-fifth edition, which will also be held at the village hall. The renovation and conservation project, which is being financed with a loan from the Saar-Stiftung für und Sport, was inspired by the construction of the new museum in an area of the former dairy factory. The new structure will include a new gallery, a cafeteria, a library, a collection of museum collections, and the new museum hall. The new structure will also include a public corridor that will connect the city to the old factory. The complex will offer visitors an opportunity to visit the former land-based plant in a number of new ways. It will also boast new galleries, educational spaces, a new café, a new concert venue, and an outdoor terrace.The renovation work, which was completed in partnership with the State of Hesse, started in February 2019 and was completed in March 2020. The renovation included the construction of a new security system, the installation of a new public hall, a new cultural amphitheatre, and", "The next Biennial should be held, and the date should be set, as soon as possible, so that the exhibition can be completed before the new year, which is expected to begin on March 23, 2020.The programme will include the restoration of the Kunsthaus Bremen in the Netherlands and the exhibition of the work of the artist Laura Poitras. The Kunsthaus Bremen will be inhabited by the artist and Italian designer Mario Tuzotti, who will create a new facade for the museum, named after the artist. The Kunsthaus will also feature a miniature and performance space designed by the designer with the help of local architect Christian Giedd.  \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed David McAllister as its next executive director. He succeeds Cindy Sherman, who departed in the spring of 2020 to head the Phoenix Art Museum, and will take up the post on March 1.“David is one of the most respected and talented people in contemporary art,” said John Thompson, the board president and CEO of the museum. “He has been instrumental in transforming MoMA into the museum it is today and has helped shape its future plans and trajectory. He is highly respected across", "The next Biennial should focus on the social, political, and cultural impact of the Black Lives Matter movement, according to organizers.“Following the dismantling of the P.A.W.C. in New York City last year, we decided that it was time to focus our attention to the biennial’s own history to try to understand how it came into being, and what contributed to its eventual collapse,” said Paul Mpagi Sepuya, president and CEO of the Trevor Project; John McAllister, chief curator of the Museum of Modern Art; and Sharon Mitchell, the former director of the Whitney Museum of American Art. “With that in mind, we have begun rethinking the history of this exhibition and the biennial as we see it now.”Further reading: Artforum. Artforum is partnering with the Black Arts Alliance to run an online edition of the March 2019 edition of Artforum. The first online edition of the event will be live on March 8. The February and March editions of Artforum will not be affected. Viewers will have the opportunity to view the online version of the event online via Black Arts Alliance’s mobile app. Artforum’s March edition", "The next Biennial should be held in 2020 and the first in 2021.\n\n\nThe National Museum of Art in Athens has received a gift of sixty-eight works by the late Greek artist Popovidr (1925–1986). Located in the city’s Pylos Museum, the works, which were donated by the late collector and collector of the Painted Age, Dimitra Pape, were organized into two tributes, one for the artist’s life and another for his works’ enduring influence on the artist-in-reporter movement.The deceased dealer organized the first two tournaments of the Painted Age, “Dorothea and Olga,” which took place in the city of Pergamon in 1972 and 1979, and “Khronos,” which was staged in Athens in 1979 and was held in the city in 1996. The first exhibition in the series was held at the Painted Age in 1974 and featured fifty works by the artist. The second exhibition, held in the museum in 2000, featured twenty-six works by the late Pindar Karamanlis and fourteen by the late Pindar Karamanlis’s daughter, Pindar Karamanlis:", "The next Biennial should take place in 2022 and will consist of twenty artists from twenty-six countries.  The biennial will also include a section titled “Dreaming in the Fours,” which will focus on the artist’s habits and experiences in relation to art and spirituality and how they relate to everyday life.\n\n\nThe Metropolitan Museum of Art in New York is preparing to welcome visitors back to the institution, following a temporary shuttered location in March 2018, in 2021. The museum announced on Tuesday that it will begin welcoming visitors again, with a new year–end theme, “For the Women of Babylon,” and is informing the public that this will be a year of celebration, not demolition. The announcement coincided with the reopening of the Metropolitan’s new location, a $130 million expansion of the museum that opened in a former factory building in the late nineteenth century.The museum has been working toward revamping its interior since 2013, when it began renovating the modernist building that houses the museum. The museum received a $222 million expansion to the museum in 2018, and in 2019, another $310 million was spent on the museum’s renovation. The museum reopened to the public in", "The next Biennial should be held in 2022. The end date of the current exhibition was set by the BCMA in order to allow the museum to continue to develop its collection and to give the British Museum the opportunity to showcase its holdings of Monet and other early modern painters. The current exhibition is considered a landmark in the history of the art world and was the first in the United Kingdom to feature work by all sixteen artists from the series. The exhibition was also the first to feature works from the contemporary art world and was presented in a British Museum setting. The Biennial will be held in several locations across London including the Tate, the National Portrait Gallery, the British Museum, the Royal Festival Hall, and the National Gallery. The Biennial’s programming will be guided by the director of the Museum of British Art, Caroline Copley. \n\n\nThe Pérez Art Museum in Madrid has appointed Pia Camil as its new international artistic director. She will be responsible for coordinating programming across Spain, the Catalan region of Andalucía, and the outside world.“I’ve been a fan of Pérez Art Museum since I was a kid and have been watching the Pérez Art Museum", "The next Biennial should be held in 2021, and the first in 2022. The biennial will be organized as follows: \"The ∞: The Art of Zombie,” will now include an exhibition of work by the artist Andrea Dwork, and the biennial will coincide with the twenty-fifth Venice Biennale, which will include different works and will be held in the city of Venice, and will be hosted by the Italian architecture magazine Gioia. The biennial will also present three new works by the artist, including one titled Zombie, 2019, which was created in front of a live audience at the Venice Film Festival in 2020, and another Zombie, 2024, which was made in front of the audience at the Venice Architecture Biennale in 2021.\n\n\nAs the number of people who have recently died from heat stroke swells in the United States, the number of Americans who suffer from chronic obstructive pulmonary disease (COPD) has more than quadrupled since 1980. According to the Centers for Disease Control and Prevention (CDC), in the last year, nearly 635,000 people have died from the illness, and another 535,000 are chronically ill. While the number of people who are dying", "The next Biennial should be held in the fall of 2021. The announcement follows the midterm exhibition, “Personas: Body Art” (2019) at the museum, which ran from March 19 to March 21.\n\n\nThe Museum of Contemporary Art (MoCA), Boston, announced today that it plans to open an arts center that will feature new works by artists including Andrea Fraser, the first African American woman to win the National Medal of Arts, and the first person to organize a group exhibition. The new museum, called the Art Gallery, will be located in a former factory complex on the site of the former Commonwealth Furniture Factory in Dorchester.It will be inaugurated by a solo exhibition of Fraser’s work, “Sister,” which was shown at the Black Box Art Museum in New York in December. “The exhibition opened with a group show of work by Andrea Fraser, ‘Idalia,’ and the WorkNER project,” according to a release. “The work was created as part of a larger project to create work in relation to the themes of the exhibition. The show opened with a performance of a production created by the artist Stella Artigas, entitled ‘Girly", "The next Biennial should be held at the Museum of Contemporary Art in New York in 2021. \n\n\nThe Bifrost Museum in Berlin, which celebrates the history of the Weimar Republic, has welcomed three new members to its ranks: artist and researcher Markus Neumann, whose work explores the limits of art and the limits of the artist-patient relationship, and scholar Urs Fischer, whose curating projects focus on the relationship between art and the humanities.The museum’s board of curators announced the appointments in a letter sent to the new board members of the museum, which was sent on July 28. The letters urged them to form an industry-wide group for the exhibition of Neumann’s work without any prior discussion among the board members and to invite Fischer to the institution for discussions regarding his upcoming exhibition “Pillars of the Wind.” The exhibition will be presented in the September 2020 issue of Artforum.com. The biennial features work by contemporary artists such as Ewa Suydam, Dusan Podgornik, and Rirkrit Tiravanija, and will run from September 10 to September 13, 2020. The biennial is part of the Förderbund’s 25-", "The next Biennial should focus on how craft and design intersects with the life and well-being of marginalized communities. An open call for proposals will open on September 26 and will run until September 30. The full list of participating artists is as follows:• Ada Colau, Argentina & Argentina• Alighiero De Martino, Italy• Alejandro Cesarco, Chile• Edouard Damici, Italy• Joseph Alberte, Germany• Kayode Iwamoto, Japan• Kim Dyu, South Korea• María Fernández, Mexico• Camille Fontanetto, Italy• Cristina Freitas, Peru• Charlotte Gallego, Mexico• Sérgio Gomes, Brazil• Chantal Green, Britain• Kara Hamilton, England• L.I.A. Jackson, USA• John Garthwaite-Holland, Wales• Cécile Gallou, France• Yuca Kato, Mexico• Shaye Jackson, Canada• Joey Mather, USA• • • ••• Where: • Come see all your favorites in one place! Sponsored by Art Fund, CAA, and the Diller Scofidio +", "The next Biennial should be held in 2021. The ART Congress was founded by the German artist Dietrich Reimer in 1957 and inaugurated by the German artist Wolfgang Schädel in 1962. The biennial consists of approximately seventy-five exhibitions, and attracts a worldwide audience. Its first exhibition, “Our World in Ruins,” was staged in 1968 and exhibited in 1972.Following the Manhattan Project’s termination, the United States government launched the “Art of Man” series, which has since become a founding theme of the biennial. Its forty-fifth edition, “Art of Life,” will be held in 2021. The 2020 edition, titled “The Healing Power of Plants,” was held in October of that year, and the 2019 edition, “The Healing Power of Animals,” was held November 7–November 11. An online tour of the biennial will begin February 17.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $5 million donation from Tom Gjones, who made major contributions to the museum in the 1980s and 1990s. MCA director Mel Rubin announced the gift at an early date this morning, and it will be", "The next Biennial should take place in the United States in 2021, and the 2020 organizers are hoping to organize a new edition in 2021.\n\n\nIn a move that has shocked the art world, the Museum of Modern Art (MoMA) in New York announced that it will resume operations at its former location in Downtown Manhattan on Tuesday, November 1, 2020. The announcement follows a brief period of uncertainty following the initial closure of MoMA in March 2019, when the institution reported a loss of $10 million in revenues. “We are thrilled to have ended our contract with the New York City Department of Cultural Affairs,” H. Paul Graham wrote in a letter to the public, “and to have landed in the good graces of the city and government for the first time since 1999.”At the time of the announcement, MoMA was facing a $2 billion budget deficit, and its lease with the city had not yet been renewed. The museum was forced to move forward with a redesign that added an additional thousand square feet of gallery space and added more public art, including a sculpture garden, an artist’s studio, and classrooms. The renovation project also added more than four hundred more square feet of outdoor space for the public,", "The next Biennial should be held at least every six years, with the first one to take place in 2019. However, a guidelines for the event have been published by the Art Historians Association. The exhibition suggests that the first Biennial should be held between January and March.“The key difference between the two biennials is that the artist-run museum is more concerned with ‘reproduction’ and the Palestinian diaspora, and the biennial should be a celebration of Palestinian art and the achievements of the Palestinian artists,” Dalia Nazaroff, the executive director of the Israel Museum, told the Art Newspaper. “The Palestinian artists that are celebrated in the exhibition are the ones that are most directly affected by Israel’s occupation, and they are the ones that are most vulnerable to Israeli domination”\n\n\n\n\n\nZoé Whitley-Brown, the chief curator of contemporary art at the Museum of Modern Art (MoMA), and Jordan Lovett, the director and CEO of MoMA, have reached an agreement in principle for the artists’ participation in the twenty-second edition of “Scandinavian Contemporary” at the museum. Under the terms of the agreement", "The next Biennial should focus on the themes of the exhibition and the thinkpieces that are produced within it. The first part of the series, titled “The Art of the Next Biennial,” will be presented by Giovanni Ferrari on October 4. While the exhibition will feature original works by forty artists, including Joan Miró, Ting Wong, and Charlotte Milton, the biennial will only consist of twelve pieces. The next iteration of “The Art of the Next Biennial” will be staged at the San Francisco Museum of Modern Art in August 2020. A full list of participating artists can be found here.\n\n\nAn open letter sent to the National Museum of Fine Arts (MoFA) in Washington, DC, by forty art collectors, including David Burton, Charles A. Birnbaum, Richard Prince, and John Bruno, in support of the upcoming reopening of the institution, writes: “We are troubled that this exhibition, ‘The Remaking of Modern Life: Art in the Twenty-first Century,’ will be held at a time when we are starting to see the effects of the coronavirus. We are troubled that the show will feature work by artists whose creative practices and careers have been impacted", "The next Biennial should be held at Oxford University in the spring of 2021. The 2019 event, entitled “Artforum: The Next Generation,” was held at the San Francisco Institute of Art and ran from May 14 through May 21.\n\n\nThe National Gallery of Ireland (NGA) has welcomed Kirsten and Eamon Coman to its team. The couple will be working with the NGA to develop and execute a new Masterpiece’s preview series, which will begin in the spring of 2021. The project will be led by Catherine O’Connell, the NGA’s director of curatorial and exhibition design, and will be funded by the National Loteries Fund, the National Council for Contemporary Art, and the National Galleries of Ireland. The inaugural event, “The Lighter Side of Life,” will include Sarah Pindell, Lydia O’Leary, Tessa J. Martin, and Catherine O’Connell. The five-week series will be hosted at the NGA in London and will run until November 48.“We are delighted to be working with Kirsten and Eamon Coman to develop a new exhibition series with a strong history", "The next Biennial should be held in 2021, and the institution’s director, Viswanathan Anand, said: “We are very much looking forward to continuing the work of Junaid and the other curators, and to growing the public and community understanding of Islamic art.”The biennial, titled “Art and the Art of Life,” will focus on “life sciences”—a term that includes everything from nanotechnology to nanomachines—and will focus on the installation of artworks in public spaces, such as museums and art galleries. The curated exhibition will include works by artists such as Princess Rania of Bahrain, the first female artist to win the Prix d’Or, and the first artist to be included in a major international triennial.\n\n\nIn an attempt to stem the spread of Covid-19, the US Centers for Disease Control and Prevention (CDC) have published new guidelines that outline how residents of eighteen US states can minimize their exposure to the virus. In a statement, the CDC said: “The most effective way to prevent illness is to avoid being exposed to the virus, and that people who are sick should not be isolated or housed alone unless medically necessary. Communicating with", "The next Biennial should be held in the third quarter of the year. The theme for the 2019 edition was “In Defense of Feminism: The Politics of Language,” and its presentation was complemented by an exhibition of works by the artists who participated in the previous two years’s edition.The 2019 edition of the Biennial was organized as a sort of “grand convergence of the biennial’s art and politics,” the organizers said. “While exploring themes of the past and the future, the organizers’ journey through the construction of this biennial and the world as we know it.”The exhibition was organized in collaboration with the artist-run project Mura Nitta, which first created a travel-size replica of the 1991 Pan-American Exposition, which showcased the work of forty-eight contemporary artists. The exhibition was organized by the artist-run organization MURICA. “The decision to organize a biennial as a series of activations was not made lightly, but we felt it was the right thing to do,” said MURICA. Over the years, the two groups of artists who participated in the event—Nadia Gert", "The next Biennial should focus on the role of women in the history of the exhibition, which is scheduled to run from March 11 to March 19, 2020. It should also involve the exhibition of a new exhibition of work by female artists, called “Danger Up Front: Women’s Work in the 1960s”, which will be presented by Fanny O’Grady.\n\n\nThe Harvard Art Museums (HAMD) are pulling the plug on the exhibition “The Body in Space” due to concerns surrounding the coronavirus and its related complications. In a statement, the HAMD said that it was “concerned about the ongoing publicity surrounding the coronavirus and its complications, both within and beyond the art world.”Hannah J. Pashler, executive director of the Cambridge-based think tank Art at Risk, said: “In a time when the coronavirus is becoming a global crisis, it is hard not to be concerned about the way that art is presented to and displayed in public spaces. HAMD’s decision to remove the exhibition is a tough but necessary step. We hope that this is just the first step in a long process to make sure these dangerous coronav", "The next Biennial should include visual arts, architecture, and design from the Americas and should aim to present a new vision of the museum’s collection for the first time. The current exhibition, “Aristotle and the Early Middle Ages,” which was organized by the Pérez Art Museum in Madrid, was curated by Mary Isabel Pérez.\n\n\nThe Center for Contemporary Art (CofA) in the Arts (CofCA) in Los Angeles announced today that it has received a gift of forty-six works by forty-one artists in the collection of its founder, William S. Burroughs. Included in the gift are a set of sculptures by Mira Dancy, Mark di Suvero, and Max Hetzler, as well as unpublished works by the artist Robert Irwin and his wife, Maria Del Toral, a member of the Los Angeles–based art collective the Mira Dancy Group.“The gift sets an example for how a visionary and generous donor can transform an artist’s life and legacy,” said Lara Doran, director of CofCA. “The work of so many talented artists is an inspiration to us all. The museum’", "The next Biennial should take place in 2022, according to Caesar. Easter will be a difficult time for many artists; in the month of August, they will be working in the heat of the year. In an attempt to counter the heat, the Manchester Museum of Art has opened its Artspace, the Manchester Contemporary, which will host a variety of events. The institution also plans to open a new museum in some of the city’s empty buildings in 2021, a move that will involve the demolition of eleven structures in the city. Some have questioned the necessity of the demolition process, since there have been rumors of people using the buildings’ remaining life to make their sculptures, and the buildings have been filled with people, causing traffic congestion.\n\n\nBrazilian artist Ricardo Campos, who typically creates sculptures based on themes of the body, politics, and the environment, has died at the age of ninety-nine. Born in the city of São Paulo, his practice incorporates works that address issues of memory, memory loss, and memory enhancement, among other topics. His works are increasingly found in museums across Brazil, and are included in the exhibitions “For and Against the Body:” (2019) and “Ric", "The next Biennial should feature a selection of works by artists from India, Turkey, and Egypt. The exhibition will launch in January 2021.  The 2019 edition of the Biennial was staged by the Guggenheim in New York.\n\n\nThe Pérez Art Museum in Mexico City will reopen on January 28, 2020 following a $1.2 billion expansion. The center, which underwent a $3 billion expansion in 2015, is currently housed in a four-story brownstone in the city, and provides free admission for all visitors.The museum was founded in 1926 by architect Jose Pérez and the Mexican–born architect Andrés Manuel Pérez, who converted the building into an exhibition space. Its inaugural exhibition, “Let There Be Light,” was staged at the Pérez Art Museum in 1964, twenty years after it was founded. In 1984, the institution expanded into a six-story, glass-enclosed palace. In 1989, the Pérez Art Museum became the Pérez Museum de Arte Contemporáne. In 1998, the museum relocated to a new six-thousand-square-foot building, which opened in 2001.Travel through the Pérez Art Museum is simultaneously", "The next Biennial should focus on “the connections between contemporary and contemporary art.”\n\nThe 2018 edition of Art Basel Hong Kong was canceled in March after organizers discovered that a fire broke out in an unused electrical panel of a booth in the exhibition space, which was being used as an outdoor sculpture garden. The exhibition was scheduled to run from March 14 to March 17.The exhibition was to feature work by forty-two artists in Hong Kong, Hong Kong, China, and Japan. The exhibition was supposed to be a joint project between the Tokyo-based studio iNMA, and the Hong Kong-based artist-activists. However, the artists were not allowed to use the booth and its construction, which was completed in 2015, was never used in the show. In a statement, the organizers said the design, construction, and installation work was “made in an unauthorized and unsafe manner” and that the development of a fire in a booth is a “serious matter.” The art-world organizers learned that the work was never installed in the space where it was supposed to be exhibited after the event was abruptly canceled. According to Artnet, the sculpture garden was supposed to open on the fifth floor of the Beijing", "The next Biennial should take place in 2020, and the first in 2021. The event will address the socio-political situation on the island, its cultural heritage, and the island’s major cities, including the city of Palma de Mallorca. An exhibition of works by Santiago Cintas, the artist behind the original series, will be staged at the venue in 2022.\n\n\nAfter a twenty-minute presentation by Donald F. James Watson, the president of the Harvard University in Cambridge, Massachusetts, and the New England Museum of Natural History, today a group of artists, including Sara Zweelson, John Ahearn, and John Lee, was awarded the Mark of the Institution. The accolade comes just weeks after Watson was named America’s James Watson Laureate, and comes in the wake of a year filled with major scholarship and an exhibition at the New York Academy of Art.The exhibition, “Technology and Human Life: Technology and Memory” (2016), presented works by forty artists such as Kiki Smith, Hans Neumann, Andrea Horvath, and Michael Rossi. It also included a new project for the museum", "The next Biennial should take place in 2021 and will focus on the collection of art from the region, in collaboration with the local community. The theme will be “A Future for the Past.”\n\n\nThe Institute of Contemporary Art (ICA) in New York has hired ten new members to its board of directors, bringing the total number of members to fourteen. They will serve two-year terms, beginning in the fall of 2020, and will be elected by a three-member committee made up of Cynthia Shea, director of the Tarrytown Museum of Art in Upstate New York; Loring Randolph, president of the Metropolitan Museum of Art; and Trina Verma, the president and CEO of the Whitney Museum of American Art.“Our board members have been key players in our museum’s evolution over the past thirty years, and they bring a wealth of knowledge and experience to the board,” said Michael Markowitz, the institute’s executive director. “Their approach allows us to reimagine how the ICA will work and flourish as we continue to invest in our future and our community, and our board members bring that vision to life through inspiring, challenging exhibitions, engaging exhibitions, and engaging programs.”The", "The next Biennial should take place in 2021.\n\n\nThe US House of Representatives voted yesterday to establish a national museum dedicated to the American Latino, the first such institution in the country. Introduced last year by New York representative Joaquin Castro, the bill for the museum, which will sit on the National Mall, was unanimously approved on Monday and now goes to the Senate, where it has bipartisan support. The museum would be a subsidiary of the Smithsonian Institution, which already operates a museum for the American Indian on its grounds, and would host more than one thousand artifacts from the American Southwest.“The legislation that passed yesterday ensures that the National Museum of American Latino will be a center for the study and appreciation of American Latino culture, history, and people,” Castro said. “The National Latino Heritage and Culture Act of 2017 makes history—and art—of the American Southwest—beginning with a new museum dedicated to the history of the National Museum of American Latino, a museum to whom visitors can come for free. The National Museum of American Latino will be a cultural and educational landmark of the Southwest, and a ray of hope for the many Americans who have made this country great—and who will continue to make this country great—and will", "The next Biennial should be held in 2021, and the show will be hosted by Robert Frank, the director of the NYU Abu Dhabi Art Museum, and Petra Gadella, the curator of contemporary art at the Museum of Contemporary Art in London, in a new exhibition, “The Future Is Present: Art and Science” that will run parallel to the 2020 event. The 2019 edition, titled “Art and Science” and curated by Frank, featured work by fifty-four artists. The Museum of Contemporary Art, London, curated “Art and Science” again last year with work by fifty-three artists, and the University of California, Berkeley, organized an exhibition “Art and Science” of thirty works by twenty-four artists in 2016.“The Golem: Art and Science” opens with art historian H. H. Giger’s 1947 monograph The Golem, and includes works by twenty-two artists. The exhibition is curated by  Sophie Bancroft, director of the University of Newcastle, UK; Samantha Bennett, director of the University of Central Lancashire, UK; and Arthur Baggott, the director of the Institute of Contemporary Arts", "The next Biennial should be held at the Museum of Contemporary Art in Seattle (MCA), which has yet to decide whether to move forward with its planned 2020 event. It will then be up to the City of Seattle to decide whether the sculpture park should reopen. If the MCA decides to reopen, the next exhibition will have to be canceled due to the Covid-19 pandemic.The announcement came shortly after Seattle’s Mayor Mike McGinn announced that the city’s art museums would begin closing. While McGinn said that the closures are a result of the pandemic—the majority of Seattle’s art museums are closed, and the University of Washington’s art school has yet to begin its fall semester—he did not mention the institution by name and instead focused on the ways in which museums are reopening. He said: “I want to thank everyone for their patience and understanding this past week as we have closely monitored the Covid-19 situation and have been cooperating with state, local, and federal officials to ensure the safety, sound, and health of our residents and visitors.”\n\n\nThe National Endowment for the Arts (NEA) announced today that it has awarded $3.25 million in funding", "The next Biennial should air on November 7 and will feature a selection of the best works from the next generation artists. The biennial will be curated by Pilar María De La Torre, who will bring with her “new approach to Diwan Ibrahima” and will be located in the city of Quirino, in the province of the northeastern state of Uruso, in the province of Quirino, in the province of Quirino, in the province of Quirino, in the province of Quirino, in the province of Quirino, in the province of Quirino, in the province of Quirino, in the province of Quirino, in the province of Quirino, in the province of Quirino, in the province of Quirino.\n\n\nThe National Gallery in London is preparing to welcome visitors back to its cavernous thirty-room exhibition space in the Museum of Modern Art (MoMA) on May 1, 2020. The reopening will coincide with the New York fair, “NYC 2020,” and will also mark the first time the museum has reopened since it closed on March 31, 2020 following a $8 million expansion.According to the", "The next Biennial should also aim to address the issues of sustainability, ethics, and accountability. “It is impossible to overstate the importance of art institutions in terms of their humanitarian impact and the impact that science and technology can have on our world,” said Helen Bailenson, chair of the board of trustees of the Biennial. “In order to preserve the integrity of the art, it is necessary to address the issues around art, to address the issues of why it exists, and to address the issues that it is not supposed to address.”Since its inception, the Biennial has welcomed more than 150,000 visitors to see works by more than 160 artists\u0097at least twenty-four of which are returning this year\u0097including Rani Benhabib, Brigid Pindell, Ron Gorchov, and Harry P. Kohn. The full list of participating artists is as follows:Sean Kelly (The World is a Color Image)Siobhan Kelly (The World Is a Color Image)Michael Knapp (Moody)Michael Knapp (Moody)Pernille Krebs (Liege)Paul Mpagi Sepuya (The Grand Gallery)Pari Dukovic (", "The next Biennial should be in 2019, and the first in 2020. The fall exhibition will feature artworks by known and unknown artists, and will have a nominal budget of $85,000. The institution will be housed in a former coal-electric plant in the city of Eindhoven, which was the site of the WWII German military air base, and will have a capacity of 10,000 visitors. The biennial will also feature a public art installation and a performance. The show will be curated by Cindy Trinh-Rao, director of the Künstlerhaus and the Künstlerhaus in Stuttgart, and will open with a free evening show on May 25. The show will then assemble before the Künstlerhaus and will run until June 9. The show will also feature works by Korakorn Bochner and Ronnie Chan, among others. The 2019 exhibition opened with work by Kennedy Lake, Sam LaBahn, and John Ma and Jake LaBahn, as well as works by Mark di Suvero, Henryk Use, and Joel and Nancy Kries. The show", "The next Biennial should take place at least fifteen years from now. The biennial will encompass all aspects of the exhibition business, including programming, exhibitions, publications, and research, and will take place between March 21 and March 23.  “We are striving to present the full range of art,” Erika Bochereau, director of the Biennial, told the Art Newspaper. “We are moving forward with a fresh and vibrant spirit, looking forward to the next edition.” The 2019 iteration of the show, “Beyond the Frame,” was held at the Museum of Modern Art in New York from March 13 to March 21. The biennial was created in 2006 in collaboration with the Museum of Modern Art (MoMA), the Brooklyn Museum, and the High Museum of Art, and featured the work of thirty-eight artists.\n\n\nThe Contemporary Art Museum Houston (CAMH) has announced that it is working with the estate of the Cajun artist and educator Mary-Anne McLean, who passed away in Albuquerque, New Mexico, on a new exhibition centered around her life and legacy. McLean, a native of Grand Junction, Colorado, was one of the first artists to be", "The next Biennial should be completed by the end of the year, and we are currently evaluating how best to move forward with this year’s exhibition.”The biennial, titled The Future Is Present, will be held at the Museums and Galleries of the University of California, Los Angeles (UCLA), from March 19 to March 21, 2021. The 2019 edition, titled The Present, featured work by eighty-five artists, including Deborah Larson, Mark di Suvero and Luis Guirao, and was staged at the Los Angeles County Museum of Art. For the 2020 edition, entitled Future, it will be staged in the Los Angeles Museum of Contemporary Art (LACMA), and will be hosted by the Los Angeles County Museum of Art and the San Diego Museum of Art.\n\n\nThe British-based arts organization the Royal Institute of British Architects (RIBA) has welcomed the addition of twelve new members to its board of trustees, including Peter Sommer, the former chief executive of the firm V&A, and James Steyer, a renowned architect who is a cofounder of the firm Budd-Darmstadt, and will serve through the end of the year. The new members, who will be elected by", "The next Biennial should begin construction in 2020 and run until 2024, its organizers said. The next iteration of the Grand Prix, slated to take place in the city of Biarritz on June 17–June 19, 2020, will be held in the spring of 2021.  The next edition of the World Architecture Biennial, which was launched by the International Centre for the Architecture of Life (ICAL) in New York in 2015, will be held in the autumn of 2021. The 2020 event, titled “After Earth,” will bring together forty projects inspired by the International Astronomical Union’s new plan for life on Mars, including a solar-powered camp for the homeless on the Red Planet, and will open on September 17, 2020.  The 2020 event will also include a redesign of the pavilion, which will incorporate a more artist-friendly setting and be inaugurated by a new work by the artist-activist and activist Nari Ward, titled “The Fire and Earth Balloon,” a collaboration between Ward and the artist-activists Hoa Nguyen and Paul Alÿs. The pavilion will have a new elliptical glass-enclosed platform, a new roof, and will be powered", "The next Biennial should be held at least once every two years, rather than every five years, to reflect the biennial’s current collection. Rendering of the exhibition as it will appear at a later date.The institution will be inaugurated by a live performance by artist-run production space T+N, which will present the first exhibition focused on photography in France since the twentieth century. The exhibition will be a collaboration with artist Julien Adam Fauber: Kunsthalle Fauber in Marseille, which will be transformed by the artist into a museum dedicated to photography, will mark its opening with a retrospective of Fauber’s work. The institution will also present a number of presentations and events on photography and art.“With the installation of the new Kunsthalle Fauber in France, there is a new opportunity to produce an exhibition that represents the vitality and innovation of the contemporary French and - London,” said Østby Nilsen, director of the Kunsthalle Fauber. “It also marks an important step in our ongoing dialogue with our partners in the UK, and a new stage at which we can begin to present significant works that reflect the exciting possibilities open to artists", "The next Biennial should take place in 2020.\n\n\nThe United States Mint has announced that it will no longer honor the late designer Frank Bowling. After a series of public disaffection with his work, including a 2011 movement in which his work was featured in a show at the Museum of Modern Art in New York, Bowling’s body was exhumed and his ashes scattered into New Mexico. In a statement, the Smithsonian said: “Frank has been an irreplaceable part of our history and a champion of American art,” and that the Mint’s actions were taken “in recognition of the work’s important role in shaping our present and future.”Bowling’s work, which has been exhibited at the Museum of Contemporary Art (MoCA), the Metropolitan Museum of Art, the Whitney Museum of American Art, the Selig Gallery, and the Santa Barbara Museum of Art, was selected from a shortlist of ten finalists by an all-star panel of judges. The six-person jury comprised Robert Schager, the director of the Brooklyn Museum; Michael L. McNamara, the director of the Carolina Museum of Art; and Phillipa Soave, the board chair of the American Institute of Architects", "The next Biennial should be hosted in Helsinki in March 2020, and the exhibition should be relocated to the capital city. In order to ensure the smooth transition of the exhibition, the exhibition will be moved to the Stivistologi Museum in Helsinki, which is currently undergoing a major renovation. The exhibition will remain in the city until March 20, 2020, and will then move to the National Museum in Kiasma, in central Helsinki, in March 2021. The exhibition will then move to the National Gallery in Finland, the National Museum of Contemporary Art in Tokyo, and the Metropolitan Museum of Art, a longtime home of the exhibition design.The full list of participating art institutions is as follows:Art.noArt EuropeArt.noArt ShanghaiArt.seArts.de Art Art HelsinkiArt.seArtsmarkt.de Artmarkt-Stiftung BerlinArtsmarkt-Stiftung MünchenArtmarkt-Stiftung MarburgArtmarkt-Stiftung MünchenArtsmarkt-Stiftung MünchenBISCHIMERICENPRESSERArtsmarkt-Stiftung BerlinBISCHIMERICENPRESSERBISCHIMERICENPRESSERB", "The next Biennial should focus on “The Past and Future of Art”—its term for events that examine the future of art and the works of artists—and should commence in 2020. During the past three years, the Biennial has presented twenty projects that examine themes such as the relationship between memory and art, the social and political and the environment, and the relationship between artists and the physical body, among other topics. The list for the 2020 version of the Biennial is as follows: 1. The Past and Future of Art: From the Body into the World. Exhibitions will take place in different locations across the United States and will focus on the biennial’s history. 2. The Future of Photography: Historical Perspectives. A series of exhibitions organized by museum directors and curators will examine the history of photography, focusing on how it became a medium of expression and the historical issues that have shaped its use in the twenty-first century. 3. The Future of Acting: A retrospective of the pioneering American actor George Cukor will continue the work of the Biennial’s previous explorations of acting and non-acting and will introduce a new format that will allow the artist to experiment with the gallery. 4. The Future", "The next Biennial should take place in 2020. The third edition of the exhibition will run concurrently with the 2020 Olympic Games.\n\n\nThe British Council has awarded the Royal Shakespeare Company £11.7 million ($13 million) in financial assistance in the form of a grant for performance-based grants. The funds will be distributed through the Royal Shakespeare Company’s Easterly Box, a $6 million central office building in central London that will serve as the organization’s main staging space. The funds will come from the UK’s National Lottery Heritage Fund, which was established in 2016 as part of a £2 billion package of cultural arts relief, arts funding, and tax incentives. The grantees will each receive $6,000.The grants, which were first announced in 2018, were for Performance-Based Grants, which will support artistic projects that utilize the RMS to generate cash for the organization. The three performers chosen for the grants are Michael C. Wright, Natalie Redmond, and Ben Harper. The Easterly Box’s curators are Hannah Bond and Chris Lumpkin. Participating organizations in the program are The Wellcome", "The next Biennial should be held in the spring of 2022. The announcement followed a year of revitalization efforts and the construction of the new museum, which is currently undergoing a $73 million renovation and will open in the fall of 2022. Designed by architects Herzog & de Meuron, the university-owned museum will be located in a former industrial site in the city of Bechuanaland and will encompass approximately 1,500 exhibition spaces and will feature a collection of seventy thousand works. The institution will also house a research library and a collection of twenty thousand artifacts.\n\n\nThe British Museum (BMA) in London announced today that it has received a gift of more than five hundred works by an unknown artist. The museum was presented with the striking haul on January 3. The donation included works by artists such as H.M. Guggenheim, Hans Christian Andersen, and Maurice Breuil, and an additional forty works by unknown artists.“This is a remarkable gift given that the BMA has only recently begun to receive small donations of works by artists, and the high turnover in the artist and art world professions, and it is needed to support the growing body of work by unknown and underrecognized artists,” said British Museum", "The next Biennial should be announced by next May. The next edition will be held at the Museum of Contemporary Art, Los Angeles (MCA).The event will come a little over a year after the museum opened to the public in February 2019. In honor of the occasion, the biennial will inaugurate the museum with a double exhibition of work by the artists whose work was selected for inclusion in the first edition, and feature several new works. The work of the artists selected for the second edition will be introduced in the third episode of the biennial.The biennial’s inaugural episode will feature work by the artists whose works were previously selected for inclusion in the exhibition. The exhibition will be curated by David Blaine and will run until November 26. The biennial’s international jury, which comprises Claudia Lissoni, director of the Italian Institute of Contemporary Art in Milan; Fabio Truglia, director of the Centro de Arte Contemporáneo de Milan; and Alexandre Prüfer, director of the Fondazione Prima Artista in Florence, will select the seventy-six artists for the exhibition. The artists chosen for the exhibition were presented by the organizers, the Italian Ministry of Culture, the F", "The next Biennial should take place in May 2021. The next exhibition should be held in March 2020.  “We are deeply indebted to the many artists and institutions and individuals who made this exhibition possible, as well as to the City of London, the Institute of Contemporary Arts, London, the National Gourmet and the Conservative Party, and their campaigns to secure our passage through the London Bridge Bridge Box Office, and to the City of London for sustaining our programme through this exhibition year,” said Naima J. Keith, director of the National Gourmet. The National Geographic Society is also working with the British Museum to create an exhibition centered on the history of the American West and its influence on America as well as the theme of the 2020 edition of the National Geographic Society’s Evolution of Life series. The National Geographic Society’s Evolution of Life will open at the British Museum on September 2. The Tate’s American Art, which has been working closely with the British Museum to preserve more than 300 works, will also incorporate elements from the institution, including a new mini-museum dedicated to American art, and will present the works in its entirety. The sculpture and installation work by the now-retired sculptor David Sal", "The next Biennial should be held in 2020.\n\n\nCanadian artist Jamila Bouwens, known for creating provocative contemporary works that experiment with human relationships and represent a feminist, queer, and trans-historical vision of the future, has died in Montreal. She was ninety-six years old.Born in Toronto in 1936, Bouwens studied at the University of Toronto, the University of Montreal, and the University of Toronto. Her work can be found in the collections of the Museum of Modern Art, the National Gallery of Canada, the Toronto Art Gallery, the Toronto Museum of Art, and the Museum of Contemporary Art Houston. She was a winner of the Prix des Arts et littoraux (1997), the Kunsthalle Basel (1997), and the Los Angeles LGBT Film Festival (1998), among other awards.Following a move to New York in the early 1950s, Bouwens continued her artistic development, collaborating with fellow artists such as Werner Herzog, the late French director of the Museum of Modern Art (LMFA), and artists who would become major influences on her work. In addition to the EP, Bouwens produced the paintings on which she would later emulate Michel Ghebalye (1944–1966), Pina", "The next Biennial should include the work of at least twenty artists, including Dorothea Rockburne, Jean-Michel Basquiat, and the late Swedish artist Jari Granberg, and will take place at the Schloss Florgmann in Basel from April 26 to April 29.\n\n\nThe Museum of Fine Arts (MFA) in New York has announced that it has received a gift of twenty-seven works by sixty-five artists in the Brooklyn-based nonprofit artist-run space the Long Island City Artist-Run, a partnership that was formed in order to advance the work of emerging and established artists in the boroughs. As part of the partnership, the museum will donate twenty-two works by thirty-six artists, including Andrew Hill, Kiki Smith, Yona and Jodi Throckmorton, and Anthony Sbarra.“The work is a great gift to the community and we are thrilled that the MFA will honor it with an exhibition dedicated to this collection,” Marc Glimcher, chair of the museum’s board of trustees, said in a statement. Glimcher also noted that the MFA has contributed $5 million to the collective over the course of the last five years.", "The next Biennial should focus on forms of cooperation and cooperation within and between artists and institutions, and should be organized in the spirit of ‘art’ as a creative and intellectual activity.”The memoirist and playwright Claudia Barros, the chair of the exhibition’s board of directors, said that the exhibition will “be about using art to offer perspectives from different points of view and the need to share experiences, not about reinventing art.” She added that the show will “bring together artists who have a particular connection to art from different parts of the world, focusing on the art that is most difficult to address and most threatened by climate change.”Barros was referring to climate change—the Paris Climate Accords limit the planet’s carbon dioxide emissions; France, Germany, the UK, and the US have all pledged to pull their carbon-intensive industries from the grid; India, China, and Pakistan have pledged to curb emissions; and the Houthi rebels in Yemen are attempting to push back the country’s government.The exhibition is also being organized in the spirit of “art” and “climate change” but with an eye toward incorporating issues of modernity and", "The next Biennial should commence in the spring of 2021.” [Update: March 5, 1 PM] The 2019 Biennial was cancelled due to a fire in the building that was started by a construction crew working on the construction of the new venue. It will now take place in an exhibition hall that opened in the new building in September. The 2019 event was also prevented by the Covid-19 pandemic, which has forced the move of the 2020 event from September to November. The next event will be held at the newly-renovated museum. The exhibition that was originally scheduled for October 20–10 has been rescheduled for November 29–December 1. The opening of the new exhibition, “Seven Stories,” will be November 29–December 1. The 2019 event was intended to showcase the work of the recently-departed artists Artsadia Marangoni and Patrice Martel, who will be presented with a commission by the museum. They will be taken on a journey through their personal histories to consider their relationship with the artist and their work, as well as their relationship with their respective institutional histories.“The building is undergoing a major refurbishment and these two", "The next Biennial should take place in the fall of 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Paula Acosta as its next director. Acosta comes to the institution from the Metropolitan Museum of Art, where she has served as the deputy director for the past two years, and was promoted last spring to director. The newly appointed deputy director, Alma Lorello, will serve as interim director until a new director is hired.“With the appointment of Paula, we are entering a new phase of our history as we embark on our plan to expand the museum’s collection in a way that will further advance the museum’s mission,” said David Graham, chair of the board of trustees. “This is an exciting time to embark on our journey to create a truly remarkable collection. Our vision is to make the Met a center for artistic, educational, and research excellence that will serve as an important laboratory for experimentation and innovation for the entire community. We are confident that Paula will further the museum’s mission and the collection’s art in two ways: as a curator, educator, and advocate; and as a champion of the arts and a champion of the community.”Acosta", "The next Biennial should be scheduled at a location other than the museum’s building, and the inaugural exhibition should be reconsidered. “I think we are at an important moment in our history when we can begin to see the enormous impact that art and art-making can make within our communities,” said director Deborah Ruane.  The institution recently received a $100,000 grant from the Krzystů Ostaszczak Foundation, a nonprofit organization based in Warsaw, to further explore the possibility of hosting a retrospective, which would be held in the museum’s basement.\n\n\nThe David-and-Goliath exhibition, which is supported by the Richard and Helen Raeburn Foundation, is making its long-overdue reopening a reality. Titled “David and Goliath: The World Has Turned to Dust,” the exhibition will be staged at the British Museum in London from March 17 to March 20, 2020. Titled after a quote from the 1968 play “The World Is Not Enough:” David and Goliath, the show will feature forty works by thirty-six artists in an attempt to explore the idea of two worlds, the spiritual and the material, and to show", "The next Biennial should be held in 2021. The next WorldTour, which will be held in 2022, will be held in 2023. The next edition of the International, which will be held in 2021, will be held in 2021. The 2019 edition of the biennial, for which the opening ceremony took place at the San Francisco Museum of Modern Art, was postponed, but Museums and other public spaces will not be shuttered in protest of the coronavirus.The American Alliance of Museums (AAM), a nonprofit organization founded by billionaire real estate developer Larry Kudlow in 2003, plans to stage an event at the Javits Center on October 25, 2020. The event will be hosted by artist-run organization MASS MoCA; the organizer is not disclosing any details about the exhibition’s theme. Kudlow, who died in 2018, was a major supporter of MASS MoCA, which has hosted exhibitions by artists such as Robert Irwin, Philippe Terrell, and Elyn Zimmerman. Advertisement\n\n\nThe James A. Farley Foundation has received a $50,000 gift from the James A. Farley Family Foundation. The gift is a record‐breaking $120 million for the center, which will dedicate", "The next Biennial should be held in the spring of 2020. We are currently in discussions with the artist-run creative space Digital Democracy about contributing to this year’s exhibition. We look forward to working with Ms. Naidoo and Digital Democracy in their upcoming projects.\n\n\nThe Claremont Museum of Art (CMA) in California announced today that it is accepting new arts and cultural producer-in-residence submissions as part of its \"Residency Project.\" Applications will be accepted until May 30 and will be evaluated on a rolling basis.The project, which was launched after California governor Jerry Brown signed a groundbreaking $43 billion budget bill in March 2019, aims to address the chronic underfunding of California’s public arts and is being spearheaded by William E. Burgos, director of the Los Angeles County Museum of Art (LACMA). The $1,500 stipend is part of a $3 billion stimulus package approved by voters in a November 2018 referendum.“This is a critical time for arts and cultural institutions in California,” Burgos said. “We are poised to become the largest economy in the world, but we do not have the resources, the staff, or the time to invest in an environment", "The next Biennial should take place in 2021; the first in 2020.The museum will be complemented by an expanded collection of forty-six works by artists who have lived in either Washington, DC, or New York City. The coordinates of the second and third biennials will be announced in the coming months. \n\n\nThe MFA Boston has launched a new grant program that will give local artists $1,250 to retrace their steps and relocate to a new location. The program, which will be offered annually through 2021, is part of a larger initiative to make the MFA’s art programs more accessible to low-income communities. The grantees will be selected through the MFA’s online art exhibition platform ArtBoston. The 2018 grantees included Andrea Baili, Stephanie Chiu, and Coles.  “In the five years since our grant program launched, we have made every year a microcosm of art across the boroughs,” said MFA director and CEO Jennifer Dietz. “The grantees represent extraordinary stories and compelling visions; each is a role model for audiences around the world as they reflect the extraordinary breadth of artistic talent we have to offer. We encourage and provide guidance", "The next Biennial should be scheduled for 2021. Artist statements and the biennial’s program will be decided by a committee composed of Bridgett Martin, one of the founders of the museum, and John McCarthy, a curator and former director of installations at the Van Gogh Museum in Stockholm; Hans von Labbéke Gallery in Berlin; and Hiroshi Fujii, the former director of the Van Gogh Museum in Oslo.The 2019 program, titled The Color of Life, was organized by the Van Gogh Museum in Stockholm and the Louvre in Paris. It was followed by The Fourth of July, which was presented by the museum in New York, and The White Album, which was presented by the Unseen Museum in New York.\n\n\nThe 400,000-work collection of photographer George Peele, which includes works dating back to the 1960s and 1970s, has been sold by Christie’s to Sotheby’s for $315 million. The work, titled George Peele: A Life, was first presented at the Fifty-Third Venice Biennale in 2009. The transaction, which was finalized on Friday, July 18,", "The next Biennial should take place in the city in 2022. Central to the project is a new library and museum, designed by architect Daniel H. Smith. While its opening date has yet to be announced, the museum will be constructed in a former brick factory in a former textile mill and will boast a large exhibition space and a café.The new museum will boast a larger auditorium, improved accessibility, and a new Spanish-language site-specific stage, which will be a collaboration with the artist-run group Projecta . A new pavilion will also be built to house the galleries' collections. The redevelopment of the former Plésencia de Cultura de la Reforma (Center for Cultural Research, Reform and Development), which is currently occupied by the National Museum of Modern Arts in Atlanta, Georgia, will see a total of twenty galleries and museums reopen.\n\n\n\n\nThe Museum of Contemporary Art (MoCA) Los Angeles announced today that it has appointed Sandy Schirle as its next executive director. In the newly created position, Schirle will work with the board, the curators, and the staff to shape its trajectory and future plans. Schirle will be responsible for disseminating the museum’s message of social justice and environmental justice through", "The next Biennial should take place in 2020 and will feature work from more than 120 artists, including David Hockney, the Czech-born, Brooklyn-based artist who took his own life last year; and a selection of works by the Brazilian artist Vicente de Castro. In the meantime, the museum has announced that it will be open to the public from June 16 to June 19. “The Biennial is an ongoing project that has been taking place for twelve years and has had an amazing success story since its inception,” said Mary Anne Georges, director of the museum. “It is now counting down to the 2020 edition to make sure the Biennial Program achieves its ultimate goal, to draw and present the deepest and most contemporary art of our time.”\n\n\nThe Solomon R. Guggenheim Museum in New York has hired Adrian Gartenfeld as its new global head of contemporary art. Gartenfeld comes to the institution from the Israeli artist-run organization Beit Eliezer Gallery, which he founded in 2016. He succeeds Eliezer Gallery executive director Sari Rohn. “I’ve been a strong supporter of Gartenfeld’s life and art since the early", "The next Biennial should be held in 2020.  In a joint statement, the Biennials said: “The 2018 edition of the exhibition was critically acclaimed, and this year’s was well received by the jury, who declared it worthy of inclusion. The 2019 exhibition was exhibited and sold well in Amsterdam and was nominated for a Golden Lion at the Venice Biennale, and the 2020 exhibition will be staged at the Museum Biennale. The museum will have a new exhibition on the history and development of the art of photography by the French artist Etienne Leclerc, based on the exhibition ‘Feminine’s Dilemma. The new Royal Academy of Arts in London will be inaugurated by the exhibition “Photographer: The Evolution of Light.”The full list of participating artists is as follows:Alison Bech, Leeds, United KingdomEddie Chartier, Madrid, SpainPei-Li Chen, New York, New YorkVincent Capra, New York, New YorkPeter Coyne, New York, New YorkAnnie-Kate Beck (Leeds), UKSarah Broom, New York, New YorkDiane Keherenberg, New York, New YorkBri", "The next Biennial should be held in 2021 and will be hosted at the Museum of Fine Arts in Boston from March 29 to April 2, 2021. The ten-day event will feature three tracks, each curated by a different curator, and will take place in various locations, including at Solomon R. Guggenheim Museum in New York, at the Museum of Modern Art in New York, at the New Museum in London, at the Metropolitan Museum of Art, and at the Museum of Contemporary Art Los Angeles.  The museum will also stage a documentary, 〜The Biennial of the Mind,” in March 2022. Will see you in 2019Three years after The Biennial of the Mind, the first exhibition of artist-designed buildings at the Fifty-Third Venice Biennale, opened at the Museo del Barrio in Venice on December 4, 2008, in a spectacular display of work by thirty-five contemporary artists. Each artist\u0097Marc Glimcher, Andrea Grazia, and Andrea Paratta, along with various curators and grantees, such as Eli Benoît Aiguille, Jean-Luc Moulène, and Benoit Pape\u0097was awarded a commission to design", "The next Biennial should be held in 2021. The arts nonprofit the Boston Foundation has committed $5 million to the construction of a new biennial for the arts in the city. The $7.5 million project is part of a massive renovation of the historic Doris Duke Building, which houses the National Gallery of Art, the Center for American Art, the Solomon R. Guggenheim Museum, the Museum of Fine Arts in Boston, and the Massachusetts Museum of Art.The $5 million investment was made during the Doris Duke Art Restoration Challenge, an initiative launched by the Doris Duke Foundation and the Charles and Lucille Duke Foundation. Boston’s Art Museum and Boston’s Sculpture Garden, which were once the site of a groundbreaking exhibition in 1904, were also renovated in 2017. The project, which also included the creation of the Doris Duke Sculpture Garden, was funded with $3 million from the Charles and Lucille Duke Foundation, $2 million from the United States Department of Housing and Urban Development, and $1.5 million from the Doris Duke Estate.The grant also supports the renovation of the Doris Duke Memorial Art Museum. The museum was commissioned by the estate in 1992 and completed in 1995", "The next Biennial should be held in 2022.\n\n\nThe LaGuardia Design Museum in New York is planning to launch an online portal dedicated to the life and work of Italian designer Gian Luigi Turin. The project, which will be led by Jonathan Ive, will be led by the Italian designer's visual artist Luca Bevilaqua, who will curate the exhibition under the auspices of the charity Donatella Bonsu.The initiative is part of a broader campaign by designers and cultural institutions to connect with the public through the public sphere, including through institutions such as the Venice Architecture Biennale and the Metropolitan Museum of Art. The museum also unveiled an interactive digital platform that will allow visitors to explore the work of its curators and will host a series of public performances that recall the Italian cultural landscape.“For years, the museum has been solely focused on presenting the work of Italian designers in a certain way, having an internal conversation with Joseph Lidauer, the director of the W.L. Beaux Gallery in New York, or with the artists José Maria Marin (in collaboration with Liz-Mai) and the late David Salle (in collaboration with Rosalind Nash), for example,” said", "The next Biennial should happen in 2020’s winter.\n\n\nThe Board of Trustees of the Museum of Fine Arts (BMA) in Phoenix has announced that it is working with the Warren B. Kanders Center for Contemporary Art (RBC) on a new collaborative project, “The Place of Art in America.” The initiative will draw from the BMA’s collection, but will focus on how art has historically been situated within contemporary American life.Museum director Edward D. Kitson said: “We are excited to embrace the legacy of the Kanders Center for Contemporary Art as the centerpiece of a new partnership between the museum and the RBC. The partnership will be a partnership of the BMA and the RBC, which will focus on the legacy of the Kanders Collection and on how art has historically been situated within contemporary American life. This collaboration will also present opportunities to engage with and include the collection and the community in new ways.”Kanders, who died in 2000, was an American painter, sculptor, and architectural designer best known for his pietà sculptures—vignettes in which a seated figure is transformed by a landscape often constructed from paper, wood, or nylon rope. His work", "The next Biennial should be in December 2020. The new theme will be “The Body,” reflecting on the critical role of the non-human body in shaping and articulating contemporary social, political, and aesthetic practices. KASHM’  is the parent organization of the Art Gallery of Ontario (AGTO), which recently staged a major renovation and expansion project. The project, which involved the reconstruction of the gallery’s original décor, introduced new works by artists such as Frank Gehry, Robert Irwin, and Arsht Hirschfeld.KASHM has also invested in the development of new programming and curation that will engage with the collection as part of the institution’s ongoing program of exhibitions, residencies, and presentations. The organization recently unveiled its first-ever biennial, “Groundwork,” which will explore the work and legacy of the late British painter KASHM’s principal North American clientele, the street artists The Hot Rats.\n\n\nThe Polish ambassador to the United Kingdom, Anna-Sophie Olszka, has been named the new head of the home affairs select committee. She is the second woman to hold the post, and the first since 1998", "The next Biennial should take place in 2020, and the twenty-seventh in 2021.The announcement of the twenty-fifth edition of the museum came amidst a major project at Frieze London, which opens today and will run through April 21. The institution unveiled its new exhibition “Live from the Open Road,” a ten-city tour of new works in the exhibition “Live from the Open Studio,” and expanded its collection by more than twenty thousand works. The exhibition “Live from the Open Studio” will be on view from March 28 through April 9, 2020.\n\n\nThe museum’s board of directors announced today that Andrea Caruso, who has helmed the institution since 2016, will depart in January 2021. She will continue to serve as curator of the Düsseldorf–based museum until the end of her term at the end of March, and will take up the post of director in January 2021.“The board of trustees wishes Andrea well as she embarks on this new chapter in her distinguished career,” board chair Olafur Eliassen said in a statement. “A wonderful addition to the Düsseldorf region, and the German Museum for the", "The next Biennial should include a new work by a contemporary artist from the United States, and should be staged in California. “Over the last twenty years, the Museum has developed an emerging and established reputation as a leader in the production of new work by artists from the United States, and one of our most successful works by a contemporary artist, ” Henry said. “We are especially grateful to Gary for his leadership in the development of the four-year biennial,” he added. The museum will also be redesignated the “Museum of Contemporary Art, Texas” and will have its current building completed by October 2020.The organization will also reorganize its current building in the downtown core, moving it into a new 140,000-square-foot space that will be called the William M. Jessop Center for Contemporary Art. The building, which will be finished in mid-March, will house the Museum’s special collections, administrative offices, and a new school, the Paul R. Guggenheim Museum. The new center will also accommodate an additional 30,000 visitors annually.The announcement of the center came on the heels of a deal between the city of San Antonio and the Guggen", "The next Biennial should take place in the immediate future. “I appreciate the invitation to participate in the upcoming exhibition, but I want to emphasize that this is a development project,” Matteo said. “I want to stress that this exhibition is not about the exhibition of my art, but a development of the art.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Gerald Willeford as its next dean of arts and design. He will lead the institution through its transition to a four-year, two-phase model as it transitions from a board chair to a dean. In a statement, Willeford said: “I’m honored to be asked to lead the MFA through this transition, and excited to begin working with the community to shape the future of the museum.”The MFA Board of Trustees also appointed Kathryn Snyder as interim dean of art, design, and design-focused programs. Snyder will serve as interim chair of the institution until a successor is hired.“I’m eager to play a central role in shaping the MFA’s future as an art museum,” Willeford said in a statement. “I�", "The next Biennial should begin as soon as possible for the architecture of a site, with the aim of reopening the exhibition in a few months. The exhibition will then continue its current programme of performances and exhibitions in a number of other cities in the country, beginning with the Art’s first exhibition in the country, “Lincoln’s Place,” in April 2021.\n\n\nThe museum’s collection and collection of works by artists such as Paul Gauguin, Pierre-Auguste Renoir, and Edvard Munch, among others, is expected to be sold off to a private collector at an auction in New York next month. The institution was set to begin the process of shutting down following a $5.2 billion expansion, but the project was stalled after the French government ordered a shutdown of the entire country\u0097the country was forced to reinstall the entire national art museum complex, known as the Centre Pompidou, in an attempt to protect the collection.The auction house Lévy Gorvy, which has partnered with Christie’s since 2016 to organize the major sale, had originally held the rights to the collection for five years. When the center reopened following a major renovation\u0097its name changed", "The next Biennial should be in April 2021.  The 2020 edition will be held at the Museum of Modern Art in New York. The 2021 edition will be held at the Museum of Contemporary Art in the United States of America (MCA) in Los Angeles. For the 2020 biennial, the institution will present a selection of works by artists in the chronological order of their birth\u0097from Pablo Picasso to Cyril Connolly, and will introduce a new series of lectures on contemporary art. The exhibition will also include the first major retrospective of Carlos Araujo\u0097Franz Klimt, “In Praise of Life\u0097a collaboration with artist Wangechi Mutu.”The exhibition will be inaugurated by a public installation of four new works by Klimt, which will be presented on January 28, 2020, at the Contemporary Art Museum Miami (CAMM). The work, “The Night Sky,” was commissioned by artist Mimi Alemu’s cousin, Asif Ali, and was originally installed in a gallery in the city of Jumex, in the also-rural province of Kano, in 1976. Since its installation, the piece has been", "The next Biennial should take place in 2020, although in what capacity remains to be seen. Until now, the museum has been focused on revamping its existing campus and building a new facility. In March of 2020, new director Andrej Peić announced that the museum would move forward with the reopening of the institution. Peić announced his plans to the press, but he later backpedaled, saying that the decision to close the museum was not related to the March 19 incident. In a letter to the public, Peić wrote: “I want to emphasize that the museum is not in a position to predict how events will develop, nor would I be at this moment if this decision was not taken.” The letter concluded with the words “Together, we can make history.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has added three new artists to its list of donors: Sabrina D. Greenfield, Cara Flores, and Grace Kelly. The acquisition of the works was made possible through a $50,000 grant from longtime donor RCA.“The board is incredibly grateful to all of the donors who have made this possible,” said David S", "The next Biennial should be staged in 2020 and would explore the history of the exhibition, its participants and the impact of the exhibition on their lives and works.\n\n\nThe British-based arts organization the Palais de Tokyo in Paris has received a donation of $7.5 million from the billionaire collector Willem de Kooning, who has a private collection of more than 300 works, in an effort to support French painter Etienne Léger, who is currently fighting for his life after being diagnosed with cancer last November. In the French Cultural Capital, a ceremony took place on Monday, May 22, to officially receive the funds, which are estimated to total several hundred million euros.According to the New York Times, the Palais de Tokyo is one of several Parisian galleries that have benefitted from the proceeds of the sale of works by the late artist. The Louvre and the Centre Pompidou are also among those that have recently placed works on display in the city. The collection comprises works from the late twentieth and early twenty-first centuries, including works made during a time when French Muslim immigrants were still considered exotic and depressing by many, and include works by early modernists like Pierre-Auguste Renoir and the late French", "The next Biennial should take place right in the heart of Toronto, curated by Sarah Sze. The invitation says the event will be a celebration of the city and its people. If you go, you'll discover that the most vibrant of cities, that has created an enormous ripple effect in the art world. It will also feature original works by fewer than thirty artists, including the private exhibition group Open Eye, whose Joshua Foerster-designed installation will be on view until January 29.Thursday, January 29, 2019Opening Reception: 9 AM “To the City of Toronto’s City Hall,” 7 PM Opening Reception: 9 AM “To the People of Toronto” Opening Reception: 9 AM “To the Arts’ People’s City Hall,” 7 PM Opening Reception: 9 AM “To the Arts’ People’s Cities,” 6 PM The upcoming show will be a joint project between the City of Toronto and the Toronto Art Gallery, who are also collaborating on a new public sculpture garden designed by architect Frank Gehry. Both institutions are collaborating on the project, called the City for All Seasons, in partnership with the National", "The next Biennial should be held in 2020. Maclean Gallery, the Museum of Modern Art, the Duke Art Gallery, and the Metropolitan Museum of Art have all announced plans to reschedule. The Metropolitan Museum of Art, which has not yet announced whether it will hold an exhibition in 2021, will also not be canceled. Alexandra Lee, the director and CEO of the Museum of Modern Art, told Artnet that the museum has been working toward rescheduling since 2018, when Hurricane Maria hit Puerto Rico. She said that the Met’s work, which is currently on display in “Robert Irwin: Storm King” (2019), was not impacted because of the hurricane. “I’m hopeful that we will still be able to host a show in 2021, but it will be in a way that will allow us to focus on the art.”Lee added that the recent outbreak of Covid-19 in the US, where more than 128 cases have been confirmed, has forced the Met to consider how it might move forward with exhibitions without interruption. “If the world were to end tomorrow, and we were to suspend travel to and from the US, we’d like to think that we would", "The next Biennial should be held in December 2020. It will also serve as the site of the exhibition “Amor: The Case of the Sixth-Grade Girls” (2019) and the exhibition “Stories we Tell.” The 2020 edition will focus on the Parisian Bourse, with a co-curated by photographer Michael Wieder, curator Michel Houellebecq, and sculptor Henri Bechès.The 2019 edition, titled “Arts and Culture,” is set to open at the Museo de Arte Contemporáneo Madrid (MASM), on December 4. The full list of participating artists is as follows:Mohammed Ali (United Arab Emirates)Alyson Abramović (United Arab Emirates)Diana Al-Hadid (United States)Laurie Anderson (United States)Hannah Black (United States)Laurie Ballenger (France)Diane Ballenger (France)Laurie Boesky (United States)Hannah Cook (United States)Laurie Bianchi (United States)Jenny Boyer (United States)Hannah D'Angelo (United States)Laurie Desmarais (United"]