["The next Biennial should focus on the history of contemporary art, with an emphasis on how the decline and fall of the former imperial ruler, the late King Leopold II, shaped the present-day art landscape in Hong Kong. The theme of the event is “Revealing the Past: Hong Kong in the Twenty-First Century.”\n\n\nArt historian and curator William Eggleston, a longtime curator and writer who curated the first Biennial of Contemporary Art (2019), will step down from his post at the Metropolitan Museum of Art in New York after serving as curator of the second one, “Theatrum Gloriana.” Eggleston, who has curated exhibitions at both the US and Chinese embassies in Hong Kong, will continue to work with artist and art historians on the exhibition series.“William Eggleston was the driving force behind the later stages of the five-year, multi-institution, multi-venue, and multi-platform exhibition Theatrum and the function of the artist’s body. He was instrumental in developing a new series of exhibitions that would explore contemporary art from the perspective of artist and historian and become the basis for the development of an international audience for contemporary art.”", "The next Biennial should be held in 2021. Photo: Kofi Annan , Courtesy of the artist.\n\n\nThe Museum of Modern Art (MoMA) has suspended a planned retrospective of Chinese artist Yan Shi, whose large-scale urban settings often included the pieces in a painting-like style, after receiving a letter from a collection of thirty Shi works that declared its intention to sell the works.“The exhibition has been on indefinite hiatus for some time now, and we failed to anticipate the exhibition’s resumption,” said Barbara Avitollo, the executive director of the collection, which consists of seventy works—including works by Ai Weiwei, Sadie Frost, and Frank Gehry—and is currently on display in the exhibition “Be/longing” (2017–18).Commenting on the exhibition, which will close on February 15, 2020, MoMA director Adam D. Weinberg said: “For more than two decades, Yan Shi has been central to the work of Chinese artists and has been an essential platform for bringing Chinese contemporary art to the United States. We were thrilled to be able to present his work at the museum. We know it is a landmark exhibition and a powerful symbol for the region and", "The next Biennial should consist of a series of lectures and other activities that examine the interconnected ways in which art history is redefined and reinterpreted through the lens of our times and the social, ecological, and political challenges that we face. The theme of the next Biennial should be “the future of art.”\n\n\nTen years after the London-based, nonprofit organization People for the Ethical Treatment of Animals (PETA) and the British Museum received a massive $100 million donation from a group of wealthy collectors in an effort to save the critically endangered northern spotted owl—the species was recently listed as critically endangered by the International Union for Conservation of Nature (IUCN)—they remain at risk of the bird’s extinction.According to the New York Times, the £110 million PETA campaign was led by John McAllister, a former director of Tate Britain and an associate at the law firm Mayer Levin. “Tate is committed to using all of its resources to try to save this iconic bird,” McAllister said in an interview with the New York Times. “It is an extremely rare case where a group of individuals have been able to come together to try to save an animal. It is an", "The next Biennial should be held in 2022, when the exhibition will be presented by the Danish company Deakin.\n\n\nThe Skopje Biennial, which was scheduled to run from March 17 to March 21, 2020, has been postponed due to the Covid-19 outbreak. Its twenty-second edition, which was originally set to take place March 19 to March 21, was originally slated to be held in March. It was postponed again in April, when it was announced that the twenty-third edition would be held in June.The event will now be held in June 2019. The 2020 edition will be moved to July, with the 2021 edition to follow. In a statement, Skopje city councilors said: “Given the current situation, it is impossible to know when the Skopje Biennial will resume. However, the decision to postpone the event was made in the interest of the city’s cultural and cultural heritage, as well as for the good of the event.”The Skopje Contemporary Art Centre (SKAC), which was set to host the event, has also announced that it will postpone its June 30 attempt to open as planned. The news follows a furore sparked by artist Lars-", "The next Biennial should take place in 2020.\n\n\nThe Metropolitan Museum of Art in New York has hired five artists to the 2020 iteration of the Met Galerie, which will mark its thirteenth year with the exhibition “Between the Land and the Sea,” which will run March 9–March 10, 2020. Titled “The Fifth Wave,” the exhibition will include work by twenty-eight artists, including Sacha Yanow, F. S. Kastej, and Tadeusz Kereńc. It will also introduce the first-ever solo shows by female artists in Poland and will feature the works of one hundred artists from twenty-eight jurisdictions from nineteen countries.“We are delighted to welcome these artists to the new format and to present their work in the new way,” said curator and director Daniel H. Weiss. “Their work is timely as we confront the challenges and innovations presented by climate change and climate disruption, and we anticipate their contributions to the exhibition.”The exhibition will showcase the work of the fifty-two artists who have received the BAPG Award for their “Between the Land and the Sea” and will highlight their respective journeys between the continents since 1961", "The next Biennial should be held in 2020.\n\n\nThe Ballet Theater in New York City has received a significant donation of $15 million from Haim and Annette Wallach, the founders of the eponymous New York City arts incubator NEA. The gift brings the total sum raised by the company, which has been in existence since the late 1980s, to $36 million. The donation also includes a $5 million gift from artist-activist and educator Martin Scorsese, along with a collection of works by Sol LeWitt, Margo Price, Stella Adler, and other notable figures in American ballet.The gift was made in the name of the Wallach brothers, who have been working together for more than three decades to create a new stage for American dance. The new venue will be called the Ballet at Rockefeller Center. The Wallachs first invested in the company with a $5 million investment in 2014. Since then, the company has raised more than $100 million for its development and expansion, and has staged more than twenty-five performances. The company has also become a significant force in the New York City arts scene. The company has staged performances at the Metropolitan Opera House, the Metropolitan Opera, the Metropolitan Opera", "The next Biennial should begin as soon as possible to address the financial crisis, focusing on the collection, preservation, and exhibition of artworks made in the crisis, including the exhibition of work by artists who were affected by the outbreak. The current exhibition, “Ricardo Galeano: The Overlook,” opens on September 29 and runs until November 15.The museum will also begin welcoming visitors from the United Kingdom and the United States by the end of the month. It is planning to open a branch in Jerusalem in 2021.\n\n\nArtist and writer Cécile B. Evans has been named the twenty-sixtieth president of the Museum of Contemporary Art (MoCA), St. Louis. During her seven-year term, she has overseen the expansion of the museum’s collection and presented more than forty-five exhibitions, including “Anton Kern: The Artists’ Place” (2017), “Cécile B. Evans: The Importance of Being: Art in Motion” (2015), “Feminine Action” (2014), and “The Art of Not Getting Tired” (2013). During her tenure, she has also overseen the acquisition of more than seven hundred", "The next Biennial should be in 2021, and the last Art Basel Hong Kong will be held in 2022. “With the recent suspension of the exhibition until further notice, we felt it was the right time to re-evaluate the long-term future of the exhibition,” said curator Christian Fortmann. “We are updating our program and our exhibition experiences to reflect the current needs and needs of our audience.”Commenting on the changes, the organizers said: “The new pavilion and the new exhibition will bring together an altogether new group of artists, and it will be a great challenge for the existing artists to be able to present a programme that will be able to fulfill their visions and to bring new ideas and new perspectives to the exhibition. We are committed to them both and plan to keep them together. Nevertheless, it is important to stress that the programme of the new pavilion and the new exhibition will be well prepared for the exhibitors.”The twenty-fifth edition of the Biennial Hong Kong will take place at the Hong Kong Art Museum (HWM) from September 15 to September 21, 2021. \n\n\nOn Tuesday, British artist Rineke Dijkstra published an open letter in which she", "The next Biennial should be held in 2020.“The best way forward for the Biennial is to focus on the collection of its earliest works and on the future of the collection,” said Kunsthal Aarhus curator Joost Rudens, adding that the events would include exhibitions and workshops, concerts, performances, and other events in addition to meetings with selected artists. The upcoming instalment will be held at the museum in the late spring of 2020.\n\n\nThe Museum of Modern Art (MoMA) has appointed Grace Gotti as its next director and CEO. Gotti joins the institution from the New Museum, where she has served as interim director since April. During her tenure, Gotti has helped MoMA navigate its reorganization as the museum has evolved into a larger institution encompassing more galleries and with it, more opportunities for the museum’s artists to exhibit and curate. Gotti will assume her new responsibilities on October 23.“I’ve long been a fan of Grace’s work,” said David Guggenheim, chair of the New Museum’s board of trustees. “Her goal throughout her tenure has been to develop and deliver compelling exhibitions that reflect the sophisticated and inter", "The next Biennial should take place in the spring of 2020. We look forward to welcoming you to the Museum.\n\n\nThe Portuguese artist, painter, and educator Carlos Goya is suing the Fondazione Cinéma, the city of Cuiaba, in the southern city of Porto, in an attempt to prevent the museum from moving to the Museu de Arte de São Paulo, the city of São Paulo, Brazil, following its acquisition in 2016. The artist alleges that the museum plans on cutting back on its exhibitions and on the programmatic activities of the museum.“The Museum committed an act of aggression by acquiring the Ponte de São Paulo as a new center for contemporary culture,” Goya’s lawyer, Silvana Pindell, told the Art Newspaper. “The city council received a written request from the artist a few days before the acquisition to dissolve the institution’s existing contract. The decision was controversial at first because it gave the artist and the museum the opportunity to keep the money from the sale. But it was the only option left to the city council after the city won the right to buy the land.”The artist is suing the city of São Paulo,", "The next Biennial should be staged in 2019, according to an announcement from the Ministry of Culture, Arts, and Science (MoCAS) of Japan. The 2019 event will be the last of the thirty-three-year-old exhibition, which has been held in various locations in Tokyo, including the Toko Museum and Botanical Gardens, and will close in March 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston, Massachusetts, has appointed Kiera Carothers as its next executive director. She succeeds Carrie Brown, who departed the museum in March 2019 to head the Metropolitan Museum of Art in New York, and will assume her responsibilities in April.“We are thrilled to welcome Kiera to the MFA,” said director Joseph Ratner. “Kiera has worked hard to integrate her curatorial practice to meet the needs of the museum, while redefining how we think about the role of art in the contemporary world. She brings a wealth of experience and knowledge to the MFA, and we look forward to her continuing to advance and strengthen the museum’s practice.”Carothers began her career at the museum as an assistant curatorial curator in 1989. She went on to serve as the", "The next Biennial should be held in 2021. The 2020 edition, titled The Century of Resistance, was held in Los Angeles in March and featured work by forty-one artists, including Anthony Kiedis, Dave Hullfish, Michael Komaroff, Matthew Marks, Robert Mahy, and Arto Nesvig.\n\n\nThe Museum of Modern Art (MoMA) in New York has launched a new $2 million initiative to support artists and art institutions across the city impacted by the coronavirus. The program, called The Artist's Pledge, will provide financial relief to ten artists and five art institutions: the Brooklyn Museum, the Bronx Museum of the Arts; the Brooklyn Museum and the Bronx Museum of the Arts, the Bronx; the Museum of Modern Art, the Museum of Modern Art, and the Bronx; the National Gallery of Art, the National Gallery of Art, and the Museum of Modern Art, the Museum of Modern Art, and the Bronx; and the Metropolitan Museum of Art.Starting in the fall of 2021, the initiative will offer up to $2 million to support artistic practices, including artistic production, installation, performance, and display. Pledges will be limited to $1", "The next Biennial should focus on the history of Québec’s Indigenous art, and would re-envision the history of the Michel-François Biennale, which opened on May 3, 1951 and ran for twelve months. The event would also present a new selection of works by artists from Indigenous communities in the Americas. The exhibition would be hosted at the Jean Drapeau building, a former Franciscan friary, and would include artworks by forty-five artists, including Jean-Jacques Julien, Hélène Béchard, and William Greider. The inaugural exhibition would be a presentation of work by women artists from the Pacific Northwest, and “The Winter War” was the name of the first exhibition.The plan for the Biennial has faced backlash from those who believe that the Biennale cannot be staged in a city where the newest pandemic outbreak—disease-related deaths have surpassed those from the novel coronavirus—and where the death toll probably exceeds one hundred. The cancellation has also been branded a “disaster.” The event’s organizers have claimed that the cost of staging the exhibition has already been estimated at $", "The next Biennial should take place in the city of Hamburg in 2021. The 2020 edition will be staged by the Hamburg-based museum, which will receive $3.5 million from the state of North Rhine-Westphalia. The museum’s 2019 edition, titled “Sensations of Life,” was held in the city of Kassel. The gallery also represents artists such as Wolfgang Amadeus, A.J. Antuna, and Rirkrit Tiravanija. In 2018, the show was awarded the prestigious Hugo Boss Prize. The gallery also has its own space in a new urban, mixed-use development, the 'Kunsthalle Biennale,' in the city of Stuttgart.\n\n\nThe Philip Johnson Foundation for the Arts has announced that Maren Fung, whose groundbreaking, multi-disciplinary practice drew from the cultural and institutional histories of California, Oregon, and New Mexico, was awarded the 2019–20 Mark S. Allen Award for Lifetime Achievement. Funded by donor Philip Johnson, the honor comes with a monetary prize of $750,000. The Allen Award is one of several lifetime achievement awards given by Johnson that are presented in conjunction with the Mark S. Allen Memorial", "The next Biennial should see the work of around thirty artists, including Doug Aitken, Benjamin Britten, Cécile Bochereau, Robert Irwin, and Simon Lorn.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced the opening of a new digital research center dedicated to the art of this century. Called the Anderson Center, the center will be housed in the former site of the former Evergreen State College, where artist-run incubators such as the Space Between, a space in Central Park, and the Monadnock Gallery of Art, a nonprofit that strives to develop new works, will work with artists to present projects that examine the histories and social and political histories of African American art.“The Anderson Center will provide a new platform for the studies and exhibitions of contemporary art, bringing to light the voices, visions, and practices of artists of color, both nationally and internationally recognized, who have shaped the movement for racial justice and social justice in America and the world,” said Michael Graham, chair of the museum’s board of trustees.The center will be led by Jon Paretsky, a curator and writer; Louise Arbour, a curator and educator; and Michael Jackson,", "The next Biennial should be a gift to the city of Aberdeen, the National Maritime Museum, and the National Museum of Scotland, the National Maritime Museum and the Science Gallery, and will open in 2021.\n\n\nThe British Museum (BMI), which has been working toward revamping its Anish Kapoor–designed building in London’s Grosvenor House for several years, is raising funds for the overhaul of its building and the restoration of its gardens. The renovation, which will include the conservation of the building’s original roof, is expected to cost $150 million and will begin in the summer of 2021. The renovation is part of a major $500 million project to modernize the museum, which was launched in 1991 and has recently been undergoing a major expansion.“This is a major project for the museum and we are working hard to ensure that it will reflect the future vision of the museum as it moves into the next phase of its refurbishment,” said museum director Maria Balshaw. “This is an ambitious project and we are working with a long-term partner to understand how we can make the work of restoring the building and gardens a reality in the future. The reconstruction of the Anish Kapoor–designed", "The next Biennial should focus on how the philosophy of art will be presented in the twentieth and twenty-first centuries. The first part of the program will be a selection of essays on the theme “Life and Art in the Twentieth Century” and will run from January 17 to January 19. The second part—which will take place two weeks after the first part—will examine the theme Life and the Creative Process and will be held from January 20 to January 23. The theme for the fifth and final part of the program, “Art and Cinema” will feature the work of fifty artists and will be held from March 21 to March 23.“The Biennial is a great creative project that will draw together artists and thinkers from all over the world to create a major exchange of ideas and experiences between contemporary art and contemporary life,” said Osei Neugroschel, director of the Biennale. “The partnership between Katz and the Biennale’s team embodies how the partnership between the artist and the arts can enrich and inspire each other and form the base of a vibrant and vibrant culture in the city of Basel.”\n\n\nThe Saatchi Gallery in New York has announced its representation of", "The next Biennial should be in 2021. For a full list of upcoming shows, visit the Art Newspaper. \n\n\nThe Ohio Arts Center (OAC) in Columbus has appointed Anne-Marie Nellor as its new deputy director and chief curator. Nellor, who has served as the OAC’s curator of modern and contemporary art since 2015, will be responsible for the care and management of the center’s permanent collection. The appointment was made by executive director John Hutton.During her tenure at the OAC, Nellor has organized exhibitions that include “The Runaway Railroad,” “The End of the American Dream: American Art in the 1940s” (2018), “Artist Suspense: Contemporary Art in the 1950s” (2015), “The Illusionists: Fall 1966” (2018), and “The Artist’s Body: Women Artists in Modern Art” (2015). She also edited “The Artist’s Body: Women Artists in Modern Art” (2015–16).The position is the second of two terms at the OAC, which is located at 1111 East Ninth Street in Columbus and has an endowment of $36", "The next Biennial should be held in 2019. With the break of the second half of the calendar, the 2019 edition of the fair will return to the museum in 2021, with the first event being held in 2017.The new exhibition will be titled “Feminine Balance: Art and Gender in Motion” and will represent the first time that the exhibition will be inaugurated by a woman as head of a retrospective exhibition. The first artist to appear in the exhibition was Romila Thapar, who is known for her works such as the “Shelter,” 2007, which is a female ghost story built around twin sisters, one of them a feminist icon.The 2019 fair, which was organized by the Hong Kong–based collective Gamsu and curated by curator and food writer Lee Haitong, was beaten by the Hong Kong independent film festival Hong Kong Film Festival this year in the Hong Kong Film Awards.Hong Kong’s National Museum of Fine Arts (NHFA), which has not yet announced its future plans for the space, is also facing a backlash from the art world. The Museum of Modern Art (MoMA) in New York has reportedly received ten thousand applications for the 2020 edition of the NHFA,", "The next Biennial should be held in 2022.\n\n\nThe Edmonsons Foundation has announced that it will return $6 million to the descendants of Mabel Edmond, the first woman to ever head the Smithsonian Institution in Washington, DC, in a major gesture of respect for their legacy. The gift, made in 1925, was made in recognition of the Edmonsons’ contributions to the arts. “The mission of the Edmonsons Foundation is to offer opportunities for people to make meaningful contributions to the arts,” said David Edmonsons, the foundation’s chairman. “With this gift, the Edmonsons family will contribute back to the arts for further generations by transforming the Edmonsons Collection into a permanent home for the collections of the Smithsonian Institution.”The gift includes a one-hundred percent revamp of the Edmonsons Collection building, which was completed in 1925 and finished in 1947, including the creation of an open-air platform for exhibitions, the renovation of the building’s interior, and the addition of a new public gathering space. The art historian Tracey Edmonsons and her daughter, Georgia, are donating the works of Jules and Paul Picasso, Henri Matisse,", "The next Biennial should be held in the fall of 2021, with a presentation of the exhibition “Art and the Nation: Beyond the Mask of Death” at the Philadelphia Museum of Art in 2021. The ten-city run of the exhibition will conclude in the spring of 2022.The theme of the 2019 event was “The Role of the Body in the Context of Modernity” and the first section, entitled “The Body and Body Politics,” was devoted to the body politic in relation to the history of resistance. “The Body Politics: Resistance and the Body” will be on view until October 27.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has appointed Sarah H. Crown as its next commissioner. In her new position, which is funded by a $2.25 billion budget line item in the city’s budget bill for the 2021 fiscal year, Crown will assume her responsibilities from Marcia Diné, who will retire after serving as commissioner for the city’s Department of Cultural Affairs from March 2019 to March 2021. Crown will assume her responsibilities on July 1.“Sarah H. Crown is an experienced, highly respected leader in the cultural sector who has been instrumental in", "The next Biennial should be held in December 2020.\n\n\nThe MCA Center for Art and Architecture (MCA) in New York has announced that the museum will welcome back the Merry Mather Collection, the group of artists and collectors who collectively shuttered their doors in protest of the Republican National Convention in Cleveland in July.The institution will honor the artists by creating a new public space in the center, which housed the collection for more than forty years, with a new exhibition on the group’s work in December 2020. MCA director Carmel Mollari has described the work as “the biggest single initiative of our work in the Center.”“The MCA’s commitment to supporting the artists and their legacy is a central tenet of our work,” MCA executive director Michael Oreskes said in a statement. “The MCA’s stunning new building, the MCA Palazzo Arletto, is dedicated to the collection and the integrity of the collection. This work celebrates the legacy of a group of women who collectively created a new kind of work in the 1960s, and whose work, in turn, is a central thread through our collections.”The MCA", "The next Biennial should be held in 2021. The committee is asking representatives of the arts and cultural sectors to be included in the design and construction of the exhibition. Dimensions’ combined, contemporary, and progressive, and its large-scale installations, such as the Biennial of the City of New York in 2010 and “The Story of Us,” 2014, both in the Bronx, are creating new opportunities for direct engagement with and innovation in the arts.For now, the new pavilion will house both the exhibition and the exhibition’s inaugural installation, “The Art of Life: Artists in Transition.” It will also host the 2021 exhibition “Tracy Max” and will host the artist-in-residence, a selection of his works, in the inaugural exhibition “Sissies: a show of Cindy Sherman” in the fall of 2020.\n\n\nThe nonprofit Art Fund announced that it has awarded $13 million in grants to nineteen artists in the twenty-first century, which celebrate their achievements through exhibitions, residencies, classes, and other programs. The awardees are Diana Al-Hadid, Tim Bernhard, Larry Achiampong, Andrea", "The next Biennial should take place in the Marina del Corté in January 2020 and will address themes such as “ecological reconstruction” and “creative destruction” as well as include a selection of works by artists residing in the city. The museum is currently working on its next edition, which will examine the role of art and design in the ’80s and ’90s in New York City and will launch in 2021.“The new exhibition will be an extension of the series ‘Art as a System’ that is currently staged at the Museum of Modern Art in New York, and will focus on the work of artists whose work addresses themes of place, history, and the body,” said curator Anna C. Zobel, who curated the exhibition. “It will also include works that address issues and issues of identity as documented in the work of the participants. The exhibition will be marked by a new and immersive experience created specifically for the exhibition.”\n\n\nThe Royal Academy of Arts (RA) in London has appointed a new president and CEO, who will assume his post in January 2020 and will be based in the city. The news comes after Italian curator Giorgio Trif", "The next Biennial should aim to create a more connected and accessible experience, and to focus on the full range of artistic activity within the city. It should be a celebration of the city’s rich history, culture, and vitality, and should draw from the city’s rich artistic heritage.”Among the themes for the 2020 edition are “living together, life on earth.” It will include the experimental work of internationally-renowned artist Dan & Zoya, whose work was featured in the 2017 Venice Biennale, and will highlight the city’s rich tapestry, which encompasses art, architecture, and design. Most of the works in the exhibition are not currently on display in London, but will be shown in the new exhibition “Photography in London,” which will open on September 14. The show will have the same three-act format as the biennial, but will be structured in a way that allows for a more immersive experience. “Photography in London’s future is uncertain,” said David Cameron. “We need a new and bold vision for photography in London, and the exhibition series is the best way to bring that vision to life. The series", "The next Biennial should be held in 2021. “The future of art and design is at stake,” said Vittorio Cicutto of the ACM. “As art history scholars, we are faced with an unprecedented situation in which the collections of Italy’s three great universities, the Institute of Design and Art, the Institute of Contemporary Art, and the Centre for Contemporary Art, are being demolished in a single day. Now we must ensure that the archaeological sites of the Republic of Venice are preserved and that they are properly commemorated. The archaeological site of the Pantheon in Rome is a special monument to the memory of the victims of the Third Reich. The new archaeological commission, which will be headed by architect Claudio Marini, will have the responsibility of making this happen.”“The Institute of Design and Art is truly a remarkable institution,” said Stefano Scarpetta, chair of the board of trustees and president of ACM. “Its collection, exhibitions, and program have made it a standard-bearer for the spirit of Italy, and have been instrumental in exposing the broad and distinctive influence of design in Italian culture. ACM will always be a powerful institution for the advancement of design in", "The next Biennial should, at a minimum, include two illustrative works on the theme “Synthetic Beauty”\u0097an open letter from artists such as Nina d’Osso, Yinka Shonibare, and Yuki Tanaka\u0097and should, ideally, feature two artists from the same family. DiS was also asked to create a “synthetic art” series for the biennial and is working on developing a new work to represent the history of the artist group in Japan. In an attempt to emphasize the importance of the biennial to the museum, Tokyo Metropolitan Museum of Art director Tatsuo Kikuchi, who has been involved with the group for twenty years, signed an open letter in June. In it, he wrote: “The Biennial is an essential step in the history of the museum. . . . And over the centuries it has become one of the defining features of Tokyo Metropolitan Museum of Art. I wish to extend my gratitude to the director of the Museum, Takashi Kato, and to those who have helped develop this year’s exhibition.”\n\n\nThe Rubin Museum of Art in New York has received a gift of three decades of Paul Gaugu", "The next Biennial should be held in the autumn of 2020.\n\n\nThe British artist Gerald of Wales has died at age ninety-two. His work, which explores the human condition via his body, is housed in the collections of the Tate, the Getty, and the Metropolitan Museum of Art. The Welshman received a lifetime achievement award at the London Biennial for his lifetime achievement in 1961.Born in London in 1932, Welsh began illustrating at an early age. By the time he was thirteen, he had become the first to model his own physique after that of Charles Atkins. He became known for his work, which blends anthropomorphism and pragmatism, drawing inspiration from such subjects as architecture, landscape, and music. The most recent exhibition featuring his work was at this year’s Venice Biennale, which opened on March 6.Along with his contemporaries such as Jean-Luc Godard, Ingmar Bergman, and Douglas Mina, Wales experimented with the concept of a body of work as a means of expressing a larger message. In his own words, the work of a body is a “message from God about reality and about what is possible.” Some of his most famous works, which are housed in the Getty’", "The next Biennial should take place in the fall of 2022. The entire October/November schedule will be recreated, with the addition of performances, lectures, books, and exhibitions. \n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) in Philadelphia announced today that it will not renew contracts with the police or municipal governments in the city, citing budget cuts and a decline in attendance. The move follows a sharp fall in attendance and the arrest of more than 1,500 people at the hands of the Pennsylvania State Police between April and September.The Pennsylvania Union Leader reports that PAFA’s director of security, Susan Glickman, said that the police force is currently responsible for 40 percent of all disciplinary actions taken by the academy, which has a minimum of sixty-four students. “The academy is in a precarious financial situation,” she told the newspaper. “The closure of PAFA will mean fewer opportunities for our students to work with the police. It will also mean that our educators will have to find new ways to address the growing crisis of inequality and police brutality in America.”Cuts at the PAFA include a hiring freeze and a hiring freeze for the division that works with youth. It also plans to lay off", "The next Biennial should take place at the Place de la République in Paris in June 2020. The exhibition will mark the 100th anniversary of the publication of Le Monde. \n\n\nThe University of Washington in Seattle announced today that it has received a gift of twenty-six works from the artist Michael Kors. The gift, which includes work from several of Kors’s solo exhibitions at the University of Washington, and includes a selection of works from the artist’s residency at the museum as well as works from the Seattle Asian Art Museum (SAAM), the Museum of Fine Arts, and the Museum of Contemporary Art.The gift includes works by Kors, who was born in Kansas City, Missouri, in 1936 and lives in Seattle with his wife and daughter. The Korss works are currently on display in “Kor’s Works at SAAM,” curated by veteran curators Jeremy Rosenfeld and Susan Silver. The gift also includes a selection of works from the artist’s residency at the Museum of Contemporary Art, which will open to the public in May.“A while back, we were able to receive a great gift from Michael Kors,” said Julie Tarabay, senior", "The next Biennial should focus on the issues surrounding the “Middle East and the Fallacies”\u0097particularly with regard to the “Arab Spring,”” as well as “the relationship between Islam and democracy,” as a way to better understand contemporary issues.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it is opening an independent, not-for-profit, research center focused solely on the works of African American artists in the city. The center, which will be housed in a former steel mill in an industrial district of Los Angeles, will offer a free primary source of information on the state of the art of the art authored by African Americans. The center will focus on the history of art from the African diaspora and will feature a collection of works by artists whose work is currently on display at the museum.“The MOCA Research Center will be dedicated to the history and the development of works by African Americans, who comprise a significant and increasing portion of the American art canon, and will offer the public a comprehensive, relevant, and accessible place to view these works,” said Elizabeth Bingham, director of the museum. “As we previously announced, we are", "The next Biennial should be held in 2021.  Bretton Taveras, director of the Natural History Museum in London, told the Art Newspaper: “I am really excited to see how the National Galleries of Scotland will celebrate its 150th anniversary next year. A world-class institution founded by passionate supporters, the National Gallery of Scotland is in the process of building a new that will reflect the charm of the National Museum Glasgow and the National Maritime Museum in Southampton. The National Art School in New York is also working hard to create a new institution that can better serve the rising generation of artists in our city. We are now in the process of selecting the architecture for the new National Gallery of Art, which will be complemented by a new and exciting development program. We look forward to creating a new exhibition space for the many talented artists who are currently under-recognized and underrecognized elsewhere in the world.”\n\n\nThe National Gallery of India (NIA) in New Delhi has appointed Aruna Dutt as the new director of curatorial affairs. Dutt joins the institution from the Delhi-headquarters of the National Gallery of Art (NGA), where she has been serving as director since January 2017. Dutt", "The next Biennial should take place in the city of Bogotá, the capital of the Central American country of El Salvador, in December 2021. The exhibition marks the first time that the institution has staged a major art event in the country. Bogotá has been working to secure funding for the Biennial since 2016, when the institution held an exhibition of works by José Antonio Reyes de Jesus Acosta, Íñigo Olivera, Ricardo Rocha, José Antonio Peña and Ricardo Veiga.The next Biennial will take place at the Centro de Artes in Bogotá, between April and June 2022. The upcoming edition will feature twenty-four works by artists from Central and South America and the Caribbean. The Los Angeles County Museum of Art is preparing to reopen with a new exhibition of works by artists including Giancarlo Esposito, Tereza Gomes, and B. M. Hauser & Wirth. The opening of the new museum is slated for March 21–March 26.\n\n\n\n\n\n\nThe Wellcome Collection has announced the acquisition of the manuscript manuscripts of thirty-five works from the series Wurtz, which was first published in 1964 and", "The next Biennial should be held in Maryland in 2020.“I was stunned when I learned that the inaugural event, ‘Feminist Museum of Art, was being held in a building that was constructed with funds intended for the construction of a museum. I played no role in this decision, nor was there any intention to mislead or deceive,” said Harlan. “I am deeply saddened that this has come to light, and have begun an investigation into the matter. I will do everything in my power to find a solution that respects the thoughtful and thoughtful-of-the-best minds of the department and city of Chicago.” \n\n\nThe Vancouver Art Gallery (VAG) has appointed David Adjay, a Vancouver native, as its new deputy director and chief curator. He succeeds Jessica Stern, who has led the institution for twenty-six years and is slated to depart in March.“David is a seasoned curator who understands and appreciates the unique curatorial and curatorial needs of a contemporary art museum,” said VAG director Edward Izzard. “We are grateful to the board of trustees and to the board of directors for their confidence in David’s ability to carry out", "The next Biennial should take place in 2019, with the ambitious goal to present a new work every two years. The museum will also be reorganized in such a way that the biennial will be a continuous experience of the artworks that have been created by the institution in the last two years. The first exhibition of   “HELMUTT” will be held in the fall of 2020.\n\n\nThe stunningly beautiful and intricately detailed work, titled “Feminine and Mosaic”\u0097a collaboration between artist, theorist, and structural engineer, S.S. Rajagopal, and his colleague J.B. McDonnell, from the Fall of 2019 exhibition “The Sign of the Hour: Contemporary Art”\u0097has been selected as the winner of the Cooper-Hewitt & West End’s prizes for fiction and poetry. The awards, which are awarded by the Cooper-Hewitt & West End each year, recognize the contributions to the field of contemporary art made by one or more shortlisted artists. The ten shortlisted artists were: Body/Form, Amitry Glanvill, Elizabeth A. Hennessy, Adam Hairy,", "The next Biennial should be held in 2022, an additional exhibition in 2024, and the first exhibition in 2020, at the London Center for Contemporary Art (LCCA), which will open in 2023. The work of the two curators, Keisuke Takahashi (Japan) and Yoshisei Ikeda (Japan), is currently on display at the London Center for Contemporary Art.\n\n\nWillamette Week, the Seattle-based arts and culture organization, has announced that it is teaming up with the Seattle Art Museum (SAM) to present an exhibition of works by local artists, including Amara Abdal Figueroa, Wangechi Mutu, and Tanya and Andrew. The exhibition will take place simultaneously at both institutions and will run from March 21 to March 23. The opening will be marked by a virtual reality experience that will feature works by seven local artists.Based on a theme of the body, this exhibition will examine notions of body and the body “intersection” with a focus on contemporary bodies. Fabian Gilder, director of the Seattle Art Museum, said: “This is an exciting opportunity to create a new virtual reality experiences that will engage with", "The next Biennial should focus on the history and future of Indigenous art and surely will. Unfortunately, in the current climate, the Museum’s neglect of the art of our indigenous past is an embarrassment to the whole of Western New South Wales. We are committed to re-creating an environment for artists, scholars and the public to engage with our history and art.”The Australian Council of Science (ACC), which represents more than 1,400 academic, cultural and trade organizations in Australia, also called for an end to the exhibition-based academic program. The organization cited the exhibition-based model as a major reason for its cancellation in a statement, which was submitted to the ACMC last February.The statement reads: “This exhibition-based model is not sustainable in the long term and will not adequately reflect the richness and diversity of our contemporary world. Instead, it will only exacerbate the concerns and growing divisions over our past, especially our past as Indigenous peoples, and will undermine the very purpose of the ACMC.”In its statement, the ACC said: “It is the ACMC’s responsibility to ensure the future of the program, and this means that it must continue to be responsive to the needs of the contemporary world.", "The next Biennial should be held in 2021.”The museum received $5.4 million in $75 million from the sale of works by Frederick Mayhew and Owen W. Johnson in the $6.5 million exhibition, “The Man Who Fell to Earth,” which opened at the Museum of Modern Art in New York on May 6, 1916. The museum received $3.8 million for the newly restored “Aristotle” in the $4.5 million show, which will open in 2020. The Metropolitan Museum of Art, which recently completed the restoration of its Vincent Price building, will also likely receive $3 million from the sale of “The Artist” and “The Work of Art in Motion,” which were originally set to open in 2020 and 2021, respectively. The museum has ten years to raise the remaining funds for “The Artist” and the “The Work of Art in Motion,” which were salvaged from the three-story, fifty-one-thousand-work Metropolitan Museum of Art building in 1912. The works will be moved to the Metropolitan Museum of Art, and the rest of", "The next Biennial should focus on a “radical reconsideration of the nature of art and culture,” the organizers said. “This is a moment of universal crisis for art and culture. We must confront, question, and rethink the role of art, culture, and artmaking, in our communities, world, and the world beyond.” The 2019 edition of the DMA’s “Art in America,” which was curated by Kate Bradley, will open at the Smithsonian’s National Museum of American Art in Washington, DC, on August 29 and run through September 17.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Charles B. Stewart as the museum’s fourth director. In his new role, which is funded by a $50 million gift from artist-philanthropists Ed and Lorraine Robertson, Stewart will oversee the expansion and renovation of the museum’s holdings of early modern and modernist art and will spearhead the museum’s recently opened Ed Sullivan Gallery, a new contemporary art museum in the city.“Charles B. Stewart is a global leader in the field, having successfully led multiple institutions across the US and Europe, including the Metropolitan Museum", "The next Biennial should be announced early next year. In the meantime, there are plans to hold the first exhibition in the new format, Exo & Past, in the coming months, and to bring the art of the first-person perspective to the biennial stage.\n\n\nThe Oceana Art Museum in New York has received a gift of fifty-six works from the estate of the late American architect Frank Gehry. The works were donated by the Gehry family in the form of a collection that includes work by more than one thousand members that have not yet been formally identified.“Gehry and his family have been highly supportive of the museum over the years, donating dozens of works every year when he was alive,” David Kamin, the estate’s president and CEO, said. “The Gehry collection represents a critical moment in the history of American art and we are thrilled to bring this work to the Oceana.”The Gehrys have donated works since the museum’s founding in 1970 and have given the institution significant funding, including $3 million in support of the first exhibition in the new venue, “Frank Gehry: Architectural Vision.” This show, which will", "The next Biennial should focus on the history of the art and its production and will feature current and upcoming exhibitions and projects. The year 2020 will be the last year of the biennial’s current format. The 2019 cycle, “Bienal,” featured two exhibitions of work by Gabriel Boudicca​ (Chicago), “The Dueling Spires of St. Paul” (Moscow), and “The Sanguine Painted Girls of Rome,” (New York).\n\n\nThe Metropolitan Museum of Art in New York has closed its doors indefinitely after a fifteen-year run following a series of deadly riots in the city in which a white supremacist rally was held the night of February 25. The Metropolitan Museum of Art is the latest institution to be forced to shutter after it failed to prevent the deadly riots, which were sparked by the acquittal of George Floyd for the death of George Floyd Jr., a Black man who was killed by a white police officer while he was being placed under arrest for allegedly trying to use a fake Social Security number.Since the riots, which involved more than 1,600 people and left twenty-nine dead and hundreds injured, the museum has faced protests from local residents, the National Coalition", "The next Biennial should take place in 2020, with the first exhibition being titled Mariah and William, a joint project between the artists. Art works from the exhibition will be on show throughout the museum as part of a series of two- and three-day events.The sculpture program will be conducted by the Danish curator Tine Ola-Agbuz and the British artist Christopher Wool, with the support of American curator John Akomfrah. During the course of the next three years, the two men will construct a new work each year for the exhibition.“It’s an ambitious project to create a new work every year, and at the same time to create new experiences in the galleries, but given the current situation I think we’ll be able to pull it off,” said Ola-Agbuz. “It’s a long-term vision, but we can’t do that if we’re not able to have art in the galleries.”Wool added: “What we’re trying to do here is create a space where people can come together in a space that’s their own and where they can feel safe to go and have a", "The next Biennial should start shortly and conclude in September. The first exhibition, “Hiroshima” will be on view until October 17 and will be followed by the third exhibition, “Takashi Nara,” which will run from January 4 to January 5 in the same venue and will be organized as a duet with the new year.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has announced that the upcoming exhibition “Feminine” will feature work by a select group of female artists. The exhibition is curated by Jennifer Stapleton and Sophie Asaro, the curators of the Feminine, a twenty-two-year-old biennial that was directed by André Ai. The biennial will examine female empowerment through the lens of a feminist theory that posits that women have the responsibility of changing their own environments through direct action. “Feminine is an invitation to rethink the roles and responsibilities of women in our world,” said Stapleton. “This exhibition is a historical milestone for MoCA, as it marks the first time that the Museum of Contemporary Art (MoCA) has presented a female artist in its sixteen-year history.", "The next Biennial should be held in 2021 and will take place at the Metropolitan Museum of Art. The 2020 event, titled “Art & Labor” was curated by Amada Cruz, whose Subversive Art and Labor was one of the first exhibitions devoted exclusively to labor and labor-related topics. The 2020 exhibition will feature work by fifty-seven artists and will run until January 26, 2021. The biennial is supported in part with funds from the J. Paul Getty Trust and the Andrew W. Mellon Foundation. \n\n\nJoan White, a British textile artist whose intricate tapestries, stylized collages, and gestural installations often grapple with questions of materiality and social practice, has died at age eighty-eight at her home in London.Born in London in 1941 to a Welsh mother and American father, White first studied at the School of the Art Institute of Chicago (SICA), where she studied drawing and in the 1920s at the Serpentine Galleries in London. In the early 1950s, White moved to New York, where she worked on her first large-scale project, a series of 19-foot-by-20-foot picturesque silks that were exhibited at the Hammer Museum in 1984", "The next Biennial should be held in 2022.\n\n\nThe San Francisco Museum of Modern Art (SfMoMA) has added twenty-four artists to its board of directors, bringing the total number to sixty-six, including eleven international alumni, in a move that will ensure a more diverse portfolio for the institution.The board of directors comprised of David H. Pimentel, director of the Kendall Museum of Art in downtown Miami; David K. Duarte, director of the Kiwanis Art Museum in New York; and Anne-Sophie Pimentel, president and CEO of the Matador Art Museum in San Antonio.“The board of directors recognizes the significant and growing impact that the forty-six artists in the SfMoMA program have on contemporary art and the transformative impact that their scholarship has on an institution’s cultural landscape,” said board chair Carolyn Levey. “This is a moment of great change for the museum, and we are excited to see how this new structure will shape and enhance the board’s work as we work together to champion the institution’s collection, exhibitions, and programs.”Duarte added: “We have been working for some time to strengthen the board", "The next Biennial should be held in 2019. \n\nWhile the museum is planning a major renovation of its former space (it has been renovated twice before: in the 1960s and in the early 2000s), it did not release an architectural design for the building that would have accommodated the premiere contemporary art exhibition and the exhibition venue of the year. The plan, which would have opened in 2021 and run through 2024, is now in the hands of the 2019 and 2020 winners, which are working together to create a theme that will take years to develop. The next edition of the Biennale, curated by Yvonne Rainer and directed by Rebecca Watson, will take place in 2022.\n\n\nOn September 28, the Ministry of Culture and Sports (MCA) in Beijing announced that it will begin removing the remains of one of China’s most notorious ghost towns, the Shenyang Metropolitan Region, from the city’s public art. The dismantling of the Shenyang Art Museum and History Museum (SAFM), which is currently undergoing a major renovation, is part of a campaign to combat  “ghost towns” and boost tourism. Since the Chinese government first started removing cultural artifacts from urban areas in the", "The next Biennial should be in 2022. The institution is seeking an additional $120,000 for the 2020 edition and hopes to raise $160,000 for the 2021 and 2022 iterations. Engineering and Design Biennials: The first annual exhibition, which was hosted by the Swiss architect Dieter Zuijs, opened earlier this month at the Bauhaus and is currently on view until October 21. The next event, “Engineering and Design”, will focus specifically on the ongoing design and construction of the sustainable materials of the 21st century. “In the current context of the current crisis, we could not have chosen a more important time to launch our upcoming events,” said Carlo Cicutto, head of the Bauhaus. The biennial, which will launch in March 2020, will be organized under the theme “Modern Life and the Future.” The event will consist of a series of architectural, design, technological, and scientific exhibitions organized by subject and theme. The design biennial “Anais Nin, 1968–1991,” will highlight the contemporary efforts to integrate contemporary art with the virtual reality of the early 1960s. The twenty-first century will be the theme", "The next Biennial should be held in 2020. The next edition of the Biennale will be held at least once a year in the city of Parma, Italy, from December 15 to January 15, 2021. The 2020 edition will feature seventy-five works by forty-three artists from twenty-eight countries and will draw from forty thousand works from the collection. The 2019 edition, entitled “Yale Unveils the Future,” was staged at the Museum of Fine Arts, Denver, and was held in June and July, respectively. The exhibition was organized by the Yale Museum of Art and the University of Denver. The biennial was chosen to commemorate the centenary of the founding of the Yale University Art Museum. The institution had previously staged the exhibition “Yale: From the Ground Up,” which commemorated the founding of the art school in 1925, and “Yale: From the Vault,” in 2015, but the opening of the second edition of the exhibition was temporarily interrupted by the Covid-19 pandemic.\n\n\nThe Museum of Fine Arts (MFA) in Boston has announced that it is working with the National Endowment of the Arts (NEA) to create a", "The next Biennial should be held in 2021, and the dates for the 2020 edition will be announced in the coming months.The theme of the 2019 edition was “The Image of Life.” In the twenty-first Century, the exhibition will focus on the landscape and its discursive power, as well as on the art of transforming images in order to make them personal and transcendent. It will also examine how the visual arts have contributed to the advancement of human knowledge, and on the political and social transformation that has taken place in the last twenty-five years.It will be hosted by the New Museum in New York in partnership with the city’s Department of Cultural Affairs and the City Council in partnership with the Architect-Consulting-and-Design Association (CADA), the Greater Greater East Side Neighborhood Development Corporation, and the East Harlem Preservation and Development Group. Among the local partners will be the East Harlem Preservation and Development Group, the East Harlem Preservation and Development Association, and the East Harlem Arts Council.Inaugurating the exhibition will be a public reception at the New Museum on South Street at 7:00 PM on October 3. The evening’s program will include a performance by composer Haig Esmond and Bruce M", "The next Biennial should be held in the third quarter of 2020, to coincide with the half-yearly Biennial. This is when the biennial’s programming is most inclusive and when it will have the most opportunity to celebrate the most pressing issues of our time, including climate change, and will therefore be the most relevant to our cultural life.”  The 2019 event, “Earth Summit,” marked “Endless Change”—a new study, led by Erik Brynjolfsson, that analyzed the human condition through the lens of the artist’s work. In addition to the work of Björk and the rest of Björk’s immediate family, the subject of climate change was broached by Björk and Björk’s sister, Freya Björk, who collaborated on the show. The project was conceived as a way to reflect on Björk’s influence on history and to consider the future of Björk’s legacy in the years to come.“It is the duty of every cultural institution to remember and reflect upon the legacy of the founder of the Hermit Kingdom, the biennial artist Björk, with a", "The next Biennial should mark the occasion of the seventeenth International Congress of Graphic Arts, which will address the theme “Plagiarism and the Critique of the Critique” and will launch on September 6. The exhibition will be organized in conjunction with the exhibition “Plagiarism: A History, 1935–1965” and will be organized as follows:The exhibition, which was organized by the German-born architect Herbert Bayer, will draw from new research conducted by Kjetilztürmer Albert and Förgman Götz and will feature works by artists, including Joachim Neugroschel, Walter Bonz, and Adrienne Büttner, among others, as well as original exhibitions. “The exhibition is a synthesis of various collections of Götz’s own work and the work of others, of the visual arts and architecture, as well as the visual arts and architecture of the twentieth century,” said Kjetilztürmer Albert. The organizers also noted: “In the exhibition, Götz recast the picture of the world as a collection of objects, objects as objects, and the collection as a gathering of ideas. The", "The next Biennial should take place in 2021. The Biennial’s next iteration will be held in the city of Fortaleza, Brazil, which will host the twenty-third iteration in 2020, and will be curated by Jokin Yamanashi, the curator of Contemporary Art and Design at the Biennial, in collaboration with the artist and curator Felipe Calderona.The theme for this edition of the biennial is “Time for Change” and will be written and curated by Luiz Felipe, the artistic director of the Museo de Arte Contemporáneo Brasileiro, and will take place in the city of Porto, in the city of São Paulo, in the state of Pernambuco, and in the city of Para, in the state of Rio Grande do Norte.Featuring works by eighty-four artists, including Evan Agustín, Amiti Karata, Eddie Deen, Amy Goodman, Emily Haines, Claudia Sánchez, Carla Tucker, Derek Wetmore, Oscar Vergara, John Yau, Mingi Zhang, ", "The next Biennial should be held at least once a year, with an opening day of 24 March. The organizers are considering a program similar to the 2016 Art Basel Hong Kong, which launched in late March. The exhibition will be hosted in the Hong Kong art museum, Kunsthalle Basel, the Museum of Modern Art, and the National Museum Taipei. The theme of the 2019 edition will be “Globalization in Christ,” and the exhibition will be split into two parts: “Art and Truth” and “Art and the Future.”The proposal came amid a crisis for Hong Kong’s artists and activists. On March 16, Hong Kong’s Arts Council announced that it had voted to sever ties with the mainland government, citing the ongoing pro-democracy protests as the reason for its action. In an effort to placate the protests, Hong Kong’s government listed the pro-democracy protests as an “extraordinary threat” and said that it would protect “the vital interests of Hong Kong’s economy and people” through “structural adjustment and rent-seeking.”On March 18, the government also suspended all public events and parades and moved", "The next Biennial should focus on “Global Development,” a global theme and a new book, with a biennial criticising the current state of development and its relation to the past. The fifth Biennial will be “If We Have No Future Without You” and will note the need for new forms of social justice.The programme is being organized by the Wiradjuri Arts Council (WAC), which comprises six local bodies—the Wiradjuri Contemporary Arts Council, the Wiradjuri Festival Council, the Wiradjuri Museum, the Wiradjuri Theater Council, and the Wiradjuri Waterfront Corporation—in a bid to offer a new form of activism for the local community of over one thousand people.“We are creating a new model for engagement with the region,” said Aneya Sarkar, President of the Wiradjuri Arts Council. “This is a new and urgent need for us as we struggle to survive on this planet, and it is this need that we will address.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Michael Nelsworthy as its next director and chief curator. Nelsworthy will succeed Kimer", "The next Biennial should be completed in the spring of 2021, the year of the twenty-fifth edition of the Art Newspaper Berlin. \n\n\nThe London-based organization Mendel Art Museum in London has appointed Mitch Birkenhead as its new director and chief curator. Birkenhead will assume his post after serving as director of Tate Britain since March 2019. Birkenhead will assume his responsibilities on October 4.“Mitch will immediately bring a new set of skills and ideas to the museum and we are looking forward to his work opening up the world-class collection to a new generation of visitors,” said director Maria Balshaw. “We are thrilled to welcome him to the curatorial team. His extraordinary experience and ability will be instrumental in combining the institution’s excellent collection with the museum’s extraordinary exhibition and research programs.”Birkenhead succeeds Charles Rowland, who departed the institution in March 2019 to become director of the National Museum of Scotland, and will succeed Rodney Levey as director of the National Gallery of Art. Birkenhead received his doctorate from the University of Oxford in 2019 and is currently a postgraduate at the University of Sheffield. He is currently a professor of", "The next Biennial should be held in the summer of 2022. The museum’s current exhibition “The Life and Death of Pablo,” which is on view until September 25, is scheduled to open in March 2020. According to Artnet, the show, which was curated by four former Christie’s executives, will feature the work of thirty-four artists. The artists chosen for the exhibition include Adam Dallaglio, Adrian Piper,  Anna Reich, and Jane Panitch, who will each receive a total of $10,000.The biennial was established in 2007 to increase the visibility of contemporary art through a series of public exhibitions and to support the growing field of contemporary art history. The program also expanded the museum’s collection by 36 percent, discoveries by twenty-six artists and a handful of other greats, and the scope of the museum. It now encompasses more than 120,000 items, including “Nirvana” (2019), “Buyer Beware” (2019), “The Death of Salvador Dalí” (2019), and “The Complete Works of Jean-Luc Godard” (2019), as well as", "The next Biennial should be held in 2022, with the first exhibition taking place in 2020.<|endoftext|>NINE years after a group of artists, including Morris Louis, Julie Mehretu, Mark Giordano, and Peter Sellars, decided to set up a new nonprofit dedicated to the preservation and promotion of the work of their peers, more than three hundred artists are now requesting that the Tate reconsider its relationship with the Tate.The artists have been making their concerns known to Tate director Maria Balshaw, who was appointed last month following a decades-long campaign, organized by the Artists in Concert campaign group, and numerous other organizations, including the Tate, the Royal Shakespeare Company, the National Poetry Festival, and the Royal Film Festival.“The group of artists are extremely concerned about the future of the relationship with Tate,”said Balshaw. “We took a number of actions that were designed to address some of the concerns the artists raised.” She added that the organization is currently discussing a number of options for how it can change its culture and how it should proceed with its planned expansions as part of a $850 million expansion.The Artists in Concert group believes that Tate’s move to London has contributed to a “per", "The next Biennial should take place in 2020 and should attempt to bring together all the artists working in the city’s art museums. The new Museum of Contemporary Art Brooklyn will then host a biennial devoted to the history of African American art.  The museum plans to open an outpost in the city in 2021. “The new Museum of Contemporary Art Brooklyn is committed to the history of African American art,” said Brooklyn Borough President Gale A. Brewer. “It is our hope that this biennial will serve as an important step in that journey and remain a landmark in supporting the history of art in New York City.”\n\n\nThe Japan-born, Melbourne-based artist Iori Ono has won the Prix d’Art Mondial in Paris. The seventy-five-year-old Japanese artist, whose wide-ranging, sculptural works combine fine art and hybrid genres, has been nominated for the $50,000 Nederlander Art Prize.According to the Art Newspaper, the Japanese artist’s work is “an amalgamation of two conflicting ideas, one of them powerful and the other elusive,” while his hybrid of art and non-art works, which often incorporate both male and female", "The next Biennial should be held at the Museo de Arte Contemporáneo (MAS), in Madrid, in 2020; and last year, the sixteen-year-old team behind the exhibition created the film world’s first live-action adaptation of Gogol Bordello.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) has received a major donation of twenty-seven works by thirty-seven artists in a landmark $100 million donation from the Daniel and Edwidge D’Souza Foundation, which was established by the couple in 1989. The modern-day landmark gift includes works by forty-seven artists, including Philip Glass, John Cage, Anna Atkins, Ed Ruscha, and Nada Rivera.In a statement, the foundation said: “The Met, like many other major urban institutions, is experiencing a severe financial crisis. The D’Souza family’s gift will allow us to continue to support artists who are working toward greater understanding and appreciation of the works in our collection. That is an important first step in the right direction. They have made the gift possible in part through their generous giving over thirty years, and we are deeply grateful for every measure by which", "The next Biennial should also be a celebration of the full range of artists who have contributed to the cultural life of the city of Los Angeles. The first round of programming, which will run from April 24 to April 29, 2020, will focus on the history of contemporary art in the United States and will include lectures, concerts, screenings, and installations by artists such as Mark di Suvero, Michael Edward Heinemann, and Annie Prouvé. The second round of programming, which will open May 15 to May 19, 2020, will be on the history of photography and will begin with the exhibition “Vision and the Inner Life of a Pictograph,” which will be organized as a series of photographs taken by David Hockney. “Los Angeles is a city of extraordinary life. The future of this city, and of its future artists, will depend on their creativity and their persistence, the city’s leaders and the city’s residents, who are ready to embrace who they are, and forge new collective identities,” said museum director Michael A. Smith.\n\n\nThe British artist Paul Gauguin, who was one of the first to use ULV glass to create works of art, has died at age", "The next Biennial should be staged in 2020–21. \nJosée Bénétière, who was named director of the Biennale de Lyon\u0097which she ran for two years\u0097and the next year\u0097said: “It was a relief and a joy to be able to close with the big three and not to have to tackle the building and planning and cultural mission of Venice\u0097that is the greatest challenge. The construction of the hotel is still going very well, and the exhibition is continuing as planned. I am very proud of the work we have done, and I hope it will continue to be a success.”The Biennale de Lyon is currently on its way to completing a renovation project that will add more than two thousand square feet of exhibition space and a public garden. The exhibition will also be moved to a new site and may reopen in the spring of 2021. \n\n\nThe National Galleries of Scotland and the National Art Gallery in London, which were forced to cancel a planned exhibition in March due to the Covid-19 pandemic, have reached an agreement that will see an additional £5 million delivered to the institutions, the Art Newspaper reports.Following months of negotiations between the two institutions", "The next Biennial should take place in the following city in the following year: \nEntrants wishing to participate in the 2019 edition must submit a proposal for a theme that reflects their own cultural heritage. The theme will be chosen by a group of twenty-five artists, including Christopher Lee, Madonna, and Shawn Mendes, and will be announced by January 1, 2020.The biennial will be held at the Autry Museum of Art in Detroit and will consist of a series of exhibitions, including the biennial “Detroit Stories,” which will highlight the city’s rich history and will run from April 3 to April 24, 2020. The Detroit Institute of Arts (DIA) will stage the show, which will be curated by artist‐in‐residence Jodi Throckmorton, and the Detroit Institute of Arts (DIA) will provide the sculptures, murals, and installations that will be included in the exhibition.Tickets for the inaugural edition, which was organized by the Free Library of Detroit, were on sale as of Thursday, December 10, and will be available online beginning January 11, 2020. The biennial will be held at the DIA from April 17 to April 18, 2020. \n\n\nTeacher and", "The next Biennial should begin in early June and visit a number of sites in the capital, including the National Gallery of Art and the National Museum of Art, the Sichuan Art Museum, and the Chinese Academy of Fine Arts, Beijing.\n\n\nThe Museum of the American Jewish Experience (MAJI) in New York has commissioned the work of artist Allen Ginsberg, whose decades-long career includes many collages, drawings, and sculptures, to represent the United States in a new exhibition. The installation will open at the New Museum on May 29 and run through December 31, 2020. Ginsberg’s work, which also comprises paintings, sculptures, collages, and drawings, is housed in the museum’s permanent collection, the Allen Ginsberg Collection, and is currently on display in the exhibition “Theater of Operations: The Gulf Wars 1991–2011” (2018–19). Named after the American Indian activist and self-taught painter, whose work often addresses the history of racial violence in America, the exhibition will feature twenty-one works by Ginsberg and will span his career from 1977 to 2015.“Allen Ginsberg was an extraordinary artist, an extraordinary individual, and, in the late 1980s,", "The next Biennial should be held in 2020.\n\nFrank Gehry, whose Studio Museum in Harlem is currently undergoing a major renovation, is suing the city of San Francisco over its decision to remove a large sculpture by the artist Richard Serra from its grounds in January 2019. The work, titled The Bicycle of Life, was part of an exhibition dedicated to the Italian Marxist painter Casanova. The move prompted a massive uproar and prompted Mayor Ed Lee to declare that the project, known as the Golden Gate, was dead. “The Golden Gate is a great work of art, but it was not born on the Golden Gate, and that was the wrong decision,” said Lee. “The lawsuit is about more than just the history of the work, but how it was treated, and about the future of the Golden Gate,” Lee said. “I have made it clear that the Golden Gate is not coming back.”The controversy surrounding the removal of the work, which was mounted in 1975, began when the work was moved from its home on the waterfront into storage. As the city worked to secure the permanent relocation of the sculpture, two local groups, Save the Golden Gate and Save the Golden Gate Community Association, launched", "The next Biennial should be held in 2021. \n\n\nThe artist-run nonprofit Artadia has received a $30 million donation from the Andrew W. Mellon Foundation to support the development and implementation of a new educational initiative, Artadia Fellowships, that will engage with students and alumni of the Art Institute of Chicago (AIC), which is now closed for its annual Fall/Winter semester.The gift, announced in the February 2020 issue of Artforum, marks a significant step in the long-term development of the fellowship program. Established in 2015 by Andrew W. Mellon, the Andrew W. Mellon Foundation’s president and CEO, after the billionaire financier and philanthropist’s death, Artadia Fellowships will provide students and young artists with two years of full-time study at a two-year institution of their choosing, including studio space, learning support, and professional development.The initiative will also help establish a new curatorial practice, Artadia Fellows, which will offer full-time support to emerging and established artists. The fellowship program will launch with three years of support for emerging artists and will culminate in an award of up to $500,000. “We are exceedingly", "The next Biennial should take place in the spring of 2020. “I’m very excited to be returning to the Grand Rapids Museum of Art to present my first Biennial exhibition in twenty years,” said Larry Fink, chair of the museum’s board of trustees.Founded in 1972 by collector Richard Hoffer, the museum now boasts over thirty thousand artifacts from his collection. The museum holds exhibitions organized under the brand name of the Friedrich Reimer and Kunsthalle Kunstbau, which are often covered with the inscription Feinsteinbau (fries crowned with a shawl) in praise of Hoffer’s legendary collection, which includes works by composers such as Paul Gauguin, Pierre-Auguste Renoir, Pierre-Auguste Henrot, Cézanne, and Jules and Loïc Bouygues. The museum also maintains a collection of more than 1,000 works by the Kunstler Paul Strasser, whose influence on art history and philosophy is felt by collectors all over the world.\n\n\nThe Tate has appointed Denise King, who has previously served as senior director of curatorial affairs at the Royal Academy of Arts in London, as its", "The next Biennial should be held in the spring of 2021. The venue will be dedicated to a specific collection of works from the exhibition “Living and Breathing.” The exhibition is organized by the New York–based artist-run nonprofit the Spelman Center for Art, which is affiliated with the New School, the University of Pennsylvania, and Brooklyn College.A press release from the museum reads: \"In this exhibition, Masoudi presents an examination of the relationship between the artist and the material world, as reflected in his practice. His work opens up other ways in which he can engage with the material world today and in the future.”The exhibition’s inaugural season, “Living and Breathing” (2018), was held at the Brooklyn Museum and was presented by Masoudi. The exhibition was originally curated by the artist himself and will be organized by the New York–based company Fuzz Factory. Previous shows at the museum include “The Practice of Making” (2017), “Claudia Naud (1882–1980)’s “Monet Image” (2015), and “Living and Drawing” (2014).\n\n\nThe Ferranor Pacifica", "The next Biennial should take place in 2022, and the 2019–20 edition was staged at the Annecy Festival, which recently canceled its iteration of the festival. The 2020 edition, which was organized by the Italian art center Cipolletta di Battaglia, was also about to begin its run.The institution has since received a letter from the Royal Commission for the Future of Art, which called the closure of the exhibition a blow to the careers of six artists, and three of the participants in the upcoming edition.The seventy-eight-year-old artist Gia Aiello, whose work explores concepts of pain and the body, has also decided to retire from the stage. “María del Carmen is a sculptor who has lived in the small, of course, but she is a great artist,” said Aiello, who also designed the outside of the venue. “Theatre is a community; it is a community of friends. And this is what we are losing. . . . I have a feeling that this is a very long-term project, because nothing is going to change in the next eighteen months.”\n\n\nThe design of a new museum dedicated to the life and works of Italian modernists", "The next Biennial should be announced by the end of the year.\n\n\nThe Museum of Modern Art (MoMA) on Saturday unveiled its long-term design goals for its new campus in the heart of Little Italy, which will accommodate 132,000 visitors a year. The design of the beloved museum, which will extend from the Museum of Modern Art’s current site in the Little Italy neighborhood of Manhattan, has been in the works since 2013 and was undertaken by architect Jane Birkin.Birkin revealed the project, which is part of a plan to re-create the historic Rockefeller Center, during an interview last year with the New Yorker. “I wanted a space that was as open and accessible as possible,” Birkin said. “I wanted to create a space where people could go and feel part of a community and feel part of a community’s history.” The new campus will also include an auditorium, a rooftop terrace, and the first floor will be dedicated to MoMA’s collection of twentieth-century works.“The Museum of Modern Art has always been about creating spaces where people can feel part of a community. What we are doing now is creating the most intimate museum experience on earth.", "The next Biennial should be held in October 2019. The inaugural edition, titled “Ace of Spades”\u0097the title of a work by the Italian artist Marcella Battista, drew nearly 300,000 visitors to Milan in 2012. The 2019 iteration of the exhibition, titled “The Future is Present,” will draw 250,000 visitors to Rome.\n\n\nThe art historian Nancy Cartwright—a fierce proponent of the medium and a relentless collaborator who shaped the postwar history of photography\u0097has died at age eighty-eight. The cause of death was cancer\u0097the result of a rare form of the disease, called melanoma, which has affected only a small fraction of those diagnosed with the disease\u0097was discovered on December 2, 2018, when the artist was taking a break from her practice.Born in Manhattan in 1940, Cartwright grew up immersed in the world of photography. As a teenager, she became fascinated with the American Civil War through the work of her father, who became a Civil War replicator for the Union and Confederate forces. Following high school, she enrolled in the photography program at Columbia College in New York and graduated in 1951 with a degree in photography and a minor in English. Her work was", "The next Biennial should be held in 2020.\n\n\nLeon Black, the director of the Charles Egan Gallery in New York and creator of the New York underground art scene, died on March 29 at age eighty-eight.Born in Brooklyn in 1931, Black moved to Manhattan after World War II and enrolled in the city’s Pratt Institute before the institution transferred him to the University of Pennsylvania, where he studied to become a painter and eventually became a sculptor. He went on to teach at the School of the Art Institute of Chicago, Los Angeles, the School of the Art of Modern Art, New York, and the Institute of Modern Art. In 1974, Black was selected to represent the United States at the Venice Biennale, and the following year, he began his long-running, multi-person project, Black Magic, which incorporates art, photography, video, and installations to address issues of racial and economic justice.The project,’s inaugural exhibition, “Waves of New York,” opened at the Charles Egan Gallery in 2010. The series, which was initiated in 1975 by Egan, McDonnell, and John C. Harnwell, was created in response to the riots of 1989, which were sparked by the", "The next Biennial should focus on the history of science and technology in the art world. It should also explore the relationship between contemporary art and the twentieth century, focusing on the history of art from the African diaspora, as well as that of European art, and the history of science and technology in the art world, focusing on the history of science and technology from the African diaspora, as well as that of European art, and the history of science and technology in the art world. It should also explore the relationship between contemporary art and the twentieth century, focusing on the history of art from the African diaspora, as well as that of European art, and the history of science and technology in the art world.”The 2019 edition of the Cooper-Hewitt will focus on the evolution of the visual arts and the history of painting and sculpture from 1890 to 1970. It will also explore the history of photography, which was invented by Edward Weston in London in 1834, and will present its first exhibition dedicated to the artist in 2020.\n\n\nThe Museum of Fine Arts (MFA) in New York City has appointed Tom Breyer, who has served in various roles at the institution since 1983, as its next director. Breyer succeeds", "The next Biennial should take place in 2020. “We are still in the process of conceptualizing what a biennial would look like,” Mijares said. “We are currently working on a new platform for the exhibition that will be accessible by everyone. We are also designing the biennial to reflect the local and regional identities of the cities. We are planning to include artists from the same region in the exhibition and to collaborate with local artists.”\n\n\nThe University of Washington in Seattle announced today that Amanda White, a recent graduate of the school who teaches at a small liberal arts college and has been featured in a number of videos for the school, has been hired as its next director. White will assume her responsibilities on January 31, 2020.“We have been impressed by Amanda’s work for months, and she has consistently demonstrated an ability to educate and develop highly informed opinions about contemporary art and its potential for social change,” said director and CEO Becky Anne-in-de-Ville. “Her curating, writing, and organizing have been central to her school’s development into a dynamic, international arts hub, and her teaching has been inspiring and thought-provoking. We are honored", "The next Biennial should be in 2020. “The current exhibition is a remarkable example of twentieth-century art at its highest and most ambitious,” said Kunsthaus director Christian Stadel. “With its 350,000 works and its unequalled collection in both the art and architecture worlds, the Biennial is the most important exhibition in its history.”The Frankfurt Biennale, which opened to the public on February 24, 2019, was transformed by a new crop of artists who have been inspired by the building blocks of modern life. In the past fifteen years, the exhibition has grown from twenty-nine curators to a larger-than-life collection that is curated by a team of world-class curators. The Berlinale, which took place in September last year, was staged by a team that included Dieter Rams and Herschel Piehlbauer, and the Seoul Art Biennale, which ran from March 28 to April 6, was organized by a group comprising Hans-Georg Maazel, Christian Schläbstra, Kjetil Østbye, Wolfgang Pfeifer, and Paula Scher.To celebrate the heritage of the exhibition space, the Biennale will begin the construction of a new pavilion as", "The next Biennial should be held in 2021.  Kirchner was asked to reprise her role as director of the Mainz Museums in the summer of 2018, shortly after the construction of the new regional museum facility in the city of Mainz, the hometown of Ludwig and Gerhard Biennials; initially, the museum dismissed the idea. The decision caused a stir at the museum, where there was widespread speculation that the museum would relocate to a larger space in the city.Kirchner, who had previously served as director of the Berlin Art Museum (BAM) from 2011 to 2014, was chosen to lead the new institution by two-thirds of the museum’s board. The other two thirds were Hansa and Monika Kübler, who had previously served as director of the Berlin Art Weekender and the Berlin Design Weekender, respectively, and had been nominated by the Berlin-based architectural historian Junkelsten Grätte.“The appointment of Kirchner as director of the Mainz Museums is a statement of the integration of the museum experience,” said Kölnischer Beobachter’s Hansa. “Her vision and technical expertise are exemplary in their", "The next Biennial should be held in 2019, according to the organizers, and will include works by sixty artists and will take place in the Faurschou, a former Nazi concentration camp, in the Rhine Valley. The exhibition will include the works of Marcel Prouvé, Robert Mapplethorpe, Haus de Parte, and Christine Adrien. Both the Faurschou and the Ruhrlands have been transformed into museums since the war.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Kendra Harris as its next director. Harris will be responsible for serving as the interim leader through 2021 and will begin her role with the institution in April.“Kendra has the unique experience and leadership skills necessary to manage an institution at the forefront of transforming how we think about art and design,” said Elizabeth Harris, chair of the museum’s board of trustees. “Her approach to the role of director will align with MoCA’s core mission, and will instill in our artists and design thinkers the critical tools to reimagine and redesign our collections while respecting the history of the building as a landmark.”Previously, Harris worked as an independent curator and taught at", "The next Biennial should take place in 2021, and the first in 2022.  The first exhibition of the new program will be “The Missing,” a collaboration between artists Chantal Ghanem, Anish Kapoor, and Shahriar Shahriar. The show will be organized in conjunction with the upcoming biennial “Jadunthi,” which is slated to open in March 2021. The exhibition will be based in New Delhi, Mumbai, and Gurgaon. It will feature new works by the participating artists and will be curated by Ashok Gavai, the director of the Biennale, and will take up the theme of “Project,” a concept inspired by the World Crisis. The exhibition will be inaugurated by a survey of Gottfried Remer’s work, titled “The Future Is Present,” which will be on view until January 7, 2021.\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Sarah Pidcock as its new chair of contemporary art. She will be based in the city’s South Kensington neighborhood, which was recently transformed by the CNEB and the massive expansion of the Olympic Park", "The next Biennial should be held at the Neue Galerie in Berlin in March 2020. The exhibition will feature seventy works by women artists. Artist response to the event will be featured in a special exhibition at the Jury Museum in New York in March 2021. The 2019 edition of the event, titled Art and the Biennial, was held in the US city of Cologne. It was organized by the German government and the museum.International collaboration\n\n\nThe eighth edition of the Venice Biennale, curated by Stefano Lambretta, has announced that it will take place at the Forum in Venice from February 18 to February 21, 2021. The event will be hosted by the Palais de Tokyo in collaboration with the Scala Architecture Academy and the Università di Stampa and will be cochaired by Gino Zammit, the director of the MAMAMAN Center for Contemporary Art, and Pierluigi Boi.The upcoming event will offer a retrospective of work by artist-in-residence Vitaly Chirik and a collaborative exhibition of work by twenty-one artists. The show will be organized as a platform for the next edition of the event. “The concept of the Venice Biennale,", "The next Biennial should take place in the spring of 2021, with the exhibition marking the first of the series. Commenting on the project, ʜThe exhibition is as much about resistance as about celebration, and what is new and in between,” said Loren B. Anderson, the curator of the series. The exhibition will be hosted at the Minneapolis Museum of Art (MMA) until April 4, 2021, and will continue to be organized by the artist’s group, the MCA, and the artists. The 2020 edition of the exhibition, titled Labyrinth, was curated by Jeff Koons and features work by more than sixty artists from twenty-seven countries and territories, including France, Italy, Poland, and Thailand.\n\n\nItalian cultural workers will stage a protest at Milan’s Sestra Oeste on Wednesday, September 29, over plans to close the Fondazione Prada, a cultural institution associated with the controversial artist Giorno architect Stefano Cattelan, to make way for a new shopping mall. The planned restructuring of the old cultural venue has sparked outrage in the artist’s home country, where he has lived for the last decade, and has led to a massive demonstration in", "The next Biennial should be held in the mid-2020s and will likely include artists representing both South and Central America. “The future of art in the Americas is at stake,” said Carlos Romero, director of the Art Institute of Chicago. If the biennial is to be a success, it will need to address both the structural and the cultural challenges of the Americas. Although the first iteration of the exhibition was held in early 2020, it was closed to the public for an extended period of time in early 2021. For artists participating in the event, the 2019 event marked a pivotal moment. “We are all very excited for the 2019 iteration,” said Jorge Inacio, a curator at the Museum of Contemporary Art, Texas (MoCA), Austin. “The museum is committed to renewing sustainable practices in the art world through our exhibition program and collection, making the next iteration of the Biennial a success.”\n\n\nThe Art Institute of Chicago (IIC) announced today that Amanda Bell, director of the Chicago-based nonprofit the Center for Contemporary Art, has been hired as director of the new exhibition space the Garage. The Garage will offer curatorial and performance programming in the new facility, which", "The next Biennial should, however, be a departure from its procedural character. It should be a platform for the artist’s personal efforts, and not the other way around, and should be an opportunity for the public to engage with the work of the biennial.”In the past, a motion picture biennial was held every other year at the Museum of Modern Art. In the 1990s, the MFA hosted a series of films, performances, and documentaries about the life and work of artist-in-residence Ruth Dix. In the 2000s, it hosted a biennial of small-scale art made by artists from South Asia.The 2019 iteration of the Biennial of South Asian Art, curated by artist and curator Sushil Gupta, will take place in New Delhi from June 4 to June 8, 2020. Gupta’s previous works include “Infinite Jest: A Film Biennial,” in 2011, “South Asian Art: From Jyoti Dutta to M. S. Naik,” and “Featuring Kirin Pickard, Anna Swarbrick, Sita Dutta, and Rishab Ranjan,” which opened at the San", "The next Biennial should be announced soon.\n\n\nThe Guggenheim in New York has launched a $50,000 prize for the visual arts. The $50,000 award will go to the winning team of artists for their work in the 2017 exhibition “Roland Bacher: The Art of Life” at the museum, which was not chosen by a jury but was presented to the artist in person by his daughter and the winner of the inaugural prize, Peter Bacher, who will receive an additional $50,000.\n\nThe Guggenheim has awarded $50,000 to the twelve artists who were selected to participate in the 2017 exhibition “Roland Bacher: The Art of Life” at the Museum of Modern Art. The prize was established after the artist issued a challenge to the jury to make a selection of one work from the catalogue for the exhibition. This year’s prize exhibition, “Roland Bacher: The Art of Life” and “Roland Bacher–Sandra Benitez” will feature the work of artists such as Adam Dachow, Alex Daniloff, Karolina Wojtas, Yinka Shonibare, and Yuki Tanaka", "The next Biennial should focus on technical advances and the use of technology to address social and environmental challenges, as well as the history of the exhibition and the exhibition, as well as its reconstruction and development. We will also consider the possibility of reopening the exhibition in the future. \n\n\nNina Bochner, the curator of contemporary art and the owner of the contemporary art space the Kunsthalle Basel, has announced that it will reopen in the Swiss city of Basel, now that the coronavirus has been contained. The organization’s Art and Travel section will reopen on January 19, 2020.“We are all very excited by the news that the exhibition will reopen in January 2020, and that the Kunsthalle Basel will be able to present an exhibition of works by the artists in January 2020,” said Bettina Fuchs, general director of the Basel-based museum. “The exhibition is currently closed until December 23, and we are working hard to reopen it in January 2021. I am thrilled that it is now possible to see the work of the artists in January 2020, and to have it in the same building as at this very moment. We hope that the exhibition will be able to open in the", "The next Biennial should open in 2020.\n\n\nThe Royal Academy of Arts (RA) in London has named Michael Servet as its next director. He will take the helm from artistic director Gillian Woolery, who will retire on March 31 following ten years at the helm of the academy.“Michael brings with him significant experience from the Royal Academy of Arts and is well positioned to build on and further develop the legacy of the RA, which has led the way in the development of new art and the exploration of new forms of artistic expression,” said RA artistic director Kate Fowle. “Our new partnership with the Royal Academy of Arts will allow us to further the RA’s vision of connecting contemporary art with the values and the needs of our times, and will strengthen our relationship with the RA’s beautiful museum, which has played such a central role in supporting contemporary art in Britain.”Following a five-year search, Servet was appointed director in February. During his tenure, he has expanded the academy’s contemporary art collection, worked with the development and exhibition of new works, and overseen the reopening of the RA’s new building in London’s Hyde Park during the construction of the borough", "The next Biennial should include a performance by the Cambridge-based collaborative group, Biennial of the Decadent, and a presentation that the artists say will draw from a wide range of topics, including the history of art, the possibility of art and its art, the relationship between art and science, and the contemporary world. The organizers emphasize that the exhibition will not be a “confrontational” way of presenting art but rather will focus on the “cinematic.” The biannual exhibition, which opened in the city in 1996, is organized by the Cambridge-based organization, Cambridge Biennial, and will run from September 3 to September 7.In an open letter, signed by Nina Ehrlich, Cara Pindell, Hal Foster, and Molly Landreth, the artists said: “It is an incredibly exciting time to be a participant in both the Decadent and the Cambridge Biennials. We look forward to continuing our work as a collective and to present our work in 2020.”\n\n\nThe Yuz Museum of Modern Art (Yuz) in New York has announced that it will welcome visitors back to the institution in March 2020. The announcement comes a little", "The next Biennial should take place in the spring of 2021.\n\n\nThe historian Anna-Marie Johnson has been selected to lead the inaugural edition of the sixteenth Bienal de Paris, which will take place in the city in 2022. Johnson, who is based in Chicago, is the founder and director of the think tank the Bienal-Paris, which works to hold cultural and artistic institutions accountable for protecting and restoring their historic sites\u0097thus increasing the amount of funding available for heritage conservation projects\u0097and has previously curated exhibitions such as “Ateliers Jumeaux III: Mulhouse & Moulier” (2013) and “Our World in Turbinations” (2013).Johnson is an associate professor of history at the University of California, Berkeley and has held curatorial positions at the Museum of Modern Art (MoMA), New York; the Museum of Human History (MoH), New York; and the Museum of Modern Art (MoMA), New York.Hélène Berger, the director and chief curator of the Bienal-Paris, said: “Hannah is a gifted and committed curator whose thoughtful, inspiring, and articulate work reflects a deep commitment to the art of the past that", "The next Biennial should be held in 2020. It will take place in the city’s Urban Institute of Arts, which is slated to open in 2020, and will be organized as a series of interrelated biennial exhibitions. The 2018 edition of the exhibition, titled “The Commonwealth of China,” featured works by thirty-three artists and contained over twenty-five thousand photographs.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a major gift of more than twenty-five thousand photographs by Italian modernist Gio Ponti. Titled “The Maltese Garden,” the exhibition, which was organized by the Italian architect Marcella Bocca, was curated by Giovanni Battista and will be on view in the museum for the next eight years.The gift includes an original set of photographs by Ponti that were stolen from the architect’s home in Rome in 1996 and are currently on display at the museum. The stolen photographs were first reported by Bocca and were featured in a book about Ponti’s work, Gio Ponti: The Maltese Garden, published by the Italian publisher Carlo Cacciavarella in 1996. The work was stolen from the apartment of", "The next Biennial should be held in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Marianne B. Nilsson as its next executive director. She succeeds Marilynne Vreeland, who has helmed the institution for more than twenty years, and will begin her role in January.“The board of trustees is delighted that Marianne is the perfect person to lead the museum as we move into the next phase of our development,” said board chair David Gass. “She is highly respected within the curatorial community for her vision and ability to build and maintain a strong collection, a solid staff, and attract new audiences. Marianne will deliver on our mission of celebrating the history and art of the twentieth century with a curatorial vision that is grounded in social justice and integrally interconnects with local, national, and international contemporary art.”Nilsson comes to the MoCA from the Metropolitan Museum of Art, where she has served as associate curator of modern and contemporary art since 2017. She previously worked at the Whitney Museum of American Art and the Atlanta Museum of Art, where she served as a curator of African American art. Commenting on her new role, Nilsson said:", "The next Biennial should take place in 2022. “I have long believed that the best way forward for our biennial is to develop the programming that will facilitate and celebrate the work of the past.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) is planning to increase the size of the budget of the cultural agency it postsdoctoral fellows to match the upcoming exhibition “Feminine,” which will be staged at the Javits Center in Downtown Manhattan. The agency, which posts the fellows on stipends and receives their salary, has yet to announce a date for the upcoming exhibition.The expansion of the DCLA’s budget was made possible through a $3.7 billion federal stimulus package signed into law in March. The $2 billion boost to the agency’s matching funds, which are used to extend unemployment insurance benefits, will run out on July 1. The bill also allocated $1.2 billion for grants for cultural institutions and cultural organizations across the city, and $1.1 billion for the arts and cultural economy, according to Artnet. The March 22 issue of Artforum revealed that the DCLA’s initial proposal for 2020, revealed", "The next Biennial should be about six months from now, and will be held in late September. The first exhibition will be dedicated to the work of the last twenty years, with the artist-run space the gallery reopening as the new venue for the event. The second, which had been on hiatus since March, will focus on the artist-run space, which is located in the industrial district of Beijing, and will run from September 20 to September 25.“The concept of the Biennale is to reconceive the past,” said Wang Fei of the institution. “Instead of presenting a list of the most important works, the museum will focus on the impact of the exhibition on the artist’s work. We are currently developing a strategy which will enable us to present the best possible exhibitions in the future, while preserving the Biennale’s unique character.”The Biennale’s first exhibition, “The Man Who Fell to Earth,” was staged at the gallery in Beijing in 2010. The exhibition was followed by “The Man Who Stole Love,” in 2013, and “The Art of Self-Portraits,” at the Beijing Museum of Fine Arts in 2015", "The next Biennial should take place in the spring of 2021. Its theme, “Hope for Tomorrow,” will be an exploratory reinterpretation of an oft-quoted quote attributed to Martin Luther King Jr.: “Hope is the only reality.” The exhibition will also include a collection of modern and contemporary art from around the world and will be hosted by a collaboration between the Pan Asian Art Museum in Beijing and the National Gallery of Art in Washington, DC. The exhibition is part of a larger project by the Smithsonian’s National Museum of Asian Art and the National Museum of American Art, presented by the National Geographic Society, that aims to create a lasting legacy of art and place in the United States.“I’m thrilled that we’re bringing together such a magnificent collection of contemporary art, history, and design to Washington, DC, and the nation’s capital city,” said Mark Becker, director of the National Museum of Asian Art. The National Museum of African Art, Washington, DC; The National Gallery of Art, Washington, DC; The National Gallery of Art, Washington, DC; the Los Angeles County Museum of Art; and the Whitney Museum of American Art have announced that they�", "The next Biennial should take place in 2019. \n\n\nThe Haus der Kunst (HdK), Berlin:  Started by Hildegarde Currier, the museum is in the process of reopening after a major renovation and will be welcoming visitors again in March 2020. \n\n\n\n\nSydney’s Museum of Contemporary Art (SAFA), New South Wales: After a series of closures, including a temporary closure in March 2019, the museum reopened in April. \n\n\nThe National Gallery of Australia (NGA) in Canberra is planning to open on May 10, 2020, and will be celebrating with a new exhibition, “My Heart Goes On,” a collaboration between artist and NGA staffer Gisèle Bénétière, in the gallery, where it will be housed until the end of its year-long exhibition. The inaugural exhibition—created by the NGA’s Creative Artists Program, which runs alongside the Gallery of Modern Art in New York—will showcase work by twelve artists in an attempt to address the challenges and opportunities posed by the pandemic. The show’s inaugural edition will also feature a new installation, “Acts of Presence�", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning on moving forward with a reopening party for its Marfa location, which was temporarily closed due to the Covid-19 outbreak, despite the city and county of Los Angeles having declared a state of emergency, the Art Newspaper reports. The party will now take place in the city’s downtown shopping district.According to the Los Angeles Times, the museum announced in September that it would open with a new theme, “Lucian Freud,” but did not specify when the event would take place. On Friday, the day of the party, the museum will be closed until March 13, when it will reopen as part of the Los Angeles–San Francisco Art Institute (LASMAC).The reopening party has faced opposition from some in the city’s arts community, who say it is premature and that the museum should have anticipated the crisis and taken precautions before implementing emergency shuttering orders. The news that the museum would reopen with a new party, titled “Lucian Freud in the City,” has also sparked outrage from some local arts organizations that have expressed a desire to see the exhibition in an alternate location", "The next Biennial should take place in the summer of 2021; a new exhibition of works by women artists will take place in the fall of 2024.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has announced that it is planning to open an underground museum in the city’s Chinatown neighborhood in the fall of 2021. The underground museum will host an exhibition of work by a select group of artists in August of 2022.The proposed $8 billion museum, known as the Metropolitan Stories, will be located in the former site of the American Airlines New York City Center, which is currently undergoing a major expansion. The project is a joint effort of the city and the state of New York and is part of the city’s plan to revitalize Chinatown.“As part of the city’s plan to make Chinatown more welcoming and diversified for visitors and residents, we chose to prioritize work by artists who are based in Chinatown,” said Richard Armstrong, the executive and artistic director of the Metropolitan Museum of Art. “Joining the growing list of artists who have directly impacted our community and who have been central to the museum’s mission is a special honor. We are thrilled that all three of these artists will be represented", "The next Biennial should open in 2022, and will showcase a collection of new works by artists from the Philippines.\n\n\nThe Public Art Fund, the nonprofit organization that supports cultural, historical, and contemporary art, and provides funding for exhibitions and events, and maintains a collection of more than 1,000 works, has awarded $1.5 million to six artists: Anson Chan, Salma Chára, Kyuna Hans, Ida Bonham, Tanita Bengston, and Taranaki Maori. Among those invited to participate in next year’s edition are Jochen Benz, Alain Guiraud, and his wife, Hélio, and the curator Marina de Sousa.The funding round was made through a combination of individual gifts and at-risk grants that model the organization’s long-standing philosophy of giving artists as a gesture of support. As an example, the fund announced in a statement that it will provide $150,000 for individuals to attend the 2017 edition of the exhibition “Feminine Equilibrium” in New York, and will match up to $100,000 for the production of works by women artists.The announcement of the grant cycle came on the heels of the launch of", "The next Biennial should take place in the fall of 2020 and will include an exhibition of the work of Olu Olu, who is well known for her monumental painting The Life and Death of Benjamin Britten, at the Museo de Arte Moderno in Madrid, Spain, and will receive a commission by the exhibition.\n\n\nThe National Poetry Library in Washington, DC, is launching a new digital platform, called the National Online Library, that will make it easier for people to access and share the work of more than 150,000 poets. Each year, the library will offer free access to selected works through the National Poetry Slam, a national poetry competition that was launched by the National Association of Broadcasters and the National Endowment for the Arts, and will host the inaugural National Poetry Slam Poetry Awards, which will honor poets from sixteen states. The platform also includes a new section for poets that will offer frequent updates on new works and will host artist residencies.“The National Online Library will be an essential platform for the many thousands of poets currently unpublished or under copyright in the US,” said Jillian K. Vaughan, the library’s chief curator and director. “Posing a provocative question about the nature of", "The next Biennial should be held in 2020. The exhibition had been scheduled for a 2019 run but was pushed back due to the Covid-19 pandemic. For the past three years, the Biennial has been a platform for Yinka Shonibare, a Japanese artist, artist-activist, and writer known for his public sculptures, including a monument dedicated to the late Japanese cartoonist Hayao Miyazaki, which will rise in the exhibition venue.“I am very excited and proud to be a part of the Biennial of Tokyo,” Sharon Mislemon, executive director of the Biennial, told Artnet.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $5 million donation from the New York–based foundation Biennial Fund. The gift comes in addition to the $1 million offered by the Shari Ruben Foundation in 2016. Charles and Joyce Ruben, the founders of Ruben Fine Arts, stepped up to help raise funds for MFA’s proposed expansion, which would add more than twenty new galleries and galleries of new scale.“The Rubens and the MFA are dedicated to advancing the museum’s mission and", "The next Biennial should be in 2020, a spokesman for the organisers told the Art Newspaper. “In order to avoid congestion on the museum’s platform and in order to protect the exhibition space, the exhibition was cancelled. “The next Biennial will be in 2022, when the exhibition will be on display until October 29. ‘Innovation and change is a core theme of the new biennial, and we are already implementing new changes to enhance the exhibition experience. The exhibition will be there for a week longer, with new programs and new initiatives, as usual.” The events calendar for the next Biennial has not yet been announced. \n\n\nThe Diller Scofidio + Renfro–designed Tate’s new venue for the Tate Modern—which will host more than one hundred exhibitions every year—is running out of money and will have to go back to the creditors, the creditors representing the majority of the museum’s creditors, to renegotiate a new deal, the Art Newspaper reports.The insolvency proceedings were brought about by the collapse of a previous agreement between the Tate and its creditors, the British Society of Composers and Authors (BSA), in the wake", "The next Biennial should be held in 2021. The time will be selected by a panel comprising Kambayashi, Hirano, and Kobayashi, and will be presented by the Tokyo Metropolitan Museum of Art in Tokyo. The project was awarded a $10 million grant from the Tsukiji Museum of Art in Tokyo, Japan, earlier this month. \n\n\n\n\n\nTakashi Iwasaki, who founded the Tokyo Metropolitan Museum of Art (TMM) with his girlfriend Takako on November 12, 1991, has died at age eighty-eight at his home in Tokyo. He was seventy-six years old.Born in Nagoya, Iwasaki studied mechanical engineering at the Tokyo Polytechnic University before finding work as a museum curator, serving as director of the MGMT building, which was completed in 1996 and renamed the MGMT Museum in 2008. He joined the museum in 1988 and served as director until 1998, when he departed to head the Musashi Museum of Art in Nagoya. Iwasaki often drew from the contemporary art of the period to bring the museum to life through artistic projects that exceeded his own expectations. His paintings often involve surreal and abstract compositions that are inspired by the avant-garde art of the 1960s", "The next Biennial should be held in February 2021.\n\n\nThe University of Pretoria in South Africa (UP) announced today that its Students’ Union (SU) is pushing for a new agreement between the institution and the students’ union coalition Sisseton United National Union (SUNU). The coalition was formed to counter the impending defunding of the institution’s student leadership program, the National Union of Students (NUS), and has since claimed that it has helped push the university’s decision to terminate the leadership program.The funding, which was cut by almost half in the wake of the pandemic, is estimated at $14 million. According to the student’s union, the funds have been used to pay union members who have not yet signed up for a union drive but are still owed thousands of dollars.The union, which is still seeking a minimum wage increase and a union contract, has also criticized the university for not providing the students with enough medical care. It says that the university failed to inform the students of the cost of the treatments and that hundreds of medical staff have had to be let go. The students say they were not consulted about the move and that they were not informed that their salaries would be suspended until", "The next Biennial should be held in 2020.With the 2019 edition marking the twenty-fifth anniversary of the Biennial, the exhibition will focus on themes such as the importance of the Biennial in the lives and experiences of artists, and the exhibition of work by twenty-six artists at the festival. The 2019, a retrospective of the work of Hélio Oiticica, was also staged at the Museum of Modern Art in New York.The next edition of the Biennial will take place at the LaGuardia Grand American, in the summer of 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $50,000 donation from the Simon family. The institution will now be able to say that it has received a major gift from a prominent philanthropic family. Simon Spielberg, a former director of the Los Angeles County Museum of Art (LACMA), is giving the institution $50,000 in support of its latest capital campaign, which aims to raise $65 million for its expansion and operation. The institution also received a $10,000 donation in support of its K-12 education program in 2018. The K-12 capital campaign was led by Linda and Richard Simon, who have donated $30 million", "The next Biennial should be held in 2020, and the first in 2021.The 2019 show, which was curated by Nusseibehir, featured works by thirty-six artists. The exhibition was generally well received by critics, who called it an excellent addition to the collection. Huw Price, a curator at the National Gallery of Art in Washington, DC, said, “The exhibit is an essential engagement with American art from the 1920s to the present day. The exhibition is a cultural portraiture of contemporary American art, bringing the subjects and their works to life in an open, inviting, and accessible manner. The central theme of the show is the importance of art in the life of the artist.” \n\n\nThe Guggenheim Museum in New York has appointed Tanya Birnbaum as its new director. Birnbaum comes to the institution from the Whitney Museum of American Art, where she has served as deputy director since March 2019. She succeeds Peter Wilt, who retired in March 2019 after seventeen years at the helm of the institution.“Tanya’s appointment represents a new era for the Guggenheim, and we are very excited to welcome her to the family,” said museum", "The next Biennial should take place in 2020, and will include a selection of new works by seventy-five artists from twenty-four countries. The full list of participating artists is as follows:Alberto Barbera, Buenos Aires, ArgentinaCara Brachan, Tel Aviv, IsraelTania Bruguera, Brno, Czech RepublicEddie Best, New York, NYCatriona Blatt, New York, NYDiana Bruguera, Buenos Aires, ArgentinaTanya Bruguera, Buenos Aires, ArgentinaBianca Bruguera, New York, NY\n\nBoston Art Museum, the National Gallery of Art, and the SculptureCenter announced today that they are working to finalize a long-term partnership for their annual Fall/Winter Symposia, which will run in conjunction with the annual March/April American Ballet celebrations in Washington, DC, starting in 2021.The development marks a partnership that will advance the museum’s mission in several ways. The museum will receive an additional $200 million for its expansion; it will receive more than $180 million for its expansion project; and it will receive an additional $110 million for its expansion project. In addition, the institution will continue to host", "The next Biennial should focus on presenting a selection of contemporary paintings by local and international artists, as well as on the ongoing research into the installation and exhibition of digital art in the museum. “We are currently working to develop a new biennial program that will be able to better deal with the current global challenges and will present the first work by a new collector in the United States,” said Michael J. Pfeifer, director of the Biennial. The Museum anticipates that the Biennial will be a catalyst for discussion about the future of digital art and will be a valuable educational tool for students in the museum. The museum is also working with a group of students and faculty from the university to create a new master exhibition at the museum. The project is part of a larger goal to create a new collection of paintings by the artist Victor Moschino, who died last year. \n\n\nThe Schirn Kunsthalle Basel in Switzerland, which closed on March 13 due to the coronavirus, has appointed Ola Bahl as its new executive director and director of exhibitions. Bahl comes to the institution from the Frankfurt-based arts organization Theta. He succeeds Matthias Glimcher, who resigned in March after", "The next Biennial should be in 2021 and is expected to open in 2023.\n\n\nThe Museum of Art (MoA) in New York will divest from several of its holdings in the wake of a public health crisis sparked by Covid-19, which has infected more than 590 people in the United States and has killed more than 4,800—the hospitalization of the novel coronavirus. The institution’s current charitable arrangement with Wells Fargo, which dates back to 1997, began to unravel last September when the New York City Department of Health announced it would no longer renew its contract with the financial services giant.The museum has been working with a group of artists, academics, and activists to preserve more than five hundred works by artists and activists associated with the Black Lives Matter movement. The initiative, called the Legacy Preservation Initiative, received a $500,000 grant from the Black nonprofit the C.A.W.E.N.T. Foundation this month. In addition, the institution’s holdings of Francisco Goya’s The Birth of a Nation, 1865, and Helen Frank’s The Double Life of Elizabeth Peyton, 1964, are being restored to their historic condition.The institution plans to take the first steps towards", "The next Biennial should welcome the public at the Pacific Palisades Museum of Art in Long Island City, New York; the Museum of Contemporary Art (MoCA), San Francisco; the Museum of Contemporary Art Los Angeles; and the Museum of Fine Arts, San Antonio. “We are looking forward to working with our artists, partners, and the community to develop a new platform for their work and continue to build upon the impact that Biennials and Black Arts can have on the world,” said curator of contemporary art, Lonnie G. Bunch.The 2020 theme, “Themes of Illusions,” brings together a variety of cultural and political themes to highlight the work of artists representing a wide spectrum of artistic practices. It will also provide an opportunity to address contemporary concerns such as climate change and the impact of the coronavirus.The biennial, which was inspired by the work of artists such as Anna Atkins, Tanya Bonakdar, and J. M. Worthy, will mark the thirteenth edition of the festival. \n\n\nThe National Endowment for the Arts (NEA) has released guidelines for how museums should respond to the coronavirus. The guidelines, which were issued on September 14", "The next Biennial should be held sometime between October and May 2020. For the next five years, the museum will be transformed into a research center dedicated to the history of modern art; from October 2020, the institution will become a major work-study center for creative and cultural professionals; and for the next seven years, the biennial will be divided into three parts\u0097the first part will be on October 15–20, the second part will be October 25–31 and the third part will be November 13–20.\n\n\nThe National Gallery in London has appointed Pippa Edwards as its next chief executive. Edwards will take the helm of the institution from Michael Gove, who has led the National Gallery since March 2019. She succeeds Damian Collins, who was appointed as director of Tate Britain in April, and will begin in her role on August 2.“Pippa is a well-known and trusted leader in the field and will be crucial in delivering on the National Gallery’s ambitious plans for the future,” said Michael Gove. “Her incredible track record of transforming the National Gallery into a leading international arts and design destination with a winning combination of passion and skill, combined with her ability to", "The next Biennial should be held in 2020.  The event, which has been co-organized by the Norad Institute and the Gallery of Modern Art, will be held in the MNE, a former Soviet concentration camp, near the village of Kramatorsk, in the coastal region of Norilsk, in the Arctic republic of Kamchatka. The theme of the exhibition is “Art and the future of man.” The Soviet Union’s first museum dedicated to the artist and culture was the MNE. The museum was opened in 1983 and closed in 1994. The current institution is housed in the former prison camp of the Soviet Union’s Central Security Service (FSB) until 2015. \n\nThe Oregonian, an independent, Portland-based arts publication, has launched a new digital platform, OregonLive.com, that will present the latest news and information about the city’s art and culture. The platform will provide visitors with daily updates on developments in the city’s arts and will showcase work by artists in the field.“A lot of people have asked us about the platform,” said publisher and cofounder of OregonLive.com, Don Kluge. “It�", "The next Biennial should focus on the interrelationships between art and the environment and the reconstruction of the biennial’s twenty-first-century program. The work of the first two days of the exhibition should reflect the exhibition’s commitment to exploring the connections between art and life, with a particular attention paid to the present. The exhibition should be especially marked by the work of artists who are currently or formerly active in the exhibition’s program.\n\nOn Saturday, September 17, ahead of the seventy-fifth edition of the Venice Biennale, the theme of the event was “Reconstruction.” The seventy-sixth edition of the exhibition will be held in the quarter-century following the exhibition and will take place in the capital city’s Vittorio Emanuele, Venice, in the summer of 2022. The show’s inaugural edition, “2021: Architecture, Landscape,” will be staged in the city’s Giro d’Aloia and will include a retrospective of Pablo Picasso’s work in the fall of 2022.“Reconstruction’s New York and New York–based artists, whose work often addresses", "The next Biennial should be held in 2021. The second edition was scheduled to take place in January 2022.  The first iteration of the exhibition, titled “Stanley Kubrick: The Man in the Shadows,” had been staged at the Museum of Modern Art in New York since March 2018. The theme of the museum’s exhibition was “Pose—” and the exhibition, which ran for eighty days, featured work by seventy-seven artists.The museum has also announced that the biennial will be retitled “Stanley Kubrick: The Audience,” and will be presented in the form of a film with the theme of a documentary. The film will be shot entirely in black and will be accompanied by a new sculpture by artist and curator Anita Borg.“We are thrilled that our all-encompassing story of the modern age will be presented in this way,” said Nusseibehro Moth, director of the Museum of Modern Art. “Stanley Kubrick and Anita Borg are a true pair, and their work is a true statement of art and storytelling.” The artist-curator’s first show at the museum was “Pose", "The next Biennial should be held at the Museum of Contemporary Art (MoCA), in June 2020. This year’s event will feature a total of fifty works by forty-seven artists. The theme, “Sensuality/Sensuality” will be “Where Are We Now?” The full list of participating artists is as follows: Anastasia Betschke , New York, New York, New YorkA.J. Dillard, New York, New YorkAmmar Abidi, New York, New YorkJustin Abney, Brooklyn, New YorkNatalie Avedon, New York, New YorkMarian Abney, Brooklyn, New YorkÂA.S.N. Akbarnia, New York, New YorkA.R. Anderson, New York, New YorkA.W. Beasley, New York, New YorkRobert Anderson, New York, New YorkA.R. Callaway, New York, New YorkA.S.B. Alexander, New York, New YorkA.S.B. Alexander, New York, New YorkAlberto Bonafaro-Girón, New York, New YorkAna Bocconi, New York,", "The next Biennial should take place in 2021. \n\n“I’ve been here for thirteen years now, and I’m proud to have produced what has been a triumph for the city of New York,” said Mayor Bill de Blasio (D). “Through the long and arduous process of crafting the redevelopment plan, we created the conditions for a massive economic recovery that has benefited our residents and our city. We’ve also created new opportunities for the arts and the creative economy.”The exhibition, titled “The Future Is Present,” will feature work by twenty-four artists, including Serkan Todashev, Nima Toosi, and Yaneer Mohamed Nasrallah; the first artist to be included in the show, Paul Gauguin, who will present his first solo exhibition in the city next month; and several lesser-known artists, including Kiki Smith, Mary Cassel, and Mimi Alemany.“The Future Is Present is a remarkably timely project for New York City, as the city prepares to welcome people back from the brink of collapse,” art historian Elizabeth Gilbert wrote in an article for Artforum. “Skeptical about returning to", "The next Biennial should be held in the fall of 2021 and will announce the winners in late October. The upcoming exhibition will focus on “Art, Politics, and the Masses” (1926–1957) and will be organized as a “zine,” installation, and performance series.\n\n\nThe Neue Galerie in Paris has appointed Rachida Choudhury as its first director. Choudhury comes to the gallery from the French Ministry of Culture, where she previously served as an artistic director for the Saône-Cloy-de-Marne and won the Prix d’Alès.“I’m inspired by the quality of the work we are doing, and also by the spirit of the Neue Galerie, which has always been an unswervingly intimate and supportive space for art,” Choudhury said in a statement. “This is a very important season to be able to celebrate the return of one of our curators: Rachida. I hope that this new leadership will work together with the board of directors to promote the gallery’s already exceptional collection programs and to strengthen the collection.”In a statement, the", "The next Biennial should take place in the spring of 2021. For the 2021 edition, the theme—­concerned with the rebalance of society—will be the Black Lives Matter movement, which recently led protests in the United States over a grand jury’s decision not to indict George Floyd and the death of George Floyd’s cousin, respectively.“The Biennial is a vital, inclusive platform that stimulates and informs conversations about the art that is currently on display, around the art, and beyond the art,” said Mark Borthwick, chair of the exhibition’s creative commissioning committee. Borthwick added that the 2030 revision—which will focus on the role of art in social change—will also include the work of local and international artists and will be a “more collaborative experience.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Mary Ellen Hanley as its next executive director. Hanley has been its board president since 2016 and has been instrumental in the museum’s transformation from a museum of the twentieth century into one that is envisioned as a hub for contemporary art. She takes the helm from director Daniel H. Weissman, who has served as MoMA�", "The next Biennial should be in 2022 and will be a joint project of the Museums Association and the Museums Board, with research and programming by the Museums Association and the California Academy of Sciences. “We are approaching this as an unprecedented moment,” said Julius Bode, chair of the board of trustees. “This is a crucial time to redefine the future of the museum and the public, and we are eager to see how this new model for exhibitions and public programs will be embraced and developed by the many communities of art in Los Angeles.” The new theme for the 2019 edition was “Expectations by Design: Design in the Making of Contemporary Art” and the 2019 edition featured more than 230 works by seventy-eight artists.\n\n\nSylvia Millar, the New York–based artist who pioneered the use of acrylic paints and plastics to create works that recall works made in the Victorian era, has died at age eighty-eight.Born in New York City in 1926, Millar moved to the city in the early 1950s to study at the University of Pennsylvania. She studied under John and Robert Rauschenberg, the late father of the late Michael Jackson, who often used samples of his own", "The next Biennial should take place in 2022. \n\n\nThe National Museum of African Art (NMA), London: “Art is now more relevant to the lives of Africans than ever before. We need to be thinking of new ways to engage with art to help Africa move beyond the current crisis.” Since the outbreak of the virus in 1976, the number of people diagnosed with the novel coronavirus has risen to 678, and the number of deaths in the country has risen to 387. The coronavirus has spread to twenty-nine countries and regions and has caused at least 113,000 deaths around the world. Luzma, a small town in Nigeria’s Borno state, became a hub for cases of the novel coronavirus. Visitors to the NMA, which celebrates its sixtieth anniversary this year, were greeted by a sea of empty chairs and tables and concerned by the possibility that the popular destination will soon be no more. Last week, the NMA announced that it was halting all events until at least the end of September. It is working with the Royal Shakespeare Company, the National Galleries of Scotland, and the National Galleries of Australia to determine when events will resume. The Royal", "The next Biennial should take place in 2020, but this is not a given. We will consider your suggestion.We appreciate your understanding and hope that these proposals will be of some use to you.Sincerely,Bernardo CamposBORG L.A. (Borges LaBorz)ArtistsListArtists for the next stage:Hannah WilkeDrew HildrethThomas Miró-LópezaroSpanishMariana CamilVicente CifuentesVincent van Gogh2ndBiennial of the Arts in MexicoCity: March 2019<|endoftext|>Story highlights Donald Trump has repeatedly blamed the media for ruining his campaign\n\nHe has accused CNN of killing his chance to be president\n\n(CNN) Donald Trump was given a major setback on Friday as a federal court in Washington, DC, upheld a temporary restraining order that blocked his campaign from closing multiple public buildings in the city.\n\nThe District of Columbia’s Federal Circuit Court of Appeals ruled 4-3 in favor of the Trump campaign, which was allowed to temporarily close a number of buildings in the city in an attempt to prevent the spread of Covid-19, the virus that causes hundreds of thousands of people to contract the virus each", "The next Biennial should be held in October 2020. Executive director Alejandra Almodóvar, who has been director of the Institute for Contemporary Art in Lisbon since March 2020, has previously said: “We will continue to work together as always, in solidarity with our colleagues in the Arts and in the public, in order to push for credibility and quality in art.”\n\n\nAmerican Ballet Theater (ABT) announced today that Michael Rosenfeld has been appointed as its next director and chief artistic director. Rosenfeld, who comes to the company from New York’s Ballet Theater, will assume his new responsibilities on March 31. He succeeds Eric Kripke, who joined the company in August 2018 as director of dance, and will also be responsible for artistic direction and performance.“Michael is a star leader in our company’s history, and we are deeply grateful for his service and for the business relationship he has built over more than two decades with the company,” said cofounder Jeffrey Seller. “This is a deeply ambitious and challenging time to be at the company. We are all deeply grateful for his leadership, his enthusiasm and his vision.”Rosenfeld comes to the company from the New York", "The next Biennial should focus on “negative space,” which might include themes such as the physicality of art and the political, social, and economic conditions of the contemporary world. It should also consider new ways of thinking about art and the world.In response to the decision, the Fondazione Biennale Foundation wrote: “The Fondazione Biennale is a foundation founded on the vision of an internationally supported, the arts and culture of Italy. We are always active, aware of the current situation, and committed to keeping our future plans for the event in mind. That is why we decided to postpone the forthcoming event until at least 2020. We look forward to working with the community once again, and to continuing to present the best art and culture of Italy in the years to come.” \n\n\nThe Neue Galerie in New York has announced that it will lend more than two hundred works by fifty-eight artists and collectives to the institution. Topics of the exhibition include “The Death of a Great Russian Architect,” “His Body, Its Parts,” and “Benign Vision,” and will run in conjunction with the two-year-long celebration of", "The next Biennial should be held in 2022.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it is preparing to launch a $1 billion cultural redevelopment program for the city’s seven boroughs, which will be led by the city’s Department of Cultural Affairs (DCLA), in the spring of 2021. The DCLA’s urban plan for the city, released this spring, called for the redevelopment of “all of New York City’s historic districts,” including the Catskills, the Hudson Valley, and Central Park, as well as the South Bronx, the Criminalist District, and the Lower East Side. The city has already spent $2 billion to remake the streets of much of Manhattan, but it plans to spend $3 billion more to make up for lost ground in the boroughs and to extend the streets of the South Bronx. The plan also calls for the construction of more than 1,300 new affordable housing units for low-income New Yorkers, and for the expansion of public transportation, the streets, and cultural and historic sites, and the arts.The plan is part of", "The next Biennial should take place in the summer of 2022, and will include presentations of new works by leading artists from the emerging and established categories, such as photography, film, sculpture, and performance.Selected by a jury comprising art historian and curator Hie Iskowitz, Berlin’s artist-in-residence Peter Dreher, and artist-in-residence Helene Bochereau, the exhibition will be curated by Hie and Peter Dreher in partnership with Benteke, the management company of the Pushkin Museum in Moscow, and the Russian Academy of Arts in Moscow, in collaboration with the independent curator and curator Andrea Borys.The biennial’s first exhibition, “NIRIN,” will feature the work of the Russian artist Oleg Mitrokhin, who is currently on display at the Russian Academy of Arts in Moscow. The work, which is based on a periodical called the «Dumina,” is a reinterpretation of the NIRIN star, the constellation of thirty-six stars that forms the constellation Pisces, and is a reflection of the Épineuil-Ateliers in Paris. Other works on view include “Radical", "The next Biennial should be in May 2020 and will be hosted by the Museum of Contemporary Art, Los Angeles (MCA). The exhibition will culminate with a performance by the Los Angeles–based folk-pop trio 60 Minutes (also featuring Kevin Hufse).The show will also draw upon the artist’s other works, including the work The Mexican, 2018, a quadruple-brick, five-story installation at the Museum of Modern Art, curated by Joëlle du Palais in Paris, and the 1967–68 collection of Thomas Hampson, which includes works by such luminaries as Margaret Sanger, Frank Gehry, and Robert Irwin.The three-day event will also be hosted by the Los Angeles–based nonprofit Collaborative Workspace, which has partnered with local arts institutions to host the show. It will showcase a fifty-five-minute video installation by director Nari Ward, a performance by the Los Angeles–based artist Tanya and Paul Kaplan, and a book by the artist from the show’s third exhibition. The show will run from March 19 to March 21. “We are incredibly excited to work with the MCA to present the next Biennial, and that the show will be assembled", "The next Biennial should be in 2020, with the dates to be announced later. \n\n\nThe New Art Museum Houston (NAMI Houston) has appointed Kate Fowle as its next director. Fowle has served as the interim director of the institution for the past twelve months. In her new role, she will be responsible for building on the museum’s cultural legacy through programming that addresses contemporary issues of art and culture, scientific research and public engagement, and the collection and exhibition of contemporary art.“Kate’s expertise, passion, and willingness to take on challenging and often conflicting challenges not only aligns with NAMI’s mission, but is in harmony with our visionary leadership team’s vision to engage audiences, foster the institution’s full range of artistic and academic interests, and shape the city of Houston,” said NAMI board chair and CEO J. Paul Getty. “In the years ahead, she will provide the leadership, vision, and technical capabilities that NAMI has lacked.”Fowle comes to the institution from the Metropolitan Museum of Art, where she has served as director since 2015. During her tenure at the museum, she oversaw the renovation and expansion of the Met’", "The next Biennial should be held in 2020. The Biennial will be hosted at the Marsden-Fortes Art Museum in New York. The biennial will include a program of exhibitions, performances, and other events, culminating with a grand opening reception on December 8, 2020.\n\n\nThe heirs of James A. Farquharson, an American aviator and creator of one of the first video games, are working together to create an immersive work that will explore the connections between video and video art. The partnership between the two artists, who were both born in the same town in Orange County, California, but were separated at birth, was first revealed by Artforum. This week, James and Irene Farquharson have announced that they are collaborating on a new project, titled James & Irene: Video, the James Farquharson Experience, which will present a selection of Farquharson’s work at different times throughout the year.“The mission of the James Farquharson Experience is to be an educational platform for the artistic community, especially for those not previously familiar with Farquharson’s artistic legacy, and to enable exceptional artists to expand the vocabulary of our art. We hope that", "The next Biennial should take place in 2021–20.\n\n\nThe Benjamin Casteel Fund, which has supported artists and arts and cultural institutions in New York City since 1999, has received a gift of $6.6 million from the Sacklers. The funds will go toward the construction of a new scholarship center in their honor. The new space will also include a new exhibition space and a media and performance space.The gift was made while the $5.5 million center was still under construction and was made in honor of the Sacklers’ philanthropic support of many artists. The institution is working toward constructing a new permanent collection space for the artists and has recently introduced new scholarship on contemporary art and the social, political, and cultural legacy of the Jewish people.In a statement, the fund said: “After a lifetime of championing artists and cemeteries, the Sacklers are thrilled to support the new center dedicated to their legacy. The new center will:· Celebrate the legacy of the beloved Casteel brothers.· Encourage a more direct and immediate connection between the Museum and the cultural community, with a new programs and outreach program;· Contribute to the preservation of a globally recognized collection of Jewish art; and· Stre", "The next Biennial should be held in 2020, with a budget of $25 million. The 2020 event will, however, be somewhat smaller than the 2019 event, with a budget of $30 million. The 2021 event will also be smaller, hosted by Radcliffe Art Gallery, in London, and will take place at a different location. While the museum’s new exhibition space will be inaugurated by a show of the works of the first ten years of the British Commonwealth, the museum will also host a series of commemorative events in commemoration of the anniversary of its founding in 2021.The 2020 venue will host the opening exhibition “The House of Ideas,” curated by Mia C. Jackson. The 2019 event, “From Antiquity to Modernism” will go on view in 2021, with a new exhibition of the works of the former director general of the Royal Academy of Arts, Christopher Le Brun.“The House of Ideas” is a collaborative project between the two institutions, which will collaborate on the installation, archiving, replication, and conservation of the original drawings of the museum’s prehistoric galleries, and the design of the new central location for the institution. The exhibition will bring together the work of sixty artists,", "The next Biennial should take place in the Netherlands in 2022.  Mautner has since launched a commission of foreign artists to present a collection of works by the Hannover-based artist Adam D. Iron Eyes.The exhibition will be a joint project of the Museum of Contemporary Art, Hannover, the University of Mainz, Krefeld, and the Kunsthalle Basel. For more information about the festival, visit the Museum of Contemporary Art, Hannover. \n\n\nThe Michigan-based artist, activist, and educator Craig Thompson, who initiated and ran several massive art and education projects in the United States, including the Colby College Art Museum in Waterville, Massachusetts, and the Museum of Contemporary Art, Detroit, was recently named the winner of the $75,000 MacArthur Fellowship, which is one of the largest grants in the United States.The MacArthur Fellow was selected by a committee comprised of DC Galleries Fellow Sam Rock and DC Julien Galleries Fellow Rebekah J. Browne, who was also a MacArthur Fellow in the arts. The jury comprised James Cuno, a Los Angeles–based MacArthur Fellow; Adrian Bell, a MacArthur Fellow in the arts; and LaToya Alcorn,", "The next Biennial should have been the one where the full range of the artist’s experience was represented. Instead, it was slimmed down, auteurist, and commercial in its approach.”\n\n\nThe City of Los Angeles (L.A. County) announced today that Solveig, who has been a Los Angeles native since 1990, will be enshrined in the city’s National Cemetery. The announcement marks the first time the eighty-two-year-old artist will be buried in the city’s national repository. The project, which will also involve the construction of a new, more than six-mile-long Solveig driveway, was funded by billionaire industrialist Peter Zegar, the founder and chairman of the pharmaceutical company Merck. According to the Los Angeles Times, Zegar donated $1 billion to the cemetery in the ten years since it was founded.After Solveig’s death, the National Endowment for the Arts (NEA) established a gift fund for the cemetery. The final resting place of Solveig will be in the city’s city-owned backyard, where he will be interred in the city’s public cemetery alongside John Ed"]