["The next Biennial should take place in 2020. Following the ceremony, the Smithsonian American Art Museum Atlanta will host a public exhibition of works by Indigenous artists.\n\nAUSTRALIA’s cultural sector is facing a major blow as the country heads into a new round of budget cuts, which will likely affect arts workers and institutions in all corners of the country. The Australian Council for the Arts (AC), the Australian Council for the Humanities (ACHA), and the Australian Council for the Arts (AC) are among the arts groups that have laid off or furloughed staff since the March 7 budget cuts were announced.The moves have forced a reckoning for the government, which has already reduced funding for arts programs by $275 million since the March 14 start of the financial year. Government minister Christian Porter announced the February 22 budget cuts for the 2019–20 financial year and started phasing out some $54 million from the arts, on February 19. According to the Australian Broadcasting Corporation, the cuts will affect every part of the Australian economy, from small local venues such as cinemas and music stores to large institutions such as the Art Gallery of New South Wales.While the news isn’t all bad for Australian arts", "The next Biennial should be held in 2020.\n\n\nCultural historians have criticized France’s newly launched Institut Politique de l’Amitié in the name of freedom of the press, but a new book by French author Nathalie Bassouila argues that the move is a dangerous step in the country’s ongoing struggle against extremism. The Political Prisoners Project, an advocacy group, has launched a campaign to raise awareness about the plight of political prisoners in France and has proposed that the French government abolish the institution. The group is also seeking the immediate abolition of the death penalty and the release of all political prisoners.“We condemn the Institut Politique de l’Amitié, which proposes to change the prison system in France,” Bassouila writes in The Political Prisoners Project’s book, Amitié Bassouila: Quarantines (Paris: Mouton Rothschild, 2017), which was published by Verso. “The institution is an affront to the fundamental principles of democracy: freedom of the press, freedom of the demonstrations, freedom of the assembly. We demand the immediate and unconditional release of all", "The next Biennial should take place at the American Museum of Natural History in New York in 2021. The full list of participating artists can be found below: 1. Jack Blum, New York, NY 2. James Turrell, New York, NY 3. Anselm Kiefer, New York, NYC 4. Ilse Hansen, New York, NY 5. Marcin Zalewski, Warsaw, Poland 6. Craig Johnson, Dallas, TX 7. Dennis Ho, New York, NY 8. Andrew Ho, New York, NY 9. Laura K , Chicago, IL 10. Rebecca Hoist, New York, NY 11. Adam M. Karl, New York, NY 12. Jackie Mall, New York, NY 13. Catherine Oehlen, New York, NY 14. Diana Pape, New York, NY 15. Daniel Rees, New York, NY 16. James S. Jones, New York, NY 17. Kate Scott, New York, NY 18. Sara Shatz, New York, NY 19. Joslyn Stegner, New York, NY 20. Mark R. Lillard, New", "The next Biennial should focus on outreach to the large-scale art museums and academic institutions in the United States, which have been hardest hit by the pandemic and are struggling to keep their doors shut. The 16th is also expected to highlight the contributions of women to American art and will focus on the history of women’s art, and will include a selection of works by artists historically underrepresented in museum collections as well as pieces by artists of color.The Los Angeles– and New York–based artist Nari Ward-Foster, whose 2008 exhibition “Masculine Rebellion” featured work by artists such as Isamu Noguchi, Laura Owens, and Louise Nevelson, as well as works by radical hip-hop artists such as Yukon Kaiba, said: “This biennial will not only honor the legacy of the pioneering women artists of the American canon, but will also encompass the work of young artists who are striving to make a difference in their communities and the world.”\n\n\nThe National Gallery of Art in Washington, DC, has received $7 million from the $2.1 trillion fiscal year 2018 fiscal, the Office of Fiscal Affairs reports. The grant follows a", "The next Biennial should take place at the Museum of Contemporary Art, Miami Beach, in December 2019.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has received a $5 million donation from the Sperthafel family of Germany, which has represented the family in the Berlin Art Show for the last two years. The gift comes from the Sperthafels, a family who previously established an eponymous art gallery in Berlin in 1972. The Sperthafels are also the owners of the German company Silbern, which invests in the development of German art. The donation is made in honor of the family’s dedication and entrepreneurial spirit.“The gift of the Sperthafel Collection is a fitting tribute to the family’s longstanding commitment to support the development of the Berlin Art Show,” said Frank Sperthafel, the family’s founder and longtime chairman of the Sperthafel Group, who was a board member of the institution and oversaw the gallery’s transformation into MoCA. “Since the gallery’s inception, the family has championed the exhibition as a vital platform for the German art market, and it has always been true to its word", "The next Biennial should focus on the history of art in the Port, and the next on the city’s African diaspora. The current exhibition “The World is Only Skin Deep,” which explores the heart-rending weight of cultural memory, is being organized as a series of two exhibitions, “Labyrinth of Art,” with the upcoming exhibition “Uncanny,” which is focused on the history of women’s art in the United States, and “The Paris Review,” which will take the arts and culture of Paris and present it as a large-scale performance.An international panel of thirty-eight artists will examine the history of art in the Port and the history of art in the African diaspora in conjunction with a series of solo exhibitions. The artists include Robert Creely, S; A.S. Tugade, M; S.S. Johnson, L; L. Habe, M; S.R. Anderson, K; and L. Lobdell, K.The upcoming series of exhibitions will have an opening in January 2020 and will run concurrently with the upcoming exhibition “Theatre of Cruelty,” which will open at the", "The next Biennial should showcase the work of the entire staff of the Biennial Centre, with an emphasis on the production of work by artists whose practice spans the globe.”The exhibition’s inaugural edition—held in March 2018—was disrupted by the Covid-19 pandemic. The centre reopened in August, but the exhibition suffered as the UK faced a surge in COVID-19 cases. A second exhibition, “Aerialism: The Art of Jules and Paul” (2019), was canceled. The third, “Strategy of the Framemaker: The Art of Elisabeth Kübler” (2019), was rescheduled.The Biennial Centre, which prides itself on hosting over one hundred exhibitions annually, is facing a loss of $300 million as a result of its location in a city-owned redevelopment project, as complaints mount that the venue is overcrowded and is not being protected by a new, $75 million flood wall. The Central London Forum for Arts and Technology (CLFAT) is also concerned about the future of the space. Its board chair, Peter Tosh, has threatened to pull the plug on the center if it does not alter its plans to demolish three existing buildings—", "The next Biennial should focus on “In Defense of the Human Being,” a new exhibition of work by thirty-one curators and dealers, curated by Adam Gopnik, that will open in the spring of 2021. A performance of the exhibition is planned for the fall.\n\n\nThe J. Paul Getty Trust in Los Angeles has approved a proposal to acquire the artworks of the controversial late Chinese dissident artist Ai Weiwei for $100 million. The news marks the end of a tumultuous five-year campaign, beginning in November 2017, when a group of artists and collectors led by collector Kihong Hsu and activist Steven L. Shapiro staged a protest at the Getty’s Los Angeles headquarters over the proposal.The trust’s board of trustees voted 2-1 in favor of the acquisition, which was approved by the executive director of the trust, David Karp, in a vote that marked the end of an era for the trust, which oversees most of the artist’s art. The trust’s board chair, John S. and James L. Paulson, said: “We are delighted by this major milestone and look forward to the upcoming exhibitions and programs.”The trust will distribute the proceeds", "The next Biennial should be held in the spring of 2020, said the organizers.The London-based artist, who has also had solo exhibitions at the Museum of Modern Art, the National Portrait Gallery, the Royal Academy of Arts, and the Governors Palace in London, and whose work is exhibited in the collections of the British Museum, the Tate, the Institute of Contemporary Art, and the National Gallery in London, created the work for her 1979 exhibition “Doll,” a collaboration with the artist Barozzi. The exhibition, which was opened by Bernard Oppenheim, was one of several exhibitions hosted by the artist in the United Kingdom, where she lived and worked from the 1970s to the early 2000s. The collection also comprises works by Rembrandt, Tintoretto, and Kandinsky.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it plans to open a new arts space in the building currently occupied by the Hardy Boys Museum (BMB) in the city’s Greenwich Village neighborhood in the spring of 2020. The museum’s new home will be located on the ground level of the former HCA building, which has yet to be completed, and will feature a $1", "The next Biennial should open in 2020.The exhibition’s next edition will take place at the Museum of Modern Art and the Los Angeles County Museum of Art. The 2020 exhibition will feature works by forty-nine artists, including Andrew Collins, Yayoi Kusama, Robert Creel, Richard Diebenkorn, and Andrew Kreps.\n\n\nOn Wednesday, the Chinese artist and educator Ting Geng (1944–2017) was selected as the winner of the Asia Art Award. In a shortlist that included the works of Kunlun Zhou, Chang Yuxian, Zhijie Zhang, and Xiaoxing Zuo, Ting was chosen as the winner of the award for his “The World Is Not Enough,” a monumental project for which he built a huge and intricately stained woodwork in China’s Tiananmen Square. He was also awarded the ArtsPrize, which is an award given to a contemporary artist who has made an outstanding contribution to art-making. The winner will be announced in January 2020.“Ting is a spiritual teacher and a great artist, who has shown the way to a new artistic era", "The next Biennial should be on the issues of the presentation of art and society. He will continue to serve as the main curator of the exhibition “Alberto Adonis’s Modern Art: From the Post-War Period to the Present.”\n\n\nThe Stanley Donwood Foundation in Oakland, California, announced today that Megan McArdle has been named its 2021 recipient of its highest honor, the Stanley Donwood Lifetime Achievement Award. In recognition of her accomplishments as a curator, the award is bestowed annually by the foundation on those who have made outstanding contributions to art.McArdle will receive the award at its annual gala on Saturday, November 28, at the Stanley Donwood Gardens in Bloomfield Hills, Michigan. The gala will feature a performance by the contemporary artist Hozier, an installation by artist Renata Calderón, and a moderated Q&A with McArdle.Drew Johnson, a senior curator at the Stanley Donwood Foundation, said: “I’m thrilled to welcome Megan to the foundation. Megan has developed a sterling practice over her forty-five-year career, both as a curator, educator, and writer, and we’re confident that her next project will be", "The next Biennial should be in 2022. The last was in 2020. \n\n\nThe Metropolitan Museum of Art has appointed designer and founder of L.A. Reid Whitney Architects the next director of its Design Museum. Whitney’s twenty-seven-year tenure at the museum began in 2016, when it was still known as the Dirksen Gallery. He succeeds Michael B. Johnson, who was hired to head of the George Chamorra Collection in the 1980s, when the latter moved to the Museum of Fine Arts in Boston.It remains unclear whether Johnson, who died in 2006, will return to the museum in 2022. In a memo sent to museum directors last week, Gagosian said that Johnson “will play a critical role in ensuring that the museum remains a vibrant, internationally recognized destination for contemporary art and architecture throughout its seventy-year history.”\n\n\nThe Guild of Visual Arts (GVA) in New York has appointed Amara Dancy as its new president and CEO. She succeeds Bradley Baillie, who retired in August 2019 after seventeen years at the helm of the organization. Dancy comes to the Guild from the Los Angeles County Museum of Art (LACMA), where she has served as the executive", "The next Biennial should take place at the site of the United States military base in Qatar from January 21 to March 7, 2020, and should be held in conjunction with the 18th Venice Biennale. The 2022 edition will be staged at the Algeria-Palestine Center in Paris. The 2022 edition will be curated by Anselm Kiefer and Martin Lüpertz.\n\n\n\n\n\nCollectors Daniel and Luca Cimmina have sold their majority stake in the French luxury conglomerate Saint Laurent to Sotheby’s. The company announced the news at the end of March, and CEO Marc Spiegler said the partnership had been in the works for more than two years. He told the Art Newspaper: “From the beginning of our discussions Sotheby’s was interested in taking stock of the future of fashion and luxury goods. Their philosophy is to focus on design. We believe they see what we have been doing with our collections since the 1980s as a core part of our business.”“We are delighted to be supporting the work of an artist of impeccable talent and integrity, who has been at the core of the company’s story for twenty years", "The next Biennial should be held in 2021.\n\n\nThe New York–based biennial Arts+Open, which has been held every June for the last thirteen years, has announced that it will be forced to cancel its 2020 edition, which was originally to take place in June in the city of New York and was set to take place in June 2021. The cancellation was made after the organization received an outpouring of support from the public for its decision to hold the event in the months of June and July.More than half a million people have signed a petition supporting the annual event, which was cofounded by American artist and curator Luke Kelley in 2002, and its organizers announced on Thursday that they have received over 1,400 letters of support from artworld professionals and are expecting another wave of support for cancelling the event in the coming weeks.“We have received incredible support from the art world community since we announced our intent to cancel the event in May,” organizers said in a statement. “We are immensely grateful to our staff and board for their tireless work in reaching our decision. We are grateful for the invaluable input and advice they provided throughout the process. We acknowledge the work of our independent curator, Anna C. Hsu, who", "The next Biennial should be held in 2020.” In a statement, the National Gallery said: “The National Museum of Art will not be the same without the incredible generosity of our generous donors, and the enthusiastic enthusiastic leadership of curator Marian and board chair David Kander. We will continue to support the National Museum of Art with a powerful and transformative exhibition program, and will work with our talented team to design an exciting exhibition for the National Museum of Art in 2021.”\n\n\nArts and Culture Minister Pia Camil and Media Minister Monica Graziano are dealing a heavy blow to the Italian art scene with the retirement of Carlo Cipolletta, the former president of the Palazzo Bicocca, over the course of a year. The move was made in an attempt to avert a government-imposed shutdown and is part of a package of social and economic reforms that will tackle the country’s massive fiscal crisis.“Carlos Cipolletta was a fantastic example of a young man devoted to art who understood and appreciated the power of art as a tool of social change and who made it central to his political and social practice,” said Pia Camil. “After working", "The next Biennial should take place in 2021 and will be organized in the new museum. The 2019 show was held at the Yuz Museum in Moscow, and the show featured work by more than 80 artists, including Alexey V. Kalinin (Artists Project), Diletsya Chaudhari (Kunsthalle Künnen), Lina Gedney (Bower Whittle), and Rujela Kadam (Guggenheim Museum, London).This year’s edition will focus on contemporary issues such as climate change and the impact of art on social change. The 2019 exhibition opened with a series of performances by artist-run organizations at the St. Petersburg Design Week (SPV), which aims to advance the practice of architecture in the Russian capital. The first part of the show, titled “Future Cities,” will feature the work of people from regions such as the Mari city state, the Urals, and the Kaliningrad region. The second part of the show, titled “Intersections,” will invite the public to consider the intersections of architecture and landscape through the art of re-creation. The show will coincide with the upcoming Art Basel Hong Kong fair.\n\nThe", "The next Biennial should be held at any of the following locations:ArchitectureCenter, ArchitectureCenter HD, ArchitectureCenter LX, ArchitectureCenter M, Architecture Center N, Architecture Center O, ArchitectureCenter PW, ArchitectureCenter Q, ArchitectureCenter S, ArchitectureCenter T, ArchitectureCenter U, ArchitectureCenter V, ArchitectureCenter VI, and ArchitectureCenter VII. The final exhibition will be held at the Art and Design District in Hong Kong in 2020. The 2019 exhibition was organized by the Hong Kong–based company MCH Group and attracted a total of 213 artists, including Isabel LeBlanc, Michael Olade, and Sohrab Mohebbi.\n\n\nThe Alabama Museum of Art (UMA) in Tuscaloosa has announced that it will reopen to the public on Monday, April 20, 2020, following a $135 million expansion project and a $105 million gift from philanthropists Marilyn and David Wilmot. The extension of the museum’s footprint in the city of Tuscaloosa, which was completed in 2017, has also added twenty", "The next Biennial should take place in the fall of 2020.\n\n\nThe Ottawa Architecture Biennial announced today that it will postpone its 2020 edition, which was originally slated for December, because of Covid-19. The event will now be held in June. The event, which will be staged in the city’s Ottawa Armory, will be relocated to the National War Museum in Ottawa. The museum will also receive an additional $1.2 million to accommodate the anticipated influx of visitors from the region.The decision to move the exhibition, which was originally scheduled for July 21–July 23, was made in recognition of the ongoing recovery efforts following the global health crisis. Approximately 2,800 people have died from Covid-19, and the number of people infected with the virus is rising rapidly. The World Health Organization (WHO), the United Nations, and the governments of the United States and Canada have all declared the outbreak a global public health emergency.The biennial, titled “Orient,” will instead focus on the work of artists dedicated to preserving and presenting history through the study of the evolution of the shape and structure of the earth from prehistoric times to contemporary times. The theme of the year 2020 is “Making Place.” The", "The next Biennial should take place in 2020 and will be the fourth one in the US. Emerging from the sixteenth Biennial in Johannesburg, South Africa, the theme “Feminism and its Critics,” which is a nod to the current year, will begin with a “sixth slide.”A biennial is an amalgamation of artist-centred exhibitions and public presentations, usually organized in both a city and a country. A biennial is also a biennial is an ensemble, which is a collective work staged by an artist. The last two years have seen the first exhibition of the “Art of: South African Women,” curated by Nari Ward and featuring work by ten artists. Previous biennials have featured work by the likes of Katchu Ndzube, Tsegatha Mpagi Sepuya, and Melanie Bulow.“The themes of this biennial are ‘Outsiders and In: The Difficulties of Being a Woman’ and ‘In: The Difficulties of Being a Man.” “Outsiders and In: The Difficulties of Being a Woman’ is a feminist statement: we ask", "The next Biennial should open sometime between September and November 2021, with the event to take place at the eastern end of the city. The show will also include a retrospective of the Biennial, titled “Lombard & White” and a presentation of works by former curators Christopher Wool and John Ma, among others.\n\n\nThe National Arts Center (NAC) in Alexandria, Virginia, has received a gift of four hundred works from the late American composer and educator John Adams. The donation includes almost four thousand images, drawings, and photographs, as well as several early works by Adams, including his classic, “Goodnight Moon” (1955), a heavily textured, geometric design that evokes the moon and the stars. The works were donated by his longtime friend and colleague, Ralph Ellison, and are currently housed at the institution. Since the late 1960s, the NAC has participated in a program of free public exhibitions, lectures, and talks with acclaimed artists such as Mark Halperin and Terence Blanchard, as well as with artists of African and international descent. The program, which also includes free public programming, has helped establish the museum’s reputation as a leading cultural institution in the United States.", "The next Biennial should announce the selection of the twenty-nine artists who have participated in the previous iterations of the exhibition in 2021. The selected artists will then receive a one-time grant of $100,000, which will be used to further develop their public programs.The 2018 and 2019 editions of Biennials were held at the Museo de Arte Contemporáneo (MAS), in partnership with the cities of Friulano, Rio de Janeiro, and Sao Paulo. The exhibition featured work by some sixty artists from twelve countries. The 2019 edition, “In the Shadow of the Sun,” featuring work by Natalja Lintjens, was presented by the artist-run project Tanya Bonakdar. The exhibition was curated by Arseney Cibulkova, the artistic director of the collective Pinchas (Arts of the People), and Pia Camil, the former artistic director of the Los Angeles County Museum of Art.The 2019 edition of the exhibition was held in the Museo de Arte Contemporáneo, Rio de Janeiro. The exhibition was curated by Alexander Dallenbach, the curator of the second edition of the show, “Thesaint” (", "The next Biennial should examine the theoretical and practical aspects of modifying and integrating social and cultural objects through the creation and manipulation of light, sound, and images. The next will be a public gathering that would represent the coming together of artists and cultural workers from different regions of the world. The next, scheduled for 2020, is a text by Merry Pape, a leading German artist and activist, which will focus on the history of the United States from the perspective of its visual arts and humanities. The next will showcase the work of Anya Coman, an American artist and activist, in collaboration with the staff of the Seattle Art Museum and the Washington State Cultural Center.\n\n\nThe David Yuritomo Foundation in New York City has announced that it will donate $5 million to the David Yuritomo Foundation for the Arts as part of a new $15 million initiative that aims to advance the work of art and culture in New York City. The art museum will receive the funds from the David Yuritomo Foundation for the Arts, which was founded by Bechold Agapenko, the founder of the Berlin-based company Analogue Devices, in October 2019.“This is a time of great loss and", "The next Biennial should take place in 2021 and will be held at the museum in conjunction with the Tokyo Art Museum. The first exhibition will be titled “Ukiyo-e: Ai no Koto', a collaboration with the artist Ayumu Kawamoto. The next exhibition will be held in 2020 and will be held at the Museum of Contemporary Art in New York.\n\n\nThe London-based biennial, dubbed the 'naked and perfumed city', has been canceled. Its organizers cited safety concerns surrounding the exhibition as the reason for the cancellation. The show, which was slated to take place in the Hammer Museum in London in September 2021, was to feature forty artists, including Peter Andre, Marcel Breuer, and Ulrika and the Open Arms, and was slated to be the opening of the inaugural Biennial of the Americas. It was also to have featured the work of thirty-four artists representing twenty-six nations and thirty-four aesthetic zones.“The London-based biennial, ‘naked and perfumed city’, was canceled because of a serious concern for the safety of the artists who are participating in it,” Elizabeth Denholm, the director of the Hammer Museum, told the Art Newspaper. �", "The next Biennial should be held in two phases, beginning in 2020 and 2021, according to organizers. One of these phases will be open to the public, while the other will be closed to the public. The theme of the 2020 edition is “Abercrombie and Beyond: Fashion as Art,” and the 2020 participants will be chosen by a jury consisting of Khadija Kapoor, Kamala Khan, Eva Lechtenberg, and Hannah Mark-Viver. The 2021 edition will introduce two new themes:  “Abercrombie and Beyond: Fashion as Art and the Art of Man,” and will be held at the Museum of London. The 2019 edition was organized by Abercrombie and Beyond, but the 2020 edition will be run by the museum, with the help of a team of twenty-six designers and curators. They were chosen from a pool of five finalists, including Nadine Vermeer, Sasha Levine, Andrea Levitt, Amina Maad, and Olivier Prouvost. The design firm that won the 2019 prize was Nirvan", "The next Biennial should be held in 2020. The time and date have yet to be decided.\n\n\nThe National Museum of Fine Arts (NMFA) in Boston has hired Jennifer C. Canavan as its new director. Canavan will take the helm of the institution from Mark DeRe, who will remain involved with the museum through 2024, and will be responsible for overseeing the performance of the institution’s more than four hundred works in the coming years.“Jennifer is poised to focus on the future of the NMFA as she builds on the museum’s past achievements, creating an environment for artists and thinkers to realize their full potential,” said Diane Russell, the institution’s director and chief executive of conservators. “A visionary organizer, she will bring a new and compelling vision for the museum, and the board of trustees, and to the community.”The seventy-six-year-old museum director has been a longtime advocate and champion of the institution’s collection, which comprises some six hundred works, and its collection as a whole, for the past thirty years. She is credited with coining the term “collectivism” and was one of a group of curators who established the museum", "The next Biennial should be held in 2021. The 2019 iteration of the event, entitled The Death of Art, was held in Los Angeles in March and featured work by eighty-three artists.\n\n\nAlberto Bedoya, a Mexican-born American artist whose monumental series of Labyrinth paintings were inspired by both the Zen and Pop movements, has died at the age of seventy-seven. The work, which explores the notion of an afterlife, is a meditation on the limits of the human experience.Born in Los Angeles in 1937, Pettway became interested in art and architecture at an early stage. After graduating from the University of California, Berkeley, he moved to Mexico City, where his early career took off. His first solo exhibition was at the Trecedo Museum in Villa Borghese in 1959. The next year, the artist began to receive commissions. In 1962, he returned to his hometown to paint the labyrinth of the Los Angeles Public Library. Returning to the work in the early 1980s, Pettway created a series of paintings that combine the elements of wood, paint, and mirrors, each depicting an individual person's final resting place.Named after a phrase in Spanish, the series has been exhibited at the Los Angeles County Museum of Art; the Pasadena", "The next Biennial should be held in 2021. The next will be held in 2023. The museum has also hired Paul Mpagi Sepuya, who will serve as the museum’s director of curatorial affairs in the first year of its new location at the Khao San Road in Bangkok, and will soon have a new works installation on view. Unlike most contemporary art institutions, the Museum of Contemporary Art (MCA) in New York has not yet awarded its first artist-in-residence, or a new artist-in-residence grant. However, in a recent Artnews interview, MCA director Marc Glimcher said that the museum has had conversations with artists and have had discussions about how they may be able to benefit from the institution’s new space. \n\n\nThe Auditorium at the Whitney Museum of American Art (MoA) in New York has named the sixty-two artists who will receive the $400,000 $1,000,000, $250,000, $100,000, and $50,000 prizes this fall. The winner of the $50,000 prize will receive $100,000.Artists are chosen by an independent panel of judges. The award", "The next Biennial should be in 2022.\n\n\nThe National Geographic Society’s plan to move the very last scene from its upcoming exhibition “The Grand Canyon’s Sculpture,” which is currently on view at the Art Institute of Chicago until March 5, has been halted by a judge. The scheduled March 18 opening of the exhibition has also been moved to March 21–March 22. The postponement means that the March 21 opening date for the exhibition will be rescheduled for March 23–March 27.The postponement was made in a ruling published by Judge Lawrence E. Strickland of the United States District Court for the Northern District of California on March 19. Strickland ruled that the March 20 opening of the exhibition’s second section—a documentary based on the artist’s trial and his performance in the Mississippi Delta in the 1970s—was invalidated by a review panel appointed by the court. The panel found no evidence of “the ravages of cancer or other unnatural causes” and found no evidence of the museum’s use of a “group”” to “pressure or manipulate” Willem de Kooning into participating in a “photo-", "The next Biennial should take place in the spring of 2022. The biennial is part of the initiative, billed as a collaboration between artistic producers from the UAE and New York City, to further attract international audiences to the UAE, and is being organized by the Institute of Contemporary Arts (ICA) in the United Arab Emirates.“The UAE is a vibrant hub for creativity and innovation in the Middle East and North Africa,” said Munem, who is also the head of the Ministry of Culture in the UAE. “The new edition will explore themes of history and philosophy, its relations with art and architecture, and its impact on people and communities. The exhibition will incorporate new artistic and technological approaches, as well as new approaches that are new to the UAE. The exhibition will be hosted at the Abu Dhabi Institute of Contemporary Art, and will run from March 13 to March 20.” The UAE has long been considered one of the most promising destinations for culture in the Middle East. In 2013, the country hosted the Venice Architecture Biennale, and last year, the Abu Dhabi Museum of Art staged an exhibition of work by internationally acclaimed artists, including Ahman Sobhi, Saad Al Hussein, and Yasser Sall, among", "The next Biennial should feature short films from the winners of the first two editions, which were staged at the Art School and the Royal College of Art in London, respectively. Two films from each category will be presented in the third edition, which will be held at the Brooklyn Museum in New York from November 25 to December 7, 2020.The next iteration of the annual Topaz Prize will focus on “institutional inquiry,” said Sofia Bronkhorst, the director of the Guggenheim in New York. The 2019 edition, which was staged at the Museum of Modern Art in New York, was organized as a “mini-series,” while the 2020 edition will be “more ambitious,” she said. The film festival will also aim to “do more with less,” Bronkhorst said.Its inaugural section, “Institutional Inquiry,” will feature three films from the biennial: the work of Humberto Delap, the architect and urban designer known for creating works such as the Tucson House of Architecture, a modest forty-foot-wide, half-submerged concrete residence built in the desert on an eighty-foot-long, twenty-one-foot", "The next Biennial should focus on the creation of an international leadership and collection of contemporary art from Russia and other former Soviet republics, including Kazakhstan, Belarus and Uzbekistan. The twenty-first and twenty-second biennial will focus on the revival of Russia as a global cultural leader.\n\n\nThe Hirshhorn Museum in Washington, DC, has appointed Brenda L. Evans as its next executive director. Evans will be responsible for developing and implementing global priorities for the museum and developing the Hirshhorn’s mission statement. She succeeds Sidsel Mijers, who led the Archiv for Humanities and Social Sciences at the museum for twenty-four years, and will begin her tenure in January 2020.“We are thrilled to welcome Brenda to the Hirshhorn,” said Marnica Hockley, chair of the board of trustees. “Her impressive career at the Archiv and her decades of leadership have been central in developing the Hirshhorn’s unique collection and its international reputation. We look forward to her leading us through this transformative moment as we embark on our next chapter as a museum.”Previously, Evans served as chief curator at the Metropolitan Museum of Art in New York. During her tenure at the", "The next Biennial should be set up at the current site of the Museum of Modern Art in New York, the newly renovated Diller Scofidio + Renfro–designed Pavilion of Art, and the newly redesigned Museum of Modern Art—the present-day boundaries of which were reinterpreted in numerous ways by artists and designers.\n\n\nThe KW Institute for Contemporary Art (KW Institute), located in the southern city of Wuppertaler, Germany, has announced its representation of the Italian designer, painter, architect, and photographer Imane Valade, a collaborator of São Paulo-based artist-activists César Cervetto and Marisa Cervetto, in the exhibition “Reborn,” which will run for thirty days from March 13 to March 15. Valade’s work is part of the four-part series “Planet” (2017–18), “Tonga: The Adventure Begins” (2019), “La Femme Nikkita” (2017) and “Last Resort” (2016). The exhibition, which was organized by the KW Institute and the Wuppertaler-based firm, Finca, is the first of its", "The next Biennial should take place in the coming months.\n\n\nThe National Museum of Women in the Arts (MoMA) in New York received a gift of fifty eight rare works by women artists on Tuesday. The museum, which has been working to obtain the works since it reopened in December 2010, revealed the news in a press release.The gift includes works by Annie Desborough and Maud Maxwell; Mary Beard, whose practice involves a combination of painting and sculpture; and Lounger Lorraine O’Grady, whose large-scale works emphasize the role of women in both domestic and social life. Also included in the collection are works by Eleanor Birnbaum, the wife of the late British sculptor George Birnbaum; and Wangechi Mutu, who became the first African head of state of South Africa after the country gained independence from Britain in 1948. The gift also includes three works by Zaria Aliyu, a Nigerian who is known for her drawings, sculptures, and collages that often use color and form to address issues of feminism and equality.“Today’s National Museum of Women in the Arts is thrilled to receive this extraordinary gift of fifty works by fifty artists,” said museum director Christopher", "The next Biennial should be held in 2020, the same year that the 2020 edition of the Munich Biennale will open, and the first full edition of the exhibition will be presented in 2021. \n\n\nThe artist, activist, and teacher A.I.R. Galán, one of the founders of the collective 21族洋 (Arts r) and a former president of the University of Córdoba\u0097a Spanish conservator and educator who founded the institute in the 1970s and died in Madrid in 1996\u0097has died at age eighty-eight.Galán’s work has been exhibited at the Venice Biennale, the San Francisco Museum of Modern Art, and the Oslo Biennale, as well as at the National Museum of Art, Washington, DC; the Museum of Modern Art in Mexico City; the Museum of Modern Art, New York; and the Tokyo Metropolitan Museum of Art. She has also had solo exhibitions at the Museum of Modern Art, the Museum of Modern Art, and the Museum of Modern Art, and has been part of a retrospective at the Los Angeles County Museum of Art in California and the San Diego Museum of Art.Her work will go on view in the exhibition “A", "The next Biennial should be held early next year. \n\n\nRussian artist Aleksandr Solzhenitsyn has died at age eighty-two.Born in Leningrad in the Urals, Solzhenitsyn moved to Moscow at age seventeen to study at the St. Petersburg State Academy of Fine Arts. In 1960, after completing an art course at the Academy, he moved to St. Petersburg, got a job at the Art Newspaper, and began producing works that were later collected by the St. Petersburg State Museum of Fine Arts (PSMA).Solzhenitsyn’s early years were marked by political and artistic ferment. In 1964, he was selected for a solo exhibition at the museum, but his work was never placed on view; rather, the show was held at the VKM-1, where it was kept for forty years. In 1997, Solzhenitsyn was awarded the Order of Friendship by the Central Committee of the Communist Party of Russia.In 1966, Solzhenitsyn’s first solo show was at the St. Petersburg Museum of Fine Arts (SMPFA), where he was invited to participate in a show titled “Anna Karenina,” a show of work by the self-taught artist", "The next Biennial should be held in 2020. \n\n\nThe New York City Department of Cultural Affairs (DCLA) will soon begin welcoming visitors to the city’s Metropolitan Museum of Art, where it plans to open a new museum dedicated to the collection of African American art. The Met, which was founded by philanthropist George Cukor in 1943, is currently working toward finalizing a $1 billion redevelopment plan for the institution, which was commissioned by developer Donald Katz and is slated to open in 2023. The first visitors to the new museum will be able to enter through a frieze elevator, which will move them from exhibition to exhibition.The museum, which will be constructed in a former Jewish delousing facility at 10 East Seventy-Third Street, is shrouded in secrecy because of the ongoing reopening of the Solomon R. Guggenheim Museum in Queens. The opening of a new museum will help the city and the Guggenheim institute reestablish their relationship, which has been strained by the May 19 suicide of six-year-old George Floyd, who committed suicide shortly after the opening of a new Guggenheim exhibition in January.The DCLA is now working with architects Herzog & de Meuron", "The next Biennial should be held in 2022. \n\n\nKatherine McKinniss, the former director of the Centre for Contemporary Art at the University of Edinburgh, has been appointed the next executive director of the Arts Council. She succeeds Helen McColgan, who retired in March 2019 after twenty-five years at the helm of the council.“Katherine is a powerful, compelling, and scholarly leader, whose work has been transformative not only for the arts but for the city as a whole,” said Arts Council director Glyn Davies. “Her leadership of the Centre for Contemporary Art and the Centre for Media Art, in building on the achievements of the previous leaders, is a defining legacy.”McKinniss comes to the council after twenty-five years at the helm of the prestigious Royal Institute of British Architects (RIBA). During her tenure, she oversaw a new three-year grant cycle for RIBA students, expanded its internship program, and launched the “Katherine McKinniss Fellowship,” an annual award.“This is a pivotal moment for the council, with the renewal of the thirty-year-old Katherine McKinniss Fellowship and the centenary of the birth of the current chair", "The next Biennial should have been held in 2019, but was postponed because of the Covid-19 pandemic, and will investigate the role of the Tiananmen Square Protests in shaping China’s new leadership succession. Its inaugural edition, held in February 2020, featured performances by artists such as Jean-Michel Basquiat, Henry Fu, and the late singer Hong Jinwoo. \n\n\nThe Centro de Artes Plásticas (CAPP) in Madrid has announced that it will withdraw from further negotiations with the United Arab Emirates over the future of the World Heritage site. The venue had been working toward a final agreement that would have allowed the excavation of the area that comprises the City of Arabe’s Palacio de Arte Contemporáneo (CAC), the City of Plaça, and the Plaza de Arte de Arte, and will now have to begin a process of “reconstitution.”Dubai’s cultural officials cited the ongoing political crisis in the UAE as the reason for the retraction and stated that the decision to cancel the 2020 iteration of the pavilion was mutual. The 2022 iteration of the site, titled “City of Villains,", "The next Biennial should focus on the history of art with an intention to present a new and exciting way of looking at art. This should be an opportunity to develop the local ateliers and to engage with the local communities. The next iteration should focus on the relationship between artists and their audiences, on the role of art and art history in the visual arts, and on future plans for the event.”\n\n\nThe National Endowment for the Arts (NEA) has released a long-term strategic plan for the future of the $2 trillion federal arts and culture complex in Washington, DC, which was drafted by the agency in response to the rapid growth of the so-called cultural corridor, a network of publicly owned venues that have attracted hundreds of thousands of visitors each year but have failed to draw audiences. The NEA’s nine-point plan, titled “Future of the National Center for the Arts,” outlines how the agency will continue to operate under the leadership of a new director, and the NEA’s board of trustees will continue to receive annual funding from the National Endowment for the Arts, but will be reorganized into two boards, one for NEA and one for the NEMA.The strategy is part", "The next Biennial should take place in 2022, and the premiere should be staged by an international team of international artists. The 2019 festival, at which time the project was still in its early stages, was held at the National Museum of Art in Seoul.\n\n\nThe Philadelphia Museum of Art (PMA) has released guidelines for how it will handle allegations of sexual misconduct made against its board member John Tate in light of the allegations made against Thomas Middleditch, the former director of the London-based London School of Economics, and Jodi Throckmorton, the former director of the New York School of Design.The recommendations are aimed at preventing a cycle of accusations and counter-accusations that has seen many fall through the cracks. According to the New York Times, the school’s former director, Laurence Fink, pled guilty to misdemeanor sexual harassment last month and was sentenced to three months of home confinement and three years of probation. The charges against Throckmorton were dismissed last month when prosecutors agreed to drop the harassment charges.In light of these developments, the institution’s board chair, Becca Mitchell, issued the following statement: “We understand that this is", "The next Biennial should take place in one of the new, temporary spaces designed by the city to house the collection. The exhibition will launch with a lecture by David Hockney, the former director of Tate Britain, in between the exhibition “Be/longing: Seeing Art in the Age of Black Power (1958–1975”) and “Art and Race” (2019). The exhibition “will include multiple collaborative projects and may include works not previously on display.”\n\n\nThe Museum of Modern Art (MoMA) in New York has launched a new online platform that will allow visitors to view rare early works by Pablo Picasso and Henri Matisse, among other artists. The exhibition will debut with a special exhibition in May, 2020.The platform, called Picasso & Matisse, will allow visitors to search for works by Picasso and to see how the artist improved his own work through the use of a number of filters, including the use of charcoal, graphite, and watercolor to emphasise and contrast the two artists’ bodies. Picasso will also be the first work to be featured on the platform since 1967.On the first day of the special exhibition, the museum will include works by Richard Aved", "The next Biennial should be held in the summer of 2021. A new exhibition curated by and featuring the work of ten artists selected by the current curator, Wangechi Mutu, will inaugurate the Biennial.Siddey is also working on a new collection of artworks that will highlight the contributions of South Africa to the international art community. Titled, “South Africa: From the Point of View of the North,” the show will debut at the Taipei Biennale in October 2020.\n\n\nThe Noguchi Museum in New York City is planning to open a new 24,000-square-foot, museum dedicated to the American revolutionary and the civil rights struggle. The institution has filed a $2 million lawsuit against the federal government to prevent the construction of a monument to Rosa Parks and the Montgomery Bus Boyce, two Southern Christian activists who were taken apart and killed by the Georgia National Guard near their home in the city of GBI in April.Noguchi, whose father owned a local hardware store, is seeking $10 million in damages from the US Department of Education and the US Department of Justice. The suit also alleges that the park’s family and state, the city of New York, and the state of", "The next Biennial should focus on reimagining the role of the museum in relation to contemporary society, the future of the institution, and the creative process in the museum, the city, and the world.”The ten-year celebration of the museum’s fifty-fifth anniversary will conclude in December 2020.\n\n\nThe São Paulo Biennial of Contemporary Art (SPAC) has announced that it has won the first edition of the High Level Conference (HLC) in Sao Paulo, Brazil. The exhibition, titled “Particle Politics” and curated by Manuela de Castro Pérez, was presented at the São Paulo Art Museum in August. The biennial was founded in 2010 by artists and architects Malawian and Brazilian-born, and is supported by a $5,000 prize that was established by the museum in partnership with the award organization IMMARCO, and the European Regional Development Fund (ERDF).The ninety-one-minute exhibition commemorates the Brazilian artist-in-residence, Jule Galería, who was one of the first practitioners to attempt to make a movable work that would replicate the combustion of a gas molecule. Since its inception, the biennial has featured new exhibitions by seventy", "The next Biennial should aim to provide a new and detailed account of the major events of ancient and modern history; to employ contemporary technologies and an open approach to exhibitions; and to create a long-term institutional program for the exhibition of artwork. The twenty-seventh iteration of the prestigious exhibition will open in London in May 2020. The curators are: Linda Gaynor, Joshua Cohen, and Nadia C. Witten.\n\n\nThe Museum of Fine Arts (MFA) in Boston has released the first-ever full rankings of the five hundred artists who were selected for the 2020 Giulia Awards, a prestigious international award celebrating excellence in the arts. The artists, who were chosen in a public competition that was organized by the Giulia Foundation, were selected by a jury that included Lisa Foster, the executive director of the foundation, and John T. Evans, the director of the Boston Art Museum.Based on a survey of more than seventy artworks exhibited at the museum since it opened in 2001, the 2020 prizes were awarded to artists in recognition of their contributions to the arts. Giulia Awards are given annually to an artist who has a work that has been exhibited in a major exhibition at the museum. The 2020 prize recipients are", "The next Biennial should be held in the summer of 2021. \n\n\nThe museum has received a gift of one hundred paintings from the collection of a single individual: German architect and collector Erich A.M. Gerhart. The works, which date back to the 1950s, were donated by Gerhart to the museum in Berlin. Gerhart, who passed away in 1952 at the age of seventy-nine, was a major collector of German art during the Nazi occupation and deported to Auschwitz in 1944.Auction house Sotheby’s announced that it has purchased a painting by Gerhart for $19.95, a record high for Gerhart. In addition, the auction house also purchased the work of sculptor Eugène Atget for $10.00, and twenty-six works by the German industrialist Albrecht Dürer for $5.00. The works were purchased in an unannounced, show-stopping, six-hour auction held on Wednesday, March 7, at the Thirteenth International Exhibition of German Art in Cologne.Commenting on the sale, Sotheby’s director Timothy Rogers said: “The sale of these works is a great honor and a great privilege. We are thrilled", "The next Biennial should be held in 2021.\n\n\nThe Tate’s board of trustees has voted to absolve the Tate of any responsibility for the fluctuations in the value of artworks, with the caveat that the board must give the institution a year to regroup and consider reopening the five Tate galleries in London. “We understand the urgency of the situation and believe that this must take place by the end of the year,” said board chair Jay Dyer. “We are consulting with our committees and advisors on the best way to launch a new round of funding, which will hopefully include an assessment of our business in the coming months. We believe that this is an opportunity for the Tate to re-emerge as one of the world’s leading arts institutions.”The trustees were unanimous in deeming the Tate financially responsible for the fall-out of the Covid-19 pandemic. The Italian architect Alessandro Castello, who advocated for the institution to move some of its artworks and museum collections abroad, was nominated for the prize for the best new development at the Tate in 2014. Castello ultimately withdrew his proposal after he was informed that the institution was still in the process of setting", "The next Biennial should focus on the history of the exhibition and how it has impacted the lives and work of the artists represented in the exhibition, and should draw from the biennial’s work to create a new and engaging narrative. The biennial will be held at the Trans-Themes, a new contemporary art space in central London, from November 16 to November 19.  David Weddell, chair of the exhibition’s governing body, the Art Biennial Foundation, said: “The biennial is currently at an exciting moment as many of the most important challenges and opportunities of our time are being addressed and reimagined. We are very much looking forward to working with our new collaborators and audience to build on its legacy with an exciting new world order and a revolutionary new way of looking at art.”\n\n\nThe Greater London Council (GLC) has announced that Tate Modern and the British Museum are the first institutions to launch a new partnership in support of the local community. The partnership, which will launch on August 22 and run through October 27, will bring together twenty-two London galleries and museums to create new opportunities for London’s arts and cultural sector. The partnership comes as London becomes a leading center for", "The next Biennial should be held in 2022, with a new exhibition entitled “Surface Arts and Debris.” The biennial will focus on the relationship between painting and urbanism. It will feature works by thirty-two artists. The Biennial’s next major iteration, titled “The Age of the Urban,” will be held in 2020. The new platform will aim to build on the themes of the previous two years, namely “art and the city,” and will be inaugurated with a series of public conversations.The exhibition’s organizers said: “The ‘Age of the Urban’ project is a synthesis of animistic, political, and social concerns. It represents the true spirit of the artist-bund and the city. It will establish a new collective concept of art and the city, one that will remain free from commercial pressures and commercial objects. There will be no commercial interests involved at all, and no buildings, no projects, and no vendors associated with the exhibition.”The exhibition’s curator, Johannes Geissendorfer, told the Art Newspaper that the project was not about creating a “monolith” but about “reinventing", "The next Biennial should be announced in the autumn of 2021. The biennial will take place in the city of Rio de Janeiro and will be led by a committee composed of artists, architects, historians, and other specialists.\n\n\nArt dealers in Hong Kong and across Asia are protesting the reopening of the Shenzhen Exhibition and Exhibition Center (SEAC), the largest exhibition space in China, as the region gears up for what is expected to be a fierce battle with COVID-19. According to Artnet, the protests have been sparked by the addition of three new urban parks in the capital, as well as by the provisional reopening of an old industrial zone in the city of Wuhan in March.While Beijing announced that the zone was being rebranded as a “smart city” in March, the designation was only temporary. The city has since been working to develop a plan to protect and redevelop the area, and now plans to rebrand the area as a “clean city” in 2021.The plan has sparked controversy across China, with many criticizing Beijing for not working to protect the cultural space as the outbreak of the novel coronavirus continues to spread. Many also questioned the plan for removing artworks and commercial objects from public display", "The next Biennial should take place in 2021. \n\n\nThe Royal Academy of Arts (RA) in London, which is currently under construction, is planning to turn one of its buildings into an immersive art museum. Curated by the British artist Richard Avedon, the event will take place in the Grand Hyatt, where the Royal Shakespeare Company (RS), which is currently undergoing a renovation, currently has a space. The new museum will be called the Royal Academy of Arts and will be built in a former cotton gin and will boast a collection of over sixty thousand objects, including more than ten thousand works by Richard Avedon and a selection of his works by contemporary artists. The museum will be located in the Grand Hyatt, a former factory that was once a large cotton gin in central London, and is expected to open in the 40s.The announcement of the project, which will involve the construction of two 5,000-square-meter (13,000-square-foot) galleries, came after the Tate and the Edinburgh Festival announced plans to renovate their facilities in March and April. The Tate has not yet commented on the project, but the Abbey of Edinburgh declined to comment.The Royal Academy of Arts is", "The next Biennial should be held in 2020. The budget for the event, which will take place in Shanghai, has yet to be set.\n\n\nNew York’s Metropolitan Museum of Art and the Hirshhorn Museum and Sculpture Garden are teaming up to create a new national collection of some 275,000 works of art. The museum will commission the artist-run online platform Rubicon Project to produce the catalogues, which will be made available through the museum’s online viewing rooms by the end of the year.“The museum is committed to supporting the work of the most important artists in the United States, regardless of their medium, and Rubicon Project is a prime example of how we can use free and open platforms to make exhibitions of the most important artworks in the country,” said Met chairman James Rubenstein. Rubenstein added: “We are thrilled that the works in this new collection will be available to the public online for free, and that the Rubicon Project will be able to host our next exhibition in the fall as usual, including the retrospective, as an interactive experience.”The partnership between the Met and Rubicon Project comes amid a national campaign to raise $1 billion for the museum", "The next Biennial should take place in 2020 and is expected to run from March 19–March 22. \n\n\nThe museum in the capital Hamburg, which is currently closed due to the coronavirus, is welcoming visitors back to the city, but only in designated areas. According to the New York Times, the institution is suspending operations at least until April 15 and anticipates a major reduction in visitors in the coming weeks.The museum’s director, Rainer Baumann, told the New York Times that the decision to prevent large public gatherings and to focus on smaller, more intimate sites was made in order to optimize care for the museum’s collection, which comprises more than 1,500 objects and is housed in a former brewery.The order to shut down the institution stems from a ruling by the Federal European Court of Auditors on March 30. The court found that the museum was breaking Germany’s EU-IMF bailout agreement and that the decision to do so was made with the understanding that the museum would not reopen.“The court of Auditors considers the decision taken by the director of the museum in the interest of the public and the German people,” Baumann said in a statement. The decision has also been appealed", "The next Biennial should take place at the museum in 2021, and the tenth and final editions will open in 2022 and 2023.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has hired Laura Ho as its new deputy director for collections and exhibitions. Ho previously served as director of curatorial affairs at the Art Institute of Chicago and as head of the exhibition program at the Whitney Museum of American Art.“Laura is an accomplished curator and scholar who has been instrumental in forging MoCA’s contemporary collection and exhibition programs,” said museum director Dennis Ghossein. “Over the past ten years, her tutelage has helped shape the museum’s collection as well as shaping the museum’s exhibition program. Her ability to adapt to meet the demands of a museum’s changing collections, as well as her proven ability to apply new ideas and approaches to curating and presenting art has made her a strong fit for the role of deputy director.”Ho will be responsible for overseeing the collections and exhibitions in the center, which was purchased by the museum in 2003 and renovated by MoCA in 2016. During her tenure in the center, Ho oversaw the acquisition of works by artists such as George Miller, Lynn", "The next Biennial should open in 2022 and will explore the creation and distribution of new works. The programme will also aim to develop a biennial tradition of works that engages the humanities, the social sciences, and the arts. The jury that selected the seventy finalists for the prestigious accolade, which is named after Filipino artist and activist Tilda M.A. Agus, said that the exhibition was “the best work created by the three artists in the series as a group.” It also included work by artists such as John Christian Salmi, Raimundo Contreras, and Rachel Weisz.\n\n\nThe Museum of Fine Arts Los Angeles (MFA LA) announced today that it has received a gift of over ninety works by twenty-four artists from the collection of the late collector and philanthropist Arthur Conan Doyle. The institution is also creating new works by contemporary artists, whom Doyle often encouraged. Among the works selected are paintings by Yoko Ono, Gere Kavanaugh, Julie Mehretu, and David Salle. The Doyle Estate is also working on the creation of a new digital platform that will include the archive of works by the Doyle Estate at the Los Angeles County Museum of Art (LACMA).“", "The next Biennial should take place in 2019. “The Biennial is a labor of love, a labor of an extraordinary team, and a labor in service of a profound and urgent need,” said designer and curator Pol Silvestre. During the exhibition, which has been curated by Arturo A.P. Pino, the Venice and New York–based curator, curator, and writer, the artist and activist Emilio de Castro, and the juror Verónica de Sousa, the collection will unveil the work of forty-three artists, including Pierre-Auguste Renoir (co-founder of the Institut Pasteur), Samuel Taylor Coleridge (British author and collector), and Pierre-Auguste Renoir (1902–1973). The exhibition will also feature the work of the artist-activist Helène Tomé and of the Swiss artist Klaus von Bodecker, who was part of the exhibition. Among the artists represented in the exhibition are Cyril and Rosemary Kamm, who will be represented by Gallery M, Cologne; Hernán Cortés, a contemporary artist in residence at the Kapel Institute in Madrid; and Alex Isosu, whose work was included in the", "The next Biennial should be announced soon and will be held in Hong Kong.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has hired David Lichtenstein as director of its Arts and Narratives department. Lichtenstein comes to the arts institution from the New American Foundation (N.A.F.), where he serves as a curator of modern and contemporary art. Since joining the organization, he has curated exhibitions such as “Meet John Cale,” which was on view at the Allen Memorial Art Museum in Kansas City, Missouri, and “The Metropolitan Museum of Art,” which opened in 1992. Lichtenstein will assume his new curatorial role in June. His first show with MoCA is its new exhibition “The Late Cone.” The show will examine the history of the late American painter and will present five works by the artist. In the exhibition, the artist can chose between three works by Cale (1905–1980), Pierce Caine (1919–1974), and Adrian Piper (1904–1972). The artist will also be able to choose between two works by the late American singer Bob Dylan (1905–1988), and a trans", "The next Biennial should take place in 2021 and should include the work of twenty-six artists. The exhibition will be hosted at the Museum of Contemporary Art (MoCA) in New York, which recently underwent a $250 million renovation and expansion project. The museum is currently adding five new spaces to its existing collection. “We are thrilled to support the city and the talented team of curators, thinkers, and organizers who have led the exhibition to this point, and are excited to see where this exhibition will take us next,” said Museum Chair and CEO Thomas Friedman. The exhibition will celebrate the city’s rich history with a collection of work and a number of new works by artists whose work has yet to be exhibited.The biennial, titled “Thinking of the Present,” will be presented by James Joyce. It will run from November 14–November 21, 2020 and will be curated by James Joyce. “The exhibition’s work is grounded in style, in the twenty-first-century and contemporary art, and in Joyce’s own personal practice,” Friedman said. “It will invite us to think deeply about the future and to reevaluate", "The next Biennial should be held in the spring of 2021. It will also resume with a new project, “Away from the Sun: Contemporary Art in the Age of Climate Change” (2019), in the summer of 2022. The creative space will remain closed until March 23, 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today the launch of a new digital platform and a digital residency program for artists and creatives who are facing eviction from their homes due to the coronavirus pandemic. Called the Artists Street Shelter, the program will provide free housing and resources to Boston’s artists.“This is a crisis for us all, but especially for artists,” said museum director Matthew Teitelbaum. “I’m grateful for the generous support of our Boston colleagues, our city, and our state, and especially our city council and mayor, who have worked together to listen to our community, to our artists, and to our artists’ concerns.”The platform was developed in cooperation with the nonprofit arts organization the Artists’ Alliance, which will house the artists in an air-conditioned space at the museum. The organization will begin accepting applications for the summer", "The next Biennial should be in 2020, and the first in 2021. The exhibition will be based at the Polar Gallery, the new university-owned location in Shanghai, and will be organized as a series of exhibitions, each lasting thirty days and curated by two artists. Its opening will coincide with the twenty-fifth anniversary of the Shanghai Biennale. The show will be organized as a biennial, with each pavilion featuring an artist and a work by only one artist.The theme this year is “I, Myself, and the World.” The theme of the exhibition will be “Imagination and Reality.” The exhibition will be divided into different sub-categories, such as Animation, Art, and Cinema, and will take up themes from the themes of the previous biennales, including the theme of the exhibition “Beauty and Pain” and the theme “Art and the Body”. The artist-directed installations are being created in collaboration with the artists of the exhibition and will be presented within the theme. The exhibition will also feature works by Atif Mokhtar, Ahmed Abou-Rahme, Hao-Chien Huang, and Ashraf Ismail, as well as", "The next Biennial should take place in the fall of 2020, and should include a selection of works by women artists, starting with the work of Marina Abramović. The exhibition will also present programming that addresses issues such as climate change and the impact of violence on women. The 2020 edition will be held at the Museu de Barcelona, the Palacio de Arte Moderna, and the Palacio de Cultura.\n\n\nMinneapolis’s Museum of Fine Arts (MFA) is attempting to overhaul its current exhibition format by moving forward with a redesign, announced in February, that will introduce a new system of peer reviews. Under the direction of architect Frank Gehry, the museum has already invested more than $100 million into its Digital Curatorial Lab. Its redesign will see the curatorial team collaborate more closely with the public.“The deputy director for curatorial affairs, Maureen Ryan, said: “Over the past two years, we have been working with curators and artists to understand the digital world and what it means for their exhibitions and exhibitions programs. We experimented with self-authentication and self-distribution, and with the digital abstractions of our exhibition spaces. It was a real conversation about making the museum more accessible to", "The next Biennial should take place in 2021.\n\n\"I wanted to start the event in a way that would reflect on the current state of our world and create an opportunity for our artists to connect the biennial with what is expected of contemporary culture worldwide,” said Lena Parsons, chair of the commission. “The result is an exhibition that will celebrate the ability to take risks and experiment.”The exhibition will consist of twenty-four works by thirty-four contemporary artists and will run a minimum of three days. The workstages will be curated by the Berkeley Art Museum and the San Francisco Museum of Modern Art, and will be at least fifty feet apart. It will also feature performances, tours, and public readings. The artists selected for the exhibition were chosen based on their work in the exhibition “naturally occurring,” Parsons said, citing artists such as Narges, Mondrian, Chantal Málaga, and Anna-Sophie Neuf.The exhibition will be curated by Patti Staton, chair of the commission; Fabiana Varejão, the curator of the exhibition; and Tanya Stricker, the director and chief curator of the San Francisco Museum of Modern Art; and will", "The next Biennial should be held at the Venetian, in 2020.\n\nGalleries, which are set to be awarded 1,500 grand prizes in Miami Beach, have already begun organizing for the 2020 edition, which they hope will draw as many as 1.25 million visitors. A full list of participating galleries is as follows:\n\nThe Bank of New York, New York: Tania Bruguera Gallery, Manhattan: Nancy A. Rossetti Gallery, New York: Sara Callahan Gallery, New York: Pamela Caruso Gallery, New York: Lucie Caruso Gallery, New York: Julia Soto, New York: Ray Turok Gallery, New York: Jody Wilson-Kruse, New York: Sharon Yang Gallery, New York: Natalie Okasha Gallery, New York: Natalie Treiman Gallery, Brooklyn: The Art in Exile, New York: Tania Bruguera Gallery, New York: Nancy A. Rossetti Gallery, New York: Assemblages: Luis Barbosa, New York: Sara Callahan Gallery, New York: W", "The next Biennial should take place in the fall of 2020. In the meantime, Zappa’s work will continue to circulate in its entirety and will be presented in the exhibition “Composition: A Biennial of Art and Art History.”Curated by Daniel Radin and featuring works by twenty-three artists, including Doris Salter, Phyllis Peiffer, and Shimon Peiffer, and featuring a selection of seven original works, “Composition: A Biennial of Art and Art History” will be on view through November 26. Below is a list of the upcoming performances.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Robert Rauschenberg as its next executive director. Rauschenberg, who has helmed the museum since 2015, succeeds Michael L. Dunn, who departed in the summer of 2019 to head the Metropolitan Museum of Art in New York.“We are delighted to welcome Robert to the Museum of Contemporary Art,” said museum director and CEO Matthew Teitelbaum. “His further development of the museum’s art programs as a global leader in a new digital space as well as his engagement with both the contemporary art", "The next Biennial should be held at a site selected by the council in consultation with the artists, in support of the new buildings and the city. Beijing Art Museum and Museum of Contemporary Art (BAM) will host the final exhibition in 2020 at a venue yet to be decided. The new exhibition, titled “Fantasy of the World,” will be curated by the Beijing-based artist and award-winning curator Yang Tingchuan. It will inaugurate the Biennial for China Artists and will take place on November 20-December 4.The 2020 theme of the biennial is “Fantasy of the World” and will be “Fantasy of Art, Fantasy of the World” in honor of the fifty-fifth edition of the Art in Shanghai.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that it is planning to open a new sixty-seven-minute museum dedicated to the work of Ernst Lubitsch, the German painter and theorist whose works fuse surrealism with the history of modernism and the cultural history of the twentieth century. The museum will be named the Lubitsch Museum after Lubitsch’s son and will be located in the eastern end of London’s Hyde Park", "The next Biennial should take place in 2021. It will also host the first edition of the Trans-Pacific Partnership, the third Asian economic summit, and a biennial of visual art.The biennial will be held at the United Nations Headquarters (UN Headquarters) and will be staged in collaboration with the San Francisco Museum of Modern Art. The exhibition will be curated by Jodi Throckmorton, the head of the 25,000-piece collection of jewelry and watches in the Swiss city of Bern, and will be open to the public from February 10–March 2. The next edition of the Biennial will be held in 2021. The proposal for the new venue for the biennial was made by the United States, Australia, and New Zealand. The deadline for submissions was March 6, and the organizers are currently working on a design for the venue.The 2020 edition of the biennial, entitled The Heart of the Matter, will highlight the philosophical and political issues that affect our lives and was held at the Collezione Palazzo Venezia di Mello in Rome. The biennial will be staged in conjunction with the 2020 Venice Architecture Biennale. The hundred-and-seventh edition, entitled Responsibility,", "The next Biennial should be held in January 2020.  The exhibition will consist of the work of fifty artists, including Aretâda Hameed, Arashiyar, Baghdad Aleen, and Abdul Rashid , who will be presented with the Biennial Pavilion.  The initiative is being organized by the New York–based nonprofit the Brooklyn-based collective Posse Gallery.\n\n\nThe French cultural ministry has launched a $5.2 billion project to improve the environment for French film artists by launching the National Film Academy, an initiative that will introduce more than 1,200 new works by French filmmakers and will launch in 2022. The initiative is part of France’s Vision 2030, which aims to revitalize the French film industry by introducing new digital and media technologies and by training 150,000 people to make films in 2020.The new film academy will be modeled on the Academy of Fine Art in Paris, which was established in 1955 to help French filmmakers achieve their first Academy Award, for its first film project, titled The Magic of Storytellers, 2010. The film will be made in collaboration with the twenty-seven-year-old filmmaker and writer Lucne Bignon,", "The next Biennial should take place in 2020.   In May 2018, the museum moved the exhibition, Art of the Party, to the Jubilee year, and in March 2019, the exhibition was invited back for a second year, this time in 2021. A few months later, the museum launched a new online platform, which allows visitors to explore its collection in real-time. The museum is also working on a redesigned building and on the construction of a new museum. The announcement of the redesign comes amid a reshuffling of the museum’s collection, which has undergone a number of reconfigurations since it opened in the early 1960s. Its holdings are now divided into five different categories in the museum: Modernism, 1960s, 1970s, 1980s, and Modernism’s Future. The current exhibition, “The People’s House,” will be on view in March 2019.\n\n\nThe Metropolitan Museum of Art (the museum) in New York announced today that it has chosen the artist and educator Reinhold Messing as its next director; he has been appointed for a four-year term beginning January 1, 2021.Messing will be responsible for running the show “Messaging", "The next Biennial should focus on restoring the Berlin Art Museum to its original purpose, which has historically been to house the works of the German masters, and on a digital reconstruction of the museum’s collection. It should also consider how the museum might incorporate contemporary art into future exhibitions and how well it might function as an educational institution.“For over four decades, the Biennale has been a collaborative project between a network of more than sixty cultural and cultural-related institutions in Berlin. The result is a remarkable collection of art, architecture, and design from around the world,” said Berlin City Hall deputy chairman Wolfgang Totenbauer. According to the Berliner Morgenpost, the museum has twice held significant art shows, in 2006 and 2008. In 2012, the museum completed the restoration of the Neue Galerie, which had served as a landmark for visitors to the city for more than a hundred years, and in 2015, the museum added a new level of contemporary art to the museum.\n\n\nThe Grand Rapids Museum of Art in Michigan has received a gift of more than four hundred works by fifty-seven artists, including Anne-Marie Pelletier, John Darnielle, Ursula von Rydingsvard", "The next Biennial should be a reflection of the emergence of new and spirited perspectives in art history and the twentieth century. Its themes should be centred on the soul of art and should be inspired by new and often surprising ideas.”\n\n\nThe Museum of Modern Art (MoMA) in New York has named Anne-Marie Sorokin as its next director. In her new role, she will oversee the museum’s expansion to eighty thousand square feet of modern and contemporary art and architecture, and will oversee development and education initiatives for the museum’s permanent collection.“We are thrilled to welcome Anne-Marie as our next director, and equally thrilled to welcome a talented and dedicated team to MoMA,” said Sarah Savitz, executive director of the arts and architecture nonprofit the Mariner Fund. “Anne-Marie’s background and knowledge of MoMA and the collection enhances MoMA’s ability to present a truly internationally-acclaimed collection while continuing with the exciting and challenging path of new exploration and the museum’s ongoing transformation.”Sorokin first joined MoMA in 2000 as its first deputy director. Her tenure saw the museum expand its collection and programmatic priorities, introduce new exhibitions, conduct research", "The next Biennial should take place in 2030 and will focus on the history of art from the Middle East. The theme of the next event will be “African art,” and on the upcoming exhibition “Black Power: Art and Politics from the African Continent” at the Diadema Gallery in Johannesburg, South Africa.\n\n\nThe Smithsonian today announced that it is establishing a new $500,000 award to support research and preservation efforts in the field of African American art. The $500,000 will be distributed in the form of a grant.The SOUTH BYLINE’s review of the announcement noted that the awardees were selected by an all-white, four-member board composed of current and former members of the institution, which was led by Christine A. Blum, director of the Smithsonian American Art Museum, in conjunction with the South by Southwest (July 6–July 8). The winner of the award is unknown.Blum told the South by Southwest review that the awardees represented a wide range of artistic and academic practices and that they will be recognized for their achievements in the field. “These artists and scholars have given voice to ideas and histories and have shown how African American artists have positioned", "The next Biennial should be held in 2021 and should be titled “Aurora Bénéti,” a reference to the city situated in the Andes mountains in Peru.  The panel’s president, Alexandra Grujic, said: “I highly recommend that the institution re-examine its current programming to understand how it can present a truly international, interdisciplinary, and intergenerational exhibition.”\n\n\nThe Museum of Fine Arts (MFA), Boston, has appointed Paul Colangelo as its next director. Colangelo comes to the museum from the Craigie Air Force Base, Alaska, where he has served as deputy director of curatorial affairs since 2013. He succeeds Joe Mather, who retired last July after a fifteen-year tenure at the museum.“We were impressed by Paul’s demonstrated commitment to the museum and to what we perceive as a future-forward museum program,” said cochair and director Richard Armstrong. “His leadership and vision for the museum reflect his belief that cultural heritage is central to a modern, meaningful, and healthy future.” Colangelo previously served as the board president and director of the Palais de Tokyo in Paris and as the founding director and", "The next Biennial should be held in 2020. The next event should be held in the spring of 2021. And the next will be staged in the summer of 2021. Over the past several years, the institution has staged numerous exhibitions and other events to celebrate its fifty-sixth anniversary. The Biennial’s artistic director, Reem, said: “We are thrilled that the public will enjoy these exhibitions and events through these next fifty-six years and beyond. We hope that the Museum will continue to thrive in the face of the unexpected.”\n\n\nA group of individuals whose only connection to the Tate was a vague memory of an Alan Cooper painting that was on display in “The Tunnel” have sued the Tate, its new board member Sir David Murray, and the corporation’s former director of architecture, Anish Kapoor, alleging that the Tate withheld information about the painting “No Man’s Land” from the public in order to damage its reputation.The claimants are demanding a “meaningful apology” from the Tate and an undertaking to “explore and consider the implications of the situation,” reports The Times.The statement by the claimants comes on the heels of a series", "The next Biennial should take place in November 2021.”\n\n\nConstruction of the Tel Aviv Museum of Art (TMA) has begun on a new building designed by the Israel-based firm Adsins. The contemporary art museum will be inaugurated in 2021 and will function as an extension of the TMA, which is located in the city’s old fair venue. The project was inspired by the museum’s previous project, a new civic center built to house the TMA’s collection in a French-designed building adjacent to the city’s TMA. The project will involve the design of a new park designed by Peiksavich Architects and will involve the construction of two towers, each measuring nearly 4,000 feet, that will rise in a courtyard.According to the Israeli newspaper Maariv, the new museum will also boast of a public balcony, a public courtyard, a rooftop terrace, and a large conservatory. Atelierspace, the Israeli NGO, has been working with the TMA and plans to support the project with a $3 million grant. In addition to the construction of the new museum, the building of the museum was also included in a ten-year, $7.5", "The next Biennial should be at least fifteen years away, and we will continue to work with the global community in designing events that will reflect the richness and diversity of our collections, while recognizing that this is a uniquely global and contemporary day.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to close its doors to the public in January 2021—the same year its fifty-fifth iteration will open. The museum’s board of trustees announced the news on Tuesday, and the museum’s current programming schedule, which runs through March 20, 2021, is being adjusted accordingly.“We are working hard to reduce our impact on the environment, balance our business and administrative needs with our mission of sheltering and nurturing the creative, and offer opportunities for community engagement,” said board chair John Barker. “We are confident that we can continue to operate in a way that will provide the best possible environment for our artists and our future generations.”While the museum closed until March 17 to prepare for the coronavirus—it reopened on March 19—it will have an additional twenty-four hours of public programming, including an exhibition, “The Big Goodbye: Art and the Coronavirus”", "The next Biennial should take place in May 2021, at the Museum of Contemporary Art, London, and will be led by curator and curator-designer Joao Pereira. The exhibition will feature work by over seventy artists and will highlight the enduring influence of the artist as well as fifty-eight selected works by the artist’s descendants.\n\nThe Art Newspaper reports that, in an effort to repair the damage that the exhibition “takes both artistic and cultural significance,” the Taipei Fine Arts Museum (TFAM) in Taiwan has agreed to donate fifty artworks, including some of the works of Kiki Smith, to the Museum of Modern Art in New York. The museum is also planning to bring Smith’s work, “The Crash of Our Dreams,” and Natasha Movsesova’s “Take Me Home,” both 2007, to the museum, which will hold them in a permanent collection exhibition.Smith, who died in 1996 at the age of seventy-two, was one of the first artists to use Photoshop to create work that took direct inspiration from Smith’s 1969 painting The Crash of Our Dreams. The works are currently on display in “Views: Kiki", "The next Biennial should take place in 2020, with the first exhibition scheduled to open in 2022. The twenty-first Biennial, which will be held at the institutions of the Czech Republic in 2022, will be held at the University of Oslo in 2021. The twenty-third Biennial, which will be held at the University of Geneva in 2021, will run from September 14–September 16. The twenty-fourth Biennial, which will be held at the National Museum of Contemporary Art, Prague, in 2021, will be held from September 13–September 16. The twenty-fifth and twenty-sixteenth Biennials will be staged at Rotterdam in 2021 and Zurich in 2020, respectively.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MCA) has announced that it is restructuring to take on a more balanced financial riskier business model. The move is part of a $140 million capital campaign to improve financial viability for the Pasadena institution, which relies on donations for nearly all of its operating revenue. “After a thorough analysis of the institution’s financial position and estimated future needs, MoCA board president and CEO Michael Govan and board president and CEO Jennifer Talbot concluded that the best way", "The next Biennial should take place in 2020, in the same place, of all of the world, and the city of Toronto should be able to host it. The next iteration will also be on the same site, and will be organized similarly, with a different selection of artists. A new exhibition will also be staged, and the biennial’s digital platform will continue to function as a platform for sharing and learning from the work of artists around the world.“There is no greater gift than an artist’s body, but especially our city,” said Councillor Josh Matlow, chair of the city’s arts and culture committee, who was not involved in the decision-making. “It’s a monumental challenge to move a collection of this size and this important to this city, and that’s what we’ve done. We moved the collection to the National Arts Museum in Ottawa in 2016, and to the Toronto Collection in 2021. We will move it again this spring, and again in 2021. This is a long-term project, and as such, we have been working with the community to find a way forward.”The announcement of the new partnerships between the city and the Bi", "The next Biennial should be held in 2020, at which point the museum will rejoin the city in a larger exhibition. While the museum is currently closed due to the Covid-19 pandemic, it is planning a reopening date of March 23.Deana Haggag, director of the National Museum of Women in the Arts, said in a statement: “This fall marks a turning point for the National Gallery. We will now begin a process of rebuilding and polishing up the museum, and we will not forget our audiences or our visitors.”\n\n\nThe Danish architect and multimillionaire collector Jørgen Haag, who founded the luxury lifestyle brand LVMH and amassed a fortune worth $50 billion in the process, died on January 30 at the age of seventy-nine.Born in the small town of Søndal in southern Denmark, in 1941, Haag moved to New York City in the early 1950s. He studied at the School of the Art Institute of Chicago and the School of the Arts in London, then at the old Fashion Institute of Technology and the New School, and eventually landed a coveted tenure at the Brooklyn-based firm W.S. Grafton and served as chief executive officer of the", "The next Biennial should take place in 2020, the Art Newspaper reports. The venue will be the same as the Arts Centre in London—the National Maritime Museum in Southampton.The exhibition has faced many challenges, including a recent fire that broke out at the Museum of Modern Art in 2012, which put out in January of 2013. However, in a move that was hailed as a victory by the fire officials, the building, which contains three times the number of exhibitions as the museum, was allowed to reopen. Although the new exhibition hall will be equipped with a specific volume to accommodate the exhibitions, the National Museum of Art in London, which is located in a different building, will also be able to host the remainder of the series.The museum has also been working on a redesign, which will include a new glass-enclosed lobby with a glass floor and a new interior design. The renovation will be funded by the National Lottery Heritage Fund, which is a major supporter of arts institutions and the arts in the UK, and will be completed sometime between May and September 2021. The museum will also receive funding from the government of Wales and the Tate.The institution, which has faced many challenges in the past, was also forced to close the museum in 2016, after a", "The next Biennial should be held in 2022. The museum is currently planning a new exhibition, “Towards a Theory of Image,” that will—in part—introduce new images and ideas to the exhibition.\n\nThe first exhibition dedicated to Thailand’s monarchy, the Golden Jubilee, will open next month in Bangkok. The exhibition will feature fifteen thousand artifacts and artifacts from the kingdom’s history, including royal documents, royal horse sculptures, and artifacts from the royal palace, the Royal Palace Museum. The exhibition will also feature a selection of work by the royal artists, including the Kywatei Gallery’s Karla Surya, Meegan Saar’s Ameer al-Caspi, and Yin Joo Kang’s The Palace and the City. The exhibition will be accompanied by a book of the Royal Palace’s art.The new exhibition “Kingdom and Treasure” will be held at the Royal Palace from September 19 to September 21, 2020. \n\n\nNew York’s Metropolitan Museum of Art has launched a new digital initiative that will allow the public to upload photos, videos, and other artifacts from the museum", "The next Biennial should take place in the autumn of 2020, and the next will take place in the spring of 2021. The 2019 prize jury: Yanira Eshak, Aric Hayat, Ebony Ho, and Zoe Paglen. The biennial’s theme is “Life and Death: On the Origins of Life” and the artist will be the first to open the new exhibition. The artist will be a Songbird from the South, a South Asian American artist, and will speak of the coexistence of modernity and spirituality in the American Southwest. The biennial was chosen by a jury comprised of an artist, Poppy Rocha, the curator of contemporary art, Kia Moteg, and the director of the Museum of the Tibetan Art.  “At the same time this exhibition is about to open, I am already inspired by the visual ways that the exhibition will be received by the people. I am confident that the [artistic] painters and sculptors who are participating in this exhibition will be able to react to the cultural landscape of the United States with a sense of lasting awe and delight.”\n\n\nThe museum in Cairo", "The next Biennial should take place in 2019, and the inaugural event will be held in 2022.The modernization initiative was launched in 2002 to address the growing concerns over the conservation and preservation of art in China. The country’s threat to take legal action against foreign shareholders in state-owned entities, including the National Museum of Fine Arts in Beijing, has also been a source of tension between the government and the museum.\n\n\nArt-world veteran and philanthropist Pierre Omidy, whose pioneering philanthropic efforts supported dozens of emerging artists across the globe, has died at age eighty-eight.Born in Marseille in 1919, Omidy, who came to the United States in 1957 from Poland, was drawn to Claude Monet’s stunningly detailed works as a young man. He eventually landed in New York, where he met his future wife, Lisa, and their son Sebastian. After graduating from the city’s Art Students League in 1964, he moved to Paris, where he met actress Sharon Stone and two future sons. Omidy relocated to Nice, France, where he met and married photographer Pierre Omidy, and later opened a holding company in the city. In 1997, the couple moved to the United States, where O", "The next Biennial should take place in the spring of 2021. The 2019 edition, which ran from February 12 to March 13, featured work by sixty artists. The 2020 edition will be about fifty years old.\n\n\nThe New Museum in New York has appointed Rebecca Rund as its next executive director. Rund will be responsible for building partnerships between New York and Boston galleries and will assume her new post on March 28. She succeeds Carolyn Ryan, who departed the institution in March after ten years to become president of the National Gallery of Art in Washington, DC, and will take up her new post in the spring of 2021.“Rebecca Rund’s appointment reflects the New Museum’s recent evolution as a global leader in contemporary art,” said museum director Daniel H. Weiss. “She brings exceptional skills, understanding, and vision to the position, a strong demonstrated commitment to curatorial practice, and a network that has catapulted the museum’s exhibition program.”Rund joined New Museum in 2006 as assistant curator of modern and contemporary art. She returned to the institution in 2009 to lead the museum’s annual “Next Year,” and has held the position of chief curator of modern and contemporary art", "The next Biennial should be in the spring of 2020. We will also be preparing for the possibility of a further increase in visitors from China. As a result of the recent extension of the Biennale, the Museum of Art in Beijing is planning to increase the number of its delegations by twenty-eight. The plan is supported by the Chinese government in its bid to strengthen cultural ties with Beijing and is part of President Xi Jinping’s China Dream, a project to revitalize the cultural scene in Beijing. Since the project is still in its infancy, the organizers are worried about how the exhibition will be received by the general public and what effect it will have on the local Chinese community. 'The exhibition will not be a disaster for tourists, but it will be a disappointment for the local people,” Liu Xiaojun, the director of the Biennale, told the Art Newspaper.\n\n\nThe Museum of Fine Arts (MFA) in Houston, Texas, announced today that it has received a gift of more than forty more works from China\u0097including several works by artists such as Hong Jinhua Tian, Shigeki Kanemaru, and Qin Lei\u0097at an auction held at the museum on Tuesday. The", "The next Biennial should take place in August 2021 and will be hosted by the new venue, the National Museum of Fine Arts in Athens.The committee presented on Monday, June 16, the recommendations of a three-member panel comprising: Dr. Nikos Lippas; Prof. Panayiotou; and Pilar De Carvalho, director of the National Museum of Modern Art in Miami Beach, Florida.“Today’s exhibition is one of the most important conservation exhibitions ever made,” Lippas said. “It depicts new and exciting ways of preserving the art of the past. The spectacular setting will allow visitors to experience the museum’s collection in a whole new way.”According to the Portuguese curator and critic Ana Conte, the exhibition “is a new kind of museum where the collection is integrated in a contemporary way and in which the museum’s mission is also to present the art of the present.”\n\n\nWith an estimated value of $12 billion, the National Museum of Fine Arts (MMFA) in Cincinnati has become the latest major cultural institution in the United States to file for Chapter 11 bankruptcy protection. The museum, which has been closed since March 14 due to the Covid", "The next Biennial should be held in 2021. As of December 2017, the exhibition had only seven works, and had featured work by 35 artists. The next exhibition, which was set to open at the Museum of Modern Art in New York in April, was canceled after a gunman opened fire at the museum on December 2, killing six people and wounding thirteen others.Prior to the shooting, the museum had been on lockdown since December 14. The museum reopened on January 5, 2018, but the exhibition “Open,” which focused on the exhibition “Yoshitomo Goto,” a collaboration between Goto, a Japanese artist, and artist Yoko Kanno, was canceled.In the months leading up to the shooting, the museum had been one of the last places in the United States to be completely closed. Over the course of the last two years, the institution has hired security guards for the biennial, which will take place in an 18,500-square-foot space. The museum has also developed a new biennial programming schedule designed to maximize the number of visitors, and has strengthened security in order to prevent an overcrowding crisis. The museum will likely draw an additional 10,000 visitors to the biennial", "The next Biennial should begin in September 2019 and conclude in April 2021. In the meantime, the exhibition will continue to be organized in accordance with the principles of the biennial.  It will be hosted by the Museum of Contemporary Art, Los Angeles; the Brooklyn Museum; the National Gallery of Art, Washington DC; the Whitney Museum of American Art, Washington DC, and the National Museum of Women in the Arts, San Francisco; and the Los Angeles County Museum of Art (LACMA).“We are thrilled to announce that our 2020 biennial will be a celebration of the past, a reckoning with and a reimagining of the future—a platform for critical reflection, imaginative experimentation, and a challenging of preconceptions,” said Jean-Luc Godin, chair of the Biennial’s board of directors. “The theme of the upcoming year is ‘indigenous,’ and our artists are committed to exploring the history of their communities and their place in the world.”The full list of participating artists is as follows:*Continental Inca artist and activist Hélio Oiticica*Becoming Masterpiece. Urged by a group of young activists, the artist formed this work to create a tangible", "The next Biennial should be held at the Museum of the History of Art in New York in 2020.  David Kander, director of the Walter de Maria Art Museum in New Orleans, cited the institution’s longstanding commitment to the art of the American South as the reason for its absence. The institution will also host a second biennial of American art in 2022. Norton Simon Museum director Tim Riester said: “This is a moment of great change for the United States. We must remain vigilant as we consider how to respond to this challenge and to how the art of the future will be perceived by the public and the future generations. We must address the roots of our curators’ practice, and we must do so in partnership with our communities and the communities around us. We must also consider how we will balance the need to preserve and present the work of our curators with the need to provide an environment for future generations to explore and create. And finally, we must remember that our curators are not here to judge but to present the work of other artists. They are here to tell their own stories.”\n\nThe Abel Prize, which honors the lifetime achievement of an artist or team who has produced", "The next Biennial should be held in January 2020. In order to help you prepare, here are some questions to help you think about: 1) What do you think will happen in the next twelve months? 2) What will your city look like in 2020? 3) What will your body feel like in December 2020? 4) What will be the story of your life in the next twelve months? 5) What will be the meaning of your life in 2020? 6) What will be the ending of your life in December 2020? 7) What will be the beginning of your life in December 2020? 8) What will be the beginning of your life in December 2020? 9) Are you able to see yourself living your life as if the next twelve months will be the shortest and the last month being the most exciting? 10) What will you say to your loved ones and to those who have asked you to be here? 11) What will you do if you are not here? 12) What will you say to those who are not here yet? 13) What will you do if you are not here? 14)What can you do if you cannot see yourself living your life", "The next Biennial should take place in 2019. The 2020 iteration will be held at the Ville de Versailles in Paris only.\n\n\nCameron Rowland, a British artist best known for turning his studio into a public space to explore the ideas behind painting, has died at the age of eighty-three.Born in Glasgow in 1937, Rowland studied at the School of the Art Institute of Chicago, the Sainsbury Art School in London, and the School of Fine Arts in Paris, before moving to the United States to study under Charles Atkins at the University of Chicago. In 1977, he returned to England, and began his career as a painter. In 1984, he established his own studio in London, and in 1988, he painted the public mural in the Rockefeller Center, Manhattan, which featured a cast-iron Cage, a steel cage made in 1942, to portray a canvas from the artist’s previous life. He has been the subject of many exhibitions, including the Venice Biennale, the London Art Museum, and the Metropolitan Museum of Art.In a 2017 retrospective at the Museum of Modern Art, Rowland was asked to explain his work. He replied: “I think what I’m interested in is the process", "The next Biennial should begin June 3 and run through September 7. The exhibition will feature works by twenty-two artists chosen by a jury composed of Laura Aguilar, Art Director of the Museo de Cultura de Manila (MCA); Rosalind Franklin, curator of contemporary art at the Museum of Modern Art in New York; and Ricardo Nava, director of the Museum of Contemporary Art in New York. The full list of participants is as follows:ARTICLE REVIEW: Artforum.comArtforum.comArtforum.comArtforum.comArtforum.comArtforum.comArtforum.comArtforum.comArtforum.comArtforum.comArtforum.comArtforum.comArtforum.comArtforum.comArtforum.com\n\n\nRobert Rauschenberg, the director of the Museum of Modern Art in New York, is stepping down from the institution in September 2019 to pursue new creative projects. In a letter to staff published on May 2, he writes that he has completed a four-year fellowship at the Walker Art Center and hopes to return to New York to continue working on “all things Art,” including exhibitions, commissions, and curating. He also", "The next Biennial should be held in 2020.The National Trust for Scotland also said: “We are extremely pleased that the final selection for the 2019 National Biennial will be selected by Chancel Gallery for its exhibition ‘We Are All In This Together.’ It will be the first exhibition by the artist in the UK since 1972. We are already working closely with the city to ensure the biennial explores the themes of resilience, the transition to democracy, and the importance of art in shaping social change.”\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is sending more than two dozen artists, activists, and scholars to the museum for the museum’s fifth edition of the Art of Manliness, “Manifest Destiny.” The program will feature works by artists such as William Alston, Sidney James Dyson, and Sol LeWitt, among others, and will run from August 5 to August 8, 2020.“We are thrilled that the five-night run of the Museum Art in America will mark a watershed for the institution,” said Mark Salter, director of the museum. “It represents an important moment for the museum and for the world at large", "The next Biennial should take place in 2020, with the theme 'Shifting Ground: The Politics of Living, Dying, and Multimedia.”\n\n\nBoston Art Museum (BAM) is suing the New York institution in an attempt to force it to reduce the number of its works by 75 percent in order to make room for more exhibitions by the same artists. The lawsuit, filed in federal district court in Manhattan on Tuesday, November 3, alleges that the reduction of the number of works in its holdings amounted to “an unfair and deceptive act or omission.”It further alleges that the institution breached its fiduciary duty of care by withholding the $68 million in donations it promised to make in return for the first tranche of the works that were to be donated to the museum next year.BAM is asking for the institution to forfeit $35 million, to be divided among the artists whose works it has donated and for the museum to pay it an additional $15 million if the institution fails to comply with the court’s order to reduce the number of works it owns by 75 percent by December 31. The museum has already agreed to pay $7 million to the plaintiffs, but the amount owed to BAM is much higher.The lawsuit", "The next Biennial should take place in 2019.\n\n\nThe Modern Art Museum (MAK) in Seoul announced today that it is preparing to host the first exhibition dedicated to women’s contemporary art in the country. Titled “The Modern Female,” the exhibition will feature work by thirty-six artists and will be on view in the exhibition “The Contemporary Female,” which will open in January 2021.The show is organized in partnership with the Contemporary Korean Art Association (CKA), which aims to promote the art of contemporary Korea and promote women. CKA presented the first exhibition dedicated to women’s contemporary art at the museum. The show, which will include work by the artists, was set to open in March and ran until April.Following the exhibition, CKA said it will create an exhibition dedicated to “Japanese modern art from the 1960s to the present,” which will be held at the museum in 2021.\n\n\nThe Botanical Gardens in the Art District of Seattle, the Inner Harbor, and the Potomac River Valley are teaming up to create one of the largest new public lands in the United States. The new state-of-the-art urban farming campus will grow food for the", "The next Biennial should take place in 2021, with an opening date of 2019. The theme of this year’s event is “life after death.” The exhibition will include a retrospective of the work of artist Marcel Proust, the work of French contemporary artist Nicolas Ghesquière, and the work of Russian artists Oleg Kashin and Evgeny Nares. Other works from the show will be presented as part of the inaugural exhibition “The Body and Death” (2019); the “The Material Body” (2019); and the “The Pale of Necessity” (2019).\n\n\nThe collection of Christo and Henri Bocquet, the two founders of the Paris-based contemporary art project the Bocquet Foundation, has been damaged by a fire that broke out in a large closet in the building on June 22 and spread to the rest of the building. The firemen who extinguished the blaze, which was extinguished by the authorities on June 26, said that the cause was electrical.The French fire ministry is investigating the cause of the fire and is working with experts at the location to assess the situation, which was not far from the Bocquet Foundation’s headquarters and", "The next Biennial should be held at the National Gallery of Art in Washington, DC, in 2022. It will also be housed at the Smithsonian American Art Museum in Washington, DC, and at the Cooper-Hewitt, New York, gallery.The National Arts Center has already announced that it will continue to host the exhibition to coincide with the centenary of the outbreak. It says it is still assessing the impact of the coronavirus.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Jodi Throckmorton as its new senior director of contemporary art. Throckmorton succeeds Leslie Salto, who has served as deputy director of the institution for the past two years, and will take up her new responsibilities at the end of the month.“The appointment of Jodi Throckmorton is a strong signal that MoCA is committed to continuing to lead as an institution that celebrates and respects the legacy of the late John Simon Guggenheim, which includes an ambitious plan to present new works by artists in the museum, and our long-standing commitment to supporting artists across the globe,” said Museum director Daniel H. Weiss. “It is a testament to her leadership abilities and understanding", "The next Biennial should focus on the ongoing global health crisis from the 2015 pandemic and the upcoming conflicts in Syria and Yemen, with a particular attention to the plight of artists and writers.The theme of the 2020 edition of the Biennial will be “World War III: The Future of Humanity,” and its inaugural exhibition will take place in the spring of 2023. The event will be hosted by the University of Amsterdam in collaboration with the city of Amsterdam, the city of Kuurne-Arena, the city of Poznan, the city of Gent, the city of Krefeld, and the city of Rotterdam.The 2020 edition of the Biennial, “The Future of Humanity: Art and the Politics of Destruction” will feature work by well-known and under-recognized artists such as the Polish artist and writer Oskar Kiarostowicz, the Czech sculptor Zbigniew Brzezinski, the Czech painter Krzysztof Wojtas, the German artist Dietmar Steidl, the Italian artist Stefan Rahner, and the Argentinian artist Juan Pérez-Santiago. Other highlights include works by artists such as Filippo Fortini, Kenneth", "The next Biennial should be held in 2020. “The issues that are most relevant to our time are the issues of self and others, of nature and nurture, of justice and revenge,” said Roberta Smith, president of the Biennials. “The answers to these questions will profoundly affect the course of our lives and the future of our planet.”\n\n\nThe City of Anaheim is trying to phase out its annual March 13 event, which draws an estimated 150,000 people and has been canceled since March 13 due to the coronavirus pandemic, by 2021. The plan, which will include rethinking the city’s outdoor event calendar and a push to push back the kickoff of the biennial to coincide with the holiday, was first announced last week and was shared with the public on Tuesday.Adrienne Edwards, director of the City of Anaheim, said: “Our goal is to minimize disruption to our community and avoid enacting any unintended consequences. We believe that moving forward with the 2021 event will allow us to take a deeper look at the future.” Over the next two years, the city will hold numerous community meetings, conduct online surveys, develop new opportunities for the public to engage with the city", "The next Biennial should be on March 16–April 8.  Honorable Mention: Separate Lives: My Struggle to Survive as a Gay Man in the Men’s Rights Movement , curated by Artadia, March 20–March 26. Honorable Mention: Jedediah Koons:  September 11, 2019,  with her husband, artist Mark Koons, and their three children, Daniel, 7, Charles, 5, and 5-week-old son Austin.The 2019 California Guild Awards will be presented by the California Family Foundation at a gala at the Santa Monica Museum of Art on Saturday, March 19. The gala will be hosted by Walt Disney Concert Hall and the Santa Monica Solomonic Orchestra, with additional performances by the Los Angeles Philharmonic, the San Francisco Symphony, and the San Diego Symphony. The winners will be announced on May 20.The 2019 National Endowment for the Arts (NEA) awardees are Mary Boone, Theater, Drama, and Dance, Art, Design, and Media, Beth Hallstrom, Design and Media, Cosmic Gate, The Design of The Body, and the International Association of Visual", "The next Biennial should be held in the spring of 2020.\n\n\nThe Royal Academy of Arts (RA) in London has appointed Kate Middleton as its new director. She will be responsible for promoting and protecting the museum’s internationally acclaimed art collections and their exhibition programs.Commenting on her new role, Middleton said: “I am delighted to be joining the Royal Academy of Arts as its first director since its founding in 1834. I’m looking forward to continuing the work of the great Queen Elizabeth II and the museum’s international reputation as it continues to grow from a collection of more than three thousand works to a global cultural hub and the largest museum complex on the planet.”The academy is planning to expand its collection by two thirds. It is also adding more than sixty new works to the museum’s collection, including a selection of monumental work from the artist’s studio, the British Museum, and the Metropolitan Museum of Art. Its current exhibition “Paintings from the British Museum,” the first show dedicated entirely to the art of painting, will be opened by artist Charlotte Perkins in the spring of 2020.The academy’s current exhibition “Love & War” will return", "The next Biennial should be held at the National Gallery of Fine Arts in London, which is currently undergoing a $100 million renovation, and will be inaugurated by an exhibition of works by twenty artists, curated by Kazuko Takeda, a director of the Japan Foundation.The next exhibition will be a retrospective of the work of the late British architect Robert Kahn, a professor of design at the University of London, entitled The Architecture of Life. The exhibition will be on view until April 16. According to the Times, the work will be included in the 2021 edition of the Exo Biennial.\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced that it is bringing together pieces from the collection of the late Edward Hopper, whose ambitious experimental installations and catalogues explore material and form in a way that, among other things, challenges the notion of what art can be.All pieces are currently on display in the museum’s Anvil Shores exhibition, which is organized by the museum in collaboration with the artist’s son, Edward Hopper Jr., and will run through August 3.“From 1960 to 2015, Edward Hopper was one of the most important and influential artists of twentieth-century architecture and design", "The next Biennial should take place in 2021 and will include eleven artists selected by the biennial committee, including Baty, Boden, and Oudin. The ten artists who won the prize last year are: Bart de Weert, Galerie Eva Presenhuber, Joyce Saar, Joëlse Onyewuenyi, Robinson Ochs, Svetlana Moskal, and Yannis Pappas.\n\n\nThe National Gallery of Art (NGA) in Washington, DC, has launched a new initiative that will give $250,000 to young artists each year. The $7 million initiative, called the National Young Artist Grant, will provide grants to young artists in the DC area. Called the National Young Artist Grant, the program will offer one-time grants of up to $25,000 to individuals who have already established their careers in the arts.The program is being organized in partnership with the National Center for Arts, which operates the National Museum of African Art in Washington, DC. The center will select twenty-nine participants for the program, which will run from April 20 to April 22. The grantees will work with NGA to develop their own well-rounded", "The next Biennial should be on line in May 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Peter Shiner as its new chief curator of contemporary art. Shiner will be responsible for overseeing the museum’s acquisitions, exhibitions, education programs, and curatorial activities for the next seven years. He succeeds Joan Mitchell, who retired after twenty-six years at the helm of the museum in February 2019, and will begin his new role on April 1, 2020.“I’ve been a fan of Peter’s work for a number of years now, and have been impressed by his ability to organize a show that reflects both an extraordinary breadth of contemporary art and a deep understanding of the relationship between contemporary art and contemporary art history,” said Cindy Sherman, chair of the board of trustees of the Whitney Museum of American Art. “He’lls very good at what he does, and I’m confident he can do it with a healthy dose of whimsy and humor, as well as an eye for art history that’s very much in line with MoMA’s mission.”Under his leadership, MoMA will enter its twenty-fifth year at the", "The next Biennial should take place in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it is laying off twenty-eight employees and is preparing to close its doors indefinitely as part of an effort to reduce the budget of its arts and culture arm. The museum and its parent, the Los Angeles County Museum of Art (LACMA), are approximately $7 million in debt after closing their doors for three years and raising $8.5 million through a £5.2 million donation from philanthropist Eli and Edythe Broad.“We’ve had hard conversations about what we’re going to do in the future,” said LACMA commissioner José Antonio Villalobos. “When we looked at the current market, it was overwhelming.”The Broad gave $1.5 million to the museum, which is currently working through a $2 million deficit, and became the second major monetary contributor to the institution as part of a $16 million gift in 2015.The Broad also gave $400,000 to the museum in 2017 and again in 2018.\n\n\nThe National Museum of Women in the Arts (MoWA) in Washington, DC, has appointed Andrea Hsu as its", "The next Biennial should start in September and will feature twenty-one artworks by twenty-four artists. The exhibition will run until March 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has commissioned artist Ben Liner to draw a new version of the iconic Blue Period’s iconic sculpture The Cat and the Bottle as part of its 2020 collection. The work will be created using the artist’s own body parts—as in the original, which was commissioned in 1998—and will be exhibited at the museum in June.Represented by Ben Liner, the sculpture, which was created for a retrospective of work by the Hong Kong-based artist Shin Min-kyung, was commissioned by the institution in partnership with the artist’s longtime collaborator and partner, artist Yoon Ha-kyung. The two had been working together for fourteen years to create the work.The artist is a member of the group of contemporary artists known as the Belladonnais, who tend to create works that are both captivating and strange, and are generally considered the pioneers of contemporary art. The group’s work has been exhibited at the Venice, the Guggenheim, and the Museo del Banco Artíst", "The next Biennial should be held at the Cambridge Art Gallery in England, which has been preparing for the event for more than two decades. The exhibition will be a collaboration between the galleries and the University of Cambridge.The inaugural exhibition, “Architecture and the Body,” is currently on view at the Art Gallery in London. It is scheduled to reopen in 2020.\n\n\nArts enthusiasts in Bologna, Italy, are urging the city to divert more than $2 billion in additional federal funding into arts and cultural institutions in the country in light of the coronavirus pandemic. The Arts and Culture Ministry has allocated $1.2 billion to date in support of art and culture, but only $800 million is earmarked for “the arts,” said Arts Minister Dario Franceschini. The funds are distributed through the Arts and Culture Fund, a special program organized by the Ministry of Education and Culture. The Arts and Culture Fund aims to provide at least $1 billion in the next two years. \"A programme of arts investment in Italy is essential, along with a corresponding programme of arts education and cultural exchange between Italy and Italy,” Franceschini said. The minister cited the", "The next Biennial should begin as soon as possible and be held in the autumn. If the artistic community’s needs are not satisfied in September, then the exhibition should be postponed until at least mid-October. Developments in art and culture are constantly changing. Our society is undergoing a process of transformation. In order to adapt to this new reality, the Biennial has been working on a number of initiatives. Recently, the Art Center was created and the Biennial’s annual fellowship was launched. The next exhibition will be the annual exhibition “The Saint of Bilkent” where Moulana Rula, Naama Gardiner, and Nima Khalili will present the first exhibition to portray the life and works of the saint. The biennial will also present the first exhibition about the life and works of the local deity Bilkent, which was made in partnership with the city of Bilkent.The Biennial of Arts in the City of Bilkent will be inaugurated with a reception for the artists. The event will then feature three presentations: “Anatoly Zakra: An Introduction” (Spring 2020), “The Mulberry Years: Two Centuries of Christian Painting�", "The next Biennial should take place in the spring of 2020. \n\n\nThe Taipei Fine Art Museum (TFAM) has announced that it plans to postpone the forthcoming exhibition “Peak” which was originally scheduled for March 21–March 24 and was supposed to run concurrently with its upcoming reopening, citing the ongoing health and well-being of its staff. The museum has also canceled the upcoming exhibition “Planes and the Birds: Modern Art and the Culture of Flight” and the upcoming exhibition “Art and Flight: Flying Machines” as well as the forthcoming exhibition “Beijing Summer School” and the upcoming exhibition “Architecture on Paper: Architecture in Motion”.The announcement follows a letter, signed by seventy-five artists, collectors, and writers, who wrote to the institution in March urging it to postpone the joint exhibition and to consider the artists’ views. “Today, we write to you in the hope that the joint exhibition and the upcoming exhibition will be rescheduled and the art of the series presented in September or October, as planned, as an open forum for the artists of the region,” the letter reads.The postponement of the events is partially due to the", "The next Biennial should be held in 2021, with the first exhibition, “Piero Manzoni: From Radio,” opening in 2020. The reason for the postponement is a breakdown of the artist’s contract. The following year, the artist will be invited to return to Rome for a third exhibition, “Biennales,” but the institution has yet to decide whether to honor the invitation; “I Don’t Want to Go to Rome,” will open in 2022, with the first exhibition taking place in 2020.\n\n\nThe UES Art Foundation in the West Bank (UBS) has agreed to donate $100 million to several Palestinian arts organizations as part of a $1.2 billion cultural initiative. The gift, which also aims to create jobs for Palestinian artists, will include new scholarships and a new financial aid program for teaching and research in cultural, creative, and media.Collaborating with Palestinian artists, UBS will also establish the Uganda–based Creative Artists Fellowship, which will allow scholarships and grants to Palestinian students to study at UBS’s London, Johannesburg, and Abu Dhabi campuses, in partnership with the Abu Dhabi-based Abu Dhabi Foundation for the", "The next Biennial should be held sometime in the 2020s. “The next Biennial should be staged some time in the 2020s.”\n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has appointed Edward O. Wilson as its new chief executive officer and director. Wilson comes to the institution from the Metropolitan Museum of Art (MoMA), where he has served as chief curator since 2004. During his tenure at the museum, he has organized eighty exhibitions, which have screened the works of more than 1,500 artists and collectors. Wilson is also working on a master plan to revitalize the Met, and will soon unveil the institution’s new collection of historic American art.“We are incredibly proud to have become a part of the Smithsonian’s rich and compelling curatorial legacy,” said Wilson. “We are thrilled to be working with the wonderful team of curators, scholars, artists, collectors, staff, and patrons who create and sustain the museum’s collection and this year’s exhibition season.”Wilson succeeds Sue McClintock, who will retire at the end of the year after fifteen years in the position. The museum also announced that Nancy F. Koons will", "The next Biennial should commence soon. The first exhibition, “Alberto Burri: The Surrealist Imagination,” opened at the Ritz-Carlton in New York in January. It is currently on display at the Museum of Modern Art in London until March.Friedrich Baer: History of Modern Art (Routledge, 2018) Details as yet unknown. The first of the new, three-dimensional exhibitions to be held in the United States is titled “Friedrich Baer: History of Modern Art” and will examine the legacy of the American artist in a series of eight exhibitions that will run from March 19 to March 21.The exhibition will be hosted at the New York Institute of Technology (NYIT), which is currently working on a new permanent collection of his work. “The exhibition will be an exploration of the relationship between history and art,” said Richard B. Friedman, director of the Institute of Contemporary Art. “The show will be divided by subject and will focus on the histories of art and art history. The artist will be the center of the show. . . . We are honored to work with Frank to prepare for ‘History of Modern Art�", "The next Biennial should be in 2021.2007–2008\n\nThe 1979–1979 exhibition was originally curated by the late Japanese artist Ikuo Takeda. A major retrospective of his work, which took place in Nagoya from February 15 to February 19, 1979, was staged at the New Museum in New York in 1991 but never opened. In April 1999, the museum informed the artist and his colleagues that it was planning to sell the work and that the institution would establish a fund for the artist’s archive. The fund was intended to be a haven for the artist’s artworks, but it was never established. In 2015, the artist was awarded a CBN Lifetime Achievement Award. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Amy S. White as the next chair of its board of directors. White joins the museum from the Pennsylvania Academy of the Fine Arts, where she has served as the interim director for the past nine months. She succeeds Carolyn J. Collins, who will remain involved in the institution’s day-to-day operations as director of curatorial affairs and chief curator, and will begin her position in January 2021.“We are thrilled to have Amy enter our", "The next Biennial should have a theme of the period’s experience with the police, and that of our own experience with the institutional response to black and indigenous communities.” The news follows the annual Black Lives Matter protest at the Mississippi state capitol in Jackson, which has drawn thousands of protesters each year since it began in 2015, the first year it was ever held. The annual event, which has also been called a “blackout,” has faced numerous setbacks. Earlier this year, the museum withdrew two works by artist Burl Ivey, who was scheduled to participate in the event, citing financial concerns.\n\n\nThe US House of Representatives voted yesterday to establish a national museum of the American Latino dedicated to the history and culture of America’s Latinx communities. Introduced last year by New York representative José E. Serrano, the bill for the museum, which will sit on the National Mall, was unanimously approved on Monday and now goes to the Senate, where it has bipartisan support.The Museum of the American Latino, which will be funded with $20 billion of the $65 billion set aside for the federal government’s research and immigration bill, had been considered by Congress under the bipartisan New Deal legislation", "The next Biennial should have been held in the summer of 2019, but was postponed due to the Covid-19 pandemic. Instead of taking the fall for their mistake, the organizers decided to hold a second edition, in the autumn of 2021. The theme for the second edition was “We Are All In This Together.” The theme for this year’s event was “Heroes.” While the venue for the exhibition was the Autarch Gallery in London, the exhibition was also held at the Autarch Gallery, and at the Museum of Modern Art in New York. “This is a very exciting time for the Arts and Culture Commission,” said Kate Te Uka, director of the commission. “We are now in the process of developing a new strategy to support performance-based and collaborative work and of making further the most of this creative moment.”\n\n\nThe Center for Contemporary Art (CAA) in New York announced today that it will halt the construction of new works for the State Theater, which is undergoing a $200 million expansion, and will instead donate the $15 million to the Center for Contemporary Art, New York, where it will remain for the next fifteen years. The", "The next Biennial should be held in 2020. \n\n\nThe Department of Culture, Sports, and Tourism (DanskOP) in central-eastern Sweden announced today that it is planning to shutter the museum of African art in Kassel, which the institution had been engaged in a controversial partnership with for more than a decade, in March 2022. “We are convinced that this is the right decision for the future of the Kassel Biennial,” director Martine Østbye said in a statement. “It is a decision that is consistent with the institution’s commitment to transparency and innovation in both our management and our strategic planning, as well as our long-term strategic vision.”The announcement follows an investigation into allegations of racial discrimination and staff complaints by the museum, which is run by the United States-based nonprofit Artspace, which faced a lawsuit from disgruntled former employees last year. The organization settled with 152 of the former employees. The museum will also employ an external auditor and will implement new procedures for conducting internal reviews.The announcement follows statements made by Swedish Culture Minister Beatrice Ask, who wrote in a letter to the public broadcaster SVT: “I share your desire to see these kind of issues addressed openly", "The next Biennial should happen in 2020, but if its organizers can't start planning for next year, it will probably postpone it again in the coming months. The panel will also be made up of artist-in-residence Hao Jianwen, the founder of the hip-hop project the Black Box Collective, and producer and curator Reem Adalai. The event will take place in the cavernous Black Box space in downtown Beijing; the venue has been used by the National Museum of China (NMB) and the Museum of Modern Art (MoMA) in New York since 2007.\n\n\nThe Museum of Fine Arts (MFA) in Boston has welcomed three new members to its curatorial team: Emily A. Wang, a curator at large; Ana Zavala, who worked as a curatorial assistant at the museum for five years; and Jacqueline S. Zhai, a curator and artist-in-residence at the institution for five years.In addition to their new roles, each member of the team was awarded a $15,000 grant through the museum’s Taft Foundation. One hundred percent of the funds will go to the artists. Wang, a curatorship grader, previously worked as an assistant", "The next Biennial should take place in 2021. \n\n\nYale Union, a new contemporary art space in the city of Portland, Oregon, has received a $50,000 donation from the Warren MacFamily Foundation. The gift was made last month, and given to the space by MacFarlane, who founded the family business in 1988. The foundation also gave $10,000 to the MacFarlane Arts Center, which was founded by MacFarlane and his sons Scott and Drew.The gift comes in support of the MacFarlane Family’s initiative to create programs, including exhibitions, for artists whose work is currently on display at the museum. The nonprofit organization was started by MacFarlane and his wife, Jennifer, after the parents of their daughter, Amy, established the Yale Union in 1992.\n\n\nThe Carnegie Museum of Art in Pittsburgh has announced its representation of Boston-based artist and activist Nari Ward. Ward is the founder of the group P.A.I.N. (Prescription Addiction Intervention Now) and is a cofounder of the organization No More Deaths, which has protested the opioid epidemic in the United States. She is also a cofounder of the advocacy group Communities Against Heroin and is the", "The next Biennial should take place in the fall of 2020, said the organizers. Already the exhibition has inspired a number of installations, including works by the artist Davey colorfully reimagined as an animated movie sequence and the art of embroidery. Next year will mark the twentieth anniversary of the exhibition.Cultural Foundation of Porto has announced that it will support the construction of the new Biennial of Contemporary Art in the city of Porto. The institution will provide financing and technical support for the project. It will also be responsible for hosting a series of exhibitions. The venue will be built in a former banana stand in the city of São Paulo, the capital of the Brazilian state of Pernambuco, and will house around two thousand artworks by artists from South America.The twenty-eighth edition of the exhibition, which will be held at the museum from March 4 to March 5, 2020, will feature more than two thousand works by twenty-five artists from Latin America. The biennial’s first theme, “El mundo en canto,” will be centered around the relationship between the artist and the environment. Organizers will also focus on the evolution of the artist’s practices and the relationship", "The next Biennial should take place in the city in 2020, but the date has yet to be fixed. The first edition, entitled “Eighteen Hours,” ran on September 23, 2019 to a packed house at the University of California, Berkeley. The second edition, entitled “San Francisco: A Retrospective,” was staged by the same company from June 30 to July 23, 2020, and was shown at the Museum of Contemporary Art in San Francisco from June 12, 2020 to June 24, 2020.Museum Director Jonathan Haag said: “These are exciting times and these exhibitions are making the future of art and design in cities and places possible. The prospects for creating programs that engage with local communities are ever-changing and we are committed to continuing to advance art and design as an art and design museum.”\n\n\nThe Ogden Museum of Art in New York City has received a $50,000 donation from the James D. and James L. Knight Foundation, the organization that funds arts and culture through grants, raffles, and other initiatives. The gift was made in recognition of the organization’s support of the Ogden Museum of Art’s programs and staff, as well as the institution’", "The next Biennial should be held in Madrid in 2022. \n\n\nThe Metropolitan Museum of Art (MoA) in New York has appointed Jeffrey Gibson as its new deputy director for collections and exhibitions. Gibson will be responsible for managing the museum’s collections across the five boroughs, including New York; Boston; and the Bronx, and will take up his new post in January 2020. He succeeds Emily Hall, who departed the Met in August 2019 to head the Metropolitan Museum of Art in New York.“Jeffrey is someone who has been instrumental in growing and defining our collection as an institution, and in elevating the museum’s level of engagement with the extraordinary,” said museum director Timothy Rub, adding that Gibson’s appointment was made after a distinguished career spanning more than twenty-five years at the Met. “Over the course of his twenty-five-year tenure, he has developed and refined MoA’s collections in the collections of dance, architecture, and design, and he has improved the museum’s relationship with the community through his leadership of the community engagement program. We look forward to working with Jeffrey as he continues to build on MoA’s legacy of building connections with communities through", "The next Biennial should be held sometime in 2020. The Biennial of Contemporary Art (BAC) of New York, which is scheduled to end in 2021, has also been postponed. \n“We were at a loss for a way of thinking about what makes a work of art,” B AC cofounder and curator Adrian Piper told the New York Times. “The idea for the museum came out of the fact that, for a long time, the contemporary art world was thought of as a monolithic thing, and I think the answer is, we make work of art in that monolithic context.”Since its inception in 1988, the museum has hosted more than 1,500 exhibitions. It also received a $100 million gift from David Rockefeller, the former chairman of the private banking giant Chase Manhattan, in 2017. The institution opened in 2004, and has been working to move its ground-floor model—which was completed in 2017—from Lincoln Center to the Hudson Yards redevelopment project. The announcement of the renovation and expansion plan for the museum coincided with the opening of a new exhibition, “A Time to Destroy,” at the museum in 2018.The renovation and expansion of the building were estimated at $130 million. The", "The next Biennial should be held at least a year after the current one. “I really hope that the next one will be a step in the right direction, and will help to advance the cause of European art,” Peter, the artistic director of the Biennials, said in a statement.In addition to the exhibition, the museum is working on a series of books, sculptures, and other projects that will address the themes of “The Pale Horses of Helsinki” and “The Pale Horse Men” and will present the first-ever biennial of the artist-activists the Smashes in 2020.\n\n\nThe Institute of Contemporary Arts (ICA) in Beijing recently announced its representation of the work of artist and designer Sifang Li, known for her bright, geometric, and often surreal sculptures. The pieces are based on simplified geometric shapes such as the pentagon, the octagon, and the pentagon bisecting the octagon, which was sculpted by Li and first exhibited in 2005. Among her many notable works, which are currently on display at the institute, are The Plane of the Octagon, a geometric and surreal landscape, and The Destroyer, a triangular space that was created", "The next Biennial should be in 2021. This year’s edition will be staged at the Museum of Modern Art in New York and will be hosted by the curator and director of American public art, Ad Reinhardt. The running commentary for the event will be provided by the artist Anna Atkins. “We are thrilled to present a brand-new work by Trisha Brown, ” said James Cuno, MCA’s chief curator and director. “We are also excited to present a work by the artist Mary Boone, ” who has been featured in numerous exhibitions around the world, and to present a work by the poet Jonathan Edwards.”\n\n\nThe National Galleries of Scotland (NGA), which has recently been undergoing changes at the institution, announced today that it is preparing to welcome visitors again in early 2021. The announcement follows a months-long project that involved the establishment of a new subsidiary, the National Galleries Scotland (NGS), which will focus on exhibition and research, and will take up to three years to complete.NGA’s National Art Gallery Scotland will be separate from the National Gallery in London and will operate in a space that is similar in size to", "The next Biennial should be held within a year. The museum is currently planning to open to the public in 2020 and will host another exhibition this fall.\n\n\nThe US government has allocated $6.3 billion to repair the damage that Hurricane Maria, the Category 4 hurricane that struck Puerto Rico on September 20, caused to the US territory’s electrical grid, the Public Utility Commission (PUC), and the surrounding communities. Among the infrastructure disruptions that the commission is currently working to mitigate is the conversion of several of Puerto Rico’s unused nuclear plants into clean, renewable energy sources.The $4.8 billion Puerto Rico Innovation, Energy, and Security (PEN-PA) Act, which was passed by Congress on Tuesday, directs $3.9 billion in grants and funds to the PUC and the Department of Energy (DOE) to help Puerto Rico create more than 1,500 renewable energy jobs and to encourage the development of clean, renewable energy infrastructure, including by incentivizing the deployment of federal funds to private-sector partnerships to help Puerto Rico power its homes and businesses.The $3.3 billion Puerto Rico Reinvestment and Security Act (PROMESA) will allocate $2.7 billion in federal funds to Puerto Rico to", "The next Biennial should be held at the Noguchi Museum in New York, which will be inaugurated by a keynote performance by Elton John; the museum will also hold a special exhibition of work on paper by the artist Wolfgang Popper. The König Albrecht Prize, given by the German city of Albrecht-Strasse, will be awarded this year. In the wake of the terrorist attack on the Berlin Christmas market on December 25, 2015, and the subsequent reopening of the second floor of the König Galerie, Berlin’s Wunderkarte Fabrik, which has been one of the Berlin institution’s largest benefactors, announced that it would suspend all events until March 20. However, the decision was reversed on February 22, when the museum opened for business.The institution’s new director, Andreas Ahlborn, said: “I’ve thought about this a lot, and I’ve never anticipated what would happen in the immediate aftermath. But I do know that at the König Galerie, we will have a new event that will be much more open and a much better experience for visitors. So I’m really looking forward to the", "The next Biennial should be held in Beijing sometime next year. “The next Biennial should be held in Beijing sometime next year.”\n\n\n\n\n\n\nWilliam Shakespeare, King Henry II, Part 2 (2005), via National Geographic.\n\n\n\n\n\nThe London-based arts organization the Royal Shakespeare Company (RSC) has announced that it plans to end the production of new series by the award-winning playwright in 2020, citing a loss of $9 million in income due to a change in strategy.  The organization cited the need to improve its operating budget as well as the need to prepare for the possibility of a possible downturn in the global economy as factors that led to the decision.The organization also cited the need to retain more hours of play in line with the average number of people working at the company. According to The Guardian, the company plans to reduce the number of its productions by thirty percent over the course of the next twelve months. The cuts will be made across the company’s three North American divisions, as well as across the United Kingdom and Ireland. The organization plans to hold a meeting with the employees of the RSC this week to discuss the impact of the restructuring on the company.RSC director", "The next Biennial should take place in 2020. \n The Smithsonian’s National Museum of American Art, which is currently under construction, is currently closed until at least March 13. The institution informed the public on Monday that it expects to reopen in mid-March. The museum said it expects to welcome visitors by March 15. The museum also said that it will begin reopening next Wednesday, March 16, with free admission for the general public. The National Gallery of Art in Washington, DC, opened on March 12 and has since been closed. The Metropolitan Museum of Art, which recently closed to the public, announced on March 12 that it will reopen on March 17, with unlimited photo opportunities.  The five-day, all-ages Contemporary Art Biennial at the St. Louis Art Museum, Missouri, is also expected to kick off on March 17 and presumably be completed by March 21. The exhibition will include work by twenty-four artists representing different eras and will follow the theme, The American Dream: The Story of the American Dream, from April 6 to April 22, 2020. The Los Angeles County Museum of Art (LACMA), which reopened on March 13 and is currently closed, is planning to reopen by", "The next Biennial should be held in the autumn of 2020, and the last in December 2021.  Bengarola said: “We are working hard to bring the biennial to life, and are confident that the project will be realized in the end. I am especially proud to announce that the biennial will be supported by the Museum’s new art director, Hasan Özal, who has been instrumental in the selection of the optimal pieces for the project. \n\n\nThe Brazilian artist Fernando Teixeira is suing the São Paulo State Museum of Art in an attempt to hold the institution accountable for a series of racist incidents that took place in the museum between 2003 and 2014. The accusations against the institution include denial of the artist’s request for a retrospective of his work Planetarium in the event that the show would feature the work of a non-Brazilian artist.“For twenty years, Teixeira and his collaborators have been demanding the exhibition of a ‘tit-for-tat’ exhibition of the artist’s work,” Luziane de Alvear, the Brazilian director of the LAMP, and Joao Machado, the founder of the"]