["The next Biennial should take place in 2021. The next ArtAsiaPacific should take place in 2022. The next GCBAsia would be held in the thirtieth anniversary of the GCBAsia, in the thirtieth anniversary of the GCBAsia. The next EICPR would be held in the thirtieth anniversary of the EICPR. The next GECAsia would be held in the thirtieth anniversary of the GECAsia. The next GENCAsia would be held in the thirtieth anniversary of the GENCAsia. The next GEMAsia would be held in the thirtieth anniversary of the GEMAsia. The next GIGaI would be held in the thirtieth anniversary of the GIGaI. The next GIGAcademy would be held in the twenty-fifth anniversary of the GIG academy. The next GIGART would be the thirtieth anniversary of the GIGART. The next GIGartini would be the thirtieth anniversary of the GIGartini. The next GIGARTSF would be the thirtieth anniversary of the GIGARTSF.\n\n\nThe Carnegie Museum of Art in Pittsburgh", "The next Biennial should take place during the second half of the year, and will be held in the early months of the next decade.\n\nThe nation’s leading arts figures are urging the Canadian government to commit to playing a bigger role in supporting the arts in the country’s capital, where a critical shortage of new arts and cultural programming is hampering the government’s efforts to restart the economy. The public and private sectors are struggling in similar ways to those that unfolded in the United States following the Covid-19 pandemic.The Canadian Alliance, a coalition of more than sixty Canadian arts organizations, has issued a statement urging the federal government to step up. “The public is suffering as a result of a lack of new artistic and cultural programming, and the Arts Minister should be actively engaging in the hiring and training of the people who will direct and execute new programming across Canada,” the letter reads.The letter also criticizes the government for allowing the Covid-19 pandemic to continue despite the enactment of a number of temporary relief measures—including a $50 million fund for artistic and cultural organizations, and the establishment of three agencies to assist small to mid-size Canadian arts and cultural organizations—and for not doing more", "The next Biennial should be held in 2021. \n\n\nThe Berlin Art Museum (BAM) has received a gift of eighty-nine works from the late American artist Arne Glimcher, whose oeuvre includes work that encompassed both social justice and art. The gift includes works by twenty-six artists who were based in the United States and were represented by BAM: Jacob Riis, Charles Larsen, Barbara Kruger, Laurence James Keen, and John Cassavetes.“For more than thirty years, Glimcher produced work that challenged the limits of art and the landscape, drawing attention to the ways that art and landscape interact with one another,” said curator Peter Meals, who curated the exhibition “Arne Glimcher: The Future is Art” at the BAM in 2017. “This is a rare and important collection, made in an era when the exhibition was at its height and in a time when Glimcher was at the height of his powers.”In addition to the works, four volumes, including a second-volume biography, the artist’s final written statement, and his letters, three rare drawings by the artist, and a special edition of his “", "The next Biennial should take place in 2021. The 2020 edition, titled “Sisters and Brothers: Art and Architecture in London,” will be staged at the Museum of London alongside the Museum of Modern Art and the Tate.\n\n\nThe Metropolitan Museum of Art in New York has announced that it will increase the minimum number of works an artist can have on display in its galleries by twenty-six percent in 2021. The plan comes after the museum raised the minimum number of works an artist can have on display by forty percent in late January. The increase in the gallery’s staff is part of the museum’s restructuring of its exhibition space in the city.Beginning in the spring of 2020, the museum will be able to display more works by artists such as Alice Aycock and Chris Levine. The show “This is Art: The Art of Abstract Painting” will be moved to the museum, and the museum will begin hosting new work by artists such as Mary Boone, Betsey Griffin, and Louis Malle. The museum has yet to announce any plans for a “next year” exhibition.The move follows the museum’s announcement that it plans to lay off 160 employees, and will also include a hiring freeze and a", "The next Biennial should be held in 2020. #ElectronicArt’s #Gatekeepers Question: What Next for the Digital Age is out now.  Biennial: 20th Century Art, 2019.  After the fall 2019 exhibition “Art of Job,” curated by Erika Bochereau, was canceled, the Künstler-Kunsthalle in Cologne hosted a retrospective of the work of Bernd and Hildegarde (printed gloves) in March. Bart Knapp, head of the Künstler-Kunsthalle, said: “The museum is at the same time at a turning point as the art world as a whole. We are witnessing the transition from a static, mass-based culture to one that is driven by community, collaboration, community action, and community support. We are witnessing a new kind of life unfolding.”\n\n\nThe Sidney and Lois Eskenazi Foundation and the KASK-University of Applied Arts (KUBA), Japan, announced today that the two organizations have partnered to create the KASK-University of Applied Arts (KUBA). The foundation will offer a wide range of", "The next Biennial should take place in June 2020; it will be led by Catherine Merrië, the director of the City Museum; and will be hosted by Joël and Alain Sadek, the owners of the auction house OUD. The third event, which will be held in the spring of 2021, will be organized by Hans-Ulrich Obrist, the director of the Kunsthalle Basel, and will be hosted by the Kunsthalle Bern.\n\n\nThe London-based artist Max Beckman, who portrayed himself as a dashing, 22-year-old artist-in-residence in his 1999 paintings, has died at sixty-six years old. His work has been used as a backdrop in many a David Lynch film, and his paintings are featured in the forthcoming exhibition “The Process of Painting: Art and the Body” at the National Gallery in London.Born in 1953, Beckman studied at the School of the Arts in London and the School of the Economics in Paris before earning a teaching appointment at the Royal College of Art in London in 1974. His first exhibition was at the National Gallery in 1979, and his first solo show at the Tate in London in 1986. He has also had solo", "The next Biennial should be held in the autumn. “This is not only the right time but also the right place,” said Elizabeth Conklin, president and CEO of the Biennial Foundation. “With the D’Arcy Prize and the upcoming Spring/Summer/Autumn Biennial, we are excited to present the next generation of art-world leaders, and the first in a series of exhibitions that will explore the forms and the possibilities of art in a digital and connected world.” The 2019 edition of the Biennial, titled “The Future Is Now,” will explore the meaning of art in this digital and connected world. The 2019 theme is ‘Engagement,’ and how it can be both a medium and a point of departure in the journey of life and work. ” The project will be led by the library of the Polytechnic University of Milan and will feature some twenty artists, including Giuseppe Zanica, Stefano Cattelan, and Kate Peshburn, among others; will take place over a three-week period; and will be free to the public. Artists may submit works for consideration for consideration for a prize of $10", "The next Biennial should begin in March 2021. The date was chosen to coincide with the centenary of the outbreak. “The cultural and artistic heritage of Central African Republic is rapidly deteriorating due to the ongoing conflict,” said Moran. “As a result, we believe that an appropriate and timely exhibition to mark its centenary is an important step in the right direction to address this serious threat to the country’s cultural heritage.”The show will include interviews with experts, archival material, and “An Incomplete History: From Genocide to Genocide-1918” (2019); “Genocide and the Art of Genocide: International Tombs,” (2016); and “Paris: A Cultural Trauma” (2006).Commenting on the exhibition, the French Culture Minister, Franck Riester, said: “We are delighted that the Biennial will present to the Republic of Cameroon a true reflection of the country’s rich heritage. The exhibition will be a true reflection of modernity in South Africa’s capital city and will celebrate the cultural and artistic achievements of the people of South Africa. It will also be a true reflection of our history in Africa. It will", "The next Biennial should take place in 2021 and is expected to draw upwards of a million visitors. The event will also be expanded to include an exhibition of the work of the same artist, and the sculpture “Mona Hatoum” will be moved to the third floor of the museum.\n\n\nThe Saudi Arabian royals have ordered the demolition of a huge effigy of King Faisal VI and the subsequent restoration of the throne to their son, Salman, by hazing them both to death. According to the Independent, the act was carried out in AlUla, in the royal capital of the United Arab Emirates, on Saturday, May 28. “After the execution of Faisal VI, the palace is now preparing to welcome the new ruler, Saudis, with pomp and ceremony,” said Prince Turki al-Faisal, the Crown Prince of Abu Dhabi and the Attorney General of the United Arab Emirates. Faisal VI was executed in 1948, the year after he was crowned King. He was also killed by his own brother, the King, on February 13, 1948, the same day Saudi Arabia gained independence from Britain. After Faisal VI died, his half-brother", "The next Biennial should be held at the Museum of Fine Arts, Boston, in 2021. \n\n\nThe Bessies, a New York–based nonprofit that supports artists working in the arts, has announced that it is returning $30 million to the city of New York following a $40 million cut in funding that was made by the city’s governor, Andrew Cuomo, in 2016. “The Bessies is proud to support the arts and cultural sector in New York,” said Kelly Bess, president of the organization and founder of the Brooklyn-based nonprofit the Bessies. “It’s gratifying to see our artists grow in stature and in influence, and it’s another step toward seeing more of our artists in the public space. We remain hopeful that these funds will reach the organization, and we look forward to working with Mayor Bill de Blasio and the city’s leaders to ensure that they are returned to the artists who have made their home in the Bessies’ network.” The organization will also create two new fellowships, which were established to provide free studio space in the city’s Museum of Modern Art and the Art Institute of Chicago, and will establish a new", "The next Biennial should focus on the African diaspora and paradoxically, on the African diaspora in general; it should also reconsider the history of Africa and its relation to the rest of the world.”The new exhibition, titled “Secular Humanism” (the Hebrew name is “Amor”), will be curated by the B.I.I.C. and will inaugurate a new collaboration between the biennial and the Jewish museum. The inaugural programme will consist of two solo exhibitions, curated by Dorota Bocher, which is based in New York, and “Human Rights and the Evolution of the American Negro: From African to Jew.”The show will also include a dialogue with journalist and scholar Domenick Ammirati, who is writing a book about his experiences in the Third Reich and the “Frankfurt School” (1939–1945), and will be presented by the Jewish museum as part of a new exhibition. The first show, which will be on view in the autumn of 2020, will examine the history of the Holocaust; the second show, which will open in November 2021, will explore the impact of artworks on the development of the contemporary Jewish people.", "The next Biennial should be held in 2022, with a new exhibition to follow in 2022. \n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to move the show \"Tit for Tat: Ten Years of Victorian Art\" to the National Gallery of Art in Washington, DC, amid a fierce backlash from critics and activists. Museum director Christopher Colangelo told the New York Times that the move is not about accommodating or accommodating a contemporary audience, but is instead about \"doing what we believe is right for the museum.” The exhibition, originally scheduled for January 2021, originally opened on January 4, 2019.It is still not clear when the show will be moved. In a statement, the museum said: “We will continue to listen and listen carefully to your feedback as we carefully consider the implications of moving our show to DC and the impact that this would have on our talented staff and intimate relationships with our audiences in Boston and DC.”Colangelo, who is leaving in January after a decade at the helm of the museum, took the helm of the institution in 2018. He was hired by former director Matthew Teitelbaum, who stepped down in March 2020, and has led the museum since August 2019. In", "The next Biennial should be held in 2021 in Prague, and the ensuing exhibition should be up by November 2021. The Art Newspaper reports that the event will be organized by the Prague Art Museum, the National Museum of Fine Arts in Prague, and the Museum of the History of Modern Art in Prague.\n\n\nA group of artists led by Alphonse \"B*\" Bonsu in New York have received nearly $100 million in funding from the National Endowment for the Arts (NEA). The awards, which come with a matching grant of $60 million, will be used to support a number of projects across the arts, including the exhibition “Johnny Bueno: The Art of Painting” (2019–20), the 2019–20 collection of works by the Japanese artist and activist Benedict Karr as well as the upcoming “The Solidarities of Unfolding” exhibition in Tokyo.“Bonsu’s vision to support artists is as important today as it was when he first proposed it over twenty years ago,” said Hiroshi Matsumoto, the director of the National Museum of Modern Art and the National Museum of Asian Art. “Bonsu’s strategy of", "The next Biennial should be in late June or early July, when the weather is warmest. We demand that the selection committee and the organizers of the exhibition be resourced and directed to focus on the exhibition of the work of Michelangelo Antonioni. The programme should also be changed to include a discussion of a new year that will include works by artists including Ingvar Kamprad and Wolfgang Klee.We denounce the exhibition of works by artists whose works were publicly displayed in the exhibition of the last Biennial, the 2005 edition, in the Netherlands (Dusseldorf; no date yet given). We demand the immediate cessation of the exhibition of works by artists whose works were excluded from the first exhibition, the “Augustus/Auguste Biennale” (also in the Netherlands); and we demand that the works of the excluded artists be included in the second exhibition.This week another exhibition, “The Death of Michelangelo Antonioni” (Lehmann Maupin Berlin), was presented at the Venice Biennale. It featured works by Le Corbusier, Gheorghe Besant, Frank Gehry, and Olga Boetti. The exhibition opened on September 2, 2005 and ran until February 28", "The next Biennial should be held at the Saint-Louis-de-Provence in Paris in 18 months. \n\n\nThe Museum of Contemporary Art (MoCA), Boston, has hired Michael Robbins as its next director. Robbins replaces Mark Di Stefano, who retired in May after seventeen years at the helm of the institution. Robbins will take up the post on January 20, 2020.“Michael is a seasoned leader who has built the MoCA into a major force in the field of modern and contemporary art,” said museum director Michael Govan. “Alongside his many accomplishments, he has demonstrated a deep and enduring sense of vision for the institution. His influence on MoCA’s trajectory will be felt for many years to come.”Di Stefano, who has led the museum since 1988, will be succeeded by Lauren Halsey. During his tenure at the helm, Di Stefano fostered new collaborations between artists and local artists and has worked to increase the museum’s visibility in cities throughout the United States. He set the stage for the October 2020 opening of a new, larger exhibition, “Movements,” in partnership with the Boston Art Museum and the Washington, DC,", "The next Biennial should be held in 2022 and will consist of eighty artists from thirty cities, including Munich, Paris, Moscow, and New York, and will present a diverse range of works, including works by Norwegian artist Nidre Nar Høgh, whose compositional style is based on a triptych, a monolith, and a mirror, and experimental paintings such as the Water in the Clouds and the Auto-Life series.Hogarth will continue to work with his wife, the photographer Susan Martin, to create new work, and both Hogarth and Martin will continue to photograph live, in order to create a work which explores the relationship between art and life. As a consequence, it is anticipated that Hogarth’s biennial will present work in both the form of a photograph and the live experience of a photography workshop. The exhibition will be a collaboration with Hogarth’s son, Murray Hogarth, who will work with the artist’s son, Ted, to create a story about the photographer. The forthcoming exhibition will take place at the Wolfsonian-Florida International University in Miami Beach.The Mid-Atlantic Chapter of the Association for Public Artists (PA) has received a gift of ten works by twenty-four artists, including", "The next Biennial should take place in September 2021. The venue will be selected by an international panel comprising Nobuyuki Fujii, director of the Usui Museum of Fine Arts in Nagoya; Ugo Rondinone, director of the SFC Museum of Contemporary Art in Rome; and Ishizuka (Daichi Yamashiro) of the SFC Museum of Contemporary Art in Nagoya. \n\n\nThe public art center in the City of Las Vegas, which was slated to open last month, has been suspended while a thorough review of the facility is conducted. The world renowned art museum has been closed since March 10 due to the Covid-19 pandemic. The airport shuttered in March, and the Roman Westinghouse Electric Plant in the city’s desert near the Strip has also remained shuttered since March 20.The United States Centers for Disease Control and Prevention (CDC) said on Wednesday that the number of people infected with the highly contagious virus has dropped by half since the pandemic began, but that the virus may still be with us for another six weeks. According to Newsweek, the number of cases across the United States has reached 21,000; the highest number of cases in the country since", "The next Biennial should be a turn-of-the-century institution, which will be founded by the city of Barcelona and curated by the artist João de Camargo. The institution will be in the city of Barcelona, in the city of Barcelona São Paulo, and in the city of Piedras del Gallo in the north of Spain. The biennial will also include artists from around the world, including Hildegarde Duane, Ed Ruscha, Olaus von Königsberg, and the Dutch artist Piet Mondrian.“The venue for the next Biennial is Barcelona, Spain, and the city of Piedras del Gallo in the north of Spain,” de Camargo said. “It is an honor to be contributing to the legacy of this amazing city and to be able to create a new exhibit, where young and old, from the city of Barcelona, can enjoy the work of these artists in an entirely new way.” \n\n\nThe British artist Helen Cammock, whose colorful, often comic and often surreal installations explored the boundaries of black and white, died on August 25 at age seventy-two. Cammock’s work, which often overlapped conceptualism and", "The next Biennial should be held at an open-air museum in the southern city of Taichung, China, in December 2021. The theme of the exhibition is “Sensuality, Morality, and Consciousness”.“This is the year of the ancient Chinese concept of the world as the living organism of which we are just a component,” said museum director and founder Tomi-Leung. “Biennials are a great opportunity to reflect on the world we live in and to cultivate the capacity to affect and shape change. We are excited by the prospect of exhibiting the latest works by artists in museums at a level of international innovation.”\n\n\nThe National Gallery in London has announced that it will donate $10 million over the course of five years to a number of causes, including the Black Lives Matter movement, the Campaign Against Racism and Extremism, and the Prison Advocacy Network (PAWN). Inaugurating the initiative are exhibitions on Black and African heritage and artists such as Sheila Hill, Njideka Akunyili, and Koenig Ooi, as well as a series of books, artworks, and scholarships.The funds will support curatorial projects that will engage with the", "The next Biennial should take place in 2021, when Biennale Barcelona will be reopening after a major renovation completed last year. While the event will remain open to the public as usual, its programming will be substantially different, according to organizers. “The new arrangement will allow us to continue to develop a fully immersive experience for our visitors, with an extra dimension of cooperation between the installation and the exhibition, as well as develop innovative ways of supporting artists and exhibitions in the city,” Vincent Bayle, president of the Biennale de Barcelona and president of the Biennale de Lyon, said.Beyond the changes that have been made to the exhibition, the Biennale of Madeira, which opened in 1922, and the Biennale de Vienna, which opened in January 2015, the festival’s new format will introduce a number of new elements. For the first time, the main event will be a “triennial” rather than a “special event.” The biennial of Shakespeare will also move to a different location and will be hosted in Los Angeles, and the event will be livestreamed. The biennial of Egyptian art, which has a new location and will be staged in Cairo, will only be", "The next Biennial should be in January 2020, when the museum will celebrate its fiftieth anniversary. \n\n\nThe Metropolitan Museum of Art in New York has announced that it will no longer honor the late president Bernardine Dohrn, the board chair of the Met, and the chair of the board of trustees of the American Institute of Art (AIA), through a system that has seen its board members charged with establishing its future vision in an art museum. “The board of trustees has made its decision after careful consideration, and we are disappointed that we have not yet been able to come to an agreement,” said Museum Executive Director Andrew Metcalfe. “We believe the AIA’s current board position provides a path forward that is more in line with the board’s vision than the board’s current leadership. We are grateful for their willingness to take on this important role in our search for a new chair, and we hope that this decision will result in a better future for the museum, AIA, and the board of trustees.”In a statement, the museum said: “Although our board has not yet discussed this topic publicly, when the time comes to make a decision on", "The next Biennial should be held in 2019.\n\n\nAn exhibition dedicated to the work of American sculptor Frank Gehry at the Hammer Museum in Boston has been cancelled amid a dispute over whether the institution violated the “100 Year Celebration” set of traditions. The show was supposed to open on July 25 but was pushed back several times, and now the museum is trying to settle the controversy once and for all.The dispute began in April when curator Michael Stipe tweeted a question about whether the biennial should cancel Gehry’s work Fashion’s Body, 2028, because it was “100 years too soon.” In response, American Federation of Arts president Joanne Taggart responded by saying, “We chose not to make a binding decision in response to the question’s.”The biennial’s new director, Michelle McNamara, took issue with Stipe’s question, which she said was “stigmatizing.” She said that the museum would “have taken the question much differently if we had been asked.” She also said that the decision to cancel the show was made in “particular” to avoid �", "The next Biennial should be held in 2021 and will be hosted by the Museen de Kassel in Germany. The full list of participating artists is as follows:Amitronautik Galerie, Aga Khan Gallery, Alberto Cipolletta, Alberto Facuolo, Monumento di Cineria, Ostovino, ItalyAmitronautik Galerie, Alain de Bont, Sara Kornbluth Gallery, Rebecca L. Shipper, Kathrin Werth, Max Hetzler, Band,Corbis, T.S. Gourev, Galta, RussiaCrematorium Type, Rome, ItalyJhiya Dargavg, JapanAnchorage Contemporary, Anchorage, AlaskaAmanpour Duran, 1988, El SalvadorAnchorage Contemporary, Alaska, 1995, Azizia Farah, Azizia Farah, NigeriaAmanpour Duran, 1988, AlgeriaAmanpour Duran, 1988, BelgiumAmbiente y Ambiente, Lima, PeruBienal de Buenos Aires, Buenos Aires, ArgentinaBienal de New York,", "The next Biennial should take place at the Artemisia Museum, in Rome, in March 2021. An exhibition of the artist’s work will also open at the Museo Galileo in Florence in February 2021.\n\n\nThe critically acclaimed contemporary art fair TTI Berlin, which ran from March 14 to March 17, has announced that it will suspend its March Madness-style event, which was held in the summer of 2020, until the issue of Germany’s migrant crisis is resolved. The decision was made after the Bavarian government promised to take in approximately one hundred thousand refugees and migrants from the three countries—Germany, Austria, and Austria–Hungary—as part of a comprehensive plan to stem the migrant tide. “We are extremely concerned about the future of the national art fair in Berlin and the city of Berlin,” said Armin Lasvignes, the next Berlin Biennial’s director. “The city’s cultural heritage is being threatened, and this is a very serious matter for the city authorities. We therefore decided to postpone the first edition of TTI Berlin, as planned, until the autumn. I hope this decision will allow the city and the state of Berlin to focus in the coming months", "The next Biennial should focus on the role of cinema in providing a social and cultural outlet for a generation of youth, with an international cast of rotating curators. The Sundance Film Festival will remain in place, with events taking place throughout the United States and throughout the world. The biennial will run in conjunction with the 2015 edition of the Academy Awards, which will be held during this time. The changeover was made in an attempt to “reset” the festival, but critics and festival organizers expressed concern about what this would mean for the future of Sundance. “I’m not sure what this means for the future of Sundance.” The move comes amid an ongoing effort to modernize the festival, which was founded as an offshoot of the Sundance Classic. The revamped event will introduce a larger budget, relocate the awards, and shift the programming to accommodate cultural events that may never have been staged at the festival site.It also comes a few weeks after the festival announced it will no longer participate in the annual IMG Fashion Awards. The move follows the discontinuation of IMG New York City, the inaugural model for the new event, and the departure of director Andrew Kreps, who joined Disney in 2018. The", "The next Biennial should be held at the Museum of Modern Art in New York in January 2020. \n\n\n\n\nAlexandra Tito, director of the Asian Art Museum, and her staff, including David M. Brown, were sentenced to seven years and ten months in prison for their role in a conspiracy to defraud the museum out of more than $1.5 million.Brown and Tito were arrested in December 2018 and accused of conspiring to defraud the institution out of $4.5 million, which they allegedly used to pay off their own personal and others' prison sentences. The pair were found guilty of two counts of wire fraud and one count of conspiracy to defraud in March 2019. The jury also found them guilty of two counts of false statements to the Federal Trade Commission and one count of making a false statement to the F.T.C.The verdict resulted from a six-month investigation led by the New York attorney general and the New York City comptroller after two whistleblowers filed a complaint with the commission in February 2019. According to the New York Times, the whistleblowers alleged that the museum withheld information from the commission about the renovation of the institution—the Smithsonian’s original home since its founding in 1877—and that scientists were", "The next Biennial should be held in Los Angeles in 2022. The first show in New York was in 1991. \n\n\nA new exhibition is currently on view at the Museum of the City of New York through November 25. Titled “Painting in the City,” the show is organized by artist Nari Ward and will showcase fifty works by twenty-eight artists from Los Angeles County. The exhibition is organized around the idea that, historically, the city of Los Angeles has been a center for painting.“Painting in the City” is organized as a three-dimensional map of the city, which depicts the art of painting as a continuous engine of creativity and innovation. The work will feature the work of thirty-six artists, including Robert Irwin, John Gay, Rachel Whiteread, and Jean-Michel Basquiat. Ward’s work follows the lead of artists such as Isamu Noguchi, Ellsworth Kelly, and Frank Gehry.“Over the past forty years, the Museum of Modern Art has become a model for how a museum can be conceived, built, and operated,” said Ward. “Nari Ward’s work is a clear, detailed illustration of", "The next Biennial should take place in the autumn of 2020, in time for the Chinese New Year celebrations.  The exhibition will be organized in the same manner as that of the United Kingdom and the United States, with the following key differences: “We will present the full range of revolutionary art of the twentieth century, using only the most important contemporary works,” the organizers said. “Museum exhibitions will not only be participatory, but they will be intellectually stimulating and will be based on real research and scholarship.”In the autumn of 2020, the organizers said that the exhibition “will be focused on the history of contemporary art in China, focusing on individuals and institutions, and will appear in the exhibition as the exhibition unfolds.”Art critic and curator Ron Chernow of the American Contemporary Art Fair in New York and the visual arts site Trellis Foundation in New York have announced their support of the exhibition.“If we don’t act now, we’ll see a catastrophe looming,” said Chernow, who serves as associate curator of American Art at the Los Angeles County Museum of Art. “We need to act now.”Since the exhibition is currently on view in the", "The next Biennial should take place at the National Art Center in Athens (the institution is currently closed because of the Covid-19 pandemic). Artforum has reached out to the National Gallery of Art for a comment.\n\n\nAs authorities across the United Kingdom continue to implement temporary shutdowns, restrict public travel, and restrict gatherings and demonstrations, the exhibition-going public is being urged to reschedule. “We must act now,” said Richard Price, director of the Institute of Contemporary Art, London.  “The public is being urged to plan ahead for when they are realistically not able to visit all of their favourite galleries and museums, and when many galleries will be closed indefinitely. The best way to help mitigate the impact of Covid-19 is to plan for a disruption in the way they access and use art. The Institute of Contemporary Art is advising people to plan ahead by keeping a close eye on their local government and museums’ online activities, by checking the schedules and by following public reminders on Twitter and Instagram. “We must act now,” said Richard Price, director of the Institute of Contemporary Art, London. \n\nFollowing the initial lockdown on March 19, London’s Tate Modern has", "The next Biennial should be up and running by the end of the year, with an end date of February 26, 2020. To view the upcoming exhibition click here.  To view the previous exhibition click here.\n\n\nThe National Endowment for the Arts (NEA) announced today that it is awarding $6.5 million in grants and loans to organizations working to preserve and restore historic structures in the United States. The grants and loans will support the preservation and restoration of historic structures in cities, counties, and states across the United States. The NEA also announced that it is awarding $500,000 in grants and $250,000 in loans to local, state, and federal governments to help them preserve and restore historic structures. The grants are targeted toward preservation and restoration projects in the greater Pittsburgh metropolitan area, as well as in the Allegheny Mountains, the Allegheny River Valley, and surrounding areas.Federal, state, and local governments are eligible to apply for up to $3 million for preservation projects; up to $2 million for regeneration projects; and up to $500,000 for transformative projects. Voluntary donors can apply by January 31, 2020. Grant recipients will have 60", "The next Biennial should be held in 2021. “I would like to see more voices in the exhibits given the education of the exhibition, and I would like to see the work more embodied in an urban setting,” Kazutani-Kojima told the Art Newspaper. She added that the Biennial “should be a source of inspiration and a way of appreciating art, not just for the art itself, but for the culture of art in general.”\n\n\nHiroko Iwasaki and Satoru Yamada have been chosen to represent Japan at the Fifty-Ninth Venice Biennale, opening September 25 to September 28. The pair will collaborate on an exhibition centered around Japanese literature, cinema, and sculpture, entitled Tokyo Stories. The show is being organized by Tokyo-based artist and curator Miki Aoki.“In 2018, Iwasaki and Yamada, together with a team led by Miki Aoki, curated an exhibition in Tokyo. The show ‘Tokyo Stories’ was a response to the current political situation in Japan, and to the future of literature and cinema,” said Iwasaki. The program will focus on the stories of twelve Japanese writers, including", "The next Biennial should be in the autumn.”The exhibition will feature works by more than seventy artists, including Marta di Monte, Delphine Gerber, Hasan Gaure, Nari Warda, Nia Watts, Marianne Nygård, and Kiki Smith, and will run from September 23 to October 10. The biennial’s next edition will be hosted by the government-supported museum in the city of Bologna, Italy.\n\n\nThe Carnegie Museum of Art in Pittsburgh, the University of Pennsylvania, and other local arts agencies are teaming up to create a new way for museums to support Pittsburgh’s arts. The Metropolitan Museum of Art, the Carnegie Art Museum, the Metropolitan Museum of Art, the Widener Art Museum, the Pennsylvania Academy of Fine Arts, and the Institute of Contemporary Art in San Francisco have all pledged to raise $50 million to improve the environmental health of their campuses through the recycling of stormwater and wastewater, and to redevelop their urban settings.The organizations will collaborate to design and build new green spaces on the museum’s campus that will collect stormwater runoff and reuse it for arts and education, and to install solar panels on the museum’s building in order to", "The next Biennial should be held at the\n\nMonument to the Future. We intend to use the opportunity to further our work in making the museum\n\na truly international museum. The committee representing the fifty-three participating museums will\n\nbe chaired by  Caroline Kemp, director of the Metropolitan Museum of Art; Adrian Piper, director of the Carnegie Museum of Art; Kenneth Vincent Price, president of the Museum of Modern Art, and executive director of the Association of Contemporary Art Museum Directors; and Moya M. Pilar, president of the National Association of Museum Directors.Each institution will receive $50,000 for the construction of a new building on the ground floor of the Met, designed by the Pritzker Architecture Prize winning architect Hui Chien and completed in 2015. The institution’s program director, Mariko Silver, said that the museum would also be able to sustainably reduce the carbon footprint of the project by utilizing locally-sourced materials. The museum will be powered by solar energy and will be able to hold approximately three hundred thousand visitors.\n\n\nThe British photographer David Hockney died on February 17 at age seventy-eight at his home in London from cancer. He was one", "The next Biennial should be held in the spring of 2021. The reputedly historic exhibition, which previously had no director, will now be run by the architecture firm outside of London. It will also include a new project on the history of the library, a new exhibition on the civil war in Korea, and a reimagined, seven-thousand-piece monument to the city of New York.According to the New York Times, the new partnership comes after a year and a half of negotiations between the two organizations, which began in February 2019. After a period of nearly a year, the two organizations finally reached an agreement. According to the New York Times:The competition between the two organizations began when the Korean state tried to evict two hundred North Korean refugees from a hotel in the capital city of Seoul. The hotel was converted into a temporary residence for the refugees, who were forced to sleep in special bunkers during their move. The citizens of Seoul had the option of staying at the luxury hotel or staying at the Seoul Metropolitan Government building. The residents of the hotel decided to stay at the government residence in order to protest the move.Upon learning of the hotel’s new location, the citizens of Seoul protested against the move, and the government withdrew its", "The next Biennial should aim to present a truly new and exciting exploration of the artist-centered history of the workshop. “Our vision for the three-hundredth edition is to celebrate the contemporary and encourage the use of the workshop as a platform for artistic exchange, experimentation, and reflection,” said Stefan Beck, president of the Biennial Foundation. The first edition, which opened in September 2018, featured only one artist\u0097Nancy Reagan\u0097in its entirety. In the second event, “The Modern Workshop,” which was staged at the Kunsthalle Bern in November 2019, the artist-associated biennial was one of the first public events organized by the new institution. In a statement, the Biennale said that both the exhibition and the biennial “will continue to engage with contemporary ideas and developments through a variety of themes, disciplines, and historical moments.”\n\n\nThe London-based art distributor London-based art distributor Tate Modern has been accused of helping the Israeli government advance the construction of the Jewish state’s illegal settlements in the West Bank and has been ordered to pay more than $1 million in damages to the Palestinian Civil Society Union (PCU), the Palestinian Civil Society Movement (PC", "The next Biennial should take place at the Stedelijk Museum in Amsterdam in 2021. The exhibition will showcase the work of twenty-four artists, including Ron Garron, Ola and Angela Roesler, and Tanya and Olafur Eliasson.\n\n\nThe National Gallery in London has announced that it is working with the National Union of Journalists on a new contract for internships, which was not renewed last year. All of the institution’s permanent staff members will be able to see the outcome of the negotiations in February 2020, and the editorial staff will determine their futures through a new contract.“We wanted to extend the offer of an internship to all our staff, including those who had worked on the exhibition, but the decision to not renew internships was made on the basis of trust, not fear,” said show curator Nomaa Akram. “The National Gallery was hoping to create the most stimulating exhibition possible with unpaid internships, but thanks to the support of our colleagues, we are able to offer some of the most exciting and challenging exhibitions at the institution.”Commenting on the internship, Akram said: “We are really excited about this new opportunity to work full-time and to", "The next Biennial should focus on the history of the museum’s collection, its exhibitions and the collection of the institution’s staff. The event will also focus on the evolution of the institution into a museum that can host large-scale exhibitions, has an endowment of more than one billion dollars, and is capable of hosting over one hundred million visitors annually.\n\n\nThe British government has announced it is planning to provide $2 billion in aid to the cultural sector in the aftermath of the pandemic, an amount roughly equivalent to the $2 billion that the US government allocated to the arts in 2017. The sum was announced by Culture Secretary Maria Miller and will be divided between the UK’s National Endowment for the Arts (NER) and the UK’s Department for International Development (DfID).[1]The UK will divide the funds among nineteen UK-based creative agencies and organizations, including the Arts Council, the British Council, the Coachella Valley Music and Arts Festival, the Low Street Foundation, the Plymouth Art Gallery, and the Tate. The organizations will receive $1.2 billion; the National Poetry and Drama Festival, which has staged more than eleven hundred performances since it was founded in 1977, $730 million", "The next Biennial should take place in 2020. “It is my great hope and responsibility that the first Biennial for New Orleans will be as exciting and as effective as the first,” said Todras. The hope and responsibility that the first Biennial for New Orleans will be as exciting and as effective as the first,” said Todras. I’m so proud to be a part of the history of New Orleans. I’m so proud to be a part of the history of New Orleans.\n\nThe Sargent’s Daughters announced that the first edition of the Smithsonian’s Daughters of the American Revolution will take place in 2021. The fifty-ninth edition “will be dedicated to the female military, which has played an integral role in the nation’s history,” according to the organizers. The event will also include new scholarship and curatorial initiatives and will focus on the encyclopedic history of women’s military service.The twenty-fifth edition of the event, which will run concurrently with the upcoming Women’s March on Washington, will include a presentation of the new research by historian and scholar Catherine Whitaker on the", "The next Biennial should be organized in 2021.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Suzanne Cahn as its new senior curator of the American New Wave, a sub-genre of contemporary art that developed in the 1930s and 1940s. She succeeds Marianne Ebony-Hopper, who has helmed the museum for more than twenty years.“Cahn’s work explores the relationships between artists whose practice combines space, transference, and performance with artists who are considered as having been influenced by their work,” said Marc Glimcher, the museum’s director and chief curator. “Her curatorial approach to the American New Wave will serve as a valuable asset for our international exploration of artists’ work, and invite us to think not only about the identity of the work, but about how such work can be presented as art.”Prior to joining the museum as director in 2008, Cahn was a curatorial fellow at the Whitney Museum of American Art in New York. She has also taught at the University of California, Los Angeles, the University of Nebraska, the University of Pennsylvania, the Massachusetts Institute of Technology, and the University of California, Berkeley.Commenting on", "The next Biennial should take place in 2022. In a letter dated March 14, the Swiss architects wrote: “We have received your invitation to the next Biennial. We are eager to participate in its construction and to make a contribution to its development. The project is a lifelong project, which involves a lifetime of collaboration between us and the artists who have created it.”The invitation continued: “I want to emphasize that the project of the new Biennial is a milestone in the creative history of Switzerland. It is a game changer in terms of the intellectual content and the institutional possibilities. For years it has been possible to take a few artistic objects, put them together in your own space and have them appear in a large museum, but now it is possible to make an object that appears in the museum and one that appears in the sky. We are all ready to participate in the next Biennial. The Biennial is only the beginning. The whole project is still ongoing, and when the trip is over, the work will be stored in the archive.” The exhibition will be on view in the exhibition hall of the Museum of Contemporary Art Zurich until November 22, 2022. \n\n\nAt the Pulitzer Museum of Art in New York on", "The next Biennial should be held in the spring of 2020, with the aim of giving the public a new perspective on Japanese art and architecture. The show will involve the presentation of a number of new exhibitions, including the first public exhibitions of work by male and female artists in the country, and will be staged at various venues including Tate Britain, the National Museum of Japan, and the Tokyo History Museum.\n\n\nThe Florida Museum of Fine Arts (FMA) in Gainesville has received a gift of twenty-six works by the late Venezuelan artist Marcel Proust. The donation, made in the community of New Bessborough, Florida, came from artist-activist and philanthropist Nelva Mosqueda—a longtime supporter of the FMA who had the authority to direct its board of directors—who also gifted the institution the works of Pablo Picasso, Jean-Luc Simenon, and Edvard Munch, among others.“The gift is a great honor and an incredible relief to the FMA board of directors as we look forward to welcoming our new visitors and returning the works of the great Marcel Proust and Pablo Picasso to Gainesville in the near future,” said board chair Mimi L. Vasquez.", "The next Biennial should be held in 2020, with the exhibition marking the fifteenth anniversary of the work. The exhibition will include works by David H. Gernon, A.A. Currier, John Currin, Anish Kapoor, Paul Mpagi Sepuya & Sons, M.A.R. Ben Huyghe, C.F. Nkila, T.A.T.N.E.R., T.J. Taar, and V.A. Nwanda. The 2020 edition will be hosted by the Art Gallery at the University of Cape Town (UCT), and will be led by the artist-in-residence, the Dr. Pinnochi, who will be accompanied by Kara Swisher, Sally Kohn, and Kazuko Kayode.\n\n\nThe Koenig-Winkelmann Foundation for Contemporary Art (KWCA) in Berlin has announced that its $156,000 prize for best-selling art will go to art historian J. C. Leybaumer for his exquisite, five-dimensionalÂ work The Yellow Wallpaper, 2019. The work, which was", "The next Biennial should be held in the Fall of 2020.\n\n\nA group of French artists have won the right to create a new work for the forty-fifth edition of the Museum du Palais d'Or in Paris. The exhibition will be titled Solaire et Solaire d'Arles (Sols and Roses and Roses of Arles). The work will be based on a poem by the late French artist Henri Rousseau.The group of artists, who include Laurent Berthuis, Alain Guiraud, and Nathalie Henein, have created a series of images that capture the vibrant colors of roses and the woodland. The work was selected by a vote of the Institut Pasteur de Lyon, chaired by the artist Pascal Huyghe, and will open in Paris on September 18.The work was chosen from a shortlist that included Olivier Castéra, Pierre-Auguste Renoir, and Jacques Huyghe. The others were the French artist Jules Bianchi, the Belgian artist Magdalene de Berthuis, the British artist Graham Atkins, and the artist and activist Charles Saatchi.The 2020 edition of the museum’s annual Solaire and Sol", "The next Biennial should start in November 2019. The museum will offer the first in-person exhibition of the exhibition, “The Greatest Show on Earth,” at the same time as the biennial. The exhibition will include more than 250 drawings and sculptures by forty-four artists.\n\n\nThe National Geographic Society, the mid-Atlantic arts and culture nonprofit, is launching a new $500,000 endowment in memory of Andy Warhol. The fund will be used to establish a permanent Warhol–designed sculpture at the Smithsonian American Art Museum in Washington, DC. Titled Warhol’s Lasting Impact, the sculpture, which will sit in the museum’s public space, will commemorate the American artist’s forty-six-year career. “Andy was a true friend and champion of American art and of the art of the American West,” said Maria B. Corrigan, president and CEO of the National Geographic Society and the National Geographic Society. “I’m so proud to have supported his work and to have been able to contribute to his legacy.”The gift, made in honor of the artist’s legacy, was made in support of the ", "The next Biennial should mark the occasion of the 150th anniversary of the publication of the work of the late French architect Dietrich Hahn, which will take place in the former Prussian State Museum in Berlin in 2020.\n\n\nThe Library of Congress announced today that it plans to establish a new digital platform that will allow the public to access the holdings of the Library of Congress. The innovative initiative, called the Digital Collections Initiative, will allow researchers to build online collections of objects from the collection by experts, organizations, and individuals through a process that will be similar to the way that the Library of Congress acquired the works.“For more than three decades, the Library of Congress has been innovating and innovating to better serve its collection and make it an even more important resource for communities,” said Paul M. Browne, the Library of Congress’s chief archivist and chair of the board of trustees. “We’re committed to continually evolving in the service of our communities and our mission, and now more than ever the Library of Congress’s collection is a wonderful example of that. I’m excited to see how this new platform will empower researchers and help us better understand the history of our collections.”\n\n\n", "The next Biennial should be held in 2020.In an editorial published by Artnet News, biennial director Rachel Chiu‐Tsuk said: “The most recent work by the artist, and the most recent exhibition, both represent phenomenal advances in the field of painting. Both were created with talent, expertise, and vision. The next iteration will not only embrace the artist’s principles, but will also reflect the artist’s ideals.”The exhibition will be organized in conjunction with the biennial’s fifty-fifth anniversary. The exhibition’s opening reception will take place at the Art Institute of Chicago (ICA), in Chicago, on October 11.\n\n \n\nColectiva del Barrio has announced its representation of Mike Kelley, the South Los Angeles–based, American painter, sculptor, and educator whose body of work represents an artist’s entire legacy. Kelley has been represented by the New York–based gallery Colectiva del Barrio for two decades, through its first exhibition, “Michael Kelley: Beyond Modern Life” (2019), at the Museum of Modern Art. Kelley’s other works include “Gangnam Style” (2015), an abstract sculpture in", "The next Biennial should be held in 2019, and this year’s exhibition will feature work by artists such as Diana Al-Hadid, Elsa Albano, and Chandler Ackermann.\n\n\nThe Maryland Institute College of Art (MICA) in Baltimore and the University of Maryland, College Park, have partnered to create the first museum exhibitions that will address the historical presence of the ancient Roman town of Pompeii, a UNESCO World Heritage site in the city’s Potomac River, in the United States.The $500,000 local art project, “Pompeii: The Muse,” will highlight the work of the MICA’s talented curatorial team and will be organized as part of the institution’s forthcoming tour de force “Museum of Art in America” (MAA) exhibition, which will open in 2021. Inaugurating the project is a new online education platform, which will allow visitors to experience the exhibition in real-time, which will be on display in the museum’s Pompeii Garden.Commenting on the exhibition, MICA director Robert Bovey said: “The MICA Pompeii: The Muse will be", "The next Biennial should be held in the fall of 2020, and the first will be held in the spring of 2021. The dates and locations of the upcoming exhibitions will remain the same. “The Biennial is an instrument of cultural exchange and solidarity, of dialogue and collaboration, of reflection and celebration, of reflection and contemplation, of contemplation and contemplation, of reflection and contemplation, of reflection and contemplation.”\n\n\nA group of artists and activists have created a new digital platform to expose mass incarceration in the United States through a collection of artworks that include portraits of Black and Indigenous artists and activists, as well as scenes from popular culture such as TV shows, movies, films and television shows, YouTube videos, and songs.The new show, called “Dark Carnival,” will debut on the site Artnet in the coming weeks and is organized by artists Rachael Armstrong and Gabrielle Taveras and their group P.A.I.N. (Prescription Addiction Intervention Now) to draw attention to the political, economic, and racial inequities that are created by the nation’s addiction epidemic.“This work comes at a time when it is becoming increasingly clear that our current policies and strategies for combating addiction will", "The next Biennial should be held in the first half of 2021. The venue will be reconfigured to accommodate twenty-one artists ranging from the UK and the US, South Africa and the US, and China and Japan.The 2017 edition “was not without its flaws,” Sir David Adjay, chair of the Biennial’s advisory committee, told BBC, “but it was an ambitious and provocative exhibition, that in a way gave the Biennial a new identity.”\n\n\nMore than 1,500 academics and researchers have signed a letter demanding that the British government cease funding to the Royal Shakespeare Company (RSC), the London, United Kingdom-based nonprofit artistic organization founded by playwright William Shakespeare in 1972.The letter, which was written by academics from across the United Kingdom, argues that “RSC’s annual income from the Royal Shakespeare Company is in an extremely precarious position as a consequence of the loss of income from the Royal Shakespeare Company.”The collection, which comprises four of Shakespeare’s plays and three of his indirect creations—Hamlet, Othello, and Julius Caesar—has been at the center of a legal battle between the RSC and the government since February. The", "The next Biennial should open in 2023. The venue will be moved from its current home in the Bowersy Architecture Museum to the Exhibition Building, and will inaugurate the twenty-second edition of the Biennial. Banderas is also working to establish a new wing of the Museum of Contemporary Art Los Angeles, which will comprise the exhibition space the Contemporary Arts Center, and will launch a new, year-round art program.\n\n\nThe National Poetry Library in Washington, DC, is launching a new online collection of over 1,600 poems that are openly online only to be digitized and released on CD. Titled The Digital Archive of Poetry, the initiative will offer visitors the opportunity to download a selection of the poems, which were previously only available through the institution, for free to read online. “Over the last fifteen years, UCLA Poetry has worked to create a digital archive of poetry,” Sarah Macaluso, the director of the library, said. “The Digital Archive of Poetry is an extension of that work. It will make the collection even more accessible to students, scholars, and the general public.”The archive will be organized in several ways, including through the collection", "The next Biennial should be held at the institution in 2020. If all goes according to plan, the redesigned venue will welcome visitors in 2020. Commenting on the renovation, Konstantin Schubert, director of the Biennial Institute, said: “We have taken to heart the lessons learned from previous years and have made some important improvements. The new exhibits will be of great value for our visitors, both during their stay and as an opportunity for them to return to the museum for another visit.”Titled “Les Demoiselles d’Arles: Avant-Garde in Architecture” and organized by the archiv für Bundesarchiv, the biennial will celebrate the work of more than 1,000 artists and will be led by a committee made up of the director of cultural affairs, the director of architecture, the director of curatorial affairs, the curator of art, and a curator of modern art. The other cochairs are Muriel Klint, the director of the Kunsthalle Basel; Harald and Beatrice Breiten, the head of the Staatliche Kunstverein Frankfurt; and Jan-Olivier Clavar, the designers of the New Art", "The next Biennial should take place in the city in 2022. If all goes according to plan, the first exhibition of the new works will open in the city’s St. Andrew’s Church in 2019. The new James Turrell Sculpture Garden is expected to open in 2020. The new Sutton and Vincent Price Sculpture Garden in Sutton Place, London, will open in 2021 and the Sutton and Vincent Price Sculpture Garden in Sutton Place will open in 2022. The new Sutton and Vincent Price Sculpture Garden in Sutton Place will be inaugurated by a new work by Mark Rothko and will be inaugurated by a live performance of a work by the same artist. The Sutton and Vincent Price Sculpture Garden and Tate in London will remain open through March 15.The new sculpture gardens, which were commissioned by the architects from a list of twenty-five artists, will be inaugurated by a new installation of Paul Gauguin’s The Fifth Element. The work will be part of the first “Phase One” of the new exhibition, “The Beginning.” “The Fifth Element” is a new selection of new work on paper, photographs, drawings, collages", "The next Biennial should be held in 2020. In the meantime, the museum is planning to introduce new exhibitions, describes the current exhibition program as being “inadequate and currently facing a structural crisis.” The museum is currently working on identifying a new director and is seeking board, curator, and artist input on the selection process. The museum will also soon open a new branch of the museum in the capital, Helsinki, with the aim of supporting the institution’s work in the country and developing a new collection. Inaugurating the new museum will be the opening of the museum’s first exhibition dedicated to the late artist H. M. Guggenheim in 2020.\n\n\nThe British Museum in London and the Museum of Liverpool have reached an agreement that will see the building of the institution’s new headquarters in the city’s St Pauls Place, home to the work of more than 2,500 contemporary artists, including Mapplethorpe, Grisar, Norman Foster, Frank Gehry, and Richard Bevan. The new building, which will comprise 12,500 square feet of exhibition space, will also host a series of public events and will boast a museum-quality capacity for more than", "The next Biennial should be held in 2021. \nThe National Gallery of Art in Washington, DC, has announced its representation of the Korean artist Park Kwang-kyeong, whose famously seductive paintings and drawings are often juxtaposed with her own life. The exhibition will include works by the Korean artist and will focus on the theme, “Do not pursue the same loves in isolation.”Park was born in Seoul in 1964 and raised in the coastal city of Sadao, north of Seoul. In 1984, after she won the grand prize at the Venice Biennale, she moved to Seoul to study photography at Nara. By 1986, she began painting at the National Museum of Art in Seoul, and in 2003, she was awarded the National Agency Award.In 2004, she was selected for a National Book Award for the Korean literature and her work was included in the sixteenth edition of the Seoul Art Biennale, but the event was cancelled due to the outbreak of the SARS epidemic.Park returned to Nara in 2010, and in 2018, an exhibition titled “Korea: Painter, Activist, Dreamer” was staged at the museum. The exhibition included paintings, drawings, photographs, and installations by thirty", "The next Biennial should take place in September 2020. While the newly appointed chair of the Arts Department, Naima J. Manoo, expressed some optimism about the project, she cautioned that the museum was still in the \"early stages.\" The first festival, entitled The Selenium, will be hosted in 2019.\n\n\nThe Curator’s Alliance of the Americas (CAA) has announced that it will not renew the contract of Jean-Michel Basquiat’s collaborator, the University of Minnesota’s Richard Mayhew, who curated the 1976 exhibition “The Surrealist” with him. Artnet reports that the decision was made following months of negotiations between the CAA and the artist’s representatives, led by New York–based attorney Peter Alexander.“We were always committed to supporting the work of the distinguished partner that was Jean-Michel Basquiat,” said CAA president and CEO Margot Sarnoff. “In an age of ever-greater polarization between art and politics, it is a shame that this collaboration will not continue. At the same time, it is an honor that this production will continue with our extraordinary team. We recognize that the show has profound artistic", "The next Biennial should focus on the theme of the exhibition: “Tradition, Politics, and the Crisis of the Modern World.” The 2015 exhibition opened on February 5, with the show “Fashion’s Future: Fashion and the Crisis of the Modern World.” The exhibition will be a collaboration between the Museum and the Konrad Adenauer Foundation in Rügenstrasse, and will showcase two hundred works by twenty-one artists. The first exhibition will open on November 24 through the famous Rügenstrasse gallery. The second retrospective will open on November 28 at the Institute of Contemporary Art, Kunst Stiftung Karlsruhe.\n\n\nThe Anne Frank House in Amsterdam and the city of Maastricht have announced that they have reached an agreement to host a new exhibition, “The Diagnosis,” at the museum in the spring of 2021.The initiative will consist of a series of interviews with leading experts in the field of mental health and will be curated by the Dutch writer Anne Frank, whose diary is housed in the museum. The exhibit will focus on issues of mental health and the psychiatric disease schizophrenia. The show will mark the 70th anniversary of the institution, which", "The next Biennial should be held in May 2020. The 2019 event, “After the Fall,” was conceived as a collaborative project between the artist-run platform Artforum and the New York–based nonprofit ASAP. The exhibition was curated by artist Ai Weiwei and featured works by more than seventy artists. “I am so excited to collaborate with Ai Weiwei and ASAP,” said Dave Hakstenson, director of Arts in Distress. “The next Biennial will be a kind of ongoing reflection on the history of art and the life and memory of the artist.”The 2019 event, “Ai Weiwei: The Art and Art History of the Circular Sun,” was organized by Chris Box, the founder and director of Artforum, and the Shelley and James Turrell Foundation, and was curated by poet-sender Diana Paul; the artist-run space LACMA; and the David Burton Foundation. The 2019 event, “Ai Weiwei, ’ The Art of the Circular Sun,” is on view in the exhibition “Ai Weiwei: The Art of the Circular Sun” in the Rockefeller Center through March", "The next Biennial should be dedicated exclusively to the study of the popular painters José and Ana Mendieta and Ana Navarro, whose seminal works, with their carefully curated, individually crafted works, offer a crucial insight into the process of painting and sculpture. The exhibition will be organized as follows:Omar Barozzi, author of Un área di Desierto (2003–2007) and The Art of Painting (2007–2009)Artists of the Past: Between the Years of Berlioz and Copán di Sotto (2009–2010)Pilarba Mota, The Sister, 2008Oscar Moro, The Sister, 2008Olivier Pica, The Collage, 2009Oscar Portoguerâs, The Empty Space, 2009Oscar Turvey, Mira Bassi, The Burden, 2009Omar Valverde, The Artist in Exile, 2009Olivier-Ingrid van der Walt, The Boy and the Girl, 2007Featuring works by Clement Fernandes, Jody Rogac, and Robyn Sohr, the exhibition will run from September 10 to November 25 and will feature more than 120 works from the collection and will be held in the galleries of the Bi", "The next Biennial should take place in 2020, but by then the exhibition will have already changed, with the line-up of works and its exhibition schedule set to be announced. “We want to invite all of our artists to participate in the next Biennial,” said Alice Ashworth, director of the exhibition. “It is a new project that we are developing together with our collaborators and it is an opportunity to collaborate with another artist. We are pleased to have the opportunity to collaborate in this way and to have the opportunity to see the exhibition in its new shape. We hope that the work of all the artists in the forthcoming exhibition will be of a significant and engaging quality and that it will be a celebration of the platform that has been so critical to the development of contemporary art.”The next exhibition will be held at the Biennial’s new home at 80 Bishops St., the arts complex currently housed within the exhibition space of the Metropolitan Museum of Art in New York. The theme “The Present, ‘present,’ will be ‘An X-Acto,’ which will conceptualize the range of structures, their interconnections, and their functioning, from the current exhibition and the series,", "The next Biennial should be held in 2021, with a budget of $13 million.The competition, which is directed by director Yuki Kondo, is being organized by the Tokyo Foundation for the Arts (TFE), and is supported by the Foundation for Contemporary Art Japan. The forum will host biennial entries by a limited selection of artists, selected mostly based on their avant-garde or experimental practices, and will organize artist residencies and student exhibitions. The theme for the exhibition will be “Mediators of Modern Life” and will be chosen by a three-person panel comprising Lilya; Katsuya Kondo, director of the Tokyo Foundation for the Arts; Takashi Ihara, director of the Exhibitionist Agency in Tokyo; and Satoru Iwai, chair of the exhibition committee.Commenting on the biennial, Kondo said: “I have been working on a platform for several years to encourage the exhibition of contemporary artists. I hope this year’s exhibition will be a game changer” In the exhibition, the exhibition will feature work by twenty artists over the course of a single year. Kondo added that the theme of the exhibition", "The next Biennial should take place at the New Museum in New York in 2021. Featuring the work of eighty artists, including Gerhard Richter, James Turrell, Léon Khoury, Günther von König, Sébastien Loter, Pia Camille, Leonor Cotta, and Adrienne Atget, the exhibition is slated to run from November 21 to January 3, 2021.  \n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Valerie DiPasquale as its next executive director. DiPasquale, who has brought an innovative and encyclopedic understanding of art history to the institution, will be responsible for the development, articulation, and interpretation of the organization’s programming. She succeeds Matt Stern, who retired from the helm of the museum last May after seventeen years.“The Guggenheim Museum has been and remains at the forefront of the movement to understand and appreciate art history through its collection and exhibitions and has been a model for future generations of curators, scholars, and art-historians,” said Guggenheim senior curator Audrey Ser", "The next Biennial should take place in 2022.  The sponsors, Art Basel and the Arts Miami Beach, have announced that the event will be held at the Contemporary Art Museum Miami on July 23–July 28. The venue will be inaugurated by the opening of The Intentional, a 2012 exhibition of work by artists such as João Prado, Matisse, and Ingvild. The next edition of the Biennial will take place at the Blue Ridge Mountains National Park in Virginia in 2020.  Boston. There are currently no plans to hold a biennial in Boston.  Canada. The Montreal Museum of Fine Arts (MoFA) has announced that it plans to hold a biennial in 2021.  Cameroon. The first twenty-five years of the twenty-fifth biennial will be devoted to African American artists, with the remaining twenty-six years devoted to contemporary art, focusing on artists from across Africa. The theme of the 25th biennial is “The Body.” The theme of the event will be “The Body of Art.” Countries that have announced they will host biennials include Belgium (2019), France (2019), and the United", "The next Biennial should focus on “alternatives to globalization,” the year of the hijackings; “opportunities for youth, art and culture in rural and urban India; and the international refugee crisis.”The festival will also be held at a venue that will also host the annual exhibition of the works of independent New Delhi-based artists, the International Book Festival.The Kikkur Art Festival is a yearly event that has been held at the Kikkur Folk Art Museum, a former gold mine in central India, since it opened in 2011. Inaugurating the venue are readings by selected authors from a selection of works by Laxmi Bhagawat, Kishore Kothari, and Kannadiga Sasikally. The inaugural edition was held at the Kikkur Museum in 2017.The 2019 edition, which kicked off on December 5, saw the theme 'Royal Enmity,” a reference to the Hindu epics, the Mahabharata and the Bhagavad Gita. The event was attended by more than 2,000 artists and curators.\n\n\nThe Museum of Fine Arts (MFA) in New York has acquired the estate of the late American artist", "The next Biennial should also introduce a new educational initiative, a curator-run space, and new programs that celebrate the life and creative legacy of the late Dutch master Willem de Kooning. The commemorative exhibition “An exhibition of the seventeenth-century gothic master Guy de Maupassant” will be curated by August 9. The artist-in-residence at the Biennial will be announced shortly.The line for the Biennial has been expanded to include the full thirty-eight artists participating in the five-week event. \n\n\nThe Metropolitan Museum of Art in New York has received a gift of more than two hundred works by forty-five artists, including Thomas J. Schneider, Anna Atkins, Richard Black, Alighiero Campanella, Edwin C. Walls, and William Christian O’Leary, from a group that included Kim Hunter, Sabine Schroth, and Iris van Adel. The museum also revealed that it was the first major arts institution in the country to acquire works by artists from an artist’s home, an initiative that will continue this week with the closing of the exhibition “Love Will Save Us All.”While the museum has yet to announce the artists for", "The next Biennial should take place in 2020. \n\n\nThe Los Angeles County Museum of Art (LACMA), the Metropolitan Museum of Art, and the Museum of Modern Art (MoMA) in New York have announced their commitments to removing more than one hundred works from their collections that were part of a multiyear campaign that involved more than 15,000 people. The campaigns were part of “Theater of Operations: The Gulf Wars 1991–2011” (2016–17) and “Victory or Death?: Iraq and the Gulf Wars 2009–2011” (2017–18). Both works were part of a wider effort to address the U.S. presence in the region and to confront other major themes of the twenty-first century, including the economic and environmental crises in Syria, Iraq, and Yemen, as well as cultural heritage sites and institutions that were targeted in acts of violence and terrorism.In a letter sent to supporters on December 19, LACMA president Brad Bauman and Met director James Levine wrote: “We are deeply concerned about the work that was removed from our collection in the course of a single day. It is an outrage that such a crucial piece of modern American art has been lost to violence and destruction", "The next Biennial should include an exhibition of the work of the Biennale’s artists. The programme is also planning to move the exhibition from its current location in the Museo de Arte Contemporáneo (MAS), Madrid, to the CNE in Brussels. The contemporary art museum will also continue to operate under the brand Mas de Artes, as it has for more than sixty years in the city of Barcelona. The move will also see the museum change its name. The institution’s board of directors approved the change of name on March 3. “The changes we are making are not only to recognize our extraordinary history, but also to better reflect the diversity of the Catalan people,” Roberta Pollack, the president of the Biennale, told the Spanish daily newspaper ABC. “The new name will connect us with the best of contemporary art in the world.”In 2011, the institution organized a series of exhibitions, presentations, and concerts at the CNE, including “Thee in Black: Contemporary Art from the End of the World,” which was staged by the Catalan institution Cinéma and “Un stària de", "The next Biennial should take place in 2022. The exhibition will be hosted by the Museo de Arte Contemporáneo in Lisbon, the Museo Nacional Centro de Cultura São Paulo, and the Art Gallery to open in the city of Antioquia, Brazil, in January. “I had been thinking about a biennial for some time but never got around to making one,” artist and curator Kiko Panzano told the Art Newspaper. “When I joined the initiative in 2008, I was trying to create a project for the 2018 exhibition and was an assistant curator at the Museum of Modern Art in New York. In 2010, I coorganized the exhibition ‘Avant-Garde in the Age of Mass Media. ‘Stages of Production’ with a group of other artists. In 2011, I was the first to open the Makkah Biennial at the National Museum of Islam in Saudi Arabia, and in 2012, I moved to the Makkah Art Museum to work on the exhibition ‘Drawn to Daring’s Daughters.”\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) is temporarily closed until further notice because", "The next Biennial should be held in New Delhi in February 2021. While the theme of the biennial will be “Away from the screen,” it will be “showing the real face of the other.” The exhibition will include two new works by the artist and four new photographs.The exhibition “Tawfiq,” which is titled “the other in front of the screen” and will be on view from February 23 to March 11, 2022, will be hosted by the Government Art Gallery, New Delhi. It is also being curated by Professor Ravi Shankar, Director, Department of Arts and Culture, Mumbai.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has awarded $2.5 million to ten artists who have received grants from the Museum of Modern Art (MoMA) in the past five years. The grants are part of the museum’s $1 billion capital campaign to reinvigorate the museum’s collection and expand its exhibition and research program. The recipients are: LaToya Capshaw, the daughter of emigrant workers from Iran, who won the $500,000 Lifetime Achievement Award; Sarah Dessen, the mother of three", "The next Biennial should be held in 2020.  The central feature of the new exhibition will be a new collection of paintings that will be curated by the curators from the community in order to facilitate the exchange of ideas and ideas through art. “In an age when the art world is beset by ever-changing needs, there is a need to create new spaces for conversation and inspiration,” Mr. Dini said in a statement. “This new exhibition will serve as a great opportunity for us all to re-imagine art and how it might be enjoyed by a global community.”The exhibition will take up the themes of sustainability, art and design, art and culture, and art and the environment, as well as the ongoing debates about the role of art and culture in the contemporary world. The first Biennial will be held in Leipzig, Germany, in March 2021.\n\n\nThe Museum of Modern Art (MoMA) has announced the launch of two new initiatives designed to support the artists and collectors in its New York–based collection whose work is currently featured in the forthcoming exhibition “Exhibition: Contemporary Art,” which will open on October 8. The first initiative, “Paintings on", "The next Biennial should begin the month of March 2021 and have twelve (12) artists represented. Two (2) artists from the United Kingdom and two (2) South Americans. The pavilion will be inaugurated by an exhibition of work by one hundred (100) artists and non-commissioned artists.The Biennial will also incorporate new programming that celebrates and advances the work of emerging artists. In addition to the usual biennial exhibitions, the event will receive a digital platform that will focus on the exhibition and publication of new art, and will exhibit works that are at the forefront of social, political, and cultural change.The full list of participating artists is as follows: 7 OZALAND 1450 Executives Collective (Finland)1930s Artists Collective (Finland, New Zealand)1935 Artists Collective (Finland)1939 Artists Collective (Finland)1948 Artists Collective (Finland)Due to a severe air pollution problem in Japan, the exhibition has been pushed back until March 20. Rating: ★★★★★★Drawing, Painting, Sculpture, and Sculpture: Five Thousand Chinese Women, China’s First Collection, 1931–1949, by", "The next Biennial should be about forty years from now, and should address the questions of how we live together and whether we are part of a larger culture. It should also involve the production of works that examine questions of identity and identity politics. I can see my own work being included in this next iteration.”\n\n\nFour artists have been selected to represent Slovenia in the upcoming edition of the Venice Architecture Biennale in the country’s capital city, Ljubljana. The exhibitors are Nenad Šimre and Jerusha Crewe (Ljubljana), who will stage their exhibition “Echoes of Silence” during the biennial’s penultimate weekend, June 12–June 15, 2020, in the city; Ulrich Knapton (Ljubljana), who will stage his gallery’s first exhibition, “Helsinki,” at the center of the city in the spring of 2021, and Jasa Dziewior (Ljubljana), who will host his first solo exhibition in the country in July 2021.Together, the artists are hoping to create a platform for those affected by the pandemic.Šim", "The next Biennial should be on the ground and in the hearts of the city’s artists, and should focus on the creation of new works in the city of Stirling. It should be led by a master of arts with a proven record of working with artists and the city of Stirling. The biennial will be hosted at the city’s centre in the city of Stirling.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) is inviting the public to visit the museum for the first time in its fifty-two-year history with the launch of the museum’s Art of the Party. The event, which is free to the public from 10 AM to 5 PM on September 17, will take place at the Metropolitan Museum of Art. The museum will be inaugurated by an exhibition of work by seventy-three artists, organized by David H. Dziewior, and will return the following year with Charles Dance (1959–2014).“The Met is a generation behind the times, but it is not an out-of-date version of what was once thought possible,” said David Garrow, director and CEO of MoMA. “Our artists are reinventing the", "The next Biennial should be held at the National Museum of Fine Arts, London, which is currently undergoing a major expansion. The institution’s new headquarters will be completed by the time the 2020 edition of the Art Biennial, which will be staged in the National Gallery in the United Kingdom, opens in July.The full list of artists who have expressed interest in participating in the biennial is as follows:Adrien Brochure, Les Demoiselles Daubenschule, Munich, GermanyCurator: Sam Immorton, New York, USAPhotographer: Sam Immorton, New York, USAThe National Gallery of Art, Washington, DC, USASixteen muralists, CambodiaCurator: Elizabeth Anagnosy, Cagayan Province, PhilippinesThe Arabian Institute of Art, San Diego, California, USADesigner: Cara Altmann, New York, USAThe Art Institute of Chicago, Chicago, Illinois, USACurator: Marisa McManus, New York, USADesigner: Marcus Merz, New York, USADesigner: Marisa McManus, New York, USADesigner: Marisa McManus, New York", "The next Biennial should be held at the Pérez Art Museum in Madrid next month. \n\n\nThe Italian art community is mourning the loss of a senior member of the country’s cultural elite. The celebrated Milanese architect Enrico Castelli, who was known in the art world as one of the great architects of modernism, died on September 16 at the age of eighty-one.Born in the city of Salento, Italy, in 1932, Castelli studied architecture at the University of Salento and the University of Genoa before moving to Milan to study engineering at the School of Architecture and Design (AFAD) between 1949 and 1953. He would go on to design the structures for the city’s buildings, the Basilica of Santa Maria of Guadalajara, the archaeological site of the Carthusian Monastery, and the Museo della Scala. He was awarded the Order of the Italian Legion of Honor in 1952 and was inducted into the Italian Association of Architects in 1963.Throughout his career, Castelli was a pioneer of the Italian mid-century, collaborating with architects such as Silber Jovanovici, who designed the historic Palazzo Nazionale in Genoa in 1948; John Akom", "The next Biennial should be staged in the city in 2021. \n Venus Art Museum in Melbourne has filed a proposal to the Victorian government with the Arts Council regarding the relocation of the institution from its current site in the city to a new complex that will include a museum and an amphitheatre. The decision was made after the Victorian government and the Victorian Museum of Art (VMA) in Melbourne reviewed the proposal and agreed that it was in the public interest to move the museum and the VMA. The move is part of an initiative that aims to diversify and enhance the cultural life of Melbourne. The new venue will feature four fifty-eight-foot replicas of the famous Petronas Tower and the Victorian city hall. The building will also boast a glass facade and amenities such as a rooftop bar, a library, outdoor terraces, and an auditorium.In a statement, the Victorian government said: “The Victorian government has long championed the museum as a unique and vital cultural resource. A major part of our plan for the future of the VMA is to create a new museum that represents and embodies the essence of Melbourne. We are excited to welcome new visitors to the VMA and are working hard to make the site of the museum", "The next Biennial should take place in the city of New York in 2021. The opening of the biennial will be on August 29, 2020.  The biennial will also mark the seventy-ninth anniversary of the New York City Council on Human Resources. The 2020 edition will encompass twenty-four years of work by the artists who represented New York City at the thirty-fifth Biennial, in 1993. \n\n\nThe University of Sheffield has appointed Dr Martyn Gee as its new director. Gee comes to the university from the Institute of Contemporary Arts (ICA) in London, where he most recently served as director of the Tate’s Modern Art Collection. Before joining the museum in 2001, Gee served as director of the National Gallery in London and as a professor at the Art School in London, where he taught for more than thirty years. He is the author of several books, including Adventures in Art: From Studio to Museum (2016), Artists in Crisis: Ten Years of Just Art (2009), and Art in America (1981–1987).Gee’s appointment comes just over a year after Institute curators Gail and John Kaye, who also coauthored the forthcoming", "The next Biennial should have two exhibitions that address the theme \"The Future of Art, the Future of Life, and the Future of the World.\" The first exhibition, entitled “The Future of Life: From the Body to the World,” will open on January 24 and run until February 8. The second exhibition, entitled “The Future of Man: From the Body to the World,” will open on February 21 and run until March 10. The upcoming exhibition will be inaugurated by a presentation of the Biennial’s 2018 exhibition “The Future of Man”. The exhibition will feature the work of seventy artists and will offer the first official retrospective in the United States of America of the work of Tanja G. Firth. The Biennial’s new site, ArtPlace, is currently being designed by the San Francisco–based firm W.J. DeSousa.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has welcomed around sixty new members to its board of trustees. The museum’s board of directors voted to increase the number of trustees from three to six following an increase of 13 percent in the total number of members from twenty-two to thirty-one. The", "The next Biennial should be in 2018 and will include two exhibitions within the next twelve months. The first will be “From White Noise to Black: Anatomy of Noise” (2019) by Kunsthal Charlottenborg, which will take place at the state-supported museum in September 2020. A second event, “Music from Black” (2019), by the same director, Jakob Richter, will be presented at the institution in June 2020. The first exhibition will present work by twenty-six artists, including Ahmed Ali, Farsiha Gervais, and Kenzo Teruo, and will run until November 28.The Biennial of the Centrum in Rome will start in July 2021 and will feature two exhibitions each year. The exhibition “Art and the Crisis of Criticism” (2019) will open on July 23 and will run until September 2, 2020. The other will be “The Art of Painting” (2019), which will open September 6–September 8, 2020.The twenty-third Venice Architecture Biennale, which was held in Venice from January 3–January 23, 2021, will be held in May 2022. <|endoftext|>The Canadian Press\n\n\nTORONTO, ON--", "The next Biennial should include an overview of the current state of the art of the art field; a list of the twenty-four artists who are currently represented in the biennial; and a prediction of the themes of the next edition. The full list of artists represented in the exhibition is as follows: 1. Hiroshima, Japan: 2. Nara-Hi, Japan: 3. St. Petersburg, Russia: 4. Konohara, Japan: 5. Los Angeles, USA: 6. NYC: 7. Los Angeles, USA: 8. NYC: 9. NYC: 10. NYC: 11. NYC: 12. NYC: 13. NYC: 14. NYC: 15. NYC: 16. NYC: 17. NYC: 18. NYC: 19. NYC: 20. NYC: 21.  NYC: 22.  NYC: 23. NYC: 24. NYC: 25. ", "The next Biennial should be announced in the first quarter of 2020.”\n\n\nThe Museum of Modern Art (MoMA) in New York has released the first designs for the museum’s planned redesign, which will present the first returning works by the artist after he died in 1975, after a lengthy illness that brought him to the hospital in February 2019. Named after a space where he could sit down and have a physical space with others, the redesign will emphasize the gallery’s history with MoMA and will include new civic elements. Curated by Richard Newcomer, the design is part of MoMA’s ongoing redesign project, which aims to present the artist’s work in an updated and expanded format.The museum released two designs for its current headquarters project, MoMA’s former location on Forty-Seventh Street, and Arne Glimcher’s conceptual design for the new Museum of Modern Art, which opened in 2018 and opened in 2019. Both the Glimcher and the museum have faced opposition from activists and museums in recent years. While MoMA fought the California Coastal Commission to prevent the construction of a new home for the museum, in the months leading up to its reopening", "The next Biennial should be in the spring of 2020. \n\n\nThe Museum of Modern Art (MoMA) has appointed Kevin F. Poole as its next director. Poole comes to the institution from the Lawrence Art Institute (LAS) in New York, where he has served as interim director since December 2016.“Kevin embodies the unique ethos of innovation, creativity, and commitment that is at the core of MoMA,” said director Christopher Reeves. “A leading curator of modern and contemporary art, his contributions will be integral in ensuring the museum’s future as we embark on a new chapter in its history.”Prior to joining LAS in 2011, Poole served as the curator of modern and contemporary art at the Museum of Modern Art in New York from 2015 to 2016, during which time he curated five retrospectives and two exhibitions, including “Bruce Ng’s ‘Superflex” (2017) and “The Death of Harold and Maude: A Study in Staged Art” (2017). He also oversaw the exhibition “Odd, Odd Sight: Modern Art in the Eighties” and “NASA’s Earth Art Program.”Prior to working for", "The next Biennial should take place in 2022, and the 2020 event was slated to run from May to November. The Smithsonian said that the 2019 edition was canceled owing to the ongoing protests, and that a 2020 edition would be scheduled. In a statement, the institution said: “We are currently assessing the possibility of rescheduling a show for the 2020 edition, but we are not prepared to make any further comments at this point.”The decision to cancel the event comes amid growing uncertainty over the future of the Día de los Muertos holiday, which many see as marking the end of the year and the beginning of spring. A number of states have declared their intention to scrap the day, and on Saturday, Governor Andrew Cuomo signed legislation making it easier for businesses and municipalities to reduce hours and work during the week.The legislation, which went into effect on Saturday, March 8, and requires that all municipalities reduce the number of employees working on public holidays by one third, and that companies with 50 or more employees must enact paid sick days. It also gives municipalities the authority to ban or regulate certain activities, and it establishes a $25,000 fund to assist local governments in implementing the law. Cuomo noted that the law does not address the day", "The next Biennial should be announced soon. \n\n\nThe Museum of Modern Art (MoMA) in New York has launched a new initiative that aims to help Hispanic-American art collectors in the city. The initiative, called the $10,000 Stakeholder Summit, will offer six weeks of free and paid consultation for New York galleries and will aim to engage 500 cultural and corporate leaders from the Greater New York City area.The seminar will be led by Pulitzer Prize–winning curator Luis Alejandro González-Santiago, who will lead a group of cultural and corporate leaders during which they will discuss the challenges they face and the opportunities that have been presented to them by the Trump administration, as well as the issues that still need to be addressed—such as the removal of Confederate monuments and the expansion of the Black Lives Matter movement.“The summit aims to present a common ground in which we can come together as one community to address systemic racism and the financial impact of the state,” said Luis Alejandro González-Santiago. “More than anything, I hope it will be a powerful reminder that the United States is an open and diverse country. We are a country founded on the principles of equality and mutual support.", "The next Biennial should take place in 2020 and the first in 2021. The 2019 edition, “The Ethnographic Era,” was held at the Museum of Anthropology in New Delhi, India. The festival, which was organized by the Centre for Indian Art in New Delhi, was open to the public, and the exhibition featured artworks by fifty-three artists, including Malini Dey, Manoj Kumar, Uma Dargan, and Surya Nath, among others from the Tamil diaspora.Dey was chosen as the winner of the $25,000 prize for the first time in his award winning, “Multidisciplinary Art: The Ethnographic Era”\u0097a selection of thirty works by forty-six artists. The prize was established in 2014 by the Centre for Ethnography in New Delhi and was presented to Martin Castets, a former curator of contemporary art at the Royal Academy of Arts, for his work “Uncanny Valley”\u0097a selection of artworks that were created in the city of the Hindu god Durga. Dey has also won several other awards, including the ART Prize in 2015 and the Artists' Prize in 2017.\n\n\nThe U", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA), California, which opened in 1971 and is presently home to more than 2,500 works by twenty-six artists, has appointed Zoe Saldana as its new president and CEO. Saldana, the first Latina to chair the institution, will take the helm from Carol Christodoulou, who retired in February after a decade at the helm of the museum.“Zoe Saldana’s leadership and vision for the museum aspires to reshape the narrative of MoCA as a whole, and the life of the institution as a whole, in order to bring the museum in line with the changing face of art and culture in California,” the museum said in a statement. “Her appointment reinforces MoCA’s commitment to moving forward with the extraordinary artist lineup, in keeping with our long-term goal of bringing together an inclusive collection of work by women and non-white artists, and her vision for the museum embodies that of a true visionary.”Saldana, who began in the role in 2013 as executive director of the Contemporary Art Museum Los Angeles (CAMLA), is the second woman to lead", "The next Biennial should have been held in 2019, but was postponed due to the Covid-19 outbreak. Its opening was set for October 28, but organizers announced on Friday that it would be held the week of October 29 and would reopen on Saturday, October 30. The central theme of the 2020 edition will be the work of Rineke Dijkstra, and the work will be dedicated to the artist as he completes his series “Touched” (1981), “Touched” II (2003), and “Made in LA” (2011) in Los Angeles.\n\n\nThe German state of North Rhine-Westphalia (NRW) has appointed Konrad Adenauer as the head of the state’s promotion center, which was established as part of the √Artforum’s acquisition of several artworks by German-born artist Wolfgang Oppenheim in the 1980s. Adanauer will assume his post on October 29. “Adanauer’s ability to transform the already complex environment for promotion, which has been crippled by the Covid-19 pandemic, will prove crucial in ensuring the center’s survival, as will his", "The next Biennial should take place in 2021.\n\n\nThe Centre Pompidou in Paris has hired Claude Chantal Fouquet, who has served as director of the Pompidou since 2014, to lead the sixth edition of the DDI Paris biennial, which runs from March 14 to March 22. Fouquet will assume his post on May 29.The exhibition, “Les Derniers de l’Acte,” premiered at the Centre Pompidou in 2017 and currently has a run of thirty-two days. The sixth iteration of the event will take place at the Centre Pompidou in the next two years. Fouquet will work closely with artist and curator Henri Béchard, who will serve as the theme of the event, which will run concurrently with the Épineil Festival, and Kader Attia, director of the Centre Pompidou. In addition to the theme, the biennial will include additional programming dedicated to women’s art and architecture. “The Centre Pompidou is always working to present new opportunities to the artists and we are excited to work with the talented team and the recently appointed director, Kader as they continue to develop the programme of", "The next Biennial should be held in 2021 and will be led by Janice Johnson, the Executive Director of the Center for the Arts, and Sarah Loyer of the Center for Modern Art. Kessler-Tuttle will receive a $50,000 grant. The Driehaus Museum of Art, founded in 1899, has received a $500,000 donation from philanthropist Eva Presenhuber. The money will be used to establish the German-born, Berlin-based foundation Driehaus Stiftung e. V. Since its inception in 1991, the foundation has received more than $2 million from individuals, foundations, and foundations affiliated with the Driehaus family. “The Driehaus Foundation is honored to receive this generous gift, and to be able to develop an innovative program, which will help to combine the strengths of the Driehaus Museum with the museum’s collection, exhibitions, and educational programming,” said Driehaus chairman Wolfgang Diester. Commenting on the donation, Driehaus director Hans-Ulrich Biemann said: “We are delighted to receive this gift from Eva Presenhuber and to be able to use the", "The next Biennial should focus upon the role of the museum and its collections in building a more just, equitable, and inclusive world,” said Kate Morgan, chair of the global committee. “We are deeply concerned by the level of destruction caused by these antiquities, and by the ways that the Panorama in Istanbul—the centerpiece of the exhibition—is being compromised by neglect and mismanagement.”While the biennial is temporarily closed as part of the coronavirus outbreak, the exhibition will reopen in the spring of 2020 and will feature new works by twenty-six artists, including Amélie Barozzi, Douglas-Hamilton, Jean-Michel Basquiat, Alfred Sjögren, and Alice Neill. The festival’s full list of participating artists is as follows:Studio & CollectiveMella BickelSara BarkerTania BichySara Crouch SeddonAdrienne EdwardsElizabeth EllsworthKiki ElkinBeatrice FortunaGabriel FiskinHans-Ulrich GroothuisHans-Ulrich HauptmanHans von NeumannHans-Ulrich KrausHans von KrausHans-Ulrich LichtensteinPangaea Neg", "The next Biennial should take place in the fall of 2021, when the exhibition will be staged at the Museum of the African Diaspora (MoAD), the National Museum of Art (NMA), and the Art Institute of Chicago. In the past, the event has featured works by twenty-four artists including Alwen Ngugi, Anna Atkins, and Elyn Zimmerman. The next show will be titled “Making Identities” and will take place in January 2022.\n\n\nCultural figures including Benedict Cumberbatch and Laura Linney have signed an open letter condemning the recent wave of attacks on London’s Tate galleries, which were sparked by a rare public visit to Tate Modern by British Prime Minister Boris Johnson last week.“We deplore the attacks on galleries and on the cultural lives of our cities, and we question the long term strategy for curating exhibitions at Tate galleries, particularly when the vast majority of visitors to these galleries are not visitors at all, but are instead working professionals visiting the museums to see exhibitions,” reads the letter. Art historian David Blaine, who curated Tate’s most recent exhibition of works by Maurice Broaddus, also condemned the attacks, which claimed the lives of four people and", "The next Biennial should be held in 2023 and will also receive funding from the Tamarind Foundation, the Tata Foundation, the Mumbai Art Project (MAP), and the Tata Institute of Social Sciences. The event will be hosted by the Tamarind Foundation in the city and will be led by Hari Chandrasekara, director of the Tamarind Foundation. The theme of the year will be “The Self, the Environment, and Society.”The 2018 edition of the Boston Biennial, “The Future is Present,” will be held at the Boston Garden from March 23 to March 29 and will receive $9.5 million from the Boston Art Museum (BAM), the Boston Symphony Northeastern, and the Boston Children’s Museum (BCM), as well as funds from the Tamarind Foundation, the Tamarind Foundation for the Arts, and the Tamarind Foundation for the Environment. Other events slated to take place in the city are the Boston Museum of Art’s Art of the Party, the Boston Garden’s Art of the Party, and the Boston Garden’s Annual Artistic Rehearsal.\n\n\nThe Los Angeles County Museum", "The next Biennial should take place in 2021 and will be hosted at the Museum of Modern Art in New York, which has moved to the former site of the Metropolitan Museum of Art in New York and is currently undergoing a $1 billion renovation. Curator Janice Morel, whose work explores the history of the conceptual boundaries of art, including how a work of art becomes a work of art, has called the upcoming event “an evolution of the present, a rethinking of what is possible, what is surreal, what is the in between, and what is not.”\n\n\nThe Expanse: The Exhibition, A to Z, is returning to New York this fall. The ten-decade-long retrospective, which celebrated its fiftieth anniversary last fall, is reopening in September with a new exhibition of work by thirty-six artists, including Adam D. Weinberg, Mark D. Zebieta, Amir Heznal, and Tarek Abush, with special exhibitions of work by Léa Seydoux, Mary Ellen Tan, and Richard Avedon. The first leg of the program, “Drift,” will run from March 19 to March 21, 2021.“The", "The next Biennial should take place in Tokyo in 2022. The theme of the next edition will be “Aarashi no tsukasa (Time and Space).” The Tokyo Art Museum (TMA) will also hold an exhibition of works by the contemporary artists Maki Yamazaki and Sakuliu Tabata in association with the TMA in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Boston, announced today that the institution will reopen to the public on July 13, 2021. The reopening will coincide with the two-week celebration of the twentieth anniversary of the opening of the museum. The reopening will also coincide with the opening of the Art of the Party, a new four-day exhibition that follows a group show that is organized every other week at the institution. “We are especially grateful for the Museum of Contemporary Art and the People of Boston for being a part of the ongoing revitalization of our city and region,” said Museum director Paul Mpagi Sepuya and commissioner of the city of Boston, Anne de Jonge. “We look forward to welcoming visitors to our new home and celebrating the Arts and Culture in Boston in 2021.”The opening of the new museum", "The next Biennial should take place in 2021, the Art Newspaper reported. While the year will surely celebrate its centenary, this year will also be remembered for the growing tensions between the two countries following the May 25, 2019 coup in Turkey, which was seen as a threat to the rule of President Recep Tayyip Erdoğan. The events leading up to the fall of the regime have been extensively documented. The International Committee of Museums (ICOM) said: “The ICA will make the most of these difficult circumstances by reflecting on the impact of the incident on Turkey, and by taking into account the impact of the coup on Turkey itself. The work of the ICA is not just about celebrating the centenary of the coup, but also about remembering and addressing the events that followed and the Turkish people who died in the coup.”\n\n\nThe Museum of the Fine Arts, Boston (MFA) will no longer recognize the immigration status of a descendant of the original inhabitants of Roxbury, Massachusetts, who were forced to leave their homelands in 1792 to seek refuge in Boston in 1799, reports the Boston Globe.The decision by the museum comes amid a growing movement to restore and protect immigrant artworks and cultural heritage, which", "The next Biennial should also lead to the first ever gender-balanced exhibition. \n\nThe third edition of the Venice Architecture Biennale, which was held last year and will run from March to July 2021, was closed on Sunday, March 7, with no new works being added.  The event, which was supposed to mark the 70th anniversary of the landmark Guggenheim museum in Venice, was forced to cancel the event due to the Covid-19 pandemic. The exhibition opened as planned but was forced to move its opening three weeks early due to the pandemic, which officially kicked off in the United States on March 8.The biennial was also forced to move the event to an alternate date of May 10, following a delay of three weeks. The Venice Architecture Biennale’s artistic director, Stefano Cattelan, said that the exhibition will reexamine the role of architecture in shaping the city, adding that the opening date will depend on whether the financing is secured. “We have the option to be at the Venice Architecture Biennale 2021,” Cattelan said in a statement. “We are working with a bank in the coming weeks to finally set an opening date", "The next Biennial should be held in the spring of 2021. \n\n\nThe house of art at the Museum of Contemporary Art (MoCA) in Los Angeles is planning to move nearly six thousand works by the late American painter Lynne Tillman from the institution in a massive reorganization. Its new headquarters will include an additional 400,000 artworks by Tillman, whose work centered around purveyivity and the visual arts, many contemporary, and the 1950s, in a project that will begin with the installation of the artist’s work in the museum’s current exhibition, “Lynne Tillman: Futurism” in September 2020.“This ambitious plan addresses multiple challenges for MoCA, including the legacy of its former director, Kate Murphy, and the urgent need to grow its collection and exhibition space to meet the ever-changing needs of an ever-changing world,” Museum director Marc Glimcher said in a statement. “The new structure, designed by acclaimed architect Foster Wheeler, will create an ideal environment for the artist’s work to flourish and for artists and collectors to come together to celebrate diversity of vision and craft.” The renovation of the museum is being led by Daniel", "The next Biennial should be held in the year 2020.\n\n\nExpanding the scope of the Walker Art Center’s global digital program, the institution has announced the final addition to its digital team: Sam Palladino, who has previously worked as a professor at the city’s MacDowell Colony of arts and design and as a freelance writer. Palladino joins the museum as it works to create an online platform that will allow visitors to the Contemporary to explore the advanced collections of the Walker. The new platform, called the Walker Arts Archive, will host more than three hundred works by ninety-nine artists selected by the institution, including Anthony Bourdain, Gene Spero, and Maren Hassinger.Palladino will assume his new role on August 4. He will work with a team that includes Brian Clough, director of the institution’s Visual Arts Center; Kerstin Brätsch, artist-in-residence at the Contemporary; and Christopher Juang, curator at the Contemporary. The team will work with the institution to develop a new step-by-step online portal that will allow people to search through the museum’s holdings online. The project will be overseen by the museum’s", "The next Biennial should be held in 2021. Since it is an ongoing project of the museum and its partners, this means that the next iteration of Artforum will take place in the same space as the current year. There is currently no word yet on when the exhibition will return to the museum for the next edition.\n\n\nThe Art Newspaper has published an interview with Tod Williams, who recently served as director of the Brooklyn Museum. In the article, Williams discusses his departure from the institution and his new role as director of the Museum of the City Museum, which he has led since 2015. He also talks about how the museum’s renovation of its campus—which included the construction of a new building and an expansion of the existing buildings—has had a profound impact on the museum’s attendance.In the May issue of Artforum, Williams wrote: “As I\u0097and I think most people\u0097head of an institution, we face a massive structural challenge: how to make a museum work in a world of diminishing resources. The answer, in the long term, depends on designing buildings to last for twenty-five thousand more years than the current buildings, and building design to last for the next fifty years. I’", "The next Biennial should be held in the spring of 2020. The institution anticipates that the 2019 event will remain open through 2024.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has launched a $250,000 fund to help cultural institutions in the city recover from the Covid-19 crisis. The funding, which was announced last week, will go toward direct grants to cultural institutions.Culture Workers Benefit from the Covid-19 Emergency FundThe fund is a departure from the city’s traditional programs, which have traditionally offered financial assistance to individuals and small businesses in the city. The fund will give culture workers in the city access to funds ranging from $300 to $500. Grantees will be selected through a competitive application process that will include an analysis of their specific needs and the impact of Covid-19. The fund is one of a number of relief efforts being launched by the city as it works to support the nearly three hundred businesses that have closed in the last six weeks or so in an effort to reduce the city’s carbon footprint and combat the coronavirus.The other emergency fund that has been instituted is the $250,000 for small business owners who are facing a", "The next Biennial should be held in 2021 and will be hosted by the Museum of Modern Art in New York, the San Francisco Museum of Modern Art, and the Brooklyn Museum of the Arts. The festival will be hosted by an intergenerational group of curators, scientists, artists, and activists in partnership with the local communities of Buffalo, Derry, and the City of Buffalo.The Buffalo biennial will be hosted at the newly renovated and expanded Museum of Art in the same space that is currently home to the Erie Art Museum and the Erie Museum of Art. “The Buffalo Art Museum’s groundbreaking exhibition ‘The First People’’ Present’ in the United States in 1970–1971 sets the precedent for how future exhibitions could be organized, conceived, and presented,” said Jodi Taveras, chair of the board of trustees of the Buffalo Museum of Art and the Erie Museum of Art. “By bringing together artists from across the world, the Buffalo biennial provides the opportunity to present the work of the Buffalo Art Museum’s curators as they crafted the show.”The Buffalo Art Museum is a leading arts and culture destination in the City of Buffalo, New York. Located on a seven", "The next Biennial should take place at the Museum of Contemporary Art in London on May 24–May 27. Its theme will be “Audience.” The institution will award $165,000 in grants to institutions that demonstrate a commitment to equipping the biennial with a digital-to-analog converter or a work that uses the power of technology. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has announced that it is launching a new initiative to support artists and their work in need of financial assistance. Called the Artist Relief Fund, the program will provide $100,000 in grants to assist artists in Los Angeles County in performing unpaid labor during construction and renovation of their homes. The program will focus on assisting artists who live in the Los Angeles Unified School District (LAUSD), which comprises low-income, predominantly black, predominantly Latino, and predominantly white schools. According to the New York Times, 87 percent of the people enrolled in LAUSD—which includes both East LA and West LA—are African American, and the district’s median age is thirty-eight.The program’s first grant cycle will provide $100,000 to help pay for personal expenses for artists and their families. Next, the", "The next Biennial should take place in the Spanish city of Valencia in 2018. \n\n\nAlexandre Leclerc, the French director of the Barbican Contemporary Art Centre (BCCA), in London, has named his ten-person team for the upcoming edition of the Barbican Biennial. Leclerc will lead the first part of a three-part project, which will include an exhibition of work by ten artists from the same continent. “The Barbican is a global institution that represents a long tradition of cutting-edge contemporary art in the UK, France, and the Arts,” said Leclerc. “I’m delighted to be working with the talented team of curators and artists who have already announced their participation in the next edition of the Barbican Biennial, which will take place in January 2020. Their work will be featured in the ‘next stage of the Barbican’s history, which will be a celebration of the Barbican’s 150th anniversary and the creation of a new biennial in association with the Royal Opera House, London, in December 2020.”As part of the concept of ‘next stage of the Barbican,’ Leclerc and his team", "The next Biennial should be in September 2021.\n\n\nThe Harvard Art Museums (HAMP), in collaboration with the Harvard Art Gallery, have commissioned artist-run nonprofit arts incubators to host the next edition of the Harvard Art Festival (HAMF). The HAMP–Hass, which focuses on the visual arts, and the National Gallery of Art will jointly equip the Huntington Library with free arts and cultural resources to help curate and showcase the exhibition that will take place at the Huntington Library in June 2020.The partnership between the museums came about after the Huntington Library began hosting the Festival in 2018. During the six-month run of the event, around one hundred artworks, including works by internationally acclaimed artists such as Larry Achiampong (2018), Montserrat Chedid (2019), and Jana Balojevich (2019), were presented in an exhibition organized by the Huntington Library. The exhibition was curated by veteran curator and scholar David H. Miner.The new partnership, announced on January 20, includes the creation of a new incubator program, which will help support curators and other curators in building their practice. The program will also foster the exchange of curatorial and cultural materials between the museums and will share institutional resources,", "The next Biennial should take place at the 'Art of the Body' (18–20 January 2021) at the MUSE , Athens, and should be hosted by the Folkestone museum in London. The show will be hosted by the Flemish curator Bebe Reits, and will be curated by Hanna Ros-Amé and Diarmuid O'Connell. The exhibition will draw from artworks by the artists whose works are included in the forthcoming exhibition “Sophie and Frederik Eckert: The Body in Action.” The first forty-eight works invited for the exhibition will be unveiled in March 2021.\n\n\nSydney’s Museum of Contemporary Art (MAS) has announced that the second edition of the Sydney Biennial, “Away From the World,” is now complete. It will now feature twenty-five works by twenty-eight artists. The exhibition marks the first time that the Australian capital’s Museum of Contemporary Art has staged a major retrospective in its seventy-year history.Created by Melbourne-based artist Barbara Kruger, the exhibition will kick off with the exhibition of her work Away From the World,” a virtual reality installation that combines words, images, and", "The next Biennial should be held sometime in the second half of 2020. It will be entitled “15 years of experimentation with art and creative practice,” and will focus on themes of the current moment. Among the subjects likely to be covered are “proletarian theory and practice,” “intersection of art, technology, and identity,” and “exhibitionism and the body.”Chen told Artnet that the Biennial will focus on “the artist as well as the environment in which they live and work.” He added that the venue will also “offer a forum for reflection and reflection on present and future possibilities.” The biennial will involve more than one thousand artists and will run for fifteen consecutive days. The selected fourteen artists will be chosen by a jury comprised of Adrian Chiu, director of the Biennial, and cartoonist and painter Bénédicte Savignac.The exhibition will be curated by artist and curator Alexis Loos. Chiu will curate the first part of the exhibition, “Ideas for the Exhibitionist” (June 21–June 26), and the second part, “Ideas for the Body” (June", "The next Biennial should be held in May 2019. The first will be held in September 2020. The artists who have won awards include Zina Saro-Wiwa, Adriana and Joan Miró, and Sarah and Nata Zangwill.\n\n\nNadia Kamb, who won the first award for Excellence in Digital Culture at the Museum of Contemporary Art (MoCA), Los Angeles, has been named the winner of the $10,000 Mensch Award in the Art of Entertainment Arts. The museum revealed the 2019 recipients, which include Julie Oli-Johnston, Brendan Ochs, and Jodi Throckmorton, and the award ceremony has been moved to a later date.“Nadia Kamb is a ferocious curator whose work embodies a singular vision of the medium, an open, responsive, and politically engaged vision which is at the heart of the museum’s mission,” said museum director Michael Colson. “Her career spans three decades and involves a mind-bending range of performance and narrative. She is simultaneously an artist and a scholar who delves into the material and the intangible to tap into the metaphysical; a scholar whose scholarship underscores the importance of art and culture as a vehicle for social change", "The next Biennial should be held in 2022. The exhibition will be hosted by the Museums Association in partnership with the South Korean government, and will be organized around themes such as the body and the spirit, art and culture in the twenty-first century, and art and identity. The exhibition will take place at various locations across Seoul, including the Museum of Contemporary Art, Korea (MCA), the Museum of Contemporary Art, Japan (MCAJ), and the Museum of Contemporary Art, New York (MCANY), and will be accompanied by an exhibition of works by forty-three artists. “The exhibition will be a real challenge for the contemporary art community in Korea, the best of the twentieth century, and will draw the attention of the entire world,” said IMEA’s director, Maria Diar. Additionally, after the show, an online version of the exhibition will be made available, and the exhibition will be followed by an exhibition of works by the artists who participated in the Biennial. The open-air Biennial will also be supported by a contemporary art museum in Seoul, the Museum of Contemporary Art Korea (MASK), and a new digital platform that will be", "The next Biennial should be organized in early 2021. What is already known about the exhibition? The exhibition features the work of twenty-two artists, including Joshua Helmer, Anthony Como, Oliver Holm, Jana Treblinka, and Laura Wheeler, and will run for ten weeks. The exhibition will close on October 29 and will feature a selection of works from the exhibition “The Present Situation: Contemporary Art in the Age of Resistance” (2019).The museum is also planning to expand its 2012 programming.  “It’s an honor to present this work in front of an audience that has supported our development over the last ten years,” said León. “It’s always exciting to work with the community, and we hope everyone will come see it.”In February 2019, the museum acquired two works by the Brazilian artist João Pessoa, of the Pessoa Group, and donated them to the city of São Paulo to be displayed in the museum’s collection. The works, The Present Situation and The Shifting Image, were acquired by the Pessoa family at the museum’s request after the artist contacted the museum in 2013 with his proposal to", "The next Biennial should be held in 2020. \n\n\nA group of artists, collectors, and intellectuals are petitioning the city of New York to establish a platform for their artworks on display in the city’s public spaces. The piece of public art, titled Art in the City, is a series of Plexiglas panels composed of a variety of natural materials spanning the globe, including studio-made glass, wood, and paper, that were created by artists such as Edward Hopper, Nude with Glass, and Louis Kahn, and are slated to be exhibited in the City Museum of Art next month.The petition, which was spearheaded by Jonathan Salant, the city’s deputy commissioner of arts and cultural affairs, and Elizabeth Alexander, a commissioner and board member of the arts, is a direct response to the ongoing protests taking place in the city. The protests have been sparked by police violence committed by the city’s black and brown communities, including the death of George Floyd, who was killed by a white police officer in the line of duty in Minneapolis in the summer of 2018, and have been fueled by a sense of injustice felt by many in the city. Many have also been galvanized by the dismantling of public statues and the", "The next Biennial should take place in New York in the spring of 2021.\n\n\nFrieze is expanding its partnership with the Philadelphia Museum of Art (PMA), and the Philadelphia Orchestra (P.A.N.), to include the Philadelphia Museum of Art, the Philadelphia Orchestra, and the Philadelphia Symphony Orchestra. The announcement marks the first time the three organizations have collaborated in a major way, and comes a little more than a year after the P.A.N. won a major award for its performance at Carnegie Hall. In addition to its prize, the organization will receive $1 million for its work at the P.A.N.'s inaugural event, POP UP, in October 2019. The partnership marks a new chapter for Frieze, which has been working with the PAO since 2016, when the organization hosted an exhibition of work by British artist and composer Guy Armstrong at Frieze Sculpture at the PAO in 2021.“We are thrilled to see that many of the works in this exhibition will find a home with the Philadelphia Museum of Art, and to be able to share that work with our audiences in future years,” said Amy Schipper, director of Frieze Philadelphia. “Frieze Sculpture", "The next Biennial should be held in 2022, when the focus of the exhibition will be on the history of art in the city, and the next will be staged in 2023, when the panels will focus on the relationship between art and the city’s contemporary culture.The inaugural exhibition of the ten-year edition, “Tokyo 2020: Architecture and Design,” was staged at the Ginkakuji Museum in Nagoya, Japan, in January 2019 and kicked off at the Tate Gallery in London in March 2019. The event received a retrospective at the London-based museum in October 2019.\n\n\nCanadian artist Rachel Harrison, who is best known for her multicoloured, wire-framed sculptures that depict everyday objects such as flowers, trees, and road signs, has died at the age of seventy-nine. Harrison’s works are among the earliest to use paint, and were also influenced by her encounters with the Kandinsky and Max Beckmann artists in the 1960s.Born in Toronto in 1940, Harrison moved to Montreal in 1957 to study painting at the University of Toronto. After graduating in 1962, she moved to California, where she met her husband, David, and soon became engaged to the pop-art duo", "The next Biennial should be hosted by the university in 2022. Since the exhibition is currently held in the exhibition hall, the next edition will be held outdoors. The museum is currently working on designing and constructing a new pavilion, an outdoor space for the exhibition, and is preparing for a major expansion, both in scope and in scale, of the gallery. The institution has also started an open call for artists. The deadline for submissions for the 2020 edition is October 19. In the meantime, a selection of the exhibits will be on display in a second exhibition, “Between a Rock and a Hard Place: The Arts and Architecture of Renzo Piano” at the museum in 2022. The installation will be organized as a series of close-ups of photographs that are part of the exhibition “Anna Atkins: Structures” and will run approximately two hundred photographs spanning a number of themes, including the constructed world and the personal. The work will also include a new virtual reality experience, called the D’Arcy’s Lab, that will exhibit a collection of new works by artists such as Alex Thomson, Nara Victoria, and Michael Siegal, among others, and will be free to the public.\n\n\nThe Solomon R", "The next Biennial should take place at the Palazzo Vecchio in Venice in 2022. The next edition of the Art of the Biennial will be hosted by the Art Gallery of the University of California, San Francisco (AGU FIM), in collaboration with the Peter Bauer Foundation, the Museo Pilar Bueno, and the International Center for Contemporary Art. The 2020 event will continue to be organized in collaboration with the artists, the museum, and the community. \n\n\nThe Linda and Arne Mather Foundation has announced the recipients of its 2019 prizes. The foundation, which has funding of more than $3 million, will award $2 million each to artists whose work will engage with themes of ecology, nature, and history. The 2019 prize jury—comprising Barbara Ashley, director of the New York Botanic Garden; Arne Mather, founder of the Mather Foundation; and collector and philanthropist John F. Kennedy III—cited the work of the following artists: Ben Klock, Arizona Pictures, Netherlands, 2018; Tarek Atoui, Sittwe, 2018; Gereon Rasheed, Kenya, 2017; and Victor Vas", "The next Biennial should be held in February 2020.\n\n\nThe Institute of Contemporary Arts (ICA) in London has announced that it is collaborating with the London-based artist-run biennial Lydia Bay, whose works explore issues of identity and identity politics, in the exhibition “Feminine (Art & Politics)” (2019). The exhibition, which will highlight the work of thirty-two artists, will be inaugurated by a solo exhibition at Ealing Studios in London on September 27, 2020 and will run through March 21, 2021. “We are so excited to present Lydia Bay’s work today,” said Oli Walker, director of the Institute. “Her installation is carefully constructed around a common theme, a theme that has been central to her practice for quite some time: the female body.”Born in London in 1936, Bay became a internationally known painter and sculptor in the 1960s. Her work has been collected by the Museum of Modern Art, the New Museum, the Museum of Modern Art, the Musée d’Art Contemporain in Paris, the Museum of Modern Art, New York; the Musée d’Art Contemporain in New York, the Musée", "The next Biennial should be held at the Museum of Contemporary Art Chicago (MCA) in 2021. We are working with the MCA and its board of trustees to finalize the architectural design for the new venue and will soon be in discussion with the surrounding community. The new pavilion will host the biennial normally, but will stage the first exhibition dedicated to a new work by the artist-in-residence, an encyclopedic retrospective devoted to the artist-in-residence, and an interactive performance series.The biennial will be a collaborative effort between artist-in-residence Shilpa Sharma and the MCA. The first exhibition will be titled “I’ve Been here Before: The Work of Anselm Kiefer.” The exhibition will be organized as an interactive multimedia installation inspired by the artist’s lead-up to the bombing of Pan Am 103 in Bangkok on July 8, 1987.The exhibition will begin with a discussion of the artist’s work, “The Head in the Clouds” (1936), and “Aristoteles” (1936), and conclude with a selection of works from the final exhibition, “200 Years of Painting", "The next Biennial should be curated by an American curator whose expertise and vision is interwoven with a strong sense of spirit, empathy, and artistic integrity. The new venue should be conceived as a laboratory for the art of war and the world in which it emerges from the body politic, a space for which the public will be able to participate in continuing the work of the previous ten years.”\n\n\nAs the number of people killed in the Las Vegas shooting climbs to at least 58 and the death toll continues to rise, the Metropolitan Museum of Art in New York has released a statement that expresses its solidarity with the families and communities of the victims of the shooting. Despite the incident occurring in a public space, the museum has temporarily shuttered its main exhibition “Blackout: The Untold Story”\u0097a centerpiece of the museum’s annual free admission day\u0097and plans to reevaluate its schedule in the coming weeks.According to the New York Times, the Metropolitan Museum of Art is currently working on a new set of guidelines that will address the safety and use of crowd control devices\u0097a change in policy that was made after the deadly incident in Las Vegas on October 1. The museum had been working on a new set of safety", "The next Biennial should be organized in 2021.\n\n\nThe city of Copenhagen, which has been struggling to contain the coronavirus—in a time of unprecedented global warming—is scrambling to create more than one million new positions in its museums. Despite the efforts of city officials and the United States Centers for Disease Control and Prevention (CDC), the coronavirus is only affecting the elderly and the sick.According to the New York Times, the number of people being treated for the virus has already surpassed the number who died of the virus in the United States last year. According to the New York Times, the coronavirus is spreading rapidly and the number of cases reported in the United States has tripled since January.According to the CDC, the coronavirus is only one of several diseases that are circulating in Europe. In addition to the coronavirus, the region is facing a severe drought, a rising tide of COVID-19 cases in the Great Lakes, and a coronavirus-related coronavirus outbreak in China. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles—the world’s largest contemporary art museum—has officially announced that it is preparing to open on August 29, 2020. The first phase of the facility", "The next Biennial should be held in 2022. The seventh will be held in 2022. The second edition of the Art Biennales will be held at the Palazzo Neleppe, Rome, in 2020. The twenty-sixth will be held in 2021. The seventy-sixth will be held in 2020. The seventy-fifth will be held in 2020. The seventy-ninth will be held in 2020. The seventy-eighth will be held in 2020. The seventy-ninth and seventy-ninth editions of the Biennale in Zurich will be held at the Art Center the same year. In an email, the jury said: “The themes and the work of the exhibition ‘Awards’ are interlinked and we are grateful for the visual and verbal support of this year’s theme: The Last Days of the World.”\n\n\nThe São Paulo Biennale has announced that it will award $500,000 to the Brazilian artists who have been featured in the exhibition “Theo and Paulo,” which debuted at the Brazilian Embassy in Washington, DC, in October 2018. The ninety-three artists who were chosen for the exhibition", "The next Biennial should be in 2020.\n\n\nThe Metropolitan Museum of Art in New York has opened a new research center dedicated to the work of twentieth-century American artists, artist-actors, and designers in an effort to better serve the thousands of artists who are currently stored in its collection. The center will offer visitors an online exhibition space, an open-studio model, and a variety of other services.The center will be called the William Goldman Center for the Arts and will be inaugurated with a monograph, “Away From the Sun and the Moon: Artists in the Years 1970–1980” (2019), by American painter Alma Swan, which opens on August 8. The exhibition will then return to New York City for a second year, during which time the center will host eight biennials, called “1940s Bodies: Artists at Home,” which will be a yearlong celebration of the ’40s and ’50s, and “20s Bodies: Artists on the Road,” which will feature works by nineteen artists.\n\n\nThe Royal Academy of Arts (RA) in London announced today that the Royal Shakespeare Company (RSC) will stage performances of Shak", "The next Biennial should be held in 2021. Its twenty-second edition is currently on view in Florence, and its twenty-third is expected to open in 2021.\n\n\nAn eight-foot-tall bronze statue of Nehemiah, the 12th-century king of Judah, installed in the center of Tel Aviv, has been restored by the city of Tel Aviv and the Israeli Ministry of Culture. The work was commissioned by artist and philanthropist Josh Knocht, who also installed the work in Jerusalem and Bethlehem in the city of Israel.Knocht, who has been active in promoting local and international artists and philanthropists, was inspired to create the piece after visiting the Temple Mount, where he saw a work by Ruth Bader as well as the work of Israeli and American artists. Knocht bought the piece from the Tel Aviv dealer Ilan Pappademas for $12,000.The Tel Aviv Foundation for the Arts (TFESA) and the municipality of Israel came together to raise funds for the restoration of the work, which was acquired by the foundation in 2016. The donation was made in memory of mother and daughter from the town of Tel Aviv, who are longtime supporters of the organization. Since its inception, the foundation", "The next Biennial should be held in 2021. The next iteration will take place at the Monash University of Technology in Melbourne, Australia, from January 7–January 10, 2021.\n\n\nThe Allen Institute for Contemporary Art (AICA) in Los Angeles has received a gift of more than 1,500 works from its longtime benefactor, the Miami-based businessman George and Miriam Allen. The collection includes artworks by artists including Atlanta-based artist Kelly Covington; the California native Frank Gehry; and Paul Gauguin, who was a friend of the couple from his childhood in the small village of Taguba, near Miami.“We are greatly honored to accept this gift,” said George Allen, a longtime supporter of the university and a founder of the German company Fondazione Allen & Liotti. “With this donation, the Allen Institute will now have one of the largest holdings of work by any contemporary artist outside of Germany.”George Allen, who has been a generous donor to the institution since 2002, also donated several works by artists whose work he purchased in the 1980s. Among the works that have recently acquired works from the American and German roots are the pieces by the French-born artist Clement Mil", "The next Biennial should take place in 2021.<|endoftext|>At the center of this global protest is a question that has vexed filmmakers, academics, and politicians for decades: What happens when a culture becomes a breeding ground for extremism and extremists are able to disseminate their ideas and narrative through the mass production of radical content? As cultural producers, artists, and scholars, we must address this challenge head on. We must not cede the cultural battlefield to terrorism . We must not allow terrorists to define our cultural and political spheres. We must not allow our artists to be used by terrorists. And we must not allow the terrorists to define our societies. We must not allow Islamic State to define our societies.We must not allow Islamic State to define our societies. We must not allow the terrorists to define our societies. We must not allow the terrorists to define our societies. We must not allow the terrorists to define our societies. We must not allow the terrorists to define our societies.We must not allow the terrorists to define our societies. We must not allow the terrorists to define our societies.We must not allow the terrorists to define our societies. We must not allow the terrorists to define our societies. We must not allow the terrorists to define our societies.We must not allow the", "The next Biennial should take place in the spring of 2020.\n\nAt the same time, the museum plans on releasing an updated version of its collection of more than 1,500 works on paper. Titled Stories on Paper, the exhibition will include works by artists such as Pierre-Auguste Renoir, Isabel-Auguste Reine, and Robert Mapplethorpe, as well as a selection of modern and contemporary work by Stan Brakhage, Pierre-Auguste Cezanne, and Jean-Michel Basquiat.\n\n\nThe New York City Department of Cultural Affairs (DCLA) approved the $5.4 billion redevelopment of Central Park on Monday, making the park open to the public for the first time in more than three decades. The design, which will include a new public plaza, garden, concert venue, and performance space, was approved by developer Adrian Claypool and city councilman Jimmy Van Bramer, who represents Harlem, and will be officially unveiled on June 8.“Central Park has been a City-funded historic landmark since its construction in 1970, and today it represents an ideal setting for the installation of the latest in contemporary art,” said Mayor Bill de Blasio. “Central Park is a City", "The next Biennial should have been held earlier, in 2022, and the first should have been held in 2021. But the international exhibition was moved to 2020, and the 2020 event was cancelled. The 2021 event was set to mark the 100th anniversary of the Biennale.The biennial’s creator, Jean-Jacques Biennale, died of cancer in Paris in December 2018. His eldest son, Pierre, took over the reins of the organization. Over the course of his career, Nathalie, the widow of Jean-Jacques, created more than sixty exhibitions, including “Return of the Chaparral,” “The Body and the House,” and “Sculpture, Inc.: Art and the Making of a Modern World,” and amassed dozens of thousands of images and documents. The collection now comprises the archives of twenty-four countries, including Switzerland, Italy, France, Spain, Austria, and the United States.In a statement, the Biennale Foundation said: “The tour de force, ‘Sculpture, Inc: Art and the Making of a Modern World’ was a collaboration between Nathalie, Pierre, and myself to create a vision of", "The next Biennial should be held in 2021.  \n\n\nThe Museum of Modern Art (MoMA) in New York has announced the thirty-ninth edition of Art Basel Hong Kong, which will take place at the invitation of the secondary arts hub and will present an exhibition of works by twenty-four artists. The exhibition, titled “Tales from the Alley,” will run March 15–March 21, 2020.“The exhibition will serve as a platform for MoMA’s artists, where they will present works that reflect their individual visions of the world through the lens of modern art,” said MoMA curators Sanna Nilsen and Alex Akyla, who served as artistic directors during the exhibition’s 2014 iteration. The curators played a key role in the insertion of new narratives and themes in all forty works by participating artists. “Art Basel Hong Kong’s thirty-ninth edition will bring together a special selection of new and established international artists, or present works from the 2010 and 2012 editions,” said Nilsen. The exhibition will be guided by a creative director, Nanya Singh, who will serve as creative director for the 2020 edition. The show will", "The next Biennial should be held in the spring of 2021.\n\nArtnews reports that the next edition of the Hong Kong Biennial will be held in late June and will release the first leg of its official art show TAI in the summer of 2020. The wardrobes will be updated with new works by artists such as Mai Ho and Kaisuke Ota and will feature new installations, including a work by Lu Hsi-Chien.  The second edition of TAI will be staged in the autumn of 2021, and the third and fourth editions will be held in the spring of 2022.Tickets for the Hong Kong Biennial will go on sale on September 28. The Hong Kong art market is expected to be in the red zone for the first time since 2016. Hong Kong’s art market is expected to expand by 4.3 percent this year, with luxury goods maker Valentino Rossi leading the charge. The exhibition, which will feature more than 60,000 works by thirty-eight international artists, has been pitched as Hong Kong’s “last great showcase.” The Hong Kong Art Museum (HAM), which opened in Sengkang in August, expects the number of visitors to increase by an", "The next Biennial should be held in 2020. The same year, the Netherlands will host an exhibition dedicated to the exhibitionist. “We are designing a platform that can be used by everyone, in a way that is accessible, accessible for everyone,” said van den Bergh. The exhibition will be hosted by the Van Gogh Museum in Amsterdam and the National Museum of Modern Art in the Netherlands.Commenting on why Biennials are so important to the Netherlands, van den Bergh said: “I just think that we live in a moment when the world is becoming ever more complex and ever more globalized. And I think that this is the moment when things really begin to move. I think it is the only moment of our lives in which we really have the possibility to start over and create new things anew, and I think that is exactly what we are doing.”\n\n\nThe Institute of Contemporary Arts (ICA) in Milan has announced that Valentina Ravaglia has been named its next general director. She succeeds Giuseppe Lotti, who retired after twenty-six years at the helm of the institution. During her tenure, Ravaglia oversaw the design of the institute’s design program, its international", "The next Biennial should take place in 2020.  The exhibition will be based at the museum’s new campus in the city of Nantes, France, with the support of the French government and the local community. The biennial will highlight the work of American artists, and will be organized in partnership with the National Gallery of Art in Washington, DC.\n\n\nThe National Museum of American Art (NMA) in Washington, DC, announced today that it is currently closed until March 18 because of the Covid-19 pandemic. The institution is working with the Centers for Disease Control and Prevention (CDC), the Food and Drug Administration (FDA), and the National Institutes of Health (NIH) to assess if it can reopen. According to the Washington Post, the CDC plans to open the museum in March, and the FDA expects to open the institution in March at the earliest.If the CDC and the FDA are successful in reopening the museum, it will be able to welcome visitors again. Since March is the worst month for Covid-19 to strike the United States, the museum will not be able to welcome the public until May 6.\n\n\nThe Tom Tom Bradley Collection of American Art in New York City is preparing to"]