["The next Biennial should take place in the coming months, and the second in the 2020s. The institution hopes to present a new selection of works by artists such as Clara Zingaretti, John James Gilded, and Grant Wood in 2020.\n\n\nThe City of Hong Kong announced today that it has instituted a temporary closure of all public places and spaces in Hong Kong City from May 21 to May 26, 2020, in an effort to protect the health and safety of residents, the environment, and the workforce. The schedule for the closure, which will last through June 15, is as follows:May 21–June 22: Closed until further notice.May 23–June 26: Closed until further notice.May 27–June 29: Closed until further notice. The decision to close major transportation hubs and major shopping areas has been made in order to mitigate the risk of a second Op-Op Civil War. Both China and Russia signed a treaty on the outbreak of a second Op-Op Civil War on May 6, but at an early date as Beijing sought to stem the outbreak. China and Russia have since suspended large-scale joint military exercises, but only after a formal declaration of the outbreak. The Cultural Capital of China, the Hong Kong Art Museum", "The next Biennial should be shut down as soon as possible.”According to the New York Times, the number of people who have died within the facility is at least 102, with as many as 124 injured. The Yale School of Art suffered its heaviest storm to hit the arts since the pandemic began. According to the New York Times, officials there are expecting up to 200,000 visitors.The storm has also forced the cancellation of a number of events slated for the five-week event, including the upcoming edition of Art Basel Hong Kong and the Singapore Biennale. The upcoming edition of the Bali and Art Dubai fairs, which was originally supposed to take place in the country next month, has also been put on hold.“The safety and well-being of our guests, staff, and the fairs and pavilions is of paramount importance,” said fair director Marc-Olivier Wahler in a statement. “As such, all future programming and rescheduling of the two fairs has been suspended.”\n\n\nThe world-renowned museum spanning fourteen hundred rooms at the Museum of Contemporary Art (MoCA) in New York has received a $1.75 billion gift of works by twenty", "The next Biennial should be announced in December 2020. Duarte leaves in early December. The 2020 event will be held at the Museo de Cultura Económica (MEC) in Madrid.   The full list of participating artists is as follows: November 21–December 22, 2020Bibliothèques de Bienne (Bienne, France)January 14–February 22, 2020Art Publishers Club (New York)January 29–March 7, 2020Art Press Gallery (New York)January 29–January 31, 2020ArtTours (New York)February 28–February 28, 2020Artilynx (New York)February 20–February 22, 2020Artforum (New York)February 26–February 31, 2020Artforum Europe (New York)February 28–March 3, 2020Artforum Japan (Tokyo)February 28–May 31, 2020Artforum Asia (Helsinki)January 29–February 31, 2020Artforum South America (São Paulo)January 29–February 31, 2020Artforum Southwest America (Argentina)January 30–February 3, 2020Artforum Southeast Asia (New Delhi)January 29–February 29, 2020Artforum Southeast Asia (New Delhi)January", "The next Biennial should be celebrated by the end of the year. The exhibition will continue with a new selection of works by contemporary artists that will be organized in a different manner and will be presented in the spring of 2022. The biennial will also include a selection of works by Teresa of Avilés\u0097an internationally known Mexican American painter and sculptor\u0097which will be shown in a special exhibition at the Biennial as well as a new book by Joseph Steinhauer. The show will be inaugurated by Joseph Steinhauer’s first book, Hélio Profesor: Lámpanitas y las ricas (1921–2018), which was published by the same publisher that published Sacred Hearts: Mexican American Artists and the American West (2017–2018). The exhibition will be followed by the biennial’s first film, a biennial of photographs by artist and filmmaker Otis Redding\u0097which was staged at the San Fernando Valley Museum of Art, in Los Angeles, in 2002\u0097and its first comic book series.The biennial, which was founded in 2007 by Robert and Marian Bi–Giroux to commemorate their parents’ passing,", "The next Biennial should take place in 2021.\n\n\nFounded by artists, artists of color, and artists\u0097including Darius Ali, Kate Mulgrew, and Evelyn Waugh\u0097in 1967, the Museum of Modern Art (MoMA), New York, has become a unique symbol of the city’s cultural heritage, with more than seven hundred works by seventy-four artists and collectives. The institution reemerged in 1971 as the Metropolitan Museum of Art, and became the center of a strange and vibrant community of artists, activists, writers, and musicians in the city.In the 1970s, the museum became known for its active and collaborative culture, in which a wide variety of artists participated\u0097from Rosalind S. Eliot and Robert Irwin to Frank Gehry and Jack and Marilyn. In the 1980s, the museum became known for its space-twisting exhibitions by artists such as Robert Irwin, Evelyn Pape, and Jean-Michel Basquiat. In the 1990s, the museum became a critical center for artists such as Paul Gauguin, David Salle, and Mark Rylance. In the 2020s, MoMA’s collection expanded to include works by artists such as Alice Ay", "The next Biennial should be held in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has named Cynthia Brandt as its next director. Brandt will take the helm of the museum from director Mary Anne Carter, who will retire on May 9 after more than twenty years at the helm.“We’re very excited about Cynthia’s appointment, especially since she’s been a transformative force at MFA,” Carter said. “With her deep and diverse knowledge and love of art, her passion for supporting the important work of emerging artists, and her ability to listen and see and connect, Cynthia is exactly the person the MFA team needs to continue to grow.”Among her many achievements are the creation of the MFA Artists’ Program in 2007, the first ever MFA Fellowships, and the creation of the Biennial for Visual Arts, which launched in 2013. A ten-year survey of contemporary art, the show concluded that art has played a major role in shaping the MFA’s international reputation, and the museum has hosted more than two hundred artists from eighty countries.\n\n\nThe New York City Department of Cultural Affairs has launched an ambitious new cultural redevelopment plan that aims", "The next Biennial should take place in 2021. “It is our duty as a commissioning body to reflect the spirit of the times and to respond to the needs and perspectives of our contemporary society,” said Johanna. During the next edition of the show, the team will explore the ways in which architecture and design can be used as a platform for social change and innovation. The first exhibition “Epiphany: How Design Can Make the World Better,” will open in the autumn of 2020.\n\n\nThe Metropolitan Museum of Art in New York has hired Seth Williams as its new senior curator of American art and design. Williams comes to the museum from the U.S. News & World Report, where he has served as the editor in chief of the magazine for more than ten years. He succeeds Amy Vermeulen, who retired in August 2019 after twelve years at the helm of the museum.“Seth brings a deep and enduring experience in American art and design in a time when the humanities and the social sciences are at the forefront of awakening publics to the wonders of nature,” said director Christopher MacGill. “His ability to integrate new and cutting-edge research, both technical and curatorial, is", "The next Biennial should be held in 2020.\n\n\nThe National Museum of Fine Arts (MoFA), in Washington, DC, has appointed Christopher Wool as its newest director. Wool will assume his responsibilities on February 22 following the retirement of Diane Russell, who retired in December 2019. Wool currently serves as a research professor at the University of Washington’s School of Art. Russell was succeeded by Brian Kelley as director of the National Museum of Fine Arts in December 2016.“Christopher Wool has been instrumental in transforming the National Museum of Fine Arts in Washington, DC, into a dynamic research institution that advances American art through an interdisciplinary approach to exhibitions and collections and engages with and reconsiders the history of art,” said Christopher Wool, the museum’s director. “His leadership and expertise in how a museum can better support the visual arts has had a transformative impact on the museum and on our collection and exhibitions. We are eager to bring him on board as we continue to advance our work in a collaborative and open way.” Wool previously served as the founding director of the National Gallery of Art in Washington, DC, and as a curator at an independent curator’s space in New York", "The next Biennial should take place in 2020 and is expected to take place in the city of Shanghai. For the first time, the exhibition will be hosted by an international organization rather than a Chinese institution. “The main objective of the new Biennial is to develop and develop a new kind of international relationship between China and the United States,” said German foreign minister Heiko Maas. “We are ready to play our part in shaping this future.”The exhibition comes at a time when Beijing is expanding its influence in the region. It has recently built up artificial islands in the Spratly and Paracel islands in the South China Sea and has made territorial claims in several other contested waters, including in the Paracel and Spratly seas. The Chinese government also recently approved the construction of fourteen new islands in the Spratly and Paracel seas. The works in question are the works of Feng Shui, Jie Zhongwen, and Wang Jun, as well as Ewan Le Gall and Francis Paine, both of whom have recently won international awards.\n\n\nWhile it remains unclear when a new report into the British Museum’s sale of twenty-four works by British painter David H", "The next Biennial should be held exclusively in Chicago, with a view to increasing the exhibition's reach beyond the city\u0097it is expected that the announcement of the 2018 edition, which will be at the Forty-Third Street Armory from September 5 to September 6 and will feature work by fifty artists, will be made in June.The closure of the exhibition follows a series of setbacks for the New York–based nonprofit, which recently announced that it would no longer organize the show in the city. In March, it announced that it was planning to lay off all sixty-two staffers\u0097more than two thirds of its staff. Last month, the organization laid off almost all of its artists, and this June, the staff was only permitted to leave the building for thirty-four hours a day, seven days a week.The Board of Directors of the Association of Independent Curators in the United States (AICA), which represents curators\u0097which include George Condo, Ann-Marie Condon, Patricia Hamilton, and David K. Levine\u0097issued the following statement regarding the closure of the show: “After a year of organizing and exhibiting in the Chicago art scene, we are very much in a position to offer a meaningful biennial", "The next Biennial should take place in 2021.\n\n\nThe Royal Academy of Arts (RA) in London has appointed Paul Mpagi Sepuya, the architect and curator of The Human Roll, as its new director. Sepuya will assume his responsibilities on February 29. Sepuya joins the academy from the Solomon R. Guggenheim Museum, where he has worked as a curatorial assistant since 2003. He succeeds Richard Toolt, who has served as the director of the museum since 2006, and will begin his new role on January 3, 2021. Paul Mpagi Sepuya’s naming welcomes an announcement that the academy has welcomed to its roster. After graduating from the Royal Academy of Arts in 2006, Sepuya worked at the Solomon R. Guggenheim Museum for a decade before moving to the University College London (UCL), to continue his studies at the University of Central Lancashire, and to gradually rise through the ranks of the academy. In a 2017 Artforum interview, Sepuya described working at the museum as a “very different kind of world.” Sepuya’s work is currently on", "The next Biennial should take place at the Northern Ireland Museum in Derry. It will host ten international presentations of work by artists from across the world in a single location. The event will also feature a review of the exhibition “Abandon all hope, no matter how high.”\n\nThe Smithsonian International Art Museum (SIM) in Washington, DC, has received a gift of eighteen works by German artist Karl Lagerfeldt. The gift includes works by artists such as Mina Hoch, Oskar Kokoschka, and Wolfgang Paalenbach. The works were donated by Lagerfeldt and his wife, Sabine Hoch, who is also a professor of modern art at the University of Heidelberg. The couple will be presented with the works during a special exhibition at the museum on September 21.Lagerfeldt was born in Berlin in 1932 and raised in the small town of Trier in the German state of North Rhine-Westphalia. He graduated from the Berlin Academy of Fine Arts in 1964 and received a Ph.D. in art history from the University of Heidelberg in 1969. In 1977, Lagerfeldt moved to the city of Dusseldorf, where", "The next Biennial should be held at least once every two years, with a maximum of five years of the exhibition. The Biennial will include work by artists whose practices are currently under-recognized, as well as a selection of works that are currently on display and will re-create the exhibition. The 2017 event, titled The Black Alliance, was curated by Frances M. Gramsci, the Italian curator of Italian art, and took place in Rome between November 9 and December 5.The 2019 event, entitled The Unity of the World, will be held in Milan between March 7 and March 15. It will draw from the work of sixty artists, with the theme of the year 2020, and will feature works that are currently in storage at the Museo d’Arte del Consumo and the Museo di Trisulti. The 2019 exhibition was curated by Oliver Goldsmith, the director of Tate Britain; Lin-Manuel Miranda, the star of HBO’s Hamilton; and Steven De Souza, the artist, curator, and educator best known for his drawings, sculptures, and installations.\n\n\nThe Metropolitan Museum of Art in New York has appointed Kristen Miro,", "The next Biennial should take place in January 2022 and will feature ninety-nine works by seventy-three artists from twenty-two countries. The theme of the exhibition will be “Art & Life in the Age of Resistance.”The inaugural exhibition was curated by the Saudi Arabian-born American artist Majid Saeed al-Qasimi and will run until March 14. The exhibition will feature works by twenty-four artists who are currently imprisoned in Saudi Arabia, including Jia Yu, Nima Nabavi, and Hamza Walker. The exhibition will also include works by artists such as Abdulrahman Al-Khudairi, Abdullah bin Utayd, Hoor al-Muthanna, and Ammar al-Qasimi. The event will be led by Ali al-Khalidi, director of the Al-Makrifa Art Museum in Al-Madina, and will be attended by Suleem Muthanna, the director of the Karakum Art Museum in Kabul; Abdulrahman al-Khudairi, the director of the Al-Madina Art Museum; and Nina Ashraf, the editor in chief", "The next Biennial should be held in 2022. The opening of the fourteenth Biennial, “View of the World: The Early Man of Cinéma” (2019), was postponed from 2021 to 2022. The construction of the Art of the Americas (2019) was also pushed back. The 2020 edition, which will be hosted by the Musée d’Art Moderne in Bordeaux, France, will not be staged until March. The 2020 edition of the Art of the Americas will be held at the Musée d’Art Moderne and will be held in conjunction with the 2020 edition of the Seventeenth Venice Biennale.“The themes we chose reflect the transformations of the twentieth century, and also the thirty-first century,” Jean-Pierre Berthold, director of the Museum of Contemporary Art, Paris, told The Guardian. “From the history of the twentieth century to the history of the twentieth-century, the artist developed new perspectives and developed new models. Our theme these days is questioning the historical trajectory and the history of art. The question of the physicality.”The opening of the exhibition marks the twenty-fifth anniversary of the Paris-based nonprofit O", "The next Biennial should take place in December 2019 in February and will be designated an International Exhibition. The exhibition will be centered around a collection of works by thirty-six artists, including Yee Tai, Annamaria Cattelan, Laura De Marzo, B.J. DeSOUSSA, Reem Vassy, Nicoletti Cattelan, and Yoko Taro. The exhibition will also feature the works of thirty-six lesser known artists, including Nari Ward, Kiki Smith, and Thomas A. Wilson. The biennial is curated by the artist-in-residence, Nicholas Pinchuk.\n\n\nThomas A. Wilson has announced his departure from the residency program at the Brooklyn-based nonprofit Broad Institute. “The biennial will be defined by its exploration of the ontological, epistemological, and the ontological-emotional dimensions of the human experience,” Wilson wrote in a statement on his departure. He also emphasized that the work’s “spiritual and cultural contribution will continue to shape the narrative of the Biennial.”Wilson, who began working at the Brooklyn nonprofit in 2014 as its artistic director, will depart after the festival, which runs through August", "The next Biennial should take place in the Dutch city of Utrecht in September 2021. The 2020 theme Body and Space is returning to the United Kingdom. The 2019 tribute was The Body and the Sound of Music; the 2018 theme was The Body in Art. The 2019 edition of Body and Time was held in the Netherlands, and the 2019 exhibition was staged at the State Museum of Art in Rotterdam. The 2019 exhibition featured work by twenty-three artists, including Lars Donert, Sam Delacroix, Karel de Soert and Ulrich Obrist; the 2018 show was Body and Time Workshop.The 2019 exhibition closed with a performance by Joachim Neubert, and Daniel Beck, who each presented work that revisited the theme that year, Body and Space. The 2019 show featured work by fifteen artists, including Germaine de Kooning, Natalie Hobsbawm, Annie Godfrey, and Kasmin. The author of this year’s biennial was Anne-Marie Aller, who will be awarded the 2019 Michelin Prize in Paris. The 2019 list of winners comprises ", "The next Biennial should take place in 2020 in Guadalajara, Mexico; the site of the upcoming exhibition “California Stories,” which is being organized by the Kerouac Foundation and the Museum of Fine Arts, San Francisco, and is slated to run from March 19 to March 21. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Vikram Gill as its next director. Gill joins the institution from the Museum of Modern Art, which he inherited from his father, in 1992. Vikram Gill, who has served as director since 2003, has overseen the museum’s transformation from a mid-century institution dedicated to the study of the modern art world to a major cultural institution in the city. During his tenure, he also joined the museum’s board of trustees and helped raise funds for its acquisition of more than fifty works by artists such as Alice Aycock, Barbara Cooper, and Halston Gilbert, among many others, and oversaw a $50 million donation to the museum in 2017.“We are immensely grateful to Vikram for his extraordinary leadership in our transformation from a mid-century institution focused on the study of the modern art world to a major cultural institution", "The next Biennial should be held at the new venue, which will be inaugurated by a series of exhibitions celebrating the history of the city in the first half of 2020. The exhibition will include studies on the city’s history from a wide range of artists and institutions, including the Museo de Arte Contemporáneo Nacional (MASN), and will be hosted by the artist-run museum.The first Biennial of the Democratic Republic of Congo (Burma) will be held at the new venue in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Miami Beach has announced that it has received a gift of forty works by five artists\u0097Jovan Abramović, Elin Østby, Nilo and Tatjana Rensgen, Lourdes Varejão, and Seychelle Sarr\u0097from the Grandmaster Charles Berlind, who passed away on December 28. The exhibition will present the work of the artist in the form of a single frame, which will be carried into the exhibition as part of the exhibition “The Artist’s Century” in March 2020.“The gift of the master’s art was made in recognition", "The next Biennial should be held in 2022.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has appointed artist-in-residence Mark di Suvero as the new director of the Pantheon, which has a permanent collection of more than 2,500 works in its collection. Di Suvero, who currently serves as head of the department of early childhood education at the city’s Department of Education, is the founder of the nonprofit The Procession and is currently collaborating with EXCELSION Theater and the Museum of Modern Art to create a new stage, called the Procession Stage, that will explore the history of the institution’s collection through a number of ambitious projects.“The Pantheon is at the forefront of a major visual tradition in New York that exemplifies the spirit of the twentieth century,” Dia Art Foundation president and CEO Johna Cahn said in a statement. “Mark brings a rich and compelling history of the Pantheon to the modern age, and we look forward to working with him as we continue to expand the legacy of the Pantheon as a world-class contemporary art museum. Mark’s vision will forever shape the future", "The next Biennial should be on the theme “Ideas, Politics, and Culture: Avant Gardes & Biennials” and will take place in the spring of 2021. The exhibition will present nearly 1,500 works by forty-eight artists, including video artist Pablo Picasso, who is currently on display at the Smithsonian American Art Museum (SAAM) in Kansas City, Missouri; Arts of Life and Death: Guerrilla Art in the Gulf War’s Gulf Wars I and II; and Chinese artist Zhong Yijun, who claimed the title of the first man to work in video.The 2022 and 2023 editions of the Biennial will be held at the National Museum of Fine Arts, Washington, DC; the Metropolitan Museum of Art, New York; and the San Francisco Museum of Modern Art. The National Gallery of Art in Washington, DC, will host the 2022 iteration of the National Biennial, “Black Lives Matter” and the exhibition “Sun, Wind, and Rain.” The gallery will also host the exhibition “Tungi: A Retrospective of Asian Art” (2019) and the residency program “Japanese Art in the United States�", "The next Biennial should be held sometime in 2020, he said. The exhibition, titled The Past, will be curated by the artist-in-residence, Claudia Belloni, and will be held at the Museo de Artes Alpes, in the capital of Florence, from April 13 to April 15.The festival will also feature the first retrospective of the late-Sigmund Freud, and the first show dedicated to Chinese art. The inaugural exhibition, The Future Becomes the Past, will be staged in June 2020. The second, The Color of the Past, will be staged in September 2020.The exhibition will run for twenty-four hours at a time, from January 13 to March 31, 2020, and will feature twenty works, most of which were created prior to the outbreak of World War II. Among the pieces that will be on display are works by artists such as Fernando Campos, who is best known for his sketches of landscapes and historical figures such as the former director general of the United States, George S. Patton, and Hiroshima University professor Toshio Suzuki, who was responsible for the development of the Japanese concept of the ich", "The next Biennial should take place in 2021. Those who wish to participate should complete an online application by December 15, 2020. The deadline to apply for the exhibition has not yet been set. The biennial will be hosted by the König-Stiftung in Cologne and will showcase the work of seventy-eight artists.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of twenty-three works by forty-six artists selected by its board of directors. The gift includes artworks by forty-five artists that are currently on display in the institution’s newly constructed, thirteen-story, 200,000-square-foot, fabled Goldsmiths Museum. The gift also includes five works by unknown artists that will be on display in a museum exhibition later this year.The board of directors is made up of Sheila Kornbluth, director of the Kornbluth Gallery at the Museum of Modern Art; Michael White, director of the Los Angeles County Museum of Art; and Annie Shatz, a LACMA trustee.“We are extremely grateful for the enthusiastic response of our board to this year’s challenge and to the artists who have chosen to contribute to LACMA,�", "The next Biennial should take place in 2020 and will aim to present the first European artistic representation of the work of the artist in his lifetime. The 2019 edition of the exhibition featured work by forty-one artists and occurred in both the Basel and the Hong Kong Biennials.\n\nThe Pérez Art Museum in Mexico City has appointed a curator to its collection of Pilar Corral-Barré paintings, which were discovered in the Museo del Artes Plásticas in Mexico City in 2006. She will be tasked with developing a new collection of the artist’s work and to helping the museum become more culturally engaged with his legacy.“We are very excited to support the work of the legendary Mexican painter Pilar Corral-Barré by bringing her paintings to Mexico City’s Pérez Art Museum,” said Monica Barilla, the Pérez Museum’s director. “In celebration of its grand opening, the institution will present Pilar Corral-Barré’s Pueblo de la Universidad de los Andes in 2019. Pilar Corral-Barré’s paintings will be on display in ‘Pérez Art Museum�", "The next Biennial should be held in the spring of 2021 and will be composed of two sessions: the first, involving some sixty artists and cultural professionals, is slated to take place in the summer of 2021. The second will be organized in the fall of 2021. The 2017 edition of the Venice Biennale, which was hosted by the city of Venice in cooperation with the Artists’ Alliance, featured more than seventy-five works by eighty-nine artists.\n\n\nMuseum of Contemporary Art (MoCA), San Francisco, announced today that it is working with the Institute of Contemporary Art (ICA) to create a new cultural collaboration program centered on the art of the Bay Area. The initiative, which will focus on creating opportunities for local, regional, and national artists to collaborate, will partner with the ICA to foster the exchange of work across the region.“We are delighted to provide an opportunity for artists working in the Bay Area to collaborate with the ICA, and particularly with the ICA in San Francisco,” said Museo CEO Cora Cropper. “The new partnership will present the Bay Area artists with a unique opportunity to work with the ICA in their home city and will showcase the ICA’s", "The next Biennial should take place in the fall of 2020. The theme of the current exhibition “Art and History: From the American Civil War to the Future Present,” curated by Alison Knowlton and moderated by Laura Mulvey, is “The Politics of Memory.”The biennial will include twenty-six exhibitions that examine the history of the artist-historical, from the American Renaissance to the present day. The first show will focus on the American American painter William Kentridge, whose early work includes works on paper and images; the second on the American professor John Cage, whose work includes paintings and sculptures; and the third on the American sculptor Frank Gehry, whose work includes lifelike works on paper and images. The last show will examine the influence of the American artist-historian F. R. G. Bickel on the contemporary artist-historian.\n\n\nNew York’s Metropolitan Museum of Art has hired researcher and curator Tara Donovan to lead a new research program that will examine how the Metropolitan Museum of Art has positioned itself to attract new audiences and retain its cultural and historical legacy. Donovan will begin her work in December and will initially focus on the history of art at the museum, which opened", "The next Biennial should take place at the Art Institute of Chicago in the spring of 2021. \n\n\nThe Museum of Contemporary Art Portland is working with the Portland Art Museum and Rose City Art Museum in California to bring a new collaborative exhibition called “Unfinished Business: Art and the Struggle for Civil Rights” to the Portland Armory in the spring of 2021. The show, which will feature contemporary art created by African American artists and non-Native American artists, will be organized as part of the museum’s new partnership.“The partnership comes at a critical moment for the African American and Native American communities, as their rights are being celebrated and their work being celebrated with greater fervor by museums and institutions across the country,” said Mike Ehrman, the museum’s director. “This partnership will allow us to continue to celebrate the history of African Americans with a greater degree of authenticity, and to grow our collections and exhibit galleries in ways that truly reflect the communities we serve.” The museum will also develop a new series of lessons, called “African American Art in the Oregon Northwest,” that will stress the history of African American artists and their contributions to the state of Oregon. The exhibition will also feature work", "The next Biennial should be held at the Diller Scofidio + Renfro Campus, in the Piedmont Corridor, in Milan, on August 27–September 4. Bosch has also worked to expand its membership base; last year's event, which drew 1,200 visitors, was attended by 1,500.The fourth edition of the exhibition, titled “Future Present: Just Art and Change,” will be hosted by the Diller Scofidio + Renfro Campus and will run from September 3 to September 13. The fifth edition of the exhibition, titled “Kafka and the Modernist Movements” was organized by the São Paulo–based artist Gerardo Boné and will take place at the Kunsthalle d-Art Moderner Kunst (KUNSTAL) in Frankfurt from September 14 to September 16. The sixth edition of the exhibition, titled “Horizont,” will be staged at the Institute of Contemporary Arts in Berlin from September 16 to September 20.The KUNSTAL is also planning to add more than three hundred works to the exhibition, which is currently held at the Bodega da Cunha Museum in Lisbon. The institution is", "The next Biennial should be held in 2022. The Biennial of the City of New York is currently under consideration. “I am deeply honored to have this opportunity and continue to work with artists to help their work reach new audiences,” said Arturo Rosales, director of the Los Angeles County Museum of Art. “This is a defining moment in my career and a watershed in my career as a curator. The story of the artist was selected in a competition organized by the Los Angeles County Museum of Art and the Los Angeles County Museum of Art was selected as the theme for this century’s Biennial of Art. I am thrilled to be a part of the future of art and am confident that working with my colleagues, Jackson Pollock, and others, will bring additional artistic and conceptual strength to the new exhibition series.”Remarking on the selection process, Roberta Pollock, chair of the board of trustees of the Museum of Modern Art, said: “I was honored to be asked to serve on the board of trustees for the fourth Biennial of Art. I have worked on the topic of exhibitions, and especially the art of the exhibition format, for twenty years. The selection of the artists and their discourses", "The next Biennial should be held in Beijing in the spring of 2021, with a possible opening of the exhibition in the autumn of 2021.\n\n\nThe Smithsonian’s National Museum of African Art (NMA) in Washington, DC, has appointed Annie deMause as its next director. DeMause comes to the institution from the Metropolitan Museum of Art in New York, where she has served as its director since January 2019. She succeeds Carolyn Ritchie, who departed the institution in July 2019 to head the Metropolitan Museum of Art, and will assume her responsibilities in January 2021.“I’m thrilled to welcome Annie to the NMA and to collaborate with her on the next chapter of the exhibit,” said Michelle Johnson, the institution’s director. “We were able to secure her expertise and leadership qualities to advance the museum’s mission of representing the visions, histories, and stories of African Americans through the installation of the first exhibition dedicated to the history of slavery in the United States. I’m confident that she will further the museum’s position as a leading museum in its history by championing the institution’s ambitions, fostering our community’s relationship with the institution, and serving as a", "The next Biennial should cover “exhibitions, exhibitions and performances,” and “the role of art and culture in the contemporary world.” Though the inaugural edition of the upcoming edition will unfold in the United States, the venue will be relocated to a new location in Hong Kong. The exhibition will also be held on the occasion of the Hong Kong International Festival.The 2022 edition will take place at the Kunsthalle Basel and will be hosted by Kunsthaus Berlin. It will be hosted by Chanel Nees and will be curated by Hindustan Times writer and curator Svetlana Zhonskina.\n\n\nSinger-songwriter-songwriter Mark Rylance has been cast in the next season of BBC America’s Doctor Who. The fourth episode, which premiered on Friday, March 21, will feature a new companion character, a woman who is part of a new race of Time Lords known as the Twelfth Doctor (Matt Smith), and will premiere on October 8.The role of Rylance, who has been writing for BBC America since 2011, was first proposed by David Mackenzie, who helmed the original series for seven seasons (1993–1996), and will first appear in episode four", "The next Biennial should open in 2021, with the exhibition's first edition in 2022. “Dátma’s last work, 2014, was a collaboration with the Montréal–based artist Etchéléa.”\n\n\nGerman artist Karl Lagerfeld has won the Deutsche Kunsthalle Berlin (DKGB) Berliner Kunst (BUNK) as well as the prestigious Design Berlin award.Lagerfeld, a multidisciplinary artist who is best known for his evanescent, improvised landscape sculptures, which range from whimsical polyester sculptures made of human and antarctic tissue to large-scale works that manipulate aspects of nature, became the first artist to win both the Design and Designers’ Berliner Kunst (DKGB) and Design Berliner Kunst (DKK) awards in the same year.Lagerfeld’s work has been featured in a number of notable exhibitions, including the Venice Biennale (2013); the Prague Art Exhibition (2014); the Metropolitan Museum of Art (2015); and the Fondazione Prada (2016). His work has been created or adapted for the screen in a number of films, including Kramer and Lassiter", "The next Biennial should start in March 2020. \n\n\nThe Danish art historian Jørgen Tellinghuisen has been named the winner of the prestigious $50,000 Atlas Prize, which honors artists who have made significant contributions to their countries and the world. In a ceremony at the Danish Embassy in London, Tellinghuisen was presented with the award for his design for the Danish pavilion at the upcoming Copenhagen Biennale, which is currently on view until March 21.“In the past years, Tellinghuisen has been nominated for several awards, including the Norman Black Art Prize in 2013 and the Peter Eisenman Award in 2015, but never received any of them,” Danish Minister of Culture Morten Anderegg said in a statement. “Now that he has won this award, we can expect his next project to be at least a statement in the form of a show.”In a statement published on August 13, the Danish Ministry of Culture said that the award was awarded to Tellinghuisen “as an artist, thinker, writer, and curator, and not for any particular achievement.” On the ceremony, which took place at the Danish Embassy in London on September 4, Tellinghuisen", "The next Biennial should include a list of fourteen artists whose work is currently exhibited by the museum that is collaborating with the museum on a new project, and a selection of works by twenty-seven contemporary artists whose work is currently on display. The exhibition will open on September 25 and run through October 12.“The Biennial is an extension of the Museum’s mission to present and inspire transformative art to meet contemporary needs of our world,” said Jim Dolan, the museum’s director. “The exhibition will engage with recent and prehistory, with significant contemporary artists, including Simone Leigh, Taima Massey, and Jannis Kounellis, and will celebrate the critical role that art can play in connecting and strengthening communities.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has added Blake Schoonmaker to its curatorial team. Schoonmaker, whose practice spans photography, sculpture, video, performance, and theater, has been appointed associate curator of contemporary art at large. Previously, she worked as a curatorial assistant at the Museum of Modern Art and as a curator at the Bronx Museum of the Arts.“Blake brings with her a wealth of experience, breadth of understanding, and creativity", "The next Biennial should be held in the city, which is home to more than 2 million people, in 2020. The event’s organizers are currently in the process of setting up a platform, called The Biennial Tracker, that will track the exhibition’s progress and allow the public to keep an eye on the exhibition.The full list of participating artists is as follows: Achille Castello (New York)Alfred L. Albright (New York)Alan Parsons (New York)Alberto Zurawski (New York)Anneliese Colombo (New York)Anneliese Debie (New York)Andrea Dwork (New York)Raimond Godet (New York)Anneliese Golinksi (New York)​George Morton (New York)Alfred Parsons (New York)Harry Bourne (New York)The Artist’s Colony (New York)Arts of Beauty (New York)Alfred Stieglitz (New York)Alfred Strassberg (New York)Artists’ Camps (New York)Bertrand Langret (New York)Diana Langret (New York)Dennis", "The next Biennial should take place in 2021. Though it will be a departure from the Biennial of Modern Art, the exhibition will be an extension of the art, culture, and design programs of the city—and will be organized as a Connecticon for London, the first major British city to launch its own biennial.\n\nLévy Gorvy, the internationally recognized luxury conglomerate known for its high-quality products, has announced that it will invest an additional $250 million in Europe over the next four years as part of a new strategic plan. The funds will come from three sources: 1) From the long-standing partnership between the company and the London-based philanthropist Richard Branson, who will donate $250 million over three years; 2) From the business partner Max Moschella, who will donate $150 million over three years; and 3) From the art director Christa McAuliffe, who will donate $125 million over three years.“LGP is committed to helping small and mid-size galleries and arts spaces thrive and thrive in London,” Richard Ghebesh, director of LGP, said in a statement. “This is an exciting time to support galleries and we look forward to working with", "The next Biennial should include a statement of purpose, an opening statement, and a closing statement. Cleveland’s Phase 4 will also incorporate a new way of organizing events, which will be announced in the coming weeks. The pavilion will host a series of exhibitions that will showcase the work of artists from twenty-four countries in the year 2020. “It’s been a transformative experience to support artists in the United States, as we have not had an exhibition dedicated to their work in twenty-four years, and it’s been a critical partnership for many years now,” said Hannu Olofsson, chair of Circle. Artist-run galleries across the US are now facing a new round of budget cuts and furloughs as the US economy slows. Among the artists whose works will be on display at the biennial are Carmen Otero, Denis Villar, Fons Hof and Marianne Haag, and Anton Kern. The next edition of the Fifty-Eighth Venice Biennale will take place in 2021. \n\n\nThe Manchester Art Gallery (MAGB), which has been closed since March 13 due to Covid-19, has appointed the director of its European department,", "The next Biennial should take place at the Museum of Modern Art, in New York, in 2021. Its theme, “In Defense of the World,” will address the ongoing threat posed by climate change and the impact of invasive species. Among the participating artists are Pia Camil, Wangechi Mutu, Richard Tuttle, and Tintin-esque Michelangelo Antonioni. Upon learning of the event, Geneva-based artist and activist Nissim Bhabha called the upcoming event “a signal of the times we live in. It is the moment when we are called to account for the destruction of the planet.”\n\n\nThe Royal Academy of Arts (RA) in London announced today that it is launching a series of exhibitions devoted to philosophers, mathematicians, scientists, and artists. The eight-month-long exhibitions, “Orientations,” will examine the ways in which philosophy can be used to engage with the mysteries of the universe and the way it connects with the rest of nature, with the exhibition marking the opening of the titled “Paper and Iron.” The show is part of the Royal Academy of Arts’s five-year $3 million renovation, which also", "The next Biennial should be the eleventh, in May 2020. The theme of the exhibition is “the transformation of our world.” The exhibition will include live performances, performances of work by art, and other events, with fifty works selected for exhibition in the exhibition.Nusa Massa (2018–2019) is currently on display at the National Association of Arts in Washington, DC. The biennial will run from March 10 to April 21. The exhibition is a joint initiative between the Smithsonian American Art Museum (SAAM), the James A. Farley Center for American Art, and the National Endowment for the Arts (NEA). The two partners have twice before partnered on American artists’ projects. The show will feature work by seventy-eight artists, including Robert Irwin, Howard Ashman, Alighiero Bagnall, Hélio Pérez-Perez, Karen Kilmnik, F. W. Mumm, David Lebovitz, Howard Shore, Norman Rockwell, Ermanno and Erma Solti, and Berenice Abbott. Other highlights include Joslyn Whitehead’s The Box, 2010, which followed the Japan Box Project, an exhibition of", "The next Biennial should take place in 2020.\n\n\nThe Centre Pompidou in Paris and the Tate in London announced today that the two institutions will collaborate on a new public art project. Titled The Bénétière Tous Les Dessins (The Gardeners Are Coming), the exhibition will feature 150 works by some 1,500 artists from thirty-five countries. The theme of the exhibition is “Art and Science”\u0097a nod to the French philosopher Pierre Bourdieu’s famous dictum that “Art is the science of the universe.” The work of the project will be curated by the artist-in-residence of the Centre Pompidou, Laurent Bénétière, and will be mounted in French, English, and German. The artwork will be made from the enchanted stones of the Château Pompidou, the Parisian Pyrénées–Prestel, and the Punta della Dogana.The exhibition is part of a partnership between the central arts institution and France’s Ministry of Culture, with the mandate to “promote public awareness of contemporary art and its historical importance and to implement its values.” The Centre", "The next Biennial should be held in 2021. The museum has been closed since March 26 due to COVID-19.\n\n\nAmerican artist Philip Larkin passed away at age seventy-four on October 3rd, after a long illness. Born in New York on January 7, 1927, Larkin developed his recognizable abstract style during the 1960s and 1970s, when he lived in Los Angeles. He was known for depicting rural landscapes, often in photographs, with a stunning array of silver, steel, and aluminum works, some of which had been made in small exhibitions in Los Angeles or New York at the time.The collection consists of twenty works, including photographs of farmland, a cabin in the woods, and a well-known Larkin installation, The Dandelion Tree, 1966, in which a single tree depicted a woodland landscape. For his work The Wind Rises in a Forest, Larkin fabricated a landscape from layers of steel, from which the tower of the Wind Farm rises from the ground as a dramatic backdrop.In a retrospective of his work at the Museum of Modern Art in New York in 2004, Larkin said: “The trees in the forest are not ornamental or useful or of any particular value, but they are", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles announced that it has received a gift of eleven newly discovered works by Johann Wolfgang von Goethe in its collection. The work, which was added to the collection last spring, is a collection of four works from his series “On the Flight of the Wolf,” which were first published in a retrospective organized by Goethe in the city of Alserpolis in 1846.The work, which was discovered in an exhibition that was staged at the MCA in November 2019, was purchased by museum director Eric Goldman in exchange for the collection’s management and management consulting services. The MCA plans to merge the works with the newly acquired works, which include pieces from the first two books of Goethe’s Cycle of the Wolf, which is considered the first German calendar.“The acquisition of the works is a milestone for the MCA,” said Goldman. “The inclusion of these works in the collection is one of the most important introductions to Goethe’s oeuvre. The series consists of a series of paintings, sculptures, drawings, and prints with a particularised critique of modernism and", "The next Biennial should take place in September 2020. This is likely to be the last edition of the exhibition, either in person or on paper, with both Adam Dallenbach and Nancy Lawler taking up the mantle this year. “The exhibition has always been about connecting to and creating the work of artists, but now we have the opportunity to create a new kind of art,” said Dallenbach. “I can’t wait to see what this new World Biennial will achieve.” The exhibition’s curators, Craig Bennett and Elin Eriksson, spoke about the future of the exhibition in a letter published by the Danish Cultural Foundation this month: “We are excited about the future of the exhibition in the words of its signatories: 'Creating a new world, new situations, new relationships, new visions, new paths.”Eriksson added: “The Biennial offers an opportunity to develop an independent and resilient vision of art through the artist’s world, and to create new experiences in collaboration with the artists themselves. The themes of the show are not about merging the art world and the artist’s world. The themes are about creating the", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid in 2021, and the first exhibition should open at the Museo de Arte de Madrid in 2022.The prize, which was established in 1983 by the Spanish architect Fernando Burles to promote the work of contemporary artists, is awarded annually in the form of a prize that is presented by the winner to the artist who best represents the theme of the Biennial. The prize jury was composed of Renata Brindisi, Gabriel Balbi, Fernando Burles, Vittorio Cattani, and Marco Cipollini.The winner will be announced at the San Ildefonso Museum in Madrid in March 2021.\n\n\nFrench artist Alain Guiraud, who created a series of works that appear to be a combination of moviemaking and theater, has died at the age of seventy-eight. Guiraud was born in Lille, France, in 1931. After graduating from the Sorbonne, he studied at the city-state conservatories of Paris and Saint-Denis and then at the Paris Academy of Fine Arts, where he received further training. In 1981, Guiraud moved to Paris, where he continued his", "The next Biennial should take place at a location chosen by the City of New York. The venue will be determined by an ordinance adopted by the City Council. The council will then vote on whether to proceed with the festival.“The city’s celebration of New York has always been about more than just the city,” said Christopher Wool, chair of the city council’s cultural affairs committee. “It has always been about the work that it has done to shape the very fabric of the city. For thousands of years, the city was a crucible of creativity and innovation. The work of the biennial will evolve that hub into a kind of modern-day outpost in the heart of New York, where people can come together and have a great time.”\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is planning to open in the summer of 2022, following a project schedule that includes construction of an indoor-outdoor Pavilion for the Arts and an outdoor plaza. The exhibition space will be located on the third floor of the iconic building, which comprises four historic buildings at the same time: the Museum of Modern Art, the Metropolitan Museum of Art, and the Solomon R. Guggen", "The next Biennial should take place in Beijing from June 24 to June 28. As part of the upcoming exhibition, the Museum of the Chinese American Experience (MCAE), a newly-open museum in the former MCAE building, will host a series of presentations and tours in which American and Chinese intellectuals, artists, and activists will discuss issues related to the arts, culture, and culture of the Pacific Islands.The exhibition will be curated by David Forman, curator of American art at the Museum of the Moving Image in New York, and will be co-chaired by Arthur Gough, president of the Museum of Modern Art, and Luje (pronounced Lun-je). The project is part of the MCAE’s ongoing strategy of integrating contemporary art with contemporary life in New York City and is also part of an ambitious plan to transform the city’s Chinatown neighborhood into a museum that can become a core part of New York’s cultural life.According to Artnews, the proposed exhibition is part of MCAE’s ongoing redesign and expansion, which took it from a collection of one hundred million objects to a collection that will encompass 300 million objects by the end of 2020. The MCA", "The next Biennial should be held in 2022, the museum stated. The date for the twenty-fifth iteration of the exhibition, titled “From the Shadows to the Light,” was also set as a guarantee for a new exhibition titled “Connections.”The announcement marks the first time Museum Basel Switzerland has publicly acknowledged the exhibition. The institution first approached the Swiss association for the exhibition in 2016, and then invited the duo to participate in the 2019 edition, which took place at the Rüdiger Strasse in Basel, Switzerland.\n\n\nThe William and Mary Museum in Virginia announced today that Sarah Estévez has been hired as its new associate curator of foreign art. Estévez will be tasked with identifying the main works and exhibitions made by artists from the Middle East and North Africa. “Sarah brings a wealth of experience and expertise to the William and Mary, including a decades-long curatorial career focused on Middle Eastern art and a decades-long curatorial career focused on art from the African continent,” said director Mary Anne Carter. “Her achievements and contributions to the museum’s collection reflect her passion and commitment for the art of the Americas. The museum has a long history", "The next Biennial should take place in the spring of 2022.\n\nThe research and the exhibition happened in the context of a year of artistic experimentation and critical thought centering around the ethics of the body and the construction of a more compassionate and inclusive society. Among the works featured in the exhibition were works by artists such as Yoko Ono, Jean-Michel Basquiat, and the Italian architect Silvio Brunelleschi, which were on view as part of the inaugural exhibition, “The Body Art Museum: The World as a Body,” which opened in June 2019. The exhibition featured works by artists such as Ravi Shankar, Walter de Grood, and Thomas Joscelyn-Williams, among others who have made significant contributions to the field of body art.The biennial’s inaugural event, “A Future to Afford,” was organized under the auspices of the artists’ collective. The exhibition—which comprises three hundred works, the majority of which are from the collection of the Russian sculptor Ogon, who passed away in November 2019—was inspired by and filled with works that are from the collection of artist Milovan Viso, who is known for his laboratory works", "The next Biennial should be held in 2021, and the twenty-fifth in 2022. The forthcoming exhibition “The Art of Life” will be staged in the Museum of Modern Art in New York from January 29 to February 21, 2022.\n\n\nTaipei’s New York Academy of Art (NYAC) announced on Monday that it will resign in February 2019, following months of protests from artists and activists who have called for its withdrawal from the triennial that began in January 2019. The move follows a wave of resignations from GAIM, the New Art in Taipei, and Palazzo delle Papesse, a contemporary art museum in Rome, which called for its cancellation amid the coronavirus outbreak. The moves follow months of criticism and protests in the art world and media for the academy’s decision to remain closed and its treatment of the coronavirus—its longest-running exhibition in the United States—and its silence about the outbreak of the virus in China. While the majority of artists and art workers in Taiwan signed a statement of dissent published by the Art Newspaper on January 26, the institution officially announced that it would remain closed until March 14, the deadline for other events and for international", "The next Biennial should take place in the Kingdom of Saudi Arabia, in 2021. The 2020 edition, titled \"Feminine, and Fragile: Art and Politics in the Age of Black Autonomy, will be held at AlUla, the AlUla Art Museum, in Mecca. The 2020 edition will also include the first exhibition of work by artists of the AlUla Art Museum, the first institution of the AlUla Art Museum, and the first officially commissioned work by an artist of Saudi Arabians, Iranian, and Lebanese descent, to be held by an artist of Saudi Arabian origin. The 2020 Biennial will be hosted by AlUla Art Museum and the Saudi Arabian Ministry of Culture, and will be inaugurated by artist Nima Nabavi, who will create the exhibition “Dubai at Noon” in partnership with Dubai Art Week. The event will be organized in conjunction with the theme “Feminine,” a term that was coined by Tunisian-born artist Rashid Johnson to describe a “bellic, visionary, and vulnerable female voice of the Arab Spring.” In the “Feminine,” women are presented in an unpretentious", "The next Biennial should take place in 2021. The institution has not yet announced the date or the venue for the exhibition.\n\n\nThe collection of the Museum of Fine Arts (MFA) in Boston has announced the acquisition of forty works by thirty-four artists from the collection of the late John McAllister, including thirty-one works by Norman Rockne, thirty-one works by Ernest Hemingway, and twenty-nine works by Edward Hopper.An overview of the acquisition can be found in a statement that was released by the museum on Sunday, November 14. MFA director Peter Heller said: “John McAllister was one of the most important contemporary collectors of American art. His expansive and deeply personal collection reflects his exceptionally good taste and his enduring commitment to the arts. With his passing, the collection will be included in a museum of the American art. We are proud to present the works in the collection that were acquired by John and to present the artists whose work was inextricably linked to the collection.”The forty-nine works acquired by McAllister include the celebrated abstract compositions of the late artist John McAllister (1974), whose more than four-hundred-work collection includes works by Pablo Picasso", "The next Biennial should be held in 2021. \n\nThe biennial, titled Wangari Damodaran’s Art of Life, will focus on the art of life and the practices, institutions, and institutions of art. The exhibition will run from December 25 to January 3, 2021. The theme for the event is: “The Body,” the body, the body, the body, the body, the body, and the body.”The biennial will have a total running cost of $145,000. The organizers, Klaus-Dieter Hoffmann, and Kamala Weiss, presented the proposal for the exhibition, which was directed by Alexandre Loa, at the United Nations in March. The exhibition will include works by 15 artists, including Renan and Paul Stam, and will be organized in a manner similar to the exhibition “Wangari Damodaran’s Art of Life,” which was held in 2001. In 2012, Hoffmann and Weiss organized the exhibition “Wangari Damodaran: Transformations of Life.”The opening of the exhibition was originally postponed from October 2019 to October 2020. However,", "The next Biennial should be held in 2021 and will be organized as a platform for the worldwide movement of art. The event will be hosted at the Museu de Arte del Palacio and will consist of a series of exhibitions that will address issues such as: the relationship between art and politics, art and life, art and the environment, art and architecture, art and music, and art and art and the natural world.” \n\nThe Archive at St. Paul’s United States Holocaust Memorial Museum (USMH) has been designated an “unofficial world heritage site.” In a statement, the institution said that it hopes the designation will prompt the United States Congress to approve a permanent endowment for the museum, which is housed in a former munitions factory in a former cotton mill in West Saint Paul, Minnesota. The museum is also seeking $50 million for its permanent renovation, and $25 million for its renovations to its grounds.USMH director Dennis Prager said: “In the interest of protecting and promoting the universal value of human life, the museum’s staff and I are proposing that the museum become a permanent resource for the public and that the museum be located on the first floor of a modernist building on", "The next Biennial should set a new precedent for building a more inclusive and equitable world, one that puts and renews the dreams of thousands of artists.”\n\n\nArt Fund has received a significant donation of twenty-three works by artists who chose to remain anonymous for the upcoming edition of Art Basel Hong Kong, which will take place in the city in March 2020. The seventy-five works, which were selected by renowned Hong Kong–based auctioneers Kunal Bahl and Kim Eun-sung, will be displayed in the first exhibition of its kind at the venue, which has yet to announce an opening date for its second edition, which will take place in November 2022.“Artists have always been at the heart of many auctions, and we are delighted that this year will mark the first time that the artworks will be on display in Hong Kong,” said Kunal Bahl, who established his gallery in 2013. “The works in the exhibition are intended to reflect the diverse histories of artists working in the region and provide a unique insight into the global art market.”Awards for the show will be given by Sundaram Tagore, Gere Kavanaugh, Xian Lijun, Panayi Lu,", "The next Biennial should be organized in Spring 2021.  The event will be organized under the theme, “Art and Art History,” and will be led by Megumi Ogawa, curator of contemporary art, Tokyo; Hideo Ota, director of the Tokyo Art Museum; and Masao Nakayama, director of the Chiba Museum of Art. The first iteration of the event, held in 1976, drew some 6,000 visitors. \n\n\nAmerican Ballet Theatre (ABT) has appointed Peter Sellars as its new artistic director. In his new position, which is currently unpaid, Sellars will oversee operations in the United States and will oversee the programming of the company’s upcoming season at the Metropolitan Opera House in New York.Credited with bringing the company’s productions to the fore of the contemporary art scene, Sellars will be responsible for overseeing the management of the company’s international brand and for organizing the company’s annual summer tour. He will take up the post on June 6, 2020.“Peter has been instrumental in our growing international reputation in the United States, and in developing the brand in the United States, to a level that no one has done before", "The next Biennial should be held in October 2021. The artist’s last exhibition, “Afternoon Live,” was held at the Museum of Art, New York, in December 2019.\n\n\nThe chair of the Committee on European Art (CEM) in Brussels, Michiel van der Linden, announced today that the twenty-five-member commission will hold an inquiry to examine whether the construction of the new €57.5 billion ($65 billion) European Regional Fund for Cultural Innovation (ERF), which comprises thirty-four European countries, was informed properly before it opened in 2020. The Forty-Second Brussels Architecture Biennial will then be asked to reconfigure its exhibition format to reflect this.“The biennial was established as a way to take the best of contemporary art and to develop new ways of bringing it together,” said Michiel de Vries, chair of the CEM. “The inquiry will assess whether the construction of the new fund is effective and timely. It will share what it has learned with the host countries, who will be given the opportunity to present their own works, and will ask the question: is the construction of the new fund able to contribute to the integration of art and", "The next Biennial should be held in 2023. The theme of the twenty-second edition is “My Struggle.” Like the first, the fourteen-thousand-piece exhibition will include reflections on contemporary life and social issues. It will also be focused on the themes of the twenty-third and twenty-fourth editions.The theme of the thirty-second edition is “The Birth of a Nation.” The exhibition is being organized as part of CNA’s efforts to develop an Indigenous-centered multidisciplinary Indigenous art program. The forty-ninth international workshop on Indigenous appropriation art will take place in Santiago, Chile, in September.\n\n\nThe Metropolitan Museum of Art (the Met) in New York has announced that it is planning to nix a major expansion of its collection of nineteenth-century photographs, titled “Take Two,” that is currently housed within its Met-1 building, and expand its exhibition program by one hundred percent. The renovation, which is part of a $200 million expansion and modernization project, was undertaken with the help of architect Douglas Drury and landscape architect David Childs.“The new system will mean that the collection will be able to present more contemporary images", "The next Biennial should be in 2020\n\nThe Los Angeles–based nonprofit Artadia, a coalition of arts and cultural organizations that includes the Art Institute of Chicago, the Burbank Museum of Art, the Museum of Contemporary Art, Los Angeles, and the Museum of Contemporary Art San Diego, is asking the city of Los Angeles to delay the 2020 edition of the Museum of Contemporary Art (MCA) to at least two years.“The mission of the MCA is to provide critical and contemporary art experiences that engage with contemporary art and culture in order to provide a bridge between the two cities,” said Mike Farfield, director of Artadia. “We believe that expediting the exhibition and organizing the event could greatly benefit the MCA’s ongoing exhibition and fundraising efforts.”After Artadia presented its proposal at an event in Los Angeles last year, the city council unanimously endorsed it. In a statement released on May 4, the council said: “We are excited to endorse this project and the work of Artadia, a group of local artists, and the local community they represent. The MCA has shown the world that Los Angeles is one of the most creative and vibrant cities in the United States. We believe that this exhibition", "The next Biennial should focus on the reconstruction of the Golan Heights, an area comprising many ancient Christian sites and situated near Damascus, and the city of Aleppo, Syria, where it will be held next year. The next edition of the Golan Biennial will be held in May 2020.\n\n\nThe Museum of the Fine Arts (MFA) in Boston has received a gift of fifty-eight works by Verne and Gertrude Jacobs, including a collection that dates back to the early twentieth century. The works, which were acquired through the MFA’s acquisition program, were funded by an anonymous donor in 1993.The collection, which includes works dating back to the nineteenth century, was recently gifted to the institution along with a program of exhibitions and presentations that was initiated by the Jacobs family. The program, which will run from March 16 to March 22, 2020, will represent the Jacobs family’s twentieth-century art, including several works by Ellsworth Kelly, a portrait of the late artist that was recently unveiled at the Martin Building, and a reconstruction of the final years of Verne da Cunha\u0097a project that was staged in the MFA’s Main Gallery in 1998.“While the Jacobs Museum", "The next Biennial should take place in 2021, and the first show will be held in 2022.The network said the upcoming editions will focus on themes such as the power of visual art to shape our world and the connections between people and art.\n\n\nThe Museum of Contemporary Art (MoCA), Miami Beach, has elected to divest from the private prison industry through a resolution adopted by the museum’s board of trustees on Tuesday. The vote was part of an initiative to hold the companies accountable for their human-rights abuses.“We are proud to have supported the work of our board of trustees in their efforts to advance the cause of social justice by addressing the systemic racism, economic injustice, and environmental devastation that are caused by the millions of people incarcerated in US prisons,” said board chair Lorie Maiorano. “We believe that the divestiture of funds from the GEO Group and Core Civic should serve as a powerful signal for other corporations that contribute to the brutalist, racist, and exploitative business model of mass incarceration. We hope other institutions, cultural and nonprofit leaders, and policymakers will join our board of trustees in this work and take a moment to support the work of the museum’s artists, curators, and staff", "The next Biennial should take place in the spring of 2020.  The event will be hosted at the mytanga Ramchandani, Mumbai. The show will also feature works by Prasanth and Kartikī. The show will run for ten weeks.\n\n\nThe Commonwealth Fund has awarded $72 million to twenty-seven artists and organizations in the United Kingdom in its centrist, four-year budget, which was announced today. Alexander Black, the chief executive of the Art Fund, said: While we are grateful for the support of the UK government in supporting artists and small to mid-size creatives in our home country for their integrity, integrity is not enough. This year’s budget marks a new level of commitment to artists and culture across the UK. It also recognises that government funding for arts and culture is under threat from a range of challenges, including the impact of the coronavirus, and the restructuring of the public sector. The budget will support some of the most urgent needs of British arts and culture. Represented are in alphabetical order:Laurie Andrew, the Portland Group, LondonAJ Amadou, the Baskerville Group,", "The next Biennial should be held at the Art Institute of Chicago, which is currently slated to open next year. Artforum has reached out to Biennial organizers for comment. \n\n\nThe New York City Department of Cultural Affairs (DCLA) announced on Monday that it is currently reviewing the redevelopment of Public Theatre of Harlem, which was closed since 2013 due to Covid-19, and is assessing the feasibility of relocating the troupe.In late February, the department announced its intent to reconfigure the neighborhood around the Metropolitan Opera House into a more urban setting, encouraging more residential development, transit, and pedestrian expansion. The plan is slated to be finalized by the end of the year and is part of a $1.5 billion overhaul of the city’s infrastructure. The redevelopment project is part of the Cuomo administration’s Vision Zero plan to reduce the city’s homicides to zero by 2026. The plan is also part of Mayor Bill de Blasio’s comprehensive transportation and urban plan, which aims to cut the city’s deaths by 80 percent by 2027.The Department of Cultural Affairs (DCLA) announced that it is currently reviewing the Met, which plans to dismantle the institution in late 2021, and is evaluating", "The next Biennial should bring together the most recent exhibitions and collections, and will examine current challenges and opportunities. “The exhibition will be a reflection of the current state of the exhibition and will not be a monolith, but will contain the biennial’s most recent exhibitions, as well as a selection of works by artists who have not been represented in the Biennial since the seventeenth century,” said Artier.The exhibition will also feature a special section, titled “Labyrinths of the Mind,” dedicated to the work of artists such as Pierre-Auguste Renoir, and Jean-Luc Godard, the latter of whom adapted a painting by Pierre-Auguste Renoir\u0097a miniatures-only version of the surrealist work Clos, for his film, “The Magic Mountain,” 1969, in the third quarter of its run. “The Biennial will continue to be a central feature of the Annunaki Museum, supporting the remarkable collection of works that has served as a model for the museum’s future, and will give visitors a unique opportunity to see works created by the biennial’s most celebrated artists,” said Shelly. ", "The next Biennial should be held in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it will begin accepting visitors' family members through the use of a new program that will culminate with a family photo-essay that will feature works by artists that have had the opportunity to create for a family for the first time.Brought about by architect and curator Martin Goodman, the program will aim to introduce the public to the work of artists that are represented in the collection. The first exhibition in the program, “Family Photos,” will open at MoMA on October 12, 2020.The retrospective will present the work of twenty-nine artists: Jirard, Margot, Alice, Brian, Caroline, Edith, David, David H. Richard, Eileen, Eileen Houghton, and Martha Shepherd. The show will examine how family photographs can exhibit a range of emotions, underscoring the inherent social and emotional dimensions of photographs.“I’ve been asking myself why there isn’t a family photo-essay,” Goodman told the New York Times. “I’ve looked at pictures of my kids, and I’m sure they’", "The next Biennial should take place at the Museum of Contemporary Art Chicago (MCA), in 2021.\n\n\nThe German government approved a $5 billion aid package for Greece last week, bringing the total investment to $8 billion, bringing the total amount available for the country to $12 billion. The sum is the nation’s first response to the crisis as it attempts to rebuild its debt and reduce unemployment. The assistance package also includes $1.2 billion for joblessness relief, and $1.3 billion for interest payments on existing debt, and would create a new type of loan for Greece.According to the New York Times, the aid package represents a partial solution that will still leave Greece in 2017, and will only involve partial repayment of the country’s debt. ​The deal, which also preserves the Social Democrats’ promise to reduce the number of members of the European Parliament from forty to thirty-five, was hailed as a victory for democracy and human rights. German Foreign Minister Heiko Maas hailed the decision as a “historic day for democracy.” While the bailout does not involve the Greek government directly, it does address its outstanding loans, and will allow the government to reduce the amount of debt owed to", "The next Biennial should host fourteen artists from the Saar and Flemish regions. The design of the exhibition will be inspired by the Saar town of Umlau, which is located in the northern part of Germany. The show’s theme “Tolks and the Saar,” which was chosen by a special jury, will take place in May 2020. The next edition of the exhibition will be held in May 2021.\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it has appointed Stacy LeBlanc as its next executive director. LeBlanc comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as deputy coordinator since 2016. She succeeds Mona Hatoum, who retired in March 2019 after twenty-two years at the helm of LACMA.“Stacy’s career trajectory has been a long-term journey, spanning more than twenty years at LACMA and multiple locations around the world, and we are deeply delighted to welcome her to the organization,” said LACMA director Laura Rosen. “Her tenacity, vision, and enthusiasm for art and the arts and her ability to align with L", "The next Biennial should take place on the island of Corsica in August 2019.\n\n\nA group of artists and collectors have launched a $25 million initiative to restore the former site of the Museum of African Art (MoA) in Washington, DC, to honor the contributions of African Americans to the institution and the nation.The restoration project, which involves the hiring of a group of experienced movers, was inspired by a conversation between artist and museum administrator Mary Nash, who is black, and philanthropist Arne Glimcher, who is white. The director of MoA, Frank Gehry, commissioned Nash to design a new headquarters for the institution in 1993. The result is the lobby of the museum, which is still being renovated, and is now home to the Charles Egan-designed Museum of African Art.The restoration project will be led by the nonprofit organization African American Heritage Preservation, which has received $5 million from the Guggenheim Foundation and has received $1.25 million from the Rockefeller Brothers Fund. The group will work with local, state, and federal officials to design, construct, and operate a new museum that will include a library, public gathering spaces, classrooms, and an auditorium. The renovation of the existing building will involve", "The next Biennial should be in 2020.The work, titled “Meeting the Future,” is part of a series that explores how art forms and institutions adapt to change and what can be learned from them. The theme of the exhibition is “connectedness, the future, and the present.” “Meeting the Future” will be hosted at the Institute of Contemporary Arts, Amsterdam (ICA). The exhibition was commissioned by the Dutch Minister of Arts, Heiner Tijdschæger, who also presented it at the 57th Venice Biennale in 1972. “The future is now,” Tijdschæger said at the event. “Art, art, art, art, art, art. Together they bring us together.”The Dutch production houses Witte de Kooning and Ghent-based Three Lions are represented by their Dutch principals, John de Lichtenberg and Joost van den Bleek. De Lichtenberg said: “The partnership between the three of us began with an invitation from the former to design an exhibition for the third Biennial. The shows meet each other’s needs, and our teams collaborate in the studio to draw attention", "The next Biennial should be held in 2021. “The State of the Art” is the theme of the second edition of the National Museum of Modern Art in Washington, DC, which is currently on display in the “Manhattan of Art” at the Smithsonian American Art Museum. \n\nThe Tate’s board of trustees has appointed Kate Foy, the chief executive and director of the Tate, as director. She will take up the post on January 7, 2020.Foy comes to the institution from the Metropolitan Museum of Art, where she has led the museum since 2018. She oversaw the museum’s transformation into a center for contemporary art, expanding its collection, exhibitions, education, and research programs. She also launched a new studio to produce new works by contemporary artists and curated several exhibitions, including “The Future Is Now: From the 80s to the 90s” (2019) and “The Rise of the Modern Art Museum” (2015).“Kate has proven herself a leader, creating a culture of excellence and attracting new audiences through her ambitious exhibition programs and relationships with major art institutions in the UK, the US, and Europe,” said Charles Green, chair of the trustees. �", "The next Biennial should take place in the fall of 2020. The project is currently being organized by the Institute for Contemporary Art (ICA) in collaboration with North Korea’s Ministry of Culture and the National Museum of History and is supported by the National Korea Foundation (KMF), the Kwonhoi Foundation for Contemporary Arts, and the Kwonhoi City Museum.“This is a new challenge for us, but one that we hope will strengthen our faith in humanity’s ability to overcome great challenges,” said Kim Yoon-sung, director of ICA and a former curator at the Museum of Modern Art. \n\n\nIn a move that will push the boundaries of what art museums are able to achieve by establishing a new cultural platform, the Kunsthalle Basel in Switzerland has announced that it is planning to close its doors in November 2022. The institution has been in discussions with the government and international experts for several years over the future of the institution, which has a unique collection of more than three hundred thousand works and is located in the historic Kreuzberg district of Germany and is the first museum in the country to be completely shuttered since the Second World War. The Kunsthalle, which was founded in 1899,", "The next Biennial should be staged on August 28–September 3, 2020. Just ahead of the exhibition, the Bavarian Federal Office of Culture (BfV) issued a statement confirming that the Berlin Biennale would move to August 15–August 17, 2020. The theme of the year will remain the same: the future of art. The 2019 edition of the Berlin Art Biennale, held in the Bavarian city of Altenbek, was cancelled due to the Covid-19 pandemic. The event was to have taken place in August.The fifth edition of the Berlin Art Biennale, which was scheduled for January 28–January 31, 2020, was also cancelled. The Berlin Architecture Biennale, which was scheduled to take place in February 2020, was rescheduled for March 20–March 22, 2020. The Berlinale Film Festival, which was supposed to take place in March 2020, was re-scheduled for March 8–March 12, 2020. The 2017 edition of the Berlinale was also postponed. \n\n\nThe French Ministry of Culture is planning to build a massive new exhibition space in the capital of Lyon, which has been home to the Museum of Modern Art (MoMA", "The next Biennial should include a selection of works by local and international artists. The next edition of the Biennial will take place in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a $375,000 donation from the Doris Duke Foundation, which was established in 1994 by the philanthropists after the death of Duke, the founder of the eponymous furniture company Kellogg & Company. The donation was made in recognition of the foundation’s extraordinary work in growing the public awareness of the relationship between architecture and sustainable design.Melissa Hale, director of the foundation, said: “In the mid-’60s, when Martha Tuttle gave up her seat at MoMA to move to New York, we launched a program to help her continue her work. We are grateful to the Duke Foundation for this gift and hope that it will continue to support the Doris Duke Foundation as it continues to present the best exhibitions in the world. We thank our donors and our board, staff, and supporters for making this possible and look forward to future years.”Awards Beyond the Museum’s Endowment FundFor the next biennial, the museum will award $875,000 to four artists\u0097Ali", "The next Biennial should take place in 2021.\n\nIn its last iteration, the event, titled “The Future Is Present,” was held in Seoul in November 2015 and ran for eighteen months. The exhibition represented the first time that Korean artist Lee Seo-kyung, who was nominated for a MacArthur Award in 2007, had participated in an American art festival. It also marked the end of a twelve-year run for the American artist and marked the first time that the commission of a solo exhibition by Lee was included in the biennial. When the South Korean artist was chosen to represent the United States in the sixth iteration of the show, he was chosen from a shortlist that also included Takashi Tokita, Julie Harris, and Toby Man, as well as the artist Seo-kyung Kang.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Rina Banerjee as its new assistant curator of contemporary art. She will be responsible for integrating the efforts of the gallery and the Smithsonian’s National Museum of African Art in a multi-year initiative that will culminate with a retrospective of the British artist’s work, which will open on October 8, 2021. The exhibition, titled “Art", "The next Biennial should begin as soon as possible in order to allow the Board of Trustees and the organizing committee the opportunity to re-evaluate the current program and its future plans. We realize that this is an unprecedented situation and are working closely with the Board of Trustees to understand the implications of the past few weeks and to determine the best way forward. We believe that an interim season of events that will include programming that reflects the critically acclaimed and moving exhibition series will be the best possible outcome for the museum. We look forward to continuing to present the award-winning works of the biennial series during this challenging and challenging year.\n\n\nThe Toyota Museum of Contemporary Art (TMA) in Tokyo and the Sanyo University Museum (SUM) in Osaka announced today that they will collaborate to stage the 50th edition of the TMA Asian Art and Design Biennial, to be held in 2020, at the Sanyo University Museum. The event will be hosted by the interdisciplinary institution, which is currently experimenting with a new hybrid of film and design, in collaboration with the Japanese pavilion at the 2020 Tokyo International Film Festival. The biennial will be organized as a joint venture between TMA and SUNY, and will be housed in the newly renovated", "The next Biennial should be held at a site selected by the city of San Francisco in 2021. The theme, “Avant-Garde and Material Culture:” has yet to be decided. The fourteenth edition of the exhibition will take place in the Bay Area’s Museum of Modern Art in 2020. The winner of the award will be announced in March 2021. \n\n\nThe Metropolitan Museum of Art (the museum) in New York has announced the launch of the Metropolitan Museum of Art Online Viewing Rooms (MMOV), an initiative that will give members of the public new ways to experience the museum. Designed to complement the museum’s existing digital viewing rooms, the online viewing rooms will allow visiting members to experience the museum like never before.“The Met is committed to creating new platforms for people to discover and experience the Met, and MMOV will provide a new way for people to experience the museum,” said Met director Nicholas Hilder. “The Met has long recognized the value of an open and connected experience, and MMOV will join us in that mission.”The online viewing rooms will feature over seventy works by twenty-six artists and collectors from across the globe and will be presented in", "The next Biennial should aim to inaugurate a new generation of artists, to be led by an artist-in-residence, who will be invited to the exhibition space, and to engage with technology and the future of art and design in order to produce an exhibition with greater impact. “The work of the artists at the Biennial is an expression of our admiration and respect for their work and the vision of the exhibition,”said Adrian Wootton, chair of the board and a trustee of the Biennial. “The collaboration between the two museums will be an opportunity for visitors to see and touch the work of the artists whose bodies and work are interwoven with that of the artists who are represented in the exhibition.”\n\n\nThe National Museum of Fine Arts (MoFA) in Washington, DC, is facing a class-action lawsuit from thousands of former employees who allege that the museum withheld information about the safety and well-being of workers during a massive fire that broke out in one of the building’s auditoriums in June 2018, according to the New York Times.The suit was filed by employees of the Walters Art Museum in Brooklyn, New York, who are seeking at least $100 million from the institution", "The next Biennial should be held in late spring or early summer. A new edition of the National Geographic Society’s Biodiversity Symposia, which is scheduled to run from February 19 to February 22, 2020 in Washington, DC, will be presented by the National Geographic Society in association with the DC–based conservation and education organization Conservation Northwest, which represents more than 2,500 farmers and ranchers in eight states. The symposia’s theme, “The Anthropocene” will be addressed not only by its creators, but also by thousands of activists and scientists across the country. “Today, we are living through an unprecedented global crisis,” said National Geographic Society CEO Mary Anne Carter. “The future of our planet and our way of life is at stake. We are working hard to stretch our reach into the future by bringing together leading experts and leading conservation biologists to share our knowledge and perspectives with the public. We are committed to creating a better future for our planet, and we will continue to advocate for policies that protect and restore America’s natural heritage sites and resources for generations to come.” The 2019 edition of the Biennial featured work by forty-four artists. Among", "The next Biennial should be held at the Museum of Contemporary Art, Los Angeles (LA MoCA); the biennial will be followed by three subsequent editions at the Museum of Modern Art (MoMA) and the New Museum in New York.The 2020 edition will feature fifteen million objects, including paintings, drawings, sculptures, and photographs, and will be staged at sixty locations across the United Kingdom, including Edinburgh, the Grand European Lighthouse, and the National Maritime Museum.The 2020 final edition will be the first for the British Museum since 2005.\n\n\nThe International Council of the Arts (ICA) has awarded the UAE $2 million in support of the construction and renovation of a new three-storied, glass-enclosed cultural center in the capital of Abu Dhabi. The museum is a major redesign project that will extend the contemporary art museum’s modern aesthetic and contemporary education.Dubai’s Al Mada house of worship (ASOH) has completed its renovation of its minaret in the city’s Al Mada district, which is believed to be the largest commercial space in the United Arab Emirates. The nine-story glass building, which was commissioned by the Al-Jazeera Group and comprises seventy glass terraces, was completed", "The next Biennial should take place in 2025. \n\n\nThe Ottawa Art Gallery (OAG) is planning to scrap the annual MasterCard cultural event, which was first held in 2006 and has since been held at various locations in Ottawa including the Ottawa Opera House, the Detroit Institute of Arts, and the Canadian Museum of Civilization. The move follows complaints from some cultural institutions that the exhibition “rarely, if ever, addresses the complex and nuanced questions of contemporary life.”The cancelation of the annual event follows several complaints made by cultural organizations that the event’s programming did not address the current climate. For many years, the MCH Group, the parent company of the visual arts organization the National Gallery of Canada, organized the event, which featured more than 120 artists selected by a biennial jury. The event was part of a larger program of programming at the institution, which celebrated its sixtieth anniversary this fall. The institution is currently working on revamping its current campus and is planning to reopen in the spring of 2022.\n\n\nThe British Council has announced that its new foreign secretaries, Alexander Abney and Lena Roden, will represent the UK at the 2020 Venice Biennale, which will take place at the Italian city from", "The next Biennial should be titled “Beyond the Sea and the Air” and will be held in the city of Long Beach, California, in 2020. It will examine the continuing threat posed by climate change, and the ways in which art and architecture are impacted by environmental destruction and crisis. “The exhibition will focus on how art and architecture, the medium between humanity and the natural world\u0097beyond and beyond the sea and the air\u0097are currently being rediscovered and rediscovered again,” the organizers said in a statement. The first exhibition of the new work, “The Last Supper: Art and Renewal” will open at the New Art Place in New York on June 5. The second, “Celestine: Art in the Age of Black Power” will open in the United Arab Emirates on June 11 and will run until June 12.The first show of the new series, Zina: Contemporary Art in the Life of a Black Woman, will open at the Museum of Modern Art in New York on June 18. The second, “The Black Family: Art in the Age of Black Power” will open at the Museum of Modern Art in New York on June 25 and run", "The next Biennial should be in 2021, the Art Newspaper reports. When the event is completed, an exhibition of work by thirty artists and collectors will be presented. The next iteration of the exhibition will take place in 2022, and the event will be staged in conjunction with the biennial, as well as the museum. “The revised and completed Multi-Level Art Biennial is an ideal platform for contemporary art exhibitions in Europe and the United States,” said José Carlos Pérez-Ruiz, director of the Museum of Modern Art. “We look forward to the full experience of the Biennial in 2021, and to the project of the Multi-Level Art Biennial in 2022.” The 2020 edition of the Biennial took place at the Museo de Arte Contemporáneo Madrid (MASM), and the 2020 edition of the Art Berlin Biennale will take place at the Berlin Art Museum. \n\n\nArtist Tarek Atoui, the Lebanese-born, Massachusetts–based artist, has won a Pulitzer Prize for his art, “Amar al-Kasasasbeh,” which was exhibited at the Fifty-ninth Venice Biennale", "The next Biennial should aim to concentrate more on the work of artists who are not currently represented in the institution’s collection, and could focus on two or three artists over the course of a year. The inaugural exhibition “zinefolding” was organized by a panel of fifty artists, including Hozier, Ellis, Hanna, Nick, and Wong.\n\n\nEddie Arroyo, the longtime LA’s independent curator, has died at age eighty-eight years old at his home in Santa Monica.Born in Cuba in 1942, Arroyo emigrated to the US as a teenager and settled in Los Angeles, where his father ran a hardware store. After graduating from Stanford University in 1975, Arroyo moved to Santa Monica to work at a local hardware store, and later at the archives of the California Historical Society in San Clemente. He would later direct the LACMA art museum in the 1980s and has acted as an educational consultant for museums and schools in the city. His work has been exhibited at the Museum of Modern Art, the Museum of Contemporary Art, Chicago, the Los Angeles County Museum of Art, and the San Diego Museum of Art. His Los Angeles home is currently undergoing a $1", "The next Biennial should be presented by the City of Auckland next March, the Arts Council in 2021, and the Arts Council Museum in 2021. The site of the 20th Biennial will be designated as a “sensitive site,” but it will still be open to the public.The announcement comes on the heels of the publication of the Art Newspaper’s 25th issue on November 27, which also announced that the National Gallery of Australia’s new exhibition “Diana’s Exhibitions” will depart for New York in March. The show will be followed by a book launch at the gallery in April and then the next exhibition will be relocated to Qatar from September to October.A statement from the Arts Council states: “As part of our ongoing work to improve access and accessibility across Australia, we have appointed Molly Steenkamp’s new senior curator of contemporary art, Andrea Balsom, to the role of curator. Balsom will be responsible for the direction and delivery of the museum’s exhibitions. Her success in this role will be closely aligned with the work of the curators and experts who have previously worked with the Biennial", "The next Biennial should take place in the spring of 2021, and the exhibition should be a continuation of the inaugural, titled “The Future of Art: The Art of the Impossible,” which was staged in the summer of 2019.Kampferer told the Art Newspaper that the new format will allow the artists to “perfectly carefully conceptualize and depict the changes that are taking place, while maintaining a certain humor’s innocence.” She added: “The major challenge of the exhibition is that it has to be very difficult, at times, to go through with these projects, and also that the artists’ lives and well-being are at stake. So I am really excited for the exhibition to begin with this new opportunity for the artists.”\n\n\nAdvertisement\n\nThe Museum of Fine Arts (MFA) in Atlanta has welcomed four new members to its board of directors: Woody Melton, a curator and author; artist and outspoken supporter of artists; Richard and Virginia Williams, the founders of the Tracey and Boris Museum of Art in New York; and artist-in-residence Jamie Ward.“We’re thrilled to welcome their talents and dedication to MFA, and look", "The next Biennial should be held in 2020.\n\n\n\n\n\n\nMADISON, Wis. (AP) – A Wisconsin appeals court has upheld the conviction of a man who died in prison after he was found guilty of murdering his stepmother and two siblings in a brutal quadruple murder-suicide in February 2018.The 18-1 Supreme Court of Appeals ruling Wednesday reversed a lower court decision that had found the defendant not guilty of second-degree murder, which carries a maximum sentence of life in prison. The justices found that the Wisconsin Department of Corrections failed to properly investigate the case after it received a report in February 2019 from the Cora Walker Center for the Arts about a possible suicide attempt by the man. The governor appealed the conviction, and the case was transferred to the Wisconsin Court of Appeals in Madison.The court found that the Department of Corrections failed to administer the first suicide-protective measure it could have: a mental health evaluation and treatment program for the man who was housed at the facility for a mental-health crisis in February 2019. The court found that the man was placed in solitary confinement for six months without access to a lawyer or an appeal process. The man was also denied a lawyer. The court found that the DOC failed to properly investigate", "The next Biennial should open in the autumn. In the meantime, the museum will have a grand opening ceremony on Wednesday, October 28, and will be closed until January 2021. The biennial’s first exhibition, “Together in Time” (2017), opened at the museum in March, and the first exhibition of the new work by artist Serpa Zivkovic, “Binary Waves” (2018), will be presented in December.\n\n\nThe Museum of Asian Art (MAS), a major center in the US devoted to the study of Southeast Asian art, is planning to open an outpost in Bangkok in 2021. The museum, which has locations in Los Angeles, New York, and Singapore, will be located in the capital’s Tamanrassery district and will provide contemporary art exhibitions, a library, and a contemporary art museum.The new space will be called the Pacific Northwest Centennial, and will offer twenty years of masterclass exhibitions. The institution has selected the Dusayan Art Museum in the Philippines for the inaugural edition, titled “Dusayan at the Pacific Northwest: From Dusayan to the Pacific Northwest,” which will feature thirteen paintings and a new sculpture by the D", "The next Biennial should take place in 2020 and the first in 2021. In April 2018, the museum announced a partnership with the Smithsonian American Art Museum, the Museum of Fine Arts, Houston, and the City of Houston. The biennial will include special exhibitions, a monograph series, an open-studio day on Friday evenings, and an online version of the annual exhibition, which is currently closed due to Covid-19. The 2019 exhibition was staged at the new museum in a small-scale, with the help of Guggenheim’s architect, Drew Garrett.The new museum’s director, Elizabeth Anne Foster, said: “With this year’s event we’re excited to invite new audiences to the museum, and to cultivate relationships with local communities through the museum’s programs. The biennial will provide a unique opportunity to engage with Houston’s history, culture, and residents. We feel it is critical to our mission to connect with and present this amazing story of our city.”\n\n\nThe Metropolitan Museum of Art (MoMA) in New York announced today that artist Marisa Córdoba has been selected as the recipient of the $50,000 Jacob K.", "The next Biennial should take place in 2022.\n\n\nThe National Gallery of Art in Washington, DC, announced today that it is planning to lay off sixty-five employees, or about twenty-four percent of its workforce, as part of its ongoing effort to restructure to protect the cultural institution from further financial losses as a result of the pandemic. The decision was made during a time when the institution is grappling with the financial impact of the coronavirus, which was first identified in December. The Capitol News reports that the forty-nine employees who were let go were not let go because of any specific actions taken by the museum, but rather because of their dissatisfaction with the performance of certain staff members.The employees were let go as part of a restructuring plan approved by the museum board of directors last July, which required the museum to make at least eight cuts across its three locations—the museum, the Smithsonian American Art Museum, and the National Museum of African Art—in the first two years of the restructuring process. The employees are now seeking union representation.“We are deeply concerned about the proposed layoffs at the National Gallery of Art,” said Ellen Gartenfeld, the board’s chair. “As we have previously announced,", "The next Biennial should be held in 2021. LaToya Brown, chair of the board of trustees of the Whitney Museum of American Art, said: “As we work to reimagine how art can connect with the community and the natural world, we hope that the upcoming exhibition will show that art can make a meaningful contribution to our world and the city.”\n\n\nIn a move that could change the face of American architecture, the National Geographic Society has appointed John Deutsch as its next chairman and CEO. Deutsch was selected from a shortlist that included Toby Chopra, Ana Mendieta, and Fernanda Rondin, and will assume his post in January 2021.“John is an exceptional leader at a critical time in National Geographic’s history,” said Ellen Myhrvold, director and CEO of the National Geographic Society. “His demonstrated record of driving change and building compelling narratives for our vision of where art and design will be in the future. His long history of visionary leadership makes him ideally qualified to lead National Geographic into the next phase of its history, and I’m confident that he will shape its future direction for the better.”Deutsch comes to the organization from the University of", "The next Biennial should start in February 2020 and will consist of fifteen exhibitions, including a documentary on the New York–based artist Steven De Souza, whose face has graced the gallery’s three previous editions. The first solo exhibition, “Stefan De Souza: The Last Man,” will be presented by Michael Krieger, director and chief curator of the Whitney Museum of American Art; Simon L. Foster, curator and founder of the Chicago-based nonprofit Equinox Gallery; and John deKozma, director of the Center for the Arts in New York.New York’s biennial will be the only one devoted entirely to women artists, and will include ten works by a select group of women artists selected by the biennial’s president, Doris Schweizer, in what is believed to be the first such event in the United States. The first exhibition will open on November 3, 2020. Admission to the biennial will cost $1200 and will be free for permanent exhibitions. The biennial’s biennial ticket, which will be honored at the institution, will include access to the exhibition.The biennial will be hosted by the Whitney Museum of American Art and the Brooklyn Museum of the Arts", "The next Biennial should take place in the new museum’s new location on the campus of the University of Exeter in Oxford, UK, in 2023. David Rutter, the Sherwood Museum’s director, said: “The new Sherwood will offer a unique contemporary and the most anticipated exhibitions in its history. The redesigned museum is ambitious in exploring new and innovative ways to engage with the world and I look forward to working with the team to achieve this.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it plans to save the David Division, an eighteenth-century mansion located in the affluent Chelsea neighborhood of Manhattan, by tearing down the residence in order to make way for the expansion of the Grand Central Station. The renovations, which were completed in 2017, will result in the redirection of $9 million from the estate’s endowment to the DCLA.“The David Division is one of the most important surviving examples of eighteenth-century architecture in America,” said Carolyn Goldin, DCLA commissioner. “It is a treasure of the Civil War Museum and of the David Lewis Wallace Foundation, and we hope that the work will stimulate future visitors to appreciate the", "The next Biennial should be held in May 2021.\n\n\nThe Museum of Contemporary Art (MoCA), the Museum of Contemporary Art Los Angeles (MCA LA), the Museum of Contemporary Art San Francisco (MCA SF), and the Museum of Contemporary Art San Diego (MCA SDS) have announced their intention to open their new locations in the city of Santa Ana, California with a series of workshops, performances, and other events. “We are thrilled to offer this opportunity to the public in the city of Santa Ana, California, and recognize the tremendous contributions made by artists and institutions during the museum’s nearly thirty-year history,” said museum director and CEO David Wainwright, who added that the museum is currently working on a new series of exhibitions.The first exhibition, slated to open in February 2021, will feature five works by Los Angeles–based artists: Spenser Okamoto, Neil Paradies, Jennifer Salazar, and John Skipper. The second exhibition, titled “Beyond the Landscape” and scheduled to open in March 2021, will feature works by the Bali Bali Sculpture Festival, the Manila Biennale, and the Los Angeles County Museum of Art. For the third exhibition,", "The next Biennial should take place in 2021 and will focus on “the New World Order”\u0097a reference to the new American government. The theme of the next edition will be “Free Flow of Information and Art,” an issue currently dominating the global debate\u0097and the first to have a public pavilion. The work will be curated by Fergus Walsh.The next arrival of the phenomenon will be on September 7. While the date is yet to be announced, the biennial will be held at the Hong Kong pavilion.\n\n\nThe Playwrights Union (PWU) in New York City has suspended its contract with New York’s Lincoln Center, the New York–based nonprofit that supports theatre in the city, after it informed the union that it plans to terminate its relationship with the group on January 3, 2021.According to the New York Times, the short notice was given to the union by acting director Adam J. Bernstein, who took the helm of the organization in November. The move means that the production company will likely shut down at the end of the month.In a statement issued on January 16, the Playwrights Union said that the “decision has been made", "The next Biennial should begin in late January 2020 and will feature twenty-four works on paper. The theme will be organic forms, indigenous knowledge networks, performance, and technology.The proposal was submitted by architect and curator Stefano Cattelano, who was recently appointed the artistic director of the Italian Villa Artola. Cattelano stated that he was influenced by the work of the late Italian painter and sculptor Piero Manzoni and the Italian painter Gio Ponti, who were also nominated, but were not chosen. In addition, a selection of work by the Italian artist Gio Ponti will be presented. Commenting on the biennial, Cattelano said: “I am very happy to be a part of this extraordinary exhibition, that is represented by the Villa Artola and is making a new contribution to Italian culture.”\n\n\nAmerican artist David Breslin, a pioneer of avant-garde performance who experimented with sound and color in stark new ways, has died at age eighty-two at his home in the Bronx. Breslin’s work, which examines the relationship between sound and movement in a visually stunning yet deeply philosophical way, is often compared with that of Willem de Kooning", "The next Biennial should inaugurate with a series of performances, films, concerts, and other events that will draw on the intellectual and technical depth and creativity of the past and highlight contemporary issues. The theme of the twenty-ninth will be 'Collective Identity'.”The 2020 edition will be curated by Annie Godfrey, who has helmed the exhibition since its inception in 1994, and will return to the Greenwich Village Public Library in Connecticut after a four-year hiatus in the spring of 2022.\n\n\nThe DeMaio Foundation, an educational organization based in New York City founded by artist and philanthropist David DeMaio in 1999, has launched a $1 million initiative to support the visual arts through the loss of artworks. Funded through a combination of donations and grantmaking in partnership with arts professionals, DeMaio Foundation’s Artist Perks grant program—which organizes funding competitions and awards grants—has raised $3.7 million so far.The initiative will provide $1 million to artists whose creative practices have been negatively impacted by Covid-19. The fund will also grant $1.5 million to free visual artists in New York City who live within a seventy-mile radius of New York City. The deadline for applications", "The next Biennial should focus on relationships between African art and technology and the African diaspora, and should include a survey of the history of art in the United Arab Emirates, and art in South Africa. The theme for the third Biennial should be “Limited to the Past and Beyond,” a place where art, technology and technology’s negative implications are addressed. The third and fourth Biennials, slated to open in 2021 and 2022, respectively, will address questions of what it means to be an African artist in the digital age, and will feature artists from Ghana, Kenya, and the Republic of Congo. The new five-yearly theme “Art and Distraction” will be about art and technology, and will address the cultural, psychological, and spiritual effects of technological distraction. The theme will focus on the impact of digital technology on the African diaspora.The twenty-fifth edition of the African Museum of Modern Art, which will be held in Lagos from October 23 to October 27, 2021, will feature contemporary art from North and Central Africa. The museum will also introduce an exhibition focused on the work of Cara Delevingne, whose African diaspora was featured in the first edition of this event", "The next Biennial should feature a selection of works by illustrators and filmmakers on the Koreatown–Marina del Rey corridor in the heart of Los Angeles, which was recently transformed by an undocumented immigrant family.“The next Biennial will be an opportunity for artists to be together, to work together, to engage each other, and to create transformative experiences,” said Kelly. “We are excited to work with the next generation of Dadaists to reimagine the Koreatown–Marina del Rey corridor in the city of Los Angeles, and we are confident that our curators have created an exhibition that reflects these visionary themes and the creativity of the Los Angeles region.”The opening of the exhibition “Practical Domination” in 2017 coincided with the opening of the exhibition “NIRIN,” which showcased the work of seventy-nine international artists. The exhibition received a retrospective at the Los Angeles County Museum of Art in 2018, and a 2019 exhibition at the National Center for the Arts in Washington, DC.\n\n\nThe Museum of Fine Arts (MFA) in New York has received a gift of twenty-three works by artists who have lived in or are still living in St. Louis. The gift includes works", "The next Biennial should focus on exploring modern and contemporary approaches to the creation and construction of narratives through archaeological, theoretical, and experimental approaches. It should also consider the way that the art of the past intersects with the contemporary. The theme of ’Dahriya’ may sound familiar to longtime visitors to the Museum; it is the term given to the region of northern Iran, predominantly in the center of the country, where the pilgrimage center was established in the 1980s. But this year’s edition will build on the theme of the first, which touched upon the history of the region and the cultural heritage of Iran, and may include images and sounds that have not been represented in the museums in the past.“The museum will continue to evolve by meeting new challenges and new objectives in the museum’s new location in the city of Herat, the new museum in Düsseldorf, and the museum of the contemporary in the city of Shiraz,” said Director Evlaine Nawaz.\n\n\nThe Boston Art Museum has received a gift of more than 1,600 works, manuscripts, photos, and other cultural artifacts from the Kalamazoo Tribe of Michigan, which is seeking the return of the Cultural Heritage", "The next Biennial should be held in the spring of 2021 – the year of the 2019 Hong Kong Biennial. The program will outline the themes of the next iteration, which will take place in the city of Hong Kong in the United States. \n\n\nThree artists who have been working together in the United States in support of LGBTQ rights are partnering up once again to create a new exhibition dedicated to the history of lesbian, gay, bisexual, transgender, and transgender (LGBT) rights. The inaugural exhibition, “Atlas: Lesbian and Gay,” will be on view in the exhibition space Black Box Craft Space in the Leipzig suburb of Berlin from March 22 to March 27.The participants in the project are Ganesh Gawande, Anastasia Abar, and Anwar Saeedi. Gawande, who received the award for his work for Lesbian and Gay in 2014, was selected from a list of three finalists by the Black Box Craft Space and presented with the prize at the exhibition. Abar is a Parisian-born, Los Angeles–based artist whose work focuses on lesbian, gay, bisexual, and transgender (LGBT) rights and is recognized internationally. She was also nominated for the prize in 2016 and 2018.", "The next Biennial should add another 300,000 visitors to the city through September 30, 2020. The theme “The Body, Events, and Events,” will include works by a selection of trans-disciplinary artists and art historians. The exhibition will include work by thirty-seven artists, including three from the Biennial and three from the city of Los Angeles.The biennial will be hosted at the Metropolitan Museum of Art until October 26, 2020.Inaugurating the exhibition is the first Biennial “Buildings of Life,” which will present works by fifty-eight artists and will draw from the theme of “The Body,” the body and its relationship with the environment, and art history. The exhibition will be followed by “This Is Not a Bandcamp,” a show comprised of work by artists, including Hernán Díaz, Félix Alemán, and Miuccia Prada, and will run until September 30, 2020.Funding for the Biennial has also come from the Huntington Foundation, the Beverly Hills Foundation, the Museum of Contemporary Art, Hollywood, the San Francisco Museum of Modern Art, the Metropolitan Museum of Art, the San José Museum of Art", "The next Biennial should be held at the Venetian in 2021 and the Venice Architecture Biennale in 2022.\n\n\nMore than 1,700 artists and academics have signed an open letter declaring that they will not participate in the upcoming edition of the Venice Architecture Biennale, which will take place in the Italian city from May 22 to May 28.“We recognize that this is a critical moment for the future of our cultural and artistic ecosystem,” reads the letter, which was written by art historians, architects, conservators, and other cultural figures, and was dated May 31. “We demand that the organizers of the exhibition take the following steps: ‘Act in a way that does not allow the cancellation of the exhibition or reduce its program in any way;\n\nImplement a compensation plan that provides for the artists and institutions involved in the exhibition, including for the losses of income from the attendance of the public and the exhibition’s commercial and institutional sponsors, with an emergency funding plan for the artists’ immediate needs;\n\nImplement a formal apology and compensation plan for the organizers; and\n\nImplement an independent investigation into the show’s cancellation.”The open letter is presented in the", "The next Biennial should take place at the Museum of Modern Art in New York from January 21 to January 23 2020. Curated by Joachim C. Hofmann and featuring a selection of work by thirty-five artists, the show will present works that are in the exhibition catalogues, have been previously shown in the exhibition, and will inaugurate the biennial.“We are delighted with the delivery of this year’s Biennial, offering the most inclusive and exciting programme ever,” said Jürgen Todend, president and CEO of the Berlin-based foundation. “The theme this year is ‘Democracy and History,’ to be specific about the future. The themes are very relevant and timely for our times. The programme will be an opportunity for the artists involved with the exhibition to recall the themes of the previous years and to reflect on their experiences in parallel with the theme.”The Biennial’s inaugural showcase of work by thirty-six artists was held at the Guggenheim Museum in New York in January 2019. Titled “2017: The Year of the Artists,” the exhibition was one of a number of collaborations between the Foundation and the Palazzo Bianco in", "The next Biennial should take place in 2020, and the first in 2021. The new venue will also be located in the old Biennial building, and will inaugurate a new series of exhibitions. It will also become the oldest exhibition space of the exhibition movement and will host the first exhibition of “Rosa Negra” in the United States, the Republic of Korea, and Hong Kong. Meanwhile, the biennial will continue to present the artists whose work is currently on display. The inaugural exhibition “Judy Matthews” will showcase work by forty-five artists.\n\n\nThe Dutch government approved a $750 million relocation package for the cultural center the MCA Maastricht in the Netherlands on Monday, the Dutch News reports. The redevelopment of the former Maastricht Castle, which serves as the backdrop for a number of the artist’s internationally acclaimed paintings, is part of a larger plan to draw large international art collectors to the Netherlands, which has been struggling to recover from the coronavirus (the UK has since confirmed its worst outbreak here). The MCA Maastricht is one of the centers that have experienced rapid growth in recent years. The center has expanded by more than twenty thousand square feet since it was established", "The next Biennial should take place in the year 2021 and will unveil the programme in collaboration with the Los Angeles County Museum of Art (LACMA) and will be organized as a 'triennial of the museum.”The biennial will focus on the company’s new facility in North LA\u0097the new campus of the Los Angeles County Museum of Art, which opened to the public in January 2019\u0097and will feature a selection of artists and/or works. The artists selected for the exhibition will be announced in March 2020.The biennial will be held at the new museum’s current home on the first floor of a building adjacent to the Museum of Contemporary Art Los Angeles (LACMA), which opened in May 2018 and is currently undergoing a $130 million facelift. The renovation includes the installation of new galleries and classrooms, expanded public areas, and increased curatorial and preservation skills.The Los Angeles County Museum of Art will construct its new campus\u0097designated for its construction by the city of Los Angeles\u0097in the city of Los Angeles, which is currently constructing a new 1,700-foot, air-conditioned walkway across the street from the institution. The new museum will be built in the same", "The next Biennial should be in February 2020. An update to the artists’ work will be presented at the Art Basel Dubai Biennial in March 2020. The 2020 edition of the Philadelphia Biennale will be held at the Philadelphia Museum of Art (PMA) from March 21 to March 26, 2020. The event will celebrate its thirteenth year with a special exhibition of work by forty-three artists. The biennial will celebrate its twenty-fifth anniversary with a special exhibition of work by thirty-three artists. All of the artists will receive 10 percent awards as well as a prize of $50,000. The 2019 edition of the Pittsburgh Biennale was held at the Pittsburgh Museum of Art (PMA) from April 21 to April 28.The twenty-third edition of the Chicago Biennale will take place at the Chicago Cultural Center from May 23 to May 29. Its first edition, titled “Between Worlds,” was staged at the Lincoln Center in September. The event will consist of three unique scripts\u0097The Golden Age of Art, The Present Moment, and “Between the World and Me.” The theme is “Time and Space and Nature: Toward a Future", "The next Biennial should begin in 2020 and conclude in 2021. It will be hosted at the Museum of Contemporary Art (MoCA), New York. The exhibition will be curated by Elissa Altman and will run on the National Geographic–backed and managed platform Artforum. The museum will stage approximately eighty exhibitions a year, including a collection of works by artists such as Theo Adès, Alex Katz, Janet Anthony, Yinka Shonibare, Mark Leckey, Paul Mpagi Sepuya, and Philipa Soares.The biennial will be biennial: the term is used by Smithsonian scholars to describe a number of events that occur in a single year. For example, the museum will open its National Museum of African Art in Washington, DC, in 2020 and conclude its eighth exhibition, “Mary Queen of Scots: The Biennial,” in 2022.The 2019 edition of the biennial—which received more than three hundred nominations and featured works by more than sixty artists—was held at the Smithsonian American Art Museum (SAAM). The biennial’s director, Stephanie McShine, said: “In the spirit of the biennial’s long-standing tradition,", "The next Biennial should also consider the importance of the role of the female body in shaping the future shape of art. The Art of Women, a new exhibition being staged by the Museum of Modern Art in New York, is a good start.\n\n\nSeven years after American artist Richard Anuszkiewicz—who utilized collage and sculpture to create works that challenged notions of realism and depth in painting and drawing—was killed by a jealous ex-girlfriend, the National Gallery of Art in Washington, DC, announced that it will reopen with a new set of works by the Polish-born and American-born artist Grzegorz Dziwior. Dziwior’s Legacy, a new exhibition of work from the artist’s sixteenth-century Polish graveyard, will open in 2021.The exhibition, which will present works by thirty-two contemporary artists, marks the first time the National Gallery has exhibited the work of an American artist since the artist’s death. Its opening will mark the beginning of a commemoration of his life, work, and work of his art. The seventy-five-year-old American artist, who lived and worked in Poland, was raised in Roswell, New Mexico, and moved to", "The next Biennial should be held in 2020.\n\n\nThe Art Newspaper in Japan has published an interview with the artist and curator Yuki Kondo, who represents Japan in the upcoming Tokyo Art Biennale. In the article, which was transcribed by Artnet, Kondo talks about the importance of political correctness in Japan, the problem of erotica, and the cult of the creator. His thoughts on the Golden Gate Bridge, the original installation “She's Gone,” a work that took place on the bridge between 2008 and 2010, and the current controversy surrounding the installation are relevant.Kondo also discusses the need to reevaluate the relation between art and politics in Japan, and the continuing importance of art in the ongoing struggle against the Maeda and Takahashi regimes in Japan. His forthcoming project, “Rin, The Tokyo Bridge,” also based on a photograph by Tsuyoshi Tsuruoka, will be on view in Tokyo Central Station in 2020.\n\n\nThe Pérez Art Museum in Puebla, Mexico, has received a gift of some twenty-five works from the Puebla Museum of Art, which was founded by the Puebla People in 2008 as a commemorative museum for", "The next Biennial should welcome the public in 2021. For the past two years, the museum has been working toward revising its current exhibition program and expanding its collections. The institution’s current exhibition, “Away from the Sun,” opened in the summer of 2018 and has yet to reopen. The next edition of the Diller Scofidio + Renfro–designed show will take place in the spring of 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston will give $20,000 to individual artists who are participating in the upcoming twenty-fifth edition of the Boston Artadia Awards. The annual $100 prize, which honors emerging and established artists, is one of the many prizes given out by MFA. The biennial has also helped to raise more than $100,000 for the museum, which was also awarded a $10,000 MFA Foundation grant for the 2019–20 season.“We are thrilled to receive this generous gift from MA’s talented and dedicated curators,” said Peter Travers, the MFA’s executive director. “The museum’s exhibition program has been featured in many exhibitions across the country and internationally and this year", "The next Biennial should be held in 2021.\n\n\nThe British Museum in London announced today that it is planning to turn the building where the Dorothea Rockgreen Collection, the family collection of James Charles Rockgreen, and other works are stored into a new center dedicated to the visual arts. The American artist and educator, whose work is often compared to that of Mark Rothko, was a major collector of rockets\u0097the list includes Peter Weems, John Tavares, and others associated with the famous worship group Pentagram\u0097in the 1960s.Born in London in 1936, Rockgreen studied at the Royal Academy of Arts, Cambridge, where she met her husband; acquired the family collection in 1964; and began working alongside her husband on a series of projects that incorporated sculpture, drawings, photography, installation, and installation photography.In 1977, the couple moved to the United States, where their three-acre estate is now managed by the nonprofit Manchester Cultural Center. The Rockgreen Sculpture Park, an outdoor sculpture park that is intended to mimic the natural environment in which the works are housed\u0097the center has commissioned artists to create works in its courtyard\u0097was completed in 2010 and named after the couple.\n\n\nThe Museum of", "The next Biennial should be held in the spring of 2021. The institution will also hold one more exhibition in the spring of 2022. The restructuring of the Biennale is part of Oederbeek’s plan to shift its exhibition space in Amsterdam to a smaller, more intimate venue. The restructuring, which will be implemented by Oederbeek as well as Biennale Board member and former mayor of Amsterdam, Hein de Kooning, will also involve the exhibition of fewer works and the reduction of the number of works on view.The restructuring of the exhibition space is part of a new strategy that integrates the exhibition of contemporary art with events and programming across the city, including events such as the opening of the new Museum of Contemporary Art in the port of Rotterdam. The restructuring of the Biennale is part of a larger plan to diversify the Biennale’s collection and collection programs in order to improve accessibility and accessibility aims will be enhanced. In order to improve accessibility for the general public, Oederbeek will introduce a new digital platform that will allow visitors to enter the Biennale from a number of different locations around the city. As part of the renovation, Oederbeek", "The next Biennial should be held in 2021. \n\n\nThe Art Newspaper has published a new report that reveals that sales of works by artists on the verge of their first exhibitions are at a record high. The study, titled “Art and the Future,” analyzed sales from the artist-run platforms Artforum and Facebook alongside the institution’s own endowment.According to the Art Newspaper, the sales total $1.1 billion, which represents a surge of nearly $100 billion since the crisis began in late March. The surge, which is largely attributed to the coronavirus, has been fueled by an explosion in both demand and supply, fueled by an expected surge in visitors, and by the previously announced opening of the museum’s new $1.4 billion flagship, the David, in 2020.“With a buying power of more than $1 trillion, the market for art is at an all-time high,” Mark Evans, the Art Newspaper’s director, told the Art Newspaper. The increase in demand for art, he said, was driven by a combination of two factors: the coronavirus and the increased popularity of art, especially by middle- and high-income audiences.Among the works", "The next Biennial should address the “issues of language and memory in political struggle,” which is a theme that has been explored by artists working in all the Americas over the last two hundred years. The Biennial’s next iteration will take place in Rio de Janeiro in 2022.\n\n\nThe University of California, Los Angeles (UCLA), announced today that it is planning to reduce the size of its campus by 11 percent in order to balance the school’s academic budget and reduce the number of classes it offers. The first phase of the restructuring, which will begin in the spring of 2022, involves the demotion of three hundred undergraduate and graduate students and the reduction of the number of professors by twenty-five. The second phase, designed to take place in the fall of 2022, will involve the elimination of fifty-nine full-time positions and the establishment of two hundred part-time positions. In a statement, UCLA said that the changes “will reduce the need for institutional and administrative support, and will reduce costs for Los Angeles Unified School District, which operates throughout the city through the California Community Colleges.”During the 2019–20 school year, the district served approximately 2,300 students, providing both a financial boost and", "The next Biennial should be held at the new Galleria Internazionale di Milano in Milan in June 2020 and is expected to cost about $110,000. The show will be hosted by designer Sara Burke, curator of contemporary art at the Milan Biennale, and Christina H.S. Franczano, director of the art museum.\n\n\nThe Liverpool Biennial has received a boost in funding thanks to the generosity of the Wellcome Collection, which revealed in a £3 million donation that it plans to match the annual £65,000 investment of the museum. The donation also includes £30,000 for the construction and renovation of the museum\u0097the museum is currently refurbishing the ground-floor facades of its former premises, and is studying the use of the proceeds from the sale of works of British and foreign art in an attempt to raise funds for its current exhibition program.“Liverpool is one of the most important cultural sites in the United Kingdom and one of the most vibrant arts hubs in the world\u0097and we are living through a challenging time for the city and its arts,” said director Hamish MacGregor. “This is a game-changing gift, helping to make sure", "The next Biennial should take place in 2020. The first edition, held in 2019, heavily featured new works, although it was generally well received by critics, who praised the exhibition’s decision to use Lévy Gorvy’s contemporary collection instead of relying on abstract works by masters such as Pierre-Auguste Renoir. The second edition, which also featured works by artists such as Joëlle Pacotte, Jean-Luc Paré, Henri Matin, and Jean-Luc Lafontaine, opened at the Art Institute of Chicago in 2018. The ten-year program will continue in a new venue in 2020 and will feature work by a selection of artists, including Arts of Life, Mimi Lache, and Alexï Sitch, in 2021.\n\n\nThe Baltimore Museum of Art (BMA) in Maryland has appointed Tia Yozdak as its next executive director. Yozdak is the founder of the commercial real estate company the Carlyle Group and has served at the helm of the organization since October of 2016. She succeeds Carolyn Brown, who has led the museum for eighteen years, and will begin her tenure in January 2021.“Tia has done a tremendous job building the B", "The next Biennial should be held in the coming months, with the German city of Aachenhain in June 2019, and the pavilion should open in 2022. The event will be hosted by the Aachenhain Cultural Center and the University of Aachenhain.\n\n\nThe Museum of Fine Arts (MoFA) in New York has added two new artists to its roster: Mira Dancy and Alicia Barrow. The works, which were selected from a pool of seventy-one artists, will be displayed at the museum in a new exhibition entitled “Theaters of Life,” which will run until December 15.“Dancy and Barrow are among the most promising young American artists,” said museum director Matthew Teitelbaum. “Their recent works draw from the imagination and from their own lives to confront and extend themes that have been most at odds with conventional conceptions of beauty, life, and death.” Although their respective careers are still in their infancy, their shared interest in sculpture and painting and their ongoing studies of the philosophical implications of both have made them excellent candidates for the 2020–2021 season.Dancy’s work, which was exhibited at the Whitney Museum of American", "The next Biennial should be a celebration of the tenacity and the beauty of the black female body. That is the theme of this year’s event, the theme of our next year. We will continue to challenge and change the way we think about our own bodies. We will continue to confront systems of oppression and patriarchy. We will continue to be proud to be black women.”\n\n\nThe newly founded nonprofit Artadia, a New York–based project that supports artists through art schools, arts incubators, and other programs, has awarded more than $2 million in grants to arts institutions since its inception in 2018. The 2018 grant cycle, which began with $50,000 awarded to the Brooklyn Academy of Music on September 26, saw nearly $150,000 in funding come from the Arts and Cultural Heritage Fund and the New York City Council on Cultural Affairs. The 2019 cycle, which launched with a $100,000 grant to the Tenderloin Museum of Modern Art, saw $250,000 in funding come from the City Council, the Mayor, and the NYC Council on Arts.The organization’s board of directors said that the new awards program will continue to support the arts and cultural heritage of New York City through the '", "The next Biennial should be held at the Museo de Arte de São Paulo, Brazil; the Corição de São Paulo, Brazil; and the Museo de Amigos, Rio de Janeiro. \n\n\nOn Tuesday, the International Council of Museums (ICOM) announced that the twenty-second edition of the Milan Biennial, which was canceled due to a catastrophic fire at an industrial complex in the city, will go ahead as planned, despite the intense health concerns caused by the pandemic. The ICP, which was founded by Dutchman Willem de Kooning in 2014, had called for the cancellation of the exhibition, which was set to feature work by twenty-eight artists, just days after the fire that damaged more than three hundred buildings and destroyed at least eighty-seven homes in the neighborhood of Milan, took place on April 24, at the Palazzo Cattelan, in the city of São Paulo.The event, which was set to run from March 26 to March 28, had been moved to the Museo de Arte de São Paulo, and organizers were hopeful that the renovation of the former textile factory complex, which is currently home to the Berggruen Institute, the", "The next Biennial should be held at least once a year, and may be held as often as necessary, depending on the circumstances of the society.”The initiative’s inaugural edition, “Mother Nature Presents,” ran from March 21 to March 29. The next Biennial, “Mother, ” will be held in September 2020. The 2019 edition of the event, titled “Mother: A Retrospective,” was organized as part of the Smithsonian’s A.I.R. Gallery at the University of Chicago’s American Art Museum, which has been working to launch a new permanent exhibition dedicated to the work of the artist. Inspired by the work of Hemingway and his peers, the exhibition will include drawings, sculptures, videos, and installations that have not been shown in the United States for seventy years.The institution is currently working on a monument to the artist, whose work was influenced by his experience living in a steel plant in China. According to Smithsonian American Art, the final version of the installation, which will be presented by the Smithsonian American Art Museum in 2021, will feature an excerpt from the novel, Nature Boy, by Isaac Asimov, in which the character of Mother Nature", "The next Biennial should be held at an Exhibition space in the city, but if it isn't, the city will return the money to the artist who will get the commission. “The Biennial is a tool that can change lives and open up new horizons,” said artist Michael Crowley. “I’ve been approached by a number of museums in the US who have expressed an interest in participating in the next Biennial. They are invited to submit manuscripts, original artworks, or films, and I’m anxious to see what they have to say.”Crowley said that he wants the next show to be “flexible, accessible, relevant, experimental, and experiential,” explaining that his experience doing a series of exhibitions in a museum setting means he can use the platform to create works that are both visual and textual, both historical and contemporary, and both intimate and expansive. In a statement, the museum said: “It’s our goal to present significant artworks within a meaningful historical context. It’s also our goal to present works in environments that are conducive to their development and to foster the practice of interdisciplinary collaboration.”\n\n\nThe Museum of Arts", "The next Biennial should begin in March 2020.\n\n\nThe Metropolitan Museum of Art in New York has appointed Travis L. Carey as its next director. He succeeds Carmel Miro, who retired in June 2019 after twenty-seven years at the institution. “Travis brings a wealth of experience and knowledge to the Met, and has led our institution through a number of transitions,” said director Fran McCarthy. “His ability to inspire, guide, and motivate our artists, staff, and supporters through challenging situations and his ability to translate that passion and vision into tangible results will be essential as we move forward and shape the Met’s trajectory toward reopening and recommenceing our annual exhibition season.”Prior to joining the Met in 2000, Carey served as executive director of the Electronic Arts and helped launch the nonprofit organization the Electronic Arts Promotions, which has supported the organization throughout its seventy-eight-year history. He also worked as a consultant for the Metropolitan Museum of Art, where he helped the Met develop a new engagement strategy; helped establish the Digital Experience at the Metropolitan Museum of Art; and spoke to hundreds of artists and creatives from around the world, including Robert Irwin, Paul Gauguin, François Duane, and", "The next Biennial should, according to the document, encourage the development of new artists’ work. It should also include new educational initiatives, raise funds for conservation and research, and present the exhibition “Binaural,” where the works will be presented in a biennial-size format.The pavilion would be located within the Cultural Capital Hub, a $110 million, 164,000-square-foot former steelworks in downtown Port-au-Prince. The new venue would be managed by the new nonprofit organization Make Place, which was founded by two former school principals, Lyle and Kip Thier, who were previously planning to open a museum in Port-au-Prince but were forced to backtrack after Hurricane Matthew swept through the city, killing at least 151 people.The four-day event would feature artists’ works in their homes, in venues such as the Museo de Arte Contemporáneo, and at public spaces. The pavilion would also host “Pretend,” a workshop for twenty-first-century artists that would include the work of artists such as Jean-Michel Basquiat, Nari Ward, and Gabriel Garcia María. The show would be curated by", "The next Biennial should be held in Shanghai in April 2020. \n\n\nThe Frankfurt Art Museum (FAM) in Germany has welcomed Daniela Samborsky and Anatole Karaman to its staff. The Frankfurt-based artists have announced their participation in the upcoming edition of the Frankfurt Biennale, which will be held in March 2021. Samborsky and Karaman will create new works based on the themes of the week, exploring the connection between architecture and landscape in large-scale installations. The pair will also collaborate with the artistic director of the city of Frankfurt, Dieter Weise, and curator Janine Knupp, who will collaborate with them to develop a new exhibition.“The Frankfurt Art Museum is delighted to welcome two very talented young artists to the team, and we look forward to working with them together in creating the show for the next edition of the Biennale,” said Stefan Beckmann, director of the museum.\n\n\nThe Seattle Art Museum (SAM) has received a gift of more than 600 historic works by Norman Rockwell and his associates. The institution also revealed that more than 2,500 works in its collection will be restored to their original state and displayed in a special exhibition titled “N", "The next Biennial should take place in the village of Sestito di Farmis in the town of Pavia in the province of Sardinia, Italy, in 2020. The theme of the show, “Articles and Discussions,” will be “Articles and Discussions as Art” and will encompass interviews with artists, scholars, writers, and public officials. The artists whose works will be featured in the Biennial are Antron Zsigmond, Atif Ahmad, Diana Alves, and Anastasia Savitskaya. The first exhibition, “Articles and Discussions: Constructivism and the Incisive Art of Art” (2019), was organized by the Arte Povera Foundation in Rome. The second exhibition, “Articles from the Vault: The Art of Criticism” (2019), will air on the Biennial’s website on October 16. The organizers are yet to announce a date for the third and final exhibition, “After the Fall: The Art of Art during the Fall of Soviet Russia,” which will be held in the spring of 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it has", "The next Biennial should be held at the Sakharov Academy in Moscow in 2021. The event will be hosted by the Sakharov Institute of Modern Art and the National Gallery of Art in Washington, DC.\n\n\nThe Whitney Museum of American Art in New York has appointed Alexandra L. Jean as its next director. Jean has served as the director of the Art Institute of Chicago (ICA) and the Art Museum Chicago since 2014, and has helmed the ICA through its first two editions (2015 and 2016). She succeeds Christina Logsdail, who will resign in March 2020 after more than two decades at the helm of the ICA. Jean is also the founder of the New York–based nonprofit the Whitney Center for Contemporary Art, which has supported the ICA, and the National Council on the Arts, which decides on the future of the ICA.“We are thrilled to welcome Alexandra to the ICA family,” said ICA director Elizabeth Alexander. “Her history, passion, and ability to bring great exhibitions and programs to Chicago reflect her understanding and skill as a leader. We are confident that her ability to work across disciplines and eras will continue to shape the ICA’s artistic mission and shape the ICA�", "The next Biennial should be organized in ten weeks and will be ready to go by the end of May. Organizers are planning to open the exhibition at the Kunsthalle Basel in June and will present the first exhibition of works by artists such as Ernst and Heckelmann, Henri Matisse, and Piet Mondrian. The biennial will also feature an exhibition of sculptural works by artists such as Jan and Jan von Praem, who are collaborating again this year.The exhibition will be hosted by the Kunsthalle Basel in collaboration with the BMW Group and will be curated by Markus Schäfer, the director of the Kunsthalle Basel. The last few years have seen a series of exhibitions of work by women artists, many of whom are taking part in the first exhibition scheduled for the autumn. Among the first artists to receive commissions from the Kunsthalle Basel are Marina Schäfer, Anna Bächli, Irene Reed, and Hanna Škoda, who are all collaborating again this year. The Kunsthalle is also organizing a special exhibition dedicated to the Swedish artist Katjaa Aarhus. \n\n\nThe Museum of Fine Arts (MFA) in New York has hired Domenico Tribolo", "The next Biennial should commence in the Fall of 2019. For a full list of participating artists, visit the Biodata Biennial website.\n\n\nThe Seattle Asian Art Museum (SAAMI) has received a gift of eighty-one works by seventy-four contemporary artworks from the collection of Roberta Kass. Only ten of the works are currently on view in the institution’s newly renovated Asian Art Museum (SAAMI), which opened to the public last fall.The gift includes works by artists such as Alex Katz, Andrew Seymour, and Anna Atkins; a selection from the Kass Collection, including work by Tracy Leto, Arashka Karangara, and Matisse; and three previously unexported works by Kass that were on display in the museum’s collection. “The Kass Collection is a treasure trove of contemporary art,” said SAAMI director Rini Sexton. “The museum has been able to secure the works and collections of very distinguished collectors in recent years, but none of these works are on view. We are incredibly grateful to the Kass family for this generous gift.”Sexton added: “We have long admired Roberta Kass, and in 2016 we were impressed by the work of her", "The next Biennial should be held in 2020.\n\n\nThe Austin Art Museum has added seven new artists to its collection: Poppy Harlow, Katherina Maldonado, and Christine Hooper. Harlow graduated from Texas Southern College in Austin and worked as a curator at the Whitney Museum of American Art in New York. She currently works as a freelance curator, where she curated the 2013 exhibition “Thinking About Politics: Poppy Harlow” at the Whitney Museum of American Art. “I’ve known Poppy Harlow since her early paintings,” said museum director and CEO Jan Goldsmith. “Her bold, politically charged, and often surrealist paintings, which reflect an intuitive understanding of the visual world, and her vivid, sometimes disturbing, sculpture, which elegantly blends the physical and the spiritual, are considered classics.”Commenting on the museum’s selection, Harlow said: “In addition to being a master of art, I’ve been inspired by the museum’s collection and the people who have worked here over the last fifteen years. I’m especially proud of the work of my predecessor, Patience Trotman, who was instrumental in growing our"]