["The next Biennial should begin in 2021 and take place at the Tombs of Samsara monastery in the Aligarh region of western India. The biennial will focus on how the art of the Theravada tradition, which traces its origins to the Tamil and Marathi traditions, can be made accessible to a wider audience.One hundred thousand artworks by forty artists from forty countries will be presented in the exhibition, which will be held on the tony island of Goa in India’s Western Ocean. The theme “God and Life in the Bodhisattva Landscape” will be centered around the Bodhisattva state of Śabiranga, and will explore the concept of a bodhisattva. The exhibition will take a Buddhist aesthetic and will include sixty-one works by contemporary artists. The exhibition is part of the “Global History of Photography,” a larger initiative to focus on the history of photography through photographs. The first half of the exhibition will highlight the “Golden Age” (1650–1700), the “Golden Age”’s development as a photography medium, and the “Golden Age”’s influence on the development of photography in the", "The next Biennial should be held in 2021.\n\n\nThe Corcoran Gallery in New York is planning a major renovation of its space in the Hudson Yards neighborhood of Manhattan. According to Artnews, the gallery is renovating its existing space in the 5,100-square-foot building into a new thirty-nine-thousand-square-foot museum that will house a large collection of works by artists such as Mark di Suvero, Francis Ford Coppola, and Lin-Manuel Miranda.The Galleria del Corcoran, which is housed in a former dairy warehouse, opened in the former garment factory in 2010, shortly after the Javits Center was completed. The gallery’s inaugural exhibition, “Fabrication,” was organized as a show of the works of artist-in-residence Paul Graham. The show’s twenty-one-thousand-piece collection is comprised of works by Pierre-Auguste Renoir, Pierre-Auguste Renoir: The Third Man, and Pierre-Auguste Renoir: The Mother Less Male, as well as works by Renoir in the studio. To date, the gallery has organized twenty-nine shows in the United States and has presented work by", "The next Biennial should be held in 2020, and the 2020 Exhibition should be a continuation of the first, said the organizers.The event will be hosted by the Paris-based architectural studio Tillett and will take place outside of the city of Paris. The exhibition will present a selection of works by forty-eight artists, including Pierre-Auguste Renoir, Aline M. Hirschhorn, Remedios Varo, Jacques-Louis Vuillard, Alighiero Cattelan, Elsa von Neue Nationalgalerie, and Louise Bourgeois.The 2020 Exhibition will be held at the Consulate General of France in Frankfurt, the city of Germany. It will also be hosted by the French Ministry of Culture and the Museum du Temple de Paris, and will highlight work by forty-seven French artists, including Dominique Haigh, Edouard Bouguereau, Jean-Luc Godard, Jean-Paul Gauguin, Frank Gehry, and Marius Mauris.The 2019 edition of the show was concurrently held at the Paris Museum of Fine Arts and at the Museu de Arte Moderno. The show, which ran from February 3 to February 7, 2019, featured work by sixty-three artists, including Jean-", "The next Biennial should take place in 2022. \n\n\nLos Angeles’s Art Museum and Botanical Gardens (LACMA) and the Pasadena Art Museum (PAMM) have announced that the two institutions will collaborate in the renovation of their historic buildings, which have been closed since 2016 due to Covid-19, and are currently in the process of organizing an exhibition that will feature works by thirty-two artists, including Lee Camp, Kaitlin Burton, Jenny Holzer, and Marcus Olsson.The works will be mounted in the museum’s newly constructed galleries. The museum will also be retrofitted with a new greenhouse that will provide the necessary environment to create new works by thirty-two artists. PAMM’s extensive collection of art dating from the Gold Rush to the present, including works by artists such as Gustavo Dudamel, Mário Flores, and Marcel Proust, will be restored through a $2 million renovation and expansion project.“As Pasadena’s first public museum dedicated to contemporary art, we are committed to the long-term preservation of the landmark building and its collection of art from the Pasadena Art Museum and Botanical Gardens,” said museum director Michael S.", "The next Biennial should take place in Paris sometime this fall. The theme of the year will be “How to Live together in a World Without Us” and will consist of a series of interviews between Marc-Olivier, Gerard Biard, Michel Houellebecq, and Jean-Luc Godard. Marc-Olivier will situate the interviews within the plot of a novel written by Jean-Luc Godard. \n\n\nThe exhibition “In Praise of Nothing” was set to open in Bilbao, Brazil, on July 7, but was postponed due to the Covid-19 pandemic. The exhibition was originally scheduled to open in August, but was pushed back again due to concerns over the virus. Luca Bruno, artistic director of the Biennale de Lyon, commented: “We are determined to push forward with the opening of the show, in part because of the extraordinarily high level of interest on the part of artists, collectors, and institutions worldwide in the exhibition. We are confident that with the assistance of the International Festival of Curators and the support of the artists, collectors, and institutions of the art world, we can present the show with the impact and warmth that we have always", "The next Biennial should be held in 2020. \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than one hundred works by contemporary artist Justin Hurley. In his will, the seventy-seven-year-old philanthropist, who has taught at LACMA since 1987, gifted the institution a selection of works by the artist which span a variety of media and depict various experiences.“I’ve been a huge fan of Hurley for many years,” said Paul Mpagi Sepuya, LACMA’s director and CEO. “I’ve actually been working with him for years and have been a huge admirer of his work. I’ve been fascinated by his art for years and have always wanted to try to find new ways to connect with it. I think that he is one of the greatest living African American artists and his work is on view in this year’s museum.”Hurley was born in Atlanta in 1941, the son of a railroad engineer and a homemaker. Although he was studying painting at the University of Southwestern Tennessee in the early 1940s, he quickly earned his first commission, as a landscape artist for", "The next Biennial should be held in 2022, with the programme scheduled to run from March to September 2022. The twenty-eight artists chosen to participate in the exhibition will take the full duration of the installation and will return to the exhibition in 2021.\n\n\nThe London-based artist, who often draws from his own personal experiences to create works that examine the history of the building and its environments, has died. He was seventy-nine years old.Born in London in 1933, the son of a German Jewish family, Alexander and Gertrude Rich, the artist studied at the School of the Arts in London, the Institute of Art in London, and the Royal College of Art in Oxford. In the 1950s, he continued his studies at the school, but in the early ’60s moved to Paris to study at the Académie des Beaux-Arts. In 1967, he returned to London, where he would spend the next eight years, practicing his craft and living and working from his studio.In 1974, an exhibition at the Museum of Modern Art (MoMA) in New York featured his work’s first solo exhibition. He returned to Paris in the summer of 1976, where he met and began to work with Pierre Hab", "The next Biennial should take place in both Paris and Berlin, and at least one of the upcoming editions should include a performance by a selected group of artists, according to the art historian Isabelle Crozier. The six-month event is meant to be a platform for the art of the future and will be held at the Galleria Paul Ricoe in Rome, the Solomon R. Guggenheim Museum in New York, and the Bode Museum in Vienna.The exhibition will focus on innovations in art and design in an effort to address some of the major challenges of the contemporary world and will also include a selection of works on paper. According to the organizers, the exhibition will introduce a new generation of collectors to the art world and will include the work of artists, designers, vendors, and activists in order to promote the ideas of new digital technologies and new materials. An artist-in-residence will be created in each city and will serve as an exhibition space in the summer of 2021.\n\n\nJapan’s Tate Japan announced today that it will postpone the 2019 edition of its Tokyo Triennale, originally set to take place in January, to March. The announcement comes less than a week after a group of Japanese artists,", "The next Biennial should be held in March 2022. During the next two years, the Biennials will present ten exhibitions a year. The institution will also begin to consider new ways to organize exhibitions, collaborations, and educational programs. Participating artists include Artsasia, Artisanal Astana, Artanguard, Art of the Masses, Babylon Museum, Bibliothèque d’Art Contemporain, Bibliothèque du Pape, Bibliothèque des Beaux-Arts, Bibliothèque du Louvre, Bibliothèque du Monde, Bibliothèque du Parc, Bibliothèque du Vin, Bibliothèque du Tournai, Bibliothèque du Ville, Bibliothèque du Ville+Henriette Bouquet, Founded in 2015 by Arnaud de Montlaur, the institution was granted a temporary license to open its first exhibition space in Paris in February 2018.\n\n\nThe museum of contemporary art in Bangkok has canceled a show that was to have taken place this", "The next Biennial should be an open-access event, with visitors having the opportunity to examine and make works. The first exhibition will be a biennial of works created in the area of the Biennial's inaugural exhibition. The second will be a public gathering of work-in-progress and exhibition-ready materials and will be presented by the Paris-based collective the Fine Arts Museums (Claude & Luce). The third exhibition will be a special project of the Guggenheim in cooperation with the local community, and will be organized in collaboration with the historian and writer Zina Edidi.The story of the biennial is a microcosm of the global crisis of the present. The museum has been impacted by the global outbreak of Covid-19 since February, and the collaborative exhibition is one of the mainstays of its season. In order to mitigate the health risks and protect the work-in-progress, the museum has declared an emergency of the second and third floors, and has installed new panic buttons and a self-healing barrier to prevent dust and water damage.The Guggenheim has also faced backlash from some quarters for the exhibition’s decision to open on a Saturday, a Friday, and a Monday", "The next Biennial should be held at the Museum of Fine Arts, Boston, the Museum of Contemporary Art, San Francisco, and the Museum of Modern Art in New York. The 2020 event will be held at the New Museum in New York from January 13 to January 19, 2020.\n\n\nThe Uffizi Foundation, the Italian government-backed organization that funds contemporary art in Italy, has announced that it will not receive any monies from the current account crisis in September. According to the Art Newspaper, the conference is the first time that an Italian institution has withheld funds from the crisis.According to the Art Newspaper, the Uffizi Foundation president, Carlo Bombioni, said: “We are facing a situation in which the future of the Italian art world and the international exhibition industry is at stake. It is a situation of which we are all but incapable of handling. . . . So we decided to take a decision that would guarantee the future of the foundation, the Art Newspaper reports. The decision was made jointly by Carlo Bombioni and Valentino Lepin. It was unanimous, but in addition to the general criticisms made by the other directors of the organization, they questioned the decision. The decision was made in the interest of the", "The next Biennial should take place at the Museum of Modern Art, the OMA in New York, or the Biennial of Contemporary Art, London, and will be announced by the Museum of Modern Art, in conjunction with Artforum. It will be held at the Museum of Contemporary Art, London.Beginning at the museum, the biennial will include five exhibitions that examine artists’ practices through the lens of newness. The twenty-second exhibition will focus on the history of performance art, and the twenty-third exhibition will examine the history of interdisciplinary art. The twenty-fourth and twenty-fifth biennials will be dedicated to artists and their mediums, and the twenty-ninth will examine the relationship between art and health.The full list of participating artists is as follows:Anna Bronstein (New York)Dave Chiu (New York)Diane Goldin (New York)Dirk Fridericiano (New York)Derek Frank (New York)Dorian Jones (New York)Derek Huang (New York)Derek Kranz (New York)Derek Lewis (New York)Drew Mahan (New York)Drew Kiefer (New York)Drew Mull", "The next Biennial should also take place at the Museum of Contemporary Art Los Angeles (MCA LA) and will be held in the fall of 2021. Artist-in-Residence Rina Banerjee, a curator and writer based in New Delhi, will serve as the inaugural director. Inaugurating the inaugural biennial will be the reopening of the newly renovated SID Architects–designed Biennial Pavilion, which will inaugurate the 2019 edition; the inaugural Film and Literature Biennial; and New International Art, which will be held in the second half of the year. The opening of the new museum will also coincide with the reopening of the recently renovated Museum of Contemporary Art (MoCA), which will inaugurate the twenty-fourth edition of the biennial in October.About the 2017 edition of the Venice Biennale, which was staged in Venice in March and April, the exhibition was postponed from March to July and featured performances by thirty-seven artists. “In the first half of the year, we will have new projects, new exhibitions, new performances, and new works in the galleries,” said Pascal Rozen, the artistic director of the Biennale. “The Cultural Centre will also have a new exhibition", "The next Biennial should include a discussion on the development of a new site for the museum. The new museum will be designed by the Atlanta-based firm W.G. Mote & Partners, with design by the Georgia-based firm Pinnacle West. The museum will be inaugurated by a three-minute film by director/artistic collaborator John Akomfrah. The new museum is also collaborating with the Georgia Museum of Art on an exhibition of work by the late Georgia governor Sonny Perdue. The show, titled “Bush and the World,” will run from March 28 to March 29. Inaugurating the new museum will be an installation of the works of the Atlanta-based artist, designer, and educator Norman Red Menchaca. Make sure to follow Artnet’s Modern Art Twitter account and Artnet Photos’ Twitter account on Facebook to stay updated with the latest in art and culture. The biennial will be held at the museum’s former campus in the Buckhead neighborhood of Atlanta, which has undergone a major $4.3 million expansion. The new building, which boasts a 3,600-square-foot gallery, a restaurant, and classrooms, will be inaug", "The next Biennial should be held in September 2021. While other editions of the exhibition will be held in the United States and Europe, it will be relocated to New York.  The first tier of the upcoming exhibition will be dedicated to the works of the twenty-sixth Biennial, “WELCOME TO THE OUTPOST.” Based on the Eleventh Amendment to the Constitution, the exhibition will feature artworks that address social and environmental concerns, such as work by the African diaspora, Indigenous art, and LGBTQ art. Citing the importance of youth in contemporary culture, the exhibition will include a series of live performances, a digital platform for the exhibition, and other activities and events that will be organized to attract and engage with audiences. The second tier of the exhibition will focus on the history of refugees and asylum seekers, focusing especially on their history of migrations and detention, and will be organized in parallel with the exhibition.“The future of art and culture in the United States and around the world is at stake,” said Harald Szeemann, the director of the Museum of Modern Art. “Art and culture are the engines of social change, and they play an important role in forging new", "The next Biennial should be held in 2020 at the V&A and will be inaugurated by a new exhibition of work by the Belgian-born, New York–based artist Tilmans. The program is being organized as part of an initiative to re-imagine the museum experience in a new way.“The new model has been made possible by a new generation of curators who are reshaping the museum with a new view and a new intellect, and inventing new and hitherto unexamined works,” said Kassel-based curator Joël Lehnert, who has served as director of the V&A’s contemporary art section for five years and was appointed curator of the biennial this spring. “I’m a little nervous, because now I have to start planning and organizing the exhibition. But I’m not nervous about the project, I’m nervous about the show.”Since its initial exhibition of work by the artist in 1991, the biennial has attracted some of the most prominent artists from around the world, including Robert Irwin, John Paul and Olga Canell, Werner Herzog, David Salle, Sergei Grosvenor, and Ed Moses. The second edition", "The next Biennial should focus on the history of ancient and modern art and the future of the service,” the site reads.\n\n\nThe 2018 biennial of Diyarbakır, Turkey, has announced that it will no longer hold its next edition, titled: \"Between Two Worlds’s Gallery,” due to return to Istanbul in November 2021. A statement released by the Armenian Cultural Foundation reads: “The fair, which was organized by Diyarbakır Art and Architecture Museum, was not able to present its 25th edition in Ankara in March, and the reasons for this are really problematic. Therefore, in order to think of a new solution, the Diyarbakır Art and Architecture Museum decided to postpone the event until at least May 2021. We hope that this decision will help the fair organizers to move forward with the event in the best interests of the fair and the fair participants.”The Statement of the Armenian Cultural Foundation reads: “The Diyarbakır Art and Architecture Museum cannot exclude the possibility of the exhibition of the exhibition Between Two Worlds’s Gallery,” which consists of a combination of exhibition space, a chair, and a gallery that will", "The next Biennial should also examine the role of migration in urban development and the future of the city’s art, culture, and heritage. Modern urbanism has witnessed several pivotal transformations in its sixty-two years of existence. Its post-World War II generation underwent a sweeping cultural and intellectual rethinking of the world from the West; its architects participated in the construction of the new city for the former Soviet Union; and its architects were considered global icons. As the global aesthetic landscape changed, so did its architecture. In 1970, Michael Graves created the Myra Headlands National Sculpture Park in the Kenilworth Sculpture Garden, which today houses the entirety of the contemporary art museum’s collection. In 1987, the museum became the first museum to hold a major retrospective of the work of the American artist Frank Gehry, with an exhibition of his art in 1994. In 2018, the museum reopened to the public to celebrate its centenary.\n\n\nThe National Gallery in London has announced that it plans to shift its collection from its current exhibition format to a digital format as part of a major overhaul of its upper level and its administrative operation. The future of the institution is currently up in the air following the 2016 reopening of the National Museum", "The next Biennial should be on the 20th of April.\n\n\nThe Metropolitan Museum of Art in New York has appointed Kamiar Taylor as its next director. Taylor will succeed director Christopher Lloyd, who has led the institution for nearly fifteen years, and will assume his responsibilities in April 2020.“Kamiar is a distinguished leader who has made the Met a major cultural destination in New York City,” said Peter W. Scharf, the institution’s board president. “He has created a strong and diversified portfolio of exhibitions, public programs, and digital initiatives that continue to advance our mission of providing a platform for artists and audiences to connect with the works of the honored and the work of the greatest American sculptors.”Taylor joined the Met in 2011 as director of curatorial affairs. He assumed the role of senior curator and director in January 2015, when he resigned from the board of trustees to pursue a career in the public sector. Taylor added two new commissions to the museum’s collection in 2017, “Prism: A Contemporary Art History” (2019) and “Prism: The Exhibitionist,” both of which were staged by the newly formed Metropolitan Museum of Art, and served", "The next Biennial should consider a post-trauma model to address the impact of trauma. On the occasion of the twenty-fifth edition, Dr. Antony Hudak, chair of the department of psychiatry at Columbia University, New York, and Dr. Zvi Haber, director of the Center for Trauma, said: “All the elements of a post-trauma community are present and well within our current medical systems, and we should consider them. Indeed, the best way to treat trauma is to consider the community as a whole, and what resources can be put into the care of trauma survivors.”The next edition of the Biennial will be held at the campus of the City University of New York from March 13 to March 15, 2020. The theme “Recovery: Beyond the Walls of Psychiatry,” featuring interviews with survivors of psychiatric and addiction treatment centers, is one of a number of topics that will be addressed in the Biennial. The theme is one of the themes of the ’70s Biennial, “After Trauma: From the Margins to the Streets” (issue #72), and will be revisited in 2020.\n\n\nThe Museum of Jewish Heritage (M", "The next Biennial should hopefully be up and running in mid-March, and biennials will probably be the subject of a formal announcement in the coming weeks.\n\n\nThe National Museums Scotland (NMS) has appointed Peter Tom as its new director. He will succeed John McAllister, who will remain at the helm of the organisation through March 2021, and will assume his responsibilities in March 2022.“Peter is a leader, a visionary and a loyal servant of the NMS,” said Nic Dakin, the NMS’s chief executive. “He has brought a keen understanding of the collections and exhibitions and the expertise to further and shape the vision of the NMS while ensuring the future of the arts in Scotland. He is truly a national treasure and represents an exciting future for the NMS.”McAllister will continue to be involved with the NMS, but will not be involved in scheduling exhibitions or directing exhibitions. A new museum of the Scottish in collaboration with the National Museum of Scotland is currently underway in the National Museum of Fine Arts Glasgow, which will open in 2022. \n\n\nAfter a group of artists, writers, and other cultural workers in Hong Kong withdrew from a planned protest rally this weekend", "The next Biennial should be held in the year 2021. ​\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received $10 million from the California Community Foundation (CCF), the state’s economic development agency. The gift, which is a portion of the institution’s $75 million capital campaign for the 2020–2021 fiscal year, was made in 2017 and was made in response to MoCA’s announcement that it would close its doors for the last time in 2022.“This is an extraordinary year to be a board member of the CCF,” said board president Matthew Lau. “Each year we are challenged to think of new ways in which art can affect and shape the lives of communities. We are grateful for the opportunity to work with the CCF to advance the museum’s mission, and to support the museum’s mission of showcasing the work of contemporary artists. We are excited to see what future MoCA has in store for its beloved building, and for the artists, artists, artists, artists, and artists around the world who will continue to inhabit and shape its space.”The institution received its $10 million grant in 2017, when MoCA was still", "The next Biennial should be held in late spring or early summer. \n\n\nArtforum has announced its selection of five artists for its May 30 issue. The six-day event will include a reception at the artist’s London, a solo exhibition at the National Gallery, and a presentation at the National Theatre. The biennial is curated by artist-in-residence, Laura Mulvey, and will highlight the work of forty-four young British artists.Curated by Laura MulveyThe International Artists’ Festival: From River to The River (2017) is the finale of a one-day series, “The International,” that began in London in July. The yearlong festival, which traditionally culminates with an exhibition at the National Poetry Library, will now move to New York City for its next iteration. The event will be hosted by the National Poetry Library and will run from March 29 to March 31.“Our artists have left their mark on the world, and we are all inspired by their world,” said Laura Mulvey, who is a longtime curator at the National Poetry Library and the first woman to chair the festival. “Their work, in its many forms, is a window into the", "The next Biennial should take place in New York in 2022. \nThe announcement follows a year of spectacular growth for the museum, which has seen attendance surge from 9 million visitors in 2015 to 15.6 million in 2016. The museum, which was founded by William Goldman in 1937, plans to open a new $120 million headquarters in the city next year and intends to expand the museum into a space that would house the entire collection of more than 4,500 works by contemporary artists. However, the construction of the building, which will be located at 15 East Seventy-Third Street in Manhattan, has been held up by a series of delays and has served as a source of contention for the museum.According to NY1, a new three-tenths-scale design for the museum was unveiled in May, but the project was halted in June after the reopening of the museum in the summer of 2018. The refurbished museum will be inaugurated by a new exhibition of works by Pierre-Auguste Renoir in the fall of 2020. \n\nThe Museum of Art in Chicago has announced its representation of the Egyptian artist and educator Nima Nabavi, whose charcoal drawings and sculptures take a fantastical and playful approach to the creation of sculptures of deceased", "The next Biennial should focus on critical interdisciplinary research and create a new platform for experimentation in social change. It should also serve as a pulse in the international conversation in order to expand our knowledge and understanding of contemporary issues through a public forum. The next iteration of biennial ’s project, “Black Decade” will focus on the history of African art and will take place from March 27 to March 29, 2020. The Redevelopment Museum of Art in Harlem, the Museum of Modern Art, and the Museum of Modern Art New York will present the next iteration of the museum’s Designing Black: Designing Black for Harlem, which will run March 22 to March 29. The “Arts of Resistance” will be a retrospective of artworks by Gheorghe Bochner, Tanya Bonakdar, Wangechi Mutu, Tariq Ali, and many others and will be held at the Art Institute of Chicago (AIC), March 15–March 21. Other events slated for the 2020 edition of the Redevelopment Museum are the “Playground for the Power of Art”, “Abraham Lincoln: The Untold Story” (March 20–March", "The next Biennial should take place in 2021, at which point the first edition of the exhibition will move to the Biennial Center in Lisbon. The work of artist-in-residence Marina Kuzma will be included in the second edition (2019); and the third edition (2019) will take place in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Chris Albrecht as its next executive director. Albrecht will be responsible for building on and strengthening the curatorial and development programs of the institution.“Chris’s leadership qualities, knowledge, and passion for art make him ideal for the newly created role of executive director,” said museum director Noah Horowitz. “Chris brings significant experience in both the arts and technology. He has managed the museum’s collection, developed exhibitions and programs around art, and curated some of the most important exhibitions in museum history. We are thrilled to welcome him to MoCA and his growing list of achievements.”Prior to joining MoCA in 2007, Albrecht was the director of the Hammer Museum at the University of Pittsburgh, where he was the chief curator of the exhibition “Electric City,” which opened in 2008 and remains on view", "The next Biennial should be held in 2020. This article was originally published by Artnews. Republished with permission.\n\n\nThe Museum of Modern Art (MoMA)—a major supporter of the French Resistance during the Vichy regime and an advocate of social justice and the arts in general—is suing the French Ministry of Culture, which is accused of trying to suppress a retrospective of the controversial work of the late French artist Henri Matin. The exhibition was to have taken place at the institution's Thirteenth Street location in Manhattan in 2021.It is claiming that the ban on the exhibition—which was supposed to take place in March—was in violation of the Le Mans Accords, France’s treaty with the United States, which stipulates that no retrospective of a banned work may take place in France between May 27 and April 29, 2021.The institution is demanding that the museum stop denying entry to visitors to the exhibition until it addresses the dispute through a formal complaint in the Court of Cassation, France’s supreme court of appeal. The argument will then be heard by a three-person panel convened by judges from the French Ministry of Culture, which is going before the court for the first time to address a formal complaint regarding the exhibition", "The next Biennial should take place in 2021, and the two-year event will be hosted by the Brooklyn-based nonprofit HomeRunsArt. The biennial will commemorate the personal and collective work of the late artist-activists Lillian Harvey and Kathy Ayer, who are widely recognized as pioneers of the electronic-music subgenre. Harvey and Ayer were among the first to use computers to create music, and their work is recounted in the book The Art of Noise: From Jazz to Electronic Music, 1972–1986 by Paul Haggis and Douglas Adams. In honor of Harvey and Ayer’s achievements, the Biennial will present the Harvey/Ayer Project, an exhibition of their music works, the Harvey/Ayer Sessions, an online-only event, and a retrospective of their work at the Brooklyn Museum in 2017.The 2020 biennial will include works by artists such as Jessie James Perry, Nirvana, Giorgio Armani, and Amy Sherman-Palladino, and will take up the themes of social justice, technology and the body, and will be staged at the Brooklyn Navy Yard in October. The event will feature work by seventy artists, including Harald S", "The next Biennial should take place in 2021, and the first exhibition will be an installment of the same ideas in 2019. The show will be organized so that the audience, who will be able to enter the hall through specially designed windows, will have an intimate view of the works. The spaces, which have been created with the help of international and local partners, will be located in the central courtyard of the Museo de Arte Contemporáneo de Madrid, and will include works by women artists from the Philippines, Mexico, and Costa Rica.Daniels, who will assume her post in January 2020, said: “Arts is an important engine of social cohesion and action, one of the most potent guards of social cohesion and action in the world. It is a tool that can be recharged, recharged again and again through the social, ecological and cultural production of art for art’s sake.” She added that the new office, where she will work in partnership with the late Catalan architect Felipe Banderas, and the museum will be “in a way a laboratory for the realization of the ideals of the contemporary artist, a laboratory for his thought about content and the instrumentality of art.”\n\n", "The next Biennial should be held in 2021. “We are currently researching ways to further explore the cultural heritage of the city,” said Breivik. “We have been investing in new educational programmes and in the distribution of knowledge in an effort to bring about a more open and transparent culture. We are also planning new exhibitions and exhibitions.”Commenting on her appointment, Breivik said: “The Biennial is one of the most important achievements of my career, and it was given to me by a great team. I am very much looking forward to working with the city of Oslo and the city’s residents and working with the community to see this Biennial through to the end.”\n\n\nArt historian, author, and curator Pia Camil is suing the museum where she was held captive by the Abu Ghraib prison for three years and three months, accusing director John Alexander of ignoring warnings about the risks of housing a trans-species species and inhumane prison diet.The New York–based artist and human rights activist filed a lawsuit in federal court in Manhattan on Tuesday, October 16, in an attempt to secure compensation for the three years she spent confined to a cage in 2007. ", "The next Biennial should take place in 2020.        ~Nina Silver, Director of the California Institute of Architecture, in Los Angeles, said, “We’re planning to start the new year by rethinking how we create narratives around architecture, how we think about the world and how we create new ideas. This means taking seriously the legacy of buildings, creating conversations about the history of buildings and the future of architecture.”\n\n\nThe Metropolitan Museum of Art (MoMA) in New York is planning to remodel its iconic David H. Koch Chair in Art and the Museum of Modern Art (MoMA) in the Bronx with a new array of office spaces. The overhaul is part of an effort to modernize the museum to make it more accessible and engaging to the public.According to the New York Times, the $8 million redesign will include the redesign of the Museum’s David H. Koch Chair, which is located near the Museum of Modern Art (MoMA), but separated by a large glass door and features a glass paneled interior that resembles a Koch Industries logo. The project is part of a $9 billion overhaul of the museum, which is currently undergoing a $1.5 billion renovation and expansion", "The next Biennial should be held at the LACMA Museum of Art in Los Angeles, which is currently undergoing a $1 billion renovation. “In the next eight years, we will be able to present more exhibitions and performances with an international cast, curated by artists from the biennial, and to organize an annual exhibition that will reflect the full range of contemporary art,” said Herbert.\n\n\nThe National Arts Museum (NAV) in Washington, DC, has introduced three new leadership and development initiatives in an effort to support its talented, dedicated staff and attract and retain new and talented artists. The initiatives—which were coordinated by director of curatorial and development Jennifer McKean and chief curator of modern and contemporary art Robert C. Daniels—involve the creation of a new cross-disciplinary programming center, the Pace, which will be an extension of the Museum of Fine Arts (MFA) in Washington, DC, and the National Gallery of Art (NGA) in Washington, DC; the institution’s relocation to the National Museum of African Art in Atlanta; and the establishment of a new $5 million endowment fund.“The contemporary art world is an ever-changing landscape, and we need", "The next Biennial should take place in December 2020, at the exact moment when the coronavirus is on the rise in the US and Europe. The event will be hosted by the Smithsonian American Art Museum in Washington, DC.\n\n\nThe City of Philadelphia’s budget for its 2020 fiscal year has been released. City Hall estimates that the fiscal year 2020 operating budget will be $13.4 million, a $500,000 decrease from the President’s proposed $15.2 billion plan for 2019. The budget also proposes $300 million for fiscal 2018, which was a result of the cancellation of the 2019 and 2020 seasons. The budget is $120 million lower than the President’s request for fiscal 2021, which was also released on Sunday, February 10, and is $130 million less than the 2018 plan. The 2018 fiscal year ended on March 31, 2019 and ran through May 31, 2019, resulting in a deficit of $1.4 billion.\n\n\nOn Thursday, the Soviet-born architect, architect-general, and founder of the space-age firm Maad Co., Victor Soskoff, died at the age of seventy-nine. The cause of death was pneumonia, which", "The next Biennial should take place in 2022. The full list of participating artists is as follows:Agnieszka Csík, Warsaw, PolandBoris Čljebar, Warsaw, PolandFabiana Negri, Milan, ItalyDimitri Nistor, Milan, ItalyMaudlin Ooi, Milan, ItalyFiona Pfeifer, London, EnglandJuno Van de Wijngaard, Amsterdam, The NetherlandsHannah Wijngaard, Amsterdam, The Netherlands\n\nThe National Gallery of Scotland (NGM) has hired Mark Muro as its new director. Muro comes to the institution from the Royal Academy of Arts (RA), where he succeeds Ian Murray. He succeeds Helen Glynn, who will retire after a decade at the helm of the institution on September 2022.“While at the RA, Mark has been instrumental in bringing together an international group of curators and scholars to create what is now one of the most comprehensive visual arts collections in Scotland,” said Helen Perceval, director of the NGM. “His commitment and passion for art and for creating a more encompassing and inclusive vision of our world, which includes art from other parts of the world, will be", "The next Biennial should also consider how to re-intersection art and social practice with the contemporary and the contemporary effect in the contemporary day with a view to the anticipated future. The fourth iteration of the Biennial, to be hosted at a new site in Santa Fe, New Mexico, will launch in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has established an $18 million fund to support the artists and workers who have lost their livelihoods in the Covid-19 pandemic. The funds will come from the Karlsruhe and Edward Wirth Galleries, whose former home is slated for demolition, and a new $4 billion package negotiated by the city of Los Angeles.“The future of art and culture is at stake,” said City Councilman Mitch Englander, who represents the city’s Chinatown and Downtown areas. The fund will also provide $10 million for the redevelopment of the Foster Art Center, which serves as a public gathering space and has been the site of numerous protests and sit-ins, and $5 million to compensate workers who lost their jobs as a result of the pandemic. “As artists and cultural workers, we are acutely aware of the precariousness of our jobs", "The next Biennial should take place in 2021, and the second in 2022. The 2020 event, called 'Theosophy’s New Life: From Ideas to Action,” opened in the Greek city of Kalamata in March. The exhibition was organized by the Greek Ministry of Culture and the Education and Research Council of the European Communities in cooperation with the University of Strassburg and the University of Vienna. The 2020 exhibition will run at the Athenian Theater in Athens, the National Museum of Greek Architecture in Athens, the Museum of Modern Art, the Museum of Modern Art, University of Vienna, the Museums Fondazione Prada, and the Museum of Modern Art, the National Gallery of Art, and the Forum des Arts Treasures of Art.\n\n\nThe presidential campaign of Turkish artist Fotopunkh, whose work explores the nature of the images and sounds that animate Turkey’s cities and landscapes, has been derailed by a flood of complaints after an exhibition of his work at the Biennale d’Arles in January 2019, when it declared that it would cancel the biennial due to the coronavirus.The exhibition was supposed to have featured work by seventeen artists from Turkey’s Di", "The next Biennial should be held at least four times a year and should incorporate the contributions of both artists and scholars. The festival would provide an opportunity for the better understanding of the work and the artists, as well as the exchanges of ideas and experiences that are essential for the artists.”Julia Bernhard, director of the Biennale, said: “The Biennale was created by artists in a very personal way, in their homes, only a couple of hundred meters from the museum. It was born in a museum, in a space of the museum, and it will always be in an museum. We are extremely happy that people are still experiencing the Biennale in their homes and in their communities for the very first time. It is a wonderful opportunity to share the Biennale with the public.” \n\n\nThe Smithsonian’s National Museum of African Art (NMMA) in Washington, DC, has received a gift of more than one hundred artifacts from the African American community in Washington, DC, including a collection of personal belongings belonging to Black female artists, a copy of a poem written by a Black woman, and a work by a Black lesbian poet.The museum collaborated with an outside organization, the Black Power Project", "The next Biennial should be called the 2019-20 Biennial of the CACAM, after the French Minister of Culture, Françoise Bailly.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) is preparing to open its first museum dedicated to the life and work of American painter John Gutierrez. The institution will introduce a new six-thousand-square-foot exhibition, “Gutierrez: Beyond the Lifelike,” at the museum next month, the New York Times reports.The exhibition will feature works by “gutierrez’s contemporary, John Paul Smith, and will introduce the artist’s work to the public in a three-dimensional theater setting. In the exhibition, which will be presented in a rotating format, Gutierrez will examine his pre- and post-Confederate works in a presentation that will include live performance, installations, and installations that will explore ideas of community, community building, community conflict, and the legacy of a black female body.“In the past few years, Gutierrez has been nominated for a Pulitzer for his art. In the upcoming show, we will showcase his paintings and sculptures in a way that can bring people together,” said Michael Govan", "The next Biennial should be presented by the renowned artist Marina Abramović, in collaboration with the Norwegian architect Knut Steger, in June 2020. However, a change of plans is now being considered for the 2020 edition, which is divided into twelve parts and will take place in the waters of the Sargasso Sea in southern Italy.The works that will be on view include the artist’s first solo exhibition, “Bear in the Air,” in 1997, and “In Search of a Sea,” in 1998, both of which were later restored by the artist and his wife, Anna, with the help of the São Paulo–based firm Carbo Artis. Influenced by the painter-turned-historian René Magritte, the exhibition was organized by the artist and his wife and was staged in collaboration with the thematic artist Ruslan and their two daughters, Oskar and Masha.The artworks will be featured in the pavilion of the third edition of the Fifty-Ninth Venice Biennale, which will go on view in 2020, and will be distributed by artists and institutions across Venice.\n\n\nArtist and activist Karla Menendez, the California native and Oakland native who was", "The next Biennial should be held in 2020, the same year the sculpture “Hologram,” which will be mounted on the twenty-first century Anthropocene, will open.The fifty-seventh edition of the Leeds Biennial will take place at the Leeds Art Gallery on Wednesday, March 21, 2020, at 6 PM. The show is also being hosted by the Museum of Contemporary Art Los Angeles; the New Museum in New York; the National Gallery of Art in Washington DC; and the British Contemporary Art Museum in London.\n\n\nThe Metropolitan Museum of Art (Met) in New York has appointed Doris Hall, a senior curator and art historian whose work spans the history of art and design, as its next executive director. Hall will be the first director to lead the museum since Glenn Ligon retired in 2016. She succeeds Anne-Marie Thorogood, who was named interim director in January 2019.“As we enter a pivotal stage in the museum’s thirty-year history, I’m excited to take on this new role as the new director of the Met,” Hall said in a statement. “I’m inspired by the museum’s history of collaboration with artists, designers, and", "The next Biennial should aim to present a statement of purpose that recalls the work of the past. “The Art of the Future” may be the theme of the upcoming exhibition, “Art of the Future:” curated by Frank Gehry, which is set to open at the Museum of Modern Art in New York in December.\n\n\nThe Flemish Ministry of Culture and the Norwegian Ministry of Arts have agreed to jointly develop a digital platform for the preservation of heritage works in the Netherlands. The initiative will involve the archivists who will work directly with the descendants of the individuals whose works are on display in the museums, and will be overseen by archivists from both countries.“The cultural legacy of the Netherlands and Norway is engrained in the psyche of many Dutch and Norwegian citizens, and in turn, the museums,” said minister of culture Beatrice Opstelten of the Norwegian Ministry of Foreign Affairs. “We will continue to collaborate with the Dutch and Norwegian institutions to preserve the cultural heritage of these countries and countries’ families.” The platform will offer a first glimpse into the archiving project. The ministry will commission a digital-era archivist, who will begin the archiving process by creating a", "The next Biennial should begin with a presentation of work by the artist Jean-Michel Basquiat in the 1950s, a time when the term Biennial was still in its infancy. The theme of the biennial should be “in opposition to the modernist ideal,” said Arne Glimcher, chair of the board of trustees. Since the 1970s, the Biennial has been an annual event that has been held at the Museo de Arte Contemporáneo in Madrid, in collaboration with the public, and has had sixteen editions. \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than six hundred photographs by Robert Irwin. The donation, made by the El Paso-based artist Frank Irvin, also includes ten photographs by the same artist that were previously unaccounted for, including the works he took at a time when he was working alone.Irwin said: “I am extremely honored to receive this gift of the work of Frank Irwin, which was made in the spirit of giving back to the arts and community. I have been an avid collector of Irwin’s work for many years and have had many projects in the works to stage this gift as", "The next Biennial should commence on July 21 and will be hosted by the museum at 1300 Ruxton Street in London and will comprise fifty artists from the exhibition.\n\n\nThe Cultural Centre of the Czech Republic (Czech Republic Museum) in Prague announced today that it will move its exhibitions and concerts to the new museum in the capital, as the institution prepares to open on July 27. The reforms, which will bring the museum closer to the Polish and Austrian capitals, were proposed by the conservative government.The changes were made in order to keep the museum as close to the capital as possible. The government believes that the move will expedite the construction of the museum. The CNA reports that construction is currently scheduled to begin in 2020, and that the museum will be completed by two years. The Central Institute of Art History in Prague will also begin to operate as it has since it opened in the castle in 2014. The museum will be inaugurated on July 27, 2020 with an exhibition of the artist-designed works of the Czechoslovak painter Jaroslav Lisens. The show will run until November 24, 2020, and will feature work by ten artists, including Jan and Jasańs Vyší Střínek and ​Merl", "The next Biennial should be held in 2020. \n\n\nThe Skarstedt Museum in Frankfurt (Germany) has appointed Michele Wächtels as its next director, effective immediately. Wächtels comes to the institution from the Bezirkischer Kunstverein in Munich, where she has been responsible for the development of the museum’s permanent collection since 2014. During her tenure at the Bezirkischer Kunstverein, Wächtels organized more than ninety exhibitions, including the inaugural exhibition “Wirtschaftsbau von Karlsruhe,” which was held in 2018. She also oversaw the launch of the museum’s Münster Galerie, and organized numerous international collaborations.“I am very excited to work with an organization that respects the continuity of the Bezirkischer Kunstverein’s history and even more so to work with an organization that has been dedicated to preserving and exhibiting the Kunstverein’s collection since the 1980s,” Wächtels said. “The Bezirkischer Kunstverein is an exceptional collection for the Kunstverein. Its collection is diverse, of great historical significance,", "The next Biennial should be staged in 2020, and the first in 2021.\n\n\nThe Venetian museum of the same name in Venice has received a donation of five hundred paintings by the famous artist Gio Ponti, who is known for his bold, collaged paintings that often utilize drawings and text as well as music and text to create works that are as profound and thought-provoking as their abstract counterparts.The work, which was given to the museum by the Carnovista family, was acquired by the Venetian collector Giuseppe Romani, who has been working with the family for more than twenty years to secure the works for the institution. In an exhibition that will open in the museum on December 13, Romani will present the works to the public for the first time, during a special exhibition titled “Per Uno,” titled “Gio Ponti: Tutti di Spazio” that will feature works by seventy-eight artists in the institution, which was founded in 1979 as the Casa Romani in the northwestern part of Venice.“I’m very excited to be able to present this work to the public for the first time,” Romani told the Art Newspaper.", "The next Biennial should be held in 2020, according to a statement by the institution.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has launched an investigation into whether the artist-run nonprofit the Boy Scouts of America (BSA) are breaking the law by allowing a pedophile to lead them through a ceremony honoring gay and lesbian troops. The investigation was launched after a complaint was made by a mother and her young son, who were attending a BSA youth event at the Waldorf Astoria on Saturday, March 16.The event, titled, “Just Say Yes” and hosted by the Boy Scouts of America, featured a presentation of a new film by director Oliver Stone and the BSA. The presentation was part of a ceremony honoring gay and lesbian troops who were active in the United States military during the Vietnam War, and honored the BSA’s support of the LGBTQ community.The event was held amid heightened tensions in the United States over the repeal of a law that prohibits sexual abuse of children in the military, and was held in front of a massive crowd of Boy Scouts. The historic event, which included songs performed by Stevie Wonder, Bob Dylan, and John Lennon, drew an estimated 40,000 attendees. When", "The next Biennial should be held in 2020. \n\n\nThe BAE Systems Art Museum in Portsmouth, England, has been selling works by artists such as Pierre-Auguste Renoir and Anne-Claude to raise funds for the British Royal Shakespeare Company. The institution is giving a total of $129,000 to the charity Museum of the Arts, which also made headlines last month when it unveiled a new collection of works by American painter David Adjay.In recognition of their contributions to the museum, the institution is giving the two men a special grant of $32,000. The prize, which was established in 1998, was established following an agreement between the two institutions when they each donated $10,000 to several charities.\n\n\nThe City of London Corporation (C.L.O.C.) is planning to award $1.2 billion in subsidies to London arts and cultural institutions this year, but only if they commit to reducing the carbon emissions blamed for contributing to the coronavirus pandemic. Last month, the government announced that it would provide more than $1 billion in grants to help mitigate the global health crisis, and given that London has already pledged more than $1.2 billion in grants to the capital over the next", "The next Biennial should aim to engage with the current world through directly relevant art and to the extent possible to transform its images and its projects into actual reality. We must be prepared to consider a future beyond the present. We cannot continue this work, but we can continue to present it in exquisite and compelling ways.\n\n\nThe Bellagio Museum of Art in New York, which was scheduled to reopen this spring, has announced that it will suspend construction and will instead begin a three-month outdoor reopening campaign in late April. The announcement was made as the museum prepares to welcome visitors in April and marked the first time the Bellagio has opened to the public since 1999.The reopening was initially scheduled to coincide with the opening of the museum’s collection hall for American art, where new works by artists including John Mayberry, Jacques-Louis Neuville, and Frank Surtees are currently on display. However, the museum has since postponed the opening of the hall and will instead begin a series of public programming activities, including the introduction of a new free children’s book, “A Personal History,” on April 3.“We are thrilled to open with the new book in the hall and to have our first", "The next Biennial should be organized as follows: Biennial 1: The Report of the Fourth International Biennial , 2019 [2019] “ The Ascent of Art: The Role of Science in the Art of Human Life” The Eleventh Venice Biennale: “The Future of Art” The Twelfth Venice Biennale: “Being Art: The Ecstasy of Life” The Thirteenth Venice Biennale: “Philosophy and the Environment” The Fourteenth Venice Biennale: “The Crucifixion of the Body: Towards a New Vision of Physicality” The Fifteenth Venice Biennale: “The Present and the Future: On Art and Meaning in the Twenty-First Century” “The Hygiene Myth: The Effects of Modern Medicine on the Body and the Environment” The Sixteenth Venice Biennale: “The Voyage of the Chef: How Art and Cooking Changed Human Life” The Seventeenth Venice Biennale: “Criticism and Criticism: The History of Art and the History of Cooking” The Eighth Venice International, 2019: ", "The next Biennial should be held in 2022, in the first instance to take place in the city before the start of the reopening of the Smithsonian’s National Museum of African Art in Washington, DC. The inaugural event, Art of the Ancient West, was scheduled for September 2018. The event, which was co-organized by the Smithsonian American Art Museum (SAAM) and the Metropolitan Museum of Art in New York, is currently closed due to Covid-19. “In the interest of expediency,” the Smithsonian announced on Tuesday, “the twenty-third edition of the Art of the Ancient West will be staged in 2022.”According to Smithsonian’s director Joseph C. Watkins, the institution’s top priorities for the 2020 biennial—including the exhibition of work by the first African American artist of the twentieth century—are still being worked out. “While we look forward to the show, we need to do so in a way that represents both the richness of our collection and the breadth of our exhibition program.” \n\n\nShania Twain is suing the Metropolitan Museum of Art in New York City over the institution’s decision to shutter its entire wing of the", "The next Biennial should be selected by the Board of Governors of the Art Museum of Chicago and will be conducted by biennial director Elizabeth Patton. The show will debut in the spring of 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Stephanie Bergs, the senior director of curatorial affairs at the Philadelphia Museum of Art (PMA), as its next executive director. Bergs comes to the institution from the Philadelphia Museum of Art (PMA), where she has served as deputy director since 2015. She succeeds Emily Harmon, who became interim director last May.“Stephanie is incredibly talented and dedicated and has the ability to think through complex and difficult issues through elegantly and thoughtfully, ” said Steven Davis, the director of the MFA. “In the last few years, she has helped AMA to a new level of artistic achievement with the exhibition of the first exhibition of work by the newly restored modernist Richard Diebenkorn, and in sharing AMA’s collection with the public. Her ability to see and appreciate art in its fullness and resonance is an asset to our institution.”Previously, Bergs worked as a curatorial assistant at the Museum of", "The next Biennial should be held in 2021, and the first show in 2022. The 2018 event, titled “The Missing Link,” was organized by the PEN American Writers’ Association, the Center for the Arts, the Museum of Fine Arts, Boston, and the Museum of Contemporary Art, Los Angeles.\n\n\nThe Institute of Contemporary Art (ICA) in New York is launching an ambitious new eight-year plan, which will employ several new creative practices to further its ambitions to become a world leader in art museums’ exhibitions and collections. The platform will encompass a number of new creative initiatives—including “Beyond the Frame” (2019), “Reframing the Museum’s Art,” and “Post-Exhibition,” which will combine panel discussions, residencies, and residencies, as well as noncollecting exhibitions and online experiences.This year’s entry, “Beyond the Frame,” will focus on issues of memory and mythologies and will include works by Jodi Throckmorton, Ruth Pape, William Goldman, and Terence Winter, among others. Throckmorton’s work, which opens the work, “The Frame,�", "The next Biennial should be staged in the spring of 2021. \n\nOne hundred years after the International Exhibition of Modern Art (820), Helsinki, Finland, hosted the first edition of the Nordic Collection, the exhibition was a success. The inaugural exhibition was a success for a number of reasons: its selection of thirteen works by three artists—Nils Lække Rasmussen, Hieb Sommer, and Harald Szeemann—and its invitation to a new generation of Finnish artists.Selected by the Nordic Commission for Contemporary Art, Finland, in 2002, the collection was soon joined by thirty-six works by thirty-nine other artists, including Lars Christian Larsen, Janna Niska, and Hanna Turkina. In 2017, a retrospective of the works featured in the collection was staged at the Finnish Institute of Contemporary Arts, and a revision exhibition was organized. The collection also comprises works by Vari Lehtonen (1925–1933), Tukku Martikainen (1932–1959), and Janna Saari (1930–1953).\n\n\nThe Museum of Fine Arts (MFA) in New York has appointed Adam Jonas as its next director. Jonas previously served as director of the Allen Memorial", "The next Biennial should be held in the coming months.  “This is a challenging time for the contemporary art world,” said Matthias Gebre, the executive director of the Association of Arts Museums of the Russian Academy of Sciences. “We are at a critical juncture, at a turning point, and we don’t know what the next steps will be. We hope that the Sochi Biennial, and the next one in St. Petersburg, will stimulate us all to think of new and better ways to share art and ideas.”The organizers of the annual exhibition, which is organized by the V-Novosti news agency, have already identified twenty-five artists from the contemporary art world as being nominated for the accolade. The twenty-one recipients are: Aleksandr Bennuka, Anton Kern, Mikhail Gurenko, Alexandra Zakhary, Michael Kester, Natalia Vassilyeva, and Oleg Rezskov.The biennial will address the current global social and political situation in the midst of a worsening global pandemic, which was brought on by the coronavirus. The biennial will also consider the role of art and culture in fostering public and private partnerships between local authorities", "The next Biennial should focus on “Communication and the Body”\u0097a theme that has traditionally been associated with the library and the museum, but is often neglected in the West. The event should be organized in such a way that visitors can come back to the museum to continue their journey.  The Biennial of Contemporary Art (BCA) is a multidisciplinary initiative of the BCA, the British Council, the Tate, and the Royal Shakespeare Company that has included exhibitions, residencies, books, and performances by artists and will continue to include artists.The Biennial of European Art (BGE) aims to bring together artists from the European Union and the United Kingdom, and will be held in London, the United States, and Italy. In the spring of 2021, it will focus on the theme: “European Art and Human Rights.” It will also hold its first exhibition in the United States in 2021 and is planning for a second show in 2021. The Biennial of the American South (B.A.A.) will examine the cultural and historical experiences of African Americans from the Southern United States and will open in Memphis, Tennessee, in 2022. The inaugural exhibition features works by forty African American artists", "The next Biennial should focus on “African art history and the United States” as a series of exhibitions that would delve into the concepts of history, history as a history of art, and history as an art historian. Instead of a single exhibition, the brains of the prize jury will work together to create a series of exhibitions that address the themes of the year and each other.“The first shows the work of the amazingly prolific and influential Ali Sina,” said Jerome Bruni, the artistic director of the New York Museum of Modern Art. “This exhibition is a celebration of the work of such a talented and dedicated curator, of his life and work, and of his enormous passion for his subjects.”The second exhibition, titled “The Passing of the Art,” will be a retrospective of the artist’s exhibition at the Venice Biennale in 2021 and will be on view in the spring of 2022. The third exhibition, titled “Outsider Cinema,” will be on view in the summer of 2022 and will be staged at the Eye of the Tiger in London in the spring of 2021.\n\n\nFollowing a groundbreaking exhibition at the Space Museum in Washington, DC, on August 21 that addressed", "The next Biennial should take place at the Government Museum of Art in London, the Wolseley Museum in Oxford, and the London Science Center. The 2020 edition will launch on April 19 and will run through May 8, 2020. Presented by the Government Museum of Art and the London-based art collective SATOKO. The 2020 biennial will feature over forty works on glass, including a new work by artist Christopher Wool, “The Glitch in Time” (2019); a new work by artist Frances Britton, “The Sea in My Eyes” (2019); and an exploration of the nature of light and the way light affects our relationships with the world around us. The sixteenth edition of the Biennial will take place in the capital’s Hyde Park from April 24 to April 27, 2020. The festival will also host a special exhibition of work by Spencer North, a British-born, American-based artist and curator, on May 14, 2020. North will present his first solo exhibition at Tate Britain, in London, at the invitation of the British Foundation, in partnership with the Chinese artist Wang Wei. The event will also mark the opening of the S", "The next Biennial should be held in the autumn of 2020, after which a new programme of exhibitions will be presented. The current exhibition “The Blue,” which opened at the Biennial in September 2019, is on view until December 21. Museum director René Magritte said: “The programme of exhibitions that we are creating now will satisfy the needs of the professional collector for many years to come. The future of the Biennial and of the Museum, I believe, lies in the hands of the collectors who have a vision of what is new and exciting in art.”\n\n\nArt Basel Hong Kong has announced that it is launching a new online marketplace where galleries, collectors, and dealers can exchange artworks for one-time payment of $1,500. Launched in partnership with the Hong Kong Art Museum (HKMo), the platform allows buyers and sellers to exchange artworks by artists and has yet to list an exchange rate. The platform, which will initially focus on Hong Kong galleries, has also not listed an exchange rate yet.全业多路, a platform that is run by the Hong Kong branch of the Art Museum Hong Kong, has added four new artists to its digital database", "The next Biennial should be held in 2020. Featuring a new selection of artists, the exhibition will also celebrate its centenary. The exhibitors include Okwui Enwezor, Martine Syms, Brian Simpson, and Camille Blatrix.\n\n\nA new exhibition organized by the New York Museum of Modern Art (NYMoMA) will stage a retrospective of work by Minimalism’s Max Beckmann, Alessandro Cipolletta, and Mario Tamaões. The show, titled “Max Beckmann: A Tribute,” will open in the museum’s new building on East Seventy-Third Street in April 2020. In honor of the artist’s eighty-sixth birthday, the museum will stage a reopening ceremony at 7 PM on April 3 as part of its April Fools’s Day celebration. The show will be followed by a public reception at 7 PM on April 3, and a “Max Beckmann: A Tribute,” performance by artists Béla Fleck, Martine Syms, and Christian Duyguen, and will run through May 1, 2020.“This is a decision made in memory of", "The next Biennial should also take place in the spring of 2022.  The theme of the exhibition is “Life After Death.” The exhibition will also include work by artists who are currently in the process of re-creating their own futures. The first exhibition, “Identity, Politics, and Death: Ritual, New Arts, and Ritual: Art and Politics in the 20th Century” (2019), was organized by the Museum of the Jewish People in Jerusalem, and featured work by artists such as Gershon Arkady-Kasper and Yvonne Rainer.The full list of participating artists is as follows:Adam GoughGuest Artist Guest Artist Guest ArtistGuest Artist Guest Artist Guest ArtistGuest ArtistGuest ArtistGuest ArtistGuest ArtistGuest Artist Guest Artist with Collaborator/Creative Director/Associate Director/Co-OperatorGuest Artist Guest ArtistWith Collaborator/Creative Director/Associate DirectorThemes of Life After Death: Ritual, New Arts, and Ritual: Art and Politics in the 20th Century (2019)Art Institute of DublinMaureen O'HaraArt Institute of ArtTeresa O'HaraArt Institute of ArtTeresa O'HaraArt Institute of Art", "The next Biennial should focus on contemporary art and the body, the life and death of art, and the relationship between the artist and the medium.”The successful finalists will each receive ten thousand dollars. The next iterations of the exhibition will open in March 2020.The finalists will be selected by a jury comprising art historian and curator Elissa Antelos; curator Krista Feigenbruch; artist Rachael L. Avery; and artist Kasper Kalsenbach. The jury will consist of artist Mungo Barnwell; curator Eva Hossen; art historian, historian, and critic Anita D. Walker Smith; biennial director Lina Yelland; and artist Zoya Galian.\n\n\nThe New York City Department of Financial and Workers' Compensation (NYC WIC) announced today that it has created thirty-one new positions within the agency, which provides food, shelter, and medical aid to thousands of low-wage workers through its New York City Food Bank, the City New York Kitchen, and other programs.Among those who will soon be working within the department are recreational landscaper, pool cleaner, and hot tub user; artist-in-residence; and a technician who helps oversee the", "The next Biennial should take place in 2020. The list of participating artists is as follows:Arts CouncilLabyrinthLoudon-GirardPapel MacGirardInstitute for Theoretical and Computational PhysicsArtistic 3DArtistic 3D: Post-Post-ModernArtistic 4DArtistic 5DArtistic 7DArtistic 8DArtistic 9DArtistic 100: The Art of Max Beckmann (1925–2002)Artistic 100: The Art of Max Beckmann (2008–2009)Artistic 1: Post-Cavity Artistic 2: The Art of Max Beckmann (1963–1985)Artistic 2: Post-Cavity Artistic 3: Avant-Garde Artistic 3: BauhausArtistic 4: The Art of Max Beckmann (1902–1974)Artistic 4: The Art of Max Beckmann (1927–1968)Artistic 5: “Sincerity\n\n” (2007–2009)Artistic 6: “The Existence of Art” (1988–2010)Artistic 7: “Ishikawa Miki’s Constructivist Art” (1999–2001)Art", "The next Biennial should examine the role of art in fostering social change and politics worldwide and should include a discussion of the origins and evolution of the museum-as-system.​\n\n\nThe artist-run space the Museum of Contemporary Art (MoCA) in New York has become the latest cultural institution to seek the official approval of the state of Hawaii for a new monument dedicated to the island’s military forces. The fourteenth iteration of the Memorial Day War Memorial, which is slated to open in 2020, has called for a “more visible, cultural, and political response to the lessons of World War II.”The debate over the placement of statues and commemorative plinths in public spaces has been ongoing for years. The National Museum of Women in the Arts in Washington, DC, voted to take down a statue of General Douglas MacArthur in 2017 over his refusal to acknowledge the United States’ victory over Japan in World War II and declared last October that it would not return the biennial’s $150,000 prize given to MacArthur for his lifetime achievement. The United Kingdom, France, Italy, and Turkey have all spoken out in defense of the monarchy.\n\n\nOne hundred years after the historic United States–Japan Summit, which", "The next Biennial should have a new set of new ideas and a new mission, and is working on how it will move forward from here. I am confident that with the changes and ways in which we live, the Biennial will come back to the witness of the people and will be experienced again, and again, and again.”Prior to joining the Prada group and its parent company, Birkenstock, in 2000, Klein served as director of the New York–based firm KPMG from 2004 to 2009, when she was working as the director of the Museum of Modern Art in the Bronx. Klein’s work has been exhibited at the Venice Architecture Biennale in 2006, the New Museum in New York in 2007, and the Museum of Modern Art in Chicago in 2012. She was nominated for a Pulitzer for her book The Art of Making Buildings, and for her photographs One Hundred Years of Photography, 1972–1985.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Laura Mulvey as its next director. Mulvey arrives at the institution from the Museum of Modern Art in Los Angeles, where she has served as deputy director since 2010. She succeeds Tom Schwartzman, who was hired", "The next Biennial should be held in 2021. “The future of the Biennial is for us to decide,” a statement from the organizers said. “On the occasion of the biennial, we ask that you if possible, delay the opening of the exhibition until at least December. The exhibition will now be ready for you on the second day of March 2022. We hope that this will continue to be the case. We will see you in March.\n\n\nThe Museum of Fine Arts (MFA) in Boston has named Alexandra C. Ferris as its next executive director. Ferris succeeds Miriam Morton, who retired in March 2019, and will take up the post on April 3.“We’re extremely proud to welcome Alexandra to the MFA,” said Sharon Hunt, director of the museum. “We’re thrilled to have her in our family, and we’re especially proud to have her as the first woman to lead the museum. The fact that she’s coming from outside the region, and to a city that’s run by a woman, to the region, and to a city that’s run by a woman is a tremendous boost to our museum.�", "The next Biennial should take place in the new, redesigned museum, which will be inaugurated by a new collection of the artist’s work, “Eternal Place: ‘In Praise of Death,” which will feature works by twenty-five different artists. The seventh edition of the Bénédicte Savich’s Biennial of the Arts will take place in the basement of the current building at 19 Rue de Rivoli in Paris, in December 2020. The last iteration of the MOS and the São Paulo Bienal, which are currently on view in the Brazilian city of São Paulo, will return to the museum in February 2021.“This year’s Biennale of the Arts has set the stage for a new wave of exhibitions and projects, which we will develop further into the new year,” said Alfredo Pintura, the president of the Fondazione Prada. “I’m very excited to be working with the art of the future. This is the year to create new ways of interacting with art, to re-create the connection between viewer and artist.”\n\n\nArt historian and curator Mark Jenkins has been appointed as the next", "The next Biennial should take up the theme “Gina Steinem: The Lady and The Art,” which Steinem created in 1971 and which explores the relationships between women and art. The exhibition will also include a virtual reality installation and an oral history with Steinem.The prize jury also selected Shawty as the winner of the Andrew W. Mellon Award, which is given annually to an artist. Specialist artists that will receive the award include -Dorothea Rockburne and LaToya Walter, James Swallow, Eric Fischl, and Michael Ondaatje. The other finalists were Linda Evans and Silvia Sosa. The Clement Greenberg Award is for the art of the Twenty-Second Century, a new exhibition organized by the American Institute of Graphic Arts (AIGA). Steinem, a former MacArthur Fellow, will receive $150,000. The five finalists are BENJAMIN LAMONT, Timur Lutwidge Duttu and Daryll J. Thompson, TONY MALAHIDE, Jenny O’Leary, and Justin Thomas Bell.\n\n\nThe Museum of Fine Arts (MoFA", "The next Biennial should launch in the spring of 2021 and will take place at the Museum of Modern Art. In the past, the organizers have said that they wanted to begin the event in March. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of works by the late artist Susanne Varejost, who was a staple in the city’s art-world community. The guidelines were drafted in response to the ongoing exhibition “Suellen: A Nude on the Loose,” which ran from May 3 to May 5, 2019. The exhibition was canceled after a protest by fellow artists, many of whom were affiliated with the artist’s studio, from the artist’s home state of New York. The move prevented the show from taking place. The DCLA’s consultation with the artist’s heirs resulted in the release of the guidelines, which outline how the personal belongings of a deceased artist should be displayed in a “reasonable and dignified manner.”Among the guidelines that have drawn opposition are displaying the artist’s work in a “compact” state, perhaps by cutting it away from the body, or", "The next Biennial should be held in 2021, according to the organizers. \n\nThe 2019 edition of the annual Art Paris fair, which took place at the city’s Musée d’Art Moderne in Paris last week, featured work by seventy-five artists. Among the thirty-five invited to participate were Thierry Riester, Zoya, Anton Kern, Paul Gauguin, Pierre-Auguste Renoir, Claude Monet, and Alex Katz. They are among the artists whose works are slated to be included in the 2020 edition. Among the sixty-five artists whose works will be included in the 2021 edition are Anselm Kiefer, Henrique Medeiros, Victoria Miro, Ariana Pappalardo, Jerome van Inwagen, Marcel Proust, Ursula von Rydingsvard, Wolfgang von Neumann, and Susan Sontag.The work of the seventy-five artists selected for the fair is displayed in the exhibition “Art Paris: Thirty-Five Years of Miraculous Selection.” The biennial’s website says that it will take up “art as a symbol of humanity” and will explore the themes of art through", "The next Biennial should take place in 2020.\n\n\nThe Supreme Court ruled today in favor of the B.C. Conservation and Forestry Commission (BCFC) in a landmark environmental lawsuit over the province’s plan to clear and burn more than a million square miles of forest in the province’s interior in an effort to curb the spread of the coronavirus. The decision means that the forests and wildlife of British Columbia will remain cut down and endangered until at least 2066, at the earliest.“Just as BCFC sought to address the forest and wildlife crisis by reducing the area burned and the area that could be burned, so it is now attempting to address the forest and wildlife crisis by cutting and burning the forests and wildlife that is already there,” said Justice Mary Oudekeum. The case involves four national forests in British Columbia; the boreal forest in Tsawwassen, north of Vancouver; the redwood forest in the Columbia River Valley, in the interior; and the boreal and redwood forests of British Columbia’s interior, which collectively comprise around one-third of the province’s total forest area.The forest commission, which is overseen by Justice Oudekeum, ruled that the", "The next Biennial should explore how the lives and experiences of Indigenous peoples have shaped the history of the city and its landscape, and should consider the possibilities presented by the ongoing process of colonial occupation. For now, the show will focus on the role of art in the city’s history.\n\n\nIn an attempt to end the coronavirus in the United States, the Centers for Disease Control and Prevention (CDC) announced on Monday that it will begin allowing visitors to twenty of the fifty states to return home by November 21. Although the move is expected to remain in place through the end of the week, the CDC expects the number of cases to spike once health officials in the states begin to see an increase in cases.The move has been made in cooperation with state and local governments, which are working together to contain the virus. Since the virus is spread mainly from person to person and is spread by close contact, the CDC says it is urging people to disinfect their homes and to wash their hands with soap and water for at least twenty seconds after blowing your nose, coughing, or sneezing. If you aren’t able to do this immediately, then you can avoid being exposed to the virus if you are going somewhere where there are few cases, such", "The next Biennial should take place in 2020 and will be hosted by the museum. Our 2018 event, “The Body,” brought together sixty artists, including Amada Cruz, Hamza Galloway, and Ulla and Romel, to present work on a series of films by the American filmmaker Martin Scorsese. The festival, which is supported by the James W. and Mary Kaye Foundation, is receiving support from the Richard and Mary Kaye for the second year in a row.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $35,000 donation from the Italian designer Stefano Cattelan. The donation, which comes in addition to the $50,000 in Italian gifts previously granted to the museum, is part of a larger initiative that will culminate in the institution receiving a total of $51,000 from the brand new $305,000 Cinema Design Center.The gift was made on behalf of the Cattelan and their families by the Italian luxury goods company Calistro Elettronica, which also comprised companies that include LaStampa, Bicocca, and Louis Vuitton. The fund will allow LACMA to complete a $", "The next Biennial should focus on the development of new ways of living together and will participate the following biennials: 2015, '96, and 2018. This year’s event will be held in the city of Zurich from January 13–January 16. The first edition of the biennial, “2016, ‘was organized as a project of the Tsukuba-based artist group Hiroshima Biennial,” Leonid Ghebaly, director of the Tsukuba Museum of Art, told Artnet.  The exhibition will be hosted by the Swiss Federal Office of Culture and the Swiss Federal Council, with participation from the German Federal Office of Culture and the Federal Office for Culture in Berlin, the Italian Ministry of Culture, the Italian Ministry of Education, the National Union of Journalists in Switzerland, and the International Committee of Museums. The Vienna Biennial will take place from February 17–February 21. \n\n\nThe Museums Association (MA), a United Kingdom–based regional organization representing more than 1,500 UK-based museums, is asking the government to establish an emergency fund for cultural institutions in the event of a future Brexit. According to the Guardian, the group is urging the UK", "The next Biennial should be in 2020.” The Smithsonian’s Board of Visitors will discuss the subject of the museum’s new building, called the Center for British Art, at a meeting on September 7.\n\n\nThe Aga Khan Museum in London has released the list of twenty-three artists nominated for the 2019 biannual Asia Pacific Picture-Art Award. The thirty-six artists selected for the biennial were chosen by a jury comprising Linda Alexander, a visiting research scholar at the University of the Arts, and Naveen Desai, director of the Institute of Visual Arts at the University of London; as well as Joëlle Prouvé, director of the City of London Museum of Art; and Ondine Agnew, director of the Tate Britain. The 2019 prize jury announced the artists selected for the award, which was established in 1983 by the Aga Khan and the Sultan of Brunei, Sheikh Zayed bin Saʿaan, and was made in memory of Namita Malik, the artist and philanthropist whose work commemorates the memory of her mother, Sadek Malik, a well-known supporter of British arts. The 2019 award cycle also", "The next Biennial should be held at the University of Amsterdam in 2021, the first being a biennial at the Museum of Modern Art (MoMA), in New York, in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Hannah Vassallo as its new director. Vassallo comes to the institution from the Museum of Fine Arts in Boston, where she has served as assistant director since 2013. She succeeds David F. Selby, who retired in January 2019 after a decade at the helm of the Museum of Modern Art (MoMA).“Hannah has been instrumental in transforming the Museum of Modern Art from a museum built in the mid-1980s into one that is a global leader in design and art,” said museum director Tom James, who was appointed board president by Selby in 2017 and had served as director since 1997. The museum also embarked on a $250 million redesign, which added a new floor plan, improved security, and improved accessibility. The project, which brought the museum’s current building, the Selby Center for Design, to a new, larger, and, in 2018, became the centerpiece of MoMA’s centennial celebration. Vassallo’s", "The next Biennial should be held in December 2019. Hall’s support of the museum has been largely responsible for the museum’s ongoing, nearly four-decade-long expansion, which added new galleries and programs in order to meet the demands of a rapidly expanding museum. Biennial attendees will be able to participate in a series of live performances, lectures, and other events across the museum, as well as in the public plaza, the Ricoh Arena, and the Metropolitan Opera House.“We are thrilled to partner with Dean and the Diocese of New York to create a new experience for visitors to the Metropolitan Museum of Art,” said Joseph D. Shiner, chairman of Metromuseum Associates, the non-profit gallery founded by Dean and Donna in 1998. “This shows the true breadth of our partnership and dedication to Dean’s mission. We are certain that the Museum will be much more welcoming and engaging to visitors once more members of the Diocese are included.”\n\n\nThe Museum of Fine Arts (MFA) in Boston, which has long faced a possible closure due to its worsening respiratory illness, has entered its sixth year of operation. It announced on March 15 that it will remain closed until at", "The next Biennial should be held in the spring of 2021, and should be entitled “This Is Not a Serial Event.” The show will be centered around the series of events that led to the outbreak of the disease, known as SARS, and will also include a retrospective of the work of the artist and curator Zita Haroon.Commenting on the forthcoming exhibition, Lorena Mazzei, director of the Biennial, said: “In the midst of a global pandemic, we are excited to return to our roots, to our roots as artists, to our roots as curators, and to our roots as organizers. We are grateful for all of the artists and organizers who have contributed to the success of this exhibition.”\n\n\nThe Flemish government approved a plan on Tuesday that will see the dismantling of the country’s military and civilian governments. However, the news comes amidst political uncertainty and uncertainty in Brussels, as the leaders of France and Germany try to come to an agreement on the terms of a temporary financial aid package that will lift austerity measures enacted to try to mitigate the crisis and bring the country out of its debt spiral.According to the New York Times, the proposed legislation will remove the military", "The next Biennial should have been the last, but the trustees of the Architectural Association, who had been pushing for a new exhibition, decided to push ahead and had already commissioned the art of the forthcoming thirty-fifth edition. “This is a critical time for all the participating artists and the museum,” said Peter Higgs, president of the Association and a professor at the University of the Arts London. “They have a responsibility to take a long-term view and plan for the future in consultation with the artists. This is a moment of great uncertainty for the gallery industry, and the artworld in general. We must work together to ensure that the next edition of the Art of Man is a clear and compelling vision of contemporary art and architecture.”In a statement, the exhibition said the decision to hold the event was made based on the “ultimate objective of having a good show and having a good time.”\n\n\nThe MoMA in New York has revealed that it will introduce new programming in the coming months following the reopening of the Uffizi, the country’s largest and most renowned contemporary art museum. Titled “Frumentari: Italy” (Runway to Italy), the exhibition will", "The next Biennial should be held in 2022, and will bring together around sixty artists from twenty-six countries.  Advertisement\n\nRetired chemist Virginia Hadley, who championed science over aesthetics, has died at age eighty-three. Her long-standing advocacy for organic chemistry and chemistry-based art has been documented in numerous works, including her artworks The Witch and the Tree (1993), which was exhibited at the 1992 Biennial of American Artists at the Museum of Fine Arts in Boston, and The Eliminators: A Retrospective (2007), a series of photographs by Virginia Hadley.Born in New York City in 1932, Hadley is the daughter of a chemist and a homemaker. She studied at the School of the Art Institute of Chicago between 1957 and 1958 and the School of the Art in London between 1958 and 1961, where she met her husband, the artist Richard Hadley. She began her career as an experimental artist in the 1960s, but moved to Los Angeles in the early 1970s to pursue a career as an artist. In 2012, the year she died, she was awarded the National Medal of Arts.Born in Chicago in 1937, Hadley grew up in Southern California, and graduated from the University of California,", "The next Biennial should showcase work by contemporary artists, including Sala Salah, Hoor Al-Khalili, and Mehmet Altind, as well as pioneering contemporary Moroccan artists. In addition, the exhibition would mark the first time the exhibition would feature work by an indigenous, non-European artist from the Arabian Peninsula.The twenty-third edition of the exhibition will open in April 2019.\n\n\nThe Metropolitan Museum of Art in New York, which has been closed since October because of the Covid-19 pandemic, has appointed Laura Pippa as its next director. She succeeds Deborah Caldwell, who took over from Caldwell in February 2019.“We are thrilled that Laura has agreed to join the Met,” said Alan Gruschel, the museum’s senior director of external affairs. “She is an appointed leader with proven track records and a proven track record of transforming the Met from a museum that is a dynamic, open, and welcoming gathering place into one that is a robust model for public engagement and innovation.”Pippa comes to the Met from the Museum of the City of New York, where she was the executive director of the New York City Cultural Council. She previously served as the inaugural director of the", "The next Biennial should be held at the locations in 2021. The upcoming exhibition, “Cultural Capitalism” (2019), will be relocated to the Museum of Modern Art in New York. The show will remain open until September 11. \n\n\nThe Metropolitan Museum of Art in New York announced today that it is planning to hold a new exhibition titled “New Art in the Age of Trump,” on the museum’s campus from September 9 to September 14. The exhibition will feature new works by twenty-one artists and will showcase work by artists whose work has been digitally altered or fabricated to appear in photographs or paintings.“The exhibition provides an unprecedented opportunity to hear and see firsthand the work of these artists and to see their work in their media and in their mediums,” said Michael Govan, director of the Museum. The exhibition will also feature an original selection of paintings by thirty-six artists and will include new works by artists whose work has not yet been publicly exhibited.Acquired by Andrew Kreps, the director of the Museum, the five-hour “Mass Effect” event will take place at the venue’s new home on West Twenty-Fourth Street in the Museum of Modern Art", "The next Biennial should be held in Beijing in 2022, and by 2022, the competition should be over. The next will be marked with a new exhibition of works by the artist Alberto Burri. In May 2020, the exhibition will return to the city of Luao, where the artist, an Italian citizen born in Argentina, is based. This will mark the artist’s return to Italy, where he resides in Punta del Este, in the province of Bergamo. Taubat Ma, the founder and director of the Dhaka Art Summit, has also announced that the event, which will run from January 22 to January 24, 2020, will be held in New Delhi, India, where the artist will perform his special exhibition,  The Actor Effect, in conjunction with Atiyeh Saro-Wiwa, at the Javadu Gallery in New Delhi, India from January 28 to January 31, 2020.“We are absolutely delighted to be able to present such a stunning exhibition at such a crucial moment in its artist’s and curator’s lives,” said Dhaka Art Summit founder and Dhaka-based artist Salahuddin Satheesh.\n\n\nThe", "The next Biennial should open in the fall of 2020.  An exhibition of works by the artist in the capital, Beijing, is currently on display at the Beijing Gallery of Modern Art (BGMA), and a performance in the provincial city of Xian will take place in the capital in the first exhibition of its kind in China.The first show at the new venue will feature two new works by the artist, a portrait by the artist in the city of Xian and a large-scale installation by the artist in Haneda, which is located on the west coast of Japan.The other new works will take up the themes of the biennial, which began with the invitation from the Biennale di Tellez in April 2020 and culminates with the annual exhibition of the artist’s work in the city of Xian. In both cases, the work is being exhibited in conjunction with exhibitions already held at the venue.The event will invite a different mix of artists to the city and will be inaugurated by a special exhibition of work made by the artist in his studio. “This is an exceptional year to be alive,” Dong Moo-kye, chair of the board of trustees of the Biennale, said. �", "The next Biennial should take place in the spring of 2021. The first exhibition, “A History of the Body,” will open in the spring of 2020 and run until the end of the year. The second Biennial, “A Spectator at First Light,” will debut in the spring of 2021 and run until the end of the year. The 2019 edition of the event, “A History of Modern Art,” was staged in the former Aptos warehouse in the City of Los Angeles; the 2019 exhibition, “The Body and the Art,” was in the Pacific Standard Time museum in New York; and the 2018 edition of the event, “The Body and Art,” was in the Museum of Modern Art in New York.The 2019 edition of the event, “A History of Modern Art,” will be on view June 18–June 21 in the Los Angeles County Museum of Art.\n\n\nLázaro Cattelan, a graduate of the Academy of Fine Arts (Alasba) in Paris, has won an award from the Palazzo Stampa in Venice. The 2019 edition of the Palazzo Stampa, which was jointly organized by the", "The next Biennial should be in 2022. The theme of the 2020 event will be “art and its history,” and the next edition will be held at the University of Rochester.\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of 150 works by artist Douglas Coupland as part of the institution’s previous commitment to the late American painter Robert Irwin. The gift includes works by forty-nine artists, including Huey Hernández, Deborah Guggenheim, Paul Gauguin, and Robert Irwin, as well as three works by contemporary artists such as Cortéya, Paul Mpagi Sepuya, and David Salle.The museum is also releasing a new digital collection of works by the late Colombian painter Gábor Roca. Titled “Luchita and the Sun,” the exhibition will run at the gallery until November 29, 2020. This newly created collection also features work by artists whose work was previously displayed in the gallery’s previous online exhibition, “Cold Equations,” which opened in 2016.The new digital collection is part of an ongoing effort by the museum to present the work of more than 1,500 artists in", "The next Biennial should begin in the spring of 2020 and will feature a selection of works by forty-five artists. According to the New York Times, the exhibition will premiere at the Art Institute of Chicago, which was founded in 1929 and rebranded in 1993 as the Metropolitan Museum of Art, in the fall of 2019. A Rafflecopter giveaway will also take place on February 16. A similar event was held at the Detroit Institute of Arts (DIA), which was established in 1964 and rebranded in 2013 as the Wayne State University Art Museum in Detroit. The artists chosen for the exhibition were selected from a pool of sixty applicants. The seventy-four-year-old museum director, Thomas Campbell, announced that the new venue, Biennial XL, will be a “family environment.” The exhibition will feature work by forty-eight artists in various stages of their careers, including Johns Hopkins University, the Museum of Modern Art, the Museum of Modern Art, the Pushkin Museum of Art, the Musée d’Art Contemporain, the Academy of Arts Prague, the Museum of Modern Art, the National Museum of Art (MoMA), and the Museum of Modern Art.The museum explained that the", "The next Biennial should be held in the city in 2021. The decision was made after a meeting between the city and the artist-run foundation, which said the project was “an excellent first step in the right direction,” but that it had not yet determined the format of the next edition. “At this stage, we’re not sure what the future holds,” Gabrielle Laverrière, the director of the Biennial Foundation, told the Art Newspaper. “It’s a question of when, not if, that the Biennial Foundation will decide to renew its membership. . . . We’re afraid that this will be the last time.”\n\n\nSara Cwynar, a British curator who ran the London-based nonprofit East London Art Exchange (ELEX), has been named the new chair of the board of trustees of the Tate. She succeeds architect-turned-activist Haroon Mirza, who announced last month that he was quitting the organization amid controversy over his connections to the Middle East following the Paris bombings, and will be succeeded by a new director, who will be chosen by the board.“Cynthia brings to the board a wealth of knowledge", "The next Biennial should take place at the Château d'Arles, France, in 2022, and will include some twenty artists representing twenty-six countries. The event will also debut a new platform where visitors can receive two tickets to the museum directly from the artist(s). The five-day event will be housed in the museum in a building designed by the designer Ana Crespo.The 2018 edition of the biennial, titled Away from the World, was held at the Museum of Fine Arts Hong Kong (MFJ), with the show featuring seventy-five artists from twenty-six countries. The exhibition was curated by Kunjai Krishnamurthy, director of the contemporary art museum Art Basel Hong Kong, and premiered at the end of May. \n\n\nVIVO Art Museum is the latest major arts institution to announce that it will shut down its diadem and shutter its exhibition spaces to avoid disrupting the 2020 Rio+20 Olympic and Paralympic Games. The museum has been closed since March 13, when it was forced to cancel a major exhibition due to a widespread coronavirus outbreak in China. “On the occasion of the opening of ‘Around the World in Four Weeks’ and �", "The next Biennial should be held in 2022.\n\n\nThe Swedish Museum of Fine Arts (Skartborgska Academy), which has drawn criticism for its reluctance to expand its holdings by major international artists, has announced that it is preparing to reopen its doors on August 21. The announcement follows the news that the institution will welcome visitors again in September.While the Museum of Modern Art (MoMA), which is currently closed until at least September 15, has said that it is only preparing to open again when the weather permits, the institution has faced numerous backlash for its August 18 announcement that it would reopen with a bang. Following several days of protests by museumgoers and politicians, the museum board voted to postpone the reopening of the institution for a minimum of three weeks. The postponement, which was announced on August 18, was made despite the fact that the museum will be closed until October 1.“The board is aware that the summer is an extremely busy time of year for museums, and that many of our artists are currently on the road,” Amy Trotman, the board’s chair, told the Art Newspaper. “But we believe that together we can make a difference.”\n\n\nThe Royal Academy of Arts (RA", "The next Biennial should be held in 2021. \n\n\nThe Tampines Museum of Art in Florida is planning to shutter its permanent collection of 1,600 works by José Cabó, a Brazilian artist who often used his body and his work to highlight racial and political inequities, a move that will undoubtedly impact the institution’s collection and programming as it tries to understand what happened after the famous 1967 publication of his book ¡Nu Juso,” a collection of essays that was meant to be read by a white, middle-class audience.Cabó was killed by the police officer who killed him in front of his home on March 8, seven days after the book was published. The police claim that the killing was in self-defense, but the autopsy revealed that he did not shoot at the officers but rather at a book, a collection of drawings he had placed in their patrol car, which was parked nearby.“The museum has delayed the exhibition by a year, but we remain optimistic,” said museum director Billy Raynsford. “The show will reopen in the spring of 2022. I can’t imagine an exhibition that opens this soon after the death of an African American at the hands of the", "The next Biennial should be held in 2021.According to the New York Times, the forthcoming exhibition will be the first dedicated to the life and work of Alexander Calder, a painter best known for his monumental paintings that are both dense and packed with political and social commentary\u0097Calder was a leading member of the Communist Party, and many of his works were displayed in the country’s National Museum of Art. The exhibition will also feature an exclusive selection of Calder’s artworks from the collection, which was inaugurated by the artist in 1974.Commenting on the upcoming exhibition, Marc Glimcher, the curator of the exhibition, told the New York Times that “it’s a question of when; of what kind of an exhibition to have? And if we are going to have the government and the museum engage in the collection and the exhibition, what kind of collection to have.”\n\n\nHere at the Duchy of Lancaster, we are committed to supporting galleries and artists. As part of our ongoing work to reshape the relationship between arts and the state, we have increased the amount of funding available to cultural organisations through the Duchy of Lancaster’s Annual Grant Fund and the Oxford", "The next Biennial should be in September 2020. \n\n\nThe Bristol Museum of Art (BMA) in England has launched a new digital platform, BMA Online, to help audiences understand and engage with the museum’s collection. The database will include multimedia content and will provide visitors with an overview of the biennial’s exhibitions and events, as well as a search function that will include the biennial’s newest works.“We wanted to build a platform that would be accessible to everyone, especially those who were not using technology to try to understand the biennial,” said David Levenson, director and CEO of the BMA. “This is an opportunity to build a deeper understanding of the museum’s art. We hope that by using this platform visitors will find what they are looking for and will feel empowered to ask questions and explore the biennial.”The platform will connect visitors with the latest biennial news and will include a number of resources, including an interactive guide to the biennial’s opening, a biennial curation guide, a video previewing a particular exhibition, and a full text of the biennial’s first lecture. Visitors will also be able to order", "The next Biennial should be held sometime in 2021, with a new exhibition added every two years. The new show will include works on a wide variety of topics, including the Human Body, Environment and the Environment, and the Biennal. \n\n\nThe São Paulo Biennale, Brazil, has announced the opening of a new digital platform, Themes3, in partnership with the South American branch of the New York–based organization Foundation for Contemporary Art (NYCA), to support Brazilian artists. The platform will include a platform for artists to share ideas and will provide a platform for global dialogue. The new initiative, launched in collaboration with the São Paulo International Film Festival (SPIF), and curated by Sérgio Sérgio da Conceição, will commemorate the 50th anniversary of the organization.“Themes3 is a platform for the visual arts in creative collaboration with a new international initiative, the São Paulo International Film Festival,” said Sérgio da Conceição. “Themes3 is a design for a new future, not only for artists but for the digital ecosystem as a whole. Artists are the new point of departure for the global community, and we plan to build on the work", "The next Biennial should be held in 2021.\n\n\nMike Smith has announced that he is planning to resign as director of the Museum of Modern Art (MoMA) and return to the United Kingdom to take up the post of chief executive of the Royal Medieval Society (RMS). Smith will assume the role of deputy director of communications at the end of the RMS’s seventy-fifth anniversary celebration in May, and will serve as the commissioning officer for the RMS’s next major exhibition, “The Costume of the Field: From Antiquity to the Present.” He will succeed Kate Fowle, who has led the museum since 2010 and will assume his responsibilities in July.In a statement, Smith said: “My leadership at MoMA and at the RMS has been inspiring and incredibly satisfying, and I’m eager to lead into the future. The Royal Medieval Society is, to say the least, an extraordinary institution that has contributed to shaping the Museum of Modern Art and the Museum of Modern Art in London. I’m excited to continue to lead the way for artistic and academic research and to collaborate with the RMS and with colleagues across the UK, the US, and internationally.”\n\n\n", "The next Biennial should be held in 2021.”The new biennial is also introducing a new series of exhibitions, which will take up contemporary themes and have a new location; and it will introduce a new exhibition format for the 2020 edition.\n\n\nThe Superior Art Foundation (SAF) in New York has appointed Jennifer Schroth as its new director. In her new role, which is expected to begin in June, Schroth will oversee the organization’s expansion into Southeast Asia, the Americas, and the Far East.In the new role, which will take up the role of director of the museum’s current exhibition space, the Contemporary, on the ground-floor of the former Warner Brothers building in Manhattan, Schroth will guide the new institution’s expansion to the upper floors of the former Sears building in Dearborn, Michigan, and the former Smith-Perry Building in Annandale-on-Hudson, New York.“This is a historic building. It has never been used as a backdrop for a retrospective before,” said Schroth, who previously served as an assistant curator at the Contemporary and as a curator at the Museum of Modern Art in New York. “I look forward to working with", "The next Biennial should be held in 2020, and the fifth and sixth will be held in 2021 and 2022. The show’s board of directors has also indicated that it will consider the possibility of a seventh edition in 2022, but has stated that the decision is not yet final. Commenting on the upcoming events, England’s permanent secretary, Maria Miller, said: “The current exhibition programme at the Biennial is working extremely well, and I am confident that with the right mix of programming, creative skills, and funding, we can continue to deliver the largest and most ambitious exhibition ever staged.”The exhibition will be hosted by the National Poetry Library in London and will be accompanied by a biennial of contemporary art, an exhibition of new work and new voices, and a special exhibition of work by artists from the East End. During the run of the exhibition, the National Poetry Library will commission new work by seventy-five artists, including Spalding, Evans, and Jones, and will host ten books from the collection in a significant exhibition.The board is also planning to open a new branch in Hong Kong in 2021, with a grand opening planned for 2021.\n\n\nThe Solomon R. Guggenheim Museum", "The next Biennial should be held in the city, which has a population of around three million, in 2023.The second should be held in the city in 2026. The third will be staged in the city in 2027. The fourth will be staged in the city in 2032. The fifth will be staged in the city in 2022. The sixth will be staged in the city in 2021.The seventh will be staged in the city in 2016. The eighth will be staged in the city in 2019. The ninth will be staged in the city in 2018. The tenth and final Biennial will be held in the city in 2022. The event will be hosted by the city from January 8 to January 12, 2020.\n\n\nIn what has become a familiar scene, the museum’s doors are locked and the museum’s highly anticipated 2020 edition, which opened on September 9, is still a month away. The critical question is whether the decision to cancel the event was made in good faith or not.While the museum issued a statement on Wednesday saying that it was “in no way” behind the decision and that it did not believe the move was made in a “politically motivated”", "The next Biennial should present the first multidisciplinary exhibition in the newly renovated museum in 2021.”\n\n\nOn Friday, the Howard University Women’s Center (HUD) in Washington, DC, announced that artist-in-residence Melissa Clayton has been appointed as its next president and CEO. The seventy-one-year-old, whose career spans thirty-six years, first gained national attention in the late 1990s with her installation of \"Everybody Masks: The Art of Painting by Sergei Gromov,\" 1979–1980, on the walls of the Whitney Museum of American Art. She continued her practice in the '00s with “The Grid, 2001, a series of drawings by Garry Kasparov that were shown in the 2009 Whitney Biennial. Clayton’s work has been exhibited at biennials and internationally, including the Venice Biennale (2007), the Venice Architecture Biennale (2008), and the Sydney International Biennale (2008).“Melissa’s work is an example of how percipient and innovative art can be as universal as water and yet express a universal language,” John Campbell, director and chief curator of the National Gallery of Art in Washington, DC, said", "The next Biennial should be held in 2022.\n\n\nRussian artist Alexei Nelyukhin has been appointed the winner of the 2019 Art Prize. The twenty-two-year-old, who was chosen by a jury comprising artists from seventeen countries, including Canada, Japan, Mexico, and the United Kingdom, in a special exhibition organized by the European Art Museum St. Petersburg, will be awarded $144,000. The prize was established in support of a group of contemporary artists that calls for a more progressive and international vision of art. The jurying panel comprised artist and curator Oli Mavozov, who is based in Moscow; art historian and critic Valentina Zhelezniews, who is based in Berlin; and Oleg Tumanov, a curator at the Winter Palace Museum in Saint Petersburg.The jury that selected the prize for the biennial “In the Shadow of the Eiffel Tower,” which will take place in October 2022, was led by Valentina Zhelezniews, whose work will be included in the 2020 and 2021 editions of the Art Prize. The jury also included Alexander Voloshin, the founder of the Institute of Contemporary Arts in Saint Petersburg; Oleg Tumanov,", "The next Biennial should take place in 2021 and will take place at the Birkbeck College of Art, University of London. The exhibition will feature 200 works by twenty-seven artists as well as a selection of contemporary art. The exhibition will also feature curated projects by artists such as Frank Gehry, Leslie Norvell, Ursula von Rydingsvard, and Joan Miró. The 2017 Biennial was hosted at the Royal Academy of Arts in London and was organized by the Academy of Arts. The 2017 event received an additional $8 million from the British Council and a donation from British billionaire Art Dalzell Ramsden, who is a cofounder of the London-based firm Dezeen Group. For the full list of exhibitors, visit the official website.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it has granted $202 million in aid to cultural and literary institutions in the city through its Treasury for Cultural Institutions (TFCI) program. The funds will go to help Arts and Cultures NYC (ACT), a program of cultural preservation, restoration, and reburial that began in 2017 as a way to foster the city’s cultural and creative life", "The next Biennial should focus on the relationship between the artist and the non-artistic world. “The biennial is not just an exhibition, but a new way to look at art and the world,” said Ming Wu, founding director of San Francisco’s Museum of Modern Art. “Combining the latest techniques and the knowledge of academics, the biennial will offer a unique perspective on how art can transform our lives and encourage us to reflect on our own lives.” The museum also revealed that it will invite artists to San Francisco for the first time since 1989, when it opened. \n\n\nThe Museum of London Art (MoMA) in New York announced today that it is planning to lay off twenty-five employees, including thirty-six staff members, on November 5. The announcement follows the two-week notice that the museum received from the Department for Digital, Culture, Media and Sport (DCMS) in an attempt to encourage its exhibition-viewing and ticket-buying operations.The staff cuts will reduce the museum’s workforce by two thirds by 2022, and will take place across six departments, including curatorial and development, and will be made across seven locations: the museum, the", "The next Biennial should be held in 2020.\n\n\nThe Museum of the Jewish People (MoJo) in New York has appointed Arne Glimcher curate of the seventh edition of the Moshav HaKollelani (Moshav HaKollei) biennial. Glimcher joins the museum from the Margate Museum in Wales, where he has served as director of exhibitions since 2014. During his tenure, he curated the first photo-montage exhibition, “Voyage of the Museums” (2017), and promoted the work of “Katherina Antony” (2016) and “Zoé Whitley” (2015).The biennial is based on the principles of “living together in diversity,” a concept that was first articulated by Hans Christian Andersen in the novel The Three Little Pigs, which he wrote and illustrated in 1915. “We are honored to introduce Arne Glimcher to the Moshav HaKollelani,” said Museum Director Bernadette McAllister. “This is a project that will challenge the boundaries of what it means to be a curatorial professional.", "The next Biennial should take place in the Barcelona suburbs, in April 2020. With the support of the Spanish Ministry of Culture, a group of curators and artists has already announced plans to stage a biennial in the Victorian town of Santa Teresa, Mexico City, in June 2020.The project to depict the city of the Aztecs in bronze has been in the works for more than ten years. In 2015, the city of Barcelona awarded the team the fifth edition of the Centro de Cultura Azul. The category was established in order to promote the city’s heritage and inspire thought and reflection on the history of the area. The second edition, which took place in Barcelona in 2017, was held in Mexico City.\n\n\nSagan and David Kordansky, the co-owners of the California company that owns and manages the Los Angeles County Museum of Art (LACMA), are launching a new art-world venture to help defray the mounting financial and operational costs of defending a lawsuit against the institution in an antitrust lawsuit brought by the US government. The venture, which will include a digital platform, called the DefendLACMA.info, will offer visitors an avenue to access and explore the institution’s holdings of works by", "The next Biennial should take place in Istanbul in 2021. The deadline for the Turkish pavilion was pushed back to December 2022, and a date for the show was also cut.\n\n\nThe Luppuccino, a series of sculptures made in Italy, has closed after a yearlong exhibition in Milan. The show, which opened on May 6, lasted through May 22, as many as two hundred artists and collectors converged on the Meccano region of northern Italy to view the work. The exhibition, which also featured works by Maco Celant, David Adjay, Susana de Câmara, and Adrian Piper, had broad appeal. Its subjects ranged from everyday objects and everyday life to the future and its impact on art.The exhibition was organized by Ludwig Lueg, the director of the Luppuccino, and Milan–based artist and director of visual arts Andrea Sciarra. Among the thirty-eight artists represented were a group of artists from Germany, Austria, France, Italy, the Netherlands, and Japan. The show opened at the Museo de Arte Contemporanea in Milan on March 3 and ran through May 16.Among the work’s notable mentions were the bronze sculpture of a dog", "The next Biennial should be held in 2021 and will be presented by the German city of Dortmund. Its inaugural Berlin Architecture Biennial was hosted by the German city of Stuttgart in 2024 and will be staged in the city in 2021. The biennial, which was first organized in 1960, is considered a seminal work in the study of architecture and its architecture as such. It was nominated for a Pulitzer Prize in 2017 for its architectural history and was selected to participate in the 2022 edition of the Venice Architecture Biennale.\n\n\nThe New York City Department of Cultural Affairs (DCLA), which oversees fifty boroughs and has been dealing with the aftermath of the coronavirus pandemic for more than a year, has unveiled new guidelines for museums that are facing financial losses as a result of the coronavirus pandemic.The guidelines, which were released on Tuesday, April 18, encourage institutions to reduce the number of visitors and charge museums for additional activities, such as the relocation of exhibitions and events, and propose capping the number of visitors at an institution. They also call for curators to work more collaboratively and with smaller groups.The document states that museums will be eligible for up to $50,000 in refunds if they meet certain additional", "The next Biennial should take place in the spring of 2021, and will include an exhibition of work by twenty-four artists, including Richard Avedon, Tammy Aratani, Shane Bobman, and Ludmila Cadevich. \n\n\nThe Institute of Contemporary Art (ICA) in Los Angeles has received a gift of more than a hundred paintings by artists such as Kate Suttner, Adrienne Kober, and Anne-Marie Lee. The $1.6 million donation, made by a group of donors led by Suttner and Celine Dion, was made in honor of the institute’s founder and chairman, Felix H. Schempp.The artist-in-residence, sculptor-photographer Lee, said: “The gift of these works is a tribute to this distinguished and important institution for providing an enduring work of art to the children of the city of Los Angeles.”While the works will be on display in the new exhibition “Away From the Sun,” which will run until October 9, the ICA will retain the collection of longtime curator and board president, Frank Gehry. Gehry, who passed away in 1954, donated the works in 2017. The institute", "The next Biennial should inaugurate the museum in September 2020. In addition to the installation of the exhibition, the museum will receive 125,000 square feet of land to create a new exhibition space and will become a center for the promotion of contemporary art.\n\n\nThe 2017 edition of the Venice Biennale, curated by Stefano Bicchieri, has released the list of participating artists who will be returning to the Venice Biennale in 2020. The sixty-five-person panel\u0097which comprises Lina Esposito, Sara Cwynar, and Oskar Gabrielli\u0097decided that the twenty-two-year-old American Pia Fritsch would be the next artist to portray a human body in a living work. Bicchieri, who established the Venice Biennale in 1991, recently announced that he will not be returning to the Venice Architecture Biennale, which will run from May to October 2021, and will instead create a new work for the city’s Palazzo Delle Papesse. The new exhibition “Baroque,” curated by Bicchieri, will be presented in October.“We are really excited about the", "The next Biennial should also include a retrospective of the artist’s work\u0097the first in the United States since 2008\u0097and an exhibition of the work of young contemporary artists. \n\n\nThe Beretbrick Museum in New York has appointed Laura Miller as its next chief curator. Miller joined the institution from New Jersey’s Montauk on January 27, 2019, and will begin her position in June.“Laura’s young and diverse practice inspires awe, delight, and fear\u0097all around the world, in a way that the art world has never done before, and she has been able to bring to light during the immediate and extended lifetimes of artists, curators, and artists themselves,” said museum director Daniel H. Weiss. Miller is also the author of the forthcoming book, Beretbrick: The Biennial of New York Art (W.W. Norton & Company, February 2020).“Laura’s skills and personality, combined with her world-class curatorial skills and curatorial vision, make her ideally suited for the role of chief curator,” Weiss said. “Her curatorial approach to curating has been to the detriment of a great many of the world", "The next Biennial should be held at St. Petersburg in August 2021, the Russian city’s capital. \n\n\nThe Schwartz Gallery in New York has announced that it is launching a new digital platform to help artists and cultural workers struggling due to the Covid-19 pandemic. The platform will be run by the artist advocacy organization We Are Artists, which was cofounded by George and Sam Schwartz and Adam D. Weinberg. The organization will host monthly online seminars and engage with community members in real time regarding how to reduce their exposure to Covid-19 to prevent the spread of the virus. The first event to take place on the platform is “How to Stop Being Infected,” a workshop that will run concurrently with the biennial and will focus on the three steps of the viral exposure process, starting when an individual is exposed to the virus and continuing into their lifetimes.The Schwartz team has created a tool to help the public stay connected to their artworks and other cultural institutions, including by providing them with a tool to enter a venue and receive notifications whenever a new workshop, exhibition, or performance is scheduled. The service will also include a number of educational resources, including a monthly newsletter that will address specific questions and will have", "The next Biennial should aim to achieve a balance between its artistic and educational goals, both by reflecting and reflecting the times.”Kooyman said: “The future of Tokyo muso is at the core of the upcoming exhibition. The unique and experimental nature of the exhibition and the invitation to create a new dialogue with other cities worldwide are inseparable. I am honored to be a founding partner in this project.”He added: “I am not looking for the museum to become a museum of the future. Instead, I am looking for to open a new era of creativity and culture. This exhibition will enable us to fully realize this vision.”\n\n\nGoldsmiths, Cambridge, has announced that it will acquire the art and design company Norman Foster & Partners (NFP) for an undisclosed sum. The partnership, which will take place in the United Kingdom, was established in 1997 after Goldsmiths acquired Foster + Partners, which represented Norman Foster & Partners in the United States. The acquisition of the international gallery opened up a new stream of work for Foster + Partners, which has represented the Hong Kong–born artist in the United States since 2009.The acquisition of Foster + Partners has been ongoing since 2010, when Goldsmiths purchased", "The next Biennial should be a change of pace, we believe, from the current exhibition-based model, and will be led by a team with a strong and detailed scientific knowledge of the art. “Our team is keen to design a new architecture for the Biennial which will allow us to interact with the history of art in an innovative way,” said Biennial director Elena Cossu in a statement. “The new architecture will introduce a new kind of history-making experience for visitors to the Biennial, in addition to an entirely new level of artistic and scientific research.”Meanwhile, the Museum of Modern Art (MoMA) in New York has taken a hit to its bottom line as it works to pay off the debt it incurred when it closed in 2013 amid the coronavirus epidemic. According to Artnet, the museum faces a $200 million shortfall as it attempts to make up for lost revenue from its exhibition space, which reopened in April 2019.The New York Times reports that MoMA is currently working on a series of loans to help it balance its books as it works through the fallout from the coronavirus pandemic. The first installment of the aid is expected to be given by the end of June. MoMA", "The next Biennial should also consider how the exhibition’s organization and collaboration with the local communities of the Biennial will affect the exhibition’s programming, including by providing an opportunity to perform and to participate in the exhibition’s programming for free. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has issued an apology to the city of Los Angeles over the forced relocation of the Art Institute of Chicago’s collection and exhibition space from its former home in the Central Library District (CLD) to an adjacent lot in the Hollywood Hills.The museum’s board of directors and staff members agreed this week that the building’s transformation into a new forty-two-acre complex for the museum was not the result of the institution’s own design, but was instead a result of a previous wave of forced evictions of historic homes in the area. The move resulted in the displacement of the Isobel and Edward James Olmos Stations, as well as of the Hirshhorn Museum of American Art, which is currently undergoing an expansion.“As we understand it, the Hirshhorn moved to the new lot in the early 2020s in anticipation of a new design for the building,”", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid. The theme of the forthcoming edition is “Por favor: Análisis por la Bandera” (1930–1943). Commenting on the upcoming show, Michael H. Nelson, president and CEO of the biennial said: “The themes for the thirty-second edition of the Artistic Experience are timeless, engaging, and relevant to the contemporary world. The 2018 exhibition was a huge success and we are excited to see what is next. We are committed to continuing to present the quality contemporary art of the Spanish-American War through an artist-centered approach, leveraging the unique and expanding collections of the Museo de Arte Contemporáneo in Madrid.”\n\n\nThe Brooklyn-based nonprofit Corporation for Public Arts (CPA) has received a $1 million donation from the Sargent and George Washington LLP foundation in support of its 2019 fiscal year endowment. Karen and Ira Sargent were honored to receive the gift of a century of supporting artists. CPA was founded in 1976 by the couple to provide grants to small- and mid-size cultural", "The next Biennial should be held in 2021.\n\n\nThe Philadelphia Museum of Art (PMA) is reopening to the public following a $100 million expansion project, which will include a new visitor experience designed to appeal to a broader range of audiences. The renovation, which is part of a yearlong project to reconfigure the museum, will also introduce new exhibitions, projects, and education programs.“We created this new experience, ‘The Trauma Center,’ to address the urgent needs of survivors of sexual violence, to provide a place where they can connect with trauma-informed experiences,” said Amanda Ross-Rivas, the museum’s interim director of arts. “All of this is an extension of our long-standing commitment to feminist and anti-racist organizing, which we believe informs and inspires the transformation of the trauma center.”The renovation is part of a larger cultural and legal strategy to refocus the trauma center’s programming and attention away from the institution’s historic buildings. Since last fall, the museum has been working to shift the focus of the center’s programming to the city. In March 2020, PMA will stage “Urban Liberators: The Surround Sound of", "The next Biennial should be held in 2021, but the government’s decision to suspend the construction of the memorial has left many political and cultural figures concerned. Australia’s Arts Minister, Mitch Fifield, said: “I believe strongly in the importance of an environment-friendly site in the grounds of the World Heritage site and the museum.” However, the government also stated that the construction of the memorial would not be affected by the coronavirus. “The World Heritage site is an integral part of the national identity and the fabric of our state and country, and it is vital that we do all we can to protect and promote that identity and that culture,” Fifield said.  The Commonwealth Bank, which partnered with ArtsAustralia to develop the 2022 edition of the biennial, also said that the exhibition was not impacted by the coronavirus. The Bank will not be able to continue with the exhibition, and the exhibition will not be completed, until at least March 25, 2022.The coronavirus has spread rapidly since it was first reported in Wuhan, China, on February 5, and the virus has reached all parts of China, including Hong Kong, where the first cases are reported.", "The next Biennial should take place in 2021, with a new collection of works by the Detroit-based artist-activists Pilar Cornejo, and will be hosted by the Michigan Institute of Art. The 2017 event, which was curated by Fredric James and Mary Mattingly and featured work by more than sixty artists, including Charles Atkins, Mark Bradford, Michael Bobadilla, and James McEnroe, received the 2017 Kenneth C. Bonar Award, which honors a curator for their work on the exhibition’s inaugural edition in March 2019.\n\n\nGillian Wearing, the British curator who won the Pulitzer Prize for her series “The Virgin Births,” 1972–76, and the New York City–based nonprofit museum, the Lincoln Center for the Arts, last year, has died at age eighty-two from breast cancer, the New York Times reports. Born in London in 1940, Wearing, who grew up in the Borough of Manhattan, told the New York Times that she discovered the Harlem Renaissance through the writings of American artist Robert Irwin. She became a member of the organization, the CCA, at age thirteen and has lectured widely on the cultural impact of that era, including at the Venice Bi", "The next Biennial should be held at the König-Kunsthaus in Cologne until June 25.The next exhibition, “Das Leben im Staat: Biennalis und Gesellschafts” (2017), will take up the theme of the exhibition, which will explore the history of the institution and the institution’s collection, including works by artists such as Schirach, Todorov, and Hesse. The theme will return in 2020.The announcement of the twenty-sixth edition of the German pavilion exhibition “Tacita Walker: The Wild Life” (2019) marks a milestone for the group. It opened in November in cooperation with the König-Kunsthaus, the Renntseal Kunstverein Berlin, and the Frankfurter Kunstverein. The exhibition will now return to Hamburg in March 2020.The sixteenth edition of the Dutch pavilion exhibition “Marianne Boesch: A Forest of My Dreams” (2019) will be held at the Amsterdam Museum of Art from January 28 to March 29. It will be staged in the autumn of 2020. \n\n\nThe Hirshhorn Museum and Sculpture Garden in", "The next Biennial should be held in 2021 at the Museum of Contemporary Art Chicago. The 2020 event will feature works by eighteen artists, including some of the last living artists from the city, including Frank Gehry, Paul Gauguin, and Adrian Piper.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to open a gallery in the former home of the Milwaukee Art Museum in Wisconsin, but the museum has yet to determine the location for the new institution. The new institution will be on the third floor of the museum, which will be located at 900 East Twenty-Fifth Street, in Manhattan, and will be inaugurated on September 1.The announcement marks a turnaround for the museum, which for years has been approached by both MoMA and the Milwaukee Art Museum to open a gallery in their former headquarters. The museum began exploring the idea in 2011, when it relocated from its current location at 733 Seventh Avenue to an expanded space in a former dairy barn in the small town of Eau Claire, Wisconsin. The move led to the hiring of architect James Turrell as the interim director.In an interview with the Los Angeles Times in 2016, Turrell acknowledged that the museum’s initial plan for the space was “not", "The next Biennial should be held in 2020. \n\nThe Australian National Museum (ANU) has received a gift of more than 1,500 photographs by American photographer Carroll Dunham. The gift includes some 250 negatives taken between 1960 and 1974, as well as a set of negatives by his son, Joseph Dunham, whose work has recently entered the public domain.Carroll Dunham is a photographer whose work is often used as a guide to the contemporary American landscape, and whose photographs are often featured in exhibitions at museums. The main exhibition at the Museum of Modern Art in New York will be his first, “Carroll Dunham: The Art of the Photograph,” which will visit the museum in December 2020.“Carroll Dunham: The Art of the Photograph’s’ Introduction by the artist Peter König, ‘1966,’ will appeal to both scholars and general audiences,” said museum director Cynthia Wilkins. “We were thrilled to receive the gift of this important work of Carroll Dunham, especially in the month of October, when he most frequently photographed in his studio in his home, in his home town of Bendigo, Victoria, Australia. Carroll was a true champion of photography and of photography-makers, and", "The next Biennial should be held in 2021.\n\n\nA new, smaller, and more affordable museum has opened in Shanghai. The Bejing Art Museum’s new location in the city center has been developed with an original design by the architect Weihua Jie, whose families founded the company that designs buildings in Beijing. The museum has faced fierce competition from several other local candidates, including the Contemporary Art Museum Shanghai, which is slated to open in the coming years, and the Shanghai Art Museum.The museum will be housed in a building designed by the Jie family, including the recently opened Urban Viewing Rooms, which will be located in a nine-thousand-square-foot space, and will be inaugurated by a new exhibition, “Wu Shanshi,” which will be curated by the artist. The show will present the work of forty-eight contemporary artists, including Junya Jia, Aiguo Wu, and Ming Lu, in addition to the original installation.“The Jie family’s unique architectural style and their dedication to creating new works in a tangible, contemporary, and organic way are deeply admired by the local community and the country,” said Shanghai deputy director Zheng Wenyuan, who", "The next Biennial should take place in early 2020.<|endoftext|>The Art Newspaper has revealed that the Metropolitan Museum of Art (the Museum) of Modern Art (MoMA) in New York City has added five new artists to its collection for its upcoming exhibition “Daddy: A Retrospective.” The exhibition will showcase the work of the five artists currently represented in the institution: Thomas Bennett (New York); David C. Driskell (New York); Ana Mendieta (New York); Adam H. González (New York); and J. Paul Getty (Los Angeles).“Daddy’s first solo exhibitions were at the Museum of Modern Art (MoMA) in 1996 and at the Museum of Modern Art (MoMA) in 2001, with Adam H. González and Ana Mendieta, respectively, and at the Whitney Museum of American Art in New York in 2001, with Robert Mapplethorpe,” said Marc Glimcher, director of the Metropolitan Museum of Art.“Together they have created a series of works that are unique and fascinating, and will be presented at the forthcoming exhibition.”The exhibition will examine how the sculptor Maurice Louis Vuitton has woven together the themes of family,", "The next Biennial should be on the subject of the creation of new social formations, which may include a discussion of the historical conditions of the formation of the new institutions and of the possibilities of their reappearance. A discussion of the political, economic, and cultural impact of the settlement in Palestine should also be addressed. A biennial on the works of the Palestinian artist Ahmad Hijazi should also be featured.The 2020 edition was organized by the Bethlehem-based nonprofit organization Art Initiative Bethlehem in commemoration of the twentieth anniversary of the group and the first in a new series of events supported by Bethlehem.  During the event, a selection of the artist’s works will be presented by renowned international artists such as Hans-Ulrich Obrist, Angela Laine, and Mehdi Tammouli, and the Bethlehem-based artist, activist, and curator Rami Makhlambawi.The 2020 edition will also feature an exhibition of the works of forty-six Palestinian artists. The full list of artists featured is as follows:Alia Abidi, Bethlehem’s Deputy Minister of Arts, Culture and SportAbir raad, Likud Member of the Knesset (Israel)Abir Qasimi, editor", "The next Biennial should examine how the existence of different political structures, institutions, and ideas may influence each other and influence the future.   The second Biennial should include a discussion of the social and structural conditions that might affect the political development of the person. This biennial will be organized on a large scale in order to bring about broad and deep reflections on the history of art and to present the artist as a living subject. The third Biennial will examine the role of the artist in the biennial cycle, as an avatar of the spirit, through an interdisciplinary approach that will incorporate art, philosophy, politics, and the sciences. The fourth Biennial will focus on the spiritual life of the artist and will involve a series of spiritual exercises and discussions with artists such as the folklorist and contemplative Mírzë Kazimir and the artist-activist Monica Vigo.The fifth and final biennial will examine the relationship between artists and the biennial cycle through a series of discussions with artists and other cultural figures such as Jean-Luc Moulène and Jean-Luc Simenon. The first two biennials were held in 2008 and 2009, and the third one will take place in 2020.\n\n\nThe ", "The next Biennial should take place in 2020 at the same venue. This will mark the fifteenth iteration of the city’s annual biennial, which was inaugurated by Alfred Stieglitz, the artist who created the original edition. The inaugural exhibition was held in the city on February 7, 1921.\n\n\nThe Metropolitan Museum of Art in New York has appointed Christopher Knight as its new chief curator of eighteenth-century art. He succeeds Ann-Marie Oehler, who retired following more than twenty years at the helm of the museum in January 2019. Knight comes to the institution from the Museum of Modern Art (MoMA) in New York, where he has served as curator of art since 2005.“Christopher has a deep and expansive understanding of how the Met of Art has been transformed by an ambitious and robust program,” said director Robert C. Zankel. “A former curator of European and modern art, he brings a new perspective to our contemporary exhibition-setting, as well as a preoccupation with the meaning of art, as essential for the museum’s mission.”Knight’s first project at the Met will be “The Power of Art,” an exhibition that will organize the museum", "The next Biennial should draw from a pool of five international artists, with the winner chosen by an online vote. This year’s collection, curated by David C. Driscoll, is housed in the Museo de Arte Contemporáneo Lugaro in the city of Lugaro, and comprises twenty-one works by the artists whose works are slated to appear at the exhibition. The 2019 edition of the exhibition is still on view, and the biennial’s theme, “Monuments: Culture and the Art of MyLife” is still being decided, with the exhibition opening in the spring of 2020. The selection of the five finalists for the prize, which is $25,000, is as follows: 1. Jorge Correa, New York City, USA: 2. Valentino Cipolletta, Milan: 3. George Boo, New York: 4. Thierry Fad, New York: 5. James Kapoor, New York: 6. Maggie Pearson, New York: 7. Bradley Joseph, New York: 8. Michael Rosenfeld, New York", "The next Biennial should focus on the philosophical and archaeological roots of the visual arts in an attempt to secure their continued relevance in an age of great technological change. “We are at a turning point in history,” said Vijay Kumar, president of the Arts Council. “The arts are recovering from the effects of the pandemic, but they are not yet at a point of ultimate recovery. We are at a critical moment.”In an editorial in the March 28 issue of the Art Newspaper, V.S. Rao wrote: “It is important to note that while I would like to see the Biennials focus on the past and present, I believe that this is a phase in the history of art, ‘at a certain point when the Art of the Future will be what art should be today, tomorrow, and the next century.”\n\n\nThe Fifty-Third Venice Architecture Biennale has announced that Elisa Cvetkova will represent Russia at the 2020 edition. The exhibition will take place at the Stedelijk Museum in Amsterdam from October 29 to November 4 and will air on PBS in the United States on November 6. The event will mark the fifteenth edition of the Venice Architecture Bi", "The next Biennial should be announced by the end of the month. \n\n\nThe American Ballet Theater (BALT) will announce the names of its thirty-eight artists and the seventy-four participants in its upcoming edition. The 2019 event will take place at the Metropolitan Opera House, in New York, in February. The festival will also mark the first time that the full range of its holdings will be presented in the United States, with performances by choreographer Mamta El Haddad, opera singer Anita Bryant, and novelist H.P. Lovecraft.“We are enormously excited to present to you the artists who have won the 2019 competition, and to hear their stories,” said executive director Tony Danza. “You will hear their personal narratives and see their works on the stage. It will be a real honor to present their art in person.”The artists selected for the 2019 competition are Amanda Almeida, Sofia Bronk, Yinka Shonibare, Tanya Oakley, and Samuel Taylor Coleridge. The full list of prize winners can be found on the American Ballet Theater’s website. The 2019 competition, titled “A Return to the Theater,” was held", "The next Biennial should open in 2021 and will pay tribute to the works of the biennial’s first curator, the French architect Christian Klee, founded the institution in 1982. The new exhibition programme will focus on the contributions of artists from the sixteenth century to the seventeenth.The first exhibition is entitled “Plutarch of Alexandria” and will open at the Stratos Museum in Athens on September 9. The second show, titled “Eugene Büchner: 3D View,” will be shown at the Museo de Arte Contemporáneo in Madrid sometime in October. The third show, titled “Las artsístas en la paz de Madrid,” will be shown at the Museo de Arte Contemporáneo in Madrid between October 27 and October 30.\n\n\nThe London-based arts organization the London Foundation for Contemporary Arts (LFA) has announced the launch of a new $250,000 fund to support London’s independent cultural institutions. The fund is being created as part of the London Assembly (LA), which was launched in 2020 to encourage the creation of new cultural and community-based activities by local and international artists"]