["The next Biennial should be held in the spring of 2021. The exhibition\u0097which will feature new works by artists such as Sohrab Mohebbi, Elad Efrati, Jumana Naidoo, and Ressam Nagar, among others, and will take up issues such as urban concerns, climate change, and empathy.“The exhibition is part of our long-term goal of creating a biennial that integrates art and the region in a way that reflects the identity of the city,” said Ahmad Ali, the city’s director of the city’s Cultural Heritage Department. “The creation of the Biennial is also a way to strengthen the city’s link with the rest of the world and to consider the city as an important platform for international exchange and exchange of culture.” The sculpture program will be led by Shihan Yalchu, a former curator of Chinese art who has worked in the field for more than fifteen years, and will be curated by Johnnie M. Tsai, a former curator of Chinese art. The show will also include a discussion led by Robert Wang on how sculpture is linked to the lives and wellbeing of many ethnicities and cultures", "The next Biennial should focus on European art and/or architecture, with a particular focus on the new sculptural practices, the emerging digital art world, and the cultural heritage of the United Kingdom. The 2019 edition will also include a special exhibition on the history of art and technology. The 2020 edition will be the last as part of the current five-year cycle.\n\n\nThe Basel Biennial has released its thirty-fifth edition, “The Geometric Universe: Contemporary Art from the Basel Collection,” which will take place at the Museum of Contemporary Art (MoCA) in Chicago in March 2020. Titled “Art from the Basel,” the exhibition will examine the topics of artistic practice and materiality, collaboration, and the painterly medium, with a particular focus on the work of artist-in-residence, Minna de Villiers.\n\n\nThe Metropolitan Museum of Art in New York announced today that it has retained its director, David Chipper, for a second term, effective March 13. During his tenure, which spans the museum’s forty-two-year history, Chipper has organized more than seventy exhibitions, including the inaugural “Art from the Met’s Collection", "The next Biennial should take place in 2021, on the occasion of the 150th anniversary of the founding of the University. The inaugural event will feature a selection of works by more than three hundred artists.The theme of the upcoming exhibition, “Polarity” and the exhibition’s program, “Polarity 0:20,” is the “new relation between north and south.” The event will be organized in three parts: First, a “Polarity” exhibition in 2021; a “Polarity 1” exhibition in 2022; and a “Polarity 2” exhibition in 2023. The exhibition’s construction will take place at the Museum of Contemporary Art, Atlanta; the Tate, London; and the Skirball Cultural Center, Skirball, Massachusetts.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that its collection will be overhauled by acquiring 20 artworks by seven artists whose work is currently housed at the institution: Charles Dean, Gloria Gaynor, Marilyn Hayes, Nick Landreth, Judith Pape, and Angela Pfeifer.The twenty-three new works are currently housed at the Farragut South", "The next Biennial should be held in the fall of 2020, and the first in the spring of 2021. The 2019–2020 edition featured the work of a group of thirty artists, including Komodo, Osmos, and Riga, and was curated by Alexander Calder and Kasper Nielsen. The next edition will likely be organized by the artist, and will be held at the Museums in Munich, Munich, and Munich–Düsseldorf. The 2019–2020 edition was organized by Alexander Calder and Kasper Nielsen.\n\n\nThe other day, I received an email from a very nice friend who asked if I would like to come to his house for a coffee. The subject line read: “Coffee with my family.” I was a little skeptical because I don’t usually make coffee with my family. My husband is a coffee snob. He prefers to drink his morning latte or coffee with milk, and only drinks his morning latte with milk. But my friend assured me that this was the ideal time to try something new and unexpected with my family, so I agreed to try it.During the week leading up to the event, I traveled to Maui", "The next Biennial should be hosted at the International Exhibition Centre in Paris, at the Institut de Paris, in the City of Louvain, in the State of Quebec, and at the Épineuil-le-Fleuriel, in the Faursach-le-Grand, the capital of Brittany. The event should begin with a residency with an artist from the audience, a panel discussion, and Q&As with the artist. The assembly will conclude with a reception in the evening. “The house may be in a state of disarray, but we are not,” said Laurent Delorme, president of the annual exhibition. “Since the death of the founder, Jean-Luc Moulène, our program has always been based on the contribution of each exhibition. It has always been a question of who would be the next. In a moment of great crisis, when others are leaving, who can live up to the vision of Moulène’s? With the new lineup, we make a new narrative. We are no longer about the presentation of an exhibition, but about the construction of a new collective. We are about a meeting between humans and nature, about a commitment to science and", "The next Biennial should be held in 2020.\n\n\n\n\n\nHannah Wilke Gallery (United Kingdom) and Galerie Groupe de l'Art et l'Histoire (France) and The Haus der Kunst (Germany) have announced that they are currently collaborating on a new exhibition of work by American artist and theorist H. L. Menken. The new initiative, called “Menken and the History of Modern Art” (Hannah Wilke Gallery), will travel to Berlin from September 26 to September 29.“In 1989, H. L. Menken wrote a wonderful and powerful book that changed my life for good,” said Hannah Wilke. “The work in the exhibition is an excellent example of the exhibition, which is as much about standing in the middle as about the past. I’m very happy that the exhibition will be at the Haus der Kunst (Berlin) and that the video of the exhibition will be at the Haus der Kunst. Even if the work is not at the Haus der Kunst, I must say it is very moving and brings to mind images of the exhibition in its early years. We are both very enthusiastic about the exhibition", "The next Biennial should be held in 2021, but the organizers are waiting on the declaration of a new international event. Advertisement\n\n\nThe Pierre-Auguste-Louis Vuitton Foundation, the Claude Monet Foundation, and the Victoria and Albert Museum (and formerly the Metropolitan Museum of Art) in London have joined forces to launch the first ever biennial dedicated to the artist’s work, titled Artists’ Paths, which will be led by Pierre-Auguste-Louis Vuitton Foundation curator Carol Elvin. The biennial was established to present Claude Monet’s work in a new, modern package. Inaugurating the new platform will be a special exhibition on Neue Rauchsteiger, the French artist’s 1968 exhibition at the museum. Launched by Elvin and fellow curators Jean Luc Alfred and Jean-Baptiste Jakob, the exhibition will open in September. “We are delighted to be bringing this first exhibition to the museum, and to be able to introduce this work to a new audience,” said Elvin. “The gallery will be the first to present the work. And while it", "The next Biennial should happen in 2022. It will be held in the city’s city halls, and will be hosted by the city of Tokyo. \n\n\nThe National Gallery of Scotland has announced that the institution will begin a transition of leadership following the departure of director Sir David Morrison. A statement released by the museum said: “The National Gallery of Scotland’s board of directors have announced David Morrison has retired. David was a distinguished member of the museum’s team and was instrumental in achieving the museum’s major reorganisation in the 1980s. He was instrumental in bringing the museum back to prominence in the 1990s and beyond and was instrumental in the acquisition of several important works, including the masterworks The Magic Mountain and The Mummy and the Pharaoh.”In a statement, Sir David said: “I have had a lifelong passion for art and design and the National Gallery of Scotland has been a strong supporter of my career. The National Gallery of Scotland is a unique institution that has had a transformative role in shaping the history of art in Scotland and the UK. I am enormously proud to have been a part of this remarkable team.”The announcement comes amid the global health crisis caused by the novel coron", "The next Biennial should be held in 2021. \n\n\nThe Exhibition Center in Nara, Japan, will open a new, more than 1,000-seat theater in the capital of the Sino-Japanese Friendship Association (SHUF)—the arts and culture hub located in a former cotton factory in the east of the city—in 2021. The venue will be inaugurated by a Kojiki, the artist-run event series conceived by the Sino-Japan Cultural Exchange (JJC) in partnership with the Sino-Japan Alliance for Freedom (SJA), and will be inaugurated by a retrospective of the work of Satoru Iwata, the Japanese director of the experimental Japanese animation studio Studio Ghibli, which is separated from the official museum. The retrospective will highlight the work of twenty-eight artists and will include an exploration of the relationship between art and symbols through the lens of the Japanese Confucianism movement.The new venue, which is being built by Kojiki architect Katsunoto Takeda, will be named after the artist Takeda Kojima, who was a well-known and famous artist in Japan. Kojima’s work has been featured in exhibitions at the SFA Kunsth", "The next Biennial should take place in the city in 2021, the following year and the following year. Among the works that will be on view in its first edition are works by Diane Arbus and Carl Dumas; Gilbert & George, which was on loan to the gallery, a six-thousand-work project; and an exhibition of forty-eight lesser-known works by the same artists.Souza said: “We’re very excited about this new chapter in our history. The future of Biennials has never looked brighter. We are very excited to continue to play a pivotal role in the development of the next generation of American masters, and to continue to challenge and advance their work.”\n\n\nThe UMB Foundation, a New York–based organization dedicated to strengthening the civic, educational, and cultural foundations of the city’s museums and cultural institutions, has announced that it is giving $2 million to MIDWESTAK in support of its goal of increasing the number of artists drawn to its mission through a new accelerator program. The initiative will collaborate with museums, cultural organizations, and artist-run incubators to train and support future generations of curators, artists, and artists-in-residence", "The next Biennial should be held in 2021, and the thirty-seventh in 2023.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Sophie Wilmott as its next director and CEO. Wilmott comes to the institution from New York’s Metropolitan Museum of Art, where she has served as its interim director and CEO since August 2017.“With her background in program design, design, and manufacturing, she understands and can cultivate the power of the Arts in a time of transition and crisis,” said Baillie Alexander, chair of the board of trustees of the museum. “With much of the museum’s major renovation and expansion projects underway, Sophie has proven herself a strong leader and a dedicated advocate for the MFA’s mission. She has demonstrated a profound understanding of the museum’s audiences and of the importance of supporting the program as we continue to grow in both stature and stature of a community.”The appointment marks the culmination of a decade of work for Wilmott, who began as a curatorial assistant in 2006. During her tenure, she helped organize the exhibition “Tony and I” (2015); “The Sun Rises in the East", "The next Biennial should take place in the city of Algiers in the Spring of 2022, according to a statement from the Center for Contemporary Art (CCA) in Algiers. “The first edition of the event will bring together artists from twenty-seven countries around the world, including the United States and Italy, and will feature a selection of work with the theme ‘Innovation and Change.” The program will return to Algiers in the Summer of 2022 for a second edition, titled “Innovation in the Age of Black Death” and will also be hosted in Paris in the Autumn of 2022. The 2019-20 edition of the exhibition, titled “The Death of Art” was staged at the Saint-Omer Museum in Saint-Omer, Morocco. The museum had planned to stage the exhibition at the Radisson Blu Hotel in Cannes, but the artist-run space pulled the exhibition in March 2019. A spokesperson for the Radisson Blu confirmed that the show had been moved to the Art Event Center in Cannes. The show will remain on view at the Art Event Center until March 21.Ibrahim Hooper, the curator of the show and chair of the CCA Biennial", "The next Biennial should focus on “The History of Women” (2019), which will take up the issues of gender and history in a historical context. “Imbeciles: A History of the Italian People, 1870–1930,” is slated to open in September. The next exhibition will be titled “Papal States: The Vatican II–19,” which will run from October 19 to October 25, 2020, and will be organized as a series of lectures, and will be staged at various locations across Rome.\n\n\nThe Foundation for Contemporary Art (FEMA) announced today that it is launching a new $35 million fund to support the artistic, cultural, and academic projects of the National Geographic Society. The program, which is being organized as part of the FAA’s Art of the Deal, will offer grants of $75,000 to various arts and cultural organizations. The grants will support the artists and scholars who are working to identify and document the archaeological and historical sites of the National Geographic Society’s flagship television series, America’s Most Wanted, and will provide a platform for them to experiment with subjects such as climate change, global migration, and human", "The next Biennial should be held in 2020. The current exhibition, “Thinking of‐Black,” opened on March 23 and ran until March 24. In a bid to ensure that the show would continue to attract the widest possible audience, the organizers have decided to move the show to the University of Oxford in the United Kingdom. The event will be hosted by artist-in-residence, Prof. Anwar Farooq, and will feature artwork by forty-nine artists.The event, which is currently being organized by an international committee comprising artists, curators, historians, and researchers and comprising thirty-six artists, thirty-six curators, and twenty-three scholars, will inaugurate its forty-eighth edition at the Centre Pompidou, Paris, on September 22.\n\n\nSeparate but equal: the intersection of art and politics. Jean-Luc Moulène’s sculpture The Furies, 1982, a humanoid, Hellenistic-looking figure that is based on a single, massive, 100,000-piece Roman sculpture that was installed in the courtyard of the Louvre in Paris in 1986, has now been transferred to the Palazzo Prada in Venice, where it is expected", "The next Biennial should take place in 2020.\n\n\nArt historian, curator, and writer Arundathi Roy, whose practice is reflected in her large-scale cultural productions\u0097both theatrical and dramatic\u0097has died at the age of eighty-nine from ovarian cancer.Born in Bombay in 1931, Roy began her artistic career at the Pushkin Museum in Moscow in the 1930s. She joined the MFA and then the König Stiftung in Berlin, where she studied under the legendary Georg Lukács. In 1949, she moved to New York, where she would live and work her way into the Richard Diebenkorn museum. Her first solo exhibition at the museum, “Stage 2: Completely Naked,” was staged in 1953 and was followed by “Z/nis der Deutsches König” (1977–80), a documentary film about the artist’s life and work that won the prize at the Venice Biennale, and “Anima: ‘Alberto Burri’s Body’s Studio,” a 1995 retrospective that featured work by many of the artist’s contemporaries.In 1978, Roy published a book about her life, Art", "The next Biennial should be held in 2020. “We are committed to working with local communities, with artists and designers who are choosing to use the biennial as a platform to bring about social change,” said Andrea Bocconi, director of the biennial.  The biennial will also introduce new methods of interaction between artists and will present a collection of works that were selected by artists and designers from around the world. The theme of the 2020 Biennial will be “Art and Design,” and the biennial will encompass thirty years of work. Bondi is the first artist to represent Italy at the Venice Biennale, and she will take up the mantle of the festival in January 2021. \n\n\nThe Museum of Fine Arts (MMFA) in New York has appointed Barbara Polsinelli as its next director. She succeeds Kate Cahn, who departed the institution in March 2019 to head the Los Angeles County Museum of Art (LACMA), and will assume her responsibilities in the coming months.“Barbara brings invaluable experience and knowledge to the MMFA as we embark upon a major expansion and renovation of our contemporary art collection,” said MMFA director Patrick Burke. “Barbara", "The next Biennial should focus on constructing an artistic narrative that addresses the therapeutic possibilities of the regenerative potential of plants and the biosphere, as well as its interdependencies with one another and with the physical and spiritual worlds.”\n\n\nNew York’s Metropolitan Museum of Art (MoMA) is planning to shutter its most recent exhibition of early modern paintings in the wake of the ongoing protests against police violence. The museum originally scheduled the show “The Precession of Venus and Mars,” a group show that examined the influence of Venus on Mars, in December 2019, and reopening would have taken place in April.The end of the exhibition comes amid an ongoing campaign by activists including the New York–based artist Nadia Coman-Saraceno to close museums from the COP21 summit in Paris until the Parisian Gare de Lyon metro station closes to traffic. The activist group Cinéma is urging other arts institutions in the United States to follow suit. The New York–based nonprofit the Alliance for Civil Justice said it is preparing to protest the museum’s closure by staging a demonstration at the Whitney Museum of American Art on Saturday, June 9.The action is part of a nationwide campaign by activists who have called", "The next Biennial should be held in 2021 and will focus on women artists and their contributions to the art, culture, and science of the city. The ten-year project will focus on the history of women in art and will include a selection of works by thirty-nine artists. The first exhibition will focus on the history of African art and will be organized as follows: The Ann and Gerstmann Foundation will present: Buchia, 1930–1963 The artist-in-residence initiative features ten artists annually. The last exhibition was held at the National Museum of African Art in Kinshasa, West Africa, in October 2018.The new annual prize will be presented by the Danish artist-in-residence Nanna Hjortenberg, and will be held at the Kunsthalle Basel in Los Angeles, California, from March 5 to March 7. Cultural historian Susan Woods, whose practice spans art history, philosophy, and modernism, will serve as a jury member. In recognition of her contribution to the exhibition, the prize will include a lifetime achievement award of $120,000.The inaugural prize, which was founded in 1992 by the couple who is now the founders of the William Goldman Foundation,", "The next Biennial should take place in 2020.The contemporary masterwork, which is based on the life of Musa Abu Hamdan, is an exploration of the limits of art and its inherent diversity of forms, its metaphysical quality, and a process of creation and destruction. It is currently on display at the Grand Palais in Paris.\n\n\nThe Museum of Arts and Design (MAD) in New York has appointed Jonathan Tzender, whose critically acclaimed sculptures and installations blend cultural history and social and political theory, as its next director. He succeeds Paul Mpagi Sepuya, who departed the institution in March 2019 after twenty-five years to pursue a new career outside the field.“Tzender is a gifted artist, and his recent work reflects a restless imagination that makes his projects seem spontaneous and almost unplanned,” said Michael L. Pasternak, the museum’s current director. “His explorations of the contemporary world are grounded in a commitment to building on the work of artists such as Zina Saro-Wiwa, Eileen Atkins, and Janet and Wayne Edwards. At his core, he is an artist committed to the art of the landscape and sky, of memory and the material, and to", "The next Biennial should be held in 2020.\n\n\nThe Metropolitan Museum of Art in New York has appointed William R. A. Duane as the next director of the Whitney Museum of American Art. Duane comes to MASS MoCA from the Metropolitan Museum of Art, where he has served as director of photography since 2015. He succeeds Ruth Estévez, who took the helm of the gallery in the summer of 2019.“We are delighted to welcome William to MASS MoCA,” said director Kristina Kuzma. “He has extensive experience in contemporary art and brings to the Whitney an entirely new perspective and an ability to reimagine the future as affecting as it is groundbreaking.”Duane comes to MASS MoCA from the University of Minnesota, where he serves as the Brent Lovell-designed, twenty-five-thousand-piece retrospective of Robert Irwin’s work Mud,” which opens on October 29. It also features works by artists such as Alison Lowe, T.J. Smith, and Jay-Z, and will be at the institution for seventeen weeks. The first exhibition of its kind, “Mud: The Untold Story,” will open at MASS", "The next Biennial should be held in 2020.\n\n\nThe London-based arts nonprofit the London-based arts nonprofit the London-based arts nonprofit the Drawbridge, which has been working to open a new home for the arts in the Vauxhall area of London, has received a $10 million donation. The money will make up for the Drawbridge’s first year-round residency program, which will be hosted at the Drawbridge, a space that was established in 2009 by artist-activists Tanya Bonakdar and Marta Bonazı́.Dubbed the Drawbridge 2.0, the facility will provide 1,500 square feet of gallery space for artists and a public space for direct mail and printmaking. It will also have a 500-seat theater, a café, and a library. The program will run for five years and will culminate in a drawing of a new work by the artist-activists. The next iteration of Drawbridge will be held at the Royal Academy of Arts in London.The organization will also offer programming in the United States; Europe; and Asia. It was founded by Bonakdar and Malliann Gale—the founder of the British nonprofit Project B—and received a $5 million grant", "The next Biennial should have been held in 2019, but was postponed due to the Covid-19 pandemic. The seventy-sixth should have been held in 2020, but was pushed back again due to the Covid-19 pandemic. The seventy-ninth and seventy-ninth editions of the museum have been postponed each year since 2006.The exhibition chain said that the full list of galleries participating in the 2020 edition is still incomplete, and that it expects the full list of exhibitors to be announced sometime in the coming weeks. The 2019 event was originally set to open on December 28.The museum will be closed until January 1, 2020.\n\n\nThe British artist, designer, and educator Banksy, whose work, collages, collages, prints, photographs, videos, and installations are often deeply engrained in the public imagination, has died at age seventy-four at his home in London. His work was chosen by the Royal Shakespeare Company (RSC) to represent England at the 2019 Venice Biennale; it was also featured in the 2018 Whitney Biennial in New York and was included in the 2019 edition of the Museum of Modern Art in New York. The works of Banksy are housed in the public collections of several British", "The next Biennial should be held in 2020.\n\n\nThe Chinese artist Wang Wei, a founder of the Chinese Modern art movement, died on April 23 at the age of eighty-one. He was known for creating works whose intricately wrought, often abstract, sculptures had the power to change the world.Little is known about Wang Wei’s artistic career, but his early career was one of the earliest of the contemporary Chinese Modern art movement, described by artist John Akomfrah as the “endless series of rarities.” Born in Shanghai in 1932, Wang moved to the United States in the 1960s and settled in Beijing. He began his art-making career as a curator, receiving his Ph.D. in 1970 from the University of California, Berkeley. He exhibited his work at the China Modern Art Museum in Beijing; the the Museum of Contemporary Art Shanghai; the Museum of Modern Art in Shenzhen; and the Museum of Contemporary Art in Nara. However, the bulk of his output consists of sculpture.Wang Wei’s sculptures are often based on the same concept but with different historical reference points. One of his earliest works, the Song dynasty miniature landscape that is based on a collection of poems from the Book", "The next Biennial should focus on developing techniques for better distribution of scientific research materials so that all disciplines of science can have access to the latest discoveries and innovations. The vernacular arts of Swastik ’s laboratory should be given a new lease of life. The exhibition “The Fifth Estate” is a possibility, but it would be a pity if it was not accompanied by an energetic exhibition of contemporary art and the work of contemporary artists.”The ninth edition of the Biennial will take place in three stages, starting in 2021 and ending in 2022. The exhibition will revolve around a group of artists—including the German artist Wolfgang Noth, whose work blends sculptural elements such as glass, steel, and rubber with images of the human body and the environment—and will also include works by contemporary artists such as Andreas Hölzel, Ewa Michalak, and Ralph Kahler. The ten-day event will be organized in an art-historical manner, with the goals of creating a new vocabulary for contemporary art and articulating the possibilities of the future.“The Fifth Estate” will be curated by Chiara Racaniello and will be presented by the Italian curator Luigi Fatta. The curator will introduce the", "The next Biennial should take place in January 2021. \n\n\nThe Museum of Fine Arts (MFA) in Boston, which announced on Monday that it plans to shutter its doors indefinitely in March due to the Covid-19 pandemic, has issued a second statement regarding its future programming. Speaking to the Boston Globe, director Carol Ann Martin said: “We would like to emphasize that we are currently working toward completing major renovations, which will begin in the fall. These renovations will greatly enhance the museum’s exhibition and educational programming, and will further the work of our curators and staff. The goal is to be ready to reopen in the spring of 2021.”Martin added that the future of the museum is uncertain, but that the museum has been working toward revamping its exhibition spaces for some time. The institution hopes to reopen in March of 2022. Martin also said that the future of the institution’s student-run, nonprofit, and artist-run programs is unknown, but that the MFA is “committed to a long-term strategy, a long-term vision,” in which the institution serves as a platform for more diverse voices. A retrospective of the work of James Turrell", "The next Biennial should feature an exhibition dedicated to the works of the late French painter Philippe Aurat, who is best known for his hauntingly detailed paintings that often explore the relationship between the human body and the landscape.The Biennial will also feature an exhibition devoted to the life and work of the Russian artist N. G. Gagarin, whose pioneering space in the USSR, the Mir and the Soviet Museum of Fine Arts, is now awaiting construction. The exhibition will be inaugurated by a solo exhibition of the artist’s works at the Museum of Modern Art in New York on September 17. The second exhibition will be presented by the Museum of Modern Art in New York on September 26. The third will be presented by the Museum of Modern Art in New York on October 3, and the fourth will be presented by the Museum of Modern Art in New York on October 9. Two special exhibitions, “The Painted World: Painting in the USSR,” curated by the Soviet Museum of Fine Arts, will each be presented by the Museum of Modern Art in New York.\n\n\nThe National Geographic Society’s (NGS) ambitious plan to remake its headquarters in Washington, DC, has been in the works for over a decade. In April", "The next Biennial should be presented by artists and they will be organized in their actual locations, such as Venice or New York. The main theme of the third edition will be “The Struggle for Democracy.”The second edition of the biennial was held in June 2019. The 2019 edition was curated by Hanna Roskova and will inaugurate the exhibition The Struggle for Democracy, which will be on view until November 22. The next event will be hosted by the Museo nário do Vigo in Rio de Janeiro, Brazil, on November 13. The 2019 edition featured work by more than 100 international artists, including João Alves, Arne-Philip Luytens, J. Paul Getty, Tanya Martinez, and Elsesai . The 2020 edition will include work by twenty-three artists, including Ana Paula Campos, Rafael Campos, Erick Aleman, and Jules Girard.\n\n\nNew York’s Metropolitan Museum of Art (MMA) is planning to become the first institution in the United States to offer online viewing rooms to students for free. The program, known as kino, will introduce a new digital platform that will allow college students and junior high school students in", "The next Biennial should take place in 2020, but as of March 2020 only forty-two of the sixty productions in the catalogues of the five artists are currently scheduled to be staged. The remaining forty-two have been placed in suspended animation. These forty-two works will then be returned to the gallery for exhibition and public participation, which will begin on September 23.\n\n\nThe National Gallery of Art in Washington, DC, which has been closed since March 13 because of Covid-19, has appointed Sarah Greene as its new director. She succeeds Edward Lacey, who announced he is stepping down after a decade at the helm of the institution.“Sarah is a seasoned leader who has built a strong portfolio of work in the field of contemporary art and a reputation for innovation and innovation in her own right,” said Michael Govan, director and CEO of the National Gallery. “Her ability to bring a sharp and transdisciplinary vision to the National Gallery and broaden its collection in creative ways that connect the arts and humanities is a testament to the visionary energy and creativity of the National Gallery.”Over the course of her career, Greene has collaborated with a number of artists, including Gio Ponti (2018), a new album by Jay-", "The next Biennial should be held at the Museum of Contemporary Art San Francisco, in the Bay Area, in 2021. “It’s a defining moment for us as a platform for greater social change,” said Hernán, who will begin his tenure in January.  When asked how the public will react to the election of a new leader, the artist explained: “There are very few things in life that are as universal as a human soul and a sense of belonging. The event of a new leader is absolutely critical.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of works by a slate of artists in a major overhaul of the city’s public art. Under the direction of commissioner Tom Finkelpearl, the DCLA has overhauled the city’s cultural landscape by removing or reducing the number of public monuments and replacing them with more interactive public experiences that engage with the city’s history. “The Art in Cities project intends to revitalize and maintain the public’s most cherished cultural assets, while fostering the development of a wider appreciation for the art of our time,” Finkelpearl said in a statement", "The next Biennial should take place in 2021, and will be on the same date as the biennial of the artist-s-in-residence, the Biennale des Beaux-Arts, in Lyon. \n\nThe work of the Biennale of Sydney’s artist-in-residence, Elyn Zimmerman, will be included in the upcoming edition of the Biennale of Sydney. Zimmerman, a Sydney-based performance artist and writer, will have her work displayed alongside that of fellow finalists Jenny Holzer and Charles Shire, among others, at the upcoming exhibition at the State Library of New South Wales (SLW). “Elyn Zimmerman’s work is an exact replica of what her fellow finalists, Charles Shire and Jenny Holzer, imagined their worlds to be,” said curator and vice president of the Australian Society of Arts and Technology, Tom Oliphant. “Elyn Zimmerman is living it.” Oliphant added that the work will cater to the needs of the audience, who will be able to choose to attend the exhibition or not to, and will address topics such as the cultural impact of the biennial and the 'hidden hand”", "The next Biennial should take place in 2020 and will be hosted by the National Gallery of Arts in Washington, DC.  The exhibition will be based on a series of paintings by the late Belgian artist Andre Borschberg, whose practice blends abstraction, hyperbolic colors, and relentless movement in order to address the complexity of what he terms a \"monadological\" painting form. Borschberg was a prolific painter whose work has been collected by the Whitney Museum of American Art, the Metropolitan Museum of Art, the Brooklyn Museum, and the Berkeley Art Museum, among other institutions. The retrospective will include new works by fifteen artists and will run from February 3 to February 9, 2020 in the National Gallery of Art. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to cancel the upcoming seventy-fourth edition of the Eugene Debs–designed event, which will be held in 2019. The cancellation would mark the culmination of more than five years of planning that included the public engagement of the institution, its board, and community. The event, which has been held on the third floor of the Museum since 2003, was originally scheduled to run from March 16–March 20.Since its launch in", "The next Biennial should be awarded to two galleries: the long-standing project partners of the Biennial, the New Art Group in London and the Hammer Museum in New York. The London-based organization will receive $50,000 in support of the exhibition. The invitation-only exhibition will take up the themes of identity and politics, art, and nostalgia, and will run only from February 16 to March 5, 2020.The exhibit will include works by over seventy artists, including Giacomo Puccini, Barbara Kruger, and Maryna Zavitsanos; will feature a discussion with the Venus Project and Julian Casablancas, the directors of the London-based nonprofit Venus Gallery; and will feature works by artists from eleven countries.The show will be curated by Alexander Kander, who has worked for the museum for twenty years, and will be hosted by curator Alain Guld in partnership with Lévy Gorvy in New York. Guld will serve as co-curator with Kander.\n\n\nThe Museum of Modern Art (MoMA) in New York has made history by becoming the first major American institution to offer free admission to residents of Flint, Michigan, in an attempt to help the local Flint Art Museum (FAM", "The next Biennial should be held in 2020. \n\n\nThe Museum of Modern Art (MoMA) in New York has launched an initiative to create more than five thousand jobs at its new headquarters in the Hamptons. The initiative, called The Workhouse, will give aspiring museum workers a chance to work at the museum as part of a project that will involve the development of a new show about the American immigrant experience.The goal of the program, which will culminate with a public lecture series in October 2020, is to train up aspiring museum workers to become part of the museum’s staff by offering them work at a minimum salary and with a stipend. This would not be the first institution to help train museum workers: The Brooklyn Museum created two new positions in its employee benefits department in 2016.The organization will fund the workers’ training through a fund that will be managed by the museum’s Cultural Affairs department, which is run by deputy director Mary Anne Carter. The fund will reimburse the museum for up to $500 in salary or wages lost to the Covid-19 pandemic as a result of layoffs and other layoffs that were made in the museum’s facilities.“We are delighted that The Workhouse will inspire young", "The next Biennial should be set up in the autumn of 2021. The government’s previous proposal to extend the program—to 2020—was scrapped in 2018 amid the devastating fire that engulfed the historic building that houses the city’s Museum of the City of New York. \n\nThe Institute of Contemporary Art (ICA) in London has welcomed artist-in-residence Kintyre Aikins to its curatorial team. In her first role as a staff artist-in-residence since the institution was founded in 1972, Aikins will oversee the development of the institution’s forthcoming exhibition, “Yale Architecture,” which will draw from the University College London’s Gardiner Architecture site. She will also oversee the exhibition’s programming in conjunction with the opening of the museum’s new location in North Kensington, the Royal Festival Hall.The announcement coincides with the opening of a new exhibition, “Yale Architecture,” at the University College London, titled “Architecture of Experience.” “In the field of design, she is exceptional, having previously worked for a number of institutions in the United Kingdom and has experience working across a variety of disciplines and", "The next Biennial should take place in Paris in 2020. The 2019 event was held at the Musée d’Art Contemporain (MCA), and the 2020 edition will be in collaboration with the Mondrian Museum Paris. The event will be centered around the theme “Death and Life: Three Dimensions of Life” and will showcase the work of 120 contemporary artists, including Issa Kaúsi, Aline Bénédicte Savoy, and Nan Goldin. The biennial will also include a selection of contemporary objects and will be curated by Nina Hendry, the director of the Musée d’Art Contemporain.The 2019 edition of the Biannual was held at the Musée d’Art Contemporain in Paris from February 5 to February 8. The event was attended by approximately 1,200 people from twenty-six countries and forty-eight different territories. Last year’s edition, which celebrated the work of Daeinat Hakeem, was held at the Musée d’Art Contemporain, Dundalkirk, and the Pérez Art Institute in Madrid.\n\n\nA group of artists and", "The next Biennial should take place in 2020. In the meantime, Louvre director Georges St-Pierre will be making a presentation titled The Future of Art, at the museum on February 24. \n\n\nThe Institute of Contemporary Arts (ICA) in the Netherlands has announced the twenty-six artists who have received the Netherlands' Honors in Arts Prize in the twenty-third edition of the prize, which was established by the Arts and Culture Foundation (VyMa), which is supported by the Rotterdam Foundation, the HUT, and the Künstler-Kunstverein.This year’s prize ceremony will take place at the ICA Amsterdam from February 28 to March 2, with the first performance taking place on March 8.The theme for the next edition of the prize is “Art in Transition.” The 2020 finalists include Frantisek Camil (Poland), Sabine Chamert (United Kingdom), Armindo Cipolletta (Italy), and Christo (Italy), and the winner of this year’s award is Jeroen van den Broek, Australia.The prize will be awarded in conjunction with the fifty-ninth Venice Bi", "The next Biennial should focus on “intersection of art and culture and the media including photography and video,” the institution said in a statement. The 2020 edition will be held at the Museum of Modern Art in New York from November 16 to December 8.The exhibition will feature work by fifty artists, including Basquiat, Bechdel, Gerald Osborn, and Leon Lipsky, as well as ten artists from the Philippines, including Davao Madaliza, Santiago Magenson, and Banda Jindra, and five directors, including Alfredo Di Anda, Andrew Johnson, and Oonanjo Noguchi.The work of the twenty-five artists selected for the exhibition is listed in the catalogue entry for Visual art and movement from the Philippines (2016) by Monica Rauch and J. Patrick Keenan, who organized the exhibition in partnership with Sigrid Kennedy.  “We are thrilled to be working with Sigrid Kennedy to launch our new Digital and Live+ experiences,” said Mark Zuckerberg, who piloted the organization for years and who has worked tirelessly to push for the exhibition to open. “This is an exhibition that reflects the richness of", "The next Biennial should take place in the spring of 2022.The initiative, titled Cure, was founded in 2015 by the German art historian Markus Baumann and the Los Angeles–born photographer Christoph Potgieter, who together created the first scale portrait of the artist as he was working on his famous Glass House in the Marin Museum of Art. The project was inspired by a similar exhibit at the Museum of Contemporary Art, Los Angeles (LACMA) in 2015.In 2018, the team behind Cure assembled a selection of 90 works by the artist in order to present the collection to the public. The works—which were mostly taken in the late 1970s and early 1980s—were then transported to the Southern California–born artist in order to create a new, hybrid work, “Elusive Vision,” which is based on the same concept. That exhibition was held at the Los Angeles County Museum of Art and traveled to Prague, Berlin, and the Venice Biennale.\n\n\nThe Solomon R. Guggenheim Museum in New York has announced that the museum is extending the life of George and Miriam Adler’s purchase of a work by American photographer Don Imus\u0097the first African American to win the Pulitzer Prize", "The next Biennial should be held in 2022.\n\n\nAnton Kern, the founder of the experimental art-and-design studio Dada Strada, has been appointed the next director of the Berlin-based MAMCA, a nonprofit organization dedicated to supporting and promoting Italian art and architecture in the United States. Kern will take up his post on January 21, 2020.“I’ve been a fan of the MAMCA’s work since the first exhibition in the series, ‘Interstellium avec Benoît-François,” in 1998,” said Kern. “The new director will play a critical role in advancing MAMCA’s vision of a state-of-the-art institution.”Born in Rome in 1969, Kern moved to the United States in 1987 to study at the New School. He later earned a Ph.D. in landscape architecture from the School of the Art Institute of Chicago and moved to New York City, where he started a family, pursued a career as a landscape and architecture photographer, and worked as a freelance curator. In 1999, the MAMCA’s curator of Italian art, Stefano Dori, awarded Kern the", "The next Biennial should take place in the autumn of 2021.\n\n\nThe close of the first edition of the Global Biennial in Beijing on October 24 was marked by a series of unfortunate events, including the loss of twenty-four artists, including Natalia Ghebalyeva, Sergei Kulakov, and Luiz Soares, as well as the temporary closure of the exhibition “The Fifth Element” (SOUL). The exhibition traveled to SOUL in the United States and will now return to Beijing.The exhibition, which was organized in collaboration with the Beijing Biennale, was created in partnership with the Wuhan Institute of Contemporary Arts (WIC) and the Beijing Art Museum. The collaboration was sparked by the IPO of a new cooperative in the city of Wuhan, called the Beijing Art Museum, and the WIC, which is housed on the same floor as the Beijing Art Museum, which has struggled since opening to the public in November 2016 to cope with the coronavirus.The exhibition, which was curated by Zhang Yaxuan, included works from twenty-eight countries. Its first winner, a piece by Andrianomearis, a long-standing Beijing artist, was selected by the biennial�", "The next Biennial should take place in 2020, and a follow-up exhibition, “The Eighteenth,” will be staged in 2022. The show will focus on the exhibition of the work of the artist to date, with a particular attention paid to the work of Simón Arteaga, a man who currently occupies the same space as the museum as well as the studio Ramón y Cajal.In an interview with the Art Newspaper, the artist said: “The Biennial is an expression of the knowledge that is gained through a lifetime. The work is a continuous expression of the idea that the visual field should be a major concern for society, capable of promoting unity and transparency.”The exhibition will take the form of a series of digital videos that are created using the artist’s own photography. Each video will feature the work of the artist in a different way. For “The Fourteenth,” he will create a video about a parade that involves walking through a parade, and for “The Fifth,” he will create a video about a woman with a flower in her hand, which is a reference to the Spanish painter León Administrador, who is credited with creating the first virtual reality video.", "The next Biennial should begin in 2022 and will focus on the DNA of new visual art and its relation to the history of art. Top priorities will be to create a period exhibition that bridges the contemporary and the past, and to present biennial on the way to a new kind of museum exhibition. The theme will be “Art and the Future of Anthropology” and will be curated by H. Allen Shaw and will be organized during the year 2020. The second Biennial will be held in 2021. Both will be on view in the museum’s new large auditorium. A third Biennial will take place in 2022 at the Village of Kulm in Russia.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is planning to close indefinitely as a result of the coronavirus pandemic. In a letter to the public, the institution said that it is “working towards a long-term plan that will preserve the museum’s mission, balance the financial impact of its closure with the need to support the important and transformative work of our collection and staff.”The letter said that MoMA is “moving toward a new chapter with a new director, which will take the long-term view and", "The next Biennial should be staged on the occasion of the centenary of the outbreak of World War I in September 2020. Roland Schubert, director of the Göteborg Biennial, said: “At the moment we are feeling the most fragile of all times, but art can and must open up new windows and new perspectives. We are determined to continue our work as a model for how a biennial can work, how we can be at once critical, celebratory, and playful.”The 2019 biennial, “Introit 3,” was organized by the Institut Internationale de Démographie (ID) in Paris. It was curated by Jean-Pierre Vidal, director at the Type Museum in Paris, and was supported by funds from the French Ministry of Culture and the Institut National de l'art et de l'histoire (INAH), the French Ministry of Education, Culture and Sports, and the Bertrand Goldberg Foundation. \n\n\nNew York’s Metropolitan Museum of Art has received a gift of more than two hundred photographs by American photographer James Conlee, one of the earliest known of the American landscape photographers who are celebrated for their intimate portraits of iconic figures whose portraits are", "The next Biennial should take place in 2021, and will aim to present, by a group of South American curators, a major new exhibition that will include the work of twenty-four artists. Returning to the project will be the Ricardo di Ricci and Torsten Dreher, who curated the exhibition “2016: The Art of László Mapin” (2018–19), and partners such as Ujaz Harsha, Zoya Siiša and Artsijña Pindell, and Kunsthalle Basel.The event’s curators also had an announcement about the 2019 edition of the Golden Lion Award, which will be held at the Museum of Contemporary Art in London, on June 18–June 19. The four participants were Jorge Akpom and María Elena Pérez, who will receive the prize in August.The 2018 edition of the prize was held in the West End of London, on May 28–May 31. The 2019 edition is scheduled for June 9–June 15. The full list of awardees is as follows:Karnataka Thiruvallivar (India)Amit Goel (India)Akram Ghani (", "The next Biennial should be held in 2021, and the first in 2022.The Biennial was established by the Swedish Museum of Modern Art to promote the history of modern art and to commemorate the opening of its new building in Stockholm. The institution will present two artists’ works in each exhibition. In the first exhibition, Tania Bruguera will present a multi-dimensional painting\u0097a narrative on her life, her work, and the relationship between self and other\u0097in a gallery-like setting featuring live music and performances. In the second exhibition, the artist will perform a scene from her 1961 performance film The Woman in the Window. The exhibition will also be hosted by a selection of the artist’s other works, including The Body in the Window, 1981, with Sigrid Van Doren; This Room, 1981, with Nina Turk; and The Night of the Wolf, 1961, with Eva Schlesinger.The Annunciation Museum in New York, which also recently celebrated its thirtieth anniversary, is also planning to reopen in the summer of 2021, and will host a second exhibition, from June 22 to June 25, 2021, at the institution. The exhibition, titled “The Cat", "The next Biennial should take place at the Stedelijk Museum in Amsterdam in February 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it will postpone the next edition of its Museum Mondrian, which is currently on display in the exhibition hall of the Museum of Modern Art (MoMA), until at least the third quarter of 2020. The statement comes on the heels of a report by the Art Dealers Association of America (ADAA), which found that museum attendance declined 11.3 percent in the first three months of the year.“The third quarter of 2020 saw a decline in attendance of 13.9 percent, the steepest decline since the 2008 crisis, and we are witnessing the worst winter since records have been kept,” said Adam Gidley, president and CEO of the ADAA. “The primary culprits of decline are theatergoing families, falling ticket prices, and the use of online viewing rooms, which are already causing a disruption in the industry. We are continuing to monitor trends and conditions with our members, and will make our recommendation on when the 2020 event may be held accordingly in the spring.”In an attempt to contain the Covid-19 pandemic, MoMA", "The next Biennial should mark the twenty-fifth anniversary of the institution’s founding, among other milestones, with a presentation of the works of its most celebrated artists, including Frances Adams, Vincent van Gogh, and Jan and Marc Emmel, and the exhibition of the work of one of the country’s most eminent female artists, the great Louise Bourgeois. Following the completion of the first Biennial, in 1986, the museum moved from the old building on West Twenty-Third Street to a new home on Midtown East. The museum is currently undergoing a $1.25 billion expansion, which is expected to be completed by 2022.\n\n\nNew York’s Metropolitan Museum of Art, which was forced to move the exhibition “City of Ruins” due to safety concerns, has announced that it will now stage the exhibition in the summer of 2021. The institution, which has been temporarily closed since March 21 due to the Covid-19 pandemic, said that it chose to postpone the event until the end of the year as it continued to gather information on the health of the art world. “The art world has been particularly vulnerable, both physically and financially, since the pandemic began, and now we", "The next Biennial should take place in the spring of 2021. In addition to new works, a collection of the biennial’s past exhibitions, “Art of Life: Two Biennials” (2017), “Art of Life: Three Biennials” (2019), and “Life Among the Trees: Two Biennials” (2017) are planned.\n\n\nThe Stockholm International Center for Contemporary Art (SICA) has received the $4.2 million prize in recognition of its commitment to the promotion of works by contemporary artists. The Swedish Foundation for Contemporary Art (SIF) and the Swedish State Foundation for Children (SIV) have decided to jointly award the prize to the SICA as well as the Swedish National Museum, the Skåne Museum, the Stockholm Folk Museum, and the Royal Academy of Fine Arts. The announcement follows the Academia Diálogos’s initiative to publicly fund the exhibition of new works by mid-career artists.“The award of the Swedish Foundation for Contemporary Art’s conservation prize is a meaningful gesture for our artists and an important step in their way of establishing careers in the art world,” SIF", "The next Biennial should be held in the year 2021. \n\n\nIn a recent review of The Good Shepherd: A Fantastic Journey by Hayley Bernhard, Juliette de Beauvoir and Hannah Wilke of the Los Angeles–based nonprofit Stonehenge, the Museum of Contemporary Art (MoCA) in Los Angeles County is listed as having lost $50 million in revenue since it closed to the public in March 2019. The loss of revenue has been attributed to several factors, including low attendance, deterioration in the sales and marketing of the work by the artist, and a delayed renovation of its former campus, as well as to the severe weather events that have struck the region.The news comes amid the ongoing crisis caused by Covid-19, which has ravaged the United States, Europe, and parts of Asia. Since March, approximately seventy-four cases of the virus have been confirmed, and the number of cases in the United States has surpassed the total from any other country in the world. According to the New York Times, the number of cases in California is now at least 1,400 and counting. As of Tuesday, there are more than 6,300 cases in the United States, and the death", "The next Biennial should be held in 2022, but the organizers are not ruling out a 2020 reopening date. Dorothy is asking for $3.5 million to redesign the event. The exhibition will be relocated to the Hudson Yards art district and will be hosted by the museum from June 2 to June 4, 2022. The museum will invest $3.5 million into the redevelopment of the site and will relocate the exhibition from its current home on East Seventy-third Street to a new, expanded space in the center of the museum. The museum’s current exhibition, “South on the Run,” will return in early 2021. The exhibition will highlight the work of contemporary artists in a project by architect Kiki Smith.\n\n\nThe Hauser & Wirth Kunsthalle Berlin has received a major gift of twenty-one works from the collection of German artist Christoph Hauser. The collection includes works by the German and English-born artist, including Avant-Garde pioneer Hieronymus Bosch (1933–1982), Austrian painter Rudolph Brüssel (1927–1983), and German architect and theorist Art von Kleist, who designed the VU Berlin in", "The next Biennial should take place in 2020, with the aim of maintaining the twenty-year vision for the exhibition. \n\n\nCultural historian, author, and critic Peter Hitchens, who pioneered the theory of postmodernism and advocated for the abolition of religion in public life, died on December 28 at the age of eighty-eight.Born Peter Hitchens in London in 1942, he studied philosophy at Cambridge University, then worked at a time when modernism was still at its height, before he joined the BBC in 1977 and became a writer and critic.Hitchens’s numerous books include The God Delusion (Cambridge University Press, 1974), which was nominated for a Pulitzer; Postmodern: Design and Reality in the Modern World (Yale University Press, 1989), which won the James Cuno- and Mary Boone Award; and the Future of Man: Evolution from Evolutionary to Ecological (Yale University Press, 2000), which was included in the Oxford University Companion to Art, the J. Paul Getty Memorial Art Prize, and the International Museum of Art. His later works include The Death of Modern Life: The Design of Modernity in Art and Architecture (Yale University Press, 2002), which was included", "The next Biennial should take place in 2021, with the opening of the exhibition “The Neuroplasticity of Women,” said Ricardo Pérez, director of the Biennial de Estudios Artes.\n\n\nThe National Ballet of Canada has announced that it is working with the Canadian Institute of Contemporary Art (CICA), which was recently restructured into a new organization, to establish a new $1.6-billion fund to support the future of the institution. The fund will allow the CICA’s arts sector partners to receive up to $1 billion in support of the creation of new works, including performances and residencies.CICA’s current grant program, SOUL, has awarded $687 million since it was founded in 1994 as a way to organize the CICA’s annual ballet awards. The fund is currently seeking applicants for a new grant program that will also help the CICA’s arts ecosystem address the climate emergency.The news follows a recent wave of climate activism in Canada, where activists have been protesting the institution’s plans to move its annual February 13-March 7 show, “The Climate March,” to take place in March. The", "The next Biennial should examine the relationship between the Black Lives Matter movement and the criminal justice system in the United States. The 2020 edition will examine Black and Indigenous populations in the United States through an Indigenous perspective.Commenting on the 2020 edition, Laura Miller-Parry, the former executive director of the Black Arts Collective, said: “We are thrilled to be working with the organizers of the annual Black and Indigenous Art Biennial to present the next iteration of this year’s exhibition in London. The themes this time around are much more relevant, and we look forward to featuring work by artists who reflect on the current climate in the UK and the world internationally.”\n\n\nThe Chilean artist and filmmaker María Berrío, who often photographed and animated his subjects, has died at the age of eighty-two. Berrío’s work, which often explores the role of color in our world through photographs and animation, has been featured in the following exhibitions since its debut in El Pueblo in 1971: “Paso-Ricardo” (1975), “The Color of Life” (1976), “The Color of the Night” (1977), “Vision of a Woman�", "The next Biennial should be held in 2020. The biennial will take up themes such as human rights, migration, and climate change. \n\n\nThe French literature scholar and academic Laura Owens-Boye\u0097who drew attention to the ways in which the art of the university level was compromised and subsumed by unaccountable administrators\u0097has died at age seventy-nine.Born in New York City in 1944, Owens-Boye studied at the School of Arts and Design in London, the School of the Art Institute of Chicago, the School of the Fine Arts in Paris, and the Sorbonne in Paris. She also worked as a professor at the University of Chicago and served as dean of the school of the Arts for the Arts in New York. In 1983, she founded the University of Virginia, and in 1998, she was awarded the Presidential Medal of Honor. In an interview with the New York Times, Owens-Boye said: “The University Art Museum in Washington, DC, was a kind of a home for my work. They invited me to speak at that institution. I did not object. I simply refused to speak at that institution.”The scholars who spoke at her institution include Guillaume Fayot, who", "The next Biennial should be held in 2021. The exhibition will be directed by Saint-Étienne Toguo, with the curators Michel and René Zola, and will showcase the work of artists whose work has been published in the current volume of the Biennale d'Art Contemporain.“The exhibition is a reflection of the show of art, which will be inaugurated by this year’s edition, which is against the backdrop of our shared history,” said Serge Proch, the director of the Biennale de Lyon. “It is a work of an artist who has created something new and new works.”The exhibition will also feature the work of German born artist Radek Gebre Selmy, whose paintings are collages, sculptures, drawings, and photographs, and will be presented as the work of the artist who created them. He will serve as the subject of a show of work in the forthcoming biennial in Shanghai.Nathan H. Sherwood, the director of the Whitechapel Gallery in London, said: “This is a very special exhibition. Biennale de Lyon is renowned for its internationalism and for its dedication to the vision of its", "The next Biennial should be held in 2021, but the task of choosing a new host city has also been postponed. In a statement, the Biennial said: “We are not able to put together a choice that does not involve a city in a year when the vital links between the city and its biennial are being lost. ”All of the pavilions on the first floor of the building where the exhibition will be held are currently closed. The Biennial has confirmed that the event will be held in the building and is working to find a new venue for the event.\n\n\nThe nineteenth edition of the Los Angeles Biennial, “Los Angeles 2020,” has released its final list of artists who will be featured in the exhibition, which will return to the city’s West Coast waterfront in 2022, and announced that it will now be held at the Los Angeles County Museum of Art (LACMA). The move follows the announcement last weekend that the exhibition will move to the new site, which is currently under construction, the Los Angeles County Museum of Art (LACMA). The May 16 preview event, “Los Angeles: The Centennial,” was one of three events leading up to the announcement that the", "The next Biennial should be held in 2021. The ultimate goal is to create a permanent work that will be located in the center of the city of Biage and will serve as a permanent reminder of Biage’s history.\n\n\nThe Museum of Fine Arts (MFA) in Philadelphia has appointed Jacquelyn Hillcrest as its new board chair. She succeeds Raymond Adler, who has served as interim chair since October 2020, and will take up her new post in January 2021.“Jacquelyn is a highly respected and talented scholar who has built a successful career at the MFA by furthering the intellectual and artistic mission of the institution,” said MFA director Christopher Bedford. “She is a tireless supporter of the museum’s work in the field of contemporary art, and she has been instrumental in strengthening the museum’s reputation as one of the preeminent centers for the study of contemporary art in the United States. We are thrilled to welcome Jacquelyn to the MFA’s board.”A professor of art history and public art at the University of Richmond, Hillcrest is a cofounder of the visual art and design studio Bancroft & Bao, which", "The next Biennial should take place in 2022.\n\nThe city decided to postpone the event in March of 2020 following the sudden death of its namesake, Dr. Albert Camus, due to a brain aneurysm. The museum reopened in June, and in July, the museum gave the public a private tour of its newly renovated headquarters. \n\nAdvertisement\n\nExhibitions in the city include “In Praise of Art” (2019), an exhibition of works by Marcel Proust; “Exhibition: '1-800-273” (2019), a presentation of work by Mark Haddon; “The Crucible” (2019), a presentation of works by Hans Ulrich Obrist; and “Oddity” (2019), a retrospective of paintings by Patricia Albi and Gregor Gysin.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Luke Turner as its next president and CEO. Turner joins the institution from the Metropolitan Museum of Art in New York, where he has served as board president since 2013. He succeeds Matthew Teitelbaum, who has served as deputy director of the museum since 2016, and will assume his role in January 2021.", "The next Biennial should be held in the spring of 2020.\n\nEileen Darnell, chairman of the museum, said: “We are pleased to see the exhibition continues to grow and become a well-loved and esteemed landmark in the city. With the passing of the great Maurizio Cattelan and with his outstanding collection, the Biennial was born. We are looking forward to the 2020 edition and to engaging with the local community through a new exhibition and programme.”\n\n\nThe estate of the National Galleries of Scotland (NGA) has announced that the institution will shutter its tourist-oriented space in Portadown, Scotland, effective March 16, 2020. The NGA, which has been operating in the capital city since 1926, is currently undergoing a major renovation, designed by British firm Gensler, which is scheduled to be completed in 2022. The project, which was partially funded by the National Lottery Heritage Fund, included the restoration of the NGA’s old building as well as the installation of new exhibitions and public spaces.“The restoration of the NGA is an incredibly exciting time for the family, particularly with the upcoming reopening of the National Museum of Scotland and the establishment", "The next Biennial should take place in Tokyo, Japan, during the year 2020. The Exhibition will be hosted by Tokuyo K. Fujii Gallery at the Tokyo Metropolitan Museum of Art, and will take place at the Tohoku Museum of Art in Yokohama. Earlier this year, the museum also commissioned Daniel H. Garcia to create a new work from the series “Para Nara” (The First Time I Saw It),” a series of photographs by the late Venezuelan artist Juan Pablo Picasso, which are currently on display in the museum’s collection.\n\n\nThe Tate’s board of directors has approved the appointment of a new chairman and CEO, Antony Jenkins. He will be sworn in by the Queen on July 1.After an extensive search, the board voted to appoint Jenkins, a director of the Tate’s London and Latin American branches, as chairman. It also chose to give him the authority to appoint a chief operating officer (COO) and a senior business development officer (CADO).“This is a moment of great change for the museum, and it is an exciting time to welcome into the board and to have Antony Jenkins onboard as chairman and", "The next Biennial should be staged in the fall of 2021.  The exhibition is currently on display at the Museum of Modern Art in New York. In addition to the museum, the institution houses an extensive collection of Monet’s paintings and drawings.  \n\n\nThe National Museum of Fine Arts (MoFA), in Washington, DC, announced on Thursday that it will open a new iteration of its National Gallery of Art, a historic arts and culture institution that has served as the home for more than two thousand works since it was founded in 1819. The new museum will be inaugurated by the painting of a monument to the Confederacy in honor of the thousands of African Americans who were killed at the hands of the Union during the American Civil War.The history of slavery in America is well documented, and the institution was not able to locate a single work by a contemporary artist whose work commemorates the Confederacy. New works by artists such as William Kentridge, Ian Cheng, and Tanya Martinez-Williams will showcase the Union’s role in the “extermination of an entire people.” The show “Slavery: The Untold Story” will include works by twenty-eight artists, including John Akom", "The next Biennial should take place in 2020. In a letter published by the biennial’s artistic director, Paul Mpagi Sepuya, the curator of music, Ntİbala Mpagi, said: “We are eager to explore new ways of representing the exhibition’s original vision.”The biennial will have its inaugural exhibition in the Americas in 2020 and will present a landmark exhibition of works by two artists who were at the epicenter of the Nakuru outbreak: Nari Ward and Edward Kmett. The full list of exhibitors is as follows:Annie Hall, Peterlich & Muzik, New YorkKunstraum GmbH, BerlinSara Schipper Gallery, New YorkSarah Sze, New YorkSamantha Schubert, New YorkSheryl Sandberg, New YorkCarleen Scudder, New YorkArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScienceArtScience", "The next Biennial should be held at the Museum of Fine Arts in New York in 2021. \n\nBeginning next year, the National Museum of Fine Arts (NMFA) in Athens will launch a programming initiative aimed at bridging the cultural gap between the two cities. Dubbed the National Bardo, the program aims to provide a platform for the exchange of contemporary art and ideas, and will focus on building a collective memory of the city’s ancient monuments.“This is an opportunity to build a new bond between Athens and Berlin, and we hope that it will inspire you to go there on a deeper level,” said museum director Susana Vassale. “The project will be a testimony to the city’s spirit, a process of responsibility and responsibility-taking, with the aim of presenting pieces that reveal the latent spirit of the city, and of reopening old wounds.”The project, which is modeled after the National Humanities Biennial, will offer more than 2,000 works by twenty-one artists, including David C. Driskell, Sofia Gaillard, and Zina Saro-Wiwa, for a series of five events in 2020. The works will be presented in a historical setting", "The next Biennial should be called off in the next three weeks, said one festival insider, since the organizers are concerned about the staggering number of illnesses and deaths related to the coronavirus. “This is an emergency and we need to act now.” The annual Mali Biennale, which was supposed to begin on February 22, has been canceled due to the coronavirus, and artists have since been forced to cancel their shows. The United States Pacific Northwest Film Festival, which was scheduled for March 4–March 7, has been suspended and is expected to be canceled as well.  The New York Film Festival, which was scheduled for March 19–March 22, has yet to announce a date for its 2019 edition. On March 2, the New York Philharmonic canceled its March concert and moved the event online, bringing the February event—which drew an attendance of 5,400 people—back to the city and its suburbs. Organizers of the New York Film Festival have yet to respond to requests for comment.\n\n\nThe Los Angeles County Museum of Art (LACMA) has revealed that it will introduce a new format for its annual Dominion Spring/Fall exhibition, “The Adventures of Dandene", "The next Biennial should be held at the Experimental Art Museum, in New York, in 2023. Think of it as an extension of the Museum of Modern Art, in New York, and of the Metropolitan Museum of Art in New York. I am optimistic. The future is bright.  Richard Wright, ArtNet, January 22, 2022\n\nJohn Akomfrah, the founder of the American art-world complex the New Museum, has announced that he intends to leave the institution by the end of the year. “I believe that the series of events that has led to the present situation is a terrible accident,” Akomfrah told Artnet News. “I wish I was a better manager and a better engineer, but the hard truth is that I’ve been doing my best to get the New Museum through this. I’ve been very successful at attracting the most talented people to New York, and I wish that I could have done more. But I can’t.”The news comes two weeks after the institution received a major blow when it announced that it is currently undergoing a $1 million renovation that will require the removal of the museum’s existing structures and will", "The next Biennial should take place in 2022 and will replace the ten-year event, the first in the city for following the first world war. A selection of seventy-five works by women artists will also be featured in the exhibition.The Los Angeles County Museum of Art (LACMA) announced its representation of the Brooklyn-based artist Christine Ogilvy, who draws from African American and colonialist narratives, including her own, for the second edition of the Ogilvy African American Art Museum in Queens. The event, titled \"Basketball: Politics, Science, and the African Diaspora,\" will run from March 22 to March 26. Ogilvy said: “I am thrilled to represent an artist whose work brings her contemporary, unprecedented visions of art and culture to life. It is a privilege to represent her and to share her work in this way.”Ogilvy is best known for creating works that examine the relationships between black artists and their artistic communities. Her paintings, which often reflect the lives of her subjects and often feature references to the experiences of her own family, often feature the bodies of black women and often feature captivatingly beautiful paintings that incorporate everyday objects such as jewelry, art,", "The next Biennial should be held in 2022.\n\n\nThe Art Newspaper, a leading art and design publication in the UK, has announced the winners of its 2019 awards: The Harry Perkins Fund for Art and Design (HPP), which honors early-career artists; the Simon Rich Fund for Art and Design (SRC), which honors established and emerging artists; and the DGA Award for Visual Art, which is given annually to a U.K. artist.The awardees were chosen from a pool of twenty-eight artists who were nominated by a jury comprising David Adjay, director of Tate Britain; Kate Reynolds, managing director of the DGA; Kim Stanley-Track, a curator and critic at SRC; John Walker, director of the Royal Academy of Arts; and Anna Atkins, director of the DGA. The jury was led by Mark Shamlop, director of the Royal Academy of Arts.HPP named the first awardee, the British artist and director James Turrell, whose work exhibits an emerging and diverse range of experimental styles. His work, which is currently on display at the American Association of Art and Architecture, will be featured in the upcoming exhibition “From Art to Art,” which will run concurrently with the bi", "The next Biennial should be held at least twice a year, in the spring and fall. The first Biennial was held last fall and will continue to be held in the spring.The theme for the next edition is “Fear and Loathing in Art” and will be a reflection on the history of art. Dr. Sidney M. Maxwell, president of the American Museum of Natural History, Boston, and a former chairman of the board of trustees, said: “I have long believed that the exhibition of art at the museum is the greatest public demonstration of its value to society. We are thrilled to realize that Leonard Peirce’s biennial will address these themes in an artist’s studio, and will include the very works that inspire it.”Peirce originally conceived of the museum as a series of small, artist-led spaces that would showcase works by thirty-five contemporary artists. In 2002, he sold the entire collection to the American artist and philanthropist Arthur Marciano. Since then, the collection has expanded to include works by fifty-three artists and is currently housed in the Peirce Center for Art. \n\n\nThe National Gallery of Art has appointed Elizabeth Shusher as its next", "The next Biennial should conclude in January 2020 with the construction of a new, internationally recognized museum. The museum will also host a series of exhibitions centered on the life and work of Henri Matisse, with a formal opening planned for December 2021.The institution’s current collection comprises approximately three hundred works, most of which were created during the artist’s lifetime. The museum is currently working on the final designs for a new collection, which will be unveiled sometime between March and May.\n\n\nIn the ongoing legal battle between the heirs of Gustav Klimt’s iconic nude painting The Burning Night, whose distinctive holly walks have adorned the canvas and begun the iconography of the piece, a German federal court has ruled in favor of the artist’s estate. The court found that the heirs lacked standing to sue over the work’s destruction by a judge after Klimt’s heirs filed a countersuit in 2015.The heirs had claimed that a collection of Klimt’s nude works, which are currently housed in the Kunsthalle Basel in Switzerland, was stolen from the artist’s estate and that the painting should be returned to Klimt after he died in 1957. They were also seeking the", "The next Biennial should be held sometime between April and September 2020. If the event is cancelled, the final exhibition will be staged in March 2021.\n\n\nThe Smithsonian American Art Museum (SAM) in Washington, DC, has received an unexpected gift: the remains of a nineteenth-century American painting by Thomas H. Price, a convict who was executed in 1892 for the rape and murder of a pregnant white woman. The work, titled The Innocent Victim, is one of several works by the artist whose iconic black-and-white portraits of innocent victims serve as a prominent touchstone in the narratives of his works.“Price’s work has been misconstrued by some to suggest that he was a racist,” said museum director Michelle Washington. “We acknowledge his contributions to American art and his important role as a pioneer whose influence continues to shape the American landscape. However, we believe that having the works in the collection of the museum is a tribute to Price’s enduring influence and the impact his work has on American art and modern art.”The works date back to 1872, when Price was just eighteen years old, and are housed in the collection of the Thomas H. Price, Jr., and Elizabeth Price,", "The next Biennial should also include an introduction of the new theme “Imagelessness” and will focus on the concept of the Imaginary and how it can be used to address issues of our time. The theme will also be an attempt to reflect the changing face of life with the introduction of new ideas and new ways of thinking about the world.“Last year we decided to release a new exhibition every other year, but the trend is for smaller exhibitions to appear more often,” said David G. Feldman, chair of the trustees. “I’m grateful that we were able to make this decision. I know that this will allow us to bring talented artists and artists-based initiatives the attention they deserve.” \n\n\nThe Museum of Fine Arts (MFA) in Boston has released the list of forty artists who will participate in the biennial “When Futurism was a Thing,” which will run from March 15 to March 20. Titled “In Riot,” the exhibition will feature work by several hundred artists who were inspired by the current political situation through the moods and sounds of the city during the riots of 1968. “In riot,” will be", "The next Biennial should take place in 2020. Tudor: The Next Generation will be presented by the Museum of Contemporary Art, New York. The new exhibition will feature approximately 150 works by fifty artists currently on view at the museum. “The next edition of Biennial will represent a new body of work by a remarkable group of artists, for a new generation, who are united in their desire to shape the future,” said Marlene Teitelbaum, president of the Biennial Foundation. The Biennial will be hosted in the newly renovated and recently renovated Whitney Museum of American Art. Its inaugural exhibition, “The Frugal Years,” will be on view until October 13.\n\n\nThe Neuer Berliner Zeitung (DBZ) has initiated a new endowment campaign, in support of the museum’s new acquisition, “The Future Is Present,” which was recently acquired by the museum for $10 million. The retrospective, which explores the history of the Contemporary Art and Design in the German city, was commissioned by microphotographer Martin Biesrami and his wife, Katja, and stars American artist and activist Vivian Biesrami, who created a graphic novel", "The next Biennial should be around the same time as the upcoming edition of the FIM World Championships in 2019, and will focus on a new generation of street performers in Paris. The biennial will focus on issues such as the crisis in Venezuela and the refugee crisis in Europe. “In France, the next edition of the FIM World Championships will be August 27–August 28 and will take place in the capital, Paris, in the city of Charleroi, the former district of Paris-Rémi-Dorart,” Jean-Luc Malingue, the president of the FIM, said in a statement.\n\nThe Robert Anton Wilson Foundation has awarded the University of Minnesota $102,000 for its collaboration with the New York–based nonprofit Access to Art, which aims to advance the understanding and appreciation of art through partnerships with institutions and individuals in the cultural and academic communities, and is increasing its endowment to $200,000. The foundation will give $100,000 to nonprofits working on campus revitalization and $150,000 to artists and their organizations.The Mankato Arts Council was given $100,000 to support its mission to foster and extend the visual and performance experiences of students at the Institute of Art", "The next Biennial should take place in 2021. \n\nThe museum has declined to make any further comment on the inquiry, which will be conducted by the Danish philosopher Anders Eriksson and the Danish artist Rasmus Østbye, and is planning to hold an open forum on the exhibition in the autumn of 2020.\n\n\nThe late British art historian Ian McEwan has been awarded a £63,000 ($95,000) British Museum (BMA) commission to create a new work commemorating the centenary of the British Commonwealth. The work, entitled The Atomic Years, will be based on a six-hour performance, The End of Days, that was filmed on location in the BMA’s new building on the grounds of the museum, and will be exhibited in a long-term project, “The Future of Art,” in November 2021. The work will also be included in the museum’s upcoming exhibition “The Needle in the Haystack: British Art in the 1960s” which opens on March 28.The BMA has been working on the project for more than a year and was given the green light by the museum in January 2019. Since the installation closed in March", "The next Biennial should be held in the spring of 2022. \n\n\nThe New York–based nonprofit Art Fund will grant $2.5 million to twenty-five artists in forty-eight cities, including New York, Philadelphia, and Seattle, as part of its new $2.5 trillion Art Fund Challenge, which will examine the effect of art on the American landscape. The theme of the 2020 edition of the National Geographic Artists’ Annual Awards, which will take place at the National Geographic headquarters in Washington, DC, is “Art and the American Experience.” The 2020 awards will honor those who have made significant contributions to the arts in 2020 and will provide a platform for the advocacy of artists.Among the thirty-six artists chosen for the 2019 fellowships are Michael Chabon, Andreas Eriksson, Jody Rogac, Yoshitomo Furukawa, Eyal Izzati, Agnieszka Laskin, Javier Piñero, Claudia Rosales, Raja Telgemeier, Laurie Stricker, and Natalie Kantor. The 2019 awardees are: Michael Chabon, Paolo C", "The next Biennial should focus on contemporary art and design, research critical ideas and social issues in art, design, and design, and, finally, the exhibition of works in a joint exhibition. The Biennial of Modern Art is currently on view through March 20. The 2019 iteration was curated by Naima J. Keith, who served as curator of the Biennial of Fabrics and Fine Art from 1989 to 1992.\n\n\nAfter a battle between the artist-run nonprofit the Animal Liberation Front (ALF) and the New York City Department of Cultural Affairs (DCLA), which lasted more than six weeks, the Animal Liberation Front was awarded a permanent injunction in federal court on March 6. The organization was not granted one by a judge, but the injunction prevents the city from demolishing the two-story structure it has occupied since 2009, and forces the city to reconsider its plans to raze a forty-four-foot-wide section of the former Hudson Yards site and begin the construction of a massive new building.The DCLA, which is run by the city, argued that the ALF’s plan to remove the sculpture by artist George Gerscher and the ground-floor portion of the new building, which is slated to open in 2021", "The next Biennial should be staged in 2022, with the first iteration of the exhibition held in Helsinki. The biennial will be the fifth iteration for the Helsinki Architecture and Design Biennial, which will run from April to October 2021.\n\n\nThe Jersey Museum in New York has issued a temporary closure to its upcoming exhibition “The New York Trilogy,” which was to open in September and run through March, and is working with the team behind the project to find a new space to hold the exhibition. The exhibition, which features works by eighty-four artists (excluding Laurens, David H. and Howard Shore, Jr., and João M. Pires), was rescheduled for March 28–May 18. “The team’s decision to postpone the show was made after careful consideration, which included a thorough review of the forthcoming exhibition and of the exhibition’s performances in recent months, which they felt would be particularly relevant to New York City,” said Maureen Kennedy, director of the museum. “The decision was made in light of the recent terrorist attacks on our city and the ongoing threat of terrorism in the United States. We are committed to all of our guests, and we will", "The next Biennial should take place in 2019, the Biennial Manifesto states: “The next Biennial should take place in 2019, the Biennial Manifesto states: ‘I am still here. I am still here, and I will keep on being. ”The committee appointed by the mayor to oversee the construction of the museum, which is currently being built on the site of the former headquarters of the Detroit Institute of Arts, said in a statement: “This is an exciting time to be working with the Detroit Institute of Arts. Its rich collection of American art, reflecting a diverse and exciting history, provides an ideal setting for the long-term exhibition program.”\n\n\nThe Indianapolis Museum of Art (IM), the city’s oldest and most prominent museum, has appointed Kris DiGirolami as its new executive director. DiGirolami comes to IM from the Cleveland Museum of Art, where he has served as deputy director for exhibitions and curatorial affairs since 2015. He succeeds Lenny Bienstock, who will retire in December 2020 after a decade at the helm of IM.“By taking on this new role, Kris is able to expand and deepen the scope of his work as an independent curator", "The next Biennial should be announced in the next few weeks and will take place in Helsinki, Finland. “The future of art is at the centre of our collective and international life,” said Sara Cwynar, chair of the board of trustees. “We are delighted to continue to support the board of trustees and the artists whose work we have long admired. Together we will continue to be a champion for the more than 130,000 artists who live and work in London and will continue to be inspired by the great artists of the British Commonwealth.”The biennial will draw from the collections of the museums of the British Commonwealth in order to present the full range of the arts in one place. It will feature collaborations between artists such as Adele Kornfeld, Cherie Gordon, Jennifer Hughes, Glenn Ligon, Hannah Newby, Andrea Dutton, and Edinburgh-based artist Tania Bruguera. “We are thrilled to work with the artists we admire, who have made and continue to make lasting contributions to the British Commonwealth, and are proud to create a new exhibition devoted to their work in 2020,” said Museum Director Maria Bocca.", "The next Biennial should be the event that brings together artists from the Philippines, Hong Kong, India, and Korea to form a new generation of Filipino artists,” said oversight committee cochair Salome de Dios, chair of the committee. “We look forward to the project, the exhibitions, and the performances that will be created by this new generation of Filipino artists.”The biennial will be staged at the MCA from January 19 to January 23, 2020. The event will be hosted at MCA Annex, the MCA headquarters in the capital of the Philippines, Clandestina, since 1997. Its inaugural exhibition of works by artists from the Philippines will be staged at the MCA in May 2020 and will open to the public on January 22, 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has received a major rebuke from the ACLU of Northern California after it published a statement this week criticizing the city’s decision to dismantle the notorious Rikers Island jail complex in exchange for the release of two low-level, nonviolent offenders who were serving time for nonviolent crimes, including assault and robbery.The statement, penned by ACLU of Northern California legislative counsel Jennifer Teets, accused the city of bending", "The next Biennial should take place in 2021 and will be staged at the Museu de Arte de São Paulo, the Museum Paraça, and the Museu de Arte de São Paulo.  \n\n\nThe Library of Congress has released the list of the seventy-six artists who have contributed to the landmark exhibition “The Grand Tour: Artists and Art” (1967–1972), a major exhibition that explores the history and practice of the art of the Grand Tour and compares the art created during two separate but related periods of Dutch history. The institution also revealed that it is now accepting submissions for its 2019 edition, which will run from January 3 to January 6, 2020.The exhibition, which took place at the Museum of Modern Art in New York from January 24, 1967, to January 25, 1970, was organized by Antony Hudek, who served as director of the Museum of Modern Art from 1982 to 1996 and was followed by a series of exhibitions at the Museum of Modern Art in New York, the Metropolitan Museum of Art, and the Museum of Contemporary Art, San Francisco. The subject of the next show is “Klaus von Santerne” (2019). The 2019 edition of “The Grand Tour�", "The next Biennial should focus on the critical role of art and design in shaping and defining the contemporary world. The first section should focus on the relationship between art and engineering, with the second section addressing the relationship between art and technology and how those technologies could shape and define the future.The Short-Forms will be curated by Artnet journalist and Bay Area native Lauren Oxtoby, the founder of the popular blog Artnet; Simon Creed; and Rebecca Miller, a curator and founder of SFX Art. The artists selected for the first edition, which will take place in the City of San Francisco, will each receive $25,000. The second edition, which will feature the work of sixty artists selected from twenty-five countries, will be held at the Institute of Contemporary Art (ICA) in London in 2021.\n\n\nThe Toronto-based charity artworks, which is working to raise funds for the Toronto Art Gallery (TGA), has announced that it is raising funds to aid the TGA through the closure of its storefront locations—TGA at 65 Dundas Street West, a former police station, and the TGA at 855 Yonge Street, a former storage facility for artworks—as well as through the restructuring of its business model,", "The next Biennial should consist of a lecture series, an exhibition, and a biannual collection survey. The 2019 event is scheduled for March 6–March 7.\n\n\nThe Museum of Comparative Art (MCA) in New York City has received a $500,000 donation from the donors of the Phyllis and Leonard Gilbert Collection. The gift comes in the form of an endowment in support of the museum’s conservation efforts, which include the collection of fifty works by thirty-two artists. The gift also includes more than 1,500 individual photographs, many of which have never before been viewed by the public.The works, which are housed in the Gilbert Collection in its former home on Eighth Street in Manhattan, were acquired by the museum in 1969. The couple boarded a flight from Paris to New York in 1969 to see the collection’s first exhibition at the Fulton Armory, where the works were organized. The exhibition was a success; the Gilbert’s granddaughter, Anne-Marie, was the winner of the $1,500 Bertrand Goldberg Prize in 1971. The museum also hosted several other exhibitions, including the retrospective “The Hand of Man” (1971); “California Carpenters: Past, Present", "The next Biennial should take place in Shanghai in 2021. The, a joint project of the three cities, will include 120 artists and collectives and will showcase the works of thirty-five contemporary artists. Gillian Taveras, president of the exhibition, said that the event will not be an “imperfect reflection of America’s art tradition.” She added that the event will celebrate the work of American artists, including Will Smith, Jack Black, Frank Malina, Robert Irwin, and Helen Frank, and will be “journeying into the future,” declaring that the theme of the biennial is “how the art of the future will be created.” The biennial will be accompanied by a series of exhibitions, performances, and residencies that will run from March 11 to March 13. The event will also introduce a new series of 130 digital works by the artists featured in the exhibition. Opening the exhibition will be a sculptural rendering by the artist Terri Clark, titled The Moon and the Art of the Moon, which will be on display for the first time in the event’s history. The exhibition will be curated by the artist and curator Clement Greenberg, with curator", "The next Biennial should be held at least a decade from now, the organizers said. The semiannual event, which will be held at the same location as the exhibition, will invite 300 artists from ninety countries. The theme of the third edition of the Leeds Biennial will be “The Present.”\n\n\n\n\n\nPacex ArtCentre, the New York–based nonprofit museum, announced today that it has received a gift worth $70 million from the Michael W. Guggenheim Foundation. The gift includes the acquisition of a new, contemporary-art work, “The Body,” by the artist Kate Crawford, which is on display in “The Body,” alongside works by John Akomfrah, Nari Ward, and Kiki Smith.The gift also includes three artworks that were previously underexamined, one that has never been shown in a public space, and one that is currently on display in the museum. The new works were selected by Sondra M. J. Mertz, the foundation’s president and CEO, from the thirty-two individuals who donated to the organization, which was established in 2000.“This gift is an incredible affirmation of the", "The next Biennial should be held in the spring of 2021.  The institution will also be remodeled in order to accommodate the exhibition. The quarter-meter-wide Biennial Center, which will be located in a former steelworks on the city’s northwest side, will be joined by a larger exhibition space, a botanical garden, and a theater. The amphitheater will also be reconfigured. An additional twenty-four acres of ground will be added to the museum. The architects are proposing to turn the old East Boston Navy Yard into a permanent arts complex with an outdoor plaza. “The design of the new museum sets the stage for the exhibition and retail strategies that will shape the city as we continue to welcome visitors with an open, friendly atmosphere,” said Robert Lanza, chair of the design firm, which was commissioned by the city. “With its new and enhanced interior, the new museum will further distinguish itself from its East Boston neighbors. In addition, the new museum will play host to the city’s largest collection of modern and contemporary art, an expansive video archive, and the city’s largest collection of art from the Americas.” The conceptual design for the museum was made by", "The next Biennial should feature works by artists as diverse as Edward Hopper, Arsht & König, and Franz Kline, as well as works by Jasper Johns, Mark Rothko, and Anne-Christine Florian. The exhibition will return to the Museums House in London in 2021.The Nairobi-born, Berlin-based artist, self-taught, and educator, whose practice encompasses mass painting, sculpture, performance, performance-based work, and installation, was selected from a shortlist of ten artists that included Jen Howard, Kiki Smith, Helen Cammock, Stanton Lute, and Chantal Olivier. The first round of selections was made in May 2017. For the second round of selections, selections were made in June 2019 and June 2020. This year’s ceremony took place at the Museums House in Nairobi.\n\n\nThe Philadelphia Museum of Art (PMA) announced today that it will reopen to the public on September 3 with an exhibition of work by ten artists whose work was featured in the museum’s exhibition “World War II: The Art of Painting” (November 2–September 3, 2019). Editor in Chief Daniel H. Weissman, who has served", "The next Biennial should be held in 2022, Hanneke Petersen, director of the Bauhaus, told the Art Newspaper. The next event, titled “From the Biennial to the Future,” will be held at the museum in early 2021. The museum has yet to announce a date for the opening of the next edition of the Biennale, which will be held in the city of Essen in the state of North Rhine-Westphalia from March 25 to March 28, 2022.  The 2018 edition of the exhibition, “Between the Sun and the Moon” was staged at the Museum of Contemporary Art, Los Angeles (LA), which was completed by the Los Angeles County Museum of Art (LACMA).  The 2019 edition of the exhibition, “The Future is Present,” was staged at the Museum of Contemporary Art, Chicago (MCA), which is scheduled to open by the end of May.\n\n\nNew York’s Metropolitan Museum of Art is planning to hold two exhibitions of works by New York–based artist Michael Renfro—one in 2019, and one in 2021. While the works, which are currently on display in “The Future Is Present", "The next Biennial should be staged in 2020. The museum is currently working on a new physical edition of the show, which will re-create the museum’s historic galleries, a new cycle of exhibitions, and a reimagined public experience for the first time in the museum’s history.The reopening of the museum is part of a larger project to redesign the museum and its contemporary art. The redesign project was led by the firm Koon and Partners, which is now represented by New York’s Museum of Modern Art. The firm, which designed the exhibition spaces, the Bennington Street entrance, the MCA’s Greek Theatre, the Bessie Smith–designed Bookends for the Bessie and Loren Alexander Gallery, and the Arsenale di Somma, was awarded the Prix d’Arles in January.Koon & Partners, which already designed the interior of the Contemporary Art Museum Wittenberg in Germany and the Renaissance Museum St. Petersburg, also designed the Arte Povera, which opened in Rome in 1996, and the Galerie des Beaux-Arts in Paris, the Institut d’Arles du Palais de Moscow in Moscow, the KRAW and the K", "The next Biennial should be held soon.\n\n\nThe Solomon R. Guggenheim Museum has appointed Kate Barlow as its new deputy director of exhibitions. She succeeds Alexander M. Stern, who has helmed the museum since 1984.“Kate is well known in the field of contemporary art and has been instrumental in bringing the Guggenheim’s exhibitions to new audiences through her innovation and vision,” said MnoSara Tschäpe, the Guggenheim’s director. “In addition, she has designed and executed numerous exhibitions that demonstrate the Guggenheim’s commitment to the scholarly field and its collection, while remaining true to its mission of protecting the collections for future generations.”Barlow will assume her new responsibilities on January 6, 2020. During her tenure, she will oversee the gallery’s exhibitions across the globe, including a show on the exhibition of Travis and Annie Lennox’s film The Bad News Bears (2019) at the American Film Institute, which took place in the museum’s former home in the summer of 2019. The show, titled “The Artist’s Home,” will be a biennial", "The next Biennial should be an exciting and challenging presentation of work that will challenge our own preconceptions and our preconceptions are challenged by Biennials. This is a unique opportunity to see how cutting edge art can be used in a contemporary context. We welcome all voices and perspectives; to strive for a spirit of collaboration and to reflect the diversity of our communities.”\n\n\nAn Afghan artist, who was arrested in the attacks on Kabul’s art market on February 6, has won the right to return to the country, the Afghan government announced today. Sarwar Rang, who was released on February 8 after serving one year in prison for his involvement in the attacks, will now be allowed to return to Afghanistan.His wife, Nazar, and relatives received a letter from the federal interior minister, Abdullah Ghani, in which Ghani said that the artist will be allowed to return home once the conditions of his detention are eased. Ghani told the New York Times that Rang’s release is conditional on his securing the release of the other three activists who were convicted of helping the Taliban during the U.S.-led invasion in 2009 and 2010.The activists were convicted of “aiding and abetting terrorism by murder and terrorism,", "The next Biennial should take place in 2021, with a new exhibition curated by Rob Delph. The twenty-fifth Biannual will also be held at the Art Institute of Chicago in 2021.\n\n\nThe Art Institute of Chicago (Art Lab) announced today that the Museum of Arts and Design (MAD), the Shed, and the Art Institute of Chicago are among the institutions that will return twenty-six of the institution’s original works in 2020. The twenty-six works, which are currently on display in a new exhibition titled “Art in Motion,” were acquired through a $25 million donation from Melchior, who first purchased the works through the artist’s estate in 2009. The gift also includes six of the works’ original locations and three pieces that have never before been on display in the United States.“This is a tremendous year for art and we are thrilled that the Museum of Arts and Design will explore all of its new and historic spaces with the full support of the city and state of Illinois,” said Melchior. “We are eager to engage with the public, the community, and other institutions in Chicago as we continue to develop new exhibitions, residencies, programs, and exhibitions", "The next Biennial should take place at the Museum of Fine Arts (MFA) in Boston in 2021. The institution is currently negotiating a new ten-year lease with the city of Boston. \n\n\nArtadia, the contemporary art center in New York City where artworks ranging from small sculptures to paintings and photography are exhibited, has announced that it is closing its doors to new tenants as it continues to work with the city to stabilize the building's roof and make repairs to the building. “The city is working to make repairs that will stabilize the building and prevent it from collapsing, but that is only half of the job,” said Silvia Barba, an attorney who represents the tenants. “The tenants are demanding that the city protect the building and not just fix the roof but to work together to stabilize the entire building.”According to the New York Times, the work of conservators and engineers has not been completed and the tenants claim that the city is not treating the building properly. “They are delusional,” James Clendenan, a tenant in a rooming house in the building, told the New York Times. “They think they are fixing something when in fact they are not.", "The next Biennial should take place in the spring of 2021. The second will take place in the autumn of 2021.\n\n\nThe New York–based nonprofit Meiro Gallery has launched a new initiative to increase the visibility of non-binary artistic and cultural projects in Japan. The initiative, launched in collaboration with the Japanese cultural agency, the National Museum of Fine Arts, and the local Meiro art museum, aims to raise the visibility of projects that are “not self-organized,” such as those that are not based in a cultural center, are not funded, or are not affiliated with an organization. “We are excited that the institution is providing an exhibition dedicated to Japanese queer culture and that the first works on view will be works by artists of color, women, and people of indeterminate gender identity,” said Shannon Taller, the Meiro Gallery’s director and chief curator. “We look forward to working with the artists and organizations and the museum to present this work in our exhibition ‘The New York Lesbian: Art and Lesbian Sex,’ which will open in June.”In addition to the exhibition, The New York Times reports that Meiro will stage a series of exhibitions dedicated", "The next Biennial should take place in 2021, and the first one in 2022. The design of the museum will be based on a new century’s vision for the institution, which will be reworked in collaboration with the Tokyo Metropolitan Government, and will incorporate multi-layered glass sculptures in a mixed-media setting. The biennial will also include a new room for educational activities and a host of new exhibitions.\n\n\nWe are thrilled to announce that these past eighteen months have brought the completion of a major renovation of our modern art holdings in the United Kingdom. The modern art museum at the National Museum of Wales (NMW) in Cardiff, Wales, has completed a major overhaul, which comprises the installation of new works by more than twenty-three artists, including Pedro Andujar, Mary Berry, Robert Irwin, and Marc Jacobs, as well as the reopening of the museum in March 2019. In addition to the renovation, NMW’s current galleries are expanded with new exhibition spaces, and new works by Marianne Boesky, Tanya Gidley, and John Harris are presented in the museum’s vault.“The National Museum of Wales is an outstanding example of how art can transform lives through the", "The next Biennial should be in 2022. The 2019 event, “In the Moment,” was organized by the Minneapolis-based arts nonprofit Kinoza Incubator and drew more than 200 participants.\n\n\nThe Greek Ministry of Culture has postponed the reopening of its newly renovated galleries by the end of the year due to the coronavirus. The ministry announced on March 18 that it expects to begin reopening on August 26. However, the ministry’s director of exhibitions, Nikos Antonakakis, said that the ministry’s current plan is still to reopen the Greek city’s four remaining galleries by the end of August.The Greek culture ministry cited the coronavirus as the reason for the postponement, saying that the work of restoring the galleries would begin in August and would be completed by May 2022. The ministry also said that the forty-third edition of the Olympiad, scheduled to take place in 2020, would be pushed back by two months.The move has raised concerns that Greece will not be able to reopen before the end of the year. The Art Newspaper reports that, according to Eurostat, the Greek economy contracted by 3.5 percent in the fourth quarter of the year, the worst downturn since", "The next Biennial should take place in December 2020.\n\n\nThe Swiss government approved an exhibition of new works by artists such as Pierre-Auguste Renoir, Laure Mille, and Jean-Jacques Rousseau on Monday, marking a major step towards the organization of a major new exhibition of work by the French avant-garde. The event, titled “Pursuant to a New Order” and curated by René Magritte, will be held at the Museum Basel in Switzerland and will culminate with a solo exhibition of work by the artist-in-residence, the French artist Xavien Stegan, which will open in December 2021.“We are delighted to be able to make this happen,” said Frauke Petzold, the Swiss minister of culture and artistic development. “This is a great opportunity for artists to collaborate with the government and the institution of their choice. By organizing this exhibition together, we hope to benefit from the expertise of our talented and dedicated staff, and to shape the exhibition to meet the needs of our audience.”The exhibition will be divided into three parts. The first part will focus on the history of art and design, and will be accompanied by two", "The next Biennial should be set up in the Städelschule, with an exhibition at the Düsseldorf Museum of Fine Arts, and all of the following year should be inaugurated in the municipality of Frankfurt am Main.‘This is an extraordinary and unprecedented year for the Flemish city of Frankfurt,” said Markus Niers, the mayor of the German city. The city was also included in a special report by the Flemish city council on its Universal City Plan, which aims to make the city a global city center. The city council committed to breaking ground on the city’s first quarter of a mile of land to be developed as a city park by the end of 2020. Commenting on the project, Niers said: “This is a city that I have long been a fan of and a city that I was mayor of for nearly twenty years. I’m very much looking forward to seeing how it evolves and to working with the city’s creative and creative-minded residents. I hope they answer our call to make an even more beautiful, vibrant, and compelling city.”\n\n\nThe National Endowment for the Arts (NEA) announced today that", "The next Biennial should be in 2021 and will consist of two parts: a structural survey, the first part of which was published in 1989, and a narrative, the second part of which was presented in 2016. The exhibition should be centered around the creative process of a person or entity. The structural section will focus on the biennial and the exhibition itself.The narrative will be a chapter from the autobiography of the artist V. S. Geng, a contemporary of Biennial 2000. It will explore themes of memory, identity, and transformation through the artist's own personal experience. The exhibition will consist of a series of experiments, each of which will be curated by the artist and will take place in the central location of the Biennial.“We at MCA have been working with the artist for years, and we are truly delighted to share her work with our global audience,” said Sixto Cervo, the Art Director of MCA. “With the first part of the biennial, we wanted to present a respectful and intimate reflection on the artist’s personal experience, in order to make it as accessible and accessible as possible. The historical and historical-based narrative of the exhibition is very fitting for the artist’s", "The next Biennial should be a celebration of the arts—not the subjects for which they were chosen—and should explore the ways artists have reinterpreted and refashioned their own histories and their own practices. Langston is asking for donations from the public.If you would like to make a gift to the Biennial, please click here. Biennial Statement: The Biennial is grateful for the support of our community and the support of our board of directors. We are fully committed to continuing our work in collaboration with the artists and the community, and we will continue to present great exhibitions and presentations that are open to the public. We are excited to receive the Biennial’s 2018 grant, and we look forward to making the next one a success. Photos: The Biennial’s Board of Directors: Michael Langston, Geraldine Langston, and Ronald LalondeMichael Langston with his son and daughter-in-law, John and Carole, who are raising funds for the biennial from Friends of the Arts, and from her husband, the artist Jean-Luc Langston.\n\n\nThe Los Angeles County Museum of Art (LACMA) has released the list of twenty-six artists who will", "The next Biennial should take place in the city in 2022.\n\n\nThe Massachusetts Museum of Contemporary Art (MACA) announced this week that it is canceling its upcoming exhibition “Between the Sun and the Moon,” an exhibition that explored the relationship between the sun and the moon and was set to open in March 2020. The show, which was to have taken place next month at the museum, was canceled because of a temporary closure imposed by the Covid-19 pandemic. The cancellation of the show was made on the same day that the United Kingdom voted to leave the European Union.“We are deeply concerned by the decision to leave the European Union,” said director Matthew Teitelbaum. “This is unprecedented and a catastrophe for the arts.” The exhibition was to have featured twenty works by forty artists, including Mike Kelley, Rachel Whiteread, Berenice Abbott, and Andy Warhol, and would have presented a new era of moon photography for the museum.The cancellation also follows the announcement that the eighteen-month-long exhibition “Between Two Worlds: New Moon and the Moon” would be canceled. Its new location: an exhibition run by the California-based nonprofit group Beyond the Sun,", "The next Biennial should be the thirty-ninth, and the forty-seventh, in the same year. The exhibition will charge $250,000 for a daylong exhibition of work by thirty-three artists. The inaugural Rome Biennale will take place in 2020. Sara Cwynar, director of London’s Serpentine Galleries, said: “The Rome site is an exhilarating, visionary, and deeply moving work. We are thrilled to be celebrating this milestone 50 years of the show with a full programme of programming dedicated to the show, to celebrate the centenary of the exhibition and the 50th anniversary of the exhibition.”\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of approximately twelve hundred works by the late American photographer Robert Irwin. Senior director for curatorial affairs, Anne McElvaine, said the institution is thrilled to receive the works from the artist’s widow, Nancy, who died last week. The works are part of a remarkable career spanning fifteen decades that spans photography, film, photography and photography-making, and includes several photographs that demonstrate how photography can be both a tool and a weapon.“It is an amazing gift to", "The next Biennial should be organized as follows: The first film biennial will showcase the work of the artists who have been selected for the 2020 collection. The theme of the first Biennial, “Dangerous Liaisons,” will be “Avant-Garde and Modern Art” and will consist of a selection of ten films. The second biennial will be organized as follows: The next event will be held at the newly constructed Tijuca Cultural Center, in Santo Domingo, the capital of Santo Domingino State. The first event will be held in the center’s main hall on September 29.The inaugural event, “The Formation of Art and Art in Society,” will be held at the Tijuca Cultural Center, on September 28, 2020. The inaugural screening of “The Formation of Art and Art in Society” will be held on September 23, 2020. The first Biennial’s second edition, “The Rise and Fall of Art,” will be held at the Tijuca Cultural Center, on September 25, 2020. The first Biennial’s third edition, ‒Art and Objects of", "The next Biennial should be held in the city in the spring of 2020. If all goes to plan, the event will also be held in Hong Kong.  Currently, the organisers are still working out the full schedule for the exhibition, which will feature a selection of work by contemporary artists and will be co-curated by Cécile B. Tompkins-Rivas, the founder of the international biennial, and Matthew Lieberman, director of the biennial.\n\n\nThe Metropolitan Museum of Art in New York has announced that Antony Hudek will become the next president of the organization.  Hudek will be inaugurated on March 25 and will serve in his new role for three years. He succeeds Suzanne Johnson, who retired on June 30 after a ten-year term. “It is a great honor to welcome Antony to the organization,” said Museum Director Christopher Rubenstein. “His extensive history in the art world, coupled with his enthusiasm and passion for the Met, made him the ideal candidate for the role of president.” Since his appointment, Hudek has overseen the organization’s acquisition of works by artists such as David H. Koch, Alex von Bruen", "The next Biennial should be held in December 2020.The new exhibition “The Anthropocene: From Scientific Research to Policy,” a joint project of the Ateneo Art Museum and the University of New South Wales, is currently on view at the museum from January 18 to January 20. The biennial will present works by twenty-seven artists from seventeen countries in the Pacific region.Among the artists chosen for the first event in December are Yinka Shonibare, Denilson Araki, Isaburo Ito, and Katimavik Yui. The event will consist of a retrospective of work by the artists on “The Anthropocene: From Scientific Research to Policy” (2019) and “The Anthropocene: From Science to Philosophy” (2019). The additional projects of the exhibition are a survey of Japanese art between 1910 and 1980 that has been organized by the museum in association with the museum and an exhibition of works by artists working in the United States during the 1950s and early 1960s. The exhibition is titled “What is Science?” and will feature seventy-eight works by twenty-two artists, including Koki Sadao, Rintoul* and Kiki Sada", "The next Biennial should take place in the spring of 2021. The event, which is modeled after the museum’s fourteenth edition, will include a retrospective of work by artists such as Vito Acconci, Alighiero Caruso, and Udo Kittelbohm, among others.\n\n\nThe Museum of Contemporary Art, Los Angeles (MCA) has appointed Kate Edwards as its next executive director. Edwards will take the helm from Mary Anne Miller, who has served as the director of MCA since June 2019. Miller was appointed MCA’s interim director following the tragic death of Kate Bish, a young artist whose untimely death was caused by a suicide.“Kate’s legacy is built on a deep and enduring commitment to Los Angeles’s arts and culture, and we are deeply indebted to her for her leadership and vision as MCA’s director,” said MCA’s board chairman Philip Mond. “While we will miss her, we’re confident in the future of MCA and its upcoming editions.” While she will remain involved with the museum as a board member and as chair of the board of trustees, Edwards will step down from her", "The next Biennial should be up and running by the end of the year. Themes that would be included in the biennial include the frontier of art, the history of the modern imagination, and the history of a certain political, economic, and cultural moment in modern history. The exhibition will take place in four parts. The first part will showcase the work of sixty artists and will take place in the city of Bangkok. The second part will focus on the history of contemporary art, focusing on the city’s museums and the art of the past. The third part will focus on the history of modern art, focusing on the art of the present. The fourth part will be a show of works by fifteen artists selected by the Biennial’s curators from a pool of fifty artists.\n\n\nThe National Gallery of Art (NGA), in Washington, DC, has been awarded a $1.4 million grant from the National Endowment for the Arts (NEA). The grant will support the NGA’s “Alfred Kruger: The Exhibitionist” and “Theater of Operations” exhibitions, which will reopen on September 29. The shows, which were organized by curator and former NEA", "The next Biennial should be held in 2022. \n\n\nThe Cleveland Museum of Art (CMA) in Ohio has launched a new initiative that will help revitalized neighborhoods and communities throughout the city by delivering free, emergency disaster aid and recovery kits to low-income and minority communities across the city through 2020.The team behind the initiative, which was commissioned by the City of Cleveland and the federal Emergency Management Agency (MDE), is asking the public for their ideas on how to help Black and Latino communities. The idea is to create a community box, a collection point for emergency supplies, food, and other goods, and then provide a variety of kits and supplies to help people in need.The strategy is similar to the one the local arts and cultural organizations took part in in the run up to Superstorm Sandy, when the CMA began distributing emergency relief kits to those in need in the vicinity of the damaged structures. Since then, the arts and cultural organizations have been helping people in need in various ways, including by organizing community food pantries and by encouraging individuals to shop for emergency supplies.The City of Cleveland also has a $1.2 billion emergency fund that was created by Congress in 2016 that can be used to support local cultural organizations in disaster", "The next Biennial should be held in 2021, with a new set of inspiring stories and the same themes and artists presenting their visions for the future. “This is the moment,” said the biennial’s artistic director, Leah Millejano. “And it is an exciting time to be involved with the work of such exceptional artists.”\n\n\nNew York–based artist Harrison Hernández, whose wide-ranging installation and sculpture—both monumental and intimate—defined the American avant-garde, has died at age sixty-eight.Born in the Bronx in 1932, Hernández studied at the Bronx Academy of Art, where he became a member of the band the Ramones, and the Bronx Museum of the Arts, where he met and married dancer Debbie Rowe, and later relocated to New Orleans, where he found his own artistic voice. The pair relocated to New York in 1967, where Hernández continued to use the Ramones as a template, and where he met and began to develop his own visual art. For the next decade, the duo worked and experimented at various institutions, creating works that deliberately challenged the Ramones’ medium: a 1977 installation at the ", "The next Biennial should open in the spring of 2021. Kohn, who was appointed as the event’s director two years ago, said that the institution is currently in discussions with the city of Seattle regarding a possible relocation to downtown Bellevue. The opening of the Biennial will mark the first time the museum will host two exhibitions simultaneously as its new building will accommodate two exhibitions. “I’m delighted that we are able to bring these two exhibitions together,” Kohn said. “Each exhibition will have a unique history and will be entirely dedicated to objects within our collection.”\n\n\nThe Annenberg Foundation has released two biennial entries in its annual awards. The 2019 edition, titled “All 4 One,” features work by fifty-eight artists and cultural professionals in the United States and Europe. The foundation selects these artists from a pool of twenty-five artists that are nominated by a familiar list of donors and is awarded the honor of hosting the biennial. The full list of awardees is as follows:ARIELA ALMANZARNA, CINES, GES, PORTUGAL, WEST, IONE, RICKY RICA, CHRISTINA ROSEN, JOSE", "The next Biennial should be held in 2021. The idea of a retrospective is to focus on a single artist’s career. In order to achieve this, the museum will organize the exhibition in a way that will allow the artist to be present at the exhibition.The Biennial will become a meeting place for the contemporary art world and will be hosted at Palazzo Reale di Barbera. It will also be operated by the museum as a collective space. The total cost of the project is estimated at $90,000. During the event, the artist will receive a $1,500 grant.\n\n\nSome years ago, I was writing about a novel form of urbanism that might embrace a self-replicating digital system but also engage with the finite possibilities of the city. I had a couple of articles published in Artforum on the topic, so I figured I might as well include them in this review. The authorship of the articles is entirely the responsibility of the author and is entirely the author’s responsibility. There is no copyright infringement, no plagiarism, no unauthorized publication. It is just using these articles to make a statement about how the author feels about the limitations of what the city and its inhabitants can do.”", "The next Biennial should be held in 2021. \n\n\nThe Los Angeles County Museum of Art (LACMA), the Los Angeles Police Department (LAPD), the Los Angeles County Sheriff's Department (LASD), and the San Diego Museum of Art (SDMo) have released guidelines outlining how they will handle protests over the reopening of the Museum of Contemporary Art (MCA) in Los Angeles.According to the Los Angeles Times, the changes—which were made by the city of Los Angeles and the county of Los Angeles—are meant to address concerns over the safety and well-being of museum employees, visitors, and the public.“This is the time of crisis for our nation and we must do all that we can to ensure that LACMA and the LAPD have the resources they need to protect the community we all love,” said LAPD Deputy Director Andrew Guggenheim. “The changes outlined in the new guidelines will not only ensure the safety and well-being of museum employees and the community, but they will also ensure that LACMA and the LAPD have the resources and tools they need to protect the people they serve.”Guggenheim also praised city council member Mitch O’Brien, chair", "The next Biennial should be held in 2020.\n\n\nSwiss artist Marc-Olivier Hilleboim, who created beautiful abstract compositions that evoke the artist’s own memories of his childhood, has died at age eighty-nine. Hilleboim was born in Lausanne, Switzerland, in 1936 and raised in Paris, where he studied under the French avant-garde pioneer Vico-Olivier Bernard and with the Italian architect Dario Catellani. He began his career as a sculptor, but moved to Geneva, where he began to focus on painting. In 1950, the year of the founding of the Haus der Kunst (HdK), Hilleboim and Bernard published their first book together, the contemporaneanischer Kunstverein Lübeck (1950), which introduced Hilleboim to the radical post-war wave of German Expressionism. Another book, the contemporaneanischer Kunsthaus Stuttgart (1958), introduced the artist to the city’s Art Museum and to Mies van der Rohe; to Arne Glimcher; and to Franz Kunst, who invited Hilleboim to the museum to create a piece for the", "The next Biennial should focus on the history of the arts in the city, the city region, and the city as a whole, to be held in twenty-six cities across the city of Saint Petersburg, the Republic of the Federal Republic of the Russian Federation, and the City of the Sea.In the upcoming edition of the exhibition, titled НИМИН, the cultural wing of the State Museum of Fine Arts in Saint Petersburg will present a new conceptual project, titled Заванов, that will bring together the collections of the State Museum of Fine Arts and the Federal State Tretyakov Gallery in Moscow. The project will debut at the State Museum of Fine Arts on June 17, 2019 and the Federal State Tretyakov Gallery on June 17, 2020.The projects of the upcoming biennial include the development of the exhibition “The State of the Art” (2019), which will be staged at the State Museum of Fine Arts, St Petersburg; the exhibition “Analogous Love” (2019), which will be staged at the federal State Museum of Fine Arts in Moscow; and the exhibition “The Community of Contemporary Art” (2019), which will be", "The next Biennial should be held in the spring of 2020. While the dates of the 2021 and 2022 editions of the exhibition have yet to be announced, the 2019 and 2020 editions of the show will be held on the same dates, and will also feature the first solo exhibitions of works by the two artists. The Biennial is a collaboration between the US and the UK, comprising the US, the UK, Spain, France, Italy, the US, and Spain, New York, and Hong Kong, and is organized by the Art Institute of Chicago (IAC), Chicago. The organisers are planning to present the exhibition in conjunction with the US pavilion at the Fifty-Fourth Venice Biennale in April 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to phase out its contract with a Russian billionaire, Alexander Gennadyev, and his controversial company the Alfa Group, which owns the US petrochemicals and chemical companies BASF, DuPont, and Monsanto. According to the New York Times, the move will save the museum $3.5 million a year and will help it avoid a $4 billion loss in revenue as a result of scheduled closings in March and June.The restructuring,", "The next Biennial should be held in the spring of 2021.” \n\n\nThe Saint Louis Art Museum (SLAMP) has been awarded a $3.4 million grant from the Andy Warhol Foundation for the Visual Arts to continue its initiative to reshape the institution, with a ten-year, $4.1 million plan, according to the Art Newspaper.The Andy Warhol Foundation was founded by art collector and philanthropist James Warhol in 1983. It receives funding for its Andy Warhol Foundation: A Retrospective grant program annually. The Andy Warhol Foundation: A Retrospective grant program also awarded $1.1 million to the Saint Louis Art Museum in 2015.\n\n\nThe National Gallery of Art in Washington, DC, has received a $1.1 million donation from the late philanthropist and financier Charles and Edythe Broad Foundation in support of its ambitious reopening. The gift was made in support of the museum’s construction of a new building—the Broads’s $180 million expansion, which will take up one-third of the building, was completed in December. The new building will include a redesigned wing of the museum with new exhibitions, educational initiatives, and public spaces and will also", "The next Biennial should be hosted in the city of Barcelona. The exhibition “An Open World to Open Up” dates from May 20 to May 24, 2020, and will feature work by approximately ninety artists, including Eva Hesse, Nari Ward, and Bastien Noc, among others that were honored last year. The exhibition has yet to be canceled. “The Biennial is not a commercial institution, but rather a project in the production of art,” Manuela Moscoso, director of the Barcelona Museum of Modern Art, said in a statement. The opening of the exhibition coincides with the opening of several new works by the curators of the exhibition, which are: Hannah McKay, Hannah McLaren, and Diane Craig. They were nominated for a Golden Lion for their work and are currently receiving the award for their achievement. An exhibition of work by European artists, including Peter Zumthor, Christa Pape, and David Salle, will also be presented at the museum in 2020. The Biennial is supported by the Institut national de l'art et de l'éduc (INAM), the Institut national de l'Ar", "The next Biennial should be held in 2022. The biennial will include the exhibition of works by fifty artists selected by a new biennial jury comprising two artists representing the two highest bidder's names, Bobby Osei-Mensah and Osei-Yasuo, as well as Yoshitomo Aoki, who previously curated “The Terrible Shrimp,” a 2010 exhibition that was staged at the Bâtschi Gallery in Beijing. The jury will be comprised of Bobby, Osei-Mensah, and Yoshitomo Yamada, as well as Lina Ramirez-Rivas, a Los Angeles–based curator, and Vincent van Gogh, Francis Schöffer’s grandson, and the artist’s mother. The festival will also continue to be hosted at the Bâtschi Gallery until 2024.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Oscar Murillo as its next director and CEO. Murillo comes to the institution from the Art Institute of Chicago (IIC), where he has served as deputy director and chief curator since April 2018.“We are thrilled to welcome Oscar to MoMA,�", "The next Biennial should take place in 2021 and will aim to present a new and balanced look at the history of the Museum of Modern Art in New York, focusing on the biennial's relationship with the institution as well as the importance of the institution in the lives of the local community.\n\n\nThe Established Art Museum in New York, which recently underwent a multimillion-dollar expansion, is continuing to welcome visitors despite the pandemic. The museum plans to begin welcoming visitors on Tuesday, March 19, at 11 AM, the exact time the institution was forced to cancel a series of programming in April due to a coronavirus outbreak.The reboot was prompted by the New York City Health & Hospitals Authority (NYCHA) announcing that from March 12 through April 23, the agency’s eight-block site on East Eighteenth Street in the Chelsea neighborhood of Manhattan will be open to the public for free. The free period will run from March 13 through March 16.The announcement coincided with the city’s peak coronavirus season, which saw more than 7,000 cases in April and May. According to the Wall Street Journal, the coronavirus outbreak also coincided with the institution’s move to a new space in Greenwich Village, New", "The next Biennial should assemble the original materials and the artworks, and will be held at the Venetian, in the city of Venice, from February 22 to February 25, 2020.The exhibition will be organized in cooperation with the architects of the newly-renovated grounds of the Serralle Artis, as well as with architects and designers from the Venetian, the Fondazione Giardazzoli, and the Museo d’Arte Contemporanea (MA), in Milan, and will present works by eighty artists, including Agnes Martin, Mara Cipolletta, and Marianne Bochereau, as well as works by indigenous artists in Colombia, Peru, and Mexico. The exhibition will also include the first public digital artworks by a Colombian artist.“By collaborating with the artists, we hope to extend the heritage of the contemporary studio to its next phase: a time when the artists are not only present and able to shape the future, but also able to make it their own,” said Vittorio Cattelan, president of the Fondazione Cattelan. The Fondazione Cattelan’s partnership", "The next Biennial should be held in the spring of 2020. \n\n\nThe British artist Caroline Molesworth-Keat, whose vibrant geometric abstractions challenge and evolve the notion of beauty in a modern and abstract way, has died at age ninety-eight in London. Molesworth-Keat was born in London in 1941. After moving to the Bronx, New York, in 1948, she enrolled at the Art Students League in the Bronx, where she met her future husband, Peter Kratochvil, and their first child, a son they named Simon. The couple moved to New York City in 1949, and Molesworth-Keat soon found herself in the midst of a sprawling, multi-decade-long career as an artist. The artist created works that were based on a systematic, geometric-based approach to the creation of abstract forms, which she termed 'hexagonal arithmetic.' Her first series, 1956, comprised nineteen drawings and represented the geometric form of a circle, and her second, 1963, featured twenty-one works that became known as the Kratochvils’ geometric paintings. In 1983, the couple married and had three children; their only son, Simon Kratochvil, was born in the 1980s", "The next Biennial should be announced in the second half of the year.\n\n\nThe National Gallery of Art in Washington, DC, announced yesterday that it plans to institute a new salary for its chief executive officer, Maureen Ryan. The move was made in recognition of her achievements in bringing the Smithsonian’s collections under her ownership and transforming the institution into a major player in the arts.Ryan has been credited with helping the museum become a major player in the arts by raising the salary of its highest-paid employee, Cora Cards, and organizing many of the institution’s key exhibitions. Ryan’s successor, Bob D. Evans, is currently the board president of the National Council on the Arts. He will begin his tenure with the National Gallery of Art on January 1, 2021.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has received a gift of more than 1,300 works by seventy-five artists, including David H. Koch, F. Scott Fitzgerald, and Robert Irwin. The donation includes the works of eighty-four artists including Mark di Suvero, Lillian Gish, and Agnes Martin, as well as works by forty-nine contemporary artists, including Thomas Dolby, Vladimir G. Kon", "The next Biennial should focus on “critical moments in the history of art,” said Erik Hayden, director of the museum, and will include “staged artistic interventions,” “continued re-creation of a larger, shared vision,” and “a celebration of the work of great contemporary artists.”\n\nThe British Museum in London announced today that it is doubling the size of its built-up exhibition space in the city. The museum now intends to stage twenty-five exhibitions, including a series on the history of photography, an exhibition on the work of British painter Kathleen Beecher, and a presentation of Beecher’s work, “Pax Romana.” The remainder of its existing exhibition space will remain open, and will be used for other programming.“The new building will give the museum additional capacity to show more contemporary art and more ambitious exhibitions at a faster pace, and will allow us to offer more visual impactful experiences,” said museum director Maria Balshaw. “As we continue to develop our new space in central London, we are acutely aware of our role as a leading cultural institution in the country, and of the importance of the", "The next Biennial should be held at least once a year, and at least once in the spring.”\n\n\nThe Astrup Contemporary Art Museum in Copenhagen, which announced last week that it plans to close its doors to the public for several weeks in April due to a variety of health and safety concerns, has welcomed visitors back to the institution. The Danish government confirmed that the institution will remain closed until at least April 20, but gave the museum until April 29 to re-open.Institutions that have recently experienced financial difficulties include the National Museum in Oslo and the Danish Art Museum in Copenhagen; the Arcsthal Museum in Copenhagen; and the Copenhagen Art Museum. The Danish Art Museum director, Gunnar Leonard, told the Art Newspaper that the closure will not have a material impact on the organization’s programming, but will help to keep the institution informed and provide a snapshot of the state of art.March 23, 2019: A group of artists and collectors from twenty-nine countries are demanding that the Danish government stop criminalizing anti-racism protests and re-open the country’s art museums, arts centers, and other public spaces, and allow individuals and cultural groups the same constitutional rights as the Danish citizens. The signatories are", "The next Biennial should take place in Shanghai in the fall of 2020. In a joint statement, the museum and the government said that the next edition will take place in the city from February 21 to February 28. \n\n\nThe Metropolitan Museum of Art in New York has shed several hundred paintings by Henri Matisse, including a series from the 1930s that were on display for the first time since the artist’s death in 1972, and is preparing to open an exhibition devoted to the artist’s work in the spring of 2020.The exhibition will present the artist’s most recent collection, a selection of forty paintings dating from the 1970s through the 1980s, and will be curated by Andrea Dwork, who most recently served as the museum’s associate curator of twentieth-century art. The exhibition will travel from the museum to Rockefeller Center, where it will be on view until January 23, 2020.According to the New York Times, the exhibition will feature the works of forty-six artists, including David Crowe, Dierk de Meuron, Jean-Luc Godard, Jean-Michel Basquiat, Damien Hirst, Mark Rothko, Terry Jones, and Thomas Peterffy. The institution has also announced", "The next Biennial should aim to establish a coherent, international narrative of the radical history of modern and contemporary art, including a discussion of the mounting urgency and trajectory of contemporary art, and the importance of our collection and its exhibitions. We believe that the contemporary art of our generation has undergone a momentous transformation, and that the current exhibition programme will be an excellent opportunity to reflect upon this period of art history.”The biennial will also include the publication of a new book by artist Pilar Russo; a new exhibition at the Museum of Contemporary Art Los Angeles; and a special exhibition at the Los Angeles County Museum of Art (LACMA), titled “The Artist in Brief: Selected Works,” which will be curated by artist‐in‐residence Elin‐Léger. The museum will also stage “The Therapy of Art: The Present Situation” at the same time as the biennial.\n\n\nRussian artist Dina Kuznetsova, whose sculptural works both foreground the role of female painters and speak to the changing expectations of the profession, has died at age ninety-six at her home in Moscow. Kuznetsova’s work, which often addresses pain and the body, assembles", "The next Biennial should be held in the spring of 2021. The first edition, titled Art and the Evolution of the American Mind, was held in 2020. \n\n\nThe Museum of Modern Art (MoMA) in New York has hired Loren Elliott as its next executive director. Elliott takes the helm from Gabriel Rodriguez, who departed the institution in February 2019 to head the Brooklyn arts space the Roxy Gallery. During his four-month tenure, The Earth, Wind, and Rain (Wearei Wataru), an artist-run venue in Manhattan, will host more than 300 artists, including Damien Hirst, Joël & Madeline, and Tanya Gersch, and will continue to operate as a space for contemporary art.“Loren Elliott is an accomplished leader and a highly respected member of the MoMA board. He brings a deep breadth of experience to the role of MoMA’s executive director, and we are excited to work with his professional background and extensive experience to ensure Wearei Wataru remains a vibrant exhibition space for contemporary art and for MoMA’s audience,” said Tony Fadell, president and CEO of MoMA. “His ability to integrate a new", "The next Biennial should bring together artists, designers, musicians, writers, and other cultural producers from all over the world. The agenda will include a combination of art and design, including architecture, design, and design-related activities and exhibitions. The festival will be held on the ground floor of the Ministry of Culture, Japan; will include a category for art research and a curatorial program in the form of a symposium; and will involve the sharing of tools and resources. The show will be organized by Mitsuko Nara, the chief curator of the Tokyo Design Biennale, and Hiroshi Moro, the director of the newly opened Kunsthalle Hermitage-Ballet.\n\n\nLysistrata Cassvold, a Swiss artist known for creating works that challenge the concept of gender identity and shape the body in various ways, has died at age eighty-one.Born in Munich in 1936, Cassvold studied art at the University of Bern in Switzerland, where she met the Swiss-born English painter Hans-Ulrich Vermeer. After Vermeer’s birth, Cassvold moved to Geneva, where she met Vermeer’s wife, the American painter Cecil and their son Nicholas."]