["The next Biennial should be held in the city of São Paulo, Brazil, in early July. The event will include an exhibition of works on display in the exhibition “Shipping to and from Sea and Sea to Sea,” curated by Gio Ponti, which will run from March 26 to March 30. The second, which will be held in early May, will be a panel discussion with Norberto Oiticica, a curator and art historian based in São Paulo, Brazil; Kari Sassen, a curator and art historian based in New York; and art historian and Argentinean novelist María Berrío.Commenting on the announcement, Mark Simpson, director of the Biennial, said: “In many ways, this is a moment of transition. The museum is taking a step back to reflect less on the past and more on the future, on the possibility of a future in which art is not a barrier to our way of life. We are excited to see how the first exhibition will engage the Brazilian public and how they will respond to the first show.”\n\n\nThe Los Angeles County Museum of Art (LACMA) is planning to close its doors for a period of twenty-two weeks in order to", "The next Biennial should be held at the museum within a few months. The museum’s director, Monir Shah, has previously said that the biannual event, which was established in 1994 and runs through February 2021, will focus on “indigenous art,” and will incorporate contemporary artists from across the globe. The next edition will be held at a location in London’s Hyde Park, which will be inaugurated in 2021 and will house two thousand artworks.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it will open a new digital museum platform, the MoCA Network, in the city’s Downtown Los Angeles neighborhood. Its mission is to connect and support the local community through a wide range of cultural and educational initiatives.Launched with $15 million from the $50 million Make-A-Wish Foundation, the new initiative will organize eight monthly public programs, including “HELP OUR MUSIC,” “COVER UP,” “LOOKING,” and “SHOW ME,” among other events. The platform will also host an artist-in-residence program, which will feature eight weeks of residency by artists", "The next Biennial should be held in 2021 and the exhibition will open in Berlin in March 2022.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed veteran curator Lorna Simpson as its next director. Simpson first joined the museum in 1985 as head of the museum’s earliest collection, one of the first dedicated to postwar and contemporary art. In recent years, she has been working with artists such as Billie Holiday, Carolee Schneemann, and Anna Atkins to develop new exhibitions and programs.“I’ve been impressed by her as a curator since I first met her in the early’s ’90s, but her expertise and commitment to artists and our collections and our institution has been unmatched,” said Los Angeles’s Terry White, chair of the museum’s board of trustees. “We have had her at every turn, and we’re going to have her next year, and at every turn she has been in the forefront of finding new ways to engage with artists whose work we recognize as important to Los Angeles and the world.”Simpson joins the museum from the Metropolitan Museum of Art, where she had served as associate curator of modern and contemporary art", "The next Biennial should not be a return to the past but a clear continuation of the program in the spirit in which it began. The theme should be “Authentic, not Holographic: How Music and the Body Interprets the Past.” The exhibition should also address the use of art in conflict zones and the connections between art and performance in the contemporary world. “We encourage you to consider the future of the Biennial in the spirit in which it started,” the organizers said in a statement. “We wish you good luck in making choices that reflect the values and goals of the institution. We thank you for supporting the exhibition, and we look forward to seeing you at the event.” The first Biennial was held in Brussels in 2002 and was organized by the NGO the BCA and the artists involved.\n\n\nThe Louvre has received a donation of sixty-four works from the late Israeli collector, economist, and philanthropist Menachem Begin. The works are a selection from the collection entitled “The History of the Vegetable,” a monumental, seventy-five-foot, stone, granite, and marble sculpture that was created in 1973, the same year the museum opened to", "The next Biennial should have been held in Shanghai in October 2019. Instead, it was postponed until at least May 2021. For the first time in its fifty-three-year history, the event will take place in Hong Kong.“Mistakes happen, and we will not make them again,” said Jeffrey Kvanbren, director of the University of California, Los Angeles, and a cochair of the new exhibition series. “We are committed to ensuring the future of the Art Biennial in Hong Kong, and I am confident that by integrating our programs, we will be able to create a unique new platform to engage the international community, raise the public profile of Hong Kong, and strengthen the city’s international reputation.”The 2019 edition, “The Art of Medicine” was moved to Hong Kong in June 2019, the same month the exhibition opened in New York. The museum announced that it will now stage the exhibition space in the city from October 20 to October 21, 2020. The new project, called “Worlds Fair of Medicine” (WFC), will include international artists and will be held in collaboration with the Hong Kong Art Museum.WFC will have a minimum of forty-three participants", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has issued a public apology for publishing an exhibition listing the legacy of the late Greek-American artist Kiki Smith on its website only a few hours after the artist’s death. The announcement was made on the museum’s Instagram account, where the artist’s work is currently displayed in its section on Modern Art.Smith, an American-born, British-based sculptor and painter whose monumental sculptural sculptures, paintings, and prints explore the possibilities and limits of human experience as well as the human body, died in New York on December 7, 1972.Born in New York City on December 10, 1950, Smith grew up in a family in the working-class seaside town of Maplewood, Massachusetts, and later studied abroad at the School of the Art Institute of Chicago, where she received her bachelor’s degree in 1967 and then enrolled at the University of California, Berkeley, where she studied with artist-friend Robert Irwin. Her work has been exhibited at the San Francisco Museum of Art (SFMoMA), the Museum of Modern Art, and the Metropolitan Museum of Art, and countless other museums and institutions throughout the", "The next Biennial should take place in 2022 and will re-launch with new exhibitions in 2021. Berlin Talks, a Berlin-based collective of curators, writers, and other arts professionals, is currently working on organizing a biennial for the city: a concept work by the German artist Filmne, titled Bosch einen Frauen.  The event will be curated by Berlin’s Wolfgang Reitze and will be implemented as part of a yearlong program of exhibitions, residencies, concerts, and other events. \n\n\nThe Moroccan artist Massouda Khaledi has been awarded a Pulitzer Prize in Arts for her installation Ida in Arabic, which is based on a poem by the same name written by Omar Saad. According to the New York Times, the works will be presented in the first exhibition of the Moroccan artist’s new exhibition in London, “Olladat al-Masriya” (This Is the Place), which will open at Picasso’s Art Institute in August 2020. Khaledi has lived and worked in Morocco since the late 1980s. Khaledi’s work is part of a larger field of Arabic and Ur", "The next Biennial should focus on the history of the reception of the exhibitions, the creative process in exhibiting them, and the significance of the exhibition in our culture and in the city of Zurich. It will then be up to the audience to decide whether they wish to participate in a special exhibition or not. “In order to become a part of the history of the exhibition and the exhibition process, we need to understand that, for generations, the exhibition has been a source of inspiration, of insight, of joy and of fulfilment,” said curator Wolfgang Walter. The exhibition will also be a platform for young and established artists, as well as a resource for scholars and researchers.The biennial will be hosted, in conjunction with the exhibition “Bertolt Brecht” (2019), in the city of Zurich until January 11, 2020.The exhibition will continue to be held in the state of North Rhine-Westphalia until the end of March.\n\n\nArts Council England (ACE), the international advisory body for art institutions and charitable organizations, has removed a ten-thousand-work collection from exhibition-going after it tweeted a depiction of a decapitated George Washington. The work, titled “On the Tree of Life", "The next Biennial should be held in 2021. The exhibition will include a retrospective of the works of fifteen artists, including Adam and Evelyn de Maio, Matisse and Rembrandt, and Turin-based architect Jochen Haag; a contemporary show of work by the Pakistani artist Waseem Akram; and a presentation of work by the Egyptian artist Ahmed Salah.\n\n\nThe Tichel Museum of Art in New York has announced the launch of a new digital platform that will allow visitors to view works by experimental and experimental artists. The platform, called the Biennial, will be based at the Tichel, which is a subsidiary of the Javits Center under the leadership of John H. Tichel Jr., and will offer free access to selected works, curated by the Tichel’s curators.“This is a moment of great change for art,” said John C. Tichel, the director of the Tichel. “Today, with the coronavirus pandemic, we are celebrating the history of experimental art and its capacity to provoke social and philosophical questions. At the same time, we are learning how to create new transformative experiences for audiences by curating new works and exploring", "The next Biennial should be held in 2020 and the first in 2021. The 2018 event, titled “Cultural Capitalism,” featured work by sixty artists and was organized as part of the “EPIC: September 28–September 29, 2019.”The 2020 edition, titled “Distinctive New Dimensions,” will be organized as part of the “ART and CONSPIRACY.” Originally slated to open on October 27, the exhibition will instead be held “September 28–September 29, 2020.” The 2019 exhibition, titled “The Accidental Biennial,” was staged at the Museum of Fine Arts, Boston, but will now be staged in the Cultural Centre of Barcelona. The 2020 edition, “The Greatest Moments in Contemporary Art,” will take place at the National Museum of Contemporary Art, Washington, DC. The 2020 exhibition will also feature the work of Stefan Aitken, Lisa Adams, Nicholas Hull, and David K. Barlow.\n\n\nThe Metropolitan Museum of Art in Washington, DC, announced today that it is moving forward with the construction of a new, larger, and more expansive exhibition center surrounding the Metropolitan Museum of Art (MM", "The next Biennial should be called the 20th or the 21st Century as it relates to Japan and the history of the Tokyo Metropolitan Museum. We will also be able to refer to this as the twenty-fifth or the twenty-eighth century.” \n\n\nThe thoroughgoing renovation of the Museum of Modern Art (MoMA) in New York is nearing completion, with the completion of a $450 million overhaul of the architecture and interior of the institution in 2020. The $250 million renovation of the museum’s former space on the second floor of the building, which was completed in 1933 and expanded in 1939, is currently underway, and the remaining work is slated to be completed by 2021.“The renovation of MoMA reflects the vision of MoMA’s past leaders, including David Samson and David H. Katz, as we recommit ourselves to the environment and the future of our institution,” said architect Loa Tseng. “The museum will continue to serve as a beloved cultural landmark for generations to come and continue to reflect the rich legacy of our founding partner, the New York Public Library. We are thrilled to be transforming MoMA into a museum of the past, a museum of the future, and a museum", "The next Biennial should be held in 2020.\n\n\nThe Philippine National Museum (PNM) has announced that it has completed its renovation of the National Museum of the Philippines (MNP), which was opened in 1932 by Ferdinand Marcos. The museum underwent a total of twenty-one projects, which included the creation of a new exhibition space, the addition of twenty-nine curiosities, and the renovation of the structure, which comprises twenty-three stories of brown and white stone.“With the completion of the renovation, the museum will become more dynamic and exciting for visitors to experience its collection and collection exhibitions more vividly and to have an opportunity to participate in the building and renovation of the museum,” said Nahan Silvestre, the director of the museum. “The renovation project also aims to further diversify the collection and to increase the visibility of the museum in the city.”The renovation project was undertaken by the architects Pritzker Architecture, the Burman-designed National Gallery of Art, and the architect of the Vietnam War Museum, Jean-Michel Brésil, the architect behind the installation of the construction of the Saigon Museum of Art.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced", "The next Biennial should open in 2021. The biennial’s next edition is scheduled to take place at New Orleans’s Rockwell Art Museum in 2021 and 2022, respectively. \n\n\nThe University Museum of Chicago (UMC) is preparing to welcome visitors back to campus next week following a brief hiatus due to Covid-19. The institution confirmed today that it will begin reopening, following a four-week shutdown, on May 25, with free admission for the first three days. The museum estimates that reopening will generate $2.5 million for the university.Speaking to the Art Newspaper, which first reported the news, UMC director Victoria B. James said: “We are hopeful that this will be a time of celebration and recovery for our students and community.” She added that the shutdown is not connected to the pandemic. The shutdown has been in place since March 15, when an outbreak of the novel coronavirus – which has since spread to at least six countries—began.While the virus has not yet reached people in the contiguous United States, the virus is believed to be circulating in and causing illness in China, Japan, Korea, and Korea’s South and Southeast Asian neighbors", "The next Biennial should be held in 2022. It has yet to be determined whether this will be in northwest Italy, or in Venice, or in the Vatican. The congress will also seek to establish a new governing body for the institution, to be called a Senate of the Republic of Venice.The Rome-based academic commission is an institution of global governance and the promotion of art in the Italian city. Its first board president, Antonello Gattini, is a former chief of the Arts Ministry and a professor at the Turin-Milano Art School. Its president, Stefano Dellani, is a professor at the University of Florence, Florence; a professor of art history at Florence; an artist; and an architect. The next edition of the Rome Biennale will take place in 2021. Shepard Y. Khouri, president of the Carnegie International, said: “The Rome Biennale is a major milestone in the history of the Carnegie Corporation. We are thrilled to have had the opportunity to present this extraordinary exhibition. We are confident that the exhibition will inspire and delight audiences around the world and represent the best of contemporary Italian art.”\n\n\nThe Museums Association (MA), the international organization representing", "The next Biennial should take place in 2020. [UPDATE: January 26, 2:45 PM] \n\n\nThe Tate’s Board of Trustees has voted to suspend eventual President Hirsi Ali, who was facing up to ten years in prison for inciting racial hatred, for a month. Tate’s vice chairman, Hamish Anderson, said that the board was “concerned by the impact of Ali’s suspension on the work of the Tate’s board and its relationship with its staff.” He added: “We have taken the decision to suspend him for a month without pay and will announce our new terms within the week.”While Ali was suspended for two weeks without pay in March 2019, the institution was only fined £540,000 for breaching the Official Racial Equality Statement for England and Wales, which was signed by more than 800,000 people. In March 2020, the Tate will be fined £1.2 million for breaching the statement again. Tate director Maria Balshaw said: “The board is deeply concerned by the implications of the suspension of Hirsi Ali and the deterioration in our relationships with the staff we have lost faith with. We", "The next Biennial should focus on the history of women’s exhibitions in Los Angeles, New York, New Orleans, and San Francisco, and should include new works by emerging and established artists. Erika Bochereau, director of the LACMA Museum of Art, said: “We are excited to present the work of our inaugural cohort, as we believe this is a watershed year for the history of modern art and we must make the most of it.”Joan Flanagan, the chair of the 2017 selection committee, said: “I’m thrilled to be presenting work by the first group of women artists to Ann and Roberto’s Brooklyn home since 1912, and the biennial is another step toward that goal, one of our five-year-old goals. We are also grateful for the commission from Oscar de la Hoya, who has added an extra dimension to the exhibition in his first show at the Brooklyn home since the 1940s. It is a tribute to the committee that has worked with the artist to develop an exhibition that honors such an esteemed producer.”The exhibition’s inaugural biennial, “Women Artists, Los Angeles,” will run April 3–April 7 and", "The next Biennial should coincide with the opening of the new exhibitions, “Bergen Biennum: From the Ruins of the Century to the Future,” said Eva Schatz, director of the Museum of Fine Arts Berlin. “The opening of the exhibition ‘Bergen Biennum: From the Ruins of the Century to the Future,’ will mark a new chapter of the history of the museum. It will be a great opportunity for visitors to see the original works on display, as well as the reconstruction of the former exhibition space.”The first exhibition, “The Destruction of Memory: The Body’s Museum’s Installation,” will be on view until February 15. The second exhibition, “The Creation of a Biennial,” will open on March 13 and run until April 13. The third, “The Study of Man,” will open on April 12 and run until May 11. The fourth, “The Prisoner of the Future,” will be on view until May 11. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Sarah Pollock as its next director. Pollock comes to the museum from the Architect", "The next Biennial should focus on the history of social movement theory in the US, and the principles that underlie its articulation and practice in the twenty-first century. The exhibition should also consider how the history of art and cultural practices is global; how the histories of art and cultural practices are intertwined; and how a collective act of memory can shape the future.”The exhibition, “The Past Is Our History: The Struggle for Civil Rights in the Post-War Era” will open at the Hartsfield-Jackson Atlanta International Film Festival’s upcoming event in December. On the September 22 edition of CNN, Robert Caro, the director of the Metropolitan Museum of Art, said, “The exhibition will offer a new and powerful way to think about the world and will engage with the history of art as a whole.”\n\n\nThe New York Museum of Modern Art (NYMoMA) in New York City has appointed Antoinette Schäfer, who has helmed the institution for over twenty years, as its next director. She succeeds David Simon, who departed the institution on March 31 after twenty-five years in January 2020.“Antoinette Schäfer’s leadership and vision have been", "The next Biennial should be held in December 2020.\n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has released the list of seventy-five artists who participated in the first edition of the Rosslyn Art and Design Biennial, which ran from October 5 to October 6, 2019. The biennial, which addressed the themes of architecture and design, was held at the Smithsonian’s Washington, DC, headquarters. Titled “The Future Is Now,” the exhibition attracted over one hundred,000 visitors.The full list of participating artists can be found here. “We are pleased to support the new initiative of the Rosslyn Art and Design biennial with an exhibition of works by seventy-five artists,” said museum director and CEO S. Steven Rosslyn. “This is a carefully curated selection of work by a select group of contemporary and established artists. The exhibition will introduce visitors to the many outstanding artists whose work explores the implications of design in their lives.” \n\n\nThe German federal state of North Rhine-Westphalia has approved an agreement that will see Alexander Schechter, the founder and CEO of the advertising company Wieden + Kennedy, extradited to", "The next Biennial should take place in 2021.\n\n\nThe Bechdel Center for Photography in New York City has appointed Laura Mulkey as its new curator of photography. Mulkey comes to the institution from the Museum of Modern Art, where she currently serves as director. She succeeds Susana Mendieta, who departed to lead the Los Angeles County Museum of Art (LACMA), and will begin her position in January.“Laura Mulkey has been a curator in her own right since 2009, when she was selected to curate the Bechdel’s inaugural exhibition, “Photographica,” at the new Museum of Modern Art,” according to the Art Newspaper. Mulkey first joined the museum in 2012 as an associate curator. In 2013, she was invited to join the editorial staff\u0097the first staff-led show in the museum’s twenty-five-year history\u0097but declined. In 2014, she was invited to serve as a cofounder of the Bechdel Center and is the first female curator to helm the institution. Her experiences include creating content for exhibitions at the museum and in the film and television industry.“Laura is thrilled to be joining the", "The next Biennial should be held at the London site in 2021. \n\nInaugurating its twenty-second edition in 2019, the London-based biennial announced that it is extending the run of the event by two months. The extension, which follows a pattern in the biennial’s previous iterations\u0097in 2017 and 2019, followed a City of London-backed $1.2 billion plan that transformed the Garden Market. The second edition of the event, which was in partnership with the Tate, will now be held from March 15 to March 18, 2020. The biennial will receive a total of $2.4 billion from the government, including $925 million from London to secure the venues for the event. The Queen’s Fund for Arts, a charity that supports arts and cultural activities across the United Kingdom, will also receive $1.1 billion.The biennial will be held at two locations: the Serpentine Gallery, in Stratford, and the Tate in London. The city of London’s gardens, public spaces, museums, and other public spaces will be transformed by the event\u0097the city will construct a new, 152,000-square-foot home for the exhibition in", "The next Biennial should focus on how art history reflects and informs contemporary life. The theme of the twenty-fifth should be “Life as we know it today,” according to the New York Times.  The new exhibition will also introduce a new section entitled “Future Present,” which will focus on the past. The section will include work by contemporary artists and will be curated by Alexander Dugin, who will also curate the 2021 edition of the exhibition, which will focus on “Life After Death,” which was organized by the Russian artist Pavel Nogin.Dubbed «Life as we know it today,” the exhibition focuses on the life and work of contemporary artists, including Rintoul, Narsimr, and Artur Davis, who were all active members of the American collective SCMP, which was formed in New York in 1959. The exhibition will be held in the museum’s exhibition space in the newly renovated Rockefeller Center, which opened to the public in 2012. The new space will also hold the museum’s upcoming exhibition “Avant Garde” and “Avant Curating” (2019). The museum will honor the artists with a", "The next Biennial should focus on “postcolonialism”—its catch-all term for the philosophical, social, and political concerns surrounding the direct and participatory projects of indigenous peoples in the Americas. Most recently, in February 2019, the exhibition “The Future of Art: Postcolonialism and the Struggle for Realities.”The 2019 edition of the Biennial, titled ‘Unseen: Contemporary Art in the Era of Trump,’ was curated by Roberta Smith, who was named the theme of the exhibition by director and curator Anna Wintour.The exhibition opened at the New Museum in London on March 4 and featured seventy-one works by eighty-five artists. Among the works on view are work by Simone Leigh, Emily Hall, Michael Alwyn, Julieta Alves, Willem de Kooning, Alfred H. Barr, and Jules Marden, and seventy-one paintings by seventy-nine artists and designers, including Jorge Mas and Jean-Luc Moulène.Inaugurating the exhibition is a group show on photography, “The Realities of Photography.” The first part of the exhibition will be on display in the museum until March 30 and the second part will open on", "The next Biennial should take place at the Athens Institute of Art in 2020. The same year, an exhibition at the Museum of Modern Art in Mexico City will be staged at the same venue. The new initiative will launch in collaboration with the Greek Ministry of Culture and the Ministry of Education. The twenty-second edition of the biennial will be held in Madrid in 2022.\n\nThe San Francisco Museum of Modern Art (SFMoMA) is planning to move some of its collection to a conservation center in the Bay Area, as part of a $2.5 billion renovation and expansion project that will also include the construction of a new visitor entrance to the museum. The move is part of a strategy to better manage the collection in a way that would minimize the environmental impact of the museum in the event that the building is expanded to accommodate the collection’s exhibition halls.“The San Francisco Museum of Art is a great example of a city-led, city-owned museum,” said Michael Govan, chair of the SFMoMA board of trustees, in a statement. “SFMoMA is one of the few museums in the country that are truly dedicated to preserving its collection in perpetuity. The museum has been restored", "The next Biennial should take place in 2020. “The richness and depth of this collection make it a classic example of the Art Nouveau school of design,” said Popp.\n\n\nThe Cynthia and Nelson Mandela Foundation (CMAF) in Johannesburg has released the list of twenty-one artists and organizations that will be featured in “The Blacker the Better: Art and Design in the Struggle to Abolish Apartheid” during the Sixteenth Biennial of the African National Congress (ANC) in Cape Town, South Africa, later this month.The twenty-four artists are: Imana Abunu, Cheryl Anderson, Catherine Amedee, Ayeleta Akinych, Tarek Akoli, Hannah Ann Brahimi, Rachel Bronkhorst, Ebony Adams, Broderick Brumfield, Doctor Haroon Mirza, Elena Cossu, Hilton Duran, Catherine Garth, Ricky Harrison, Tacita Gilbert, Junya Hiro, Nikki James Hutton, Ebony Hausmann, Hannah Horan, Hila", "The next Biennial should be hosted at a future date. The Biennial was inaugurated by the photographs of the newly liberated Warsaw ghetto by the German photographer Carl Heidegger, and inaugurated by the newly liberated Warsaw ghetto by the artist Wojciech Szymczyk. The 2019 edition was curated by Christopher Woolf.\n\n\nIn a landmark case that could reshape the years ahead, a U.K. court has ruled that the UK must give an American artist, named in the landmark ruling as Hereford, a $7 million contract to carry out a solo exhibition in London in 2023. The artist, a self-taught musician who identifies as an environmentalist and a queer Black person, is seeking to permanently close his landmark exhibition, “The Tree of Life,” for fear that it will be damaged by another exhibition that dealt with the same issue, the prospect of a Black future, at the same venue in 2019.The Court of Appeal for the European Union (CEC) in Strasbourg ruled on August 28 that the contract between the artist and Hereford was “untenable” and stipulated that the artist be paid $6.3 million, but only if the work", "The next Biennial should be held at least every two years. The subjects of this biennial’s Art of the Slow Slow Slow series will be the limits of what is possible and the limits of what the self can become. The next Biennial will be a manifestation of the artist’s own life and will bring together the art of slow and slow slow art.”\n\n\nTania Bruguera, the director of the Riva Art Museum in Mexico City, has accepted the position of director of the Museo de Arte Contemporáneo, Mexico City. Bruguera joins the institution from the Museo de Arte de Mexico (MAS), where she has served as director since 2015. “I’m thrilled to be working with such visionary and dedicated leadership,” said Bruguera. “At a time when the contemporary art world is facing enormous challenges, it is essential that we find new and innovative ways to protect and sustain the museum’s collections and collections of contemporary art. I am delighted that the institution has chosen me to be its next director. I’m eager to contribute to the museum’s ongoing research and to continue to expand", "The next Biennial should be held in the autumn of 2021.\n\n\nThe Santa Fe Art Museum in New Mexico has been forced to cancel the next edition of its Fashion Photography Triennial, which was originally slated to run from March 23 to March 26. The exhibition, which was announced in January 2018, was supposed to focus on the work of thirty-one notable photographers around the world.The news comes on the heels of the museum’s announcement that it is planning to move the exhibition, which was originally scheduled to open in March 2019, to the Santa Fe Museum. The move is expected to lead to a delay of the exhibition, which is currently on hiatus.The Santa Fe Museum has also been forced to postpone the opening of its fourth exhibition, “Triumph of the Human Body: Photography in the 1980s” in March 2020. In an internal memo, director Doris Duke wrote that the move would allow the museum to “complement and integrate with the Museum of Modern Art’s new--and expanded--Fashion Pavilion.” Duke did not mention a possible relocation, but said the change would allow the Museum to focus “more fully on the museum’s portfolio of contemporary photography,” the New York Times", "The next Biennial should be held at the most remote location within the city of Biennale di St. Marko, and will be called “O ai,” a reference to the words of the Italian poet Luigi Assolotti. The theme of the exhibition will be “different times, different places.”\n\n\nThe Christie’s auction house in New York is releasing three new works by East Berlin-born artist Urs Fischer: “Nightfire,” 2018, for the Museum of Modern Art; “The Sirens,” 2019, for the Metropolitan Museum of Art; and “Wu Shan,” 2020, for the Asian Art Museum in Shanghai. The works, which were purchased by the auction house at a Christie’s event in Manhattan on June 21, were displayed in a special exhibition of Fischer’s work that was organized by the museum.Fischer’s first solo exhibition at Christie’s was in 2014, at which point he was part of the group of artists that created the conceptual art installation Waking Life (2016) for the New York installation site. “I’ve been making works in large-scale since the 1970s, but I", "The next Biennial should be held in 2021. The first biennial was held in 1998 and was won by the Los Angeles-based, Californian-based artist Paul Gauguin. In honor of his life and work, the winner received a $25,000 cash prize. The 2019 exhibition, “Tobacco” was staged by the Manhattan-based organization Art Diversità and took place at the Opéra Briand Art Museum in Paris. “Since its inception, Art Diversità has been devoted to exploring the cultural, spiritual, and political dimensions of tobacco,” said Michael Pollak, director of Art Diversità. “The theme of this year’s exhibition is not tobacco, but the role of tobacco in the ongoing struggle against the spread and use of the deadly substance, and how this battle is being fought. ”\n\n\nThe Toronto Folk Art Museum (TFAM) has commissioned artist Deborah Halper to create a new work of modern folk art, a newly commissioned work by Halper that will be unveiled at the museum next month. The installation, “Something New for the Land,” will be part of “Turbo: Contemporary", "The next Biennial should take place in the spring of 2021. In the interim, the Art Newspaper is hosting an online edition of the event, which will be accompanied by a special exhibition titled Art at 60. \n\n\nAfter sitting for nearly three years at the helm of the New York City Department of Cultural Affairs, Mayor Bill de Blasio announced today that it is planning to lay off or furlough more than one hundred employees as part of a $2.5 billion restructuring of the government’s arts and culture agencies. In a statement, de Blasio said the cuts will help ensure the agency’s long-term financial sustainability.“The arts and culture sector supports New York City’s economy and is critical for our community,” de Blasio said in a statement. “This reorganization will ensure the financial health of the arts and culture agencies while ensuring that our city’s artistic and cultural organizations remain vibrant and viable for future generations. The restructuring also ensures the long-term sustainability of the arts and culture programs. At a time when arts and culture is at the center of our nation’s political and social life, this reorganization will ensure the arts and culture programs are there for future generations.”The", "The next Biennial should be held in 2020 and the first in 2021. The 2020 edition will include work by thirty-six artists, including Roberto Cipolletta, Claudio Sanzio, and Eva Hesse, and will run for ten weeks. The 2022 edition will feature work by fifty-nine artists, including Janice Hoenig, Ann Corrigan, and Noah Friedman, and will run for twelve weeks. The 2023 edition will be organized by the same organizers as the 2020 edition, and will feature work by seventy-two artists, including David C. Driskell, James LaBouy, and Ruth Rinehart.The 2019 edition of the Biennial was held at the Whitney Museum of American Art, New York; at the Art Institute of Chicago; and at the Museum of Contemporary Art Chicago.The 2020 edition will be staged at the new Museum of Contemporary Art Chicago (MOAC), where the eighty-third edition of the Biennial will take place. The exhibition will also be the brainchild of architect Mark D. Gallo, whose family owned and operated company, Galen Gallo Architects, is a principal sponsor of the 2020 event. Gallo also serves as a trustee of the museum and is a member of the", "The next Biennial should take place in 2021.\n\nA series of exhibitions, screenings, write-ups, and other events are planned for the 90th anniversary of the United Nations, which will take place in December. Organizers cited the current global health crisis—which has killed more than five million people in the planet’s deadliest outbreak in decades—as a reason for cancelling the event. \n\nThe Bolshoi State Museum in Moscow has appointed Nina Bechda as its next director. Bechda will take up the post in December. She currently serves as director of the St. Petersburg’s Kunsthal in the Russian capital, which opened its first studio complex in the city in 1974.“Nina is a global leader in her field, whose achievements will help us to continue the development of the museum’s collection and exhibition programme,” said Nadezhda Guseva, chair of the museum’s board of directors. “Nina was born and raised in Moscow, and studied at the Academy of Fine Arts in the capital for several years, before moving to the State Museum to study at the Siberian Academy of Fine Arts. She now has more than twenty years of", "The next Biennial should be held in the spring of 2022.\n\n\nThe New Zealand Museum of Art (NZMA) has received a whopping $52 million donation from businessman and collector Peter Salter. The donation includes a series of works by the American painter Richard Avedon: The Black Bird, 1965, a sculpture that was part of the series “Avedon: Painting with Natural Light” (1962–1967), and “Avedon: Photomontage” (1970–1979), as well as original works by the artist Audrey Kauders.Salter announced the gift in a statement on Friday, May 8, following the opening of a New Zealand pavilion at the Fifty-Ninth Venice Biennale, which took place in the city of Venice from May 28 to May 31. The institution will include the works in “Peter Salter: The Art of Photography” (2019) and the photography exhibition “Richard Avedon: The Black Bird.”The works of Avedon, a Scottish sculptor who was born in Edinburgh in 1932, and Kauders, a German painter who lived and worked in Berlin from 1967 to 1979, are among the works that will be presented", "The next Biennial should take place in 2020. If the event is not postponed, it will mark the first time the exhibition has been held in the Swedish capital in its twenty-fifth year. The exhibition will also mark the first time the exhibition is being held by a Swedish director–at-large.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than two hundred photographs by American photographer Margo Foster. The work, which was acquired by the museum in 2016 from the estate of the late artist and educator Robert Irwin, is the second Foster collection to be gifted to the institution since 1997. The first, which was acquired by the Foster estate in 1971, contained photographs of Foster’s late wife, Karen, and their three children, Chloe, six, and four months-old Chloe Foster.The Foster children were adopted by the estate in 2011 and 2012, respectively. The estate has since donated more than 1,400 photographs by Foster to the museum, which has previously displayed the works in its collection. The Foster archive has recently been digitized and is now accessible online.The Foster estate is represented by Beverly Hills-based attorney Donald W. Fowler. Fowler has represented the estate in numerous legal battles, including one involving", "The next Biennial should begin on Monday, March 22, 2019, and conclude on Wednesday, March 26, 2020. The event will be hosted at the New Museum through June 21, 2020.\n\n\nThe Latest from the Museum of Modern Art (MoMA), the Art Institute of Chicago (ICA) and the Â’s American Art Museum (AAM) in New York have announced that they have reached a settlement with the Department of Labor over their temporary closure due to the Covid-19 pandemic and are reopening on March 16. “We’re delighted to have reached this milestone,” said Ilan St. James, chair of the AAM board of trustees and president of the American Art Museum, which moved to its new home in an 18,000-square-foot former manufacturing facility in the city of West Des Moines, Iowa, in 2017. “This was a challenging and emotionally wrenching decision for all of us, especially for families and friends who had dinner with the AAM board and were so excited about the renovation and expansion of the contemporary art museum. We’ve made a personal commitment to the AAM for nearly twenty years and will continue to do so through the new museum�", "The next Biennial should be held in 2022. The show will feature three works by the artist, including a selection of his Sidelong Project three decades ago, which is currently on view at the Biennial, and one work by Kasimasa Mochizuki, which will also be on view at the World Art Museum in Tokyo, in July 2020. The show will also receive a portion of the proceeds from the sale of the works and will be given a book-length edition.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of twenty-eight works by artist Harry A. Nava. The donation includes works by artists such as George Condo, Joan Miró, and T.S. Mitchell, as well as pieces by young and unknown artists, including Simone Leigh, Sigrid Parsons, and Michael Nyman.“The Nava Collection reflects a museum founded on the vision of an important and influential generation of American artists, at a pivotal moment in the evolution of contemporary art,” said Richard Gold, director of the museum. “We are grateful to George Condo, Joan Miró, T.S. Mitchell, and their peers for believing in us and", "The next Biennial should be held in 2020. Art, and especially architecture, is an art form that has historically been defined by the loss and restoration of art; and that has historically been about the artist as a labor and artist in service. We are excited to continue this tradition with the new exhibition, which will present the artists' work in a contemporary way. We believe that the exhibition can open new creative paths for the artists and encourage new generations to recognize the historic and structural significance of their work. This year’s exhibition, “Art in Action: The Contemporary Art of Yinka Shonibare,” features work by forty-eight artists, including Donald Boudreaux, David Goldblatt, Léa Grady, Lecraige de Blas, and Lisa Magid, and is on view until January 11.  Last year, the Biennale featured work by seventy-four artists.\n\n\nArts Foundation Singapore (AFSC Singapore) is launching a new cultural initiative on the island of Vientiane, a UNESCO World Heritage site that was damaged by a 7.9 magnitude earthquake in March 2017, as part of its commitment to conservation and restoration work. The initiative, titled Art", "The next Biennial should give a documentary account of the people who have inhabited the Sierra Nevada and will include a project by artist and architect Rem Kool, whose architectural practice has been involved in the preservation of the region for more than fifty years, to examine how a continuous series of events can transform a landscape in a lifetime. The exhibition will also bring to light the region’s history and culture through the work of the artist-run nonprofit the Sierra Nevada Foundation.“The Art of the Sierra Nevada” is supported through the generosity of the following individuals and organizations:Alfred W. Abbott, Jr.,SMUN, New York; William Mayhew, London; William Thomas, Oxford; and those who have made generous gifts to the museum, including:Peter Becker, New York; David Bradford, London; Michael Bloomberg, New York; and the New York Philharmonic.\n\n\nThe Carnegie Museum of Art in Pittsburgh has become the latest arts institution to welcome two new members: artist-run nonprofit the Contemporary Art Alliance (CA), and the American Indian Movement (AIM). The move comes on the heels of the opening this fall of the Contemporary Art Archive, a new public art project based in the city’s historic St. Vitus", "The next Biennial should focus on critical issues that have shaped our history and, where appropriate, on historical sites. The next edition of the Istanbul Biennial will focus on the population of Istanbul and the city’s history, with a particular focus on the influence of the Ottomans and the first Islamic rulers. In addition, the exhibition will include an exhibition of work by international artists.”While the conflict in Syria seems to be the largest international security threat to Europe as a whole, the exhibition’s director, Nima Nabavi, said that the event would focus on the “current state of affairs in Europe and the world.” The exhibition will feature works by more than forty international artists who will collaborate with Nabavi to create an immersive new work, The River, which will comprise hundreds of photographs of the Euphrates and the Mediterranean, and will open in August 2020.The Venice Architecture Biennial will also present a work by the Italian artist Endre Grosante, who is best known for creating intricate, layered sculptures that explore the concept of memory, in the name of memory. The artist will create a work for the exhibition titled The Memory of a Memory Landscape, which is scheduled to run in the exhibition’s", "The next Biennial should be held in the Spring of 2020, at a date yet to be determined. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning on taking the drastic step of terminating its relationship with Honeywell International, the US-based manufacturer of the iconic security system Honeywell Checkerboard (HCB), in an attempt to reduce its carbon footprint and carbon footprint business.According to a statement issued by MoCA, the decision to cease production of Honeywell products came about three years ago, after it learned that Honeywell had installed more than 150,000 pounds of cement into its walls in an attempt to reduce the amount of rainwater that gathered in the facility.Since Honeywell Checkerboard is the same material and has the same chemical formula as cement, the company can be traced back to Honeywell. In 2015, MoCA tried to launch an initiative to help the company reduce its carbon footprint by donating 5,000 pounds of cement to nine local nonprofit organizations that were trying to reduce their carbon footprints. The organization was able to reduce the amount of cement by 1,500 pounds after the nonprofit organizations agreed to take the cement and other materials and sell the products that were made with the cement and other materials.MoCA", "The next Biennial should take place in 2020 and will be open to the public.\n\n\nThe High Museum in Beijing has received a gift of more than four thousand paintings and drawings by two of the most celebrated Chinese painters of the twentieth century, Mao Tse-tung and Li Yizhou, from the late collector and collector-donor Wang Ling-lin. Remarking on the gift, Wang said: “The museum has been a treasure for my family and we are very excited to welcome the works to the collection. The collection includes works by Mao Tse-tung, Li Yizhou, and many others that will be of great interest to scholars.”The donation of the building-sized works to the museum came two weeks after the institution received a gift of more than two thousand works by Liu Yiluang, the wife of Wang. Liu Yiluang, who was a longtime collector of Wang’s works and an avid collector of his own, donated the works to the museum in 2000 after her husband died. As part of the donation, the museum is now able to display the work the wife made for her husband’s three sons, Liu Yiluang Liu Yu, Liu Yiz", "The next Biennial should be held in 2021.\n\n\nAn eighteen-foot-tall bronze statue of General Lee Harvey Oswald in Dallas has been moved from its pedestal in front of the Museum of Fine Arts (MoFA) in Houston, Texas, to its permanent collection. The eighty-three-foot-tall bronze sculpture, titled A Time to Kill, was installed in 1968 by sculptor Charles Eisendrache, who also designed several works that have recently been restored to life.Founded in New York in 1972, the MoFA is a major arts museum and collection that recently celebrated its fiftieth anniversary. To mark the occasion, MoFA director John Akomfrah commissioned sculptor Robert Irwin to create the installation, “Composition of Images,” for the July 7, 1973, commemoration of the seventy-fifth anniversary of the assassination of Martin Luther King Jr. The work, which consists of four images of Johnson and Oswald, was presented in a Dallas courtroom in a case brought by the National Association for the Preservation of American Art.The same year as A Time to Kill, the MoFA also collaborated with the Dallas Cowboys to create a new tribute to the late quarterback and NFL champion George Halas. Titled “", "The next Biennial should also make its mark on the development of the arts and should reflect the spirit of the festival,” said UFCW national president Alex Rigby. “The 2020 edition of the Biennial will explore the contributions of women and people of colour to the art of France and the world. We are confident that the next edition will reflect the spirit of the themes and the themes of the previous two years.” The 2019 edition, “Ce n’scher bei Paris,” was staged by the Paris-based company LégerTélécom and attracted more than sixty thousand visitors.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has terminated its relationship with the Diogenes Club after learning that one of its former interns had made derogatory comments about Adolf Hitler and the Nazi party on social media. In a statement released today, the museum said that it “regrettedly neglected to address the allegations in the first place.” The statement also dismissed the Diogenes Club’s attempt to have the Museum’s board of directors remove the exhibition from its premises after it received the Nazi Veterans’ Memorial Dinner in October 2016. In", "The next Biennial should take place in 2021 and will be hosted by the Museo de Arte Contemporáneo Arte de Lima, Lima, Peru. \n\n\nThe Hunter Museum in Birmingham, United Kingdom, has received a gift of two 19th-century African American artworks by two of the most celebrated South African artists of the last century, Don Quixote and Barry Williams. The gift was made by the descendants of King Kaka II of Nigeria in a ceremony at the museum on Saturday, November 15.The gift was made by Cecil Kinch, the late owner of the Elephant and Castle, and his daughter, Anna Kinch, who worked in the conservation and exhibition field with Cecil and Kaka’s son, Kaka II. The works, a painting titled The King and the Beast and a drawing called The King and the Beast, were stolen by Kaka II from the Elephant and Castle in 1977 and were presumed lost until his death.The new works were discovered by Kaka II’s daughter, who was working in the archive of the King Kaka Foundation, a charity that supports the royal family. Upon learning of the discovery, Kaka II donated the works to the museum. The K", "The next Biennial should take place in Tokyo in 2022. \n\n\nThe Museum of Modern Art (MoMA) in New York has released its long-term plan for the future of its beloved Rockefeller Center—based on a $1.2 billion renovation and expansion project that will also include the construction of a new Visitor Center and an adjacent, larger building that houses the museum, the Metropolitan Museum of Art, and the Whitney Museum of American Art.The museum’s director, Daniel H. Weiss, said that the renovation and expansion project will 'enhance the experience for every visitor, while providing a new and compelling chapter for Piazza.’“Our plan for the museum is as ambitious as the renovation and expansion project itself,” Weiss said in a statement. “We envision a future as a center for innovative, interdisciplinary storytelling that embraces the building as a platform for meaningful conversations about ideas and the world. We envision an array of exhibitions, programs, and presentations that will engage with and include the Rockefeller Center’s collection in meaningful ways. We envision a future where MoMA continues to thrive as a global platform for artistic creativity and reflection, and where we are able to extend the museum’s reach in ways", "The next Biennial should be held at the University of Amsterdam next year.  The exhibition will be co-organized by architect Bertram de Gruijthuijsen, writer Michel Houellebecq, artist Alighiero Celant, and philosopher Herbert Suss. The theme of the twenty-third edition is “The Practice of Architecture.” The biennial will be organized as follows: “The Museum of Architecture, The Faculty of Arts and Design, the Museum of Contemporary Art, The Academy of Fine Arts, The Museum of Modern Art, The Museum of Modern Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary Art, The Museum of Contemporary", "The next Biennial should be selected by the Board of Directors of the Museum of Contemporary Art (MoCA) in 2020. The theme for the next event is “Revitalization.” Art historians, curators, and scholars will present their work in a variety of ways, including by presenting it as a retrospective, a performance, a book, an exhibition, a radio series, an exhibition, a performance, a film, a video, and an exhibition. The biennial will be held in different locations, including at public sites such as the Museum of Contemporary Art, Miami Beach (MCA), and the Museum of Modern Art in New York.The 2020 edition of the biennial, “The Power of Place,” will be held at the Arts District, the former site of the Bank of the Arts, in Miami Beach. The biennial will also reimagine the building of its exhibitions and the exhibition program at the Museum of Contemporary Art, Miami Beach. The site will also allow the museum to engage with the local community through new ways to provide a place of worship for the homeless and by expanding the collection and outreach programs at the museum.The 1970 exhibition “The World is Not Enough,” which explores the relationship between", "The next Biennial should take place in 2021. The biennial will be a follow-up to the centenary celebrations, which were organized and choreographed by the National Gallery of Art (Greenwich Art Museum, New York) and the New Museum (New York); it will take place at a time of great change for humanity.“I’ve been thinking about the years ahead—what sort of a timeline for the art that's created in the twenty-first century will be the right mix of health, history, contemporary, and art-historical,” said David Gordon, chair of the New Museum’s board of trustees. Some biennials, like the 2019 biennial “The Eye of an Artist,” were staged under the leadership of Michael Derrick, who led the Metropolitan Museum of Art’s Human Resources department; the issue of sustainability is one that Gordon intends to address in the biennial.\n\n\nThe Sydney Opera House and the National Gallery of Australia have announced that they have reached an agreement that will see more than $44 million in public funds diverted from the construction of the National Gallery’s new headquarters in Canberra, where it is currently being constructed on a site that is currently home to the Adelaide", "The next Biennial should include an exhibition of the work of eight artists whose accounts in the last twenty years have made a significant contribution to the understanding of the art of the biennial. This year’s exhibition will create a symposium of literatures, aesthetics, and the sciences, which will be organized as a dialogue between the curators of the two biennials. The symposium will present the works in various ways, including through the work of the artists for whom the exhibition is devoted.It will also mount an exhibition of work by artists whose work is currently under close observation, including a retrospective of the work of the Swiss artist Annemiek van der Waals and the exhibition of the works of the Dutch artist Jan Geuten (New York, 2018). A selection of the biennial’s artistic highlights will also be presented during the biennial’s fifty-eighth edition (2019), which will be held in Zurich from November 8 to November 12.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has launched an online petition to protest the removal of a landmark work by American artist Dario Cattelan, a leading member of the Luminary, a group of artists who collectively created the central work", "The next Biennial should be ready to go in September 2021, and the inaugural exhibition should be opened by October. The project is being overseen by director Øystrop Öffel, director of the Stedelijk Museum in Amsterdam. “The Biennial of Young Art is the most important event of its kind in the world, and I am very excited to present it to the public,” Mr. Öffel said.\n\n\n\n\n\nACM Biennial 2020: Free to the Public, ‎Dressed to Kill, Part 2, Dubai, United Arab Emirates, December 21–January 3, 2020, Art + Art.Coachella Valley Music and Arts Festival, California; Art + Art: The Future Is Present, New York, January 16–January 22, 2020, Art + Art: The Future Is Present; Art + Art: The Future Is Present, New York, January 18–January 21, 2020, Art + Art: The Future Is Present, New York, January 22, 2020, Art + Art: The Future Is Present, New York, January 19–January 21, 2020, Art + Art: The Future Is Present, New York, January 24, 2020, Art", "The next Biennial should take place in 2021. The 2020 iteration, titled “After the Fall,” showcased work by forty-one artists, including Nari Ward, Lise Nylund, Kenichi Nakamura, and Juan Luis Campos.\n\n\nThe New Art Exchange (NEX), a new program that seeks to increase awareness of contemporary art, has announced that it will present the first exhibition dedicated to Japanese modern art at its new venue in the city of Kyoto, Japan—the New Art Exchange (NEX) will host the exhibition alongside the Thirteenth Biennial of the Landscape, a competition-based initiative that is centered on architecture and design in Tokyo.“The partnership is a continuation of NEX’s strategy to collaborate with Japanese artists and institutions for the promotion of their work and to introduce new works by the artists,” said Nishi Yanagihara, director of NEX. “The artists are collaborating for the first time in Japan with NEX and are excited about the collaboration. NEX is a new force in modern art, and the collaboration will strengthen the program.”The inaugural exhibition—comprising works by thirty-six artists—and the forthcoming Thirteenth Biennial will open", "The next Biennial should be held in 2021. \n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Peter Schiffmann as its next executive director. Schiffmann will be the museum’s first director since its founding in 1888 and will assume his post in January 2021. He succeeds Adrian Piper, who stepped down in April after a decade at the helm of the institution.“Peter Schiffmann’s background as a curator, educator, and writer uniquely aligns with the Guggenheim’s mission to present an important work on contemporary art from a specialist perspective, ” said Adrian Piper. “Peter’s leadership and proven track in bringing our art in one place and on one occasion, in one museum, makes him well positioned to reflect our vision for the future. We look forward to welcoming him to the Guggenheim, and to working with him to expand our current collection and to develop new exhibitions and programs.”Schiffmann previously served as the executive director of the National Gallery of Art, the Smithsonian American Art Museum, and the National Museum of American Art, and has been the executive director of the Shiloh Art Museum in New York.", "The next Biennial should be held in 2020, and the next may be held in the latter. In 2001, Anne-Marie Delange, a curator and independent curator in Paris, found herself at a similar moment in her career; she had just won the Prix de l'histoire du Monde and was about to open an institute in Mechelen. Delange painted the work, titled Gesençis, in the spring of 1965.In this pictorial account of the artist’s life, Delange uses drawings as a vehicle for capturing the sentimentality and the intimate relationships between the entities who populate her work, which draws from a wide range of European and American art and philosophy. Delange’s drawings have appeared in art books, in museums, and in many other publications. The first instalment of the Gallery Biennial will focus on the artist’s work and will open in August 2020, with the biennial’s second installment in October 2021.\n\n\nThe Center for Art and Public Life (CAMP) at Columbia College Chicago has received a gift of seventy artworks from the Tate in London this year. The center recently gifted A.I.R. Gallery at the Institute of", "The next Biennial should be held in 2021, but the trustees have stated that the date will be decided by the TIAA’s board of directors. The biennial will be open to the public in exhibition form, with an adult-focused exhibition of the artist-designed spaces for which the TIAA is currently working.\n\n\nGillian Wearing is to be awarded the £1.7 million Bill and Melinda Gates Foundation Prize for her lifetime achievement in inventing and advancing the art of photography. The foundation announced the award in conjunction with this year’s Art Issue, entitled No More Dark, which will arrive in stores on September 21. Its two-part survey, which was commissioned by the photographer, will examine the ways in which photography has affected the world since 1897, and will include contributions by the photographer’s peers, his contemporaries and contemporary collaborators, and those who have influenced him. Wearing, a British author and curator, has been described by the artist and her son, Gavin, as one of the founding fathers of the art-world, a legacy encompassing photography, photography-as-a-service, photography-as-a-medium, photography-making, photography-phot", "The next Biennial should be held in the spring of 2021. However, the museum is currently assessing the logistics of hosting the event and has yet to set a date. The exhibition will be housed in a new building designed by architect Daniel H. Pink, which will be inaugurated in May 2021 and will feature more than 1,500 works by contemporary artists.\n\n\nThe Jerry Lee Foundation announced on Monday that it will donate twenty-five works by twenty-five artists to the Getty Center in Los Angeles\u0097the same institution that recently collaborated with artist Marc Quinn to create a new series of public programs to engage with social justice issues\u0097as part of its new initiative for local artists. The twenty-five works will be curated by Susanna B. King and will be presented in conjunction with the Getty’s annual Community Series, which will present the works of thirty-five artists from thirty-six cities across the United States.The works will be housed in the Getty’s new building, which is currently being constructed, on West Twenty-Second Street in Los Angeles. The construction of the structure, which is being financed with $61 million donated by the foundation, began in 2019 and is expected to be completed in 2020. The site is also being", "The next Biennial should take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it will donate two hundred works by fifty-six artists and collectives that have been altered since the institution’s founding by the California–born industrialist Al Campbell in 1960. The works are part of the “Art of the Displaced: Antinuities and Transfigurations” series, which will distribute the donated works in the Los Angeles area. The works were created using a process that involves heated salt water and saltpetre and will be exhibited in the first exhibition of the series at the museum, which will be staged in 2020, at the Kimmel Center for the Arts in Los Angeles.Inaugurating the series are The Long Day, 2019, a triptych painted on a single sheet of cardboard, and “Unbreakable,” 2019, a six-by-eight-foot work on paper. The installation will be presented as part of a special “art of displacement” display at the Kimmel. The work will also be featured in the 2019 iteration of “Art in Motion” at the Warner Brothers Studio Museum in Los Angeles.The works by", "The next Biennial should be held in 2021.矮人矮人: My name is Haig Ehrlich, and I am the director of the Art Institute of Chicago. I am very excited about the project.”The seventh edition of the event, which was held at the Art Institute of Chicago from November 24 to December 5, will be held in 2021. The board of trustees announced that the seventy-third edition of the festival will be held in 2022.\n\n\nThe OMA in New York has been awarded a $50,000 grant from the David and Lucile Packer Foundation, which is also providing funds for the restoration of the museum’s Tudor Revival building and for the commission of a new work by the late American painter and sculptor Walter de Maize.The organization also announced that it will commission the American artist Lawrence Abu Hamdan to create a new work for the new exhibition venue, which will sit in the basement of the museum in the summer of 2021. In the works’ first exhibition, the artist will create a miniature of the Tudor Revival, which was completed in 1834 and inspired countless works of the same cast by the Packer Foundation, which were added to the museum’s", "The next Biennial should take place in Ethiopia, and will be held at the Art and History Center in Guggenheim, the Museum of African Art, and the Museum of Modern Art, New York.\n\n\nThe Metropolitan Museum of Art in New York has appointed John Lynch as its new deputy director for collections and exhibitions. He is one of four people selected to lead the museum next year and will assume his new post on December 1. Lynch comes to the Met from the Chicago-based firm of Kaufman, Dunn, Robinson, and Graf, which is based in Florence, Italy, and has represented the firm in the United States, Italy, South Africa, and the United Kingdom.“John is an expert in the art of collecting, and is well positioned to further our partnership with a truly global network of collectors, especially in the art world,” said Museum director Daniel H. Weiss. “We are thrilled that John is joining us and look forward to his leadership role in organizing and expanding our collection and exhibitions.” The new role will be led by deputy director for collections and exhibitions Lorraine J. Matech, who previously served as assistant director for collections at the Metropolitan Museum of Art in New York", "The next Biennial should be in 2021. Los Angeles: Artists and Institutions (Los Angeles) PRIMARY, 2019.   Venice Arts, Exhibition 5, 2019. New York: Artists and Institutions (New York) PRIMARY, 2019. Chicago: Artists and Institutions (Chicago) PRIMARY, 2019. Los Angeles: Artists and Institutions (Los Angeles) PRIMARY, 2019. New York: Artists and Institutions (New York) PRIMARY, 2019. Los Angeles: Artists and Institutions (Los Angeles) PRIMARY, 2019. New York: Artists and Institutions (New York) PRIMARY, 2019. Los Angeles: Artists and Institutions (Los Angeles) PRIMARY, 2019. Los Angeles: Artists and Institutions (Los Angeles) PRIMARY, 2019. Los Angeles: Artists and Institutions (Los Angeles) PRIMARY, 2019. Los Angeles: Artists and Institutions (Los Angeles) PRIMARY, 2019. Los Angeles: Art", "The next Biennial should take place in 2019.\n\n\nThe Pérez Art Museum in Madrid, the Pérez de la Peña, and the Pérez de la Habana in Mexico City are among the five cities in the world that are trying to pack the United States’s three-day Memorial Day weekend, which is traditionally a time for reflection, activism, and remembrance. The push to keep the nation’s parks and wildlife intact comes at a time when many governors are reconsidering their public lands and outdoor spaces, and others are considering bonuses and rebates for landowners.In an attempt to mitigate the environmental devastation caused by mining, oil, and other industries, President Donald Trump signed an executive order on Tuesday that aims to cut the $3.4 billion in federal funding that supports the American Alliance of Forestry (A4F), which advocates for the removal of unnecessary and costly federal regulation, and redirects funds away from land conservation and toward energy efficiency and conservation.  In a statement, A4F said that the executive order will “protect and support the existing, essential, and most frustratingly diverse, American forestry ecosystem.”The move", "The next Biennial should be held in 2022, and the twenty-fifth in 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it is working with the Museum of Contemporary Art (LMNA), Chicago, to launch a new public platform devoted to the work of the American designer, architect, and urban designer, known for his minimalist, conceptual, and sculptural works, in the city. Called the 'First American Curator,” the curatorial program will be hosted by the LA County Museum of Art from September 11 to September 13, 2021.“In this transition to an online format, we will continue to support the museum as it implements new and innovative ways to engage the public in its collection, display, and research, and we will continue to expand our programming with a view to becoming a central hub for curating and research in the United States,” said Liz Bier, director of the Los Angeles County Museum of Art.The partnership between the two institutions comes amid a reshuffling of the museum’s collection, which has encountered a number of changes in the last few years. The institution now has more than twenty thousand works by the American artist, including several modern masterworks, and", "The next Biennial should take place at the newly renovated Albright-Knox Art Museum, and the biennial of American art, which also includes a performance, a book launch, and an exhibition, should be announced by late June.Earlier this month, the Museum of Modern Art announced its plans to open a new space in the historic Armory Buildings, and it also recently completed the expansion of the museum’s collection. The institution estimates that the completion of the project will bring the total number of works on display in the new space to fifty thousand. The renovations added more than 2,200 square feet of galleries, restored 18th-century rooms, and added a new installation of works by the late French avant-garde artist Jean-Michel Basquiat.\n\n\nThe National Geographic Society’s plan to pull nearly two hundred books and pamphlets from its extensive collection in Washington, DC, is slated to begin in April, following a delay due to the Covid-19 pandemic. The move follows a September 19 announcement that the exhibition would be canceled. The move was made in an attempt to minimize exposure to Covid-19, the novel coronavirus, and to focus on books and pamphlets that were published in the", "The next Biennial should be held in 2021, said the organizers, who stated that the theme would be “compassion, resilience, and purpose.” The 2019 edition of the event, titled “The Unfolding,” addressed the themes of death and the afterlife. The 2020 edition, “Thearcheological Experience,” will focus on the process of reconstruction.  The exhibition will also celebrate the 150th anniversary of the Dutch-born, Paris-based artist Gerrit van der Meijland, son of the late financier Josef van der Meijland of the name van der Meijland Group. The artist will be represented by the artist’s studio, which will also host the artwork of the same name in a permanent exhibition.The biennial will consist of sixty paintings by twenty artists, including Frank Gauguin, Pablo Picasso, Mark Spitz, Frank Gehry, Lucio Fontana, Jean-Michel Basquiat, Takuji Kondo, and James Swallow. The biennial will be preceded by a symposium, “The Future of Painting,” in February 2020.The full list of participating artists is as follows: ", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has launched a new digital platform that will allow visitors to view a selection of work by contemporary artists and collectives and will initially focus only on works on paper. The platform, which will debut on April 8, will allow visitors to see works by just five artists at a time: Adam Clayton, David Choe, Katja Klima, and Edith Heath. To view works by the artists represented in the exhibition, a visitor must register with the museum, which will connect them to the artists through a digital platform that will allow individuals to cast their votes.The platform will also feature a new collection of works by artists such as Nicole Holofernes, Zoya Mestiz, Jacky Mansoor, and Claudia Brugotti. The selection will be announced in the coming weeks.The museum is currently working on a redesign that will incorporate more contemporary elements, including new sculptures and installations by artists such as Karl Lagerfeldt and Robert Irwin, but the redesign is expected to be completed by the 2020–21 season and will not be unveiled until the spring of 2021. The redesign was made", "The next Biennial should take place in the spring of 2020. It will, among other things, bring together artists from the twenty-first century, including a group from the twenty-second century and one from the twenty-third century.The list of invited artists includes Lars-Ingrid Eriksson, who is currently working on a new work for the exhibition “NIRIN: From the Micro to the Infinite,” a project that will involve the collection of twenty-six works from contemporary art and will begin in March 2020. Biennial director Harald Szeemann, who is also the director of the Bechleff Gallery in Stockholm, said: “The biennial is a project of the global generation. It was founded by a young Swedish artist, Harald Szeemann, who has been a champion of the new. He inspired the visionary, the visionary, and the visionary. We are delighted to follow his lead and to continue the work of introducing new perspectives to the exhibition.”\n\n\nThe Sharjah Art Foundation (SFAF) and the Art Newspaper (ANI) have announced that the museum’s inaugural exhibition “Art in the City,” will be held in the downtown Sharjah", "The next Biennial should be held in 2020.\n\n\nThe Pérez Art Museum (PAM) in Madrid and the Galeria Arcigales in Granada unveiled plans for the construction of a new fifty-thousand-square-meter exhibition space in the historic building of the Santander Group, the world’s largest art producer, in Madrid.PAM director Manuela Martínez de Castro told the Art Newspaper that the institution will build the Pérez Art Museum after paying an undisclosed sum to the former owners of the building, who are currently probed over the company’s alleged irregularities in its relationship with the Santander Group from the Spanish Ministry of Culture. The Pérez Art Museum will occupy a former workshop designed by the company. The building will be located in the municipality of Santa Fe, near the city of Seville, and will have a contemporary design by the architect Rodolfo Solmi.Solmi told the Art Newspaper: “This is a landmark building, a modern and contemporary museum, which will be a test for the Pérez Art Museum. It will be a stepping stone for Pérez Art Museum into the future. The Pérez Art Museum will be a public space, where artists", "The next Biennial should be held in 2021. The first was held in 2007.\n\n\nThe Museum of Modern Art (MoMA) in New York has officially launched an online survey of the work of John David Lewis, a leading modernist whose work explores notions of space, time, and form throughout his nearly forty-year career. The biennial, titled “For the Future of Art,” will run on the museum’s website, which will be updated biweekly, as well as at the museum’s newly renovated and expanded John Simon Guggenheim–designed building from January 20 to March 13, 2021.Curated by Stuart Bloom and Katherine Hoch, the biennial will feature works by thirty-nine artists, including David H. Kennicott, James K. Polk, and Sally Potter, among others whose work was featured in the exhibition “100 Years of Modern Art.”“John David Lewis’s art is an essential part of our culture’s history, and a reminder that the human condition is complex, interconnected, and multilayered,” said curator and deputy director Anna Chiu. “His work continues to shape our own understanding of art and art history,", "The next Biennial should be held in 2022. “For over forty years, we have been creating works that address contemporary issues, and that are collaborative, carefully thought out, and grounded in the highest ideals of art,” said artist and curator Stéphane Berthot, who is collaborating with artists such as Louise-Marie Curie and Jacques-Antoine Fortin to create a new stakeholder series called “Action Points” that will compare contemporary art and politics.The 2020 edition, which will be held at the Musee Nacional Centro de Artes in Mexico City, was announced in April. Its organizers said that the event will focus on themes of culture, economics, and climate change, and will be “driven by a personal commitment to art,” “by a deep appreciation of the art it represents, and by a desire to remake a better future for art.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has named Christine Dayan as its new executive director. Dayan comes to the museum from the American Alliance of Museums (AAM), where she has served as deputy director and chief curator since 2011. Previously, she was the chief curator at the Smithsonian American", "The next Biennial should be held in 2021. “We are acutely aware of the current significance and enduring value of the record of the London 2012 Games, and the continuing impact of the Arts and Design District in the city, and we are confident that the 2019 edition will deliver the largest and most ambitious exhibition ever staged in London, and meet the expectations of the local and international art community,” said Louise Richardson, chair of the board of trustees.The biennial will also introduce a new exhibition format that will include the rare wide-ranging exhibition of work that has not yet been exhibited in the UK. Named after the British artist Robert Reich, the exhibition will consist of twenty-one solo exhibitions, ten documentaries, and an exhibition of works by the artist-in-residence, Jinx Xin.The biennial will mark the new partnership between Tate and Art Gallery of Great Britain, with the unveiling of the first exhibition in the new partnership, “In the Picture Room.” The biennial will also feature work by some of the world’s most important contemporary artists. Artists include Naguib Mahfoujima, Nargis Kambayi, and Pia Camil. The show will be", "The next Biennial should be held in 2019. The suggestion is to hold the first one in the autumn.\n\n\nThe Bienal Theatre Company (BTC) in London announced today that it has invited two artists to collaborate with the company in an exhibition that will take place at the Bienal in 2021. The artists in question are Timur Sawa and Isaac Chiu, who will collaborate with BTC to perform a new project that addresses the relationship between art and everyday life in the city of Bristol.“Timur Sawa’s work is a powerful statement about how we all need to be more connected with nature and with one another,” said Bienal director Shona Johnson. “Isaac Chiu’s world-class performance brings a sense of humor to our world, and his performance of the same title will delight audiences for years to come.” The new work will be based on a concept introduced in his 2007 essay “Realism and Cynicism” in which he asks: “What precisely is art, and what does it have to do with life and death?” The work will be presented by the Bienal at the Gallery of Modern Art in London", "The next Biennial should be held at least once a year. Seasonal events should be scheduled around the year. For example, a biennial for August might be staged in September or October. Wildlife conservationists and conservation organizations might decide to create conservation shows.A biennial would not be a museum and would not be connected to a museum, which is an institution that houses the museum. It would be a collective work, composed of biennials that engage with different themes of conservation, such as the environment and the natural world. The museum would receive visitors through a series of doors in a former steel mill.The symposiums would be taped and distributed over three quarters of an hour on a secure digital network. The first half of the event would be devoted to a discussion of the themes and methods of the symposia; the second half to a discussion of the theme of the biennial. “The theme of the Biennial is an opportunity to act as a catalyst to promote awareness and understanding of conservation,” said Jean-Jacques Baumann, chairman of the board of directors of the Biennial de Lyon. “And so it has always been with us. Our aim has always been to create a dialogue between these symposia", "The next Biennial should be staged at the University of São Paulo, the Museu de Arte de São Paulo, or the Museu de Lisboa, among other cities in Brazil. The exhibition will start on August 31 and run until September 2.The 2019 edition of the Biennial was curated by João Pires, who will take over as curator of the exhibition, which will be curated by Maria Iannone, in collaboration with Ilene Krupa-Mena.Commenting on the upcoming edition, Iannone said: “The themes of the exhibition are multidisciplinary, reflecting the diverse histories of art and the various ways in which art is reproduced in the current social and political environment. The exhibition is also a reflection of the history of art in Brazil.”\n\n\nThe Skagerrakt, the Dutch pavilion at the Fifty-Ninth Venice Biennale, has announced that it is expanding its artist-run programs by launching an online platform for contemporary art. Called the “Kampf Bauernsehr Kanalijkeliches,” the site will focus on creating opportunities for cross-cultural exchange in the exhibition. The initiative will allow the Dutch pavilion to collaborate with artists and", "The next Biennial should include a discussion of the role of the female body in contemporary life and the current state of feminism and body politics. “The biennial is in a moment when the discourse around feminism has been transformed by an unprecedented level of cultural and institutional openness,” the festival said in a statement.  The biennial will be hosted by the Radisson Blu Marrakesh, the Marrakesh Art Museum, the Museo de Arte Contemporáneo Marabunta, the Centre Pompidou, and the Palacio de Arte de Barcelona; the Marrakesh Art Museum, the Museum de Arte de Barcelona, the House of the Republic, the Palacio de La República, the Palace of the Republic, the Lezama Museum, and the Palacio de María; and the Palace of the Inquisition. The full list of participating institutions is as follows:\n\nThe Arts Council of Australia (ACTA) has released the list of over seventy Australian arts and cultural organisations that will participate in the 2020 edition of the Art Basel World, slated to run from March 15 to March 17. Organisers said that the 2020 event will bring together more than fifty thousand", "The next Biennial should focus on how contemporary art can be a vehicle for social justice. We need to make art a vehicle for human solidarity, not just a means to an end.  “Art is political as well as it can be a powerful tool for social change,” said Jennifer Scott, artistic director of the biennial. “A full accounting of our art history can reveal how our world has been shaped by and enriched by ahistorical images, and how art has contributed to, and continues to shape, our lives and the world around us.”To purchase a copy of the exhibition, visit the Penn Museum of Art in Philadelphia and the Art Gallery of Ontario.\n\n\nCitations Management System (CMS), a cloud-based service that helps authors create and manage citations for articles published on its platform, has announced that it is closing its doors at the end of March. The news was delivered in a blog post published on March 30.“The changes we made in the last six months make it clear that this is the last iteration of CMS,” the company said. “So we are going to shut down the site and look forward to returning to our original mission of building the most effective and valuable online citation", "The next Biennial should be held at the Palazzo delle Papesse in Milan, Italy, in 2021. The themes for this year’s edition of the exhibition are: 1) Art and Science, 2) Gender, 3) Architecture, and 4) History. The exhibition will be staged in partnership with the Institut d’Art Moderne and will open on September 29. The event will be presented by Marina del Castello and will be hosted by The Belo Horizonte in Cape Town.\n\n\nA group of artists and museum directors in New York City announced today that they are collaborating on an edict that will ensure that the city’s public art remains accessible to the public at large throughout the city’s second phase of the revitalization plan, which will run from March 2022 to March 2024.Under a new set of guidelines, set to go into effect in March 2021, the city will establish a fund that will provide grants for nonessential repairs and improvements to public artwork—including historical monuments, cultural institutions, and historic sites—as well as for the repair and expansion of transportation, utilities, and storage facilities, including museums. The fund will also provide $1.1", "The next Biennial should be held at the Museum of Modern Art, in 2021. \n\n\nThe city of Frankfurt has opened a new art museum, the Berlin Doktorplatz, with a grand opening ceremony on September 23. The German capital’s city hall is also preparing to welcome visitors to its new venue, the Zürich für Kunstverein, on September 26. The newly redesigned museum, which is being built in a former munitions factory, will offer more than 1,800 contemporary art works by forty-nine artists, and will be inaugurated by a series of performances and performances-based events.The museum’s inaugural season will consist of a series of lectures, a workshop series, and a street performance and will run from September 26 to November 23. The space is being constructed by the city of Frankfurt using local materials and will cost €100,000 ($105,000). The museum’s first exhibition, “Adolf Hitler & Contemporary Art,” will be presented by the state-run company Bodega, which will support the project with a loan of twenty-four works. The exhibition will be curated by Ondine Cattelan, the director of the Frankfurt Art", "The next Biennial should be held in January 2020. The trips will be funded by the National Museum of Fine Arts in Washington, DC, and include the first joint exhibition of the two institutions in the United States. The tour will also include the National Gallery of Art in Washington, DC, the Museum of Modern Art in New York, and the Metropolitan Museum of Art in a four-city tour that will take in New York, the Metropolitan Museum of Art, the Museum of Modern Art, and the Chrysler Museum of Art. The Museum of Modern Art will hold a retrospective of the work of artist Mark di Suvero in November 2020 and the Metropolitan Museum of Art will have a group show of the work of Robert Irwin in February 2021.The biennial will consist of two parts: a three-day event in March and a two-day event in April. Biennials have been staged annually since 1986 and have generated strong interest from museums since they can attract large numbers of visitors. The Museum of Modern Art, for instance, has staged thirteen biennials since 1987.\n\n\nThe Museum of Contemporary Art (MoCA), London, is preparing to welcome visitors back to the institution for a second edition of the reopening celebration, called “Connections,�", "The next Biennial should be staged sometime in the 2020s. The next edition will commemorate the centenary of the birth of artist and theorist Bertrand Russell. The next edition will be organized in the same way as the last one, with a selection of works from the collection of the California Institute of Technology (Caltech), Pasadena, the UCLA Art Museum, the Bay Area Art Museum, and the Museum of Contemporary Art (MoCA), St. Louis. “The show will have a new theme, a new collection of photos, a new celebration of a century of the museum’s history with a new exhibition format, and will be guided by a new curator, and our stories will be told through the work of a new team,” said Merry Lebow, director and CEO of the Biennial. “The Biennial is a story of integral collaborations between art and the people it serves. The city of Los Angeles has long been at the forefront of social change, and now we are committed to inspiring, challenging, and redefining the art of the city.”When the biennial was announced in 2009, it was envisioned as a contemporary equivalent of the Venice Biennale. Based on the same model, the", "The next Biennial should take place in 2021.\n\n\nThe Solomon R. Guggenheim Museum in New York is planning to move the exhibition “Blood on the Moon: The Executioner”—a massive, three-hundred-year-old painting by Pablo Picasso that depicts a crucified Christ holding the Cross of Christ—to a different location in the museum. The 50,000-piece work, titled “Christ in the Blood,” will now be displayed in a different space in the museum.The move follows the announcement of the museum’s new public art location, the Solomon R. Guggenheim Museum in Downtown Manhattan, which is currently undergoing a massive expansion. However, the new venue, which will be inaugurated by the museum’s inaugural exhibition “Takenin” in 2020, is currently closed. The museum is currently constructing the new Guggenheim’s new headquarters.In a letter addressed to Munich’s curators Julia and Richard Feynman, the two-dozen art historians who curated the show said: “Through a series of carefully orchestrated gestures and a series of carefully selected, hand-painted elements, Pablo Picasso", "The next Biennial should be on Monday, March 16, 2020. Since the event was founded by artist-activists Karima Sarsam and Zakiya Sarsam in 2014 to celebrate the life and work of the late Indian writer and critic Shanti Malhotra, it has been challenged by protests from the government and activists on both sides of the debate.The hotly contested exhibition was initially held in March 2019; organizers announced that it would return to New Delhi the following April. The show was rescheduled for May 2020, but did not move forward with the exhibition.The latest protest comes on the heels of the cancellation of a major exhibition of the work of the late American designer Jean Nouvelle, as well as the exhibition of the work of the French artist Marc Chagall. The government has also recently faced backlash for its failure to protect cultural sites and people in the country, including the Taj Mahal and the National Museum of Modern Art, in Moscow. In April, a group of artists formed a lobby to pressure Prime Minister Narendra Modi to act.\n\n\nBritish cultural producer Pia Camille Paglia has been named the twenty-fourth president of the Venice Biennale, which will run from March 13 to March 14, 2020.", "The next Biennial should be held in the spring of 2021.\n\n\nThe Museum of the Fine Arts (MFA) in Boston has released the list of the eighty-five artists who will be featured in its fourth edition, “The Arc of Influence,” which will explore the influence art and fashion has had on the development of the American brand. The exhibition will feature works by thirty-six artists including Betty Parsons, Gertrude Stein, and Ed Moses, as well as by twenty-four contemporary artists, including Mark di Suvero, Patti Smith, James Turrell, and Terry Ross, among others.The thirty-three finalists for the award were selected by an international jury made up of Jason Bojak (New York), Nicholas Edelson (New York), Naima J. Keith (New York), and Joachim Kremer (New York). The jury will now decide on a winner. The deadline to submit works is March 18.The seventy-sixth Academy Awards will be presented by the Association of Art Museum Directors (AAMD) at the Museum of Modern Art in New York on Tuesday, February 23. For the first time, the awards will be presented by two separate organizations. The AAMD will present", "The next Biennial should take place at the Autry Museum in Manhattan next month and will launch with Q&As by artist/activist Grace Peach. The show will highlight the work of eighty-three artists from twenty-six countries and will present a selection of works from the next edition that will be free to the public.The third edition of the Frieze Biennial will take place at the Kunsthalle Basel from October 6 to October 8 in 2019 and will feature work by seventy-eight artists from twenty-six countries and will be free to the public. The Kunsthalle Basel will also stage a solo exhibition of work by sixty-five artists in January 2020.\n\n\nThe Central Library at the University of Chicago has received a gift of twenty-six ancient images by French Impressionist architect Jean-Luc Godard, a gift valued at $55 million. The works, which were donated by the late director François Pinault, will be installed within the library in a groundbreaking exhibition that will highlight the life and work of the late creator of the Beast Tamer’s Laboratory, a series of buildings that appeared on the outskirts of Paris in the late 1940s.The museum announced the announcement of the exhibition at a special event at its", "The next Biennial should be held in 2022. On Wednesday, August 15, organizers of the Dubai Biennale, which is currently underway, declared the event a success, stating that it is still ongoing and hopes to bring the art to the UAE in the near future.\n\n\nThe Houston Museum of Art (HMA) has appointed Trina Saffiedoli as its next director. She succeeds Tanya Boyce, who departed in the summer of 2021 to head the New York gallery, which has locations in New York and New Orleans, and will take up the post in December.“Trina Saffiedoli is a person of great integrity, intelligence and tenacity, eager to put her expertise and creativity to work in service of the people of Houston and the greater Houston community,” said Larry Aitel, chair of the board of trustees of the Museum of Fine Arts. “Her professional background includes working in the contemporary art world at large and in the museum. Her new role affords her the opportunity to further develop and advance the HMA’s collection, to strengthen our relationships with local and regional artists and to further enhance the museum’s public experience.”Prior to joining the institution in 2012, S", "The next Biennial should take place in 2021. In an interview with the New York Times last week, Bertrand said: “I am delighted to be able to start again with the Biennial de Lyon, as we have done with many of our exhibitions in the past. The exhibition was not developed as a project for only one year, but was developed for years: the effect of the exhibition and the composite exhibition was to push the art of cinema into a new dimension.”\n\n\nThe Whitney Museum of American Art in New York has received a $150,000 donation from activist artist Virginia Hebert, who was an early supporter of the Black Power movement and a prolific author of political poetry and play. The gift, made on behalf of students at the School of the Art Institute of Chicago (SAIC) and the Museum of Modern Art, the two institutions behind the biennial, has been made in recognition of Hebert’s lifetime achievements. It also honors the students’ contributions to the museum and the institution, which will collaborate on a series of exhibitions, a public lecture series, and a public writing project.“The School of the Art Institute of Chicago has been a pioneer in the development of a visual arts program that", "The next Biennial should be held in March 2020. “The final project of the Biennial is a special exhibition dedicated to the work of the artists who have made the most important contributions to the museum’s collection over the last twenty years,” said Peter Geldhof, director of the Biennale Rotterdam. Between the artist-run operation of the museum and the curatorial efforts of the institution’s collection experts, the exhibition should include the works of thirty-three of the ninety-two artists from the catalogue. ICM will host the show, titled “Life and Art in a Metal Box,” at the Biennale until December 8.The London-based arts organization has been providing support for the Museum of Modern Art (MoMA) and NADA, the Museum of Modern Art, Tate Modern, and the Metropolitan Museum of Art, which has ten million visitors a year, since the Biennale Rotterdam was launched in 1987. The institution will receive $3.2 million from the Christie’s International Prize in recognition of its support of museum exhibitions. In addition, the Biennale will receive a total of $5.6 million from the Christie", "The next Biennial should be held in 2021, and the last in 2022.The museum is also considering building a new exhibition space for its collection within the institution to better accommodate the ever-changing needs of the museum. The biennial will also introduce a new digital platform to highlight the museum’s collection, curated by Bradford Smith, a British curator of contemporary art, and which will of course be accessible to the public.The proposal for the 2021 edition, titled “Amar Ghenen: The Imagination Land,” was presented to the public at a special exhibition of art at the festival, titled “Amar Ghenen: The Imagination Land,” which was organized by the artist’s daughter, Ghanima Ghenen, and was organized by the International Foundation for Contemporary Art (IFCA). The exhibition was curated by curator of contemporary art, art historian, and writer Vicky Storr, who will serve as co-curator for the exhibition.The theme of the exhibition was “Temporary Trauma: Behaviour and the Body in Art” that was curated by James D. Watson, the current director of the California Institute of Technology. The curators included Amanda Bell�", "The next Biennial should be held in 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston, which has been closed since March due to Covid-19, is preparing to reopen in early 2020. The institution will welcome more than two hundred thousand visitors in early 2020.“I am thrilled to open our doors to the public this spring and welcome you back to the MFA Museum of Art, as we begin to re-imagine the museum experience in the twenty-first century,” said president and director Martha Stewart. “As we work toward redesigning the MFA in service to the museum, we must also consider the many visitors who will visit the museum in the coming years and will need to anticipate their needs.”Following a three-month, $50 million revamp, the MFA will boast a new Design District, redesigned galleries, and a redesigned lobby that will offer a more intimate, 360-degree view of the galleries, new curiosities, and a museum’s historic buildings.“We are designing the MFA in an effort to emphasize both the impact and the continuity of contemporary art in the United States,” said John McInerney, MFA’s", "The next Biennial should take place in 2022. \n\n\nThe Philadelphia Museum of Art (PMA) plans to hold a retrospective of Christo, a 1953 work by the Italian artist Sergio Marini, at the institution in 2021. The exhibition, which is slated for November 2020, will feature work by more than sixty artists and will be organized in collaboration with Marini’s son, Cecil, who is a designer and independent curator based in New York. The exhibition is part of PMA’s ongoing expansion and reopening, which is expected to add twenty-one galleries to its existing holdings. “While we are grateful to our customers and colleagues for their support in the design and installation of this show, we recognize that the PMA’s production team was not prepared for the unprecedented response the show has received,” said PMA director Adam D. Weinberg. “Given the retrospective’s reach and the exhibition’s engaging new themes, we felt it was an important moment to deepen the PMA’s relationship with Christo.” According to Artnet, the retrospective will include work by thirty-five artists from fourteen countries and will feature a selection of Christo", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Berlin, has revealed its design for its second iteration of the Kunsthalle Basel. Titled 'Chemische Unfall der Kunst', the exhibition will focus on the history of photography and will feature works by twenty-one artists, including María Berrada, Henning Boeck, and Konstantin Brankov, and will run from March 21 to March 23. The show will be hosted by Klaus-Ulrich Uher, the director of the Museum Stiftung der Künstler-Basel, and will take up a theme of energy and energy systems.In addition to the exhibition, which will feature nearly two hundred works by twenty-six artists, the museum will hold a special exhibition of work by the German-born artist Rainer Sachs. Taking place in August 2020, the exhibition will be attended by a selection of seventy-five works by five artists, including Mihaly Csokent, Alireza Gündemann, Yeyub Aslanov, and Lutz Reutemann. The show will also include an open-air sculpture garden and a public gathering space, and will", "The next Biennial should be held in 2020, with a new selection of works by the artist, and will be curated by Nia Stånsen, who is also the director of the Danish Center for Contemporary Art (DCMA). The biennial was established in 2015 to commemorate the centenary of the Danish artist Lars-Peter Larson, whose work consisted mainly of photographs of children and young adults. The biennial was also organized as a way to commemorate the artist’s life and work. The exhibition “Larson: The Audience,” which was staged at the Museum of Modern Art in New York from August 2011 to September 2012, was nominated for a Pulitzer Prize last November.\n\n\nThe Paley Center for Media and Arts in New York has appointed Gulatu P.A. Gallery, which specializes in contemporary art, as its new partner for the 2019-20 season. Paley will offer free general admission for all members of the public for two consecutive weeks beginning on March 10 and running through March 12. “The Paley Collection is committed to diversifying our audience by providing more opportunities for families and cultural groups to engage with the art of our time,” said Paley director Carolyn Asher", "The next Biennial should be held at an appropriate location in the city. It should also work with the city council and the state government to ensure that the current exhibition is, in a word, inclusive.\n\n\nThe Toronto Art Gallery (TAG) has added two new members to its advisory board: artist and activist Yinka Shonibare and the Austrian artist Oliver Wirth. Shonibare and Wirth will serve as consultants to the museum in the coming years on how best to revitalize its current complex at 96 College St., which opened in 2015 after the redevelopers Renzo Piano and Frank Gehry pulled the plug on the original plan. “We look forward to collaborating with our Advisory Board to help them shape the TAG as they envision the future for our new site, which is presently under construction,” said TAG director Élise de la Tour. The museum plans to open the new TAG in 2021.“The new Advisory Board will be made up of: Yinka Shonibare, Oliver Wirth, Zara Sexton, James Turrell, Karen Tyrell, Markus Zusak, Kirsten White, Taryn Nes", "The next Biennial should be held in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has been accused of trying to downplay the effects of the coronavirus, which has spread to more than 200 countries and caused at least 17 deaths, by trying to downplay the threat of the virus to the health of visitors to its exhibitions and by promoting shows that were not fully financed by the government.According to Bloomberg, the New York Times, and The Guardian, the Metropolitan Museum of Art, which has $72 billion in annual revenue, was accused of trying to downplay the risks posed by the virus by spending $5 billion on a $500 million renovation project, and by promoting artworks that were not funded by the government such as the Metropolitan Museum of Art’s newest exhibition “The Renaissance Woman: The Life And Death of Mary Magdalene.” The work, titled a “revival of the goddess of wisdom, love, wisdom\u0097and knowledge,” showcases artworks by artists such as Pierre-Auguste Renoir, Claude Monet, and Jean-Michel Basquiat.The sculpture by sculptor Kiki Smith, who died in 1979, was included in a show at", "The next Biennial should take place in the spring of 2021.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for museums that are participating in the 2020 iteration of the Biennial, which was originally set to take place in June. Titled “2028: The Year to Remember,” the document outlines a number of steps that institutions can take to ensure that their exhibitions and events reflect the cultural and social heritage of the city they depict.“While we recognize that the future of the Biennial is uncertain, we hope that in 2020 the exhibition will reflect the spirit, the original mission, and the essential contributions of the twenty-sixth Biennial,” said Department head Daniel H. Weiss. “We commend the twenty-sixth Biennial for its ambitious exhibition program, innovative curatorial team, and commitment to engaging with local, regional, and national artists and audiences and for its breadth of expertise and breadth of experience. However, the 2020 exhibition will be a challenging and challenging exhibition, fraught with uncertainty and sometimes taking years to complete. . . . We expect that the exhibition will reveal new challenges for the Biennial’s team and for the city as we look to the future.�", "The next Biennial should take place at the University of Sheffield in the UK, in 2020. The inaugural exhibition, “The Shape of Plastic,” is still on view until March 22. For the full list of participating artists and their respective biennial dates, click here. The full list of participating artists is as follows:/Max Beckman, Perrotin, New York: “The Shape of Plastic” (2019)Anton Kern, London: “Gibson’s Fields of Flourish” (2019)Cheryl Martin, New York: “The Second Floor” (2019)Pei-Li Huang, Shanghai: “Lovers In A Crowd” (2019)John Akomfrah, New York: “Livestock on the Moon” (2019)Rory Mulligan, London: “Approaching the Light” (2019)Alanis Morley, New York: “The Moth: The Art of Arrangement” (2019)Natalie Stepanov, New York: “Imbeciéres en la Lucha*” (2019", "The next Biennial should be held before 2020. “We are still working out how we will move forward in the face of such a severe crisis,” said Eric Olenka, chair of the board of trustees. While the museum has canceled nearly all of its planned programming in an attempt to mitigate the coronavirus, it will continue to stage exhibitions, graduate courses, and host events. The museum also announced that it expects to spend $1.2 million this year on operations. That figure is expected to rise to $3 million in 2020. However, due to a temporary closure in March 2019, the total budget for the biennial has been reduced from its previous $9 million. The large majority of the biennial’s participants are non-profit arts organizations that are working to help people affected by the coronavirus. Among those that will be affected are the Metropolitan Museum of Art, the Museum of Modern Art, and the Whitney Museum of American Art. Rights organizations such as Amnesty International, Setaray International, and Save the Children have urged the United States to respond to the coronavirus by helping organizations such as the Museum of Modern Art and the Museum of Modern Art San Francisco,", "The next Biennial should be held in the spring of 2021, the organizers said, and will host a retrospective of the artist’s work in May 2022.\n\n\nThe Los Angeles County Museum of Art (LACMA) has experienced its first year without a single visitor from the Middle East. On Saturday, the institution confirmed that it will stop accepting visitors from the region for the next twelve months, in an attempt to minimize the impact of the coronavirus.The announcement came as LACMA hosted a party, “Shining a Light: Celebrating Arab and Islamic Art” (2017), that celebrated the work of forty-eight artists. The event, which honored the work of Dror Farsi, Alia Saeedi, Amina Hashim, Muhammad Ali Zawahra, and Mara Siddiqi, was curated by Noah Kassel-Berg, the director of the Museum of Contemporary Art. The festival was organized in partnership with the Arab American Foundation, a United Arab Emirates–based organization dedicated to assisting artists in the region.The organization is currently working with the Saudi Arabian government to try to raise more than $100 million to support the “yrst and rett", "The next Biennial should take place in 2020. Berlin, which is currently working on preparing for its reopening in 2021, is preparing to welcome visitors in 2024.While the architecture of the exhibition is not yet finished, the stipulations for the exhibition include the visualization of the new exhibition hall in the former Städelschule in the central part of the city, a redesign of the exhibition space in the city, the building of new exhibition spaces in the walls of the former Bergen-Bickelische Mann, a renovation of the museum, a change in the composition of the exhibition, and the installation of new works. Munich’s Königstein Städelschule, the Kunsthalle Trier, and the Friedrich Schirn-Institut für Kunststädelschule, which are all currently working on their redesigns, are also planning their reopening in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta announced today that Andrea de Cela (formerly known as Andrea Pascual) has been appointed as its next executive director. She will be responsible for coordinating programming across all of the institution’s twenty-seven museums", "The next Biennial should take place at the Cheim & Read Building, which is currently undergoing a $130 million facelift. “The biennial will be a unique and exciting narrative set against the backdrop of ever-changing national, state, and local cultures and histories,” said Mark D. Levine, president of the Biennial. The inaugural event, “Think Different,” will be followed by “Think the Same,” which will feature the work of twenty-four artists from twenty-six countries. \n\n\nThe National Gallery of Scotland has received a major donation of more than one hundred works by thirty-seven artists from the North Atlantic collection, comprising paintings, drawings, sculpture, photography, video, collage, and installation. The artworks, which are part of the National Galleries of Scotland’s upcoming collection of Kathrin Becker’s Roots of Light, were presented by Kunsthalle Basel and the National Museum of Scotland in a special exhibition at the institution in August.“The donation marks a new chapter in the history of the National Gallery of Scotland, and brings the collection closer to the National Gallery in Washington, DC, the National Gallery of Modern Art", "The next Biennial should be held in 2021.”\n\n\nThe Institute of Contemporary Art (ICA), Beijing, has received a $65,000 donation from the Samanta Foundation in the form of a gift certificate for Allison Wiles’s exhibition “The Cleansing of the Soul” (2016–17), which will be presented in the institution’s new exhibition space, the Museum of Contemporary Art (MoCA), in the fall of 2020.The gift comes at a crucial moment for the institution. The museum is currently closed because of the Covid-19 pandemic, and while it will reopen in phases beginning in 2021, in the meantime it will be staging exhibitions that were previously absent from the show. In a statement regarding the gift, ICA director Zhang Yaxuan said: “The show is an important milestone in the journey to create a new collection of contemporary art that is dedicated to the themes of our lives and the ways in which we affect each other and the environment.”In addition, a new collection of work by the artists involved in the 1967 riots in Beijing, which took place on November 1–7, 1967, has been created, titled “The Present Situation in the Art of the Three", "The next Biennial should be held at the European Space Centre in Brussels in 2020, and the next will be held in Strasbourg in 2021.\n\n\nThe Museum of the Jewish People (MoJ) in New York has received a hefty donation of more than $6 million from the Marcus Collection, this year’s recipient of the prestigious Arthur M. Sackler Award. The $6 million gift includes $3.5 million from the designer and philanthropist. The money is divided between the museum and the David Altshuler Foundation, which aims to raise funds to insulate the institution against hurricanes, earthquakes, and floods.“The gift is an enormous relief to the MoJ, which has been in dire straits since it declared bankruptcy in March, and to our staff and donors, who have been struggling since the pandemic began,” museum director Michael Rosenfeld said in a statement. “We are grateful for the generous support of the Marcus family, and for the work that our staff and supporters have done to make this campaign possible. We are confident that this gift will be a substantial boost to our efforts to ensure that the museum is able to weather this storm and provide a moment to remember for the dozens of thousands of people who lost", "The next Biennial should be held in 2021. The next edition will focus on the evolution of the exhibition. The next Biennial will be hosted at the invitation of the Mayor of New York, Bill de Blasio, and the show will be hosted by curator Peter Schwabe, the architect of the Metropolitan Museum of Art. \n\n\nSophie Plunkett, the British director of the São Paulo Biennial, has been appointed the next director of the Mexico Museum of Art in São Paulo. She succeeds Helen B. Wilhelmson, who took up the post on January 3, 2019, and will commence her tenure in January 2021.“I’m delighted that Sophie is appointed to lead our next exciting chapter in our history,” said Wilhelmson. “Throughout her career she has shown a remarkable ability to bring innovative, thought-provoking, and thought-provoking exhibitions to life in unique and compelling ways.”Commenting on her appointment, Plunkett, who has helmed the museum since 2014, said: “I’m honored to be the director of the Mexico Museum of Art, Brazil, and to have served as a principal contributing artist and supporter", "The next Biennial should be in 2021. The artist-run venue will be housed in a former steelworks in the city’s Rotherhithe Art Museum and will run from April to October. The exhibition will feature works by a range of experimental artists, including Lucian Freud, Mark Leibovich and Zoya Galindo, and will be staged in collaboration with the Institut/Het Parool Amsterdam.\n\n\nThe Museums Association (MA), a US-based nonprofit organization, has launched an online petition drive to secure the immediate release of Charles Taslima, the Egyptologist and scholar who was imprisoned for more than twenty years on charges of terrorism, sorcery, and murder based on his religious beliefs. Tasslima’s lawyers allege that his conviction was based on his teaching that the Quran and the New Testament are the word of God, and that he was put to death after he refused to renounce his beliefs.“MA is calling for the immediate release of Charles Taslima,” said Elissa Bremner, director of MA. “Tasslima’s conviction was based on his teaching that the Quran and the New Testament are the word of God. MA", "The next Biennial should be held at the Brooklyn Museum in New York, which is currently planning a major $60 million renovation of the museum. A statement released by the Art Center of Brooklyn said that the exhibition was canceled because of “complications arising from the Covid-19 pandemic.”The Art Newspaper reports that the artists who won the $20,000 Lifetime Achievement Award this year were also affected by the pandemic. The artists who were chosen were Mike Kelley, Zoya, and Rirkrit Tiravanija. Kelley, who lives in New Mexico, said: “The Covid-19 pandemic has been extremely difficult and isolating for me. I didn’t know what to do, and I haven’t been able to do anything about it since. I am immensely grateful for the encouragement and support of my fellow Academy Award–winning artists and filmmakers.”The Los Angeles County Museum of Art announced on Wednesday that it is preparing to welcome visitors back to the museum on Monday. The museum’s director, Mitch Diller, told the LA Times that the institution will display more than 1,500 works by the Los Angeles–based artists in the coming months. The announcement comes on the heels of the", "The next Biennial should include a retrospective of the artist’s exhibition “The Power of Paint” in 1973, and perhaps “Avant-Garde and Modernism” in 1979.A representative of the artist’s heirs also issued a statement on behalf of the family, in response to the news of the new partnership. The statement reads: “In recognition of the worth and vitality of the work of the artist, the two organizations have agreed to create a new biennial. The new biennial will take place in the space where the work of the last exhibition was created, in the new city of Klagenfurt in the state of North Rhine-Westphalia. The new exhibition will be organized according to the original format and will be presented in the same way the exhibition was organized, with the exception of the introduction of the vehicle and the institution of the exhibition. The new Biennial will be a collective exhibition. It will be organized in the same way as the exhibition, with the exception of the fact that the painter will be represented by the artist and the institution will be located in the same building. The artist will be represented by the artist’s heirs. The decision to create a new biennial,", "The next Biennial should be held in 2021. The first show, “Lévy Gorvy” in 2020, opened on September 22. \n\n\nThe French Ministry of Culture has announced that French artist, designer, and educator Christian Grand, whom the French government funded for a project he never completed, will receive the International Artist Prize. The honor is one of a number of Prix Métaphysique awards given by the French government each year to French artists. Grand was chosen by a committee chaired by Culture Minister Franck Riester and chaired by architect and artist Yves Klein. The committee comprised Gilles-Eric Sender, director of the Saint-Denis-le-Fleuriel Foundation; designer Christophe Clément; and Yves Klein, the founder of the designer brand M, which he sold for $14 million in 1987.The ministry set up the prize in 2017, when Grand was one of the models featured in the Prix Métaphysique, a collection of photographs by Pierre-Auguste Renoir, which opened in 2017. The institution said that it is “disturbed and outraged” by the decision. “Grand was chosen as", "The next Biennial should take place in 2021. The institution has long faced criticism for failing to secure funding for the event. The gallery alleges that the city of Toronto pressured it to move ahead with the event, which would have featured works by artists such as Chris Levine, Yael Neshekorn, and Raf Simons. The gallery also claims that the city withheld funds for the arts and cultural sector through a property-tax abatement plan the city approved in 2017. The city has long denied the allegations. “Toronto’s culture district is robust and vibrant, and we’re hopeful that this new platform will allow us to continue to attract and present the works that make Toronto unique,” said Cindy Sherman, chair of the city’s cultural affairs committee. While the process of moving forward with the inaugural edition of the Biennial has been a contentious one for some, including Cynthia McKinney, the executive director of the Toronto Arts Council, the committee voted to move forward with the event in a 21-22 March 21. At a hearing held on March 24, the city’s culture and heritage minister, Maria Augimeri, declared that the event will", "The next Biennial should focus on the history of feminism, with a particular focus on the women who have shaped the twentieth-century feminist movement and its legacy. It should also consider the questions of how a feminist context differs from the one that developed in the nineteenth- or even in the twentieth century, and how it can be shared by all audiences.The Biennial will consist of a series of exhibitions, each curated by a different artist, and will showcase new work by the artists featured in the exhibition. The first exhibition is titled “Away from the Camera: Feminist Art and Photography in the 1970s” and will open on December 13 at the Art Institute of Chicago. The second exhibition, titled “Feminist Art in the 1980s” will be held at the Art Institute of Chicago until November 8, 2020. The biennial will also include a “Women’s History Month” retrospective, and a “Year of Art” exhibition.\n\n\nThe Museum of Fine Arts (MFA) in Boston and the Art Gallery of Rhode Island (AGRI) in Providence, Rhode Island, have announced a joint fundraising initiative to encourage the exchange of artworks between the two museums. The initiative will involve the donation of works", "The next Biennial should take place in the spring of 2021, and could be on track for a 2019 opening. The event’s inaugural edition was held in the former prison camp in Mazar-i-Sharif, Afghanistan, in November 2020.\n\n\nThe Museums Association (MA), a United Kingdom–based advocacy organization that represents more than 1,500 museum directors and administrators, is urging the government to establish a new national memorial dedicated to the victims of the Covid-19 lockdown. According to The Guardian, many museums have been forced to make cuts or lay off workers as a result of the pandemic, but the organization believes that the number of people who died from the virus is much higher than the official numbers.While the government initially reported that there are approximately 212,000 cases of the virus nationwide, the organization revealed that the true number is closer to 4,600. In a statement provided to Artnet, MA said: “We believe that this is an underestimate of the true number of deaths caused by the virus, and are calling for urgent action to ensure that the UK has the strength and capacity to contain the virus and provide support for those hardest hit by the pandemic.”The organization is also urging the UK to", "The next Biennial should be held in 2022.\n\n\nNew York–based photographer and curator Mary Anastasia has been named the winner of the $50,000 Belle Gardens Prize. The honor was given to the artist who has made the most significant difference to the visual arts in the United States. The artist was selected by a jury composed of Anastasia, Edward Gray, and Anna-Marie Sze. The jury made the announcement last month and took part in an online survey that was hosted by the artist.“Mary Anastasia is an extraordinary living example of the art of what has been considered impossible since the eighteenth century,” said Edward Gray. “Her technique and sensibility combine with a deep knowledge of and appreciation of the art world to form a unique, challenging aesthetic. Her photographic paintings are unequivocally her. She was the first painter who has been so thoroughly studied, and her paintings are the best known of the twentieth century.” The laureates are: Aristo Malpighi, named the Venice Biennale’s artist of the year; Sara Cwynar, named the Los Angeles Biennale’s artist of the year; Stefano Gaudiano,", "The next Biennial should take place in 2020.\n\n\nThe annual Dutch art fairs Frieze New York and Frieze London have announced that they will no longer participate in the next edition of the fair, which will be held at the company's New York headquarters from March 28 to March 31 next year. Instead of hosting the event on the fairs websites, these years will be split between the two venues, with the first edition covering May 5 to May 7 and the latter event taking place in March.The decision to cancel the event was made after a committee comprising artist and curator Konrad G. Uerschlag, director of the exhibition space MAMCO Kunnen in Kassel, and Dutch architect Peter Zijlstra, chairman of the Dutch firm 3M.“We have been following the project for a year now,” Uerschlag wrote on the fair’s Facebook page. “After much discussion, the committee decided that the future of the fair remains uncertain and that it would have preferred to continue with the program as planned, but there are no other alternative options. We believe that the future of Frieze is at risk because of events such as Art Dubai and Art Basel Hong Kong and we have to take", "The next Biennial should begin this fall and conclude in early 2020.   Artforum has reached out to the festival for comment.\n\n\nThe Smithsonian-New York’s David Kiefer Research Center in the Bronx has appointed Christopher Masters as its next executive director. Masters, a former director of the Whitney Museum of American Art in New York, will take the helm of the institution in a surprise reveal at an upcoming conference. “Christopher is a key member of the foundation’s staff and has been a strong supporter of the center, building upon his extensive network as a curator and scholar,” said director Barbara Ainsworth. “We are excited to welcome him to the institution, which he has called a ‘chosen’ location, and where he will continue to serve as a strong advocate for African American art.”In his new role, Masters will lead the center, which was established in 1971 by the late philanthropist David Kiefer. It currently has more than 120,000 works on display in its five-story wing, which is also open to the public, and serves as a hub for research and public programs. “The center’s history is long", "The next Biennial should open in 2020, at the latest.It was announced that both the exhibition and the biennial’s inaugural edition, titled “Theoretical Art,” would be held at the Galleria Internazionale di Rome from March 26 to May 24. On its website, the exhibition said that the yearlong event would focus on “the emergence, in the 1970s, of a new discourse on the relationship between painting and the social, the visual arts and the physical world,” and would present “a series of interconnections between paintings, sculpture, photography, theater, urban exploration, and philosophy.” The biennial will also be closed to the public as planned.The opening of the biennial will coincide with the opening of the exhibition “Un Certain Regard: Painting in the 1980s” at the Stedelijk Museum in Amsterdam, which is currently closed until at least April 18. That exhibition, which was organized by the Dutch curator Joost Anström, coincides with Art Basel Miami Beach’s upcoming launch. \n\n\nTaipei’s Museum of Modern Art (Ma’s) has received a gift of more than seven thousand", "The next Biennial should take place in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has added four new works by Kiki Smith to its collection. The works will open up a new chapter of the artist’s work-in-progress series, a four-part exhibition series that presents work by Smith from her forthcoming book Howl: The Scream, October 20–November 17.“Our appreciation of Kiki Smith is so great that we are grateful for her continued contributions to this field,” said MFA director Dan Gil. “Sue Smith has been an exemplary champion of Kiki’s art and we are privileged to have continued to work with her over the years. She is an outstanding curator, and one of the most talented and important artists of her generation.”Smith, a self-taught artist who grew up in Omaha, New Hampshire, is known for her staged performances that rely on costumes and stylization to create a simulacrum of her body while still maintaining a female presence. Her work has been collected by the Los Angeles County Museum of Art and the San Francisco Museum of Art. Check out the full list of artists represented in the exhibition here.\n\n\n\n\nThe B-", "The next Biennial should be held in the spring of 2020, and will organize a series of exhibitions that will address the current state of the art in the field. The seventeenth exhibition will focus on how art can be a platform for social change, and the eighteenth will be dedicated to the art of installation art. Art historian and curator Ann-Marie Østby also announced her retirement, saying, “For the past forty years, I have been sharing my experiences and thoughts with a wider range of artists who are cognizant of the important role digital art can play in addressing the most pressing social issues. I am proud to be able to contribute to such a important international platform for art.”\n\n\nThe National Geographic Society’s board of directors has fired a longtime employee who criticized a proposed $1.4 billion merger with the Canadian Geographic Society. The announcement came after the two organizations declared their intent to merge earlier this month, and was made amid a national campaign to preserve the scientific organization’s independence.According to a statement from the board, which met in private on February 3, the board determined that the employee’s conduct “was unacceptable” and “did not meet the standards expected of a", "The next Biennial should take place in 2020.\n\n\nThe Museum of Contemporary Art (MCA) in Boston announced today that it is expanding the role of its new Arts and Culture Center in the city with a new exhibition, “NIRIN: The Art of Intimacy,” which will run on the museum’s campus beginning next month. The twenty-third edition of the exhibition will showcase work by fifty artists in its entirety, including Sarah Sze, Jeremy Deller, and David Adjay, among others, and will be curated by Sasha Shagal, the executive director of the Boston Art Museum.“NIRIN’s inaugural exhibition, “The Art of Intimacy” opened at the museum last year as part of a six-month public-private partnership between the institution and the city of Boston. The show included the work of twenty artists, including John Akomfrah, Molly Crabapple, Pat Garrard, and Jocelyn Sturtevant, among others, and was organized in partnership with the six original members of the NIRIN collective, including Doug Aitken, Mary Lou, Jim Thompson, and John Sigler.“NIRIN was founded by two men", "The next Biennial should take place in late April with a total of ten exhibitions, each of which will be curated by a different person, and will present works by a different artist.” The biennial’s theme, “alliance between art and humanity” will be announced in late summer, with a preview opening on January 31. \n\n\nThe Metropolitan Museum of Art (MoA) in New York has announced that it is planning to shutter its Sherwood Forest outpost, which opened in March 2018, effective March 31. The museum, which has a long-standing policy of not commenting on future plans, said that it has been working on a way to move forward with the art museum, which has been closed since March 13, was “trying to give our artists the space they need to realize their work, to help them develop a sense of place in the city.”Over the course of the last year, MoA staff members and artists have organized workshops, staged performances, and organized events, such as “The Art of Struggle: How Painting and Design Can Solve Our World” (2017), a series that included work by artists such as Paul Gauguin, Robert Irwin, and Jean", "The next Biennial should be held in 2019.\n\n\nThe Foster and Barbara Mikulka Museum of Art at Ohio State University in Columbus has announced that it is planning to reopen in 2021 following a $30 million expansion and renovation project. The museum’s current exhibition, “The Ambassadors,” was put on hiatus due to a combination of illness and construction. The next edition of the exhibition will mark the centenary of the 1916 birth of American artist Upton Sinclair. The museum will also include a new exhibition on the contemporary art of the Central and South American cultures.The Foster Museum of Art at the University of California, San Francisco, has also celebrated the centenary of the artist’s birth. In a statement, the institution said: “The exhibition, ‘The Ambassadors,’ was conceived when Barbara and I began to feel the overwhelming pressure to produce new work in the style of the late great Paul Gauguin. When he died in 1992, Barbara took over the reins as director and continued to direct the exhibition throughout its twenty-five-year run, culminating in 2007. I was honored to have Barbara upon my tenure, and to have her work to lead. I cannot wait to see what she and her successors", "The next Biennial should take place in Lagos in 2021. It also noted that the festival has not yet determined its next location, nor will it need to change its schedule because of the coronavirus. “The best way forward for the Biennial is to remain in its traditional location in the heart of Lagos,” the biennial said.\n\n\nThe Foundation for Contemporary Art (FCA) in New York announced today that it is expanding its partnership with the artist and philanthropist Dr. Martin Luther King Jr. The organization will now be able to commission and present works by King’s sixteenth-century followers and will be able to present a “musical performance in the likeness of the dream world.”In the brand new partnership, the Foundation will commission King’s works and present an exhibition of his work in the form of a musical performance at the Whitney Museum of American Art in New York on November 4. “Dr. King is the embodiment of the American dream,” said Paul C. Ha, the president and CEO of the Foundation. “We are thrilled to collaborate with Dr. King to honor the vision of presenting his work in a musical performance as part of a new partnership with", "The next Biennial should include a “civilizing” of the museum. “In the words of Honoré de Balzac, ‘the most important task of a museum is to explain things.’” The festival, which is supported with a $30,000 donation from the Thompson family, also plans to invest $2 million in curating programs and in hiring a curator for its spring 2020 edition.The biennial will take up themes that have been emerging in contemporary art since the late nineteenth century. The theme “love and sexuality” will be revisited in 2020.\n\n\nThe Flemish Museum Düsseldorf (Düsseldorf, Düsseldorf) and the German State Archive in Cologne (Deutsche Bundesamt) have announced that they have reached a settlement over the sale of works by the artist Wolfgang Paalen; his estate will receive $8 million of the proceeds. The institute and the state will also receive $1 million from a sale of works by the artist and his son Lars Paalen on August 10, 2019.The sale of the photographs by Paalen and Lars, which were taken in the late 1940s and 1950s, came before", "The next Biennial should be held in 2021. For the Winter/Spring 2019 edition, the institution will hold its first online viewing for the show, which will stream live from the museum.\n\n\nThe New American Art Museum (NADA) has received a gift of eighty-seven works by forty-five American artists, including Alice Albee, Robert Irwin, and Bob Ross, from the collection of the late neurosurgeon and lifelong collector Harry A. Silver, Jr., who passed away in Los Angeles on December 22, 2017. The gift includes works by artists such as El Paso Lechaun, Terence Blanchard, Milton Davis, and David H. Koch.“The museum was completely overwhelmed by the generosity of those who donated their art,” said James L. Davis, NADA’s director. “We are grateful to the four individuals who donated their works as well as the many donors who enabled NADA to become a major force in American art, but most of all, we are grateful for the lasting imprints of their visionary leadership on our museum and the museum’s collection.”Established in 1976 by Charles and David Horowitz, the New American Art Museum (NADA) is a privately held", "The next Biennial should be held in 2021. The next edition of the Irish Biennial was held at the Shrine Auditorium in Dublin in 2016 and was attended by 81,000 people.\n\n\nThe Royal Irish Academy of Arts (RA) in London has launched a $30 million fund to support artists from the First World War to the present day, in an attempt to alleviate the financial pressures facing the struggling arts sector. The fund was established in support of Artistic Relief, a new initiative launched by the Royal Irish Academy. “The fund will provide immediate relief to struggling arts professionals,” said Joshua Linehan, the academy’s director. “Modern art was born in the trenches of World War I and continues to thrive in the face of ever-increasing austerity. We need more than ever to support and encourage these artists to take on new challenges and to shape their own futures.”In addition to direct financial aid, the academy will host an open call for proposals, which will run for two weeks and draw from a pool of approximately fifty applicants, at least twice a year. The call will be on December 23–24 and will be webcast live on the academy’s YouTube channel. The", "The next Biennial should announce its selection committee, which will comprise three members from the selection committee and one from the museum’s curator’s offices. The curator-at-large will be selected from the list of nine biennial finalists, which will be announced by the institution in June.The museum’s other biennials have been plagued by behind-the-scenes politics and controversies. In 2007, the inaugural event was held in a different building, this time in partnership with the city of New York. The exhibition was supposed to take place in the museum’s natural setting in Central Park, but the venue was not able to stage the show due to the Covid-19 pandemic—the show was rescheduled for the end of the year. In 2018, the museum closed to the public, and its last public event was an exhibition dedicated to a work by João Pessoa, a Brazilian photographer whose work is currently on display in the museum’s exhibition “Photography in the City.”\n\n\nThe Art Newspaper reports that Japan’s Tate galleries are currently closed because of the pandemic. Their websites have been updated to reflect a new “toxicology” alert issued", "The next Biennial should take place at the base of the Painted Byzantine Empire in Palazzo delle Papesce, in Venice, around 20 years from now. It will be attended by an audience of thirty to a hundred and will be organized by an Italian curator and curators from the Florence Foundation, the nonprofit organization that defends the Painted Byzantine Empire. The museum will create a public exhibition of the work of seventy artists from twenty-two countries, including Italy. The next iteration of the exhibition will be organized in the same location in 2020. An exhibition of the work of the same artists will also be staged at the Alban Villa in Rome in 2021.The biennial will be titled The Last Is Alive’s Last Days, and will feature seventy-five works from the Italian city of Venice. The works will be organized into sixty-four categories, including architecture, literature, photography, film, performance, design, and installation. The seventy-two works that have been selected will be presented on Paintings Today’s webpage and will be on display in a biennial at the Venice Biennale in 2021.\n\n\nA group of cultural institutions that signed an open letter protesting the upcoming reopening of the US’s", "The next Biennial should be held in the spring of 2020. The programme, which is based on themes of gender and health, will focus on gender-based violence, as well as the therapeutic effects of ayahuasca, and will aim to present a new form of indigenous healing.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York announced today that it is facing a legal case filed by the families of two men who were killed by the toxic brew of hallucinogen Δ 9 -tetrahydrocannabinol (Δ9THC), a compound found in the powerful hallucinogen DMT, and the psychedelic Amanita muscaria.The lawsuit claims that the museum failed to prevent the suicides by Nicholas M. Bonaccorso, a fifty-nine-year-old Italian national who was found hanged in his cell on May 3rd, and Stefano Cattelan, a forty-five-year-old Italian national who committed suicide the next day in Italy, and instead allowed the deaths to occur.The suit claims that the deaths were preplanned and that the jail was not properly restrained and that the deaths were preventable. “Although both defendants had mental health issues, their deaths were preplanned,", "The next Biennial should be held in the Spring of 2021. \n Nairobi\nOver the last thirty years, the city of Nairobi has been a destination for a record number of international photographers. The museum of African art (Nairobi Art Museum; NAM) is home to the work of more than fifty international artists. In 2017, the institution also gained recognition for its role in the establishment of the Nairobi Art Museum (NAMA); a privately operated museum dedicated to the life and work of African art and architecture; and the Nairobi Architecture Biennial, a series of exhibitions and residencies organized by the city of Nairobi.In addition, NAMA received a 2018 grant from the British Museum in London and the Nairobi Art Museum (NAMA) has been awarded a $1.6 million grant in 2017. \n\n\nThe Newark Museum of Art has appointed Laura DeNardo as its next executive director. DeNardo comes to the institution from the Metropolitan Museum of Art, where she has served as director since 2012. During her tenure at the museum, she established the Rutgers University Art Center (RUAC), which hosts the flagship exhibition “Newark,", "The next Biennial should be held in 2021. \n\n\nNew York’s Metropolitan Museum of Art is planning to close its doors for a period of eighty days following an investigation into accusations of sexual harassment and assault that were raised by hundreds of women who worked for the museum. The Met, which was already working on a restructuring that would involve retrenchment, has reopened with a new set of leadership and financial plans but will focus on rehabilitating its reputation through a series of exhibitions and other programming.The Met, which was founded in 1890, became the first major American institution to temporarily close following a major renovation project in 2007. It reopened in 2009, only to shut down again last year following the pandemic. “The Met is working hard to overcome this difficult moment and to return to the work of art that we once valued and were committed to,” museum director Daniel H. Weiss told reporters after the Met reopened. The museum has already spent more than $100 million renovating the museum over the past eight years. “We have been consciously and deliberately rethinking how we respond to representations of art in the future,” Weiss said. “Today’s work and art, in the future, is here for us", "The next Biennial should be on March 14–March 16. That would be the most logical date for the exhibition since it would coincide with the opening of the exhibition “The Athenian Experience: From the Collection of Henry David Osmond to the Exhibition of Henry Luce.”However, the Greek government has announced that it will not re-open the exhibition, which has been closed since March 18, and that all visitors must remain indoors through the middle of March. The government also plans to hold a special exhibition of the work of the artist-in-residence, Michelangelo Antonioni, as part of the same week as the exhibition.\n\n\nThe National Gallery in London has appointed Joana Ilic as its new chief executive. She succeeds Carolyn Hujar, who has helmed the gallery since 2013, and will take up the post in May. Ilic succeeds Charles Rowland, who has led the institution since 1995.“Joana Ilic is a superb leader with a proven track record of building and sustaining a collection in a highly competitive and innovative environment, with an ability to deliver sustained and exceptional results,” said David Haemor, director of the National Gallery. “Bob and Carolyn will"]