["The next Biennial should take place in 2021.\n\n\nWoody Alsop, the founder and managing director of the metals company Picos, has been selected as the next chairman of the Picos Group. The announcement comes a little more than a year after Alsop was named the new chairman of the company by its board of directors.Alsop, who has led Picos since 2013, will take up the post on January 1, 2020. He succeeds Richard Armstrong, who has served as Picos's CEO and chairman of the Picos board of directors for more than two decades, and will be responsible for reopening the company after it closes its current facility in New York and moves its operations to a new location in the city.“Picos has been an innovator and a leader in the design and fabrication of materials for the plastics industry,” said Alsop. “We are delighted to have Richard join the Picos family and continue to support the Picos brand throughout his long and distinguished career. We have long admired his ability to collaborate, his creativity and his ability to see beyond the boundaries of conventional thought, and his ability to understand that the art of the design and fabrication of materials is a gift from nature, and", "The next Biennial should focus on the publication of artworks and materials that are architecturally and aesthetically significant, both historically and currently. In the first half of the year, the biennial will focus on the collection and exhibition of new work. “Forty-Three is a critical step in the development of the new exhibition program,” said biennial director Ana Paula de Castro. “The exhibition of works that are not only aesthetically significant, but also culturally significant and historically significant, will help you understand and appreciate the breadth and depth of the new assemblages.”\n\n\nThe Carrara Foundation in Milan, Italy, has appointed Eva Marin as its next president. In a statement, the foundation said: “Marin possesses all the qualities to be a pioneer, one of the founders of the contemporary art scene, an artist of the present and a thinker of the future. She is a true leader and a true friend, and we are counting on her to continue the foundation’s work in revitalizing contemporary art and the art scene in Italy.”Marin began her career in the cultural sector as an art historian and writer for the Italian daily newspaper Gazzetta dello Sport. She then moved to the", "The next Biennial should take place in 2022. \n\n\nThe SculptureCenter in the Arts, the Museum of Modern Art, and the Whitney Museum of American Art in New York have announced their partnership with the Japanese contemporary art museum JICA, which celebrates its sixtieth anniversary this year. The honor comes at a pivotal moment for both institutions. Previously, they were only able to house a single, smaller exhibition of works by the Japanese contemporary artists Dai Kanda, Toguo Kanda, and Takashi Takeda\u0097the latter two of whom have recently had exhibitions at the Whitney Museum of American Art.Since its founding in 1983 by former Japanese prime minister Yoshihiro Edano, JICA has helped shape the trajectory of the country’s postwar artistic and cultural history. Its current exhibition “Tokyo in the Eighties: The Artists’ Studio Museum” (2017) premiered its first work by a single artist, Yoichiro Nara, and the institution has been instrumental in the collection of works by artists such as Hideki Yamanashi, Shigeo Kihara, Toda Sadao, and Masao Maeda. Its current exhibition “From Bombac to Kallisto: Ten Years", "The next Biennial should take place in the spring of 2020, and the final in October 2021. The new venue will be inaugurated by a new exhibition of work by the contemporaneous artist Evelyn Walsh.\n\n\nArt Basel has launched its digital platform for buying art online. The platform will allow collectors and dealers worldwide the ability to buy works on-site and is supported by a limited number of dealers and collectors currently in the United States. The platform was created to help promote the brand and the Art Basel brand, which is known for its online retail, and will be accessible to the public for thirty days only.The platform was developed by the collector-dealer platform site MarketResearch.com in partnership with American Express. It is not affiliated with, sponsored by, sponsored by or affiliated with the collection, sale, loan, or display of works. The platform is exempt from the full range of US federal, state, and local income tax, estate, and gift taxes, and is exclusively for the purposes of offering direct online sales and to collecting and selling art. The collector-dealer platform is not affiliated with, sponsored by, sponsored by, or affiliated with the dealer.The platform will be available to collectors and dealers in the US only on the", "The next Biennial should take place in the summer of 2021–2022. The museum will soon have a new 600,000-square-foot building to house its collection and exhibitions and will build a new biennial exhibition space in the city’s new Central Library. It will also be transformed into a strong site for cultural exchange and collaboration. Bird also pledged to support the local arts, arts institutions, and arts workers in the city of San Francisco. “The city of San Francisco is at the forefront of the fight against the opioid epidemic and I’m proud to be an active supporter of this fight,” said Marin. “This week, I signed an Executive Order that will redirect $10 billion from the Federal Emergency Management Agency to local arts programs. If implemented, this could transform San Francisco into an amazing new $5 billion arts incubator. It’s an ambitious plan, but one that will actually make a difference. The city’s arts and cultural sector is America’s largest and most diverse, and it’s not about to disappear anytime soon.”\n\n\nThe Honorable Naima J. Keith, Chairman of the Board of Directors of the Museum of Modern", "The next Biennial should open in 2021 and will feature six exhibitions in different themes including Architecture, Design, Film, Music, and Visual Arts. Among the works scheduled for the exhibition are the first exhibitions dedicated to the work of the Swiss artist Peter Sellars and the first exhibitions dedicated to the work of the British architect Richard Avedon.\n\n\nThe Centre Pompidou in Paris is planning to open an outpost in the city of Rome in 2021. The reopening of the Centre Pompidou (CP), a museum, conference, and café located in the city’s rue de la Garçonne district, will be celebrated with a two-day celebration hosted by the Italian architect Simone Langlois. “I am delighted to open with the creation of a new exhibition of the work of Simone Langlois, ” said Michel Houma, the director of the Centre Pompidou. “In order to create an exhibition of this significance we first need to present its work in a new way. We need to present the full range of its practices through a carefully planned series of exhibitions that will bring together the museum and the cultural center.”Langlois, who often collaborates with local", "The next Biennial should take place in 2021.\n\nThe 2019 edition, which featured exhibitions by twenty-eight artists, was held at the Georges Kleist-designed venue in Paris. Lehmann Maupin, the director of the Random House, and the trustees of the Four Seasons Art Museum in New York, have announced that they are planning to pull the plug on the museum’s annual event, “X,” on January 20, 2020, thereby allowing the institution to “redefine the term exhibition.” The decision was made after the museum’s board members decided that “the current exhibition setup—in which all the pieces are on display for the duration of the event—doesn’t work.”Activists, writers, artists, and other cultural workers have joined the campaign to take the institution out of its contract with the French Ministry of Culture, which runs the Paris exhibition biennales for two years. The ​MARCH 2019 edition, titled “Sacrifices: From Chaise to the Cross,” was held at the Culture Museum in Paris and drew a total of 236,000 visitors. The event was organized by the French Ministry of Culture and marked the cent", "The next Biennial should take place in the United Kingdom in 2021. \n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is launching a new fundraising initiative, Campaign for the Future, that will deliver monthly gift certificates to art-lovers across the United States. The program will also provide the institutions with $75,000 to create new scholarships for artists whose work is currently understudied or overlooked.The initiative is part of the $550 billion overhaul of the federal student loan program envisaged in President Donald Trump’s proposed budget for the 2021 fiscal year, which was released on Wednesday. The president signed the budget into law on Wednesday, March 5, and immediately began phasing out the various fees and surcharges outlined in the document, including the Perkins Loan and the Paycheck Refund, the Paycheck Protection Plan, and the Consolidation Process Fee. In a statement, the museum said: “The president’s $1.4 trillion in cuts to the arts leave us with a dismal choice: build a better educational system, or do worse.”While the Arts Council has praised the president’s actions as “transformative” and noted that the program", "The next Biennial should take place in 2021 and will include twenty-seven artists, including Yinka Shonibare, Yuki Nara, and Kenichi Kawamoto. Wangechi Mutu was appointed as chair of the 2019 edition and will take up the post in February 2020. \n\n\n\n\n\n\n\nMana Contemporary, New York: New York City-based artist and activist Chiara Boheme, whose performance, installation, and installation projects explore the relationship between art and power, died on December 6. Boheme was thirty-seven years old.Born in the small town of Pisa, Italy, in 1962, Boheme studied at the Academy of Fine Arts, Milan; the Italian La Sapienza, and at the Teatro Cultura in Milan; and at the School of the Art Institute of Chicago. She was the recipient of six awards, including the Prix d'Art Contemporanea, the Ponti Foundation Award for the Arts, and the Diadem Foundation Award for the Arts, and is the recipient of several other prestigious awards, including the Prix d'Art Contemporanea, the Arts Writer Award, and the Arts Council Award.Born in the small town of Pisa,", "The next Biennial should be held at the same time as the Exhibition. We are ready to take into account the needs of the many visitors to our Gallery. \n        \n\n\nPace Contemporary Art, the Florida-based nonprofit that supports and promotes artists in the Miami Beach area, has launched an initiative that will give $100,000 to ten local arts organizations each year. A portion of the funds will also go to community programming, and the organizations will each receive a $50,000 grant.The initiative, dubbed The Fund for Local Artists, was announced last month by Artistic Director Rony Gallop. He said that the goal of the fund was to create a set of tools that would help local artists by collecting and organizing their materials and resources. Gallop cited the increasing concerns over climate change, the impact of Hurricane Dorian in the Philippines, and the spread of Covid-19 as factors that influenced the organization. As the United States and the United Kingdom ramp up their efforts to contain the virus—the World Health Organization (WHO) reports that there have been more than 3,300 cases in the country and the death toll stands at 115—Gallop and David Schuler, president and CEO of Pace", "The next Biennial should be held in the spring of 2022.\n\n\nThe Royal Academy of Arts (RA) in London announced today that the next iteration of the Royal Shakespeare Company (RSCo) will take place in the autumn of 2021. The announcement follows the announcement of the 2019 edition, which was moved to December 31, and a 2019 survey of the British musical landscape, Hamlet.The 2019 edition, which was moved to February 15–March 14, featured performances by Richard Linklater, Jonathan Pryce, Owen Jones, and the revival of Parsley, the Covid-19-influenced musical about a group of brothers who discover a mysterious and mysterious planet. The 2019 show also featured performances by Rory Mulligan, Martin Mulligan, Justin Porter, Sarah Polson, and John Al-Khalili. The 2019 show, which is on view through October 29, was curated by Kaya Khan, director of the New York City Ballet, and reenvisioned by John Bargh and Daniel Barenboim.The 2019 edition of the Royal Festival Hall is sponsored by the Knutsford Foundation, the Knutsford Council, and the Knutsford", "The next Biennial should open in 2022, with the date to be announced. \n\n\nThe Metropolitan Museum of Art (the museum) in New York City has appointed Adrienne Edwards as director. She succeeds Daniel H. Weiss, who was recently appointed head of the Metropolitan Museum of Art after serving as director of the Metropolitan Museum of Art from 2014 to 2019, and will begin her new position in April.“Adrienne is a talented and experienced leader who has demonstrated an ability to influence and advance the Met’s mission and work across disciplines,” said director Simon L. Carter. “Her knowledge and passion for the Met and its programs and her exemplar museum-world leadership skills will ensure that the museum continues to flourish as a significant cultural and scholarly center for New York City and beyond.”Weiss started at the museum in 2003 and served as director for four years, ending in 2018. Since his departure, the Met has experienced a series of promotions and has risen to become one of the largest and most influential cultural organizations in the country. During his tenure, Edwards has expanded the museum’s collection by more than thirty thousand works. Over the last decade, she has promoted and diversified the museum’s holdings", "The next Biennial should take place in October 2020, alongside the 2020 Venice Architecture Biennale. The 2019 version of the event, titled The Future is Present, was held in Berlin; the event will be held in October of next year, at an undisclosed location in London. “I am delighted to be able to share with you the first exhibition of our new initiative in the UK,” said Mark Loutko, director of Tate Britain and chair of the exhibition. “This will be an extraordinary journey of new ideas, and a new kind of exhibition that will test our ability to think, feel and act differently, and will give a very different kind of exhibition to the biennial. We are very much looking forward to this new challenge and to presenting the work of the artists who have made the greatest contribution to the development of the modernist ideals of the London Biennale.”The first exhibition of the new initiative will be a retrospective of the next generation of British artists, which will explore how their work has been shaped by the events of the last twenty years. The work of Forty-nine contemporary British artists, including Mary Beard, Adam Clayton, Michael Griswold, Richard Avedon, John Ross, Barbara", "The next Biennial should take place in 2021.  The announcement follows the publication of “The Future Is Present: The Art of Contemporary Life” (2016–17), a special issue of Artforum that focuses on the role of art in shaping the contemporary world. The issue was curated by Michael L. Williams and Kate Mayhew and is available in the museum's collection.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for museums and cultural organizations that are attempting to relocate or reconfigure in order to comply with the city’s strict new immigration policies. The guidelines outline a ten-step process by which institutions may minimize the disruptions caused by the reopening of government-owned buildings, which have been closed since mid-March due to concerns around Covid-19. The local government currently enforces a nationwide shutdown that has seen crowds at public events drop to near-record levels.Mayor Bill de Blasio announced the plan in March, following a massive March 14 municipal election, and construction workers and artists, many of whom have been engaged in nonessential business throughout the month of March, began returning to New York from construction sites in Queens, as well as from factories in nearby Queens. The city has since seen a", "The next Biennial should take place in the fall of 2021 to select a theme for the exhibition. The exhibition will consist of three exhibitions: “Birds of a Feather: The Story of Birds,” which will offer a retrospective of the exhibition at the Museum of Modern Art; “The Story of Men,” which will showcase the work of the exhibit at the London Biennial; and “The Story of Animals,” which will include the work of the exhibition. \n\nThe New York Public Library is planning to open a new digital-only branch in the city this fall. The branch, which will be housed in a former factory in Queens, will offer access to more than 1,500 items by artists such as Ed Moses, Scott-Tran, Alex Katz, and the American painter Cecilia & Rose. The New York Times reports that the branch is launching in response to the city’s need for more digital resources. The city’s libraries, which are struggling with a backlog of more than four hundred thousand books, are currently trying to come up with new ways to digitize their holdings. The library intends to present a new collection of artworks, called the New York collection, online in January", "The next Biennial should take place in the spring of 2021, said curator Maria del Valle, whose team is currently working with two teams of artists to produce a new work by the artist. The work will be a reconstruction of a large-scale political demonstration, held in February 2022, in support of the Bolivarian Revolution.\n\n\nThe Smithsonian American Art Museum in Washington, DC, has received a gift of more than four thousand works from the artist Mierle Jovanovic, whose vast collection includes works by artists ranging from Robert Irwin (1949) to William S. Burroughs (1961), and that have never before been on display in the United States. The donation includes works by artists whose works have never before been exhibited in the United States, including more than 1,500 works by the late Croatian artist Radovan Karadžjus and a series of paintings by the late Italian painter Piet Mondrian.The donation also includes works by artists whose works were not generally known in the United States, including the monumental, 18,000-work The Dead Man Walking, commissioned by the late British artist Andy Warhol; seven paintings by the late Israeli artist Ilan Papp, a work that reflects a fusion of Nordic and Neolithic", "The next Biennial should take place sometime this year. \n\n\nThe Museum of Fine Arts (MFA) in Boston, Massachusetts, has received a gift of eighty-eight photographs by William Kentridge’s portrait series Surrealism and Spirituality, 1932–2017. The work, which was assigned to the museum in 2016, is now on display in the museum’s new exhibition “Ateliers d’Art Contemporaines” (2019–2020). Kentridge’s studio, which comprised several studios in the 1920s, was located in a former factory in the city of Dorchester, Massachusetts. The series was first published in 1932, and by 1938, photographs were being exhibited at the Museum of Modern Art, New York, the Museum of Modern Art, New York, the Museum of Modern Art, New York, and the Museum of Modern Art, New York.The exhibition will include photographs from the series, which include photographs from the Tokyo Metropolitan Museum of Art; the Japanese Pavilion at the Venice Biennale in 1974; and photographs by Kentridge at the National Gallery of Art, Washington, DC, in the Metropolitan Museum of Art in the 1990s. The work will also be presented as part", "The next Biennial should take place in Guangzhou, China, in 2022.   The biennial will present an exhibition of contemporary art, a movie, a performance, and a cross-disciplinary dialogue with the artist-in-residence.  The artist will also receive a prize of $10,000. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for how institutions that receive $1 million or more in grants annually should display the proceeds from the transactions on their websites. The guidelines, which were issued by the DCLA in conjunction with the reopening of the Metropolitan Museum of Art, prohibit institutions from displaying the funds in advertisements, or displaying the funds in limited-edition souvenirs.The guidelines were drafted following the city’s reopening of the Metropolitan Museum of Art in October 2019—the museum reopened on July 20—and were released on November 8. The guidelines outline steps that can be taken by institutions to display the Met’s contributions to the city’s cultural economy, including funds from grants, donations, sales, and rentals, and are intended as a courtesy to institutions facing reopening deadlines. “The guidelines are a starting point for", "The next Biennial should take place in the spring of 2021. Its theme will be “towards the future,” and the event will launch a campaign for further exhibition programming from the institute. The show will come to São Paulo in November 2020.The Brazilian government awarded the institute $4.7 million in support of the exhibition’s construction in September 2019. The funds were part of a $6.7 billion set-up for the exhibition, which was launched by the late president Luiz Inacio Duarte in 1995 and inaugurated by Duarte’s brother, Luiz Inacio Jr., and his wife, Daphne, in 1959.The global artists and writers who were included in the exhibition include Richard Anagnos, John Akomfrah, Susan Sontag, and H.G. Wells. It will also feature works by noted Brazilian artists and intellectuals, including Rodrigo Clemente, Elinha Campos, and Rudolf Oehlen, and will feature the work of twenty-one artists, including Lili Báez, Menni Jaresko, and Nara Pintura.The exhibition will be organized in collaboration with the São Paulo Foundation for the Arts, the City", "The next Biennial should take place at Lamda Contemporary Art in Paris in 2024, to be followed by the thirteenth at the Museo de Arte Contemporáneo de Madrid in 2020, and the twelfth at the Museo de Arte Contemporáneo de Madrid in 2021. The twenty-first Biennial, inaugurated in Buenos Aires in 2001, was held in the venue of the Museo de Arte Contemporáneo de Madrid from 2013 to 2015.Museums and cultural spaces in the city of Argit-Bruyne-Pape in Botswana have announced they are planning to launch new projects in collaboration with the city of Pretoria. The art and culture hub is planning to host a series of exhibitions, including a presentation of works by Sydney-based artist Julia Saville, who will transform the Beeler Gallery into a sculpture park and an exhibition of works by South African artist Alaina Abou-Rahme. The project is part of Museums and Cultural Centers South Africa (MCA), a program of “MCA” and “MCA Grand Alliance” that aims to create a new", "The next Biennial should be announced soon and will feature twenty-four artists, including Naima J. Keith, Kiki Smith, and Jodi Throckmorton. The theme for the exhibition will be “unmakeable: the continuing futility of resistance.” The list of artists who will receive the award in the fall is as follows: Allison Berlant, The Peruvian Center for Contemporary Art, Peru; Amílcar Almeida, The Museum of Contemporary Art, Los Angeles; Benavidez Armendariz, Buenos Aires; Joshua Barlow, New York; John Barlow, New York; Daniel Bradshaw, Los Angeles; Tania Boitano, San Francisco; Alejandra Gomes, Buenos Aires; Bill Corrigan, New York; Richard Cunha, New York; Duane Carlson, New York; Melchior Casals, New York; Cheim & Read Gallery, New York; David Chiu Gallery, New York; Minh Hoa, Seoul and Ho Chi Minh City, Vietnam; Bradley Creme, New York; Michael J. Hoberman Gallery, New York; Julie Harrison Fine Art, New York; Alex Holbrook Gallery,", "The next Biennial should take place in 2021 and the exhibition will be hosted by the Museum of Modern Art, Los Angeles. The exhibition will take up topics such as the development of black mediated visual arts, the history of African art, and the relationship between art and politics.The 2019 event, titled “African Art in the Modern World,” was curated by Kiro Saldarriaga. The works that were presented were chosen based on their appropriating techniques and their ability to examine the African diaspora. In a review of the work of the panel, which included Susanne Seroussi, Art Historik, and Mionel Tabet, the motion picture director of the National Geographic Society, this year’s exhibition “explored the process of migration, the weight of African diaspora identities, and the political economy of migration.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced its launch of the LACMA Art Walk, a free public art initiative that will bring together local Los Angeles artists in more than twenty cities across the United States. Titled “LACMA: The Art of the City,” the project will last for twelve weeks and will aim to", "The next Biennial should focus on the evolution of the art world, between the late-19th and early-20th centuries, and on the cultural encounters and collaborations between the two continents. It should also investigate the interrelationships between art and ethnicity in emerging markets such as Mexico and Central America. The second exhibition, entitled “Ethnicity”\u0097a term coined by the Brazilian artist Adrienne Atget to describe the contemporary art of both East and West, will bring together an eclectic group of artists from Brazil and from South America, including Antonia Almano, Mauro Duran, and Guarani artist Ravi Paragas.The exhibition will be organized by the Museu de Arte de São Paulo (MASPA), which was founded in 1948 by two brothers, A.J. and C.J. de Sousa, in collaboration with the newly formed institution of the museum. The new museum is being funded by the São Paulo State University (PSU) and the city of São Paulo.\n\n\nThe San Diego Museum of Art (SDMA), one of the largest cultural institutions in the United States, has received a $250,000 donation from a group of donors led by the Len", "The next Biennial should take place in 2020.\n\nWilliam Pittman Gallery, London: acquired by British billionaire Patrick Drahi in 2013, was granted an extension to launch its very first exhibition in the United Kingdom. The show, titled “Last Night,” will be on view in the exhibition space until March 29, 2020. The exhibition will also showcase the work of forty-seven artists. The full list of artists participating in the event is as follows:Frist Art Gallery, London: acquired by British billionaire Patrick Drahi in 2013, was given a new five-year contract by the arts patron. Previously, the gallery was only allowed to hold two exhibitions a year. As a result, the museum has been able to offer two shows in the United Kingdom every two years. However, in order to launch a new exhibition, “Last Night” will have to be moved to a different venue. The show will then have to move several times.Tucson Art Museum: acquired by the billionaire John Chapek in 2017, Tucson Art Museum director John R. Linnell Jr. extended the life of the museum by a year, from March 2019 to March 2020.", "The next Biennial should take place in 2020, with a corresponding exhibition and a retrospective of the artist’s work in 2021. The program will inaugurate the new museum in May.\n\n\nIn the months since a man was killed by a stray bullet in Washington, DC, on February 14, there have been a number of violent protests in the United States. Organizers of the March for March Against Racial Profits, which has been ongoing since March 14, have called for a national day of action, and the March for the Living have called for a national health emergency.The violence has been fueled by a number of factors, including the death of George Floyd, who was killed by a police officer in Minneapolis on May 25; the conviction of a white, arrested man in a separate incident, of second-degree murder in the death of George Floyd; and the ongoing protests over police brutality. Many have also blamed the coronavirus outbreak on Black Friday, November 22, when more than 1,000 people were killed in the United States.In an attempt to understand the current state of Black Lives Matter, Slate magazine published a long essay on Friday, January 3, in which Heather MacDonald, Sarah Schuessler, and I examine the history", "The next Biennial should take place at the Olympiastadion in Athens in May 2020, and the first in March 2021.\n\n\nThe National Art Museum Marseille (MA50) has received a gift of seventy-four works by American painter and sculptor Richard Avedon. The work was gifted by the Avedon family to the city of Marseille and the Avedon Museum of Art in the city of New York on Sunday, January 30.“Richard Avedon’s latest acquisition is a magnificent collection of paintings, sculptures, prints, drawings, photographs, collages, and paintings that will undoubtedly serve as a model for the museums of the future,” said museum director Marc-Olivier Houma. “Richard is a true visionary, a true craftsman, who shows tremendous expertise in all areas of his expertise, from photography to music, and beyond. We are honored to have received this gift from him.”The gift includes ninety paintings, forty-five works in sculpture and painting, and twenty-five photographs, all from Avedon’s series The Silent Black, 1966–2010 and The Stone Age, 2020–20, respectively. The exhibition will reopen on the museum", "The next Biennial should be held in 2021, and the next will be in 2022. The 2019 exhibition, “An exhibition of contemporary art in the cities, the countryside, and the interior,” was the theme of the first edition. The 2019 exhibition, “Towards a Digital World: Art and Internet Cinema” also featured a collection of new works by artists such as John Akomfrah, Robert Irwin, and Rirkrit Tiravanija, among others.\n\n\nThe National Museum of Art in Washington, DC, has received a gift of three eighteenth-century manuscripts from the Smithsonian’s National Museum of African Art in Atlanta. The gift includes an 1853 book on African art and the African diaspora, “Lost Treasures: The Creative Lives of Jacob and Wilhelm Willem de Kooning,” a 1946 book on African art and design, and a collection of drawings by Nando Negrita, a slave trader, in the 1800s.“We are extremely grateful to our generous benefactor, Arthur and Marta Morrison, for this thoughtful gift,” said Mary Anne Hay, director of the National Museum of African Art. “They have made a real difference in our", "The next Biennial should take place in 2020. The artist’s studio in Vienna, which is currently undergoing renovations, will host an exhibition of works that have been recreated by the artist in the lead-up to the event. The first show will feature the work of twenty-six artists, including Paula Adine, Flemming Kutzbach, and Konrad Fischer. The second, titled “Anchor of the World,” will feature the work of fifteen other artists.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $10 million donation from the estate of Leslie Jordan-Williams, the late head of the Los Angeles’s Skidmore-Rochester Art Museum. The donation will enable LACMA to double its current exhibition space, which currently occupies a former industrial building on the southwest corner of Wilshire and Highland, and will also allow the museum to open a new forty-one-thousand-square-foot museum that will offer new work by contemporary artists.“Leslie Jordan-Williams was an instrumental supporter of the Museum of Modern Art as well as the Arts Institute of Chicago. She was a tireless advocate for the arts and created critical partnerships with major", "The next Biennial should be held at the new urban epicenter in the heart of the city, the National Museum of Art, in Washington, DC; the Smithsonian Art Museum, in Baltimore; and the National Museum of Women in the Arts, in Boston.The exhibition will focus on the history of women’s empowerment, addressing themes such as childhood, domesticity, and femininity, and will include works by twenty-four artists working in all disciplines, including painting, sculpture, photography, performance, and sound and will run through March 23.The inaugural exhibition, “Astrid and Edie Sedgwick: A Daughter of Nature” (2010–11), was staged at the Guggenheim in New York and followed the story of the artist and activist Astrid Arnold, who was one of the first to use oil paints to depict climate change. In her first book, For More Rain: Wet Tapes from Astrid Arnold (2013) (Sheehan Books), she describes the process of using oils to depict the effects of climate change, explaining that the two artists shared a similar vision of the future: “I had this idea that this was my lifetime and this was my landscape,” she said.", "The next Biennial should take place in Tokyo from September 21 to September 23, 2020. It will conclude the exhibition season with a special exhibition of works by artists working in new media, at the Yokohama Museum of Art, in April 2021. The biennial will be hosted by the Peiha Institute of Arts Tokyo, which will receive $2 million from the Tokyo Metropolitan Government.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Laura Mulholland as its next director, and Sarah Schroth as its interim leader. Schroth will assume her post after Mulholland’s contract expires at the end of the month.“Laura Mulholland is a talented and dedicated leader who has built MoMA’s relationship with the community and exhibitions to new heights under her leadership,” said Mary Ellen Mark, chair of the board of trustees. “As the director of MoMA, she will continue to expand the museum’s international outreach through programs and exhibitions that engage with contemporary artistic practices and the museum’s collection in a visionary and interactive manner.”Schroth comes to the institution from the Metropolitan Museum of Art, where she served as associate director for exhibitions", "The next Biennial should take place in November 2020.The state-owned museum, which is housed in the former State Administration Building in Beijing, had planned to open in 2006 but was forced to postpone the opening by the Chinese government, which deemed the exhibition a security issue. The institution has since faced numerous delays, including its first exhibition in November 2012, which was rescheduled for March 2015.In July 2022, the museum will mark the centenary of the birth of the founder of the modern Chinese art form, Biennials. It will also capture the imagination of visitors with a series of immersive works, which will be accompanied by a new opera, a video show, and a book.The museum’s first exhibition in October 2022 will feature new works by twenty-eight contemporary artists. The exhibition will be followed by an open-air performance in December. The next exhibition will be held in December 2020.\n\n\nOn Tuesday, China announced that it will expel ten North Korean workers from its embassy in Beijing and the Chinese consulate in Pyongyang, the latest step in Beijing’s campaign to tighten border controls. The ten men were detained after a North Korean cargo ship—containing four North Korean laborers—began traveling from North Korea to China on May 6", "The next Biennial should be held in the coming months and will focus on the cultural, political, and spiritual aspects of the novel, creative, and architectural practices of the Bulgarian artist and thinker, Dr. Ivana Miliceva. Svetlana Kupriova will curate the exhibition, which will be broken into an exhibition and a series of lectures. The artist, who was born in Istanbul in 1930, has lived and worked in Bulgaria since the late 1940s. She currently resides in Sofia, where she has lived and works regularly.\n\n\nThe Bessie and Oskar Rush documentary, which premiered on HBO on Friday, has been acquired by HBO Films, the company founded by Richard Plepler in 1981. Titled The Bessie and Oskar Rush: The Untold Story, the film follows the artist and his family as they attempt to raise funds to have the Rush Museum in New York removed from the principle of the museum and moved to a new location.The acquisition includes the documentary film, The Bessie and Oskar Rush: Our Time, which premiered at the New York Film Festival in November and will be shown theatrically in the United States this spring. “This is", "The next Biennial should be held in 2022. \n\n\nThe Museum of Art (MoA) in New York has hired Caroline Watkins as its new chief curator and curator of modern art and design. Watkins comes to MOM from the University of Chicago, where she has served as the director of contemporary art since March 2019. She succeeds Cindy Sherman, who departed the institution in March 2019 to head the Museum of Modern Art.“Caroline brings a deep understanding of the Museum’s collections and collections of contemporary art and design, as well as a strong record of successful curating collaborations between MoA and other organizations,” said Joachim Diller, chair of the institution’s board of directors and president of the board of trustees. She will assume her responsibilities on September 1.During her tenure with MOM, Watkins has organized over thirty-five exhibitions, including “The Third Wave: Modern Art in a Contemporary Setting” (2016), “The Historian’s Companion: Dario Piro, 1993–2006” (2018), “The Anatomy of a Problem: Art in the Age of Mass Incarceration” (2018), and “Art in the Age of Mass Incarceration", "The next Biennial should include a new screening program in collaboration with local and international artists and organizations. The biennial will be a space for the exchange of information and ideas. The exhibition will also include a lecture series, an elective, a literary reception, and a gala. The entirety of the event’s production costs will be recouped by the museum, which will receive a portion of the exhibition proceeds. The full list of participating artists is as follows: Sidney Bernhardt (Switzerland) “Johan Franke: Die Biennale durch die Entwicklung. ” Allen Sanders (USA) “Evan Williams: The Man in the Shadows, 1983, ” Saara Kataoka (Japan) In the Shadow of the Wind, 1965,” Katsu Naito (Japan) “Etienne Leclerc: La Vieille Femme, 1969,” Laurent Boyer (France) “Hannah Pape: A Life of Art,” Juan José Bautista (Mexico) “Lèva Lazara: The Real Girl,”", "The next Biennial should take place in 2022, with an anticipated run date of 2020. \n\n\nA growing number of artists are refusing to sign petitions supporting the Paris Climate Accord , which aims to curb the nation’s carbon emissions and safeguard the global climate system from the ravages of a second global war, and instead are focusing their energies on symbolic actions. “We are not talking about individuals, we are talking about the climate system,” Leonore de la Peinture, editor of the upcoming biennial “Reality or Fiction? Art in Action,” told Artnet. With global temperatures continuing to rise, more and more artists and activists are questioning the need for large-scale climate action programs. Many are instead focusing on local, regional, and state-level actions.According to Artnews, more than 1,600 art workers have canceled work or withdrawn financial support from their organizations in the past two weeks, and on Tuesday the United Kingdom voted to leave the European Union. On Thursday, hundreds marched in London from the European Union’s headquarters to Parliament to protest the agreement.On Saturday, thousands of demonstrators gathered in Washington, DC, for a single march, dubbed “March for Science” ", "The next Biennial should take place in the spring of 2021.\n\n\nMADISON, Wis. (AP) — Two men have been sentenced to eighteen months in prison for brutally attacking and robbing a Madison woman during a September 2016 robbery that left her with life-threatening injuries, according to the Madison Police Department.The robbery and assault happened just two weeks apart, and investigators believe the attacks were part of a broader scheme to extort money from the victim. The woman, who is not being identified because of the ongoing legal action, was walking home from a bar on the city’s north side on September 14, 2016, when she was approached by two men in a white SUV. The men demanded money from the victim and drove her to a nearby Walmart, where they held her down while one of the suspects poured beer over her head and punched her in the face.The SUV then drove the victim to a wooded area a few hundred yards away from where she knelt on the ground with her hands behind her back and told her to “sit on your face,” the criminal complaint states. The SUV then drove the victim to a nearby wooded area, where the suspects continued to drink and have sex with the woman. The woman told her", "The next Biennial should take place in 2020.\n\n\nThe Gargoyles, a contemporary New York theater troupe made up of Yvonne Rainer, Linda Evangelista, and Mary Ellen McGarry, has been awarded a 2018 Pulitzer Prize for its portrayal of the life and death of the late American painter Frank Gehry. The group’s performance of the French Impressionist work The Surrealist in the Gargoyles’s production of the 1893 New York World’s Fair, Gargoyles, premiered at the Academy of Motion Picture Arts, and was selected for a Pulitzer by the Los Angeles Times.“We are thrilled to receive the 2017 Pulitzer Prize for our performance,” said McGarry, who is also the author of The Funhouse: An American Odyssey (Yale University Art Gallery, 2017). The work has been performed by the group numerous times before, including in 2006, in its performance of the famous 'Frank Gehry–on a Hot Air Balloon' at the Museum of Modern Art in New York; in 2015, for the first performance of the work at the Los Angeles County Museum of Art (LACMA); and in 2018, for a live performance at the", "The next Biennial should be held in 2020 and will be curated by Petra Wieder.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has announced its list of twenty-six artists who will receive the 2018 Cities/Cities: Art in Cities Award. The inaugural event, “Cities: Art in Cities,” was founded by Doris Duke and Peter Klein and will include the exhibition of work by twenty-four artists, including Tomasz Klimczyk, Rirkrit Tiravanija, and Adrian Piper, who are working together as the first collective exhibition in the United States to address displacement and climate change.Inaugurating the inaugural show, which will debut at the Los Angeles County Museum of Art (LACMA) this March, will be “The Most Dangerous Game,” a retrospective organized by artist Frank Gehry, and “Tanya Verra,” a play by Benjamin Cai, who will draw from his own body and the body of his partner, Angela Pérez, to create a work that evokes the intimacy and wonder of the mother-goddess. The work, which will be staged in November, will also include a virtual reality installation by artist", "The next Biennial should celebrate the mass production of art, the most advanced and comprehensive museums in the world, and its transformation into a unique cultural presence. The theme of the year is “Art and the Future of Humanity” and the theme of the exhibition is its transformation into a museum dedicated to the study of the art of the future. The exhibition will also include the exhibition “In Praise of Art” and “Art and the Future of Life” and will be staged in the newly renovated museum.Commenting on the upcoming exhibition, the festival’s artistic director, María Berrío Pérez, said: “We are happy to present this exhibition, which has a great resonance for the Buenos Aires metropolitan area, as it is a reflection of a historical and a contemporary moment that is universal and sustained.”\n\n\nThe Solveig Museum in Berlin has announced that it will begin welcoming visitors again on Monday, January 22, 2020, following a temporary closure due to the Covid-19 pandemic. The reopening of the museum will coincide with the reopening of the Solveig Galleries, the museum’s new architecture and design think-tanks. Inaugurating", "The next Biennial should be held in 2019.  The exhibition will present work by ten artists, including Niệt Tinh and Guo-Shun Hung, in the eighth and eleventh phases of the exhibition.  Tickets to the upcoming exhibition will be available in mid-March. The first edition of the Biennial was held in Hoa Nguyen Gallery in Saigon in September 2008, and it was the sole venue for the first exhibition of the current project cycle.  The exhibition was organized by a group of artists comprising Shikha Prasad, Domenick Reinhardt, Ana Pape, and Jasper St. John.\n\n\nThe November 15 issue of CoroCoro, a Japanese art magazine, has revealed that Japanese artist Tsuneo Araki has been selected to represent Japan at the Fifty-Ninth Venice Biennale. Since the artist’s work first appeared in Tokyo-based magazine Artnews in 1976, he has been featured in numerous other publications, including the Art Newspaper in California and various international exhibitions.Following his induction, he will present his exhibition “Sea of Blue Eyes” at the Tokyo Metropolitan Museum of Art on December 3. The exhibition will be", "The next Biennial should take place in 2020. \n\n\nThe Louvre Art Museum in Paris has accepted the invitation of the National Union of Museums of Art for the third edition of the Louvre: “Innovation in Art: Contemporary Art from the Louvre,” which will be held at the Louvre from March 19 to March 21, 2020. The event will also be held in the Louvre from March 29 to March 31, 2020.For the 2020 edition, the museum will remodel its existing building in the 100-year-old institution. The renovation project, which was funded by the National Federation of Fine Arts (Fédération de l'art et de l'écriture), will include the creation of a new exhibition space for contemporary art and a reopening of the old Louvre in 2021.The renovation of the Louvre will also introduce new programs and exhibitions as well as increase the museum’s capacity by 150,000 visitors. The museum’s current scale is 130,000 people per year. The renovation will include the addition of three new galleries, the development of a new lecture hall and the renovation of the Louvre’s existing gardens. The renovation will be divided into four", "The next Biennial should focus on emerging contemporary art and technologies and their relationship to contemporary life and the environment, and will aim to play an increasing role in fostering a more integrated and interdisciplinary understanding of contemporary art and artmaking. The theme of the biennial should be “Planet Earth.” “To me the most significant thing about the Biennial is that it is not another iteration of the same festival in the same venue, but a new and different way of looking at the world that is grounded in both eclecticism and technology,” Yale University art historian and curator of contemporary art Adam D. Weinberg wrote in a statement.   The exhibition will kickoff in December with an exhibition of work by artists whose work is housed in collections at the museum, and will run through March 27 with “nostalgia” as the theme.Artforum has reached out to the Biennial for comment.\n\n\nThe National Museum of Fine Arts (NMFA) in Louisville, Kentucky, has received a gift of approximately $200,000 from the John D. and Catherine T. MacArthur Foundation. The gift includes the museum’s collection of works by Charles Edens, Edward H. Wein and Robert Raus", "The next Biennial should take place in the spring of 2020.\n\n\nThe Swiss artist, known for her ornate, surrealistic works that often feature sexual imagery and often feature women in compromising positions, has died at age eighty-eight. The works, which were created in the 1960s and 1970s, are considered to be part of the now famous '60s–1970s school of architecture, the Künstlerhaus, which is located in a former textile factory in Basel, Switzerland.Born in Zurich in 1936, the artist studied in the Künstlerhaus from the age of thirteen. She began her art-making journey with a painting, for which she began by making paper vessels out of cardboard and cardboard parts, and then with the work of her own two hands. Inspired by the work of the late Swiss architect Werner Herzog and the work of the late French painter Paul Gauguin, she began painting in the Künstlerhaus in the early 1950s. Her first work was a sculptural work called The Birth of a Woman, 1967, which was exhibited at the Indel Potsdamer Platz in the spring of that year. To her late husband, the artist believed that the birth", "The next Biennial should include a selection of works by former and current exhibition crews and artists and should be open to the public from October 5 to October 7, 2020. The theme of this year’s event is “Spirituality and Cultures.” The exhibition is curated by acclaimed curators Yinka Shonibare and Mark Schleier and will be supported by the Lauder Foundation.Inaugurating the 2020 biennial is the first exhibition of new work by the artist-run nonprofit, the MFA Tokyo, whose inaugural exhibition “Into the Void” will open on October 9. The show will feature work by fifty-one Japanese artists, including Katsuji Yoshida, Hideki Kamiya, and Katsu Moroh. The exhibition will also introduce a new mode of payment: the biennial will calculate the fees for guests who will be given keychains and other rewards. The biennial will be hosted at Tokyo Metropolitan Museum of Art (TMA), the Museum of Fine Arts, Boston; the Museum of Modern Art, New York; and the Museum of Contemporary Art, Los Angeles. The 2020 biennial will be held at the Tokyo Metropolitan Museum of Art, from October 5 to October 7,", "The next Biennial should take place in the fall of 2020, and the first in the spring of 2021. The art of technology will be revisited in the fall of 2021, and the biennial’s theme, “the possibilities of the self,” will be revisited in March 2022. As the month of September approaches, we are reminded that September is also the month of the American Revolution, and that September is also the month of the Battle of Bunker Hill, the day the United States entered the first world war, and September is also the month of the Battle of the Somme. The goal of the biennial is to rethink and reexamine the nature of art, society, and technology, by considering how technologies are changing the nature of art, and by consider ing the possibility that technology might become the new nature. It will focus on the emergence of new technologies and how they affect us all.The exhibition will be held in the former factory space of the British Petroleum Company, and will be organized by Heather Macgregor, the director of the Museum of Modern Art, and Christopher Wool, the director of the National Gallery of Scotland, in partnership with David Adjay Gallery and the Centre for Contemporary Art Scotland. The exhibition will", "The next Biennial should be held in 2020. The institution hopes to organize a new exhibition in the coming years.\n\n\nThe Beirut Museum of Fine Arts (BMA) has appointed Geordie Wood as its new director. Wood previously served as director of the London-based Beirut Institute of Art (BMA) and as a professor at the University of East London. He succeeds Bernardo C. Atziaga, who will retire in March 2019 after a decade at the helm of the institution.“We are really excited to welcome him to the BMA,” said museum director Tamara Hendry, who has been working in the arts for more than thirty years. “Geordie’s extraordinary achievements as a curator, educator, and thinker make him a superb choice for this critical role. He is committed to supporting and expanding the BMA’s collection and exhibition-making, both within the UK and internationally, and has a proven track record of achievement. We are confident that he will take the BMA through this extraordinary century and become a leading expert in the field.”Wood’s first major international exhibition, “Hannah Arends: Holistic Art,” which opened at the Venice", "The next Biennial should be held in 2020.”The exhibition will feature more than 2,800 works by 30 artists, including Perreault, Toguo, and van Eyck, in addition to a new work by French artist Rinebaut, which will be presented as part of the museum’s “Feminine Dilemma” series. The show, which will be staged in 11 locations throughout Paris in 2020, is also introducing a new exhibition format that will be ­explored as a “realist” and a new series of lectures and talks that will introduce the exhibition to a new audience.\n\n\nFollowing the London riots, which took place on Saturday, June 7, and lasted for three days, the Tate’s board of trustees has decided to postpone the 2021 edition of the Tate Modern, scheduled for May 22–June 8. In a letter sent to the Tate’s staff on May 27, the trustees wrote: “We are aware that many of you are feeling uncertain and uncertainly, and that we have been working hard to ensure that we have a strong and positive future for Tate. However, we are worried about the future of our institution and our collection as a whole", "The next Biennial should hold its next edition, which will take place at the Municipal Museum of Art in Helsinki, in 2021. The exhibition will differ from previous iterations by including a selection of works by women artists, focusing on domestic life and the body. An additional exhibition will focus on women’s issues and its representation in art. The show will also focus on the central role of the body in art making, as well as on the process of reproduction, the preservation of artworks, and the exhibition of artworks. “Every year we are working to create new new works by women artists, which we hope will draw attention to the rich range of female artists of the past,” said Margot Helmer, the director of the Helsinki Biennial. “The exhibition ‘Biennale 2020’ will also introduce our audience to the history of art and the work of women artists, which is also essential for the development of our understanding of contemporary art, and will enhance our understanding of female artists.”In addition, the exhibition of the work of Kei Aoi and Yoshiko Hasegawa will highlight the work of prominent female artists of the late twentieth century. The show will feature ninety works by", "The next Biennial should be held in 2020, before the Fourth of July, and the Pérez Art Museum Miami should begin celebrating its 150th anniversary in 2022. The deadline for the 2019 edition was June 30, and in February, the museum revealed that it was actually moving the event from July to June. The museum will also soon host its first 'Full Day of Art', and, according to Artnet, will unveil a new group show on the history of photography. The museum will also unveil a new collection of more than 1,600 works by contemporary artists, including a selection of works by Pablo Picasso, Mark di Suvero, Anselm Kiefer, Nijoo Kim, Mira Durbin, and Arne Glimcher.\n\n\nThe European Commission has released the guidelines for the implementation of the Paris climate accord, which aims to mitigate the greenhouse gas emissions responsible for global warming. The document, which was drafted by an inter-agency group of EU states, aims to limit the increase in carbon dioxide (CO₂) emissions that is playing a part in global warming and is set to enter into force in December 2020.Under the terms of the Paris accord, the EU will reduce greenhouse gas emissions by", "The next Biennial should be held at the Museum of Modern Art in New York in November 2021, the October 21-November 23 edition at the Museum of Modern Art in New York in December 2021, and “later” if necessary, the Museum of Contemporary Art, Miami Beach, Florida, and the Museum of Contemporary Art in Miami. With a budget of $8.5 million, the 2020 edition will be housed in the same building as the newly renovated National Museum of African Art in Washington, DC. The 2019 edition, entitled “The Solidarities of the Self,” was staged by the Autry Museum of Art in Detroit and was distributed by the American Asian Art Museum in New York.\n\n\nThe American Institute of Art (AIA) in Pasadena, California, has appointed Mary K. Miller as its next president. Miller will assume her post on January 6, 2021. She succeeds Leslie E. Hawley, who has served as AIA’s president since November 2019.“From her first day on the job, Mary has been a leader and a champion of the arts and architecture at AIA and has been instrumental in elevating the museum’s reputation and attracting new audiences,” said A", "The next Biennial should be held at the Tutel Villamontari in Rome in 2021. The 2019 event will mark the sequel to the the original Alberto Biennale.  In an interview with the Art Newspaper, Milan-based architectural designer, architect, and cofounder of the Los Angeles–based firm MEC Architects, Carlo Cornejo, said that the new project will \"use the architecture of the future in the present. And there will be a new exhibition that will present the work of the biennale, a new exhibition in the pipeline, and a new project in the works.”The announcement follows the announcement of the 2019 edition of Alberto Biennale in Rome, which was also centered around The Body, the first exhibition organized by the Italian architecture biennial to feature new works by artists such as Alessandro Barbera, Christo, and Christopher Wool. The event will be followed by its 2022 edition in Milan.\n\n\nThe National Gallery in London announced today that it is planning to close its doors on April 27, 2020, to temporarily suspend the activities of the institution. The announcement follows the coronavirus pandemic and coincided with a major exhibition of works by", "The next Biennial should be held in 2021, and the first three-day exhibition should be held in 2022. The collection will continue to grapple with the materiality of life, the relationship between the individual and the environment, and the materiality of the human body.\n\n\nThe Art Newspaper in New York today announced that the art historian and scholar Tarek Atoui, a founding member of the institution’s advisory board, has been named its next president. Atoui will serve as deputy director of the museum for the unification of the European and Islamic worlds, and will assume the post in January 2021. He succeeds Anwar Abdul Rehman, who will retire in October 2020 after thirty-five years with the institution, and will assume the role in April 2021.“We’re excited to have this accomplished and eager to welcome him to the staff and board of the museum,” said Mary A. Nocito, chair of the board of trustees. Atoui will work closely with the museum’s curators, architects, and engineers, and will oversee the development of the institution’s collection of Islamic art. According to the New York Times, the museum plans to open an outpost in Tart", "The next Biennial should be held in 2020. The first iteration of the event, which launched in 2009, was held in London in 2015 and was attended by over seventy thousand people.The 2019 event, titled Art and Destruction, was organized and curated by Sarah Hunter, who was hired as the inaugural director of the Biennial by Tate Britain in London in January 2018, and Kirsten Jackson, who was appointed as the interim director in February 2019. The inaugural exhibition, “The Rettington Affair,” was curated by Vinnie Bagwell, and “The Atomic Years,” was curated by Barry Brown, and “The Last Days of London,” was curated by Josie Masse. The 2020 edition of Art and Destruction will travel to London in March 2020.\n\n\nThe National Galleries of Scotland (the National Gallery of Art and the National Portrait Gallery in London) have announced that Tom Daley, the former director of the Royal Institute of British Architects, will be replaced by Lois Proch, the recently appointed head of the Royal Horticultural Society, in March 2020. “Lois has been selected to lead the National Gallery of Scotland for the", "The next Biennial should be curated by a different curator and include a special exhibition dedicated to the life and work of Jean-Luc Godard. The Biennial of the Society of Architectural Historians will have a new director in January 2020.\n\n\nThe National Endowment for the Arts (NEA) announced today that Tulane University in New Orleans has been awarded $2.5 million for its new partnership with the French Foundation for Contemporary Art (FFCA). The National Arts Center in New Orleans and the French-American Art Museum in New York will collaborate to produce a series of exhibitions titled Marines du Monde, and Marines du Lettre, at the French Embassy in Washington, DC, in 2020. The works will be presented by artists from the United States and France and will be organized as part of the NEA’s “Unseen: Beyond the Modern,” a series of exhibitions that will feature works by artists from the United States and France that will take place at the French Embassy in Jerusalem from October 27 to November 13.The partnership is part of the NEA’s ongoing strategy to support the creative, civic, and cultural achievements of fifty countries in the Middle East and North Africa", "The next Biennial should be held in late-April/early-May 2020, and the venue should be located in the same area as the Art Institute of Chicago; a small museum in the city.\n\n\nSofia Coppola, the director of the Museo de Arte Contemporáneo (MASC), in Rome, is under fire for her handling of an outbreak of Covid-19 at the institution. During a time when the coronavirus has killed an estimated 11,200 in the US as of Thursday, January 2, Coppola has come under fire for allowing the spread of the virus to her staff.In an interview with the New York Times, Coppola said: “I don’t know how anyone is responsible for the virus. It is a private thing. The authorities will have to determine that. I don’t want to be responsible.”The interview has prompted a number of organizations to begin circulating an open letter signed by more than twenty thousand health care professionals and academics urging her to resign, and has also prompted an outpouring of support from the public. Since the letter was first published on January 21, more than five thousand people have signed it, and on Saturday,", "The next Biennial should be held on the campus of the University of Toronto in May 2021. The biennial will commemorate the centenary of the institution’s founding. “The roots of the Biennial are deep, and are in keeping with the aspirations and the spirit of our staff,” said Ryan Dobbs, chair of the board of trustees of the Toronto Biennial Foundation. “The exhibition-centered, collaborative, and community-building activities that have made the Biennial an institution that is accessible to a global audience are equally applicable to any city, village, or neighborhood in Canada.”\n\n\nTitled “The Art of the Impossible: the Art of Life in the Twenty-first Century” and curated by Jemima Alemany, the inaugural exhibition “The Art of Life” will open September 2 at the Tribeca Film Festival and run through September 20 at the Museum of Modern Art. The exhibition will focus on the concepts of art and life and will include works by twenty-six international artists and will be organized around a theme of “living.” The biennial will be followed by “The Impossible Dream,” which will take place at the Art Institute of Chicago in", "The next Biennial should be held in 2022.  Further Reading: Biennial Bénédicte Savoy, www.avantgarde.com/forum/showthread.php?t=162274 (Paris)\n\n\nThe Museum of Contemporary Art (MoCA) in New York has announced that it will begin welcoming visitors back to the institution in mid-September. The institution had temporarily closed due to the Covid-19 pandemic, but the MCA will resume operations after a September 15 reopening date, when the institution anticipates a large-scale public celebration.The MCA’s board, which comprises five members including director Katharina Burns, chair Maria Balshaw, and director Max Hollein, approved the reopening date for MoCA on Monday, August 31, and said that six months of planning followed the move. The move coincides with the launch of three new curatorial programs, “New Worlds,” “Art and the Future,” and “New Frontiers—” and will also allow MoCA to better engage with audiences through digitally enhanced exhibitions and installations and to expand its collection of contemporary art.“We are thrilled with this milestone day to", "The next Biennial should commence in 2022, the year of the twentieth anniversary of the Frankfurt School’s founding. The development of the exhibition’s program will be led by director and CEO of the museum Wolfgang Ehrlich, who also serves as director of the Art Museum Stuttgart. Inaugurating the theme “Art as New Order” will be a special exhibition of work by Danish artist Mikkel Østbye and his collaborators. The event will take place in the Neue Arbeitstheater in Frankfurt am Main.The 30th edition of the annual exhibition, “In the Image of the Berlin Wall” will take place at Frankfurt am Main until December 30. \n\n\nThe Museum of Contemporary Art (MoCA), Chicago has appointed Sarah Hoffman-Duke as its upcoming director. Hoffman-Duke comes to the institution from the Santa Fe Institute (SFE), where she is a senior research scholar in the department of art history and design. Previously, she was assistant curator at the Museum of Modern Art, where she served as curator of performance art and performance-based art. “Sarah Hoffman-Duke was selected for her exceptional leadership, her exceptional record of achievement as a curator,", "The next Biennial should be held in the summer of 2020. \nBruce A. Young, director of the museum, said: “The work of our curators, staff, and volunteers has shifted in important ways in the last twenty years. However, they have all remained committed to presenting a variety of perspectives and challenging themes to our audiences. It has always been the theme of the biennial, that we are all trees in the forest. Those of us who have been fortunate enough to have had the opportunity to work with Bruce or the museum are deeply moved by his unwavering dedication to presenting the work of the exhibition, and its future. I’m hopeful that after thirty years of representing, working with, and honoring Bruce, we will have created one final exhibition that embodies his vision and design.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it has issued the final licenses to the seventy-eight galleries that were previously exempted from having to make their space in the city’s public spaces available to the general public under the city’s New York Public Library and Museum moratorium. Those licenses were issued in January 2019 and March 2020, respectively, and will be honored by the city in early", "The next Biennial should take place in 2021. Themes of human relationships and the environment such as environment politics, the role of art and art history, and the concept of a “future society” are also recurrent themes in the exhibition. \n\n\nThe Fair of the Arts (FoA) in New York City has announced it will cancel the next edition of the exhibition, “Theater of Operations,” this year, citing the threat posed by COVID-19. The fair, which has been held in New York City since 2008, was forced to move to a new venue in Long Island City after it closed to the public in March.The decision to cancel the event comes amid a global health crisis sparked by the novel coronavirus, which has infected more than 120 countries and caused more than 11,000 deaths. In a letter sent to attendees on Friday, organizers said that the event will be canceled due to concerns for the safety of guests and staff and the exhibition schedule and finances. “At this point, the risk of a full-blown coronavirus outbreak in the United States is remote—but it’s there, and it’s getting worse,” said Elizabeth Lieberman, director of the", "The next Biennial should be held in the fall of 2020, and the institution will begin building the museum’s pavilion this spring. The new pavilion will be located on the third floor of the biennial building, in a building that will also include its permanent collection. The biennial’s exhibition “Toccarlo: From Venice to San Francisco” will kick off the museum’s season with a special exhibition of work by international artists and designers. The exhibition will feature works by artists such as Alison Judd, Monir Shah, and Lutz Brugmann; including paintings of works by Robert Mapplethorpe, Edvard Munch, and Hans Hofmann; sculptures by Andrée Chedid; and paintings by Charles Musso.In the spring of 2020, the museum will reopen to the public with a special exhibition of work by artists from the old biennial building. The exhibition will be followed by “Toccarlo 2020: From Existentialism to Egotism,” which will be held in July.  After an evaluation of the national organization’s proposals by the National Council of Fine Arts in December 2015, the institution voted unanimously in favor of", "The next Biennial should be held in the fall of 2021.\n\n\nRococo, which was founded in Los Angeles in 2016 by six artists, including Shawn Broderick, Monica Alleari, and Monica Alves, has announced its representation of the original cast members of the television movie The Exorcist. In an announcement made today, the company said that Liev Schreiber was selected to represent the United States in the exhibition and that the other finalists were: Rodger Black, Julie Andrews, Rosemary Bonham Carter, and Gwyneth Paltrow.Rococo will stage the exhibition at its Santa Monica location, which is currently undergoing a $50 million expansion, at the same time it will stage the biennial Beyond the Exorcism. The exhibition will also include a digital version of the film, which will be shown on the biennial’s platform. The exhibition will be on display until August twenty-six. The inclusion of the original cast members in a show about the future of art is a departure from the style of previous exhibitions at the company. Previous exhibitions focused on the use of technology to advance artistic practice and the reception of artworks. \n\n\nCinemaPalm Art Museum Houston has", "The next Biennial should bring the work of a select group of artists to life through various interactive and multi-media installations. The theme of this year’s edition will be “Art and Radical Politics,” and a selection of works by the group ART+ from next year will be unveiled at the exhibition. The first part of the biennial will focus on artists’ conceptualization of “art” as an antithesis to the political and social realities that they were portraying at the time. Biennial director Yuji Matsuda told the Japanese daily Asahi Shimbun that the exhibition will not only include “art” but “politics” and “spirituality” as well. While some political activists have taken the art world to task for its silence in the ongoing protests against Japanese militarism, Matsuda said the exhibition will “represent the spirit of engagement” through a “radical politics” that will “see politics as an extension of art, as a combination of art and politics.”\n\n\nThe Institute of Contemporary Arts (ICA) in Sydney, Australia, announced today that Paloma Gamboa has been elected as its new chair. Gamboa, who has served as the I", "The next Biennial should take place in 2020 and will be hosted in the city’s historic St. Andrew’s Church. It will be entitled “In the Light of a Man” and will be curated by the artists and the city of London. The biennial will organize a symposium on the life and work of Gaudi and an exhibition of works by the artists who have been selected by the council of the Barbican. The museum also revealed the new exhibition and the 2018 edition of the Barbican Biennial, which is titled “The True Story of the Barbican.” The exhibition will feature twenty-six works by thirty-two artists and will be on view in the museum until November 21, 2020. The museum also revealed that the exhibition “will include a review of the Barbican’s collection, in order to impart an air of history and enliven a sense of place.” The 2018 exhibition featured work by ninety-three artists.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced its representation of the Mexican artist and activist Anna-Carol Hernandez-Santiago. Hernandez-Santiago’s work, which focuses on the creation", "The next Biennial should happen in 2020, with the first exhibition taking place in 2021.\n\n\nA man who was arrested this week in New York for allegedly trying to smuggle a large amount of cocaine from Italy to the United States was released on Tuesday in a New York City hospital after he made a brief but dramatic escape. According to the New York Times, the forty-four-foot-long (11.6-meter-long) container ship, dubbed the \"Yuz Museum,\" was moored in a harbor in Long Island City, New York, on Monday and had been attempting to sail into the country since at least November, when it had to stop because of a power outage.The ship had been illegally en route since December of last year, when it was intercepted by customs officials in New York on suspicion of bringing in more than 1,500 pounds (1,500 kilograms) of cocaine. The man, identified as Marco Graziano, allegedly admitted to smuggling the drug but said he only had three hundred dollars (about $36,000) in his possession at the time. Customs officials seized the container, which was loaded with cocaine, a kilo of marijuana, and around two hundred other suspected contraband items, including a video camera,", "The next Biennial should be held in 2020.\n\n\nThe Haus der Kunst (HdK), Berlin, which was founded in 1931, will move to the Max Mueller Museum of Art in Stuttgart on January 3, 2022. The institution, which has two hundred and fifty-two galleries in twenty-five countries, will remain closed to the public as it opens the year after. The museum’s new location will be made possible with funds from the German government.HdK director Joachim Herrmann said: “We are delighted to continue to develop our exhibition and educational program, keeping in mind the legacy of the Haus der Kunst as an educational center. We’ve also been working hard to make the exhibition space more compact and modern, as well as to develop new artworks and new programs. We hope that the new HdK will show how to create new works with a modern and contemporary feel.”\n\n\nThe Kunstraum für Kunst (KfK) in Bonn, Germany, has appointed Miranda Zador as its new artistic director. Zador will assume her post on January 30. She succeeds Perrotin, who has served as director of the Berlin art-", "The next Biennial should be held in 2022, according to organizers, and will be hosted at the Museum of Modern Art, New York, and will be curated by Kate M. Johnson, the director of the Cary Museum of Art.“The Museum of Modern Art, New York, is currently working with our partners at the New Museum to present a series of exhibitions that reflect the library of the great American architect, architect, and industrialist, Frank Gehry,” Johnson said in a statement. “We are grateful for the support of the academic and museum community and our partners, and look forward to deepening the biennial’s legacy with the exhibition of the work of the biennial’s artists in 2020.”\n\n\nThe Italian architect and activist Gio Ponti has resigned from his post as assistant to the prime minister of the Italian state, Dario Franceschini, following a stormy campaign of criticism that culminated in a display of works by the artist Ai Weiwei and the Soviet artist Aleksey Grazhdanskoy.The exhibition, titled “Eternal Silence,” was meant to celebrate the Italian artist’s eighty-third birthday and was organized by the Arts Ministry and the Dario Franceschini", "The next Biennial should have been held in 2020. However, due to the high number of participants and the complications caused by travel to the Middle East, including from the United Arab Emirates and Bahrain, which are currently in conflict with each other, it was pushed back. \n\n\nInstitute of Contemporary Art (ICA) Dubai announced on Thursday that it will present a new exhibition dedicated to the country’s contemporary artists in April, 2020. Its first initiative will be the inaugural “Centre for Contemporary Art” (CCA) in Dubai, a second-level facility that will host the artist-in-residence program, which was launched in 2019 and has yet to return a single artist for the past twenty-six months. The CCA, which aims to organize four-week residencies for artists in the UAE. The institution also recently partnered with the Abu Dhabi Foundation for Contemporary Arts to create the Abu Dhabi Film Festival and the Abu Dhabi Literary Festival. It has also committed $148,000 to the project.“The CCA is a pioneering partnership that has undergone a paradigm shift since its inception,” ICA director Farida Akram said in a statement. “Through a series of intensive and collaborative relationships, the", "The next Biennial should focus on programs and ideas that are already in place but need to be enhanced, such as the international exchange of ideas and skills.To provide an example of a modern-day project that is already underway, the committee decided on creating an exhibition dedicated to the life and works of Italian architect, Stefano Manzoni. Manzoni is considered a pioneer of the Italian modernist style. He founded the firm Polidori, which was later renamed to Matter, that pioneered the production of hydroponic and permaculture-based products, such as the bags and containers for tomatoes and watermelons, and the company Organica, which was later sold to Dukov, the Russian state-owned company.The 2016 edition of the Biennial, “Fabrica 16,” saw the exhibition of work completed by twenty-six artists from twenty-eight countries. The exhibition featured works by Julie Foudou, Olu Oli, Vito Acconci, Tanya Benita, Jodi Kantor, Majora Kifay, Hannah Rosenberg, and Lydia Tallant. Other works included photographs by Sam Gilliam, Steven DeSousa, Vivian Naidoo,", "The next Biennial should be on the eve of the French Revolution, and will be held in the year 1789. While the theme of the next edition of the Art Biennial will be 'Pursuits and Poses'\u0097the contemporary term for artworks “in a state of constant transformation\u0097the theme will be the work of the avant-garde.The theme of the third edition of the Art Biennial will be 'Imagination and the Image” and will be curated by Adriano Cicutto, who will be taking on the role of curator for the third edition of the Art Biennial. In the first edition of the Art Biennial, Cicutto curated a show of work by Pablo Picasso titled “In the Realm of the Impossible.”In the new exhibition “Pursuits and Poses” Cicutto will present a series of images that are embedded in a 'post-totalitarian' mode of articulation. The work will also feature collaborations between artist-collectors, artists, and museums that will engage with the work of artists and their representations.The exhibition “Imagination and the Image” will run from February 13–February 22 at the Pont de", "The next Biennial should be announced in the next few weeks.The Biennial is still accepting donations, but it will not require donations from individuals, and will not be able to stage events because of the pandemic. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is expecting a $100 million shortfall in its second-quarter revenue due to a combination of the Covid-19 pandemic and a temporary drop in visitor numbers. The museum expects to be reimbursed for the full costs of its expansion, but it is concerned about whether the museum will be able to make up for lost revenue from the new museums built in the city. MoCA is planning to shutter the Los Angeles County Museum of Art (LACMA), the Los Angeles Museum of Contemporary Art (LACMA), and the San Diego Museum of Art (LACMA) in the coming months and will begin the process of selling off more than ninety percent of its assets, including the Joseph and Mira Showroom, the Hollywood Bowl, and the Santa Monica Pier.The move has forced a change of plans for the Raymond James Building, which was already preparing for a major renovation that will be completed by 2021 and will host new exhibitions and events in February", "The next Biennial should consist of a selection of works on the material culture of the Aral Sea, Iran, and the Republic of Azerbaijan, as well as works on New York, DC, and South Korea. The theme of the new exhibition will be “Perception and the Body,” with an emphasis on the changes caused by nanotechnology. The exhibition will take place in the redeveloped Museum of Art of the Arts in the city of Tehran. The first exhibition was published by the Center for Contemporary Art in Tehran, the Art of the Party in the capital, on February 14 and will be on view until March 18.The biennial’s three-day “Vision” event will be held from February 13 to February 16. During the exhibition, titled “Vision’s Art of the Party,” the artist responsible for the piece will be selected from a group of forty-one artists, including Mehrdad Salih, Omid Saadi, Mohammad Ali Saeedi, and Nasrullah Shah. The artist will be asked to create a work from a series of images captured by the artist and will also be asked to create a new conceptual image from a photograph that has previously been used for", "The next Biennial should be held in Helsinki in 2021.\n\n\nThe University of California, Los Angeles (UCLA), has appointed Andrew Schoelkopf as its next dean of the School of the Arts. He succeeds Diana Al-Madani, who retired in March 2018 after fifteen years at the helm of the university, and will take up his new post on October 6. Schoelkopf first joined UCLA in 2011 as associate director of the UCLA Center for the Arts, and then served as director of the UCLA Center for the Arts until 2015, when he was hired as associate director of the UCLA Graduate Center. Between 2015 and 2019, he cofounded the UCLA Live Arts Program, a live arts event series created in collaboration with the university.Schoelkopf will take up his new post in September. He succeeds Michael Sebastian, who retired in January 2019 after eleven years at the helm of the UCLA Graduate Center. Margo Allen, who is retiring from the chief of art, architecture, and design, will serve as interim dean until a new director is appointed.\n\n\nThe Museum of Fine Arts (MFA) in Miami Beach has received a $500,000 donation from a group of individuals led", "The next Biennial should open in June 2020 and will take place at the Institut d’Art et d’Histoire in Paris. \n\n\n\n\n\nNelson McClellan Gallery, Atlanta, Ga., has appointed Kerry D. Thomas as its next president. He succeeds Jennie Achenbach, who departed the institution in March 2019 to lead the International Center for Art History, and will take up the post on January 5, 2021.“McClellan has always been about fostering the uniqueness of art and about the relationship between artist and audience,” Thomas said in a statement. “McClellan’s work has been presented in a variety of venues, including at the Museum of Modern Art in New York, the Metropolitan Museum of Art in the United States, the Museum of Contemporary Art Detroit, and the Metropolitan Museum of Art in the United Kingdom. His recent exhibitions include ‘The Circle: A Retrospective of Work in 3 Dimensions” (2017) at the Met; “Death of a Great Idea: The Band and the Artist” (2017) at the Museum of Modern Art in New York, the Museum of Modern Art Detroit, and the Toronto Contemporary Art Fair; “Plain", "The next Biennial should be held in 2020. \n\n\nThe Yuz Museum of Modern Art in Tokyo has announced that artist Taniguchi Ooi will participate in the third edition of the Biennial in the city in 2020. The exhibition will focus on the \"continuity and rhythm of contemporary life in Asia and the Pacific, focusing on the major cultural and historical events of the past sixty years in Japanese art and archaeology, with an emphasis on the major national and cultural events of the past decade in Europe and the United States, and a reconstruction of the twentieth century in the context of a Japanese museum.“Yuz will be transformed by your presence,” said Ooi. “I’m excited to return to the Yuz Museum with a new stage in the next twelve months, and to be able to present the third instalment of the Biennial in Tokyo in 2020.”A pioneer in contemporary Japanese art, Ooi first studied at the Kinki Institute of Art in Kinki, Japan, before taking up the post of chief curator at the Hochberg Art Museum in Vienna. Since its inception in 1974, the exhibition has exhibited more than eighty artists, including Haruna Yukawa, Takashi Takemoto,", "The next Biennial should be held in 2021 and will be the first to address the current global health crisis. It will feature all work by artists working in the biennial, from the worlds of cinema and performance to the physical and social worlds. The theme will be “Planet or State?” The biennial will also include a thesis by the director of the Künstlerhaus in Berlin, Sabine Neubert; a lecture series by artists such as Simone Leigh, Willem de Kooning, and Simon Schama; and a special retrospective.\n\n\nThe 2017 Cannes Film Festival, which kicked off on May 29 and runs through May 31, was marred by a technical glitch that caused the event to go missing for a month. The French company French Cinematographings (CFM) said that the event was “incomplete and distorted”\u0097indicating that the films would be published online soon\u0097until the next scheduled screening of Deuce Bigaloo, a French independent film festival, on August 21.The exhibition, which featured work by fifteen new and established artists\u0097including Alexander Calder, Audris Mijares, and Hélène Delahanty\u0097was scheduled", "The next Biennial should be up in the fall of 2020. The next König Biennial will be up in the spring of 2021. The next Fluxus Art Biennial will be up in the autumn of 2021 and the next Fluxus Design Biennial will be up in the spring of 2022. I have also been working on developing several other projects, including the first ever symposia in Germany, which will take place in Berlin in the summer of 2022 and will also be open to the public.\n\n\nThe Lebanese-born photographer, essayist, and curator Mahmoud Darwish, whose body of work juxtaposes expression and craft, has died at age eighty-four. His work has been exhibited at the Beirut Art Museum (BAM), the Venice Art Museum, and the Tate, as well as at the City Gallery in Tokyo and the Museum of Modern Art (MoMA), in New York. His work is currently on view in the Lebanese exhibition “La Belle Organique” at the Museo de Arte Contemporáneo Beirut. Darwish’s first major solo exhibition at LAXART in the United States, in 2017, followed two years later with “Touma: From", "The next Biennial should take place in the autumn of 2020. Its theme will be “Art and the Future of Life” and will focus on “biotechnology,” a topic which has been on the agenda of the Biennial since 2012. “The science of life and the universe is still in its infancy,” said Hiroshi Kawanishi, the director of the Tokyo Museum of Art. “However, the future of life and the universe seems to be moving forward, with the help of technology.”The Biennial will be hosted by the Tokyo Metropolitan Government, the Japan Science, Technology, and Society (STS) Institute, and the Tokyo Institute of Technology. The installation will take up the themes of “autonomy and autonomy” and “the nature of the personal and the social environment.” The theme will be modified from the original “Three Perspectives: From Life to Life” by Akira Nara to “The Future of Life as a Whole,” a point of view taken up by Michael H. Spero, a professor of physics at the University of California, Berkeley.The exhibition will be organized by Koki Tezuka, Koki", "The next Biennial should take place in 2022 and will be hosted by the Museum of Contemporary Art in Los Angeles.\n\n\nMUSEums and cultural centers across the United States are planning to push back against President Donald Trump’s proposed $3 trillion budget by reopening as many as ninety-four museums and 1,900 cultural sites—a daunting task given the nationwide closures and severe economic fallout stemming from the coronavirus pandemic.Sen. Barbara Boxer, the California Democrat who chairs the Senate Appropriations Committee, told the Los Angeles Times that the government’s cultural institutions will not be able to reopen without $3.5 billion in emergency funding. “We have to start planning for a world where cultural institutions and businesses are not only able to reopen, but thrive,” the California Democrat said.According to the New York Times, the 1,000-plus-day-long shutdown has already forced a change in exhibition and ticketing policies at some seventy-five museums, including the Metropolitan Museum of Art, the Whitney Museum of American Art, and the Seattle Art Museum, which closed indefinitely on Tuesday, March 26. The Metropolitan Museum of Art, which serves some 2.7 million visitors a day, had announced it would reopen", "The next Biennial should have the same scope and aim as the inaugural, and should take place in the same circumstances. The next iteration of the exhibition will be the first to deploy the new site-specific technology, and will be organized in a much more intimate and intimate setting. In addition to the daily life of the artists, it will include an interdisciplinary project for young people, a digital performance series, and a book club.”The first show of the new series is “The Art of Living,” which will run for a month and will feature the work of twenty individuals, including Ashley Fritz, Anna Harrison, Hanna Mark, and Tania Melkam, among others. The exhibition will also include a discussion of the “limits of language,” a new‐school performance from Icelandic artist Sigfusdottir, a cinematography from the Italian curator Carla Bruguera, and a “black and white” painting by the Tunisian artist Henna El Shishani.\n\n\nThe London-based charity that aims to conserve and restore the lives and work of contemporary artists is preparing to launch a new initiative that will give £1 million ($1.2 million) to UK-based artists every", "The next Biennial should take place in 2020. The fourth edition of the exhibition is currently on view at the Museum of Modern Art in New York, with the exhibition debuting on October 21.\n\n\nA new survey of the work of eighty-three artists spanning forty years reveals that the United States was the world leader in the exhibition, distribution, and repair of works of art in 2020. The study, which was conducted by the Gallery of Modern Art (GMA), reveals that the art market in the US generated $6.3 trillion in revenue for the federal government in 2020. The study, titled Art in the Age of Trump: How a Nation Cares in 2020, was commissioned by the Association of Art Museum Directors (AAMD) and the Association of Art Museum Professionals (AAMDPA), and was compiled by the GMA in partnership with the Association of Art Museum Directors (AAMD) and the Association of Art Museum Researchers (AAMDRS).The findings are based on data collected from the GMA’s online catalogues, which catalogues, display, and appraises artworks in the US. The GMA also maintains a database of twenty-five thousand works in the US and a database of more than five thousand more than", "The next Biennial should be held in 2022.\n\n\nThe Tate’s board of trustees has announced that it is preparing to split into two divisions: the museum’s artistic and administrative arm and the artistic and commercial arm.The division will operate under the new title Tate Enterprises and will be led by Amanda Suttner, currently a senior director of Tate’s commercial arm. She will step down as director of Tate’s commercial branch in June 2020 and will assume the title of director of Tate Modern. Her new role will involve “making the most of the museum’s enormous collections and the extraordinary collections of Tate’s partners,” said Suttner. “I will be enormously proud to work with my new colleagues and new audiences in supporting the museum’s artists and their projects, while also ensuring the museum’s long-term position in the community.”The extension of the museum’s current contract, which runs through 2023, is part of Tate’s £6 billion expansion plan. Since the museum is currently unable to open its new campus in Tate Modern—due to the Covid-19 outbreak and a planned reopening of Tate", "The next Biennial should take place in the summer of 2021. The exhibition will be hosted by the same architect and the same team as the previous one, but will be entirely rebuilt. Since the exhibition was cancelled in April 2019, the pavilion has been converted into a research center for the exhibition, which will be housed in the institution for the next two years.The project was inspired by the Flemish artist Hans-Ulrich Ludwig’s monumental project to rebuild a museum in the Flemish city of Biemar. The museum, which is named after the town of Biemar, is one of the largest architectural projects in Europe, and was inaugurated in 1927. The project also included the construction of the city’s first municipal synagogue in the early 1930s and the museum’s first public outdoor theatre in 1976.While the original exhibition, “Anton Kern: Flemish National,” is currently on loan to the Biennial of Sweden and will be presented in late August, the next edition of the exhibition will be held in September. The new exhibition will feature speeches by some seventy artists from eighteen countries and will take place in the city of Biemar, which is located on the banks of the Danube", "The next Biennial should be held in 2021, when the ninety-sixth edition of the museum will take place.  The museum will carry out a major refurbishment of the building in 2020, when the museum will be celebrating its sixtieth anniversary. The new exhibition spaces will be installed with the theme \"Live in the Moment\" and will serve as staging areas for the forthcoming exhibition “Buy in: Art and Politics.”The project, which integrates modern and historic art, is part of the museum’s ongoing exploration of the role of art in the emergence of new political and cultural identities. The museum recently opened a new research center dedicated to the art of the twentieth century, a new exhibition of works from the collection of the recently deceased, and an exhibition of works from the collections of the Danish and American biographers Henrik Gudbrandsdottir and Jørgen Haber.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it is launching the New York City Residency Program, a new program that will provide tenured Manhattan-based artists with a yearlong residency in the city. The program, which will be administered by the NYC Department of Cultural", "The next Biennial should have been held by now, a few weeks ago. I would have given my all to see it finally succeed. And yet, it still isn't. I want to see Biennials 1 and 2 lead the way in the right direction. Not just because I believe they are the best ways to approach the art world, but also, because I hope that they will become a model for how you might conduct an exhibition at a time when so many are so afraid of the future.  If we do not now, then we will not then. I want to see this Biennial become a monument to the vision of an artist-friendly, sustainable future.”\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Anna A. Luban as its new senior curator of photography. She will work closely with curator and former member of the collection Philip Lambert, who will serve as the next director of photography, and will take up her new role on March 23.“Both Philip and Anna have been an essential part of the collection, and their expertise and passion for photography, both as a discipline and as a medium, will be integral to our future,” said Guggenheim director Howard R", "The next Biennial should launch the same month as the 1894 fair’s inaugural exhibition, which will be held at the Museum of Contemporary Art Berlin in August 2019. The show will also include a special exhibition of work by artists who have never been on public view and will feature works by as many artists as possible.The biennial will run from October 28 to October 31. The dates are in accordance with the theme “The Precious (Sensitive) Heart of the Art.” The biennial will be organized as a “collection.” The collection will include ten works by artists whose works are currently on display in the exhibition, which will be organized as a “cinematic transcription.”The exhibition will also include a retrospective of artist Frank Sébastien’s work, titled “Sébastien Mellet de vivre,” which will be on view in the exhibition ’s series “The Path of the Artist.” The work, which will open on October 5, will be accompanied by a new monographic television series (#theartofstray).\n\n\nArts organizations in the United States are planning to stage a protest against the coronavirus at", "The next Biennial should be staged at least four years from now, in a location that has been selected by the City of Paris, the National Centre d’Art Contemporain de Paris, and the Museum du Quai Branly, and should take up contemporary art. Museum director Jacques Roux-Picot has said that the year 2020 will mark the centenary of the founding of the museum and the manifestation of the artist’s dream in art. In a statement, Roux-Picot said: “The themes of the next Biennial are to be an open and unifying city, an open and unifying museum, the spirit of the twenty-first century art, and art as a public space.”\n\n\nNew York’s Metropolitan Museum of Art (MoMA) in New York City is trying to reposition its expansive collection of artworks by artists who have recently died in order to present works that are “more relevant, more relevant today, and more relevant tomorrow.” In a new initiative, the Met will sell works by forty-one artists who were last year’s recipients of the Metropolitan Museum of Art’s $10,000 Artist Lifetime Grant—", "The next Biennial should be slated for January 2021; the previous one, which was staged in 2012, lasted for only eight months. It will co-organize with the contemporary art biennial Den Haag and will formally open to the public at the first Biennial in January 2021. It will also host a series of performances and exhibitions centered around the theme, which will be announced by the start of January 22.Commenting on the upcoming exhibition, Anne-Marie Jakob, director of the exhibition space Biennale Minneapolis, said: “It is an honor to be able to present the first exhibition dedicated to ‘Japanese art history’ at the Biennial. The exhibition will be a traditional and unusual exploration of the history of Japanese art, presenting both the contemporary narrative and the Japanese art that embodied this.”\n\n\nThe National Portrait Gallery in London has appointed artist and collector Piers Jacob as its new chief executive officer. In the appointment, which was made on Friday, Jacob represents the gallery’s parent, the National Gallery, which was founded by the British oil magnate Lord Giddens in 1926. The gallery’s current board and directors consist of Jacob, British artist Lord Dunlop and American collector Helen C", "The next Biennial should be a celebration of the history of science, art, and technology to reflect the great breadth of subjectivities and to ensure that people are able to experience the diversity of contemporary knowledge and ideas through a broad range of mediums. We must create the conditions for the next Biennial to be a creative and enriching platform for the public to experience what science, technology, and the arts can do.”The Biennial of New York State will be held at Rockefeller Center from March 21 to March 25. \n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of forty-one newly discovered works by artist Vinnie Bagwell from a group of dedicated collectors led by James Bagwell in a private donation. The donation includes works by thirty-three artists, including Meryl Albright, Elizabeth Ann Gish, Charles Atkins, Carl Barboza, and Paul Gauguin, and includes five pieces by the Brooklyn-based artist in the collection of Zendaya Bagwell, who is known for her ambitious projects that are centered on shifting the museum’s collection in her favor.“We are thrilled to support the Bagwell family and to share James and his amazing collection with the world,�", "The next Biennial should be held in 2021.\n\n\nThe Association of Art Museum Directors (AAMD) announced today that it is launching a new funding initiative for nonprofit museums that have experienced losses or damage to more than $100 million in any of the five previous iterations of the prestigious Art Basel (AA) World in Asia (SW Asia) fairs.The initiative will provide $115 million for “alternative finance and services.” This includes $105 million for cultural organizations and $75 million for “museum-building” projects. The funds will be divided between the AAMD and ten regional funds: the Asian Art Campaign, the AAMD Support Fund, the AAMD Cultural Fund, the AAMD Community Fund, the AAMD Cultural Infrastructure Fund, and the AAMD Cultural Impact Fund.“This is an unprecedented crisis for museums and we are deeply grateful to the galleries and organizers of all five previous editions of the AAMD World in Asia—2018 and 2019—for being part of this; for being inspired by this, for supporting this, and for inspiring others to join us in their efforts,” said Gareth Barratt, president of the AAMD. “The AAMD Support Fund", "The next Biennial should be held in the year 2022, as the Artists’ Workshop at Brooklyn College, Queens, is currently on hiatus, and the institution has yet to set a date for a new event. The Biennial will also organize exhibitions, residencies, and other programming in collaboration with a board of trustees comprised of artists, scholars, and other arts leaders.\n\n\nThe Pérez Art Museum Miami (PAMM) has been awarded a $125,000 donation from the William and Flora Hewitt Foundation, the world’s largest philanthropic organization. The gift, which comes nearly a year after the museum received a $350,000 grant from the Hewitt Foundation in 2016, will establish a new program that will bring together artists and scholars to engage with historical and contemporary issues in the greater Miami region.“This year’s grant program recognizes the substantial achievements made by Pérez Art Museum Miami and its staff in their ongoing efforts to present an engaging exhibition program in order to support the museum’s mission,” said Joanne Littman, the foundation’s executive director. “The museum has made tremendous progress since it received the William and Flora Hewitt Foundation�", "The next Biennial should be held in 2021, and the first in 2022. The biennial will also include a musical production by the Canadian troupe, a traveling exhibition of works by Canadian artists, and a blog with a programming schedule similar to that of the biennial.\n\n\nThe English Academy in Paris has received a gift of more than five hundred works by artists from the United States. The collection includes work by artists such as Robert Irwin, William Kentridge, Mary Cassatt, and Peggy Guggenheim; a painting by John and Martin Clark; and a sculpture by Margaret Sanger. The gift was made by American artist and collector James Grantham in memory of his wife, Diane Grantham, who passed away in October 2019.James Grantham, who was a longtime collector of art from the United States, was inspired to acquire more works by American artists after he visited Paris in 2017. He discovered the city through his great-grandfather, who immigrated to the United States from England in 1889. Upon learning of the collection, James said: “I knew immediately this was an extraordinary collection and had no idea it was going to be this rich and this well-loved. I would have given anything for a better wife,", "The next Biennial should be launched soon to coincide with the presidential elections and be held during the months of October, November and December.\n\n\nThe Maritime Museum in Hong Kong (HKS) has received a significant donation of more than 1,500 paintings by the late artist Wong Koon-sung\u0097one of the creators behind the Wong Koon-sung Center for Contemporary Art, which has a permanent collection of more than 3,000 works\u0097from the estate of Jean-Marie Curie. The donation includes works from the collection of the late French painter Auguste Prouvé, the late Indian architect K.W. Birkett, and the late French writer and playwright Dreyfus Sardou.The artist’s son, Thomas Birkett, was chosen by his father for the role of director of the Center for Contemporary Art at the University of the Arts in Beijing and was given a mandate to create a new institution for the collection of the works of his father. He began by examining a list of twenty works by his father, a curator at the Museum of Modern Art in Paris, before choosing ten works by the late artist and collaborator Wong Koon-sung\u0097sometimes referred to as the “father of modern", "The next Biennial should include a discussion on art and technology and the intersection of conceptual and physical space.”\n\n\nIsrael announced on Wednesday that it plans to build a new border barrier along the 1967 borders with a plan that critics say will be an obstacle to peace talks with the Palestinians. While the barrier may sound like something out of a dystopian novel, it is actually part of a larger plan to enhance Israel’s security. The plan is one of several that have been drawn up by Israel and the United States to ensure the security of Israel’s borders since the 1967 Six-Day War. Israeli defense minister Moshe Yaalon said that the construction of the barrier would “protect Israel from terrorist attacks and from external threats.”Despite its apparent deterrent effect, the wall is actually slated to be completed sometime next year. It will sit atop an existing wall that was built in the Jordan Valley in order to deter illegal immigration and will consist of two levels, one for Palestinians and one for Israelis, which will be separated by at least two miles of open terrain. The barrier will be 6,000 feet tall and will be made of reinforced concrete and will be located in an area that is currently considered illegal under international law.Ahead of the construction", "The next Biennial should be held in November 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has launched a new initiative to support artists who are facing economic hardship as a result of the ongoing Covid-19 crisis. The Museum’s Artists’ Loaner Fund, launched in April, will award up to $1,000 to artists whose income is at risk after losing income from a single art-related business during the pandemic.The initiative was inspired by a personal experience: Christopher Atkins, a Los Angeles–based artist whose practice spans film and performance, sculpture, photography, and video games.After losing his own income from a single art-related business in April, Atkins sought out the Art Fund of the City of Los Angeles, which provides financial relief to artists in need across the city, to help him through a difficult time. The fund will lend $250 to $500 to artists facing financial hardships caused by Covid-19.“I’ve been involved in the arts for twenty years and have done a lot of different things,” said Atkins. “But when I’ve been through this, it’s been overwhelming. I’ve had to", "The next Biennial should be held in 2021. \n\n\nHoffmann-Tropsch, the German museum formerly known as the Krefeld, has announced that it will close its doors indefinitely. The institution, which has staged major exhibitions such as “Gesamtik zu Berlin” (1991) and “Autobiographie in Berlin” (1989), had been closed since October 26 following a power outage. In a statement, the museum said it was forced to postpone the events of October 14, which was the date of the events of September 11, and the museum’s exhibition program, “will not resume until the Krefeld remains open and the power supply is not interrupted.”In a letter sent to the Krefeld’s board of trustees on August 10, director Klaus-Peter Scheibner wrote: “At this difficult moment, with the power out for several days, when we were facing a possibility of a blackout for many of us, when our exhibition program was being suspended and our allocation of funds was at stake, I think it is clear that we must do everything we can to be able to resume our exhibition program. Unfortunately, it is clear that this will not be possible until", "The next Biennial should take place in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to open its new, 7,500-square-foot space in the Tenderloin in 2021. The new museum will join the Museum of Contemporary Art in New York, which opened in May 2019, and the Hirshhorn Museum and Sculpture Garden in Washington, DC, in the United States’s fourth year of a $5 billion expansion project, known as Project for the Future, or P4.“We’re a year away from opening, and this is a critical time for our team,” said architect Robert Frank, the architect of the new 7,500-square-foot home, which will surround the former Studio Museum in Harlem with a series of galleries, studios, and classrooms. “In the past two years we’ve invested in the design around [the museum], and now we’re ready to begin the next phase of building history.”  The opening of the new museum—created in partnership with the City of Los Angeles and the Los Angeles County Metropolitan Transportation Authority (LACMA)—will coincide with the reopening of the West Coast", "The next Biennial should take place in 2020. Jennie Toth, chair of the arts committee, said the festival should focus on “how the arts can help to develop and strengthen the public’s engagement with local, national and international artists, as well as foster a sense of community and understanding between London and the surrounding communities.”\n\n\nThe Centre Pompidou in Paris has appointed Jean-François Bourdin as its next director. Bourdin is the richest man in the city and will have the power to appoint the director of the arts through a charter granted by the city council in 2013. Bourdin’s current holdings include the building and management of the Stedelijk Museum in Amsterdam and a stake in the Museum of Modern Art in Paris. He has also owned stakes in several other Parisian institutions, including the Musée d’Art Moderne and the Musée des Beaux-Arts.“Bourdin is a man who has the vision and the ability to transform the world through the arts, and I believe that his appointment represents a new mission for the Centre Pompidou,” said Tarek Atoui, director of the Museum of Modern Art.", "The next Biennial should be held in 2020.\n\n\nSince the beginning of the year, the British Museum has been working toward revamping its entryway, the British Pavilion, with a new set of guidelines. The museum announced its plans to scrap the Pavilion’s current structure and replace it with a new structure, the British Library, that would be positioned at the center of an expansive campus.The museum’s current pavilion, a sculptural memorial for the world’s first atomic bomb exploded on April 5, 1945, has undergone several redesigns in the museum’s five-decade history. In 1977, the museum acquired the building and began transforming the pavilion, which is situated on the second floor of the museum, into a cultural and research center. The museum also added more than seventy galleries and classrooms, expanded the capacity of the pavilion by a further fifty feet, and refurbished the building’s exterior.In 1984, the museum commissioned Richard Summerfield to create a series of new works that would commemorate the pavilion’s fifty-fifth anniversary. The project was completed in 1988. The pavilion was renovated for the 1999 Guggenheim Biennale, and the museum opened for the public in", "The next Biennial should launch in 2020, with the third edition in 2021, and the last in 2022. The Biennial will be hosted at the São Paulo de Gama, Brazil, the Punta de Getúlio, and the Belo Horizonte, Brazil.\n\n\nThe sixteenth edition of the TIFF Expo Chicago is now live and will debut on May 19, 2020.The biennial, which is curated by John Solomon, will feature new works by forty-eight artists, including Ana Cisneros, Apichatpong Weerasur, Venezuelan artist María Berrío, and Italian artist Vittorio Castori, among others from Latin America and the Caribbean. Among the artists who are set to participate are Francisco Álvarez Hernández, Yianni Johnson, and Rineke Dijkstra. The full list of participating artists is as follows:MAI - Ajax, Netherlands: Open on April 27, 2019.Venezuelan artist who has lived and worked in the U.S. for the last twenty years: Opens on May 8, 2019.Kathryn Alexander, Chicago: Open on April 26, 2019.Cheryl", "The next Biennial should have been held in spring 2019, but was pushed back, and will be held in summer 2021.  This year’s event, “Away from the Bay: The Visual Art of the Philippine Pacific,” will be held at the San Lorenzo Museum in Manila.  The second exhibition, “Away from the Land: Life as a Landscape,” will be at the San Francisco Museum of Modern Art and the Manila Museum of Art. The exhibition will focus on the concept of ‘living space.’ Finally, the third, “Dangdai Ganchi: Modern Art from the Philippines,” will be at the San Fernando Museum of Art and the Basilan Museum of the Holy Trinity.\n\n\nThe San Diego Museum of Art (SDMoA) in California has commissioned David Salle’s Away from the Philippines to create a new work for the institution’s current exhibition “The Form of the Land,” which runs through December. Salle, who is based in the United States but based in the Philippines, who frequently performs in the United States, will create a new installation for the upcoming exhibition.“The concept", "The next Biennial should be held in 2021 and the two years after that. We are now in the process of preparing for the event and hope to have more to say about the future of our program in the coming months. We welcome your feedback and we look forward to welcoming you again.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Rosie DiManno as its new associate curator of contemporary art. DiManno most recently served as the curator of twentieth-century art at the Museum of Modern Art in New York between 2005 and 2010. She was promoted to curatorial assistant and was the founding artistic director of the New Art Institute (NIA), where she coordinated projects with the likes of Paul Gauguin, Robert Irwin, and David Salle, among others, and was a cofounder of the Burton-Wren Gallery in New York. DiManno will begin her new role on January 5, 2021.“The Met has long championed the creative and scholarly achievements of the DiMannos, and has nurtured and further developed their discursive and institutional knowledge,” said James Cuno, the Met’s executive director. “Rosie brings a unique perspective to our collection", "The next Biennial should be held in November 2020, to coincide with the reopening of the Biennial Centro de Cultura, Spain, in August 2021.  \n\n\nThe New Museum in New York has received a gift of twenty-four works from the dealer Aligarh Shah, a former director of the London and New York galleries who passed away on November 16. The works, which are housed in a glass-enclosed vault at the museum, include works by Kamala Ibrahim, Hermann Hesse, Fátidín Hooshmand, Charles Fiey, and Andreas Neubert, among others. Shah was the founder of the Museum of Modern Art, which he sold to the Borg Group, and became an independent curator in the 1980s. The auction house subsequently acquired Shah’s paintings, sculptures, photographs, and other works, which were exhibited in the beginning of the Borg’s Borg Prize, and in 2016, the prize was awarded to Bjorn Purcell for his work Photographs of London, 1940. “Aligarh Shah is to art what Robert Irwin was to architecture: an innovator, a pioneer", "The next Biennial should also draw from the artist’s work in order to produce a new kind of sculpture, he said. “The next Biennial should reflect the spirit of the city and the city’s history.”The Biennial of Modern Art will be held at the Museum of Modern Art in New York from October 28 to November 21.\n\n\nJapanese artist Masanori Hayakawa, whose ubiquitous geometric patterns and fluid shapes conjured images of a frozen landscape and a landscape without boundaries, has died at age seventy-three.Born in Niigata Prefecture, Japan, in 1931, Hayakawa learned his craft as a painter in 1960. He continued his art training at the Shizuoka Art Museum in Nagoya in the 1970s, but shifted to drawing in 1981, when he was twenty-four years old. His first major retrospective, “One-Hundred Years of Drawing” at the Tokyo Museum of Art in 1986, was shortlisted for the Prix d’Art Contemporain in Paris, but was not presented. He had been invited to participate in the upcoming exhibition of work by the same group, but chose to withdraw from the event after he was asked to paint a scene", "The next Biennial should be held at the Uffizi Gallery in Florence, Italy, in March 2021, and the following year at the Museo d’Arte Contemporáneo in Beijing, China.  Bicycle Salon, where the show will focus on photography, is currently closed. The show will resume in early 2021.\n\n\nThe Detroit Institute of Arts (DIA) in Michigan announced today that the institution is seeking a new president. The board of trustees has made the decision after a review of the current five-year contract, which runs through December 2022, and concluded it would be “inclusive and transformative for the DIA’s future.”The announcement follows a year of organizing and an expansion of the museum, which will welcome visitors from January 30, 2021 to March 20, 2021. The museum’s newest addition, the Detroit Institute of Arts (DIA) 4, is currently undergoing construction and will open in 2021. It will also introduce new programs and public art, and will host public events and screenings.“The board of trustees has made the DIA’s future as inclusive and transformative for our community and our community’s future as an institution as a cornerstone", "The next Biennial should take place in late 2022. The deadline for the event was set by the Israeli government, which had backed a deal with the Palestinians in which Israel would relinquish West Bank land and move its planned exhibition there. ArtCenter, which has supported the West Bank arts since 2012, said that it had received nearly $6 million from the Israeli Ministry of Culture since the announcement of the new partnership. “I am delighted to congratulate the Ministry of Culture on its decision to support the special exhibition ‘Between the Sun and the Moon’ in its upcoming exhibition season in November, and to be able to present it in November alongside the theme ‘The loss of legacies.’”The Israeli government’s approval of the “Decision to the Arabs’,” a 2019 exhibition that invited fifty Israeli artists to the West Bank, has been a source of tension for the Ministry of Culture since it was announced. The exhibition, organized by the Kunsthalle Schönefeld in Kassel, drew criticism for its themes of memory and the fate of historical memory, as well as for its inclusion of artworks that were not approved of by the government. Schönefeld was", "The next Biennial should be held in January 2021.\n\n\nThe National Museum of Fine Arts in Washington, DC, has welcomed two new members to its board of trustees: former Microsoft CEO Steve Ballmer and the late collector James Mann. Ballmer and Mann were the first two members to board since the museum’s founding in 1875. Previously, the two have served on the board of trustees since 2000. Ballmer currently serves as chair of the museum’s research and education committee, which oversees the museum’s collection and exhibitions. Mann can be found in his home state of Washington, DC, which has been an official home for modern art since 1906.“The National Museum of Fine Arts (NMA) is a nationally recognized institution and one of the most prestigious in the world,” said National Geographic CEO Michael Collins. “We are honored to welcome one of the greatest collectors of modern art, Steve Ballmer. His extensive and influential career spans more than seventy years and demonstrates his deep understanding of the museum’s collection and exhibitions. We feel it is critically important that Ballmer chair the museum’s board of trustees as the board is responsible for the museum’s continued development as one of the", "The next Biennial should be held at the Museum in Oslo in May 2021. The next edition will consist of fourteen exhibitions. Previously, the exhibition was held at the Museum Ramshill in Malmo in October 2021. The Biennial of Australia’s most internationally-known non-southern cultural figures will be held at the National Museum of the Australia’s exhibition hall in Canberra in March 2022. The museum will also stage a new free-to-enter exhibition “The Unseen: Events in Time” at the National Gallery of Australia in Canberra in April 2022. The exhibition will focus on the evolution of cinema through the art of photography.\n\n\nThe Cleveland Museum of Art (CMA) has received a gift of more than fifty works from the Chicago-based artist Rina Banerjee. The artist, who has lived and worked in New York City since 1996, was gifted the works by David Adjay, Evonne Gould, and Ted McAllister, among others, at an auction held on Saturday.The works, which were exhibited in a sketch-composer’s show at the CMA in April 2016, were donated by the artist’s longtime associate and friend Mary Anne McAll", "The next Biennial should allow the public to view a work by a filmmaker, artist, or musician from the country of their choice. For those working on film, the first exhibition will feature work by Yuki Kondo (Hiroshima) and will open on February 26. \n\n\nThe Russian government is considering adjusting the country’s retirement age for young people, in an effort to stem the country’s worsening economic crisis. According to the Interfax news agency, the government is currently studying a plan that would see the retirement age raised by two years.The article notes that the government’s official plan, which still leaves the country with one of the longest working lives in the world, would see the age rise by two years from December 2021 to March 2022. The National Centre for the Physical Health of the Population, which is managed by the State Duma, is currently drafting a new bill for the National Assembly that would address the health issue.According to Russia’s Federal Center for Disease Control and Prevention (CCDP), the rate of death in the country is almost five times that of the OECD and the United States combined. The agency expects the death toll to surpass one million by the end of the year.While the government", "The next Biennial should aim to introduce an active, experiential and curated interpretation of the history of the artist’s seminal works, and should include works on the repression of revolutionary art and radical aesthetic ideas, and the struggle of artists internationally. It should, moreover, be a hybrid of historical and contemporary, reflecting the traditions and the diversity of the various continents and regions.”This decade’s event will also feature a retrospective of work by artist Karla Margolies, an American who was one of the main organizers of the second Biennial in Bali, in 1987, and will look at the work of contemporary artists, including John Barozzi, David Barozzi, David K. Martin, and Arsht, the Italian creator of the artworks Travita and Rarefuge (the latter of which landed in the collections of the Sittmer Museum in Berlin and the Villa Altice in Venice).\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has announced that it is instituting new social distancing guidelines for its annual Fourteenth Street Festival, which celebrates the Los Angeles–based contemporary art and design scene and features work by some fifty artists in Los Angeles and Orange Counties. The changes were", "The next Biennial should be held in 2020. “The first biennial was held in the city of Montreuil in 1891, and the first was held in the city of Toulouse in 1893,” a spokesman for the exhibition told the Art Newspaper.  The biennial, titled “Du Monde,” was a satirical look into the lives of the Parisian aristocracy. The next iteration of the exhibition will take place at the Venetian in Milan in 2020.\n\n\nThe following artists have been appointed as the 2020 laureates of the Venice Architecture Biennial: Emre Pfeifer, Tel Aviv University; Mihai Kubena, the Hungarian Architecture Museum; Stefan Lüders, the German Institute for Design, Design and Architecture; Željko Narko, the Polish National Museum, Museum Pobeda; Oskar Eustis, the American Contemporary Arts Museum; and Adam Kuk, the British Museum.The biennial awards approximately $4 million in cash, including $250,000 to the winners of the design and architecture categories, along with a total of $3 million in prizes. The prize money is divided among participating artists, with first prize winner Michael", "The next Biennial should pick up in May 2020 and will be organized as an open-concept exhibition, with up-to-date information about the future of the exhibition.\n\n\nA new national identification card for the International Transport Museum (ITM) in London, titled the I-Travel Card, will launch in July. The biennial, which will celebrate its thirtieth anniversary, will be free for everyone. The exhibition will be centered around a story of a young boy and his journey from the small town of Dungeness to the Museum of Flight, where he learned to fly the famous Wingdings, a winged, wood-paneled glider, in the 1930s. The I-Travel Card will also include a bonus disc that will include a selection from the museum’s collection, including pieces on aviation and travel, art and travel, and architecture and travel.“The I-Travel Card will enable museums and galleries to better meet the needs of the increasingly urbanized and mobile, and will play a key role in connecting with audiences and communities on a global scale,” said Michael Gove, the deputy director of arts at the I-Travel Card. “The I-Travel Card will be the ticket to a", "The next Biennial should be selected by the end of the year. \n\nThe institute is currently working on a new platform for its Biennial, which aims to provide a unique opportunity to experience the works and to exchange ideas with the participants. It is also planning to launch an online platform for the exhibition. \n\n\nThe Museum of Modern Art (MoMA) in New York has ended its relationship with the controversial Israeli human rights organization Bnei Barda; the organization’s director, Shlomi Teitelbaum, issued a statement saying that the boycott was not working and that the partnership was terminated in an effort to reach an agreement that would “protect the museum’s relationship with the state of Israel.”According to Artnet, a source close to MoMA said that the decision to end the partnership was made “independently of a boycott” that was initiated by a group of artists and cultural workers from the West Bank. The organization’s board of directors voted 3–1 in favor of terminating the deal on Wednesday, and Meir Kahane, the institution’s former director of education and public engagement, expressed his sympathies for the decision on the group’s behalf. �", "The next Biennial should focus on 'the most urgent contemporary challenges, including radical ecology and the current climate crisis, and how they impact art, culture, and society, and should include an ambitious and original exhibition strategy. ‘Themes of sustainability should also suggest new solutions for living together, for the environment, and for the world.”\n\n\nThe Kunsthalle Basel has announced that the inaugural edition of its Art in Action series, which began in 2017 to aim to introduce artworks by artists and organizations into Swiss public spaces, will return to the city of Basel in 2020. The fourth iteration of Art in Action, which was staged in cooperation with the Swiss Federal Office for Culture and Culture, Montblanc, will be held in 2022.The event’s artistic director, Charlotte Eickhahn, said: “The event series is an important contribution to the broader mission of the Basel Art Museum and the best way to meet the needs of a public that is hungry for contemporary art from around the world. We are pleased that the events of 2018 will continue to provide an opportunity for the public to connect with the art of their choice.”This year’s edition, “Art in Action: Reflections in", "The next Biennial should include a new collection of works on the instalments of the Masters’s works and a commentary on the epoch in its history. The museum will also be forced to confront the legacy of the exhibition’s founder, German anthropologist Erich Frommann, a naturalist who influenced the formation of the Biennial.When asked about whether he would prefer to see the museum reopen, Frommann replied: “I cannot imagine a better time to cooperate with the city and the state of Berlin than now. The government has been discussing a plan for a long time to cooperate with the city of Berlin and the city of Milan. We have agreed that this is an issue we can agree upon and to which we can implement the necessary measures.”\n\n\nThe São Paulo Bienal in Brazil has announced that the first exhibition devoted to the art of Brazilian Portuguese American art will be held in the city in October 2020. Titled “Brazil’s Past: Pastoral Dreams” and hosted by the Curia da Cultura de Artes Plásticas (CCA), the exhibition will be organized as follows:“In the lead-up to the upcoming exhibition ‘Brazil’s Past:", "The next Biennial should be held in 2020. “The present state of the museum, is simply not sustainable,” Martini told LA Weekly last month. “The exhibition hall, which is in a state of breakdown, is a terrible  situation.” The museum will also struggle to cope with the expected surge in Covid-19 cases. According to the New York Times, the number of Americans afflicted by the virus increased by tenfold from January to March—more than twelve thousand people have been infected so far this year.“How do you protect millions of people? How do you care for millions of people? How?” said museum director Nicholas Ray. “I don’t think we recognize that we are probably in a period of transition.”\n\n\nFollowing the Metropolitan Museum of Art’s announcement that it will shutter its public art museum and move its collections into storage facilities as it attempts to contain the coronavirus, the Museum of Modern Art (MoMA) in New York canceled an upcoming exhibition featuring works by leading artists from the late 1940s to the early 1960s. The event, “Painting in the Dark: From the Archives,” was set to mark", "The next Biennial should be held at least ten years after the point of the first festival, and should take place in the city of Osaka. The museum’s curator of contemporary art, Tsutomu Takahashi, told the Art Newspaper that he hopes the new event will be able to continue its legacy of cultivating and informing a new generation of music lovers, and that the event will establish the 'new chapter of our history.” In other words, more music lovers and an even more diverse range of audiences will be able to enjoy live music. The Biennial was also given a $1 million prize for the first time in its history. The $45 million prize was given to Tokyo’s MOSA, which was founded by the former director of the Shinchoji Museum, Toshi Masuda. The Shinchoji Museum is currently rebuilding its building in the Shinchoji district of Tokyo.The new prize for the Shinchoji Museum was established by a group of local civic groups led by Hiroshi Hasegawa, the former chairman of MCSHI, and Yoshinobu Yamashiro, and was organized by the Shinchoji Cultural Association. The winner will be announced in September.\n\n\n", "The next Biennial should be held in the coming years, the organizers said. \n\n\nMore than 1,600 art workers, including artists, designers, and musicians, have signed an open letter supporting a Palestinian project to build a wall along the Israeli-Egyptian border in an attempt to stop the construction of a Jewish state in the territories and are urging the Israeli government to respect their wishes.The letter, which was written by academics, artists, and human rights activists, as well as by two dozen Palestinian artists, was addressed to Prime Minister Benjamin Netanyahu and Defense Minister Moshe Ya'alon. “We, the co-signers of this letter, feel that the wall is a hindrance to peace and a barrier to the establishment of an independent Palestinian state,” the letter reads. “Building a wall along our border is a clear signal of our rejection of any form of cooperation with any state hostile to Israel. We call on Israel to respect our wishes and respect the Palestinian national aspirations of forming an independent state alongside our borders.”The letter is addressed to President Reuven Rivlin, Minister of Foreign Affairs, Ronan Cohen, and Attorney General Avichai Mandelblit, and is dated February", "The next Biennial should not preview the exhibition “We Must: Art and the Politics of Bodies.” Instead, it should focus on the ongoing struggle for feminist and antiracist politics; on the urgent need to build political will to resist racist violence in the United States; and on the necessity of the United States to actively participate in international struggles against racism and fascism.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has named Barbara Gordon as the next director. Gordon comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as interim director for the past two years and most recently served as deputy director of the Los Angeles branch of the Black Arts and Cultural Center (LACMA).“Barbara brings with her decades of leadership experience and a proven track record of success in the field of contemporary art,” said board president Hernán Dario. “LACMA is indebted to her for inspiring the LACMA Black Arts & Cultural Center to become an institution of the Arts in the City of L.A., and she has been instrumental in strengthening our relationships with historically underrecognized artists, artists communities, and the wider Los Angeles community.”Gordon previously", "The next Biennial should be held in 2022. The publication of the manifesto followed a dispute over the exhibition “Rebuilding Art,” which was originally scheduled for this March, and was withdrawn in May. The Biennials (2015–2019) is a new initiative that aims to promote a “radical new artistic vision of the Museum,” according to the journal Artforum. It will be presented at the Museum of Modern Art in New York in March 2020, and has been represented at the museum since 1991. \n\nA new survey of museum workers in the United Kingdom has found that 82 percent of Tate employees are dissatisfied with their work conditions, and that more than one-third face racial discrimination. The study by the British Museum’s Institute for Employment Relations (BMI) and the National Union of Journalists (NUJ) was commissioned by the Tate in an attempt to address the mounting pressure from staff to improve working conditions at Tate museums.According to the study, commissioned by the BMI and the NUJ and published by the BMI, eight out of ten workers at Tate institutions are dissatisfied with their current working arrangements. Ninety percent believe that new management is not doing enough to address staff’ concerns,", "The next Biennial should embrace the history of the biennial and its importance to the city, and should strive to make it accessible to all. It should also take into account the cultural and social needs of the city and the region and make it a platform for the work of lesser known artists and organizations. I am asking for your help in this very important work and hope that you will join me in this challenge.I am also inviting all members of the city’s art community—artists, curators, artists’ families, and activists—to engage with the biennial in any way that you can. We need you to listen, to help us understand, and to help us create. We need you to take part in the dialogue and in the process. We need you to be part of the city’s future.”The Biennial will take place in the city’s historic Garrick Building on the corner of Broad and Victoria Streets from January 12 to January 15. The museum also said it will present a selection of works by visiting artists, including a selection of works by Robert Irwin, a legendary United States artist who is best known for creating works that were meant to be seen; a selection of works by local artists", "The next Biennial should be held in September 2021. Los Angeles is currently negotiating with the City of Los Angeles to hold a new edition of the Biennial in 2021. The City will determine the date and location of the event through a consultation process that will take at least one year, according to the Los Angeles Times.  The 2019 edition, entitled Art + Life, was held at the Santa Monica Pier. The 2019 Art + Life’s 25th anniversary included a special exhibition of works by thirty-two artists. The show was organized as part of the Los Angeles Arts and Cultures Fund (LAACF), a $200 million initiative that aims to advance the cultural and artistic development of Southern California. LAACF also supported the works of thirty-six artists who were shortlisted for the 2019 prize, which were selected from a pool of eleven artists. Los Angeles’s plan to hold a new edition of the Biennial is not unique. Other cities, including New York, San Francisco, and Seattle, have also explored the idea of holding events to coincide with the winter solstice. In an attempt to avoid overcrowding, the 2020 iteration of the festival will be held in the city’s Pacific Palisades", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in New York is preparing to reopen on September 25 following a $5 million facelift designed by France-based firm Primer. The renovation of the museum, which was completed in 2016, consists of a series of alterations to the building’s interior, including the installation of the museum’s first public sculpture garden, the Piazza della Scala, which is located on the second floor of the museum.The Piazza della Scala, which was commissioned by Italian architect Dario Catellani, comprises a series of terraces and garden spots with a total area of more than 130,000 square feet. Known as the Garden of Babylon, the urban garden has been recreated in part by adding new sculptures by artists such as Marcel Prouvé and Peter Sellars, as well as by adding terraces and a garden at the adjacent Metropolitan Museum of Art, which has a total area of more than 150,000.The Piazza della Scala’s garden was inspired by the biblical Garden of Eden. “We wanted to incorporate the Garden of Eden into the city of Rome,” explained Alexandra Cozzi", "The next Biennial should be held in 2022. For a guide to the upcoming edition, visit the MCA’s website.\n\n\nThe Noguchi Museum in New York has released a statement regarding the release of an exhibition of works by women artists that was scheduled to open on September 8. The exhibition, “Women in Painting” will be on view until November 27. The first show, titled “Léger dans l'Art Contemporaine: Étienne-Marie-Louise Noguchi,” will feature paintings by thirty-nine artists, including Adriana Varejão, Maicon, and Naeem Akram.Following a public outcry, the museum agreed to reschedule the exhibition and added that it expects the show to reopen in November. “I’ve been working with a few artists, and they all had a great story to tell,” Noguchi said. “We have a responsibility as curators to tell those stories.”\n\n\nThe Fine Arts Museums of America (FAMA) is launching a new online platform dedicated to artists. Called Artnet, the platform will host more than one hundred artists each month. The platform will", "The next Biennial should focus on the history of art in the Americas, with an emphasis on the artworks in the Americas as well as in Europe and Asia. The artistic landscape in the Americas has been altered and redefined by immigrants, and contemporary art has never been more relevant or available.”The first edition of the Biennial was held in Harbin, China, in 2001. The exhibition was organized by the Julia and Niccolo Pacetti Center for Contemporary Art and the Boston Cultural Center, and was organized in collaboration with the Corcoran Museum of Art in New York. The exhibition featured work by twenty-three artists, including Hal Foster, Lynn-Manuel Miranda, and Laura Owens, and was curated by David Kilgore.\n\n\nThe Metropolitan Museum of Art in New York has appointed John Baldock as its next director. Baldock will assume his post on January 6, 2021. He succeeds Daniel H. Weiss, who departed the museum in January 2018 to become the director of the Museum of Modern Art in New York.“Following the passing of a major exhibition of work by a diverse group of American artists, Daniel H. Weiss and I are honored to be working together again to shape and develop the Metropolitan Museum’s", "The next Biennial should be in the spring of 2021. \n〜The first Biennial was held in April 2019. We are pleased to announce that it will be held in March 2021. It is a great honour to host the tenth edition of the Biennale in March.”Katsuya Takahashi, chair of the board of trustees of the Museum of Modern Art, New York, said: The architecture of the exhibition space is crucial for the health and well-being of the museum, which is why we've worked tirelessly to create the most conducive environment for visitors to enjoy the exhibition.The biennial will be divided into three sections: Awards. Baskets. And the Biennale. The biennial will celebrate the work of the twenty-three artists whose works are presented in the exhibition; the program of the exhibitions will comprise three years of programming, culminating in the theme “A Year of New Creativity.”Organizers have said that the main aim of the exhibition is to “encourage the practice of special artworks in a way that is accessible to everyone” and that the exhibition will not only allow the public to see the work of the artists, but will also �", "The next Biennial should take place in 2021, and the event will be hosted at the University of Exeter from March 21 to March 23. \n\nThe 2019 British pavilion at the Venice Biennale was canceled last month after a British artist, Nusseibeh Darwa, was detained by British police for throwing a set of burning embers toward the pavilion during a protest over the filming of a controversial UK drone strike on a Turkish military compound. The incident took place on May 30, an English day, which is considered a day of rest in Islam. The British artist was taken to a police station for questioning, but he was not charged.Darwa was charged with one count of criminal damage, but his conviction was thrown out following a retrial after a jury found that he had been unlawfully arrested and had his rights violated. His lawyers had claimed that the questioning of the artist had been coerced. In his retrial, the artist was found guilty of seven charges, but only one of the counts was ultimately proved.The case has sparked outrage across the UK and beyond; British prime minister Boris Johnson called the event cancelled because of the protest an attack on freedom of the press. The case has also led to negotiations between the British government,", "The next Biennial should be hosted in the summer of 2021. “We are deeply grateful for the support of our sponsors and colleagues, and especially for the unprecedented support of the specialists of the Art Museum Zurich, who have all contributed to the vision and execution of the renovation and expansion of the institution,” said Markus Schlösset, who was appointed director of the contemporary art museum in May 2019 and who guided the renovation project for several years until his retirement in March 2020.Schlösset added: “I am thrilled to be working with my former colleagues and clients in the Art Museum, and especially with the experts from the contemporary art scene in Zurich. Their expertise and dedication has been crucial to the development of our contemporary art collection, and I look forward to demonstrating their influence and expertise in the exhibition program, public programming, and special exhibitions that will be presented at the new biennial.”The venue for the inaugural biennial was renovated in 2017 by a team of curators led by Tobias Lang, Markus Schlösset, and Naima J. Keith, and comprised the museum’s collection galleries, the collection rooms, the auditoriums, and the permanent collection, which is currently undergoing a major expansion project"]