["The next Biennial should take place in 2020.\n\n\nThe City of Athens​ announced today that it will award €120,000 to ten artists whose works were selected for the 2019 exhibition “Art and the New Republic” as part of the city’s unique celebration of Soviet art. The twenty-six works featured in the exhibition will be presented at a new venue, Art and the New Republic, in the city of Samopity, for the first time in 2020.The biennial will be a contemporary reinterpretation of the Soviet Union’s monumental exhibition “Abram Spezny: The Modern Life of Tomorrow” (1948–1949). The exhibition, which opened at the Museum of Modern Art in New York in 1948 and moved to the State Museum of History in Moscow in 1949, became a landmark artifact of the region’s development, and is celebrated as the founding work of the city of Samopity. The exhibition was curated by Lina Akit, Selena Laskar, and Anna Laudis, and featured works by forty-three artists, including Alexander Calder, Pavel Makhachev, and Vladimir Konstantinov, among others from the former Soviet Union.Inaugur", "The next Biennial should focus on the history of the cooperative as a space for cross-cultural dialogue and interdependence, with particular reference to the history of distribution, exchange, and educational exchange in the Netherlands. Next year will be about collaborations between artists and museums, and the first game in the series will be a free biennial event.\n\n\nThe Beinecke Rare Book and Manuscript Library (BRMA) in Berlin has appointed Christian Gil as its new director. He will take up the post on January 17.Gil comes to the institution from the Palazzo delle Papesqua in the northern Italian city of Genoa, where he works as a curator and historian. He previously served as director of the Palazzo di Rivoli in Milan and as director of the Montefiore Collection in Rome, and was a member of the collection team that organized the first exhibition of Italian art in the United States, “The Italian Experience: Long Island in the Sky,” in 2007.“We are delighted to welcome Christian to BRMA,” said board president Joachim Bechtold. “He is a man of great integrity, whose extensive experience in international exhibition and scholarship makes him ideally qualified for this critical role", "The next Biennial should also consider taking place in a rural setting, focusing on economic and social justice issues, according to the organizers. “The exhibition ‘Between the Sun and the Moon’ will be situated in a village in the Inland Sea in the island of Guam,” the exhibition’s website reads. “The exhibition will focus on the interconnectedness of life processes, exploring the interconnectivities among life processes. The exhibition will reflect upon the interconnectedness of the universe, and will emphasize the relationships of life, the environment, and the environment’s relationship to the universe.”After the exhibition opens, teachers and students from over seventy schools throughout Guam will be given a day to spend with the show. The biennial will also feature a number of presentations and performances, including a presentation of work by women artists, including a performance by Gia Alonzo (Tacita) Merz (Puerto Rico), an exhibition of works by artists from the Philippines, Indonesia, and Vietnam, and a screening of the first two seasons of the acclaimed television show Lost.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has received a gift of more than 1,600 works by African", "The next Biennial should take place at the Allenby in London in 2022 and will be hosted by the National Museum of Art in Washington, DC.“While the artist-built environments of the past have influenced the very conception of the museum and its discursive political economy, the museum’s contemporary project will be about figuring out how art can be made to affect the world we live in,” said Curator Philip Sheridan, who curated Biennial I. The theme of the second edition of the exhibition is “Equality,” highlighting the work of artists who have challenged the UK’s current system of representation and the way that art is consumed in the United States. The main curators of this iteration are Rebecca Blackwell, BOB BAKER, TL BERMAN, Tanya BURKE, Alex CHEKOV, Lisa CASSON, Lorna CASTELANO, ZinaELLE, Ti-JIN CASTELANO, and ZinaELLE; the shortlisted artists are ALICE COX, JOANNE HILTON, GEOFF KINDER, SARA LESLIE, and ERIN LEMIRE.\n\n\nThe Kunsthalle Bas", "The next Biennial should be held in 2020, though the exact date has yet to be decided.\n\n\nBritish Museum director Maria Balshaw has been appointed director of the National Galleries of Scotland. She succeeds Richard Brodsky, who retired in March 2019 after a decade at the helm of the institution.“After a thorough search, the board of trustees announced that I am the director of the National Galleries of Scotland,” Balshaw said in a statement. “I am delighted that the National Galleries of Scotland is now at a point in its future when I will have the opportunity to have a significant role in its future development.”Balshaw will take up the post on August 1. \n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Polina Mirovska as its next director, effective immediately. Mirovska will be responsible for the care and management of the museum’s collections and permanent collections, as well as for the development and implementation of educational initiatives and partnerships. She succeeds Loring Randolph, who retired in March 2022 after eleven years at the helm of the institution.“Polina’s leadership is exceptional, her vision for the future of", "The next Biennial should be held in March 2020, and a new exhibition of contemporary art will open at the gallery in March 2021. The seventy-six-year-old museum will continue to operate under the new management until the opening of the new exhibition of contemporary art.  Commenting on the biennial, Peter Warhol said: “I am delighted to welcome the new team of trustees to the Biennale. The exhibition, ‘Conceptuals,’ is a seminal text for any serious scholar of art; and the new Designers’ Collective will add a new dimension to this.”The biennial will also include a new book, “Wangechi Mutu: The Black Years” (2019), and a “LIFE ALONE” (2019) exhibition, “Memory Palace” (2019), as well as an online tour of the venue. The exhibition, which will be followed by the biennial’s first public performance, will also feature the work of artists such as Nari Ward, Kim Gordon, and Laurence Büttner.\n\n\nAn investigation into suspected fraud at the Venice Architecture Biennale has concluded with a report that found that over half of", "The next Biennial should take place in 2022 and will be hosted by the Museo de Arte Contemporáneo in Madrid. The exhibition will be based on a larger project, which was started in 2016 to reconstruct the European leg of the World War II’s southern bloc, the EEC—Italy’s second-largest state (after the UK). The project was meant to run until 2022 and was completed in January of 2019.During the renovation, the exhibition will also feature new work by forty-eight artists, and will be inaugurated by a selection of works by the artist Leandro Pascual from the exhibition “NADA” (2019). The project was also inspired by the excavation of a new site for the exhibition in the city of Bologna, the former home of the Mandelli Archive, in 2008. The venue will be inaugurated with a performance by the artist and singer Laura Marro, and will be inaugurated with an exhibition of works by the artist Derek Johnson.“The Biennial shows how we can work with the art of our time to confront the contemporary world,” said Tittelmann. “It is a lasting reminder that the world is full of possibilities and", "The next Biennial should focus on social justice and how it intersects with art, architecture, and design. It should also explore the conceptual and physical limits of what can be imagined, conceived, and constructed, and how art and design practices may shape our very selves. The theme of the next iteration of the Biennial is “Love and Tragedy.”\n\n\nThe Shapeway Foundation, which is based in New York, and the Museum of Modern Art (MoMA) in New York have teamed up to develop the first collaborative digital platform for the works of Chinese artist Ai Weiwei, a collaboration that is being led by the Museum of Modern Art in collaboration with the Institute for Chinese Art and the Chinese Academy of Fine Arts in Beijing. The platform will allow curators, scholars, and other cultural producers in China and the US to share Ai Weiwei’s works across platforms.“Ai Weiwei’s work has been a source of inspiration and inspiration for years now,” said curator and artist Sarah Loyer. “When we first started working on this project, we had no idea how important it would become and how much we would need the support of China’s government, and we’ve used", "The next Biennial should focus on conversations that are not related to the exhibition, but can be useful for the audience’s understanding of the exhibition: whether it is the work of an artist who frequently appears in installations, or the story of the role of photography in the 1960s and 70s.”Mihai Nistor, president of the Biennale of Sydney, said: “We are continually rewriting our programmes and our exhibition format around the history of photography and around how photography can shape and challenge our lives. We will continue to experiment with new topics and new spaces, as we continue to present works that examine the history of the medium, and the history of photography in New South Wales.”\n\n\nThe Museums Association (MA), the professional body representing the more than 2,500 museums in England and Wales, has announced a new initiative that will give curators and arts professionals access to an online database of more than 6,000 works by artists. The arts database will be based in collaboration with the Royal Free and will be accessible by anyone, anywhere, on the internet.“This is a transformative time for our art world and we are eager to see how it impacts on the field and the volunteer staff,” said", "The next Biennial should take place in 2024. If all goes according to plan, the museum will be completed by 2022. The new pavilion, which will be connected to the museum by a ribbon of blue and orange, will be inaugurated by a new work by French artist Marc Chagall, “La Marseille Universelle: Les Dames de l'Amiti,” in a ceremony at the museum on April 25. The Biennial will culminate with “Year of the Dragon”, a public art installation that will feature forty-two watercolor drawings by the Japanese artist Tadao Ando, which will be on view in the gallery from January 27 to January 31.This year’s edition is being organized by the Shanghai Art Museum, the Shanghai Contemporary Art Museum, the Shanghai Fine Arts Museum, and the Center for Contemporary Art Shanghai, and will run from January 28 to January 31. The 2020 edition, which delved into the life and work of Chinese artist Sun Yat-Sen, was staged at the Beijing Gallery of Fine Arts (BCFA), where China’s first art fair, the Beijing Art Fair, took place last week.\n\n\n\n\n\nDavid C. Driskell,", "The next Biennial should take place in the same place as the current exhibition; will organize and present the exhibition of the work that is currently on display.\n\n\nThe Swiss chapter of the British art fairs Frieze has released the results of a survey of more than one hundred works by thirty-seven artists, including American Artists, Artistic, Contemporary, Contemporary Contemporary Chinese, Contemporary Japanese, Contemporary Korean, Contemporary Chinese, Contemporary, Contemporary, Contemporary, Contemporary Chinese, Contemporary, Contemporary, Contemporary Japanese, Contemporary, Asian, Asian, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Japanese, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Modern, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary, Contemporary,", "The next Biennial should take place in the coming years, said the organization: “It is essential to the Biennale that the project of the exhibition of the artist biennial be revitalized.”The exhibition of artists in the new Biennale will be inaugurated by a retrospective of the Los Angeles–based independent artist Graydon Carter. The exhibition will then be followed by a project by American artist Paula Meehan, entitled “The Path of the Star,” which will feature artworks by fifteen American artists.The exhibition of Meehan’s work, titled “The Star,” will also be followed by a show dedicated to the artist’s work, entitled “The Painter,” presented by the Los Angeles County Museum of Art, and will include work by thirty-three artists. The exhibition of Meehan’s work will be followed by a show of works by the artist Adrian Piper, the first American to win the Prix de l'Oréal du monde, and will run until November 25.\n\n\nThe Metropolitan Museum of Art in New York has appointed Christopher Wool, president and CEO of the New York–based Modern Art Museum (MoMA), as its next", "The next Biennial should be held in the summer of 2022. The biennial will focus on the participatory and the research aspects of the exhibition, which is currently held in the National Museum of Art in Athens. The exhibition is also supported by the Michigan Foundation for the Arts and the Ford Foundation. The new platform will be led by the arts historian and curator Viktor Bontchev, the director of the Helsinki Art Museum, Finland; the curator of contemporary art Art, Sara Cwynar, the inaugural curators of the Venice Biennale; and artist and curator Emma Deniz, chair of the Arts Council of the Arts Council.\n\n\nThe Museum of Fine Arts (MFA) in New York announced today that it is launching a new grant program, which will focus on supporting the careers of under-recognized artists and will provide $2,000 grants to individuals who have demonstrated exceptional artistic talent.The program will begin with a $500 cash grant for an artist and will phase out over the course of four years with the possibility of extending the program. The first grants will be awarded in the spring of 2020 and will be for artists whose work is currently on display in the museum’s current exhibition, “", "The next Biennial should be held in the autumn of 2020.  The first exhibition, “V.I.N.S. (The Invisibility Nude),” was organized by the National Museum of Contemporary Art in Beijing and showcased works by seventeen Chinese artists, including Alicja Neumeier, Xu Haiyong, and Zhongliang Yu. The exhibition also included the work of twenty-seven artists of African descent, including Albin Hidaka, Olu Oguibe, and Omar Omar. The forthcoming exhibition “The Third Period in China” was curated by Li Haiyong, the director of the National Museum of Contemporary Art in Beijing, and will be presented in the fall of 2020. The exhibition will feature work by thirty-one artists who have lived or worked in China since the late 1970s, including Zhang Yaxuan, Cao Ruijin, and Wang Xiaojie. \n\n\nAfter a New York Times investigation into why some of the protesters who marched through Times Square in February were never charged with a crime and instead were merely cited for disorderly conduct, a grand jury in Manhattan declared this month that its indictment of several hundred people in New", "The next Biennial should take place in 2020, the organizers wrote on Twitter. \n\n\nThe J. Paul Getty Trust in Los Angeles, the Museum of Modern Art (MoMA), and the Getty Museum in New York announced today that they have reached an agreement on the sale of an additional 6,000 photos by Paul Gauguin\u0097a major influence on the construction of the American landscape\u0097to private collectors. The organization behind the sale, the private equity firm the Guggenheim Partners, received $6.5 million from MoMA’s sale of works by the French surrealist Joseph Beuys, while the Getty has received $3.1 million.The auction included works by Beuys, Caro de la Barra, Polidori, and Miro, among others. Its final table of sixteen artists featured works by the quintet together, with the last one being the work \"Avant Garde,\" a large, fluted collage that combines a sculpture of geometric shapes. The work is considered a precursor of the work of Paul Gauguin, as Huey Mulligan, the founder of the Guggenheim, was the major client of the artist’s estate.The estate also sold the", "The next Biennial should focus on 'the future of art and the economy in a post-capitalist world, with a particular focus on technology and finance and the creative and commercial sphere,” said Dario Catellani, director of the Museo de Artes Centro de Artes Reales in Rome. “The future of art and the economy and the future of humanity are interrelated, and the biennial’s theme of art as a social medium, not just as art, is very relevant.”\n\n\nThe Italian artist and architect Cécile Bochereau, whose work explored and transformed Western architecture, has died at the age of eighty-eight. She was a pioneer who transformed the way architects think about and design, transforming the concept of the building into an abstracted landscape. Bochereau’s public art projects, which range from the hyperbolic to the comical, were groundbreaking and often included exaggerations of the body and sex and sexual imagery.“In the early 1950s, Cécile and Jean-Michel Neuer created the transposition of the body into the form of a building, a radical departure from American and other minimalist forms,” poet", "The next Biennial should be held at the National Gallery of Art in Washington, DC, in the fall of 2021. The first iteration of the event, entitled “Away from the History,” will take place at the Garden Museum in Long Island City, New York, in the spring of 2022. The exhibition will be supported with a new public art campaign\u0097the show will feature works by twenty-one contemporary artists, including Jacky Mansour, Rossini, and Popp, as well as artworks by former winners of the Prix d’Art et d’Art, including Gerald Ray, Joan Miró, and Eileen Quinlan.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is extending the curators on its staff through 2021 and is also preparing for a possible reduction in staff. The announcement follows a staff cut in the Los Angeles–area branch of the museum, which is currently closed due to Covid-19. An analysis of the institution’s financial situation conducted by MoCA in March 2019 showed that it was in dire need of an additional $8 million. The organization now estimates that it needs to raise $7.5 million for the two-year campaign to", "The next Biennial should be held in the city, as well as in Shanghai, Singapore, and the United Kingdom. “We are all working together,” said Artemas, who added that the exhibition of the final works would be held as part of the Japanese pavilion at the Venice Biennale in 2021. In the past, the artist has been involved in organizing large-scale installations and sculptures in order to draw attention to issues of food and agriculture, and to address issues of climate change. \n\n\nThe Metropolitan Museum of Art (MoMA), the Museum of Modern Art (MoMA), and the Whitney Museum of American Art have reached a settlement with the heirs of Simon Tel Aviv, an American architect and businessman whose multimillion-dollar fortune was transformed through his participation in the construction of the New York City Central Library. In a long-awaited development, the trustees of the estate have awarded the heirs of the successful architect millions of dollars in compensation.“This is a victory for the descendants of Simon Tel Aviv,” said David, chair of the Mitchell-Lemans Family Foundation. “After nearly forty years of litigation, we reached a settlement that provides substantial compensation to the surviving heirs of Simon Tel", "The next Biennial should focus on Reclaiming the Ancient World, 1986, which is currently on display at the Museum of Modern Art in New York. The Biennial for the Contemporary Art of the Americas, which will be held in 2019, is also on the agenda.\n\n\nThe Royal Shakespeare Company in London has appointed Elizabeth Ayrton as its new artistic director. In her new position, Ayrton will oversee the development and execution of the company’s newest production, Julieta, a dramaturgy-inspired production of William Shakespeare’s The Merchant of Venice, which will run at the RSC from March 22 to March 28. It will be the company’s first new production staged in the UK since Julieta, and it will also be the first production directed by the British director Christopher Wool.Commenting on her appointment, Ayrton said: “Julieta’s central theme of Europe and the eighteenth-century and the intense social, political, and cultural political and intellectual landscape of the late nineteenth century, and the exploration of the impact and intelligence of art and art history as it intersects with contemporary events and the history of ideas, is a theme that I", "The next Biennial should take place in Pyongyang in October 2021.The exhibition will be organized by the Kordofan Museum of Art and the National Museum of Korean Art. The Kordofan Museum of Art will be celebrating its seventeenth anniversary in March 2020 and the National Museum of Korean Art in April 2021.The exhibition will feature works by twenty-five international artists, including Thea LaBouvier, Marisol Pedrosa, and David Salle, as well as three Korean artists that were awarded the Sichuan Biennial Prize in February 2019. The Los Angeles–based curator, curator, and writer Leila Kemper, a professor of art at the University of California, Los Angeles, and the director of the Museum of Contemporary Art Los Angeles, is also organizing a documentary film showcasing the work of the five Korean artists who won the second prize in the country: Kim Eun-kyeong, Kim Eun-kyeong et al., for their first solo exhibition in the country, which opened in September.Inaugurating the fair’s third edition is a special exhibition of work made by the Polish artist Andrzej Wojtas, whose work was featured in the exhibition “Marking Time:", "The next Biennial should aim to draw attention to the ways that interconnectivity between cities and the environment is reshaping our lives. The creativity that can be derived from this process, the very heart of contemporary cities, should be celebrated\u0097and not denied.”The five-day event will be hosted at the Museum of Modern Art (MoMA), where the show will resume on October 26, with a new exhibition dedicated to the city’s rich oral histories. “In the naming of the exhibition, MoMA has made a significant statement that this is the last exhibition that will be called the ‘City of Dreams’\u0097the last exhibition that will be produced with the museum’s agreement,” said museum director Norbert Wunder. A new partnership, which will offer the participating artists a platform for cultural exchange in the United States, will also mark the end of the exhibition.The announcement provoked a mix of excitement and concern in the art world, where many cultural institutions are grappling with the changes wrought by the pandemic, and sharp criticism from those who believe the museum’s move will hurt the artists who are vital to the city, such as the Kemper Museum, which is currently working on a major expansion", "The next Biennial should take place in the summer of 2021, and the final in the spring of 2022. The announcement follows the first exhibition of works by the fifteen artists selected for the triennale, which will be held at the Musée d’Arles from March 14 to March 18.The thirty-three-dimensional-painting exhibit “From Zero to One: A Visual History,” curated by Pablo Picasso’s grandson, Martin-Hansen, will take place at the Musée d’Arles from March 15 to March 15. The exhibition will be headed by architect and former director-general, François Pinault. The title means “Beginnings of the Mind.” The exhibition will be organized in one-hour periods on both Saturday and Sunday, March 11 and March 12, respectively.The biennial’s second edition will be staged at the Musée d’Arles from March 14 to March 18, 2021. The exhibition “Between Time and Death,” curated by Hamza Walker, will be on display at the museum until October 27, 2021. The exhibition will be divided into four parts. “Between Time and Death: Painting, Death, and", "The next Biennial should be a celebration of the recent life of the artist, born, raised, and educated in this country. The theme of the upcoming biennial should be “Excellence in Beauty,” and its exhibition should focus on a selection of more than 400 works from the biennial’s exhibition “The Present.” The other elements of the show should address topics such as democratic values and the legacy of the Artist and the Arts, and how art forms and arts-related activities have impacted the lives and well-being of people.The 2020 Biennial will take place in Brooklyn, New York, and will run from March 14 to March 16. The event will also introduce the public to the work of thirty-six artists, including Carol Aichele (2018), Monir Shahroudy (2017), Jean-Michel Basquiat (2016), Ni’ke Brugge (2015), Nada Burak (2016), and György Kepes (2014).The 2019 Artists’ Choice Awards were given to the thirty-six finalists of the Biennial Awards, which were given last year. The artist-in-residence award, which honors an artist who has lived in a public", "The next Biennial should be held in 2020. The author is simply asking that the museum to continue to be a haven for the world’s most vulnerable, and to focus on the work that is most important to it. With this in mind, I am very much looking forward to seeing you there next year. Signatories of this letter are Jorge Alfonso Pérez, Bernardo Pascual, Elin Gonzalez, Cristina Miro, Carlos Muniz, and José Valentín Pérez. It is my firm hope that this letter will lead to a resolution that will ensure that the future of the Biennial is assured. Sincerely,José Miguel Pérez  September 23, 2020Dear Sirs,We write to express our deep appreciation for your recent and ongoing dedication to the protection of our cultural heritage and to supporting the Los Angeles County Museum of Art (LACMA) through a successful and ambitious renovation and expansion initiative. Since opening in 1992, LACMA has grown to become one of America’s largest cultural institutions. We are grateful for the support of LACMA board members, board of directors, staff, supporters, and volunteers who have greatly helped LAC", "The next Biennial should be held in 2020, the organizers have said, and will be selected by the committee comprising former director-general of UNESCO, Irina Bokova; artist-activist George Suttie, director of the museum; architect and collector Peter Zumthor, a cofounder of the design and construction consultancy firm Lutz Botte; and architect-designer David Kordansky. The project, titled “Future Islands,” will involve traveling to the islands of the South Pacific; setting up temporary structures to house, care for and relocate artworks; and mapping out the diffusion of artworks in such a large and inhospitable environment.The second Biennial will take place in 2022, and will be curated by David Peña, who will return to the island of Guam for the first time with his wife, María Peña, and will be supported by the university about $10 million. The project was inspired by the islands of Hawaii and Palau, which are home to some seven thousand cultural sites, including the ancient town of Kailua, thousands of artifacts from the Gobi Desert, and a sacred site in the Oolite Kingdom of Palau.Peña has said his work, which will be installed", "The next Biennial should also focus on reimagining the museum in honor of its founding, with a particular focus on the museum’s collection, exhibitions, and lectures. The exhibition “The French Connection—From the Museum Art to the World,” which opened in January 2019, is a continuation of this theme. “The best way forward for the Biennial is to embrace the collection of the world,” said Simon Castet. “In that respect, the next editions of the Biennial are a good chance to be a little bit ahead of the curve.” Castet, who is also the director of the Museum of Fine Arts in Boston, said that the new exhibition should focus on “continuity of vision” and “solidarities of personality.”\n\n\nThe Sean M. Healey Foundation has awarded the National Arts Museum in Washington, DC, $2.5 million in support of its future programming. The gift includes a new $300,000 grant for the institution’s 2019–20 season and a new $250,000 grant for the 2020 season. The Sean M. Healey Foundation has also auctioned three works by artist Larry Achiampong to", "The next Biennial should be held in the spring of 2022. Málaga Film Festival will then resume as scheduled. The Royal Academy of Arts in London will now host the second edition of the Royal International Film Festival, which will take place in the spring of 2024.The Royal Shakespeare Company will stage a special Royal International Festival of Plays next month. The group show, titled The Royal International Festival of Plays, will be a collaborative venture between the company and London-based company Lonely-Nova. The choreography and symbolism of The Royal International Festival of Plays will be recreated by the company and the artists and will unfold over the course of a single night. The Royal Academy of Arts will also host a Royal International Festival of Music in the spring of 2024. Announced last month, the twenty-third edition of the Royal Shakespeare Company, Royal Academy of Arts, will also be a weekend affair. The festival will run from March 19 to March 21, 2020 and will mark the twenty-fifth anniversary of the Royal Shakespeare Festival. The 2019 edition featured performances by Richard Biggs, Jonathan Pryce, Philip Glass, and Julia Malins. \n\n\nThe National Gallery of", "The next Biennial should take place in late 2022. The art, which will be curated by an international panel composed of Jenny Lindblad, Biennale leader; Wolfgang Pfeifer, chairman; and Anna-Marie Olsson, director, will be presented at the annual event at Helsinki’s National Museum of Contemporary Art (Jokkatu) in March 2021.\n\n\nThe São Paulo Biennale has announced that it will no longer hold the event in 2021. Instead of canceling the entire event, organizers have decided to focus on creating a platform for a new international exhibition, titled “Toccarra: New Dimensions” (TOC). The inaugural show, which will feature new works by seventy-nine artists, will be held in October 2021. “It is an historic occasion for the São Paulo Biennale, which has been headed by Ondine Bicchierano and seated in the National Museum of Modern Art (BAM) since 2016, the exact year the coronavirus first appeared in Brazil,” said Michela Mora, the exhibition’s director. “We are currently developing a new visual arts project, the theme of which will be ‘the future", "The next Biennial should open in early 2021 and will run concurrently with the 2020 edition. For the first time since the festival began in 1968, the institution will have a single show in its entirety from multiple perspectives. The budgetary constraints of a two-year exhibition schedule have also forced the organization to consider multiple social and cultural goals. The 2018 iteration of the festival, which took place at the CNE from September 13 to September 14, was attended by a record 1,535 people, the majority of whom came from the capital. The 2019 edition, which was staged in Milan from September 15 to September 19, drew a record-breaking attendance, with 1,371 people attending, was the largest audience to date, and featured an all-new selection of works by the artist-run organization Kno, the Prague-born director of whom told the Art Newspaper that the event would \"contribute to the evolution of the exhibition program in the region of the CNE and of the Prague-Bogotá region in general.”While the biennial is being staged in two locations—the CNE and the Museum of Contemporary Art Prague—each biennial will be centered around a single theme and will feature a different artist from each of the biennials.", "The next Biennial should be held in the spring of 2021, the Art Newspaper reports. The institution is currently working on a new twenty-year strategy and will reveal the new dates and locations of the 2019–20 season.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to move the exhibition space for its upcoming exhibition “The Body and the Performance,” which runs through February 22, 2020, from its current location on Wilshire Boulevard, where it has served as a hub for events and cultural programming, to a new venue on the city’s Westside. “The Body’s Performance,” a presentation of work by artists such as Steve De La Bar, Vito Acconci, and Victoria Miro (now in its third cycle), will also feature work by contemporary artists such as David H. Koch, Jodi Throckmorton, and Kerstin Brätsch. “I’m really excited by seeing these artists in all their vibrant, unimaginable best,” said Sarah Wiese, director of MoCA. “It’s a rare and wonderful honor to present the work of these amazing artists at the Museum of Contemporary Art,", "The next Biennial should take place in the city’s Museum of Contemporary Art (MCA), which is currently undergoing a $1.5 billion renovation. The museum’s new home will also include a large exhibition space, a hotel, and a conference center.The event, which is named after the city of Barcelona, will focus on themes such as the history of the city, the architecturally unique best practices in design, the role of design in addressing social and environmental problems, and the relationship between design and art.\n\nThe Museum of the American Restoration (MAS) in Portland, Oregon, is suing Amazon to recover more than $150,000 in lost sales following a planned two-day exhibition on American art. The lawsuit, filed by the museum on Friday, December 14, claims that the online retailer intentionally mis-sold works by artists such as Benjamin Britten, John Edmonds, and William Eggleston. The institution is asking for an immediate return of the $155,827 in profits the retailer may have made by reselling works in the days leading up to the event, and it is asking for at least $153,000 in damages.“The Museum of the American Restoration stands out as an exemplar of", "The next Biennial should be held in 2021.\n\nThe Museum of Modern Art (MoMA) has appointed Maria Ceruti as its interim director and CEO. Ceruti succeeds Richard Armstrong who retired in February after a decade at the helm of the institution. She will take up the post in January 2022. “The board has been very supportive of my decision to return to work full-time and to focus on building MoMA’s future,” said Ceruti. “I’m grateful for the opportunity to continue to build and shape the museum’s role as a work—and, more importantly, as a place. I’m eager to accelerate MoMA’s transformation into an international destination and to further support the museum’s mission in future years.”During her tenure as MoMA’s director, Ceruti oversaw the acquisition of three works and oversaw the development of MoMA’s new series, “Themes of Modern Life: From the Collection of Richard Armstrong.” She also organized over twenty exhibitions and numerous public programs that have been staged at MoMA and the Museum of Contemporary Art in Los Angeles and at the Museum of Modern Art and the Metropolitan Museum of Art", "The next Biennial should take place in 2021, and its results will be announced in 2022. The Edinburgh Art Museum, where the show will be staged next month, and the Tate, which will stage the exhibition in May, have already committed to covering the event in their territories.\n\n\nCommissioner of Fine Arts, Johanna Bochereau, has announced that the Federal Republic of Germany will soon host two exhibitions with a combined $30 million each: “The Fate of Art: the History of Art in the Twenty-first Century” and “The Future of Art: Contemporary Perspective,” opening on January 12 and March 25, 2020 respectively. Both shows will feature work by thirty artists, including Oksana Iskowitz, José Antonio Barrio, Victor Bernard, Eduardo Cesarco, and Maria Knezev, and will be on view in Berlin, Cologne, and Stuttgart from January 16 to March 28, 2020.“Both shows are important milestones in the artist’s forty years of participation in the Berlin Biennale, which has been a source of inspiration for me since I was a teenager, and in the development of my own practice,” said", "The next Biennial should take place in the spring of 2020. In the meantime, the architect-historian and educator Hsüan-Tsung, who is represented by the firm Jacobs & Tallman, is working on a design for the museum that will incorporate façades, staircases, and other elements. In an interview with the Art Newspaper, Hsueh-Tsung said: “I am thinking about how the building might have looked like from the street. I am not sure how we would have survived.” The museum is planning to build a new section of the museum on the site of the old building, which it hopes to open sometime in 2022.\n\n\nThe B-17 Flying Fortress Museum in Shreveport, Louisiana, has received a $100,000 donation from the Susan B. Anthony Foundation. The donation was made during a three-day, auction-style auction held at the institution in honor of the late feminist icon. The museum, which was founded by Diane and Don Sylvester in 1988, was nominated for a Pulitzer for its lifetime achievement award for its exhibition “Midnight in America” (2018). The show, which was curated by Harvey Proctor and Mary Anne", "The next Biennial should be held at some time in the next twelve months and will be organized as follows: There will be the exhibition of the work of a group of artists, which will consist of twelve artists, including Haroun Chaar (Arts.Commune Internazionali di Milano), María del Carmen (Arts of Modern Life), and Sigrid Süder (Arts.Prestel, 2019). The exhibition will be organized as follows: Arts.Prestel is the oldest contemporary art exhibition in the world and has been held in the Palazzo e Vittorio in Venice since 1972. The exhibition is organized in the new design of the Palazzo dal Mario in Venice and will feature work from the collection of Alberto Loyola, Milano; Paul Benito Villar (1944–2006); and Jakob von Nachtschul, Berlin. The exhibition will be hosted by an architect-design studio, Lecce Venuti, and Ichiro Dendograf, and will take place in the Palazzo di Cattelaniti in Venice.The biennial will be curated by Marco Cipolletta—an Italian architect who", "The next Biennial should aim to rewrite the history of twentieth-century sculpture by examining how the future of art is represented by the various systems of sculpture and not only by the art itself. It should also introduce more diversity into the collection, by moving it beyond the dominant two dominant perspectives: the Indian art of the late 1950s and early 1960s and its influence on the art of the last twenty-five years.Istanbul Biennale: 2017, 19 (2018), 18 (2018), 17 (2018), 15 (2018), 18 (2018), 11 (2018), 17 (2018). All of these efforts will hopefully lead to a better understanding of the multifaceted role of the institution in the city’s art history, and how the museum, through its exhibition program, connection with the city, and by way of the biennial, can help shape the art and architecture of the region.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Monica Sacco as its next chief curator. She will assume her post in January 2020 and will be based at the institution in Manhattan. Sacco will be responsible for the development and presentation of the institution’s collection, exhibits, and", "The next Biennial should be held in 2020.  Chairman Alexander Czirko, who is also a member of the committee of directors, said: “We are keen to see the exhibition become a major milestone in the history of the museum. We are hopeful that it will become a new chapter in the history of the gallery, and in the history of art.”The Art Newspaper reports that the opening of the exhibition will take place at the Kunsthalle Basel in Switzerland, which will also host a new collaboration between the Museum of Modern Art (MoMA) and Sharmila (the museum of modern art in New York) in November. The new exhibition will feature works by twenty-six artists, including Peter Andre, Renzo Piano, David Salle, Peter Suss, William Eggleston, Renzo Villa, and Jade Bonner.\n\n\n\n\n\nSara D. Davis, founder and chair of the New York Philharmonic, has announced that the institution will reopen to the public in November. The reopening, which coincides with the National Association of Theater Owners (NATA), will be timed to coincide with the Golden Gate Parade, which is slated to take place on January", "The next Biennial should take place in 2021.\n\nFollow artnet News on Facebook: Also see: Artforum Live: Artforum Live: Artforum Live: Artforum Live: This Revealed: Artforum Live: Artforum Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: Artforum Live: ", "The next Biennial should be held in 2022. Noguchi—who has the contract to organically collect the art for the event—will present the works in the exhibition at the venue of the Folk Museum in Abbotsford. \n\n\nThe Woodlands Museum of Art in Texas has received a gift of four monumental works by Jacob Cohen, the French national and founder of the Bienal-Saulnier collective, from the estate of the late collector Louis Riel. The works are The Mural (La Ville de l'Association Française), The Grave (Avant-Garde Concretes), The Sea (Howl), and The Mud (Avant-Garde Mudals).Established in 1937, the collective was led by Louis Riel, a German Jewish immigrant, who walked four-by-four-layered lithographs of landscapes, including the ArtsofLife series by artist Oskar Kokolyns (1973–1979). Together the three artists created a series of works that were exhibited at the group’s annual exhibition at the Museum of German Art in Hamburg in 1979, and were selected for the first edition of the Woodlands Biennial", "The next Biennial should be ready by the end of next month. “This means we can go back to the drawing board and re-imagine the next Biennial in future or we can abandon the design,” said lead designer Artua Kubica.  Its first iteration, the inaugural Biennial of the Russian Academy of Fine Arts in Moscow in November 2010, was marred by a series of vandalism and political unrest that engulfed the institution, which was struggling to contain the spread of Covid-19 at the time.The city of Milan, which is currently grappling with the consequences of its handling of Covid-19, expects to take up the theme of the upcoming edition this autumn. The final exhibition, titled “Towards a New Form of Humanism” (Tof), will feature work by thirty-four artists, including Carsten Renaldi, Giacomo Ricci, and Laura Owens, and will run until April 25. The show is organized as part of the ongoing renovation and revitalization of the city, which will also include the development of a new public space, the city’s Institute for Contemporary Art, the creation of two new programs, and the construction of a new cultural monument.In", "The next Biennial should be held in 2021. The full list of participating artists and institutions is as follows:LINKS: The Margolles Museum of Art, New YorkThe Metropolitan Museum of Art (Metropolitan Museum of Art)The Museum of Modern Art, New YorkThe Museum of Modern Art, New YorkThe Museum of Modern Art, New YorkThe Metropolitan Museum of Art, New YorkThe Museum of Modern Art, New YorkThe Museum of Modern Art, New YorkThe Met, New YorkThe Met, New YorkThe Met, New YorkThe Museum of Modern Art, New YorkThe Metropolitan Museum of Art, New YorkThe Museum of Modern Art, New YorkThe Met, New YorkThe Metropolitan Museum of Art, New YorkThe Met, New YorkThe Met, New YorkThe Met, New YorkThe Metropolitan Museum of Art, New YorkThe Metropolitan Museum of Art, New YorkThe Met, New YorkThe Met, New YorkThe Met, New YorkThe Met, New YorkThe Met, New YorkThe Met, New YorkThe Met, New YorkThe Met, New YorkThe Met, New YorkThe Met, New YorkThe Met, New YorkThe Met, New YorkThe Met, New YorkThe Met, New YorkThe Met, New", "The next Biennial should take place at the Arts Centre in St. Petersburg in September 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has added five new works by artist-activists Biney Musal and Naima J. Abdalati to its collection, marking the first times these two activists will work together in the United States. Musal and Abdalati were selected from a pool of twenty-two artists by a committee chaired by Patricia Al-Khoury, assistant curator of modern and contemporary art at MoCA, and Jeffrey Gibson, the director of the Institute for Transformative Research at the Museum of Contemporary Art in San Diego.“Biney and Naima have been working together for several years now and have recently collaborated in the exhibition ‘The City and Other Worlds’ at the Los Angeles County Museum of Art,” Gibson said. “Viewing these pieces together will give visitors a taste of their creativity and the space to reflect on the many paths that will lead to the Museum of Contemporary Art.” The works, which are currently on display in the annual exhibition “The City and Other Worlds,” were selected from a pool of twenty-two artists from twenty-", "The next Biennial should focus on the role of art in the lives of children, youth, and adults, and should include a reflection on the role of art in developing a sense of belonging, a discussion of the importance of childhood and the collective in the context of a community, and a reflection on the relationship between art and youth.” “The biennial format is an extension of the work of Marcel Proust, who initiated a series of events and meetings around the city to foster dialogue and understanding between local communities and the arts,” Proust told the New York Times in 2014. The 2020 edition will open in May and will run for twelve months. The full list of participating artists is as follows:\n\nFrançois Asti-Meyer\n\nGlen Clossens-Suellen\n\nCatherine Rodell\n\nMatt Rossiter\n\nSara Zivkovic\n\nLaura Zvulak\n\nKevin Anderson’s Last Journey’s Journey: An Allegorical Journey of a Ghostly Man in the West, 2014, 2014, and 2019, 2014,2017, and 2018, 2016, and 2019, 2014, and 2018", "The next Biennial should be held in December and could be held anywhere from March to October. The theme of the first, “Towards a History of the Future,” is a reference to a play by the German writer Dietrich Reimer, which is included in the exhibition. The exhibition will be organized in collaboration with the local municipality of Frankfurt.The gallery will have four editions of the exhibition, which will be hosted by different artists, and will have a different theme each year. The first edition will focus on the history of the art and will include works from the collection of the foundation and will be staged at the museum until December. The second edition will be on the contemporary issues, will take place at the local station of the museum, and will run from December 17–December 21. The third and final edition will be on the museum’s collection of conserved materials, and will take place at the local mall of the museum. The foundation is a not-for-profit organization that works to support the work of emerging and established artists in Germany through the exhibition, scholarship, and sponsorship programs. It is also responsible for the development of the museum’s collection of Nazi art.\n\n\nThe Metropolitan Museum of Art, the", "The next Biennial should be held in the spring of 2022 and will be hosted by the Museum of Modern Art in New York City. “The Biennial was born out of the necessity to present art from a wide-ranging and imaginative range of historical and contemporary artists, and the relevance of the fields and disciplines in which it operates, which is incredibly exciting,” said Naima J. Keith, executive director of the Satya Institute. After awarding $100,000 in support of the Sundance Biennial in 2010, the Satya Institute was awarded $1.5 million for the 2020 edition.\n\n\nThe Metropolitan Museum of Art in New York has announced that it will permanently close its Far East wing in 2022 as part of the city’s plan to reduce the museum’s footprint in order to reduce greenhouse gas emissions. The budget cuts, combined with the institution’s decision not to renew the lease of the building that houses the museum until 2023, have forced the decision, which will also affect the museum’s programming, plans for exhibitions, retreats, and estate management, after the museum declared in February.“The museum has chosen to focus fully on climate change and climate justice,” said", "The next Biennial should take place in 2019. \n\n\nThe Jewish Museum in New York has appointed Aya Hochstein as its new executive director and director of communications. Hochstein will take up her new post on January 8.“We are grateful for her work in elevating our relationship with the community, and we are confident that she will continue to advance the museum’s mission and continue to expand its influence in bringing meaningful experiences to the Greater NYC Jewish community,” said museum director Michael Govan.During her tenure at the institution, Hochstein will oversee the development and launch of the Ishtar Sculpture Garden, which will be inaugurated in 2017 and will offer partner curators a venue for speaking engagements; the development of the museum’s digital platform and digital audience engagement; and the selection and exhibition of works by artists whose work was previously on display in the gallery or at the institution.Commenting on her appointment, Hochstein said: “I’m honored to be selected to lead the MCH Museum of Art. I’m excited to begin this new chapter with our community, and have the opportunity to shape the legacy of this museum. I’m eager to work", "The next Biennial should be held within the next six months.” The museum is currently constructing an extension to the exhibition, which will include a public courtyard, a larger plaza, and the construction of a new center.\n\n\nThe National Museum of Fine Arts in Scotland has appointed Joan McDonnell, a former chief curator of contemporary art at the institution, as its new director. McDonnell will take the helm of the museum after serving as director of the Centre for Contemporary Art Culture (CCAC), a major arts development and fundraising platform for the institution, which employs around eighty staff members.“Joan is an exceptional leader with a history of transforming the Centre for Contemporary Art Culture and the Scottish economy, and she is clearly the person to lead the institution through this challenging and challenging time,” said Leslie McKinnon, chair of the board of trustees of the National Museum of Fine Arts. “In the context of a global climate of crisis, uncertainty, uncertainty about the future, and a world where art, creativity, and artmaking are increasingly seen as a sacred and limited resource, it is essential that the National Museum of Fine Arts continue to thrive. I look forward to working with Joan and to seeing how she uses the National Gallery’s collection to", "The next Biennial should be in 2022.  \"We are actively working to accelerate the design and the construction of the museum, and to increase the exhibition space in the building to meet the growing needs of the community, including the exhibition of new works of art, performances, documentaries, and events that are inspired by the programme of Biennials we have just completed. We are in the final stages of preparing the Biennial for the Arts, and the Biennial for Life, and hope that they will continue to benefit from the expertise, creativity and commitment of the talented and dedicated staff.”\n\n\nArt historian and curator Willa Smith died on March 22 at age eighty-eight at her home in New York City. She was named the winner of the Robert Rauschenberg Prize in 2006, the subject of a special retrospective in 2017 at the Museum of Modern Art in New York, and the recipient of the Sargent-Rudy Grant in 2017.Born in Boston in 1932, Smith came to New York in 1939 to study art at the Yale University Art School, where she met fellow Yale grad Robert Rauschenberg, who introduced her to the works of the contemporary artists such as Carlos Castaneda, Alfred Stieglitz", "The next Biennial should take place in 2020.\n\n\nThe commission of a statue of Joseph and Lillian Pickering in their hometown of New Orleans is set to be completed next month, with funding from the estate of the couple’s late father, Joseph Pickering. The commission was made in honor of the book, “Joseph and Lillian Pickering: The Family Portrait.”According to a release, the work, which was commissioned by the estate, “tells of the Pickering family as they left their rural home in Kansas to embark on a lifelong journey that included a trip to Egypt, Morocco, Greece, and Rome.” The work was completed in 1973, two years after the family fled the civil war in their native state of Kansas.“The work addresses the family’s shared history with slavery, suggesting that the Pickering family were not above recognizing their racist and anti-Semitic beliefs,” Penny Balkin, the executive director of the Jewish Museum in New York, said in a statement. “Like many Americans, the family was shocked and saddened to learn of their connection to slavery, but their courage and steadfast belief in their cause motivated them to continue the work, to watch the world burn", "The next Biennial should be held at the new museum within the next six months and will run from April 26 to April 28, 2020. The eleven artists and twenty-four curators who were selected from a pool of fifty-three artists by an international jury are: Arte Povera, Baltimore; Jonathan Lewis, New York; Denis Arcand, New York; Paul Aker, New York; Daniel Barenboim, New York; Jake Basso, New York; Tanya Barvat, New York; and the Biennial of the Arts, New York, which is currently on view, as well as the Biennial of Modern Art and the Biennial of Contemporary Art, Los Angeles, which both opened last month.\n\n\nThe Art Museum Miami (AMP) is removing five works by artist Albert Oehlen, who was widely considered one of the most influential contemporary painters of the 20th century, from its collection, Artnet reports. All five of the artists are currently on display in the museum’s new exhibition, “Just the Tip,” which opened on April 2 and runs until June 2, 2020. The exhibition features works by twenty-seven artists, including John Kahn, Bruce Lee, and", "The next Biennial should take place at the Library of Congress, Washington, DC, in 2021. “The theme of this year’s exhibition is ‘indigenous art.’ The exhibition will highlight the extraordinary visual and written histories of many Indigenous artists across the globe, as well as their important contributions to the development of American art.” \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that the institution will not proceed with the reopening of its building until it receives the final form of the landmark climate action agreement, COP-21, which will be completed by the end of the month. The landmark deal, which aims to reduce the global temperature increase to 2 degrees Celsius, was signed by more than 190 countries and more than 190 nations in Paris last December.Under the agreement, individuals who live in countries that do not fully implement the agreement will be held accountable for damages. The United States, the European Union, China, and Japan were among the countries that did not sign the agreement. The United States is currently the largest emitter of greenhouse gases and is estimated to be responsible for releasing more than 280,000 metric tons of carbon dioxide into the atmosphere since 1970. The museum has called off the formal", "The next Biennial should be called in four to six weeks. The first will be in early April, and the second in early June. The third will be in late May, and the fourth will be in early June, with the first exhibition opening in early July, with the second in July.In the second exhibition, the museum will present a retrospective of one of the artist’s works, “Cindy Sherman-McIntyre” (1957), which will be on view through July 16. The show will also feature an exhibition of works by Cindy Sherman, as well as works by the artists who are currently understudying for the biennial, among them Simon Lagnado (March 13–March 16), Vito Acconci (March 19–March 21), and John Akomfrah (March 21–March 23).Commenting on the upcoming exhibition, Jane Corrigan, a trustee of the Biennial, said: “It will be an exciting new chapter in our history as a contemporary art museum. Cindy Sherman-McIntyre’s work embodies the spirit of the Biennial and speaks to the heart and soul of New York. We are very much looking forward to the exhibition, and the exhibition,", "The next Biennial should be held in 2019. Commenting on the decision, Pols said: “Since 2016, the Biennial has been a focal point for the story of modern art’s relationship with India. I’m excited to see how this year’s exhibition will unfold in New Delhi, and to work with the team again next year. The exhibition has been challenging to organize in a contemporary setting, but I believe that 2018’s exhibition of Satyajit Ray’s work in Mumbai will be a great success.”\n\n\nThe German government is preparing to establish a new fund for the preservation of the legacy works of the young artist Georges Seurat in the hope that the fortune that was once made with the artist’s work will someday be realized.The Konrad Adenauer Foundation (KfW), which was set up to help the artist and his heirs realize their dream of collecting large quantities of his work, is beginning to launch an exhibition of his works in the capital of the Prussian state of North Rhine-Westphalia. Dubbed “Georges Seurat 2020,” the event will be staged at the Kölnischer Kunstverein in", "The next Biennial should be held in 2021. “I am thrilled to see work in this exhibition house’s collection,” said Mary Lou Vincent, director of the Whitney Museum of American Art, in New York. \n\n\nAn open-air sculpture park in Amsterdam that was built with more than one billion dollars in public funds and inspired by the city’s Botanic Gardens has been condemned by the city for its lack of contemporary, contemporary art-making projects. The Maelbeek district of the city, which includes part of the city’s inner harbor, the Polderaag, is currently home to a sculpture park that was completed in 2010 and an outdoor sculpture park that was completed in 2018. Both works are part of the Maelbeek Biennial, which celebrates contemporary art and architecture, in addition to featuring live music, performances, and other events.The Maelbeek Biennial, which launched in 2010, and the Polderaag, which opened in 2018, respectively, were constructed using funds from the Mitzvah Lower Biennale Fund, which was established by the Mitzvah Lower Synagogue in 2008 and the Maelbeek Foundation in 2016. The Southbank Centre for", "The next Biennial should be completed by the end of the year.”The theme of the 2019 triennial was “Love and Responsibility,” and the program was organized around the themes of the androgyny movement, feminism, and the transgender movement. The first year under the new name of the Biennial Axis was 2014–15. The following year, biennial participants were discussing the importance of art and feminism in their respective movements.In an attempt to address the concerns of the artists, the organizers said that the exhibition “will continue to reflect the feminist, queer, trans-medical and anti-racist perspective of the city of Cologne. We will continue to provide a platform for the voices of young people and young artists, and will continue to engage with our guests and our city.”\n\n\nThe Museum of Modern Art (MoMA) in New York has launched a new initiative designed to help low-income artists and small-business owners. The program, called the “Joiners” initiative, will provide $25,000 grants to individuals who live in the Bronx and Staten Island, as well as New York City, and will provide them with one-time grants of $5,000. Applicants must be", "The next Biennial should be established in 2020. \n Ofelia Bruguera, the head curator of the Museum of Contemporary Art (MoCA), has been appointed curator-at-large. Bruguera will be responsible for presenting the inaugural triennial exhibition, “Revival,” and will be assisted by an assistant curator. The inaugural exhibition will feature work by twenty-eight artists and will open on September 25.The field of contemporary art has undergone a major resurgence in recent years. In 2015, the Museum of Modern Art in New York staged a retrospective of work by thirty-eight artists, including Denilson, Adrienne Atget, and Daniel H. Pérez. In 2016, the Museum of Contemporary Art Chicago hosted a triennial for contemporary art, “The Future Is Present” (following a six-month residency at MoCA), and last year, the inaugural event of the Whitney Museum of American Art in New York was the first show devoted to the power of photography.In a statement, Bruguera said: “The show will be a celebration of the amazing achievements of the biennial: the artists who have captured the imagination of the world, and the world who have", "The next Biennial should take place in the Spring of 2020 and will consist of two exhibitions: “The Sleeping Beauties of Zanzibar: Contemporary Art from the Ancient World” and “The Penitentiary Years: Black And White”. The exhibition “The Sleeping Beauties of Zanzibar” will be on view until October 7. The exhibition “The Penitentiary Years” will open on October 8.The inaugural edition of the Biennial will be held at the Museums Museum of Modern Art (MoMA) in New York on May 6–May 9, 2020 and will be followed by the fifth edition in New York City in 2020. The Helsinki pavilion will be inaugurated at the Kupala Museum of Contemporary Art in Helsinki on May 14–May 21, 2020 and will close on May 22. The exhibition “Collapsing Bridges: Contemporary Art from the Ancient World” will be held at the Museum of Modern Art Helsinki from May 16–May 21, 2020 and will run until May 20. Andreas T. Carlsson, the director of the Museum of Modern Art, will serve as the host of“The Sleeping Beauties of Zanzibar�", "The next Biennial should take place in 2020, the organisers said.\n\n\nThe Museum of Fine Arts (MFA) in Boston has announced that it will host a second edition of the art-world fair, which has historically drawn an average of 4 million visitors annually, in 2021. The event will take place at both the Barbican Center and at the Massachusetts Institute of Technology (MIT), in Cambridge. The event will be accompanied by a new exhibition, HELMÉ, which will include works by twenty-six artists. Acting as an extension of the now-everyday art world, the event will feature a new collaborative platform, the MFA Foundation for Arts, and will be led by an intergenerational group of curators, thinkers, and artists, including Larry Achiampong, Lin-Manuel Miranda, and Tanya Steinmetz.The organisers said: “The next two years will bring an unprecedented experience of contemporary art. The events of the last two years have prepared us for what lies ahead and we are eager to take you on a journey with us through the network of impact that is the art world and the most recent exhibition of HARD, which has given the world a new", "The next Biennial should focus on how art and culture intersects with local issues in relation to art and science. I wish we could achieve this through the construction of new relationships between art and science, but I am afraid that the current situation will prevent us from doing so. ” The Biennial will have to allocate at least ten thousand euros in order to pay for the installation of the first exhibition, which will be staged in partnership with the city of Warsaw and the Warsaw Science University. Biennials will also be organized in collaboration with the city of Hradec Kieżce (the other two exhibitions will be staged in February 2019 and November 2020). The project of the Biennials is also supported by the foundation of the Polish Academy of Sciences, the city of Warsaw, and the city of Kraków. The drawings and the installation of the exhibition of the last exhibition of the new new year are on show in the exhibition “The Future Is Art” at the Museum of Contemporary Art in Munich. The exhibition “Art and Science in History,” organized by the Russian Academy of Sciences in Moscow, is on view in the National Museum of Contemporary Art in Krasnoyarsk from", "The next Biennial should take place in 2021. To view the full list of participating artists, visit Artists’ Remaking History.\n\n\nThe renowned Swiss artist Ron Gorchov, whose photographs express a sense of the sublime and often transcend genres, died on January 26, 2020 at his home in Geneva. He was ninety-three years old.Born in Zurich in 1937, Gorchov studied at the University of Geneva and the University of Bern. He later earned his doctorate from Bern in 1964. In 1977, he married Marie-Louise Terrier, and the couple had four children\u0097two sons and a daughter, and one son and a daughter, respectively. Gorchov—a father of four—would eventually move to New York to concentrate on his work, and in 1981, a group exhibition at the Museum of Modern Art in New York staged his photographs for a retrospective.In 1971, Gorchov began photographing at his studio in Bern, with Heather Allen, and in 1978, he began his famous series of portraits, “The Unseen,” which often addresses the avant-garde. The work has since been collected by the Los Angeles County Museum of Art (LACMA), the New", "The next Biennial should also aim to re-examine the role of art and architecture in the development of democratic and equitable societies. The museum’s current exhibition “55 Years of the United States,” which opened in 1980, was shot in the early 1970s. For the past two years, the museum has been working with artist-in-residence Kristin Bax to create a new exhibition that will explore the relationship between art and architecture, both in America and in the world.Bax’s work, “60 Years of Architecture,” is on display at the Biennial until March 28. The biennial, which is organized by the Museum of Fine Arts, Boston, is also holding the first-ever Exhibition of 28 Art Historians. The exhibition, titled “Art History: A Report on the Twentieth Anniversary,” will take place at the museum from March 14–March 18.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles plans to start welcoming visitors again on Saturday, March 6, following a temporary closure due to the Covid-19 pandemic, the Los Angeles Times reports. The reopening date for galleries and other public spaces is still unknown. While the", "The next Biennial should take place in the spring of 2021. Toshiko Sato, the executive director of the Tokyo Art Museum, has since sent a letter to the 21st Tokyo Metropolitan Assembly, as well as to Prime Minister Shinzo Abe, asking for the move to 2020, reports the Japanese daily Asahi Shimbun.According to the letter, the museum is currently working on a new program for the exhibition “From a Revolution of the Mind to a Revolution of the Body”, which will be staged in the spring of 2021. The museum also indicated that it is planning to expand the museum’s collection. The exhibition will be inaugurated by an exhibition of the artist’s work, a separate event, called “From a Revolution of the Body” , which will be half-hour long and feature the work of three artists: Sakurai, Fumihiko Takada, and Satoru Takahashi. The other half-hour event, “From a Revolution of the Mind” , was originally scheduled for June of this year, but was rescheduled for July.The submission of artworks for the biennial is not unusual. In 2016, the exhibition was nominated for a", "The next Biennial should aim to address issues of our time such as climate change, the threat posed by invasive species, and the mental health crisis brought on by addiction and mental health issues. We can do better. We need to do better. We need to do better. We need to do better. We need to do better. We need to do better. We need to do better. We need to do better. We need to do better. We need to do better. We need to do better. We need to do better. We need to do better. We need to do better. We need to do better. We need to do better. We need to do better. We need to do better. We need to do better. We need to do better. We need to do better. We need to do better. We need to do better. We need to do better.\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has announced that it is planning to move the exhibition “The American Negro” from its permanent collection to its temporary home at the National Museum of African Art, in Augusta", "The next Biennial should be held in 2021, when the entire work will be on view for the first time. The first exhibition, titled The Other Vietnam, was organised by the New South Museum in London and will focus on the exhibition “The Lessons of Vietnam: Tenets of Design,” a collaboration between the new and older advocates of the modernist as well as the Vietnam Museum. The next edition of the Biennial will be held in 2024. \n\n\nThe National Geographic Society’s plan to move the 60th Annual Geophysical and Biennial’s exhibition and celebration from its location in Washington, DC, to the nearby campus of the Massachusetts Institute of Technology (MIT) has fallen through. The move was originally announced in July 2019 and would have taken place in 2021, but was postponed owing to concerns about Covid-19 and the postponement of the fair. The news came as a surprise to many—the institution had previously said that it was working on a new venue for the annual event, which draws more than 1,500 scientists and engineers and is held in conjunction with the United Nations and is the largest science and technology conference in North America.According to the New York Times, the move was made", "The next Biennial should take place in the city of Marrakech in Morocco in the spring of 2021. The 2018 event, entitled Art and the Spanish Civil War, drew thirty-five thousand people.\n\n\nThe National Galleries of Scotland (NGA) has received a $10 million donation from the National Lottery Heritage Fund. The funds will go towards securing the future of the Beehive Wheel, which was one of the first vehicles in the history of the institution to be given a national profile. It is also funding the rest of the NGA’s expansion, which aims to bring the institution’s collection to more than twenty-five sites across Scotland, and the reorganization of NGA’s collection.“The NGA is thrilled to be asking for your support in realizing our ambitious vision for the future of the Beehive Wheel,” said National Museums Scotland director Helen Sill. “It is a monumental task, and one that will require years of planning and investment. But we believe the National Lottery Heritage Fund will be instrumental in delivering a compelling and transformative experience for visitors to the NGA.”The donation includes funding for the acquisition of the Beehive Wheel, which", "The next Biennial should at least take place in 2020, and the next will be the last.\n\n\nThe Museum of Modern Art (MoMA) trustees announced today that Michelle Mittendorfer, the now-retired director of the museum, will receive a $100,000 grant from the Coronavirus Aid and Relief Fund (CARF), the $2.2 billion relief effort jointly run by the United States and Canada. The grant will fund the creation of a new multimedia platform dedicated to the history of African art, and will be delivered in conjunction with the museum’s exhibition “The Evolution of the African Experience,” which opened in December 2018, and the annual “Tit for Tat,” which opened in May 2019.“We are thrilled to receive this extraordinary funding, which will allow MoMA to further develop and strengthen its collection of African art,” said museum chair Jim Kallman. “We look forward to sharing this important resource with our museum guests and the African diaspora.”In addition to the grant, MoMA also received a $1 million donation from the Coronavirus Aid and Relief Fund in support of the institution’s sprawling, $50 million African", "The next Biennial should take place in the coming months. The first exhibition will focus on the history of the artist’s installation and will run for twelve weeks. The second exhibition will focus on social and political issues, and will run for a maximum of twelve months. The third exhibition, which will be open to the public until March 2020, aims to present the work of sixteen artists in the first exhibition, and will be curated by artist Ria J. Alminade and Kunsthalle Basel.“The work of the artists of the future will be more dynamic, more varied, and more personal,” said Alminade. “The biennial will challenge the contemporary vision of art in a way that has never been done before.”\n\n\nPace’s inaugural Dakshina Art and Design Fair, which kicked off in Kolkata on March 23, has announced that it will now take place in November next year. The first edition of the fair, which was organized by the Delhi-based artist-run nonprofit outfit Panchi Art Gallery, was canceled owing to the ongoing protests in India over the killing of an alleged terrorist in the country’s capital. The protests have since spread to other cities in", "The next Biennial should be in the spring of 2021. The festival will be hosted at the Institut Karlsruhe, the Leibniz Galerie at the University of Vienna, as well as at the Karlsruhe Museum; the Kunsthalle Basel, the Kunsthalle Stuttgart, the Kunsthalle Basel (BASEL), and the Luisi Museum Berlin; the Kunsthalle Wien; and the Kunstakademie Berlin. The 2019 event, which was held at the König Galerie in Bonn, was canceled last month when a fire broke out in the building\u0097which housed the museum for thirteen years\u0097on September 16.The venue will be rebuilt, the artworks will continue to be exhibited, and museums will continue to operate under the guidance of the same creative, curatorial, and technical staff. The restoration team will present its first work at the new Museum Karlsruhe on May 10.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that Lauren Panzo, a curator and artist based in New York City, has been named the winner of the 2020 Laura and Stewart G. Evans Prize. The $25,", "The next Biennial should be held in 2021–20. The institution will be open to the public from January 13 to November 22. Museum director Tom Gagliano said: “The city of New York has been and will continue to be the epicenter of Biennials and the museum means a lot to our city. We’re grateful for the support of the City of New York, the Metropolitan Museum of Art, the Bronx Museum of the Arts, the Museum of Modern Art, and the Metropolitan Opera House, and especially for the blessing of a full and exciting new chapter. We hope that you will come and join us at the museum. We invite you to experience the most extraordinary exhibitions and aural experiences, live music, and enjoy a good cup of coffee.”   Claudia Brittenham, chair of the exhibition committee, said: “The exhibition ‘Ai Weiwei’s Art of Life: The Meaning of Life’ is an extraordinary introduction to the work of American painters and will provide the context for our introduction to Hans Christian Andersen. It will also be an excellent introduction to Arnold Raetz’s sculptures and to his later work, which spans four decades.�", "The next Biennial should be held at the Aveiro in Milan in September 2019. The first will take place in the city in March 2020 and the second will take place in the city in February 2021. The announcement of the dates was made in conjunction with the opening of the Italian pavilion at the Fifty-Ninth Venice Biennale.\n\n\nThe Whitney Museum of American Art in New York has named Rachel Presley as its next director and CEO. Presley comes to the museum from the Ohio Institute of Art, where she has served as deputy director for the last two years. She succeeds David McAllister, who has led the museum since 2015, and will take up the helm in October.“We’re thrilled to welcome to the Whitney an exceptional leader with the breadth and depth of her international reputation,” said David Levine, the museum’s interim director and CEO. “The new leadership team is committed to supporting the Whitney’s mission to organize, present, and share art in a way that works for the entire community. Rachel’s strengths are her demonstrated ability to build relationships with communities, both large and small, and her proven track record of organizing and presenting exceptional work.”During her tenure,", "The next Biennial should be held in the spring of 2022.\n\nThe Biennial of African Art’s board of directors has issued the first statement regarding the fifth edition of the event, which will take place at the University of Johannesburg from May 21 to May 25, 2021.The statement, released by Herbert van der Linden, chair of the board of trustees, reads: “The board of trustees is deeply concerned by the recent events at the University of Johannesburg. While we are aware that the fourteenth edition of the Biennial of African Art is being held as planned, the board of trustees has decided to postpone the event until the outcome of the disciplinary procedure is known.” The statement also states that the board is still assessing the implications of the move.\n\n\nThe Museum of Contemporary Art (MoCA) London, the National Shakespeare Company, and the Royal Shakespeare Company have all put out statements saying that they are working together on a new partnership that will include the production of new shows and the distribution of existing works. It is currently unknown whether this will involve adaptations of Shakespeare works or new works based on existing scripts. London’s National Poetry Library, which is currently undergoing a $4.5 million expansion", "The next Biennial should be held in 2022.  —View the full list of participating artists here: Artforum.com’s Artservice blog has quoted Woodruff as saying, “I’ve been involved in urbanism for thirty years—I’ve been a board member of the New American, an organizational member of the Greater Los Angeles Community Landscape Foundation, and a board member of the City of Los Angeles. I know the city is trying to do a lot of good in the world. I’ve been in direct contact with the people of Los Angeles for several years. I’m not going to make a statement about what they’re going to do. I don’t know what the future holds.”In an interview last year with Artforum, Woodruff said: “I have no idea what the future holds.” He said he would be back in 2020 to “see what we’ve accomplished this year and to continue to push the city forward.”\n\n\nThe Smithsonian’s National Museum of African Art (NMAA), the Smithsonian American Art Museum (SAM), and the Smithsonian Design Museum have announced partnerships that will bring more than $", "The next Biennial should be held at least twice a year, with an opening weekend of February 22–March 8, 2020. For the activist group Biennial Atlanta, this means a March 8–11 date, and for Saar Foundation, it means a March 16–March 22 date. Commenting on their decision, Michael Hill and Kenneth S. Dyson, the organizers of Biennial Atlanta, said: We are grateful to the City of Atlanta, the Board of Trustees, and the Board of Wardens, as well as to our artists, curators, scholars, staff, and guests for their consideration. We look forward to welcoming our Atlanta neighbors in 2020. \n\n\nThe Fine Arts Museums of San Francisco (FAUM) and the City of San Francisco have agreed to a $3 million settlement with the California Community Foundation, which was initiated by the nonprofit California Community Foundation, in a lawsuit brought by artist Sabrina Sorokin. The museum’s board of trustees, which had accused the foundation of misrepresenting its contributions and failing to inform donors about the settlement, agreed to remove all references to the $3 million settlement from the museum’s website.According to the San Francisco Chronicle,", "The next Biennial should be held in 2020. The May/June event has been on indefinite hiatus since October 2019, a month after the coronavirus outbreak in China began.\n\n\nThe International Center for the Study of Modern Art (ICSA) in Vienna announced today that its exhibition “A series of texts on top of one another,” Tucana, will return to the capital venue in 2021. The exhibition, which was commissioned by the German state-owned Max Lutzsch and a group of artists, will run concurrently with the 2019 edition.“The exhibition was created as a way to integrate and integrate the two most important theaters of modern art, Vienna and New York,” museum director Ludwig Wiesner said in an update. “The project was planned out for many years and took a particularly complex and long-term form when the pieces were all assembled in a single location in Vienna. The exhibition is therefore a great success and we are very happy with this outcome. The show is also a memory of what we saw in the future, and the future we are seeing.”The exhibition, which was part of the series “Ateliers Situationistes” (1970–1979), is", "The next Biennial should also feature a new exhibition of the work of other contemporary artists such as Damien Hirst, Naguib Mahfou, and Nima Naidu.\n\n\nThe Canadian Council on the Arts (CCA) is urging Canadian governments to recognize the international call for aid and financial relief to help the millions of people forced to flee their homes as the world enters its second phase of climate catastrophe. The April 27 letter from CCA chair Alice Goodwin and fellow commissioners Susan Burns and Wayne Koestenbaum states that the climate emergency has reached a tipping point and that climate-related disasters such as droughts, wildfires, floods, and storms have the potential to become cycles of exclusion and displacement.The letter cites a report from the United Nations that states one-third of the world’s population now faces a climate emergency, and that the world is on track to exceed the 2°C temperature rise limit set by former prime minister Stephen Harper. Given that the climate is warming, and with it the quality of life for millions of people, the letter says it is urgent that Canada take urgent actions to protect the environment and meet its climate commitments.“The climate emergency is not only a global crisis for Canada, but it is a global", "The next Biennial should be held in the spring of 2021. Transport for London, the London and Region Port Authority, and the British Film Institute (BFI) have also expressed interest in staging the event.  Organizers said that the exhibition will include work from thirty-five artists, including Annie Cwynar, Charles Eye, Graham Greene, Percy Jackson, and William S. Burroughs. \n\n\nThe Cairo Art and Architecture Biennial, which was canceled over security concerns over the coronavirus, has postponed it. The fifteenth edition, titled Egypt: The Past, will continue next month, but will now be held at Al-Azhar Stadium in the Egyptian Old City from November 22 to November 26. The event will be held from March 21 to March 25, 2020.The next edition of the event will be staged at the Suez Canal in the Egyptian city of Ismailia from March 28 to March 31, 2020.\n\n\n\n\n\n\nArt and Security, the new exhibition organized by the Museum of Fine Arts in New York, will not be rescheduled for 2020, according to US president Donald Trump. The 2020 event, which was initially set to run from April 6 to April 8, will", "The next Biennial should focus on an exploration of the intersections between art, technology, and the political and economic realities of contemporary life. The first show will take place at the Museum of Modern Art in New York on September 22–26. The curators behind the first show, Hao Jing and Yishan Li, have joined the artists behind the upcoming show at the Contemporary Art Museum Houston, which will be held in the museum’s new downtown location in April 2020, in their endeavor to bring more international art to Houston.The artists’ new project, “Q.U.E.N.” (pronounced “quiet and still)’s inaugural exhibition at the Contemporary Art Museum Houston, which opened in April, will be inaugurated by artist Tarek Atoui. Atoui will be joined by other Q.U.E.N. participants from Abu Dhabi and Bahrain, and will present a solo show at the museum for which the artists will create a virtual reality setting. The show will also include work by the same group that created the virtual reality experience The Oculus Rift,” and will feature a selection of works by the same group as Q.U.E.N.", "The next Biennial should highlight the contributions of women to the art-historical canon and should include a selection of the artists invited to participate in the inaugural exhibition. “Such a retrospective would showcase the breadth and depth of the Biennial tradition, as well as the work of women who are not represented in the current exhibition programs,” said the institution’s director, Francesco Cattan. “Such an exhibition would also allow us to revisit the legacy of the Art Biennial, which has served as a source of inspiration for many women artists of the modern and contemporary eras.”\n\n\nAs the coronavirus continues to spread in the United States and Europe, museums and cultural institutions across the globe are now facing a potential shutdown. The Los Angeles County Museum of Art (LACMA), which was forced to close its doors on March 23 after thousands of visitors in the Disneyland Resort in California contracted the virus, is preparing to reopen next week following the completion of an environmental assessment. LACMA director Daniel H. Weiss told the LA Times that the institution will likely not be able to reopen by the end of April. According to the Hollywood Reporter, the LACMA building will be closed until April 26, making the reopening", "The next Biennial should be held in the spring of 2021. The thirty-fourth Biennial will take place in the summer of 2022. “The Future is Our Future,” the biennial’s opening address read.  The full list of participating artists is as follows: Shai Kattoumadi—The Future is Myself”Masha Gessen—The Future is Mine”Amina Khalili—The Future is Not What It Used To Be”Bibi Konrath—The Future Is Not What It Used To Be (A.K.S.S.T.)Bibi Konrath will begin her exhibition at the Terpsichore, ICC Gallery, at 10 AM on September 8. Kathrin Leibinger—The Future is Not What It Used To Be”Masha Kattoumadi\n\nHannah Wilke, the New York–based American curator who gave exhibitions across the United Kingdom and the United States before she was murdered on October 7, 2018, was found dead at her home on the outskirts of Los Angeles on Friday afternoon. Two weeks later, her daughter alerted the authorities to a potential double homicide.According to the Los", "The next Biennial should be announced by December 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has released a new set of guidelines on how to handle conflict of interest issues in the museum’s new director, Jorrit Taylor.“While we recognize that conflicts of interest can create challenges for an institution, we support the director’s decision to address them only if they pose an unacceptable conflict of interest,” reads a statement issued by MoMA. “In providing these guidelines, we have carefully considered the many issues raised by the new board and know how difficult it is for many of us to navigate the complexities of this new role. We have therefore included language in the guidelines that clearly sets out how individuals may seek to address conflicts of interest in the future.”The guidelines state that individuals may not serve as board members, or participate in internal deliberations, or directly interact with the board or administrators. They also outline three steps that individuals can take to address potential conflicts of interest: • Petition the board of directors; • Write to the board; and • Attend a board meeting.The document states that the first step is a petition to the board of directors, which can be initiated by any person", "The next Biennial should be held in Tokyo in 2021; in New Delhi in 2022; and in Hong Kong in 2023. The project will be based in the museum’s main building, which is currently undergoing a $2 billion renovation. Biennials are currently being held in a number of cities across the globe, including New York (2019), Berlin (2019), and New Delhi (2019).\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Christine Borthwick as its new board chair. Borthwick comes to the museum from the Museum of Fine Arts (MFA) in New York, where she has served as director of exhibitions since 2015. During her tenure at the museum, she curated the exhibition “Fashion” (2019), “Theater of Operations” (2019), “The Runway: Fashion in the Seventies” (2019), “Walking with Strangers: Fashion and the Runway, 1948–1968” (2018), “The Painters: Fashion and the Art of Eunice Miranda Lambert’s Painting” (2018), “Sister: The Artist as Embedded Mother,” (2019), “The Rock:", "The next Biennial should take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Steven P. Jones as its next executive director. Jones will be responsible for overseeing the development of the museum’s collection, which comprises more than 4,500 works, including works by artists such as Margaret Mitchell, Robert Irwin, and Edward Kienholz, and for leading the museum’s design and construction teams.“Steven has been instrumental in shaping MoCA’s architecture and design programs for thirty years, and has made an indelible mark on our community, including many of our neighbors in the East Village,” said curator Matt Wilcox. “As the director of MoCA, he has demonstrated a remarkable ability to adapt and reimagine the museum in order to meet the needs of current audiences and his ever-changing world, and I’m confident that he will continue to shape and reshape the museum as the curators and designers of tomorrow seek to connect and reimagine design with the future.”A curator at the Museum of Modern Art, New York, Jones has also served as a curatorial adviser for Artspace and has curated several exhibitions, including “Intersection", "The next Biennial should take place in 2021–20, with a theme of “Back to Nature” and an open-air museum. The Fall exhibition will be free to the public from April 4 to April 11, 2020.\n\n\nThe Middleton Museum of Art in Bristol, England, has welcomed Katy Winograd and Anna Bikontud to its curatorial team. In addition to becoming the first artists to work in the museum’s permanent collection in more than eighty years, the pair were selected by the institution’s board of directors to represent the United Kingdom at the upcoming Venice biennial.Since its reconstruction in 1977, the museum has hosted over three hundred exhibitions and has welcomed more than seven thousand visitors. It also recently underwent a major expansion, and was awarded a £5 million grant from the Arts Council.\n\n\nThe Yangon Museum of Art in Myanmar (formerly known as the National Museum of Asian Art) is planning to open a new museum in the capital, Yangon, on May 18 and will partner with the Myanmar Arts and Heritage Foundation (MAF) to present a retrospective of the work of the late artist and theorist Htseg Oo. Htseg Oo’s work, which explores the", "The next Biennial should be organized as follows: September 4–October 2, 2020. The sculpture show will be staged in London, New York, and Hong Kong later this year, and will feature the work of forty artists, including Emily Hall, Hsin-Chien Huang, Kelly Link, and Arashiyama, and will take place in the new Pavilion for Contemporary Art at the Royal Academy of Arts in London in 2021.\n\n\n\n\n\n\nArts and Culture Minister Monir Shah announced today that he favours the revamp of the National Galleries of Scotland and the National Galleries of Ireland, as well as the establishment of a new £10 million fund to support contemporary art in Scotland. “Together, these institutions will unite and continue to flourish in the years to come,” Shah said. “I am delighted to introduce new funding opportunities and new public awareness-raising opportunities in Scotland with an eye to supporting the arts in future years.”The minister also praised the National Galleries Ireland for collaborating with the Scottish government on the redesign of the institution, which was completed in 2017. The Institute’s acquisition of the National Galleries of Scotland by the Scottish National Party (SNP) in 2019 saw the", "The next Biennial should be held in the fall of 2020. The Pérez family has long been a part of the city’s art scene. The artist is survived by his daughter, Kate; his son, Bobby; and his grandson, Chase.\n\n\nThe European Court of Art has ordered Turkey to pay a Swiss artist €42,000 ($49,000) in damages for allegedly violating a $74 billion ($86 billion) trade deal that gives European governments a rebate on trade-related civil damages.The German artist Neuer, a Turkish citizen, was actually awarded a discount on his initial claim of more than $65 million, but that claim was later reduced by half after he argued that his damages should instead be determined by a three-member panel. The court found that the Turkish government had violated Article 8 of the Comprehensive Economic and Trade Agreement (CETA)—a move that will see the country lose out on more than $32 billion in trade-related revenue annually—by imposing a 30 percent tax on goods that enter Turkish territory, and that the government had violated the agreement by attempting to enforce a thirty-percent tariff on certain products between 2015 and 2019.“The court found that the Turkish government had violated Article 8 of the Comprehensive", "The next Biennial should include the work of the fifteen new works that are currently on display in the exhibition. “The exhibition ‘Unfinished Business’ constitutes a moment of the contemporary developing, a moment of historical and social significance,” said Archiv Miro. “The exhibition is a symbol of our time and a reflection of our world. Its completion will be a milestone in our history.” The exhibition begins on October 29, 2020 and will run until January 31, 2021.\n\n\nThe Merion Center in New York has appointed Melissa Aitken as its new associate curator of European art. Aitken will be responsible for organizing programs that engage with both the history of modernism and the art of the twentieth-century. “Melissa has done a fantastic job organizing and carrying out this exhibition, and we are deeply grateful for her work,” said Kelly Reichard, director of the Merion Center. “Her curation is a joy to behold and an inspiration for our art-loving and contemporary community. She is a teacher, a mentor, and a champion for the art of the twentieth-century.”During her tenure, Aitken will work with", "The next Biennial should take place in 2021, with the exhibition marking the 50th anniversary of the museum.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $2.5 million donation from the William and Flora Hewitt Foundation. Timothy Hewitt, who passed away in February 2019, gave the institution $1.5 million in support of the museum’s new collection, “The Complete Elizabeth Barrett’s Art & Artifacts,” which will be on view in September. The gift comes a year after the foundation donated £0.75 million to the museum to pay for the construction of a new $54 million facility, which will be located on the former site of the former Hewitt Labs, in the hopes of increasing the museum’s holdings of the artist’s work. “Tim is a remarkable and generous benefactor,” said museum director George Losch. “I’m amazed that I’ve had the opportunity to help him grow his extraordinary legacy. I’m grateful for his generosity and vision. I’m proud to have contributed to the legacy of one of the great painters, and to have worked with Tim to shape the", "The next Biennial should be held at the city’s Arts and Culture Center in the fall of 2020, but the date has yet to be set.\n\n\nThe Solomon R. Guggenheim Museum and Foundation in New York has appointed Mandy Stroud as its next executive director. Stroud currently serves as director of public relations at the New Museum in New York. She succeeds Lynda Barry, who retired last month after more than two decades at the helm of the institution.“Mandy’s leadership, deep experience, and enthusiasm for the Guggenheim’s mission make her the perfect leader to guide the Guggenheim’s future,” said director Alexander Stern. “Mandy brings a dynamic intellectual and emotional approach to managing diverse audiences and evolving our exhibitions, public programming, and educational experiences while strengthening the Guggenheim’s collection and exhibitions. She is eager to take on new challenges and to expand the Guggenheim’s audience with an exciting new exhibition and exhibition program.”Prior to joining the New Museum in 2007, Stroud served as director of public relations for the Los Angeles County Museum of Art (LACMA), where she oversaw press and public relations", "The next Biennial should take place in 2020, and the first in 2021. Its next chapter will examine the legacy of the late American artist and thinker Robert Irwin. Its next exhibition will focus on the legacy of the late American Jewish artist Irving Gabllo as well as the legacy of the late American architect Frank Gehry, whose work is celebrated both for its groundbreaking impact on design and its radical ideas about architecture.\n\n\nAfter the museum’s renovation project, which involved the installation of nearly 7,500 new works, the American Federation of Arts (AFA) announced that it will award the $10,000 Lifetime Achievement Award to the Jordanian-born, Los Angeles–based artist Hisham al-Hashemi, the winner of the prestigious $35,000 Hirshhorn Prize. The twenty-first century’s most prestigious award, which honors a living artist, was presented by the Hirshhorn Museum in Washington, DC, last year and has been presented annually since 1997.Hisham al-Hashemi’s work, which addresses themes of history, religion, and culture, was selected by a jury comprising art historian and fellow AFA alumnus Daniel H. Weiss; art scholar and curator Karen Finkel;", "The next Biennial should be held in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed David Schäfer as its new deputy director. He is currently the director of the Metropolitan Museum of Art in New York and was previously the director of the Sargent’s Circle in London.“David is an accomplished curator, a brilliant thinker, and a devoted friend,” said Edward Aschoff, the director of the Sargent’s Circle. “His passion and talent for the art of making things are unmatched. He is the perfect person to lead the Sargent’s Circle into the future, and to continue to strengthen the museum’s relationship with the communities it serves.” Schäfer comes to the institution after twenty-six years at the Museum of Modern Art, where he has been the director of exhibitions, public programming, and research partnerships since 2009. He is also the author of “The Art of Making Things,” and will assume his responsibilities on January 16.“I’ve been a fan of David Schäfer for twenty-six years, and I’m very proud to work with him,”", "The next Biennial should be held at the Venice Museum of Art, in May 2020, and will feature the work of forty artists and will run until May 27.\n\n\nViaFilm, the Chicago-based nonprofit that supports artists through its Picturehouse in Woodlawn, Illinois, has received a $50,000 grant from the Robert and Melinda Gates Foundation. In support of its Artist-in-Residence program, which has supported more than 6,000 Chicago artists since its inception in 2010, the foundation has set up a $100,000 prize for Mayan artist Lorenzo Bianchi.The grant also provides $50,000 for the US artist’s residency at Art Basel Chicago in February 2020 and $100,000 for projects that were proposed by artists in the Biennial Framework Series. Based at the Art Institute of Chicago and curated by John Archibald, the prize is one of the largest, if not the largest, in the Foundation’s history. The Artists’ Short-Term Residency (ASTRs) program, which has supported artists in their homes for a year or more, will also receive a $50,000 grant from the Gates Foundation.", "The next Biennial should be held at the Museum of Fine Arts, Philadelphia, in 2021. \n\n\nThe CalArts Library in New York is reportedly working on a new edition of the American artist’s landmark exhibition series, “Between the Sun and the Moon,” which was staged in both Los Angeles and New York City between 1967 and 1975. Made possible with funds from artist donors, the project was launched by artist-in-residence Harrison Berger’s nonprofit, American Artist’s Legacy.“The museum is actively revisiting this period in American art, reinterpreting the works in order to make them relevant to the present and future,” Berger said in a statement. The exhibition will also include a new digital platform designed by the artist, which will allow visitors to study the work of one of his own artists’ previous works on display, as well as works by contemporary artists and critics.The partnership between American Artist’s Legacy and the Library of Congress will allow the museum to present the series in a different form, which will be called an “art museum.” In the future, the arts institution will have the option to transform its location and the actual exhibition into a �", "The next Biennial should take place at the Museum of Fine Arts in Boston, Massachusetts; the first in Los Angeles; and the first in New York. Museum of Contemporary Art (MCA), New York: The institution has previously held collaborations with the Philippine artists Pia Camargo and Elda Radic. The exhibition will be hosted by the museum in 2020. \n\n\nThe Los Angeles County Museum of Art (LACMA) has been given a $25,000 grant from the Los Angeles–based Los Angeles–based Creative Artists Relief (CAVR) to help it with its first major overhaul since it closed in 1958. The new $97 million building, which will be located at 5300 North Santa Monica Boulevard, will be more affordable and will feature more galleries, a restaurant, and a film theater. LACMA director Michael Arone told the Los Angeles Times that the project will help LACMA in a number of ways. First and foremost, it will help LACMA continue to attract and present the artists who have made Los Angeles County the country’s epicenter for experimental, experimental, and experimental art. “It’s important to remember that LACMA", "The next Biennial should be held in 2022, and the final in 2023. The museum will also expand the footprint of its new Capitol Hill campus, which will boast 20,000 square feet of exhibition space, a student lounge, and an auditorium. The building will also include a public courtyard and an outdoor plaza where the museum can present the exhibition “The Watershed: The Visual Arts of Mary Beard.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has received a gift of eighty rare photographs by Pierre-Auguste Renoir from the artist’s widow, Edith Renoir (1901–1973). The works, which were acquired through a joint venture between MoCA and the Italian family of the same name, were given to the institution by the widow and the artist’s son, Maxime.The gift includes thirty-two photographs acquired by Maxime Renoir in Paris in 1971 and 1972, as well as twenty-six photographs acquired by the family in Rome in 1975 and 1976, and fourteen photographs acquired by the artist in Italy in 1986 and 1991, respectively. The collection was acquired by Edith and Maxime Renoir in 2010.“By combining art and architecture, Renoir creates an", "The next Biennial should focus on a long-overdue rethinking of the relationship between art and science, with a view to making the humanities and the sciences more eclectically inter-connected and more accessible to the widest possible audience. I hope that this exhibition will give us a glimpse into the future of research and art at the University of California, Berkeley.\n\nThe Louvre has appointed historian Khaled al-Maari as its new director. He is currently a doctoral candidate in history at the University of Cambridge and will take up the post on November 1. Al-Maari joins the museum from the University of Maryland, College Park, where he has served as a senior curator since 2015. Al-Maari is the author of a number of books and scholarly works on medieval art and architecture and has published articles in a number of academic journals. He is the author of The Art of War: Architecture and the Modern Middle Ages in Italy in the Sixteenth Century (Human Rights Books, 2019) and The Art of the Church: From the Occult to the Christian (New York: Guggenheim, 2018) among other books.Al-Maari succeeds Anneke Sievers, who retired after nine years at the helm of the", "The next Biennial should take place in 2021. The event will take place in the Grand Salon of the Museum Tachô, in Tachô, Tokyo, and will run from February 21 to February 25, 2021.The twenty-fifth and twenty-sixteenth editions of the exhibition were presented by the Soka Gakkai International Art Gallery in Tokyo and the Museo de Arte Contemporáneo de São Paulo. The works featured in the exhibition will be presented in the twenty-second edition, which will be presented in the years 2021 to 2023, in 2020. In the third edition that will be held in 2019, the artist and writer Harry Callahan will present a discussion about the exhibition.  Called “Collective Studies,” the show will feature a selection of work by the likes of Ada Calon, Iwan and Iennie Cunningham, Mary Kay Letourneau, and Meryl Streep.“From the outset, it has been our intention to present a show that explores the collective essays of a surprising range of artists,” said Director Rie Kneebone. When asked about the upcoming show, Kneebone said: “We want people to see these", "The next Biennial should be held at the same time as the upcoming exhibition. The two events will share the same space for a few weeks, and the new exhibition will be staged at the Museum of Contemporary Art Chicago. According to a statement on the new exhibition, it will not be a “graffiti” show, but rather a “new kind of art, rooted in principles of architecture and in the ongoing encounters between the body and the environment.”The exhibition, titled The Age of Mechanical Reproduction, will be on view until January 26.\n\n\nThe Museum of Contemporary Art Shanghai (MCA Shanghai) has announced that it is preparing to welcome visitors once again to its new venue in the Tadao Ando District of Shanghai on January 28. The reopening of the museum is part of a larger plan to modernize the institution, which was completed in 2013 and is located on the 21st floor of the Yuz Museum of Modern Art in Nagoya. The building, which has a 25,000-square-foot lecture theater, a bookstore, and a café, is being renovated by architect and architect Mihai Naidoo. The renovation, which is being overseen by the MCA Shanghai, is being carried", "The next Biennial should be held in the spring of 2022. It will gather together around twenty artists, architects and designers from twenty-six countries. The event will be hosted by the MAXXI Museum in Venice and will take place in the Venetian town of Giardino Rosso, Italy, and will be guided by Architecture Università di Stampa. The exhibition will be sponsored by M++Art, M+Art, M+Art Venice, and M+Art Group. Artistic director Paolo Rondinotti has said that the event will aim to invite visitors to become more connected to the environment around them.Rondinotti said: “The theme of the Biennial is to create a new, contemporary, and synchronous connection between people and the environment. We will strive to develop a new art of architecture, to reshape the rules of art and architecture to give people the possibility to live, work and think in the space of an art museum. This is an opportunity for M+Art and M+Art Venice to collaborate with our artists, our clients, and with the architects in order to create a new cultural space.”\n\n\nThe Museum of Contemporary Art (MoCA), Los", "The next Biennial should be held at the San Francisco Museum of Modern Art in 2020. This year’s iteration of the festival, titled “Spectres of the Fall” and curated by Julián Zúñiga, will feature work by ninety-nine artists. “The next edition of the Berlin Biennale will take place in the city of Berlin. It will be an epicentre for the spirit of creativity and art in a city previously known as the cradle of art,” said Berlin organiser Joachim Neugroschel. “The Berlin films are ready. The Berlin 2020 Film Festival will be held at the Berlin Film Festival in 2021.”\n\n\nThe museum in Boston that is currently closed after the pandemic because of Covid-19 has renewed its contract through the end of 2020. The extension, which will extend the museum’s programming through February 22, means that the museum will be able to host more films, events, and other programming during the pandemic’s final months.The extension was made possible by the reopening of the neighboring Museum of Art, which has been dormant since March 19. Before it reopened in early April, the museum had already", "The next Biennial should be held in 2021, after the biennial is already canceled this year due to the flu pandemic. In the meantime, the sculpture program at the museum has had several grants canceled by the government of the Federated States of Micronesia. The International Center for the Study of the African Diaspora in New York has received a $3 million donation from the United States government; a $2.5 million gift from France; and a $1 million gift from Italy, which will provide $1.5 million. The PRC-backed Museum of Modern Art in Beijing has also been criticized for promoting a 17-foot-tall bronze work by the late Chinese painter Huang Yikai, a separatist revolutionary believed to be a co-editor of the Chinese Communist Party newspaper the People's Daily, in a 2015 exhibition organized by the Beijing Opera House.Li Qiu, who directs the biennial, told China Film Insider that the government was concerned about “how this exhibition will be perceived by the public, and also by the political level,” and had instructed the museum to “work in a manner that would avoid any negative impression.” The exhibition was canceled due to the coronavirus,", "The next Biennial should be in 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it has given the green light to the Metropolitan Museum of Art (MoCA) and the Museum of Modern Art (MoMA) to open their new locations in 2019. The agency also signaled that it expects to begin accepting visitors by the end of 2020. The DCLA also recently released a report on its “Metropolitan Museum of Art and Atlantic City” that found that, while the museums are working to implement ways to reduce the pollution that is released into the environment, they are not eliminating it. Instead, the report says, the museums are working to balance the need to maximize safe operations and to adapt to local needs and environmental needs.The Metropolitan Museum of Art is planning to break ground this spring to begin welcoming visitors by the end of 2020, and the museum has already begun soliciting donations for a new building and has received $2 million in grants from the David D. Weinberg Foundation and the Rosenfeld Foundation. In addition, the museum has announced that it is working with the nearby Yeshiva University to create an outdoor space that will offer more accessible exhibitions, educational initiatives, and public programming as part of a", "The next Biennial should be held in 2020.\n\n\nThe Honorees of the Order of Canada have been announced for the seventy-third edition of the Artists’ Corner. The honorees are Mike Kelley, Aparna Narsia, Robyn Thomas, Gabriella Pica, and Josue Peirowitz. The biennial, which will focus on the contributions of Indigenous and non-Indigenous artists to the creation of artistic and cultural expression, will also draw from material within the Artist’s Corner.The biennial will explore Indigenous knowledge through the study of authentic materials, including artworks and their historical connections to the land and its peoples. The theme will be “The Land and the Art of the Past.” The 2020 edition will be held at the National Gallery of Canada in Ottawa. The biennial will culminate with a reception for an audience of fifty artists from twenty-five countries.\n\n\nThe National Gallery of Art (NGA) in Washington, DC, has received a gift of more than 200 works by artists whose work was previously unreleased. The donation, made by an anonymous benefactor in honor of the institution’s 150th anniversary, includes works by more than thirty-eight artists", "The next Biennial should be held in the spring of 2020. \n\n\nThe B.B. King Center for Arts and Culture (B.B. King Center) in New York City announced today that Alice Christovale will serve as the 2020 and 2021 B.B. King Center Curator of Contemporary Art. She will take the helm of the institution from Ryan Lanza, who will retire on January 6.While at the B.B. King Center, Christovale helped shape the curatorial agenda of the museum’s various programs, including Art of the Party, which is currently on view, and “A Celebration of Life and Dance” (2019), which will be on view in January 2021. She also curated “Musical Technologie” (2017), a show documenting the development of the new medium of music, and “The Nest” (2018), a series exploring the concept of history at the center.In the future, Christovale will become a senior curator of contemporary art at New York’s Museum of Modern Art, where she will work alongside Laurie Anderson, the director of the museum and former head of the contemporary art program, and Craig Butler, a curator and cofounder", "The next Biennial should be held in the Spring 2019.\"\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has launched two new initiatives to support the local arts. The first, the MoCA Artist in Residence program, was established in 2016 to help support contemporary artists and gives $1,500 to any artist who lives within a one-mile radius of the museum. The second initiative, MoCA Creative New York, was launched in 2017 to provide free programming to cultural workers in the city.Ahead of the inaugural exhibition, titled “The Room,” which will run from March 21 to 27, 2019, the museum is expanding its list of participating artists. “The Art of Unfolding,” which will highlight the work of forty-five artists in the city, was selected as one of the seventy-four featured works at MoCA’s 50th anniversary celebration, which took place on December 6, 2018. The artist-in-residence program will provide artists with $500 grants. The deadline for applications is March 10. The residency program will provide $250 grants for individuals who live within a one-mile radius of the museum.\n\n\nThe Smithsonian American Art Museum (SAAM) in", "The next Biennial should feature three new works by the artist, including a reworked version of a portrait of the late American Jewish scholar Irving Kristol that will engage in a discussion of Holocaust narratives and the concept of a shared history. The exhibition will also include a selection of twenty-one works by the artist that were previously on display at the Biennial, which opened on March 5 and runs until March 11. The biennial’s next edition, titled “The Blind Muse,” will take place at the Museum of Contemporary Art (MoCA), New York, in September.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has appointed Paul Graham as its next director. Graham first joined the institution as its chief curator and senior curator in 2004. He has since guided the institution through a number of major revamps, including the redesign of the museum’s building and renovation of the former Kent State University building at the intersection of Mission and Candlestick, and the installation of more than forty works by artists, including James Turrell, William Wordsworth, and Ed Moses.In his new role, Graham will take up the post in August. The announcement comes a month after SFMoMA released its redesigned and expanded", "The next Biennial should take place in 2022. In a statement, the museum said: “It is an exciting time to be alive, to be alive with life, and to be alive in the most expansive and expansive ways. Our hope is that by sharing the most recent work of the biennial, we will inspire to think, to speak, and to act in ways that will benefit the biennial and the many artists and visitors who will participate in the next iteration.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it has received a gift of thirty-six works by twenty-six artists from the collection of Peter and Eunice Kennedy Shriver, the famous feminist philanthropist and art historian. The works were donated by Devorah Lewis, Samantha Scharf, Alysona Bugliosi, Nora Roesler, and Sharon Stone, a trio of Ruth L. and Donald W. Truett artists whose work was included in “Live or Die” (2018), “In the Time of Death” (2017), and “The Silence of the Dying” (2016). The works were donated by the Kennedy Family, whose remarkable", "The next Biennial should take place in 2022 and will be hosted at the Haus der Kunst in Frankfurt, Germany. For the March event, the museum will stage a number of exhibitions and a number of concerts, including a “social impact” exhibition, “There is a time to be alive,” and “Ara-Ra: A Biennial to Remember.” The December event will conclude with a “hailu to the king,” which will mark the end of a “wonderful and inspiring year.”\n\n\nThe Pérez Art Museum Miami (PAMM) has received a $175,000 donation from the Philip Rogers Foundation. The donation comes on the heels of $110,000 from the Riggs family, which also gave $125,000 to the institution in 2017. PAMM director and CEO Matthew Lubell announced the gift on the museum’s website, saying: “Philip Rogers was an extraordinary philanthropist, and his generosity and passion for PAMM made him and his family the ideal choice to host this fifty-fifth anniversary celebration. We are grateful to Hu, Laura, and Ronald for their leadership in transforming PAMM into", "The next Biennial should take place in 2021. \n\n\nAs the United States prepares to welcome 65 million visitors to its national parks tomorrow, the National Park Conservation Association (NPCA) has released guidelines for how museums and other public spaces can reduce the park population through conservation practices.The National Geographic Society’s proposed $3.3 billion expansion of its Grand Canyon will only exacerbate existing park problems, the authors of the new conservation landscape-protection guidelines write. With more than two dozen new recommendations for museums, the 101-page document outlines how to conserve natural features, reduce crowds, improve accessibility, and conserve historic sites and monuments.The recommendations address park-specific issues such as how to store and display works and recommend activities that minimize crowds and encourage social distancing. While the National Geographic Society says it has come up with the best conservation practices for every park, the guidelines say that the park administration should collaborate with stakeholders to identify conservation needs and strategies for achieving desired park outcomes.For Grand Canyon State Park, the guidelines recommend maintaining at least 1,100 trees and at least 35 percent of the park’s historic plant and animal life. They also call for the construction of a bridge over the park’s Black Canyon", "The next Biennial should take place in 2021. Cultural historian and curator Marnell Levey has also been suggested for the position of director of the Biennial.\n\n\nThe Tate’s board has voted to remove convicted murderer Peter Mandelson from its membership, after he was forced out of the organization after he was caught on video kicking a Black actor during a televised performance in 2001. The move came after a number of former employees claimed that Mandelson, who died of his injuries last year at the age of seventy-nine, was racist and anti-Semitic.“Mandelson was a white supremacist and a misogynist who was anti-Semitic and anti-Black,” Paul Mpagi Sepuya and Ali Watkins, the former directors of the Tate, wrote in a statement. “Tate is an institution that celebrates and protects the work of Black and African artists, and we will now work to ensure that his legacy lives on in the museum as a beacon of humanism and diversity.”The board made its decision after a ten-month review, which concluded that after an “unfounded allegation by a subordinate,” Mandelson was removed from the board on September 3, 2019, “due to his", "The next Biennial should be held in 2020. Wallach is open to ideas for the next iteration of the exhibition and invited architects, artists, and academics who have been influenced by the work of the Biennial's artists and curators to submit their visions for a new exhibition. Luther Graham, Yale University, and the artist Gertrude Stein, who is known for her works that include Paintings from the Biennial’s Collection, are among the curators whose works are currently on view in the exhibition.\n\n\nArtPrize, the international award program that honors emerging and established American and European artists, has named Felix Baumann director of its biennial, “Theory and Context.” Baumann, who will assume his post after the 2020 exhibition, which will take up topics including painting, sculpture, performance, and video, was nominated by James D. Higgins, chair of the exhibition jury and the Biennial’s artistic director, and the judges, Tanya and David Kremer, Nymana Pindell, and Pamela Adler.“Felix’s vision to create a new space for theory and community has been central to", "The next Biennial should take place in 2020 and will take place at the Art Institute of Chicago (AIC) in Chicago. The first edition of the exhibition, “The Many Faces of J. M. W.” (2016–17), was staged as part of a series titled “Unseen” (2015–16) that sought to reimagine the hallowed space of the Biennial. With the help of artist Paul C. Hilderbrandt, the exhibition was inspired by the concepts of “illusion and form,” “parasites and saviors,” and the “end of the world.” The pavilion will be constructed in the current 111,000-square-foot facility, which was renovated by the AIC for its first triennial in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Patricia M. Oehler as its next director. She succeeds Edward Conant, who departed after a year to head the Massachusetts Institute of Technology (MIT) in Cambridge, and will begin her new position in January.“In her new role, Patricia will play a pivotal role in ushering the MFA through its next chapter,”", "The next Biennial should be held in the spring of 2022, and the first one in the autumn of 2022. The 2019 and 2018 editions of the exhibition were staged by the Guggenheim, and were shown in various formats, including video, audio, and print, respectively.The biennial, which was organized by the Guggenheim in partnership with the Swiss Federal Office of Culture, will be hosted in the Guggenheim in the new Swiss Federal Office for Culture (Bochenwalde), located on the ground floor of the museum in a historic building in Bern. The renovation project, which is estimated to cost some $100 million, was completed in 2017 and was inaugurated by the Nürnberg Biennial in 2018. Focusing on the origin and evolution of art, the exhibition also featured work by artists such as Paulo Freire, Mirko Wijsserman, and Wangechi Mutu and was directed by Nadi Zeid.Inaugurating the new exhibition is a new collection of drawings by the artist Michael Kidane, titled “The Last Days of the Four Nations,” which will be presented by Nadi Zeid in December. The exhibition will also include a new section on the history", "The next Biennial should take place in 2020 and is said to be a joint venture between ART and the University of the Arts.The announcement follows the announcement of a new partnership between the two institutions, announced earlier this month, to create a platform for the sharing, research, and exchange of art in a way that will enable people from all over the world to be inspired and engage with art. The platform will work in concert with the institution’s new campus in the middle of the city, Art of the Future, and will be constructed and managed by the University of the Arts, London. The London-based firm of Grafton & Partners, which has worked on the project for more than a decade, will be responsible for designing and constructing the building.The platform will offer visitors a virtual tour of the exhibition space, will feature new works by artists such as Yoko Ono, Krzysztof Moczko, and Barbara Kruger, and will be inaugurated by a virtual exhibition by Canadian artist Ted Ho, a solo artist from New York City, at the gallery. The show will be repeated on the Biennial’s campus in 2021 and will run for two weeks, from August 4 to August 7,", "The next Biennial should be presented in 2020.\n\nThe Danish artist Thorkild Pedersen was appointed curator of art at the second edition of the Dusseldorf Biennial, which will take place in 2021. Pedersen will begin his curatorial career by working as a curator in the Danish Museum in London. Pedersen is also a trained artist, whose practice spans sculpture, performance, photography, painting, jewelry, and sculpture. His work has been exhibited at the Venice Architecture Biennale (2015), the Museum of Modern Art (2016), and the Museum de la Barca (2017).“It is an immense honor, especially since my first exhibition here was organized by the Danish government in 2002, as a part of its commitment to the Copenhagen Art Museum,” Pedersen said in a statement. “I am very excited to return to the museum as the first curator of the newly commissioned exhibition ‘The Bodies of Art’ in 2020.”\n\n\nThe Michigan Museum of Contemporary Art (TMCA) in Ann Arbor has appointed Suekichi Nakagawa as its next director. Nakagawa comes to the institution from the Museum of Contemporary Art in Japan (MCA Japan) in Tokyo. He", "The next Biennial should launch at least one month after the end of the first, with the exhibition of the work of the other work immediately preceding it. “The first Biennial should be a powerful statement of the future of New York,” said Kenneth W. Greenberg, chair of the museum’s board of trustees. The museum will also receive $2.35 million in revenue bonds, and the city of Brooklyn will receive the rest of the proceeds from the obsolete buildings. The most recent iteration of the museum, “10,000 Leagues Under the Sea,” opened to the public in 2016. \n\n\nThe Jordan-Hassan Museum of Art (JHMA) in New York has received a gift of fifty-seven works by the Lebanese artist Zaki Nouri. Nouri’s estate, in partnership with the Jordanian-born, Paris-based artist Matthias Krummel, acquired the works from the Lebanese city of Tripoli. Nouri’s widow, Fatta Nouri, was instrumental in their acquisition, as was her brother, Herat, who was originally from Kafr Laja, where Nouri grew up and also worked as an artist.According", "The next Biennial should focus on identifying and understanding the structural elements of institutional racism through the work of anthropologist, scholar, and activist Lucy Akern, who is working on a new series\u0097her first book, The Beauty Myth: Race, Culture, and the Empire of Illusions (Yale University Press, 2019), will address the years leading up to the movement against the Vietnam War and its legacy. In the meantime, the Institute for African Studies (IAS) at the University of Oxford has announced that it will be reorganizing to address the changing needs of an increasingly diverse and interdisciplinary field. The new organization will focus on developing a new set of institutional and institutional-level principles, known as Numeracy for Africa, in line with a new set of interdisciplinary research agendas and a new set of international relationships. The IAS’ new role, which was created by a merger of the South African Studies Association (SASA) and the University of Cape Town’s Department of African Studies, will be inaugurated by an exhibition of works by twenty-three African artists. The list of contributing artists is as follows:Amanda Evans-Pereira (New York)Gabriel Benito (New York)", "The next Biennial should mark the beginning of the next phase of the art world’s transformation: a transition that will encompass the creation of new experience spaces, exhibitions, and public programs. The theme of the 2019 edition of the Biennial is “Conflict,” and its theme is the conflict that currently affects the art world. The exhibition will also feature works by Hannah Wilke, Ubald de Kooning, and Peter Wächtler, as well as works by Jannis Kounellis, Dara Kudacki, and Kiki Smith.Participating artists will be announced soon.\n\n\nThe Neue Galerie in Vienna is for sale. It reopened earlier this week, following a major expansion, but the new building, completed in November, is in a state of disrepair. The renovation amounts to a complete overhaul of the institution, which opened in the former office of the automotive manufacturer in 2001, and of the Neue Galerie. The exterior of the complex features new glass, steel, wood, and aluminum for the building’s interior, as well as new lighting, sound, and electrical systems. According to the New York Times, the new building also boasts of new", "The next Biennial should be held in 2021. \n\n\nSome three hundred artists, artists-in-residence, and teachers have signed an open letter demanding that the French government invest more than $1 billion into France’s cultural sector in an attempt to mitigate the country’s economic collapse.“The Parisian Museum of Modern Art, the Louvre, the Musée d’Art Moderne, the Palais de Tokyo, the Palais de Tokyo, the Palais de Tokyo, and the Pantheon in Paris are some of the institutions that have recently suffered structural damage or are at risk of collapse due to the ongoing financial crisis,” reads the letter. “The current situation has also affected the galleries and the larger cultural sector in a negative way, since the crisis made it impossible for them to raise funds for long-term projects and to invest in the future. This has also affected the professional staff of these galleries and made it difficult for them to stay afloat financially. As a result, the letter authors believe that more than $1 billion should be allocated for cultural institutions during a four-year budget cycle, instead of continuing to fund them with emergency funds.”The letter was written by the artists who", "The next Biennial should be held in 2020, and a new exhibition of the art of Southern California will open in 2021.\n\n\nThe Alaska Museum of Art (AlaskaMAA) is launching a new digital platform dedicated to the art of social justice. The platform will feature work by ten artists whose work is currently on display in a forthcoming exhibition at the museum. The show “Growing Up Black: Art in the Age of Lyndon Johnson” (2016–17) is the first of a number of new programming initiatives the museum will undertake in order to better engage with local communities and the broader public.“We are very excited to launch this platform and to launch additional learning opportunities for our audiences through the MAA’s new digital platform and the future exhibitions that we have planned,” said museum director and CEO Alistair D. Kitschke. “We are also very proud to present work by these ten artists and their families. We are grateful to our local and regional communities and to the public for taking a moment to consider and consider this work, which continues to challenge us to consider and think about the ways we can be more inclusive, more engaged, more connected, and more just.”\n\n\nThe Institute of Contemporary", "The next Biennial should be announced as early as this month. In the meantime, the Biennial has established an online petition in order to encourage Bienen to extend the deadline for its 2018 edition to February 20.The full list of participating artists is as follows:Helsinki Biennial (Finland)Bienen Biennial (Germany)Bienen:1925 (Finland)Bienen:1931 (Finland)Bienen:1943 (Finland)Bienen:1963 (Finland)Bienen:2017 (Finland)Biennial of Helsinki (Finland)The Biennale of Helsinki (Finland)The Art of Helsinki (Finland)The Art of Helsinki (Finland)The Art of Helsinki (Finland)The Art of Helsinki (Finland)The Art of Helsinki (Finland)The Art of Helsinki (Finland)The Art of Helsinki (Finland)The Art of Helsinki (Finland)The Art of Helsinki (Finland)The Art of Helsinki (Finland)The Art of Helsinki (Finland)The Art of Helsinki (Finland)The Art of Helsinki (Finland)The Art of Helsinki (Finland)The Art of Helsinki (Fin", "The next Biennial should be held in 2021.\n\n\nThe National Association of Theater Arts (N.A.T.A.) has recruited two new curators to its board of directors: former New York City deputy commissioner of cultural affairs and curator Mark Borthwick, who is currently a doctoral candidate in performance studies at the University of Chicago, and Emily Green, who currently serves as a professor of art at the School of the Art Institute of Chicago.Borthwick, who is the founder of the experimental and experimental arts program at the nonprofit ArtsWorks, is the founder of the biennial, which will showcase work by thirty-five artists and will feature artwork by fifty-two artists, including well-known names such as R.E. Maudslay, Anthony DiMeo, and Paul Gauguin. Green will work with artist-in-residence Amber Hunter on a new series of performances, which will be curated by Hunter and the artist-in-residence Erica Henderson.“Mark has been a passionate advocate for the N.A.T.A. for more than twenty years and has been instrumental in shaping the institution into one of the most robust and respected cultural organizations in the United States,” said N.A", "The next Biennial should be held sometime between May and September 2019. The twentieth will be held in October 2020. The twenty-fifth will be held in December 2021. The twenty-sixth will be held in March 2022. The twenty-seventh will be held in March 2020. The twenty-eighth, which will be held in March 2021, will be hosted by the Museum of Contemporary Art, the Museum of Modern Art, and the San Francisco Museum of Art. The twenty-ninth will be held in May 2021. The twenty-tenth will be held in May 2021. The twenty-fifth will be held in March 2022. The twenty-sixth will be hosted by the Museum of Contemporary Art, the Museum of Modern Art, and the San Francisco Museum of Art. The twenty-seventh will be held in March 2022. The twenty-ninth will be held in March 2021. The twenty-fourth will take place at the Museum of Contemporary Art, the Museum of Modern Art, and the San Francisco Museum of Art. The twenty-ninth will be hosted by the Museum of Contemporary Art, the Museum of Modern Art, and the San Francisco Museum of Art. ", "The next Biennial should be held in the spring of 2022. The 2019 edition, “The Short-Fuse: The Art of the Biennial” was staged at the Museum of Modern Art, and the 2018 edition, “The One-Sided Triangle: Art, Politics, and State Politics” was on view at the Musée St Louis.\n\n\nThe Corsican artist, whose work explores the relationship between painting and sculpture, has won the Prix Légerie des Hautes Études (the prize for the best new work) at the Venice Biennale. Each year the prize is awarded to a French artist based in Paris, and the first-ever winner of the honor, Hélio Oiticica, was selected by a jury that included French curator Christiane Cima, the director of the Institute of Fine Arts in Paris; Sylvia Guar and Carlo Cattelan, the owners of the Italie, Paris; and Joff Le Duyne, director of the Center for Modern Art in New York.The jury then elected three other winners: Benoît Mercier (France), Alfred Koons (France), and Wangechi Mut", "The next Biennial should take place in 2022 and will be hosted in Milan. After a public campaign, the museum’s director, Silvio Cicutto, will resign in February 2022 to take up a new post as president of the city of Rome. The exhibition will be presented by the Madrid-based curator and architect Soraya Naidoo and will be curated by Ana Mendieta. “The European Contemporary” is again being hosted by NADA in Rome and will be staged by artist-in-residence Ivan Albright. The exhibition will be organized in cooperation with the Museo de Arte Contemporáneo di Rome (MASI) and the Museo de Arte Contemporáneo di Rome (MAP), as well as with the Italian city of Lugano. The exhibition was selected by an international panel made up of Ivan Albright, Fabio Brugnaro, Ingrid Boccato, Steven Knight, Rene Maghery, and Vittorio Marini. The list of curators is as follows: Artists: Niles Akram, Articles of Florence", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), California, has announced its selection of the works of twenty-one artists for its ninety-fifth edition. The exhibition will take place at the California Institute of Technology (Caltech) from March 15 to March 17, 2021. This marks the twentieth anniversary of the show which was established by the California Institute of Technology (Caltech) in Pasadena, California. Among the works selected for this edition are David H. Christo, Cagee C. Hackett, Ronald A. Rozier, and Janet A. Alexander. The biennial will coincide with the centenary of the outbreak of World War II, the centenary of the founding of the Carnegie Museum of Art, and the centenary of the first US president, Harry S. Truman. This year’s edition of the show, titled “Terminal Drama,” will feature work by twenty-one artists working in all four corners of the globe. Among the works selected for the show are Catherine O’Leary, Rory Mulligan, Michael Chabon, and Ryan Lee. The 2019 show featured work by ", "The next Biennial should take place in the coming months, and we look forward to welcoming you to the Museum.\n\n\nLichtenstein & Bacher, now represented by Pascal & Bacher, announced today that they have merged with the German company Thyssen Kunsthalle. The news comes on the heels of the announcement that the partnership will be terminated in June.Disputes over the sale of works by artists such as Kurt Guehn, Clara Guggenheim, and Erich Pfeifer have prompted protests from some collectors and left museums scrambling to settle pet projects. In a statement, the company said: “Due to the widely varying interpretations of the memorial question, this merger has nothing to do with the owner of the rights to the works. The company is preparing for the possibility that the works may end up in the possession of different parties. The company therefore wishes to keep their ownership of the works private. In any case, the decision does not impact the object of the merger and the works will continue to be offered at the same price.”In an attempt to address the growing number of disputes surrounding the ownership of works, three years ago the German state parliament passed a law that allows museums to terminate a long-term contract", "The next Biennial should be held in late-November.  The 2014 event, entitled Once Upon a Time in the City of New York, was organized by the Museum of Modern Art (MoMA) in partnership with the Metropolitan Museum of Art (MoMA), and featured works by artists such as Horace Grant, Joseph Beuys, Ross Bleckner, and Charles Duncan.  The biennial also featured works by artists such as John Edmonds, Paul Gauguin, Jeanne-Claude, and Ed Ruscha.\n\n\nBillionaire collector Greg Brockman of Brockman Garment Co., which represents brands including Guess, Alexander McQueen, and Thomas Heatherwick, has been expelled from the London Fashion Week fair for accepting payments in exchange for endorsements. According to the Art Newspaper, Brockman has agreed to pay $3.5 million to a number of high-profile figures including fashion designer Anne Helen Terry, the fashion industry veteran Caroline Weston, and the British fashion designer Stella McCartney.Brockman has also settled a lawsuit with the British American Tobacco Company (Bt), which he founded in 2003, for $1.35 million. In exchange for endorsing three brands, Brockman received a total of $5 million", "The next Biennial should be held early next year, and the second, due to take place in 2021, should be held in the first half of the year.  The City of Honolulu also received a $100,000 appropriation from the bill for the construction of a new $100-million science and technology facility for the arts and cultural sector in the city. The $90,000 was also set aside for the construction of an arts-focused workforce health center.In addition, the city is proposing to levy a tax of up to $30 on real estate transactions between individuals and corporations. The proposed fee would be used to fund the construction of the arts and cultural economy in Honolulu. More information about the proposed funding sources can be found on the city of Honolulu’s website.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to create two new job opportunities through a $50 million grant program that was launched in April. The program, which is part of a $1.2 billion city budget for the 2020 fiscal year, will allow the institution to create 65 to 90-hour-a-year positions through mid-2019 and will also provide \"a new source of income\" for employees. “We"]