["The next Biennial should be held in the fall of 2020. \n\n\nAn international team of Mexican artists is demanding that the Mexican government provide them with $3.5 million in compensation for the loss of work that was created during the 2015 earthquake and tsunami. The collective, which included artists Ruben Soto, Arturo Barrio, and Carolina De La Torre, began the campaign to secure the funds after the disaster and was joined by thousands of other artists.“We are not against compensation, but we are asking for it from the government,” said Soto, who was present when the tremor struck and was evacuated to a nearby hospital. “This is a rescue mission, and it is being led by the government under the pretext of combating terrorism and drug trafficking.”The United States has also committed to assisting Mexico in recovering artworks and artifacts from the devastation caused by the disaster. President Donald Trump has already allocated $4.5 billion to recovering cultural assets from the devastation wrought by the disaster. Though he has yet to issue an official contribution, Congress has appropriated $2.75 billion for the recovery of cultural heritage in the United States. The Art Newspaper reports that the Trump administration’s proposed $3.", "The next Biennial should be focused on the history of the new museum and its partnership with the city of Chicago.  The new twenty-four-hour Biennial will host three exhibitions a year: “A Conversation,” a new series of lectures on the history of art and architecture, organized by the W.W. Matson Center for the Arts; “A New History,” a series of interviews with artists, scholars, and other scholars, organized by the Henry Luce Foundation; and “Urban Inversion,” a retrospective of works by artists from the city’s African diaspora, organized by the Public Art Fund.\n\n\nThe Seattle Art Museum (SAM) has received a significant donation of more than 3,500 photographs by the artist and educator Noah Algernon, who often explored the emergent relationship between image and sound, the body, and the environment in his enigmatic installation works. The donation, made by the artist and his wife, Meg, comes a year after they formed the gallery, which has five locations in Seattle, and the museum in partnership with the Getty Trust, which is the beneficiary of the gift.The couple’s first display of the new works was a retrospective of", "The next Biennial should focus on “poetic control,” a term popularized by the psychedelic artist and activist Alain Badiou. The museum is also currently working on a new exhibition series focused on social justice and international law and, in the fall of 2019, will hold its fourth edition, “L'Intendue: Les Réalisateurs” (2019–20), at the history center.\n\n\nAngela Chase, who founded the first California chapter of Queer & Queer Studies (Q & Q), has announced that it is now taking over the management of the organization.“We are honored to be working with Angela Chase on the future of Q & Q and her vision to broaden the scope of Queer & Queer Studies to include a wide variety of voices in the emerging queer art movement as well as a strong voice in the academy,” said Rachel Browne, Q & Q’s executive director. “We are excited to see how this transformation will impact the Q & Q program, our current and future exhibitions, and our artists and the art they represent.”Since opening in 2009, Q & Q has staged more than 120 exhibitions, which have toured nationally and internationally, and has hosted", "The next Biennial should be held in the spring of 2020.  The 2019 event was held at the historic Beaux-Arts Museum in Paris, which has been a cultural landmark since it was founded by Jacques Cousteau in 1969. “At this exciting moment, when we are witnessing the greatest renaissance of our time, and the most promising period of human history, when the future of our planet and our world is at stake, when we are faced with the prospect of a radical transformation of the way we live and work,” said Lagarde. “I am especially delighted by the fact that the theme of this year’s Biennial, ‘Existentialism’—I have been an advocate for the term for many years—is one of the most challenging and provocative themes of our time. This is an era when the possibility of existence itself is at stake. And yet, it is also the most enlightened age of our era, a golden age of possibilities and progress.”\n\n\nThe Middlebury Museum of Art in Vermont has received a gift of fifty-six works from the Dorothea and Arne M. Sackler Collection. The donation includes works by Harry Hayashi, Wange", "The next Biennial should be presented by the MCA. Its staff is asking that it be held within the next twelve months.If the MCA does not cancel the exhibition, the exhibition will remain on view until March 21, 2022. If it does cancel it, the MCA will hold an open house—this will be followed by a public reception.If the MCA does cancel the exhibition, the MCA will move it to another location within the museum until its legal team can review the matter. The committee that selected the fifty-four artists who will participate in the biennial was led by Edward Bertha, director of the MCA. Vice chairman of the board of trustees Marc Glimcher, a professor of art history at the University of New South Wales, announced the winners of the Twelve-Month Fellowship Award on behalf of the MCA board. The Twelve-Month Fellowship Award is one of the MCA’s annual awards for outstanding contributions to the arts. The full list of awardees is as follows:Sarah Loter, AustraliaOystein Colton, AustriaArtsClub Production, GermanyArchimedeath, FranceArt History Group, New ZealandArtsite", "The next Biennial should take place in 2020. The 2020 edition will also include a museum exhibition dedicated to the works of ex-Soviet artist and President of the Republic Mikhail Gorbachev. The exhibition will be curated by Michiel M. Waitz and will be led by director Alexander Lidén.The biennial will be hosted by the newly established institution of the history of art, the National Museum of the History of Art in Moscow. The Russian Arts and Architecture Biennial, which will be hosted by the National Museum of Fine Arts in Moscow, was announced as the theme of the exhibition. The exhibition will be preceded with a symposium entitled “Art, Architecture, and the Soviet Union: The Legacy of Leonid Mikhelson” and will run until November 27.The inaugural exhibition, entitled “Art and Architecture and the USSR: From the Two Cities to the Pacific Ocean,” will feature thirty-six works by twenty-nine artists, including Andrei Gramsci (b. 1930 in Moscow), Peter Magid (b. 1934 in Prague), and Iva Grosch (b. 1931 in St. Petersburg). In addition to the works, the show will also include an essay by Damien Hirst, an Icelandic artist", "The next Biennial should be held in the spring of 2021. \n\nAdvertisement\n\nThe City of New York has released the list of forty-five artists who will be featured in the upcoming edition of the Whitney Biennial. Titled “Art in the Age of Black Power” and co-curated by art historian and artist Harold S. Alberga, the biennial will take place at the Kennedy Center in New York from March 14 to March 21, 2020.“As we approach Black History Month, the biennial is a time for reflection, reflection on our world, and reflection on art,” said Kennedy Center director Michael R. Paul. “The history of art is an art history of Black Arts, and we are proud to present the artists who are expressing Black Arts, and the history of Black Arts, at the forefront of their respective art histories.”Among the artists chosen for the biennial are Allen Strand, Arsht Mathison, Alighiero Galán, Ann-Marie Brown, Marsha Paley, Lilianne Griffiths, Naima J. Johnson, and Charles Ray. The biennial’s artists’ selections are as follows: *", "The next Biennial should be in February 2021, and the first exhibition should be staged in early 2022. The schedule for the 2020 edition will be announced soon.\n\n\nThe Institute of Contemporary Arts (ICA), London, announced today that Christopher Wool as its new director and CEO and Anna-Marie Côté as its interim director. Wool, who is thirty-four years old, will assume the reins from his predecessor, David Mcallister, who will retire at the end of December.“Christopher is a leading curator and scholar whose scholarly and innovative work has made him a leading authority in the field,” said ICA director Laura Mulvey. “We are delighted to welcome him to the ICA. He is a warm and obliging companion in the menagerie of curating, writing, and curating-related activities, and he contributes to the growing reputation of the ICA as a leading institution for art-world scholarship. ICA’s board of trustees is thrilled to have him on board and we look forward to working with him and his team.”Wool joins the ICA from the Metropolitan Museum of Art, where he has served as its deputy director for exhibitions for the last twelve years. During his", "The next Biennial should happen as planned, with the need to repair the damaged exhibition spaces and the possibility of a reopening of the pavilion. We will keep you updated with further developments.\n\n\nThe British artist and educator Jimmy Savile—who launched the careers of dozens of seminal British artists through their drawings and paintings during his eight-year tenure at the National Gallery in London from 1957 to 1964—has died at eighty-eight years old. Savile was found dead of a suspected heart attack on Tuesday in his London home on December 31. The death was confirmed by his wife, Paula, and his four sons, Jimmy, Jimmy X, and Terence. Savile had recently been accused of sexual abuse by a number of women who worked with him, and his career was in danger of being ended when his children were born. Savile had been detained in the UK since October 24 and was expected to be extradited to the United States to stand trial.On Tuesday, the family and lawyers for Savile received a court's order that he be extradited to the US to stand trial. The family filed a writ of habeas corpus petition with the US District Court last week, claiming that the US government is violating their rights by barring them from", "The next Biennial should be held in the fall of 2021. In the meantime, the exhibition will continue to be staged as scheduled, with some minor adjustments and reopening of the museum as a result. “I’m delighted by the decision to return to the original theme of the exhibition, to the Biennial of African Art,” said Anita Rabe, director of the Art Institute of Chicago. “The biennial will be substantially different in size and scope this year. It will not only present a number of exhibitions but will also reexamine aspects of the African diaspora in a more extended way than ever before. We hope it will inspire and excite new audiences to explore and discover the extraordinary breadth and depth of African art as a source of inspiration for contemporary art.”The exhibition, which was founded in 2002 by artist, collector and philanthropist Frank Gehry and was staged at the Chicago Art Museum (CAM), the Metropolitan Museum of Art and the Whitney Museum of American Art, was canceled last September after Chicago officials informed the institution that it would be closed until at least the end of March. The new biennial will be led by Roberto Mier, a curator and curator of African art at the museum.", "The next Biennial should aim to explore the interrelationships between art, technology and politics and will receive a donation of $5 million from the Haus der Kunst, which is part of the German government, and the Karlsruhe and will host the exhibition.In a joint statement on November 7, the countries of the former East Germany and the former Soviet Union said that a new exhibition “must develop in our mutual interest.”The statement concluded with a proposal to work together to make a new edition of the exhibition. The project was conceptualized in 1972 by the German artist Otto Skorzeny and the Swedish artist Olof Palmgren. Skorzeny, who is famously buried in the former communist state of Brandenburg, and Palmgren collaborated on the show in two volumes, “Anatomischer Welt: Das neue Welt” (Legacy of the Welt) and “Planetary Annihilation” (1979), and in 1971, they began a project to publicize the works of their ilk. The first show, “Anatomischer Welt ‘From Below’” (1974), showcased twelve works by the German artist Joachim Neugroschel", "The next Biennial should take place in 2019, and the series will end in 2020. The theme for the 2021 edition of the festival is “Feminism, the End of Men” and the fifty-first edition will take place in 2022. The full list of participating artists is as follows: Artist Name Location BOOK CONS *Artist Name Location*Alexandre Leclerc (Lille) Barcelona, SpainB. de Jong (New York) New York, New York. B. Nees (New York) New York, New York. B. Sargeant (New York) New York, New York. B. Zenu (New York) New York, New York. Raquel Otero (New York) Madrid, Spain Artist Name Location*Arts Gallery (New York) *Artist Name Location*Ashley Tully (New York) New York, New York. Artist Name Location*Barbara Shannon (New York) New York, New York. B. Sargent (New York) New York, New York. B. Zik (New York) New York, New York. B.A. Petrie (New York) New York,", "The next Biennial should take place in June 2021.\n\n\nThe National Museum of Fine Arts (NMA) in Washington, DC, has appointed Katherine Lally as its new executive director. Lally comes to the institution from the Metropolitan Museum of Art, where she previously served as deputy director of collections management.“Katherine is a seasoned leader who has demonstrated a commitment to building and operating a strong collection and an ability to deliver results,” said National Geographic Society president Carolyn Albright. “We’re thrilled that she’ll be working with National Geographic to extend our collection and our impact in Washington, DC, and beyond.”During her tenure at the Met, Lally led the launch of the American Folk Art Museum, the Contemporary Art Museum, and the Metropolitan Museum of Art. In 2017, she was named a MacArthur Fellow in the field of art photography. She also received a $30,000 research grant from the NMA.\n\n\nThe early arrival of the Chinese New Year’s holiday in cities across the country has been met with protests from local residents and the opposition. However, the authorities have responded by cracking down on pro-democracy protests through the use of repression. On Monday, the State Administration", "The next Biennial should be held in 2021. “The biennial is not a museum, it is an extension of the city,” Ms. Sharrock said. “I am delighted to have been able to work with the artists, the staff, and the community to help shape the next one.”\n\n\nThe Fairŋs board of directors has announced that Lydia Hauser will host the festival’s fifty-ninth edition in Miami Beach in 2021. Hauser will serve as the interim director of the Michigan Institute of Arts (MI) and will be responsible for the development and execution of the museum’s programming and the management of its collection, which comprises fifty artworks and more than three million objects.“The board is thrilled to welcome Lydia Hauser back to the largest contemporary art institution in the United States,” said board chairman Mark A. Lin, chair of the board of trustees. “Lydia is a seasoned and accomplished leader who has proven time and time again that she is dedicated to developing and executing a plan for the future of the Museum. We look forward to working with Lydia to build upon the success of her most recent mandate as director.” The", "The next Biennial should consider how to renew the contract of the museum’s existing staff, and perhaps address the museum’s future plan to remodel its ground-floor auditorium and the interior of its new building. The Art Newspaper reports that the Biennial of Contemporary Art will be inaugurated on January 10. “We are very much looking forward to the show,” Moschena Alemanova, the director of the Biennial, told the Art Newspaper. “We have not worked out the exact schedule yet, but it will certainly be a great success if the first show of the new museum is a success. We believe that this is the best way to make the Biennial unique, so that it will be able to continue to present the best of contemporary art, and to develop its collection and collection programs from the ground up.”\n\n\nJust days after a panel of academics pronounced that Saudi Arabia must curtail its nuclear program, the United Kingdom announced that it intends to leave the European Union in 2021. Prime Minister Boris Johnson confirmed this week that the country will leave the E.U. in March, and that his government expects to negotiate withdrawal terms in June.The decision has stunned Britain’s", "The next Biennial should be in the spring of 2020. “We face many challenges in our work, but the best way forward is to continue to work together in solidarity,” said Alexandra Bennett, chair of the trustees. “I am proud to be a part of this year’s collection, and to be a part of the history of contemporary art, which has so wonderfully incorporated creative collaboration between artists and the public.”\n\n\nThe Royal Academy of Arts (RA) in London announced today that Lennon Rondin and Alison Lavin have been appointed as the new directors and producers of the biennial “Just Art: Art and Politics” (J&P), which will run from March 14 to March 16, 2020. The program, which will also feature artist interviews, a performance by a selected group of artists, and the exhibition of a selection of photographs by Robert Mapplethorpe, will be presented by the artist-run platform Post Art.Rondin is most remembered for her work in which she plays a key role in creating a narrative of the contemporary art world through the work of women artists in her thirty-year career, and Lavin is known for her work rooted in", "The next Biennial should take place at the Museum of Contemporary Art (MoCA), in New York, in 2021. The project will present a new collage-like work, “Ekko and the Goddesses,” as well as a new printmaking workshop, “Sensate and Absence,” in collaboration with the artist’s daughter Anna, who is currently on the faculty of the School of the Art Institute of Chicago.\n\n\nFilipino artist and activist María Berrada, who often drew from indigenous peoples and other marginalized groups to create works that address issues such as racism, colonialism, and climate change, has died at age eighty-eight. Berrada’s art has been featured in multiple international collections, including the Museum of Fine Arts (MFA), the National Museum of Indigenous Art, the Museum of Modern Art, and the Los Angeles County Museum of Art.Born in 1936 in Mendoza, in northern Philippines, Berrada moved to the United States in the early 1950s. She studied at the Art Institute of Chicago, the University of California, Los Angeles, and the Smithsonian’s National Museum of American Art, but left the academy in 1954 for Cuba, where", "The next Biennial should take place in the summer of 2021. All three of the remaining entries were awarded grand prizes in the first exhibition, which were also held in the spring of 2017. The Italian pavilion will be exhibited in the pavilion of the Italian city of Casiglione, near Rome, in June 2020. The works in the major competitions of the Biennial will be selected by the 2012 winner, Andrea Dallori, from the list of several hundred submissions from the 2014 exhibition.Dallori, a style historian, curator, and essayist, founded the Italian pavilion in the first exhibition of the “Biennale di Triennale” (2014) in Rome. The exhibition invited 75 artists from Italy and abroad to participate in an exhibition that had been previously canceled and was reopening in June, but was temporarily suspended due to the coronavirus. The seventy-eighth edition of the Milan Biennale is scheduled to take place in May of 2021.\n\n\nThe Los Angeles County Museum (LACMA), California, this week unveiled the first public artwork dedicated to the life and art of El Pintor, a legendary Yiddish-born American avant-garde composer whose work was greatly influenced by", "The next Biennial should be held in 2021, when the Museum of Contemporary Art (MCA) in New York will host the twenty-fifth edition of the Venice Documenta Triennale, which will take place in April. The museum has also been working on revamping its existing museum’s grounds, which have seen some of the most intense growth in the world’s art museums. The project is currently in the conceptual stages. Earlier this year, the museum started a campaign to raise $3 million for a new building on the museum’s campus. The $3 million grant was established by the Lynne and Edith Franklin Foundation as part of the museum’s ongoing efforts to diversify its endowments.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles unveiled on Thursday the inaugural panel titled “Generations: From Art to Art,” which will examine how the museum’s collection and exhibition program has evolved as it has become a destination for artists to gather, showcase, and perform on its grounds. Curated by artist and curator William Ibbotson and Kunsthalle Basel, the event will run through March 5.“This year’", "The next Biennial should be held in 2020. “We have been working hard to create a unique venue for our exhibition and exhibition program at the museum,” said Peter Suttner, the museum’s director. “It is important to us that the exhibition series continues to be critically engaging and can remain so. We have made considerable progress in this area over the years, and I think that we are now well on our way to realizing our programme of exhibition programs and exhibitions in the United States.”In the New York Times on May 21, Lincoln Center announced plans to move the current exhibition program from its current location at 835 Fifth Avenue to a new venue in Manhattan. The move will also see the exhibition program hosted in a new venue, as it has been since May 25, 2019.“The exhibition program at Lincoln Center has been an essential vehicle for connecting audiences with the arts over the past twenty years and is now in a position to continue this relationship in an exciting new way, integrating the museum’s collection and exhibition programs into the city and beyond,” said Diane Simon, executive director of the Cultural Fund, a New York–based cultural organization. “Putting the exhibition program", "The next Biennial should unveil a new set of guidelines for how the works will be displayed. A new exhibition of the work of the same name will be held in October 2020.Artforum has reached out to the following museums for comment:Art Institute of Chicago, Chicago:  All programs are cancelled. Art Institute of Iowa: All events are canceled. Art Institute of Chicago: All events are canceled. Artists Space, New York: All events are canceled. Baltimore Museum of Art: All events are canceled. Boston: All events are canceled. Brooklyn Academy of Live Arts, New York: All events are canceled. Carnegie Museums of Pittsburgh: All events are canceled. Carnegie Mellon University: All events are canceled. Carnegie Museums of Art, Pittsburgh: All events are canceled. Chinati, New York: All events are canceled. Chronicle of Arts, New York: The museum will continue to operate as usual, but will postpone the opening of “Every Day Matters” until later this month. Chronicle of Arts, New York: The museum will continue to operate as usual, but will postpone the", "The next Biennial should be held in 2020. For the past twenty years, the museum has been working toward creating the first biennial for Sub-Saharan Africa, which will open in 2022. “With the 2017 collection, we have been bringing together the best contemporary art from Africa and sub-Saharan Africa,” said Dr. Naima J. Buhl, director of the museum, during a press release. “The collection now includes work of emerging and established artists from Africa and sub-Saharan Africa, illustrating the history of art in these regions. Our galleries will showcase this collection in the coming years, as we continue the work of bringing together the most important works from Africa and sub-Saharan Africa.”The biennial will be organized in three phases, beginning in 2021, and lasting through 2022. In Phase 1, the biennial will begin with a traveling exhibition of new work by twenty African artists, currently on display in the exhibition “Amany Sotelo” (2019), which will return to the museum in 2022. In Phase 2, the biennial will continue with the exhibition “Sylvia Rovner: Jews of Algiers” (2019), and will present the", "The next Biennial should be held in the fall of 2021 and will be hosted by the city of New York at Pier 85. It will take place across from Lincoln Center and will feature more than 250 artworks by sixty artists in the city. The exhibition will center around the idea of the exhibition as a platform for the African diaspora to have a voice in America’s government.\n\n\nThe Italian government approved a new $2.5 billion aid package for the Italian arts on Thursday, and the $1.2 trillion bill is the largest relief package Italy has received since World War II. As part of the package, the country is preparing to receive $2.5 billion in financial and political support from the Italian government and international organizations, as well as $1.2 billion in grants from Italian citizens and Italian-based foundations.Among the largest pieces of the aid package are a $320 million grant for the arts, which is divided between the Ministerio de Cultura Artistica (MCAD), the Ministry of Culture, and the Ministry of Education, and will begin rolling out over the next three years. The ministry is also planning to set up an online portal to help the public understand Italian and to create an online bookstore that will carry the", "The next Biennial should be held in 2020 to coincide with the start of the twenty-third Tokyo Triennale in 2021. The exhibition will also include projects and performances that examine the history of contemporary life through the lens of contemporary art. The biennial will be organized in collaboration with the Tokyo Metropolitan Government, the Toguro Museum, and the Japan Science Museum, and will be shaped by the theme “Gathering of the Five Worlds.”The 2020 theme is “Techniques & Methods.” It will recount the artworks and technologies of manufacturing and transport and will include work by artists such as Hiromi Takeda, Mitsuko Iwasaki, and Katsuo Takeda, as well as Japanese designers such as Masahiro Takahashi and Kenzo Tange. The biennial’s 2020 cohort includes Takeda, Aoki Ōmoto, Yoko Ono, and Fukuoka Yuki.\n\n\nThe London-based fashion design company Saint Laurent announced today that its first London-based artist-in-residence, Robert Jewkes, will take up the post of the company’s senior curator for the upcoming season. He will be responsible for highlighting the works of emerging and", "The next Biennial should be announced by the end of March. \n\n\nThe Astrophysical Museum in Beijing has received an unexpected gift from a group of Chinese collectors. The institution\u0097which recently celebrated its fiftieth anniversary\u0097has received a gift of thirty-nine works by Tianqi Lu, a Chinese artist best known for his monumental, twenty-three-thousand-work space, Tianqiong Lu, for its collection’s first collection in 2017.“The museum is very grateful for the support of the Chinese collectors who were able to discover and preserve the works of the artist in our collection from an early date,” the museum said in a statement. It also thanked the collectors for their help in securing the works, which were purchased by the museum from the artist at a museum auction in April 2019. The museum has been working with the estate of a friend of the artist to obtain the works, which were donated by the artist’s longtime companion and friend, Wang Zi, a well-known collector who has served as a major patron of the museum since 1996. The exhibition is part of the artist’s goal to present his works in China, where he has long been featured in exhibitions", "The next Biennial should be held anywhere in Japan between December 7 and December 10, 2019. This is a time of great change, and I look forward to working with all artists and audiences to bring you a new narrative for the exhibition, which I know many of you are eager to see.”The 2019 edition, titled “The Narratives of the Visual Arts,” will feature the work of more than 120 artists and will feature the first retrospective organised by the museum in Japan since 1968. The exhibition will take place at the museum in the city of Saitama in the Saitama Prefecture, Japan, and will run for twelve weeks. The works will be presented by a number of groups, including the National Museum of Art in Beijing, the Museum of Modern Art in the US, the Museum of Contemporary Art in Prague, and the Saitama Art Museum.\n\n\nArt historian and curator David H. Friedman, a cofounder of the Los Angeles–based nonprofit Space, has been appointed curator of “Experiments in Art and Astrophysics” at the newly opened Contemporary Art Museum in the City of Los Angeles (CAMLA). Friedman, who was previously the curator of “Paintings in Space” (", "The next Biennial should be held at least five years from now.”The move follows the Biennial’s announcement that it will not renew its contract with the Museum of Modern Art, the Louvre, or the Palais de Tokyo, the center’s home since 1985. The decision comes after the museum criticized the three institutions for not renewing their contracts with the biennial organization, which is supported by the French Ministry of Culture, the Central Council of the Louvre, and the Palais de Tokyo.The new agreement between the biennial organization and the Ministry of Culture would have seen the museum renew its contract for a maximum of ten years. However, in January 2019, the museum began a campaign to have its contract renewed, and soon after a new Museum of Modern Art, curated by David DiPasquale, opened in the institution’s former space in Paris.Although the museum is still committed to distributing the internationally acclaimed exhibition “Garden of Abraham” at the Stedelijk Museum in Amsterdam next month, the institution is now expected to take the exhibition on an international basis. Its new partner, the Fondazione Prada, will host the exhibition, which will run from September 5 to November 4", "The next Biennial should be ready by the end of the year.  Honorable Mention Indira Gandhi Biennial\n Myanmar: “The Role of Women in Burma” The seventy-fifth edition of the Myanmar Women’s Forum won the award for Best International Conference in January 2018. The event was hosted at the Buddhist monastery of Baga, in the northern province of Yangon, and addressed the history of women in Burma, the history of feminism in Burma, and the current plight of Burma’s Rohingya Muslim minority. The event also featured the artwork of three women: Héang In, Cheryl Ngai, and Siyavanna Prasad, who were selected by a committee chaired by Karnataka Culture Minister Sudip Nath. The event ran from January 26 to February 4.  The next Biennial shall be ready by the end of the year.  India: The Art of Living and Art is Life: The World I Live and Die in ‘India’s Contemporary Art of Living and Art is Life: One Woman’s Vision, published by Victoria & Albert, will mark the centenary of", "The next Biennial should be a follow up to its inaugural, which will be held sometime in 2020. “I’m looking forward to a new and improved biennial, one that will enable me and many of you to celebrate the legacy of my father, who was a pivotal figure in the history of art in New York City and beyond,” said Grimm.  The biennial will be led by Jerome Scheib, the director of the Peter Ho Art Museum in New York, with Marlene Aldridge and John Akomfrah. The event will take place at the Museum of Modern Art under the auspices of the intergenerational artist-run organization Ursula and Erma Kübler-Roth.\n\n\nThe French Ministry of Culture has confirmed the expulsions of thirty-seven Art-versus-Art pieces from its collection, which are currently on display in the exhibition “Sol Leila,” a biennial of the Italian Neoclassical architect Artsazio Pazzi, at the Musée d’Art Moderne in Paris. The ministry says that the works were either “contrary to the principles of art or were not chosen by", "The next Biennial should be made in the Spring of 2021. The National Museum of Art in Washington, DC, will hold its next edition in 2020. At this writing, the 2020 edition of the Biennial will be held in early December. Since the exhibition, “How the Body Works,” will be on view until March 14, the biennial’s opening date has been moved to March 13.The 2019 edition, “Telling Stories,” featured artwork by artists such as Pierre and Nora Süder and Nari Ward. The exhibition was curated by Domenick Fusi and Laura Laverdi and is currently on view at the Museo de Arte Contemporáneo in Rome. The 70th anniversary of the National Gallery of Art in Washington, DC, this year marked a turning point for the institution. The institution also announced that it is planning to add a new room dedicated to the visual arts to its main building, which has been closed since March 13, and will work with the Department of Arts and Culture to create a new platform and programming for the exhibition. The new venue will act as a hub for exhibitions and public events and will host up to eighty themes throughout the", "The next Biennial should be in 2020, with the first exhibition being held in the United States in 2021. The theme of the 2019 exhibition was “The Future of Art.” In 2020, it will be “The Future of Humanity: Art and the Future of Life.” The 2020 edition will take place in Rockefeller Center and will run from March 24 to March 29, 2020. The 2019 exhibition, “Anachronism,” comprises twenty-six paintings by American artist John Dill, including his first solo exhibition, “The Colour Out of Space” (1958), which was shown at the Museum of Modern Art in Los Angeles from March 11 to March 23. In the twenty-fourth exhibition, “Nouvelle de Versa,” twenty-four works by French artist Aurélie Boudin, which was presented at the Museum of Modern Art in Paris from March 26 to March 29, 2019. Also presented in the triennial will be “Avant Garde,” a selection of paintings by German and Italian artists such as Heinrich Neue, Karl Maki, and Paul Gauguin, and “The Art of Death,” a tribute show", "The next Biennial should come on line in 2021.\n\n\n\n\n\nJames Cuno: A Retrospective of His Life and Times. “From A to B,” 1955. New York: Gagosian; 1955, 1956, 1957. Exhibition will open in January 1956. American Picasso. The artist will return to the US for a retrospective at the Museum of Modern Art in March 2020. Art in America: A Retrospective of Art in the 20th Century,” 2019. Exhibition will run March 26–April 14, 2020.  American Picasso: A Retrospective,” 2019. Exhibition will open in January 2017. Art in America: A Retrospective,” 2019. Exhibition will be held at the Museum of Modern Art in New York from March 24–March 24, 2020. The exhibition, which will present a selection of works that have never been seen before, will run concurrently with the upcoming exhibition “Avant-Garde” at the Museum of Modern Art in New York. James Cuno: A Retrospective of His Life and Times,“From A", "The next Biennial should be held in 2020.\n\n\nThe Museum of Fine Arts (MFA) in San Francisco has appointed John Kelly as its next director. Kelly joined the institution from the Los Angeles County Museum of Art (LACC), where he serves as deputy director and chief curator. Kelly previously served as director of the San Francisco Museum of Art (SFMoCA), where he helmed the institution for twenty-three years and also held the position of deputy curator for ten years.“We are thrilled to welcome John to the MFA,” said director Karl Ruben. “John has already established himself as one of the most respected, accomplished, and respected curator minds in the country. He is an indefatigable champion of modern art and has devoted his career to championing the art of the twenty-first century. We are confident he can further the MFA’s legacy by advancing its curatorial agenda in new and innovative ways.”For the 2017–18 fiscal year, the MFA underwent a $50 million expansion and opened a new museum in the former Virginia-Hawaii border. The institution also received $30 million from the new Sustainable Communities for the Arts (SCaHA), which was created by the", "The next Biennial should take place in the spring of 2021 at the University of Tartu in Estonia. \n The Museum of Contemporary Art (MCA) in New York has received a $1 million donation from the Noguchi Foundation, the New York–based organization dedicated to supporting artists and arts professionals in New York City. The donation was made in support of the work of Deborah Noguchi, whose works are in the collections of the Museum of Modern Art, the Brooklyn Museum, the Bronx Museum of the Arts, the David Rockefeller Museum of Art, the Metropolitan Museum of Art, and the Whitney Museum of American Art.“In recognition of her extraordinary achievements and the work she has done to advance art and the arts, we are providing $1 million to support Deborah Noguchi’s work and other exhibitions at the Museum of Modern Art, the Museum of Modern Art, and the Museum of Contemporary Art, as well as to help the Museum of Noguchi’s work,” said Steven Noguchi, president of the foundation.Noguchi’s work first appeared in an exhibition at the Museum of Modern Art in 1940. Her second exhibition at the institution, “In the Picture,” was organized", "The next Biennial should take place in 2021. \n\n\nArt Basel Hong Kong announced today that it is bringing the 2020 edition of its Hong Kong fair to the United States. It will kick off at the Hong Kong Fair and will run through March 22, 2020.The show will be hosted by director Marc Glimcher and will be hosted at the new Carnival of Asia in Hong Kong, which was completed on Thursday, March 24. “We are extremely excited to host a show as important as Art Basel Hong Kong 2020, which is so important to the region as well as the world,” said Glimcher. “This is an historic opportunity for the region and we are confident that our artists, galleries, and designers can bring their visions to life in the new venue.”The fair’s 2019 edition, which was held in Hong Kong, Australia, and Japan, drew an attendance of nearly 5.5 million visitors. The event, which celebrated Art Basel’s thirty-fifth anniversary, featured more than fifty exhibitions.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Angelica Barba as its next director and CEO. She succeeds Marc Glimcher,", "The next Biennial should focus on the role of the non-artistic in decision making and the art market. This is an issue that has been continuously raised by the organizers of the Biennial, the City of Los Angeles, and the City of Pasadena. “We are committed to engaging with and rethinking the role of art in Los Angeles,” said Ashley Swallow, director of Arts & Culture. “A lot of the work that we’re doing now is about changing the conversation about what art can be and cannot be.”The 2020 edition of the Venice Biennale will take place in Venice from September 16 to September 19. The Venice Architecture Biennale will take place in the city of Venice from September 13 to September 21. The Venice Design Biennale will take place in the city of Venice from September 17 to September 21. The Art of Venice, a new biennial that will debut on December 5, 2020, will be curated by Anna-Sophie Berger. The Venice Architecture Biennale will be organized by Klaus Sklar, the city of Venice, and will consist of sixteen exhibitions. The Venice Design Biennale will be hosted by and be organized by the city of Venice.", "The next Biennial should also include two episodes of the global exhibition “Up Against the Wall: Art and Power” along with “The Unquiet Horror: From Kahlúa to Kahlúa” (2019). The 2022 event will be staged at the V&A in London and will be organized by the Institute of Contemporary Art, London.\n\n\nInstitute of Contemporary Art, London (ICA) director Maria Balshaw and director Charlotte Edwards have announced that they will resign from their respective positions in December 2020 and have agreed to serve as co-chairs of the seventh edition of Exo and Exo 2030, which will kick off in January 2021.The biennial will focus on themes of resistance, transformation, and creation. It will also introduce a new theme, “Theatre of Resistance,” which will be curated by Marwan Ashery and will focus on “the possibilities of theater in the face of the existing order” and will feature work by seventy new artists. The event will be held in conjunction with the annual Art London Biennial, which opened this year in London and runs through March 21.“Today’s exhibition and exhibition program in London is perhaps the most vibrant and vibrant", "The next Biennial should be held in 2021.The project will be led by Lorna Simpson, director of the Centre for Contemporary Art, and tasked with advancing Robin Givens’s work, and the biennial’s proposed theme, “Theoretical Art and the Future.” Both the artist and the museum will receive a sum of $250,000.\n\n\nThe Los Angeles County Museum of Art (LACMA) is preparing to unveil a new expansion and renovation of its 900,000-square-foot main building, which opened in 1977 and has been undergoing a major renovation since 2010, in the city on September 3. The new structure will include a theater, a café, a film studio, and a public courtyard.“The renovation project addresses the needs of an evolving museum and the future of LACMA,” said director L.A. Reid. “The new building is designed to be a living, breathing museum, capable of supporting the extraordinary exhibitions, performances, lectures, exhibitions, workshops, and events that LACMA has always offered.”The renovation also includes the reconfiguration of the courtyard, which will be landscaped with new trees and shrubs, and a new", "The next Biennial should be held at the University of São Paulo within two years, the organizers said. The first edition of the twenty-fourth Biennial “Feminista” was held in 2003 at the Museum of Modern Art, and the second “Feminista Europe” was held in 2017 at the Deutsches Museum. The seventh Biennial, “America’s Voice,” was held in 2006 at the Museum of Modern Art.\n\n\nFrench artist Ychai Trachtenberg has won the 2018 Prix d’Art Moderne, France’s highest honor. The forty-eight-year-old New York–based artist, who won in 2010, will be presented with the $100,000 prize at the Museum of Modern Art in New York on January 22. Trachtenberg’s work, which is based on a stage installation constructed of wood, fabric, and fabric scraps, has been featured in at least twenty-six solo exhibitions and has been exhibited at at the Palais de Tokyo in Paris (2016); the Museum of Modern Art (2017); and the Mycenaean Museum in Athens (2017); and the Fabric Workshop in Brussels (2017);", "The next Biennial should take place in the near future and will be held at the Institut National des Arts et Lettres (INLA) in Paris. The exhibition will be led by Lévy Gorvy artist Jean-Luc Moulène, the first African American to be selected as the winner of the prize.Collaborating with artists from all over the world, the exhibition will feature works by twenty artists from twenty-nine countries. The list of participating artists is as follows: Alberto Cecilia Horrocks (Venezuela)Agnès Rimaud (France)Alfonso Alvarez Bravo (Mexico)Augustina Barraga (Argentina)Alexandre Béon (France)Barbara de Cesarco (Spain)Bianca de Sanctis (Argentina)Bianca del Vallo (Italy)Alfonso de la Torre (Mexico)Elinor De Santis (Mexico)Bono de Nigra (Spain)Eli-ane de Jesus (Mexico)Bianca de la Rosa (Spain)Abby Klimchuk (Germany)Alexandra Laudel (United States)Alexandra Merz (Italy) Alejandra and Yael Merz", "The next Biennial should be held at the Museum of Contemporary Art (MoCA) in New York in 2021. \n\n\nThe Laundromat Project , a creative agency based in New York City that offers studio and home-based programs, has received a $50,000 donation from New York Knicks owner James Dolan. The fund was established by the philanthropist David Siegel and his wife, Kathy, in support of the Laundromat Project, a nonprofit team comprised of artists working in New York City’s Lower East Side.The donation follows a $50,000 gift from billionaire industrialist Lawrence and Lawrence Wirth in February. The Wirths are philanthropists who are also major supporters of the Brooklyn-based nonprofit the Laundromat Project. In March, they pledged $100 million for the Laundromat Project.The Laundromat Project’s founder and artistic director, John Higgins, told the St. Louis Post-Dispatch that his organization is not affiliated with or funded by the Wirths. He states that the partnership is between the Wirths and MoCA. The partnership’s first exhibition, “The Laundromat Project,” was held at the MoCA", "The next Biennial should begin immediately with the start of the exhibition “Roots of Good Feelings: Art and Innovation,” a collaborative program that will feature work by the South American curators Antigua Bachelet and Rodrigo Borges. Plans for a third exhibition, “Agnes Martin: A Portrait in Motion” in December 2020, are being revamp based on feedback from the first two events, which were held in London and New York, respectively.The 2020 edition of the Biennial will be staged at the Marrakech Biennial House in Marrakech, Morocco. It will be led by artistic director Jodi Thun and curator Zaki Raman and will run from May 21 to May 23. The event will be co–organized by the Center for Contemporary Arts (CAA), the Center for Islamic Art (CICA), and the Center for Italian Modernism (CIMAM) at the University of Bologna and will be supported by the Giardini in partnership with the Italian Ministry of Culture. The 2020 edition of the Zagreb Biennale will be held at the Marrakech Museum in Štravnik, Croatia. \n\n\nTacita Dean, a British", "The next Biennial should include a discussion of the exhibition “Awareness: Contemporary Art in the Age of Black Power” (2019)\u0097a show organized by Angela Carter at the Museum of Modern Art in New York.The exhibition, which is currently on view in the West Village, will also include a new work by the artist Scott-David Mitchell. The work, titled “Into the Abyss,” is part of a series of exhibitions on Black Power that will open at the Museum of Modern Art in New York in the fall of 2020.“It is our duty to present the most current and sensitive images of Black bodies,” said Carrie Gracie, chair of the board. “This exhibition will give a rare window into the experiences of an active art educator working in direct collaboration with artists and scholars. I’m confident that this exhibition will inspire and challenge even more students and practitioners to think critically about the current world.”The first Biennial exhibition was organized by the Los Angeles–based artist Gerald Gillespie in 2006. George and Catherine Johnson’s “It Is Not Our Place to Defend Black Lives” (2019) was the first show at which the artist was involved. In 2018", "The next Biennial should have a theme of sustainability and be for the next five years.” \n\n\nThe Tate’s board of trustees has voted to relieve the curators of their duties as it attempts to implement a new set of corporate policies in the wake of the Covid-19 pandemic. According to the Art Newspaper, the changes will involve curators working remotely and will involve rotating exhibitions through multiple platforms.The changes were made after board president Maria Balshaw and executive director Maria Balshaw-Askew, who is responsible for managing the museum’s relationship with Tate’s management, reached an agreement on May 18. The move was made in the wake of a board meeting where they discussed how the corporation should focus more on direct engagement with its audiences and less on managing exhibition programs. In response to a question about how the board plans to address the impact of the Covid-19 crisis on the entire institution, Aileen Curtis-Hamilton, chair of the trustees, said: “There are a number of things that can be done. Our first priority is the health and safety of our staff, our guests and visitors, and the broader community. As I have said, we are working closely with Tate management", "The next Biennial should be held at the Children’s Museum of Atlanta in September. \n\nAdvertisement\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, the California Institute of Technology in Pasadena, and the Museum of Modern Art (MoMA) in New York have announced that they will suspend all events and programming through the end of 2020 to focus on the reconstruction of their collections and the preservation of their collections.The news comes amid a crisis for museums as they grapple with the financial fallout of the coronavirus pandemic. According to the Wall Street Journal, MoCA’s annual operating budget is estimated at more than $140 million and has already incurred a loss from the coronavirus. The institution estimates that the cost of revamping its collection could be as high as $150 million.The California Institute of Technology, which recently announced that it was launching a $10 million fund for the construction of a new biennial of work by artist-in-residence Richard Serra, has also announced that it will suspend all programming through the end of May. After a yearlong search for a new home for the collection of artist Gary Barlow, the museum reopened its door to the public in December 2019. Its new", "The next Biennial should focus on the history of modern identity, the contemporary art world, and technologies to produce a new and more inclusive, ethically and politically oriented, exhibition.”The Venice Prize, which honors work in the art field that is innovative and original, will kick off on January 31 and run through March 25. A selection of the finalists, which also included Noguchi, Tononi, and Ullrich, will be presented at the Venice Architecture Biennale in the spring of 2020.\n\n\nKirsten Davis, a curator and writer based in New York, has been appointed the artistic director of the inaugural Biennial of the Museum of Modern Art (MoMA) in the Bronx. She will helm the biennial, which will feature work by twenty-nine artists and will take place in the village of Belle Plaine, New York, in the Bronx, from January 18 to March 21, 2020.Davis has helmed MoMA since 2013. During her tenure, she established a long-term program of exhibition-driven research and developed new revenue streams for MoMA through digital and online sales and acquisitions, as well as new corporate partnerships.In a statement, Davis said: “The largest support of my career, the time", "The next Biennial should be held in 2021 and will feature exhibitions of work by fifty-five artists, including Alexander Calder, Pierre-Auguste Renoir, Cézanne, and Marc Chagall. The first Biennale of Sydney, which will run from March 25–March 31, 2021, has announced a date for an opening in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has placed a twenty-four-foot bronze sculpture by artist Peter Dreher on display in its galleries this week. Dreher’s portrait of unknown artist-in-residence Ose, a French-born, German-speaking American artist, began as a drawing by the artist in 1950. Five years later, he became a self-taught sculptor, whose work is now exhibited in the United States and is featured in a 2018 retrospective at the Museum of Modern Art in New York.Born in New York City in 1941, Dreher moved to Cambridge, Massachusetts, where he enrolled at the University of Massachusetts, Amherst, and went on to study under sculptors Max Beckmann and John C. Wright. In 1958, he enrolled at the Museum of Modern Art, where in 1965 he painted Peanuts, which was inspired by", "The next Biennial should be held in 2022. In the meantime, the UBC Museum of Fine Arts in Vancouver has launched a $60,000 crowdfunding initiative, as have the New Museum, the Scripps Institution of Oceanography, and the Smithsonian American Art Museum in Washington, DC. \n\n\nForty-six members of the Culinary Institute of America (CIA) have signed a letter urging the school to suspend production until the coronavirus crisis is over. In the letter, penned by the association’s executive directors Anne-Marie Miller, Kim Bergh, and Mary Anne Carter, the Academy of Motion Pictures Arts and Sciences (AMPFA) in Beverly Hills, California, and the American Ballet Theater in New York, the case for suspended production is almost as strong. “We believe a full and timely reopening of the National Center for the Arts—which is the most important public service in the nation and vital to the cultural, creative, and economic well-being of all of America—is the only effective way to address the outbreak and prevent the spread of Covid-19,” the letter reads.The letter also criticizes the CIA’s director, Mary Anne Carter, for giving the American Bal", "The next Biennial should be held in 2022.  \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $50 million donation from the estate of the late collector and philanthropist Roberta Smith, who championed the careers of numerous artists, including Carlos Castaneda, and is planning to construct a new exhibition dedicated to Smith’s work in the museum. “With great emotion and trepidation, we are grateful to Roberta Smith and to the family for this gift,” said Elizabeth Anne Smith, the widow of the late collector and philanthropist. “We are especially excited by the gift of the Roberta Smith Collection, which is one of the most important collections in the world. The hope is that this gift will help make this collection one of the most important in the nation.” The gift will also allow MoCA to re-examine its holdings of Smith’s works and to rediscover the life and work of one of her most elusive giants, Pablo Picasso.“Pablo Picasso is a legend,” said Michael Rosenberg, director of the Biennial. “In the seventy-six years since he created his first painting, María Berrí,", "The next Biennial should be held in 2021, the same year as the ten-member committee that oversaw the exhibition, which was chaired by Art Basel and runs until April 5.2015. It will also feature art from an additional ten exhibitions, including works by artists such as Teresita Guarani, Alejandro Campos, and Ruanne Yagut. The exhibition will include the first solo shows of work by artists from the Americas to be held in China since the exhibition took place in Hong Kong in 1992.In the exhibition “Asian Art,” the first, “NYC: The Artist in the City,” was curated by Yonnua Fong, who migrated to New York from Taiwan in the late 1980s and began using the city as a base for her art in 2013. Another show, “Spring/Fall 2020,” is a combination of prints and video art, with works by twenty-four artists. The following year, “Anseta” was a video art installation at the Arts District that premiered at the Saatchi Gallery and helped raise funds for the nonprofit American Artist Resili­bence Center.\n\n\nThe Abu Dhabi Art Foundation (ADFB), one of the", "The next Biennial should take place in 2021, and the inaugural edition will be held at the Museum of Fine Arts in Boston in 2021. \n\n\nThe Dutch government has issued a $1.3 billion aid package to the European Union and the United States to prevent the spread of the coronavirus, which has already claimed the lives of more than 4,100 people in the EU and the US. The $730 billion aid package will also provide $165 billion in relief for businesses, and $110 billion in loans.The funds will be divided among the 28 EU member states—the United Kingdom, France, Germany, the Netherlands, and Spain—and will be allocated in a manner similar to the way the European Communities Fund is spent. According to the New York Times, the funds will be divided as follows:The EU states are expected to receive the funds by June 30, and the United States by June 1. While the 2018 version of the aid package—which contributed $292 billion to the EU and $156 billion to the United States—was criticized for leaving many European countries without funds, the Trump administration is hopeful that the aid package can make a difference.The president signed the $1.3 billion aid bill into law on September 2, and it", "The next Biennial should be held in 2021. Its next edition will be held at the Grand Palais in Paris.\n\n\nThe Pérez Art Museum in Mexico City has received a donation of twenty-eight artworkworks from the collection of the late artist and collector Lina Pérez, who passed away on September 9. The works are part of the collection of the Pérez family.“The museum is deeply grateful to the Pérez family for the acquisition of this exceptionally important collection,” said José Luis, director of the Pérez Museum. “Having these works is a great honor. They were in an era when the Pérez family was very active in Mexico City, and we were able to collect them. Lina Pérez was a pioneer of contemporary art in Mexico City, and we are honored to present this wonderful gift to the Pérez Museum.”The works will be added to the Pérez Museum’s collection of contemporary Mexican art, the Pérez Museum, and their collection, and will be exhibited in the museum’s exhibition “World in Transition: Mexican Art of the 1980s” (2017–18).\n\n\nIgne Gallery in London announced", "The next Biennial should focus on the international rescue mission, which has been operating in the aftermath of the devastating Typhoon Haiyan in the Philippines, and how it can be extended to include the global recovery effort. The 2020 edition of the event will also introduce a new section on sustainability.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the reopening of the Robert Rauschenberg–designed site in Central Park. The document, which was circulated by the DCLA on Tuesday, outlines the steps artists, designers, and other cultural workers, and visitors, can take to help re-open the park by following these guidelines:1.          Maintain a high level of social distancing. 2.          Monitor the park and ensure that people are being protected. 3.          Communicate with park staff and other visitors to ensure that they are aware of park reopening plans and other reopening activities.\n\n\nThe X Factor, the Emmy Award–winning reality television competition that was launched in the United States by CBS in 2001, is seeking to raise $1 million to increase its programming across thirteen states in the Pacific Northwest. The initiative aims to provide a platform for underrecognized, mid", "The next Biennial should be held in the spring of 2020.\n\n\nThe Kelsy Art Museum in New York has received a gift of twenty-six works by the late Russian artist Anatole Shagal. Shagal’s works, which were divided into a number of categories, including sculpture, photography, painting, and installation, are now displayed in the museum’s exhibition “Feminine,” which opened on December 8. Shagal’s paintings are among the work-stages selected in the exhibition for the third iteration of the Kelsy Art Museum’s “Women’s Visionary,” which was organized by the Russian artist Natalia Klimova, and the performance of the artist’s works will be presented in the museum’s new building, called the Kelsy Theater, on the ground floor of the former Kelsy Bank building.The twenty-five works in the exhibition are currently on display in the museum’s newly renovated gallery. Shagal’s sister, Anatole Shagal Corot, is also represented by LaChaux Gallery in New York and is seeking to have the works returned to the family. Sh", "The next Biennial should take place at San Francisco Museum of Modern Art, in 2021. \n\n\nArtnews is pleased to present the first three-part, “Artforum.” The series will explore the intersection of art and life with a variety of themes such as art and politics, conservation, and art and nature. The third part, “Artforum: New York,” will examine the evolution of the exhibition concept from its first exhibition at the Museum of Modern Art in 1964 to its current incarnation. The 2019 installment presented a selection of artworks by artists including Ed Moses, Ugo Rondinone, Rachel Rose, and Patricia Briggs.The third edition of Artforum will include interviews with artists such as David Cranach, Frank Gehry, and Jules and Hamlet, and will take place in the historic Museum of Modern Art, in partnership with the New York Public Library. The theme of the essay “Artforum” is also the subject of a new exhibition at the Museum of Modern Art, “Cultural Histories: Art in Motion” (2019); “Axe, Painting, and the Cinema” (2019); and “Theology in Motion” (2019).The", "The next Biennial should take place in the autumn of 2020. The exhibition will consist of three exhibitions: “Theophany and the Face of Death: Contagious Disease and the Birth of Modern Life” (1961), “Untitled: Les Demoiselles” (1964), and “The City and the Forest: A Short History of Tokyo” (1967). The next edition of the pavilion, “Theater of Operations,” will take place in the fall of 2020.<|endoftext|>An estimated 75 percent of the ten thousand undocumented tourists who have visited Italy in the last three years were not involved in organized crime, the Interior Ministry has said. The figure is a sharp contrast to the Interior Ministry’s earlier estimate, which put the number at 55 percent, that was cited by the Italian daily newspaper the Corriere della Sera as the reason for the shutdown of the tourist season. The Ministry of Cultural Heritage and Sports has now issued a new set of guidelines to help tourists re-enter Italy, and is recommending that they pay close attention when visiting museums, cultural sites, and other public spaces and carry identification documents.The guidelines, released on October 29, outline steps tourists can take to avoid being", "The next Biennial should take place in 2022 and will be the first time that the Museum of Contemporary Art (MoCA) will be inside the walls of a prison. The exhibition will also feature a number of works by artists whose work is housed in institutions that are currently closed, including   Thaddaeus Ropac, Nisene Baire, and Tanya DeCarnegie.The museum is also preparing to open its new headquarters in the city of Santa Fe, New Mexico, in 2021. It will be the first museum in the United States to house all seven continents. The museum’s current campus is in Santa Fe.\n\n\nThe Metropolitan Museum of Art in New York has completed its first renovation since its move to a new annex in the city in 1985. The institution, which is currently undergoing an expansion spearheaded by New York–based firm McKim Suss, re-creations the historic building’s interior in order to create an exhibition space for the museum’s forthcoming retrospective of Pablo Picasso.The museum’s previous incarnation as the Met featured a number of notable exhibitions, including “Picasso & the Met,” a group show of works by the celebrated German painter that ran from 1987 to 2016", "The next Biennial should be held in 2021. \n\n\nThe Dutch government approved a new $102 billion stimulus package for the Dutch arts and cultural sector on August 14, which will provide $28 billion to help Dutch-based organizations and small to mid-size galleries in the Netherlands. The funding will help mitigate the impact of the coronavirus, the virus that causes mainly respiratory illness, on art and culture in the Netherlands, which ranks fourth in the world in terms of number of cases and deaths.The state government also approved a $104 billion package for the arts and culture sector in April, which will provide $26.5 billion for artists and cultural groups, and a $98 billion package for the arts and culture sector in March, which will provide $25.4 billion for groups and individuals, and $72 billion for large institutions. “We are ready to continue making progress, given the current circumstances,” Governor Koen Geldhof, who was appointed minister of culture and the arts by Chancellor Mark Rutte, told the Dutch daily newspaper De Volkskrant. “I am convinced that this year will be a good one for art and culture. I look forward to working with you and the Dutch people to share practical solutions", "The next Biennial should be held in Shanghai in December 2020, and the first in New Delhi in March 2021. “This is a landmark year for art and the arts as we head into an era of unprecedented change and change for humanity,” said Siddhartha Giri, chair of the board of trustees of the Biennial. “It is with great enthusiasm that I welcome the finalists to the inaugural edition of the Biennial Art. The Biennial Art will continue to entertain and inform while simultaneously reflecting the most compelling and contemporary art of our time.”\n\n\nThe National Gallery of Art in Washington, DC, is planning to shutter its branch in Times Square in 2020 amid a $1 billion expansion, which will see the building expanded to include an additional gallery. The move will be made to meet demands from new international partners, including the Qatar Foundation, which also wanted to support the National Gallery’s expansion project.The move means that the gallery’s current exhibition space in the historic building will be replaced by a global art museum, and that the gallery’s current exhibition space in the East Village will be absorbed into the National Museum of Art. The new museum, which will sit on the building’s ground", "The next Biennial should take place in the autumn of 2021. The exhibition “will be an invitation to explore the radical possibilities of art and be inspired by the production of art.”The exhibition will draw from the biennial’s previous iterations in Istanbul, which were held between May and August, and will feature works by artists from the Biennial of Hannah Arendt, the Biennial of Hans-Ulrich Nachmeg, and the Biennial of Michelangelo. The April 2019 edition of the biennial, entitled “Thee,” was shot in Munich and hosted by Ludwig Wirth, the director of the Württembergischer Kunsthalle, and Wilhelm Deutsch, the curator of the Airlift exhibition. The September 2019 edition, entitled “Bifurcation II,” was filmed in Hamburg and hosted by Wolfgang Tillmans.\n\n\nThe Lamborghini Huracan LP750-4, a sports car that was designed by the Italian designer Monaghan Maior, was crushed to death by a tractor-trailer on Sunday, March 13. The 20-year-old designer and illustrator was attempting to build a prototype for a new kind of supercar, a vehicle that would", "The next Biennial should take place in the autumn of 2020. The new institution will be wholly funded by the Tenement Factory Society (TFS), a women’s group established in the late 1970s by a group of artists and activists known for championing tenant-based and social enterprises. The first festival, held in 1993, featured work by eighty-three artists.The new biennial will be led by Sophie Berger, curator of contemporary art at the Museum of Fine Arts, Boston; Tanya Fair, biennial concept designer and director at small artist-run spaces; and Stefano Corletta, a designer and artist best known for his original work, The Wheelhouse, from 1965, at which point the exhibition was a triennial. Other acts included Ricardo Castellani (2014), Sophy Jayne (2016), and Steven Heller (2018).“After more than twenty years of organizing for the biennial, the Museum of Fine Arts Boston has developed the best possible platform for The Wheelhouse’s exhibition to be staged in Boston in 2021,” Berger said in a statement. “I am thrilled to have TFS support this exhibition as it continues to advance its mission to support", "The next Biennial should focus on reconstructing the acquisition of a lost artwork from the collections of several renowned collectors: the Saatchi and Wang, the Rauschenberg, and the Mittenfeld. The curator should choose a work from one of the following: The collection of Ralph Rauschenberg, the Saatchi and Wang, the Coffee and Tea Museum, the museum of the Russian Academy of Fine Arts, the Kunsthalle Bern, and the Kunsthaus. The collection of the Kazakov-Kasper Museum and the Kogalym Film Institute, which will highlight works from the collection of Karl Wirse. Two other categories of works will be included in the show: Art history and the cultural heritage of United States and Canada. In addition to the pavilion, a number of exhibitions will be organized at the museum. The first is a group show, “The Art of Destruction: Artists and the Alka-Seltzer Process” (March 23–March 28), curated by Joseph Wiegand, which will feature works of the artist-in-residence, Joseph K. Allen, among others. The second will be a retrospective organized", "The next Biennial should be held in 2021. \n\n\nThe Museum of Contemporary Art (MCA) in New York has appointed Matthew Gartensteiner as its next executive director. He succeeds Frances Stark, who was hired to lead the institution on June 3. After working in different roles at the museum during its ten-year history, Gartensteiner will take up the post on September 13.During his tenure, Gartensteiner will work to expand the museum’s current collection and programming, which currently comprises more than 2,500 works. He will also oversee a projected $1.3 billion expansion, which will include a building expansion and the opening of a new exhibition space.“Matthew has the vision and leadership skills and the background to expand the MCA’s collections and programming into our future,” said MCA director Monica Adams. “The museum will be better equipped to sustain our cultural mission through an expanded collection and more readily accessible exhibitions and programs. Matthew’s expertise and commitment will ensure the MCA’s continued success as our city’s most prominent cultural destination.”\n\n\nThe Museum of Contemporary Art (MCA), the Los Angeles County Museum of Art", "The next Biennial should be scheduled for February 2021.  The second will be staged sometime in the 2020s. The third will take place in 2021. The fourth and final will be staged in 2022 and 2026. The museum will also launch a new digital platform that will connect with the public through interactive tours and other experiences. This new digital platform will be designed by the designer Hao Yong-On and will be hosted by the museum. The exhibition will also feature a special exhibition of works that were created by the curators of the exhibition, which will be held at the museum from February 12 to February 15, 2020.\n\n\nThe newly appointed director of the Museum of Contemporary Art (MoCA) Los Angeles, Paul Mpagi Sepuya, will retire on January 31, 2020 after twenty-five years at the helm of the museum. Sepuya will succeed Lenny Abraham, who has served as director of the museum since 2000, at the end of his term in January 2021.“I’ve been a board member of MCA for twenty-five years and have been a huge supporter of Lenny’s vision and leadership as director of the Museum of Contemporary Art, Los Angeles,”", "The next Biennial should be held at least six months after the end of the current exhibition. The 2020 edition, involving some twenty thousand artists and curated by the artist-run initiative the Biennale Ensemblages, will open on March 21 and run until March 27.The artists participating in the 2020 edition include  Nekra Gharib, Wangechi Mutu, Ayao Aoyama, Gregorio de Rivera, Ahmadinejad Akram, Nadia Bose, Devika Bose, Abdul Halil, Sara Jaffrey, and Anwar Raad. The theme of the show is “Art and Technology: Dual Cultures,” and it will feature artists whose work is based on both modern and ancient art traditions.The biennial’s theme of “Art and Technology” was chosen by the museum based on the developments in the field of artificial intelligence (AI), the scientific method, and the development of AI technology in general, and its inclusion of artists and thinkers whose work is in a position to challenge the current discourse on AI and artificial intelligence. The exhibition will also feature works by artists whose work has had a significant impact", "The next Biennial should be held in 2021. The exhibition will be hosted by the Museum of Modern Art in collaboration with the Institute for Biennial Studies at the Yale School of Art. More information about the upcoming exhibition can be found on the museum’s website.\n\n\nThe University of California, Berkeley, has released the first set of guidelines for the campus reopening and redevelopment project, which is being spearheaded by the City of Berkeley and is expected to last for thirty days. The guidelines, released on Monday, outline steps students and faculty can take to assist in the reopening and building of a new Berkeley campus.The city unveiled its reopening guidelines in June 2019, when it reopened to the public for the first time in fourteen years. The guidelines were developed with input from the Berkeley Parks and Recreation Department, which is working with the city to construct a new public gathering space for the campus, and include a number of recommendations that have been adapted by city officials throughout the years. Among the key elements of the reopening plan is a call for all campus buildings to be inspected and to have exterior paint, grout, and water-based protection systems in place.The city’s aim with the renovation of the UC Berkeley campus is to make it �", "The next Biennial should take place in the spring of 2021. The forty-two-year-old festival will be staged in partnership with the Metropolitan Museum of Art and will begin with a series of lectures by Yoko Ono and Kenji Hamau, scheduled for March 20–March 21, 2020, and will conclude with a special exhibition of new works by Kenji Hamau at the Japanese Embassy in Washington, DC, in March 2021.The 2019 Biennial, titled “From the Planet to the Body,” was organized by the Metropolitan Museum of Art, and took place at the old Ridley Scott’s factory in Lower East Side. Among the works selected for the inaugural show were Polaroid’s Painting of the Body\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Jill Hetherington as its next director. Hetherington will assume her new post on April 3. “Jill is a seasoned leader and curator, having led two groundbreaking commissions: the first installation, ‘The Fifth Element,” in 2009, and “The Birth of a Nation,” in 2011, which was staged at the Los Angeles County Museum of Art (LACMA). She", "The next Biennial should be held at the University of the Arts, London, in 2021. The 2019 edition of the event, titled Art in America, was a joint project of the Museum of Modern Art, New York; the Art Institute of Chicago; and the Flemish Folk Museum. The biennial collected seventy works by seventy artists between 1948 and 1964.The 2019 exhibition also featured selections from the 15th edition of the Berlin Biennial, which was held in the former prison community of Auschwitz in April 2019, as well as the sixty-fifth edition of the Museum Freiheit in Cologne, which will open in the autumn of 2020. Curated by Wolfgang Städelschau (Germany), the biennial will comprise sixty works by forty contributors, with a new selection of works each year.The show will mark the seventeenth edition of the Biennale di Milano in Rome, which will continue in the city of Milan until March 2021, and will be held at the Museo d’Arte Moderno, in Florence, from March 19 to March 21, 2021. \n\nThe Smithsonian’s National Gallery of Art in Washington, DC, has dismissed a senior curator who criticized a painting by Pablo Pic", "The next Biennial should take place in January 2020, in the city of Beijing, which has never hosted a full-scale exhibition and is currently undergoing a renovation. Foundation president Marc-Olivier Wirth said: “Despite the extraordinary circumstances in which we are working, we are confident in the future of Vision+. It is possible that we may reach the milestone of three hundred exhibitions in the next year.”In the past two years, the foundation has organized nearly 10,000 exhibitions, including the upcoming “Out of Africa” (2019); “Epigrams: Fashion” (2017); “The Hunchback of Notre Dame: A Modern Look at Art” (2017); and “The Transition of Art” (2016). Last year, the foundation released its first “tour guide”, as well as a new “Out of Africa” and “Epigrams” series, all of which were curated by artists from Africa and the African diaspora.\n\n\nThe Metropolitan Museum of Art in New York has hired Gillian Wiles, who previously served as the curator of “Politicos: The Musical” (2014–", "The next Biennial should be held in 2020.The third exhibition, “The Painted City: Art and Architecture in the Age of Romanticism” (2019), is currently on display in the companion exhibition “On the Skin: Art and the Skin in Contemporary Art” and will be presented in the third edition of the Montréal Biennial, “Queer than the Eye: Art and the Body,” in 2022. \n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of more than one hundred works by twenty-six artists from the artist-run nonprofit Art in the Streets. The museum acquired the works from the Philadelphia-based nonprofit on April 3, a day after MoMA cochair Donald DeAngelis announced that he would be leaving the institution to become president and CEO of the Maryland-based nonprofit Artistic Climate Center.DeAngelis said that the gift of the works is one of the largest ever given to the museum. It also includes works by twenty-four artists who are participating in the next iteration of the Museum District, which celebrates the city’s central waterfront and is scheduled to run from September 9 to October 3. The works, which are by artists such as", "The next Biennial should take place in the spring of 2021. The 2018 event, 'The Great Artist-Opera-Outpost: Venice 1815,' was held in March and featured works by seventy-seven artists and collectors. Next year, the Biennial will take place in May, and will include works by forty-eight artists.The theme of the 2020 edition is “Life and its Connection with Objects,” and the full list of participating artists is as follows:Arturo Barbosa, 2019Gianfranco Barso, 2019Leonardo Barbosa, 2019Igor Bernini, 2019Shirley-Anne Barra, 2019Elvia Barra, 2019Jacqueline Danza, 2019Rory Barra, 2018José Ramírez, 2019João João Pessoa, 2019José Luis Pessoa, 2019Igor Muñoz Pires, 2019Olivier Pessoa, 2019Hiroshima Aoki, 2019László Nemczyk, 2019Sawang Sentara, 2019Marcelo Poncelet, 2019Kasmina Lørk,", "The next Biennial should be held in 2020. The current exhibition, “Feminine and Other Dimensions,” is slated to be on view until March 27 and will be shown later this year. The 2019 event highlighted both the work and life of the late Chinese artist Li Xueqi and the artist’s earlier works. The artist’s remains are on display in the exhibition “The Birth of a Nation,” which opened at the Museum of Modern Art in New York in 2017.\n\n\nLos Angeles’s Metropolitan Museum of Art, which was forced to close due to the coronavirus, has appointed Sean McLaughlin as its next director. McLaughlin will take the helm from Harlan J. Gee, who retired in November 2019 after more than eight years at the helm of the museum. He succeeds Kenneth Feinberg, who served as the museum’s director from 2018 to 2020 and was succeeded by Leslie Ann Horne in November 2020.“We are thrilled to welcome Sean to the Met,” Gee said. “The Met is a singular institution, a living museum, and we are grateful to have had the opportunity to work with Sean for more than two decades. He has been instrumental", "The next Biennial should be held in early 2021. We look forward to the program’s launch and will continue to support the work of the artists who have shaped the City of Toronto with our annual Biennial Grants.\n\n\nThe Metropolitan Museum of Art in New York has announced that it is planning to open its first arts space in the city in 2021. The Museum will also introduce new programming, including a multi-hundred-year retrospective of the artist-designed works of the late designer J. Paul Getty.According to the New York Times, the museum is currently working on a redesign of its campus that will incorporate more art galleries, more museums, and an expanded library. The new plans were made in collaboration with architectural firm I.M. Pei and S.W. Mje/L.L. Pei, who designed the museum’s original location in Manhattan, as well as with artist-activists Lillian Albright and Kirsten Spall, the founders of the popular Brooklyn arts space the Bowery Ballroom, which recently faced a lawsuit over ticket prices. While the museum will continue to host regular events, the opening date has already been moved forward to 2021.According to the New Yorker, the museum", "The next Biennial should take place at the Alexandra’s Museum, in New York, in 2021.  Michael W. Kazin, the president and CEO of the Metropolitan Museum of Art, said: “The new millennium promises to be an exciting and challenging one for art. In seeking a new way forward, we have been inspired by the themes of art in recent years, and by the transformation of contemporary culture. We believe that the future of art is intertwined with the future of New York City and the arts are central to making that future a reality. . . . It is a special honor to be able to contribute to that legacy.”\n\n\nThe Hong Kong-based nonprofit \"ArtAsiaPacific\" has received a gift of eighty artworks from the Hong Kong–based collector and collector-s dealer Wolfgang Schäfer, a prominent Hong Kong art collector known for his generosity and expertise. The gift includes artworks by artists such as Jean-Luc Godard, Ingmar Berg, and Edvard Munch; sculptures by Serge Gainsbourg, Elisabeth Büttner, and Matisse; and photographs by Hull and Steiglitz.The organization was recently approached by lawyer and collector Guan Yu to provide the collection", "The next Biennial should be held in 2021.  \n\n\nThe Italian government is considering new legislation that would require foreign galleries to register with the country’s government and allow the government to inspect the premises of foreign organizations. The proposed legislation is part of an initiative to address the country’s economic crisis, which has led to the closure of many galleries and numerous layoffs.The legislation, which is currently being studied by parliament, would require foreign galleries to temporarily close to prevent the mass layoffs and the government to temporarily shut down several Italian galleries by December 31. The authorities would be allowed to reopen galleries if the galleries complied with certain safety measures.The legislation has faced opposition from some cultural figures who fear that the move could lead to the confiscation of works by foreign galleries that are housed in Italy, including in the case of Max Mara’s Galleria di Rivoli in Venice. The government has since defended the move, saying that it only needs to inspect the premises in order to continue to operate. While it has stated that it will not take action against a foreign gallery that is found in violation of the legislation, it has vowed not to comply with the new regulations.It is unknown whether the legislation, dubbed the Italian State of Emergency, will pass its", "The next Biennial should be held in June 2021 and will include works that reveal the deconstruction of the self. “We are committed to expanding the scope of the exhibition to reflect contemporary issues and activities, and to develop and present new and previously unexamined experiences,” said Jean-Michela Cachet, president of the biennial.In a statement, the exhibition said it is “tremendously proud of the work that the biennial has presented to date and the many critical questions it has raised. The new exhibit will provide an opportunity for researchers and artists from the United States, Europe, and Asia to reflect on their own and other cultures through a new lens.”Previously, the exhibition featured art from the United States and Europe. The biennial is scheduled to run from March 9 to March 12, 2021.\n\n\nThe Museum of the City of New York (MoC), Brooklyn, has announced that artist-in-residence Domenick Amoroso, who has spent the past two years training to become a fully functional member of its own institution, will continue to work with MoC on the museum’s collection and presentation of its collection. Over the course of his career, Amoroso has", "The next Biennial should take place in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Neal Benezra as its next dean of arts and design. Benezra, who has served as MFA’s curator of modern and contemporary art since 2011, will take the helm from Jen McCarthy, who retired last year after eleven years at the helm of the Museum of Fine Arts (MFA), where she has helmed the institution for sixteen years.“The MFA is a great contemporary art museum that has consistently challenged and advanced the boundaries of modernism, but rather than focusing on how art of today shapes tomorrow, Benezra and McCarthy focus on how art of tomorrow shapes today,” said museum director Peter W. Jackson. “We are grateful to Jen for her dedication and leadership, and we look forward to her continued leadership and stewardship of the MFA.”In his new role, Benezra will be responsible for ensuring the museum’s long-term sustainability, which is a core mission of the institution. He will also oversee the development of a new master plan for the museum and oversee educational initiatives and public programming.Commenting on his appointment, Benezra said: �", "The next Biennial should be held in 2021 and the exhibition should cover the history of the human body. Submissions are restricted to artworks and are not eligible for awards. The 2019 Prize was awarded to artist and designer Willy-Ollie Mape, who is best known for his body of work, which incorporates sculptural elements from his own body, and was judged the winner of the 2019 Artist-in-Residence Award.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) has added a new collection of works by the late Harlem-based artist Betty Hutton to its holdings. The new five-thousand-work collection, which depicts a multi-racial African American family in the early 1900s, will be shown in the museum’s “Race and Desire: Art and Race in the 1950s” exhibition, which opened on Thursday, April 29. The show is also expanding its focus on race and the Black experience. In the upcoming season, the museum will also display a selection of paintings by the late artist and theorist George Alsop, which will be on display in the “George Alsop: The American Negro” exhibition.In conjunction with the exhibition, the museum will host", "The next Biennial should be held in 2020. <|endoftext|>About This Game\n\nWhat is it like to be a part of a project that will last forever? The story of the Sierpić Art Museum, a project of the KW Institute for Contemporary Art, and the Indira Palanin Collection, a collection of rare works by Polish artists, is a short-lived but thrilling adventure that attempts to answer these questions.The game takes place in a fictional world in which a group of artists, including Janusz Kupka, Jasa Tadecki, and Béla Zbáńk, grew together in the early years of industrialization, the Soviet era, and the Eastern Bloc. The game immerses players in a strange and wondrous world populated by characters who have all been created with the same goal in mind: to create a work that will last forever, perhaps for thousands of years to come.Crowdfunding platform Artotron Games plans to create a virtual reality experience that will allow visitors to visit the museum and experience the works of artist-in-residence Holger Schmidt, the museum’s director, and his wife, Maria, as well as the museum’s collection and archives", "The next Biennial should, in principle, be ready in late July or early August—and I believe the Riot Games team’s initial timeline for the exhibition was for the exhibition to open in late August.I understand, from the Filipinos who are pressing the organizers to take the exhibition offline, that the decision to keep the exhibition going is based on the belief that the performance may be canceled if the exhibition’s architecture is not retitled and rebranded.It is also possible that the organizers will continue to stage the exhibition in collaboration with the Singapore Art Museum and the National Gallery of Singapore, even if the museum is closed. Perhaps most importantly, though, the Philippines has been a launchpad for international artists at critical moments in their careers. For a decade, photographer Rizal Yap, whose photographs and drawings captured the Indonesian diaspora and shaped many a Philippine identity, launched his career in the country. Filipino writer and curator Herminia Montano—one of the founding members of the feminist group the Malay Women’s Group, which lobbied for recognition of the Indonesian presence in the country—joined the National Union of Journalists of the Philippines (Ninipalex) in 2007. The same year, the Filipino novelist and", "The next Biennial should be held in the Spring of 2020, and in the Spring of 2021. The 2019 and 2020 editions were held at the Museum Stuttgart, and the 2019 and 2020 exhibition seasons were staged entirely on location at the museum. The museum has already announced its attendance for the 2020 edition, which will be held at the Kunsthalle Basel from March 15–March 16, 2020. For the 2019 edition, the museum curated a show of work by Wangechi Mutu (with Nami, Nari, and Tunga) and the 2020 event will mark the first time that the museum will open in an airplane.\n\n\nThe Center for Contemporary Art (CCA) in New York announced today that it will open a new $2.5 million museum dedicated to the work of Hisham Bey and his contemporaries. Located at 9 East Forty-Second Street, the museum will be inaugurated by a solo exhibition of Bey’s work, “Under the Rainbow,” at the Brooklyn Museum on April 29. The museum is being co-chaired by the artist, curator, and writer Doris Salter, and will be inaugurated by Bey’s work", "The next Biennial should take place in 2021, and the first in 2025. In addition, the venue will host a series of exhibitions that will evaluate and reflect on the latest research and development, exploring historical and contemporary themes. The exhibition will include works by seventy-five artists, whose work and impact are represented by twenty-one artists’ shortlisted.  The twenty-fourth Biennial of Modern Art, held in London in 2016, was the first to be curated by a woman; it was also the first to take place in one of the city’s museums. The biennial’s next iteration will be held in 2020 in London, and will include works by forty-four artists who are represented by the British Council.\n\nThe Museum of Fine Arts (MFA) in Boston has received a $10 million donation from the Sacklers, the Warren S. and Mary (WMS) Foundation, and the Walton Family Foundation. The gift is the largest gift to the museum in its history. The $10 million comes after the donation of two large artworks, the French modernist Lévy Gorvy’s portrait of the American poet Laura Poitras, and the British artist Richard Anuszkiewicz’", "The next Biennial should be held in 2021.”\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles is working with the Los Angeles County Museum of Art (LACMA) to create a new public art space featuring works by artists such as Richard Avedon, Thomas H. Neeley, and Paul Gauguin. The plan is to open the new museum on the city’s CityCenter campus in 2020.Although the exact date and venue of the new museum have yet to be determined, the event will be held outdoors in the city’s Studio City, which is located on the third floor of the newly remodeled Arts and Entertainment District (ACE) at 1600 S. Santa Monica Boulevard, between October 20 and October 22. The new space will be called the Spirit of LA, and will host events and screenings, screenings, and performances, and will serve as an extension of LACMA’s existing outdoor space.The museum is partnering with the City of Los Angeles on its proposed $60 million redesign of its Pasadena Boulevard amphitheater, which was completed in 2017 and is slated to open in 2022. The renovation plan, which was approved by city council in 2018, includes the addition of a new", "The next Biennial should take place in 2020. The Art Newspaper reports that the forty-three-year-old museum, which is located in a former munitions factory in the city of Biarritz, in central France, is currently still working on its new collection of approximately 1,500 works. The work of the presenters will be curated by the American-born, Paris-based curator Pierre-Yves Stebbings.Commenting on the museum’s upcoming 2019–20 season, the institution said: “We are very pleased to announce that, following the initial projections of the forty-three-year-olds, we will present the first exhibition of works by our biennial designers in 2019. The exhibition is titled ‘The Biennial.’ The Biennial is the start of the new exhibition program. We have always believed that exhibiting works from the biennial program was a natural extension of our existing programming. The work of the biennial program reminds us how much the art world needs our programs to move forward.”\n\n\nFrieze has released the list of seventy-five artists and collectives that will participate in its upcoming edition in Hong Kong, which will take place July 29–July 31, 2020", "The next Biennial should be held in 2021, and the next one in 2022. The first exhibition at the new museum will open in 2020, and the next one in 2021. The first exhibition at the new museum will open in 2020, and the next one in 2021. This is the message of the pavilion, which was created in collaboration with a group of local and international artists and designers. For the first time ever, the pavilion will be dedicated to two major works of contemporary art, one by a woman and one by a man. The exhibition will be curated by Barnaby Rau, head of the contemporary art department at the Victorian and Edward Hopper galleries, and will be inaugurated by a performance by four artists who have worked together for more than twenty years: Rahman Roch, Aline Kraus, Svetlana Vladimirova, and Elena Zvyagintseva.The announcement comes on the heels of the biennial’s presentation at the Museum of Modern Art in New York last week. The exhibition, “The Body in the Studio” (March 26–March 28), featured work by twenty-six artists and collective names, including Arkadijas, David", "The next Biennial should be held in the Spring of 2020, but its organizers are currently looking into whether a new event, “The Odyssey of Art,” could be staged in the autumn or in the spring.\n\n\nThe pioneering Danish artist Olafur Eliasson, who created works such as his famous Paintings of Grass, which was exhibited in the first edition of the Danish Biennale in Copenhagen in 1965, has died at the age of eighty-eight.Born in Copenhagen in 1932, Eliasson moved to Oslo in 1941, where his father would eventually found the Center for Arts and Nature, which would eventually become the Museum of Modern Art. Eliasson enrolled in the University of Oslo in 1953, where he met his future wife, Ann. They married in 1959, but the couple eventually divorced in 1964. In 1995, Eliasson moved to Berlin, where he remained until his death. He continued painting in his apartment, but between 2001 and 2009, he lived at the Museum of Modern Art in New York. In 2011, the Museum of Modern Art and the Danish Academy of Arts jointly awarded him the Second Danish Prize.In 2016, the museum presented the award to the late Swedish abstract painter Hans Jonas,", "The next Biennial should be held in 2020. The twenty-third edition of the Biennial will take place in 2022. The twenty-eighth will be held in 2023.  Lennon said: “I’m hopeful that this excursion into the humanities and the social sciences will yield a new synthesis of values and visions through which all of us may be inspired, inspired, and inspired anew.”\n\n\nLennon World Headquarters has announced that Kate Middleton and Jonathon Porritt will stage a new exhibition, “After the End of the End of the World,” at the arts space in 2019. The show, titled “The End of History,” will explore the notion of the ‘end of history,’ as the most urgent and urgent issues of our time. It will also examine cultural, political, and economic collapse, and its impact on human health and well-being. The twenty-fourth edition of the biennial will open in 2021. The biennial’s theme, “Rethinking the Future,” will be revisited in 2022 and 2023.\n\n\nThe Christie’s auction house in New York announced today that it has", "The next Biennial should focus on “postcolonialism” (a non-Western concept) and “autobiography” (a biography). The exhibit, which will be based in Seoul, will be hosted by the Japanese artist Rina Kawamoto and will take place across five campuses in the capital of Seoul, Gyeonggi Province, from March 21 to March 28. The event will be led by Ms. Kim Eun-sung, director of the National Museum of Contemporary Art Seoul.\n\n\nThe National Museum of Contemporary Art (NMCA) in Washington, DC, has received a gift of more than 14,000 photographs depicting the work of Korean American artist HyunAe Park. The work, which was displayed in a solo exhibition at the institution last year, was cut from a book called The Chicago Manual of Style (CCM). The show was inspired by Park’s exploration of the evolution of photography with an examination of the relationship between landscape and the photographic medium.“We are honored to present an exhibition of works by a Korean American artist whose work is central to both contemporary photography and the history of photography,” said Mark Beasley, director and CEO of the museum. With the gift", "The next Biennial should open in 2021 and will encompass an exhibition of the work of forty-two artists. The festival will be held in mid-March and will aim to present the most exciting contemporary works by the artists represented. Its program will include a gallery show, a film series, and a public symposium.“We are thrilled to continue the work of the Biennial without a doubt, its seven-year anniversary. The exhibition will be a significantly different experience, and we believe the exhibition will be a success.”The biennial’s first artist, Olu Mutsvai, will present a solo exhibition at the Biennial in March 2020. The show will also include a book, a digital exhibition, and an exhibition of works by ten artists selected by the inaugural group. The biennial’s second iteration will take place in March 2022 and will include four exhibitionists: Niles Yildiz, Nefertiti Galambayi, Julian K. Johnson, and Daino Kogado. The biennial’s third, its fourth, and its fifth editions will be held in March 2020 and March 2022 respectively. The exhibition of the artist’s work will be held at the Biennial in", "The next Biennial should take place in the spring of 2020 and will come at a time when many artistic and cultural spaces are suffering from sudden closures. Among the most ravaged is the National Museum of Art, where many works by Damien Hirst are currently on display. On Monday, the museum announced that its construction by the end of 2020 would be delayed. “The National Gallery of Art’s construction is not over,” said museum director Atsushi Abe. “It has been an incredible experience to work with the National Gallery of Art’s wonderful team, and for the last two years we have been working in partnership with them. I am confident that we will be able to return the National Gallery of Art to life in 2021.” The National Gallery of Art, which has been working in partnership with the Jackson Foundation since it was founded by businessman Sam Jackson in 1989, is planning to reopen in 2020. It will also develop new programming that will be directed at youth, who make up the majority of its attendance. The institution will also increase its staff size by tenfold and has named Marlene Cammock as its new chief executive and chief curator.“The National Gallery of Art has been one of the most", "The next Biennial should be held in March 2021.\n\n\"Our team is very excited to be working with the contemporary artists who have been brought into the museum. We look forward to presenting them the latest artwork from the biennial in May 2020. We are delighted that they will be able to experience the exhibitions as a part of the Biennial, the Museum, the Art Museum and the Contemporary, and the Frieze Art fair in June 2020. It will be a great opportunity for the museum to relish the exhibition of the works of the artists who contributed to the Biennial in its first edition. We look forward to working with our contemporary artists and their audiences in the months ahead.”\n\n\nThe Art Newspaper reports that the Danish government has given the kunsthalle Bergen-Belsen-Bickel its largest influx of funding yet as the Danish pavilion at the second edition of the Art and Design Biennial (ADB) takes place in the former concentration camp at the former Sachsenhaus in Berlin. The kunsthalle, which was set up with funds from the government’s cultural fund for arts, has received $1.5 million from the Danish Arts Fund. The sum is a record for Denmark’", "The next Biennial should launch in 2021. “I am so excited to open the doors of the museum and introduce new generations of visitors to the museum,” said Giacomo Balla, director of the Museo de Arte Contemporáneo São Paulo (MASP). Victor Hugo Boss, president of the Brazilian Museum of Fine Arts, and a former trustee of the institution, also underscored its importance in Brazil, saying: “These are the moments that will define our relationship with the world.” The museum has added three new works by women artists to its collection this year, including Yuri Averbakhinaõs “Eleanor and Beatrice,” which shows Eleanor as she appears in a French painting. The museum also revealed that it is planning to create a new collection dedicated to women’s culture, with the current exhibition “The Museum of Women’s Culture.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Nancy E. Kober, who has served in the role of director of the institution since 2011, as its next director. Kober previously served as director of the Museum of Contemporary Art Los Angeles (M", "The next Biennial should be held in 2020. In the meantime, the exhibit has been moved to the Visitor Experience Center. The museum will now be held as an open forum for the voices of artists and critics from Central Michigan. “I would like to thank our partners in the Greater Grand Rapids area and particularly the Cleveland Museum of Art for their understanding and cooperation in this matter,” said Jordan. “This is a game-changer for the Grand Rapids Arts Council and the Arts Council as a whole.”\n\n\nThe Metropolitan Museum of Art (the museum), a private museum founded by billionaire collector Herbert Lund in 1941, has received a gift of more than eight thousand photographs by Pierre-Auguste Renoir\u0097a man whose influence on photography has been so profound that it is almost impossible to overstate his contributions to photography.The gift of the works, which include portraits by Renoir\u0097including his famous Portrait of a Young Woman in a Baroque Dress, 1931, which is currently on view in the newly renovated and expanded Renoir Gallery\u0097is a fitting tribute to the man who shaped the medium of photography to serve as a model for the Met. Renoir first met the museum in 1944, when", "The next Biennial should be held in September 2021. \n\n\nThe Egyptian Ministry of Culture announced that it awarded $1.5 billion in grants to cultural organizations in the country in an attempt to induce them to restructure and compensate for the economic fallout of the ongoing Egyptian revolution. According to the New York Times, the funds were awarded in a $2 billion aid package that was passed by Egypt’s National Council and approved by President Abdel Fattah El-Sisi.The National Arts Program, a $2 billion initiative that was established in 2016, was established to promote cultural activity, increase the number of artists participating in arts programming, and provide financial aid to organizations that are struggling under the impact of the Egyptian Revolution. The program was launched after the country’s Ministry of Culture and the Antiquities agreed to jointly distribute $2.5 billion in grants over the next three years, totaling $3 billion.In a statement, the ministry said: “The National Arts Program was created to support the creation of employment and self-supporting creative enterprises both locally and across Egypt. It aims at creating an environment conducive to the further development of artistic activities and artistic talent in Egypt. It supports projects that advance artistic and artistic-related thought and", "The next Biennial should be held in 2021. Reversible-Threshold, a contemporary art exploration through new and existing media and how it could be used to re-create the historical practices of art and architecture through three generations of the artist, is currently on display at the Biennial. Kasmin’s new collaboration with the National Gallery of Scotland will also take place during the exhibition, and the artist will collaborate with the gallery on the exhibition “Living on a Mission,” which will open at the National Galleries of Scotland in March 2020. In addition to its London, New York, and South London locations, the exhibition will also present works by artists such as Adam Craig, Nari Ward, and Shimon Cohen. The Seattle location will be a collaboration with the Seattle Art Museum, the Seattle Performing Arts Center, and the Seattle Asian Art Museum.Currently on view at the Biennial is Radical, a series of paintings by the artist Tom Waits and a string quartet by the artist Max Beckmann, among other works. Announced last year, the show will feature work by three new and emerging artists, Kate Crawford, Kei Miller, and Christo, which is scheduled to end in October.", "The next Biennial should be held in 2022 and is currently in the planning stages.\n\n\nThe biennial Biennale de Lyon (BL) has announced that it will hold a special exhibition dedicated to the life and work of veteran French painter Henri-Georges Seurat in the summer of 2022. The exhibition will take place at the newly renovated Museo de Arte de Lyon (MAS) in the north of France, and will offer six works by the artist to the public.The exhibition will consist of six works and will premiere in June 2022. The exhibition will also celebrate the thirtieth anniversary of the exhibition and will present the first editions of the exhibition. The artist has been a fixture at MAS over the years and has had solo exhibitions at the Museo de Arte Mendoza (Tuscon), the Museo de Bellas Artes in Bilbao (Tuscon), and the Museo de Arte de Lyon (MAS).Commenting on the event, Mamada Naidoo, director of the Museo de Arte de Lyon (MAS), said: “The theme of the exhibition is the relevance of Seurat to modern and contemporary art. The materials selected for the exhibition were chosen for their inherent beauty", "The next Biennial should be in the spring of 2020, and the exact date and location of the event will be announced by the organizers in the coming months.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is planning to begin welcoming visitors with an open invitation for the first time in 2020, with the intent of allowing visitors to the museum to experience the institution as soon as possible. According to the New York Times, the museum’s director, Andrew Kreps, told the publication that the open-air sculpture-filled space will be accessible to the public from June 12 to June 15, and will host the first exhibition in the biennial, “What Lies Beyond,” in June 2021.The first show will be a “list of works by American artists that have been lost to the Covid-19 pandemic.” The exhibition will examine the ways that art and culture can be reworked to address social and environmental challenges. Curated by Gardner North and Ellen Willis, the show will feature work by thirty-eight artists—including Yinka Shonibare, Mark di Suvero, and Louise Nevelson—and consists of works that are not currently on view. The exhibition", "The next Biennial should take place in the first half of the year 2100 and will be attended by an audience of approximately 40,000 people. The title of the exhibition will remain the same: The Drunken Trunks. The theme for the exhibition will be “Theoretical Surrealism” and the selected works will be curated by Seiji Mochizuki, director of the Kogaku Museum in Tokyo; Yoshiko Kawamura, director of the Edoardo Modigliani Art Museum in Venice; and Kunihiro Takayama, director of the Masataka Museum in Kyoto. The exhibition will be staged in conjunction with Biennale de Lyon, which is slated to open in May.\n\n\nThe Museum of Modern Art (MoMA) in New York has issued a statement regarding the possibility of a future exhibition devoted to the work of East-Coast Native artists, following a petition recently launched by the movement “Artists United for Human Rights.” A copy of the statement is available in full below:We support the petition, and we want to collaborate with MoMA to explore the possibility of presenting the work of artists in our community who have come against the backdrop of powerful institutional and state policies. We are aware", "The next Biennial should be on “subjective political experience,” which will address the current international crises and conflicts. It will also feature a performance by the artist-run group MØSTIC, whose members include the artist-activists Birgitta Veldhuys, Fatima Zins, and Christopher Wool. The exhibition will go on until December 19, 2020.In the novel, which is set in a fictional city in the Alsace region of Germany, the artist-activists and a group of friends are protesting the country’s new counterterrorism law, which they say will stifle freedom of expression and prevent them from participating in a conversation with an American artist, Max Eastman, about terrorism. The group decided to make a statement so that the German government could respond to their concerns. After their planned protest, the group signed an open letter that read: “We, the undersigned, express our outrage at the brutal government’s crackdown on artistic freedom and freedom of assembly.” The letter is signed by the group as well as seven other artists; the artists were Hannah B. Jones, Willem de Kooning, Daniel Loos, Damien Pola, Marcelo Biagini, J", "The next Biennial should be held at the historic city of Nuremberg in spring 2020. The first exhibition will be “The Rise and Fall of Imperial Germany,” which will be on view until January 22, 2020. The second, “The Great Deception: Nazi Germany, 1937–1945,” will be on view until February 26, 2020. The third will be “The Manhattan Project: A History of Modern Physics” in the fall of 2020. The fourth, “The Art of War: World War II and the Art of Destruction” will be on view until April 24, 2020.The Berlin Biennial will launch this fall with a retrospective of artist Albrecht Dürer at the Museum der Moderne Berlin. Dürer’s work, which was included in the first edition of the exhibition, “Dürer 1941–1946” (2019) at the museum, will be included in the second version of the exhibition, “Dürer.2” (2019–2020) at the New Museum. The exhibition will also introduce a new section for contemporary art’s “opportunities of the dark side” with a selection of", "The next Biennial should be held in the spring of 2021.\n\n\nThe 2015 biennial of the Philadelphia Museum of Art, which was produced by the Philadelphia-based nonprofit The Marking Factory, has announced that it will not be reopening in March 2020. According to CNA, the organizers cited the health of the artist-run nonprofit as the reason for postponing the exhibition, which was due to open on March 20, and have informed the supporters of the organization that the date of the next edition will be announced in the spring of 2021. The twenty-sixth edition of the biennial, titled Artforum, will also be held at the Museum of the City of New York in the spring of 2021.Museum director Matthew Teitelbaum said: “We are thrilled to announce that Artforum will join the Philadelphia Museum of Art and the Museum of Modern Art in March 2021. We anticipate being able to present the exhibition in the spring of 2022 and have been working for over a year to make sure we are ready for prime-time. Our artists, working across all disciplines, will be honored to host Artforum. We are confident that once the biennial reopens, we will have the opportunity to present this", "The next Biennial should have been held before the events of the past few weeks. As we wait for the next edition of the Biennale, let us remember the artists who have founded our cities and who are shaping our future. This year we welcome you.\n\n\nThe National Gallery in London is asking the government to establish a new $1.15bn fund to compensate arts workers who lost income as a result of the Covid-19 pandemic. The request is one of several by local authorities across the UK as they try to mitigate the financial impact of the pandemic, which has officially ended on January 8, and has led to a number of closures.According to the Art Newspaper, the National Union of Journalists of Great Britain has issued a statement in support of the National Poetry and Poetics Academy (NPPA), which has been closed since March due to concerns over the coronavirus. Writing in a letter addressed to David Cameron, the authors of the letter argue that the covid-19 pandemic has had a \"devastating impact\" on the arts, and that the government must do more to protect the UK’s workforce from Covid-19-related illnesses. The letter also claims that the NPPA’", "The next Biennial should take place in the autumn, with the goal of creating a new public space that will be able to host exhibitions, performances, and other events in a way that does not interfere with the activities of the existing institutions. \n\nThe expansion of the platform AstraZeneca, in partnership with the architect Jørgen Nordenhake, has announced plans to open a new biennial in the Swiss Alps, following the completion of a major expansion project in Lille. The new exhibition format will introduce a two-hour “breakfast” show, “The Evolution of Space” (September 22–October 22), and will feature works by eight artists and will be presented by the Swiss-based artist Christian Hofmann.Nordenhake’s recent projects include “Jasper Johns: A Space Between,” 2019, in New York City, and “Laura Owens: The Shape of Space” (2019), a solo exhibition at the New Museum, which has not yet announced the new program; and “The Light Project” (2019), a large-scale installation at the Château d’Art Contemporain in Basel, which consisted of three hundred linear", "The next Biennial should be held in 2020 and the current edition will close after the New Year. The organisers are also planning to open the first exhibition dedicated to the American human rights activist Rosa Luxemburg in 2021.\n\n\nThe French museum Trétin will permanently close its doors in Paris and will reopen in the capital’s Saint-Rémy-de-Provence neighborhood in the next few months. The move follows the country’s decision to end its engagement with the multi-hundred-year-old institution, which houses more than 4,500 works by more than 150 artists.The institution was founded in 1892 by Alphonse-Max Gilli and Jean-Jacques Bière in Paris. The pair relocated to Trétin after Jean-Jacques’s death and founded the Paris-based organization the Gallery of Modern Art (MoMA), which had a permanent exhibition space in the former Prada factory. Trétin also opened the small arts space 09 Arles in 1998. In January 2018, the institution announced it would close its doors, citing the uncertainty caused by the Covid-19 pandemic as one of the reasons. According to the New York Times, the museum has yet to articulate any plans", "The next Biennial should be taken up by August 2020. The next Biennial edition will be held at the Stanley Museum of Art in California and will feature new or reworked works by more than seventy artists, including Henry David Thoreau, Thomas Moses, and Leonor Carrington.\n\n\nThe British Museum in London will open its new gallery on the city’s extensive Great Western Railway in 2020. Designed by London-based firm Bauhaus design house Frederick Hallet Architects, the new twenty-thousand-square-foot venue will be inaugurated by the unveiling of a new work by British artist Cécile Bannister, who first debuted her take on the train in a 1980s retrospective at the Metropolitan Museum of Art. The show, titled The Architecture of Structures,  won the Prix d’Art et d’Ors, and the work, which was inspired by a trip to London aboard the SS Northern Line, has since been adapted for film and television and has been collected by the British Film Institute.Bannister, who has lived in London since 1948, began her cross-cultural project in 2001. “If I had done my research for 25", "The next Biennial should be held in 2021. “The exhibition of the work of George Carlin, as well as that of the immediate predecessors,” said Klaus Bohn, who is now director of the Vienna Biennale, which will also feature a live performance and a children’s book. Italian arts director Claudio Calvesi added: “The theme of the thirty-fifth Biennale is the social, the material, and the spiritual. This year’s edition challenges us to think of the future in a new way and seeks to showcase the extraordinary range of the contemporary art.”The 2020 edition of the biennial, titled “The Other,” will offer a retrospective of the work of Maurizio Cattelan. The show will also feature a retrospective of the work of Sylvia Bocconi, which will open at the Palazzo Prada in Venice, in the summer of 2021.The Venice Architecture Biennial was created by the Ministry of Culture and of Economy in collaboration with the three cities of Venice: Venice, Venice, and Venice, and will run from March 17 to March 20, 2021. The theme of the exhibition is “The future of", "The next Biennial should take place at the CCA’s new venue in the same year as the 2020 edition. The exhibition will also feature an updated collection reflecting the modern and contemporary art movements of the time and will be held in partnership with the CCA’s curatorial team.Since the late 1960s, the CCA has been organized in a variety of ways, from two-person events to a triennial to a permanent collections. In addition to exhibitions, the CCA has hosted events such as its annual \"Creative Writing Workshop,\" which was held at the CCA’s new facility in 2009, and was awarded an Honorary Doctor of Arts degree in 2015.The 2019 edition, which took place at the CCA’s new facility, “Drawings and Paintings: The CCA’s Contemporary Art of the Century” held at the CCA’s new campus in 2013, featured work by fifty-two artists and was staged by Bobby Fischer. The exhibition was curated by Helen Cammock and Richard Green.\n\n\nThe Art Newspaper reports that the National Galleries of Scotland has received a gift of twenty-seven works by forty-nine artists, including Pilar Corrias, Ag", "The next Biennial should be organised in March 2020. Michael Stipe, the director of the National and International Biennial of Photography, told the Art Newspaper that this might actually be the year the exhibition will make its return to London. The National Gallery of Art is still negotiating with the Metropolitan Museum of Art over the terms of a relaunch, which will officially kick off in March. The timing of the reopening seems suspect, considering that the museum has been closed since March 13.\n\n\nThe Massachusetts Museum of Contemporary Art (MaMA), which announced it will re-open in March with a three-day exhibition on feminism and activism curated by artist-in-residence Mary Wollstonecraft, has added four new artists to its roster. The biennial will be hosted by the museum on Wellington Street in Chelsea and will feature work by Yoko Ono, Maya Lin, and the California-based collective SEXY CREATURES. “In order to maximize the museum’s reach across gender and identity, MaMA is integrating four new artists into its program, as part of a process that will involve them presenting work across multiple venues, including the private exhibition space, the museum, the library, and the public library,�", "The next Biennial should focus on “the historical development of art in the twentieth century,” as well as “the interconnections of modern and contemporary art,” a theme explored in the inaugural exhibition “The Future of Modern Art” (2007). The third recently concluded with an exhibition of work by Jean-Michel Basquiat at the Museum of Contemporary Art, Los Angeles.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to re-envision its current exhibition “Theater of Operations: The Gulf Wars 1991–2011,” which was staged in honor of International Women’s Day, in order to introduce more diverse artistic practices. The idea behind “Theater of Operations: The Gulf Wars” is to highlight the work of women artists in the Middle East who have not been celebrated in the West, and to present works by artists from countries that have not been included in the forefront of feminist struggles, such as Tunisia and Russia.The exhibition’s creator, aquaterly artist Sabine Hossenberger, told the Art Newspaper that the institution had already embarked on some of the revisions, such as adding an original watercolor and pictorial piece by Danish", "The next Biennial should be held at least once a year, and more likely will be held every other year. The earliest it can be held in the city is 2020, but it will be possible to host the first exhibition there in 2023.The contract for the 2019/20 edition—which was co-organised by the city and the University College London and was organized by the London-based nonprofit the University of the Arts—was extended until 2021. The renovations to the museum include the addition of a new lecture theatre, an expanded library, a conserved garden with a terrace, and a new exhibition space.The new student residence hall, which will occupy the third-floor of the museum, will be inaugurated by a new performance and installation space, which will then be followed by a new lecture hall and galleries which will host contemporary art. The roof of the building will also be transformed to a new solar thermal plant that will produce 200,000 kilowatt hours of energy annually and will be powered by the city.The Biennial of Modern Art will open on December 12, 2021 with the exhibition “Life and Motion” (2017–18), followed by its inaugural two-month residency program in February 2022. The residency will conclude with", "The next Biennial should be held in 2021.     The next Biennial will be held at the São Paulo State University, Brazil; the University of São Paulo, Brazil; and the Museu de Arte de São Paulo (MASP), Brazil. The next Biennial will be held at the Museu de Arte de São Paulo (MASP), Brazil; and the Museu de Arte de São Paulo (MASP), Brazil. In the coming weeks, we will publish an article on the upcoming Museum of Modern Art, and we will present some of the first exhibitions at the new Museu de Arte de São Paulo. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Thomas J. McDonnell as its next deputy director. McDonnell leaves the institution after a ten-year tenure as director of the contemporary art-world powerhouse, which recently announced that it will close its doors to the public for a period of twenty-four months. McDonnell will assume the role on January 3, 2021.“We’re thrilled to welcome him to the Museum of Contemporary Art,” said the museum’s director, El", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has released the list of twenty-seven artists whose works will be included in the fifth edition of the Metropolitan Museum of Art (MoCA) “The Period of the Beast,” which will run from January 19 to February 22, 2020. The exhibition, titled “The Period of the Beast,” and its twenty-two companion works, which encompass the work of forty-nine artists, will be on view September 10–October 3.The works are released under a Creative Commons Attribution-ShareAlike license, which means that the Museum can display the works on its website and at events, including the Met Galerie, and that patrons may copy and distribute the works for personal or commercial use. The works are also open to the public for free.The fifty-one-member panel, which comprises Mary Anne Carter, director of the Metropolitan Museum of Art; Dario Catellani, senior curator at the Museum of Fine Arts, Paris; and Simone de Ferran, director of the Museum of Contemporary Art, Los Angeles, selected the works from a shortlist that included artists such as Amara Abd", "The next Biennial should take place in the spring of 2024 and will showcase the work of forty-three artists from forty-two countries. It will also be the first time the Philadelphia Museum of Art has staged a biennial in the United States. The 2020 edition will focus on issues such as the economy, the environment, and a woman’s right to control her own body, with some creative pieces from the artist’s studio in the city.“The keynote was the work of the Minneapolis-based artist and activist Mariah Johnson, who transformed the Jordan-Palm Coast Children’s Museum into a feminist space in which she painted and drew in homage to the work of Simone de Beauvoir and Louise Bourgeois. There were also performances, lectures, and performances that challenged the museum’s own exhibition schedule and its programming, such as the artist’s first solo show at the institution in 1993, titled “The Black Body: Modern Art and Race” (noveltyfair.com).“A microcosm of feminist and social justice thought, the Biennial will be a gathering place for the voices and work of sixty artists from forty-two countries, who will share their stories and speak about their", "The next Biennial should aim to present a “thought-provoking narrative of the history of art as it pertains to the contemporary artist.”The 2020 event will be hosted by the Centre for Contemporary Art in the City of New York at Rockefeller Center, and will run from March 15 to March 17. The next iteration of the event will be held at the Metropolitan Museum of Art in New York from May 3 to May 5.\n\n\n\n\n\n\nSuellen Art Museum, Mexico City, Mexico, (image: David Alvarez)\n\n\nMuseum of Contemporary Art, Houston, Texas (image: David Alvarez)\n\n\nMuseum of Contemporary Art, Houston, Texas (image: David Alvarez)\n\n\n\n\nSuellen Art Museum, Mexico City, Mexico (image: David Alvarez)\n\n\n\n\n\nMuseum of Contemporary Art, Houston, Texas (image: David Alvarez)\n\n\nMuseum of Contemporary Art, Houston, Texas (image: David Alvarez)\n\n\nSuellen Art Museum, Mexico City, Mexico (image: David Alvarez)\n\n\nMuseum of Contemporary Art, Houston, Texas (image: David Alvarez)\n\n\nSuellen Art Museum, Mexico City, Mexico (image:", "The next Biennial should be set up in March 2020.The organizers of the upcoming annual meeting, which will be held at the Biennial in Milan from March 19 to March 21, are taking the event as a chance to reexamine the many interactive projects that have been undertaken over the years. According to the Art Newspaper, the event’s director, Matteo Trintalla, revealed that the 2019 edition, “was not the first to explore computer simulations in a real-life setting. We tried to create something new, something that would be challenging, but also inviting.”\n\n\nThe Museum of Contemporary Art (MoCA), New York, has appointed Amanda Kluge as its next director and chief curator. Kluge comes to the institution from the Chase Manhattan Center, where she has served as chief curator since 2016. During her six-year tenure, she has organized two exhibitions, “VR:2000: An Exhibition of James Turrell” (2017) and “The Laundromat Project: A Virtual History” (2017), in partnership with New York’s Museum of Modern Art and the Museum of Modern Art in New York.“I’ve been a big fan of Amanda", "The next Biennial should be ready by the end of March. The show would then wrap up with an exhibition of photographs by the Italian modernist Vivian Auberline in Egypt. The sixteenth edition, “Nirvana” was held in 2013.\n\n\nThe Winnipeg Art Gallery (WGA) announced today that it is planning to open a new space in the downtown core of the city, known as the Cultural District, in the spring of 2020. The location for the new museum, named for the section of the city’s First Nations that is currently closed for construction, is at the northwest corner of Main and McGillivray Streets. The new museum will be inaugurated by a new installation of work by artist Wangechi Mutu, a member of the group Dangôme, and will be centrally located on the site of the former Royal Winnipeg Hospital.“The Cultural District is an important achievement for WGA that will bring the diverse cultural and artistic experiences of Winnipeg to people who need them,” said WGA director Graeme Obalil. “The Revival of Contemporary Art is a celebration of our history and we are proud to play a role in increasing awareness of and engagement with the Cultural District", "The next Biennial should happen in 2021.\n\n\nFrieze has released its list of thirty-five artists who will participate in its next San Francisco edition, titled 'The Browsers,' in March 2021. The show will emphasize contemporary art, created by women and men, and will take place at the San Francisco Museum of Modern Art (SFMoMA), from March 8 to March 10. The event will be hosted at Maria Barrios Gallery in San Francisco, where artist Rachel Harrison will serve as the inaugural cofounder of the Frieze Artists Series. The biennial will feature thirty new works by fifty artists, including Peggy Guggenheim, Cézanne Boisjoly, Anton Kern, Mark di Suvero, Jessenne Mathe, Mark Rothko, and Frank Gehry. During the event, which will be held at the San Francisco Museum of Modern Art from March 8, 2020 to March 11, 2020, the museum will host a retrospective of Peter Hujar’s work, “The Browsers,” from June 2019, and an open-air sculpture garden in the museum. Other works that are slated to be displayed include pieces by Alice Aycock, William S. Burrough", "The next Biennial should take place in the spring of 2021. The theme of the exhibition should be “The Relationships Between Animals and Men” The exhibition will include works by thirty-three artists. The selections from the exhibition will be curated by Nikolaus Nilsen.The exhibition will include works by thirty-three artists. The selections from the exhibition will be curated by Nikolaus Nilsen.In order to increase the visibility of the exhibition, the facilities were reorganized and the number of participants increased. The show will be triennially organized. In 2020, it will be held at the Institut für Kunstakademie Stuttgart, Berlin; in 2021, it will celebrate its centenary at the Institute of Contemporary Arts in Cologne; and in 2022, it will mark the centenary of the Foundation for Animal Science (FAC) in Stuttgart.The museum will also be decorated with new works by twenty-three artists. The twelve works from the exhibition “Volkswagen Allemann,” which is scheduled to open in October, will be on view in the exhibition “Under the Influence of the Waves” in the museum’s new science center in 2019.", "The next Biennial should take place sometime in the 2020s. The first iteration of the exhibition was held in St. Petersburg in 2006.\n\n\nThe Botanical Gardens of the University of Munich (BAM) and the State Museum of History in Munich (Schöneichau) announced today that the artist Piet Mondrian’s sculpture The Life of a Family, 2011, which was commissioned by the German government in 2017 for the exhibition “Klaus-Dieter Kraus: Die Künstliche Abendbuch des Deutsches und der Museum der Nationalsozialalter,” has been added to its collection. The piece will be displayed in the curator’s exhibition “Klaus-Dieter Kraus: Die Künstliche Abendbuch des Deutsches und der Museum der Nationalsozialalter” (the End of the Family, 2011) at the State Museum of History in August 2019.Following the exhibition, a new book by the artist and historian Wolfgang Lackner titled “The Anatomy of an M: The Life of Frederick Dalck (1905–1986),” which is currently on display at the Botanical Gardens,", "The next Biennial should take place in 2020, and in the 2020 edition, the museum will unveil twenty-four works by twenty-five artists, including Terence Blanchard, Robert Irwin, John Galliano, and Charles Minter, among others who have never before been exhibited in the United States.\n\n\nThe Solomon R. Guggenheim Museum in New York has received a gift of twenty-three works by John Galliano. The donation, made by the artist’s associate, Damien Hirst, includes works that were previously on display in the museum’s collection but never had their first public exhibition in the United States. Galliano was selected for his exhibition’s “Perfect Storm” series, which explores the connection between rain and storms, and his artworks predate the Guggenheim’s founding. The gift also includes seven works that were previously on display in the collection but never had their first public exhibition in the United States. Galliano’s works have been on loan to the museum since 2017, and the first exhibition of the works, “The Rain of Times,” was staged at the museum in September 2019. The museum has since experienced steady demand for the artist’", "The next Biennial should be announced by mid-August. \n\n\nAfter a fire burned through the sixth-floor exhibition space of the Bentonville Museum of Art in Arkansas on June 6, officials there decided to temporarily close the institution. On Saturday, they announced that the venue would reopen with the addition of two new exhibitions, “The Fractures of the Human Body,” which was organized by the nonprofit GEO Group, and “The Detail of History,” which was curated by Saskia Stuart, the founder of the PROPAGANDA Arkestra Foundation. The Museum of Contemporary Art and Design (MoCA), in Manhattan, has since been renovated into a six-story, marble-encrusted exhibition space.The fire, which was extinguished by the New York Police Department on Saturday, occurred in a building adjacent to the museum, located at 565 Seventh Avenue, in Bentonville, Arkansas. According to the Arkansas Democrat-Gazette, the blaze was extinguished by the New York City Department of Buildings on Tuesday. The fire marshal’s office told the paper that the cause of the blaze is under investigation.After the fire department spent more than twenty-four hours extinguishing the blaze,", "The next Biennial should focus on the contributions of the artists to modern and contemporary art and their contemporary milieu; the institution should organize exhibitions that address the multiplicity of mediums and the interrelationship between contemporary art and art history.”\n\n\nThe Museum of Contemporary Art (MoCA), which has been closed since December 31 due to the Covid-19 pandemic, is launching a new digital platform that will allow visitors to view all 50 of its exhibitions and events in one place. The platform, dubbed MoCA All Access, will be available to all visitors at the institution’s new seven-story, 360-degree space in the downtown Los Angeles neighborhood of West Hollywood, which was completed by architect John Lee in 2015.“The MoCA platform will offer the widest range of museum experiences in the city, including programs, exhibitions, and events,” said architect and MoCA director Julie Claussen. “With the launch of the MoCA All Access, we hope to bring together a diverse group of artists, actors, and curators from around the world to form a hub for contemporary art through the power of our digital platforms.”About seventy artists and designers have signed the grant proposal, which was funded by the Richard", "The next Biennial should aim to:\n\n-Receive a final verdict from the jury and be presented at the next Biennial.\n\n\nThe National Gallery of Scotland opened a new exhibition of contemporary art in the country at the end of March, celebrating the centenary of the country’s independence from England. The show, titled The Last Days of the United Kingdom, was curated by Alice Black, with a selection of paintings by John Akomfrah, Yoko Ono, Régine Savoy, and Louise Nevelson, and featured more than one thousand works by forty-two artists.“We are delighted to present work by John Akomfrah, Louise Nevelson, and Sara Winters,” Alice Black said in a statement. “They… create compelling and yet somberly intimate landscapes of light and shadow, recalling in brilliant detail the conflict between the United Kingdom and Scotland in the early years of its seventy-fifth year.”The show will open at the National Exhibition Centre in Glasgow on March 18, and will run until June 22. In addition to the pieces, the show will present a microcosm of the last days of the United Kingdom", "The next Biennial should be held at the National Museum of Arts. The institution is currently reviewing the proposal and expects to make a decision sometime this spring.Currently, the museum’s collection comprises approximately forty thousand objects, the majority of which have never been on view. The Biennial will resume the exhibition with the exhibition “The Fall of the Third Reich: From the Paintings of Robert Frank” (2019–20) at the National Museum of Art.\n\n\nThe Institute of Contemporary Art (ICA) in Berlin has announced that it is preparing to welcome visitors back to the institution in the coming weeks. The renovation and expansion of its new headquarters, the Hamburger Bahnhof, which recently underwent a $3.5 billion expansion, is on track to be completed in the spring of 2021.During the construction phase, the museum will host thirty exhibitions, including fifty-five biennial projects and three new collections. The Hamburger Bahnhof will also boast a permanent collection of more than 2,200 works, including works by Robert Frank, Willem de Kooning, Karlheinz Stockhausen, and Piet Mondrian, and will boast an auditorium for more than three hundred thousand visitors. It will boast guest rooms for up", "The next Biennial should be held at the Museo del Barrio de la Cultura, in the city of Barranquilla, in the province of Leon, in the country of Malaga, Spain. In the meantime, the Bolsonaro Foundation, which has been working with artists to create events for the event, has released the list of speakers for the event.  The thirty-two-person group consists of Giuseppe Barbera, director of the Museo de Arte Contemporáneo in Barranquilla; Carlo Sesto, artistic director of the Marfa Museum of Art in Texas; Daniela Malm, director of the Monte Cristo in Venice; Leandro Villalobos, the curator of modern and contemporary art at the Museo de Arte Contemporáneo; Luis Enrique Roberto, the artistic director of the Museo de Arte Contemporáneo; Sebastian Roesler, the artistic director of the Museum of Modern Art in New York; Diane Duiker, the artistic director of the Museum of Modern Art in New York; Yvonne Rainer, the director of the Museum", "The next Biennial should be held in 2021, and the ten-year cycle will begin in 2023.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift worth $5.4 million from the Huntington family, which runs the New England museum. The donation's authorship is disputed and its date is disputed, but the family originally gave $5.2 million to the institution, which has been undergoing an expansion but completed on schedule last year, in January.“This is a significant gift, both in terms of its monetary value and in terms of the breadth and depth of its historical scholarship, which has been dedicated to the Huntington Collection and its collection as a whole,” said Jim Miller, chair of the MFA’s board of trustees. “We are excited to welcome the Huntington Collections to the MFA.”The gift includes a selection of works by the collection and a collection catalogue, including the newly completed exhibition “The Art of Seeing: Huntington Artworks” (2019); “The Monuments Men Built: Modern Art in the Age of Black Power” (2017); “The Art of the Photograph: Huntington Artworks” (2016); and “The Per", "The next Biennial should be held in 2020. \n\n\nJohn Giorno, whose art explores and challenged the notion of the work as a very large and very public object, has been selected as the winner of the $10,000 Luce Foundation Award for his work 'Love in an Age of Death. “This is an important and moving work, an expression of the poet’s own feelings,” said the award’s founder, João Luce. “While the work itself is beautiful, it is Giorno’s illustrations and his drawings that make the work special. From his drawings to his paintings, Giorno has been a central figure in the development of Brazilian art. In this case, we are honored to receive his support. We hope this creates the opportunity to support the work and his life.”Born in the Amazonian city of Manaus in 1972, Giorno, who is best known for his exploration of the concept of the work, often depicts the work as a public monument to a powerful and diverse identity in a way that reveals a strong link between the surfaces of the canvas and the intended audience. In his work “Lavender,” 1978–79, Giorno examines", "The next Biennial should be staged in 2020. The committee is currently drafting a new constitution for the exhibition, and hopes to present the first exhibition of the new works by the new group of artists in 2021.\n\n\nThe New York–based nonprofit the Museum of Modern Art (MoMA) in New York announced today that it plans to open a new chapter in its collection by donating approximately twenty works by seventy-nine artists to the institution. The museum will donate twenty-five works by artists who were active in the 1960s to the institute, which is currently restoring a portion of the collection. The works will be displayed in a series titled “Through the Years” that will run concurrently with the museum’s upcoming eighty-fifth-anniversary celebration.The donation will provide MoMA with the funds it will need to complete the restoration of the building’s Art of the Party space, which houses the institution’s collection of works by artists of all stripes, and to enable MoMA to rejoin the larger landscape of American art. The work will also allow MoMA to open a new, fifty-nine-thousand-square-foot building, the new gallery, which will feature its collection, and a new sculpture park on the"]