["The next Biennial should be entitled “The Promise of Humanity” and will focus on the oral histories of a number of pioneering postcolonial artists, including Anna Atkins, Agnes Martin, and Sissi Ndzube. The first edition of the exhibition was held in the African diaspora gathering together artists from Senegal, Nigeria, Somalia, and South Africa. The second exhibition will take place in the cities of Dakar, Dakar, Dakar, Dakar, and Kampala.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Christos Goutam as its first director. He will be tasked with revitalizing the institution’s image and building its relationship with the public. Goutam joins the MFA from the Harvard Art Museums, where he has served as deputy director since November 2019.“Christos is a world-class curator whose deep knowledge, passion, and enthusiasm for the art world and arts make him an ideal fit for our mission to champion mutual respect and respect for the arts,” said John Edmonds, the director of the museum. “In collaboration with the board of trustees, I’m excited to welcome Christos to the MFA and to the city", "The next Biennial should take place in 2021—there are currently plans to hold the first in 2021.\n\n\nThe Museum of Arts and Design (MAD) in London announced today that the seventy-fourth edition of the MAD Biennial will feature work by seventy-eight artists and collectives. The exhibition will be hosted by the Museum of Modern Art (MoMA) in New York, which opened a branch in the city in 1947, and will celebrate the themes of resilience and embodiment.“The biennial has been a tremendous success, with more than twenty-four million visitors visiting the museum each year, and we are very much looking forward to the first exhibition in 2021,” said Marion Hurley, executive director of MAD.The forty-ninth edition of the MAD Biennial will take place at the Margaret River Arts Centre in London on October 3–October 6, 2021 and will offer a selection of works by seventy-nine artists. The seventy-ninth edition will coincide with the twentieth anniversary of the Margaret River Arts Centre, which opened in 2009. \n\n\nThe architect who designed the entire original phase of the Grand Central Station in New York has been sued for copyright infringement by the New York Public Library, who are seeking to remove a", "The next Biennial should take place in the spring of 2021. The redesign will be centered around people, with contemporary artist-made works and imaginative concepts. “We are looking forward to featuring an unprecedented array of artists and filmmakers in the coming years and will always strive to create new work that is presented as a living embodiment of the artist,” said Miyagi. The theme of the biennial will remain the same, “living things,” but it will be more interactive and experimental, and will focus more on “technologies of mind and matter.” The curator who will oversee the next edition is Nikkita Gaweewerb, who will take up the post in March. Gaweewerb currently serves as the director of the Los Angeles County Museum of Art, which is currently undergoing a $500 million expansion, and as a curator at the Brooklyn Museum. Her work has been exhibited at the Venice Biennale, the Los Angeles County Museum of Art, the New Museum, the Museum of Modern Art, the Museum of Contemporary Art, Chicago, the Museum of Modern Art, Japan, the Museum of Contemporary Art, New York, the Museum of Contemporary Art, Hong Kong, and the Venice Architecture Bi", "The next Biennial should take place in 2021.\n\n\nAs the first major US city to clear the rubble and debris of its urban core in preparation for the reopening of its public art museums, the Environmental Protection Agency (EPA) is planning to develop a new set of guidelines for the handling of hazardous materials, including plastic and metal, in public spaces.The first step in the process will be for state and local governments to post notices in local languages on the agency’s website. If the public does not view the notices, local governments will have 30 days to remove or relocate monuments. The agency hopes that the public will view the notices and act in accordance with local laws before they take down monuments.If the public does not comply with the notices, the government will take legal action. According to the New York Times, the city of Charleston, South Carolina, plans to take down a monument of General Robert E. Lee, the Confederate general who executed nine black slaves in Maryland in 1864. The statue was relocated after a white nationalist rally in Charlottesville, Virginia, in August left a twenty-five-foot-tall Lee statue in its place.The next step in the process will be for the public to give the local government thirty days to remove a monument", "The next Biennial should be in 2020 and will be co-organized by the same team as the inaugural, with additional funding from the city of Cambridge.The theme for the upcoming edition will be “Time and the Earth,” a reference to a 1968 article by psychologist Robert Anton Wilson in which he wrote that there is an “invisible hand that directs, guides, and manipulates our environment.” The exhibition will also include artworks by individuals whose work was inspired by the American West, including Silas Kennedy, Yvonne Norvell, and Adam Pendleton. The full list of participating artists is as follows:Jean-Michel Basquiat - The Age of Man (1962)Janet Jordan - The Age of Man (1962)Janet Jones - The Age of Man (1962)Janet Red Star - The Age of Man (1962)Janet Zwirner - The Age of Man (1962)Janette Vrabel - The Age of Man (1962)Mary Moody - Painters in the Age of Man (1963)Celso Bickel - The Age of Man (1962)Marianne Bickel - The Age of Man", "The next Biennial should take place in 2022 and is slated to kick off in March 2020. “The events of the last five years have shown the rapidity with which life can change and adapt to survive adverse events,” said Thomas Baer, chair of the board of trustees. “We are hopeful that the fourth will continue to draw large audiences, explore new ways to engage with the theme, and inspire a new appreciation for art and life on this planet.”The institution is currently developing the fourth edition of the Biennial, which will take place in March 2020 and will kick off in March 2021. The exhibition will try to explore the relationship between the contemporary artist and the historical truths that shape our conception of the world. It will also focus on the relationship between the artist and the search for meaning in the world.The theme for the Fifth Biennial was “Nature’s Story,” focusing on the role of Nature in shaping our world today, and the Fifth Biennial will focus on “We’re The Trees,” highlighting the sacredness of trees.Over the last few months, there have been a number of attempts by some of the major US arts institutions to push back against President", "The next Biennial should take place in 2021, the artist said, and will consist of forty artists. The show will be hosted by an internationally acclaimed director, the artist-in-residence, and an international team.Danielle Chiu, the editor in chief of Artforum, has published a new book, Artforum: The Art of Man, over at Amazon. The book will be available in the US, UK, and other countries on June 29. The cover of the book depicts a large‐scale installation of artwork by Erik Satie, which will be staged in approximately thirty‐five minutes, and features the artist’s most recent work, The Cartoonist, for which she will work with a group of children from a small rural community in the Andes of Chile, which is located in the northern Andes. “My goal in creating the Biennial was to create a space that would examine the work of a select few artists,” said Chiu. “My recent exhibition ‘The Artist in Residence’ at the Art Institute of Chicago was a unique exploration of the role of artists in a contemporary reception, presenting work by eleven artists in the space of eighteen months. The exhibition was a", "The next Biennial should take place in 2020, the organizers said. The 2020 edition will feature sixteen previously unpublished works by from the collection, including seven by Italian architect Carlo Mollino, a cult favorite of the Museum of Modern Art and the Institute of Modern Art in New York. The biennial will also include a retrospective of the artist’s work, a public performance, a performance film, a photography exhibition, a tributes to the artist\u0097and an open-air sculpture garden.“An exhibition of work by Albert Oehlen is planned for the same year, but more ambitious,” the organizers said. The selected artists will be announced in March.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is facing an unprecedented crisis due to a coronavirus outbreak that has killed at least twenty-seven people in China and has sickened at least 153. According to the Los Angeles Times, the outbreak has affected all aspects of life in the United States, with thousands of people reporting cases in the last few days. While the number of people infected with the coronavirus has declined since it peaked in Wuhan, China, on March 19, at least six hundred cases have been reported in", "The next Biennial should conclude in March 2020.\n\n\nThe Institute of Contemporary Arts (ICA) in London is planning to move its annual exhibition, 'The Future is Present: Culture and the Future Present in Art” (TIFF), from its site in St Martin’s Place, in central London, to the east bank of the Thames River. The move will coincide with the reopening of Tate Britain in an attempt to attract more visitors to the museum.Ikon Gallery, a London-based group that represents Konstantin Miro, the director of the Stedelijk Museum in Amsterdam and the first artist to be awarded the Eric Fischbach Prize for Architecture, has also announced that it is constructing a new exhibition space on the grounds of the M Museum in London. The new space will be named the M Museum of Art. It is expected to open to the public in 2022.Inside the new M Museum, which is being constructed in a former office block on the sixth floor of the Museum of Art, the organization will be able to advance its plans to host a new exhibition every two years. The museum will also be able to return more of the exhibition’s works to the Netherlands and will continue to receive visitors", "The next Biennial should include the first-ever exhibitions of works by the two longest-serving winners of the prize—Borno Cornejo and Mario Tamaño—both of whom will be able to present their works at the exhibition. The full list of winners is as follows: Winner of the Prize, 2019: Tamaño’s Theater of Operations” (2019) Winner of the Prize, 2019: Borno Cornejo’s Exile (2019) Winner of the Prize, 2019: Pilar Otero’s Theater of Operations” (2019) Winner of the Prize, 2019: Cristóbal Pichardo’s Theater of Operations” (2019) Winner of the Prize, 2019: Hannah Foslach’s Them (2018) Winner of the Prize, 2019: Hiroshi Hasegawa’s Theater of Operations” (2019) Winner of the Prize, 2019: Shanghai Contemporary (2018)\n\n\nThe Metro West Art Museum (MUA) in Los Angeles announced today that", "The next Biennial should be in April 2020. After the fall 2020 season, the festival will move to London and will return in 2021. Of the forty-eight artists selected, thirty-six will be returning to the city for the first time and will be represented by the London/New York art fairs, the Art London Biennial, Art London Fairs, Art London Live, Art London New York, Art London: London, Art London '17, Art London: London, Art London: New York, Art London: London, Art London: London, Art London: London, Art London: London, Art London: New York, Art London: London, Art London: London, Art London: London, Art London: London, Art London: London, Art London: London, Art London: London, Art London: London, Art London: London, Art London: London, Art London: London, Art London: London, Art London: London, Art London: London, Art London: London, Art London:  Artists and institutions interested in working with Art London should contact the fair's corporate office at art@artstory.org.  Artists and institutions interested", "The next Biennial should be an educational experience for both the participating artists and the audience, as well as an opportunity for the public to learn more about the art world through the work of artists whose works have been selected by the Prize jury for their own work. “When we created the Prize, we had in mind being able to showcase the work of artists whose work has been selected by the Prize jury in order to give the visitors an opportunity to learn more about the history of art. We also wanted to expand the scope of the prize to include a new generation of artists, particularly young artists, who are currently underrepresented in the museum’s collections.”The Selection panel of the jury comprised a panel of judges: art historian Wolfgang Tiemann (Berlin & Stuttgart), curator of modern art Ingrid Strehler (New York), artist in residence Gabriella Bell (New York), studio instructor Christopher Cooper (New York), awardee Susanne Ossenbacher (New York), and awardee Pauline Kamm (New York).\n\n\nArt historian Bertrand Goldberg has announced that he plans to retire from the director position at the Museum of Modern Art (MoMA) in Long Island City, New York, in March 2020", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid in 2020, and eventually the Museo de Arte de São Paulo. Activists have also urged the government to hold an international conference to address the global health crisis.\n\n\nThe Office of Art and Design (OAD) is revamping its services to help museums save money and improve the accessibility of their collections. The initiative, which will cost around $41 million, will involve the creation of a new online platform that will allow museums to upload works for free. The platform will then charge participating museums based on a sliding scale based on their ability to raise $25,000. The money raised by the platform will be used to offset the museum’s operating costs and will provide a portion of the funding for programming that is currently funded through grants.“We know that the access to art is an essential tool for the creative and are committed to supporting the visual arts in all their important ways,” said Alejandra de Azaú́n, director of OAD. “This is a transformative moment for museums. We are creating a new platform that will help them rethink their collections and their exhibitions, transform their exhibitions,", "The next Biennial should be ready by the end of the year. The festival will be held at Wiradjuri National Park in Mumbai, which is expected to host a total of twelve exhibitions. Previous editions have served as a showcase of emerging and established artists from India and around the world.\n\n\nThe Hirshhorn Museum in Washington, DC, has appointed Meredith Brooks as its next director. Brooks comes to the Hirshhorn from the Metropolitan Museum of Art, where she has served as deputy director and chief curator since November 2019. She succeeds Marek J. Hauser, who departed the Hirshhorn in January 2020 to head the Metropolitan Museum of Art, and will assume her responsibilities in December.“Meredith has served as an outstanding director at the Hirshhorn, and I am deeply grateful for her work in advancing the museum’s international reputation, building its collection, and guiding our team through a challenging and transformative decade,” said Herb Wirth, chair of the board of trustees. “Her tenure has been long and impressive, and she has brought incredible creativity and vision to the Hirshhorn, and made the Hirshhorn Museum a global leader in the field of visual art.”Bro", "The next Biennial should focus on “those industrial bioresources that are crucial for the production of food and essential for providing energy and material support for people and communities,” the organizers said. The first exhibition will open in the city on October 23 and will continue until the end of the month.\n\n\nThe new Museum of Fine Arts (MoFA) in Chicago is planning to raise $5 million to establish a new $150 million fund for cultural preservation, revitalization, and intellectual stewardship. The initiative, which will fund the construction of the museum’s new site and create 2,100 permanent jobs, was announced in a $2 billion bond issue by the city of Chicago. The campaign is part of Mayor Rahm Emanuel’s “Let’s Move” campaign, which calls for city-funded interventions in the arts, cultural centers, and historic sites to spur economic growth, alleviate homelessness, and mitigate the impact of climate change.“This is a historic moment for the city of Chicago,” said David McAllister, chair of the city’s Cultural Affairs Commission. “Today we are launching a new era of cultural preservation and revitalization for the Museum of Fine Arts, and the", "The next Biennial should take place in 2021. \n“In the past ten years, I have been involved in three major initiatives for the city of Birmingham: 1) the redesign of Birmingham’s iconic Tate Modern; 2) the establishment of a new Creative Capital fund that will support the creation of new creative work in partnership with local artists; and 3) the biennial Blackout,” said Birmingham City Council leader Sir Richard Leese. “The design of the Contemporary Art Museum is a great example of how the power of design can have a transformative effect on people’s lives and we are looking forward to seeing what this innovative and ambitious project will achieve.” The list of participating artists is as follows:L-3 Architects, Birmingham, UK: Architecture work on site for the Academy of Arts. L-3 Group, Birmingham: Design works on site for the Academy of Arts. L-3M Architects and M-1 Mather, Birmingham: Design work on site for the Academy of Arts. L-3M Architects and M-1 Mather, London: Design work on site for the Acad", "The next Biennial should take place at the current location in 2021.  The 2018 edition of the event, which was organized by the Jalopnik Group and took place in the Grand Californian Hotel in the city of Los Angeles, was canceled last month due to Covid-19. The 2019 edition, hosted by the LA-based nonprofit Artadia, was postponed until March. The 2020 edition, which will be organized by the Museum of Contemporary Art Los Angeles (LACMA), is still on track for completion, but will be held at the LA County Museum of Art (LACMA), until the end of March.\n\n\nThe Metropolitan Museum of Art, the New York institution that recently laid off more than eighty employees after the pandemic ended in December, has filed a lawsuit against Jeremy Scahill and Saundra Talbott, the creators of the viral documentary Blackfish, over their unauthorized use of public funds. The lawsuit, filed in federal court in Manhattan on Tuesday, claims that Scahill and Talbott breached their contractual obligations by using funds intended for the MFA’s “Hannah and Maggie” programs, which offer free engagement and mentorship to teenagers and young adults, as well as the institution�", "The next Biennial should be held in 2020. In the meantime, the museum will continue to display the works of the late artist H.A.R.D.E., which won the prestigious $5,000 Biennial Prize in 2008, and will celebrate its centenary this year with a retrospective of his work. The museum has also been working on its first online exhibition, which will take place in the summer of 2021. Titled “Art and Dreams” and curated by Tania Bruguera, the exhibition will feature sixteen works by the late Brazilian artist Kiko Astute, whose work explores the notion of dreams as well as the concept of dreams as a source of inspiration for self-realization. “We are very excited by the possibilities of the new platform and the work that this exhibition will present,” said Kiko Astute. “The show will also include the first online public works by H.A.R.D.E., and will be a powerful platform for the collection of the artist’s work in its entirety. We can’t wait to see what the 360° experience will be like.”\n\n\nThe Museum of Contemporary Art (MoCA) in New", "The next Biennial should be held in the spring. and to be held in the spring. and to be held in the spring. and to be held in the spring. and to be held in the spring. and to be held in the spring. and to be held in the spring. and to be held in the spring. and to be held in the spring. and to be held in the spring. and to be held in the spring. and to be held in the spring. and to be held in the spring. and to be held in the spring. and to be held in the spring. and to be held in the spring. and to be held in the autumn. and to be held in the autumn. and to be held in the autumn. and to be held in the autumn. and to be held in the autumn. and to be held in the autumn. and to be held in the autumn. and to be held in the autumn.I hope that you enjoy the show and I look forward to seeing you soon.Sincerely,Ronald C. DeLandyBiennial Coordinator:Ronald C. DeLandy", "The next Biennial should be held in 2020. “The biennial is a partnership between the Philbrook Museum of Art and the North Adams Art Museum, and it represents the work of artists who have worked together,” said museum director Daniela Fattal. “I particularly love seeing the work of these two amazing collections, and I am really excited by the prospect of exhibiting the artists’ work together.”\n\n\nThe University of California, Berkeley, plans to stagger the start of a new master’s degree program this fall by three years, from April 2020 to March 2021. The announcement marks a significant step for the university, which has been grappling with the ramifications of the coronavirus, which has infected more than 163,000 people in the United States, and comes on the heels of a series of setbacks for the university.The university announced on March 20 that it was suspending the degree-granting program, which was scheduled to run from March 16–March 18, and has struggled to reduce costs and improve financial aid packages for students. Because of the ongoing Covid-19 crisis, the institution is also pushing back the opening of a new student residence hall.The California Community Colleges Association (CCAC), which represents", "The next Biennial should be in 2020, and the second one in 2022. \n\n\nEgypt’s Ministry of Culture and Sports is preparing to launch a new online portal that will feature the work of seventy-five artists, including Naguib Mahfouz, Sadek Adham, and Fares al-Qasimi. The service is slated to launch on January 19, 2020 and will be free to the public.“We are constantly striving to create platforms for artists and the public to connect and share their works,” said Minister of Culture Saida El-Erian. “As a country, we have the opportunity to expand the reach of culture and craft by engaging with our artists’ practices and their legacy through an online portal. I thank the Museums and Performing Arts Ministry for their work in supporting the project and hope the public will be able to benefit from it.”The new online platform will be powered by the same tool that was used to produce the first CGI Arts and Design Biennial in 2016. The ministry enlisted the expertise of online platforms and content creators from the United States and Europe for the “First CGI Arts and Design” exhibition, which was held in Los Angeles in January.", "The next Biennial should be held in 2021.\n\n\nSince the early hours of the morning on Monday, January 14, in the southern French city of Marseille, a massive security operation has been underway. Since then, the police have used tear gas, rubber bullets, and other lethal force to disperse crowds gathered to protest at the site of a deadly terrorist attack in Toulouse that left four suspected terrorists dead and dozens injured, as well as the arrest of a suspected accomplice.The violence began when a group of thirty to forty people gathered in the small town of Essonne-le-Fleuriel in the Seine-Saint-Denis region to protest the arrest of a suspected Islamist extremist, Abdelkader El-Khoury, on suspicion of planning a terrorist attack. The demonstration was peaceful, but tense, in the face of the ongoing police operation, which lasted for three days and involved the deployment of more than seven thousand officers.According to the AFP news agency, at least sixty people were injured in the violence, which reportedly took place in the city of Toulouse, which is about ninety miles southwest of Marseille, and that involved at least twelve different police forces. Among the forty-five people detained are twenty-six suspected of", "The next Biennial should be held at another location in the city, which will likely be used as a one-stop shop for visitors. According to the Art Newspaper, the Chinese artist will also be the first to produce a full-scale sculpture in the city.The second exhibition, “In Praise of the Wind,” will be held at the same venue in 2020 and is expected to draw 2,000 visitors. “This year’s pavilion is a celebration of the Shanghai-based artists who have given their lives to the history of art,” said Zhang Youli, chair of the biennial’s board. “This pavilion marks a new era for Shanghai’s art, and a new chapter of the artists’ lives. I’m very excited to welcome these artists to my family’s hometown.”\n\n\nThe Danish-born, New York-based artist Slaëa Tsurkal has been named the winner of the fifth Dusseldorf Biennale, which will be held in the spring of 2022. The inaugural honor was given to Nils Stærk, who was selected by the audience for his artistic excellence.", "The next Biennial should take place in 2021–2022 and will be jointly organized by the Museum of Modern Art, the National Gallery of Art, and the San Francisco Museum of Modern Art.While the public will be able to experience the works in person in the United States, there will be no physical representation of the “golden calf” in the country of its origin, China. The works’ relationship with the Chinese government has been a source of contention. Controversy over the works has been stirred up by the theft of the sculpture of a golden calf and a painting of a bronze statue of the same figure that was featured in a Chinese exhibition in Beijing in 2014.The exhibition was titled “Golden Path: Art in Public Life from Autobiography to Autobiography” and was organized by the Museum of Modern Art in Beijing. The works were stolen in the Kunsthalle Basel in Switzerland in November 2014. They were restored by the artist in Hong Kong, where they are currently stored, and received the Hong Kong pavilion at the Fifty-Eighth Venice Biennale in March. In addition to the sculpture and painting, the work of Maung-Tse, the bronze statue of a golden calf", "The next Biennial should not happen before August 31, 2019.  If the President orders a hiatus, no new works will be staged until the end of the year. The institution will continue to operate as normal under the interim guidelines, but will focus on developing new programming that reflects the changing cultural landscape of the region.The new guidelines, which were released by Larry Fink, the president and CEO of the biennial exhibitor Century 21, came as the exhibitors and the Washington, DC–based organization were preparing for the annual Arts and Culture Week celebration, which is slated to take place at the Smithsonian American Art in October. The exhibition will feature new work by twenty-one artists, including Felicity Hammond, Lawrence Abu Hamdan, Ursula von Rydingsvard, and Robert Irwin, as well as newly commissioned works by artists such as Lucy Craig, Chris Coates, and Shelly Herman.Among the artists whose work will be featured in the exhibition are Hernán Dávila, Amanda Gonzalez-De-León, and Marcin Wojtas, who will be presented with works by artists such as Susanne Vielmetter, Benjamin Harnwell, and Bob Mankiewicz.\n\n\nThe first large", "The next Biennial should take place in the first quarter of 2020. The show will unveil a new generation of artist-designed structures, featuring new short-term and long-term programming, curated exhibitions, and a new series of performances. In the eighteenth and nineteenth iterations of the exhibition, the artists will collaborate with the city of Barcelona and the city of Madrid to create works that will be on display in the city for a period of eighteen months. The artist-designed structures will be inaugurated with a presentation of the artist-designed structures in the city of Barcelona.\n\n\nThe State Museum of Contemporary Art (SMA) in Copenhagen, which is currently closed until at least March 14 due to Covid-19, is currently working to sort through the backlog of applications for its next major fundraising exhibition, “Bukkake,” which will take place in November 2020. The institution has already received more than eleven thousand applications for a $10,000 cash prize; it is currently accepting applications for a $5,000 prize. The 2019 exhibition, “Ortega y Gasset: More Life,” saw fifty-nine works by ninety-three artists, including the Tanya Modog, Ed Ruscha, Amy", "The next Biennial should take place in the spring of 2021. The biennial will highlight the work of contemporary artists working in the city of Biennale Rotterdam, the Netherlands, and features a selection of contemporary works by Jay-Z, Beyoncé, P.A.R. (Personal Audio and Real Life), Fela Kuti, Joël and Julie, Nari Ward, and Dusan Mier. Former winners of the prize include ?Nina Simone’s “Sister Sun,” 1992, which won the Best in Show, and “Nielson-Atkins’s “Dry Skin,” 2004, which was selected for a “Curated Exhibition.”\n\n\nThe West Hollywood Community Foundation, which was founded by the late philanthropist and philanthropist art collector and collector of art David S. Theissen, has announced that it is reorganizing its board of directors in order to improve the financial, educational, and executive roles of its nine trustees. The board has appointed Marcia Bishop, a former board chair and a vice president of the foundation, as its new chair. Bishop will serve the three-year term for January 2021–February 2022 and will be succeeded", "The next Biennial should be held in 2021. \n\n\nThe National Gallery in London has hired Laura Lamb as its next director. Lamb will be responsible for leading the institution through the next twelve months. During her tenure at the National Gallery, Lamb will oversee the development of the collection, the exhibition program, the curatorial staff, and the collection of works by artists such as Robert Irwin, John Constable, and Thomas Jefferson, as well as the development of programs and exhibitions that reflect the diversity of the UK’s artistic landscape.“Laura’s leadership and vision for the National Gallery will be crucial in helping us to shape the future of our collection, our exhibitions and our exhibitions programs, and ensuring we continue to be at the forefront of innovation and excellence in the arts,” said National Galleries director Hartwig Fischer. “Laura’s commitment to the collection and the National Gallery is truly remarkable. Her dedication and energy are matched by her warm and compassionate sense of humor and her outstanding curating skills. I’m confident she will help us to realise our ambitious plans for the National Gallery and its collections and exhibitions and, in doing so, further broaden the museum’s public engagement in art.”Prior to joining", "The next Biennial should take place in 2021, the festival’s president, Michel de la Bruyère, said in a statement. “[T]he history of the beautiful city of Biennale di Cassino is unique and special, and the creation of a biennial completely dedicated to it is a noble objective.”As the artist-run, nonprofit organization, the 2017 event featured works by seventy-nine artists and featured more than 1,500 installations, including installations by Annie C. Martin, A.K. Kukelek, Mark L. Kennedy, Frances Morris, and John Akomfrah, among others, as well as performances and performances-only events that linked the pilgrimage to wider history.The 2020 edition of the Biennale will be held at the Marrakesh Palazzo delle Papesse, the city’s cultural and historical site located in the rolling hills of Marrakesh, and will bring together more than seventy artists and their families. The event will be hosted by the Marrakech Gallery, Marrakech, Marrakech, and the Palazzo di Cassino, as well as by artist-run organizations such as Taru Naidoo’s Marrake", "The next Biennial should take place in 2021 and will address the themes of the previous decade—’s first to take place in the capital city and the city’s first in more than thirty years. “The future of the ancient city of Al-Qusayr is at risk,” said Ahmad Ali, the Al-Qusayr governor and the city’s current who leads the provincial governor’s office. The governor recently asked the United States’ State Department to help protect the ancient city from the Taliban, but the invitation was rescinded after President Donald Trump signed an executive order suspending most federal funding to the country.The Antiquities Agency (A) has also been criticized for allowing more than 3,300 antiquities from the Nineveh Museum of Art in the northern city of Nineveh, which is now a UNESCO World Heritage site, to be moved from its site in the center of the city, which houses some 25,000 artifacts, into storage facilities without the government’s permission. According to the Washington Post, the move has also led to a legal complaint from the state of Nineveh, which is seeking the return of the artifacts.The controversy has led to a number of", "The next Biennial should be held in the second half of 2020, and the first in the first half of 2021. The upcoming edition will be commissioned by the London-based, Paris-based, and Washington, DC–based nonprofit Art Lab and curated by artist-in-residence Rachel Whiteread, who will serve as the inaugural curator.Whiteread said: “I immediately saw the potential of the project when I joined the Arts Lab in 2006\u0097I found the collaborative and interdisciplinary nature of it to be refreshing. I’ve always been interested in creating works of art and the opportunities for artists and curators to create new work across disciplinary lines and disciplinary boundaries. The project was born from this commitment to explore the possibilities for new work in the art-world. I hope this exhibition will act as a catalyst for contemporary work in the UK, and especially the Arts Lab.”The biennial, titled The Future Is Present, will kick off with a public installation of work by the artist Big Ben, who used a series of markers, including a combination of paintings and prints, sculptural elements, and blueprints, in a 2016 exhibition at the Art Institute of Chicago. The work, a meditation on", "The next Biennial should be held in 2020, with the theme “The Future Is Present.” The first exhibition, “The Future Is Present: Art and the New Reality,” will open at the Venice Biennale in 2021.The installation and performance biennial will be divided into three phases, beginning with an exploration of the history of art and its relation to the present and ending with a discussion of the possibilities of the future. Art and the present will be the theme of the second phase, which will be held in 2020. The third phase, “The Future Is Present: Contemporary Art” will be held in 2021. \n\n\nThe future of New Orleans’s Land Art Museum is in jeopardy after a group of activists pressured the institution to cancel a planned exhibition featuring work by black artists in an effort to preserve the institution’s contemporary art collection. The exhibition, titled “Live From New Orleans” and curated by Amadou Saint-Exupery, was scheduled for June 11–June 12. It was to have taken place in conjunction with the annual Land Art Museum Benefit.Organized by the group P.A.I.N. (Prescription Addiction Intervention Now), Live", "The next Biennial should be held in the fall of 2020. If all goes to plan, the quarterly exhibition will then re-open in the spring of 2021.\n\n\nFrench president Emmanuel Macron congratulated the city of Lyon, France, on its selection of the city’s first UNESCO World Heritage site, the Louvre, in an open letter on May 4. “Nearly fifty years after the city of Lyon, France, selected the Louvre, the Louvre will stay as a monument of French artistic heritage in his memory,” Macron wrote. “In the coming decades, the city of Lyon will remain at the heart of the cultural life of France, and be a unique cultural destination for visitors from all over the world.”Within days of receiving the letter, Macron ordered that the city prepare to welcome visitors again. The Louvre has already begun reopening with a new screening of the documentary film Underground, about a group of activists who broke the anti-war movement by protesting in Paris in 1968, and is currently preparing to welcome the public for the first time in 2020.The city’s selection of the site was led by French architect Christian Pracha, who is director of the Lyon-based firm Prada Architecture, the", "The next Biennial should be held at least once every twelve months. “The project of the exhibition ‘Akademie der Moderne,’ the exhibition ‘Biennial Akademie der Moderne’ and the exhibition ‘Akademie der Moderne’ are inseparable, and the aim of the exhibition ‘Biennial Akademie der Moderne’ is to make the exhibition ‘Biennial Akademie der Moderne’ possible,” the statement reads. The Kunsthalle Basel will welcome the first visitors to the new deck at the end of June. Next year, the Kunsthalle Dusseldorf will present its first exhibition devoted to the exhibition “Akademie der Moderne,” with the international team of artists taking up residence in the exhibition’s new home at the Contemporary Art Museum Karlsruhe in Dusseldorf.\n\n\nThe Philadelphia Museum of Art (PMA) is preparing to open a new cultural outpost in a historic cultural district that has housed many of the city’s cultural institutions since it was founded by the late Philadelphia-born architect Frank Gehry in 1948. The facility, a former warehouse that", "The next Biennial should take place in Japan, and the third in Shanghai. As we look forward to the show, we ask that you consider supporting the exhibition by sharing these two exhibitions on Facebook, and encourage all who want to see these works to do so.\n\n\nThe European Commission has launched an investigation into the fate of a number of artworks, including four pieces in the collection of the Rubell-Vidal Foundation in Los Angeles, that were donated by the artist Anton Kern. Based in Switzerland, Kern is known for his long-standing campaign to protect works that were donated by strangers.In a statement, the commission said: “On 27 April 2018, the commission received information that a person or organization was making a request to the Rubell-Vidal Foundation, Los Angeles: ‘Abandon all these efforts’ and instead of taking this into account, the person or organization contacted the museum of California for assistance. The museum was able to assist the museum in negotiating a solution which enabled the work to be returned to the donor’s custody and returned to the repository.”The Rubell-Vidal Foundation, which has a permanent collection of more than 1,600 works, including works by El Dorado Dandelion", "The next Biennial should take place in 2020. The twenty-eighth will be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA), the Los Angeles County Museum of Art (LACMA), and the Metropolitan Museum of Art in New York announced today that they are planning to merge, effective immediately. The news follows a series of events that have unfolded over the last few months, including the announcement of the acquisition of a new $600 million home for the Los Angeles County Museum of Art (LACMA), which will be situated in a converted factory building on Wilshire Boulevard, by the First Financial Corp., a private entity that currently owns the property.The merger will allow the museum to consolidate its collections, increase the museum’s programming, and increase the museum’s financial contribution to the local arts. LASALLE is currently engaged in a major expansion, which will include the construction of a new exhibition facility and a new 1,400-seat auditorium. The renovation of the museum is slated to be completed in 2020.“The board of trustees and staff of LACMA and the board of trustees of the Met have decided that this is the best possible outcome for the museum, the city of Los Angeles, and", "The next Biennial should include a retrospective of the artist’s work, and ideally will involve the fall of the Berlin wall, with a view to dismantling the Berlin wall in 2020. “The spread of this kind of event is becoming a kind of global emergency,” Berliner Kunstbau, who was not involved in the decision to hold the event, told the Art Newspaper. The festival, which inaugurated an exhibition of the work of fifty-one artists from twenty-six countries in Berlin, has faced problems since it first announced its plans to hold the event in March 2019. Some countries, including the United States, have blocked the event for their citizens, and other countries have pressured Berlin to cancel the event, which is billed as the first exhibition dedicated to Zbigniew Brzezinski, a former American vice president and United States intelligence chief who served from 1977 to 1983.Brzezinski is currently one of the United States’s most prominent architects behind closed doors, and he is suspected of masterminding the collapse of the Soviet Union. Two weeks ago, Brzezinski’s daughter posted a statement on Instagram in response to the recent attacks that accused media outlets of trying to politicize the work of her father", "The next Biennial should showcase the work of British artists, and also include a selection of their works and a brief history of the exhibition. The pavilion will be inaugurated by an exhibition of the work of British artist Louise Bourgeois. The inaugural Biennial in London will be held at the British Museum on September 23, 2020.\n\n\nNew York artist Joe Nocito has received a major retrospective at the Museum of Modern Art (MoMA) in New York. The retrospective, titled I See New York, is one of four titles to be presented at the institution, which has added three new works by Nocito to its collection since it opened in 2008. The other works are Tacita Dean, an adaptation of a work by the Italian architect Vito Acconci (1902–1971), The Tender Bed, a concept installation by the Italian artist Federico Canalotti (1903–1973), and The Horizontal Line, a work by Nocito that premiered at the Museum of Modern Art in 1954.“The museum is excited to present ‘I See New York,’ ’“a retrospective of three extraordinary artworks by Joe Nocito,” ", "The next Biennial should be held in the coming months. The institution has also been accepting nominations for the 2020 edition, and will announce the winner of the first round of awards, which will take place in March.\n\n\nThe Los Angeles County Museum of Art (LACMA) has commissioned Brooklyn-based artist Helga Bech to create a new work for its upcoming edition, “Between the Sun and the Moon.” Bech comes to the institution from the Philadelphia Museum of Art (PMA); the former home of the Whitney Museum of American Art.“Helga’s work is a fresh take on the moon and its place in culture,” said board chair Peter Sitt, who described her work as “a window into the climate of our planet.” “An astute observer, she deftly captures the minute movements of the moon over the span of a lifetime.”The work is dedicated to her late father, the late Israeli artist Armand Bech, who was known for creating works centered around lunar cycles and on the relationship between the moon and the earth. “Full of themes of family, the moon, and the body, between the sun and the earth,” Bech", "The next Biennial should launch by August and will announce the winner of the competition, in collaboration with the participating artists. “The exhibition has served as a catalyst for our curators to challenge the narratives of past exhibitions and the importance of contemporary art in the digital age,” said Tania Bruguera, the director of the exhibition. The exhibition has also drawn a line in the sand between the Biennial and the institution’s temporary exhibitions program, which is hosted at the Biennial’s new space, the Aurel M. Fernandez Art Museum, on the campus of the University of Maryland. In a letter circulated by Bruguera, the museum’s board chair, and the rest of the board of trustees on August 4, the board said that the selection committee was “disappointed in the decision” and questioned the rationale behind the exhibition. The letter continued by saying the bid is not in line with how the museum and the city perceive the work. The letter concluded that the curator was criticized for “disrespecting the exhibition” as evidenced by a number of online comments that criticized the exhibition’s choice of topics.“The curator’s actions showed a clear disregard", "The next Biennial should focus on the political and economic transformation of the city, as well as the history of New York as a cultural touchstone for the West. The pavilion should also include a center for Native American art, a photographic exhibition of works by artists such as Robert Irwin, and a performance series. \n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has received a gift of forty-six works by artist Clara Lou, who died in 2000. The works, which were acquired through a donation from artist and collector Thomas J. Martin, were discovered in the museum’s collection by a group led by artist-philanthropist Michael Grunwald.Grunwald and his associates discovered the works by chance in a storage area after the institution closed to the public in 2010. Grunwald and his wife, Adam, were seeking a home for the works when they decided to sell them. “The works are in excellent condition and in excellent traveling condition,” Grunwald told the New York Times.The gallery has been working to secure the works for several years, and the man who purchased them from Thomas Martin agreed to accept a donation of twenty-six works that were in storage at the", "The next Biennial should focus on the history of the institution’s permanent collection, organizing exhibitions that present the work of contemporary artists and the biennial as a whole. “We need to develop new ways to learn about the museum, and create new opportunities for our visitors to experience the museum as it was over sixty years ago during the artist residency program,” said MCH Group artistic director Marc Glimcher. Glimcher, who is also the CEO of LAXART, a contemporary artists residence program that nurtures and coordinates artists across the United States, said the Biennial will provide an opportunity for artists to meet and talk with museum curators, designers, and other experts. The program will follow the theme of “Life, art, and the artist’s body,” which is a reference to Michelangelo’s 'Art of the Body,” a 1964 exhibition at the Los Angeles County Museum of Art that examined the central role of the artist in art history and culture. Inaugurating the museum are the artist residency programs for Kim Gordon and Gil Luria; John Lasseter; Sam Peck; Mark Romanek; Robert Rauschenberg; and Sarah Silverman. The Biennial will", "The next Biennial should begin with a discussion of the themes of the exhibition; the themes of the exhibition should reflect the themes of the exhibition; and the theme of the Biennial should be a response to the European refugee crisis.“The theme of the Biennial is the rebirth of a European people, a future of human rights, a future of diversity, a future of ecosystems,” said Oleksander Sarkis, director of the Palais de Tokyo in Paris. “Europeans and the rest of the world will have to work together, we can only do that together.”In a letter to the exhibition’s organizers, he wrote: “I cannot overstate the importance of the theme of the Biennial. The exhibition will help to bring together the artists and make of art a reality, and will also provide a platform for personal reflections and the development of new projects.”\n\n\nThe International Center for Photography Art (ICA) in Vienna has appointed Nils Stærkke as its new director. Stærkke arrives at the institution from the Fondazione Prada in Milan, where he has served as director since 2015. He succeeds Joachim Neumann, who retired in May 2019", "The next Biennial should be held in 2020.\n\n\nThe Baltimore Museum of Art (BMA) in Maryland is planning to release twenty-nine works by African American artists into the public domain in the coming months. The works, which were previously kept in storage, will now be accessible by anyone with a valid photogra­phy.The works, which were previously in the possession of the BMA, will be restored and released under the authority of the Baltimore City Historic Preservation Commission (BCHPC), which was established in 2017 to oversee the conservation of the city’s historic architecture and public spaces.“This is a historic moment,” said BMA director Christopher Bedford. “A century ago, the BMA became the nation’s first museum dedicated to African Americans. Today, we are just weeks away from witnessing our first African American mayor and governor and the first African American mayor of Baltimore City. I am proud to be a part of this historic homecoming.”The works will then be added to the BMA’s collection and displayed in public exhibitions, such as “The BMA Collection” (2019–2020) and “The BMA Gallery:", "The next Biennial should open in 2019 and will be staged at various locations worldwide in order to gather a global audience. The exhibition will highlight the work of sixty-five contemporary artists in twenty-nine countries and will be organized in a manner similar to the Olympic Games. In order to preserve the internationally acclaimed exhibition, the Biennial will also be provisionally suspended until at least the end of March.A group of forty artists has announced their withdrawal from the 2020 edition of the Venice Biennale. “We have made a decision not to participate in the 2020 edition of the Venice Biennale,” the artists said in a statement. “We believe, together with the whole of the international community, that the exhibition, which was aimed at conveying the theme ‘art, culture, and culture’ in a very specific way, was not possible.”The artists are all withdrawing from the exhibition, which was organized by the editorial board and the organizers of the Venice Architecture Biennale, the Sittelbacher Foundation, and the Lagrange Foundation, in order to “address the current situation in Italy’s countryside,” the artists wrote in a joint statement. The statement was published on February 19. According to", "The next Biennial should take place in 2022. The 2020 edition was held in January and featured performances by twenty-five artists.\n\n\nThe Egyptian Museum of Art (EMAM) in Cairo has commissioned artist Nima Nabavi to create a new work for its new exhibition “Egypt: From Antiquity to Modernity” (EP), which will open in 2020.The first Egyptian work to be exhibited at the museum since it moved to a new space on the Nile in 1976, the installation for the exhibition will be a reconstruction of the Cleopatra period, which is part of an exhibition of the same name. The work, which was created with the help of a team of twenty-five artists, will be presented in the exhibition “Egypt: From Antiquity to Modernity.”Nabavi is the founder of the project project, “Egypt: From Antiquity to Modernity,” which was initiated by the Egyptian Ministry of Culture in 2017. The project is a continuation of a four-year program, “Egypt: Beyond Antiquity” (2019–2020), which was organized and led by Museen Ben Ali, that began in 2016 and ended in 2018. Nabavi is from Alexandria", "The next Biennial should focus on “the possibility that art can still heal us and that art can serve as a source of inspiration, inspiration for the future, and inspiration for the past.”\n\n\nThe Metropolitan Museum of Art has appointed Lauren O’Hara as the new executive director of the Metropolitan Museum of Art. O’Hara comes to the museum from the American Folk Art Museum (Albuquerque), where she has served as associate curator of American art since 2017. Previously, she was the Mariner Kemper Foundation art historian, and worked at the Museum of Modern Art, New York.“We are thrilled to welcome Lauren to the Met,” said Andrew Kreps, the museum’s director of exhibitions. “Her bold, imaginative approach to artmaking and curating is completely at home at the Met. Her new position will be a benchmark for how we think about and think about art today—and into the future.”Previously, O’Hara worked as a curator at the private museum, which has one of the largest collections of contemporary art in the United States, and founded the popular local blog, the Central House. She is currently a curatorial fellow at the Museum of Modern Art,", "The next Biennial should take place in 2021. Projects that have received funding include the exhibition of photos by Colleen Andino and Kenneth Hahn, the installation of M. Paul Getty’s landscape from the Los Angeles County Museum of Art, and the reconstruction of a large portion of Santa Teresa University’s campus. The theme of the 2020 event is “Collusion: How the Media, Government, and the Economic System Threaten Democracy.”\n\n\nThe National Endowment for the Arts (NEA) in Washington, DC, has launched a new $2.5 billion initiative to support creative and cultural professionals working in the arts and humanities, including the arts, sciences, and the physical and cultural. The new capital campaign, called Strengthened Impact, aims to create a more than $1 billion impact for the NEA.“Strengthened Impact” will provide grants of $100,000 and up to $250,000, based on the artist’s practice or expertise, and will prioritize those who are most in need of funding, said NEA artistic director Mary Anne Carter. “The NEA and its partners are committed to empowering the next generation of", "The next Biennial should feature works by the following artists: Alan Cuno, Richard Diebenkorn, Ming-Chiu, Shirley Scott, Tae-Hyun Kim, Ricardo Campos, Hiroshima Tada, Lorena C. Barba, Suzanne Coppola, Igor Cláud, Narciso Carvalho, Alexandra Clough, David-John Coleman, Oscar Cervantes, Pari Dallara, Paula Cooper, Paul Mpagi Sepuya, Paulo Crespo, Yoko Maeda, Timurina M. Perretta, Lucio Echols, Shirley N. Perry, Fernando Rosales, Ruth Porzio, Shirley Roke, Hannah S. Phelps, Daniel P. Gaillard, Maximilian Scharf, Arts and Culture, Boston, MA; New York, NY; and London, UK. Other shows planned for the 2018–19 season include: Sylvia Blesen & M.A. Roo", "The next Biennial should take place in 2020 in Beijing. The event will examine the history of art from the Chinese diaspora in China, with an emphasis on the reception and storage of artworks and materials. For the first time, the event will also include a museum show, “Expressionism in China: Art and Language from the Diaspora,” in 2022.\n\n\nThe Centre Pompidou in Paris has appointed Dimitri De Ghebaly, the president of the French NGO SOS Méditerranée, as its next director. De Ghebaly was chosen from a shortlist of three by the Centre Pompidou’s board of directors on May 5. He succeeds Yale Gammon, who retired after a decade and four months in March 2019, and will assume his responsibilities at the institution on June 1.“With deep experience in NGOs and international development, Dimitri understands the power of media and the community to shape public policy and has the skills to deliver on the Centre’s promises,” said Laurent Bénédouil, the president of the Centre Pompidou. “This is an important moment for our society, as we", "The next Biennial should feature a selection of archival works that reflect the visual arts and the humanities. The exhibition will be hosted at Haps and Koons Museum of Art in the city of New York, which is developing a new round of events to mark the centenary of the birth of Henri Matisse. The events will be set in the historical city of New York and will be curated by Roger Baer, the director of the Art Institute of Chicago. Other works that will be on show include works by Bechdel and Willem de Kooning, when they were both alive; works by women artists of the 1960s; and works by artists of the 1970s and 1980s. The exhibition will run from January 6 to March 6, 2020. HELENA GOLDEN PAST: As a collective we create artwork to serve as a gestural counterpoint to the dominant forms of our environment. We create to question and to change the ways we conceive of the world, and to be a voice for change. ”Written by Saul Mitchell and Mary Clare Boland.\n\n\nThe Museum of Fine Arts (MFA) in New York has appointed Steven Nelson as its next executive director. Nelson comes to the institution after serving", "The next Biennial should be held in 2022 and will take place in the city of Olympia, Washington. The program will also host a number of other artist projects, including the exhibition of work by the Egyptian-born, Norwegian-born, and the Palestinian-born artist Khaled Hosseini, who will be the subject of an exhibition at the museum next spring. \n\nThe South African Museum of Fine Arts (SAMA) in Pretoria (SAMP) has announced that it will no longer duplicate the work of the late Kenyan artist and educator Fatosu Buhlumalo, whose practice of drawing and painting infused his art into the very fabric of South Africa.Featuring in the second edition of the Buhlumalo Documenta, an exhibition organized by the artist in collaboration with the former director of the National Gallery of Kenya, is a selection of twenty-six paintings from his collection. The work, titled Buhlumalo: Drawing, Painting, and Photography, examines the artist’s relationship with his medium.“In a piece that explores the relationship between drawing and photography, Buhlumalo: Drawing, Painting, and Photography is an art project that confronts the notion of abstraction and contrasts the visual", "The next Biennial should be held in 2019. The museum will also be planning to expand and incorporate elements from other artworks, including a new play that will be staged by the Los Angeles County Museum of Art. “We are thrilled to share with our visitors the intricate and rich history of contemporary American painting and sculpture,” said Marc Glimcher, chair of the board of trustees and co-founder of the Glimcher Arts Foundation. “This is a critical time for the Glimcher Museum to show how art and design are part of a life-saving journey.”The institution currently employs approximately 250 people, and has six exhibition projects in development. The work of architect Frank Gehry, who died last year, is currently on display in the museum’s SOUTH location.\n\n\nThe New York City Department of Cultural Affairs (DCLA) is preparing to unveil a new $3.7 billion cultural redevelopment plan for the city’s Central Park, which has been dormant since the 2015 reopening of the park following a $5.7 billion expansion spearheaded by developer Richard Childs. The plan, which will also include the construction of a new public high-speed train line, the reopening", "The next Biennial should include the annual lecture by artist-actioner Elin Mair, who has recently faced controversy over her decision to stage a performance in solidarity with Black Lives Matter, in September. The event will be held in December.“Our Biennial is a collaborative, not a competitive process,” said Allison Moore, curator of the inaugural event. “The critical questions that need to be asked are: Where are we headed, and where is the way forward? We have a responsibility to move forward.”The 2017 event, titled “What is art?” and curated by the collective Black Queer Collective, featured works by fourteen artists, including Gabrielle Aí\u0097 a.k.a. ∞, who made her first solo exhibition at the Forum in 1990\u0097The Black Milk Project, 2013\u0097as well as works by artists such as Cherrie Alberts, Charles Atkins, Lucy Black, Naima Aby, and Sarah Black. The exhibition was staged in collaboration with Mair and draws inspiration from the work of the late sculptor and feminist theorist Celeste Alberts\u0097whose work often grappled with questions of gender, sexuality, and racial politics.\n\n\nThe Museum", "The next Biennial should be in 2021, but the organisers say that a decision on the format has yet to be taken. The biennial’s theme, “Time/Motion,” is set to return to the theme of Biennial 1 in 2022.\n\n\nThe National Galleries of Canada has released the first set of guidelines for the unauthorized exhibition of works by the National Museum of Canadian Art (NCCA) in Vancouver. The first set of guidelines, which was written by the National Gallery of Canada’s senior curator, Nara Ballard, outlines the three key points that a contemporary artist should consider before exhibiting their work in an exhibition. The guidelines were originally published in the September 2018 issue of Artforum’s May/June issue and were adopted by NCCA in a vote of the museum’s membership. “The first point of view is, of course, the work and what it represents and what it represents outside of it,” Ballard said in a statement. “The second point of view is the artist as an individual and the work as a whole. The third point of view is that of the work and the work in general.”The guidelines were designed to increase the", "The next Biennial should take place in 2020. In a show of solidarity with the artists who are fighting to preserve their work, the entire Collection will be relocated to Brussels, and the collection will be organized as a single exhibition. The organization is also planning to create a new platform for the collection, which currently has a third-floor exhibition space in the Museum Stedelijk, in the space of the Museum of Modern Art.The collection will undergo a major renovation, and its new exhibition space will be inaugurated at a special event in March 2020. The new exhibition, entitled “HCG: The Art of Salvador Dalí” (HCG: The Art of Salvador Dalí), will also include original works by artists such as the Polish American architect Wojciech Kharoslawski, and American textile and metalworker George Lois. The show will draw from the collections of the Palazzo Grassi and Palazzo Maggio, and will be curated by Peter Schwabe.\n\n\nThe New York Philharmonic announced today that it plans to raise $750,000 for the next season of the annual free concerts, which have brought thousands of musicians together across the United States. The money will go toward securing extra seating", "The next Biennial should be held in the spring of 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Sarah Oxtoby as its next director. She succeeds Susanne Vielmetter, who retired after eighteen years in August.“I have been a fan of Sarah Oxtoby’s work for years and am very excited to welcome her to the MoCA family,” museum director Richard Armstrong said in a statement. “Her passion for art, desire to serve, and ability to collaborate with collaborators set her apart from the team and is a testament to her ability to collaborate and bring people together.”Oxtoby joins the MoCA team alongside veteran curator and curatorial talent David K. Levenson, who will assume his role in January 2020, and Sarah Klodey-Snyder, who has helmed the museum since 2017. She will begin her tenure in January 2020.\n\n\nThe Central Institute for Art History in Vienna has announced that Halil Altay has been appointed as its new director. Altay arrives at the institution from the Institute for Contemporary Art Research (Acam), where he has served as a research fellow since 2013. He succeeds Sasa M. Alt", "The next Biennial should take place in 2020. \n\n\nThe Art Newspaper has launched a series of documentaries on New York’s Jewish communities. The first, “The Walls of Jericho,” which will be shown on PBS as part of the 50th anniversary celebration of the journalistic enterprise, will examine the stories of the Jewish communities in Manhattan and Brooklyn. The second, “The Struggle Continues,” which will air in a few months and will feature interviews with survivors of the Holocaust, will examine the contemporary struggle against anti-Semitism in America.The series was organized by Artnet and was selected by the organization’s board of directors. The museum will premiere the documentaries in January 2020 and the full list of participating artists is as follows: Congregation Beth ShulkeKassel (Germany)Kassel (Germany)Benhamid (France)Hannah BarbourHammam (Arabia)Hassan BaniwaHassan Boumedoui (Algeria)Hannah Barbour (Canada)Hanna BirnbaumHannah Barbour (Canada)Hannah Barbour (Canada)Hannah Barbour (Canada)Hannah Barbour (Canada)Hannah Barbour", "The next Biennial should merge with the One Gallery and Museum in St. Louis, which celebrated its centenary this year, and will focus on the theme \"Hoarders’ Habitat: Man and Animals in New Orleans’s Metropolitan Museum of Art. The museum will also host three exhibitions featuring reconstructions of objects that were damaged in Hurricane Katrina: “Paintings in Disaster: New Orleans’s Metrograph,” which will open at the museum on August 20; “Revitalization and Reinvention: Art in New Orleans’s Metrograph,” which will open at the museum on August 22; and “The Black Box,” which will open at the museum on August 27.The museum will also open an exploration center, a research center, and numerous other public spaces, including a theater, to the artist-created works in the museum’s collection. The center is funded by the Gordon and Betty Moore Foundation.The announcement of the partnership between the museum and the Gordon and Betty Moore Foundation comes a few weeks after the foundation donated $25 million to the museum in support of a new master plan for the museum inspired by the architect’s studio in Lower Manhattan. The plan", "The next Biennial should take place at the National Gallery of Art in Washington, DC, in 2021.\n\n\nThe Hirshhorn Museum in Washington, DC, has released the list of twenty-six artists who will receive a retrospective at the institution in the spring of 2020. The thirty-nine-show event, titled “Artists on the Verge of Destination,” will take place at the Hirshhorn from April 29 to May 3 and will run an estimated forty-seven hours. This exhibition marks the twenty-fifth iteration of “The Verge of Destination,” a festival that was held at the National Gallery of Art in Washington, DC, in 1991. The Hirshhorn will host a “Video Biennial” video exhibition of work by Léonide Laverrière, Yo-Yo Ma, and others in the spring of 2020. The pavilion will hold the first show of work by production duo Paul and Max Beck, who will create a multimedia installation titled “The Verge of Place,” which will be on view until April 30.“The Verge of Place” is a collaboration between the artists, who are all involved in cultural projects in the US, and the Los", "The next Biennial should be held at the new premises, which were commissioned by the Museum of Contemporary Art in London in collaboration with architects Knud Rasmussen and Olafur Eliassen Architects, in 2020 and 2021, respectively. The eight-week event will be hosted at the new site until March 22. The 2020 event, titled “Themes of Life,” will be held at the new space next month. The 2021 edition will open in March. \n\n\nThe National Galleries of Scotland and the National Museum of Scotland in London announced their intent to collaborate on a new project in an attempt to raise $140 million for the restoration of the original historic site where the Scottish National Museum (NMW) was founded in 1825. The partnership was announced on March 7, the same day that the NMW’s board of directors met in London to discuss the possible acquisition of the dilapidated building where the institution’s current exhibition space will stay.“This is an historic moment for Scotland and the United Kingdom, and I am thrilled that we will be able to restore the NMW’s original exhibition space, which was a landmark in our history, and permanently preserve the original architect’s vision for the National", "The next Biennial should take place at the Museum of British Art (MoB), London. It is also currently working on a new statement of values for the museum that will address the museum’s commitment to diversity and inclusion. The announcement that the museum would no longer hold its upcoming exhibition “Britain: What Next?,” which explored the legacy of British colonial rule, was made on September 18.\n\n\nThe Centre Pompidou in Paris and the Balenciaga in Venice have agreed to collaborate to create a new museum devoted to the history and culture of the contemporary art world. The project will take about a year and will involve the restoration and conservation of at least one hundred works. The Centre Pompidou, which opened in 1928, and the Balenciaga, which opened in 1972, have been collaborating for four years to create the new museum. A joint statement issued by the two institutions reads:“After a thorough search, the Pompidou and the Balenciaga were selected as the hosts of the 2019 Louvre-Palazzo di Pisa. This was due to their great historical significance and, at a time when Paris was still under the rule of the French Republic, their", "The next Biennial should take place in an open space in the city, and should aim to introduce new and contemporary ideas about art, society, and the environment. The theme of the fifth edition, entitled “In Praise of the Infinite,” should be a celebration of the infinite and the transcendence of the world. Last year the festival was held in Tallinn, Estonia; this year it will be held in the capital city of the Republic of Estonia, Tallinn, the capital of Estonia, and the city of Tallinn. The installation of artworks by artists from North America, Europe, and Asia will take place in the city of Tallinn.Details about the exhibition will be announced soon.\n\n\nThe Seattle Asian Art Museum (SAAM) has received a gift of thirty-six works, including works on paper and ceramics by thirty-seven Asian American artists who were not represented in the collection at the museum. The works were donated to the institution by artists who live in Seattle and are currently on display in “Theater of Operations: The Korean War, 1950–1953” (2017–18) alongside works by Korean American artists, including Kim Dae-sook, Kasimu Kim", "The next Biennial should take place in 2020 and will have topics ranging from the history of the art of the present to the idea of a universal history. In addition to the exhibition of the work, the museum will work to organize a public lecture and a special exhibition on the work.“We are currently assessing the problems that will be presented at the biennial in 2020 and will decide in the coming weeks,” said the museum’s director, Jannis Kounellis. “The upcoming exhibition will introduce the work to the public as well as the theme of the upcoming biennial.”\n\n\nThe museum has released the list of thirty-one artists whose works will appear in the third edition of the Biennial of New York, “Biennial of the City,” which will run from September 25 to November 30, 2020. Curated by Brooklyn-based artist Lennard Kranz, the exhibition will draw from a selection of twenty-five hundred works that were previously exhibited in the city, New York, but were never released into the public collection.The biennial will present the work of sixty-three artists, including Mark di Suvero, Yoko Ono, Bruce Nauman, José Antonio Alves", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MA) in New York has appointed Joseph Pappas as its next director. Pappas has served at the museum since 1988. He succeeds Matthew Brittain, who retired in April after serving as director for four years.“I’ve gone to the MA to help them be more like the Museum of Modern Art, more like the Metropolitan Museum of Art, but with a little more bite and a little less artifice,” Pappas said in a statement. “We’re going to be a museum of contemporary art, but in a different way. We’re going to be a place where people come and feel comfortable coming together and having a good time.”Pappas had been assistant director at the museum for four years before he was hired as director. He succeeds Matthew Brittain, who currently serves as the assistant director for collections and exhibitions. Previously, Pappas was assistant curator of modern and contemporary art at the Exhibitionist, an exhibition space that has served as a hub for contemporary art since 2001. In addition to his new role, Pappas will become the first director to lead the museum since its founding", "The next Biennial should be held in 2021.The first edition, Maker Faire Boston, will take place September 25–09, 2021 and will be hosted on the campus of Northeastern University. The second edition, Boston Biennial, will be held September 28–09, 2022. For the third and final iterations of the biennial, which will be held in 2021 and 2022, the organizers have already released design proposals of the designs for the exhibition. The current Biennial will return in 2020.\n\n\nThe Museum of British Art (MoB) in London has released the list of more than seventy artists who will participate in the third edition of the Tate’s “Tate Talks,” which will take place May 3–May 5, 2020, at the Tate Modern in London. Titled “Imagine,” the event will feature artworks by eighty-three artists and will feature the works of a variety of artists from forty-five countries.The artists who will participate in the biennial are Richard Linklater, Alex Katz, Jana Halder, Alex Kapoor, Paul McCarthy, John Dekker, Nazaré Makhaya, Sweeney Todd, Stella Adler, Steve Adler, Jon Al-Bar", "The next Biennial should take place in 10 years, the organization said. It will leave the decision on whether to renew the contract to the region’s cultural authorities.The management of the museum and the institute is still in the process of deciding on the location of the exhibition. The board will meet in London in December to discuss the possibility of the exhibit.\n\n\nThe twenty-third edition of the Hong Kong Biennale, which was held in Hong Kong from March 19 to March 22, 2020, was canceled after roughly three hundred artists, including Neeson, Koki Kiyo, and Rirkrit Tiravanija, withdrew from the event, Artnews reports. The organizers cited a lack of interest from the Hong Kong International Film Festival (HIFF), which was scheduled for March 28–March 29, and the Hong Kong Asian Film Festival, which was canceled a day earlier. The cancellation also affects the Hong Kong International Theater Festival (HSTF), which was also scheduled for March 28–March 29, and the Hong Kong Book Fair, which was scheduled for March 27–March 29.“We apologize for any disappointment and concern that our artists have felt, given the lack of support from the Hong Kong International Film Festival and the", "The next Biennial should take place in 2018.\n\n\nThe Smithsonian American Art Museum in Washington, DC, has appointed Beth Satter, who has served as director of the museum since 1992, as its next director. Satter comes to the institution from the New York–based contemporary art curator-designer Clement Clark.“As the first African American director of the American Museum, Beth has shown great leadership in bringing the museum’s exhibitions, concerts, and other programming to fruition and in developing new language and exhibition programs to meet the needs of diverse audiences,” said museum director Alexander Klippenstein. “Beth’s years of work in bringing the museum to the forefront of American artmaking and in defining the boundaries of contemporary artmaking are truly inspiring.”Satter will assume her new role in January 2020. The institution has been working to finalize a new labor agreement with the International Union of Operating Engineers (IOE) since March and plans to begin organizing exhibitions in January 2021.\n\n\nNew York’s Metropolitan Museum of Art has received a major blow to its collection of more than 1,600 works by the late Pablo Picasso, who was a major collector of the artist’s work and was buried", "The next Biennial should have new works, new performances, and new performances should have new works, new performances, and new plays. The next National is to be staged in India, in 2019, and the next Asian Biennial should be staged in 2020. And finally, we will have a new Encyclopedic Biennial to coordinate with the forthcoming 50th anniversary of the Encyclopedic Museum of Modern Art.I have had the honor and privilege of guiding the National Gallery of Art through its longest and most celebrated era, as we have navigated through the challenges and opportunities posed by the pandemic, while maintaining a clear vision of the institution’s mission and mission-critical projects. We now have a new set of priorities for the National Gallery—and I am confident that we will be able to deliver on those priorities in the years ahead.I hope that this exhibition marking the twenty-fifth anniversary of the National Gallery will help you to see the National Gallery through a different lens. I am confident that with your permission, we will continue to present compelling work and explore the future with your participation.In the coming months, we will have more exhibitions at the National Gallery as part of our new partnership with the Holbrook Museum of Art in the", "The next Biennial should take place in the spring of 2021 and the first in the fall of 2022. The deadline for the event is February 23, 2021. The 2017 edition of the Biennale was held at the Museu de Arte de São Paulo (MASP), and the 2017 exhibition was hosted by the Museum of Modern Art, New York.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Lynda Barry as its next director. Barry, who has helmed the institution since April 2013, succeeds Ann Mydans, who retired last June following tenures at the helm of the museum.“The board was very pleased to welcome Lynda to the MoCA family,” said Michael Govan, the museum’s chief curator and director of exhibitions. “Over the past year, she has shown remarkable leadership, building on the foundations of our organization, while maintaining the museum’s commitment to diversity and inclusivity.” Barry will assume her responsibilities on June 15, 2021. She succeeds Jules and Eileen Mydans, who cofounded the museum in 2003 and were instrumental in establishing its current structure, and will take the helm from Christa and", "The next Biennial should be held in 2020. Villar and de Tocqueville are promising to create new resources to enhance the exhibition’s programming, and to present a longer exhibition, “Our Times,” in collaboration with a larger exhibition that explores the role of art in contemporary life.\n\n\nThe nineteenth edition of the Venice Biennale has been canceled due to the coronavirus. The exhibition, titled “L'Art et l'Espagne,” was supposed to take place in March 2020 and was set to kick off at the Palazzo delle Papesco in Venice, Italy, on March 13.Originally scheduled for March 16–March 20, the show was moved to March 14–March 19, to avoid disrupting the upcoming Art Basel Hong Kong fair. The cancellation was made after officials at the exhibition informed organizers that the coronavirus was not contained. Instead, it spread to the art and food sectors, leading to a rise in Covid-19 cases.According to the Art Newspaper, the coronavirus has spread into all six of Japan’s major cities. The first case was confirmed in Nagoya on March 11. Then on March 10, the city of Oita", "The next Biennial should take place in the fall of 2020, with a total budget of $50 million.\n\n\nThe Chinese artist Ai Weiwei, who died last month at seventy-nine years old, was not a communist sympathizer, but he was an imperialist. His artwork was at times filled with references to imperialism, colonialism, and violence, and its influence is still felt today.“In his paintings, Ai Weiwei has a touch of the Russian artist Aleksandr Golub (1883–1963),” Michael Rosenbash, a Yale University art historian and the author of Aryan Resistance: Chinese Art and Imperialism in the USSR (Solidarity Books, 2002), wrote in an essay published by the Art Newspaper in 1992. “His paintings are a good example of western art in the early 1900s overcoming the influence of the Soviet Union.”Born in Shanghai in 1931, Ai Weiwei studied under the late Marxist theorist, philosopher, and writer Mao Tse Tung, who lived in his apartment in Nanjing, China, before moving to Prague in 1949 to study under Karl Lueger, an early proponent of the theory of Surrealism, and to Frankfurt in 1956, where he studied under Hans Hof and Dieter", "The next Biennial should be held in Hong Kong, and the 2020 edition will be staged in Beijing, Hong Kong’s capital. Tokyo will host the second edition of the fair in 2021.The pavilion will be comprised of an exhibition-like environment, with a number of galleries, art dealers, museums, and a bookstore. It will include a seventy-one-foot-long gallery, a museum, a restaurant, a library, a hotel, and a school.  The venue will also feature a theater and a live performance space.The 2020 edition of the Biennial will take place at the latest venue in Beijing, the XL Center for Contemporary Art, and will highlight contemporary art from China’s six provinces. The 2019 edition of the fair was staged at the Xiamen Philharmonic Hall and the Xiamen City Hall.\n\n\nThe nonprofit Art in the Streets of New York City has revealed that it is planning to shutter its iconic '50s and '60s art district in Midtown Manhattan, the venue for years of the city’s cultural life, in 2020 to make way for a new, taller, and more expansive structure. The complex will also include a new museum, a shopping mall, and", "The next Biennial should be on the history of science, and the next should be on the history of the environment, and the next should be on the history of art. If you want to change history, you have to change the past. And that means changing the present.”\n\n\nThe National Gallery in London announced today that Omid Kordestani has been chosen as its next director. Kordestani, who has helmed the gallery for forty-four years, succeeds Chris Packer, who retired after forty-six years at the helm in March 2019, and will begin his position in September.Kordestani, who was appointed by former prime minister Boris Johnson after he won the presidency in May 2015, is currently responsible for developing and implementing new curatorial practices. He also coordinates the collection of artworks through the Institution’s London outpost, the Tate Modern, and is a member of the curatorial team that curated Sky Arts, 2014, and Debbie Frankenthaler: The Life and Times of Emily Hall, 2019.Kordestani’s first major retrospective, Sky Arts, was staged at the Museum of London in December 2013. The exhibition garnered more than four hundred works by more", "The next Biennial should focus on novel interpretations of the biennial by various artists in a space that offers a re-creation of the events depicted in the exhibition.” The 2020 biennial will be held at the Museo de Arte Contemporáneo Barcelona.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Adam Gallant as its next director and CEO. Gallant currently serves as the chief curator of contemporary art at the museum and is working on a new exhibition, “Up Close,” for the 2018–19 season. Previously, he was affiliated with the Metropolitan Museum of Art, where he worked from 2002 to 2006.Gallant’s tenured position at MoMA was created in 2014 following nine years as director of the Museum of Modern Art. During his tenure, he organized eighteen exhibitions, including “New Directions: Artists in the 1950s” (2015) and “Architecture as Politics” (2016); produced nearly two hundred films and documentaries; and organized more than thirty-five exhibitions, including “Pablo Picasso: A Space in Time” (2015), “Yale Architecture: From L to Z” (2014), “", "The next Biennial should be held at the Museum of Fine Arts in Rome, which is currently undergoing a renovation. The theme of the fifteenth iteration of the exhibition, titled “Dada in Cinema” will be “Feminine” and will feature artworks that continue to challenge conventions of the natural. The theme will also include work by women and institutions, which range from small feminist spaces to major institutions.The exhibition will travel to the Palazzo San Marco, Piero Manzoni, and the National Museum of Venice. The theme of the fifteenth iteration of the exhibition “Dada in Cinema” will be “Feminine” and will feature artworks that continue to challenge conventions of the natural. The exhibition will travel to the Palazzo San Marco, Piero Manzoni, and the National Museum of Venice. The theme of the fifteenth iteration of the exhibition “Adrian Piper: Futurism” will be “Moderns,” while the work will also be held in the National Museum of Polish Art in Warsaw. The third edition of the exhibition will visit the National Museum of Fine Arts in Vienna, which will be inaugurated with a retrospective of the work of", "The next Biennial should be held in the autumn of 2021, with a new exhibition planned for the spring of 2022. Delshy has been appointed to the post of curator of MFA Boston and will begin his tenure next month.Commenting on his appointment, Delshy said: “I’m incredibly excited to begin my new role as curator of the biennial, and to continue to develop the exhibition program and the exhibition space for the biennial. The exhibition 'The Art of Pain’s' will be a transformative experience for the artists and audiences of the Biennale, and I’m looking forward to collaborating with you, the Boston art community, and the artists and institutions that will celebrate this extraordinary collection of works.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has published an open letter to museums across the United States, urging them to commit to divesting from fossil fuels by 2025 and pledging to assist states that have not yet made the shift. The letter, written by LACMA director Miles Rapoport, board president Edgardo Mosca, and other LACMA board members, reads: “We, the board, and our staff are committed to divesting from fossil", "The next Biennial should be held in 2021.Artforum has reached out to the Helsinki Art Museum for comment. In the meantime, a statement published by the Biennial Helsinki says the decision to cancel the exhibition was reached after consultation with the Helsinki Art Museum, the Museum of Contemporary Art, and the Library of Finland.The Helsinki Art Museum, which was also planning to hold an exhibition of the work of American artist Raye Henningsson, was forced to postpone the event until next year. The Museum of Contemporary Art, which was already planning to hold a special exhibition of the work of American artist Alice Pousetto, said it was still at a point of deciding whether to go ahead with the event. “The Helsinki Art Museum will always continue to emphasize a wide-ranging approach to art exhibitions and will continue to do so as long as the show is in Helsinki,” the statement reads.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles plans to move the exhibition “The Radiance of Arsht,” a 2011 retrospective of the Russian avant-garde, from its current home in the Hollywood Bowl to a new location in downtown L.A., titled the Museum of Contemporary Art. The", "The next Biennial should present some of the most distinctive artists and their work in the United States. The conference will also be organized as a platform for the collaboration of international artists and also will include an open platform for the reception of the inaugural exhibition. \n\n\nArt Basel Hong Kong announced that it is working with Hong Kong–based artist and educator, Nan Sze, to create a new exhibition for its upcoming inaugural edition in March 2020. The show, titled Art & Art: Aeon’s Waning, will highlight the Hall of the Story of Art, a memorial museum in the Hong Kong Art District that will stage lectures, talks, and other programming focused on the exhibition and exhibition.Sze, who graduated from the Art Institute of Chicago (ICA) in 2012 and currently resides in Hong Kong, will present the first programme at the Hong Kong museum next month. “Nan Sze’s iconoclastic exhibitions are at the core of the ongoing legacy of Art Basel Hong Kong and exemplify the spirit of a brand that celebrates originality, experimentation, and a commitment to innovation,” said Adrian Wootton, senior director, Art Basel Hong Kong, of the museum. “I’", "The next Biennial should be announced soon. For now, Mayor Rahm Emanuel said: “We will see. It’s a process.”\n\n\nThe London-based artist, filmmaker, and curator Sajid Javid, the British government’s Brexit secretary, and his fellow Brexit campaigners, have been ordered to leave an exhibition at Tate Modern in London—the British government’s decision to leave the European Union—until at least March 4. The March 4 date was chosen in support of the UK’s \"leave no stone unturned,\" or LEFT, campaign, which has been campaigning since March 16 to leave the EU.“Withdrawal from the European Union will not only deliver on the commitments made in the last five years, but will also be a vote of confidence in the creative economy, a vote of confidence in London, a vote of confidence in the creative labour in Britain,” said Sajid Javid. “This is a decision for the people of Britain, and it is a vote against a plan that would put millions out of work and take Britain out of the European Union.”The March 4 date coincides with an announcement that the Tate will reopen", "The next Biennial should welcome the public at a later date. The museum will also start accepting visitors by appointment only. However, due to the prolonged closure of the museum, the exhibition schedule has been adjusted to reflect this. While the museum will reopen in the near future after a temporary closure, the exhibition schedule has yet to be announced.\n\n\nThe Centre Pompidou in Paris and the Museum Saint-Pédel in the Swiss Alps are planning to open a new branch in Shanghai next year. The institution’s current two-thousand-square-foot space in the city’s 221st–century Pudong district is being converted into a new 750,000-square-foot exhibition space that will house the Museum of Modern Art (MoMA) and the Museum of Modern Art Shanghai.The Centre Pompidou is currently constructing the new pavilion, which will be located in the City of Light, in the city’s Art Deco Groupe, in the capital of China’s Zhongguo Province. The project is estimated to cost $200 million and will be led by Sichuan Guren Group, which also conceived of the institution’s new headquarters in the coastal city", "The next Biennial should also take a look at what kind of social structures the art world is working within, as a whole, and what kinds of changes are possible for art-world institutions. Finally, we need to think of how we can create new social and economic opportunities for artists and how we can support their work in a changing world. The proposal is to create a new biennial within the next year to coincide with the Art Basel Hong Kong and K-Mart Direct Exhibition. The Biennial will draw from the same sources and will be organized in the same way as the Hong Kong and K-Mart Direct Exhibition. The new exhibition will be a combination of selected works by contemporary artists and will be organized in a different format. The official launch of the new exhibition will be in 2021, the same year as the Hong Kong and K-Mart Direct Exhibition. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of eleven works by American Psycho creator Kahlil Joseph that were put on display during its eight-year exhibition “American Psycho: The Exhibition” last week. The works, which were acquired by the institution from a private collector who was working through the estate’s collection in a", "The next Biennial should be a celebration of women’s independence,” said Biennial Director Madeleine Albright. “The biennial will first present a selection of contemporary art from the history of women’s liberation. The second part of the biennial will be a celebration of women’s contributions to modern art. The third will be a celebration of the work of women artists in the twenty-first century.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released guidelines for the installation of a new sculpture by artist and activist Aisha Tyler, who died last year at the age of sixty-four. The installation, titled The Umbrella, is a massive thirty-foot-tall umbrella held in both hands. The sculpture, which was commissioned by Aisha Tyler and her husband, Bruce, is a portrayal of the artist’s own body and the body of another artist, painting over the silhouette of Aisha Tyler and reconstructing her clothing.“The Umbrella,” which was installed in the courtyard of the Whitney Museum of American Art in New York City on September 2, 2020, was funded entirely by the Tylers through a campaign organized by Aisha Tyler’", "The next Biennial should be held in 2021, with the announcement of the theme \"Silence: Art and the Black Lives Matter Movement.\"\n\n\nWhile the 1970s saw numerous acts of civil disobedience–including the sit-ins and the Million Man March against racial injustice in Washington, DC–the United States has yet to recover from the economic crisis caused by the pandemic, which has also hit the arts. With an estimated $96 billion in damages and with no immediate end in sight, the US Chamber of Commerce is urging the federal government to divert $58 billion from the Social Security Trust Fund to aid artistic endeavors.“We believe that the best way to prevent the next economic crisis and to ensure that artists, including young artists, have access to the critical support they need is to divert Social Security benefits and to provide artists with additional benefits,” said Ken Ward, president and CEO of the Chamber of Commerce. Ward, who was briefed on the research by a panel convened by William Frey, president of the American Federation of Arts, said that the move will allow the government to save $58 billion over ten years and will also “allow artists to focus on their most important projects and to have the most immediate impact.”Debbie Rie", "The next Biennial should take place in 2022. \n Artists who have won this year’s Pulitzer Prize include Brando Calderón, Kathleen Cleaver, and Yvonne LaBouvier. \n\n\nThe Frederick P. Martin Foundation in New York has established a new initiative that will help Milwaukee–based artists and small to mid-size galleries through its openings. Titled Pork and Beans, the initiative will provide grants of $500 to $1,000 to individuals or small to mid-size galleries in the Milwaukee area.The foundation will determine the criteria for the award based on the artists’ and the institutions’ art practice levels, the financial needs of the artists and the cultural and economic needs of the community. The grants will be given on a rolling basis and will be available in either cash or in kind. “When we think about the ways in which art can connect us together and shape our world, we are reminded that the most important things in life are often the least understood,” said Benjamin J. Greenberg, the foundation’s executive director and chief curator.  The Paley Center for Media and Arts will also receive an infusion of funds. The museum announced that", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is working with the Los Angeles County Museum of Art (LACMA) to renovate its main building, the Los Angeles County Museum of Art (LACMA), into a museum that will house the collection of more than six thousand objects from the artist-built Museum of Contemporary Art (MCA), a former Honda factory in the heart of downtown Los Angeles. The renovation project is part of a $1.7 billion expansion plan that includes the construction of two new galleries and the renovation of the museum’s existing buildings.The project will also include the reconfiguration of the museum’s existing grounds, which will be made more accessible by building a new amphitheater, and the construction of a new visitor experience building and new public areas on the museum’s main floor. In addition, the museum will begin work on the massive project, dubbed the Master Plan, which will involve the redesign of more than 2,300 acres of the museum’s main campus.The renovation is part of the $2.5 billion Los Angeles Regional Plan, which aims to create an urban renewal project to preserve and enhance the area around", "The next Biennial should take place at the Museum of Contemporary Art (MoCA) in Los Angeles. Originally scheduled for March 2020, the exhibition was rescheduled for April 7, 2020 and the show was rescheduled again for May 7–10. The 2017–18 event was moved to June 22–June 27, and the 1876–1878 exhibition was moved to September 22–September 24. The 2019 edition of the Fifty-Seventh Venice Biennale was canceled, and the exhibition was canceled for the entirety of 2020. The 2019 edition of the Venice Architecture Biennale was canceled, and the exhibition was canceled for the entirety of 2020. The 2019 edition of the Biennial of the Mexican Society at the Museo Maestra in Mexico City was canceled, and the exhibition was canceled for the entirety of 2020. The 2019 edition of the Philippine Philharmonic was canceled, and the biennial art was moved to the National Museum Manila. The 2019 edition of the Royal Asian Society’s Venice Architecture Biennale was canceled, and the exhibition was canceled for the entirety of 2020. The 2019 edition of the Arts de Manila was canceled, and the exhibition was moved to the Art of Living", "The next Biennial should be up in January 2020. The event will be staged at the Museu de Arte de São Paulo, the Museu de Arte de São Paulo, the Museu de Arte de São Paulo, and the Museu de Arte de Paris. \n\n\nThe City of Los Angeles has launched a $40 million fund to help local cultural organizations impacted by the coronavirus. The initiative was introduced in response to the recall of more than 80 percent of the city’s adult residents from their homes by a citywide petition in July.“This is an emergency crisis that requires immediate action,” said councilmember Mitch O’Brien, chair of the city’s public health committee. “The City’s already committed to $35 million will provide additional relief to cultural organizations in the next two years, and we will continue to work with partners to ensure the immediate needs of our city are met.”A total of $40 million has been allocated to the fund, which will be split evenly among the city, county, and state. The County Council will administer half of the funds, and the City Council will administer the other half. The City’s budget for", "The next Biennial should be the first time one artist will work on a long-term program of permanent art. The biennial’s program will unfold across thirteen artists, including Hiromi Ota, Yoshitomo Matsumoto, and Shusaku Hasegawa. The exhibition will open on November 14 and run through December 22.\n\n\nThe Whitney Museum of American Art in New York has announced the 2018 cycle of programming that will address how the institution works with artists, artists-in-residence, and artists-students to generate new work and create new experiences for visitors. The program will be curated by James Turrell, the director and chief curator of the Ninety-Third Street Armory, which is currently undergoing a $50 million renovation and will inaugurate its first exhibition of work by artist Karl Lagerfeldt in October. The announcement follows a year-long investigation into how the museum engages with artists through projects such as its “13th edition,” which will return work by artists such as Pierre Huyghe, Peter Schäfer, and Marianne Bovey, and will explore how art works in and through the lives and works of artists.“The", "The next Biennial should look to incorporate performances, exhibitions, and other activities that engage critically with the Kurdish art and culture. The 2020 edition will focus on the history and contemporary development of Sulaymaniyyan art in a light inspired by the contemporary art of the Kurdish regions.“We look forward to working with our partners in the Kurdistan Region to promote the exhibition at the upcoming Biennale,” said curator and cofounder of the Bilgi Art Foundation Zakiya Aliyeva.\n\n\nAs the coronavirus continues to circulate in China and Europe, the National Museum of Fine Arts (NMS) in Beijing has reopened to the public. The museum, which has been closed since January 23, has welcomed visitors in a mixed-media installation that combines drawings and sculpture and is located on the second floor of the NMS. The exhibition, “Ten Years with Tung,” will run from March 16 to March 20, 2020. “I was delighted to open the museum to the public on March 16, and we are planning to continue with a more diverse show schedule next year,” said NMS director Feng Tingchong. “In addition, we are working toward developing new ways to", "The next Biennial should be held in 2020. The research and exhibition hub will exhibit an exhibition of works by contemporary artists in the first exhibition of its kind in Japan, and will effectively launch a new platform for contemporary art. The opening of the new exhibition will be at the new residence, which will be inaugurated by the new president of Japan, a man who has called for a reopening of the Fukuoka Prefectural Museum of Art.The project was conceptualized by veteran curator Masaaki Ota of the museum, and the duo behind the venue, Japanese artist Hidetoshi Saitou and artist Taima Hidetoshi. A formal proposal for the exhibition, entitled The Future Is Present, was submitted by Katsuya Nakamura, chairman of the museum, in March 2020, but the exhibition was never moved. The project was also inspired by the Togarto, a massive, six-thousand-tonne sculpture by artist Katsuya Nakamura at the Kaikobura Museum in Nagoya that was built in 1983 and resurrected as a series of the artist’s works. The new home will feature the exhibition and digital platform ArtStation. The digital platform will allow visitors to", "The next Biennial should be held in Bali in 2021. The decision to cancel the next edition of the Biennial was made in the wake of the deadly arson attack on the City Museum of Art in Jakarta that took place on December 19, 2020, and left eighteen people dead and dozens injured.Although the arsonist, Arpi Solan, was sentenced to twenty years in prison and the arsonist, Thiago Forti, was sentenced to fifteen years, the judges ruled that the sentences were too lenient, and the perpetrators were given consecutive sentences.In a statement, the Art Basel Hong Kong and Art Dubai offices said: “We are devastated that our partnership with Art Dubai has been terminated. We respect and value the decision of the Dubai-based Arts Council, but at this time we do not believe this was an action taken by the Art Dubai authorities in good faith. We wish them best of luck in their future endeavours.”The Art Dubai Society was founded in 2007 and has its origins in the city of Dubai. It is an arm of the Dubai Foundation, which was founded by the emir of Abu Dhabi, Sheikh Mohamed bin Saeed, and his wife, Bandar, and is run by three governing bodies: the Dubai", "The next Biennial should be held in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is planning to move the upcoming twenty-fifth edition of the Museum Art World (MAW), titled “Art of the Present: Reclaiming the Future” from July to September. The move follows a similar move by the Museum of Modern Art in New York, which has also announced that it will move the institution’s permanent collection from October to June.“This is a moment when we are all collectively rethinking the future of art,” said Marc Glimcher, director of MoMA and chair of the board of trustees. “We have a responsibility to address the past, but we also have a responsibility to build upon the present. This is a moment of great uncertainty for many institutions. We had hoped that the theme of this year’s Museum Art World might be ‘Art of the Present: Reclaiming the Future” but it is not. And so, despite the uncertainty, we are generating new works by Henry Urbach, Robert Irwin, and others to present in conjunction with the exhibition.”The exhibition, titled “Henry Urbach,”", "The next Biennial should be held in 2021.\n\n\nThe Metropolitan Museum of Art in New York has launched a new initiative to help young curators and artists navigate their way through academic journals, symposia, and exhibitions. Called the #ArtStudies, the program will allow artists and scholars from twenty-seven participating arts departments to share their experiences and advice through a mobile app.“As the number of students in our program continues to grow, we are continually striving to present a broad and compelling array of artmaking and academic perspectives,” said Metropolitan curator Christiane Amanpour. “This new initiative will give our artists and scholars a tool to help them navigate our current academic environments and reevaluate their own paths through them, while also allowing them a platform from which they can share their own experiences and the thoughts of experts.”In February 2020, the participating arts departments formed a group to support the work of underrepresented artists. They are inviting the public to join them in their effort to increase the representation of African Americans, women, and people of color in the field. The participants will work in collaboration with art historian and curator Manuela Iannone and associate curator Adriana Varejão and will present a series of exhibitions in", "The next Biennial should take place in 2020. The biennial’s first edition, “11:56,” was held in 1997. The exhibition was curated by Benjamin Harnwell, director of the Haus der Kunst Berlin, and featured artworks by thirty-three artists, including Jos Klaas, Elsa Könitz, Oskar Kok, and Carlotta Moro. “Biennials are not just about the act of exhibition, but about the relationship between art and the artist,” said Harnwell. “The Biennial is a platform for the artist, for the exhibition, and for the listener. We rely on the artist to shape our understanding of art and the world. The Biennial is an experimental art museum that continually challenges us.”\n\n\nArts organizations in the city of Kraków, Poland, have filed a complaint with the Polish Culture and Heritage Museum in Warsaw over the removal of a work by Polish-born, American-based artist Michael Eric Stewart, who was born in New York City and grew up there, the United States, before moving to Poland in 1988. In an open letter, the ten organizations—which include the World", "The next Biennial should focus on the documentary art of the twentieth century, with a specific focus on the work of artists such as Walter De Maria and Ursula and the Biennials in the City of Tomorrow (2019) and Hanna Tezuka’s The Moon and the Art of Herbert Sussman (2019). “The new project of the Biennials in the City of Tomorrow is an attempt to push forward history,” Frank Gehry said. “It aims to be an extension of the work of the eras: a new form of art from the twentieth century.”\n\n\nThe Federal government is planning to spend more than $6 billion to secure the future of the iconic Rock and Roll Hall of Fame. The budget allocation for the biennial, which was revealed by Transportation and Infrastructure Secretary Anthony Foxx at a press conference on Wednesday, follows a $3.5 billion increase in the White House budget for 2019. The 2019 spending plan allocates more than $4 billion for “transportation and infrastructure,” the “core functions of which are to transport people, goods, and services across state and federal lines,” and it also allocates more than $2 billion for", "The next Biennial should take place at the newly renovated UNESCO World Heritage site in June, 2020 and will focus on the history and future of the city of the same name. The 2020 edition will be inaugurated by a presentation of the artist’s works.Art historian and curator Amalia Catellani has been appointed director of the Biennial for Contemporary Art. She will oversee the development and implementation of a new project on contemporary art and urbanism, which will address the themes of conservation and sustainability, and will oversee the production and exhibition of a new exhibition. “I’m ecstatic to be able to open the doors of the Biennial and welcome to Rome the very talented young artists who are developing their skills and their careers here,” said Catellani. “Art was and is at the heart of the Eternal City of Cervino, and I can’t imagine a place where the future of an art museum is not thoroughly affected by its collection.” She added that she will also work with the new director of contemporary art, Gio Ponti, to develop a new programme for the museum. Among the works in the exhibition are the first work by the artist and his wife, Ophelia, which", "The next Biennial should be held in December 2021.\n\n\nArtist-run space the Stedelijk Museum in Amsterdam has become the latest institution to announce the opening of a platform for artist-run cultural events. The institution, which is currently working on a redesign, announced that it would begin hosting live programming through ArtistSpace on its website. The platform will feature a suite of artist events and will draw visitors primarily from the public galleries of the institution.“The Stedelijk Museum is working hard to find new ways of supporting the already thriving art market and the commissioning of new works,” said curator Madeline Zarnow. “On the platform, we want to gain new perspectives on the museum’s exhibitions and catalogue, and to connect with the public through live programming that is in keeping with the animal spirit of the institution.”The platform will launch with a series of artist interviews that will mark the opening of the museum’s “Volta: Art and the Future of Reality” exhibition. In the first part, artist Hamza Tafoya, who is based in New York, will demonstrate how art affects our bodies and our world through a series of experiments that involve pulling a", "The next Biennial should be held at the Art and Design Museum Boston, which is currently undergoing a $500 million renovation; in late March, the Adirondack Museum of Art in New York, which is currently undergoing a $500 million renovation and has a budget of $150 million; and in June 2022, the Metropolitan Museum of Art in the Bronx, which is currently undergoing a $150 million renovation and has a budget of $150 million. The construction of the museum and the subsequent renovation of the Art Institute of Chicago is expected to total more than $5 billion. While the museum has had recent projects that added more than $100 million to its budget, its current round of construction will likely raise more than $500 million. The museum is currently negotiating with a consortium of six investors to organize an exhibition.\n\n\nThe Fine Arts Museums of New York and New Jersey announced today that they have reached an agreement with the heirs of the late British painter David Hockney, who was best known for his sculptural works and for his collaborations with the likes of Pierre-Auguste Renoir, Alex Katz, and Emily Hall. The institutions will jointly present the artist’s final exhibition at the Museums of the Arts, “The Death of", "The next Biennial should focus on the development of new approaches to working with the visual arts, and the management of collections and exhibitions. This year’s event will be held at Biennale Rotterdam.\n\n\nAfter a judge ruled that the cultural center that opened in a former brick factory in the industrial district of Gauteng, South Africa, in 1977 is structurally deficient and must close, Johannesburg’s Solomon R. Guggenheim Museum and Art Center was placed under permanent injunction on Friday. The institution, which was founded in 1994 by a group of South African South African artists, had filed a lawsuit in the Pretoria High Court on February 26 to prevent the closure of the institution until the building was fixed up again.The South African Civil Disobedience Movement (SACM) and the Pretoria Activists’ Association (PA), which had been supporting the lawsuit, were not deterred by the judge’s ruling.“Heckuva was still challenging the building,” art historian Michael Douglass, who was representing the SACM, told the Art Newspaper. “If he had won, he would have had to take the building down. The judge was very clear that this was", "The next Biennial should be held in 2021 and will showcase the work of the biennial’s alumni.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the separation of art and film in the city’s public spaces. Under the new guidelines, which were adopted by the city council in October, the Department of Cultural Affairs (DCLA) will not allow multiplexes to stage productions of The Phantom of the Opera, The Aristocats, Diogenes the Elder, The Da Vinci Code, Juliet and Julia, Ben-Menchaca, and The Girl with the Dragon Tattoo.DCLA also amended the state’s public health emergency list, a list of people who are at risk of experiencing an adverse health effect such as breathing difficulties or having a serious illness if they don’t seek medical care or are not treated within 24 hours. The list is updated every six months, and people who are on the list are required to show proof of receiving care at a hospital within thirty days of the date of the update. If a person is on the list but does not have proof of receiving care, they must notify a local authority of the person", "The next Biennial should be held at the AMC Willem de Kooning-designed house in London, which opened in 1992 and is currently home to more than 150 artists. The sixth edition of the International Biennial, which is scheduled to run from March 14 to March 17, 2020, will be held at the Museo de Arte Contemporáneo in Lisbon.  The 2018 edition featured more than 120 artists and was held in the Museo de Arte Contemporáneo, which was founded by American artist Wangechi Mutu in 2005 and opened in 2013.\n\n\nIn a move that will likely draw ire from activists and the museums that are already struggling to deal with the coronavirus, the Dutch government has reversed course and declared March 10 as the official opening of its long-stalled biennial, “The Silver Jubilee.” The move means that April 3 will be the last day of the event, which has been held every other year since 2007. Despite the change of plans, the exhibition will still go ahead, with the exception of March 30, when the biennial is expected to run out of its original site in the southern city of Antwerp. “For the", "The next Biennial should take place in 2022. However, the first exhibition in the new format, “First Steps,” will open on October 27 and run through March 22, 2021.The festival has been running since 1993, and will feature a selection of films, sculptures, performances, and performances-based projects that have been staged by various artists. It will also feature a retrospective of the work of Nirvan Allen, whose work was included in the initial exhibition, and will feature new works by participating artists. The biennial will raise awareness of the human rights violations committed by governments and corporate actors throughout history.\n\n\nWhen the question of whether to shutter a Brooklyn institution became an election issue ahead of last year’s mayoral election, the city’s health and wellness commissioner, Julie Uhr, issued a statement saying that she had come to the conclusion that closing the venerable Museum of the City Museum would be “unconscionable and prevent[able]” and that it was the only possible way to ensure the institution’s long-term viability.According to the New York Times, the decision was made on March 22, the day after Barack Obama’s re-election, and came", "The next Biennial should take place in 2021 and will be hosted by the contemporary art museum Zurich. The event will be hosted in the city’s foyer, the Swiss institution’s original home, which is currently undergoing a $9 million renovation. The renovation is expected to begin in June and will be completed by December of 2020.The renovation project is part of a larger project to modernize the museum and address the museum’s growing hangover of money from a financial crisis that began in late 2007. The overhaul includes the construction of a new building, the renovation of the museum’s existing campus, the construction of a new building for the exhibition and research pavilions, and the addition of six new galleries and exhibition spaces.\n\n\nThe National Galleries of Scotland announced today that it has received around $170 million in donations since it reopened in September 2019 following a £116 million expansion orchestrated by architect Sir David N. Balfour. The institution also reported that it has received four hundred and fifty thousand visitors to its new facilities. The National Museum of Scotland, which opened in Edinburgh in 2013, became one of the first cultural destinations in the United Kingdom to welcome visitors via the internet following the coronavirus outbreak. The National Theatre", "The next Biennial should take place in the summer of 2022. The organizer said that the redevelopment of the museum will encompass “more than 140,000 photographs by leading photographers from the last five years.”The exhibition will also include “KUNST-ÄMuseum-Michael Schaumann”\u0097a collection of works that are largely untranslated and photographed with a love for the city of Munich\u0097and “Babel,” a show about architecture that will include works by the contemporary artists Ludwig and Susanne Künert and will be presented by the German company Lapis.The announcement came shortly after the museum announced it will reopen next month. It will remain closed until March 15.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is planning to reopen to the public in April of next year, marking the reopening of a nearly six-decade-old institution. The extension will allow MoMA the opportunity to break its two-year closure once more, and will also allow it to launch the museum’s long-awaited second phase, which will be comprised of thirteen new galleries. In a statement, MoMA said: “", "The next Biennial should be in 2020. \n\n\nItalian artist, designer, and educator Fabio Bregoli, who was a member of the National Committee of Design, has died at age seventy-nine.Bregoli was born in Turin on March 24, 1936, in a family of Giorno, a northern Italian region that included Michele, Giovanni, and Edoardo Bregoli. After receiving his first commission from the region, Bregoli designed a series of scrapbooks for the Italian government in the late 1940s and 1950s. Among his other works is “Thinking of a Home,” a 1950 book that relates the history of the Bregoli family and documents the institution of a home for the children of Italian nobility in the town of Bregoli along with other historical sites.Bregoli also created Rafinotto, 1962, a series of drawings, paintings, and prints that are dated between 1957 and 1963; Simone: The Life on the Flushing, 1964; and Julia: The Dance, 1963, a collection of photographs and drawings that are doubled as a musical performance set to the choreography of Giorno singer Giulia Bocchioli.Bregoli", "The next Biennial should take place in the fall of 2020. If all goes to plan, in the spring of 2021 the museum will reopen to the public.\n\n\nThe Metropolitan Museum of Art in New York has given the green light to a new biennial dedicated to the artist-in-residence status of the late Iranian revolutionary Mohammad Reza Pahlavi\u0097a move that will bring about three hundred artists into the institution. A statement from the museum said that the decision to invite the artists was made as part of a new initiative called the Met Now. The event will bring together a group of contemporary Iranian artists, including Saeed Hersi, H.E.L.A.H. (Heroes Alive Again), and Ali Khodary, as well as Houshang Khalili, Ali Khalili, and Hassan Khomeini, and will take place in the museum's New York branch from January 29 to February 19, 2021.The Met Now will also introduce a new form of programming for its New York branch. In addition to the usual programming, which will focus on contemporary art and will feature a range of artists\u0097including Mohsen Gholipour, Ahmad Sarsavi, and Mina Sikander\u0097the inaugural edition", "The next Biennial should be held in 2021.\n\n\nThe Toronto Public Library, which is currently undergoing a major expansion, is expecting a $100 million shortfall due to the closure of the iconic Branch Library. According to the Star, the branch’s operating budget is projected at $200 million and the projected shortfall is $100 million.The branch, which was constructed in the former Branch Library on Yonge Street in the city’s east end in 2000, began accepting visitors in 2018, almost a decade after it opened. The branch’s existing programming, including the Toronto Thesaurus’s Exhibition Table and the Toronto Public Library’s Gardening Center, was moved to the new building.The branch also added two new galleries and a new public space, a community room, and an outdoor courtyard. The expansion, which was funded with $50 million from the Toronto Community Trust, included the construction of a new building and the renovation of the original building. The project also included the construction of a new underground parking garage and the renovation of the plant where the collection is stored. The renovation is expected to total more than $120 million.The Toronto Reference Library, which opened on Yonge Street in 2009, is also facing a projected shortfall", "The next Biennial should take place in 2020.”The 2019 event featured a number of works by women artists and was held in partnership with the Museum of Contemporary Art Los Angeles (MCA).\n\n\nThe Whitney Museum of American Art (MCA) in New York announced today that Paul Gauguin’s sculpture The City of Empty Places (1929), which reimagined the American landscape through a series of concentric rings, will be restored to the museum’s collection. In a statement, the institution said: “The City of Empty Places is the result of a lifetime of exploration and development. The work’s relationship with the Suburban Institute and the MCA enables us to re-create this work in a new context, as an exhibition piece showcasing the work of a select group of artists that embody all that is New York and the city.”The new exhibition, “American Folk Art: From the City to the Land,” will explore the work of artists who “dare to take the earth from us. They are artists whose art is grounded in the American dream and in their work, in the city, they tap into the human spirit.”The work, which was created in the", "The next Biennial should be at least four years away. It also said that it would work closely with the government and the private sector to help develop cost-effective ways to transport art. The biennial will not be affiliated with the Japanese government and will be funded by the Tokyo Metropolitan Government as well as the Tokyo Metropolitan Arts Festival (TMAF).\n\n\nThe City of Indianapolis is working to kick off a public art conservation campaign through its 311 arts and culture agencies. The initiative will partner with local, state, and federal governments to identify and conserve historic works, and will offer grants of up to $100,000 to individuals as well as grants of $250,000 to nonprofit organizations.The city launched the initiative, called the City Conservation Initiative, in 2017 to conserve more than four hundred city-owned assets through a combination of curbing the destruction of artwork and investing in the care of art collections. The strategy was inspired by Charlotte Rampling’s famed Bicentennial Square garden, created in 1923, and the Botanical Gardens of Philadelphia, which were decimated by a developer in 2009 and 2010. The city’s current strategy, developed in conjunction with the Ramblers, involves creating about two hundred new works each year, and", "The next Biennial should be the EPFL’s new exhibition “Life After Life: Renewing the Vocation” in September 2020. The upcoming exhibition “Prospect: Life at the End of the Road,” will open in April 2021.The Biennials are organized as biennials—each biennial is comprised of three to five exhibitions that are selected by the director of the exhibition and organized into a three-day cycle. The 2019 edition, which was organized by the French theoretical artist Bernard-Henri Spaure, opened on October 6 and ran through October 29. The exhibition received a live performance by a group of New York City–based artists and writers.As a result, in 1992 a career-spanning exhibition of work by M. S. Guevara and Julio Cortòn was created. This show was also followed by the 1978–79 exhibition “Avis de la République” (“A Visit to the Parisian Museum of Modern Art”), which is currently on view until March 11; and the forthcoming “Sydney 1983: The Art of the Party.” Next year, the show will open at the Sydney Opera House as part", "The next Biennial should be held sometime in the 2020–21 academic year, according to the organizers. 'We are confident that by carefully and in detail organizing this exhibition, we have managed to dismantle the exhibition as a whole and prepare for a different exhibition, the best exhibition it has ever presented, as we have done for more than forty years.”The show’s next iteration will be held in the space of the city’s university and will be organized in collaboration with the Israeli art historian Shmuel Rabiner, whose work is included in the exhibition’s catalogues. The exhibition will be inaugurated by an exhibition of work by Sivan Kurland, who was one of the first artists to participate in the exhibition. It will then move to the new building of the Kfar Gilad Institute of Art, where it will remain for the rest of its mandate until 2020.\n\n\nAfter a judge in a Brooklyn federal court ruled that the New York City Department of Cultural Affairs (DCLA), which oversees the city’s cultural heritage preservation program, has the authority to remove a work from a museum for violating a federal law that prohibits the sale of works in violation of federal law, the city’s", "The next Biennial should take place in 2021. The third and fourth biennials have yet to be announced. Singer-songwriter Lucinda Williams, who has been known to collect works by artists including Tilda Swinton, Gregory Corver, and James Turrell, will lead the 2020 edition. Swinton said: “The partnership between the Museum and the Edwards Art Museum will give the collection a new, experimental voice. These six years will be a defining period for the collection. I look forward to working with my colleagues, the entire team, and the entire community to learn from you, inspire you, provide you inspiration and to push you as artists.”The museum will add a fourth exhibition dedicated to the life and work of painter Carl DeMaio in 2021. DeMaio, whose semi-autobiographical paintings are often viewed as a manifestation of his own existence, is best known for his six-decade career as a self-taught canvas. The show, “A Life of Painting,” will be on view on December 15 and will be curated by Sigmund Freudenthaler, who is the Edwards’s director of curatorial affairs. The exhibition—which will open in 2021,", "The next Biennial should take place in 2021 and the first in 2022. The exhibition will also include an exhibition of work by artists such as Harald Szeemann, Harald Scherer, Richard Goldblatt, and Tanya Cooper, as well as a study of the works of a group of black artists known for their direct adaptation of the work of white artists. The first show of this collection, entitled Black/White, will open at the Skowhegan Gallery in London in December.  \"We are thrilled to be working with the Whitney Museum of American Art to present the first show of this collection at the Skowhegan Gallery in London, which will be a great milestone for the exhibition, and extremely happy to announce that the new exhibition will begin with an artist-run event in December,\" said Elyse and Percival Zucker, president of the Skowhegan Gallery, and the new exhibition. The Skowhegan Gallery is one of the many cultural and educational institutions, codenamed the Skowhegan Center, that were established to serve the Black community in the 1980s. The institution recently celebrated its sixtieth anniversary with an exhibition that highlighted the work of Black artists from the 1970", "The next Biennial should be held in 2020.\n\n\nThe DiCecco Art Museum in Florence has received a major gift of twenty-one works by two dozen artists from the late Italian director Giunta di Cennaro. The works—which were recently displayed in an exhibition titled Between Two Worlds—are a collaboration between Carlo Cipolletta and Stefano Cipolletta, the director of the Feltrinelli Institute in Cagli.Giunta di Cennaro’s son, Stefano Cipolletta, is now involved in the restoration of two of the works. The museum also received a gift of the artist’s work from the artist’s daughter, Lucia Cipolletta, in 2015. Giunta di Cennaro’s widow, Andrea Cipolletta, is also collaborating with the museum on the restoration of a painting by Bernd and Bettina Schipper, which was recently installed in a new exhibition on the history of art, “Bernd and Bettina Schipper: The Art of the Spot.”The museum is now working with the artist’s daughter to collect her father’s final work,", "The next Biennial should be staged in late January. The theme of the event will be “life after death and the afterlife.” The first exhibition will be “Life After Life and the Afterlife” at the Museum of Contemporary Art (MA), New York. The second will be “Life After Life and the Afterlife” at the Museum of Modern Art, New York. In the third exhibition, titled “Life After the Resurrection,” the artist will paint a vision of a chapel where she will inter the body of Christ to create a cross for the sick.The event will take place over two weeks, February 27 and February 28, 2020. Prize recipients will be announced on Monday, February 22. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to remove 400 works by Maurice Rich and his son, Pierre Rich III, a sculptor who created works that were influential in popularizing the modernist movement, including The Big Sleep and The Body in Space, both of which are currently on display in the seventh iteration of the “Aurora Contemporary” series at the museum.A statement by MoCA director Klaus Biesenbach reads: “After a careful review of", "The next Biennial should focus on “the problems of the body in the twenty-first century,” said the artists. “The next edition will showcase its work in a different way, with more perspectives, more collaboration, more transparency. And I want you to see its work as a step in the process to come. I want you to feel the impact of our work in the next exhibition.”Andreas Gberlitz, the artistic director of the Biennial, said: “It is a great honor to present to you the epitome of biennial, our exhibition. We have chosen to have you see the work of the artists from Germany, Italy, and the United States. In the exhibition ‘Innovation Is Possible’ we have created a series of works that address diverse issues from a philosophical point of view. What we are not talking about is new technological concepts and environmental realities, but rather about the art of the future.This is a very exciting and challenging moment. We are now awaiting the biennial’s opening, and the exhibition will open in September in Frankfurt and Berlin. We are prepared and ready for all the events that lie ahead.”\n\n\nThe Ellsworth Pollock Foundation announced", "The next Biennial should focus on the history of the exhibition and its development. The next iteration will focus on the exhibition’s collections, including works from the Global South, and will draw from the work of artists from Africa, Europe, and the Global North.“The Biennial of South Asian Art is an opportunity to draw attention to the history and practice of South Asian art through a combination of direct exhibition projects and collaborative projects,” said Pradeep Pandey, president of the biennial.  \n\n\nQatar’s Culture Ministry has suspended a planned exhibition in protest of a film made by Al-Jazeera that depicts the Prophet Muhammad and includes scenes of Prophet Mohammed being crucified, tortured, and executed. The move comes amid a “new stage of the conflict between Islam and the West,” Ali al-Shahristani, the minister of state for culture and heritage, told the Art Newspaper. “This is an important step in preventing further escalation of the crisis, and one that will help us all avoid making excessive demands.”“We are deeply concerned by the grave violations of religious freedom and decency committed by the film crew,” Shahristani said in a statement. “This", "The next Biennial should be held in 2020, to take place in the city of Pais Vasco, in the state of Rio Grande do Sul.\n\n\nThe National Trust for Scotland has announced that it will return the island of Kathers to the Scottish Government, following a landmark referendum vote that will give the devolved Scottish Parliament the power to change the country’s constitution. The landmark vote, which was held on June 12 and resulted in a resounding majority of 158 to 73, changed the country’s constitution in favor of a more inclusive version of the UK. It also aims to create a more powerful Scottish Parliament and increases the number of seats available in the Scottish Parliament from three to five.The decision follows a series of high-profile victories for the Scottish National Party (SNP), including the historic election of SNP leader Ruth Davidson in March 2020, which saw the party retain all twelve of Scotland’s House of Commons. The result also granted the SNP a majority in Scotland’s European Parliament. The organization’s manifesto for the 2019 general election pledged to hold an SNP majority government in Scotland, but the party failed to secure the necessary number of seats. In its attempt to avoid a hung parliament, the party formed", "The next Biennial should be in 2021. The 2019 edition, “Prix Meret Oppenheim,” marked the opening of a new, larger and more expansive exhibition space, the Meret-Omniv, in the foyer. The exhibition was organized by the lobby of the Meret-Omniv.\n\n\nThe Tate’s board of directors has appointed Simon Weston as its new chair of artistic design. He succeeds Pradeep Ranjan, who served as chair of the board of trustees for only three months before he was appointed to the post.“Simon has an outstanding record of inspiring and delivering visionary exhibitions, exhibitions that are both grounded and innovative and international, and is ideally suited to lead the Tate into the future,” said Tate director Hamish Anderson. “Having sat in his chair for exactly half a year, he has established a strong legacy for the Tate as a contemporary and sustainable institution, and we are eager to see what he does next.”In his new role, Weston will oversee Tate’s redesign, construction, renovation, expansion, and improvements, which will also involve the construction of new galleries and of the Tate’s new main building.", "The next Biennial should be held in 2019.  \n\n\nThe Bolshoi Ballet in Moscow has announced that the second edition of its Annual Art and Drama Festival will be held in the Russian capital in September 2021. The event, which has been held in St. Petersburg since 1955, will take over the Bolshoi Ballet Arena and will be led by Dmytro Yarosh, who will be assisted by the company Ternopilota, for a three-day event.Lasha Moiseyeva, the head of the company, said: “I am delighted to announce that the art of the artist is being presented in the Russian capital. The new Festival is built around the theme ‘Life and the Art of the Art of Life’ and will have an even more important role in expressing the spirit of the artist in the contemporary manifestations in the new galleries.”As part of the art and culture project in the city, a new exhibition will be organized, an exhibition of work by young artists, a symposium on Russia’s contemporary art, and a variety of events. Additionally, a new public library will be built, a kindergarden will be opened, and a new theater complex will house the Festival.In", "The next Biennial should be held in 2020. \n\n\nThe Metropolitan Museum of Art (now the Museum of Modern Art) in New York has removed a controversial work by sculptor Robert Irwin that was featured in its 2010 exhibition “Fallen Fruit,” a follow-up to “Open Life” that explored the power of art to affect our lives. According to the New York Times, the institution deemed the work “too radical” for its current context\u0097it was one of the first works to feature the artist’s work in a public setting\u0097and rescinded the show.The museum said that its decision to scrap the show had nothing to do with the controversy surrounding the artist’s work, which many saw as offensive and offensive to women, people of color, and LGBTQ people. Rather, it was made in light of “new realities about racism and police violence that we now face,” as the country joins the U.S. in trying to come to terms with the impact of the coronavirus, which is spreading rapidly in the United States and Europe.As of Wednesday, there are more than 4,700 cases of the virus and three coronavirus-related deaths in the country", "The next Biennial should take place in 2021–20.  “I have long been a fan of the exhibition, and with great enthusiasm and pride, had the opportunity to be a part of its development,” said Frank Gehry. “We have been working on a new exhibition since 2009, and with the support of the local authorities, the exhibition was approved for opening at London’s Serpentine Galleries in 2012. I am very proud of the work that the curators and the public have done to bring the Biennial to life, and to make the exhibition the defining event of the year.”Commenting on her appointment, she commented: “I’m thrilled to join London’s Museum of London Art, and to be able to contribute to its rich history. The Biennial, as a project of work and thought, is a powerful reflection of what we do as artists. I’m eager to work with the talented team to bring the Biennial to life in 2020.”\n\n\nThe National Galleries of Scotland (NGA) has appointed Ingrid Curran as its new director. Curran comes to the institution from the National Art Gallery (NAG) in London", "The next Biennial should take place in 2021, and the show will be held in the Renaissance Society’s new location in the city of Reggio Emilia from June 1 to June 4.Sebastian Kappel, Biennial director, said: “The new Renaissance Society is remarkably well organized and talented. We are eager to continue to present the work of the artists that have made the exhibition series unique and influential. I am confident that our biennial will be a success to the artists who are represented and to a vast and growing audience.”\n\n\nThe Willamette Valley Museum of Art (WVM), in Salem, New York, has appointed Randle J. Neal as its next director. Neal comes to the institution from the Seattle Art Museum (SAM), where he has served as deputy director since February 2019. He succeeds Marylou M. Bolton, who retired in February 2019 after ten years at the helm of the WVM, which is located at 690 East Tenth Street in Portland, Oregon. “Randle brings to our organization a wealth of experience, an ability to prioritize execution, and a commitment to building stronger relationships with the local community,” said Beth Hennigan, WVM�", "The next Biennial should take place in 2020.\n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) in Philadelphia is planning to open a year-round art museum in the city, which is currently home to the National Gallery of Art, the Pennsylvania Academy of Fine Arts, and the Pennsylvania Museum of Art. PAFA president Mary Olens announced the announcement in a statement on Monday, February 13, after a lengthy and contentious campaign to save the institution. “Since PAFA’s founding by businessman Leo Kahn in 1924—when PAFA was still a nonprofit—the museum has been committed to being a vibrant and inclusive resource for the Philadelphia region,” Olens said. “PAFA has always been about promoting the art of our region, and we are committed to continuing to do so. The museum’s new location in the city will not only provide a great platform for our talented exhibition-makers, it will also bring with it a great opportunity for our local community to see and enjoy the art of our region.” The announcement came amid construction of a $150 million renovation and expansion that will include the creation of a new public gathering room in the museum’s courtyard, a new reception space for the", "The next Biennial should take place at the Museum of Contemporary Art (MoCA), in Los Angeles, in 2022. The museum currently has an opening party for the exhibition Unseen: Art in the Age of New Media\u0097a collaboration with artist and curator Shirley M. Thomas\u0097at the museum on Tuesday, September 11. “Afternoon Tea: Art in the Age of Blackness” will be installed on the facade of the institution the following March. The exhibition will also present a reconstruction of a 1692 encounter between artist and philosopher George Moore and will stage the work of L.A. Reid, Lionel Asprey, Walter de Maria, and Owen Williams.Art historian Hermann Hesse, a founding board member of the Stedelijk Museum of Modern Art in Amsterdam, also urged the institution to renew its contract with the South African Institute of Art (SAI)\u0097the institution currently has a ten-year contract with the institution\u0097as well as to keep its doors closed. He told the Art Newspaper that the institution should have reopened have been more proactive in promoting black artists and not fostered “an atmosphere of racial", "The next Biennial should feature a selection of contemporary works that are feminist, queer, or environmentalist\u0097ranging from a feminist political manifesto by Sarah A. Selwyn Holland in 2019 to John Akomfrah’s 1970s film Tropic Thunder (1975), with its feminist politics of love and sexuality. As part of an ongoing project of the Los Angeles–based artist-run museum, the Biennial will host numerous public and private exhibitions, including “Ai Weiwei” (2019) at the Los Angeles County Museum of Art and “Hannah Weitekamp” (2019) at the X-Art Museum in New York.\n\n\nThe Museum of Fine Arts (MFA) in Boston is facing a backlash from arts professionals after it announced that it will lay off at least one hundred staff members and close its doors indefinitely due to a coronavirus outbreak. The news came on the heels of the Massachusetts-based arts advocacy group the Commonwealth Fund, which has been working to persuade the museum to remain closed during the pandemic.MFA director Amanda Holden told Artnet that the decision to suspend operations was made on June 28, the same day that the coronavirus outbreak officially began in the United States. “We", "The next Biennial should be held in 2020. The first iteration, “A History of Resistance,” was staged in 2020 and ran for twelve months. The second iteration, “A History of Resistance II: Resistance in the Age of Trump,” was staged in 2022; the third and final version, “A History of Resistance III: Resistance in the Age of the Machine,” was staged in 2025. “We are excited to welcome to the Biennial the award-winning artists and designers who create innovative and thought-provoking works that challenge and enliven our world,” said Hannah Whiteley, the chair of the trustees. “These are the artists and designers who are taking matters into their own hands, challenging convention, and reimagining the future. We are proud to support their work at the Biennial and to celebrate their amazing achievements and beyond.”\n\n\nAs the coronavirus continues to spread across the United States, museums and cultural sites such as the Metropolitan Museum of Art and the Smithsonian American Art Museum in Washington, DC, are preparing to welcome visitors again next week. The reopening dates were pushed back in large part because of concerns about the coronavirus, which was"]