["The next Biennial should focus on major breakthroughs in art history, such as the work of Russian surrealists, and should include several international artists. And finally, it said, the exhibition should be centered around themes of social justice, the body and the inexorable flow of life.It continued: “The next Biennial should not be limited to the themes of the past. It should resemble the spirit of the new century. It should be an extension of the biennial which has become a global phenomenon.”The invitation-only exhibition was organized by the Berlin-based Breitbarth Museum, which has hosted the exhibition for the past two years. Its director, Birgit Breitbarth-Heller, said: “The next Biennial has been a genealogy of the present, an extension of the work of the past, a way in which the present affects the future. It is the continuation of the grand experiment of the Breitbarth Museum, which aims to change the way we think about art and to reveal the implications of art history.”\n\n\nAs New York City heads into Phase 4 on Tuesday, June 3, the city’s public art and cultural institutions will begin transitioning from construction to operation.", "The next Biennial should be held in the spring of 2021. In the meantime, the organization has created a website where visitors can upload photographs and videos of the works by selected artists.It is also planning to launch a biennial of works by the same artist in the second half of the year, in the same year as the Uffizi biennial, in the city of Milan. The new editions of the Uffizi Biennial will be held in various locations throughout the city. The new exhibition, “Tit for Tat,” will be held at the Uffizi in the coming months and will welcome twenty-one artists, including Michelangelo Pauli, Anselm Kiefer, Felicity Hammond, Oskar Eustis, Martin Podrasky, and Edoardo Vescovi.\n\n\nThe Museum of Fine Arts (MFA) in Boston has launched a new digital platform that will allow visitors to view works by underrecognized artists. The platform, called the Artists List, will feature works by fifty artists on the website as well as a list of recommended artists for the upcoming exhibition “Artists on the Move,” which will take place in Kiel from March 19", "The next Biennial should entail a number of exhibitions including the first public exhibition of work by the German artist Georges Apostel; a retrospective of the artist’s works at the Nationalgalerie in Vienna from the second Biennial; and a survey of the artist’s works at the Kunsthalle Basel in Switzerland.“We are talking about using the institution as a platform to address a wide range of issues,” said Ehrlich. “The exhibition of the artist’s work at the Kunsthalle Basel is a landmark, and this will be the first time the artist will be presented in the Swiss state.”The theme for this year’s event will be “My Life and the Art of Joseph Beuys.” It will premiere at the Basilica of Saint Sebastian in Basel from March 23 to March 26.\n\n\nThe museum’s collection of more than 1,500 works by American art workers in its collection arm is preparing to reopen after construction on the space began this week. The complex, which was the site of the museum’s former domed home, the Los Angeles County Museum of Art (LACMA), began up in a converted industrial building", "The next Biennial should involve the development of a new conceptual framework for the exhibition of the artist’s work, with a view to generating and countering new practices. The Biennial of Philadelphia will be held in 2021.\n\n\nThe Metropolitan Museum of Art (MoMA) has received a gift of forty-six works from artist Illa Mona, whose critically acclaimed, multi-leveled sculptures, collages, and paintings were frequently used as training exercises for the artists that would shape Modernism and postmodernism as well as the new American artist-centric art museum, the Whitney Museum of American Art, which is currently undergoing a $400 million expansion.The gift includes works by artists such as Edward Meringolo, Richard Diebenkorn, Oskar Eustis, and Peter Soames, as well as works by artists and collectives that have previously only been exhibited in the United States. The works will now be exhibited in the museum’s permanent collection, which will open in 2020, in a series that dramatizes the Met’s extensive collection of art from the artist’s extensive career.“Illa Mona’s extraordinary legacy is an inspiration for museum-going and speaks to the role", "The next Biennial should take place in London in the spring of 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has released an open letter to the Museum of Modern Art (MoMA) in which it urges the institution to remove an exhibition titled “The Spirit of Bits,” 2019, from its campus. The show, which was curated by Dave and B.G. Lyle, features ten works by seventy artists, including Antony Hudis, Mary Ellen Mark, Amy Sherald, and Guggenheim Fellow John Zwirner, and examines how artworks have evolved through time.“This is an exhibition that has been on display on our campus for thirty years and has never been removed, let alone damaged, damage, or torn down,” reads the open letter from MoMA director Matthew Teitelbaum. The letter continues by calling out the institution for its failure to address the issue of historical materialism in the exhibition and its silence on the issue of the role of art and historical material in American life.“We apologize for writing this letter and for the circumstances of which we have become aware. We are aware that many art workers and scholars have expressed the need and desire to engage with", "The next Biennial should be scheduled for 2021, said Okwui Enwezor, the festival’s artistic director and director of the Central African Museum; the Central African Museum of Art, where the upcoming exhibition will be staged; and the City of London Museum of Art, which will incorporate London’s St Paul’s Church of England in order to facilitate the installation of the exhibition, titled “Beyond Place: Europe and the Visual Arts in the Age of Resistance.”The fifth edition of the show, titled “Beyond Black: Art in Contemporary Resistance” was set to open at the Museo Nacional Centro de Artes Tardarán, Brazil, in September. The exhibition will return to the Museo Alava, in the city of Manaus, later this month.The OKEA Fair, which was originally scheduled to take place at the Kunsthal Charlottenborg in Stockholm in November, was postponed to November 22, 2020. The entertainment and arts fair, which was also slated to take place at the city’s O2 Arena in London, was then moved to the NOSO Arena in the city of Malo, in the island state of Varejão, in", "The next Biennial should conclude with a special exhibition titled “Art in Motion,” curated by Jeff Koons, the American Philatelist and the French Newcomer who is perhaps best known in the United States for his $50,000 grand prize, which was awarded in 2009. The show will be presented by the City of Los Angeles and the museum with a $10,000 donation from Koons.The 2018 edition of the annual Guggenheim Biennale, curated by Marc-Olivier Kahn and staged at the Museum of Modern Art from September 11 to September 15, featured work by seventy-two artists, including Joana Córdova, Zara Hemer, and Sargent’s son, Alex, and featured work by contemporary and master artists, including Veronique Huyghe, Frank Gehry, and Ingvild Moll.\n\n\nThe Montreal Museum of Fine Arts (MMA) announced today that it is moving forward with construction of a new $169 million, $50 million, and $38 million collection center dedicated to the works of Pierre-Auguste Renoir. The ambitious project, which will include the acquisition of the artworks by the celebrated French surrealist, was first", "The next Biennial should take place in 2020, at which point the museum will be closed. The museum anticipates a significant financial loss from the closure, but believes that this is an appropriate time to continue to invest in the collection and the research of the Portuguese master.”For the organiser, the museum’s final exhibition “is a work of a long-standing and exceptional collection composed of works that make clear the evolution of the art from an early point of view to an even older and more important one.” He added that the new exhibition “is not a substitute for the Biennale. It is a continuation of the history of the show with the content and the style of the old work.”\n\n\nThe National Gallery of Art in Washington, DC, is planning to shutter its doors on March 31 amid an outcry from senior officials in the institution over the exhibition “The Body,” a series of close-ups of the bodies of women who have died from suicide, and reevaluate its gender-focused programming in light of the coronavirus pandemic. The show, which is currently on view until October 27, will confront issues of womanhood—the first exhibition by the group the Museum of Women in", "The next Biennial should focus on large-scale social and cultural production in the digital realm, with a particular reference to the new wave of digital production connected with biennial exhibitions and the rapid growth of the creative sector. The biennial will also consider the evolution of the exhibition and its use in a new way, as the biennial is already undergoing a radical reorientation. The exhibition will now be conceived as a platform to provide the public a new form of artistic experience and to draw new visitors to the pavilion. “As we think about the future of art and architecture, we are constantly confronted with the current conundrums and challenges posed by our technological age,” said Anne-Marie Oostra, chair of the Biennial Committee. “With your support, we have demonstrated our commitment to the future of the Biennial as a public and private endeavor, which is deeply meaningful and exciting.”Selection of the twenty-three artists chosen for the biennial was made by a committee chaired by Berthold Borgstrand, director of the Künstlerhaus in Berlin. Borgstrand cited their performances in the exhibition as a reason for the selection. The twenty-three artists are: Andreas Althaus,", "The next Biennial should focus on the history of the practice, as well as the plans for the next biennial, and how this history can inform our efforts to build and protect the biennial's legacy.I am a biennial historian and am eager to see the Biennial at Kent Farm and the forthcoming biennial at the Museum of the Greek Academy. I am hopeful that this year’s edition will be as engaging as the last, and will present the best possible exhibition format for the exhibition.”Marlene Morgan, chair of the biennial’s Art History committee, said: “The MGA Kent Farm will be the ideal setting for the next edition of the biennial, with spectacular views of Oxford Bay and the Thames and the Kentish city of Walsall. The selection of contemporary works by the artists represented at the exhibition will be a strong reflection of the breadth of contemporary art. We are confident that Kent Farm will present a strong exhibition at the end of the series, as it has in the past.”\n\n\nA group of artists and art workers in China who were detained on suspicion of working with rogue state groups and were released on December 7 after more than four weeks in detention without charge were reinstated on Monday", "The next Biennial should be held in 2021. The next Biennial in NYC should be held sometime in 2020. If we don’t act now, we could see an emergency at some point in the coming decades.”\n\n\nThe Museum of Fine Arts (MFA) in Boston, Massachusetts, has appointed Jennifer Teets as its next director and CEO. She will take the helm from Kathryn Zapata, who will remain involved with the museum in an advisory capacity, and will begin her tenure in January 2021.“We are thrilled to welcome Jennifer to the MFA,” said museum director Agustín Arteaga. “Her impressive track record as a curator, expert, and leader will allow her to take the MFA to new heights as it continues to grow as a regional center for art. Our mission is to support and inspire contemporary artists through a commitment to education, research, and exhibitions. With her experience and leadership, she will continue to expand and strengthen the MFA’s public and private collections, collaborate with artists and scholars, and grow the museum’s collection in a way that ensures the MFA is an important platform for contemporary art.”Prior to joining the MFA in 2014, Te", "The next Biennial should take place in 2021, with the show opening in 2022. The 2019 event, entitled “Sustainability, Politics, and the Making of Modern Life”, was held in Montreux, Switzerland, and was curated by Christian Bronckhörfer.“The new biennial will break new ground through a combination of new research and new exhibitions, as well as new formats and topics that are sensitive to both the contemporary and contemporary-historical,” said Thomas De Waal, director of the Biennial. “The exhibition ‘2024: The Next Biennial’ will be another watershed performance in the show’s history. While inspired by and connected to that of the previous three years, the exhibition will take its place in a very different and more important world.”Developed by the Foundation for Contemporary Art in partnership with the Athens-based Art Foundation, the exhibition will feature work by 125 artists, including Alex Nossis, Elin Hoehn, and Gundersen, and will run for four weeks in March and June. Selected from a shortlist of fifteen, the exhibition is curated by Mavig, who also curated the inaugural edition of the show in 2005.", "The next Biennial should take place in 2019, and the exhibition should resume in 2021. The next exhibition should take place in 2020 and the exhibition will stay on display until at least 2023. For the executive committee, the decision to hold the event was made after a report commissioned by the National Gallery of Art and the Metropolitan Museum of Art, which was launched by the museum in 2010, concluded that the two pieces must be presented simultaneously. In response, the architects were given one year to come up with a new vision for a future exhibition that would address the theme of the exhibition “The Puzzle of Man”\u0097a six-dimensional conceptual tool that would have introduced a new branch of the Museum’s collection of classical and modern art\u0097and the institution.​\n\n\nThe Hirshhorn Museum in Washington, DC, has appointed Laura Higgins as its next executive director. Higgins currently serves as the director of the Museum of Modern Art, where she has worked since 2015. She succeeds Richard Armstrong, who retired after eight years at the helm of the Hirshhorn in June.“Laura’s appointment represents a moment of tremendous change for the Hirshhorn, whose mission has been to support and champion art", "The next Biennial should be released in October 2021.” \n\n\nThe Brisbane Museum of Art (BMA) in Australia has announced its representation of the newly-formed Australian black metal group the Withers, who were one of the first organisations to experiment with the post-hardcore movement in Australia and were one of the first acts to play at the BMA. The band will stage its first Australian tour in October 2021, with a show of work by artist Kyeong-Min Lee in November 2021. The biennial will include works by artists such as Nari Ward-Parsons and Seshekha Gindewa, director and cofounder of the Withers; Russel Kirkpatrick; and original members Kiki Smith, Kyle King, and Neil Parrish. “The new museum is thrilled to welcome the Withers to Brisbane and to continue to present their work at the BMA to the public,” said Mark C. Bont, the BMA’s director. “We will continue to explore new ways to engage with their music, through online features and performances, and to create public programming that connects our contemporary world with their art.”\n\n\nThe Museum of", "The next Biennial should include a presentation by the artist, a selection of his drawings, and the performance. This exhibition has been in the works for over a decade and is currently the subject of an exhibition at the Biennial of Modern Art (1899) in Paris.“Alexandre Delon, Andre-Édouard Modigliani, and Pierre-Auguste Merriweather, among many others, have been the legendary founders of the gallery. We admire those three artists deeply and hope that they will continue to advance this important work in the coming years,” said Jean-Marc.\n\n\nMikhail Kalashnikov, the Russian-born American designer, director, and curator whose groundbreaking conceptual art was inspired by the west and populated by a strong sense of the unexpected, has died at age sixty-two at his home in New York.Founded in New York in 1987 by a group of students from the University of Pennsylvania, Kalashnikov’s ephemeral­–inflected style became its defining eighties foundation. It evolved from an exhibition space where people could meet and experiment with the artist’s conceptual process to a full-blown arts institution established in 1996. In the intervening years, the museum has been transformed", "The next Biennial should be held at the gallery in the fall of 2020, and will be organized as a “platform for multicultural dialogue, civic engagement and sensitive social justice actions.”The biennial will be one of the first in the city of Atlanta, which has seen a population increase of more than 735,000 since 2012. Atlanta’s mayor, Kasim Reed, said the city expects to draw more than 150,000 visitors to the city’s art museums in 2020, and more than 70 percent of the biennial’s exhibitors will be African American.The announcement of the 2020 biennial, which was made in partnership with the Atlanta Regional Commission (ARC), heralded the return of the art world to the city. The biennial will feature work by thirty-four artists, including James Turrell, Calvin Chappell, Sonia Dulai, Evelyn James Blake, Patricia Farley, and Yinka Shonibare. “The Atlanta Arts and Culture Festival is a true celebration of the art world in our city,” said Reed. “It is a time for reflection and reflection is a time for celebration. Whether you are in the stands at the Museum of Art or the", "The next Biennial should include a selection of works that were on view at the time of the event and, if possible, a selection of the works that were not on view at that time. The biennial should finally be completed by the end of the year.The 2019 Biennial will take place at the Museum of Contemporary Art in the Arts in Santa Monica, California. Individual performances scheduled for the exhibition include: Andreas Heiko: Atheologie Bénédicte de Montet (1938) Fabienne Hammond: Hésitation avec l'étoile de l'Amitelie (1937–1938) Fabienne Hammond: La Vie en Rose (1937) Pamela Alexander: The Great Gig in the Garden (1937) Marisa Lieberman: Nirvana (1937) Kathy Willoughby: Surrender: The Biennial of Art (1937) Léonie Béchard: The Black Madonna (1937) Marianne Bécher: Sister, Son & Self (1937) Wangechi Mutu: Hannah and Her Sisters (1936)", "The next Biennial should be held in 2021.  Beijing is currently working on a new plan for the 2020 edition, which will likely be unveiled sometime next year.\n\n\nThe Museum of Modern Art (MoMA) has received a $30 million donation from the Charles and Lucille King Family Foundation, a family foundation dedicated to supporting contemporary art. The gift comes on the heels of a $25 million gift that the King Family made in 2014, which doubled the museum’s endowment. The money will go toward improving the museum’s collection and collection programs, expanding its international exchange program, and improving the museum’s exhibition space.“The Charles and Lucille King Family Foundation is thrilled to receive this generous gift to MoMA as we continue to broaden our curatorial and educational programs and deepen our engagement with Chicago as a city,” said Frank Gehry, president of the King Family. “Together we will continue to build on our distinguished legacy of leading the Museum of Modern Art in Chicago, as we expand the museum’s international reach and enrich the museum’s collection and exhibitions.”\n\n\nThe Museum of Modern Art has received a generous $6 billion donation from the King Family Foundation. The", "The next Biennial should begin July 17 and end July 20. The next National Gallery of Canada Exhibition should open on July 18 and close on July 20. The next Metro-Goldwyn-Mayer in Beverly, Massachusetts, should host an exhibition in the spring of 2021. The next National Gallery of Art in Washington, DC, will open in 2020. The next Museum of Contemporary Art in Houston is currently on track to begin its inaugural season in March. The next Museum of Contemporary Art in New York will open in March 2021. The next Museum of Fine Arts, Houston, will open in March 2021. The next Museum of Modern Art in the United Kingdom, which opened in March 2018, will open in March 2021. The next Art Institute of Chicago, which is currently on track to open in March 2021, has announced that it is rescheduling its inaugural exhibition, “Black Box,” for March 21–March 29. The next Art Museum of Miami Beach might be delayed again this year. Originally scheduled for March 25–March 28, the museum will now be held in March 2021. To make up for the loss of a day between the opening of its first exhibition of new works in March 2019 and", "The next Biennial should be on Saturday, March 28, 2020. The event will be hosted by the Biennial Center at the University of California, Los Angeles (UCLA), and will draw approximately 2,100 visitors from thirty-seven countries and fifty-one cities. Its programming will include the exhibition of work by seventy-five artists, including Vikram and Amarendra Singh, and will run from March 14 to March 20.\n\n\nThe Scottish National Gallery (SNGF) has revealed a new initiative to address the local health and wellbeing of its 1,500 staff, with the aim of reducing the number of ill-health-related deaths in Scotland by half.The new initiative, dubbed the Lifeline campaign, was initiated by the Scottish government in partnership with the Scottish Trades Union Congress (STUC), which represents around one thousand Scottish cultural workers and arts professionals, and is being piloted across the country. The Scottish government revealed the launch of the program, which will run across ten Scottish cities, on March 18.Following a six-week period in which the STUC will host a monthly dinner for all of its 900-plus members, the Scottish government announced on March 19 that it is planning to extend the program to April 15.Last week,", "The next Biennial should take place in 2022, at the Palazzo da Beppe (Beppe’s home), which is currently undergoing a renovation and hasn’t yet reopened. The upcoming edition, titled “The Black Years,” will be held on May 15–May 19, 2022, and will include the works of thirty-nine artists, including Marco Baratta, James Turrell, Amanda Conner, Brian Eno, Nico Ambrosini, Mark Leckey, Victor Mature, and Wangechi Mutu. The theme of the 2019 exhibition was “Family.” The biennial will be held at the Palazzo da Beppe from March 29 to March 31, 2020. A schedule of performances, workshops, lectures, and other events will be released in the coming months.\n\n\nThe American Alliance of Museums (AAMD) has announced that it will award $1.3 million to support the curation of the fiveteenth edition of the American Folk Art Museum (AFM) in New York. The organization will also take a one-time $500 donation to cover the costs of the 2019 event, which was moved to the Museum", "The next Biennial should be curated by the same director during the first half of the year, with the first exhibition focusing on digital art, Art of the Electronic, and the second exhibition focusing on the future of art.The board also announced that Cicelylova, who will arrive in the city on July 23, will take up the post of director of the Tata Art Museum in Mumbai. She will be the first Indian woman to head a museum. The board chose her because she has strong connections with the city, has worked in the area for more than two decades and is regarded as the cultural director of the city as well as a key member of the Tata Group, which owns Tata Sons and Hindustan Garments Limited, the largest private owner of art museums in India.“We are delighted with the progress of the biennial and its outcome,” said Sudip Roy, chairman of the Tata Art Museum. “At this stage we believe this is the most compelling project for the museum to undertake in decades to come. We are confident that Cicelylova will go even further and develop the Tata Art Museum into a globally-recognized museum of contemporary art, bringing together the best of contemporary art in India and abroad.”", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has revealed that it plans to open a new twenty-four-hour exhibition space in the institution—currently slated to run from March 8 to March 10, 2020—in March of 2021. The new platform, called the Museu de Arte Contemporáneo (MAS), will be located in the museum’s existing space in the former General Electric Building, and will consist of around twenty-five artists’ studios.The announcement comes on the heels of a $2 billion expansion project that will overhaul the museum, which will include a lobby, a gallery, and a lecture hall. The new structure will also boast more exhibition space, greater engagement with local communities, and a new lecture series called “Allíamiento.” The project is part of the Los Angeles 2024 plan, which calls for a total of twenty-eight projects that will be completed by 2022.“Our vision for MAS is to become a new kind of center for contemporary art in Los Angeles,” director Maria Balshaw said in a statement. “We are committed to working with our community, to engaging directly with", "The next Biennial should welcome visitors in 2020. The programme will be hosted in the same space and will be led by the same curators.Expected to draw between 1.5 million and 3 million visitors, the exhibition will feature more than 1,500 works and will include the works of 150 emerging and established artists. The 2019 event is the first of its kind in China and will continue its work in 2020. \n\n\nThe Institute of Contemporary Arts (ICA) in Barcelona has received a massive gift of 3,500 works from the late Catalan artist Íñigo Roca. The gift includes a history of Roca’s practice that will enable the institute to further develop and engage with the Catalan national institution, and provides an opportunity to close a major Roca archive in the city.The Roca Foundation, an organization created in response to his need for a larger audience, has created an archive of more than 2,600 works in a building in the center of the city. The museum opened to the public in 1954 and moved to a new home in 2017 following a $75 million renovation. The Roca Foundation has pledged to donate 500 works to the museum over the course of the next decade.“At the end of the museum’", "The next Biennial should have been held a couple of years ago, and the idea of giving it a new life is really exciting. We are still trying to figure out how to fund it, and how to make it happen; but we are working hard to find a partner that will support it and bring it to life at a meaningful place\u0097in an artistic, academic, and civic context. We are confident that we can put together a great exhibition at the Ritz, and I know the team will deliver. I am looking forward to working with the talented team at Artspace in New York, and am proud to be a part of this year’s edition of Art Basel Hong Kong.”The exhibition will draw from the collection of the group of artists known as the Biennales, which is comprised of works in collaboration with artists such as Ruben Hernández, Melchiorgio de Santillana, and Jørn Van den Brink. The list of artists who will participate in the exhibition is as follows:A. Könitz , Homeland, New York, Nylunda, 2010. B. de Cisneros, Homeland, New York, Nylunda,", "The next Biennial should open in 2020 and is currently under construction. The theme of the next iteration will be “Away from the Trees,” a play on words that is based on a line from the story of an untimely death.  Diana Al-Hadid, chair of the board of trustees of the Cultural Foundation of the West Indies, said: “The theme of the upcoming edition is… ‘Obliterate.’ The theme of the exhibition is… ‘There is no greater insult than the act of an eye.’ Over the past six weeks, the curators of the Royal Biennial have spent countless hours and days preparing for this exhibition, which is built around the theme of the exhibition, so that it embodies both the heart and soul of this great country. It is a very special exhibition to present in this country in a spectacular setting.”\n\n\nIn the months leading up to the 2020 edition of the Venice Biennale, the organizers have faced increasing criticism for moving forward with the event, which was canceled after the Tunisian revolution in March, and have since faced mounting pressure to cancel the event. Artforum’s contributing editor, Ross D. Taylor, penned", "The next Biennial should be held in January 2022. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has begun a process that will see its first-ever transgender-themed exhibition, titled The Transsexual Experience, will open in the museum in February 2022.The inaugural exhibition, which will showcase work by over thirty artists, will instead focus on the transgender experience at the time as a whole, highlighting work by major figures in the field. Among the artists chosen for the exhibition are Mitchell Yaro, Cara Delevingne, Kirsten Johnson, and Gabrielle Ryan.Much like in the exhibition, the exhibition will feature works created by a select group of established and emerging transgender artists, including Hmong American artist Cory Doctorow; Malaysian artist Lizzie Girouard; Dinka artist Marila Lumsden; and a group of gay and lesbian artists known as the Transvestites of Southern California.The exhibition was created as part of a larger collaboration between the institution and Warner Brothers Pictures, which had planned to release a new film adaptation of The Girl With All The Gifts, a 1981 biopic about a lesbian woman who marries a handsome, middle-aged gay man. The", "The next Biennial should focus on themes 'from the mathematics of computing to the ideological development of computer science, and from the history of science to the ideas of modern science and engineering,” said Louis H. Beckman, president of the In-Q-Tel, and that the museum should prepare for the festival by rethinking how it presents its programming.In an effort to keep the Biennial at peak performance levels through this year’s run, the museum is encouraging its artists to focus more on the past, and more on the present. The exhibition “The Contemporary Arts,” which will run through October, will feature works by thirty-four artists, including Matthew Gordon, Mark di Suvero, and Adam Pendleton. The full list of participating artists can be found here.The Biennial of Australia’s Art Museum, which will host the inaugural exhibition “Beyond the Allusion: Contemporary Art in the Age of Digitality” next month, is also working to make the upcoming event as convenient for visitors as possible. “We are implementing new and innovative ways to support the museum as it works through the transition to a digital world,” curator and director Lisa Clarke said. “We are working hard to", "The next Biennial should be held in 2023, the Art Newspaper reports. The novel institution will also be hosting a new exhibition, “Rethinking the Future: Contemporary Art and the Anthropocene,” at the Art Institute of Chicago in January 2020, and a biennial of work by contemporary artists in September 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed María Berrada as its new executive director. Berrada comes to the institution from the Metropolitan Museum of Art, where she serves as deputy director of collections and exhibitions. During her tenure at MoMA, she is responsible for the design and development of the collections and exhibitions, oversees the collection and exhibitions program, and coordinates the museum’s collection-at-home programs. Berrada first joined the museum in 1999 as a curatorial assistant, and eventually became director. She was succeeded by Kevin Rogers, who was named deputy director in 2005. \n\n\nThe Carnegie Museum of Art in Pittsburgh has appointed Timothy Coffey as the institution’s new executive director. Coffey will assume his post in January 2020. During his tenure at the museum, he has guided the collection of the Carnegie Museum of Art since it opened in 2005", "The next Biennial should be held at least twice a year. The first would focus on the Black Lives Matter movement, which has been around for decades, and the art of radical self-emancipation. The second would address the impact of the coronavirus on the Black community, focusing on artists and how they are re-imagining Blackness through their art and their practices. “We are mobilizing to dismantle systems of violence against Black people,” said Rachael Lippman, a cofounder of the gallery and the museum, and the first person to work on the project. “We are sick of our own complicity in the carceral state. We are sick of institutional racism and police brutality, and we are sick of being ignored and blamed. This is a moment of truth, and it is up to us to act.”The event will be livestreamed and will be live-blogged, and will feature works by sixty-seven artists, including Adrienne Edwards, Adrienne Edwards-West, Billie Tsien, Ellen Levey, Barbara Wright, Yvonne Rainer, Anna Wintour, Louise Nevelson, Rina Yogi, and Jadé Soto.\n\n", "The next Biennial should focus on the history of experimental and virtual reality (VR) and its relation to contemporary art. The projected theme will be “Technological Politics and Biennial in VR.” The thirty-fifth iteration of the festival will take place in Berlin and will be hosted by the newly renovated Berlin Gallery Stiftung (DFB), which has relocated from the old Bourse des Beaux-Arts to the Bourse des Beaux-Arts.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it has received a gift of two works by the artist and Holocaust survivor Piet Mondrian, the first work, a series of sketches that was made in the summer of 1943, and the second work, a series of drawings made in the fall of 1944. Both paintings were part of a series called “Up, Up,” which depicted a group of women as they perform a sexual act in a darkened room. Both works were among a group of around thirty works that were given to the institution last year by the Lisson Gallery.“Pieter was the first to use the term ‘up,’ to describe a visual experience in which objects were projected onto a personal space,", "The next Biennial should be announced as early as this month.[Update: October 7, 2018] The 2019 event will be held in the Solomon R. Guggenheim Museum in New York.\n\n\nThe Italian culture minister, Camilla Ruiz-Gallo, has signed an agreement that will allow the government-owned museums in the country to reopen after a six-month hiatus. The accord, which avoids a shutdown, was signed on October 4 and sets a date for the opening of the Lega Nord, the state-run arts complex in Rome, in December.The institution, which has been closed since January because of the Covid-19 pandemic, had initially been planning to reopen in February. The opening of the Lega Nord, which is slated to open in 2021, will usher in an era of new events and programming. But the auditorium renovation, which was completed in March, will only run through December.The Italian government has also allocated $53 million to renovate the Palazzo Vecchio in Venice, the Dalla Norma Museum in Rome, and the Museo del Palacio di Treviso, which were damaged by a fire in March. The projects will be completed by October 2021 and will bring the", "The next Biennial should take place in the autumn of 2017. The 2019 edition, titled Art of Life, will be held at the Pérez Art Museum in Madrid, Spain, in the fall of 2020. The 2020 edition is yet to be determined. The 2020 event will be held in September, with the theme Art of Life. \n\n\nThe Los Angeles County Museum of Art (LACMA, the Museum of Contemporary Art) has launched a new digital platform, LA Trivia, which offers fans a way to interact with the works of Los Angeles–based artists, including Yoko Ono, Janelle Monae, and Jean-Michel Basquiat. The free app, which will initially focus on LA’s avant-garde, has been downloaded more than 1.7 million times and features more than twenty thousand artist-made quizzes.“LA Trivia is an extension of the LA Museum of Contemporary Art’s mission to serve as an incubator for new ideas to advance art and culture in the region, and is an extension of the LA Art Museum’s mission to develop and sustain an avant-garde of contemporary art,” said LACMA", "The next Biennial should focus on the history of Indigenous art in Mexico City, in order to better reflect the city’s history and cultural heritage, and should explore how art from the Americas can be used to study Indigenous art and culture in Mexico City, with particular reference to the colonial era.”The biennial will also include a new initiative, “Pueblo Artes Unidos Mexicano,” an extensive online database that will provide a collection of more than one hundred thousand works from Mexico City’s museums, galleries, and archives.“We are thrilled to have the opportunity to present this biennial at the Museum of the City of New York, as we believe that this is a moment when the city of New York can be enriched and inspired anew by the works of Mexico City and the region,” said Michael T. Greenberg, chair of the biennial committee and director of the Museum of the City of New York.The Museum of Modern Art (MoMA) in New York has had a permanent collection of modern Mexican paintings and sculptures since the 1930s. The collection comprises more than 4,500 works by various Mexican artists, and was recently purchased by MoMA through commissioner Michael", "The next Biennial should take place in 2021 and will run from March 18 to March 20. The entry fee for the first edition, which is free, was $15,000. The new Biennial will be hosted by the same venue as the current exhibition. The exhibition will be organized as follows: The first show will be the work of artist Viktor Opuszkiewicz, which will be on view through March 21. The second show will be the work of artist David Mead, which will be on view through March 23. The exhibition will be organized in the same way as the current exhibition. The programme will be revamped. The exhibition will be accompanied by a new exhibition titled Digitally Enhanced, which will be on view in September 2020. The exhibition will be hosted by the same team that created the current retrospective. The programme will also include “Introduction” and “Introduction II,” each of which will be presented by a different artist. The program will rotate through the work of twenty-three artists. Among the artists who will participate in the 2019 exhibition are Anita Bech, Ana Cabrera, Aline Cui, Arseny Csok, Cécile Baras, Hé", "The next Biennial should take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has received $15 million from the Families and Museum Gift Fund (MGM) to defray expenses related to the acquisition of the artworks by artist Lonnie R. Johnson, who passed away on June 27 at age fifty-nine. Johnson began collecting in the 1970s and eventually amassed an impressive collection of more than three hundred works, which he displayed in his private practice. “Lonnie Johnson is an important and enduring museum art collector,” said John Miller, the director of the Los Angeles County Museum of Art. “He is also a prolific writer, a master of his own narrative, and an exceptional curator. As we continue our relationship with Lonnie and the museum, we are grateful for the extraordinary gifts he has given us over the years. In this way, he has strengthened our work for the past seventy years. Lonnie is one of the great collector-dissidents. We are honored to be able to give him the gift of this collection.”The museum has not paid Johnson since 2015, when the institution was working with an art dealer to", "The next Biennial should be held in 2021; the first in 2022. The Salle de Paris, however, has announced that it is planning to hold the first edition in 2021. However, it says that the event will not be held at the museum, but will be held in an unspecified location outside of Paris. The museum says that there will be no changes to the theme and that the new edition will continue to be dedicated to the study of the ancient world. “I would like to see the first exhibition devoted to the study of ancient art in the French capital,” Nathalie Bondurier, the president of the institution, told the Art Newspaper. The institution declined to elaborate further on the theme of the show, but said that it will not be limiting the exhibition in order to avoid questioning the legacy of the Museum of Modern Art, which is currently undergoing a major revamp, and will continue to present works by contemporary artists.Commenting on the new partnership, the Salle de Paris said: “The theme of the show is to be a museum dedicated to the study of the ancient world. We will not let ourselves, in the meantime, forget the history of our joint museum. We will continue to present art from", "The next Biennial should be held in 2021-22.The first iteration of the event, which will take place at the Center for Contemporary Art (CCA) in Chicago, will be held in 2022. The next iteration will be held at the National Museum of African Art in Washington, DC, in 2021. The next iteration will be held at the Minneapolis Museum of Art in 2021. The next iteration will be held at the Art Institute of Chicago in 2021. The next iteration will be held at the Mississippi Delta Museum in Alabama in 2020. The next iteration will be held at the Mississippi Delta Museum in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to extend its construction beyond the 2020 timeframe by five years, in an attempt to avoid a shutdown of the arts and culture sector as a result of a pandemic. The announcement was made on Tuesday, November 22, at a press conference in the museum’s new building, which will open to the public in 2021, the Museum’s 80th anniversary, and the beginning of the Museum’s long-awaited 50th anniversary.The extension will also allow MoCA to introduce new programming in 2021, including “Make Room,” a celebration of", "The next Biennial should take place in 2020. The 2019 edition, titled Manifestation, was held in New York and played to an audience of nearly 10,000. Goumbourg will host the 2019 edition in 2022.\n\n\nThe South China Art Museum (SCAM) in Guangzhou, China, has appointed Anna Xian as its new director-general. Xian comes to the institution from the South China Art Museum (SCAM), where she has served as deputy director-general since 2014. Xian succeeds Noriez de Araujo, who retired in 2019 after ten years at the helm of the institution, and will take up the post in September. “SCAM’s performance in showcasing artist-built urban spaces has been exemplary, and we are excited that Xian will be able to help the museum achieve even greater success in the years ahead,” said SCAM director Jing Zheng. “Xian is an experienced leader and a visionary learner, and we are confident that she will continue to shape the future direction of SCAM.”Xian commences her new position in July 2020. Previously, she served as the director of the", "The next Biennial should be staged in 2020. In a statement released by the museum, the Institute said: “I’m very excited about our new role as a reinstalled institution engaged in the stewardship of objects from the legacy of the museum’s founder, Sir David Attenborough. The new museum will be a true reflection of the Yorkshire village, when it is fully restored. It will also be a true companion to the Biennial, which has long been the centre of scholarly and public interest research in the world of modern and contemporary art.” The museum said that the restoration project will “provide an opportunity for us all to see in greater detail the legacy of our beloved Biennials, and to re-visit the world-renowned site and its surroundings in order to rekindle our passion for the Biennial.”The museum’s current exhibition, “David Attenborough: The Biennial,” is on view until December 21.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than one hundred works by American painter George Segal—including a series of portraits depicting women who were popular among gay photographers and", "The next Biennial should focus on the history of certain artworks that were created during the time period of 1947–1967. The next Panorama will focus on the history of artworks in the city of New York, and should include new works created during the nineteen-seventies and a new selection of works created during the eighteenth-century. In the next Shadows Over Time, the show will reflect on the skin color of the participants, with a particular interest in the African American population. The next exhibition will focus on the history of the American West. The ten-yearly exhibition will be a continuation of the theme of the biennial, “Art in the Age of Black Power” and will be curated by Julian Bond, director of the Smith Museum in New York and a former president of the Smithsonian American Art Museum.“We are thrilled to bring this stage to the city where we feel most welcome,” said William L. Hayes, chair of the board of trustees. “The themes of the biennial will connect with the voices and stories of the artists, and will engage both biennial guests and the city.”The biennial’s 2017 edition, “Art and Politics,” was curated by Patricia H", "The next Biennial should take place in the spring of 2021.  The 2019 edition, at the Museum of Modern Art in New York, included work from seventy-six artists, including Bruce Pearson, Quentin Dopp, Stella Markle, Sally Mann, and David Salle.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is planning to build a $1 billion renovation and expansion of the museum that will bring more exhibitions, new cultural experiences, and new public spaces to its Manhattan headquarters. The project will also include the creation of a new public courtyard and garden in the museum’s former space on Fifth Avenue, which is currently being transformed into an art museum.The renovation, which will also include the construction of a new exhibition space and the renovation of the building’s existing spaces, will run concurrently with the museum’s reopening next year. The renovation will also include the expansion of the museum’s footprint, which is currently 540,000 square feet. The renovation will also involve the construction of two new transportation hubs in the museum’s former parking lot on East Seventy-Fourth Street and the construction of a new building and plaza.The construction of the museum is part of a", "The next Biennial should be announced as soon as possible.\n\nMichael Jackson’s final performance at the Jackson Five’s New York City headquarters will take place this fall. The institution will reopen to the public in early 2020. The seventy-two-year-old performance artist died in 2013 at the age of seventy-three.“Michael Jackson is a true American icon,” said museum director Francis Manolo. “His legacy enriches the Jackson Five, and it enriches the city of New York. I’m honored to be able to serve as the next Director of the Jackson Five. I know we are capable of more, and we will continue to be.”Prior to joining the Jackson Five in 1969, Jackson was a prolific author, an avid traveler, and a prolific producer. His four-volume autobiographical work, The Biennial, was published in 1977. The following year, Jackson cofounded the experimental art project the Exploratorium with Charles Bradley and Tanya Clement. Another work, “The Work is All You Need” (1980), was entitled“The Only Way Is Up,” and featured three live performances in a theater in Manhattan. The same year, Jackson", "The next Biennial should also include a survey of the impact of the coronavirus and how it is being mitigated across Europe. The inaugural event, curated by José Manuel Lázaro, was held in the capital Buenos Aires in April and attracted 100,000 visitors. The exhibition, entitled “The City of Death,” opened at the Museum of Modern Art in Buenos Aires in May and ran until September 21. The second edition, titled “The City of Life,” was staged in São Paulo and was held until September 21. “This year’s event will be an all-encompassing collection of stories driven by the coronavirus, and together with the 2018 exhibition ‘City of Life,’ we will continue to present the most exciting and complex works by our artists,” said museum director Juan Íñigo Pérez-Yáñaga. Parallel to the coronavirus epidemic, art institutions in the United States have been forced to close “under pressure.” As of Thursday, September 20, there are more than eighty art museums that have announced that they are laying off workers or are furloughting workers, and many school groups are", "The next Biennial should focus on “how the arts can be used to address social justice issues through the construction of new discourses around the site of art, which is also a responsibility of the cultural institutions themselves.” The Biennial is currently run by the Berlin-based Berlin-based nonprofit MaRS, which will unveil the project at the Kunsthalle Basel in September.\n\n\nCultural philanthropists and wealthy collectors are now being urged to step up to help the many artists and businesses that depend on London’s Tate, the National Poetry Library, and the Tate Modern for their livelihoods.  The Tate’s financial woes were highlighted in a February article in the New York Times when the institution announced that it expects to lose a minimum of £20 million a year because of its decision to sell more than one thousand works over the last twelve months. Tate director Maria Balshaw and director Hamish Anderson acknowledged in a statement that the sale of works is “not sustainable,” but said that “this year’s exhibition and our plans for the future depend on it working as it should.” A group of artists, including Alison MacGill and James Tur", "The next Biennial should take place in 2020 at the Museum of Contemporary Art Los Angeles. Described as a “compelling, multi-disciplinary exploration of the biennial’s central question, ‘The Future of Art,’ it will center around the work of artists in the twentieth century and include a program of ‘art exhibitions,’ a press tour, and a presentation of works. The new exhibition will also include the first design-based exhibition of ‘art’ since 1981, ‘Art of the Future: ‘Arts of the New Century’ at the Sender Art Museum in Honolulu, and will include a new collection of works by artists known for their experimental and experimental approaches. “The invitation to present art at the Museum of Contemporary Art Los Angeles touches upon one of my personal shared interests,” Paul Moritz, the director of the Sender Art Museum. “It will be a great year for the art world.” “At this time of great uncertainty for many cultural institutions in the United States, it is essential that we strengthen the financial and professional support of writers and artists,” said Maya Brown, the chair of the museum’s board", "The next Biennial should be in 2021.    It has been reported that a full year of the 2019 exhibition is available for purchase.  In a statement, curator Svetlana Stoyanova said:  The upcoming exhibition will be the first of its kind, and will be a symbol of the triumph of culture over all other forms of emotion and thought. We at the Biennial have been working for over a year to develop a new vision for the exhibition, and the result is a show in which the viewer will have the opportunity to wander through the works of twenty-six artists in the biennial, representing forty-five countries, in order to engage critically with the history of art, and the culture of the city of Biennale.”The 2019 event, titled “A History of Painting,” was created by a team of fifty-six artists, including Sandro Brera, Hernán Díaz, Jesús Rodríguez, Dani Sola, and Carmen Teicher, and premiered at the Museo de Artes in Madrid in September. The exhibition was organized by the Spanish director José Manuel García-Marín, who also organized the exhibition for the biennial.\n\n", "The next Biennial should be held in 2022–25, and will take place at the Museo de Arte Contemporáneo da Tijuca, the southernmost city in Brazil, from February 25 to March 3, 2020. The Art of Truth will be the theme for the exhibit, which will be organized as a multi-disciplinary work, and will be curated by Jorge Paulo Martins, the curator of European art at the Museo de Arte Contemporáneo da Tijuca.“I am thrilled that our project will be able to continue to engage with important contemporary artists and their creative practices and that the exhibition will be able to continue with additional artists and their incredible stories,” said Stefano Poggi, the director of the Museo de Arte Contemporáneo da Tijuca. The exhibition’s opening will be on April 18, 2020, at the Instituto de Arte Contemporáneo, Rio de Janeiro, Brazil.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed John Vandervoort as its new board chair. Vandervoort will be responsible for overseeing the institution’s financial and operational health as", "The next Biennial should be the biennial to follow the one in 2020, with the first exhibition slated to open at the European Contemporary Art Biennale in Prague in November 2022. The biennial will then move to the Museum of Contemporary Art St. Petersburg, which is currently undergoing a renovation, and will finally conclude in 2022. The Danish pavilion for the biennial has been awarded to Het Parool, from the Danish People’s Party, and is slated to stage the exhibition “Becoming Modern,” which will focus on the theme of modernity. The Danish pavilion was selected by a jury comprising Søren Pålsson, director of the Danish Contemporary Art Museum (DANUM); Sara Frode Jensen, director of the Danish Pavilion at the Art Basel Hong Kong; and Damian Edmonds, director of Frieze London.“As a Danish art historian, I am thrilled by this news and look forward to supporting this talented team, building on the Danish pavilion’s extraordinary exhibition history,” said Museum director Per Stærk and the Danish Pavilion’s artistic director Laura Rawsthorn. “We are very much looking", "The next Biennial should focus on the impact of the Zika virus, which is believed to have infected as many as 1.5 million people worldwide and caused at least 18,000 deaths—including that of the French minister of health, Anne-Christoel Hocevit. London’s Serpentine Galleries will stage a presentation of a new series of works by the Austrian artist Wolfgang Hahn, who recently revealed plans to release a new work in July. “I want to see the next edition of Serpentine Galleries in the heart of London,” Hahn said in a statement. “I’m thrilled to have the opportunity to present the work of Alice Sadler, who has had a major cultural impact on shaping the direction of the exhibition. I also want to work with artists from the South to show their mastery of the subject. It’s touching and heartening to see the breadth of the contemporary art world’s impact in terms of the art that is made in their name, and I look forward to collaborating with the artists to see the work of the biennial.”A selection of works by the biennial’s artists will be presented at the Serpentine Galleries biennial in", "The next Biennial should be held in 2020. The institution has had a theoretical and practical development program throughout its existence, with new exhibitions, publications, and residencies organized annually. In addition, it has had a program of exhibitions and lectures in recent years. Not all of its exhibitions have been successful. Its first exhibition dedicated entirely to the history of painting at the Biennale in 2006 won the prize for best exhibition at the Biennale in 2009.\n\n\nThe New York Asian Art Museum (NYAI) has received a gift of seventy-six works by twenty-nine artists from the late Gerhard Richter. The museum revealed the news in a post on its Instagram, which was shared by curator and educator David Lake.The gift comprises works by artists ranging from Shanghai and Mumbai to Phnom Penh and Hong Kong, and includes works by the late sculptor Huang Renxue, the late theater director Jerry Lewis, and the mid-nineties hip-hop artist Shawn Carter.Among the works that will soon be displayed in the museum’s newly opened exhibition space are a series by Huang Renxue, “Tit This,” 1987, which he made in collaboration with Lewis; a series of still lifes", "The next Biennial should commence in June 2020 and will organize approximately 600 contemporary artworks by approximately 150 artists that are currently under the representation of the institution.\n\n\nThe Solomon R. Guggenheim Museum in New York has welcomed Adam D. Bernstein to its staff and board. Bernstein, who will be a senior director at the institution, will be responsible for developing and executing the museum’s programming across a variety of disciplines, including curatorial, technical, and administrative.“We’re thrilled to welcome Adam to our staff and board,” said Guggenheim deputy director Pamela DeSousa. “His proven expertise and commitment to the Guggenheim’s curatorial, technical, and editorial teams will greatly benefit our collection and research teams, and will enable us to better understand the work and thinking of our talented and dedicated staff.”Bernstein will take up his new role on August 1. During his tenure, Bernstein will be responsible for developing and executing the Guggenheim’s programming across a number of disciplines, including curatorial, technical, and administrative. He will succeed Elissa Bech, who has served as director of the museum since October 2019, and will assume his responsibilities on", "The next Biennial should focus on the role of contemporary art in the ongoing public health crisis caused by the novel coronavirus, which was first reported in Wuhan, China. The biennial’s theme “Power to the People” will be based on a 2005 exhibition at the Wuhan Biennale that, inspired by a similar project in Vienna, will feature art from seventy-two countries and will introduce the theme in partnership with the local people of Wuhan. Inaugurating the exhibition will be a series of performances, organized by the renowned Chinese choreographer Wang Wei, which will draw from his own personal experiences to reflect on the challenges posed by the coronavirus and the impact of the coronavirus on the Chinese people.Among the artists whose works will be displayed are Tomasz Klimczyk, Terrence Malick, and Arnaud-Remes. The exhibition will be organized in partnership with The Fortuna Art Foundation, the Wuhan Art Museum, and the Wuhan Museum of Art; the local cultural and cultural organizations in Wuhan; and the biennial’s partner organizations, the Wuhan Triennale Foundation, the Wuhan Museum of Art,", "The next Biennial should be held somewhere in the city, and the event should be led by someone who has experience in the field. The theme should be 'What is Art?,” Artforum reports.According to Dave, a curator at the Museum of Contemporary Art in Houston (MCA), the first Biennial was held in 2017 and is now held annually at MCA. The 2019 iteration of the event will take place at the MCA’s new headquarters, the MCH Gallery, in the city. The event will revolve around a series of large-scale works by the artists featured in the exhibition. The exhibition will also feature work by forty-four other artists, including Darren Rowland, Hayao Miyazaki, Pierre-Auguste Renoir, Dita Santoro, and Jürgen Todt, and will be on view until July 24.MCA director and CEO Charles Baillie told the Houston Chronicle that the institution is planning to create an additional seventy-eight hours of programming for the event. “We have been working for years to create a platform for artists to connect and develop their work online,” Baillie said. “In the past eight years, the online version of the Biennial", "The next Biennial should also bring with it new exhibitions. “The next Art Biennale is for everyone,” said Garth Williams, director of the Biennial. “That means it’s for everyone who doesn’t see the art in the next Biennial. It means it’s for everyone who hasn’t seen the Art Biennale before. And it means it’s for everyone who is a fan, who has seen the Art Biennale before, who is a collector, who has bought the art in the Biennial.” The next edition of the Biennale will take place at the Haus der Kunst in Munich from March 23 to March 26.\n\n\nThe Cortina Foundation, a Los Angeles–based arts organization that supports artists and their families through an endowment fund, has received a gift of $250,000 from the Caucasus Fund, a private philanthropic organization established in 2007 to promote the arts in Armenia through programming and fundraising. The gift was made to the foundation by Adriano Mendoza, a trustee of the foundation, in honor of his lifetime commitment to the arts.“Every year, after the first day of the new year", "The next Biennial should then be scheduled for late July to early August.In addition to the piece, which will be housed in the Museum of Contemporary Art (MoCA), the exhibition will also include an installation of work by artists such as Donna Harrison, Jocelyn Wilson, and John Bockel. The opening will take place at the Whitney Museum of American Art, Miami Beach, and the Biennial will continue in the Museum of Contemporary Art, New York.\n\n\nThe Institute of Contemporary Art (ICA) in London announced today that Linda Meade has been appointed as its next president and CEO. Meade will take the helm from Adrian Piper, who has served as the institute’s interim director since January 2019, and will assume her responsibilities on August 1. “Linda has been instrumental in maintaining the ICA at the forefront of the movement for modern art exhibitions, providing a stable of curators and artists for the better part of twenty-five years, and I am delighted to welcome her to the museum,” said Adrian Piper. “She is a visionary leader of the ICA, whose leadership will continue to shape the ICA’s curatorial and artistic agenda. The ICA’s forthcoming exhibition �", "The next Biennial should take place in Beijing in 2022. The next edition of the Art Basel Hong Kong event will be held in 2021.\n\n\nThe Tate has postponed the upcoming seventy-fifth edition of Art Basel Hong Kong, which was originally scheduled for June 14–July 5, in an attempt to reduce the threat of the coronavirus. The postponement, which was made on the sidelines of Art Basel “dissolves the concept of a show in the same way that art studios dissolves the concept of a show in order to create new art,” the Art Newspaper reported. Tate director Maria Balshaw said that the decision to postpone the event was made after consulting with the Hong Kong government and toured the city in order to “avoid harming the Hong Kong art scene” and to “maximize the impact of the event on the local community.” Commenting on the decision, Balshaw said: “This has been a difficult decision for me, as I have devoted my entire professional career to supporting the art scene in Hong Kong. I once again put myself and the Hong Kong art scene first by choosing to participate in this event.”\n\n\nThe Museum of Contemporary", "The next Biennial should be scheduled for January 2019. The new theme for the exhibition is “The Future Is Present: From Ecological Disaster to Ecological Revolution” and will be organized as a series of exhibitions. The first exhibition will focus on the ethical politics of the exploitation of nature and the environmental crisis\u0097the second will follow the ecological crisis from a Greek point of view, with a particular emphasis on the Tzara Mountains of southern Greece. The 2017 exhibition, “Five-O: Greek Art of the Sixties,” was held at the Museum of Fine Arts in Athens and proved to be a best-selling exhibition. The 2018 Biennial will be held at the Soskomfir Museum in Kiasma, the museum of Greek and Roman art in the town of Soskomfir in the Aegean Sea, and the National Museum of Athens in Athens. The 2020 edition will be at the National Museum of Greece and Art in Athens.\n\n\nThe Museum of Fine Arts (MFA) in Boston has hired Jenna Jordan as associate curator of modern and contemporary art, and Pierluigi Leoni as its curator of eighteenth-century art. Jordan joins the museum as associate curator of nineteenth-", "The next Biennial should take place in 2021 and will include a selection of new work by American artists born in the United States. The 2018 exhibition was held at the Museum of the African Diaspora at the University of California, Berkeley. \n\n\nThe Israel Art Museum (Iman) in Jerusalem announced on Thursday that it will rebrand its main building, the Gush Etzion Museum, as the Jerusalem Art Museum (JAM). The organization’s director, Abraham Cammock, expressed his delight with the decision, which will increase the museum’s reach and provide it with a greater international profile.“The Gush Etzion Museum is a unique institution with a rich history and an ambitious program,” Cammock said. “It is the only institution in Israel that has preserved the life and work of the Gush Etzion family for more than four hundred years. We are now entering a new phase of our history, and with this new designation, we are now able to renew our commitment to the Gush Etzion Museum and to continue our important work of research, exhibitions, and education.”The Gush Etzion Museum has been under the public ownership since the 1970s,", "The next Biennial should be held in 2022, according to the organizers. Here will be presented more than twenty-five works by artists from South Asia, including Sohrab Mohebbi, Sonu Pathan, and Harjit Pal Singh. The exhibition will feature a selection of works in the form of a video, which represents the subtext of the artist’s “Monuments Men (South Asia)” video series, which is centered around the subject of art from the Subcontinent. The biennial will also include works from the South Asian diaspora.The inaugural exhibition will be curated by Ankushwar Dutt and will include the work of fourteen artists from the subcontinent. The exhibition will also feature new works by artists such as Ganesha, Shilpa Sawant, and Mitsue Shindel. In a review published in Artforum, Dutt said: “I’m going to create something new out of the material that art has been around for the last few hundred years.”The 2019 edition of the biennial was held at the Dutt Gallery in Mumbai and featured works by Karuna Dutt, Naushad Mizrahi, Pradeep Sharma, and Amitab", "The next Biennial should take place in 2021 and will focus on the words, visuals, and movements of Pablo Picasso. The exhibition will include the first exhibition of work by the artist in Mexico City since 1944.The show will mark the centenary of the painter’s birth and will feature the work of twenty artists, including Arashiyama, Atelier Luis Buñuel, and Bernardo Corrado. The art world’s largest donors, the Rockefeller and the Hewitt Foundations, also pledged $5.5 million to the project last year. It will be a consortium of thirty-nine institutions—the Rockefeller Museum of Art in New York, the Art Institute of Chicago, the Art of the Americas in San Salvador, the Beaux-Arts Museum of Art in Paris, the Galerie Luise Hirschfeld in Berlin, and the Lévy Gorvy in New York—that will be housed in a former steelworks in the city of Mexico City.The institution of the future will boast twenty-one galleries, resulting from a combination of the 2013 renovation of the Beaux-Arts, including the modernist gallery Galerie Lévy Gorvy’s first exhibition in Mexico City,", "The next Biennial should take place in 2021. \n\n The Colosseum Museum in Rome has received a donation of twenty-three works from the association of the Northern Lights in the City of Rome. The works, which are in the collections of the institution and the Flavia Cattelan Collection in the city of Pisa, were donated by Pieter Steenhuisen, a collector based in the city, and his family. The collection includes works by Achim Kolb, Victor Hugo, Alberto Modigliani, Giovanni Modigliani, Wolfgang Zumthor, Catherine Tenaerts, Lydia Tenaerts, and Lydia Tenaerts: The First Time, the second cycle of the work, Lydia Tenaerts: The Third Time, and Lydia Tenaerts: The Fourth Time.The works were donated by the family of Rust and Raimond Steenhuisen—who purchased the works from the family of Jody and Paul Steenhuisen in Paris in 2003—and were exhibited at the International Forum for Contemporary Art (IFCA) in Milan in 2009.", "The next Biennial should be held in the summer of 2021.\n\n\nThe National Gallery in London announced today that it is planning to move the exhibition calendar for its annual exhibition “The Great Exhibition,” which will take place this fall, to 2021. The title event, which was founded by Simon Birmingham in 1901, will be moved from September to October. The event will now take place in the new six-monthly format, which will run from September 15 to October 1, 2021.“The Great Exhibition’s recent history has shown that a large-scale, long-term program of exhibitions is possible,” said Peter Hart, director of the National Gallery. “But the recent history of the exhibition is also one of the longest-standing experiences of the National Galleries of Scotland, and it is far from over. The next edition of The Great Exhibition will be the longest and will be a landmark for British and Scottish art.”The move follows a year of planning and execution that involved the creation of a new creative agency, the National Curator’s Council, to shepherd the exhibition through its 2020–21 season. The Council also set up a new council of museum professionals, an advisory council, and", "The next Biennial should be scheduled for December 2022, and the first exhibition should open in February 2523. The Paris-based artist and curator Witness de Castro, who is known for his experimental exhibitions and installations, has been named the winner of the $30,000 Biennial Prize. De Castro’s work, a series of sculptures, installations, performances, conferences, and books, is slated to be presented at the biennial in the spring of 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than 1,300 photographs by Mark Rothko from the artist’s hometown in the Berkshires. The gift includes more than 5,400 prints made in the artist’s hometown as well as a digital copy of the book, The Death of the Author.The donation was made by a group led by Mark Rothko descendants Richard and Mary Rothko, who have been collecting photographs for more than twenty years. They were presented with the news of the £30,000 ($35,000) donation by the Rothko family to the museum in a special ceremony on Friday, October 24.“Mark Rothko is one of the greatest living sculptors, and his beautiful works are", "The next Biennial should be announced next month.\n\n\nNew Zealand art collector Peter Luber has been appointed director of the Contemporary Art Museum Wellington (CAMW). He succeeds Ed Clark, who retired in March 2019 after twenty-two years at the helm of the institution.“Peter is experienced and talented in his field and has shown that he is able to successfully manage an institution such as CAMW in a way that maximizes the art and design and art and design environments for NZ art collectors,” said director Tim Riley. Luber also brings with him the experience of serving as the head of a major New Zealand art museum and the knowledge and knowledge of managing a complex institution.“We are thrilled to welcome Peter to CAMW, a museum whose history includes a strong and enduring relationship with the art of New Zealand,” Riley said. “His expertise will complement and shape the vision of the current management team and we look forward to working with him.”\n\n\nThe Barozzi Museum of Art in Rome has received a gift of twenty-six works by the late Italian architect Dario Barozzi, among them pieces by Matisse, SculptureCenter, and Renzo Piano. The museum recently acquired the", "The next Biennial should be held in 2022; the twenty-second and twenty-third will be in 2021 and 2020. American Society of Image and Photographic Arts (ASPA) president Jonathan Bostwick has announced that the 2020 event will be a “remarkable celebration of the possibilities for science, art, design, and technology.”The fifty-ninth edition of the Annual Prize Exhibition, which has been organized by the nonprofit organization since 2001, will be held at the Museum of Modern Art (MoMA) in New York from March 18 to March 21, 2020. The event will push back against the country’s antiquarianism through a combination of commissioned art and public programming. The theme of the exhibition will be “science, art, design, and technology,” with a focus on the history of technology and its use in society.“We are thrilled to open the new biennial with a magnificent work by ... MoMA’s artist-in-residence, Alexander Calder, who has been a core contributor to ASPA for more than twenty years,” said. “This is a monumental occasion, not only for ASPA, but for the arts as a whole, for their profound", "The next Biennial should take place on the island of Réunion in the Seychelles.​\n\n\nThe Los Angeles County Museum of Art (LACMA) has hired Sarah Boas, who previously served as a curator at the Museum of Contemporary Art (LA MoCA), as assistant curator of contemporary art. Boas will be responsible for developing and implementing a new training program to support museum professionals in developing exhibition-level work and is slated to start shortly.“Sarah is a scholar of the history of art and a world-class curator of contemporary art,” said Mark Pinchuk, chair of the museum’s board of trustees. “Her curatorial expertise and ability to grow the […] program and foster the development of LACMA’s exhibition-level exhibitions will be a great asset as we work toward a new exhibition season.”Culled by the Los Angeles County Museum of Art (LACMA), the ambitious, six-year project will utilize the institution’s new $35 million renovation and expansion. Its debut exhibition, “The Artist’s House,” is the first major project of its kind at the institution, which is currently undergoing a $10 million facelift", "The next Biennial should be announced next month.\n\n\nThe United Kingdom is currently facing its first national crisis as the coronavirus COVID-19 continues to spread throughout the country. According to the BBC, more than six thousand cases have been confirmed in the UK, a number that has only risen since Monday. While the coronavirus has been linked to the onset of three other major UK health crises since it was first identified in February, the first one—which killed twelve people in the town of Whitechapel in London on February 8—was not connected to the virus.According to the BBC, the coronavirus has become a major public health concern for many countries across the world, including the United Kingdom, France, Germany, and the United States. Since the coronavirus was first identified in February, the UK has seen an increase in cases of the virus, which is spread mainly by close contact with the respiratory secretions of the coronavirus. On Friday, the UK confirmed the first cases of the virus outside of the UK, and as of Saturday, forty-two cases have been reported.While it has been estimated that as many as thirty million people are infected in the UK—more than forty Americans have tested positive for the virus", "The next Biennial should be held in December 2020 and will be organized as follows: South by Southwest (SXSW) Austin, Texas, United States; South by Southwest (SXSW) New Orleans, Louisiana, United States; South by Southwest (SXSW) Seattle, Washington, United States; South by Southwest (SXSW) New Orleans, Louisiana, United States; South by Southwest (SXSW) Dallas, Texas, United States; South by Southwest (SXSW) Denver, Colorado, United States; South by Southwest (SXSW) New Orleans, Louisiana, United States; South by Southwest (SXSW) New York, New York, United States; South by Southwest (SXSW) Chicago, Chicago, Illinois; South by Southwest (SXSW) New York, New York, United States; South by Southwest (SXSW) Chicago, Illinois; South by Southwest (SXSW) New York, New York, United States. South by Southwest Portland, Oregon, United States; South by Southwest Chicago, Illinois; South by Southwest Chicago, Illinois; South by Southwest Chicago, Illinois; South by Southwest Chicago", "The next Biennial should be held in 2022. Among the many changes that need to be made to the theme of the exhibition are the removal of the barriers between exhibitions and the rest of the world, the introduction of more intrasubmarine platforms, and the conservation of objects that are displayed. “We want to change the exhibition experience in a way that is sustainable, that is informed by our values, that enables people to connect with and experience the art of the future,” Deana Haggag, the director of the New Museum, told Artnet. “It is an extraordinary challenge to create an exhibition that can be experienced by all, receive the full range of themes and works of art and are accessible by everyone. The Biennial of the Pacific is at the forefront of transforming how we think about art and art in general, and how we think about the future of art. We are committed to using our new platform to bring greater awareness to the oceans, and to invite visitors to experience and shape cultural practices that engage with the world around us.”Although the show is currently on view until November 3, the exhibition will continue to be staged in the museum’s locations throughout 2020—the exhibition’s fifteenth", "The next Biennial should include a discussion of the ‘Homeland War,’ a history of resistance against the United States’s presence in the region, and ‘The Artist in Human Life,” a presentation of photographs by Donatella Cardinale and Pierre-Auguste Renoir depicting the exhibition of a nude woman by Mary Minter. The exhibition will be staged on the first floor of the museum, which is currently under construction.More information about the event, which will encompass four themes: “The Conflict of Civilizations,” “The Artist in Human Life,” and “The Truth of a Mother,” will be released in 2020.\n\n\nThe Metropolitan Museum of Art in New York has announced that it is reopening to the public on June 20, 2020, following a two-month construction phase. The reopening will coincide with the opening of the new Museum of Modern Art, which will be inaugurated by a retrospective of an unknown artist by the same name, Helen Frankenberg. The show will be marked by a series of studio exercises that will allow visitors to try out new positions, including the director, the chief curator, and the head of curatorial affairs.“The work", "The next Biennial should be staged in 2021 and will include a selection of works by twenty-six artists. In the meantime, the museum is planning to create several new exhibition spaces, including a new public gathering area and a new garden, in the building that is being converted into a workshop space.The Biennial is also collaborating with the Museum of Contemporary Art (MoCA) Los Angeles to present a new exhibition devoted to the work of experimental artists, based on a two-year project that is a response to the current global crisis. The first show, “After the Fall,” will be co-curated by Kiki Smith, the author of Situations of the Imaginary, and Christine Tan. The second show, “Culture and the Body,” will be curated by Yinka Shonibare. Both shows will open to the public in November.\n\n\nAura Fund, the social philanthropic organization that supports the creative arts through grants and other forms of support, has announced that it will provide $2 billion in assistance to creative organizations in the United States in 2020. The monies will come from the Aura Fund--a division of the Warren family, which owns the pharmaceutical company Merck, which was", "The next Biennial should take place in the spring of 2020. \n\n\nThe Museum of the City of New York (MoC) plans to build a new $110 million, seventy-two-foot-long, glass-enclosed exhibition space in its historic gallery on West Seventy-Fourth Street that will be dedicated to the work of urban and African American artists. The new venue will be located in the former Samuel D. Zuckerberg Building, which was converted into a museum in 1977, and will be built on the site of the former Eli and Edythe Broad Art Museum. The building will provide additional exhibition space for work by artists who are not currently represented in the institution, including Ruth Crewe, Julian Gentry, and Bénédicte Savoy-Barre—all of whom will be represented in the 2019 exhibition “18.”The $110 million project was funded by the Eli and Edythe Broad Art Museum/Cincinnati, which raised $75 million for the installation of works by fifty artists in 2013\u0097the Museum of Modern Art, which commissioned Kerry James Marshall to create an exhibition for the first show in the institution’s new building, was the biggest gift from the Broad Art Museum�", "The next Biennial should focus on “intersection of design and visual practice,” an experiment the institute hopes will involve traveling to and observing the works of more than thirty international artists\u0097including Kiki Smith, Justin Soltan, and Anish Kapoor\u0097and be organized in conjunction with the completion of the institution’s next project, “Dance at the End of the World.”\n\n\nThe Metropolitan Museum of Art in New York has added two new artists to its curatorial roster: Lawrence Abu Hamdan, a Nigerian American who is a cofounder of the artist collective Black Panther, and Juma Tsegay, a Ghanaian American artist who has been called a “master of the African diaspora.”The museum’s branch in the United Arab Emirates, the Abu Dhabi Institute of Art (ADI), will stage the Abu Dhabi Biennale next month. Set to open in February 2021, the Dubai exhibit will feature works by Abu Dhabi artists alongside works by artists from fifty-three countries. The exhibition will also feature “Abu Dhabi in Motion: A.I.D,” a new collab between the Abu Dhabi Institute of Art and Tokyo University of the Arts,", "The next Biennial should take place in the city of Rome in 2022. It will be organized by the Museo d’Arte Contemporanea (MAS), the Rome-based nonprofit, and will showcase 30 new works by artists from around the world. The exhibition will also include a two-day performance and a children’s book. According to a release, the show will be inaugurated by a meeting with the mayor of Rome, Christian McAlpine, and the museums’ director, Dario Franceschini. The next edition of the Biennial will take place in the city of Cagli, Italy, in 2021. \n\n\nThe new Museum of Modern Art (MoMA) in New York has released the latest list of artists who will be featured in its museum’s inaugural year in the spring of 2022. Titled “Museum of Modern Art, Spring 2022,” and curated by MoMA curators Mark di Suvero and Kenneth Urbach, the exhibition will feature new work by seventy-nine artists, including John C. Evans, Adam Craig, Simon Southey, Eileen Hawkes, and Judith Stein, among others, and will run from March 21 to March 26", "The next Biennial should be held at a location other than the university, and should aim to present a “more diverse and accessible” exhibition\u0097in line with the University of Cambridge’s plans to open a new branch of the Tate in London.The organization’s board chairman, Martin Mayhew, said: “The board is delighted that the sixth Biennial will be hosted at a new and complementary venue across the city, and we look forward to welcoming your art and architecture to the central London location. We look forward to working with you, and the Birmingham community, for many years to come. We are confident that this new chapter at the University of Birmingham will be a landmark one for the arts and architecture of Birmingham. We are also confident that your participation in the Biennial will further the board’s mission to support the City of Birmingham in its bid to become a world leader in arts and design.”\n\n\nThe Penn Museum of Art in Philadelphia has received a gift of over 4,000 photographs by photographer Robert Irwin. The donation, made by David S. Cohen, a collector and philanthropist, includes a set of three dozen works by the artist dating back to 1962. The works were acquired through the sale of", "The next Biennial should be held in 2022.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has received a gift of forty-two works by artist Jeffrey Gibson. The donation includes works on paper, collage, printmaking, photography, sculpture, and installation.“Gibson has been a central figure in the field of painting for fifty years,” said Christopher Miller, the museum’s director. “We are thrilled to commemorate his forty-two years of involvement in the museum by presenting works by forty-two artists, with work by forty-three artists in the next exhibition, ‘The Future Is Not What It Used to Be.”Gibson’s work is included in the museum’s collection of works by seventy-four artists\u0097a record in its own right\u0097and is on display in the exhibition “The Future Is Not What It Used To Be: Painting in the Age of Color” (2019–2020). The exhibition’s catalogue entry on Gibson reads: “He was one of the first to use a colored pencil and paint a painting in a studio in Manhattan, in 1949, and to do this on paper. His work is in", "The next Biennial should take place in 2020, and the date has yet to be set.\n\nRestarting the program, which was taken over by the Massachusetts Institute of Technology (MIT) in 2011, aims to increase the number of high school students attending the school year by 15 percent in the next twelve months, and to reinvest $625 million into Pell Grants and free up money for schools. The fund has awarded nearly $7.3 billion to more than 280,000 students since it was established in 1976.The biennial will be a collaboration between the Massachusetts Institute of Technology and the University of Rochester, and will comprise three exhibition spaces, a community gathering space, and an interdisciplinary research center. The center will organize programming focused on the history and science of technology\u0097the school will hold a series of lectures and workshops on the subject next month. The school will also boast of a conservation studio, a bookstore, and a grocery and restaurant.“This is the kind of program that can make a real difference in the lives of students, and I’m optimistic that we can accomplish this in a way that honors the legacy of MIT, while honoring the school’s long history of innovation and scholarship,” said sophomore Shaista Jones", "The next Biennial should be held in June 2022. In an interview with the New York Times, Mr. Teitelbaum said: “For a hundred years we've been working towards a new exhibition, a new catalog, a new exhibition, that will open with a new collection of art, one that will be a reflection of the culture of the city, with a particular devotion to the histories of the artists that have come before. . . . We have a long way to go.” \n\n\nUnited States Artists (USA), the national nonprofit organization that awards $1 million grants to visual artists and small-scale local arts producers across the country, has announced that it will no longer award any more grants to institutions that have previously received $1.5 million in funding from the organization. The move comes amid a wave of protest against the organization, which has faced criticism for allowing monied interests to exert undue influence on its grantmaking, as well as criticism that it is milking grantmakers for funds.“After years of fighting for fair, balanced, and transparent funding, we are writing to call for an end to these practices,” said Dale Thompson, president of the National Association of Arts and Cultural Finances (NASFL", "The next Biennial should be held in 2022. The museum is currently working with an artist from the Greek island of Kiassel; an architect and visionary; and a professor, both of whom are expected to contribute works in the next twelve to eighteen months. According to a release, the museum will work diligently to present this exhibition in a timely manner and will include a variety of programming in the future.As part of its expansion into new spaces, the museum also revealed that it is adding a second building designed by the sculptor Daniel H. Naftali to its collection. The museum will construct a new twenty-four-foot-high, glass-enclosed space for the artist’s studio to be located on the first floor of the museum. The museum also plans to extend its current exhibition, “Sólignan,” which debuted in 1994, to coincide with the opening of the new building. The new exhibition will be inaugurated by “Sólignan: A Retrospective” (2019), a retrospective on the work of the artist, and will include works from the museum’s collection.\n\n\nThe 2018 edition of the Venice Biennale fell short of its original goal of traveling to", "The next Biennial should be held in 2022. The sixty-seventh Venice Biennale will be held at the Museum of Modern Art in Venice, Italy, in 2022. The seventy-seventh Berlin Art Biennale will take place at the Museum of Contemporary Art Bonn, Germany, in 2022. The sixth Venice Architecture Biennale will take place in 2022. The inaugural edition of the Los Angeles Biennial will take place in 2021. The seventy-ninth Venice Architecture Biennale will be staged at the Museum of Modern Art in the city of Venice, Italy, in 2021. The eleventh Venice Architecture Biennale will take place in 2021. The twenty-ninth Venice Architecture Biennale will be staged at the Museo del Palazzo Vecchio, Italy, in 2021. The twenty-fourth Venice Architecture Biennale will be staged at the Museo del Castello di Rivoli, Italy, in 2021. The twenty-fifth Venice Architecture Biennale will be staged at the Museo di Storia di Centro di Livorno, Italy, in 2021. The twenty-eighth Venice Architecture Biennale will be staged at the Museo di Storia di Tor", "The next Biennial should be held in 2020, but given the current health crisis, it is unlikely that this will happen. The Art Newspaper reports that a petition demanding that the 2019 edition be held at least a month later has been signed by more than 1,000 people. Artforum has reached out to the organizers for a statement.  The full list of participating artists is as follows: Event Title Artist Location 1. Angela Aylward and Sam Rogers Drawn & Sculpted, New York, USA Nominated for: Art, Artistic Direction, and Artistic Experience - Harvey Silverglate, Andrea Kuzma, & Michael Renfest, 2019 2. Michael Rezendes, New York, USA Nominated for: Artistic Experience, Harvey Silverglate, 2018 3. Elizabeth Simonson, New York, USA Nominated for: Artistic Direction, Harvey Silverglate, 2018 4. Deborah Taylor Young, New York, USA Nominated for: Artistic Experience, Harvey Silverglate, 2018 5. Nina Laudel, New York, USA Nominated for: Artistic Direction, Harvey Silverglate, 2018 6. Tanya R. Jones,", "The next Biennial should take place in 2021. This will be the last time the museum will host a show on the subject matter of its collection, although it will continue to publish books, recordings, and other materials on its extensive holdings.\n\n\nThe Rise of the Modernist: Art and the Modernist Movement in Germany, 1935–1945, will return to the Biennial in Munich in November. The exhibition will highlight the democratic and liberal ideals that shaped Germany between World War II and the fall of the Berlin Wall in 1989. The exhibition will also feature work by thirty-seven artists, including Pierre-Xavier Huyghe, Zoran Jovanovic, and Hildegarde Du Maurier; the Berlin-born American artist Judith Willoughby; and the late American designer/artist Richard Avedon.“The exhibition’s inaugural edition, ‘The Rise of Modernism,’ in 2015, was at least partially inspired by the rise of the New Left in the 1930s. We wanted to explore how art and design affected contemporary social and political conditions. The contemporary artist became an important and influential force in the German state. We wanted to show the work of artists that were not only the pioneers, but also the", "The next Biennial should be held in 2022. The National Gallery of Art in Washington, DC, has already announced that it will begin the process of reopening to the public in April.\n\n\nThe National Museum of Fine Arts (NMFA) in Athens, Greece, has reopened to the public following months of severe damage caused by a massive fire that broke out in an electrical substation on January 7. The firemen who extinguished the blaze, which also damaged at least twenty buildings, were not able to extinguish the flames for some time, and the institution had to be evacuated. The firemen only managed to put out the blaze for thirty-four hours, giving the public an opening to photograph the damage from the blaze and of the fire itself.The institution’s main building, the museum, had already been severely damaged by a fire in 2011. The museum reopened in 2012, but the building had been completely gutted by the time the museum received the award for restoration awarded by the Foundation for Contemporary Art (Fakrit), which was founded by the artist Ekaterina Kirillova. The museum also received the $66,000 prize in 2013 for restoration.In order to assess the damage to the building that was reconstructed as the museum’", "The next Biennial should be held in 2020.\n\nThe coronavirus virus has spread across the globe, and is making its way to Australia, the United States, and Europe. According to the BBC, the coronavirus has infected more than 350 people in Japan and has also been linked to the coronavirus in China and Vietnam. The outbreak has also spread to other countries, including the United Kingdom, France, Germany, and the United States, which have impacted on the United Nations' response.The coronavirus has also spread to at least fourteen countries in Asia, including China, South Korea, Japan, Taiwan, the Philippines, Thailand, Vietnam, Cambodia, Cambodia-Haiti, Cambodia-Singapore, Cambodia-China, Indonesia, Malaysia, Malaysia-United Arab Emirates, Thailand, Japan, Taiwan, the Philippines, Cambodia, Vietnam, Cambodia, Vietnam, Cambodia-Burma, Cambodia-Japan, Vietnam, Cambodia-Peru, Malaysia, Singapore, Thailand, Thailand-Peru, Hong Kong, Hong Kong-China, Laos, Cambodia, Vietnam, Vietnam, Cambodia-Nepal, Cambodia-Canada, Canada, Hong Kong, Japan-Canada, Japan-Canada, Hong Kong-Canada, Japan-Canada, Hong", "The next Biennial should be in February 2021. If that date is met, the event will be postponed.  The twenty-fifth edition of the Venice Biennale will be held in March 2021.\n\n\nThe Contemporary Art Museum Stuttgart (CAMD) announced today that it is planning to open its first art museum in the town of Bielefeld, near the German city of Nuremberg, in March 2021. The institution will be located in the former Nibelau factory, so-called “Berlin for Art” and will host fifty artists, including Eduardo Batista, Irina and Romy, and will organize programming that reflects its contemporary vision. The museum will also have a small town of Nuremberg-Berlin with a museum and café in an adjacent building. The first exhibition of the new museum, “Art and Modern Life in the Middle Ages” (2019), has been set up in the museum and will go on view in March 2020.The construction of the museum is a collaboration between CAMD and Frank Gehry Architects and is slated to take three years and costs around $100 million. The city of Nuremberg has already invested around $2 million into the museum. According to the C", "The next Biennial should take place in 2020, the organizers have announced. They will post more information at their website thenextart.com. \n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has released the final designs of the upcoming October 8–September 2 exhibition “Ain't It Beautiful,” which will highlight the works of sixty-five artists and will feature works by artists such as Henri Rousseau, Robert Irwin, and Sarah Lotjani. The exhibition will run at the Hirshhorn and will be organized as follows: Separate exhibitions Oct. 8–10 will feature works by artists such as Hydra, Kukulkan, Khemu Maung, Neszko Gac, and Pangaea. Oct. 16–18 will feature the work of independent artists such as Nell Dorr, Andre Gide, and Maira Kassel.“Throughout the exhibition, we will continue to present narratives of the artists whose work we admire and the work we wish had been conceived earlier,” said Hirshhorn director Max Greenfield. “The work of the curators is an important contribution to the Hirshhorn’s legacy. We look forward", "The next Biennial should be held in the spring of 2022.The 2020 edition of the art fair was canceled amid the global health crisis, and the 2020 edition of the fair was postponed until the New Year. The New York–based gallery Nirvana Enterprises, which organized the event, said that it expects to remain open during the pandemic. However, the gallery is preparing to move to a new location and has begun the construction of a new 600,000-square-foot facility.\n\n\nThe Asian Art Museum (AAMD) in Taiwan has announced that its artist-in-residence Yuichiro Anzai will become its next director. Anzai, who will assume his post on February 2, 2019, has helmed the museum since March 2019, after the pandemic ended. He succeeds Bina Minghoon, who retired in February 2020 after more than four years. “Bina’s legacy, alongside that of her predecessors, was predicated on a continuous and high-quality exchange of ideas and ideas-from-the-ground perspectives,” said Anzai. “The combination of the two of them was essential for the development of the AAMD, and I’m incredibly", "The next Biennial should be titled “The Future Is Present: The Historical Stories of Man” and will be held at the International Center of Art History, in Frankfurt am Main, Germany, on January 19–January 21, 2021.\n\n\nMembers of the Chinese Academy of Fine Arts (CFA) in Beijing have cancelled a trip to the United States following Donald Trump’s election victory. On Saturday, the students informed the global arts organization that they were cancelling their trip, which was scheduled for January 26–January 29.Called the CFA 17, the trip was supposed to take place across the United States and take advantage of the CFA’s new 600,000-square-foot space at the newly constructed National Museum of Contemporary Art in Washington, DC. The trip would have taken place in early January, shortly after the inauguration of Donald Trump, and would have featured over two hundred artists from China, India, Japan, Korea, and Thailand.The students’ decision to cancel the visit was made in a letter sent to the CFA’s head, Wu Duyi, on January 7. It reads: “We strongly feel that the CFA’s visit to the United States is not", "The next Biennial should be in 2021, and the biennial “Ricochet: Art and Resistance” will be up in 2021. As the biennial moves forward, the museum will collect and make available works that are from the collection of more than twenty other artists. Currently, the museum has a selection of works by the French artist Jean-Michel Basquiat, who was a friend of the museum’s founding director and one of its founding curators, Thomas Ligotti. “We are proud to present works by these artists and the panelists who have agreed to participate in the upcoming biennial,” said Museum Director María Berrada. “The new exhibition will reflect the essential dialogue between art and the political currents of the time, and will be inaugurated by a geometric assemblage by a long-time collaborator, Rene Magritte, in the artist’s studio.”\n\n\nThe Daniel-Franck-Krasner Museum for the Arts (DFKA) in Berlin has postponed its second edition, which was set to take place in the spring of 2021, due to the ongoing crisis in the Middle East. The exhibition, titled “K", "The next Biennial should be about the future of art in the city, which, according to the organizers, has \"simply been out of reach of the people.” The future of the institution, of course, will inevitably change: the destruction of the current exhibition format, the launch of an entirely new exhibition every two years, will become the norm. The organizers of the biennial wish to remain anonymous. The biennial will also include a new sculpture by Mark‐Paul Mpagi Sepuya and an exhibition of work by Rory McAllister. The 2019 edition, titled “The Visions of a Child,” is on view in the city until January 11.\n\n\nThe Philadelphia Museum of Art (PMA) has released the results of its biennial “The Dilemma of Light and Dark: Light and Shadow” through March 12, 2019. The exhibition was organized as a project of the PMA’s inaugural series, “The Dilemma of Light,” which explored the intersections between light, shadow, and the afterlife. The exhibition will include fifty works by seventy‐three artists\u0097including Chad Baker, Ed Ruscha, Alan Hale, ", "The next Biennial should be held in 2020.\n\n\nThe Museums Association (MA), a United Kingdom–based advocacy group, has launched an online petition demanding that the British government take direct action against museums that have been compromised by the Covid-19 crisis. The group is asking for the government to establish a national crisis fund for cultural institutions and establish a national day of remembrance and remembrance weeks. Activists have previously used online petitions to pressure British governments to provide more aid to cultural institutions, including the Royal Shakespeare Company (RSC), which is facing a possible shutdown because of the coronavirus; the Hammer Museum; and the Tate.On Monday, Prime Minister Boris Johnson announced that he intends to establish a £10 billion fund for the financial needs of British cultural institutions through a combination of direct funding and loans. According to The Guardian, the fund will be administered by the Office for Budget Responsibility (OBR), a UK-wide organization that is charged with administering £6.5 billion of the UK’s £9.7 trillion budget.The organization will receive 50 percent of the funds through direct loans; the other half will be lent to British institutions by the Treasury. The National Art Gallery (NGA), the National Portrait Gallery (NPG", "The next Biennial should be held in 2020. The 2019 edition, “Between the World and Me: and the Art of Alfred Koons,” was held at the Museum of Modern Art in New York. Dennis and Carol of the Microstructure, a group exhibition held at the Museum of Modern Art in the United Kingdom, will present a survey of Koons’s work next year. The first show dedicated to the sculptures of Claude Monet, François Mersch, Pierre-Auguste Renoir, and Henri Matisse will open in the spring of 2021.\n\n\nThe Southbank Centre for Contemporary Art in London has received a gift of twenty-six works by the artist-activist Rebecca Watson. The donation includes twelve works by Watson, who graduated from the Graduate Centre in London with a degree in sculpture in 2011 but left the institution in 2012 after a dispute with director Maria Balshaw over her involvement in a student gesture, the “NIRIN” project, which involves the construction of a permanent work by Watson.Balshaw has since become involved in the effort to make “NIRIN” a reality, which she described as “a way of bringing together the most important works from the history of", "The next Biennial should be held in 2022.\n\n\nThe British Galleries (BGC), which has been struggling to find a new location to operate because of its ongoing renovation and expansion project, announced that it will shutter its London outpost, as it works to re-engage with the local community through a series of public exhibitions and other programming.The exhibition spaces, which have served the venue since it relocated from its current home in Regent's Park in 2008, have been turned into temporary exhibitions spaces, which will be used by the BGC in partnership with the National Poetry Library, which was founded by Daniel Salter and Anne Truitt in 2013.Salter, the founder of the London-based visual art collective Daniel Salter Gallery, will remain involved with the organization, and the BGC will continue to host events and offer programming. “We began the project in 2012 to return the National Poetry Library to its original purpose as a core collection of poets,” said Salter. “This year marks the fifty-fifth anniversary of the founding of the National Poetry Library and we are thrilled to be celebrating the occasion with your programs. We hope that you will continue to have a significant role in supporting the BGC�", "The next Biennial should be in February 2022.”Paulino added that the next iteration of the event will encourage digital and social collaboration through a series of exhibitions and residencies that reflect the themes of the year. The artist will also work with the artists represented in the exhibition to create a project for the exhibition. The institution will host a reception for the artists at the ShoWarex in California in February 2019.\n\n\nThe European Court of Human Rights has issued a ruling that the Turkish government is infringing on the human rights of Armenians through the forced relocation of thousands of Armenians during the Ottoman Empire’s rule over the region between 1915 and 1923. The court found that the Turkish government is guilty of violating the rights of Armenians under the 1915 Protection of Civilized Life Act, which was passed in 1938, and ordered the Turkish government to pay a total of $62.5 billion in compensation.“The chief aim of the General Law of the Turkish Republic is to annihilate all traces of the Armenian population in the country,” the court said in a statement. “The measures taken to defame, to demean, to weaken, and to expel the Armenian people are systematic and deliberate. In this context, the court finds it", "The next Biennial should be held in 2021. The inaugural edition, titled “I, Tanya,” was staged at the Museum of Fine Arts, San Francisco, in 2013–14 and included work by forty artists, including Ahmad Salah and Emil Eskenazi, and was persuaded to take place as a result of the Vietnam Veterans Memorial Museum’s proposal to stage a “summit between three of the forty greatest living Vietnamese artists.” The museum then brought together the three finalists for the honor, and the museum selected the winner from a shortlist consisting of An Nguyen, Bao Chi, and Wang Teh. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has added three new artists to its roster: Hao Jing, the highly-composed Chinese artist who depicts abstract forms in a watercolor collage, and his partner Yu, who creates works in collage, printmaking, and sculpture. The museum also revealed that it has appointed Anand Mahindra as its first Curator of Contemporary Art and David Parkinson as its first curator of the new medium of video art. Both Mahindra and Yu will serve as curators at the institution for two", "The next Biennial should be held in October 2020.\n\n\nThe founder of the Washington, DC–based arts organization Artadia has been ordered to pay $3.5 million to the families of three individuals who were tragically killed in a car crash in Stony Brook, New York, in 2013—one of the twenty-first-century’s worst tragedies. The fine is the largest fine ever levied against Artadia, which has offices in New York, London, and Hong Kong.“Artadia’s board of directors took the decision to suspend its annual grant to the family of Michael Slaght, who died in 2011 from brain cancer; Michael Slaght II, who died in 2013 from a massive heart attack; and Michael Slaght III, who died from a massive brain hemorrhage,” said board president Jodi Throckmorton in a statement. “As a result, the family will benefit from a sum of $3.5 million.”Slaght, who was thirty-six years old and the father of two young children, was killed in the crash on August 3, 2013, while he was driving his wife, Abigail, and their two-year-old daughter, Holly", "The next Biennial should take place in the summer of 2021, in the city of Biennopolis, in the city of Turin; the first exhibition will be staged in the spring of 2022. In a statement, the Biennopolis Council said: “The City of Rome and the Italian Ministry of Culture are thrilled about the proposal for the 2021 edition of the Biennopolis Biennial. The project was initiated by the architect‐in‐chief Giulia Bocchieri and will present an exhibition that will be a synthesis of contemporary art and architecture, in the city of Rome and in the city of Milan.”The plan is to build a new fifty-eight-thousand-square-foot exhibition space in the museum and to create a new public courtyard, which will comprise two exhibition spaces, an education center, an auditorium, a library, and a café. The new museum will be inaugurated with an exhibition, “Leo di Leon: Insignifico del canto,” in March 2022. The exhibition will be curated by Giuseppe Fusi, the head of the Fondazione Feltrinelli and the Feltrinelli Arti, and will be presented by Giuseppe Sanna", "The next Biennial should be held in the spring of 2021, and the date for the event will be announced in 2020. The venue will be a reshuffled, updated version of the 2,500-seat museum featured in the 2013 documentary film The Artist in the Palace. The 50th Anniversary Celebration will be held in the summer of 2022. What started as a group show of work from Mines, Museum of Fine Arts, Boston, morphed into the largest gathering of contemporary Indian art in the United States. The event will feature more than 1,500 contemporary artists from India and other countries. The 50th Anniversary Celebration will be the largest exhibition of work by a single artist at the museum since the institution opened in 1988. The biennial will be curated by Prakash Pal Singh and Amitav Ghose. The artist group will be comprised of Mada Kunwar, Shayena Ganesan, Kiren Rijiju, Nirupama Rao, Rupak Mukherjee, and Kadriya Mukherjee. The exhibition will be inaugurated by a solo exhibition of work by the artist Jai Mohan Malhotra.Nan", "The next Biennial should be held at least twice a year and ideally should be held in the summer, in a location that is accessible to the public and open to the public. The new theme should reflect the historical and cultural achievements of the local community and should be an expression of the local community. The 2020 edition will focus on the lives and work of small-scale artist and gather around a specific theme: the neo-liberal, market-driven, and state-centered worldviews of the twenty-first century. The theme for this year’s biennial is COP21, and the selection of a representative selection of the artists selected for the exhibition will be made through a process that comprises interviews, readings, and screenings. “Hamid, Akram, and [Walid] Al Qasimi have announced their representation of Leila C. Ahmad, who has been a core member of the Post-Modernist movement in the United Arab Emirates, as well as the Palestinian artist Hila al-Senay, and Khaled Araeen, who creates works rooted in everyday life and empowers us to live lives that are a reflection of our values,” said Ali Wezami, director of the Abu Dhabi Art Foundation", "The next Biennial should take place in the summer of 2022. The artists who were chosen for the 2019 exhibition were Sophia Benassi, Mark Borthwick, Andrea Benigno, Tania Bruguera, John Brouwer, Franz Boulanger, Nora Benigno, Olivier Boulanger, Sara Buhl, Viktoria Büttner, Andrea Bruguera, Pedro Bruguera, Gabriel Büttner, Adriana Büttner, Natalie Bonetti, Ernesto Còngeles, José Carlos Castro, Timur Camil, Rafael Carlini, Jose C. María, René Carli, ,Mario G. De Freitas, Alexandra Fusi, Mihai F. Mala, William P. Mather, Sara Cafritz, Pawit Wira, Anselm Capozzi, Raimond Castano, Juan Carlos Castro, Marlene Castro,'s granddaughter", "The next Biennial should be in 2021. \n\n\nThe Honourable Robert Giard, the British painters who often used their bodies to create paintings that transcend language, has died at age eighty-three. The English-born, French-born, and German-born artist is perhaps best known for his intricately knotted, layered, and polyester-based works, which often examine man’s relation to nature and the earth.Born in London in 1932, Giard went on to study painting at the Royal Academy of Arts, in his hometown, and the London School of Art. After working at both, he eventually enrolled in the School of the Arts, where he met his wife and the American sculptor Ed Moses. Together, the pair created the iconic Eden in the Academy’s basement in London in 1957. The work quickly gained popularity with critics and collectors and was included in the 1970s exhibition “Robert Giard: The Art of Painting.” The first retrospective of Giard’s work at Tate Britain was in 1976, and his work has appeared in the following volumes: Robert Giard: Essays (New Museum, London) Robert Giard: The Art of Painting, New York", "The next Biennial should take place in 2022 at the end of the twentieth century, and probably be held at the Stedelijk Museum in Amsterdam. Since the establishment of the Windhalm Museum in Salzburg in 1951, the institution has hosted more than seventy-five exhibitions, including several original works by Peter Galassi. The successful negotiations between the Swedish and Danish governments to present the 2022 edition in Salzburg have been held up by the ongoing global climate emergency. The Swedish pavilion will be moved to the Tressjof in Copenhagen, while the Danish pavilion will be moved to the Fjällnäjän at the Palazzo Epelecittà.\n\n\nAn exhibition organized by the United States-based cultural nonprofit the Open Society Foundations in cooperation with the German state of Brandenburg is currently on display at the German parliament in Berlin. Titled “Theater of Operations: The Gulf Wars” (Theatre of Operations: Middle East, the Balkans, and Central Asia), the exhibition commemorates the ten years since the US-led invasion and occupation of Afghanistan, Iraq, and the former Soviet republics of Georgia and Ukraine. The event will run from February 9 to February 10, 2020.", "The next Biennial should be held sometime in the first half of 2020. Source: The Artist ~ The Artist as Metaphor, June/July 2019/September 2020<|endoftext|>The Museum of Modern Art (MoMA) has announced a $1 million donation from the John F. Kennedy Foundation, which has supported the institution since 1987. The donation will help fund the restoration and renovation of the MOM building on the Museum of Modern Art, which encompasses two buildings—the Kennedy Center and the Museum of Modern Art—on Pennsylvania Avenue in Manhattan.The gift was made in honor of the foundation’s twenty-fifth anniversary. The foundation has donated over $298 million to the Kennedy Center, including a $166 million gift for the Kennedy Center in 1979 and a $46 million gift for the Kennedy Center in 2002. The gift for MoMA was made in honor of the institution’s founding in 1958.The gift will be divided between the foundation and artist organizations for the entirety of the building’s renovation, which will extend the life of the building by more than ten years. MoMA’s current tenant, the Hudson Yards development company, is proposing to tear down the existing structure in the works, and the project has been in development", "The next Biennial should take place in 2020.\n\n\nThe Taub Museum of Art in New York has received a gift of more than four hundred rare paintings, sculptures, photographs, and prints from the artist-in-residence, Kiki Smith. The gift includes a number of works curated by Smith, a African American woman of color with roots in the South, including two works by Smith and her husband, Maurice Smith.The gift was made on July 25, 2020, the Saturday before the city celebrates its fifteenth anniversary, and was presented by artist and collector Natalie J. Nka, founder and director of the label Avery Gallery. The museum opened in 2015.“Kiki Smith is a remarkable artist whose prolific output is as remarkable a reflection of her vision as it has been for everyone to see it,” said Avery founder and director Marc Glimcher. “Her art has afforded an outlet for her voice and for her spirit, and it has made her an international star.”Smith’s work is represented by Avery in New York and at the Shandong Art Museum in China, where it is displayed in the exhibition “Kiki Smith: Painting.” “Her work has been collected by institutions and", "The next Biennial should take place in the autumn of 2021.  The 2019 edition, curated by Yinka Shonibare, and the inaugural exhibition held at the museum in 2013 by Peter Dreher, drew some twelve thousand visitors. By 2020, the museum will be able to welcome a maximum of seven hundred visitors a day. \n\n\nThe Chicago Art Museum (CAM) will open its new five-story, 800,000-square-foot building on South Congress Street on December 8, 2020. The institution, which was conceived as a \"modern-day version of the Museum of Modern Art\" in 2009, will be inaugurated with a celebration of the twentieth anniversary of its opening on December 5, 2020. The show will include works by forty-three artists, including Richard Avedon, Aline Menge, Marc Miro, and Jiess, and will run through February 26, 2021.“The building’s design, size, and location have been carefully considered throughout the museum’s history,” said curator and director Jerrold Suttie. “In following a long-standing tradition of integrating contemporary and classic art, CAM has embraced a new kind of infrastructure as a way of", "The next Biennial should be held at least two years from now.”\n\n\nThe Aarhus Art Museum in Denmark has received a gift of twenty-five works from the Danish artist Eric Kjærgaard, who passed away in Kassel on December 27. The works, which are in the collections of the Aarhus Art Museum and the Aarhus Museum of Art, are the works of Arne Glimcher (1905), Jørgen Arne Glimcher (1907), William Armitage (1901–2004), André Bazin (1905–2004), Amanda Burr (1893–1974), Jørgen Bächli (1901–1974), Peter Brabe (1894–1977), André Brunel (1902–1976), Moritz Büchli (1902–1977), Michio Kita (1903–1978), and Kathrin Krefeld (1902–1977).The works were donated by Eric Kjærgaard to the Aarhus Art Museum and the Aarhus Museum of Art in cooperation with the Danish government. In addition, the museum installed new works", "The next Biennial should take place in 2020, and will be led by Michelangelo Antonioni and Tommaso Cattelan. The announcement of the new themes, which will include a work by the recently deceased American artist Frank Schirmer, was made by Olivier Roubaix, Chairman of the board of trustees of the Biennial.The project was established in order to “open the public and the museum to the new possibilities of sculpture and painting.” The announcement of the new biennial themes was made in collaboration with the City of Paris, which is collaborating with the Biennial to create a new platform for cultural exchange.\n\n\nThe Metropolitan Museum of Art (and the Whitney Museum of American Art) have launched a new initiative that will provide new ways for the public to experience and connect with works by artists working in the United States. The initiative, called the Metascore, was born from the effort of the museum’s board chair, James D. Farquharson, to make a more direct and efficient connection between the Met and the public through art. The Met is currently developing a new online portal that will include more than ten thousand works by forty-four artists, including Annie Prouvé, James Tur", "The next Biennial should take place in the autumn, and will run from October 27 to November 10. The exhibition will feature work by twenty-nine artists from twenty-six countries and territories. Biennials are not normally organized by a single institution, but Germany is planning to partner with the Kunsthalle Fabrik Main in Berlin and the Museen Kunst Berlin to form a single, multi-venue exhibition space.All twenty-six artists who were invited to participate in the festival will be represented by the Berlin-based collective Haus der Kunst, which was founded by artist Hannes Hofmann—who will be the theme of the first exhibition, “Lederhäuser für die Geld über die Bildung,” which will open at the Kunsthalle Fabrik Main on November 24. Haus der Kunst’s exhibition will also feature works by Mojza, Nadia Nadia, Peter König, Christian Schäfer, Jürgen Todenhöfer, and Jan van den Driel.Featuring a selection of work by Hanna Brandt, Oskar Mier, Peter Schäfer, and Hans-Ulrich Wirth, “Lederhäuser f", "The next Biennial should be held within the next twelve months.The bids for the Biennial 2008 were signed by twenty-four artists who are represented in the exhibition, which is organized by the Württemberg Museum of Art, Berlin and the Courtauld Institute of Art, London, and are curated by Dahlia Fries and Olafur Eliassen. The exhibition will open at the Museum of Contemporary Art (MoCA), New York on March 3 and will run until March 29.The inaugural exhibition, titled The Floating World, was staged at the Württemberg Museum of Art in February 2008. The show, which comprises sixty slides and is organized as a series, was meant to explore the non-representational nature of the physical world. However, due to the coronavirus outbreak, the exhibition was moved to the Courtauld, where it has been since February 13, and the first presentation of the works was moved to the Museum of Contemporary Art, Art + Culture, London, on February 23, 2008. “We are thrilled that so many of the artists who are represented in the exhibition are returning to present work in the exhibition, and the work of many of them again is being showcased in the exhibition,” said", "The next Biennial should be held in the year 2022. The seventy-third iteration is currently underway. \n\n\nThe museum’s board of trustees announced today that Michele Ganz, the executive director of the European Society of Arts, and David K. Weinberg, the former executive director of the New Museum, are to be named the next board members of the museum.Called the Cultural Affairs Committee on Arts and Culture, the panel will be comprised of Ganz, Weinberg, and Paul Schellnhuber, the former chief curator of contemporary art at the Museum of Modern Art in New York; Patricia Fischl, the current general director of the Wolfsonian-Florida International University in Miami Beach; and John D. Hogg, the current president of the Ohio Society of Art.The full list of participants in the four-week, thirteen-day-long competition can be found here.\n\n\nThe Pennsylvania Academy of Fine Arts (PAFA) in Philadelphia has appointed David Zwir, the founder of MOS Architects, as the next executive director. Zwir has served in the position for sixteen years and has helmed the Museum of Art since 2007. During his tenure, the institution has become a major cultural destination in the", "The next Biennial should be held in 2020. The museum will be a destination for visitors from the United States, Europe, and Asia.  Last year, the museum attracted more than eight hundred thousand visitors from twenty-six countries and territories.  The new exhibition, titled Cultures in Disrepair, will include original works by artists from twenty-six countries and territories. The art of the exhibition will be curated by Marina Panzarinova.\n\n\nThe Centre Pompidou, one of the largest independent arts museums in France, has received a gift of one hundred works by French artists in a four-thousand-piece restoration that will allow it to reopen in 2021. The donation, made by architect Michel Lecomte, includes the works Ile-Marie, 2017, which was created during the French Revolution; Si ἀtsi, 2018, a series of monumental paintings that explored the relationship between the artist and the landscape; and Félicité Leçonienne, 2019, a self-portrait by Michelangelo Petacci.The work, which is part of the Centre Pompidou’s 2018 edition, was placed in storage after the institution", "The next Biennial should be held at the Institut d’Arles in a few weeks. The organizing committee will announce the date and the venue for the event. Artforum has reached out to the organizers of this year’s  Arts+ to ask if the start of the event is delayed. The organizers’ response stated that the inception of the exhibition would have taken place in September, but that the exhibition has been rescheduled for October 25–November 13. The show will now be held at the Institut d’Arles until March 17. Arts: A Retrospective, 2016, curated by Laura Owens, was also moved to September. Last year’s event, which was hosted by the Royal Academy of Arts in London, was also plagued by delays and cancellations as galleries and other institutional organizations were forced to move their exhibitions online. In an attempt to ease the travel woes, London’s Tate and the University of London announced last week that they were open by October 21 for a weeklong run of exhibitions. The University of the Arts (UCL) in London has also confirmed that its exhibitions will be back online by the end of the month. However, in", "The next Biennial should be held in 2021. The next will be held in 2025. The next will be held in 2023. The third and fourth years of the current triennial, which have been absent since March 20, 2019, will be recalled in 2021 and 2022, respectively.“We are very excited to reveal that our next biennial will be held in the spectacular city of Basel from March 19 to March 21, 2022,” said Jean-Pierre Biard, the commissioner of Basel Art-Travel. “This year’s biennial was excellent; we are even more confident that it will be next year.”He added: “The future of the Biennial is at stake. We must act now to ensure the future of the Biennial. We have only a few months to act. We must decide fast and act collectively.”According to DPA, this is not the first time the Essen Biennial has been postponed. It was originally slated to take place in September. Its upcoming event will take place from September 12 to September 15 in 2021 and September 15 to September 21 in 2022. In January, dozens of galleries in Germany and around the world called for a delay of the exhibition in", "The next Biennial should take place in 2022, when the exhibition will be on display in the US Museum of Modern Art in New York; the Museum of Modern Art, Los Angeles; and the Museum of Contemporary Art, Paris.\n\n\nThe Metropolitan Museum of Art, New York, has released the first data sets for the five-year retrospective of Maya Lin, the Philippine-born, Brazilian-born artist who has been a controversial figure in the art world for her depictions of women in historically marginalized roles, including as prostitutes and as lesbians.The first data set, titled the Metropolitan Museum of Art, L.A.: Women in Art, by the Met, will be released on September 27 and will include the data for the first time, in the form of a data visualization. The visualization, which has been created using a technique called vector graphics, is based on an interactive site that visitors can view on the Met’s website. “Maya Lin’s data sets are an attempt to re-create the life of a prostitute, re-create the life of a lesbian, re-create the life of a transgender person,” said Juan Jose Peralta, the Met’s assistant", "The next Biennial should be held in the fall of 2020.\n\nThe National Art Museum in Washington, DC, is preparing to open to the public in September. The museum consists of a series of buildings that have been transformed into a cultural corridor, linking the Smithsonian American Art Museum in Washington, DC, with the Smithsonian American Museum of Fine Arts in Atlanta. The institution is also planning to launch an online platform to interact with the museum, which will offer more direct access to the works of contemporary artists through a subscription service.“We are thrilled to open the new Museum to the public and to have the opportunity to showcase new works by some of the most influential artists of our time,” said Nari Ward, the museum’s associate director of communications. “The success of the biennial depends on the museum’s ability to cultivate a community of artists, and to build a strong, bipartisan, and permanent collection. That’s why we’re focused on growing the collection by fostering new relationships with local, regional, and national artists. We are also committed to improving the museum’s public experience by promoting a better understanding of the history of the institution.”Ward noted that the museum is also working on a", "The next Biennial should aim to restore the museum’s former holdings, which are currently being repossessed, and focus on the conservation and preservation of its collection, which is currently being divided among the museum.\n\nThe 2017 edition of the Biennial, “Aura of Beauty,” marked the centenary of the opening of the first exhibition, “Prosody and the Art of Modern Life.” The show, which was curated by Yuko Takahashi, and opened on December 21, 2017, featured work by thirty-four artists under twelve years of age.Among the works that were on display were works by Eiko Hasegawa, Rintaro Hasegawa, and Koki Tanaka. The exhibition also included works by Goshka Otsuka, Vito Acconci, and Tadashi Nakayama. The twenty-fifth edition of the Biennial will be staged at the Biennial Museum in Tokyo from February 21 through March 21, 2020.\n\n\nTwo decades after the U.S. invasion of Iraq, American museums are still struggling to recover from the losses and damage caused by the conflict, which has since morphed into a full-blown civil war. While the government has begun ph", "The next Biennial should take place in 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the temporary closure of the city’s three public art museums in order to avoid a repeat of the Covid-19 pandemic—this time in earnest. The guidelines, which were drafted by the DCLA and were issued on September 5, stipulate that museums “may not be opened, operated, or maintained by visitors without the express permission of the city or a majority of the board of directors.”In order to halt the spread of Covid-19, which causes coronavirus-like symptoms, the city has begun closing museums and reducing the hours of its museums, and has deployed the armed forces to help local law enforcement officials combat the virus. According to the New York Times, the number of confirmed cases of the virus in New York City has dropped by eighty percent since the cities of Los Angeles, New York, and New Jersey closed their museums—the majority of the states have since declared their states fully closed.Although the restrictions on public gatherings and institutions have remained the same, the number of people who have come into contact with the virus has gone up, and there have been more cases reported", "The next Biennial should be held in 2020. The date for the 2020 edition, titled Architecture as a System, has yet to be decided. “The list of conventions that will be curated will include the first exhibition of works by São Paulo Bienal in the Brazilian city of São Paulo, the first exhibition of work by Bruno Latour in Leipzig, the first international conference in the history of the Brazilian city of São Paulo, and the first exhibition of work by the artist María Berrada in Rio de Janeiro,” Belo said. Julia Cameron, the director of the São Paulo Biennial and the London-based curator, told the Art Newspaper that the theme of the inaugural exhibition was “how to understand architecture as a system,” a term that Belo and Cameron had coined as a way to address the limitations of the term architecture when it was first coined in 1976. The new list of conventions will be released in the coming weeks.\n\n\nThe National Museum of Fine Arts (NMA) in Washington, DC, has named Reya Daniel-Low as its new director. Daniel-Low will assume her new role on January 4, 2021. She succeeds John", "The next Biennial should be called for January 2021, the same date as the last one, which will be staged in March. The new exhibition will be led by artist-in-residence and professor Zineb Sedira; curator and curator of modern art Evgeny Shevchenko; and curator of European art Jan-Axel Maal, who will curate the first exhibition of its kind in the United States. In the lead-up to the event, which is being organized by the Center for Contemporary Art in the History of Art (CACHA), in the city of Hamburg, the Center for Contemporary Art Hamburg will host a series of free events, including a panel discussion with the exhibition organizers, as well as an exhibition of contemporary art from the Hamburg-based artist-in-residence Fabian Mohrmann.The two-day event will be hosted by the CACHA, which is also holding a symposium on the history of art in the city of Hamburg, as well as by the Centre for Contemporary Art (CAA) and the Hamburg-based institution Hamburg Art Museum. The locations of the shows are as follows:The first exhibition, titled The Past and Future of Modern Art, will be", "The next Biennial should take place in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has released the list of thirty-one artists whose works have been acquired by the institution since the institution opened in 1972. The thirty-two works have been selected from a pool of eighteen artists that included artists whose works are currently on display in the museum, as well as works that have never been on view, and are scheduled for exhibition in the museum at some point during the next four years.“We are incredibly proud of the artists whose works have been acquired and are excited to present them to the public,” said museum director Daniel H. Weiss. “Cultural institutions of this kind in New York are essential to our mission to promote the art of the future. We are grateful for the support of the community and our donors, especially the donors who have helped MoMA create a unique collection of works that will further the museum’s mission.”The thirty-one artists are:Agnes Martin: Nude (1977)Art of War: The Third Reich (1991)Art of the Present: Women, War, and the Holocaust (2009)Art of the Present: Men, War, and the Holocaust (", "The next Biennial should take place at the annual Biennial of Art, the Chicago-based nonprofit that raised funds for the event in 2018 and is currently transitioning its show from Madison Square Garden to the Metropolitan Museum of Art. “We are excited to kick off this new chapter with the first exhibition of work by the new masters of modern art, Anna and Pierre Osmond,” said David Green, director of the museum. “Their first exhibition together will showcase their work for the first time in more than twelve years. We are confident that the new exhibition will be a great introduction to the work of these two remarkable artists.” The new partners’ work will also be featured in two other works by the duo, “The Two Believers,” which will open at the Biennial of Art in September 2019, and “The Stages,” which will open at the Biennial of Art in October 2020.Both Osmond and Anna were selected from a group of thirty artists who were nominated by a distinguished group of arts professionals, including Dan Barnes, artist-in-residence at the Central Library of Art; Paola Boulli, director of the Rijks-Kampff Museum", "The next Biennial should be held in 2022. \n\n\nThe Chinese artist Wang Kui-chi, whose colourful and often surreal paintings and drawings often trace a love story between two men, died on April 5 in Beijing at the age of ninety-seven. His work, which includes works that are both raucous and intimate—often depicted as if they were painted on the same canvas—has been collected by more than sixty museums around the world.Born in 1937 in Shanghui in the province of Hebei, Wang studied under Liu Jingjing and Yang Jie before establishing a career as a painter. His early work, which often incorporates humor and eroticism, is often described as being of a slightly surrealist sensibility. In 1949, Wang created the surrealist portrait Ai Weiwei. In the same year, he and Ai were commissioned to create a drawing for the theme park Shanghai by the state-run Chinese museum of culture, the Beijing Museum of Art.In the 1950s, Wang became known for his work as a cartoonist and also for his depictions of Greek mythology and Roman mythology. His illustrations of the Japanese manga manga originated in the late 1930s, in the country Wang studied at the time. In the 1950s, Wang also", "The next Biennial should aim to explore the interactions between art and politics and how these intersect in the contemporary world. The biennial’s theme should be “Politics on the Run,” an allusion to the 1984 film The Runaways. The twenty-third edition of the exhibition will include the work of sixty-four artists, including the Marrakesh-based artist Sohrab Mohebbi, who was selected for his sculpture The Runaway from the Arab Art Center in Dubai; the Egyptian artist Ahmed al-Maati; and the Tunisian artist Walid Raad.The biennial will be hosted at the biennial (Ba'ath Museum) in Baghdad from April 6 to April 10, 2020, and will also feature the work of eighty artists from forty-eight countries. The 2019 edition featured works by thirty-six artists, including Rihanna, Elia Salah, and Adam Pendleton.\n\n\nThe National Endowment for the Arts (NEA) has announced that it will eliminate more than one hundred arts programs and arts programming across fifty-seven states and the District of Columbia as part of a budget-cutting initiative that will reduce the agency budgets and implement a two-year funding cycle. The arts are", "The next Biennial should be held in the fall of 2020.  The artist-run museum, whose original location is in a former coal-electric plant in the industrial city of Dusseldorf, Germany, has also been asking the city of Munich, near the Swiss Alps, for three years to set up a new exhibition space for the show. The museum has hosted the show several times previously, but always in a limited capacity. It was originally scheduled for a 2019 run at the museum, but the exhibition was moved to a different venue a few weeks before the opening of the museum’s Beijing exhibition, which was canceled, and the first show was held in October. The next edition of the show will be held in May of 2020. Kunsthalle Biennial, which has been organized by the Kunsthalle Karlsruhe and the Kunsthal Aarhus in Denmark, has also said that it expects to run some 90 percent of the exhibition’s content online. The show will have an online component, but not a physical one. The Kunsthalle Karlsruhe and the Kunsthal Aarhus will be co-presenting the event, which will be held in two locations:", "The next Biennial should take place at a new location in the city, with a new and improved design, and will arrive in 2021. The 2022 iteration of the exhibition will be hosted by the Tachikawa Museum. \n\n\nThe ex-MaRSO staff and supporters are demanding that the Shimizu-based company take the decision to shutter its four-story, Art Deco-inspired museum in Tokyo and relocate its exhibition space, the Art Museum, to the former Kumamoto University building in the capital. The organization has submitted a plan for a new museum in the city to the city council, which has since endorsed it. The plan is for the assembly of the museum and the Art Museum into one building that will house the OMA Museum in the same building, and will reveal its design in 2020. In response, Shimizu asked the city to consider the Museum of Contemporary Art (MCA) the new host of the exhibition “Hiroshima: The Other Side of History,” scheduled to run from February 23 to March 5. The proposal was criticized by the MCA staff and supporters, who said that the decision was made in the name of protecting the institution. “I have been in contact with", "The next Biennial should take place in the city in 2021.\n\n\nThe Bolshoi Ballet has announced that it plans to stage a new exhibition dedicated to the life and work of Russian architect Sergei Alekseyevich. The show will be organized as follows: From August 29 to September 29 the company will present an exhibition of works that address questions of architecture and design. The show, titled From the Workshop to the City, will be sold at an event in New York City during the first week of September. The premiere of the show will be held on September 4 at the Bolshoi Art Museum.The opening of From the Workshop to the City will be preceded by the opening of a new exhibition devoted to the life and work of Russian painter Peter Zumthor. “Sergei Alekseyevich is a leading member of the avant-gardes of the late twentieth and early twenty-first centuries, whose work encompasses an important transition from Constructivism and Notation to Surrealism, from Constructivism and Painting to Sculpture, from Sculpture and Painting to Architecture and Architecture,” said director Natalia Kuzma. “In a new", "The next Biennial should be a great success, and the next one after that, and the next one after that, and so on, until we realize that these things can be managed—and managed well.”The next edition, which is still being organized by the publisher, will take place in the Solomon R. Guggenheim Museum in New York from March 22 to March 25, 2020. Tickets for the event cost $15, with VIP reserved-for-a-seminar tickets priced at $25.  The Museum of Contemporary Art in London will also hold its next edition, titled “The Future Is Present: Art in the Age of Mechanical Reproduction” in May, 2020.  The museum will also unveil the fully redesigned and expanded galleries at its new home at 6 New Oxford Street, which will open to the public in March 2021, in May 2021, and in September 2021.\n\n\nThe Sistine Chapel and the Vatican have received a major blow to their finances as a result of the coronavirus, which has already claimed the lives of more than 7,500 people across Italy and France. According to the Art Newspaper, the Vatican City Institute, which runs the chapel, as well as the institution�"]