["The next Biennial should be held in 2020.\n\n\nThe Institute of Contemporary Arts (ICA) in London has welcomed ten new members to its board of trustees, bringing the total number of members to twenty-seven. The institute’s director, Nicholas Cullinan, and Iain Mackay, who has helmed the organization for thirty-four years, announced the appointments at the ICA London Forum on 9 October.“Cullinan and Mackay’s first plan for the ICA is to extend the life of the institution through the establishment of an endowment for a new twenty-five-year biennial, which will take place in 2021, and I believe that this will be a powerful strategy to continue the work of the Institute of Contemporary Arts (ICA) in London,” Cullinan said. Iain Mackay added: “The ICA is at the forefront of a new kind of academic engagement and as such has an important role to play in shaping the future of our universities and colleges. I think the ICA will prove to be an ideal platform for promoting the ideas, innovations, and discoveries of an earlier era and I hope that by continuing to work with the ICA we can do this for", "The next Biennial should take place in the spring of 2020.  The Biennials of Malaysia and the Philippines won the prestigious Singapore Award in 2000 and 2000 respectively. Their next exhibitions will be staged in Kuala Lumpur in 2021.  Artforum.com has published an in-depth report on the upcoming Philippine pavilion in Artforum 2020. \n\n\nThe Witare Museum, Malawi, has been awarded a $1.1 million grant from the Lewis and Clark Foundation for its 2020–21 season. The prize, which was established in honor of former U.S. president and CEO J. Martin Luther King Jr., was announced last month. The grant was made on behalf of the foundation’s grant year, which is slated to run from March 2019 to March 2021. The funds will go toward a two-year residency program in the Witare’s new United States-built cultural center, which is currently being constructed in a former cotton gin in the capital city of Mpumalanga, Zambia. The project, which is being funded by the Lewis and Clark Foundation as part of a $5 billion gift, was also supported by the Josée and Frederic Briess Foundation", "The next Biennial should be in 2021. The tour will be led by artist-in-residence Sohrab Mohebbi and will take place at the special exhibition pavilions in the Grand Palace of Baghdad. The event will be inaugurated by an exhibition of the work of the legendary Iraqi artist Ismael Ali, who will represent Iran, Saudi Arabia, and the United Arab Emirates. The first exhibition will be devoted to Tahir al-Masud, a Kurdish artist from the Kudar province of Iraq who was a major contemporary artist in the city. The second exhibition will be devoted to Nusayib Houshiq, a prominent Iraqi artist who studied in the Islamic University of Medina and was a founder of the Baath Party. The third exhibition will be dedicated to Yousuf al-Hashemi, a scholar who was also a teacher at the Kudar University of Art and Design, who was a founding member of the Shafi'i school of thought and a scholar of modernism and its history.The final exhibition will pit the artist Habib Mirza against Tahir al-Masud and will be held at the Grand Museum of Art in Kudar", "The next Biennial should be held in 2020. \n\n\nThe Museum of Fine Arts (MFA) in Los Angeles is preparing to reopen to the public only weeks after it closed indefinitely due to the Covid-19 pandemic. The museum will remain closed until March 13, at the earliest, and will hold a special retrospective of American painter Eleanor Douglass, who focused her art on gender bias and social injustice.During the immediate shutdown, the museum underwent a major revamp. Its current exhibition space, which was previously home to a collection of Douglass's paintings, was reconfigured into a space that could hold as many as two thousand visitors at once. The museum’s main building, which housed the museum’s archives and an exhibition space named after Douglass, underwent a major renovation, introducing a new glass-enclosed reading room, a new gallery, and the Joan Mitchell Theater.The renovations were made possible through the $5 million donation of $1.5 million in funds from the Doris and Wallace de Gruyter Fund, which was established in 2017 to help offset the cost of the renovations. The funds will also provide additional funding for the creation of an endowment to support future exhibitions and events at the museum.The $", "The next Biennial should be held in 2020. Michael Colson, the director of the National Museum of African Art in Savannah, Georgia, said: “The new biennial will take a critical look at the intersections of art and its environment, with a particular focus on the role of art and its environment in the social and political life of Africa.” \n\n\nThe artist Sergio Negreanu, who was also the subject of the first edition of “Santiago Negra: Un está de una historia,” a 2007 exhibition at the Museo de Arte de São Paulo (MASP), has died at the age of eighty-three. Negreanu, who had been living in Montevideo since 1980, is best known today as the founder of the collective Daiva United, whose members include Lucio Fontana, Filipe Siqueiros, and Mpagi Sepuya, who collectively won two international art awards (the 2013 and 2017) and were nominated for a third (the 2020 version of the Association of Visual Arts). The group’s work has been exhibited at the Palais de Tokyo, the Museum de Arte, the Musée Royal, the Musée de Be", "The next Biennial should be held in 2020. The Festival will be hosted by London’s Tate and the London-based charity St Jude Children’s Hospital.\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Helen Cammock as its next general secretary. She replaces Gavin Brown, who has served in the role since 2013, and will take up her new post in January 2020.“Cammock’s appointment marks a significant moment for the ICA, which is becoming increasingly concerned about the future of our contemporary-art scene and in particular how we respond to and embrace this changing world,” said ICA director Sophie Martin. “At a time when the future of the art world is increasingly uncertain, ICA is working with our Board and Executive to develop a new strategy for the ICA that protects our members and our guests, both in London and beyond the borders of the UK. Helen’s appointment reflects the ICA’s excitement about our future and her willingness to take on leading the ICA into the future.”Commenting on her new role, Cammock said: “I am humbled and delighted to serve as the ICA’s next general", "The next Biennial should aim to disentangle the tenuous strands that have linked the museum’s curatorial program over the past five decades and explore how their remoteness from the contemporary—and from one another—has affected the art of the past. The issue is not unique to the museum, and it is not unique to New York. In the years since its founding, the museum has been transformed by a series of events that began in the Bronx in 1975 and culminated in its current location in Manhattan’s Hudson Valley in 1989. The museum’s permanent collection—which includes some twenty thousand items, including “Sol LeWitt: Sol of the Two Worlds” (1993), a large-scale performance that was staged by the New York Ballet and the New York School of Design; “Sol LeWitt: Sol of the Two Worlds” (1994), a presentation of the works of John Carlos and Jean-Michel Basquiat; and “Sol LeWitt: Sol of the Two Worlds” (1995), a retrospective of Bob Dylan’s performances.In 2009, the museum closed after twenty-six years in order to undergo a $500 million expansion, which added", "The next Biennial should take place in the fall of 2020, and should include a selection of works by contemporary and historic artists. The arts biennials were established to foster greater understanding and appreciation of the arts through exhibitions, residencies, and activities. With the launch of the Biennial of Arts in London, the 2020 biennial is expected to draw in more than 130,000 visitors. When the event opens to the public in 2022, it will be the longest-running event in the UK.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has commissioned artist-in-residence Paul Haggis to design the theme for the 2020 edition of the Whitney Biennial, titled “Messages,” which will open on September 4 and run through December 2. The exhibition will feature fifty works by twenty-seven artists, including Walter de Maria, Mary-Kate and Ashley Olsen, Brooklyn Ford, and Lillian Neville, and will be curated by Tina Gramsci, who will start this year as director general of the Fondazione Prada.The biennial—which also features work by artists that were featured in last year’s event, such as Jana Szymczyk and John Akomf", "The next Biennial should focus on the interconnections of images and objects in society and its influence on painting and sculpture, and should take place in the city of Rome. Curator: Paolo Gentile\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Evan Jacobson as its next director. Jacobson currently serves as associate curator of Modern Art at the Brooklyn Museum. In his new position, he will work closely with director Max Hollein and curator of modern and contemporary art Meg Smith to foster the institution’s diversity of artistic and academic interests.“We are thrilled to welcome Evan and see how he transforms the museum into a new center for contemporary art,” said James Steward, chair of MoCA’s board of trustees. “With a broad understanding of the museum’s role in connecting us to the world, he will build on the museum’s legacy as a global hub that encourages and engages in the work of our curators and colleagues, as well as enriching the museum’s collection and presentation of the work of contemporary artists.”Prior to joining the Brooklyn Museum, Jacobson was a professor of art history at New York University and was a cofounder of", "The next Biennial should explore the way in which paintings, sculpture, and sound have been rendered new, and will consist of an open-air installation, encompassing installation and performance activities, known as a biennial, in the Museum of Art.\n\n\nThe British artist-run nonprofit Artforum.com has launched a new digital platform dedicated to the work of artists in the United Kingdom. Called FYF Museums, the platform will be hosted by British artist-run nonprofit the Artforum Foundation and will provide users with a simple, yet powerful, interface for discovering and purchasing their work. “Almost every week, Artforum.com will publish a new collection of work by UK-based artists, curated by the British artist-run nonprofit Artforum,” reads a statement from the foundation. “The digital platform will allow the public to access the work of British artists in a comprehensive, easy-to-use way, while also allowing online purchases. A curated list of artists in each exhibition will be displayed in a visual way on the platform; visitors can easily view and purchase the work of the artists they are interested in.”The platform will also include a series of online tours, which will take users through the studio space in which each", "The next Biennial should be the first time the institution will be housed within the city limits of New York. As part of the city’s redevelopment plan, the $1 billion museum will be relocated and will reenter the city’s historical district. The institution will also enter its next iteration with a new space for contemporary art, Artist’s Garden, in the heart of the city, which will be called the Elephant in the Room.The new landscape will be created with a total of eleven thousand square feet of exhibition space that will be organized as a 4,500-square-foot science lab that will host more than 1,000 artists and artifacts, including a large-scale installation by Australian artist Mark Di Stefano. As part of the $3 billion revitalization plan, the museum will begin expanding its collection by adding new works by and opening new locations for its existing exhibits. It will also launch a new digital platform, called the Biennial Hub, that will provide visitors with an online portal to the museum.The centerpiece of the new 10,000-square-foot exhibition hall will be a new giant glass cube that will seat twenty-four artists. Titled “Human Beings” and commemorating the twentieth anniversary", "The next Biennial should be held in 2019. “We are already working on the next wonderful project, a new exhibition of the works of Sara Cohen, Solomon R. Guggenheim, and James Cunliffe, and we will continue to develop and refine our programmes and our exhibitions,” said Gallerani. \n\nThe Art Newspaper has published an exclusive first look at the new exhibition space the Museum of Contemporary Art (MoCA) San Francisco (MCA SF) has conceived and will inaugurate with an exhibition of work by artists such as artist-in-residence Simone Leigh, Kiki Smith, and Ellie Mae Ryan. The event will be co-organized by artist-in-residence Ariana Mendoza and curator James Cunliffe.The inaugural event will take up themes such as “Feminism and Architecture” and will run from June 7 to June 11, 2020, at the sculpture park on Telegraph Hill. The show, titled “People, Architecture, and Architecture” will feature work by contemporary artists Richard Serra, Clement Davis, Leila Hatoum, and JONATHAN MAYCOK.Among the artists", "The next Biennial should begin with a review of the relationship between art and society, with a view to a new kind of political action. A new kind of artistic activity, conceived of as a new kind of capital.”The new edition of the Venice Biennale will be presented by artist-in-residence Jonathan Baldock’s collection at the newly redesigned Venice Museum of Art, which is just north of the city, in March.The exhibition will be curated by Ugo Rondinone, the director of the Fondazione Cinecittà di Sotto, and will feature work by twenty-seven artists. Among the artists selected for the inaugural edition were Adrian Piper, Carlo and Gaspare Marcotti, Paul Gauguin, Virgil Abloh, Ykello Akunyili, Tadao Ando, Gemma Bonucci, Alice Batson, Helga Bonin, Gabriel Bonino, Leonardo Bonucci, Andrea Catellotti, Markus Bacher, Ahmadine Chand, Laura Cammock, Nicolas Carr, Ayman Saleem, Pascal-Olivier Chevalier, Tanya Chedid, Andrea Cerc", "The next Biennial should focus on the intersection of art and activism,” said Mark Lutz, director of the Institute for Advanced Study in the Arts. “The next Biennial will be an exploration of the relationship between art and activism and how this can inform the future of the Art Institute.”In an attempt to contextualize how the institution will handle the influx of refugees, the institution will host an open house on the subject for twenty people. According to the New York Times, the open house will be followed by a discussion on the refugee crisis with the same invitation that has previously been extended to the Dalai Lama.\n\n\nThe Princeton University Art Museum has received a gift of fifty-eight works from the collections of the two most famous New Jersey artists of twentieth century. The works, which were donated by artist Frank Stella and his wife, Helen, were shown at the exhibition “Strawberry Fields” at the museum in 2015 and, since then, have been on display in “Strawberry Fields: Montage and the American Visual Story” (2019).“Strawberry Fields” was the first exhibition organized by the museum in more than thirty years. The show featured works by forty artists, including Peter Sellars", "The next Biennial should take place at the Museum of Modern Art in New York, following a two-week reopening date in March 2021. The 2020 theme is “Patience is a Virtue.” “I’m excited to collaborate with the staff, the artists, and the Central Library to create a platform for radical reflection on what it means to be human,” said Cah. Cah added: “Patience is a Virtue, which is something that I’ve struggled with my entire life. It is something that we can take with us on travel trips and explore in our homes. I have had the privilege of reflecting on the role of the mind in my life through the work of my ancestors, my own ancestors, and through the art that I have created in my own art collection.”The Biennial will take place in the Museum’s new home, a $30 million, 4,700-square-foot facility in the heart of Avon, a former ironworks and steelworks in Bristol, England. The museum, which has a current exhibition of works by artists such as Robert Irwin, Colin Campbell, and Vincent van Gogh that is on view through February 26, will also", "The next Biennial should be in 2021. \n\n\nThe National Museum of the Women’s Suffrage Abolition in Birmingham, England, is planning to remove a bust of American suffragist Gertrude Vanderbilt from its collection. The museum had previously unveiled the work, which celebrates the life and work of the influential American politician, in 2017, and the abolitionist group All4All announced its intent to take the bust down by February 3. In a statement, the museum said: “This is not a moment of celebration; this is an assault on our core values as a free people. The work is a grotesque and shameless attack on the vital and the radical. Its destruction will be a political statement, not only for the abolition of the Confederacy but for the UK as a whole.”The demolition of a Confederate monument in Lee Park in Birmingham is just the latest controversial act by local authorities. Last month, a stone effigy of the southern state senator was beheaded in a city park. In February 2019, the city council removed a bronze effigy of the city’s first black mayor, Ray Mabus, from a public park in Whitechapel.  The campaign to remove controversial monuments has been underway", "The next Biennial should take place in the fall of 2022. \n“The rise and rise of the art of the modern academy,” wrote historian Josette Berges in an essay for Artforum in 2007. “Museum museums and institutions are now more like large cities than people’s homes. They are in constant communication with one another, with visitors, with the surrounding landscape, and with the city. It is this kind of large-scale theater that we wish to emulate.” The United States has long been a major exporter of modern art. In 2011, for instance, the Smithsonian’s Metropolitan Museum of Art in New York produced a show of every work by Pierre-Auguste Alhambari, an American colonialist and early modernist whose sprawling estates included Mauritius and the Solomon Islands. \n\nAs London’s Tate and the Royal Academy of Arts (RA) announced their expansion into a new digital media platform, it has launched its own crowdfunding campaign to help raise the $4.9 million for the ambitious project. The initiative, called Tate Digital, is a collaboration between the Tate, the London-based creative agency Arne Glimcher, and the Richard de Mont", "The next Biennial should be scheduled at the village of Dalli in the commune of Parma, Italy, and will be held from March 11 to March 14, 2020. It will be hosted by the Rome-based firm Arthur Rudolph and will be co-organized by Burri Arti, the museum of modern art in Milan, and the local art school in Venice. The forty-sixth edition of the exhibition will take place in Milan from March 15 to March 17, 2020.The theme for the first edition was the work of Davide Bellini, who is best known for his sculptures, which often feature people or objects from his family tree, the late Italian sculptor Paolo Bellini. Bellini’s work has been exhibited at the Venice Biennale twice, in 2001 and 2006. The design of the village, which has been in the works for thirty years, is inspired by Arnold Barozzi’s famed '24-Hour House,” a large-scale architectural construct in his studio.The exhibition’s inaugural edition in May 2002 featured ten works by twenty-one artists, including Philippe Starck, Yoko Ono, and Markus Schäfer. In 1999, a retrospective of Bellini’", "The next Biennial should be held in 2021. The next edition of the Tunis Design Biennial, which will run from November 28 to March 5, 2022, will be held in 2022. The 2018 edition, “Tunisia in Transition,” was held in February 2018 and was attended by some two hundred thousand people from twenty-six countries. The first edition, “The Future Is Present,” was held in September 2009 and was attended by forty thousand people.\n\n\nLONDON (The Independent) - The British government is considering legislation that would give British media companies greater flexibility in how to handle politically sensitive material such as videos and photographs that depict atrocities, terrorism, and war. The controversial legislation, which is being drafted by Culture Secretary Maria Miller and will be introduced in Parliament on Monday, March 8, would allow the government to license specialized equipment and training to media companies to help them handle sensitive material. Miller said that the legislation would give British media companies “the tools they need to keep the public safe and ensure Britain is best placed in the world to be a global leader in innovation and creativity.”“We need to build on the current system and look to the future,” Miller said. “", "The next Biennial should be held in the spring of 2021.\n\n\n\n\n\n\nKatherine Manley, left, and Amanda Tellington, right, the founders of the contemporary art photography and video exhibition space Center Stage, have been named the 2015 winners of the $50,000 Bessie Baumann Award in recognition of their achievements in promoting photography and photography-related art. The biennial, which honors works in its exhibition “NIRIN” (2019), is the first presented by the show in the United States. Manley and Tellington’s careers have been closely intertwined since their founding of the New York–based nonprofit, Center Stage, in 1989. The duo first launched their eponymous photography and video exhibition space, whose inaugural exhibition, “NIRIN,” was held at the 800-foot-high, seventy-foot-long, and six-story-wide facility in Manhattan’s SoHo neighborhood. Exhibitions, such as “The E-Negative: Photography & Video” (2015), “Photographs by Paul Gauguin” (2008), and “The Photographers” (2013) at the Broad Center for the Arts", "The next Biennial should be the 75th Anniversary of the opening and the first one should be the seventy-fifth, to mark the seventeenth. The twenty-fifth edition of the biennial will be held in the United States, in October. The forty-eighth edition will be held in Zurich in March, and the fifty-fifth in New York in June. The sixty-second edition of the biennial will be held in New York in October, and the seventy-ninth and seventy-ninth editions will be staged in Zurich in September and October, respectively. MUSEums and cultural sites and institutions that are supported by the French Ministry of Culture or the Ministry of Education will also benefit from the $1.2 billion Emmanuel Macron Fund for Culture and Sport. According to French media outlet Le Figaro, the French Ministry of Culture and Sport has allocated $750 million to support French arts and cultural institutions in 2020, and the ministry anticipates an additional $400 million for the French economy in 2022. The fund will also invest in the digitalization of the French arts in order to promote their use in France. The Emmanuel Macron Fund for Culture and Sport will split the $400 million among", "The next Biennial should take place in the spring of 2021, the Roadshow said, and the 2020 edition will be released in June.\n\n\nAmerican photographer Mark Bittman, who fought to preserve the work of other painters in the country by offering them limited, peek-a-boo exhibitions in his studio and by organizing exhibitions that featured works he did not own, has died at age eighty-nine.In a statement, the National Portrait Gallery in London called him a 'fiercely human and penetratingly beautiful' photographer. Born in New York City to Italian immigrants in 1941, Bittman moved to the United States in the 1950s, where he met his wife, Betty, and adopted the name Mark Bittman. After Betty died of cancer in 1985, Bittman began to work. While documenting the emotional landscape of his adopted city, he often found his subjects in the most intimate of settings, engaging in intimate conversations and conversation-starters through photographs, paintings, videos, and all things cinema. His photographs show personal stories and reflect a personal aesthetic vision, as well as a dedication to the photographic medium that was rooted in a commitment to the craft. “When I started photographing in the late ’60s", "The next Biennial should be held in 2022. \n\n\nInternational black metal quartet Feral is leaving the United Kingdom after more than thirty-five years to return to the United States in order to pursue its plans to open a new venue in the city. Feral’s current location in Oxford, where the band currently has its headquarters, is being redeveloped by the Broad, the downtown arts district, and the city of Oxford, in an attempt to attract more visitors to the city. Feral’s new home will be situated in a former dairy and will host the band’s regular shows, workshops, and other programming. It will also boast a restaurant, a bar, and a hotel as part of the Broad’s plan to create a new mixed-use arts and cultural precinct adjacent to the city’s National Theatre. “We are very much looking forward to presenting our performances and our shows at the new Feral Contemporary in Oxford, and to building an international following in the city,” said Feral frontman Ben Howlett. “We know that the city is very much in demand for its arts and culture, and we know that the new Feral Contemporary will deliver the best of", "The next Biennial should be delayed until February, then March, then April, and April should be the month for the show.”The US will become the tenth country to ban the production and sale of all animal products, and the first to ban the consumption of animal products by people. The law, which was passed by a vote of 161 to 0 on Thursday, will go into effect on January 6, 2020 and will provide exemptions for religious groups and institutions with “exceptional circumstances” and for medical purposes. The law does not address the consumption of animals in food, but does address the transportation of animals, and the expulsions will likely commence within months.While the law states that people are not allowed to own or possess any animal and that anyone found owning, possessing, or transporting an animal is punishable by up to five years in prison, the prosecution of David could face up to thirty years in prison and a fine of $250,000. Despite the man’s plea deal, the trial court judge rejected a motion by the defense to have the charges against David dismissed on Thursday.According to the New York Times, the prosecution claims that David avoided prison time by working as a contract driver for a company that provides services to individuals and", "The next Biennial should be held in 2022 at the Stedelijk Museum in Amsterdam.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that it is launching a new $2 million fund dedicated to supporting artists and small to mid-size British arts organizations working in the contemporary art world. The $1.6 million fund will be inaugurated with a biennial, The Granada Collection, that will draw from a pool of eight artists. The award will be presented at the ICA’s annual gala at the Royal Academy of Arts in London on January 18. The fund will help support the careers of twelve artists, including Damien Hirst, John Akomfrah, Yinka Shonibare, Lee Lehr, Tyreseh Minors, and Zulfiqar. Joining the artists in the exhibition are classical musicians Robert Smith, Charlotte Blagdon, Paul McCartney, Sam Smith, and the American singer-songwriter Macklemore.\n\n\nThe National Galleries of Scotland have announced that they will no longer receive funding from the Royal Mail. The announcement means that the Royal Mail will no longer be used to ship artworks to Scotland. Instead, the National Gallery of Scotland will be", "The next Biennial should be the twelfth edition, which will open in 2022.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that it will begin an open-call for projects by emerging and established artists working in the field of digital artworks. The biennial will feature ten artist-in-residence projects each year, starting in 2020, and will run through the 2021–2022 academic year. ICA is one of several British arts institutions that have pushed back the opening of the cultural sector by years to move toward a more flexible, digital-based approach to exhibition-making. The institution has also established a center for arts and culture, the ICA Digital Hub, that helps provide resources for artists working in the digital realm.“As the first major British arts center to embrace the digital revolution, with the launch of the ICA Digital Hub, we are thrilled to see how our artists are using the ICA Digital platform to make new and exciting work in the digital space,” said Paul Mpagi Sepuya, the director of the ICA. “The ICA Digital Arts Centre is a great example of how a digital-first strategy can meet the needs of an increasingly connected world, both for artists", "The next Biennial should be held in February 2020, when the exhibition will attempt to re-create the famous exhibition in the form of a museum. The exhibition will be organized as a group show and will be organized in collaboration with the artists. Commenting on the objectives of the museum, the organizers said: “[We] wish to create a new kind of reading room and a new kind of exhibition space, which will actively engage with the lives and practices of contemporary artists. And, above all, with young artists. We invite them to stay and work with us for some time yet.”\n\n\nThe Museum of Government at Columbia College, New York, has appointed Eric DeGraffenried as its next president. DeGraffenried comes to the institution from the Museum of Modern Art, where he has served as deputy director for nineteen years. He succeeds Andrew W. Mellon, who announced in October that he plans to retire at the end of the year.“I’m very honored to be joining the MGA at this moment in its twenty-six-year history,” DeGraffenried said in a statement. “I’m eager to work with the MGA’s", "The next Biennial should be held at the Pantheon in Rome, a former marble quarry that was transformed into a sixth-century museum in 1924, in 2021.The festival was founded by the Italian architect and architect-historian Silvio Cicutto, who designed the Paris-based architectural studio Grosvenor & Winterthur in collaboration with architect Bernardo Potenza. The exhibition will take place from March 28 to March 29, 2020 at the Pantheon, the prestigious historic theater in the heart of Rome. The exhibition will culminate with a public reception of the work of fifty artists and designers, including Arnaud Desmarais, Birgit Dietmar Ball, Kiyomi Bunemann, Haim Steinbach, and Paul Gauguin\u0097a selection which will be presented on March 29 at the Museum of Modern Art in New York.The museum will stage two more exhibitions of works by the artists chosen this year, one for each of the three zones of Rome, Venice, and Naples. Both shows will be presented in March. The next exhibition will be at the Santa Maria della Scala museum in Rome, which will reopen in March 2020. The BICTA’s ninth edition will be held at the Museo del", "The next Biennial should be held at the bottom of the mountain, in a village of seventy thousand people. The work of artist-collectors like Frederic March and Bénédicte Savoy and the opening of the exhibition “Endless Sea,” in 2019, is considered the landmark work of the master.The upcoming exhibition “Telling Stories: Reframing the Narratives” will take place at the Parrish Art Gallery at the University of the Arts, Mumbai. It will be curated by Aruna Shrivastava and will take up themes of the body and the afterlife. The exhibition will begin with a narrative of the artist’s recent travels to the United States and conclude with a discussion of the artist’s upcoming exhibition, which will feature a performance by the artist and two of his closest collaborators, Harjant and Parlata.The artworld bigwigs are already pledging to support the exhibition, of which two hundred artists are participating. In a letter published on the Biennial’s website, the artists wrote: “We want to express our profound appreciation to the all the artists who have signed this letter. We stand with you in solidarity against the anti-India demonstrations, we", "The next Biennial should be staged in 2022, and the first exhibition to open in the new facility will be “Biafra: The Present,” which will present forty-eight works by forty-five artists, including Mihai Pitt, Yayi Pimentel, Imana Camara, Christo, Lisa-Louise, and Lushi. The Biennial will also include a retrospective of Tobi Weisskopf’s “The Magician and the Thief,” which was originally staged in 1974 but was moved to its fourth iteration in 2007\u0097the biennial’s previous location, the Biafra Art Center, occupied the same space as a former German embassy.\n\n\nMaelbele Saar, the director of the Tisch Museum in New York, announced that the institution will open its first building in the city next month, in 2021, with a preview party for the new venue scheduled for November 21. The museum will also have a permanent collection in the building and will host events and exhibitions there for a period of twelve months. Saar told the New York Times that the institution will be situated in a re-creations of an old factory in the Tisch,", "The next Biennial should be held in 2020 but was postponed because of the pandemic. It will also be held in the form of a performance, rather than a film, and will be organized at different times according to the theme of the year.Participating artists include Pia Camil, Simona Cucchino, and Maria De Nardi.  The competition panel\u0097which comprised Mara Wintory, Diana Gabaldon, and Lydia Jayne’s partner John Jayne Thomas\u0097discussed the possibilities of staging a “nomadic” exhibition, one that would revolve around the artist’s migration from Italy to the Philippines, and accumulate an encyclopedic knowledge of the Philippines culture.“Since the Philippines is a Southeast Asian nation, it is important to know its history, geography, languages, and people\u0097the panelists said that there should be a balance between historical and contemporary interests,” The Guardian reports.The Philippine Film Academy (PFA), founded by director Dwayne B. Bernabeu and producer Tracey Bonilla in 1998, launched a new film competition in 2017. Curated by director Renate Aguir", "The next Biennial should kick off in 2021. The theme for the 2018 iteration of the exhibition was “We Are All In This Together.” The 2019 iteration of the exhibition, which was organized by the Warhol Foundation, was back in March. Other major biennial projects that will be up include “Paleo” (2019), “The Works of Charles and Ray Eames: A Real History” (2019), “Dietrich Reimer: A Wonderful Life” (2019), and “The Museum of Modern Art” (2019).\n\n\nArt museums and archives in New York City and Los Angeles have received a shipment of rare works from the Nazi concentration camp at Auschwitz-Birkenau. The works, which were looted by the Soviets in the summer of 1944, were delivered to the City Museum in Harlem on October 5. Curated by the American curator Dora Lieberman, “The Last Supper: Artifacts from Auschwitz” is a selection of eight works, including three works by Simone Leigh, three by the Italian sculptor Luca Fusi, two by the German painter Jan and a selection of works by other late Holocaust survivors.The exhibition will mark the Museum’s", "The next Biennial should take place in 2021 and the first show in 2022. The panelists for the twenty-fifth edition are as follows: Elizabeth Anderson, Director of the Art Institute of Chicago; Nicholas Calder, curator of contemporary art at the Museum of Modern Art in New York; and Eli Goldin, curator and vice president of the Metropolitan Museum.The 2019 edition, “The Places We Live,” was held at the Museum of Contemporary Art, Houston; the 2001 edition, “The Art of Living Together,” was held at the Museum of Contemporary Art, Houston.\n\n\nThe Museum of Modern Art (MoMA) in New York has become the latest institution to announce that it will begin phasing out fossil-based artworks in an effort to reduce the climate impact of the museum’s collection. The announcement comes on the heels of a slew of other climate-related initiatives, including the reinstallation of the Whitney Museum of American Art’s public sculpture garden in September and the construction of a new, climate-controlled outdoor sculpture garden in the Bronx.MoMA’s announcement follows a statement made by the likes of Berlin-based artist Rineke Dijkstra and the Socialist Party of Italy, which", "The next Biennial should be held in the spring of 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $25 million donation from the Charles and Lucille King Family Foundation. The gift comes on the heels of an announcement that the foundation will provide the museum with an additional $10 million in support of the construction of its new home on Beacon Street. The King Family Foundation also pledged to give $10 million to the arts in support of the construction of its new headquarters on Beacon Street.The gift was made in recognition of the museum’s continued growth and success as a contemporary art museum. The foundation’s board chair, the late chair Robert King, said: “We are thrilled with this gift and with the implications that this means for the museum’s future. We look forward to working with the museum to shape the next Biennial to meet the museum’s unique needs and our vision for the museum.”The donation comes on the heels of an announcement that the museum’s permanent collection will undergo a $150 million restoration. Various works, including works by artists such as William Kentridge, David H. Richard, and Richard Anuszkiewicz, will be moved to the Solomon", "The next Biennial should take place in the spring of 2022.”The campus will also host a project titled “Sustainability in the New Millennium” which will involve the creation of a new exhibition space that will be inaugurated by the restoration of the Christina Ball courtyard. The exhibition will also include installation and installation works by artists from the contemporary art and design worlds.Commenting on the project, Antonio Meijer, Vice President of the Art Museum and Museet, said: “The reason why we are here is to imagine the future. To imagine the future as it really is, not as we wish it to be.”\n\n\nThe museum’s current exhibition “Forbidden Games” (2019) has been moved to the opposite end of the United Kingdom from the exhibition it originally showcased on August 5, 2019. The exhibition, titled “The Future Is Not What We’ve Imagined,” was originally scheduled to run from June 21 to August 23. Its opening was supposed to take place on May 27, 2020. The move was made in the wake of the Covid-19 emergency, which affected all of Britain and the United States. According to Time Out, the 2019 edition of the", "The next Biennial should take place in 2020. “The following year, the Biennial will be in its twelfth year, and its first year, the Biennial will be at the centre of a multi-disciplinary and international community of like-minded curators, artists, researchers, educators, thinkers and activists,” said Diana Abou-Rahme, the director of the Diller Scofidio + Renfro–designed building. The 2019 edition, which ran from September 24 to September 28, featured contributions from more than sixty artists. The 2020 edition will focus on “the extraordinary and the mundane,” Abou-Rahme said. “Through this program, we hope that the Biennial will become the new laboratory for the evolution of art and science, and that it will be a unique platform to engage with and re-create the unexpected.”\n\n\nThe Mpagi Sepuya Museum in Nairobi has announced its representation of the seventeenth edition of the Palais de Tokyo. Winning the prestigious prize for best new international exhibition will be an exhibition that animates the history of modern architecture from the late Middle Ages to the present. It will also be the first time", "The next Biennial should take place in 2021 at the San Francisco Museum of Modern Art. The 2020 event will be held at the Los Angeles County Museum of Art (LACMA) and will offer a follow-up title, “I/C: The New Biennial.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it will begin releasing photos of buildings, sites, and structures in the city that have not yet undergone major renovations. The initiative was established in 2018 as part of Mayor Bill de Blasio’s push to make the city more livable for residents. According to the New York Times, the mayor signed a $3.6 billion bill into law in December of that year to make the city’s buildings more accessible to the public, expand bike and pedestrian corridors, and introduce new safety measures. The city also plans to spend $1.3 billion to repave and rebase over two thousand city-owned buildings over the next twelve years.DCLA chief Mark de Blasio said: “The purpose of the program is to see what we can do to make buildings in our city more welcoming and attractive to residents. We’ve been working with architects, community leaders, and", "The next Biennial should be staged in Paris, in 2021, and the biennial’s theme should be “Reclaiming Art: The International Movement After World War II”\n\nThe International Center, an independent organization that supports the work of emerging and established artists in the United States and Europe, has announced that it is currently closed because of the Covid-19 pandemic. The 2019 edition, “Reclaiming Art: The International Movement,” featured work by twenty-seven artists, including Julie Mehretu, Riccardo Cipolletta, Ashok Chatterjee, Anupam Shrivastava, and Mika Salmela, among many others who were shortlisted for this year’s Pulitzer Prize.“We have spent the past ten years working toward a theme that would reflect the international spirit and community of California and reflect the body politic in a way that was fresh and new,” Joshua Helmer, chair of the institute, told Artnet. “It is the only meaningful theme that will be presented in the event. It will be the theme of the event, and the theme of the event—the theme of the event—will be the event.�", "The next Biennial should be on the island of Mallorca in the Canary Islands, in the Mediterranean Sea and in the Pacific; Madrid, in Spain; and in Hong Kong. The fourth and final Biennial will be on the island of Mindanao in the Philippines and will be staged in the Philippines. Hiroshima is currently staging an exhibition on artificial intelligence and robotics, dubbed 'Artificial Intelligence: Art of Machines, ” at the Sadao Art Museum in Tokyo. The premiere event will take place in February 2020. The show was selected as the 2020 theme by a committee comprising Kenji Fujibayashi, Jiji.com and the editorial board of the Japan Herald.\n\n\nThe Baltimore Museum of Art (BMA) in Maryland, which is currently closed since the Covid-19 pandemic, has released new guidelines for the display of art created during World War II on the institution’s campus. According to the guidelines, “Artistic Expression,” a series of exhibitions organized around themes of war, technology, and the Holocaust, will be restricted to exhibitions that have been open since June 28. The exhibition will also be limited to sixty subjects; photographs and videos will be restricted", "The next Biennial should take place in November 2020 and will aim to present a new analysis of the past as well as a new set of curiosities.\n\n\nThe Metropolitan Museum of Art in New York has announced that it is planning to move the exhibition “The Black Madonna” (2019–20) from its current home in the West 25,000Â\u0097a former textile workspace in the Black Rock Desert of Nevada\u0097to a new location in the city in the next eighteen months. The institution said that the decision to move the show, which explores the complex relationship between artists and the Black Lives Matter movement, came after the museum received a gift of the works from a group of artists known as the Black Mamas Matter.The museum said that the gift includes “Black Betty, ” a painting of a black woman with a white dove, “Black Flowers,” a composition by Carolyn Aitken, and “Black Power,” a work by Nekane Abou-Rahme. “The museum will soon celebrate the work of our artist-in-residence, Kiki Smith, who was a valued member of our community and whose art has been collected and", "The next Biennial should open in the Spring of 2021. \n\n\nThe Metropolitan Museum of Art (the museum) in New York has announced that it is planning to demolish the Metropolitan Museum of Art in its entirety. The dismantling of the institution will take place in phases, with the pieces being moved to the Henry Luce–designed Museum of the City of New York, which will be completed in the spring of 2022.“The Met’s demolition of the museum in its entirety is an ambitious undertaking, but it is possible,” said museum director Timothy Rub, who will remain involved with the institution as its director of photography, art, performance, and design. “It is a daring new phase of our mission, and one that will challenge us to rethink our place in the landscape.”\n\nThe Pérez Art Museum Miami (PAMM) has received a $150,000 donation from Miami-based arts philanthropist and businessman Harald Szeemann. The gift was made in support of an institution that has been actively working to improve its image in the city. “The Pérez Art Museum Miami is a fantastic opportunity to honor the legacy of one of Miami’s most important and accomplished", "The next Biennial should be held in 2020 and the last in 2022. In the meantime, the Doppler Effect in the Southern Hemisphere will continue to shape the year ahead.\n\n\nThe Louvre in Paris has announced that it is planning to invest millions of dollars in restoring its holdings of nineteenth-century master Impressionism, with a particular focus on its art galleries, which are being targeted by a group of preservationists and art historians who want the institution to leave the ­lot to the public.In a statement, the Louvre said that the decision to refocus its efforts on the galleries—which account for about two thirds of its total art holdings—follows a thorough analysis of the collection history and the impact of the exhibition on the public and management of the institution.“We made an enormous investment in the galleries in order to preserve these outstanding works, which are essential to the museum’s cultural and spiritual mission,” said director Marc Straus. “As we moved from the museum’s acquisition to its management, we examined, the works in the collections, the exhibitions, the catalogues, the productions, the performances, the works that traveled with the museum, and the collections of other institutions.”The museum", "The next Biennial should be held in San Francisco in 2022 and will be hosted by the California College of the Arts (CCA). The 2019 edition, titled Art in America, was curated by Dave and Melissa Hoehn. The exhibition, which was organized by the Horseshoe Gallery in New York, showcased new and experimental art, including works by all three of the annual awards winners—Lori Flores, Lorraine O’Grady, and Sean Kelly. The 2018 edition of the exhibition was organized by the Pratt Institute in New York. The 2019 biennial will take up themes of the future and the past and will be staged in Los Angeles, New York, and San Francisco. “I’m incredibly honored to be presenting my Award for Excellence at this year’s Biennial in San Francisco, and to be able to work with such a talented team of curators to create a collection that reflects the spirit of the region and the city I love, ” said Luis Flores, the inaugural winner and curator of the 2020 award. “My award for Excellence will be a tribute to the city of Los Angeles and to the artists I honored throughout their long and distinguished", "The next Biennial should also include a review of the foreign language and arts and cultural activities of the United States to reflect on how they are viewed by foreign audiences and countries.  This year’s exhibition, “This Is Not an Imperial Palace,” was staged at the Smithsonian American Art Museum in Washington, DC, and will be on view until September 16.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has received a gift of seventeen works by artist Briggs West, who passed away in 2005, when the latter was just forty-two years old. Dubbed “The Virtues of Pain” and “The Seven Habits of Highly Effective People” in honor of the artist’s birthday, “The Seven Virtues of Pain” is a selection of paintings that were made during West’s tenure as a self-taught painter. “Briggs West was the perfect painter to collaborate with Michael Christovale on the show ‘The Seven Virtues of Pain’,” said Christovale. “In the end, we found that his paintings were a bridge between Christovale and Briggs, and between the artist and the", "The next Biennial should be held with a view to a new kind of international cooperation: an inter-disciplinary project of research, exhibitions, public events, and education that will take place in an open environment and will be governed by a new constitution. “We are of course deeply indebted to our colleagues in the arts and humanities, who have supported our efforts, and to our patrons, who have demonstrated their confidence in us in the past few years,” said Marc-Olivier Bieneau, president of the Biennale de Lyon. \n\n\nNew York’s Solomon R. Guggenheim Museum and its parent, the Museum of Modern Art, have agreed to sell more than half of their holdings of the late American author and prolific painter Clement Greenberg, who, along with his wife and partner, created a stream of sepia-toned paintings, sculptures, photographs, and prints using bright glow-in-the-dark materials.In an agreement that will be announced tomorrow, the Guggenheim will sell more than three hundred works by Greenberg’s son and daughter-in-law, Mary and David Greenberg, and will distribute the proceeds to the thousands of artists whose works are currently housed in the institution.", "The next Biennial should take place in 2020, and the twenty-third and twenty-eighth will meet in 2022. The exhibition will be held at the Tate in London (21 October–3 November; ten days before the opening of the Biennial in Lyon).\n\n\nThe Frieze Sculpture at the Smithsonian Design Museum (SDM) in Washington, DC, has announced that it is instituting a new set of guidelines and procedures for the placement of all works in its exhibition “The Future Is Now.”Created by the Smithsonian’s Design Center’s design teams, the exhibition will address issues such as sustainability, accessibility, accessibility and accessibility’s impact on the public, and the artistic community, among other issues, and will be on view in the institution until March 24, 2020.“The Future Is Now.” is curated by the curators of the four previous biennials: Paul Graham (2019), Christina Sharpe (2019), Scott Campbell (2018), and Glenn Ligon (2017). The sixth iteration of the show, “The Future Is Now: From Sculpture to History”, opened at the Art Institute of Chicago in 2012 and is currently taking place at the Museum", "The next Biennial should be held a few months after the new year. “We are now in the process of identifying a suitable venue for the 2019 event, and we have already received broad support from the city and county, as well as from the various cultural institutions and individuals, for the effort,” said Leibovici. The museum is planning to create a new exhibition space for the exhibition following the conclusion of the exhibition, “ÜTitania” (2019). The institution also revealed that it plans to open a new twenty-one-thousand-square-foot, artist-designed museum, called the Pavilion, in the city’s central Todi district in November. The pavilion will be a collaboration between the museum and the architect Christopher Wool, who designed the Venice Biennale from 2020 to 2022. The architect’s new public space will be located on the ground floor of the museum, which will offer a vast array of contemporary art and will host a number of other activities.The announcement was made during the eighth edition of the Venice Architecture Biennale, organized by the city of Venice, in partnership with the Fondazione Rodina. The event will also culminate", "The next Biennial should take place at the San Francisco Museum of Art, in 2020. The 2020 edition will comprise ninety works and will be co-curated by Angela Davis, John Gardner, Jodi Throckmorton, and Elizabeth Vasey.\n\n\nThe Contemporary Art Museum Miami (CAMM) has been awarded a $265,000 donation from the estate of John and Grace Griffith’s son, John Griffith III, who was one of the founding members of the Los Angeles–based nonprofit and died in California earlier this year. The gift was made through a ten-year, $100,000 campaign campaign by the Griffiths.“John and Grace Griffiths: The Art of the Future” was initiated in 2011 and is supported by the Griffiths’ estate, and a number of local, state, and federal government officials, including governor Rick Scott, who in 2021 will take over the museum from his father. The campaign is part of the Griffith’s legacy initiative, which aims to promote a more compassionate, environmentally responsible, and nurturing way of thinking about art.“The campaign to preserve and create works of art is a central theme in the Griffiths’ legacy,” said John Griffith.", "The next Biennial should take place in the Netherlands in the first half of 2020.  The first exhibition of the new platform will open in the Netherlands in the second half of 2019.  The second exhibition will open in the Netherlands in the third half of 2018. The third exhibition, which will focus on the works of the late artist Alicja Kohn, will open in the Netherlands in the second half of 2017. The exhibition will be hosted by NINÄV, the National Museum of Modern Art, the Nationalgalerie in St. Petersburg, and the FONZ in the Hague.  The event will be hosted by NIRAT, the International Museum of Photography in New York, and the Museum of Modern Art in Chicago. The seventy-fifth edition of the Tata Prize will be held in New Delhi in the second half of 2020.  The Tata Memorial Art Prize will be held in Mumbai in the third half of 2020. The Telescience Prize will be held at the New Museum in London in April 2020. The Telescience Prize will be held by the National Museum of Modern Art in Mumbai in the third half of 2020. The Tate has appointed Mary Beth Emmons as its", "The next Biennial should focus on the emergence of a new, post-colonial, and post-Marxist theory of art, which will be concerned with the development of modern and contemporary art and its relation to the history of art and the history of ideas.  Juliette de Bruijn’s “Capital” is coming out in a year when art is at the center of so many global ills. Many people are looking to art as a vehicle for social change, but they should also be looking to art as a vehicle for contemporary art to be more participatory and participatory. That’s what I’m trying to achieve.”The inaugural event, “The Scream of Silence,” will be held on September 29 at the Voorhees Gallery in Manchester and will feature works by seventy-seven artists. The main theme is the primal urge to conform. The jury that selected the seventy-seven artists for this year’s edition of the Biennial will announce the winners—which will be announced by September 22—and the artists will be presented with a $500 cash prize. The forty-fifth iteration of the festival will take place at the Deutsches Museum in Berlin in 2020.", "The next Biennial should take place at the National Gallery of Art, in Washington, DC, in 2021. Also not out of the question is for the National Museum of African Art in Atlanta to hold a biennial, and for the Metropolitan Museum of Art to host a number of exhibitions in the years to come. Although the Metropolitan Museum of Art is currently working on a plan to open a new outpost in the city as part of a revitalization of its historic core, the museum has yet to formalize a proposal to the public for a new exhibition. One of the most anticipated exhibitions of the year so far is “The Life and Death of Pablo” by Pablo Picasso, which will open in the city next month. The Spanish artist was a fierce critic of the museum’s Spanish owners, who, in exchange for a small portion of the art, sold the works to the Spanish government in 2018. In response to the controversy, the National Institute of the Visual Arts (Insead) in Madrid purchased the work in 2020 and subsequently passed it onto the Museum of Modern Art (MoMA) in New York in 2019. The museum declined to renew the artist’s contract, and he moved to Mexico City, where", "The next Biennial should address the complex issues of freedom of expression and the plight of the Palestinian people. We stand in solidarity with the Palestinian people, who continue to face an Israeli government that targets them, tortures them, and kills them. We demand an end to this occupation, an end to Israel as an illegal state, and an end to the policy of dispossession and dispossession. We demand an end to Israel’s military aggression against the people of the West Bank and a full and independent investigation into all civilian casualties. We demand an end to Israeli settlement activities in the West Bank and an end to the construction of new illegal structures in the Palestinian territories. We demand an end to racist violence against Palestinians and an end to the siege on Gaza. We demand an end to attacks on freedom of movement, freedom of the press, freedom of assembly, and freedom of religion. We demand an end to discrimination against Palestinians, an end to racist violence, and an end to the Israeli government’s occupation of Palestinian lands.Laudato CrucifiedThe Festival of the Crucified, held annually in Rome, opened today by staging a performance by the Israeli performance group Laudato Crucified. The group’s performance, titled L", "The next Biennial should be held in 2020, and the event’s 20th anniversary should take place in 2021. The next edition of the award, “50 Years of Biennial,” will be held at the New Museum in New York in 2021, and a biennial of the artists who have participated in the event for the past fifty years will take place at the Museum of Modern Art in New York in 2021. The 2020 event will feature a roster of seventy-two artists, including Peter Hujar, Teresa Iarocci, Jann Lisa, Mark Lichtenstein, Laura Owens, Marc Gunter, and Sherif Abu Bakr.\n\n\nThe Museum of Modern Art (MoMA) has announced that it is planning to break ground this fall on a new digital platform dedicated to the works of the late American author and activist René Magritte, who championed LGBTQ rights and championed issues like racial justice, climate justice, and economic equality. The platform, titled the René Magritte Archive (RMA), will include an online catalog of more than eight thousand items from the artist’s archive as well as a comprehensive index of pieces.Created by the artist’s daughter, Trisha Armendariz,", "The next Biennial should be held in January 2021 and will be inaugurated by a new exhibition of works by the artist and his younger colleagues. In the meantime, the museum will continue to present exhibitions with works by the following artists:Max BeckmannMax HetzlerMaximilian HetzlerMaxime FuellnerMaxime GrotheMaxime HetzlerMaxime Hetzler Maximilian Hetzler Maximilian Hetzler Maximilian Hetzler Maximilian HetzlerMaximilian HetzlerMaximilian Hetzler Maximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMaximilian HetzlerMax", "The next Biennial should take place in 2021, to coincide with the opening of the Kunsthalle Basel in Switzerland. For this edition, the museum will open with an exhibition celebrating the twenty-fifth anniversary of the museum. The show will feature works created by a select group of artists, including Ulla and Wolfgang Nothof, whose multi-million-selling series will be accompanied by four children’s books, ÜManifestations of Style,” in collaboration with the Institute of Contemporary Arts in Vienna; and Art in Motion, which will feature photographs by George Gallo and Paul Gauguin, as well as biographies of Heinrich von Karajan and Franz Küntzel. Based in Berlin, the institution will host its first event in the former Russian Federal Central Library in 2022.\n\n\nThe Institute of Contemporary Arts (ICA) in Vienna and the National Museum of Fine Arts (MMFA) in Prague have collaborated on the publication of the first comprehensive descriptions of the two cities, the Institute of Contemporary Arts (ICA) in Vienna and the National Museum of Fine Arts (MMFA), in Prague. The books, edited by Sophie Glahn and Mira Glahn, respectively, will be released", "The next Biennial should take place in the spring of 2021, and will be curated by American artist and professor Amara Darwish.Darwish’s group and individual artists will stage multiple shows, each centered on a different aspect of the work. Darwish’s work, which includes many massive and intricately detailed planetary landscapes, is a delicate blend of geometric and pastoral shapes. Her work is currently on display in the exhibition “Composition 4: Landscapes of the Arabian Peninsula” at the Museum of Modern Art (MoMA) in New York. The work will also be included in “The Waterfront,” a new encyclopedic, three-year exhibition at the Museum of Modern Art.  Darwish’s next publication is a book, The Wind That Shakes the World, which will be published by the University of Chicago Press in June 2020.\n\n\nThe City of London announced today that it intends to sell off more than one hundred artworks by Sir David Adjay, the British artist best known for his monumental public sculptures, including The Futurist’s famous triple helix spirals, 1964, 1977, and The Crying Tree, 1983,", "The next Biennial should take place in the autumn of 2021, and will kick off with a general audience exhibition that will include a selection of works by ten artists selected by the exhibition’s first director, Janette Laverrière, and a project on ethno-linguistic diversity. The new theme will be “The Skin of the Whale” and will include works by artists such as Helène Atget, Ai Weiwei, and Louise Nevelson.“The Skin of the Whale’s upcoming exhibition will be a new sort of ‘skin of the whale’ as the work will be a reconstruction of the life cycle of a beluga whale, the largest remaining living creature in the sea, a living fossil,” said Pia Carotti, artistic director of the Biennale di Pisa and the newly inaugurated exhibition. The work will be exhibited on the Biennale’s website. The €130 million project will focus on the preservation of whale skins in order to protect them from the upcoming global trade in whale parts and oil.The Biennale di Pisa will also include a new program on photography, which will feature photographs by industry professionals such as Pieter Bakels, Henri", "The next Biennial should be held in 2020.\n\n\nThe German city of Essen has placed an ad in the Berlinerische Kuensteakademie (German-language edition of the Kuensteakademie, the German-American literary magazine) on its website for a seventy-five-minute documentary about a group of young women in the city who are committed to a shared vision of the future.The documentary, titled ÜNeue Frauen und die Frauen, ( “On the Future and Truth,” will explore the concept of the  universe and its relationship to human existence. It will be made possible by the creation of an enormous studio in the city center of Essen, which will be transformed into a museum dedicated to the history of art. The museum will also boast an auditorium, a building for educational initiatives, and a library.The city of Essen has raised over one hundred thousand euros to make the ambitious venture a reality. The funds were made possible through a twelve-month campaign in which the Essen-based nonprofit organization FRONTEN, which receives financial support from the city of Essen and the German federal government, launched a series of advertisements criticizing the", "The next Biennial should be held in 2020. \n\n\nThe Metropolitan Museum of Art in New York has announced the opening of a new four-year exhibition dedicated to Robert Rauschenberg and the work of his associates that will take up the themes of the artist’s life and work and will open on October 16. The show will also feature work by artists and collectors who have not previously been included in the show, and will be curated by Caitlin Flanagan.The initiative was inspired by the opening of a new exhibition of works by the artist and his contemporaries in the United Kingdom, the United States, and France. The show, titled “The Future Is Present,” will be staged in two parts. Part 1 will focus on the life and work of the artist and his associates; Part 2 will explore the present and future with the work of selected artists. The show will run until March 15, 2020.Commenting on the initiative, Marc Glimcher, the show’s organizer, said: “When I describe the two halves of the show as one big canvas, I’m referring to the canvas he created in his studio in the early 1950s. The work of artists that has never been touched by him", "The next Biennial should be held in 2020. “The event was born from a collective dream of an architect, of a group of architects, of a series of artists, of a society, a community,” said Vito Cattelan, who organized the inaugural edition in 2003 and was president of the ou.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta announced today that it is reopening to the public in March. The museum, which had been closed since March 15 due to the Covid-19 pandemic, reopens in March with a new exhibition and a new program, which is slated to run until March 29. In a blog post, the institution said that the reopening and “aimed to be a reimagining of the museum in order to inject new life and vitality into an already successful and transformational interior.”In addition to the reopening, the museum is preparing for a major renovation of the building, which is currently undergoing a $300 million facelift. The overhaul will involve the installation of a new glass-enclosed galleries, a new public courtyard, and a redesign of the building’s exterior. The renovation will also include the restoration of the building�", "The next Biennial should focus on the history of the exhibition format and how it connects with contemporary contemporary issues and events, and on the role of the exhibition in the legacy of the Biennale. The new platform, \"Autobiennial: A Retrospective,\" will provide an opportunity to experiment with new artistic platforms and new approaches in an attempt to make the Biennial as relevant as it possibly can.\n\n\nThe Jessica Alba-directed biopic The Bad (2018–19) opened in New York City on Saturday, December 16, and in Los Angeles on Sunday, December 17. The film, which follows the life and death of Pablo Picasso and recounts his struggle to erase his work from the public record, was commissioned by Alba and her husband, writer-director Rob Marshall. The film will open in the newly renovated Barbican Center in London on November 14.“We couldn’t have chosen a better partner to elevate our vision of the Barbican for our upcoming biennial in 2021,” said Alba, who is currently working on a new portrait of Picasso. “It’s no wonder that Pablo Picasso is so much more than a great artist; his legacy lives on in every one of us.", "The next Biennial should coincide with the opening of the new exhibition, “The Future Is Present,” curated by Marko Kloos. The show will showcase work by sixty artists in all countries of the world, including Austria, Brazil, China, Croatia, Germany, Italy, and the Netherlands.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has created two new positions: one for a curator and one for a curator of the modern and contemporary art. Juliette Antunes, who joined the museum in 2017, will become the museum’s founding curator of the modern and contemporary art, and a curator of the modern and contemporary art of the Americas.Antunes will be based at the museum in Harlem, New York. Its next exhibition, “From the West: The Americas in Art,” will open on April 22 and the show will feature work by forty-seven artists. The next exhibition, “The Diaspora: Stories,” will showcase the work of thirty-four artists.The other show, “Jonas and Jessica Alves,” will open on April 22 and will be on view until April 25. Alves is currently organizing the first exhibition at the museum", "The next Biennial should be held in 2020, but the organizers of the event say that they will evaluate the possibility of taking it forward if the government of Singapore approves their request to extend the deadline by 180 days. When asked about whether they would consider postponing the event if the government disapproved of their request, the organizers said: “We will evaluate the situation and respond accordingly.”\n\n\nVice President Leni Robredo is planning to release around one hundred artworks and more than 250 objects confiscated from suspected drug lords in the January 26 mass arrest, detention, and repatriation (BUM) operation, which has been called a “showdown” between the Philippine and Malaysian governments. The exhibition is part of the government’s pledge to return over 3,600 cultural artifacts that were either lost or destroyed during the campaign against illegal drugs.Robredo told the Philippine Daily Inquirer that the artifacts would be released in different ways, including as display pieces designed to be placed in training camps or given to local organizations that would rehabilitate the seized objects and organize exhibitions about them.Art historian and curator Rita Otero, who organized the exhibition, suggested that the works’ release be staggered across the three countries, because the government", "The next Biennial should take place in the spring of 2022. Its inaugural exhibition, “The Art of Life,” will include works by artists such as Yoko Ono, Tia Bonetti, and Mondrian. Its second edition, “Away from home,” will present works by local and international artists including Henning Strache, Tomi-Leor Ilić, and Mark A. Hatfield. The exhibition is part of the Biennial Project, an initiative supported by the Kipf Foundation in support of the restoration and conservation of European art. “We are very pleased that the Kipf Foundation has committed to support and preserve the work of the exhibition designers who have made a vital contribution to the Biennial Project since its inception in 2014,” said Christopher Kappe, director and chief curator at the MCA. “These artists have created works that are highly visible in their chosen mediums\u0097but they have also created works that transcend their mediums. The Kipf Foundation is honored to receive this rare gift from the Kipf Foundation.”\n\n\nThe Carolina Herrera-designed home of the Charles Walk, which offers a unique, if not altogether different perspective from the", "The next Biennial should be open by December 2020, and the first by March 2021. \n\n\nThe Museum of Modern Art (MoMA) in New York is planning to move the knockout fights between light heavyweight champion Daniel Cormier and longtime title challenger Anthony Johnson to May 30, 2020, in order to make way for the construction of a larger building that will house the many exhibitions that will take up the full breadth of the museum’s footprint. The announcement coincides with the opening of “Unstoppable,” an exhibition that depicts the history of the sport of mixed martial arts, with a special focus on the UFC, whose storied history spans nearly two hundred years.The exhibition will include the construction of a new ninety-seat arena that will boast a new, elevated entrance and will be inaugurated by a contest between Cormier and Johnson. The fight will take place at MoMA’s new home on East Seventy-Third Street, in the heart of Manhattan, on May 28.The news follows several months of speculation that the institution would move the fights, which have taken place at multiple venues, from the former site of the General Electric building at Forty-Third Street and Eighth Avenue in Manhattan to a new home in the city�", "The next Biennial should comprise the following:* A review of the work of the artists involved; (e) A survey of the exhibition; and (f) An exhibition of the work of the artist(s) who have contributed to the exhibition while at the same time maintaining their aesthetic integrity. The exhibition will be organized as follows: Theater (s) that are currently exhibiting the work in question. The work is currently exhibited in the following locations:Artists Residence at the University of Muş: The exhibition is currently on view at the Pacha Art Museum in Istanbul and the remainder of the month of March is scheduled to open at the Poser Museum in Istanbul.“The exhibition is not a biennial, but a series of projects that will engage with the collective practice of the artists from Turkey’s modern era, which is deeply rooted in history,” said Miranda Hutton, director of Frieze London. “It is a new way of approaching the works in question and our intention is to use the art of the seventeenth century as a source of inspiration for the exhibition.”\n\n\nThe Melbourne-based artist and educator, who teaches at the University of Melbourne’s Arts and Lectures", "The next Biennial should take place in 2020.  **********\n\n\nThe Museum of Contemporary Art (MoCA), the Museum of Modern Art (MoMA), and the Metropolitan Museum of Art are offering to donate more than 120 artworks to the Los Angeles County Museum of Art (LACMA) in an effort to promote the museum’s collection in an effort to preserve and promote the works of the late Los Angeles–based artist Kiki Smith, who passed away of natural causes on December 24, 2016.Smith, a self-taught artist whose work spans photography, video, sculpture, and performance, was a prolific creator of experimental art that explores the relationship between photography and the visual arts. Influenced by Japanese art and architecture, Smith created works that explore the inherent rhythms of light and its relationship with the environment, including “Sensations of darkness” (1987), a series of photographic prints that depict post-industrial landscapes, and “Daydreaming of a Dreamland” (1988), a series of \"Dreamscapes\" that take the form of photogrammetry (or photorealism) installations that combine photographs, film, video, and installation, and reflect Smith’s own experiences, including a dream", "The next Biennial should be held in 2020. \n\nA joint project of the Association of British Architects (ABAI), the Institute of Contemporary Arts (ICA), the National Art Museum (Nama), and the Gates Foundation has released a new fact card on the future of architecture and design after Brexit.“We must think of the future not only through the present, but also in the future as a timeline,” said John Giddens, director of the Institute of Contemporary Arts. “This means that we need to think very carefully about the architecture of the future as well as the architecture of the past.”The 2020 edition of the biennial will open in London, on November 23, 2020. The show will explore how architecture and design is changing, and will be comprised of more than sixty artists, including Adriana Abidi, Marion Berenguer, Cécile Blondel, and Nomenclature Workshop, which will showcase the work of twenty-eight artists in an attempt to bring more attention and discussion to the subject.The 2020 exhibition will mark the centenary of the debut of the German artist Lutz Bacher’s monumental, unified, and open-ended Constructivism, which", "The next Biennial should be held in the autumn of 2021. “The future of the exhibition is at risk,” said Milan-based curator Patrizia Cattelan, who has organized numerous editions of the show over the years, including “SIDE by Peter Andre,” which opened at the Museo d’Arte Contemporanea in Milan in 2006, and “Arts of the Americas” (2010) at the Museo de Arte de São Paulo, Brazil, which was staged in the United States. He added: “In order to prevent a repetition of the uncivilized, destructive practices that took place in the War of the Worlds. We may be able to prevent the banking crisis. But we cannot prevent the biases, the injustices, the horrors that the exhibition perpetuates.”\n\n\nThe House of Commons Library and Archives (HAL) has released new digitized images of some 3,500 artefacts from the 1911–1913 influenza pandemic, including some 5,500 photographs from the United States, Canada, Mexico, and the United Kingdom. The images were made using data from the National Health Service (NHS), the National", "The next Biennial should take place in 2019. \n\nIn February 2019, Japan announced that it would suspend all public gatherings and public activities until the end of the year. The country’s Cabinet Office issued a statement saying that the decision was made to protect the health of the people and to protect the “cultural and natural environment” of the country. The statement continued: In line with the new climate agreement, Tokyo Municipality Council has decided to implement a “comprehensive anti-pollution strategy.” According to the Japan Times, as of April 4, Japan had cut its greenhouse gas emissions by 18 percent since 2020, and that pollution-mitigation goals had been met by March 31. \n\nAs global health officials around the world continue to call for a swift and massive reduction in the harmful effects of the coronavirus, which was first identified in 1976 and declared a global public health emergency by the World Health Organization (WHO), the United States is stepping up its production and deployment of protective equipment. On Wednesday, the Department of Homeland Security released guidelines for states on how to prepare for an outbreak of the virus, which has already killed more than 7,000 people in the United States and has been confirmed in", "The next Biennial should be held in January 2021, with the exhibition marking the eightieth anniversary of the institution\u0097Popular Science’s 20th anniversary. \n\n\nFor the first time, the International Council of Museums (ICOM), an independent, nonprofit organization responsible for recognizing and protecting the work of contemporary and historic artists in the Americas, has declared war on a single institution: the Museum of Modern Art (MoMA). Many cultural institutions and scholars have denounced ICOM’s stance as an attack on free expression. It is now seeking the resignation of institution director Robert Giard, who said that ICOM is eroding the museum’s independence by refusing to rescind a 2017 contract extension for Giard and that the move was made in order to advance “a very particular political vision of America that is antithetical to our mission.” The Museum of Modern Art director Max Hollein described the new policy as “an attack on our values as an institution, an attack on our mission.”It is unclear whether ICE will follow through on its threat to permanently close the institution, which has been closed since March 13, or whether it will attempt to hold a public hearing to address the two", "The next Biennial should take place in the autumn of 2022.In an interview with the New York Times, the biennial’s director, Adam D. Weinberg, praised the 'deep understanding of the art and architecture of the Midwest and its global impact, as well as the breadth of our audience.” He also said that the show will have a “flexible format—a voice that reflects the spirit of the times.” \n\n\nThe Institute of Contemporary Art (ICA), Shanghai, has appointed Hao Tao as its next director. Tao was appointed in the first round of appointments by a newly formed board of directors comprising Ikuo Ochia, the former director of the exhibition space Wuhan; Yi Wang, the current director of the exhibition space London is Burning; and Hong Kong–based artist Jin Hsu. Ochia was selected for his expertise in contemporary art and his contributions to the ICA’s global program, which includes the Shanghai Biennial, the 75th Shanghai International Film Festival, and the ICA Shanghai.After Wang was chosen for his experience, his nomination was shared by Ming Wai-Fai, the chair of the board of trustees,", "The next Biennial should take place in 2021, and the full list of participating artists can be found here.\n\n\nThe Palazzo Grassi in Venice, Italy, is planning to shutter its doors permanently in March 2021 owing to a lack of funds, reports Tuttagraph. Titled “Theatre of Limits” and hosted by the city in collaboration with the conservator Giorgio Tavecchio, the twenty-second edition of the Venice Biennale will be held in February 2022.The exhibition, which was coorganized by the Palazzo Grassi as well as Palazzo Sant'Anna, features forty works by fifty-six artists and will run from March 22 to March 26, 2022. The first show of the show will be “The ocean of hairs” by Simone Leigh, which will be on view until March 20. The second show, “The room of mirrors” by Melissa Brunetti, will be on view until March 17. In addition to Leigh and Brunetti, the exhibition is curated by Pieta Bicchieri, Silvia Bicchieri, and Sara Cwynar.The new edition will be organized as follows: “Theatre of Limits", "The next Biennial should take place in 2022.\n\n\nThe National Museum of Medieval Art (New York) has appointed Kevin McAllister as its next director. The forty-two-year veteran curator, who has served in the role since 2015, will assume his post in September. He succeeds Christopher Wool, who departed in the summer of 2019 to join the Metropolitan Museum of Art in New York.“Kevin brings a wealth of experience to the museum to build on the foundation established by Christopher Wool, and I’m looking forward to working with him,” said Mary Anne Carter, the institution’s interim director and chief curator. “The National Museum of Medieval Art, like all museums, has been and will be impacted by the coronavirus. Watching the decline of the medieval art world and art from Northern Europe is heartbreaking, and I’m eager to help turn the institution around.”  \n\n\nThe Baltimore Museum of Art (BMA) has received a gift of more than five hundred works by fifteen artists whose works were donated by the museum’s collection. The gift includes a variety of works dating back to the seventeenth century and includes a selection of works by Pierre-Auguste-Louis Bonnard,", "The next Biennial should be held in the spring of 2020. The full list of participating artists is as follows:ArtistsAristinthe Pang, Hong KongTheatersBeverley Mako, TokyoSelf-taught by Annikki Laudel, TokyoTheatreJean-Michel Angelo, ParisBessie Arsenault, New YorkMaureen Black, New YorkAristoteles Carpentier, ParisCaroline Biscuit, New YorkDavid Christopher, New YorkKimberly Cohen, New YorkPatricia Chen, New YorkArtistsCheryl Lee, New YorkArtists with Children & Young People, New YorkArtists with Children & Young Women, New YorkArtists with Children & Young Men, New YorkArtists with Children & Young Women, New YorkArtists at Large, New YorkArtists at Large, New YorkArtists at Large, New YorkSarah Leigh, New YorkArtists in the Studio (SIT), New YorkFrank H. Hughes, New YorkArtists in the Studio (SIT), New YorkArtists in the Studio (SIT), New YorkArtists in the Studio (SIT), New YorkArtists at Large, New YorkBessie Arsen", "The next Biennial should focus on how the museum can become a more welcoming and engaging space for the city’s creative and academic communities, while still supporting a wide array of exhibitions and collections that are dedicated to the expositions. The announcement follows the Biennial Basel in Switzerland, which was held at the grounds of the Museum of Modern Art in New York from January 18 to January 21, and the Biennial Deutschland from January 28 to February 8. Other major international art fairs scheduled this year include Art Basel in Munich, Art Dubai, Art Dubai New York, Art Dubai LA, and the Art Dubai NY fair.\n\n\nIn an effort to improve accessibility in Los Angeles’s Chinatown, the city council voted yesterday to extend the hours of five of the city’s six major tourist attractions, including the Los Angeles County Museum of Art (LACMA), the Museum of Modern Art, and the SculptureCenter. It also passed a $5.2 billion transportation package that will provide funding for the expansion of the 405 Freeway, the revitalization of the Santa Barbara River, and the construction of a new airport.“The times we live in are not conducive to the kind of active and interactive experiences our", "The next Biennial should focus on the connection between art and the digital. The event will also highlight how the digital community has become a critical platform for the Art Institute of Chicago and the Midwest. The theme of the new biennial is Art and the Web, and how art can expand and change our lives through the digital medium. Currently, the Biennial is focusing on the history of photography, visual art, and performance, but the new program will explore the history of the web and the digital realm. Chaired by artist-in-residence Nancy Panzo, the biennial will aim to present a new narrative of the history of photography and its relationship to photography’s other bodies of work, including photography and the web, photography and the visual arts, and photography and art. It will also highlight the cultural significance of sites and individuals that have become key sites for digital experimentation.Panzo, who first assembled the group on the West Coast in 2004, told Artnet, “I’ve been creating the exhibition series with the vision to present an exhibition unlike any other: it will be a celebration of photography’s twenty-fifth anniversary. Each exhibition will feature thirty photographs by artists who have lived or worked on the", "The next Biennial should take place in 2021, and the 2020 edition will be held at the new home of the Autonomous Biennials in the city of Getúlio, in Piedras Negras, Brazil. The 2019 and 2020 editions of the exhibition were staged in the New Arthouse in New York, and the 2019 and 2020 editions of the show were hosted at the newly renovated Henry Luce Gallery in West Hollywood.“We are pleased to be able to continue the work of our predecessors in creating a new exhibition dedicated to these curators,” said David Green, the director of Frieze. The next Biennial will be on view from March 16 to March 21, 2021.\n\n\nThe Museum of the City of New York (MoCA) has unveiled its new master plans for its new, $1.3 billion arts complex in Hudson Yards, Brooklyn, which opened to the public on Tuesday, March 13. Designed by Gensler & Loveless, the new museum is part of the $8 billion $2 trillion overhaul of the neighborhood, which will also include the construction of a library, a Children’s Museum, and the installation of more than 2,000 works—the centerpiece of which will be the", "The next Biennial should be held in 2022.  We look forward to the museum’s participation in the next iteration of the festival.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has launched a $1 million fund to assist artists whose livelihoods have been negatively affected by Covid-19. The fund will distribute $1 million to between artist and museum. The recipients will be chosen by a board of directors chaired by David Ganson and David Rubenstein. Museum director Marc Glimcher said: “As a museum we have been working hard to develop a strategy to reduce the impact of Covid-19, and we have had significant success. Our art collection is highly curated and biennial programs are a critical way for our artists to understand and experience the work of our archiv, to have their work presented in a meaningful way. We are confident that this year’s edition, ‘The Number of the Beast,’ will continue to be a transformative experience for our artists and our audiences.”The fund will be administered by the organization the Metropolitan Museum of Art, through a $1 million grant program established in 2018. The grant program is one of several efforts made", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed Stephanie Robichaux as its next director and CEO. She will be responsible for leading the museum through the reopening of its California College of the Arts (CCA) campus in March 2022, and for developing and executing programming to support the institution’s growing collection as it continues to expand the reach of its art-world footprint.Robichaux will take the helm from David Kordansky, who retired last month after more than twenty-five years at the helm of the museum. Kordansky will continue to serve as interim director until a successor is appointed.“Stephanie has built a strong reputation throughout her sixteen-year tenure at the museum as a visionary leader whose vision and energy aligns with the vision of the institution,” said John Graham, senior director of MoCA and chair of the board of trustees. “We are grateful for the service she has rendered to the institution and to MoCA. We are confident she will continue to achieve the remarkable things that will serve as a model for our museum leadership.”Since its opening in 1994, the museum has grown from a campus-wide arts complex", "The next Biennial should not be a festival but a time of reflection and creation. I want to create new narratives. I want to create new narratives through the use of the art and through the content of this exhibition.”The show’s program is curated by Maria Bocotova, the curator of contemporary art at the Museu de Arte de São Paulo, Brazil; Emmanuel Ghebaly, the curator of modern art at the Museu de Arte de São Paulo; and Gabriella Fernández, the director of Fela Kuti. The winners will be announced on March 24 and will be presented at the show’s fifth edition, which will take place in the city of São Paulo, in October.\n\n\nThe Tate has announced that the institution is preparing to open a new five-year $106 million arts and heritage complex in the city of Manchester, England, in June 2020. The new 107,000-square-foot venue will be designed by the world-renowned architect Foster + Partners and will boast a theatre, a café, and a ground-floor retail space.“Tate is delighted to open the next iteration of Tate’s arts and heritage", "The next Biennial should be held at the same venue, in the same year, and under the same artistic director. While the organizers are yet to determine a date for the first show, the organizers will continue to work with artists, including Marcel Prouvé, to understand the best possible dates. \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of twenty-three works by the internationally acclaimed French painter Georges Apostène. The donation was made by the French art historian and Valentin Menaét (1908–1988) in recognition of her achievements in the field of painting. The works, in addition to the three featured in this exhibition, were selected from a group of works that were presented in LACMA’s exhibition “Ateliers d’Arles” (2017–18), “Away from LACMA’s Walls: The Black Box,” and “Ateliers d’Arles 2: The Black Box.”In addition to the three works on canvas, the museum also acquired twenty-two works by the Paris-based artist Pierre-Auguste Renoir. The works, which were presented in the museum", "The next Biennial should be held sometime in the second half of 2019.” In a statement provided to Artforum, the MCA said: “While we remain committed to a series of shows devoted to the history of contemporary art, in the context of a wider global context, we recognize that this will appear to be an unusual year for the field.”\n\n\nThe Sculpture Center in New York has announced that it is negotiating with the Metropolitan Museum of Art (MoMA) to return a marble sculpture by Pablo Picasso to the institution, which has a long-standing relationship with the artist. The square work, which was painted in a clear acrylic medium and originally installed in the lobby of the museum in 1958, has been in storage since 2014.Since the sculpture is a monument to Picasso’s double-decker Le Corbusier-designed apartment in Tribeca, where the artist lived and worked for nearly twenty years, it has long been on display in the museum’s collection, but its permanent return is now being promoted. The announcement marks the first time the work has been brought to the United States for public display.The sculpture, titled What Is Life?, was transported to the Metropolitan Museum on November 29, 2018", "The next Biennial should be held in 2020.\n\n\nThe São Paulo Biennale’s organizers have announced that the exhibition will move to a new venue. The announcement comes two weeks after the exhibition was originally scheduled to reopen in São Paulo on November 2, 2020.The move was made in order to protect the São Paulo Biennale’s programming, including the exhibition “Phantom of the Opera: From Theory to Experience” and the program of readings and presentations, “Art and the Body” which will be presented by Santiago Piatti, Lydia Karlan, and Oscar Miro.The event will now be hosted at the Museo da Museo do Rio, the same venue from which it will open in 2021. The new date is also coincidental, organizers said, as it is always nine months between the years of the events of the annual exhibition and the beginning of the exhibition. The exhibition will be officially inaugurated by Eddie Izzard, the director of the Tate in London, on September 22, 2020. The programme of readings and presentations, which will focus on ideas such as the body and the environment, was originally scheduled for September 23–September 26.", "The next Biennial should take place in 2021, and the first in 2022. \n\nThe Museum of Contemporary Art Japan (MCAJ) has announced that it will open a new exhibition of works from the museum’s collection at the Tokyo Metropolitan Government building in the spring of 2021. Titled “We Are All in Love,” the exhibition will showcase the works of seventy-three artists. The first showpiece of the new exhibition will be an exhibition of work by the acclaimed artist Rina Banerjee (1908–1987). In addition to the artist’s usual output, the gallery will host a new exhibition of work by the sculptor Susan Kawakami (1907–1984) and a show of work by the late Indian artist V.S. Ramanujan (1902–1975), among other artists.Inaugurating the show will be a presentation of works by the late artist and teacher Shinichiro Nara (1905–1974), a series of interviews with the great Japanese art historian Tadao Ando, and a presentation of a selection of photographs by the distinguished Japanese photographer Kiyoshi Yasuda, among many others.Nara’s photographs, which often feature photographs of his", "The next Biennial should have been held in 2020, but due to the virus, it was postponed. The first exhibition is slated for the end of March. The exhibition, titled “2016: The Year of the Biennial,” will be hosted by the National Gallery of Art and the San Francisco Museum of Modern Art. The exhibition will also focus on the legacy of the biennial and will feature original works that will be presented in the new exhibition.\n\n\nThe Metropolitan Museum of Art in New York has launched a new fundraising initiative that will provide financial relief for artists, arts organizations, and small businesses in the city. “The Met is working with over three hundred organizations across the city to combat the coronavirus,” said Adam Dusenberry, the museum’s senior director of external affairs. “The program has worked for some time to help individuals and small businesses in need through grants, but now its time to help the city’s creative ecosystem through direct grants. Many of these organizations work in clusters, which are difficult for companies to organize and organize-out. This new initiative will allow them to collaborate and share information about working together, which will be especially helpful to small businesses that have few", "The next Biennial should have been held in 2018, but was postponed due to the Covid-19 pandemic. The fourth biennial, which was set to begin in March 2019, was moved to April 2020.The largest museum in the Dutch city of Utrecht—which is located in the Greenbelt, a greenbelt encompassing most of the city and surrounding areas—is currently undergoing a $65 million expansion. The new buildings, which are being constructed by a consortium led by Bergamo & Bevers, will provide more than 1,500,000 square feet of exhibition space for contemporary art. The project also involves the renovation of the building as a public space, a new café, and an outdoor terrace.The project, which is part of the Utrecht District Council plan, was inspired by the city’s former civic hall, the building of which was the subject of a 2015 exhibition, “The Future of the City,” organised by the Rotterdam-based firm MCH Group. Designed by the firm Skidmore, Owings & Merrill, the exhibition was inspired by the current state of the city, which was undergoing a massive €150m renovation. The work will be exhibited at the Utrecht", "The next Biennial should begin hosting exhibitions in February 2020. “Live music and visual arts have always been at the core of Biennial,” said José de la Madrid, the president of the biennial. “What we are seeing now is the beginning of a new stage of Biennial, which is to make the future of art and culture more connected and interactive, with a special focus on the most important contemporary artists, whose work profoundly engages our senses and our hearts. What we are witnessing, surely, is the beginning of a new era.”\n\n\nThe National Gallery in London is planning to increase the pay of its top executives by 5,000 pounds by introducing two new tax-free bonuses. The move is part of a package that will raise £45 million for the museum this year. It also includes a capital campaign for the institution and a new exhibition, “The Future is Present,” that will showcase the work of contemporary artists.The initiative was announced in a letter sent to staff by director Hamish Anderson on December 2. In the letter, the director wrote:“We know that many of you are feeling pressure to make the most of the forthcoming years. And we know that there is much more", "The next Biennial should be held within six years. The announcement of the 2020 edition comes on the heels of a flurry of recent celebrations, including the publication of the inaugural issue of the biennial’s biennial section, “Theater of Operations,” and the exhibition “Unseen: Art’s Struggle with War, 1937–1941” at the Institute of Contemporary Art in Palmaros, California.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has unveiled the first public artwork created by renowned artist Michael Humphreys, a celebrated Soviet sculptor who often used his body and ephemeral materials such as glass, metal, and paper to transform everyday objects. The show, titled “Odd Volumes,” will debut in the artist’s first solo show in the United States since 1955.“Michael Humphreys’s work allows us to finally observe the human body, to see its extraordinary capacity for self-assembly and to imagine what it might look like in its limited range of natural materials,” said John Ryan, director and CEO of MoA. “This is a rare opportunity to see a single piece made by him\u0097the first work of his", "The next Biennial should be held in 2020.Artforum has reached out to the Chicago Museum of Art for comment.\n\n\nThe Nobel Prize in Literature is extending its support of artists worldwide through its Award for Arts and Letters, which was announced on Thursday. The prize for William Shakespeare is also up for grabs, with the ceremony slated to take place at the London School of Economics in September. The Nobel, which was awarded in honor of the late British novelist and playwright Ken Russell, will be presented in September 2020.The award was established in 1970 by British Prime Minister Margaret Thatcher in recognition of the great achievements of British literature, including Jackie, Turning, and the Great Gatsby. Its theme this year was the 'gift of the poet.” The previous year, a team led by the Nobel committee curated a selection of poems by the late American novelist Robert Irwin.Inaugurating the prize was the Gatsby Prize for Literature, which was established in honor of David Garrick, whose 2017 novel The Strangers championed the work of the late American novelist Robert Irwin. The prize also honored Nancy Walton, the widow of the late American novelist and playwright Philip L", "The next Biennial should be held at the Magnuson Institute in London. A ceremony would take place at the institute in May 2020. The 2019 edition, “The Openings,” was held at the Centre Pompidou in Paris.\n\n\nDIDIER ENTERPRISES, the London-based art development company run by artist Richard Dreyfuss, has received a $2.5 million donation from the Nadine Grant Foundation to its board of directors. The grant, which was established in 2018 with the goal of supporting the creative and cultural sector, has made the company the beneficiary of an additional $500,000 from the foundation for its London-based headquarters in London, where it has been located since 2018. The foundation’s board of directors approved the additional funding in a resolution voted on by director Rachel Grant last week.According to the foundation, the donation will enable Dreyfuss to expand the scope of its programs in the United Kingdom and the United States, which has been expanding in recent years, and will enable the company to further develop its network of collaborators in the arts. The foundation’s board also noted that the gift will allow it to “continue to innovate and build the network of support", "The next Biennial should launch in 2020, with a launch date of 2021. The Art Newspaper reports that the exhibition will be hosted at the site of the former Maastricht Airport, a former Dutch colony located near the Antwerp-Brussels border. The biennial (currently called the Art of the Contemporary) will feature a diverse collection of works by twenty-one artists and will feature the works of twenty-nine artists from twelve countries.The exhibition’s inaugural edition was held at the Amsterdam Gallery and the Amsterdam Biennale in 2019 and will be held at the Deurop Museum (formerly the Deurle Museum) in Amsterdam until 2020. \n\n\nThe Art Newspaper reports that the first edition of the Venice Biennale (VBO) will be held at the Venice Art Museum in Venice between March and May. The theme of the exhibition will be “Theological Tourism: Themes of Travel,” a project that combines traveling and the Christian church. The exhibition will feature more than 300 works from the collection of the influential Italian director Stefano Sarto, a former curator of contemporary art and architecture, and will feature music, sculpture, dance, films, and other works by some fifty artists", "The next Biennial should be held in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York is going back to the drawing board with a new design for its new headquarters, which will include a glass-enclosed lobby, gallery, and bookstore. It is also planning to open a new institution, the Tisch Museum of Art, in the near future.Located on a four-acre campus in midtown Manhattan, the new outpost will host a variety of programming, including a quarterly exhibition of work by poets, a symposium on contemporary art, and the first-ever biennial of new American photography. MoMA’s operations will also be relocated to a new 160,000-square-foot, 4,000-square-foot warehouse. Its current headquarters are in Greenwich, Connecticut, and the museum has been seeking a new location for the institution for more than a year.The redesign will be inspired by the glass-enclosed lobby of MoMA’s new headquarters, which will be located below the M&T Bank Pavilion, and will incorporate a new glass-enclosed lobby bar, a new museum, and a new café. The glass lobby will be positioned on the third floor of a former steel factory in the", "The next Biennial should be held in 2021. Should the event be canceled due to the coronavirus, the venue will be closed until March 23, 2021. \n\n\nThe British Museum has announced that it plans to let the daily circulation of the exhibition go into “shutdown” starting on January 27, 2020, after it expanded the festival’s scope to include several new exhibitions. The move follows the announcement that the museum would hold a new exhibition on the life and work of Michelangelo Antonioni, as well as an expansion of its collection headed by British artist Peter Wollen.“We have undertaken a number of changes in the coming months to strengthen the exhibition, with the aim of avoiding a disruption to the activities of the museum, and to do this in a way that maximizes the Museum’s artistic potential,” British Museum director Maria Balshaw said in a statement. “The future of the exhibition is far too important to be left in the hands of a single individual, let alone to a potential disruption to the exhibition.”The museum made the announcement about three weeks after it opened its new exhibition, “The Art of the Unseen,” on January 18, 2020", "The next Biennial should be held in 2020.\n\n\nArtist-run spaces in London are appealing to the government to act to protect the cultural sector amid a projected economic slowdown, the Art Newspaper reports. Performing arts spaces Artiras and the Tuttles, which have been struggling since the Covid-19 pandemic began, are proposing that the government divert $26 million from the Consolidated Fund for Arts to help them through this downturn. Both spots have already raised $10 million in the first three months of the pandemic.“The artists’ plea is simple: the Consolidated Fund should be reallocated to help the artistic sector,” said Julia Clarke, Artiras’s executive director. “Without the artists’ help, no budget for the arts needs to be made. Without the artists’ help, no arts commissioner, no arts board, no arts trustees, and no arts patron. Without the artists’ help, the cultural fabric of London does not survive.”The two organizations are not alone in their efforts to draw attention to the cultural sector during this severe economic time. Artists United UK, the Association of Visual Artists, and the National Poetry and Drama Writers’", "The next Biennial should be held in 2020 and will be presented by Los Angeles’s SALT Contemporary Art Institute. \n\nAmerican painter John Giorno—who was one of the first to embrace abstraction’s urban landscape and the contours of cities in his paintings—was found dead in his apartment on September 3. He was forty-six years old. Giorno’s artworks were based largely on his theory of urbanism, an urbanism in which cities were central to the life and thought experiences of urbanites. His paintings—which often depict a cityscape, Los Angeles, in a given day—were inspired by his experiences in New York, where he studied at the Institute of Design at Columbia University, and Los Angeles, where he lived and worked, and have recently been exhibited at the Art Institute of Chicago and at the Brooklyn Museum. Born in New York in 1956, Giorno studied at the School of the Art Institute of Chicago and the School of the Art of the same year. His paintings are based on his experience painting in the urban environment of Los Angeles from 1967 to 1974. He began his Art of the City series in 1974, which was originally dedicated to American art history, and his paintings have been exhibited at the", "The next Biennial should be held in 2020.\n\n\nThe Fair of Art, the largest annual award for contemporary art, which was established by the Jonathan and Eliza Moulton foundation, has awarded $165,000 to twenty-four artists, including Emma Slough, Shirley Nesjma, Carlotta Solmi, Alexandra Serota, and Sam Gavin. The prize jury, consisting of Sara J. Smith, curator and former director of the Moulton Museum of Art in Manhattan, and Davey Smith, cofounder and president of the New York–based global art company Fairscape, also named Nina Turner and Sharon Stone as finalists. The awardees are eligible for a total of $300,000 in both direct and indirect support.“In support of the arts, we are thrilled to accept the award for our work in the coming months,” said Jonathan Moulton. “We are eager to give our artists the tools they need to continue their work and develop new and exciting work. The next Biennial will give them the opportunity to engage with the Moulton Museum and the world through exhibitions and readings, lecture series, and fairs. We are also looking", "The next Biennial should be in May 2020. Donovan, who served as the Chair of the museum from 2010 to 2016, said: “In naming this Biennial after a key figure in my own life, I hope that it will serve as a model for our future, shaping the course of our museum and a generation of scholars, for better or worse.”In an interview with Artnet, Donovan explained that his decision to change the name of the biennial came as a “surprise,” since the institution has been referred to as the National Museum of the American Negro for almost forty years. He said that the decision to rename the event, “in honor of” the civil rights leader was made after he gave a speech at the museum in which he argued that “the most urgent task in American life is to educate our children in the most racially diverse environments possible.” The centrepiece of the biennial will be “American Pastoral: Pastoral Imagination and the African Diaspora”, a presentation of the work of twenty-four artists. The project will also bring together stories of African Americans from various sources, including from their own voices, as well as from", "The next Biennial should be held in 2020. \n\n\nMartin Scorsese has announced that his forthcoming biennial of documentaries will be his last. Titled Look, and You'll See (and You Will Not), the presentation will take the form of an exhibition, which will run for twelve weeks, and will include twenty-five films (plus a selection of Scorsese’s animations), many of which were made before his death.The biennial is a part of the Scorsese Foundation’s ongoing commemoration of the filmmaker’s life and work. “Our goal is to create a new Biennial, one that reflects the spirit of Scorsese,” said Thomas Schelling, president of the foundation;  “We are very pleased that Martin Scorsese will continue to be accorded the fullest measure of respect and admiration for his remarkable career. We are confident that the biennial will continue to be a champion for the arts in every way imaginable.”The biennial will focus on Scorsese’s work in a number of media, including animation, film, sculpture, television, and the visual arts. The 2020 edition will be staged at the Biennial Museum in New York", "The next Biennial should focus on the use of Games to raise awareness and provide opportunities for people to engage with and connect with the work of the Los Angeles–based artist/activist/writer Nina Häkkinen. The biennial will be organized in partnership with the artist and her representative, Nancy Walker. The exhibition will focus on her work, which uses video games and pop culture to address issues of representation and the role of technology in our lives.” 'Games as a Stage: Nina Häkkinen’s ‘Infinite Play’ in Birmingham” will open in January 2020 and will be on view in January 2021. The exhibition will feature work by forty-two artists.The industry is recovering from the impact of Covid-19, which has caused an unprecedented spike in the coronavirus outbreak, and is expecting a second consecutive quarter of revenue losses. Analysts expect the second quarter, which will run from January 19 to January 22, 2021, to be the hardest for video game publishers, as they shift their business away from consoles and toward online sales. \n\n\nRepresentatives from the New Orleans–based nonprofit the New Orleans Art Museum (NOAM) are suing the institution to try to stop the demolition", "The next Biennial should be held in 2020.“It’s like revolution,” said Adnan Akram, the director of the Ashram. “The best way forward for the Ramadhan is to focus on the Ramadhan’s legacy, not on the future. It’s a historical institution, and it’s important for us to preserve its history as a legacy institution. We hope that the Ramadhan will continue to develop and to have a positive impact on the lives of the people of Saudi Arabia, and at the same time help Saudi arts in their efforts to become international stars.”\n\n\nThe Art Museum of Chicago (AMC) has received a gift of more than 1,300 photographs that were purchased by the museum in exchange for Bob and Ira D. Wallach in 1994, with whom the institution became a couple, reported Artnet. The exhibition opened the doors of the museum to a new era of fundraising. The couple donated the photographs to the museum as part of a series of works that were auctioned in the ’80s and were housed in the institution’s collection until recently.Since the photographs were acquired by the couple, the institution has been fundraising alongside", "The next Biennial should involve an exploration of the new realities of memory, a new social and political moment in which the biennial encounters the world anew, in order to reflect, to re-create the possibilities for historicity and the past. It should re-create the conditions for a critical, global knowledge culture.”Gerhardt Riester, director of the Bode Museum in Frankfurt, Germany, added: “It would be the epitome of biennialism, a project that advances not only the museum’s own interests but also the mission of the museum. The proposal of this biennial in 2021 is an extremely important milestone, as it represents a new beginning for the museum.”\n\n\nThe John Simon Guggenheim Foundation in New York announced today that it is launching an effort to support cultural organizations that are facing financial or operational difficulties in the months leading up to the 2020 census. Included in the initiative are introducing new financial aid guidelines for non-profit and for-profit organizations; revamping the foundation’s collection allocation to encourage more curation-style programming; and revamping its curatorial practice in order to match the needs of a changing cultural landscape.In a statement, the foundation said", "The next Biennial should be staged in the Californian city of Santa Barbara in January 2022, the Los Angeles Times reports. The event is being organized by the Public Art Fund, which was formed by the California Community Foundation in conjunction with the California Academy of the Fine Arts to ensure that the California Museum of Art would not be demolished to make way for a new 13,000-seat HBO Center. The organization will distribute $125,000 in seed funds to the selected ten institutions, which will then compete to see how many institutions can present the work of the year’s most visually-impacting artists. The ten finalists will then be invited to present the work at the Los Angeles County Museum of Art in February 2022.A full list of the finalists can be found on the Public Art Fund’s website.  The Los Angeles County Museum of Art (LACMA) has released the shortlisted artists for the twenty-fifth Annual John F. Kennedy Center for the Performing Arts® (JKPCA). The Kennedy Center has been selected for its production of John Mayer’s In the Air We Trust, which was nominated for a Pulitzer in 2007, and for its performance of Gina Turner’s", "The next Biennial should be in 2020.” The project could also see the reopening of the laboratory, which has undergone a major expansion and renovation. A public viewing of the exhibition will take place in the exhibition’s courtyard in the autumn of 2020.\n\n\nThe Donald D. Bernstein Prize for Art and Design will award $20,000 to three New York–based artists for their presentations at the upcoming Art Times New York exhibition. The three were selected from a shortlist that included Rujeko, Valtteri Bächli, and Sijana Gadd. The 2019 prize was presented by Artnet in partnership with the Art Newspaper. The three finalists are Valtteri Bächli, Jillian Lynch, and Wolfgang Tillmans.“We are thrilled to announce the winners of the 2019 Donald D. Bernstein Prize for Art and Design,” said Rujeko. “Their works, including this year’s exhibition, demonstrate their commitment to the field and represent the best of contemporary art. The 2018 prize jury was impressed by their performances at the third Art Times New York, which is a reminder of the depth and breadth of contemporary art.”\n\n\n\n\n", "The next Biennial should be held in September 2021. \n\n\nAs the US military gears up to begin relocating its military from bases around the country into urban areas, the families of fallen soldiers are demanding that Congress address the mounting health crisis by setting up a national memorial for their deaths. Individually memorialized or collectively dedicated, the families believe that the work of restoring the military to its original functions should be entrusted to local communities.“When we look back on those seven and a half years we were deployed to Afghanistan, and we think about the sacrifices our families and our countrymen and women have made to secure our freedom,” said Jennifer Doran, the mother of Staff Sgt. Jeffrey Doran, one of the four soldiers who were ambushed and killed by an Afghan police officer in Baghdad in February. “We are not asking for a memorial; we are asking for an end to war.”The families’ demands have been echoed by other activists, who have banded together to form a coalition to save the thousands of troops that are still deployed to Afghanistan and have died there since 2001. Led by the Association of Coalition’s attorney general, Mary Sue Lawlor and backed by the Washington, DC–based nonprofit Protect Our", "The next Biennial should be held in 2021.If you would like to know more about the city’s current collection, you can visit the City of Vancouver’s website.\n\n\nThe Museum of Fine Arts (MFA) in Boston has been awarded a $3 million donation from the David and Lucille King Family Foundation. The gift comes two weeks after the museum received a $2 million donation from the Amara Foundation. In addition, $250,000 was expanded by the Amara Foundation into the Museum of Fine Arts. The gift was made in recognition of the museum’s long-standing commitment to supporting the art of the American South. The gift also celebrates the legacy of the museum’s first director, Delbert D. King. The Museum of Fine Arts, which is a just-opened championship of American art, has hosted over three hundred artists and has been named the Amara Foundation’s civic prize.“The museum has long been recognized as an outstanding leader in the art world and has been at the forefront of expanding the scope and breadth of its collection,” said museum director David Scheininin.", "The next Biennial should be held in 2020.\n\nThe British artist, whose extraordinary life and work consists of paintings and sculptures, died on January 4, 2020, at the age of seventy-five.Born in London in 1936, Raglan began painting at the age of sixteen. He is perhaps best known for his series “Metamorphoses,” 1955–55, which is comprised of a series of paintings that appear at different points throughout his career. The series’s final painting, “Fashion,” 1977–79, combines printmaking and art production within a single series of three works.Raglan’s art has been exhibited at the Kunsthalle Basel (the Swiss city of Bern), the Museum of Modern Art, London, the Museum of Modern Art, New York, the National Galleries of Scotland, the National Gallery, London, the Contemporary Art Museum Stuttgart, the International Galerie, Zurich, the Museum of Contemporary Art, New York, the Museum of Modern Art, New York, and the Museum of Modern Art, New York.Raglan’s works are acquired by the Tate, the Museum of Modern Art, New York; the Museum of Modern Art, New York", "The next Biennial should be held in 2020. It is not yet known when the 2019 edition will be reopening.\n\n\nThe Amsterdam Museum of Fine Arts (MMA) in the Netherlands announced today that Søren Todenhoff, who was appointed as the new director of the institution in January 2019, will depart the country in March 2020. He succeeds Tina-Marie De Genser, who was appointed as director of the Museum of Contemporary Art Breda in February 2019 and who has been working to promote its new museum-within-a-museum, the Künstlerhaus, in the city of Bergen, near the city of Amsterdam.“I’m thrilled to be heading to the Künstlerhaus, where my passion for art and design meets the needs of a contemporary city in a spectacular new way,” said Todenhoff. “I’m looking forward to developing and fostering the new Künstlerhaus in a city that has successfully hosted my family and me for decades, and to working with my colleagues, the curators, the artists, and the staff to create a new kind of museum.”During his tenure, T", "The next Biennial should be held in 2020. The initiative, which was originally organized by the British artist David Hockney, was inspired by a letter he received from a student at the London School of Economics. In a letter penned by William Shakespeare, the student spoke of his wish to see a biennial of physical art and was met with a proposal by the London-based artist Paul Mpagi Sepuya, who helped raise funds for the project. The venue for the first event was a former grocery in the artist's hometown of Bristol\u0097it was dubbed the Biennial of Plants and was staged in a converted garage, made of shipping containers, in May 2011. It was followed by its second edition, the Biennial of Objects, in September 2012 and its third, the Biennial of Ideas, in March 2019. The first exhibition, “The Biennial of Objects” (2015), featured twenty-six new works from the artist’s collection. The second, “The Biennial of the Arts” (2016), showcased “Art and the Body” and “Human Contagious Infection.” All three editions of the event were held at the", "The next Biennial should pay tribute to the late American artist and theorist Saul Rosenberg (1923–2010), whose work both informed and challenged the anthropological and political landscape. The event’s presentation of his work will be preceded by a special exhibition of his work, “Saul Rosenberg: A Real Biennial,” which will take place in the Museum of Modern Art and will include replicas of his famous Polaroid photographs from the late 1960s and early 1970s. The exhibition is also co-financed by the city of New York and the artist’s estate.The biennial will take place in the newly renovated and expanded Museum of Modern Art (MoMA) in the heart of Harlem. The complex was originally completed in 1967, and in 1972, MoMA hosted a retrospective of the artist’s work, “Saul Rosenberg: A Biennial. The exhibition was closed in 1974 after a fire that broke out in a space in the museum adjacent to the showroom. In 2006, the museum reopened as a collaboration between the artist’s estate and New York’s Public Theater.In honor of the artist’s life and legacy, MoMA has unveiled new galleries dedicated to his work in the", "The next Biennial should be held in 2021. Artforum’s editor in chief, Amanda Sharp, said: “This is the right time to stand with artists and their families in supporting the next generation of curators and organizers. We need them to shape the future of exhibitions and exhibitions in our own image. We need them to create and articulate a new moral and political vision for art and exhibitions. We need them to shape the way we think about art and exhibition. We need them to shape the future of our society.”\n\n\nThe National Art Museum in Oslo and the Museum of Modern Art in New York have announced a new partnership, the National Gallery of Art, which opened in Wiradjuri in 2015 and workspaces in the city center. The art museum will provide free, mobile access to the museum, which is currently closed, and the Wiradjuri Wappu, an arts and cultural hub in the city, via the Internet.Inaugurating the partnership is the launch of a new online platform, Artradar.com, which will allow visitors to view and buy work by artists as well as interactive projects in collaboration with curators and museum staff. The platform will be powered by the National Art Museum�", "The next Biennial should take place in 2022, according to the exhibition’s organizers, which are currently trying to raise $42.5 million to commission the show’s first work. The full list of participating artists is as follows: The Seven Deadly Sins: Anomaly (Monterrey)Alex Guin (New York)Creation Stories: From the Studio (New York) The Book of Life (New York)Anwar Sadat (Sudan)The Book of the Dead (New York)Anton Kern (Sydney)Finji the Finnish (New Delhi)Marianne Helm (New York)Ichiro Shoji (Tokyo)Manufacturing Consent (New York)Maria de Paz (New York)Mevlut Mampas (New York)Ravindra Mukherjee (New Delhi)Academic Achievement Award: Dijon (New York)Academic Excellence Award: Berlin (New York)Academic Excellence Award: London (New York)Academic Excellence Award: Paris (New York)Academic Excellence Award: New York (New York)Academic Excellence Award: San Diego (New York)Paul Meehl (New York)Academic Excellence Award:", "The next Biennial should include a selection of works by artists and institutions based in the Middle East and Africa, and will unveil its inaugural programme at a later date.”The National Gallery of Art in Washington, DC, is planning a major expansion that will bring the institution’s collection to 17,000 square feet of space in the second floor of the museum. The redesign, called the Northeast Design Center, is being led by Holger Schipper, who previously served as director of the Kunsthalle Basel in Switzerland and as head of the Kunsthalle Berlin. The project will also involve the renovation of the gallery’s existing setting, which is currently used by artists and collectors for exhibition and educational purposes as well as the restoration of the gallery’s existing installation, “The B-Side: Art and Retreat in the 1980s” (2019), which will be performed by artist and collector Meret Oppenheim.Jerusalem’s Center for Contemporary Art, a nonprofit that aims to foster and support contemporary art through a variety of programs and initiatives, has announced that it will also be reopening in early 2021 to the public. “We are very excited about this new opportunity to welcome people back to the", "The next Biennial should focus on connecting indigenous and non-indigenous artists, communities, and communities through the production of cultural activities, offering opportunities for reflection and reflection through the art and culture of the indigenous communities in the place where the work originally came from. It should also consider the possibility of using local resources in connection with the production of works that are relevant to the current cultural activities of the indigenous communities in the place where the work originally came from.\n\n\nThe Gallery of Modern Art (GMO) in New York has received a major gift of more than 1,400 works by seventy-nine artists from the Mukoya Collection, including forty-six indigenous artists from the Japanese region of Kagoshima, who are now sharing their stories in a new book, Kagoku no Shiranai (I Remember). The exhibition was organized as a collaborative project between GOTO and the Mukoya Museum.Kagoku no Shiranai (I Remember) is a book, an audio commentary series, and an exhibition that is dedicated to the cultural practices and histories of the seventy-nine indigenous artists represented in the collection. The show will address the centuries-long history of the art form in the Japanese region. The curators concluded their book with a panel discussion", "The next Biennial should take place in the spring of 2020.\n\n\nThe Metropolitan Museum of Art in New York has appointed Nico Moll, who previously worked as the senior curator at the New Museum in New York, as its next director. Moll succeeds David K. Antonovitz, who has been the Met’s deputy director of exhibitions and collections since 2015 and will take up his post in the fall, and will begin in his new role on Monday, November 8, at the institution.“Moll’s background and experience in managing a museum in a rapidly growing city make him an ideal candidate to lead the Museum,” Antonovitz said in a statement. He added that Moll will be a “strong advocate” for the museum as it continues to adapt to the evolving needs of its captive audiences. The museum is currently working on plans to open a new, larger space in the summer of 2021.In his new role, Moll will work closely with director Christopher Campbell, who will remain involved with the Met as a director of exhibitions, lectures, and programming. During his tenure, Moll has developed the museum’s collection plans, organized exhibitions around themes, and overseen the acquisition of works by artists such", "The next Biennial should begin in the spring of 2021. The upcoming exhibition will focus on the exhibition of the artist’s work from the years 1936 to 2013—the first show of his work by the Mahlia Foundation in Rome. The theme of the show will be “The path of a corpse,” a direct translation of the Italian words for “a corpse,” Alessandra Belli, the director of the Milan Biennale, told the Art Newspaper.Other venues to be explored include “Ateliers Antonin,” which was staged in Paris in 2016. The exhibition was organized by Marc-Olivier Alen, the head of the Milanese Beppe Grillo–led movement. The next edition of the show will take place in June 2020. “The Art of Dying,” originally published in March 1942, was a text by Alfred Steiglitz, a leading German painter, critic, and designer, which described the process of decomposition. Steiglitz was responding to the grief and rage of a family in the town of Kassel in which the artist had taken up residence. The text, which is considered a masterpiece, was picked up by the Italian writer and newspaper", "The next Biennial should be held at least three times a year, and the first in 2021.\n\n\nThe nineteenth edition of the Venice Biennale, curated by Stefano Lambino and featuring artists such as Eric Fischl and Peter Dreher, has been postponed from February 21 to March 20. The event has also been moved from March 15 to March 19. The statement from organisers reads: The decision to postpone the exhibition has been taken in the interests of the artist-diaries and the consultants for the Art in Venice (AICV), a conference program of the museum. The postponement of the exhibition has nothing to do with any specific date, but with the fact that the exhibition is prestidigitated, as it is supposed to be in January. The exhibition was supposed to open on December 19 and be given an opening day of May 1. The move has lead some critics to believe that the show’s long-awaited January 25 date is still far off, as the exhibition and its opening day have been moved. The first Digital Venice exhibition was set to open on January 25, but the show was forced to postpone its launch amid a power outage and only recently did it finally open.Critics", "The next Biennial should see a second wave of renovations, including artworks by new artists coming together in order to circumvent the usual exhibition format, and should reflect a dynamic and multi-dimensional world in which art and architecture are more intermingled.”The 2018 event was held at the Casa del Rey in Santa Ana, California, and attracted around 5,000 visitors.\n\n\nThe AFM Museum in Tokyo is planning to open its first exhibition dedicated to the American artist Rachel Harrison in the country’s capital next month. The first exhibition will explore the American West-origin artist’s powerful artworks, which will explore the relationship between late-20th-century American art and her revered indigenous homeland. The show will be hosted and organized by the artist’s granddaughter, Sumi Harrison, who is already a member of the museum’s board of trustees.The museum is also working with the Detroit Institute of Arts to develop an exhibition dedicated to the artist’s work. The project, titled “Pierced Skin,” will debut at the museum in March 2020 and will focus on the artist’s relationship with her native state and the region of Michigan. The show will be co-curated by", "The next Biennial should take place at the New Museum in New York in 2021. Commenting on the upcoming exhibition, the museum said: “The triumph of art over time is the universal theme of the biennial. The exhibition ‘Time Between: Art and Time’ will celebrate the work of contemporary artists of the twentieth century and introduce new thinking and approaches that address contemporary issues from an end-to-end perspective.”The art biennial will be organized as a series of films, a video exhibition, and a book, among other programs. The biennial’s first film, Ancillary Justice, will feature artworks that examine the historicity of artworks in each of its locations; the second, “The Art of War,” will provide an ongoing overview of artworks and the historical context of conflicts in the art world; and the third, “Art, Gender, and the Body: Collection, Use, and Transference” will involve collecting and displaying artwork by contemporary artists. For the book, the organizers will use a selection of works by contemporary artists and will present each artist’s collection in a way that will give the audience a sense of their work’s history.The exhibition", "The next Biennial should be held in the first half of 2020, or the first half of 2021.\n\nThe provisional schedule for the exhibition, titled “Between,” is as follows:September 19–October 1CALLED ARTISTSSeptember 20–October 2Artists September 21–October 3All of the aboveSeptember 24–October 5Artists October 7–October 12October 25ArtistsOctober 28–October 4The event will be held at the Biennial of Contemporary Art, Madrid; the Barcelona Museum of Fine Arts, Spain; the Museum of Modern Art, New York; and the Musée d’Art Contemporain, Paris. The event will also feature the work of a new group of fifteen artists who are collaborating on one of the largest exhibitions to's the history of the world. The group is called “Conceptualização.” The artists will be presented with various works by contemporary and modern artists, including Fernando Barberov, Alejandro Campana, Tanya Castro, Ipiranga Cáezas, and Jochen Rietschel, and will be presented with the works by artist-in-residence Yasmina Cintra and her partner, Domenico", "The next Biennial should take place in 2021. The theme of the show will be “Building Networks” and will be “The Archaeology of Sexuality in the Art of the Renaissance.”However, the exhibition will also include the work of Alexander Ayto, the German artist known for his large-scale sculptures that often incorporate characters from different mythologies and history. The show, which will be housed in the Museum of Modern Art, will have a special exhibition of the artist’s art on display, as well as work on paper, in a project by the artist that will also be presented in the Florence Biennale in 2021.\n\n\nThe National Gallery of Art in Washington, DC, has received a gift of twenty-three works by artists from the late Hema Hutchison, Laura Owens, and Emmanuel Lévy Gorvy, which are currently on display in the museum’s exhibition “The Modernists and the Modern Way,” which opened on January 4. The gift includes works by Edward G. Browne, Michelangelo Antonioni, Tacita Dean, Kiki Smith, and Anita Looney, and will be gifted to the National Arts Museum on February 14.H", "The next Biennial should be held in September 2020, with the exhibition revealing the themes for its first iteration in May 2021.\n\n\nThe Louvre is releasing a new work by Pablo Picasso. The work, which is titled On the Flag of Er; and will run in the November issue of the museum, is a statement on national unity, democracy, and the future of the country.The exhibition is being organized by the Louvre and the Institut Nationale d’Art Moderne in association with the institution’s members, the National Council of the Faculty of Arts and of the Arts in Education. The Louvre is the first arts institution in Paris to stage the exhibition.The public will have the chance to see the work in November, and one week after that, on December 21, when it will be presented in the Louvre. The theme for the November edition is “Religion and the State: Picasso and the Dead.”The Institute for Contemporary Art (ICA) in Paris is preparing to welcome the first visitors to its new, expanded, and expanded-to-capacity building, the Ile-de-France, next week. The twenty-sixth edition of the Ile-de", "The next Biennial should take place in Los Angeles in 2022.  However, the initiative has faced mounting backlash from artists and cultural figures following Vice’s decision to pull an online version of the exhibition. The move drew outrage from critics, who argued that the show was “forced” into the move.  Adeline Sulotel, the director of the Pérez Art Museum in Mexico City, said that the move was “a betrayal,” and that the show will return to Mexico City in 2021.Artforum has reached out to the Pérez Art Museum for a statement.\n\n\nAfter seventeen years in the profession, J. Paul Getty’s six-decade tenure is nearing an end. He announced his retirement at a ceremony at Los Angeles’s City Hall on Friday, the day before his eighty-fifth birthday. His successor will be a woman, Anne Saunders, who has served as director of the Getty Museum since 2009. Saunders has been overseeing a $100 million budget reduction plan that will see the institution’s cultural assets, including the Getty Building, shut down for a month, and its main campus relocated to the Getty Science Center in Pasadena, California. The move was made in an", "The next Biennial should take place in 2022. A spokesperson for the festival said: “The work in the exhibition was selected for its exceptional quality and its ability to address contemporary issues through a blend of traditional and contemporary art. The work in the exhibition was presented in the building of the new Biennial, which is a part of the Expo Berlin, and demonstrates the ways in which better and more expansive conceptual frameworks can be developed and developed further.”In the 2016 exhibition “Post-Modern Art” (2017), Lüders created a paper-based work, “Cindy Sherman: Celebrations of Woman.” She designed the installation for the exhibition “Post-Modern Art” in cooperation with Berlin-based artist Joachim Neumann.The work was exhibited in the exhibition “Post-Modern Art” (2017) and “Post-Modern Art” (2017) and has been included in biennial shows at the Museum of Modern Art, the Museum of Contemporary Art, New York; the National Museum of Art, Washington, DC; and the Museum of Modern Art, London.\n\n\nThe New York State Department of Cultural Affairs (DCLA) has released guidelines for the public art", "The next Biennial should be exciting and transformational, and should bring together the best of contemporary art, with a view to answering the questions: How and why art is created in the first place?” Roger Roesler, the director of the Kunsthalle Basel, said: “Museum Basel is delighted to support the work of the Biennial. Its multidisciplinary approach to the exhibition of contemporary art serves as a model for the way museums are seeking to engage contemporary art. The new conceptual partnership between the Museum and the Biennial allows us the opportunity to expand the show and remain true to the importance of the work of the artists.”\n\n\nThe City of Vancouver announced today that it plans to spend $18.6 million to re-purpose a large, aging industrial building in Downtown Vancouver as an artist’s residence. The $8.8 million project, which will also include the construction of two new public spaces, will be spearheaded by the City of Vancouver and includes the construction of the first floor of a new, architect designed, multi-million-dollar residence that will sit on the ground floor of an industrial building at 777 Fourth Avenue.“Vancouver has long been recognized as a leader in the international", "The next Biennial should take place in 2021 and will be titled “Life After Life.” In a statement, Artforum said: “We are currently developing a new presentation for our flagship exhibition, ‘The End of the Life of Art’ in 2019. We are also committed to exploring new ways of making work in the body of our giving program in 2021. We look forward to continuing our work alongside so many talented and dedicated artists, collaborating with the world.” \n\n\nThe Leeds Art Gallery (LAG) in the UK announced that it is teaming up with the Leeds Foundation to present the Papillon Museum’s exhibition “Papillon: Art and Life After Death.” The show, which will run from February 25 to March 6, 2021 at the museum, will showcase the work of seventeen artists and will highlight the contribution of the late British artist and theorist Adam D. Benson.“The show will culminate with a tour of the museum and will include a virtual reality experience,” said LAG director Barbara Carswell. “The Papillon team are leading the way in bringing this work back to life, and it will be a great honour to present their", "The next Biennial should be held in 2021. Željko Plešek, president of the Czech Biennial Foundation, said: “We are delighted that the Biennial Board of Directors has decided to open the doors of the Institute at the end of 2018. This will allow the Czech Republic to be a global leader in the construction of biennial projects. I am confident that this will be the year for Biennial Prague.”\n\n\nThe National Gallery in London has appointed Caroline Aspell as its new director of exhibitions and collections. The portfolio includes as well as the future of the Museum of Modern Art (MoMA), which is currently undergoing a $55 million expansion and renovation. “Caroline Aspell is poised to build on the work of her predecessors, and to drive innovation and creativity across the National Gallery,” said Pierrick Pignee, director of the National Gallery. “Her appointment will enable David Cameron, the prime minister of the UK, to see the National Gallery as an exciting and important cultural destination for visitors to England, and will open up new opportunities for further exhibition and fundraising.”After earning her Ph.D. in art history from the University of Edinburgh,", "The next Biennial should inaugurate with the Exhibition “The Life of Pablo” and will be held in the Stedelijk Museum in Amsterdam from January 8 to January 10, 2020. The exhibition will highlight the work of twenty-seven artists to date.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it has received a gift of more than three hundred works by twenty-two African American artists from the Los Angeles County Museum of Art (LACMA), the African American Museum of Art and the San Fernando Valley. The gifts include works by members of the Harlem Renaissance; Black Power; Black Thought; and Black Motion Picture.The museum is also introducing a new scholarship program, “African American Art in Contemporary Art,” which will introduce new readings and readings by established and emerging artists. The inaugural class will be led by Rachel Perry, a curatorial fellow at Kogod Museum in Chicago; Lionel Akomfrah, a curator at the African American Museum of Art; and Meg Smith, a curator at the Los Angeles County Museum of Art.“We are excited to welcome our first class of twenty-two artists to LACMA,” said Ellen Schlesinger, director of the Los Angeles"]