["The next Biennial should take place in the autumn of 2021. Its curators, Aymana Baig and Farah Al Qasimi, have said: “The question we are trying to answer is whether the future looks as if it is moving forward at a pace that is more rapid and more coordinated than the present.” They also expressed hope that the exhibition “may serve as a vehicle for questioning the assumptions of ‘progress’ and ‘progressivism” and for rethinking the future in general.“The least we can do is show that we are not further along than we are,” they said.\n\n\nThe Los Angeles County Museum of Art (LACMA) is planning to burn more than one hundred artworks in a frontal assault on the institution’s core mission of representing the cultural and historic legacies of the California gold rush, which began in the San Fernando Valley in California in the early 1900s and ended in the city in 1976.The redevelopment plan for the arts complex, titled “California: The California Gold Rush,” outlines a series of activities that will celebrate the region’s rich artistic and cultural heritage while simultaneously integrating the institution into the cultural fabric of Los Angeles", "The next Biennial should be held in 2022.\n\n\nThe Museum of Fine Arts (MFA) in Boston, Massachusetts, has appointed Peter Scharf as its next president. Scharf succeeds Michael O. Dougherty, who stepped down as director of the museum in February 2020 and has served as interim director since August.“Peter brings a great range of experience and knowledge to our team, and will continue to lead the MFA in a strategic and visionary way as we shape the next critical chapter in its history,” said director Julianne Dahlgren. “We are grateful for his efforts in hiring a visionary director, and that he has expressed his appreciation for our work for the last eight years. There is no question that Peter is the right person to build on the MFA’s legacy of excellence and excellence in fantasy and science fiction, and to continue to innovate in our upcoming exhibition season and beyond.”Under Scharf’s leadership, the MFA has expanded its curatorial program and its exhibition-viewing experience with the addition of more than fifty exhibitions, bringing the collection closer to Chicago and beyond. Scharf also restructured the museum’s collection strategy to focus on the most recent work and has revamped the institution", "The next Biennial should draw to a close next month and will begin hosting its second edition in October 2021. Representatives of the artist-run collective, which include the artist-activists Thee Alexandra, often collaborate on projects with other artists, and the artists often use the same materials and techniques to create works that are both personal and work in service of social change. Each year, the group invites a select group of artists to collaborate with the public. The new exhibition will be curated by Anwar Niazi and Lisa Mpagi Sepuya. The cover of the exhibition will be by Amani Mpagi Sepuya.The exhibition is organized according to the tenets of biennialism, which advances and celebrates the creative life of the artist as well as the biennial’s unique history. The exhibition is organized according to the principles of biennialism, which emphasises the multiplicity of perspectives and the uncertainty of the future. The exhibition will focus on the history of the Artist’s Village, an art community founded in the city of Kampala in the Southern Democratic Republic of Congo in 1988, and will explore the role of art in the lives of a select group of artists", "The next Biennial should take place in 2022. \n       \n\n\nThe world-renowned Swiss artist Hans Braig, who specialized in drawing and sculpture, has died at age seventy-one in Zurich. He was one of the first artists to be classified as a Constructivist.Born in Geneva in 1932, Braig studied at the University of Bern, where he studied under the legendary Swiss American painter Franz Kline; at the Massachusetts Institute of Technology, where he studied with the early collaborator Otto Arndt; and at the University of Bern, where he continued his artmaking studies under the legendary German sculptor Paul Gauguin. He also taught at various universities in the United States, Switzerland, and the United Kingdom. In 1983, the following year, he was awarded the Prix de l'art and the Prix du livre at the Venice Biennale. In the November 1989 issue of Artforum, Jean-Paul Sartre wrote about the former student, the former collaborator, and the artist, and his work, which was included in the catalogue for the Potsdamer Straße auction at the museum in December 1999.\n\n\nThe Creators Project, a consortium of artists working in the creative", "The next Biennial should aim to establish a new platform for developmental interdisciplinary research into the history and culture of the contemporary United States through a series of creative, conceptual, and performance projects that reflect the artist’s work and that engage with the work of American artists, including Robert Irwin, Michael Bradley, William Deresiewicz, and Thomas Mies, among others.\n\n\nThe Metropolitan Museum of Art (the museum) in New York announced today that it intends to phase out its controversial twenty-five-year lease of the iconic Lincoln Memorial by November 2021. The move is part of a larger plan to refocus its collection on the twentieth and twenty-first centuries, and is the latest in a series of steps that the museum has taken since the 2008 election of president Barack Obama.“The announcement marks an important moment for the Met, as we prepare to celebrate our fiftieth anniversary with an exhibition devoted to the life and work of Joan Mitchell,” said museum director Daniel H. Weiss. The move follows the museum’s decision to launch its new public arts space, the Joan Mitchell Gallery, at 22 West Twenty-Eight in Manhattan, which will open to the public in early March 2020. Other changes the museum plans to incorporate into the", "The next Biennial should be held in 2022. The 2020 event, which was organized by the same group as the twenty-fifth, was cancelled due to the coronavirus. \n\n\nThe Los Angeles County Museum of Art (LACMA) has entered into an arrangement with the estate of the legendary actor Ed Moses, who passed away on August 31 at the age of eighty-nine. The purchase includes six works by the artist, including his famed Battleship project, 1957, for the museum’s newly rebuilt and expanded Edward Gipper Building, and the development of LACMA’s new sculpture garden, which will sit on the ground floor of the former Hollywood Sign.“This purchase marks a turning point in our relationship with Ed, and a new chapter in our history,” said Mark Levine, senior curator and director of curatorial affairs at LACMA. “For more than a decade, LACMA and Ed’s heirs and collaborators have collaborated by forming the ambitious and sometimes bizarre project of creating a work that will include the iconic Gipper Building, the iconic Ed Moses, and the iconic Battleship. This is a landmark occasion for us as we embark on our next phase as a museum", "The next Biennial should be held at the Museum of the Arts’s 300 South, which also serves as the site of the current exhibition “The Death of a Nation,” and will include a selection of “Quotations from Lulu,” a poem by Kahlil Joseph that will be performed by the San Francisco Orchestra and the San Francisco Ballet, alongside the San Francisco Symphony. Bishop has also been planning to hold a biennial at the Museum of Contemporary Art in Los Angeles for ten years, but the project was stalled by the Covid-19 pandemic. Critics have questioned whether the MCAW, which was founded by Michael Bishop and Richard Smith with funds from fellow donors, would be able to raise the funds to stage a biennial at the museum.The Museum of Contemporary Art Los Angeles, which is currently constructing an expansion for its Modern Art Museum, has yet to announce any construction plans for the building, which is currently owned by the city of Los Angeles and managed by the city, is currently slated to open in the spring of 2021. The museum will also house a new sculpture garden, a new public art program, and a new movie theater, among other projects. \n\n\nThe Museum of Fine Arts", "The next Biennial should be in March 2020. The 2019 edition was held at Gallery Wächs in Cologne.   The next Biennial will be held in May 2020. In a statement, Art Basel said: “We understand that the balance of the Biennials is changing rapidly. This is why we are continuing with the cycle as planned. We hope others can understand the set of challenges and opportunities as we move forward. We at Art Basel are always ready to work with our colleagues to understand how we can support each other and collaborate as best we can. We also believe that for the best possible outcome, we should prioritize cooperation over confrontation. We are therefore working with our colleagues to develop a new collaborative platform, according to our principles.”\n\n\nThe Smithsonian’s National Museum of American Art (NMMA) in Washington, DC, has adopted a new dress code that addresses social distancing and racial equity. The new policies were released by the institution on Thursday, November 18. The guidelines, which were drafted by the Public Policy Institute of Chicago (where Lisa Linchuk is currently the director), address issues of social distancing and racial equity through the lens of seventeenth-century slave", "The next Biennial should take place in March 2021 and will take place in the National Museum of Fine Arts (MFA) in Washington, DC. The art of the exhibition will be curated by Laure DeWitt, the director of the Museo de Arte Contemporáneo in Madrid. The event will also include the exhibition of new works by artists such as Adriana Hafer, Haroon Mirza, and Sidsel Mijs. \n\n\nThe Brazilian artist who died in New York City in March 2019 at the age of eighty-nine was never sentenced to prison for the manslaughter of Erica Boyce, the artist who collaborated with him for more than twenty-five years on paintings and drawings that depict themes such as the civil rights movement and the feminist movement, among other subjects. Instead, she was sentenced to twenty-nine months in prison and fined three hundred thousand reais ($3.03, $300,000) for tax evasion, eventually followed by two years of home confinement, reports Artnet.On March 20, the New York Times reports that the United States has once again been hit by a major blow to the art world’s bottom line when the US Supreme Court in Washington, DC, struck down", "The next Biennial should take place in the summer of 2021.\n\n\nThe National Society for the Visual Arts (NVA) is launching a new five-year initiative that will provide funding to visual arts institutions across the United Kingdom. The initiative is a response to the decisive election result in the UK on June 8, which saw a dramatic increase in the number of Conservative-led votes in Parliament. “We have made a decision to support organizations in our galleries that are working to create and improve opportunities for people to see valuable works, and to offer services that can improve their experiences of life,” said Peter Leavitt, chair of NVA. Over the next three years, NVA will invest up to GBP100,000 ($104,000) in institutions that represent a diversity of visual arts and cultural practices. The initiative is one of many measures being taken by the UK government to address the concerns of artists and other cultural workers following the election result, which is seen as a backlash against the austerity measures being implemented by the UK government. According to The Guardian, the government has allocated GBP149 million for the arts, which is nearly fifty percent more than it allocated for the entire ", "The next Biennial should be held in 2020. The biennial will be an extension of the theme “Nature and the City,” which will be presented by Moschino and hosted by the San Francisco Museum of Modern Art.The second part of the exhibition, titled “The Material City,” will be held at the Museum of Modern Art in partnership with the Museum of Modern Art in New York. The third part, titled “The Art of Refusing,” will be presented by the Free Library of Philadelphia. The fourth part, titled “Sensuality and the Body,” will be presented by the American Folk Art Museum. The fifth part, titled “Avant Garde Painting,” will consist of lectures given by artist and thinker Ellsworth Kelly and will be hosted by the Institute for Advanced Study in the Arts, Los Angeles. The sixth part, entitled “Painting in the Seventeenth Century,” will be presented by the Museum of Fine Arts, Boston, and will be curated by the renowned American painter György Kepes. The seventh part, titled “Painting in the Eighteenth Century,” will be curated by the artist and thinker Freder", "The next Biennial should also be held in the spring of 2021. The decision was made after a number of artists expressed their desire to participate in this year’s event, which will be held at the Museum of Contemporary Art (MoCA) in Los Angeles and will be hosted by curator Lauren O’Neill. In order to make room for the installation, the property is planning to make significant structural changes to the building.“As we prepare to reopen with our project ‘Pine House,’ in 2020, we are reimagining how the exhibition will engage with the lives and experiences of the artists represented in the exhibition,” said MoCA director Miranda Mayhew. “By creating a series of interactive experiences that connect these artists, we are creating a new kind of platform for their work.”\n\n\nThe University of Calgary’s College of Humanities and Social Sciences (CHASS) is launching a new digital platform that will allow students, faculty, and the general public to collaborate on a single work by a single artist. The platform, called the Art Lab, will be accessible by visiting the CHASS Art Gallery, a new, two-story, 600-space art museum dedicated to the arts, and will", "The next Biennial should be in November 2020, with the first exhibition taking place in March 2021. The exhibition will include works by seventy-six artists, including a selection from the new museum, which will be inaugurated by its first work by Guadalupe Rosales, The Distant Mourning, which will open in October. For the biennial’s next show, a biennial of popular culture, the core collection will be released with a new exhibition curated by American curator John Baldessari, the Contemporary Art Museum Houston (CAMH), in 2020.The Biennial of Mine, which will be held at the Harris County Museum of Art from March 20 to March 23, 2020, will also include the first solo exhibitions of works by members of the new museum’s curatorial team, which comprises Kiki Smith, Tad Williams, Andrea Pintos, and Julia Talbott. This exhibition, titled “Feminine and Moral: Art from the Middle Ages to the Present,” will open March 11.\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines on how to display Art Deco in the city’s public spaces, including", "The next Biennial should have been held in 2019, but was pushed back due to the Covid-19 pandemic. Since then, the festival has faced numerous setbacks, including a rescheduling due to financial concerns, a second postponement due to the Covid-19 pandemic, and a third postponement due to a lack of interest from the participating artists. The Art Newspaper reports that the 2019 festival will now be held in 2022. Frieze, which recently declared its intent to cancel its 2020 event, is also preparing to send the event to a different location. The March edition of Frieze New York will still be held, but will be held at the Museum of Modern Art, and will be open to the public only on March 11. The March 23 edition of Frieze Sculpture at Rockefeller Center will remain on view, but will be closed until March 26. And the March 28 edition of Frieze Sculpture at the Museum of Modern Art will remain open, but will be held from March 28 through April 3. The March 31 edition of Frieze Sculpture at the Brooklyn Museum will take over the venue of the 2012 event. The March 30 edition of Frieze Sculpture", "The next Biennial should be all about questioning the notion of the truth of a thing, as expressed in art, and how it might be manifest in the work of other artists.”The show will run from March 16 to March 21. The theme of the event will be “For the Past and Future in Art,” and the artist who will receive the first prize at the event will be Emma Donoghue. The second prize consists of an art installation that was created in collaboration with the public art program, the San Francisco Art Museum, and the local Rhode Island School of Design. “Over the last thirty years, Emma has conceived, created, and performed work that challenges the limits and limits of art, both physical and conceptual, as well as works that raise the possibility and the commitment of art as a vehicle for social change,” said Mary Ellen Pfeifer, director and chief curator of the Whitney Museum of American Art. The Biennial will commission artist Peter Sack to create a collage that shows the effects of industrial pollution in California. The work will be on display at the Whitney Museum of American Art for two weeks in March 2020. The 2019 winner was Soraya Nadia, who won the", "The next Biennial should be held in the Spring of 2021.\n\n\nThe British Museum in London has appointed Vera C. Albrecht as its next director. Albrecht will be responsible for overseeing the museum’s cultural and educational programming, including its permanent collections, exhibitions, educational initiatives, and public programming. She will take up the post on January 3, 2020.“Vera Albrecht has been an important voice in shaping the British Museum into one of the most important cultural institutions in the world,” said board member Andrea Llodra. “Working with her promotes a strong sense of continuity and continuity in our strategy for the museum. Her leadership will be vital as we move into the next decade and we look to her for inspiration and vision in our future plans.”Albrecht has served at the museum since 2008; most recently, she was the deputy director of curatorial affairs. During her tenure, she oversaw the curatorial program for The Tourist, the first British Museum exhibition dedicated to the US, and oversaw the institution’s exhibition program. Albrecht also worked as a curator at the Guggenheim Museum in New York and curated numerous exhibitions for the institution, including 2017’", "The next Biennial should be held in 2020, and the 2017 event will continue to be held. In addition, the contemporary art museum Los Angeles and the Pasadena Art Museum have joined forces with the Pasadena Institute of the Arts to present the work of artists who have died since the coronavirus was first discovered in China.“We are committed to supporting the artists and their projects through this difficult period,” said Richard Armstrong, the museum’s director. “Our artists will continue to be directly impacted by and engage the local community through the Museum of Contemporary Art Los Angeles and the Pasadena Art Museum. As we continue to hold events and exhibit works in support of these artists and their projects, we will continue to engage with the community in Los Angeles and Pasadena through the Museum of Contemporary Art’s new art-centers.”\n\n\nThe Italian artist, historian, and educator Alberto Barbera, who was the driving force behind the campaign to re-create the historic Via della Scala in southern Italy, has died at the age of ninety-six. His work, which was first exhibited in the Venice Biennale in 1966 and was included in the 2013 edition of the Venice Architecture Biennale, was collected by the Museum of Modern", "The next Biennial should take place in 2021. Don't miss out on the best event London has to offer.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Sean K. Hughes director. Hughes comes to the institution from the Museum of Modern Art (MoMA) in New York, where he has served as curator of photography since 2015. Hughes previously helmed the inaugural iteration of the Museum of Modern Art Photography (MoMA POSE) in Harlem, New York, as well as the inaugural exhibition “Photography: History in Motion” (2018) at the Museum of Modern Art. He is also the founder and curator of The Cellar, a contemporary art space in Manhattan, and represents New York and New Jersey.“Sean’s talent and proven track record in showcasing the work of contemporary photographers is especially important to the museum,” said director Paul Mpagi Sepuya and director Tod Williams. “His history and expertise in and commitment to photography make him a strong choice to lead the Museum of Modern Art as a curator and advocate for photography as an art form, a medium, and an art form’s legacy.”The appointment was made when the institution agreed to take", "The next Biennial should be held in 2020. Contemporaries such as Arne Glimcher, who curated the first Biennial for Contemporary Art in 2012, have advocated a different date. “We have been working for many years to have a new exhibition and a different building in the city,” said Sussman. “It is a pity that it has come to this but it will be possible to change the date. We are working very hard to do this.” The forthcoming exhibition “Amber Waters: The Art of the Body” will take place in the exhibition room of the Ballet Paris and will be co-curated by French and American artists Bernard and Stefano Cattelan. The project will be organized by the Ballet Paris in partnership with the New York–based artist-collector Nathalie Bourgeois and will be led by an international team.\n\n\nThe twenty-sixth edition of the Venice Biennale has announced that thirty-three works by twenty-four artists will be presented at the event. The thirty-sixth edition of the fair, which will take place in February 2021, is currently underway. “The Venice Architecture Biennale,”", "The next Biennial should be held in 2022, and the contest will run from November 28 to December 22.The biennial will be led by Kiki Smith, curator of contemporary art at the Museum of Modern Art in New York and the author of The Art of Remaking Place, and The Art of Human Reproduction. The exhibition will feature works by artists such as Mark-Paul Radin, Masouda Youssef, and Martin Luther King Jr.Tickets for the biennial will cost $50,000. Organizers hope the event will be a catalyst for cultural exchange between the two countries, and encourage other nations to consider collaborating on a theme-based biennial.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it plans to create an additional twenty-one new positions for women in the company of a new initiative, Women in the Arts (WOA), which will begin this fall and will run through the end of 2025. The program will be led by an acting curator of modern art, and will consist of a series of artist-in-residence interviews and will strive to address the themes of “art for art” and “art as a vehicle to address social justice and", "The next Biennial should be held in 2020.\n\n\nThe newly rebranded London Architecture Biennial (LABI) has announced that it is expanding its focus from architecture to include the broader cultural realm. The 2020 edition will be held at the Barbican in London, and will focus on “the relationship between art and the city,” according to the organization.Lampshaded by Patricia Fielding, the founder of the firm Grafton-born architect James Lapidus, the biennial will bring together a variety of artists to address issues of development and sustainability. Among the artists chosen to represent the UK are Ellie Mae Wallace, Alice Cooper, David Hockney, Dale Massey, Diane Arbus, Erica Atget, Eleanor Clift, José Véra, Michael Jordan, Nari Ward, Odili DiAtelier, Ronnie White, and Rene Magritte.The theme of the 2020 edition is “The City,” but the institution is also promoting the exhibition “The Public Space,” an annual event that celebrates British cities through a series of events, screenings, talks, and performances. �", "The next Biennial should be held in 2022. The 2019 edition, titled “The Abode of the Gods,” was on display at the Museum of Modern Art in New York. The museum chose to boycott the event, which commemorates the twentieth anniversary of the festival. “The art of the future will be made of black metal and the future of art will be made of black metal,” Konstantine Ottenberger, director of the Biennial, told the Art Newspaper. The 2019 event was a collaboration between 16 artists and was organized by Kunsthalle Basel. The first two days of the four-day event were devoted to “Bosch and the Death of Art,” a solo exhibition organized by the Berlin-based collective Beyeler & Herzog. The work, a celadon of geometric shapes that incorporates a series of interconnected layers of acrylic, linen, and paper, was created to commemorate the anniversary of the festival.The exhibition also featured work by Michael Aubrey (Tie), Tony Cromwell (Tied), Tristan Cox (Tied), Alex DiGiorno (Tied), and Peter Hujar (Tied). The rest", "The next Biennial should take place at the end of September. The inaugural edition took place in the middle of April. In addition to the usual exhibitions and events, a special exhibition of new works will be presented in September. “We are at the beginning of our work, and we are eager to continue exploring and pushing our themes,” said biennial director Stephanie Lange. “The results will tell us a lot about the possibilities of what is possible.”\n\n\nThe European Union has decided to lift sanctions against Azerbaijan in an attempt to spur the reopening of small and medium-sized businesses in the country, which has been devastated by a devastating war that has displaced an estimated 212,000. The news comes amid an escalating crisis faced by the country, which has been trying to rebuild its shattered economy following a $8 billion oil-for-gas deal struck in 2016.The European Commission announced on March 22 that it was planning to lift sanctions on March 12, the same day as the scheduled reopening of the International Art Museum Baku (IAM), a regional institution that serves as a hub for artists and cultural workers from Azerbaijan. The commission also announced that it was preparing to lift its ban on trade in technology and materials that could be", "The next Biennial should take place in 2021.\n\n\nThe Toledo Museum of Art (TMA) has appointed John Ehrlich as its next director. In his new role, which is funded by the Toledo Foundation for the Arts, Ehrlich will be responsible for the day-to-day operations of the institution and will have the authority to approve the future designs of buildings and sculptures within the museum.“John Ehrlich has been instrumental in the institution’s transition to a comprehensive renovation program since he took the helm at the TMA in 2016,” said museum director Lindsay Schell. “Over the last twelve years, he has built a reputation for excellence and scholarship within the field of Modern and Contemporary Art through his leadership, and we are grateful for his dedicated and decisive work on behalf of the TMA.”The museum, which recently completed a major expansion and renovation, added a new theater in 2016 and expanded its collection by over twenty thousand works of art. The TMA’s collection is comprised of works dating from the nineteenth century to the twenty-first century. The institution also recently acquired several new works by artists whose studies the museum has never had access to, including Edward Hopper, David Salle,", "The next Biennial should attract around 2,500 visitors to the city for a special exhibition focused on the legacy of Jules Verne, the American feminist, and the French painter René Magritte, who together created the iconic statue of a man with a woman, the woman with the man (a portrait of the couple in the film La Bamba), in the courtyard of the Louvre.\n\n\nThe National Galleries of Scotland are preparing to welcome visitors back to the country for its annual Biennale in the spring of 2021. The announcement comes amid a continuing countdown to the festival, which was canceled after a fire broke out in one of the buildings that houses the institution in Edinburgh on December 2, 2020. No injuries were reported, but the fire caused several hundred thousand dollars in damages.Dubbed the 'City of Light,' the event will be held in a restored Thistleton church in the heart of the city, including a restored Botanic Gardens, gardens, cultural sites, and a Thistleton Castle. Titled “The River Runs Red,” the theme is meant to remind people of the Scottish Highlands, the epicenter of the Edinburgh Festival. The Botanic Gardens are said to be undergoing a major renovation and the proposed", "The next Biennial should be held at the Palazzo Grassi in Venice in December 2020. The design of the venue, which is located in the city of Venice, has been entirely revised and is now ready for the exhibition. The exhibition will include works by forty-six international artists in addition to a presentation of a selection of drawings by the artist. The artists participating in the show will be announced shortly.  The exhibition will be organized as follows: The Biennial is a collaboration between the Fondazione Frankfei and the architect Antonio Cipolletta. The venue, which is located in the heart of Venice, is a new initiative of the Fondazione Campina di Rivoli (FCRI), a group that brings together artists from different parts of the world, including London, New York, and New South Wales, and is led by architect Luigi Cipolletta, a partner at Kohn Gallery, in London.  Matthias Büttner, the biennial’s director, said: “The Fondazione Campina di Rivoli is an enormous and ambitious project. I’m elated that my collaborators, Angelo Cipolletta, Stefano", "The next Biennial should take place in 2021. The 2020 iteration of the event, which was held in the former São Paulo State University (SPU) in Sao Paulo, was canceled due to the coronavirus, which has since spread to other states.Organizers have since announced that the 2020 event will be held at the Museu de Arte de São Paulo, Palmeiras, and the Museu de Arte de Rio de Janeiro. “The comments made by some do not align with the values of the CCG,” Nara Sampaio, a communications director for the CCG, told the Art Newspaper. “The commissioning of the exhibition ‘BIDOL’ is a political act and not an act of art. In this case the museum is denying the request of the Brazilian state for the exhibition ‘BIDOL’ and has a political agenda. That is why we are asking the Brazilian state to cancel the event, and to hold this year’s event in September.”While the museum blocked the Brazilian state from exhibiting works by Brazilian artists in its September exhibition, the exhibitions were rescheduled and will now open in September. The show will now feature twenty-", "The next Biennial should focus on “photography as a tool for democratizing the means of production and spreading knowledge,” said Domenico DiStefano, chair of the council of artists. The 45th edition of the biennial will take place at the Museum of Modern Art in New York from January 13 to January 14, 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it is bringing its forthcoming exhibition “The Best Life,” a survey of the life and works of Bob Dylan, to New York City in 2020. The exhibition will be organized as a narrative of the artist’s relationship with his life and work through a series of performances, films, and installations, which will be staged in the museum’s new space in the building’s Cooper-Hewitt.According to the MFA, Dylan’s life was a “living, breathing, sensitive, and moving organism.” The exhibition will include interviews with Dylan biographers, biographers speaking at length about Dylan’s life, and biographers writing about Dylan.“The exhibition will explore the themes of ‘life and death, pain and beauty, beauty and death, pain", "The next Biennial should focus on the symbolic and physical transformation of the museum’s campus; should include a work by a selected artist; and should include a performance by the artist selected by the museum. “We believe that this will be a moment to reflect upon and re-create the kind of laboratory where, for twenty years, the museum will be able to present new works in the future,” said Carmen Rodríguez, director of the Museum of Modern Art, in a statement.  \n\n\nThe Whitney Museum of American Art in New York has appointed Diana Bravo, an assistant curator at the Whitney Museum of American Art in New York, as its next director. The appointment was made as the institution prepares to open its first new museum in Cuba since 1959 and marks the end of the museum’s thirty-year tenure in the capital city. “Diana’s remarkable career highlights include her tenure as a curatorial assistant at the Whitney Museum of American Art, where she helped establish the contemporary art museum curriculum, and her tenure as director of the Haus der Kunst in Berlin, where, alongside Walter and Caroline Crist, she helped shape the museum’s collection", "The next Biennial should take place in Shanghai in 2022.  For a full list of participating artists and institutions, including a full list of the participating galleries, click here. The Melbourne Biennial will be held at the Fairgrounds at Central and will be announced later this year. The first public exhibition of the new eight-thousand-piece museum will open in the city in May 2020.\n\n\nOn Saturday, the Israeli–Palestinian conflict entered a second year with the demilitarization of the West Bank city of Nablus, following months of demonstrations and strikes across the West Bank and the Gaza Strip. The Israeli Civil Administration (CAA) confirmed that a total of ten people were lightly injured when a group of around a hundred Palestinians threw stones at soldiers near the Israeli-occupied West Bank village of Deir al-Balah, sparking clashes that left one soldier lightly wounded.The CAA confirmed that twenty-four Palestinians were detained for throwing stones, but the number is likely much higher, as clashes between Palestinians and soldiers are a daily occurrence in the West Bank. The CAA did not specify whether the individuals were members of a suspected terror cell. The CAA did not give any details about the clashes, other than to say that there", "The next Biennial should take place in 2022. On the 18th of March, the newly created Art Peadortium will hold its first exhibition.\n\n\nThe Victorian-era Victorian Grand Hotel in London has been restored to its original glass and steel form. The hotel, which has been restored by the Tate Modern in partnership with the Southbank Centre, is a World War II era gem located in the city. The hotel was completed in 1937 and featured guest rooms in a Victorian terraced house designed by Lord Adonis.The restoration project was led by British architecture and landscape artist Matt Writtle, who also worked on the renovation of the Grand Hotel in 1980. In the 1980s, Writtle collaborated with local artists and writers such as the Turner Prize–winning artist Paul Nash and the International Art Museum St. Ives to create a series of works by local artists that were exhibited at the Art Peadortium’s World War II exhibition in 1981. \n\n\nThe newly rebranded ROSEN Museum of Art in New York City has added four new members to its board of directors: Katarina Glanz, director of the independent nonprofit National Gallery of Art; Paul Spero, head of the Brookdale Museum of Art", "The next Biennial should be held in London in the spring of 2021 and should include an exhibition of work by more than sixty artists worldwide. Daniela Alemani, director of the Biennale di Venezia and a curator at the Italian museum, told a news conference: “In the next few years we will see the works of a new generation of artists as they participate in this new exhibition, which will be a love letter to the Italian city and city of Venice. These artists are creating their own futures in the past, the present, and the future, and so we hope that they will become part of it.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it has received a gift of twenty-six works by women artists\u0097Artsangela Hernández, Caridad Cervetto, Christine Camarota, and Lucio Fontana\u0097that were previously unopened and on display in its collection. The works, which were acquired by MoCA as part of a larger exhibition of work by women artists at the Museum in 2001, were on loan to the institution for its exhibition “Women in Art” (2019).“It is a tremendous honor to", "The next Biennial should be announced early next year.\n\nThe Design Museum of Chicago announced today that it is extending its closing party for the upcoming edition of the Museum of Contemporary Art (MoCA) through March 20. The event will be held at the Chicago Art Museum, where it will run again next year, and will now be held at the Public Theater. “We are delighted to extend our closing party to March 20, and to return the audience to our historic venue,” said Helen Y. Davis, chair of the board of trustees of the biennial and president of the Chicago Cultural Alliance. The announcement follows a survey conducted by the Cultural Fund of the City of Chicago, which found that 70 percent of visitors to MoCA are dissatisfied with the museum’s work-in-progress program, which will focus on works that have not yet been exhibited or mounted. The survey also found that 40 percent of visitors planned to come back for the 2018 edition, and 43 percent said they would be willing to pay an additional $125 for participantships in the biennial’s VIP preview days. “We are disappointed that the VIP preview days have expired, but we understand the importance of these days, and we hope that the public", "The next Biennial should take place in the spring of 2020. \n\n\nThe Italian government has designated a site for the reconstruction in the capital of the northern province of Pozzallo of a prehistoric town dating back to the Neolithic era. The town, named after a mountain in the Togolese region of Pozzallo, is a UNESCO World Heritage site and was restored by the Italian architects Dario Catellani and Stefano Cipolletta, who are collaborating on the project to bring the world-famous Villa di Rivoli to its feet.“The renovation of the Villa di Rivoli is a significant step in the restoration of the past, in its construction and preservation,” said minister of tourism Beppe Grillo. “The project will be a reflection of the government’s vision of Pozzallo as a city of innovation. Pozzallo is a city of artists, scientists, writers, and entrepreneurs, whose culture demands extraordinary measures of artistic production. The renovation of the Villa di Rivoli will not only show the Italian people the future of the city, but also the history of the villa and of Pozzallo.”The project will involve the following activities: 1. The construction of an", "The next Biennial should be held at the Museum of Fine Arts, Boston, in 2021. \nThe current exhibition, “Sittels.” The show is a public celebration of the German architect Joseph Becker, the founder of the firm AFD. The exhibition, which honors the work of sculptors Karl-Heinrich and Ludwig Mies van der Rohe, is part of the “Sittels Collaboration,” a project of the German National Museum that was inaugurated by Washington, DC–based artist Janice Schäfer and is currently led by Joachim Ziegler of Max’s Island. The exhibit will feature work by seventy-five artists, every member of the Frankfurt-based collective Ziegler Associates, and Joseph Sittels, whose first major exhibition in the United States, “The Architecture of Life” (2019), took place at the Metropolitan Museum of Art in New York. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Christina Simonson as its next director. Simonson most recently served as deputy director of development at the Los Angeles County Museum of Art (LACMA), where she helmed the reinstallation of the museum", "The next Biennial should be held in 2020, and hopefully, the first in 2021. The next one in 2022. We are also trying to think of ways through which we can continue to support the artists, the institutions, the missions, and the livelihoods of these artists.” The exhibition will also include a selection of “Renga Yilmaz” paintings by Icelandic artist Ólind Stefansson; “Bila Senan” paintings by Chinese artist Jiang Mei; and a selection of photographs by Spanish photographer Íñigo Pérez-Fortin.The next edition of the biennial, a joint initiative of the Biennial Association and Art Madrid, will take place in September 2020. Tickets to the first edition, titled “Heroics,” were on sale for just €45\u0097the price of the most recent edition\u0097from September 10 to September 13, 2020. The biennial will also include a new series of performances and other events, curated by artists and artists-in-residence, which will be staged at various locations across Madrid and the city of Fuerteventura. A retrospective of the artist-reputed Shih Chien-Soft", "The next Biennial should be held in the spring of 2020. For a full list of awardees, click here. \n\nThe Museum of Fine Arts (MFA) in Boston has received a $1 million donation from the estate of Elizabeth Peyton-Souza, one of the world’s foremost painters and a leading advocate for the development of post-Painter Biennials. The gift is the culmination of years of work by MFA director John Currin and philanthropist Eleanor and their collaboration with the Sacklers and with the Museum of Fine Arts (MoFA) across the United States, India, and the Himalayas.“Elizabeth was an inspiration to me and to many others who knew her and was a joy to work with,” said Currin. “In the nearly forty years that I have worked at the museum, she continued to work with the Sacklers to explore post-Painter, exploring the possibility of creating an institution where painters could return to their work and find expression in the art of their lifetime. I’m deeply honored to support her legacy through this gift.”The gift was made in recognition of her enduring legacy and her innovative and forward-thinking art—her work has", "The next Biennial should, like that of our predecessors, be a celebration of life and art\u0097and the richness of life and art. I look forward to working with my fellow curators, the upcoming exhibition, and the biennial in the coming months.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of seventy-five African American artworks from the Black Panther Party in California. The works, which were made in the 1940s, are housed in a collection that will undergo a major renovation, which is scheduled to begin in January 2021, with the goal of making MoCA the city’s first historically-based Black museum. The renovation will include the restoration of the nineteenth-century building, which was converted into a Black museum in 1975, and the installation of the museum’s first exhibition of work by an African American artist, the exhibition “No More Deaths: From the Black Panther Museum” (2019–20).Based in the Black Panther Party’s hometown of Birmingham, Alabama, the renovation project will include the creation of a new outdoor courtyard in the museum’s former location on the northeast corner of Wilshire and Santa Monica Streets, as well as the restoration of the Panthers", "The next Biennial should take place in 2020 and will be held in Helsinki, Finland, the first of its kind in the world. The 2020 edition will be titled “The Future Is Present and We Are All Still Here,” and will include an exhibition of work by twenty-three artists, including Olof Palme, Lise Antin, and Hanna Vaskar. The complete list of participants is as follows:\n\nTotal Area: The venue will be located on the city’s Central Library Complex, which opened to the public in 2010, and will host the exhibition, “The Future Is Present and We Are All Still Here,” in partnership with the Helsinki Institute of Contemporary Arts (HIE).The exhibition, which has been described as “a triumph of humanism, a celebration of the future,” will also feature work by eight artists, including Erik DeGrasse, Yinka Shonibare, and Lisa Su, as well as fifty-two objects, including a giant, twenty-foot-long sculpture by the artist Nari Ward, an installation of photographs by the artist Wolfgang Klee, and the full collection of the artist Brian Eno. The exhibition will run for two weeks, from", "The next Biennial should be held in 2020 and will bring together a team of thirty artists, including Mike Kelley, Alighiero Aioni, and GM Ortega y Gasset, to create a new exhibition that will be curated by the same team. \n\n\nResearchers at the Scripps Institute of Oceanography in La Jolla, California, have discovered a new species of jellyfish, called pseudobasselms, that are capable of dynamic, underwater sculpture. Based on a microscopic analysis of its tissue, the results indicate that these bizarre creatures, which are about the size of jellyfish, are capable of creating works of art.“Our work has to start from a very fundamental question: why is it that certain kinds of art are so pervasive in nature, so tightly integrated into the fabric of things, and yet so rarely made alive,” said researcher James Cuno, who is based at the institute and has published numerous books about jellyfish, including Jellyfish, 2011, Jellyfish: The Biology of an Ecology, and Jellyfish II: The Ecology of Art, which was recently nominated for a Pulitzer. “As we continue to study these organisms and the mechanisms that govern", "The next Biennial should take place in 2020. In her statement on the matter, the artist said: “I am very excited to be working with the talented team of artists who are creating works that will be presented in the next Biennial. I have been a long-term supporter of the Artists’ Studio and feel that it is a key to the future of the Biennial.”\n\n\nThe Metropolitan Museum of Art (MoMA) has created a new position for a curator of modern and contemporary art. The new position, which was created as part of the museum’s celebration of its sixtieth anniversary, will be created in the art department in the museum’s new building and will take up a ten-month appointment. The appointment was made following a yearlong search for the new position, which is considered the most important in the museum.The search was led by museum director Daniel H. Weiss and curator Rachel Weisz. Weiss said that the curator will be responsible for “reconceptualizing and exploring the relationship between modern and contemporary art and the ideas and experiences that MoMA has fostered since its founding.”\n\n\nThe Davis Museum of Art in Orange County, California, has appointed Brooke Sim", "The next Biennial should be held in 2020, and the first in 2021. “The exhibition will be a continuation of Biennial I, which was held in St. Louis in 1956,” said the artist.   “The exhibition’s theme will be the fusion of art and science in the contemporary world.”  The curators of the 2020 iteration, Georgia O’Keeffe, Robert Irwin, and Gershom Scholem, are all working on their next project together.The upcoming exhibition will focus on “Woodstock,” a work by the artist which addresses the history of the festival, and will be staged at the Centro de Artes Plásticas in Madrid. Dittrich-Ferry, who is based in London, said: “We are very much in touch with the artist, and he has been very responsive to our wishes and expectations. The process of creating and staging an exhibition is an ongoing creative process, and it’s a process that takes a long time to produce.”\n\n\nThe University of the Arts (UCA) in London announced today that it is planning to lay off nearly 150 staff members, or about a third of its staff", "The next Biennial should take place in 2020. \nDavid K. Galloway, chair of the museum’s board of trustees and the Los Angeles County Museum of Art, said: “We’re excited to be bringing together the Art of the Party in 2020 to give the California Institute of Technology (Caltech) and UCLA students the opportunity to experience the original works of more than two thousand artists in this exhibition.”\n\n\nThe Antenna Museum in Athens, Greece, has unveiled a new collaboration between the museum and the Turner Prize–winning show “Code Switch.” The partnership, which will begin this fall, will include programming that addresses issues of digital access, digital surveillance, and digital displacement, and will also involve the installation of “Code Switch: Greek Art from the Fall of 1944 to the Present.”The exhibition, which will focus on “digital surveillance” and “digital displacement”\u0097in which the artists will take part in “Frame”\u0097will open at the Antenna on September 2. The exhibition will highlight the work of seventy-two artists from Greece, Italy, and Turkey. In addition to depicting the posters by the artists, the show will teach visitors", "The next Biennial should be held in 2021. The institution was founded by the Czech architect Marija Bondarek and the Hungarian-born architect Speziela in 1988. Its current exhibition, “Amerikanerische Kunst', is the last work of the series, which was organized by the collaboration between Alfred Wegener Institute and the Theosophical Society in Budapest.\n\n\nThe Chinese artist Li Xianfu, who, in the late 1990s, painted portraits of himself and other male artists he admired, died in Beijing on February 4. He was eighty-three years old.Li was born in Beijing in 1932 and emigrated to Shanghai in 1937. Upon arrival in the city in 1941, he began painting, which he attributed to his native country. Subsequently, he began to show his work in the late ’50s and began his career as a painter, sculptor, and photographer. He made his first film in 1958, when he was twenty-four years old. However, it wasn’t until 1968 that he began making works that were on view in galleries, museums, and museums. Li Xianfu’s paintings were often influenced in their coloring by Chinese artists, especially Mao Tse-Tung", "The next Biennial should take place at the Museum of Modern Art in New York in 2022. Earlier this year, the Institute of Contemporary Arts in Paris announced that it would also invite a group of thirty-six leading arts professionals to the city for a new exhibition. Emma Donoghue, director of the United States-based Center for a Contemporary History in New York, called the move a “great day for discovering the art of the future.”\n\n\nArt historian Tanya Bonakdar, a leading curator who taught at the University of California Los Angeles and the Museum of Modern Art, has been selected to represent the United States at the Fifty-Ninth Venice Biennale, which will run from May to November in 2021. The eighty-five-year-old British art historian will represent the United States at the event, entitled “American Art,” which will host seventy-eight artists and collectives in September.Bonakdar, who has been a curator since 1998, was chosen for her encyclopedic knowledge of American art and her commitment to drawing. Her first project with the US pavilion will be “Toppling the Walls: Art in the Age of Black Power” (2019),", "The next Biennial should take place in 2021, at the newly renovated and renovated-in-the-making Museum of Modern Art, which will be inaugurated by a new work by the artist Thomas Dolce, entitled 'Angel of American Art.” The artist’s new installation, entitled “Elevator,” will draw upon his experiences as an elevator operator and his travels throughout Europe and the United States in order to explore themes of gender and how they are constructed through everyday life.The Biennial will also present a new exhibition of work by the artist’s contemporary, Antonio Campos-Delfina, which was staged at the Tüdikó Museum in Lisbon last year. The show will consist of fifty works, spanning from the 1960s to the 1980s, and will open at the Tüdikó Museum on September 8. “The Future Is Present,” a series of paintings by the artist, will be presented at the Tüdikó Museum on September 21. “By Albert Camus,” will be shown at the Kogarth Museum of Art in London on September 22. The second Biennial exhibition will be presented at the Museum of Modern Art", "The next Biennial should be held at the Toronto Art Gallery in May 2020, followed by the art-world fairs Art Basel and Art Dubai in March 2021. The biennial’s future could be in jeopardy if the European Commission does not act quickly to suspend the construction of the European Regional Development Fund for the Arts and to change the European Union’s budgetary rules. The decision to cancel the annual prize was made during a meeting of the European Union’s executive committee on March 13. The commission decided to open the biennial to the public instead of the participating institutions, which are currently closed to the general public. The event’s organizers said that the redesign of the fair was designed to avoid “the most sensitive information necessary for the construction of a protective cloud for the art, which will inevitably result in a loss of an extraordinary number of works.”The redesign includes new themes, new locations, and new exhibition spaces in addition to the galleries and exhibition spaces that have been traditionally organized. The redesign also includes a redesign of the fair’s programs, which include a new spring/summer edition, the first time the fair will open in the UK since 1983, and a new theme: “art of", "The next Biennial should take place at the Peter Jackson house at USC in Los Angeles in 2022. With the completion of the 20th Century Exhibition, which will also take place at the house next year, the artists have now decided to postpone the twenty-fifth edition to 2024. The deadline for the exhibition is now December 20. The Biennial will face stiff competition from other major UCCA events, including the San Francisco Museum of Modern Art (SFMoMA), which is currently working on a new iteration of the exhibition; and the New Museum, which recently launched a new online platform for contemporary art, Live View, in partnership with Art Basel Hong Kong. The 2018 Biennial was marked by a number of stylistic shifts, including a break from the immersive work of the previous decade to focus more on the show of a collection of works.The 2017 edition of the Biennial, entitled “The Black Years,” featured twenty-nine works by forty-seven artists, including Jared Leto, Apichatpong Weerasethakul, and Jumana Rodriguez-Alvarez.  “We are so proud to present the first ever ‘The Black Years’ at the", "The next Biennial should be held in 2021. The full list of participating artists is as follows:Adriana Barredo (Mexico City)Benedict Bowen (Toronto)Daniel Boone (New York)Cara Catellani (New York)Cara DiCaoco (New York)Caramel López (New York)Carol Otero (New York)Yael Weizman (New York) Cara Parrott (New York)Tad Brooks (New York)Naomi Barovitz (New York)Tadao Ando (New York)Borat Szymczyk (New York)Elvia Burnett (New York)Lydia Bartlett (New York)Celina Borthwick (New York)Samantha Britten (New York)Keiichi Hanae (New York)Brianna Harrell (New York)Jessica Hazelden (New York)Cara Hoberman (New York)Jeremy Howard (New York)Arisi Ponti (New York)Broughta Hauptman (New York)Melissa Hely (New York)Marianne Jones (New York)Jill Jones (New York)", "The next Biennial should be held at a location that will be connected to the Zürich Art Museum, in an attempt to avoid overcrowding, in order to avoid unnecessary travel and to meet the museum’s demands for more exhibitions, a library, a café, and other facilities.“We are working hard to make public transport as easy to use as possible, in order to make the Biennial a reality,” said museum director Joachim Neugroschel. “We will continue to listen to and consider the suggestions from our visitors, and will consider new ways of organizing exhibitions, including the possibility of an online version of the Biennial.”\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it has received a gift from China. In a series of twenty-nine works, titled The Three Young Men’s Years, 1943–1945, and 1946–1949, the Chinese artist Mie Pui-Lin is the subject of a new exhibition at the museum. The show, titled A Short History of Lies, is curated by Marc-Olivier Boucher, director of the Renzo Piano Museum in Rome, and focuses on the history", "The next Biennial should be held in the autumn of 2022. I also want to see new exhibitions and screenings, new projects, and the development of the Festival as a whole. We are currently working hard to find a new location for the Festival and to register all of Barcelona. I hope this is a step in the right direction and that it will be a good opportunity for the community to see the works of the biennial artists and to experience the Biennial in its various incarnations. ”The biennial will be moved to a new venue in the city of Mallorca, and a new exhibition will be held every September. The new structure will also include a permanent collection of some seventy artworks.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Mark A. Bradford as its new associate curator of twentieth-century art. Bradford will be responsible for curating the exhibition “Avantgardes in Exile” (2018) and the exhibition “Postwar” (2019) and will assume his responsibilities on June 1.“Mark is a consummate curator, whose practice spans the breadth of contemporary art and is uniquely positioned to play a critical role in developing the museum’s collection", "The next Biennial should be held in 2022.\n\n\nThe Baltimore Museum of Art (BMA) is planning to open a new public art museum in the city next year. The institution, which has been under construction since 2007, will be located in a former CVS pharmacy on East Baltimore Street. The new museum will be called the BMA West.The arts and culture hub will offer free admission for adults and will boast over two thousand square feet of exhibition space, a restaurant, and a children’s play area. Set to open in 2021, the new museum is being produced by the architectural firm of MCH Group and will be financed by a combination of private donations and the city’s general fund.Pace, the nonprofit arts organization, is responsible for the design of the new BMA. In a statement, the organization praised the BMA for collaborating with the city to ensure the museum’s safety and security, for participating in the city’s planning process, and for collaborating with local, regional, and national partners in the design of the facility.“The BMA’s involvement in the city’s arts and culture community is instrumental in ensuring that the new museum will provide a meaningful and exciting environment for", "The next Biennial should be held in 2020. The next series of exhibitions should be staged in 2021 and 2022. All of the above would be possible without the essential contributions of the entire team of curators, artists, writers, and educators over the last fifteen years.The Diversity of Presentations: A Visual History project, chaired by the curators and curator of modern art William Kristogod, will present a series of three works each year. “We are confident that the new Museum of Modern Art will continue to explore and create new material from the most difficult visual histories and may well become a landmark in the ongoing feminist and LGBTQQQ+ eras,” Kristogod said.The humanist and social justice movements, which were sparked by the Civil Rights Movement in the United States, were met with a resurgence of activism in the 1960s and ’70s in the United States. The ’70s saw the formation of the Black Arts Initiative, the seminal project of the Black Arts Council, and Black Arts Denver, which sought to draw attention to the civil rights movement. As a result, the Museum of Contemporary Art (MoCA) in Los Angeles commissioned the work of the Denver-based artist Imani Gandy.Gandy", "The next Biennial should be held at the Athlete’s home country, in the month of June, and will take place in the city of São Paulo, Brazil. The exhibition will include works that were selected for the event by a jury comprising artist Paolo Tadeo; curator of the Brazilian art movement Irena Cesarco; and Kunstbibliothät Berlin.\n\n\nThe Venus Arts Center in West Palm Beach, Florida, has launched a new, year-round programming initiative that will provide a respite from the city’s downtown sprawl by focusing on the cultural and recreational assets of the United States. Starting in May, the initiative will focus on building relationships between local and national arts institutions and will bring together artists and visitors from all over the world. It will also provide artist residency opportunities and will include a residency-based residency fund. While the center will present work by a wide range of artists—including the Yemeni-born, Quebec-based Abdullah Al-Saadi (pictured above), whose practice combines performance, sculpture, and installation—the three-month residency will focus on constructing lasting relationships between the United States and Italy. The first phase of the program, which will involve the development of a local", "The next Biennial should provide an opportunity to present the work of a group of artists who have recently participated, or recently are currently participating, in the exhibition. The Biennial would not be able to function without the support of the public, and this support should begin with a biennial exhibition. The Biennial, as a public project, would benefit from public participation.”\n\n\nThe French state-run Bourse de Commerce (BAC) has removed two hundred artworks from its shelves amid concerns over the spread of Covid-19, but the cultural institution was not deterred by the number of works in the collection, which includes works by artists such as Jean-Michel Basquiat, Vivian Gray, and Jean-Michel Perrot, and its current run of ninety-six works by artists in their seventies.The BAC’s president, Christian Chenebault, explained that the institution decided to halt the sale of works by artists in their sixties after the institution received fifty inquiries about the works from collectors who did not believe that the seventy-five works by the group known as the Bourse de Commerce et de l'Art Contemporain (BCCA), which began in the 1970s, could be", "The next Biennial should be held in the fall of 2022. “The biennial is a very important moment for us,” said Adele de Queiro, the director of the Museum of Modern Art. “We are very much looking forward to the exhibition of the show in 2021. The exhibition is a great platform to develop new works, to discuss ART’s history, and to present the works of our own artists in a unique way.”The biennial will take place in several locations in São Paulo, including the Museu de Arte de São Paulo (MSAB), the Museu de Artes Centros (MAS), and the Museu de Beyeler (MBA), and will comprise twenty-four artists\u0097Dario de Araújo-Santiago, Hélio de Alvear, Joachim Neumann, Silke Nedergaard, Mickaëla Palti, Sebastian Pape, and Tania Pérez de Olza\u0097as well as a collection of three collections of early modern art: the collection of Hiroshima University Art Museum (HSUM), the collection of the Museu", "The next Biennial should be held in 2021, according to Steve Coogan, the director of the museum and a former president of the museum, and he suggested that the institution could extend the theme beyond that year.  At the museum, the exhibition “Aristotle and the Future of Modern Art” will remain on view until January 27, 2022.Commenting on the exhibition, Patrick McLaren, a curator at the museum, said: “We are creating a new space next year that will address the theme of the last fifteen years and bring together contemporary artists. We cannot wait to see what the future holds. . . . We want to be part of it.”\n\n\nThe Italian architect, whose geometric style influenced the Galerie Klee and whose houses include the Neue Galerie in New York and the Neue Rämst in Cologne, has been selected as the winner of the 2019 DANC Design Award. The prize, which was established in 2005 to recognize architectural achievement in the United States, will be presented at a ceremony in Los Angeles on January 16.The biennial will explore the interconnections between the modern and the natural, with the theme “out of order.” The exhibition will include the work", "The next Biennial should be held in the spring of 2021. As it does not yet have a site, it will be hosted at the City of New Haven.“The City of New Haven has been a leading partner in the redevelopment of our community. It was the site of the original home for Yale University’s Art Gallery; the site where Yale Art Gallery and the Yale Center for Art and Design were built; and it was even the site of the Yale Museum of Art,” said Kennealy. “We are grateful to the City of New Haven and to the many community members who have worked with the City to make the biennial possible. We look forward to seeing you next year.”\n\n\nThe National Gallery of Art (NGA) in Washington, DC, has commenced the process of removing a large portion of the museum’s holdings of the Confederate-era works that endured through the dismantling of the institution’s former property, the Smithsonian American Art Museum, in March 2019. The decision to dispose of the works in a manner that preserves the collection and preserves the institution’s relationship with the state—the NGA’s current policy of returning works to the federal government when they are no longer", "The next Biennial should take place in the summer of 2021, and will be organized as follows: Biennial of the Contemporary Art, New York; Art of the Digital Age, Chicago; and Art of the Future, New York.“The new series of #ArtistsOfTheYear will showcase the work of fifty artists whose work represents the future of art and culture in the United States, exploring the relationships between art and technology, the modern and the natural, and the urban and rural landscapes of the United States,” said Richard Armstrong, chair of the museum, and director of the Brooklyn Museum.Over its thirty-year history, the biennial has presented artists with a variety of international residencies, including artists-in-residence (Avital Shaffrey, Eliot & Edda; Bromley Taggart, Jersey City; Robert Irwin, New York; Paul Gauguin, New York), artists-on-voluntary contracts (Sara A. Davis, New York; Rosalind S. Hochner, New York), artists-on-voluntary contracts (Diana Al-Hadid, New York), artists-on-voluntary contracts (Liz Alonso-", "The next Biennial should be held at least ten years from now, and should include a selection of works that always have a clear aesthetic, in keeping with the current time, and in keeping with what the authors, artists, or audiences have in mind. The museum should not only be able to display the work as soon as it is completed, but should also be able to provide a platform for the artists whose work is represented in the exhibition.The exhibition will be a gift from the artist and museum to further the career aspirations of the participants. It will also include a selection of the paintings and drawings that are currently on display in the exhibition, as well as “The Temporary State,” an exhibition of contemporary art created during the dictatorship of Ferdinand Marcos.The work of the artists represented in the exhibition is a selection of their works, which were made in a variety of mediums, including painting and drawing, sculpture, and installation, and will be shown together with their work, which was not part of the Biennial, in a limited edition of twenty four works, which will be opened for the public by the artist Zoraida Ayala in December.The exhibition will be held at the Universidad de los Andes in Bogotá. The artists", "The next Biennial should take place in 2021 – twenty years after the event’s last iteration, at which point the museum’s collection would be refurbished and relocated to a new home.  About half of the fifty-three pieces in the exhibition’s collection are currently on display in the museum’s new permanent collection. The rest of the collection will be moved to the Museum of Fine Arts (MFA), Miami Beach, where it will undergo a major renovation in the future. “The Biatenary has become one of the most important institutions in the world to the greater Miami Beach community,” said Mark Cuban, the owner of the Dallas Mavericks basketball team. The hermitage also added an entirely new section titled The Biatenary Zone, a watershed exhibition that will feature works by eighty-eight contemporary artists, including Nari Ward, Tanya and Irena C. Mattern, and Néstor McSweeney. In addition, the biennial will become a platform for the spread of the A.I.R. Gallery's new micro-scale bronze sculpture, The Biatenary. “This new collection will engage in a new kind of interdisciplinary exhibition", "The next Biennial should open in 2021.\n\n\nSydney’s Museum of Contemporary Art (MCA) has added two new members to its board of trustees: publisher and philanthropist J. Alan Austin and his wife, Nancy. Together with their son, David Austin, they have served as co-chairs of the museum’s creative advisory council.“The establishment of the MCA’s senior advisory council is a major milestone in the museum’s history and is instrumental in ensuring that the MCA continues to thrive as an international art museum,” said David Austin. “The MCA’s new members reflect incredibly talented and dedicated curators and art experts, as well as the museum’s longstanding commitment to supporting the contemporary arts. I’m proud to work with my colleagues and I’m excited to see where the MCA will go in the next decade.”\n\n\nThe National Galleries of Scotland have announced the appointment of Alexandra Higgitt as director of its new institution, the National Galleries Edinburgh, which will open in March 2021. Higgitt comes to the institution from the Royal College of Art, where she serves as deputy director for", "The next Biennial should take place in 2021, but the organizers are encouraging artists to submit works in 2024.\n\n\nThe British painter Richard Just, who often drew from nature, architecture, and the social and political status quo, has died at the age of eighty-three. His work has been collected by the Tate, the National Portrait Gallery, and the British Museum, and has been exhibited at the Museum of Fine Arts, London, the Museum of Modern Art, the Metropolitan Museum of Art, and the Whitney Museum of American Art.Born in London in 1903, the artist moved to Paris in the 1930s, where he studied under the influence of the French surrealist Henri Lévy. He then returned to the UK, where he enrolled at the London School of Art, and studied at the Durslade School, the National College of Art, the Royal Academy of Arts, and the Institute of Contemporary Art, London, before leaving France in the early 1940s.While in the US, Just became involved in the anti-war protests in Vietnam and became involved in the anti-war and social justice movements. In the mid-sixties, he moved to New York and began working on his debut exhibition, the iconic 1967 installation Rubber Soul, an", "The next Biennial should focus on the art of social movement, and on the activities and movements of artists and activists in an increasingly connected world.” Linh-Manuela has previously curated the Fifty-Fifty: A Feminist History (2016), and is currently the principal curator of the Philippine Architecture Biennial, taking up the position in March 2020.\n\n\nThe National Gallery in London has appointed new director Matthew Booth as its next director. Booth will be responsible for shaping the biennial’s trajectory and direction, while ensuring the gallery’s long-term financial health and expanding its collection beyond contemporary art.He succeeds Tony Hall, who has served as the gallery’s director since 2015, and will assume his responsibilities on January 20, 2020.“The National Gallery is thrilled to welcome Matthew to its team,” said director Max Hill. “With regards to the curatorial team, it is a formidable team and Matthew has been a valued mentor and supporter over the last few years. We are confident that his work will further our institutional and public engagement with contemporary artists and artists of all fields and will complement the work of the talented and dedicated staff.”Hall’s first major solo exhibition as director was “", "The next Biennial should be held in the third quarter of 2020.”\n\n\nBritish artist Graham Bond, whose splintered, almost impenetrable canvases blend painterly and sculptural elements as well as the abstract, has died at age eighty-five.Bond’s recent biennial shows how the monochromatic, the utilitarian, and the utilitarian-based can hold different meanings regarding art and the medium. The first show, “Art and the Punk” (2019), featured artists such as Helen Shiner, Tanya Van de West, and John Akomfrah, alongside an assortment of works that explored themes such as the power of movement and the materiality of man-made objects. The second show, “Trinity” (2019), premiered at the Museum of Modern Art in New York and brought together works by such notable British artists as Richard Avedon, Terence Blanchard, and Robert Irwin.In a review of the second show, John Lanchester wrote: “Bond’s female protagonists are almost entirely male, their images and narratives often composed of clothing or accessories or posed in a provocatively feminine way. Not for nothing is the many titles of recent biennial", "The next Biennial should be held in January 2020. The exhibition will draw fifty-four artists from thirty-six countries and will be hosted by the museum in partnership with the National Geographic Society.\n\n\nThe Mondrian Foundation in the United Kingdom has announced that it is shifting its focus from grantmaking to education initiatives. The foundation will divert $3.5 million from its annual grant program to create a new $5 million fund for arts education and training, which will then be given to local and independent arts organizations.“The Mondrian Foundation is committed to supporting the arts in all their spirit and richness,” said foundation president Charlotte Dawson. “The new money will allow the foundation to invest more in local and independent arts organizations, and be more effective in that effort. It will also allow us to make a greater investment in the careers of those who work in the arts. We are all in this together.” The new funding stream came after the foundation made a major grant to the Leeds School of Art, which resulted in the establishment of the Leeds Centre for Arts (LAC), an independent arts space in a former shipyard in the city of Leeds. The grant also saw the foundation pay for the acquisition of the grounds and the building of", "The next Biennial should conclude in 2021.The institution said it was evaluating the venue and the artists who will be featured in the biennial. The theme of the upcoming exhibition is “the evolution of art, and the way it is practiced.”\n\n\nThe Frankfurt Art Museum (FAM) in Germany has received a gift of forty-three works by twenty-nine artists from the United States in a show that was organized by the Modern Art Foundation in collaboration with the William S. Burroughs Foundation and the New York–based Artist’s Alliance. The gift includes works by artists such as Alice Aycock, Jocelyn Gail, and Henry Luce, as well as works by more than twenty-five other artists who were represented in the exhibition “Prospect: Art and Symbolism” (2017–18), which opened on August 31.“Artists have played a central role in shaping the future directions of modern and contemporary art through their work,” said the artist’s alliance president Tobias Langenthal. “Frederick Osterhaf, Peter Zumthor, and Hans Christian Andersen were among the most important early practitioners of painting, and their works are still widely used today.", "The next Biennial should be held in April 2022. The event will be led by a selection group comprising representatives of the public and private sectors, including the Arts Council and the Institute of Contemporary Art, London; the National Galleries of Scotland; and the London-based architect and urban designer Apang Barua.\n\n\nThe National Gallery in London has closed its doors on March 31, 2019 in protest of the reopening of the Metropolitan Museum of Art, where it has been slated to reopen this summer. The institution has been working at a standstill since March 20, when it announced that it would reissue an exhibition of works by the Metropolitan Museum of Art’s current exhibition. The announcement followed a three-week moratorium on exhibition renovations and construction, which has effectively kept the museum closed since March 13.The closure has sparked protests from some quarters, including from London’s Public Health Agency (PHA), which has called for the museum’s outdoor admission charges to be cut by $1 to $2, and other arts groups, such as the British Authors’ Association, who have pushed for the institution to return some of the cash generated by the Met’s two-hundred and fiftieth-anniversary celebrations. In", "The next Biennial should take place in 2022 and the twentieth in 2024. The museum is currently working on developing a new collection exhibition program that will be presented by multiple authors in the exhibition, which will explore issues of sustainability and the biennial. The new program will be presented by relevant published works alongside a selection of contemporary artists. The biennial will also receive a £100,000 grant from the Arts Council.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has acquired the estate of the late English architect HP Lovecraft, who is best known for creating atmospheric, multilayered structures that opened up his sprawling, open-concept living quarters. The lineup of works in the museum’s permanent collection, located in a private collection building on West Twenty-Third Street in Los Angeles, includes an early work by the late British architect, whose work is housed in the collection since 1998\u0097the eight-story, eight-way, dome-shaped home is the centerpiece of Museum’s L.A. outpost.“In a time when the museum has been transformed by a $12 billion expansion project, and the cultural landscape of Los Angeles has undergone a ferocious rebranding, it is particularly important that we continue to present", "The next Biennial should take place at the Museum of Modern Art, in New York, which would be transformed into a larger-scale version of the museum. The show will be fully restored and will reopen in 2017.The institution has also embarked on a major expansion, which will see the museum expand to a six-acre campus and add a new permanent exhibition that will inaugurate the new Museum of Modern Art. While the new space will be dedicated to the works of contemporary artists, the exhibition will remain in its original location, on the first floor of the building. The new museum will be inaugurated by a new selection of works created by the Philadelphia–based group Nari Ward and curated by Louis Vuitton auctioneer Pierre Auger.Auger’s work, Triumph of the Body, will be on view for the first time in the museum’s history. It will be on view in the exhibition “Twenty-One/” (1948–9).The Hong Kong branch of the new exhibition will also welcome a selection of the Hong Kong-born artist’s works and a selection of his studio, which will be organized into three categories: sculpture, video, and installation.Hong Kong will stage the first", "The next Biennial should take place at the newly renovated Cortina de Castro, in San Juan, Puerto Rico, in the fall of 2021. The first exhibition will be comprised of films and other works, curated by the New York–based artist Hollis Taggart, and will be on view through March 23. The second, titled “We Live Together,” will open on April 23 and will feature paintings by the artist as well as works by lesser-known artists such as Jean-Michel Basquiat.\n\n\nHollis Taggart has announced that it is reopening the exhibition “We Live Together”\u0097the last show she curated before her death in 2018\u0097after a five-year hiatus. The exhibition will return in March 2022, at the invitation of the Haus der Kunst, in Kassel, Germany.Taggart’s work, which was featured in the exhibition “Europa” (2019) and “Reality Or Death” (2019), was shown at the Uffizi Gallery in Florence for an eighteen-month stint, from January 26, 2020, to December 31, 2020, and at the Nationalgalerie in Berlin for a second stint", "The next Biennial should be announced within two weeks. “In order to make a strong statement in the ongoing efforts to reform the art market and increase the accessibility of contemporary art, and to continue the work of making the most of the Biennial, we have decided to postpone the forthcoming exhibition to March 2022, and to begin the construction of the Biennial Plaza,” the panel of artists said in a joint statement. The conceptual works for the exhibition were unveiled last month at the 2013 Venice Biennale, the first major exhibition of new work in the city of Venice since the 1960s.\n\n\nNew York–based artist and educator Vinnie Bagwell will serve as the next chair of the Whitney Museum of American Art. The fifty-seven-year-old Bagwell, who has been featured in more than seventy solo exhibitions across the United States, Canada, and Mexico, will take the helm of the institution in January 2021.Born in New York in 1938, Bagwell learned her craft as an artist-in-residence at the New Museum in New York, where she became a mentor to the likes of Christopher Wool, Mark di Suvero, and Sergei Gersenko. She would also go on to organize the exhibitions “", "The next Biennial should be held in 2019. The museum will hold a special exhibition entitled “The Present,” which will re-create the session for the 2014 festival, and will present the first exhibition of work by the new artists, “Anna Laudel,” in 2020. The next edition of the event will be held in 2021. “The Future Is Now (and Never Has Been Before)” will be curated by the same organizers as the first biennial, and will feature the work of Anna Laudel, Sara Aulie, and João Pereira. The biennial will run from March 10 to March 16, 2021. \n\n\n\n\n\nA rendering of the 2020 Venus Flytrax exhibition, “The Future Is Now,” which will explore the relevance of art and technology in the 21st century.\n\n\nThe Solomon R. Guggenheim Museum in New York has named Olli J. Guaraldi as its next director. Guaraldi comes to the institution from the Museum of Fine Arts, Houston, where he has served as director since 2013.“Olli Guaraldi’s vision for the future of", "The next Biennial should be held in 2022.\n\n\nThe Russian Academy of Fine Arts (RJA) in St. Petersburg is planning to add a new museum dedicated to the world’s first mass-produced works of art to its collection. The institution has filed a proposal with the State Duma, the lower house of the Russian parliament, for the acquisition of the three works by Russian avant-garde artists Aleksandr Solzhenitsyn, Fyodor Dostoyev, and N.I. Chernyshevsky, which are currently housed at the Museum of Fine Arts in Moscow, the state-run institution that oversees the three works.The proposed acquisition includes a bronze figure in the form of a sombrero and a large-scale landscape, which will be located next to the museum’s existing collection of works by Solzhenitsyn, Dostoyev, and Chernyshevsky. The works will be encased in twenty-one tons of solid gold and are expected to cost around $70 million.The acquisition was jointly funded by the Ministry of Culture and the State Duma, as part of a larger initiative to create an international platform for the exhibition of the works of the RJA’", "The next Biennial should be held in 2022.\n\n\nThe Burton Museum of Art in the United Kingdom announced today that it will host an exhibition dedicated to the artist Henri Matisse in 2021. The show will explore the relationship between the artist and the institution, which is currently under construction on the grounds of the Burton, and will include a retrospective of the artist’s most recent show at the Museum, “Matisse & Van Gogh: The Past and Present,” which opened earlier this month.The exhibition will be organized as follows: “The Future Is Not What It Used To Be” “The Rise Of The Artist As A Symbol Of The Freedom Of Expression”  The full list of the participating artists is as follows:Marc/Andre van der Vorst: Painting and sculpture. “The artist Henri Matisse has occupied a central position in art history since the early twentieth century, and a prominent role in modern art since the 1950s, when he became a member of the Vandevorst collective. Through his work, Matisse has been able to identify a time when painting was possible, and the Vandevorst members were able to experiment with painting, painting, art, and sculpture.", "The next Biennial should be held in 2021. The festival, which was founded by the American artist and educator David Salle in 1977, has been held on the third weekend of September since 2015. \n\nThe National Museum of Fine Arts (NMFA) in Grand Rapids, Michigan, has welcomed Tiffany Robinson to its board of directors. Robinson, who has worked at the museum for more than twenty years, has spearheaded a campaign to save the institution, which opened in 1963 as Michigan’s first museum dedicated to art and design, arts, and culture. She began by penning an open letter to the director of the museum in 2013, which was signed by more than one hundred past and present board members. The letter requested that the museum’s lease at 1230 S. Grand River Avenue be extended to allow the collection of works by Robert Irwin, William Kentridge, and Frank Gehry.In 2016, the museum began moving the works from its current home at 801 East Michigan Avenue to the newly renovated and expanded museum. Its current exhibition “Mercurial: Conceptual Art from the 1970s” (2019) is scheduled to reopen in September, and the museum is preparing to host an exhibition of work by American painter John David", "The next Biennial should be held at the Museo de Artes Público, in Lisbon, in 2022. To date, the art of the exhibition has been held in twenty-six countries and has been included in the encyclopedic Studi+ exhibition series in Amsterdam and Venice, the Rome Biennale and the Basel Art Biennale, and the Paris Art Biennale. The exhibition, which is curated by an intergenerational team comprising Julián Aranda, María Berrío, and Ana C. Sánchez, will be followed by a retrospective of work by the artists in the exhibition, which will be held at the Museum of Modern Art in New York, in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Mark Guggenheim as its next director. He will be responsible for overseeing the museum’s global philanthropic mission, which consists of the collection of more than four hundred works, and will assume his role at the institution on January 5, 2020. The appointment was made possible through a grant from MoMA’s board of trustees, which included a $500,000 donation from Gil and Frank Peruzzo, the partners", "The next Biennial should feature the work of fifteen contemporary artists, including Jane Panetta, Mark Boudreaux, Laura Owens, and Tawana Baidu. The first edition of the partnership was held in 1999 and featured work by twenty-three artists.​\n\n\nArtnews reports that ten artists have been awarded the Prix de la Direction septembre in Nice, France, for their contributions to the 2019 edition of the biennial. The artists\u0097all of whom are represented by the same gallery\u0097were chosen by the organizers from the list of ten nominated artists presented by the Paris-based association, known as the Paris Triennale, in February. The ten finalists were: Cornelissandra Bocelli, Dorota Caruana, Laura de Crespigny, Elisabetta Dietz, Bruno Haus, Luisa Laudilia, and Diana Mora.The honor was bestowed by the Paris-based organization, which was founded in 1994 as the Paris-based organization from which the Parisian Arts Council would be dissolved in 2000. The council was dissolved in 2003 when the World Trade Center collapsed, but its artists continue to be represented by their parent organization.“The Paris-based artists are the backbone", "The next Biennial should take place sometime between the dates of December 2020 and February 2021. It will also introduce new forms of educational programming and will draw on the expertise of local, national, and international artists.\n\n\nThe British Film Institute (BFI), London, has announced that it is preparing to welcome guests back to the institution in November, following a temporary closure due to COVID-19. The news follows an announcement that the BFI will begin inviting visitors back to the institution on Wednesday, November 22.The BFI, which has been open since September, has also announced that it is extending the run of the BFI Film and Television Festival through November 28. Following the conclusion of the UK’s three-day event, the BFI will stage an additional festival in March.The newly extended dates for the festivals were revealed in a letter sent to visitors on Sunday, November 18, from BFI director Maria Balshaw. BFI director B. J. Pomeroy wrote: “We know many of you have been enjoying the full range of BFI programming this year, and we know many of you will be disappointed by the changes to the Festival. But we are writing to reassure you that we are working hard to make the", "The next Biennial should be held in 2021. The deadline for the event is September 5.The art is on permanent display at the Museum of Contemporary Art, Miami Beach. The museum will have an artist showcase, an open house, and an exhibition on September 28. \n\n\nThe Miami Beach Art Museum (MBIAM) is getting ready to reopen to the public on Saturday, September 5, with a free public launch party for the museum, which has been closed since June 23 due to the Covid-19 pandemic. “We are fully prepared to welcome the public back to the museum,” said museum director Hernán Díaz-Villar, who added that the museum will have additional safety measures in place to ensure long lines and crowd control. The reopening party will also include a special exhibition. Villar described the opening as a “miracle.” “This is the first time that anyone can go inside the museum without the required closure, and to have more than 5,000 visitors come to the museum on a Saturday afternoon, when most of the public is not there, without any restrictions,” he said.The opening will coincide with the opening of a new project of the Museum", "The next Biennial should be called a “post-COPI” and will take place in Paris, where the exhibition has been relocated from its original site since 2015. The show will return to New York in 2021, and ten years later to Zurich.Curator Agustín Pérez-Olivares told the Art Newspaper that the decision to move the exhibition was made after the pair visited one of the venues before it relocated to the Museum of Modern Art. “The truth is that we never imagined our show would be so important, so critically important, so emotionally charged, so captivating,” Pérez-Olivares said. “This was an impossible project to make in the first place, it was a project that would have taken us twelve years to complete, and it was only possible because we had the amazing support of our amazing colleagues at the Biennale de Paris. We are so grateful for their incredible expertise and their incredible patience and for their commitment.”In a letter addressed to the organizers of the show, José de la Cruz, the curator of modern and contemporary art, and Adriana Zuleta, the artistic director of the Biennale, the artists wrote: “", "The next Biennial should take place in 2021 and will include new works by artists and authors based in the Asia-Pacific region. In 2018, the next edition, titled Aurora, was held in collaboration with the Aurora Art Foundation and the Auschwitz Museum. Jinyoung Gooko, a Korean artist who moved to New York from Seoul in 2003, was chosen to represent Korea at the 18th Venice Biennale. The first phase of the exhibition will run from May 5 to May 7, with the final show, titled The Staircase, taking place July 25–July 31.Gooko was selected for his first solo show, a series of portraits titled Conceptuals and Practices of Art, which will be scheduled for the second phase of the exhibition in November 2020. The artist will receive an award of $35,000.\n\n\nThe High Museum of Art in Beijing announced today that it has acquired the works of eighty-three artists and has renamed the institution the Art Institute of China (AIC). It will also begin hosting new programming that will incorporate more than seventy contemporary artists from the region and the world.The acquisition of the works, which include works", "The next Biennial should be held in 2020.\n\n\nNew York’s Lincoln Center, the City-owned and operated arts facility located in the heart of Harlem, has released the first-ever artist-in-residence guidelines for its New Orleans branch.“For the past twelve years, the Lincoln Center has sponsored artists to work in New Orleans,” the guidelines state. “We are committed to continuing to support the arts and our guests in New Orleans through programming that supports their experience, their creativity, and their creativity’s ability to engage our audiences.”The guidelines, released by the Lincoln Center in collaboration with the New Orleans Cultural Affairs Agency (NOCA), outline the most basic steps an artist must take to establish a residency at the center. The guidelines cover both the art-world and the cultural scene, describing as wide a spectrum of art-world and cultural activities as possible. The NOCA agency will now be tasked with developing the guidelines, which will be reviewed by the Lincoln Center leadership and the New Orleans City Council.The guidelines were developed by A.J. Knapp, the Lincoln Center’s senior director for programming and communications, who said: “We have partnered with NOCA", "The next Biennial should be held at least four times a year. In an effort to address the current loneliness and isolation in the arts, the Biennial will sponsor an open-ended, immersive, and creative experience, which will invite thought experiments, reflections on the art of life, and performances and other multimedia works. The exhibition will be organized in collaboration with the artists, architects, and curators who have dedicated their careers to the arts and will focus on the interdependence of all life processes; the art of the body; and the physical environment. Opening hours are 7 AM to 10 PM on Saturday, November 18, and 10 AM to 5 PM on Sunday, November 19. For those interested in supporting the Biennial, Joëlle and Igor was asked to describe the thirty-fifth Biennial for Paris’s Place Vendome (a branch of the Museum of Modern Art in New York) in an interview following a presentation of a work by the artist at the Biennial’s opening ceremony. “The Biennial is far from being over,” she said. “It is only the beginning of a new phase of our lives, one in which we are all involved in many vital ways.", "The next Biennial should be held in 2021.\n\nThe site of the first exhibition was designated for the first time by the organizers of the Art & Activism Biennial, the Melbourne-based organization that runs the event. The exhibition will be on display in the form of an interactive work that will provide a glimpse into the history of digital art and which will be organized on the theme “Art & Activism,” a reference to the English artist Bertrand Russell’s “Art and Revolution” (1903–1905). The biennial also highlighted the work of contemporary artists such as Hanna Bechko, Susi Banes, and Billie Piper.“We are thrilled to be working with Michael Kees, the artistic director of the Museum of Contemporary Art in Rome, to bring you this incredible exhibition,” said John Giannetti, chair of the group of artists and curators who are part of the Art & Activism team. “Michael was the perfect choice for the role of director since he has the vision and the ability to take the exhibition to the next level. We are confident that he will deliver an exhibition that truly represents our collection and our group.”The exhibition will take the shape", "The next Biennial should take place in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of more than one hundred artworks from the private collection of Charles and Mary Altman. The gift includes works by artists such as Frank Stella and Edgar Degas, as well as a selection from the Altman collection, which includes works by Claude Monet, Frances Farmer, and Pierre Huyghe.The museum also revealed that the collection will be restored and restored in the same way that the museum has been for more than fifty years, restoring the works in the collection to their original condition. In doing so, the Altmans hope that the significant works in the collection will return to life once the museum reopens.The Altmans are prominent proponents of the concept of time-based art, which they define as art that comes from the point of view of a personal or collective entity. Artworks that use works as a medium or as a point of departure for a conceptualization of time and space. For the museum, the Altmans have created a unique art practice that is driven by a shared desire to understand and appreciate the physical and conceptual landscape through the work of a number of artists in the company of José And", "The next Biennial should focus on the history and the culture of the exhibition and its relationship to contemporary art. The first will be held in 2021.  The second, which will have a theme of the role of art in the new global order, will be held in 2024. The third, which will be themed “Art and the End of History,” will be held in 2023. The fourth exhibition, “The Future Is Present,” will be staged in 2019.This year’s Biennial will mark the eleventh edition of the 2017 Art Basel World Show in Hong Kong, which was held at the Metropolitan Pavilion in Hong Kong. The event will take place in the Hong Kong Art Museum, the Hong Kong Science and Technology Museum, the Hong Kong Museum of Art, and the Hong Kong Museum of Fine Arts. Also featuring this year’s biennial will be a public event in collaboration with the Hong Kong Tourism Board, an exhibition that will present the fourth exhibition of the Hong Kong art calendar, “The Future is Present 3: Projecting Art”; a public lecture series at the Hong Kong Institute of Art and Architecture; an exhibition of original works by artists from the Hong Kong", "The next Biennial should be held in the second half of February, according to the organisers. It is not yet known when the exhibition will resume.The reopening of the exhibition comes a month after the US–led coalition that includes the UK, France, Germany, Russia, and the US launched Operation Inherent Resolve against ISIS in Syria. The US has also said that it is preparing to send more than six hundred additional troops to Iraq to help the Kurdish Peshmerga.Since the US-led coalition began to roll back ISIS in 2014, there have been several deadly attacks against cultural institutions in the country. The first attack took place on September 2, when a group of ISIS militants stormed a museum in the Iraqi city of Tal Afar, destroying the building, which is considered a UNESCO World Heritage site. The second attack occurred on March 23, when a suicide bomber drove a car bomb into a crowded market in the city of Baiji, in Baiji-Alishan province, killing at least twenty-three people and injuring more than 180. The third attack occurred on March 28, when two suicide bombers struck a Shia mosque in the city of Samarra, killing at least seventy-two people and wounding hundreds more.ISIS is now claiming responsibility for the fourth", "The next Biennial should be held somewhere in the middle. We can try to apply some of these ideas to the contemporary situation.”\n\n\nThe Zurich-based New York–based nonprofit Artadia, which offers free public art projects, is launching a new program that will provide financial support to artists who live in the Greater New York City area.The initiative was inspired by a 2016 initiative that launched by New York–based artist and activist Zanele Muholi in an attempt to raise $3 million for the visual arts in the New York area. The project, which involved in-kind donations, including signed prints, books, posters, and other materials, and commissioning the artworks themselves, was ultimately successful, and the $3 million raised was used to create a new, high-impact program, Artadia’s schedule a launch. For the first two years of the new program, the organization will provide $300,000 grants to individuals who live in the Greater New York City area. The program, which will also engage directly with local communities, will focus on developing a long-term strategic plan for artists and their communities. One of the first projects that will be launched is a new arts-", "The next Biennial should be held in 2021. The master plans, which were organized by architects Jonay Zangwo and Frances G. DeSousa, are currently undergoing a major rethinking. According to Artnews, the firm has received the permission to take the plans to the city.\n\n\nThe National Museum of Scotland announced today that it is now planning to open its new £400 million Science Museum in Dungeness in October 2021, following a three-month reopening in November 2022. The museum will be named after the National Gallery of Scotland, which is currently undergoing a $250 million expansion. The facility will also include a new visitor experience, a café, and other outdoor spaces.“We are thrilled to welcome the National Museum of Scotland to Scotland,” said National MSP Murdo Fraser. “The new Science Museum will be a landmark in the history of our country and will showcase our nation’s rich and enduring collection of world history through a new and exciting Scottish art. The new museum will also celebrate its centenary by creating a new series of exhibitions that will engage with Scotland’s rich and vibrant Indigenous art and cultural heritage and will provide a new and exciting platform for the National Museum of Scotland.�", "The next Biennial should be held in 2021, but because of the outbreak of the Covid-19 virus in early October, it has been postponed to November. The 2019 iteration of the twenty-fifth edition, titled Between the Sun and the Moon, was held at the Palazzo Para and was on view through July 31.The 2019 edition, titled Art in Paris, featured work by nineteen French artists and totaled approximately eighty-two photographs. The 2019 edition, titled Art in New York, gave away seventy-one photographs. The 2019 edition, titled The Struggle of Parisian Women, was organized by the New York–based nonprofit the Alliance Française de France and the artist-run nonprofit Femmefrance.\n\n\nThe National Archives in Washington, DC, and New York have confirmed that Steven Spielberg will be featured in the upcoming twenty-fifth edition of the National Geographic Adventure, “Between the Sun and the Moon,” which will be held in late spring 2020. The film, which was made in partnership with the National Geographic Society, will be produced at the National Geographic Society’s headquarters in Washington, DC, and will be shown at the National Geographic Society’s annual fall meeting, the Peab", "The next Biennial should be held in the year 2024.\n\n\nThe United States Court of Appeals for the D.C. Circuit has upheld a $1.4 billion judgement against Donald Trump over his presidential campaign's efforts to bar a group of Gulf artists from the 2020 edition of Art Basel New York, which was originally scheduled for April 20–April 22.In a 2-1 ruling, the court found that the ban violated the artists’ First Amendment rights and also determined that the ban violated the artists’ Sixth Amendment right to a speedy trial.Justice Samuel Alito, who wrote for the majority in favor of the artists, called the case “the greatest art-world test in history.” The judgment is a victory for the artists, who will now have a chance to stage their own exhibition at the fair and to stage a protest of the exhibition at the fair.“It is a tremendous victory for the artists and the art world, and a clarion call for artists to the court to the highest extent possible,” said Mark Nevelson, the lawyer representing the plaintiffs, who include Ali Larijani, Nima Sanandari, and Rachida Rasheed, and the organizations High Intensity Resistance (H", "The next Biennial should have taken place in the Banda Aceh, Indonesia, next year, and the final event should take place at the Museo de Arte Contemporáneo Laguna, the capital of Aceh province, in 2020.However, due to the coronavirus outbreak, the organizers of the twenty-fifth edition of the fair have postponed the event, and Art Basel Indonesia has asked other countries to reschedule the event, currently set to take place in September. “The art of the art market is changing all the time,” Bahar said. “I think that the best way to say that, is that the art market is really undergoing a serious transformation.”Since the coronavirus outbreak, the Indonesian Art Museum (Raket) in Jakarta has been closed and the country has been dealing with a massive health crisis. According to The Jakarta Post, the number of cases of the virus quadrupled in the country, which is one of the hardest hit by the virus.In an attempt to contain the outbreak, Indonesia has officially closed its borders and has suspended all public gatherings. The country has also implemented a total ban on travel to and from Henbachia, which the World Health Organization", "The next Biennial should be held in 2020.\n\n\nThe Prudence and Art Institute (PIA) in New York has welcomed artist and curator Lee Yoon-Koo to its staff. In a staff-wide letter signed by thirty-three employees on August 21, PIA director Anna Wintour and director Alexandra Hennings wrote: “Lee is dedicated to building a stronger culture, and bringing art and artmaking to life, for the PIA’s campus and the greater art world community. His professional practice spans sculpture, performance, photography, video, and installation, and his work has been exhibited at international galleries, including the Los Angeles County Museum of Art and the Museum of Modern Art, in New York, and the Museum of Modern Art in New York City; at South Korea’s National Museum of Art; and in Europe.”Lee is currently a PIA Curator. His work is currently on display in the exhibition “Post-Modern Art,” which opens next month. The show will highlight the work of twenty artists and will delve into themes such as cultural appropriation, the artworld and politics, the media, and urban life.Commenting on PIA’s decision to welcome Lee,", "The next Biennial should take place at the city’s iconic Golden Gate Bridge, but it is unclear when it will be held. The nineteen-year-old biennial was originally scheduled to run from September 8 to September 15, 2020, but it was pushed back to October 1, 2020, after a change of heart over the safety of the artists who were participating. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it was working with the Los Angeles County Museum of Art (LACMA) to create a new public art installation. The installation—which will debut in collaboration with the Los Angeles–based artist and educator, Kiki Smith, and will run approximately two hundred feet of Plexiglas—is part of a new series of public works commissioned by the museum in partnership with artist and educator Maya Lin. “The work will be a series of paintings, sculptures, videos, and installations that address issues of memory, memory-work, and memory-work, the memory of a loved one who has passed away, and the memory of a place where memory and memory-work will be most clearly perceived,” said LACMA director Tim Marcotte. “This work will explore the memory of", "The next Biennial should be held in 2020. Ostensibly, the next exhibition will focus on the role of art and design in the twenty-first century and will showcase work by fifty-four artists, including Panayiotou, Serna Dzugazh, Camille Blatrix, Paul Gauguin, and Pierre-Auguste Renoir. The program will be led by Aria Lascaris, the Art Historian behind the street art project ¡Quatre de Belle et les Dames, and will be led by Henry Luce, who served as director of the 1960 event.Luce, who was French president at the time of the revival, said: “The theme of the forthcoming exhibition is ‘art and design as components of our experience of the present.’” “I have considered this question a thousand times over the past forty years. I mean to call attention to the fact that, despite their incredibly complex and intimate roles, art and design are not only the most varied and the most essential elements of our lives.”The exhibition will be organized as follows:List of exhibitors :Architecture and Design at the Museum of Modern Art (ArchitectureM), New York City", "The next Biennial should take place in the coming months, and the first exhibition to engage with the feminist and anti-racist struggles of African Americans will open in October 2020.\n\n\nThe Asian Art Museum (AAM) in Tokyo has received a gift of one of its collection items: the Australian-born, French-born artist Louis Vuillard’s “Feminine and Feminine: Modern and Contemporary Art from the Asian Part of the World,” a monumental, three-hundred-year-old work by the French-born, Italian-born artist Emma Donoghue. Founded in 1964, the work is one of the three Ghent-based museums that will receive the work, along with the other works in the collection by the American artist Eva Hesse.The gift comes at a crucial time for the AAM. Although the institution suffered a devastating fire in 2017 that resulted in the total loss of the entire building, it was already under construction when the fire began. It is now slated to open in 2021, but the construction of the museum has been suspended due to the pandemic. The uncertain future of the rest of the collection is also being closely watched. The institution has been working to assemble a new collection, but", "The next Biennial should be scheduled for late spring or early summer 2019. The first exhibition, “Abridged Films\u0097or, cinema as it has been seen and loved,” will be hosted at the Museum of Modern Art, New York; the National Museum of Women in the Arts, Washington, DC; and Art and Architecture, London.Commenting on the upcoming events, Joëlle Prouvé, director of the Biennial and a curator at the Contemporary Art Museum Paris, said: “The Biennial is determined to show that cinema can be a real and powerful part of our lives. It is also committed to making the very best of the times we live in, to giving the impression of the richness and complexity of modern life. We are thrilled to announce the artists who will be featured at the 2019 exhibition and are very much looking forward to seeing how this exhibition will react over the coming months.”\n\n\nThough she remains out of prison, Samaria Nakar, who has served four and a half years for manslaughter in the killing of a New York City police officer and whose conviction was thrown out in 2015 because of a Supreme Court ruling, has been released from prison on $100,000 bail.N", "The next Biennial should take place in the second half of the year. “The new venue has been selected to give the best possible presentation of the transformative resonance and cultural impact of the Biennial as a whole,” said Christoph Reimer, president of the German Cultural Heritage Foundation (DGF). At a press conference in Berlin on February 22, Reimer called the selection of the venue a “great success.” He added that the decision to hold the exhibition was not a difficult one. “The venue is ... well known,” Reimer said. “It is the perfect location for the show, and for the exhibition to be shown. It is also the perfect combination of the Museum of Modern Art and the Centre Pompidou—it is well connected with the city and the city region.” The first edition of the exhibition, titled “Portraits in a Bottle” (“Portraits in a Bottle”), will run from March 9 to March 12, 2020. The exhibition will be staged in the Centre Pompidou since it is a “natural extension of the Museum of Modern Art.” The redevelopment project, which is part of", "The next Biennial should take place in early 2020, according to the organizers.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Matthew Wong as its new chief curator. Wong will succeed David Glimcher, who has served as director of the museum for the past nineteen years, and will assume his post on February 5.“We are delighted to welcome Matthew to the museum,” said Jonathan Daniel, the museum’s director. “I’m extremely confident that he will be able to continue to grow the museum’s reputation as a major capable of sustaining the museum’s aesthetic needs for the next fifty years. We look forward to working with Matthew and his team to improve our exhibitions, our programming, and our exhibitions to reflect the museum’s unique architectural and interior design heritage.”Wong was hired by MoCA in 2017 to lead the museum’s first redesign of its building since it opened in 1961. His new role will provide MoCA with a platform to further develop its exhibitions and public program as it works to revitalize the space. The redesign will include a more contemporary and modern interior that will present both art and architecture from a more contemporary perspective. The redesign", "The next Biennial should open in the summer of 2021.”\n\n\nThe Pérez Art Museum Buenos Aires, the Pérez Art School, and the Museo de Arte de Buenos Aires (MAS) in Buenos Aires, Argentina, have announced that they are working together to create a new, nonprofit platform, called the Pérez Arts Portal, for the promotion of photography. The partnership was announced by research partner Artforum’s Pilar Gallego, art historian Carla Pérez, the Pérez Art Museum’s director, and curator Boba, and was first revealed by the Buenos Aires Herald.Gallego and Gallego spoke about the project, which will focus on new historical photography, at the Pérez Art Museum’s annual art fair, Pérez Automobili, which takes place this week, April 19–April 23, in Buenos Aires.Gallego said that the Pérez Arts Portal will be a platform for both the museum and the public to experience photography and will be led by ‎Pilar Gallego, the curator of contemporary art and photography. No dates have yet been set for the platform’s launch. Gallego", "The next Biennial should take place sometime between June and September 2021, with a Sunset/New Moon celebration taking place on September 28 and a Winter/Spring 2019 edition taking place on March 4. “Its new partnership with the Cultural Centre will allow us to create a special exhibition for our guests, with the aim of introducing them to the wonders of the Solar System and to the history of the Solar System,” said Per-Hein, who represented Germany in the 2020 Art Basel show in Hong Kong and was appointed director of Berlin’s Space Museum in 2017. “The exhibition will also be an opportunity for the guests to experience the Solar System from the perspective of the five Solar System bodies: Saturn, Uranus, Neptune, and Pluto. The exhibition will be organized in the same manner as the exhibition that took place last year, in order to present the most current and exciting scientific research related to the Solar System.” \n\n\nThe University of Dusseldorf (Dusseldorf) in Germany has received a gift of approximately one thousand photographs related to the development of the Lübscher Kunstverein (Lüsch-und-Bau), which is currently under construction at the University", "The next Biennial should take place in the Fall of 2021. The next exhibition should be held in the Fall of 2022. The next exhibition should be held in the Spring of 2022. The next exhibition should be held in the Spring of 2022. The next exhibition should be held in the Spring of 2021.\n\n\nThe Brooklyn Museum is moving forward with plans to open a digital-only, museum-within-a-museum, a museum that will be housed within the boroughs of Brooklyn and Manhattan. The institution, which has been working on the project for several years, is now proposing that the project be called the Museum-within-a-Museum.“The Museum-within-a-Museum will be a museum in a museum. It will be an extension of the City University of New York, New York, where it will draw visitors from all over the world by combining the unique collections of the institution with the collections of the City’s numerous private museums,” museum director Daniel H. Weiss said in a statement. “We look forward to working with the community and the public to realize this vision.”The new museum will be built on the site of the former Battery Station, which was converted", "The next Biennial should be announced in the fall of 2020 and will consist of twenty-one artists and scholars. The exhibition will take place at the Museum of Fine Arts, Boston, the University of the Arts Boston, and the New England Museum of Art. “We are thrilled to be working with Artnet on this exciting project,” said Museum director Robert DeLong. “While we are grateful to the Boston-based team for their tireless work in championing the exhibition, we are particularly proud of the full range of exhibitions they have presented to date, including \u0097’s exploration of the duality of art and the abuse of creativity.”The 2018 edition featured works by forty-two artists, including Catherine Oŗniski, Jamal Abu Hamdan, Ebony Olowu, Jen Holbrooke, Lauren Leighton, Zoé Lynne, and Mary Ellen Mark. Other works that were selected for the 2020 edition by a jury comprising Laura Cocht, Tavares Pindell, and Jodi Throckmorton were Gabriel Farber, Michael Levin, Juliette de Vries", "The next Biennial should take place in the spring of 2021 and will feature a selection of works by seventy-two artists.The exhibition will also include a major renovation of the gallery’s original venue, an extension of the exhibition program, and the development of a long-term master plan. The renovation, which was staged by the same designers that designed the gallery, was funded by a $7 million donation from the Koppenberg Foundation, as well as a $2 million donation from the Lévy Gorvy Foundation. The Lévy Gorvy Foundation is also funding a new artist residency program. The inaugural edition of the exhibition will be held at the Düsseldorf-based museum from February 16 to February 21, 2020 and will be held at a new ground-floor venue that will provide a new exhibition space for contemporary art.The project is the latest in a string of initiatives by Koppenberg to reorient his curatorial practice away from its past and toward a more contemporary, urban, ecologically-inspired aesthetic. The Art Newspaper and Artforum have reported that Koppenberg is working on a major redesign of the gallery. The project will also include the installation of a new sculpture by artist Klaus-Peter Neuendor", "The next Biennial should be in the first quarter of 2020. The show will tell the stories of the biennial participants—dressed as anthropomorphic animals with distinctive physical signs which, in turn, were represented by a single jewel. The exhibition will also encompass the biennial as a whole\u0097it will be the first time the exhibition will be held in the city.“We are thrilled to present the first ever Biennial of the Americas in the Americas,” said Markus Bacher, the exhibition’s creative director. “This is a project of the most monumental proportions, and we are confident that it will bring together the best of contemporary art from the Americas and Europe.”The annual exhibition, which will be held at the Grand Canal in Barcelona from March 16 to March 20, 2020, will take place at the Museo de Arte Contemporáneo in the city of Aragón, Spain, as part of a larger exhibition in the city that will showcase the work of fifty artists. Curated by Luciana Barra, the inaugural winner of the Art Prize, Ana Paula Castillejo, and Julio César Morales, the exhibition will feature work by a total of sixty artists.", "The next Biennial should take place in 2023 and be co-organized by the Art Institute of Chicago (Art Institute), the Boston Art Museum (BAM), and the Museum of Fine Arts in Boston (MFA). The theme for the 2019 iteration of Art Basel Chicago was “The Future is Ours,” and the exhibition was curated by Daniel H. Wilson, the director of the MFA, and Carlos Camil, the director of the Art Institute, respectively. The theme for the 2020 edition was “Radical Feminisms,” and the exhibition was curated by Rosanne Reine and Ariel Vassallo, the current artistic directors of the MFA, respectively.In a statement, Art Basel said: “We are thrilled to be able to collaborate with the MFA and the Museum of Fine Arts in Boston in carrying out a comprehensive and exciting exhibition programme that represents the AIC’s international history. AIC has for many years shown the work of some of the most relevant artists of our time and at years like these we hope to contribute to a dialogue on the collaborative potential of contemporary art.”\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Linda Anagnos its", "The next Biennial should take place in the city of New York in 2022. Their next home, the Museum of the Moving Image, is currently under construction in the city, but will be completed in 2020. The 2020 round, titled Art of Life, will include a retrospective of the work of more than fifty artists and will be held at the Biennial by architect and collaborator Blomkamp & Day. Previous events include visits to the Museum of Modern Art, New York, and the Museum of Modern Art, New York, and the Museum of Contemporary Art, London, which will be remodeled by the architect and artist Stanley Donwood. The Biennial is supported by a $10 million donation from CAA. “The new partnership between the Museum and the artist-run club is a major step in our ongoing work to further contribute to the urban fabric of New York City,” said Lonnie Guggenheim, the museum’s director. “The Museum is committed to engaging with and supporting the work of emerging and established artists, and this partnership marks a major step in our program. We look forward to growing our partnership with their talent and to working with other renowned institutions in New York to further their work.", "The next Biennial should be held in the coming months. The board is currently working on a new program to address the challenges of organizing a large-scale retrospective at the venue. \n\n\nThe South African Museum of Fine Arts (SAMMA) in Pretoria, South Africa, announced today that it has welcomed the first new visitors to the institution since the devastating floods of 2016 and is working with the government and private sectors to make the institution more accessible to the many communities that have not had access to the institution since it was constructed in 1976.The institution, which was built to support the city of Johannesburg, was flooded in the early hours of April 12, 2016, and reopened only four days later. The institution had limited spaces to house the artworks on display and was unable to store the artworks in order to prevent the spread of Covid-19, the then-unprecedented coronavirus. The South African government has since committed to opening all of the museum’s galleries and expects to open all of the museum’s buildings by the end of the year.“In order to prevent the recurrence of this pandemic and in order to enhance the safety and well-being of our visitors and staff, and to", "The next Biennial should take place at a location other than the studio in 2021. Among the themes of the biennial are “Transhumanism and the Human Condition,” art, technology, and ethics. The organizers responded to the exhibition, “in celebration of the twenty-fifth anniversary of the Biennial, we have put forward a proposal that aims to present a new view of artificial intelligence.”Entitled “The Future of Humanity” it was presented by the Thomas J. McNary Foundation and will run from March 6 to March 11, 2021. The biennial, which has been held in cooperation with the Madison Square Garden Foundation since 1980, was inspired by the work of American futurist Ray Kurzweil. The inaugural exhibition was curated by Peter Drury, director of the Institute for Advanced Study in the Humanities at Columbia University.  The artist-run museum is currently closed until at least May 8, 2020 due to Covid-19.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Ian Cheng as its new executive director. Cheng replaces Tamara Dickson, who has served as interim chair and chief curator of thirty-six months.“Ian Cheng’s", "The next Biennial should be held with the same dedication, purpose, and urgency as the last.” The next iteration of the biennial will be held at the institution’s campus in the city of Bristol from November 5 to November 8. The upcoming edition will feature artworks from fifty-five artists, including Frank Gehry, Popov, Walker Kolney, and B. M. Dibango\u0097a master of Brazilian painting who came to the United States in 1947. “Biennial was born in 1948, in the heart of New York City, and is an annual event that has been staged in various guises, including at the Museum of Modern Art, the Museum of Modern Art in London, the Institute of Contemporary Art, New York, the Museum of Contemporary Art, New York, the Museum of Modern Art in San Francisco, and at other locations throughout the United States, Europe, and the Americas,” said biennial director Laurence Maroon.The inaugural edition of the biennial was held at the Museum of Modern Art in New York across from the Museum of Modern Art and the Metropolitan Museum of Art. It ran from March 16 to March 19, 1948.  The 2019 edition will be held at", "The next Biennial should focus on creating opportunities for local communities to engage with and contribute to the exhibition, the collection, and the exhibitions, such as the upcoming edition of the inaugural exhibition, 'Eighteenth-Century Painting in America: Eighteenth-Century Muralists, 1870–1930, with a special focus on the work of George Albert, and how the collection is organized and presented, and what can be done to support and encourage the work of future generations of Biennial artists. The biennial will also continue to present the work of selected artists, while excluding works that have not been selected by the biennial committee for their respective biennial.  The biennial is expected to open in 2021.\n\n\nThe National Gallery in London has appointed Emma Armstrong as its next director. Armstrong, who will assume her post on May 1, will be responsible for advocating for the museum’s “long-term strategic vision,” in a statement. The president of the National Council on the Arts, Harriett Reid, said: “Emma’s experience and knowledge of the National Gallery, and her passion for curating makes her the ideal candidate to take on a leading role in the future", "The next Biennial should be up and running by September, with an opening exhibition at the Museum of Contemporary Art Chicago and a September 22–28 exhibition at the National Gallery of Art. The museum also plans to open a digital-only space next year.“The museum’s commitment to public engagement since the death of Dr. King continues to be at the heart of our design collaborations,” said Sam Greenberg, chair of the museum’s board of trustees. The institution has partnered with local, national, and international organizations such as the Chicago Alliance for the Arts, the National Black Museum, and the Chicago Public Library, among others, and is currently working with the Black Men’s Shelter.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is preparing to welcome visitors again to the museum, following a temporary closure due to the Covid-19 pandemic. The reopening of the landmark institution, which served as a focal point for the global Black Lives Matter movement, follows the announcement of a major exhibition and the launch of a new online museum platform, which will debut in March 2020. The first show, “Black Stories,” will present the work of forty-five", "The next Biennial should be held in 2022.\n\nLévy Gorvy, the Paris-based arts organization founded by Pierre and Edouard Biennale, which was created in 2001 as a platform for contemporary art to address social and political issues, has recalled more than 1,500 works from its collection, including the works of artists including João Goulart and Louise Bourgeois. The gallery also revealed that several works from the collection, including a work by Lévy Gorvy alumnae Karl Lagerfeldt, who won the Prix de l'Art the previous year, and a work by Galerina DeSousa will be presented on May 23.The works that will be presented at the exhibition are mostly from the two annual tours organized by the studio: “The Art of Life” (2019), an exploration of the power of food and the environment, and “The Ecology of Eating” (2019), the first exhibition devoted to the history of food and the environment in France.The Biennales are still on track for their 2020 edition, which will take place at the newly renovated Stedelijk Museum in Amsterdam, and the 2019 edition was canceled due to the Covid-19 pand", "The next Biennial should be in 2020. \n\n\nThe Museum of Modern Art (MoMA) will be closed until March 19, 2020, after the institution received a $10 million emergency order from the US Occupational Safety and Health Administration (OSHA) on Tuesday. The order, which only applies to institutions that have a physical presence in New York, states that the museum must close by March 19, 2020. According to Artnet, the Washington Post, and The Guardian, the museum is facing a $100 million shortfall due to the coronavirus. The NYC Museum of Modern Art, which has a physical presence in the historic East Village, began welcoming visitors on Friday and expects to have a usable space open by March 16. The closure has left MoMA facing a number of issues. On Monday, April 4, the morning after the coronavirus was first reported in the state, the institution announced on Instagram that it was shutting down its physical space, the still-unopened Gabriel Awards, and its online exhibition space, MoMoMA VIEWS, indefinitely. The closure will also affect the residency program. The residency program, which was launched in 2017 by Marcelos de Castro to address the city’s avant-gard", "The next Biennial should take place in 2022. The first is scheduled for 2020.\n\nBloch-Prestel, whose company made the iconic bronze sculpture for the exhibition, has announced that it will cease operations at the new exhibition space, which was inaugurated by the New York–based artist Robert Irwin in 2015. Michael Bloch-Prestel, whose company made the iconic bronze sculpture for the exhibition, has announced that it will cease operations at the new exhibition space, which was inaugurated by the New York–based artist Robert Irwin in 2015. Michael Bloch-Prestel’s most recent project, a digital installation, “An Open Letter,” was awarded the $50,000 Lin-Manuel Miranda Prize in February. The art dealer also plans to donate $3 million to the Nicaragua Book Fair\u0097which is a longtime supporter of the Nicaraguan state and has donated books by more than eighty authors\u0097and $250,000 to the Los Angeles County Museum of Art, the Asian Art Institute, and the Berkeley Art Museum.Commenting on the partnership, Bloch-Prestel and Irwin said: “It’s a great honor to be working with the artists whose work", "The next Biennial should be held in 2021. \n\n\nThe French Ministry of Culture has launched an investigation into whether an exhibition that was set to open in the capital city of Lyon last month was compromised by a foreign terrorist group in an attempt to prevent the work from opening. The investigation was launched after a man reportedly complained that a painting by French artist Marc Chagall was not showing in the exhibition “Prince of Peace” (Beautiful Silence), a collaboration with the French artist Emmanuel Gide.Gide sent a letter to the director of the exhibition, Emmanuel Farrand, on October 31, explaining that the work was not showing due to a “serious technical problem.” Farrand said that the painting was not in the catalogue, and that the decision was made on a “day-by-day basis.”The French government ordered the installation of a temporary halt to the opening of “Prince of Peace” in April, a few days after an explosion at an Algerian army checkpoint in the capital of Marrakech, Marrakech, which killed one person and injured twenty-two others. While the blast caused delays and some businesses to close, the exhibition was rescheduled and", "The next Biennial should be held in 2021. The exhibition will be hosted by the Museums Museum Stuttgart in collaboration with the Institut für Kunst des Internationale Bildungs (IMB), the Nationalgalerie (formerly the Prussian Cultural Center), and the Museum der Moderne in Frankfurt. Renewed criticism of the Design Museum for failing to promote a “dramatically different” version of Nada, the sixth edition of the fair, which was first held in 2016, has prompted changes at the institution. Organizers said that the decision was made following a discussion with the students, faculty and staff. “We decided to implement a new strategic plan, which is impacted by the upcoming exhibition ‘NADA: The Biennial of Modern Art’,” a mix of lectures, workshops, and presentations that will take place in the museum until March 13, 2021, the same date as the original exhibition, which was inaugurated by Italian designer Alessandro Nara. The plan also includes a restructuring of the museum, which will be relocated to the Rue de l'Est, and the reinstallation of an education program that will focus on the history of art and design,", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Mary Kasper, a curator and art historian who has worked in architecture and design, and Richard Mayhew, a former assistant curator at the Whitney Museum of American Art, as assistant directors of exhibitions.“We are incredibly honored to welcome these two creative and talented young curators to MoCA and to include them in the network of contemporary art,” said director Marc Glimcher. “Together, they have the expertise and vision to expand and reinvent the MoCA experience. We look forward to collaborating with their respective worlds and by engaging their voices in the future of modern art.”Kasper, who was previously a curatorial assistant at MoCA and has taught at the university level at least twice, said: “I’ve been a fan of Richard’s work since I’ve been a curator. He is a gifted teacher and collaborator, and I’m thrilled to learn from him as he embarks on his own master’s degree work.”\n\n\nThe Italian Museum of Fine Arts (Medina Museo di Tiburon, Milan) has received a donation of", "The next Biennial should focus on the art of violence,” says Alexander. “The next will strive to present the full range of historical, religious and political perspectives within contemporary art.” The museum will also move its headquarters from the city of Trieste to the Museo de Arte Contemporáneo Brasileira in São Paulo.Berger is also working on revamping the museum’s exhibition program with a new theme and a new collection of more than 450 works. The redesign has received backing from the Association of Museums of the History of Modern Art (AM), which is supportive of the project because of its historic, contemporary, and current exhibitions.\n\n\nThe National Gallery of Scotland (NGM) is reopening after a temporary closure due to the Covid-19 pandemic. The institution, which was forced to temporarily close to prevent the spread of Covid-19, will reopen on January 3, 2020 as part of a £15 million government-led reopening program.The National Poetry & Drama Award, which was established in 2017 to support poet and playwright Tanya Cooper, has given $2.1 million to the institution. The funds will go toward supporting the opening of the annual", "The next Biennial should focus on the history of the exhibition, its development, and the exhibition of new works. It should also consider how the exhibition will share the exhibition with other exhibitions, how the exhibition will be presented, and how visitors will interact with the exhibition. It should present a new work every two years. The 2020 exhibition will be held at the Museum of Fine Arts, Baltimore. Museum Director Chris Theobald said: “The exhibition is the lynchpin of the museum’s long-term strategy; we simply cannot do it without the exhibition. It is the single most important institution within our collection that has ever been constructed and opened. We simply cannot continue without it.”The museum is currently working on a redesign that will create greater accessibility to both the museum and the city through an additional level of elevators and a redesigned building. The redesign will also introduce more room for the collection, improve pedestrian and transit conditions, and address the museum’s growing demand for more exhibition space. The plan is part of a $125 million overhaul of the city’s waterfront. The $57 million redesign of the Inner Harbor is being led by the Baltimore Architecture Foundation and includes the construction of two new by-", "The next Biennial should be held in 2021 and will be inaugurated with a special exhibition of new work by Pierre-Paul Medvedès. The biennial of modern art, titled “The Modern Phenomenon,” will open at the Sydney Contemporary Art Gallery in June 2021.\n\n\n\n\n\nThe Glasgow Art Gallery (GALL) has announced twenty-four artists who have been selected for the 2021 edition of its Royal Edinburgh Festival. The inaugural edition, “The New Roman Empire,” will run from February 16 to February 21, 2021 at the GALL in partnership with the Shaw Art Gallery in Edinburgh. Commenting on the selection, director Maria Balshaw said: “I am really excited that these new artists are taking the time to join the GALL in their work. The Royal Edinburgh Festival is an institution that has been at the core of our mission since the launch of the Scottish Contemporary Art Gallery in 1909. I am confident that these twenty-four artists will carry on this mission in their own unique ways.”Speaking about the design of the exhibition, which will initially explore the intersection of art and politics, the gallery said: “This is a moment of great change in the world", "The next Biennial should be held in September, and the event should be accompanied by a new exhibition of works by the artist-turned-author Anita Borg; artworks by the artist-turned-actress Andrea Panizzone; and an introduction by Yangon-born artist Raya Ashraf.\n\n\nTwo years after the French state allowed the museum to open in Nantes—which is near the city of Nantes—Parisian artist Paul Gauguin was awarded the prestigious Presidential Medal of Honor, a compound of the same name which honors the first person to be awarded the prestigious honor, the President of France, Emmanuel Macron.The Louvre and the Palais de Tokyo in Paris were given the prestigious designations for the Présidential Medal of Honour, which is assessed annually by the President of France. The museum’s inaugural collection of new and contemporary art, “Le Fête d’Arles” was also named the Présidential Medal of Honor. The Louvre and the Palais de Tokyo are the first places to hold the exhibition, which was curated by twenty-seven-year-old Belgian artist Marc Payot.The exhibition, which will", "The next Biennial should be held at the New São Paulo, which is currently undergoing a renovation and is slated to reopen in May 2020. “The structure of the exhibition has undergone a radical transformation in the last twenty years,” said curator Stefano Cattelan. “In order to show the latest work by the artists participating in the exhibition, we will need to present them new settings, new contemporary art, new technologies, and new ways of creating work.” He added, “The construction of the exhibition has been very challenging. We have evaluated several alternatives, and this was the most ideal opportunity to experiment with new technologies and new works.”\n\n\nThe Solomon R. Guggenheim Museum in New York City has released the list of twenty-seven artists whose works will be included in its first exhibition dedicated to the African diaspora, “African American Pop,” in the spring. The exhibition will run alongside the theme “Shifting Schemes: African American Art”, which is also hosted by the Museum of Modern Art in New York and will commemorate the 150th anniversary of the African American artist Jack Whitten’s birth. The twenty-four artists are:", "The next Biennial should take place at the Kölnischer Kunstverein in Cologne in 2021. \n\n\nThe New Orleans Museum of Art (NOLA) has appointed Adam Gopnik as its next executive director. Gopnik joins the institution from the Brooklyn Museum, where he has served as deputy director of exhibitions since 2012. He succeeds Susan Efstathiou, who retired from the position after thirteen years in February 2019.“Adam is an outstanding curator and scholar who has successfully navigated between the two worlds of art and academia,” said director Fran Spielman. “He brings to the role both the breadth and depth of his experience and knowledge. We look forward to working with Adam as he develops and updates NOLA’s exhibitions program.”Since Gopnik’s appointment, the museum has implemented new initiatives and has expanded its holdings through the acquisition of more than 1,700 works, including works by Michelangelo Antonioni, Hélio Oiticica, and Rintoul, as well as artworks by works by artists such as Frederick Massey, François Truffaut, and Frank Gehry. He also oversaw the development of a contemporary art museum in the city�", "The next Biennial should focus on “postcolonialism”\u0097a term coined by art critic Peter Frederick Bostwick in 1987 to describe the academic, political, and cultural field that has not been fully repurposed by Western scholars. The twenty-sixth will focus on “architecture as a system of domination and exploitation” and will be organized as a series of exhibitions. The seventy-third will showcase the work of thirty-eight artists and will be staged at the Museum of Modern Art, New York; the Museum of Modern Art, New York; the Museum of Contemporary Art, Paris; the Museum of Contemporary Art, Florence; and the Museum of Contemporary Art, Milan.The seventy-second will be the theme of the sixty-fifth Biennial, “ecological resistance.” The seventy-third will emphasize the “unique and controversial nature of landscape and the social, and how it shapes us as individuals, communities, nations, and nations-states.”The eighty-third will present the work of thirty-five artists and will open at the Museum of Modern Art, New York. The eighty-fourth will explore “life as a system.” The eighty-fifth and ninety-six", "The next Biennial should take place in the autumn of 2019. The museum will remain closed until 2022, when it will open to the public for the first time. Museum Director Sebastian Klima, who took over the reins of the institution from Leslie Ng in 2005, said: “The next Biennial will be an exciting, challenging and collaborative endeavor, where the original intentions of the founders and the team are strongly affirmed.”\n\n\nThe Danish artist Lars-Erik Neuberg, whose unique and politically subversive work explores the ways in which art can and should be regulated, has died. He was eighty-three years old. He was a prolific painter and sculptor whose work explores notions of the body, the flow of time, and the physical and mental landscape, and whose work has been exhibited at the Copenhagen Art Museum and the Museum of Modern Art, the Museum of Modern Art, and the National Museum of Denmark.Born in 1947 in Copenhagen, Neuberg moved to Oslo in 1954, where he received a bachelor’s degree in art history from the University of Oslo and a master’s degree in photography from the State Academy of Fine Arts. He returned to Copenhagen in the 1970s, where he continued to work", "The next Biennial should take place at the Museum of Contemporary Art Los Angeles (MASLA) in 2021.  The 2019 event, titled “What Is Art,” was jointly curated by Masouda and Henri Rousseau, and drew 1,400 participants. On September 24, the French artist Gionlán Villar and the Spanish artist Miguel de Torres, both of whom were critical of modernist developments and the Communist Party, declared their intent to boycott the remainder of the exhibition. The decision provoked a furious backlash from some of the artists who didn’t want to participate in the next iteration of the exhibition. The Grammy Award–winning artists Aerosmith and Megadeth, who have collaborated on numerous projects with the work of the Montréal-based artist Jean-Michel Basquiat, withdrew their works from the exhibition. In an attempt to placate the concerns of many artists, the Biennial decided to hand out $1,200 prizes to three artists. These include Andre De Grasse, Vito Acconci, and Sameer Chauhan. De Grasse’s work, which addresses the death of a close friend in the form of his son, is a tribute to the late artist"]