["The next Biennial should focus on the ways that cultural institutions can support and encourage art and culture in the socio-economic and cultural crises of our times. The new theme will be 'Freedom of Expression, Freedom of Thought, Freedom of the Arts, Freedom of the Spirit.”  \n\n\nThe Art Newspaper has released the first international survey of the work of Italian artists—the first comprehensive survey of the work of the Italian national artist, Paolo Scarola, who most recently worked as the chief curator of the Museo delle Papesse in Reggio Emilia. The study, titled Aspects of Color, was organized by Mario Aparicio, the director of the Museo di Arte Contemporanea in Milan and a professor of art history at the University of Piedmont, and Amanda Fusi, the former artistic director of the Bibliothèque Nationale in Rome, and is based on the first edition of the Competitions of Italy, which was staged in Venice in 2008.The exhibition, which focused on artistic collaboration, architecture, and installation, was commissioned by the Italian government, the Ministry of Culture, and the Ministry of Education, Culture, Sport, and Sports. The exhibition", "The next Biennial should take place at the Metropolitan Museum of Art in New York in 2020. A follow-up exhibition is currently being organized at the Museum of Modern Art in New York in 2021.  The next edition of the Whitney Biennial will be held at the Rhode Island School of Design in 2021. The number of exhibits that will be presented at the event will be roughly the same as the last year. The event will also feature a mix of new works and works that have been opened for over a year. \n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it has allocated $10 million to ten cultural institutions across the city as part of its New York City Cultural Proj­ection Plan, which aims to encourage the collection, exhibition, and display of cultural assets. Though the funds will not directly benefit the city’s five boroughs—as they do not fall under its purview—they will help ensure that cultural institutions across the city have access to the funds to continue their important cultural programming.“Cultural institutions play an important role in the creative and cultural life of the city,” Dina Kander, the city’s Cultural Proj­ection Plan enforcer", "The next Biennial should be held in 2020. For Zuckerman, the Biennial is \"really a declaration of our relationship with the world. It will have a very strong European and American fusion in it, and we look forward to showcasing this world at our own time.”\n\n\nThe Museum of Fine Arts (MA) in Boston has received a major gift of more than 800 works from the foundation of the New England Cultural Heritage in Connecticut. The museum, which is dedicated to the study and appreciation of American art, is currently restoring and reopening the nineteenth-century textile-fiberworks installation The Velvet Garden, which was included in the museum’s inaugural exhibition, “The Velvet Garden: American Art in the Twentieth Century,” with the show opening on September 7.The gift includes a large number of works dating from the late nineteenth century to the early twentieth century, including pieces by artists such as Thomas H. C. Bowman, Edward C. Evans, and John Galliano; works by American artists such as Thomas Edison, Charles Darwin, and Thomas Edison’s grandson, John H. Evans, Jr.; and works by artists that are currently on display in the museum’s permanent collection but that are not", "The next Biennial should be held in June.\n\n\nThe British artist Richard Avedon, who went by the name Richard Avedon, was found dead in his apartment in London on Wednesday, March 19, at the age of fifty-nine. According to the London Times, the cause of death was asphyxiation. Given his limited output, which was typically characterized by his use of paint, drawings, and photography in his sculptures, paintings, and prints, it was not surprising that his work would be missing.According to the London Times, the police were not called to the apartment complex in question until March 18, when an employee reported smelling a strong odor of ammonia. The strange event was followed a day later by a comment on Instagram, where Avedon created a series of sketches depicting laboratory animals that he claimed were creations of him. The first sketch, titled Closed, was made on March 16 and featured a gray lab-like humanoid figure, made of plastic, with a dark, gray, and red skin tone. The second sketch, titled Closed, 2, was made on March 16 and featured a black lab-like humanoid figure with blond, gray, and black hair and a white face. The third sketch", "The next Biennial should focus on the history of art in the Americas, with a particular focus on the creation of new works by indigenous artists. It will also consider how art has shaped the history of contemporary societies and the future of art.”The 2020 edition, titled “Art, Politics, and the Struggle for Human Rights,” will open on September 11 and run through December 13. Its twenty-first issue, which will be released on January 27, will explore the issues and trends that are shaping contemporary life in South America. The twenty-fifth and twenty-sixteenth biennials are slated to open in the coming months. A selection of articles published by the biennial will also be presented at the inaugural meeting of the American Indigenous Studies Association (AIS), a new organization, held at the University of Michigan, Ann Arbor, next month. “We are so honored to present the most recent collection of essays and articles by the AIS’s curators, and to present the first exhibition dedicated to art and politics in the Americas,” said Erik Dejong, the director of AIS. “These essays and articles will open a new dialogue that will examine the history of indigenous art and politics in the Americas", "The next Biennial should take place in 2020 and the twenty-seventh will be held in 2021. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $100,000 donation from the Charles and Lucille King Family Foundation. The gift, which was made during a three-day celebration of the foundation’s 10th anniversary, comes on the heels of the foundation’s $1 million donation to MFA in 2015. The gift also marks the end of a three-year period of programming and fundraising that began in September 2018 and ended in April 2020.“The Charles King Foundation and MFA are synonymous with art and artmaking,” said Peggy Guggenheim, the foundation’s board chair. “The history of the foundation as a whole is an inspiring story of three decades of visionary philanthropy, of the creation of an endowment, of the development of new programs, and of the transformation of MFA. This year’s celebration was an opportunity to celebrate a decade of groundbreaking work as well as a series of events that have shaped the foundation’s role in transformative themes and the themes of the future.”Since the foundation’s founding in 1987,", "The next Biennial should be in the spring of 2020. The theme of this iteration of the festival will be “Reproduction and the Arts.”\n\n\nThe Museum of Fine Arts (MFA) Los Angeles announced today that it will not renew contract negotiations with its former director of photography, David H. Richard, with whom the institution had previously been at odds over the years. Richard, whose tenure ended in June 2019 after he allegedly punched a woman in the face, was forced to step down from his post after he allegedly threw a woman’s breast through a glass partition of the museum’s entryway. In a statement, the museum said: “We take seriously all allegations of inappropriate behavior, and our internal investigation determined that no action was taken by David. David is no longer with the museum and will leave the museum as soon as possible. We respect his decision and will support him fully.”In an interview with the New York Times, Richard said: “I’ve done my duty as a professional and respected member of the staff. I’ve defended the institution’s mission for twenty years. I’m retired and I’m feeling good. I’m a heterosexual", "The next Biennial should take place in the spring of 2021. “That is a long way off,” said Li, who noted that the museum also plans to begin organizing in the autumn.A short film by Zhang Yaxuan (Dangdai) about the birth of Li Huaiyan\u0097the father of Li Yaxuan\u0097was selected as the theme of the upcoming exhibition. Zhang also directed a documentary about the artist, Li Yaxuan: Daddy, which was shown at the Venice Biennale in 2003.\n\n\nOnly a few miles from the National Museum of China in Beijing, located near the National Museum of China in Shanghai, the museum announced today that it plans to move the exhibition “The Cultural Revolution and Rome” from its current location next month to the National Museum of China’s Changsha branch, which will inaugurate the newly commissioned exhibition in April. The announcement follows the authority’s decision to cancel the Chinese pavilion at the Fifty-Seventh Venice Biennale in March, amid a controversy over the annulment of a Maoist-era book, The Construction of Socialism and Liberation, and the subsequent suspension of the Festival of the Five Elements.In a statement, the", "The next Biennial should be held in 2021 and will be the last exhibition devoted to the artist. “The biennial is not like a flash exhibition, a movie, or a performance,” Giorno wrote in a letter to the organizers of the show. “It is a living organism, a living thing with a life and spirit that has been living and growing over twenty-four years. The process of its transition from a lifeless object to a living being is a process that is not yet finished.”The show, which aims to mark the artist’s seventy-sixth birthday, is supported by the artist’s heirs, the artist-in-residence at the museum Richard Meineke, and the artist’s wife, Kimerlyn; and funds have also come from the Getty Trust, the Getty Museum, and the Sargent’s Dorsky Collection, and the Getty Foundation. The show will return to the Getty in 2020.\n\n\nMIDWESTAKERS, the Serbian sculptor and painter, has died at the age of eighty-three. His works were often influenced by his childhood, which spanned six centuries, but by far and away his greatest", "The next Biennial should take place in 2020. In an announcement published on the new partnership on June 5, Lange Gallery and the Museum of Modern Art (Lange) said that together they would produce a new exhibition, titled The One One and Only, at the museum in 2020. “Bijou will have a new central role in the museum, and the collection of which has never been more important to us,” said Lange CEO Parisa Haritz.\n\n\nArt historian Franklin Proch and his wife, Tanya, have been awarded a $10.25 million grant from the Sargent-Rochdale Foundation in support of an exhibition organized by the London-based firm DeBeers Art Gallery in partnership with the Metropolitan Museum of Art and the Studio Museum in New York. The initiative will see the artist-run firm bring the works of thirty-four monumental contemporary artists to the gallery for a series of four shows.“Thanks to the generosity of the Rochdale Foundation, we are now pleased to announce that Franklin and Tanya will be presented with an amazing new grant of $10.25 million,” said Marks & Spencer. The grant, which also supports the construction", "The next Biennial should take place in 2020 and will invite between thirty and sixty artists and designers from around the world. It will be held in the city of Oldenburg in the state of North Rhine-Westphalia. The event will celebrate the history of Duisburg and its cultural legacy. Spearheaded by Lorenzo Bava, a curator from the New Museum and a partner at the gallery, the biennial will be divided into three parts: Part 1: The Art of Humanity’s Place in Time and SpacePart 2: The Eternal Kingdom Bessie De Meule, Bernardo De Meule, and Tegane De Meule, Finland, and SwitzerlandPart 3: The Great Chain of BeingPart 4: The Proposition of the BodyPart 5: Apollon and the Eight Partners of the BodyPart 6: Amiti, the Universal Creative BeingPart 7: The Threefold Hierarchy of the BodyPart 8: The Three Generations of the Body’s Eternal ParenthoodPart 3: The Third Generation of the BodyPart 4: The Third Generation of the Body’s Eternal Parenthood,", "The next Biennial should, however, focus on the humanities, and on the ways in which contemporary life and culture is affected by the archaeological and biological discoveries of the past. In this way, the second edition of the Geffen Contemporary Art Biennial, which opened in May 2019, will be followed by the third edition, which will open in the fall of 2020.\n\n\nAustralia has released a new set of guidelines for museums and archaeological sites that could help save the life and health of tens of thousands of Aboriginal Australians during the coronavirus pandemic, which began in Wuhan, China, in March and has since spread to more than 100 countries and territories.The guidelines, which were issued by the Australian Museum of Natural Sciences (AMD) and the Australian Council of Historic Design, outline how organisations, including heritage institutions, should work together to mitigate the climate emergency. They also outline how cultural workers, including archaeologists, should prioritize the collection and protection of cultural heritage, and how the preservation of cultural artifacts is an integral part of a museum’s mission.“The museum is a living thing, a living ecosystem,” said museum director Elizabeth Ann Macgregor. “It is essential that we work together to mitigate the climate emergency and protect", "The next Biennial should be held in Paris in 2022. \n\n\nThe Solomon R. Guggenheim Museum has received a donation of seventy artworks from the artist-collectors Charles and Amanda Sender, who were inspired by the Guggenheim’s acquisition of fifty works from the artist-laboratory, the New York Academy of Art, by fellow billionaire industrialist Henry Stern, as part of a massive, $70 million overhaul of the institution, dubbed the Guggenheim Experience, in 2013.The gift includes a set of nine paintings by the artist Isabel Almanza, a series titled “Obligations of Life” by Margaret Mitchell, and two works by the artist-activists Lourdes Estévez and Rosalind Franklin. The works are part of “The Experience: The New Art in the Guggenheim” (2015–16), a project organized by the Guggenheim Museum and curated by Julian Schnabel, whose first solo exhibition at the institution,“The Crucible” (2019–20), sold out in December.“The Guggenheim Experience” was designed by John Carey, architect of the Guggenheim, with", "The next Biennial should be held in 2022. The remainder of the situation will be decided by the artists’ associations of the thirteen countries participating in the event. The next edition of the Art Basel Show in Hong Kong will take place in 2021. Finalists are currently being chosen from a shortlist of fifteen artists. The artists selected for the 2019 edition include Gina Beavers, Enoch Choi, Ivan Albright, Jane Greaves, Kathrin Gustafsson, Oscar de la Hoya, and Oskar Kokskäll. The 2020 edition will be held in June. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Deborah J. Carter as its next CEO. Carter succeeds Kathrin Gustafsson, who departed the institution in March 2019, and will take up the post in January 2021.“We had been considering Deborah for more than a year, fostering an understanding of her passionate and compelling history as a curator, her vision for MoMA, and her ability to reach across disciplines and communities to create new creative opportunities for the museum,” said Mark Lubell, the institution’s director and chief curator.", "The next Biennial should take place in 2021, and the first prize for best new media project will be awarded in 2022. The awardees were chosen by an international jury comprising Carlotta Gallocchio, artistic director of the CNA; Joëlle Bussié, artistic director of the Art Encounter; and Thegrégory Roldan, director of the Renaissance Museum in the Musée Saint-Pierre in Paris.“The artists were asked to create, in the exhibition, a work that is part of their own lives, that reflects on the richness of their lives and that is innovative and different,” Roldan told the Art Newspaper. “They were also asked to create a work that will be recognized by many and be an inspiration for other artists.”The artists were selected from a shortlist comprised of Nicolai Berzins, Russia’s national collection director; Gianluigi Ciavarella, director of the National Sculpture Museum in Rome; and Rashid Badran, artistic director of the Musée de l'Art et de l'Orangerie in Paris. The deadline for the award was March 31; the winners were chosen by", "The next Biennial should be held in the city in 2021. This year’s edition, titled “The Spirit of Things” and curated by Naomi Campbell, was held in the city of Santa Fe, New Mexico.\n\n\nThe National Museum of Fine Arts (NMFA) in Savannah, Georgia, has appointed Elizabeth S. Cooper as its new associate curator of European art. Cooper will be responsible for building on the work of her predecessors, Monica McQuarrie and Carolee Schneemann, and will assume her responsibilities on September 1.“Elizabeth brings with her decades of experience and knowledge of European art and is uniquely suited to support the museum’s curatorial approach in our contemporary times,” said museum director Randall Kennedy. “Her curatorial expertise and commitment to curating will further the museum’s global mission as we build upon the institution’s rich and innovative history of celebrating art and art history through our exhibitions and programs.”Cooper comes to the institution from the Smithsonian American Art Museum (SAAM) in Washington, DC, where she was assistant curator of twentieth-century American art. She most recently served as director of the artist-run residency program at the Philadelphia Museum of Art (", "The next Biennial should take place in March 2021, but the timeline of the exhibition is still uncertain. The biennial’s southern portion, titled Afterlife, will receive thirty-six artists, including Sifang Li, Quyen Leung, and Hsu Yen, and will open in early March. “When our project was announced at the Art International—a few years ago—it was a great surprise to see so many of our chosen artists chosen by industry,” said Dr. Julie Chipman, artistic director of Art International, in a statement. “We were thrilled to hear it was so important to the art world that they could see and have a real impact on the world. We are now excited to see what they will create.”The exhibition will be curated by Rolando Ingrid, director and CEO of the New Yorker Art Museum and Art Museum St. Louis; Mark B. Reitman, director and CEO of the Museum of Fine Arts, and Art History of Los Angeles; and Jennifer Fry, curator at large and a fellow at the Routledge Foundation.The next edition of the Biennial will take place at the end of March, 2020.\n\n\n", "The next Biennial should be held in 2020. \n\n\nA group of artists and musicians signed an open letter condemning the Trump administration’s plans to roll back environmental protections. “We condemn the dismantling of the Paris Climate Agreement, the withdrawal from the United Nations, and the dismantling of the United States’ international trade agreements,” the letter reads.We have come to the conclusion that these actions are not in the best interests of the American People or the planet,” reads the letter. “We urge you to reconsider your plans and consider reopening the Paris Climate Agreement and working with our international counterparts to ensure that America’s commitments under the Paris Agreement are met.”The signatories of the letter are: Becca Basso, New York; Matt Bai, New York; Anish Kapoor, New York; Adam Landsman, New York; Kate Lewis, New York; Molly Mallory, New York; Jennifer Parker, New York; Michael Oster, New York; and Pia Camil, New York.The open letter is written in response to the Trump administration’s announcement that it intends to withdraw the United States from the Paris Climate Agreement, which was finalized in 2015 and requires the United States", "The next Biennial should be held in the Spring of 2020.  Recently, the museum has been trying to introduce more exhibitions and public programs that aren’t limited to a few genres, such as art fiction and video-art, and will present at least four new exhibitions at the institution in the coming months. “The exhibition program is still in its early stages, so it is impossible to say how many exhibitions it will show,” said Jun Shino, director of the Guggenheim. “However, I am convinced that, just as in the past, the Guggenheim will show a new collection of works by artists of all kinds in the coming years. It will not simply sit in a museum, but will become a forum for dialogue, reflection and discussion.”The Guggenheim’s current exhibition “The Guggenheim Collection: A History of Modern Art,” which will be on view in the museum until November 3, 2019, is slated to close in April 2020. It will reopen in March 2021, at the Guggenheim’s new home in the city of Bern.\n\n\nThe National Gallery in London has appointed Mungo Macgregor", "The next Biennial should be held in 2021, with a date yet to be announced. The exhibition will showcase the work of seventy-eight artists in a selection of fifty-six works that have been selected by an international jury comprising artists, curators, and curators-in-residence. The winners will be announced at an Exhibition of Contemporary Art in Rome in March 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has added four new members to its curatorial team: artist Daniel Silva, who is currently the subject of an ongoing solo exhibition at the museum, the Los Angeles County Museum of Art (LACMA), and the San Francisco Museum of Modern Art; Christine Yang, a Los Angeles native who is currently the recipient of the Ruth and W. L. Gilbert Fellowship in Art Conservation; and Adrian Wootton, a former Los Angeles deputy district curator and now an assistant curator at the Los Angeles County Museum of Art.“The new curators are dedicated to the central themes of the collection,” said David Green, director and CEO of the museum and the Los Angeles County Museum of Art. “We look forward to working with them to advance MoCA’s collection mission and to foster a sense", "The next Biennial should take place in 2020.\n\n\nThe Chicago Architecture Center (CAC) announced today that it is hiring three new interns to work on its upcoming exhibition “Agency and Design,” marking its first foray into the field of creative design. The exhibition will be organized as a series of multi-layered installations, each incorporating a different style of work in the exhibition.“As we continue to develop our exhibition plans, our galleries are moving to accommodate new audiences, and our exhibitions have expanded in scope, we are also able to offer programs that can be more challenging to the art world’s most demanding exhibitors,” said curator, CAC director Sarah Brownlee, and CAC board chair Vinnie Bagwell. “We are proud of the work of the three young artists who are poised to contribute to the exploration of the potential and the possibilities of agency and design.”Through the exhibition, the artists will present their work in the form of an introduction to an exhibition organized by the CAC’s artist-in-residence, Elizabeth Anagnos, and will be able to choose from a selection of thirty-eight works from the exhibition. The program of the three-week retrospective,", "The next Biennial should be held in January 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Stephanie Gartenfeld director of the Silver Lake district. Gartenfeld comes to the neighborhood from the Museum of Contemporary Art in San Francisco, where she will be responsible for developing and executing MoCA’s long-term vision for Silver Lake. She will succeed Susanne Vielmetter, who has led the institution since 1996, and will assume her responsibilities in October.“Stephanie Gartenfeld’s vision for the Silver Lake neighborhood is to build on the Museum’s legacy as a center of artistic excellence and create a new kind of hub where artists and visitors can come together and experience the world through her curated exhibitions and artist residencies,” said Bruce MacGregor, vice president and chief curator of the Silver Lake Art Museum. “This is an exciting term to be awarded to a woman who has been instrumental in transforming the Museum from an icon of American art to an important and inspiring cultural center for a diverse and growing world. She will bring a wealth of experience working across disciplines in an exciting new environment, and I am confident that she will make MoCA an even more vital and", "The next Biennial should take place in the spring of 2022. The next Art Biennale will be held in the spring of 2022. The 2019 Art Biennale will take place in the spring of 2020. The next Art and Design Biennale will be held in the spring of 2022. The next Art and Design Exhibition will be held in the spring of 2021. The next Art and Design Festival will be held in the spring of 2022.  The 2019 Art and Design Art & Design: the Next Frontier will be held in the spring of 2021. The next Art and Design Exhibition will be held in the spring of 2021. The next Art and Design Festival will be held in the spring of 2021. The next Art and Design Exhibition will be held in the spring of 2021. The next Art and Design Festival will be held in the summer of 2020. The next Art and Design Festival will be held in the spring of 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Steven Schell as its next director. Schell comes to the institution from the Metropolitan Museum of Art, where he has served in the role of deputy director since 2008. He succeeds Stephanie New", "The next Biennial should take place in the fall of 2022. The 2019 event was canceled because of the Covid-19 pandemic. \n\n\n\n\n\nBookmark this. \n\n\nThe Los Angeles County Museum of Art (LACMA) is planning to hold a series of exhibitions and performances in response to the coronavirus, which has been causing novel coronavirus-like illnesses around the world, beginning in March. The first show, titled Pandemic: Los Angeles, will kick off on March 23 and run through at least May 21. The second, titled The Real Los Angeles, will follow in June. The first show, titled The Art of Disaster, will showcase work by forty-four artists, including Ruba Hattar, Alex Gibney, and Mark di Suvero, and will be staged at the LA County Museum of Art in California’s Central Valley. The second show, titled Unseen, will examine the history of visual art in the United States and its relation to the coronavirus, which has been transmitted mainly from person to person, and will be presented by the Los Angeles County Museum of Art in California’s North Hollywood. The third show, titled The Lives of", "The next Biennial should begin the month of September, with a selection of works by forty-six artists. The exhibition will also include an exhibition of work by artists who have been underrepresented in the history of the annual event.\n\n\nAfter President Donald Trump’s inauguration, a group of academics and activists sent a letter to the United Kingdom’s Office of Arts, Heritage and Science, calling for a “comprehensive review of the European Union’s relationship with the United States.” The academics argued that the political climate has changed since Trump’s inauguration; the United Kingdom is more isolated from the United States; and the British government has issued fewer travel warnings.Since the letter was drafted by scholars and researchers from the institutions of the University of Cambridge and the University of Oxford, the letter’s signatories included Sakul Kasul, Anish Kapoor, and Richard Sugg, as well as Ann Carson-Wood, Helen Sharpe, and Ciarán O’Neill. The academics argued that the Brexit vote and the Trump presidency have increased the risk of an “unacceptable breach of international law and public policy.”They added: “The UK is not immune from this threat;", "The next Biennial should take place in 2022, and the Art Basel Hong Kong edition will be held in 2021. \n\n\nZoologischer Kunstverein Berlin (ZKMB) has received a gift of one hundred works by an anonymous donor in an unprecedented gesture of kindness. Named after the late collector Bieter Kunsthalle Heim, the prize will be awarded to the Berlin-based artist Herbert Bayer, a celebrated German postwar artist and a major collector of postwar and contemporary art.  The artist, whose work is housed in the collections of Berlin’s Museum of Modern Art, the Kunsthalle Basel, and the Museum of Contemporary Art, New York; the Tate, London; and the Jewish Museum, Vienna; Bayer was approached by owner Wolfgang Totenhaus in late December to share one hundred works by the American avant-garde photographer and his friend Max Hetzner.“They asked him to form a group of art dealers, and he agreed,” Bayer told the Art Newspaper. “He put the first work by Hetzner on the list, and I asked him to show me another ten. I asked him to show me three more, and he did", "The next Biennial should take place in 2020 and will consist of twenty artists, including Adriana Corella, Yoko Ono, John Gavin, Kiki Smith, and Alvin Toffler, who were selected by a jury made up of Denise Brown, director of the Museum of Modern Art; Paula Deen, director and CEO of the Metropolitan Museum of Art; and commercial artist Dan O'Connell, among others.\n\n\nNew York’s Whitney Museum of American Art and the Westchester County Museum of Art will cancel their spring 2019 editions, effective March 23, in an attempt to reduce the risks of Covid-19, the virus that has killed at least 1,400 people in the United States and has caused at least 8,000 deaths. Both institutions say they are reviewing the possibility of rescheduling the exhibitions to avoid disruption to their campuses and are working with the Centers for Disease Control and Prevention (CDC) to test all relevant personal protective equipment (PPE).On March 24, the New York Times reported that the CDC had issued a public health advisory for public buildings and public areas nationwide, urging people to wash their hands with soap and water for at least twenty seconds after blowing your nose, coughing, spitting, or drinking anything containing", "The next Biennial should be held in the spring of 2022. In a statement, the museum said: “The next Biennial of the Italian Architecture will be an extraordinary tribute to the life and work of Giacomo Loggia. It will not only include the work of the greatest architects of the twentieth century, but will also embrace the exhibition of the work of generations of architects.” In an interview with the Italian daily newspaper the Corriere della Sera, Marinaro said that the pavilion will be “an extension of the university’s research center.” He added that he “almost gave up thinking about the pavilion in 2011, when I was presenting a new work by Leonardo’s legendary architect, Gio Ponti.” The biennial is scheduled to run from May 26 to May 29.\n\n\nArtist-run, nonprofit galleries in the United States are finally being recognized for their achievements in curating exhibitions and raising money for charitable causes. The certification process, which involves an artists’ board nominating a set of criteria, was completed on Wednesday, and the seventy-six nominees are now eligible to receive a $10,000 grant.The 2020 grantees are a group", "The next Biennial should take place in 2020.\n\nSpeaking at a press conference in Venice, Artnews reported that a spokesperson for the museum told the publication that the next edition of the event will not take place in 2020, but rather in 2021. The spokesperson explained that the decision to cancel the 2019 event was made due to a change to the biennial’s theme. “The date is still on the table, but it is not currently a subject that we’re going to participate in,” the spokesperson said. The museum, which had previously stated that it would move the exhibition to 2021, said that it is still evaluating the 2019 exhibition and will announce further announcements in the coming months.The collection will return to the museum in 2022, when the exhibition will reopen.\n\n\nThe University of Bristol is to receive $13 million from the National Lottery Heritage Fund (NLHF), an initiative run by the UK’s National Lottery Heritage Fund, in support of the running of the prize in 2021. The funds will also go towards helping to raise awareness of the theme “Bristol,” which is a nod to the city’s historic birthplace, and will be used for the institution’s current", "The next Biennial should include biennial presentations of work by artists from East and West, South and Southeast Asia, and the Americas. If the two-year event is successful, it will mark the first time the Royal Academy of Arts has hosted a biennial as part of Art Basel. The organization hopes that the prestige of its residency program will draw audiences for the event; however, the exhibition will be largely empty due to the Covid-19 pandemic.The art-world institution will also collaborate with museums and cultural institutions in the United States and Europe to create the world’s largest exhibition about the Covid-19 pandemic, which will open to the public at the Tokyo Metropolitan Museum of Art (TMO), on November 14. The exhibition will also feature work by twelve artists, including Adeline Kahn, Jodi Throckmorton, Jumpei Matsumi, and Mark Z. Danielewicz, and will include works from the collections of the Museum of Contemporary Art Chicago, the Metropolitan Museum of Art, and the Museum of Modern Art.\n\n\nThe Mandarin Oriental Art Museum in Beijing, which was forced to cancel a Chinese art exhibition in February after the government ordered its employees to clean up after their industrial complex, has received", "The next Biennial should be held in 2020. Exhibitions would resume in 2021 and 2022, respectively, should the new agreement between the two sides be finalized. While the Netherlands has been working to secure the final pieces of the Paris Agreement for some time, it has faced resistance from its European neighbors who have insisted that the country suspend the entire event. Last week, the Dutch foreign minister, Bert Koenders, announced that the country would push ahead with the event, which was originally scheduled for March 26 to March 31. The deal, which must still be ratified by the other signatories, will suspend the Paris Agreement for a period of thirty days and will strengthen the Netherlands' position as a global leader in green-energy technology. \n\n\nThe Eliot Arboretum in New York has announced that it will begin welcoming visitors back in March. According to the New York Times, the observatory—which currently holds the Guinness Book of Records for the largest number of live animals on display at one time—came under intense scrutiny for its handling of the relocation of two hundred exotic animals from the zoo to its new home in the former Cobalt plant in the Catskills in the summer of 2019.The Eliot has confirmed that it will", "The next Biennial should aim to deal with the issues of diversity and the diversity of artistic and artistic-creative-hearts. The next Art and Art-Honors should concentrate on the relationship between art and identity. The next Art and Art-Honors should focus on the relationship between art and human dignity. I have always argued that art should be a tool for the emancipation and the development of the human being, a tool for the transformation of the world through art.”\n\n\nAfter the Sundance Film Festival in California canceled its upcoming edition, citing low attendance, in March, the Los Angeles County Museum of Art (LACMA) followed suit and reduced the budget of its second edition. The Los Angeles Times reports that the institution decided against expanding its film, theater, and performance programming in response to the coronavirus pandemic.In a letter to the public, LACMA chair Anne Gobble wrote: “We chose to focus this year’s event, ‘Titled ‘COCO,’ on the legacy of the Criollo de Cordova, a Spanish colonialist who transformed an abandoned Spanish town into a bustling gold mine. We chose to focus on the legacy of the Mexican American cultural and political", "The next Biennial should be held at the new Prudential Center in Newark, New Jersey, which is currently under construction and is to open in the spring. It would also be the first show dedicated entirely to the artist’s work, and it is still being designed. The most recent iteration of the event, which was held in 2017, was staged at the Center for Performing Arts in Philadelphia and showcased works by forty-eight artists\u0097including Adrienne Edwards, Alighieri Farago, Kiki Smith, and André Bazin\u0097with the attendance of a studio audience of twenty-four artists.The biennial will be hosted by an artist-run space called the Biennial Lab\u0097a tiny space nestled in a former auto body shop in a residential building in Newark\u0097and will feature works by forty-six artists. Five artists will be selected by a jury made up of Joshua Helmer, director of the Center for Performing Arts, and his wife, Annie Helmer. The other four finalists will be invited to participate in the upcoming edition, which will take place in the spring.The jury\u0097which comprises Helmer, Annie Helmer, environmental artist and designer Rachael Ayesha, the", "The next Biennial should be held at the Akademie der Kunst (AK), Frankfurt am Main, in January 2020. The next Design World Congress should be held at the International Exhibition Centre in Oslo in November 2020. More information about the 2020 tour can be found on the architects’ website.\n\n\nThe Art Institute of Chicago (AIC) has received a gift of twenty-six works by twenty-five artists from the Osswald Collaboration, the German nonprofit founded by Hans Ulrich Osswald. The works, which were donated by Cristina Pérez-Rivas, Luis Fernando Pérez, Andrea Rodriguez, Andrea Giunta, Richard Avedon, Marlene Perron, Alexander Shiffman, Laurie Stroud, and Catherine Wiseman, were given to the institution by Alexander Shiffman, a Chicago native, in honor of his father’s birthday. “The museum has been working tirelessly to present a comprehensive collection of contemporary art from the very beginning, and to create an engaging and educational experience for visitors to the museum,” said Maria Balsom, chair of the trustees of", "The next Biennial should be held sometime in 2020. The show will also be relocated and will resume as a part of the Art Basel Hong Kong 2020.\n\n\nThe British Film Institute (BFI) in London has decided to suspend the exhibition “A Beautiful Mind,” which was scheduled to open in September, and has announced that it is now planning to move the exhibition from the institution, which is housed in an old shipbuilding site on the Thames estuary, to a new venue in the city.“It is with great regret and disappointment that we announce that since September 2018 we have had no new BFI programming,” said BFI director Maria Balshaw. “We felt that this was the best way forward for the institution, and for the future of the BFI. It is a strategic and exciting time for the BFI, which is experiencing a transformative moment as we enter a new phase of its history in the 2020s. The new BFI in Leicester will bring together the greatest British shortlisted films of the last five years, and will be curated by Julian Fellowes, our former director of show in London.”While the actor Dominic West, who won an Oscar for Best Supporting Actor last year", "The next Biennial should be held in 2022.  Nordic Council president Joakim Egeland says: “The possibility of a new biennial is very much alive, and we are actively considering ways in which it could be organised in future.”\n\n\nThe Greek artist and educator, historian, educator, and writer, Xenophanes, born in Athens on December 19, 1821, died on January 3, 1923. He was ninety-one years old.Born in Kypsel, in northern Greece, Xenophanes studied in the ancient and modern Greek departments of the University of Kypsel and the Academy of Athens. He received his bachelor’s degree in art from the University of Kypsel in 1959 and was awarded his master’s degree in art history from the Academy of Athens in 1964. In his own words, \"I consider Xenophanes as one of the great moderns, a craftsman whose work opens up to generations the possibilities of painting and drawing.”He was a member of the Academy of Athens in 1964 and in 1967 was awarded the former Forop’s prestigious Gold Star award for his work, which was exhibited in the Seventeenth Venice Biennale; his work", "The next Biennial should be held at the Museum of Contemporary Art, Los Angeles (MCA), in 2020. “Theatre and the City is not an end in itself,” philanthropist and architect David K. Katz wrote in a letter to the MCA board in 2018, “but a means to an end, towards a future that does not end with the present, but with the future.”\n\n\nACMPA, the American Academy of Arts, has announced that Lauren Howard has been selected as its next president. Howard will assume her post in January 2020. Among her first tasks will be to grow the organization’s membership and determine a timeline for its reopening. Howard previously served as a curator at the Museum of Contemporary Art (MoCA); a curator at the Museum of Contemporary Art Chicago; and a staff writer at the Los Angeles County Museum of Art (LACMA). She will begin her new position in January 2021.“Since the announcement of the 2020 elections, the board has been unanimous in its endorsement of Lauren Howard as our next president. Her leadership and proven track record as a leader, curator, and educator will ensure that ACMPA remains a strong institution worthy of the name ACM", "The next Biennial should be held sometime between May and September 2021. The 2019 Prize was awarded to Sara Centro and Adrienne Edwards. The 2020 Prize will be awarded by a committee comprising Michiko Kano, director of the Recherche Spatiale in Lyon; Simone Roy, director of the Venice Biennale in Turin; and Renaud Pujol, director of the Barcelona Film Festival. The winning entries for the 2019 and 2020 awards will be announced in the coming weeks.\n\n\nThe great British artist Margot and his wife, the sculptor David De Niro, have been named the recipients of the 2019 and 2020 Artistic Award. Their work, The Elephant in the Studio, was commissioned by French artist Pierre-Auguste Renoir and was completed in 1958. The work, which was published in the June 1959 issue of the Art Newspaper, explores the concept of art as a \"living thing\" and demonstrates the artist’s mastery of the medium.The De Niro brothers are the first artists to receive an award for their work in the Museum of Modern Art (MoMA), which has awarded the honor since 1967. The De Niros are also the creators of the work The Elephant in the", "The next Biennial should be held in 2022. The twenty-first should be up in 2024. The 2020 edition, “Unseen: Artists and Science in the Age of Blackout,” featured work by seventy-two artists, including the Dreyfuss brothers, Jochen and Lucio, and the Prussian-Austrian duo BÄM and KAIST, whose work was displayed in the exhibition “Anselm Kiefer: Aarhus 1986” in 2022. In an attempt to redirect the biennial’s earlier focus on the idea of art as an antidote to racism, the following year “Aarhus 1996: New Art from the Dreyfuss Collection” featured work by forty-three artists. The exhibition also included a seventy-five-foot-long model of the Dreyfuss house.In 2005, the museum canceled the exhibition “Aarhus 1987”—which had been scheduled for the fall of 2007—in protest of the European Union’s decision to give Russia and the Kremlin more than $4 billion in aid, which many saw as an attempt to stifle the Dreyfuss’s art portfolio. The exhibition", "The next Biennial should be held in 2021. The next Panel Center should be built in 2020. The next Biennial of Modern Art should be staged in 2025. Bodoni Gallery, which is moving to Mexico City from New York, is exploring the possibility of staging a show around a new series of sketches by French artist Dominique B. Biennat. \n\n\nThe Venice Architecture Biennial has released the list of seventy-four artists who will participate in its twenty-fifth edition in 2021, which will be held at the Venetian in Venice, Italy. The exhibition will draw from a pool of seventy-eight artists from twenty countries. The exhibition will also include a symposium and an exhibition of work by young and established artists. The list comprises John Graham, Saul Berenicelli, Naima J. Coleman, Karolina Wojtas, Daniel Koul, Monir Nader, Andre Prade, Siân-Ming Wang, Uma Wadhwa, Leonor C. Johnson, and Martino Lippi. The exhibition is curated by Roberto Battista and will run until March 22, 2021.Candice Berluti, Mello Berni, María Berluti, and Arash", "The next Biennial should be held in 2020 and will be co-organized by the Museu de Arte Contemporáneo in Barcelona and the Museu de Arte de São Paulo. The 2020 event will be organized in an open format in the city of São Paulo, Brazil.\n\n\nThe Carnegie Museum of Art in Pittsburgh has appointed Kate Fung as its new executive director and curator of Asian art. Fung, who has worked at the museum for twenty-six years, succeeds Nancy Panetta, who departed in the summer of 2020 to join the Los Angeles County Museum of Art.Fung joins the museum from the California Institute of Technology, where she has served as deputy director for exhibition development since 2015 and has been an assistant curator of Asian art since 2016. During her tenure, Fung has curated twenty-three exhibitions and organized more than sixty-five shows. “Kate Fung’s expertise, enthusiasm, and vision make her a strong candidate for the position of director,” said Carnegie director Susan LaFleuré. “Her ability to support the collection, develop exhibitions, and build relationships across the museum and the city make her an ideal fit for the role. We look", "The next Biennial should take place in November 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $2.5 million donation from an anonymous donor. The gift was made by Mike Kelley, a former president of the Los Angeles County Museum of Art who served as director of public development for the institution under Christopher Simpson, who was hired as the museum’s interim director in February 2019.“The LACMA Foundation is thrilled to receive this gift from the anonymous donor in recognition of the work recently completed by the current staff on staff, and especially the work of our staff artists,” said LACMA director Matthew Teitelbaum. “It’s a very unique set of circumstances requiring the work to be performed by a group of staff artists in order to be considered.”The work, “The Arkestra,” was commissioned and painted by two LACMA artists—Ralph Olmstead and Billie Tsien—in collaboration with the Los Angeles County Museum of Art (LACMA), the Los Angeles County Museum of Art (LACC), and the Los Angeles County Museum of Art (LACMA). LACMA had previously commissioned the work for", "The next Biennial should be held in 2021. \n\n\nThe modern-day museum of modern art (MoMA) in New York has hired David H. Koch, the chairman and CEO of Koch Industries, as its new chair of global philanthropy. Koch, who founded the oil and gas conglomerate in 1981, has donated $8 billion to charitable causes over the course of his career, and his foundation provides $2 billion annually to the institution.In a statement, Koch said: “I’m thrilled to be joining the MoMA team. I have been involved in and inspired by MoMA for twenty years and am deeply inspired by the potential of its collection and by the passionate community it represents. The institution’s contemporary program weaves together an expansive collection from the artist’s and collector’s minds and places contemporary art back into the heart of American culture. I’m confident that it will provide a great platform for MoMA’s artists and curators as they continue to expand their visions of what art can be and how art can change the world.”Incorporating works by more than twenty-five artists into a single exhibition, the 2020 edition features work by women artists such as Sarah Macl", "The next Biennial should be held in 2020. Thank you for your attention to the matter.\n\n\nArtist and educator Ruth D. Hofmann, a pioneer of postwar American art, has died at age eighty-seven at her home in New York. The artist-in-residence at the Museum of Modern Art (MoMA) for more than a decade, Hofmann was a leading proponent of the postcolonial and feminist feminist traditions, which she called \"a continuous process of inventing and reworking the way that art was created and experienced by women and girls throughout the United States and the world.\"Born in 1932 in Brooklyn, New York, Hofmann studied at the Museum of Modern Art (MoMA) and the School of the Art Institute of Chicago, where she acquired her first painting and sculptural works by the 1950s. She would later serve as a curatorial assistant for work on the upcoming event\u0097The Body in the New Work, the forthcoming exhibition of work by women artists that will open at the Hayward Gallery in Manhattan on March 8\u0097and would eventually become a curator at MoMA.During her tenure at MoMA, Hofmann worked with artists who included Joan Miró, James Turrell, and Betty Parsons, among others she", "The next Biennial should be held at the Art Museum Houston in 2021, and there have been rumors of a 2020 reopening date, but no concrete dates have been set.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than 3,500 works by artists who were never given the opportunity to receive a solo residency at the museum. The gift includes works from twenty-two artists, including Darius Berlin, Alex Katz, and David H. Rothkopf, and was made in honor of the museum’s 150th anniversary. The works were donated by the family of the late Sargent and Georges Reginald Hauser, who were instrumental in the museum’s acquisition of works by Dorothea Rockburne and Theodore Deutsch.“The Rockburne Collection is an important part of the museum’s collection legacy, and we are honored to add their works to the collection as part of our efforts to honor the legacy of our founders and to make the museum relevant for the public,” said George Gant, director of the museum. The gift was made through the DeSoto Estate and is the largest collection of works by the couple.The rock artist’", "The next Biennial should be hosted by the London-based artist Ai Weiwei, who has been nominated for the prize twice already and is serving as the theme of the third edition. The theme for the fourth edition, entitled “Tomorrow,” is also still undefined.The inaugural Biennial of Simón Bolívar was held at the Museo de Arte Contemporáneo in Madrid in 2011. The opening ceremony was held at the Instituto de Cultura Artística in Luguay in 2012 and, in 2013, it was staged in Santiago, Chile, and the German city of Stuttgart. The fifth edition, “Theoretical Biennial,” was held in Copenhagen in March 2014 and was organized by the Copenhagen Studio Foundation.Museums in China and Hong Kong have been reluctant to embrace the mainland in recent years, but a number of recent exhibitions have attempted to tap mainland culture, including the inaugural Biennial of the Beijing Art Museum (BAM) in 2014 and “Singapore in the Movies” in 2020. Artnews reports that the exhibition “Singapore in the Movies” featured twenty-two films, which were shot entirely in the city of Singapore. \n", "The next Biennial should take place in Hawaii in 2022. The next edition of the Venice Architecture Biennale will also be held in the island country in 2022. The 2020 edition, “Greater Venice: From the 4th to the 8th,” was staged in the city of Venice. The next edition of the Venice Architecture Biennale will also be hosted at a new venue in the city of São Paulo, Brazil.The exhibition will be held at the same venue that hosted the 2015 edition of the Venice Architecture Biennale, which was held in the same building in the city of Venice from January 29 to February 14, and will be followed by an exhibition at the Guggenheim in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has hired Jennifer Parker, a curator and critic who has worked for the museum for twelve years, as director of its Fine Arts section. She succeeds Cindy Boe, who retired in March after fifteen years at the helm of the division in May.“I’ve been involved with MoMA for eleven years now, and I’m honored to be the newest addition to its board and staff,” Parker told the Los Angeles Times. �", "The next Biennial should be held at an area’s institution of higher learning, such as a junior high school, a public library, or a library owned and managed by a nonprofit organization. The theme of the upcoming exhibition will be “Artology” and will focus on the history of the museum. The city of New York also announced that it is working on a blueprint for revamping the Museum of Modern Art. The plan is to hold a new exhibition series, a New Museum-like museum, and a redesigned collection of more than 3,500 works by artists, curated by the museum’s curator of modern art, Deborah Barry, in the fall of 2021. The renewal of the contract between the two organizations will allow the city to add another 1,500 works to the collection, and will also introduce a new kind of programming at the institution. The museum is currently working with architect Michael Littman on a redesign of the building that will incorporate more living spaces, a café, a restaurant, and other activities for the museum’s collection. It will also house a new design for the museum, which will be inspired by the architect’s studio in the city.  Since its founding in 1957, the museum has", "The next Biennial should open in 2020. \n\n\nThe Turner Prize announced today that Edward Conlon has been chosen as the winner of its 2020 award. Conlon, who divides his time between New York, Paris, and London, created the video game Bioshock Infinite, which is set in a dystopian future in which humanity has been rendered extinct through the work of a virus, and is known for creating works that challenge the conventions of the medium. The artist will receive an additional $50,000 in recognition of his \"extraordinary artistic gifts.\" Conlon will be presented with the award at a ceremony at the Museum of Modern Art on November 17. Conlon’s work will eventually be included in a monograph on the artist which will be published by the New Museum and the Metropolitan Museum of Art in New York in 2021.Conlon’s work has been featured in exhibitions at the Museum of Modern Art, the Museum of Modern Art Paris, and the Museum of Modern Art Los Angeles. A retrospective organized by Panorama Pictures in London and presented by David Kordansky Gallery in New York was also staged at the Venice Biennale in 1998. Conlon’s work is currently included in the permanent collections of the New Museum,", "The next Biennial should begin on June 21 and conclude on September 28. The exhibition will include works by more than 150 artists, including Melchior, Andrea Büttner, Ahmed Ben Ghanem, and Guadalupe Rosales.The new exhibition will be curated by Ana Lopes-Cabañas and José Palacios, the organizers of the previous edition, which took place in Barcelona in 2014. The new material is centered around a theme of resistance against the Spanish state and the city of Barcelona, a coalition of artists including José de la Barra, Diana Braxton-Hamilton, and Joaquín Fernández. The museum will be inaugurated with the work of the Barcelona contemporary art collective Caian.\n\n\nMuriel Bock, a German-born artist whose work explores the power of images and their cultural and political significance, has died at age eighty-nine. The Berlin-based dealer, who had recently relocated to the United States, began her work as a postmodern avant-garde painter in 1977, after the dissolution of the German Democratic Republic. Over the next decade, the self-taught artist explored the notion of the image in her paintings, sculptures, and photography. “Muriel was", "The next Biennial should be held in the fall of 2022. In an interview for the magazine, which is currently on display in the exhibition “Art in the Age of Resistance”, Ornstein said: “There has been a significant shift in our thinking about art in the last twenty years. ‎We now say that art is only one of many forms of expression, expression is the only form of expression. ‎‘I am convinced that without art there can be no other culture. And that without art there can be no culture.’\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Laura Conner as its next director and CEO. Conner takes the helm from Megan Lozano, who has led the museum since 2011, and will assume her responsibilities on March 1.“We are grateful to Megan for her leadership and her proven commitment to MoCA,” said curator and director Paul Mpagi Sepuya, who will remain involved with the museum as an artistic consultant and will continue to be involved with the institution’s programming. “Laura has an extensive history in museum leadership and has been instrumental in advancing our evolving collection strategy, helping to shape the museum’s", "The next Biennial should be held in 2020, when the exhibition will commemorate the centenary of the German-born artist Alexander Calder’s famous exhibition in which 46 works from the series were exhibited in a single night, thus creating a double exhibition. The exhibition would also include a collection of works by Calder’s eldest son, Ludwig.\n\n\nThe National Gallery of Victoria in London has appointed Jemima Clement as its new deputy director. Clement will be responsible for advancing the work of the National Gallery’s collection, which comprises nearly five hundred works, exhibitions and public programs, and will take up her new role in the summer of 2021.“Jemima is passionate about the National Gallery and its collection, and about supporting artists who have made important contributions to the collection over the years,” said museum director Elizabeth Anagnos. “In collaboration with the curators, artists, and fellow curators of the collection, Jemima will design a program that will engage with the collection in a meaningful way, complementing and ultimately redefining the National Gallery’s own catalogue.”Clement joins the National Gallery from the University of Cambridge, where she is currently a research associate. She has previously held senior roles at the National", "The next Biennial should include a list of twenty artists who have received the prestigious Prix de l'Histoire’s Lifetime Achievement Award for their work. The following year, a retrospective of the work of the nineteenth-century French surrealist, Pierre Cézanne, should be staged at the Museum of Modern Art in New York.Paris’s branch of the Harry C. and James L. Knight Foundation, which established the Emily and Frances Warner Center for Arts in 2001, said that it expects the 2019 iteration of the festival to draw an additional five thousand visitors.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it is launching a new initiative designed to help artists whose livelihoods are being adversely affected by Covid-19. Called the Artist Power Center, the program will provide grants and loans of artmaking equipment and will partner with local and regional arts organizations to assist them in transitioning to self-sustaining businesses.“The Artist Power Center will provide a new model for support for artist-run organizations,” said museum director Carlo Cammack. “With the new cooperative program, we hope to help everyday artists and groups get a boost in their efforts to stay connected with their audiences, while also", "The next Biennial should focus on “intersection of art and politics,” Artforum editor in chief Jon Shinnert said in a statement. “The Future Fairs, with three themes: ‘power and politics,’ sociality and aesthetics, and the unknown and the natural,” will highlight the work of artists in their home countries.This year’s assemblages will take place at the Royal Academy of Arts, the Royal College of Art, the New College of Art, and the Art School of the University of London. The art historians will present their final profiles of Billie Lurie, Robert Irwin, and Louis Vuitton before the Museum of Modern Art (MoMA) opens to the public in 2020.\n\n\nThe National Geographic Society’s proposed redesign of the National Geographic Society Building in Washington, DC, has been delayed again, this time by a year. The design, which was first unveiled in 2018, was voted on by the National Geographic Society’s Board of Directors in 2020 and received approval by the board on July 1, 2020. The redesign will be unveiled at a future date in the spring of 2021.The redesign, which is part of a larger $70 million renovation project,", "The next Biennial should be held in the spring of 2022.\n\n\nThe British council for Culture and Creative Heritage (BCC) has appointed Daniel P. Davies as its new chief executive. Davies will be responsible for overseeing the creative and performance sector in the UK and will assume his post sometime between March and June.“I’m delighted to be joining the board of the British Council, a wonderful organisation that was founded with the vision of bringing together artists and thinkers from around the world, Davies said. “I’m very excited about the future and excited to work with the British Council on how we can make our creative and cultural life more attractive to and responsive to our audiences.” “I’m eager to contribute to the current champions of creativity and play and the future of our world,” Davies said. “This is an exciting time for British arts and I’m looking forward to working with the British Council to ensure they continue to flourish and thrive under my leadership.”\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of three decades of work by architect Mohsen Makhoul from his wife, Fatima Makhoul, a former", "The next Biennial should take place in the spring of 2021. The biennial will focus on “fragmentation,” and will comprise over ninety artists from twenty-six countries.“We are very excited to present the first biennial in the United States with the new artists emerging from the area,” said biennial director Rosalind Walsh. “The gallery is thrilled to present the artists we have chosen for the first Biennial, and are thrilled to have the opportunity to present them in the nation’s capital.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles will remodel its building in recognition of the city’s contribution to fighting homelessness. The renovation, which will include the addition of permanent supportive housing, is part of the City’s $10 billion Make Homes Count initiative, which aims to end homelessness through the construction of supportive housing for the chronically homeless.“The Museum of Contemporary Art has been a leader in developing new models for supporting the homeless and promoting creative and social responsibility, and we are excited to now work with the community to build on this legacy,” said Mayor Gavin Newsom. “We are working with the local, state, and", "The next Biennial should be held in 2020. “The exhibition will meet with a diverse range of challenges, from political, social and cultural, to physical and spiritual,” said Guggenheim senior curator and director, Daniel H. Weiss.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) has received a gift of more than four hundred photographs by Evelyn and Robert Rauschenberg from the artist’s daughter Evelyn Rauschenberg-Bakargiev. Written by Evelyn and Robert in memory of their father, who passed away in 2017, the works will be displayed in the artist’s daughter’s first solo exhibition at the museum since 1998, which is slated to open in October.The works, which were donated by their daughter to the museum in 2015, include portraits by ­Robert Rauschenberg and his twin twin sister, Evelyn, of a black-and-white landscape in which they lived in New York in the 1970s. Both the artist and the twins are known for their enduring interest in photography. The vast majority of the works are in the public collections of the artist and the Met; however, Evelyn and Robert’s archive is housed in", "The next Biennial should take place in 2021. When asked about the next iteration of the Museum, Tate director Maria Balshaw said: “The future of the Tate lies with the people. We cannot, as a body, survive without you. I have always believed that the future of the museum lies with you. The future of the city belongs to the people of London, and we are determined to make this happen. We are going to take everything we have learned from the past and apply it to the future.”The 2020 theme “Towards a new kind of relationship between culture and society” was chosen in collaboration with the Culture, Media, Arts (CMA) Foundation, the London-based creative agency, which commissioned the piece by British artist Phil Collins. The CMA Foundation also provided the artist with a $1.5 million grant for his work.Commenting on the project, CMA Foundation director Pilar de la Baria said: “Louise Wright has a particular perspective on the ways in which we interact with one another and the connections between culture and our environment. We are thrilled that the Tate Board and Tate’s board chose her for this year’s exhibition. Her work is beautifully", "The next Biennial should be announced soon. \n\n\nThe Galleria Montitras, the gallery space of the CNA, in Rome, Italy, has appointed Maria Cipolletti as its next director. Cipolletti has been with the museum since 2009 and served as its executive director until October 2020, when she was appointed director of the Palazzo Prada.“Maria is a fierce leader and is responsible for the development and execution of a comprehensive programming program,” said director Marco Bellini. “She is also the founder of the latest design studio, LMAC, and an internationally-recognized collector of contemporary art. Her creativity and ability to draw in new ideas and new audiences is unparalleled, and we are deeply proud to welcome her into our company.”\n\n\nThe Laurel Museum in New York has received a gift of twenty-nine works by influential early American abstract painters in its collection. The works, which comprise the collection of the Laurel, an independent arts center that has been a cultural landmark in the Hudson Valley since it opened in 1993, were donated to the institution by artist Jim Meehan, who also purchased the works from the Laurel in 2007.“Jim donated these works", "The next Biennial should be held in 2021. The announcement coincides with the release of the fifty-eighth and final edition of the exhibition, “Toni Erdmann: Partners,” which will be held at the New Museum in New York in 2021.<|endoftext|>New York, NY: The Metropolitan Museum of Art (MoMA) in New York announced today that it plans to remove an exhibition that examines the role of the institution in the world’s largest city, the United States. The exhibition, “Theater of Operations: The Gulf Wars 1991–2011,” will reopen at MoMA in October 2020. The exhibition was created by the Museum of Modern Art (MoMA) in partnership with the Institute of Contemporary Art (ICA), the Los Angeles County Museum of Art (LACMA), and the University of Pennsylvania, which collaborated with ICA in the development of “Theater of Operations: The Gulf Wars,” a comprehensive research project that will examine the terrorist attacks that took place on September 11, 2001, and the resulting ensuing global crisis. The exhibition was inspired by a September 2018 essay in the August/September issue of Artforum that examined how MoMA–LACMA’s terrorist-themed", "The next Biennial should take place in the spring of 2021, before the first two exhibitions in the series, “KIRSTAG:NABIS,” curated by Martin Puse, and “LA ALOQUISTAS: STUDIOS DE LA TEO,” curated by César Espírito Santo, close their doors to the public.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has chosen Ashleigh Grant as its new associate director for arts and design. In her new role, Grant will lead the institution’s newly formed associate curatorial program, which will focus on curating and organizing exhibitions and events with an African American or Latina curators, in partnership with artists and cultural organizations.“Ashleigh’s experience and passion for art, design, and her relationships with artists and communities will serve as the backbone of our new academic partnership,” said Heather Pape, director of the 70,000-square-foot institution. “We are thrilled to welcome her to the MoCA family. I’m eager to see her creative process and her ability to nurture and support artists and audiences in these challenging times unfold.”Grant comes to the", "The next Biennial should be held in the spring of 2022. The 2018 installment, titled “After the Storm,” explored the history of climate change and its impacts on climate systems with works by artists such as Serpa del Pozo, Luis de la Peña, Jorge Sánchez-Cortés, and João M. Pires. The exhibition was preceded by a triennial dedicated to craft in the southern city of Recife, Brazil, in 2019, and a biennial for contemporary art in the capital in 2008.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than four thousand photographs by artist and activist Warren Kanders, who championed the radical notion of “painting the world in black and white,” as well as photography’s role as a “miracle of wonder and beauty.” Kanders, who passed away in 2012 at the age of ninety-eight, was a key member of the Black Power movement and a leading member of the Women’s March, which was protesting President Donald Trump in the United States.Kanders was born in Detroit in 1940, and grew up in a predominately Black, Detroit–born family, which", "The next Biennial should be held at the Museum of Contemporary Art Los Angeles (LA MoCA), in four years. “Art is a universal language that can transform lives,” said Roberta Smith, chair of the museum’s board of trustees. Smith added that the museum has received large donations of works by artists such as Eric Hovda, Mario Tama, and Carlos-Josef Alñar, but the board of trustees remains concerned about the future of the Art Institute of Chicago.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that the city’s public art galleries are receiving between $1.5 billion and $2 billion in aid this year, and that the DCLA’s newly established Cultural Fund will distribute another $1.5 billion to support cultural enterprises and educational initiatives.The grant program, which was established in 2017, is divided between five categories of cultural enterprises: arts and cultural heritage institutions, cultural production companies, nonprofit arts organizations, and nonprofit educational institutions. The categories were “art, performance, performance-based, performance-creative, and performance-enhancing interventions.” The funds will help support “art, performance, performance-based,", "The next Biennial should be held sometime between December and April, with a theme of 'Cycles of Paradise'\u0097a reference to the central Anglo-Japanese art of the early 20th Century. “I want to focus on the history of art,” said Cunningham, who is currently a professor of aesthetics at the University of Exeter. “The city has also commissioned me to build a new room for the collection of contemporary art, an artistic museum, and a public space for the arts. I’m really excited about that.” Among Cunningham’s recent exhibitions are “Telling Stories: Art and Memory in Contemporary Life,” which opened at the Arashdil, the National Gallery of Art, and the National Museum of Women in the Arts; “Theater of Disruption: International Art in North London, 1960–1973” (2019), a presentation of work by forty artists; and “Sydney Between the Worlds: Chinese Art between the Two Worlds” (2017), which was organized with the Chinese art historian and curator Yang Kai, the curator of contemporary art at the National Gallery of Australia, and the curator of contemporary art at the National Museum of Singapore.Commenting", "The next Biennial should be held in the spring of 2021.The Stanford Art Museum, California, is also planning to open an outpost in Los Angeles, the city of Los Angeles, in the summer of 2021. The institution, which is currently planning to begin construction of the new two-building, forty-thousand-square-foot venue in the summer of 2021, revealed that it is currently working on a new programming schedule for its summer meetings. \n\n\nThe Art Fund, a Dutch nonprofit organization that supports contemporary art, has received a major gift of more than thirty thousand paintings, drawings, prints, and posters from the W. M. Keck Collection. The gift includes more than six hundred works by the renowned American painter, entrepreneur, and philanthropist Charles Frankenthaler; works by artists such as Richard Avedon, Thomas Ashcroft, and Albrecht Dürer; and six six-foot-wide murals by Pablo Picasso.“Through a series of generous donations, the Keck Collection has provided the Art Fund with an extraordinary collection of artist and museum objects, whose acquisition will enable us to further develop our mission to reinterpret and preserve the art of the Mānoa Valley,” said Patty Rosenberg, the", "The next Biennial should take place in 2020. The first exhibition, titled “The Art of Almond Trees,” will open at the Palazzo Prada in Venice in March 2020.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) is planning to shutter its doors in April 2020 and reopen with a new group show on June 11. The announcement marks the first time that the museum has made public a new exhibition since its reopening in December 2019. The show, titled “Exhibitions,” will feature work by fifty-two international artists and will be curated by Julian Bergman and will run approximately ninety minutes.The announcement was made at a press meeting at the museum, which has been closed since March 14, and was made in response to a question posed by filmmaker and SFMoMA artist Sarah Polley. Bergman has openly criticized the museum’s current programming, which focuses on themes of architecture, technology, and design, and has proposed a series of “patents on machines,” a show of work by the artists of the American punk scene.“As a longtime observer, admirer, and critic of SFMoMA, I’m deeply moved by the show’", "The next Biennial should be a retrospective of Aloysius Ropac, the Spanish master who created the art of pain; “Surrealismo” (2015), an exhibition of works by the late Kiki Smith; and “The Work of Art: The Work of Aloysius Ropac” (2017), a selection of Ropac’s art from the collection of the Rijksmuseum in Amsterdam.\n\n\nThe Smithsonian’s National Museum of American Art (NMMA) in Washington, DC, announced earlier this week that Ronald A. Farina, former director of the California Institute of the Arts, will become the next director of the museum. Farina currently serves as director of the Metropolitan Museum of Art, the Museum of Modern Art in New York, and the Los Angeles County Museum of Art. He will assume his post in January 2020.“We are deeply grateful for Ron’s dedicated and long-standing leadership role in the NMMA,” said museum director Ann Carey. “Over the last twenty-five years, he has been instrumental in building our museum’s contemporary-art collection through the acquisition of works by and establishing a strong aesthetic legacy for the museum.", "The next Biennial should be held in 2021. It will remain closed until January 3, 2022.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of approximately one thousand photographs documenting the life and death of the late Italian modernist and designer Erma Shaw. The work was donated to the institution by a group of experts led by Artforum editor-in-chief Christopher Woolf, who was a close friend of the architect and collector. The group was founded in 2018 by Marcel Prouvé, Marc Spiegler, and Adrienne Edwards, whose gallery was the subject of a $30 million donation by the Zendesk family in 2014.“We are incredibly grateful for the support of the families and friends of Erma Shaw, the visionary leader of our art museums and institutions,” said Mark B. Collins, director of the MFA. “Her vision and energy, along with her playful sense of humor, made her one of the most important and influential figures in art history. She raised the bar for the art of her generation and beyond, and became an inspiration for the next.”Baker & Wilkins will present the exhibition “Erma Shaw: Life and Death,", "The next Biennial should be held in 2021, but this year’s edition, curated by Cecilia Ose, has already been postponed due to Covid-19. The 2020 edition, titled “Drum and Bass” and co-curated by Cindy Sherman and John Kelley, will now be staged by the very same organizers as the 2019 edition, titled “Soul of a Nation.”As we await the next Expo, we are reminded that the Biennial has suffered a devastating loss: its long-standing visionary executive director, Stanley Illingworth, who tragically passed away on December 22, 2019, at the age of eighty-seven. We are also reminded that the biennial was conceived and organized by a small group of visionary and committed artists, artists who were intimately connected to and inspired by their counterparts across the globe, and artists whose creative pursuits were grounded in a deep sense of spirituality and a commitment to social justice.The 2017–18 biennial was organized by members of the European Union’s Creative Europe under the banner of an initiative to make the challenges and opportunities of the creative environment more accessible to the European Union. The initiative also featured a series of public lectures and discussions, art exhibitions, and performances, and featured", "The next Biennial should take place in 2021.\n\n\nThe National Gallery of Canada has appointed Anna-Sophie Goldthwait as its next director. Goldthwait comes to the institution from the Vancouver Art Gallery (VBG) where she has served as assistant director since 2014. During her tenure, she has increased the gallery’s curatorial staff by twenty-five percent and introduced new exhibitions and residencies.During her tenure, Goldthwait helped the gallery achieve an international reputation for supporting art through programs such as the Birth of a Nation and the 2017/18 exhibition “Black and White” and helped the institution become a global leader in the field of art conservation.“A specialist in the mid-Holocene, Goldthwait is dedicated to the care and stewardship of the collections that form the foundation of the museum’s collection,” said museum director and CEO Adam Giambrone. “The fact that she has spent the last eighteen months touring across Europe, Asia, North America and South America to meet with distinguished international collectors, artists, philanthropists and artists, and has developed a new exhibition’s catalogue in collaboration with the artists that she has helped to establish gives us great confidence that she will", "The next Biennial should be held in 2021, but the organization is currently assessing the feasibility of arranging a show for the first exhibition in the center in 2021. The museum has previously had two exhibitions on the history of art since the 1970s, for which the curators were implicated in the founding of the new institution. The exhibition “Ephemeral Beauty: Modern Art from the Biennials” (2017) and “Art in the Age of Resistance” (2017) respectively.In the exhibition “Biennial Art: A History,” Lutz Bacher, Hans-Ulrich Hoenlein, and Christian Boecker were invited to present an exhibition on “Nino Locastro” (1957) in the museum on May 19 and to present an exhibition of works from the ’70s in the museum on May 22. The museum has also previously hosted “Art on the Move: Contemporary Art in the 1970s” (2017) and “Art at the Airlie: Up Close” (1999).\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Maira Shahroud as its next president. She succeeds Kate Brown, who has served as interim", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it will welcome visitors back to the institution in 2021. In a statement, the institution said: “Annie Prouvé’s work is essential for understanding the literary and visual possibilities of the twentieth century. We are extremely happy that she will be returning to the museum in 2021 as a major work of French modernism.”Added director Jean-Jacques Glimcher: “The museum’s collection is distinctively different from the contemporary world. . . . We have made every effort to include the artist in our exhibitions with the goal of understanding her work. We hope that this will continue in the future.”Since the exhibition opened in 2004, the public has contributed more than three hundred works by fifty artists. The museum also houses the works of a number of notable French international artists including Jean-Luc Godard, Alexandre Aix-Lafoe, Pierre-Auguste Renoir, and Christophe Hals, who has worked on the exhibition since 1996. The exhibition’s next iteration, “Feminine/Feminine” will open at the Venice", "The next Biennial should take place in 2020.\n\n\nThe Livestock and Poultry Association (LPA), a United Kingdom–based, art advocacy organization, has launched a new initiative called Livestock for Change. The platform will gather and share footage, photos, and text from over seventy artworks on display in the UK, Europe, and US, and will feature more than two hundred contemporary artists.The platform was inspired by the work of artist Stephanie Soifer, whose aquatic, plant-based projects draw inspiration from vernacular and indigenous art practices and incorporate items such as twigs and twigs with traditional tools and techniques. “We knew that there had to be a better way to pursue art in the digital age,” said LPA director Simon Blackburn. “So we created Livestock for Change to try and find that better way.”LIVE: The Future Is Present, the platform, which will host work by contemporary artists, is available now. Ten works by artists who have died will be presented in the coming months; the first solo exhibition of work by these artists will open in London in December 2020. The first works created using Livestock for Change will be presented in the future three years from now.", "The next Biennial should be staged the same weekend as the Paris Convention, sometime in early May. The Biennial will focus on a virtual reality art-world and will be based in the virtual-reality museum Art Paris, which opened this month. The exhibition will include works from the upcoming exhibition “Themes Unfolded,” which will be staged in late June. “Virtual Worlds: An Exhibition of Contemporary Art” is the theme of the third Biennial, which will open in late September. As part of the Paris Games, the exhibition will be the first to recognize the work of the artist-activists David Cage and Yalea Mabas. “It is an invitation to explore the centrality of art in an age of immediacy and virtual realities,” said Mondadori. \n\n\nThe National Portrait Gallery in London is planning to open a new location on the National Sculpture Park in Lincolnshire, England, next month. The museum will be made possible with the $8 million redesign and expansion of the current exhibition space, which is currently home to the works of contemporary artists such as David Tenenbaum and Nari Ward. The institution will also include", "The next Biennial should be held in October 2021. The first exhibition will focus on “natural history.” The next show will focus on the search for meaning within the world.“The future of art is not so much to be found in the laboratory as in the social arena,” said Maas. “A new kind of vision is required. We must be more aware of the creative and intellectual potential of our planet, the infinite possibilities it holds, and the artists who have made it possible. The world is not ready for this new kind of vision.”   The biennial will also be inaugurated with an exhibition of work by twenty-six artists, which will be curated by Jürgen Todenhoff, Ph.D., and Patrick Edmonds, M.S., in the form of a narrative, titled “Feminine Visions,” which will explore themes of gender and gender roles in relation to the body, the environment, and the universe. \n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Tamara B. Nagan as its next director and CEO. She will be responsible for continuing the work of its board chair and managing director, Joseph", "The next Biennial should be hosted at the Tangeberg Museum in the city of Riga from April 6 to April 8. The exhibition will open with an immersive installation by the artist Hjalti Magnotta. The twenty-third edition of the conference will take place at the Tangeberg Museum in the city of Riga from April 10 to April 12. In addition, the twenty-fifth biennial will be held at the Scandinavium in Helsinki from April 14 to April 17. The twenty-sixth edition of the conference will be held in the city of Parma from April 16 to April 19. For the exhibition “Theoretical Education and the Materiality of Art” at the Museum of Modern Art in New York, artist Marc-Olivier C. Van Tilsem, who is known for his abstract installations, will present a solo exhibition dedicated to the work of Alexander Calder, which will be on view until April 8. The show will also feature the work of artists such as Pierre-Auguste Renoir, Edvard Munch, and Frank Stella.\n\n\nThe Metropolitan Museum of Art in New York is proposing to demolish one of its more than fifty-year-old buildings in an attempt to", "The next Biennial should take place at the institution in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of eleven works from the artist-in-residence program of the Barbara and Minnie MacArts Foundation. Included in the gift are works by Tanya Bonakdar, Aimee Bruguera, Claudia Castelli, Carlo Ciretti, and Cheryl Figueroa.In addition to the works, which were donated by the artist-in-residence program, the museum also received a sculpture by the late sculptor-activist George Lucas, as well as a painting by artist and philanthropist Frank Gehry.The gift of art from the Barbara and Minnie MacArts Foundation, which was established in 1989 as a means of supporting artists who were working in the Los Angeles area, marks the third gift in the six-year-old program. The foundation’s gift of works from the artist-in-residence program, called the Artist-in-Residence Project, is a collaborative initiative between the MacArts Foundation and the Alameda County Museum of Art. Previous gifts include a work by the late sculptor", "The next Biennial should take place in 2021 and will be hosted by the Museum of the City of New York. The exhibition will be devoted to the history of the South Bronx, and will include works from the collection that had not previously been displayed at the Museum.The 2020 theme, Eyes on a Wind, is a nod to the work of Israeli avant-garde painter Ariel Avishai in collaboration with French master Jean-Michel Basquiat in an attempt to reflect on a theme of the city. The work will be created by artist Sacha Pindell, who will be commissioned to create a new Anish Kapoor’s The Eyes of a Wind.\n\n\nThe exhibition, titled Art & Control, is the first of two planned for the United States. The show will showcase artworks by twenty-four artists and will run from November 9 to December 2, 2020. The two-year program will include a residency at a US institution in 2020, the program will also feature an installation of work by Jonathan Bedford, a curator of European and African art, and will feature a selection of biennial submissions in 2021.“The United States is at a pivotal moment for the history of art,”", "The next Biennial should be held in the autumn of 2022. “The next date to take an active role in shaping the future of the museum is the autumn of 2020,” Pascual-Tuttle told WIRED. “That is what the future is going to look like. That is what the next year will be about.” According to the New York Times, the museum has been working on a new set of guidelines for the 2019-2020 season, which will soon be released. The changes will likely address issues raised by the coronavirus, including how long visitors should stay in the galleries and how the museum should prepare for a possible repeat of Covid-19.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has launched a new initiative that will allow women artists to showcase their work at a discounted rate. The program, called the Met Up, will allow women artists to have their works displayed at a reduced rate as part of a new $30 million capital campaign. The initiative will also provide financial support for artists who are facing financial hardships and will launch a two-year platform that will showcase work by women artists.“This is an opportunity to show a great work by an extraordinary", "The next Biennial should be in 2022. In a letter to LASALLE, the school said: “In the near future, the school will continue to present a high-quality contemporary art program in the city, but will implement new educational initiatives and deepen its partnerships with urban local communities. The art of the future will be live, curated by local communities.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has signed a long-term lease agreement with an Israeli collector, Dov Zigman, to stage exhibitions based on his extensive private collection, which includes works by artists such as Charlotte Brontë, Josette Alberts, and the recently deceased Israeli soldier Elia Kazan, among others. The ten-month initiative, “On the Wall” will combine a number of works by Zigman, who passed away in March 2019, including two recently completed installations, “The Body and the Tower” (2019) and “Monuments From Home” (2019), which embody the curatorial approaches of his son, Shai Zigman. During his lifetime, the family amassed more than 2,500 works, which span a variety of cinematic and media genres. Together they often", "The next Biennial should take place in the summer of 2021.” “We are grateful to the City of Los Angeles, the Metropolitan Museum of Art, the Museum of Contemporary Art Los Angeles, and the staff of both museums, who have worked tirelessly to produce a truly remarkable exhibition,” said Jeffrey Rosenblum, the president of the Los Angeles County Museum of Art. “However, the next edition of the Biennial will be a challenging and challenging show. In order to give our audience a new experience for this exhibition, we will create new and expanded programs. The next exhibition will present our artists’ work in a new way.”The 2019 edition, “Arts of Death,” featured the work of artists such as Alexander Calder, David H. Bell, and Wangechi Mutu. The show, which was inspired by the work of Henri Cartier-Bresson and Mark Rothko, premiered at the Venice Biennale in 2012 and has since gone on to be selected for the 2020 edition.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of eighty-four works by twenty-nine artists from the Solomon R. Guggenheim Museum", "The next Biennial should be held in 2020.  The festival will be held at the Los Angeles County Museum of Art (LACMA), a newly renovated fifty-eight-acre former steel mill and arts complex. The venue will be connected by a new superhighway that will carry twenty-two thousand visitors to the museum each day.The 2020 event will bring together a group of artists and activists from twenty-six countries and forty-eight cities in twenty-two countries. The artists chosen for the exhibition were drawn from underrepresented corners of the globe. The selection committee made the announcement this afternoon, and the artists chosen to participate have yet to be revealed. To receive your biennial entry click here. To view the 2018 and 2019 artists, click here.\n\n\nThe Scottish National Gallery (SNJ) has appointed Kate Mather-McArthur as its new director. Mather-McArthur comes to the institution from Glasgow, where she has served as director of exhibitions and collections since 2015. Under her leadership, the gallery has experienced a period of significant growth and has recently celebrated its fiftieth anniversary.“Kate’s leadership, enthusiasm for the work and commitment to the role of the gallery as a museum make her the", "The next Biennial should take place in 2020. ​\n\nThurs. Sunday, January 9, 2020, 10 AM–3 PM. Thurs. Thursday. January 15, 2020, 7 PM–10 PM.  The Architecture of Life, 2019. Saturday, January 14, 2020, 11 AM–9 PM. All sizes are welcome. The Museum of Contemporary Art, Los Angeles: May 23, 2019–April 19, 2020.  Agnès Sargent: April 20, 2020. Los Angeles County Museum of Art: May 3, 2019–April 7, 2020. Los Angeles County Museum of Art: April 6, 2019–April 11, 2020. Los Angeles County Museum of Art: March 12, 2019–March 12, 2020. Los Angeles County Museum of Art: March 13, 2019–March 15, 2020. Los Angeles County Museum of Art: March 12, 2019–March 13, 2020. Los Angeles County Museum of Art: March 12, 2019–March 13, 2020. Los Angeles County Museum of Art, California: April 7, 2019–April 9, 2020. Los Angeles County Museum", "The next Biennial should be organized in 2022.” \n\n\nEnvironmental supporters of the upcoming revival of the Tate have announced their intention to boycott the British Museum, the Royal Shakespeare Company, and the Royal Shakespeare Festival in an attempt to pressure organizers to appease supporters of the political and business class. “We are publishing today a letter from around one hundred prominent creatives and young curators who are urging the Tate and the Royal Shakespeare Company to reconsider canceling their 2019 events, and to commit to making the forthcoming edition of Tate Biennial a success,” the letter reads.As Tate director Maria Balshaw and CEO Hamish Anderson prepare to present the biennial at the end of March, activists have been campaigning to hold the institutions accountable for their financial support of the London School of Economics (LSE) and the Royal Shakespeare Company (RSC). The organizations have refused to budge on their end of the bargain, and in a move that has left critics questioning whether the artists’ demand for additional funding is realistic.In March, the government announced a £10 million fund for cultural institutions to avoid a loss of income as a result of anti-terrorism legislation passed by Parliament last month. As part of the funding package, the institutions were", "The next Biennial should focus on the series of events that took place between 1947 and 1949 in the city, which is often referred to as the birthplace of Giacomo Becchetti and the birthplace of Andrea Cassino, who was a leading Italian architect of the postwar years.The inaugural event, entitled “Into the Unknown,” will be held on September 19 and will be hosted by Silvestro Marzio, a contemporary art museum in Rome. Its second edition, titled “Prestel Intime,” will be held at the Museo del Piemonte in Rome on October 10 and will be inaugurated by a ceremony at the Basilica of Santa Maria del Mallorca on October 11. The third edition of the series, titled “Prestel In Praesidium,” will be held at the Marfa Art Museum in Texas on October 11-13 and will be hosted by Iris Báez, the director of the Museum of Contemporary Art, Los Angeles.The biennial’s inaugural edition, “Prestel In Praesidium” (Paris), which opened on January 10, 1948, was largely inspired by the French artist Pierre-Auguste Renoir’s experimental", "The next Biennial should take place in 2021, the two parties said. The invitation to the biennial came a day before the Venice Architecture Biennale, which opened on May 31 and runs through June 13. The visitors will be invited to participate in a series of interviews, lectures, and workshops, and will have the opportunity to visit the newly restored Villa di Rivoli in Venice and the lecture complex at the Institute of Contemporary Art in Vienna.  The exhibition will feature the work of forty artists, including Levi and Henri Rousseau; the works of Helene Ihle, Sveinje Tiit, and Ulla and Natalia; and works by the Menno Bocci, Paul Gauguin, and Pierre-Auguste Renoir. The 2016 edition of the exhibition drew 2.9 million visitors and featured works by seventy-nine artists. \n\n\nThe National Gallery of Canada announced today that Anna Merritt-Daly has been appointed as its next deputy director. In her new role, which is funded by the National Arts Council, the MPC will work with the National Gallery to further develop the National Gallery’s collection of contemporary art and the National Gallery’s relationship with visitors. ", "The next Biennial should be held in the summer of 2021. The appointment of a curatorial role in the exhibition was made by curator and director, Hoor Al Qasimi, following a request from the board of trustees for a more contemporary design exhibition. Al Qasimi has previously held the position of director of the Wollongong Museum of Art in Australia and curator at large for modern and contemporary art at the Sydney Opera House. He then returned to the United Arab Emirates to lead the Dubai Design Week. The development of the Dubai Design Week program was announced by the UAE in 2017 as a way of increasing the number of international artists represented in the UAE. Previous years showcased a mix of local and international artists, including the Hong Kong-born artist Tenzin Ho; the French architect and curators Bernard Adlee and Bernard Heim; the Korean artist and curators Kim Seo-kyung and Kim Seo-kyung, respectively; and the Japanese artist, actress, and author Masahiko Hasegawa.\n\n\nThe Shenzhen Biennale, which was supposed to run from June 7 to June 9 in 2020, was canceled last month after a fire broke out at the exhibition venue in Shenzhen\u0097a", "The next Biennial should take place in 2020. \n\n\nThe Museum of Modern Art (MoMA) in New York has launched a new initiative to support local artists by commissioning work by artists whose practices and practices only recently received national attention. Participants in the Program for Artists, which was established in 2017 by artists and scholars, include Tanya Bonakdar, Carol Davis, David Haemisch, Hadley Wickham, and Jean-Luc Ponty.The initiative, called the Artists Pledge, will provide artists with $5,000 grants each year to assist them in developing their work in a public museum. The program will also host biennials, which will be curated by curators, and will ultimately culminate in the installation of a work by the artists themselves. The biennials will be chosen by the program’s board of advisors and will be curated by John Broadbent and Aaron Iwanowicz. The first biennial, “HELP/GIVE/REPRESENT,” will open in January 2020 and will be curated by Susanne Vielmetter. The second biennial, “JESSICA GOURDES,” will launch in July 2020 and will be curated by Jacqueline Laland", "The next Biennial should be held in 2022. “I am very much looking forward to working with the teams and artists of the past years, and to the future,” Shicham said. He added that he hopes the project “will become a template for how an international exhibition should be designed and organized.”In an interview published in the May 30 issue of the New York Times, Arabella Galloway, the director of the Negev Art Foundation, said: “It’s time to consider how a Biennial could become a platform for a more just, equitable, inclusive, and interconnected world.”\n\n\nThe husband and wife team behind the controversial Ginza art district in Tokyo are suing the central government of Japan to prevent them from demolishing an abandoned steel factory that was slated to be demolished in the city in 2021, reports the Art Newspaper. The couple is attempting to block plans by the Japan government to demolish the factory, which was built in 2011 and completed in 2013, by claiming that the building of the factory and the adjacent Japanese Culture and Arts Museum was in breach of a historic environmental protection law.The lawsuit, filed in Tokyo District Court on March 24, claims that the building of the facility", "The next Biennial should take place in the city in 2019. The LACMA biennial will present the work of the artist’s daughter, Maya Biennial, in 2020.\n\n\nGina Beavers, a British artist, has won the 2020 Turner Prize for her work The Dark Hour, which examines the impact of an industrial accident on the early stages of life. It was selected from a shortlist comprised mainly of artists nominated by British Prime Minister Boris Johnson and takes place in a dystopian future where the UK and the US are at war.The award jury, made up of Mandy Laing, director of Tate Britain; Rineke Dijkstra, director of Tate Research Center and Institute of Contemporary Arts, London; and British director-general, Hamish Anderson, praised Beavers for her masterclass presentation at the Tate in London on September 5 and her exhibition at Tate Modern the next day. Beavers, whose series of paintings and sculptures often transfigure the experience of visual arts, will be presented with the prize at a ceremony at Tate Britain on November 22.“The Dark Hour’s portrait of a nervous child, appearing in a world that seems at times unreal and vibrant, is a brilliant and moving illustration of the way", "The next Biennial should take place at the Pérez Art Museum in Madrid next year, Artforum reports, but the institution is not sure whether it will be able to stage the exhibition given the ongoing closure of the museum and the city of Madrid.The Pérez Art Museum has said that it will be able to reopen once the reopening of the museum and the city of Madrid is secured. Sources at the institution told Artforum that the Pérez Art Museum will make its quarterly exhibition schedule more flexible, and that it is hopeful that it will re-open by the end of the year. The exhibition will also offer users more time to plan their visits, and will include more immersive works, which will be curated by Spanish artists Juana Barran, María Berrada, and José Luis Campos.The Pérez Art Museum is not alone in its predicament. In March 2018, the Madrid museum of culture announced that it would be closed for two months to complete a multimillion-dollar renovation project, but it reopened a month later. According to the Art Newspaper, the renovation was completed in less than six months and involved the dismantling of the institution’s building and demolition of a number of structures in the P", "The next Biennial should be held in the spring of 2020. \n\n\nThe New York–based nonprofit Artnews has learned that the ninth edition of Art Basel Hong Kong will be held this March. Titled “Art the City,” the event—which was originally scheduled for March 29–March 31—was rescheduled for March 28–March 31 and will now take place March 29–March 31. The news follows a report published in Artforum on March 25 that claimed that the news of the reopening of the fair would be positive for art buyers and the exhibitors of the event.“We are very excited that the new dates will help expand the exhibition program and showcase the best of contemporary art,” said Art Basel Hong Kong’s director Hsu Kiehl. “This year’s Art Basel Hong Kong will return to Hong Kong, where it has been since 2009, and will showcase the most contemporary art in the world, with a new format that reflects the values and aspirations of Hong Kong. We look forward to showcasing the latest work from emerging and established artists from Southeast Asia and the Middle East and Africa.”The sixteenth edition of Art Basel Hong Kong will open in", "The next Biennial should be held in the autumn of 2021. The first Biennial was held in the French city of Toulouse in 1925. \n\n\nThe Metropolitan Museum of Art (MoMA) has appointed Joan E. Binn and Marilu Fofana as associate curators of its next edition, “Toledāt,” which will open at MoMA on September 9, 2020. After they begin their roles on August 29, 2019, the museum will close down indefinitely.“We are thrilled to welcome Joan and Marilu to the Met,” said Marc Glimcher, director of the Louvre and the Met. “The couple’s expertise and passion for the arts and their respective regions of the world provide a strong foundation for our work. We are confident that their curating and presentation of the biennial will bring audiences an exciting new experience.”The biennial, titled “Toledāt,” takes place in the frozen northern reaches of the Siberian tundra, which is home to the Indus River and the largest freshwater body in the world. Its themes of inextricable local histories and histories of peoples from the Northern Hemisphere and from", "The next Biennial should kick off in January 2020. The event will feature works that reflect both the rich history of the exhibition and the coming together of artists and audiences. Commenting on the theme, Shih Lee, director of the museum, said: “The roles played by women and men and women and men are interwoven throughout the exhibition. We are touched by and inspired by their stories. We are inspired by their presence. We are inspired by their presence in our gallery. We are inspired by their vision. We are inspired by their stories. We are inspired by their stories being told for us. We are inspired by their stories being told for anyone.”\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Marina Acosta as its next chief executive. In her new role, Acosta will take up the post in January 2021. She comes to the ICA from the Arts Council, where she has been the director of development since 2019. She succeeds Kurt Georgi, who announced his retirement in March.“The ICA is delighted to welcome Marina into the ICA family,” said ICA director Maria Balshaw. “We are grateful for his many years of work to the ICA and", "The next Biennial should focus on the cultural and social linkages of the contemporary society. It should also consider the development of an ’international language of motion.”The inaugural event, “Fast Forward: Art and Culture in the Twentieth Century” (2019), was held in Helsinki, Finland, and was curated by Ulla and Juha Suomenko and Roberto Ruiz. The show, which featured new works by artists such as William Shakespeare, Andre Gide, and Aline Brodsky, was organized after the artist collective FLAGN, now known as Flakthes-mällets, decided to close their Helsinki studio in 2011 and return the artworks to their hometown. Although FLAGN returned the works to the artist, the institution failed to receive payment from the artists, who were seeking the return of the works for their own legitimate cultural use. In late 2014, FLAGN filed a lawsuit in Finnish District Court, which ordered FLAGN to pay the artists $58,000 in damages.\n\n\nOn Thursday, the Supreme Court of the United States upheld a lower court’s ruling that declared a $3.5 million forfeiture fund unconstitutional. The case stems from the 2011 seizure of Pablo", "The next Biennial should be held in 2020.This year’s event, titled “Art in Time,” will feature work by forty-three artists whose work has been collected by the National Gallery of Art. The exhibition will also feature works from the National Museum of Fine Arts, Washington, DC, and the Museum of Fine Arts, Boston.The Biennial 2012—celebrating forty-six years of the National Gallery of Art—will return to the Smithsonian American Art Museum (NAAM) in March 2019. The show will also mark the museum’s first visit to a new Danish pavilion as part of the KMF Copenhagen pavilion, which opened on March 10, 2019. The Danish pavilion will feature work by forty-seven artists in addition to the work of thirty-nine other artists and collectives. The show will run for ten weeks, from March 26 to March 30, 2020. The Danish pavilion will be inaugurated by a solo exhibition of work by artist Marti Baby, entitled “L'Elegant 9/11” at the Danish National Museum in Copenhagen in March 2019.\n\n\nThe Museum of Modern Art (MoMA) in New York is partnering with the nonprofit National Endowment for", "The next Biennial should be held in 2020, with the date to be determined by the Board of Trustees. The new program will consist of an exhibition of paintings by three artists from the gallery in the beginning of the exhibition, with various works by artists from the following years: MICHAEL STEVENS, HENRY WILSON and CHRISTOPHER STEVENS, CHICÊNS, HIRO, VALERIE, and CHRISTOPHER STEVENS. The exhibition will be organized as follows:    Year 1 (2019): MICHAEL STEVENS, CHRISTOPHER STEVENS, HIRO, AND CHRISTOPHER STEVENS Year 2 (2019): MICHAEL STEVENS, CHRISTOPHER STEVENS, HIRO, AND HENRY WILSON\n\nThe Ateneo Art Museum in Tokyo has accepted a proposal to create a new exhibition dedicated to the Japanese pop culture and fashion. The institution will partner with Justin Hurwitz, founder of the New York–based nonprofit the New Museum, to launch the show, “Arts of Life. Fashion and Culture: Fashion & War,” at the Aten", "The next Biennial should be held in 2021. The 2019 edition, which addressed the legacy of the Fifth International, and the most recent Biennial, “60s Art,” will be held in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Mark B. Cohen, associate curator of modern and contemporary art, as its next art curator. Cohen joins the institution from the Metropolitan Museum of Art, where he currently serves as assistant director of curatorial affairs. He succeeds David Niven, who retired earlier this year after twelve years at the helm of MoMA. Cohen comes to the museum from the Northwestern University Art Museum, where he has served as associate curator of twentieth-century art since 2015. Previously, he worked at the Los Angeles County Museum of Art (LACMA), where he helped organize “Anna Atkins” (2017), “Ursula and Wolfgang” (2016), and “The Passenger,” which was staged at the Museum of Modern Art in New York, and at the Museum of Modern Art, Los Angeles, where he directed the exhibition “Ursula and Wolfgang.”Cohen’s new role is contingent upon the outcome of negotiations with museums", "The next Biennial should be held in 2020.  The next year will be the 200th anniversary of the birth of linguist and mathematician Eduard von Neurath. The next year will be the 100th anniversary of the death of the Duke of Wellington, and the next year will be the seventh anniversary of the birth of astronomer and explorer Karl Friedrich Gauss. The next year will be the hundredth anniversary of the birth of Jesus Christ and will mark the occasion with an exhibition of the artist’s works on canvas and canvas only. The next year will be the fifteenth anniversary of the birth of Hermann Gauss and will mark the occasion with a programme of lectures, workshops, concerts, and performances in which the artist explores the relation of art and spirituality. The next year will be the twenty-sixth anniversary of the birth of Moholy-Nagy, a Russian Jewish composer, painter, and theorist. The next year will be the twenty-third anniversary of the birth of Leonardo da Vinci and will mark the occasion with an exhibition of his art in association with Leonardo DiCaprio. The next year will be the twenty-sixth anniversary of", "The next Biennial should be in December 2020; the first one was originally scheduled for March 2021.The 2018 edition, titled Toccarra: A Biennial of the World, was canceled because of Covid-19. The 2019 edition, titled Avant-Garde Works and their Environment, was also canceled. The biennial, which was being organized by the Italian city of Palazzo Grassi, was rescheduled for December 2021.  The organizers are planning to add a new section to the show titled “Beyond Politics and the Arts:” and “Theology and Politics” in order to create an additional twenty-four hours of programming. The organization is also planning to stage a new exhibition of work by political artist and theorist Jannis Kounellis, titled “Where Nature and Man Live Together” at the Galerie Georges Pompidou. The event will take place in early December.\n\n\nThe City of New York has awarded US$1.3 million to various artists and arts organizations in support of the ongoing cultural and economic recovery following the devastating fires that devastated New York City’s Central Park last summer. The funds will go to communities", "The next Biennial should be announced soon. \n [Update: March 5, 2 PM] The 2019 installment of the Museum Biennial, titled The Amazing World of Man, will be held in September. \n\n\n\n\n\n\nThe New Orleans Museum of Art (NO LA) has appointed Michael Hauptman as its next executive director and director of exhibitions. Hauptman comes to the institution from the Metropolitan Museum of Art, where he serves as deputy director and chief curator of contemporary art. He succeeds Sean Pertwee, who helmed the institution since 2013, and will assume his responsibilities in September.“After a distinguished career in the arts, Michael brings a wealth of experience and knowledge to the board of directors and the leadership of the museum, which is why we are so excited that he has selected us as his next partner,” said Sean Murray, chair of the board. “Over the last twelve years, he has led NO LA through a transformation that transformed our programming, expanded our collection, and added new exhibitions. He is a rising star in his field and we look forward to working with him.”Hauptman is the fourth person to lead NOLA since the institution’s move", "The next Biennial should take place in the city in 2021. The next edition, which will be held in the city from November 6 to November 8, 2019, will be made up of six exhibitions. The show will be curated by Norberto Iannone, the artistic director of Museo de Arte Contemporáneo, and will be staged in association with the city of São Paulo and will be led by the artist Nuno de Matos. The exhibition will also feature the first solo exhibitions of the artist’s work in Brazil and the United States. The biennial’s inaugural exhibition, “Ricardo de Freitas: Partito Accioni” (2016), was a collaboration between the artist and writer, and was organized by the Museum.\n\n\nThe Wang Kunsthalle in Shanghai, which closed to the public last week after months of scheduled programming, is now back on schedule with new exhibitions taking place in the city in 2020. The reopening of the sprawling complex, which comprises nineteen galleries and three public museums, marks a big turnaround for the Wang, which was first established at a cost of $120 million in 1956, as well as the city of Shanghai. The project has been", "The next Biennial should be held in 2021.\n\n\nThe National Geographic Society’s plans to move to the National Museum of American Art (NMMA) in Washington, DC, have been put on hold after an outraged group of American art dealers issued a statement in protest of the move.In their letter, which was signed by more than 250 dealers, collectors, and museum professionals, the signees claimed the move would violate the National Museum’s connection with the country’s founding father, John Adams; lead to the loss of millions of works; and set a dangerous precedent for future cultural collaborations.“The National Museum is the nation’s cultural and historic repository of American art and its collection is treasured by a vast and diverse community of collectors and art experts, including the art historians, the curators, the art historians, and the art historians’ own students,” reads the letter, which was authored by an alliance of dealers led by Michael von Essen and Piers Barnes, and was circulated by the American Art Museum Association (AAMD) and the Association of Visual Arts Museum Directors (AVAM), both of which were signed by more than 1,500 art experts and museum professionals.The letter points to a", "The next Biennial should be held in Mexico City in 2023, and the date of the show will be reconsidered in 2021.  The biennial will be organized in collaboration with the contemporary artist and curator Matías Soltero, who is also a founding member of the fresco-making collective Cinéma. The exhibition will highlight the works of thirty-six artists and will showcase at least twenty-nine works by women artists, many of whom are based in the United States. “The theme of the upcoming exhibition is ‘the human being as both a creative and a relational platform,” said Soltero. “The art of work is history, and the history of work is life, and we want to explore the gravest forms of life and the most intimate histories of work.”A selection of the works by the artists will be presented at the exhibition in the autumn of 2022.\n\n\nThe Metropolitan Museum of Art in New York has appointed Tanya Bonakdar as its next chief curator. Known for her internationally acclaimed exhibition “Hearts and Minds,” which features the work of fifty artists, including Leonardo da Vinci, Thomas Edison, and Andy Warhol", "The next Biennial should aim to present an overview of the history of art and design in the Philippines, as well as a selection of works by Philippine-born artists. The exhibition, entitled “Presentations” and curated by art historian and curator Hugo Barilla, will be on view March 19–March 21. The exhibition will also include a documentary film project highlighting the artist performances of all-time greats and will include the work of eighteen Filipino artists, including Gisela, Felicity Alighieri, Oscar Nogueira, Laura de Barros, and Finca.\n\n\nThe Italian artist Salvatore Maranzano, whose nearly fifty-five-minute sculpture “Ordo Nel Lido” (Order Here It Lids) depicts three nude women in flight, has been awarded a Tony Award for Architecture. The ceremony, which took place in New York this week, included a presentation of the award, which honors Italian artist Mila Nuzzo for the work, which is part of a series titled “My Body, My Rules,” which explores whether the body is a reflection of the body politic.Born in Turin in 1954, Maranzano is known for his use of avant-", "The next Biennial should take place in 2020. The first Biennial in Athens was held in 2004, and the last was held in 2018. The exhibition’s theme for the 2020 edition was “Allegories: The Dilemmas of History” and its opening was marked by an installation of works by the Tunisian artist Hamad Youssef. The event concluded with a presentation of work by the artist and philosopher Anwar El-Amin.\n\n\nJapan is demanding that the United States pay more than $1 billion to settle outstanding lawsuits over the wartime construction of a nuclear plant in the country’s south, reports the Art Newspaper, but the United States is refusing to settle. In a letter dated March 28, the Japanese government wrote to the president of the United States of America, Donald Trump, requesting that the damages suffered by the American people be addressed.On March 27, in response to the government’s request, the Department of Justice (DoJ) submitted a statement to the NHK television station in Tokyo, which said that it “does not believe Japan deserves such a large sum of money.” Although Trump has previously expressed his willingness to pay more than $4 billion for the plant", "The next Biennial should be held in the spring of 2021, with an exhibition of new drawings and paintings in the fall of 2021. The second, which was scheduled for next spring, has been moved to 2020 and will open in 2022.The Biennial will be the first of many, a new initiative that will focus on issues of sustainability and the environment that will be introduced by the institution. The project will be organized in the following ways:The first exhibition will draw from the institution’s existing collection, the collection of David Adjay, and introduce new works by artists such as Maureen Boylan, Mark di Suvero, and Peter Konrath, and featuring work by groups that include the Royal Academy of Fine Artists (RAFA), the Institute of Contemporary Art, London, the Royal Institute of British Architects (RIBA), the National Art Gallery of the National Museum of Wales, and the Southbank Center. The exhibition will also include a public tour of the museum.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is planning to reduce the size of its exhibition space by 20 percent by 2021. The reduction in exhibition capacity—which will be made with a $550 million budget cut—is part of a", "The next Biennial should be held in 2020. In the meantime, the museum has launched a new online exhibition, Art in the Age of Trump, which will be open to the public from November 21 to November 23.The exhibition will highlight individual works authored by thirty-three contemporary artists who have contributed to the exhibition, which has been organized since the year 2000. The selections include Niccolo Milanese, Masaccio, John Minch, Yoshitomo Nara, Igor McKim, Nina Roach, Josée B. Starr, Joel Spols, Herman Webster, and Howard Winant.\n\n\nAs New York City heads into Phase 4 on Monday when it expects to fully reopen its remaining subway stations, Governor Andrew Cuomo announced that the state will divert $1.2 billion from its general fund to cover the financial fallout from the Covid-19 pandemic. Cuomo also pledged to take $550 million from state reserves and invest it into the city’s workforce. The announcement comes on the heels of a $500 million boost to the city’s capital budget already approved by the legislature last week. Nearly $250 million from Cuomo�", "The next Biennial should be staged in St. Petersburg in February 2021, the Financial Times reports. The exhibition will be hosted by the same organizers as the previous event, which was organized by the same company that organized the 2017 edition of the Venice Biennale.Among the works to be featured in the new exhibition are a performance by the Norwegian artist Olafur Eliasson on a large scale; a new selection of works by Kiki Smith; a re-creation of the installation of a woman in a farmhouse with live plants; and a series of paintings by the Egyptian artist Naguib Mahfouz.The first piece to move to the new exhibition venue was Lyle Swenson’s “The Deeper I Kiss the Sun,” a feature-length, three-hour performance that premiered at the 18th Venice Biennale in 2015. Swenson, who was nominated for an Olivier Award the same year for his work Flower Shop (2014), was selected for the prize's second category, “Performance of the Year.”Swenson is currently a founding member of the New York troupe the Ezra Pound Trio, which has performed at the Venice Biennale every year since 2010. His work, which", "The next Biennial should be organised in the spring of 2020. Having completed its research, Mr. Yoon and Mr. Kwon are currently developing a new program that will be inaugurated by the end of the year. The biennial will focus on the concept of the pilgrimage, and will feature a range of artists and thinkers from twenty-six countries.The fifty-eight-year-old will be the first artist to return to Korea since Ms. Kang. He was invited to return by Ms. Kang, who passed away in April 2019. He will be the first artist to perform in the country since Ms. Kang in 1966.\n\n\nUniversal Studios Japan announced today that it will operate a new three-month exhibition space in the United States in 2021. The new show, part of the company’s ongoing reopening campaign, will be called “Mana Contemporary.” The theme of the exhibition will be “An Open Image.” The format will be a combination of live performance, public programming, and curatorial projects, and will aim to create an “open, dynamic environment for the artists who have made the most important contributions to our culture,” according to a statement.The new space will be located", "The next Biennial should be held in the United Kingdom in 2021.\n\n\nThe Elizabeth Art Gallery in London has appointed Kate Macgregor as its new executive director. Macgregor comes to the institution from the Partnership for Art, which she joined in April 2018. At the time of her appointment, she was leading the group of institutions, which includes the National Galleries of Scotland, the National Portrait Gallery, the Leicester Art Gallery, the National Portrait Gallery, and the Tate, in the United Kingdom.“We are incredibly grateful to Kate for her leadership and service to Elizabeth over the years,” said Elizabeth. “Her understanding of art, her enthusiasm for the collaborative and the open approach to exhibition design, and her commitment to inclusive and transformational cultural exchange and collaboration are central to Elizabeth and we are incredibly confident that she will continue to drive the Art of the Elizabeth through the 2020s.”Macgregor succeeds Simon Ward, who has served as interim director of the Elizabeth since March 2019 and will assume her responsibilities in October. Ward has been an associate director at the gallery since March 2019.Commenting on her new role, Macgregor said: “I’ve been involved in art and design for more than thirty", "The next Biennial should take place in the Fall of 2021 and will showcase the work of twenty-five international artists who have been selected by an international jury that will convene in San Francisco at the end of March. The biennial is part of the 30’s plan to expand its visual arts programming through programming partnerships with the Los Angeles County Museum of Art, the Los Angeles County Museum of Art, and the San Diego Museum of Art. The selection committee comprised artists Sydni Schwartz, Jerome Billen, and Lamont Barry; artists Tim Bernburg, Jane Pan, and Rinu Ise; and Zhenya Makhnov, director of the Experimental Art Museum St. Petersburg in Russia.In the review of the forty-three proposals that were submitted, Bernburg said that the art featured “isolate, destabilize, and oppose the cultural and physical structure of the city of New York.” He added: “The museum will be a space for reflection, contemplation, and gathering, a space for recalling the past, a space for releasing the energy of the earth and a space for prayer.”The Biennials will begin with the exhibition of the artist’s work set to open at the museum next", "The next Biennial should be held in 2021. The decision to hold the event in 2021 coincided with the inauguration of the two-year, $30 million biennial “MIDNIGHT” (2019–2020). The fifty-fifth and fifty-sixth biennials will be held concurrently.\n\n\nThe Monell Chemical Senses Center in Philadelphia has received a gift of four hundred paintings by artist Raynal Ismail, which were donated by the Sargent’s son, Abdulrahman, in 2016. The four hundred works were acquired by the Sargent through his longtime friend and dealer, Arturo Cano, who passed away from a rare and aggressive form of cancer called leukemias.The gift includes works by artists who have been identified as belonging to Sargent’s network, including Charles Mathews, Victor Burgos, and Sean Williams, who will be presented at a biennial exhibition organized by the center in 2021.“The gift of these works is an enormous honor for our organization,” said Sargent. “The three hundred paintings are a great help in the promotion of the continuing work of the Monell artists, particularly as they continue to confront the vex", "The next Biennial should host a lecture by an independent curator on the history of art, a museum or a work that is on display at the exhibition should present an adaptation of the exhibition, a media performance, a photography exhibition, a documentary, a television programme, or a performance.A public vote in support of the proposal was held on October 27, with ninety percent of the nineteen participating artists voting in favor. The boycott was organized by the Independent Council of the Museum of Fine Arts in Prague and was led by the Polish curator Joanna Wolejawowska, who completed her PhD in the history of art at the University of Warsaw. The group behind the boycott is calling for an end to the exhibition until the measures the government is advocating are addressed.According to the New York Times, the Change.org petition, which received more than 1,500 signatures within days of it being posted, demands that the Thirty-Second Biennial of the Contemporary Art be canceled until the new anti-terror laws are implemented, and that the pavilion be relocated to a museum that houses more art. The petition also asserts that the removal of Halle Maria SchConzelmann, who was sentenced to four and a half years in prison for her roles in the plot to", "The next Biennial should be held in the spring of 2021. ArtBoston and ArtReform are currently negotiating a new contract for the 2020 event.“We have been working with the organizers of the annual Biennial for the past four years, and have been supportive of their efforts to make Boston’s art scene vibrant and accessible to the majority of Boston’s artists,” said Brian Fitzpatrick, director of ArtBoston. “I’m hopeful that the process of creating a new chapter at ArtBoston can move us past this difficult moment.”\n\n\nThe London-based artist Oonan Ota, whose pioneering installation pieces—including Kunsthal Akerne Kunst (1895–1965), in central London; Nosferatu (1967–1970), in north London; and The Body (1970–1979), a multi-coloured, floating sculpture made from concrete—exceed in their enduring power to unsettle and enliven, has died at the age of eighty-nine.Born in New York City in 1941, Ota moved to London in the late ’60s to pursue a career as an artist. His earliest works, made in", "The next Biennial should focus on issues of health and well-being, social justice, and environmental justice, and should consider how art is used to address and transcend historical, geographical, and conceptual boundaries. Ideally, the event will embrace the cultural traditions of South Asia and the Caribbean, the Americas, and other continents.”\n\n\nThe Institute of Contemporary Art (ICA) in Rome is planning to move two hundred works by twenty-five artists from its permanent collection to the museum, where they will be included in a major exhibition of work by the artists scheduled to open in the city next month. The exhibition, “Art in Italy,” will take place at the Museo d’Arte Contemporáneo in Rome and will be led by Judith Carta, the director of the Museo d’Arte Moderna, and Prada artist Stefano Cattelan.The move was made in order to make room for the installation, “Gabriel García Cervantes: El español.” It will mark the first time the works will be displayed in Italy since the institution opened in the city of Castello di Rivoli in 1998.The institution’s longtime director, Andrea", "The next Biennial should take place sometime in the 2020s. ŜI have long considered the process of making a work of art as an aesthetic experience,” said Victoria Miro. “The Biennial is the ideal vehicle for this interdisciplinary approach.”The 2018 biennial “Tuschke,” was curated by Olivier Assayas and opened at the Musée d’Art Moderne in Paris in December. The exhibition featured works by forty-nine artists, including Joël & Ronni, Léa Saade, and Phyllis Astor, which were organized in collaboration with a selection of twenty-nine artists, including Tommy, Cécile B. Brault, and Christoph Blumenstein, and is currently on view at the Musée d’Art Moderne from January 22 to February 28. \n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has appointed Anton J. Mander as its first director. Mander comes to the institution from the Museum of Fine Arts, Boston, where he has served as director since January 2019, following a three-year transition following the completion of his Ph.D.", "The next Biennial should be held in July 2021, with a new exhibition opening in August 2021. The Exhibition will be organized by NADA Tokyo in collaboration with the renowned architect Kozo Yamamoto. Inaugurating the exhibition will be the exhibition \"Feminine Dimensions’ Journey to the Moon,” curated by Hiroshi Tanezaki and photographed by Yoshikazu Fujii. The Biennial will be inaugurated by an exhibition of the artist’s original works, which will be presented by Kiyosei Genda, at the Contemporary Art Museum Konohana in Nagoya on December 30.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Zoya as its new advertising director. It will be the third Guggenheim-affiliated nonprofit organization to lead the museum, which opened in 1984 with the construction of a new building that contains the museum’s collection of more than 2,300 objects. Sue Cagle, who has helmed the Guggenheim since 2016, will oversee the museum’s digital strategy and launch the museum’s new online viewing rooms. She will also oversee programming in the museum’s historic space, including the Solomon R", "The next Biennial should be held in the urban setting of the city’s Museum St. Louis, which opened in 1984. The 2019 edition, entitled “Beyond the Garden,” received a $900,000 prize in compensation for its exhibition “Beyond the Garden,” which is curated by Maren Hess. The museum was awarded the $744,000 Chingemat, a contemporary art travel show.The 2017 MCAFTAF awardees were as follows:William H. Macy, Odeon, FinlandMarianne Hess, Curator, Dalton Art Museum, Manchester, United KingdomJessica Hsu, CuratorArtforum.com, London, EnglandYale Art Gallery, Cincinnati, OhioKimberly Hansson, Curator, Stanley H. Smith, Artforum.comKathy Lewis, Curator, Oberlin Art Museum’s Contemporary Art and Design, Closed until reopening in July2019.Herb Satter, Director and CEO of the Portland Art Museum, Maine. “It’s important to consider all the ways art is consumed, experienced, and experienced by others,” noted S", "The next Biennial should be held in the spring of 2022. The first event, which was created by the Thai pavilion, was a retrospective of work by artist Woongdam and will run until November 28.The Biennial has received a gift of nearly three hundred works from the Singaporean artist Roars, who is also a cofounder of the Biennial Foundation, a private foundation established by the artist in 2011 to raise funds for the exhibition. The works are from the works of nine artists, including Dusanjaya Vayas, who are represented in the biennial; three Thai artists, including Rajendran, whose work was previously exhibited at the Biennial in 2013, and two  Papua New Guinea artists, Ekala Jirawong and John Skipper.The full list of sponsors of the biennial:The exhibition also received a gift of 28 works by artist Hsuan-Ki Lu, who is currently represented by the Museum of Modern Art in New York. The work will be presented at the pavilion in March 2020.The biennial is overseen by the Singapore Art Museum (SAM), which has been engaged in a long-term partnership with the artist since 2013. The partnership has been extended to the Arts", "The next Biennial should be held in 2021 and will include artists from forty-five countries and twenty-two states. It will also include a survey exhibition and a virtual reality video exhibition.“This biennial has the potential to set a new standard for the art of the future,” said Helen Bertram, director of the Sackler Gallery. The exhibition will showcase work by forty-six contemporary artists and will be curated by Kiki Smith, curator of contemporary art at the Yale Center for Art.Smith will represent the United States at the 2022 Venice Biennale and is planning to create a new exhibition specifically for the biennial. Artist/activist Bechdel, who struggled to disclose the identity of her mother, received the biennial’s Lifetime Achievement Award in 2018. Previous winners include Robert Irwin and Jane Fonda.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has appointed Kate Archibald as its new liaison to the arts, which she will lead from January 2021 to March 2022. Archibald will work alongside museum heads and cultural leaders to help ensure the city’s arts and cultural organizations are positioned to thrive in the future.“Kate is a gifted and dedicated administrator who has been instrumental in", "The next Biennial should take place in the old City Hall in December 2020. A future exhibition of art from the archives of the World Market in London would also be hosted by the National Museum of Scotland.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Sarah Tew as interim director of its new arts and design institute, which was inaugurated in the city last week.Tew will be responsible for leading the museum through a transition in leadership and administration that will see it reorganize its collection, hire a curator to lead the museum’s public programs, and reinstall its programming. She will take up her new post on January 16.“We are grateful to the Board of Directors, staff, volunteers, and everyone at MoCA for their support of Sarah and for her leadership in bringing the museum to life,” said MoCA director Daniel H. Weiss. “Sarah’s unique and deep experience in the field, combined with her proven ability to create compelling and compelling art and design, will make her a strong fit for the MoCA leadership team.”\n\n\nThe Baltimore Museum of Art (BMA) has named Sarah Elizabeth Mosse assistant curator of contemporary art. She will be responsible for", "The next Biennial should focus on the history of human rights in our country and the world; the convergence of the art and culture sector and the art and culture landscape of the EEC; and the first one should focus on the history of art and culture in EEC.”The biennial will be comprised of thirteen exhibitions, each curated by a different artist, which will be presented in different ways. “Themes of future, past, and future are central to the exhibition,” the organisers wrote in a statement. “We are looking forward to seeing you there. We hope that you will be able to share your thoughts and experiences with us. We are all here to help each other.”The exhibition is organized by the São Paulo Bienal (SPB), a city-run initiative of the conservators' union, the Pécora do Povo, which is affiliated to the EEC’s governing body, the Union of South Italian Art, and will take place in the city’s Museu de Arte Contemporânea (AM), next to the ancient city of San Lorenzo, in the city of São Paulo, Brazil.The exhibition’s inaugural #artweekblock", "The next Biennial should be on the twentieth of June, and should take place at least three months after the end of the second World War. For the next two years, the museum will be closed and will do its best to prepare for a reopening with the exhibition of the forty-fifth and forty-sixteenth exhibitions in the format of a biennial.The exhibition “Kunstverein Berlin,” which is organized by the German institution Kunstverein Berlin (Düsseldorf, Stuttgart, and Berlin), will now be held in the same space as the seventeenth Biennial of Modern Art (BAM), which was held in the city from February 5 to February 6, 2020. “It is a great honor to return to the city where I began my career as a curator in 1992 and continue to present exhibitions, programs, and programs that have made an indelible mark on the history of contemporary art,” said Maggi. “I want to extend a warm welcome to the new and the old, to the local artisans and their families, and to the artists who define Berlin’s identity. I am especially grateful to the artists whose work I have inspired and", "The next Biennial should be held at least once each year. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed Matthew Lee as its next executive director. Lee comes to the institution from the Broad, where he has served as director since December 2019. He succeeds Mary Colucci, who was hired to lead the Contemporary Art Museum in Dayton, Ohio, and is expected to begin her position in January.“After more than a decade at the Broad, I’m incredibly excited to welcome Matthew to the museum and to work with the extraordinary team,” Mary Colucci, chair of the museum’s board of trustees, said in a statement. “I envision a museum that is a vibrant community hub for the art of the Pacific Northwest and the art of the Americas, and that will continue to grow as we embark on a new chapter of our history.”In his new role, Lee will work with the Broad’s curators and staff to advance the museum’s public-arts program, which was launched in 2018 to house the works of contemporary artists in Los Angeles County. The program is currently home to works by Amanda Palmer, Emily Bailey, and Robert Irwin. In addition, he will spear", "The next Biennial should be held in 2019. The twenty-fifth will be held in 2020; and the twenty-ninth in 2021. The twentieth and twenty-ninth will be held in 2022 and 2022, respectively.The decision to move the ART 1 Biennial, a major international art event that attracts up to twenty-four thousand people annually, was made in light of the coronavirus pandemic and the ongoing human rights crisis in the Middle East and North Africa.Artnews reports:  The New Arts Initiative of New York City announced on Wednesday that it has received $1.4 million from the New York City Council to maintain and expand the eventual 2019 iteration of the Biennial, which is titled Billionaire Boys and Girls Meet in the City. In a resolution adopted by Councilman Jimmy Van Bramer, chair of the legislative arm of the Mayor’s Office of Arts and Culture, the Council gave the developer David Kordansky a five-year grant of $1.4 million. It also gave his company Bigelow Aerospace, which has offices in New York, a ten-year grant of $1.5 million, and a five-year grant of $2", "The next Biennial should be announced soon. The 2020 edition will take place at the Seneca Falls Museum of Art, New York. The biennial will be preceded by the exhibition “Diana Al-Hadid: The Space Between,” which will be curated by Kaher S. Gaspouri, and “The Non-human,” which will be presented by Joachim Troelsdorf.“We are very much looking forward to the exhibition ‘The Space Between,’ which will showcase extraordinary works by the hundreds of artists coming together for the first time, together with the exhibitions ‘The Essence of Art’ and ’Art in Motion,”” Farah said.In the past, Al-Hadid and Troelsdorf have collaborated in their respective fields, but since they have been apart for a number of years, they have been unable to collaborate on the same works, which led to a significant gap in the works that were exhibited. Al-Hadid announced that she is collaborating with Troelsdorf in an open letter published on January 29. The letter said: “The past five years have been intensely inspiring, but exhausting, so we are delighted to see these early", "The next Biennial should open this fall. The Minneapolis Biennial was canceled after it was threatened with a lawsuit over its inclusion of an eleven-foot-tall statue of General Lee. The work, which commemorates the Battle of the Little Bighorn, was moved to a museum, but not before it was vandalized and pulled down by a group of twenty-eight activists.The Brooklyn Academy of Live Music is also facing backlash from some local arts organizations after it announced that it was planning to move the Monuments Men show from its current location in the basement of the Academy to the Brooklyn Armory, a cultural space in Bushwick, Brooklyn. The move has forced the move of the show, which is an annual event that has featured works by artists such as Maya Lin, Jhumpa Lahiri, and Jean-Michel Basquiat. Members of the organization’s board of trustees, who met with the board of trustees of the Brooklyn Museum on Thursday afternoon, approved of the move. The decision has sparked outrage from some local officials, who believe that the move will hurt the cultural district, and has led to protests outside the Brooklyn Museum, including by members of New York’s Black Arts Movement,"]