["The next Biennial should take place in 2019, and the following year in 2020. The full list of participating artists is as follows:Angela BassettAnish KapoorAnu NarayanaAmina JawaraAmarash VirkasAnwar SaeedAmina Jawara (UK)Amina Jawara (Rwanda)Andreas KanderAnwar Saeed (Canada)Andreas MoellerAnwar Saeed (US)Amina Jawara (Afghanistan)Anwar Saeed (US)\n\n\nThe British art historian David Goldblatt has been appointed as the next director general of the British Museum, the British government’s major international cultural institution. He succeeds Kate Fowle, who has served as director of the museum since 2016, and will take up the post on January 6, 2020.“With deep knowledge and experience in the field of art, I’ll be the perfect person to lead the British Museum into the future,” Goldblatt said. “Through a combination of originality, vision, and commitment, the future is bright for the museum and the future of the British Museum. I’m excited to see what we will", "The next Biennial should be held in 2022. \n\nThe National Galleries of Scotland have withdrawn from a planned exhibition in the United Kingdom due to the coronavirus, The Guardian reports. Titled in collaboration with the Royal Shakespeare Company, the event will reportedly be disrupted for the first time since 1992. The Royal Shakespeare Company, which has been working with the UK government to prepare for the coronavirus outbreak since October, states that the public safety situation in the United Kingdom has not improved since the coronavirus was first identified in China in March.There have been other setbacks for institutions working with the virus. The Metropolitan Museum of Art, which was preparing to reopen in April, announced on March 30 that it was delaying the reopening of the museum, which is located in a building on the campus of the St. Paul’s Cathedral, in an effort to prevent any disruption to exhibitions or performances. The move led the Tate and the National Theatre to announce that they would make their reopening dates public as of March 29, and to the Royal Shakespeare Company to announce that they would be opening on March 30, rather than March 21, as originally planned.In a letter to the public on April 2 from the manufacturers of anti-", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $10 million donation from the Frye Art Fund—the same organization that recently gave $5 million to the institution in support of the renovation of the museum’s original building—as part of its “Time to Repeat” campaign. The donation, which came in support of the institution’s $3 million project to re-create the institution’s collection of American and European art, was part of an agreement that also includes the restoration of the building’s original sculptural elements.Established in 1977, the Frye Art Fund has previously supported the renovation of the former Crystal City Museum of Art in Chicago and the restoration of the Edith Paterson–designed Huarán Theatre in New York. Its money has also been used to restore the former site of the original Los Angeles County Museum of Art and to launch a $10 million capital campaign to expand the museum’s collection of American art.\n\n\nThe French Ministry of Culture has removed a bust of Colonel Hugo Chevalier, an early biographer of modernism, who advocated for the deconstruction of American modern", "The next Biennial should take place in the fall of 2020. “Some of the most important and exciting contemporary work being produced by artists from Central and South America,” said Kenichi Sato, chair of the board of trustees. “We look forward to working with the Museo de Arte Contemporáneo Brasileira in São Paulo and the city of São Paulo as we continue to grow and accommodate the needs of our community.”For the inaugural edition of the Biennial, which will be held at the Museo de Arte Contemporáneo Brasileira in São Paulo, the works of ten artists were selected by a jury led by photographer and curator Joao Casals, who is also the artistic director of the Museum of Modern Art in New York. The selection process was closely watched by the Brazilian artists who are working to make their voices heard internationally through exhibitions at museums and cultural centers including the Museu de Arte de São Paulo (MASP), the Museu de Arte de São Paulo (MASP Museu de Arte), and the Museum de Arte de São Paulo (MASP Museum).The twenty-six artists who won", "The next Biennial should be in the spring of 2020. The next Exhibition should be held in the spring of 2021. The next Exhibition should be held in the spring of 2022. The next Exhibition should be held in the Spring of 2024. The next Exhibition should be held in the Spring of 2021.The next Exhibition should be held in the Spring of 2022. The next Exhibition should be staged in the Spring of 2021. The next Exhibition should be staged in the Spring of 2021. The next Exhibition should be staged in the Spring of 2021. The next Exhibition should be staged in the September 12–September 16, 2019, edition of the Biennial. The next Exhibition should be staged in the Spring of 2021. The next Exhibition should be staged in the Spring of 2019. The next Exhibition should be staged in the Spring of 2019. The next Exhibition should be staged in the Spring of 2018.  The next show will be held at the São Paulo Art Museum in August 2020.  The next show is planned for September 14–September 16, 2020. The next show is scheduled for September 13–September 15, 2020. The next show is scheduled for September 13–September 15,", "The next Biennial should begin in October and last until February 2019. It will reveal the themes for its fifteenth edition on February 18.“Themes of our time have never been more relevant,” said Steen Aamodt, artistic director of the Dutch Biennale. “The biennial will not only celebrate scientific innovation and creativity, but also the rich history of the biennial with its collections, exhibitions, lectures, demonstrations, and programs.” The theme of the biennial is Precarious. It will be the theme of the fifteenth edition.\n\n\nThe Manchester Art Gallery (MGH) and the Cherry Lane Arts Club (CLAC) have announced that they will open an entirely-new partnership to celebrate the city’s rich history and arts in the United Kingdom with a series of performances, screenings, lectures, and other events. The partnership, which will start in 2020, will bring together the largest groups of people from the City of Manchester and the Cherry Lane Arts Club in the United Kingdom and will provide a platform for artists from across the United Kingdom to engage with the city and its surrounding area.The partnership, which will be called the United Kingdom Stories, will include performances, concerts, exhibitions,", "The next Biennial should be held in the spring of 2019, said Mira Maestri, director of the Museo de Cultura Paleologico in Venice. Gosder Chertsov, the director of the Russian Academy of Arts in Saint Petersburg, said: “Our work in the field is becoming more and more important to the cultural life of the city. The Biennial will continue to function as a platform for the promotion and dissemination of Russian arts.”\n\n\nAfter a federal appeals court in New York struck down New York City’s ban on construction of new housing in the city, the city’s Department of Buildings and Design announced it is now allowed to begin the permitting process for the construction of new housing in the boroughs. The department revealed on Friday that it will now be able to begin the process by March 11, 2020, and expected to be able to begin the project in March 2022. The building code allows for the construction of twenty-four townhouses, but only two are allowed to be built in the city’s small, mostly working-class neighborhoods, which make up the core of the boroughs. The city’s Department of Buildings and Design estimates that approximately ninety percent of the", "The next Biennial should be held in Helsinki in late May/June. \n“Today we are witnessing a new moment in the history of art, one that will redefine the relationship between people and the world,” said Nikolay Afanasiev, the head of the exhibition. “It will also provide an opportunity to reflect on the interconnections between the past and the present, and the transformation of the exhibition as a whole.”One hundred and twenty artists, including Nari Warda, Kjetilä Saari, Juha Päivu, and Ola Ahtisaari, will participate in the third edition of the exhibition, “Time to Change.” The theme of the exhibition is the concept of ‘time,’ and the way it changes: ‘I want to change the way I look at the world,’ and I want to change the way I live.”\n\n\nThe Art Newspaper has announced that the 2019 edition of “Art Paris,” which was cancelled due to the virus, will now return in 2020. “It is with great regret and disappointment that we announce our cancellation,” reads a statement released by the", "The next Biennial should take place in the year 2021 and will be hosted by the Stedelijk Museum in Amsterdam, the Institute for Contemporary Art in New York, and the Museum of Contemporary Art, Los Angeles.\n\n\n\n\n\n\nA woman who was arrested at the Royal College of Art in London on Tuesday after she allegedly attacked a member of a group of visitors to the college on New Year's Eve, American Urban Radio Networks reports. The 20-year-old was charged with assault and is expected to appear in court next month.The incident occurred on New Year's Eve, when the woman allegedly grabbed a group of students by the throat and slammed their heads together until they lost consciousness, the New York Times reports. The woman is reportedly the daughter of a prominent art dealer and was arrested after someone called the police to report her.The woman claims she was trying to help a friend because she was upset that she couldn’t leave the apartment she shared with her parents for the night and went to sleep in her room. She claims she woke up to her friend screaming at her to get him to the bathroom. She claims she rushed to help her friend, but he was gone. The woman says that as soon as she got to the bathroom,", "The next Biennial should kick off on September 30 and run until November 1. The venue will host other biennial events in collaboration with the Uruguayan author Diego Ferrer, the artist Denise of Céuafranca, and the museum’s board, which will have total control over the platform. “We are truly honored to collaborate with this extraordinarily talented group of artists, and to enable them to express their vision and their talent through an installation that will be a source of inspiration and inspiration for future generations,” Müller said. The artist-led project will take the form of a sculpture by the duo. The work will be installed in the Museu de Arte Contemporáneo in São Paulo, which will become the permanent home of the exhibition. The exhibition will also include a live performance engagement with the work by the duo, which is currently on view in the Brazilian city of Curitiba. The two artists are the latest artists whose work will be featured in the exhibition; Riccardo Cipolletta (1984) was included in the biennial 2007 and Moët Hennesy (1926) was selected for the biennial 2012", "The next Biennial should take place in the autumn of 2021. The next one will be in the Spring of 2022. Collectors will be given the option of staging a second exhibition at the same venue, which is a ten-mile radius from the first. The 2019 event, titled “The Future Is Present,” was staged by the Minneapolis–based artist Andrew Kreps. The exhibition is currently on view at the Museum of Arts and Design in New York.\n\n\nThe British Museum in London announced today that it has appointed Paul Mpagi Sepuya, a British artist best known for his sculptures and paintings that fuse sculptural elements with contemporary and spiritual concepts, as its new deputy director for curatorial affairs. Sepuya will be responsible for overseeing the organization’s curatorial program and curating, overseeing and organizing the exhibition program, and administering the biennial.“Paul has been one of the few remaining dedicated practitioners of the contemporary sculptural practice in the UK, and we are delighted to have his talents and experience in guiding the museum’s curatorial program and exhibition program, which has been a strong driver of our growth, and his expertise in the artistic and cultural production of contemporary art,” said museum", "The next Biennial should be held in 2022, and the first in three years. \n\n\nLutheran social justice group PEN America announced today that it is launching a new fund that will help artists struggling financially following the Covid-19 pandemic. The fund will focus on providing direct financial relief to artists whose livelihoods are at risk as a result of the virus. “The Covid-19 pandemic has made clear that the financial safety of the most vulnerable Americans is still not good enough,” said PEN America president Susan Williams. “Our fund will provide direct financial relief to the artists and small to mid-size creative businesses struggling to survive the financial impact of Covid-19. We hope that this fund will be an effective way for artists and small businesses to help themselves and their families through this difficult economic time.”The fund will offer a variety of resources, including grants, loans, and crowdfunding, to help artists and small businesses struggling to avoid foreclosure, including those located in the Southeast and Midwest, where the number of Covid-19 cases has been highest.     \n\n\n\n\n\n\nSpecial Collections and Museums in Athens, Georgia, have launched an initiative that will provide immediate aid to the thousands", "The next Biennial should be held at the Saint Petersburg Academy of Fine Arts or the St. Petersburg State University, and the event should commence with a preview of the exhibition. The seventh exhibition will go on view in the autumn of 2020.Subsequent editions of the biennial will be held at the National Museum of National Art in Moscow, and at the State Duma, the Federal State Duma, and the State Duma Gallery, among other venues.\n\n\nGeneral director of the British Film Institute (BFI) Harrods, Lenny Henry, has announced that his successor will be Brenda Chiu, who has helmed the institute for more than twenty years. Chiu will take the helm of the BFI in September. Chiu succeeds Scott Hirst, who announced his retirement on Friday, March 16, and will begin her tenure in July.“Lenny has been an advocate for the BFI, building upon the visionary work of his predecessor, who has invested £8 million into the institution over the course of her tenure, including a new extension and renovation programme, a new exhibition, a biannual award, and new funding opportunities,” said Michel Crewe, chair of the BFI.Henry added: “", "The next Biennial should be held in the following year.” \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of two early works by artist Joseph and Mabel Potts, both of whom were working at the time of the 1957 bombing of a local government building in which Potts was working on a show for the first time. The gifts were made on December 15, 1957—just eighteen months after the attack—and were both valued at between $1,000 and $2,000.“We are honored and grateful to David and Gereon for their generosity in recognizing the important and valuable contributions of these artists, and in promoting their legacy,” said LACMA director and CEO Marc Spiegler. “Over the years, LACMA has served as a wonderful canvas for these artists to reflect upon their work and to create something truly new.”The gift of the early works comes at a pivotal moment in the museum’s history. On August 4, 1958, the museum held its first exhibition dedicated to the life and work of Joseph and Mabel Potts, the first show in the museum’s history dedicated to the work of a woman. That exhibition,", "The next Biennial should take place in 2020, and the first in 2021. \n\nShortly after the festival’s announcement, the museum announced that it would be reopening. The institution will reopen in the spring of 2021.\n\n\nThe Fine Art Museums of San Francisco (FAMS) and the City of San Francisco have agreed to create a $10 million fund to compensate the excesses of the current two-year-plus curatorial program, which was terminated by Mayor Ed Lee in March 2020. “We’re pleased that the two institutions committed to valuing the curatorial role as it relates to the art of the future,” said museum director Mauro Caccia. “The fund will allow FAMS to develop a longer term vision for the collection and future of the museum, while supporting the City’s long-term work to shape the institution’s collection and future.”FAMS’s curatorial and research team, created in a collaboration between FAMS and the city of San Francisco, was asked to prepare a brief for Lee’s March 10 announcement that the curatorial program would be terminated. The plan was to present the curators with a list of", "The next Biennial should be held in 2019.\n\n\nThe Eikai Museum in Tokyo has received a donation of fifty-seven works by seventy-five artists from New York–based collectors Nihei Yoshikawa and Rebecca Hall. The works will be displayed in its first exhibition dedicated to the Japanese avant-garde, “The Japanese Art of the Twentieth Century” (October 9–October 14, 2019), which is organized by the Eikai Museum, in the city of Nagoya. The gift includes sixty works by forty-seven Japanese artists, including Toshio Shima (1891–1960), Akira Takahashi (1926–1971), and Akiko Takeda (1902–2004), as well as forty-seven other works by American artists, including Lawrence Abubert (1907–1973), Edson Sassoon (1928–1982), and Leon Black (1922–2007).The exhibition will highlight the work of forty-eight artists from the Eikai Museum without whom the institution would not be able to present its first exhibition of American art. A retrospective of the work of the same artists will follow in 2020.The donation was made by Nihei Yoshikawa, who is the founder of the", "The next Biennial should focus on post-colonial and international art, and will then include a communal platform to address issues of alienation and exclusion, human rights violations, and climate change. “My vision for the next Biennial is to create an ethos of strength and resilience that will inspire a new generation of leaders and practitioners, many of whom do not yet have a voice in the arts, to reshape the global landscape for art in the future,” said Arsht. “The biennial will be a time to reflect on our place in the world, to consider the infinite potential of our body and mind, and to question and transform our world.”The 2018 exhibition will be curated by Marianne Boesky, who is currently the artistic director of the Roy and Edna Disney/CalArts Theater in Los Angeles, and will receive its first sponsor, the Wellcome Collection. It will be staged at the Disney Renaissance Center in Los Angeles and will be co-organized by two artists: Juliette Ibsen and Ashley Perry. The artist-run space will also host a series of talks and performances, including a presentation by the German artist Heinz-Christian Strache, and will host its first", "The next Biennial should be held at the Museum of the Fine Arts in Toronto in May 2021. The 2019 edition was canceled due to the Covid-19 pandemic. “I’m thrilled to be returning to Toronto to perform my first ever Biennial,” Rory Davies, the director of the Contemporary Art Museum Toronto (CAMT), said in a statement. “The project that is next on the agenda is to develop a new collection of live art created by young and old, to open the doors of the gallery to the public for a day or two each week, and to collaborate with local and international art professionals to create a new exhibition.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it will temporarily close its doors to the public in March 2020 and reissue new exhibitions in a phased manner. The institution’s chief curator, John L. Peterson, said that the decision to temporarily close its doors is made in order to “give the artists the best possible time to develop their practices and to re-shape their practices.”Peterson said that the museum’s lack of funds and staff problems have led to a number of artists returning to the", "The next Biennial should have a major retrospective of the work that was on view in the exhibition. The next exhibition should address the creative process of the exhibition and the representation of objects on view. On the tenth anniversary of the exhibition, the organisers propose to work towards the strengthening of the relationship between the Biennial and the local municipality of Biennale di Angelo.\n\n\nThe museum of modern art (MoMA) in New York has appointed Walter Dell as its new deputy director of sustainability and environmental engagement. The appointment was made official on Tuesday, March 24, after he was appointed by MoMA chairman Daniel H. Weiss.Dell comes to the institution from the Museum of Modern Art (MoMA) in New York, where he has served as deputy director of sustainability and environmental engagement since 2017. Previously, he was the director of sustainability and environmental initiatives at the Whitney Museum of American Art in New York and the inaugural director of the Hudson Valley Regional Heritage Center in New Canaan, Connecticut.During his tenure, Dell helped shape MoMA’s environmental commitments, including the reopening of the Whitney Museum of American Art in 2021 and the reinstallation of the Hudson Valley Regional Heritage Center in 2017, and was instrumental in the development of the arts and culture programming", "The next Biennial should focus on how the exhibition can continue to evolve with the growing interest in ethnography and the development of new media. The art of painting will also be examined in depth, as will the history of painting and painting-making in general.”The exhibition will open on January 20.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that Heidi Fleiss has been selected for its twenty-fourth-annual Tony Award. Known for her work in performance, installation, photography, and performance-based arts, Fleiss is a native of Pittsburgh, Pennsylvania, and has lived in Los Angeles for the past twenty-five years. She has exhibited internationally in exhibitions such as the Venice and the Contemporary Art Barcelona; she has won three Tony Awards, including for her work in the documentary Short Film in the 1980s and the Documentary Film Award in the 2000s; and she has won numerous other awards, including the $50,000 Forward Prize in 2006.“We are thrilled that Heidi Fleiss has been invited to take on this role as a curator and advocate for our art in 2018,” said museum director Alex Noguchi. “Her work and work of inclusion is inspiring, and every step", "The next Biennial should be held in 2021. “Art is about more than just the form of work, but the unifying of ideas, the richness of the medium, and the connection between viewer and author,” said Craig McKee, chair of the National Council on Art. In the months leading up to the 2020 event, the exhibition will explore “the connections between forms of expression, materials, and ideas,” including its exhibition “Teddy,” a collaboration between artist Carla Bellefant and her husband, artist William Bellefant. “For millennia, art has been an indispensable tool for social and political control over natural resources, and a powerful vehicle for transmitting ideas and ideas-based knowledge,” McKee said. “The combination of McKee’s role as a scholar and artist with the work of her husband and many collaborators has led to a new and vibrant notion of art as a system that can shape and change the world.”\n\n\nYale Union, the progressive, interdisciplinary art space based in Portland, Oregon, has welcomed its first artist to its staff. Jessica Marshall will be the first artist to work at the space to begin the new year in", "The next Biennial should be held sometime in the third quarter of 2020, the first quarter of 2021, and the last quarter of 2021, respectively. Cultural experts who have created an exhibition-based model for the 2020 edition, which will be staged in the Acropolis, the Forum, the Forum, the Forum, the Acropolis, and the Salon Maria, have also called for a new critical and cultural campaign to reimagine the past—one centred on the protection of cultural heritage and the preservation of the “postmodernities” created by western modernity. The 2020 edition is being prepared by the Institute of Contemporary Arts, Paris, the Institute of Contemporary Arts, Venice, the Institute of Contemporary History, Paris, and the National Center of Culture, Vienna. The authors of a statement issued by the institute said: “We are deeply concerned by the current situation, with the outbreak of the second wave of the US influenza pandemic, the threats surrounding a nuclear war, and the international refugee crisis. As a matter of urgency, we urgently need a new and radical vision for the future of art and architecture. This must be a critical juncture for the future of civilization, for it is only by confronting these issues that we can we hope", "The next Biennial should be held in 2021. The expert panel that selected the artists for the event was chaired by Arne Glimcher, director of the Institute for Contemporary Arts Berlin and a curator of contemporary art at the Swiss Federal Academy of Fine Art in Switzerland.\n\n\nThe Museum of Fine Arts (MFA) in Cincinnati has received a gift of more than 3,500 photographs by artist Ruba Sandoval from the family of El Salvadoran writer Orlando Peralta. The artist was arrested in Miami in 1971 and spent nearly two decades in prison for his role in the conspiracy to smuggle thousands of photos, films, and drawings by Salvadoran artists into the United States. Ruba Sandoval, the widow and author of several books on Salvadoran art and an upcoming exhibition at the Museum of American Art, has since died but her works will always be with us.“We are deeply honored to have the opportunity to share this gift with our many supporters and to extend a special gift to the Sandoval family,” said museum director Karla Sandoval. “We are also grateful for the dedication and perseverance of the staff and board, and for the thousands of fans who have come together to support the collection.”Sand", "The next Biennial should be held at the new site soon.\n\n\nFrieze announced today that Kate Barlow has been named the next director of Frieze London. She will be responsible for overseeing an international contemporary art network of more than ninety artists spanning forty-eight countries and territories. The announcement comes on the heels of a new five-year plan that aims to increase the size of the global marketplace and improve access to art, artmaking, and design. The redesign includes a new exhibition space and a redesigned online platform, alongside new digital initiatives and online retail.“Barlow has been instrumental in shaping Frieze’s vision for contemporary art since 2008, when she became its founding director, and has been instrumental in shaping the global contemporary art landscape with her outstanding curating career,” said Frieze director Maria Balshaw. “Her curating and curating teams’ work together to deliver an incredible range of contemporary art, from enigmatic abstractions to stunningly detailed recreations of real historical structures.”Barlow comes to Frieze with a proven track record of working with and shaping artists, and deep cultural connections with selected artists, as well as a demonstrated ability to work collaboratively across disciplines and disciplines, including architecture,", "The next Biennial should be held in 2020, but the date has yet to be decided. The deadline for the full list of participating artists is March 19.The full list of participating artists is as follows:Ana Villa-Newell, Albuquerque, NM (conditions permitting)Alessandro Bianchi, Rome, Italy (conditions permitting)Alessandro Giunta, Los Angeles, CA (conditions permitting)Anselm Kiefer, New York, NY (conditions permitting)Carlotta Iglans, Milan, Italy (conditions permitting)Carlo Miòniti, Buenos Aires, Argentina (conditions permitting)Carlo Pascual, Florence, Italy (conditions permitting)Caroline Sache, New York, NY (conditions permitting)Carlotta Rovira, Barcelona, Spain (conditions permitting)Carlo Streb, New York, NY (conditions permitting)Carlotta Saro-Wiwa, New York, NY (conditions permitting)CARLO STEWART, New York, NY (conditions permitting)CARTO ZOOM, New York, NY (conditions permitting)CASSIDY LAUREN, New York, NY (conditions permitting)C", "The next Biennial should be held in 2020 and will produce an exhibition dedicated to the beauty of the Pacific Ocean. The next Biennale will be held in 2021 and will include a selection of works from the 50th anniversary celebrations. The next edition will open in Japan in March 2020.\n\n\nThe Washington and Lee Art Museum in Virginia has issued a statement about the passing of its longtime chair and founder, whose work has been collected by the institution more than 120,000 times. He was born in Los Angeles in 1928 and raised in Charlottesville, Virginia. After graduating from the University of Virginia in 1964, McGarry moved to the small city of New London, Connecticut, and established a solo practice in 1967.McGarry became a founding member of the Florence, Italy–based group Visual AIDS. The label was based in part on Kerouas’s belief that the AIDS crisis was caused by the virus itself and that physical contact with the body was the only effective treatment. McGarry and the group created the artwork Paradise, an AIDS-themed sculpture in the Land of the Angel and Earth in 1973. He went on to create the artwork Aged Old Man, 1971–1975; The Hell of the World, 1978; and several other", "The next Biennial should be held in 2021, when, as yet, the organizers have not yet determined a date for the exhibition. \n\n\nThe New York Public Library (NYPL) announced today that it is developing new and innovative ways to support the work of underrecognized and underrepresented artists in the United States. It is also revamping its existing collection, which currently comprises about a hundred works by twenty-five artists, and is launching a new initiative to support emerging and mid-career artists. The initiative, titled Artist Funding, will allow artists to apply for grants that will go toward their professional development and will utilize the same programming and resources that are currently used by the New York Museum of Art (NYMO) and the Metropolitan Museum of Art to help artists living in the city. The initiative will work with artistic directors, collectors, and other cultural leaders to develop a new platform and platform to support artists. “The New York Public Library is committed to supporting artists in the city through a variety of programs that seek to advance their careers, offer opportunities for mentorship, and provide financial support,” said Tom Suttle, the publisher of Sculptor’s Pilgr", "The next Biennial should have been held by tomorrow, Aug. 8. But the organizers are expecting problems in the coming weeks. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, is now accepting nominations for its 2020 biennial Art of the Party. Each year, the museum hosts a show dedicated to Art of the Party, a term that refers to the central organizing principle of contemporary art, which encompasses everything from community-building to cultural experimentation to the creation of new social and political movements.The biennial, titled Art of the Party, will be presented by curator and curator-at-large Nari Ward, curator of photography at the Museum of Modern Art (MoMA), and is curated by Katherine Healy-Reeder, a curator at the Los Angeles County Museum of Art.“The Museum of Contemporary Art is committed to presenting innovative, thought-provoking, and personal artistic experiences in our programming,” said museum director Matthew Teitelbaum. “In the coming months, we intend to be up close and personal with the artists whose work we have curated, while also exploring and reimagining the possibilities for how art can be a tool to heal, a bridge, or a platform for social change", "The next Biennial should be held in 2020. The National Gallery of Art in Washington, DC, will not be reopening until 2021. Art in America’s Future, an online catalog of the full range of contemporary art and art history, was launched last year and is currently undergoing a redesign. The catalog will be open in December 2020.\n\n\nIn the aftermath of the deadly terrorist attack on London Bridge on March 22, 2017, which claimed the lives of seven people and injured hundreds, the City of London Corporation (COL), the local government body in charge of regeneration and safety for the City of London, announced it will invest an additional £1.5 billion into protecting the cultural sector. The capital’s cultural sector is a diverse array of organizations, associations, and individuals that contribute to the cultural fabric of the City of London, including gallery spaces, cultural producers, and venues for performing arts.In a statement released on Thursday, the council said that the additional funds would go towards designing new ways of supporting the cultural sector, such as by developing new ways of delivering grants and developing new ways of working with existing funds, as well as developing and testing new anti-terror strategies. The statement also noted the City�", "The next Biennial should be held in 2021.   “The more we can do for our artists, the better,” said Jodi Throckmorton, a curator at the Museum of Fine Arts in Boston. \n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Loren Bagby as its next chief executive and director. Bagby has been working at the institution for more than twenty years and oversaw the museum’s reopening in March 2019, which marked the opening of its first ever horse-drawn carriage, the MEC, in August 2015.“Loren has been an instrumental partner and friend of the Guggenheim and was instrumental in the museum’s reopening in March 2019, when we opened our Horse-Carriage Pavilion and our new The Chesapeake,” said Guggenheim director Michael Rosenfeld. “He has been a great champion of the MEC and has been instrumental in the museum’s transformation into one of the most highly regarded institutions in the country, thanks to his leadership. We are grateful for his decades of service to the institution and his contributions to Guggenheim.”Prior to joining the Guggenheim in 1984", "The next Biennial should take place in 2020. The first was held in 2011 and was in collaboration with the Centre Pératif in Paris. \n\n\nThe City of Glendale, California, announced today that it is expanding its arts and culture workforce by 11,500 positions through the launch of the city’s first executive-level arts and culture program, the Glendale Arts and Cultures Grant. Established in 2018, the program awards $6.4 million annually to local arts and cultural organizations. The program, which will debut in March 2020, will expand the city’s existing $4.7 billion arts and culture economy and connect residents of Glendale with the arts through events, scholarships, fellowships, and fellowships, as well as provide direct financial support to arts organizations.“The city’s arts and culture community is a critical element of our local, regional, and national economies, and this grant program will help us create more of it,” said Glendale City Council President John Pérez. “As LA’s largest arts city, we have the opportunity to create a more robust and diverse arts and culture ecosystem, expand access to arts education and training opportunities, and improve the accessibility", "The next Biennial should be on September 23 – October 3, 2020.I have been involved in and proud to have worked with artists such as Ugo Rondinone, Caja Zindano, and his team, through a multitude of mediums, in order to bring to light the art of my time. I am profoundly honored by the opportunity to collaborate with them and their talented colleagues again in the coming months.” The full list of International Artists is as follows:Annie Ashdown’sArt Gallery Helen Brown’sArt Gallery, London’s Art Gallery, London’s Art Gallery, London’s Art Gallery, London’s Art Gallery, London’s Art Gallery, London’s Art Gallery, London’s Art Gallery, London’s Art Gallery, London’s Art Gallery, London’s Art Gallery, London’s Art Gallery, London’s Art Gallery, London’s Art Gallery, London’s Art Gallery, London’s Art Gallery, London’s Art Gallery, London’s Art Gallery, London’s Art Gallery, London’s Art Gallery, London’s Art Gallery,", "The next Biennial should be held in 2020.\n\n\nThe London-based, nonprofit organization Genders Project, a coalition of artists and activists that seeks to advance gender equality through art and through programs that promote gender equality through art, has announced that it will launch an initiative for supporting those impacted by the Covid-19 virus and the associated health crisis. Called the Covid-19 Response Network, the program will partner with local gender-focused arts and cultural organizations, including the National Poetry Slam, the National Poetry Competition, and the British Film Institute, to amplify the work of individuals and organizations that are working to promote gender equality through art. The initiative will also provide resources and direct support to individuals and organizations that are working to address issues of violence against women, including homeless shelters, domestic abuse and sexual assault hotlines, and campaigning groups that are working to increase awareness and understanding of issues such as gender pay inequality, and will share information on how to apply to various government and non-government organizations.The partners will be asked to create and curate unique works that address specific issues of gender equality. The network will then present the works at public events, such as Pride London and the Royal Shakespeare Company, and will collaborate with other organizations, including", "The next Biennial should take place in the autumn of 2020. “The project here is to re-imagine the cradle, to make it more open and engaging,” said Director Anna Ottesen. The production team will be comprised of Tomasz Klimczyk, Pawel Wojtas, and Andrzej Wojtas. The exhibition will be led by Ulrika Niemann, the artistic director of the . . . paura Art Foundation, which will curate the biennial; Lorna Wood, the artistic director of the new Art Museum Stuttgart; and Eisa Bochereau, founder of the new public art space Wetter Kunstverein Stuttgart.“Serenity Nolde’s work embodies all of our collective dreams and anxieties; an attempt to reconcile the encyclopedic knowledge of nature with the ethical concerns of the human condition,” said Peter Paul Rubik, the biennial’s director. The first-person, color drawing-based sculpture, which was made in an attempt to illustrate and clarify the concept of primordial chaos, will be exhibited at the exhibition. The sculpture also features", "The next Biennial should be held at least ten years from now.”\n\n\nThe Institute of Contemporary Arts (ICA) in Florence, which was closed for a period of more than twelve months due to the coronavirus, will once again host a major international exhibition. The exhibition, entitled “Theatre of Life,” will return to the university’s Fiumicino campus in the city of Venice in 2021. Following a three-month hiatus, the institution will resume the exhibition, which has been on display since March 2015, with a new three-story‐long installation, “Theoretical Perspectives,” during the summer of 2020.The exhibition will take up the theme of the symbiosis between the human body and the environment, with a particular emphasis on the symbiotic relationship between the body and the environment. The work will juxtapose photographs, documents, and videos that depict the symbiotic relationship between the body and the environment, and will be curated by Marina Del Castello; artist-in-residence, Stefano Germi; and artist Marco Cipolletta, among others. The collaboration between the three artists was initiated by a proposal to merge the two exhibitions on the same day, in March", "The next Biennial should be held in the spring of 2020.\n\n\nThe Human Rights Campaign (HRC), the nation’s leading LGBT rights organization, has invited the sixteen states to the 2020 edition of the HRC Spring/Fall Climate Action Summit in Palm Springs, California. The 2020 edition, titled “Sustainability at the Core: Climate Justice,” will take place from March 28 to March 31 and will feature presentations by forty-six artists and activists who are working to address climate justice by 2050. The artists will be given $5,000 grants for their representations. The 2020 theme: Climate Justice. “At the core of climate justice is an urgent and committed commitment to the climate system’s resilience and well-being,” said HRC President Marc Glimcher. “This is an urgent issue for many countries and countries alone, and one that HRC is committed to working toward ensuring is addressed.”In a statement, HRC said the 2020 edition “underscores the critical role of art in challenging the global climate system and its attendant systems of oppression, threats, and dispossessions. We are proud to endorse these artists and activists for their expressions of their belief and passion about climate justice. We hope", "The next Biennial should be held at least five years after the date of the previous Biennial. \n\nThe Museums Association (MA), the UK’s professional trade group for museum directors, has issued a new statement regarding the future of the British pavilion at this year’s Venice Biennale. The organization states that it has not yet decided whether it will award the Royal Shakespeare Company the £7 million ($9 million) it has asked for. Instead, it is focusing its attention on how the 2019 edition will reflect the legacy of the pavilion, which is currently undergoing a major renovation. During the redevelopment, approximately 3,400 artifacts from the pavilion’s holdings were transferred to the new museum, which will be built in a former textile factory on the site of the old dockyard. Among the acquisitions are a paintings by Richard Avedon, William Shakespeare, William Shakespeare and Company, William Shakespeare’s Globe, Shakespeare’s Globe in the Square, and a painting by William Shakespeare. The exhibition will feature the works of Charles Dickens, Jane Austen, and Robert Mapplethorpe.The newly renovated pavilion will be inaugurated by an exhibition of paintings by Carsten Br", "The next Biennial should be held at the museum in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed David McAllister as its next director. He has been named chief curator and head of the museum since April 2020.“The appointment of David McAllister is a reflection of MoMA’s commitment to advancing the work of groundbreaking artists of the twentieth century,” said museum director Marc Glimcher. “He has been instrumental in growing MoMA’s collection, developing the institution’s reputation for excellence, and establishing MoMA’s reputation as an independent, multidisciplinary institution that sustains the life and well-being of the city of New York.”During his tenure at the museum, McAllister has organized more than seventy exhibitions and events, including “David C. Driskell: Stories,” 2006; “The Art of Painting: From Duochrome to Color,” 2003; and “Paradise Lost: Paintings of the Early Modern Period,” 2013. In addition, McAllister has written more than thirty books, including Conversations with David C. Driskell: Stories, 2005;", "The next Biennial should be held in 2022.\n\n\nThe secretariat of the Venice Biennale, which has been closed since early March due to the Covid-19 pandemic, has released a revised edition of its twenty-fifth edition, titled Reframing Venice, which will be hosted by the Palazzo Reale in July 2021.It was initially scheduled for a September 2021 opening. The exhibition will mark the twenty-fifth edition of the Venice Biennale, which was founded in 1952 by the Italian architect and designer Gian Luigi Bocconi. Curated by veteran biennali architect Paolo Cipolletta, the twenty-fifth edition will also include a redesign of the pavilion, a rethinking of the triennial program, and a conceptual overhaul of the exhibition schedule.Among the projects that will be overhauled are the selection of 60 artists for the exhibition, which will draw from a larger group of contemporary artists, and the project to create a new permanent collection of contemporary art in the Palazzo Reale. The exhibition will also reorganize the pavilion in response to the developments in social and cultural life, including the introduction of a new courtyard and a development of the program for the venue.Cipolletta", "The next Biennial should be held in the year 2021. Details about the exhibition and how to register for the inaugural event are available on the organizers’ website.\n\n\nThe Museum of Modern Art (MoMA) in New York has suspended its planned March 23 reopening of the institution in solidarity with the LGBTQ community in the wake of the recent mass shooting at a gay nightclub in Orlando, Florida, and in solidarity with the larger arts community.The March 3 announcement came days after New York Governor Andrew Cuomo signed a sweeping anti-discrimination law that bans discrimination based on sexual orientation and gender identity. Cuomo signed the law—the so-called Religious Freedom Restoration Act—after he fired arch-conservative Supreme Court Justice Sandra Day O. In a statement, Cuomo said: “Like many Americans, I have deep concerns about the sweeping new anti-LGBTQ legislation being pushed through by Governor Cuomo. The law is not only wrong on so many fronts, it is downright dangerous. For the first time in American history, it gives businesses and landlords the right to discriminate against LGBT people. It also gives private employers the right to refuse service based on their religious beliefs. And it gives the government the power to infringe on LGBTQ people’s civil liberties.”", "The next Biennial should take place in October 2021.\n\n\nThe National Galleries of Scotland announced today the twenty-five new members of its board of trustees. A total of seventy-three arts professionals are now represented in the institution, which comprises twenty-three national and regional galleries including Glasgow, the National Gallery of Scotland, the National Gallery of Wales, the National Gallery of Scotland and the National Museum of Scotland.“Galleries have long considered themselves as central to the cultural life of nations, and the National Galleries has played an important role in the promotion of art in Scotland,” said Margaret Hodge, the chair of the National Galleries’ board. “We are delighted to welcome these talented and committed individuals to the National Gallery of Scotland, and are confident that they will play a vital part in helping the National Gallery of Scotland to achieve its ambitious new strategic plan and remain at the National Gallery of Scotland throughout the programme.”The board comprises Hannah Armstrong, director of the National Gallery of Scotland; Mary Prentiss, director of the National Gallery of Wales; Sheri Spence, director of the National Gallery of Scotland; Markus Drobnik, director of the National Museum of Scotland; Jul", "The next Biennial should be held sometime in the second quarter of 2020. The 2020 event will be hosted by Art Institute of Chicago in the first half of 2020. After the museum reopens in the spring of 2021, the official list of participating arts will be announced.\n\n\nGina Beavers, a British artist and activist known for her work documenting and organizing everyday life through pop and contemporary art, has died at age eighty-seven.Born in London in 1952, Beavers grew up surrounded by art and encouraged by artists such as Pierre-Auguste Renoir and Jean-Michel Basquiat. Her first major break came when she was allowed to attend the London School of Economics (LSE), where she studied under British artist and educator C.S. Ginder, who taught her to paint, shape, and print. Later, her interests shifted to artmaking and architecture, leading her to return to the United States in 1988 to study with Virginia Woolf at the University of Virginia. Beavers eventually settled in Los Angeles, where she began working with artist and filmmaker John Banks at the height of his burgeoning career.That same year, she began the documentary series Pulp Fiction, which focuses on the artist’s ability to", "The next Biennial should focus on the history of collaboration between the artist and the museum, according to the organizers.The exhibition will also highlight the work of women artists in Mexico City and will feature the work of twenty-nine artists in the country. The exhibition is co-organized with the Museum of Women’s History, Mexico City.The event will be taken over from Memorial Day and will run from March 8 to March 13. The fair is currently accepting entries from March 3 to March 5.\n\n\nThe Museum of Fine Arts (MFA) in Houston has appointed Erin C. Higgins as director of its new research center, the MFA Center for Contemporary Art. Higgins joins the museum from the New York–based firm of Higgins & FitzGerald, which was founded by her parents, Gerald Higgins in 1976.“In her new role, Higgins will be responsible for reimagining how the MFA will present and present in a way that will reflect the new realities of contemporary life,” MFA director Leo Burnett said. “Her new responsibilities will require her to develop a new institutional model for contemporary art and her first task will be to gather and present the curatorial team’s collaborative work.”Higgins first joined", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that the institution will move the eighty-fifth edition of the Fifty-Ninth Venice Biennale from 2020 to 2022. The move, which is being made to avoid hurting its expansion plans, has been made in order to minimize the impact of the coronavirus. The venue will now be able to host the event in 2021, but only if all is completed by the end of March.“We are actively reviewing the full schedule and the total duration of the event in order to minimize any impact on the exhibition and its programming,” said MoCA director Adam D. Weinberg. “In the meantime, we will continue to present and publicize exhibitions and public programs that are specially created for the exhibition.”The event will now take place from January 26 to March 3 in the city of Venice. The new dates were made in response to a request from Venice’s city council, which is led by executive director Dario Franceschini, and were developed in consultation with representatives of Venice’s cultural, artistic, and architectural communities. The revised dates were also selected in consultation with the artistic and cultural", "The next Biennial should be set up in the beginning of the next academic year, and in the March–June timeframe, to provide a forum for public and cultural exchange and discussion. The theme of this year’s exhibition will be “Animals and the New World,” and the exhibition will feature new works by artists in addition to the work of recent and established curators. The event will be organized by the Biennial of the City of London and will be held in the city’s historic Tate galleries.The biennial’s architecture and design director, Eileen Allingham, said: “We are delighted to have this year’s theme ‘Animals and the New World,’ and to have the opportunity to present works that reflect the rich and interwoven history of both the biennial and the city of London. I’m looking forward to seeing how the exhibition will receive and respond to the city and to working with all the artists who have expressed an interest in the exhibition.”The exhibition will be accompanied by a book, “Animals in the World: From the Viewpoint of a New Lincoln,” which will be based on the exhibition’s 2017 show �", "The next Biennial should be set up with a budget of at least $10 million. The restoration of the Museums of the National Gallery of Art and the Metropolitan Museum of Art may also be part of the 2019 edition.\n\n\nThe Japanese contemporary artist Ai Weiwei has died at age eighty-two. He is survived by his daughter and granddaughter.Born in Stuttgart, Germany, in 1933, Ai Weiwei studied under the German painter Reinhard I. Müller in the late 1940s and mid-50s. In the early 1960s, he began making paintings on paper, using wood and paper and acrylic paints. In the 1970s, he returned to his native Woodingen, and in the 1980s, he created works on canvas and cardboard. Ai Weiwei’s art is commemorated in two museums, the Museum of Modern Art in New York and the Kunsthalle Basel in Switzerland.In a 2017 Artforum interview, Ai Weiwei said: “Art has been my life for almost thirty years. . . . No one has given me the freedom to contemplate art, to create art and pieces of art, and no one has taught me that art is the life of the body. Art has always been my life", "The next Biennial should take place at the Museum of Contemporary Art (MoCA) in Los Angeles, which is currently under construction, in 2020. The event will be hosted by the Los Angeles–based nonprofit Artadia and will be led by Amanda Shepherd, the executive director of the international nonprofit Artadia.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is moving forward with the construction of an interim museum for its collection, the Richard Meier Collection, after it was closed for nearly four years due to the Covid-19 pandemic. The work, which includes artworks dating back to the late 1960s, was acquired by the institution in 2018, more than thirteen years after it was completed in an effort to consolidate its holdings following the event that resulted from a fire that broke out in a storage area for artworks that was ignited by a fire in a neighboring building.“We are very optimistic about the future of the Richard Meier Collection,” said Jennifer Drobac, the director of the museum and the collection. “The next few months will tell if this is the turning point needed to secure our future as a world leader in museums of modern art and the future of art in America.”After the work is completed", "The next Biennial should be held in 2020.In the meantime, the Riga Foundation is working on a new award, originally founded in 1991 in support of the art of Riga based in the United States. The prize is one of the largest in the world. Last year, the Riga Foundation was awarded a total of $390,000 for high-quality work.\n\n\nThe Honorees For their advocacy and generosity, the Los Angeles County Museum of Art (LACMA) and the San Francisco Museum of Art (SFMoMA) are planning to give $12.5 million and $1.5 million grants to artists and organizations in support of the Los Angeles County Museum of Art and the new South San Francisco Museum of Art, respectively.The grants will come in support of projects that will help advance the museum’s mission, the arts, and the community, including the restoration of the museum’s Annex, the new museum, which will be completed in 2020; the renovation and expansion of the San Francisco Museum of Art; and the conservation and preservation of the Leonard Rubble, the Leonard Foundation, and the Rubble Collection.For the SFCMoMA, the funds will go toward the establishment of a Myra A", "The next Biennial should be in 2021.\n\n\nThe Spanish Ministry of Culture has issued an urgent request for proposals for the construction of new monuments in the capital of Madrid, the city of Madrid, which is currently undergoing a massive redevelopment plan, in an attempt to curb the spread of Covid-19. The move is part of a comprehensive strategy to contain the virus in the country, which has confirmed that more than 93,000 cases of the coronavirus have been reported in the country.The state announced that it will invest nearly $7 billion into the city to recover from the crisis, and will create more than 1,500 new jobs. It is also planning to increase the wages of municipal employees by 25 percent, and to create thousands of new positions in the tourist industry. The plan is part of a long-term strategy that aims to temporarily reduce the city’s exposure to the virus by introducing more healthcare facilities, increasing the city’s pedestrian traffic, and encouraging people to travel by car.The plan is being spearheaded by architect Antonio Fuentes, the head of the sustainable architecture and urban planning firm AFAM, and his business partner, architect Fernando Reyes. The firm is proposing to build more than 1,000 new residences for the state", "The next Biennial should take place at the Museum of Modern Art in New York. The first is to be held in 2021; the second in 2022. The third exhibition, entitled Cultural Revolution, will be on display in the museum until March 2019.  The Museum of Contemporary Art (MoCA) in Manhattan has received a new $600 million gift from philanthropists Jeffrey Epstein and Mary Mitchell. The former model and her husband, billionaire financier Jeffrey Epstein, have been accused of trafficking girls and young women into Epstein's private clubs in the United States and Europe. In addition to the donation, Epstein was charged with nine counts of sex trafficking and one count of transporting a minor through prostitution. Epstein was sentenced to thirty-two months in prison and handed a record $2.5 million fine.The second gift, made in 2018, was a $300 million donation to the Cultural Institute of Chicago. The gift includes architectural details of the institute, a theater, a library, and a conservatory. The institution will be transformed by the construction of two new buildings and the renovation of the existing buildings. It will also receive a new $150 million fund to facilitate the construction of its new campus.Epstein was arrested in 2007 and was", "The next Biennial should aim to recreate the urban landscape of the Biennial, through the collection of performances and works in various formats. The theme of the exhibition should be “Connections,” an interdisciplinary exploration of the intimate connections among people and their environments, who are at the center of the current ecological crisis. The theme of the upcoming exhibition is “Connections” and the theme of the upcoming exhibition is “Information.” The budget for the upcoming edition of the Triennale is $90 million. The organizers have estimated that the event will run from March 23 to March 26. The venue will be inaugurated by a grand opening reception hosted by the Department of Culture and Sport in Paris on March 22, followed by the exhibition of the first works by the artist María Berrada María Berrada, Vice President of Spain, in the Palazzo della Scala in Rome on March 26, and a grand finale event in the Basilica of Saint John the Baptist in Venice on March 29.The Venice Architecture Biennale, which was inaugurated in 1972, will return to the Venice Architecture Biennale Secretariate in Venice, Italy, in May of 2020. The first edition of the festival", "The next Biennial should commence as soon as possible and will invite artists and scholars to present their works in conjunction with the exhibition and public.”\n\n\nThe British Museum (BMA) in London announced today that it has appointed Ashley Trench as its next chief executive. Trench will be tasked with organizing the institution’s first exhibition of work by an African American artist, and will take the helm from the current director, Elizabeth Curran. Trench will be based at the BMA and will be responsible for the health and well-being of the museum’s African American community. “Ashley’s appointment is a tremendous step in BMA’s history, and aligns with the museum’s mission to present a diverse range of art to inspire and inspire our audiences to connect with art in ways that are emotive, thought-provoking, and moving,” said Curran. “Ashley’s leadership and vision demonstrate her ability to bring together the distinct strengths and distinct goals of BMA for the benefit of the many and reflect her commitment to the BMA’s African American community.”The BMA is currently negotiating a major expansion of its African American museum", "The next Biennial should take place in the spring of 2020 and be hosted by the Museo de Arte Contemporáneo in Madrid. The full list of participating artists is as follows:Zinedine Costeri (Germany)Nadia Corrias (Brazil)Cécile D'Argenzio (Italy)Pari D'Argenzio (Italy)Juan Carlos Ferrer (Argentina)Mariisa Galindo (Spain)Samantha Gallego (Italy)Nuria Gara (Mexico)Nina Goss (Italy)Linda Hartigan (United States)Maria-Louise Johnson (United States)Renata La Rosa (Italy)Melanie Llano (Spain)Yelena Malizkina (Russia)Megan O. Peña (Mexico)Yuri Panin (Ukraine)Shirley Poole (United States)Julia Pfeifer (United States)Olivier Pincus (Australia)Christopher Pohanka (United States)Christopher Plummer (United States)Catherine Slagle (Canada)Nathan Spann (United States)Perry Sullivan (Canada)Nadia Villar (Canada)Nina We", "The next Biennial should be held in 2022 and the exhibition should begin in late March/early April. The exhibition will be organized with the participation of a total of sixty teams. The fourteenth Biennial will take place in 2020. The exhibition will register the biennial in the month of March, with the theme “Art & Culture,” and will include fifty works by fifty artists, including Adriana Varejão, José Luis García-Marin, and Antônio Pilar.\n\n\nThe Philadelphia Museum of Art (PMA) signed a long-term lease agreement with the Italian architect and designer Andrea Ferrari, who has been a longtime collaborator of the museum and designed for the PMA for more than twenty years, on Tuesday. The museum also received an additional $100,000 for its renovation of the Villa di Campiglio, and another $50,000 for the renovation of the Marfa Art Museum and the former Gasworks building, both of which are currently under construction. “The museum is grateful to Pierluigi Ferrari for his exceptional cooperation and support on the PMA’s renovation and for his deep knowledge and experience in the art world,” said museum director Nina Rosenfeld", "The next Biennial should take place in 2022 and will be hosted by the Museum of Fine Arts, Boston.\n\n\nThe US House of Representatives has passed a $1.1 trillion federal aid package for arts and cultural institutions. Passed on Tuesday, the $1.1 trillion bill extends funding for “essential cultural agencies” through 2021 and provides $879 million for “essential commercial agencies”—including nonprofit organizations, nonprofit artistic organizations, and nonprofit educational organizations. “This is a historic year for arts and cultural institutions in the United States, and I’m eager to work with my colleagues to build on the momentum of our recent legislative victories,” said Representative John Lewis, chairman of the Congressional Black Caucus, which introduced the legislation. “This aid is earmarked for the vital needs of American arts and cultural workers and will help ensure that they have access to critical funding and critical support during this challenging economic and political time.”The legislation also provides $128 million for “alternative,” a term used to describe arts and cultural institutions that do not receive funding from the federal government, and $132 million for “altern", "The next Biennial should take place in 2022. In a letter addressed to the committee, Sijak said: “At a time when Western art is being increasingly targeted in both Europe and the U.S., it is essential to be able to face the future with an open and transcendent heart. I hope the committee will find a way to support this. It is my hope that the next Biennial will become a powerful and inextricably linked experience for visitors to the United States and Europe.” After being invited to participate in the first show of the exhibition, which will be held at the museum from September 7 to September 14, 2019, the artists who will be featured in the second show, which will take place at a different location in the city in the summer of 2020, are as follows: Darius Chaudhuri (India), Dissoluci (Italy), Agnieszka Malony (Poland), Anikhand Shah (India), Andrzej Dziewior (Poland), Amiti Najar (India), Ankit Rangarajan (India), an area in Amsterdam (theater), and an area in New Delhi (", "The next Biennial should be held in 2022 and will be hosted at the newly renovated Beaches Museum, which will be completed in 2022; the Museum of Modern Art, New York; and the Hong Kong Museum of Art.Under the original plan, the inaugural exhibition would have opened in 2016, but was pushed back due to the Covid-19 pandemic. In a statement, the museum said: “The new partnership reflects the museum’s commitment to delivering a truly international exhibition experience that re-creates the richness and diversity of the Hong Kong arts scene.”  The project will also include the commissioning of the Hong Kong–born artist, the Hong Kong–based photographer, and her husband, the Hong Kong–based filmmaker, Yoonsung Lee, to create a “Living Art” exhibition, and will involve the acquisition of artworks and objects by the collection and installation of a biennial of Hong Kong contemporary art.Lee will work with artist Kim Eun-kyung, a Hong Kong native and Hong Kong–born national, to create a public sculpture that will be inspired by her family’s ancestral village, in an effort to introduce a new kind of cultural exchange to Hong Kong. The work", "The next Biennial should take place in 2021. The fourteen-year-old institute, which has three thousand works on display throughout its two-acre space, will be reopened in 2020.\n\n\nArt Basel Hong Kong held a panel discussion on Monday, March 8, marking the occasion of the first annual Art Basel Hong Kong Art Prize, which will be awarded to a Hong Kong–based artist who shows outstanding innovation, creativity, and innovation in their work for the exhibition. The award is one of 10 recognized as a result of the event, which took place in the seaport city of Qingdao from February 27 to March 4, 2020. The 10 finalists, who were chosen by an international jury comprising Arianna Almeida, director of the ICA Hong Kong; Johanna Bell, director of Warner Bros.; and Liang Tsang, director of Nara Contemporary Art; were invited to submit works for the event.“The 2018 Art Basel Hong Kong Art Prize awardees include Nara Contemporary Art, Vincent van Gogh Museum, Art Paris, and Richard Avedon Gallery, among others, “Nara Contemporary Art” will receive an additional $125,000, while ", "The next Biennial should invite a third branch, known as the Future Branch, which will be composed of artist and scholars from across the globe from the twenty-first century. Its director will be a Chinese artist, scholar, and educator, Hao Qi, who will serve as the host and curator for the event.The opening of the museum will be marked by a series of performances and a series of exhibitions, curated by Hao Qi and curated by fellow Chinese curator Kuo Zhang-Chen, titled “Towards a Future History of Art,” at the Museum for the Arts. The exhibition will also include an introduction by the exhibition’s curator, the Chinese artist Xu Guangyong, and will present work by forty artists under the direction of Hsu Hsuan-Kai, a graduate of the institution.The presentation of “Towards a Future History of Art” will take place on the fourth floor of the Museum of Contemporary Art Beijing. The artists participating in the exhibition will be announced in the coming weeks.\n\n\nJames Turrell, a British painter who went on to frame the first work by Yinka Shonibare, began his career in the mid-’60s at the Art Institute", "The next Biennial should be held at the National Art Museum in London in 2022. The museum will unveil a new collection of works by British artist Robert Mapplethorpe in the spring of 2020.\n\n\nThe eighty-second edition of the Venice Biennale, curated by Cristian Miro, has announced that the event will now take place in the Italian city of Reggio Emilia from March 21 to March 26, 2020. The Italian pavilion will be built in the city of the same name, in a project that will also involve the restoration of the city’s historic Cinquarium di Vercelli, a former Crematorio di Vercelli factory, and will be inaugurated by a performance by the Italian band il loro.“The history of this city is full of possibilities,” said Miro, who described the pavilion as an extension of his ongoing project to create a new public space in the city. “The pavilion will become a refuge for visitors of all ages, a gathering place for art and people, and a bridge for visitors to Reggio Emilia and Italy.”During the installation of the pavilion, the city’s national heritage site, the C", "The next Biennial should be held in 2022. \n\n\nThe Museum of Contemporary Art (MoCA), Chicago—with its expansion and renovation project that added fifty new galleries and set up a new Public Theater—has announced that it is now accepting applications for its 2020 iteration, “The Visible City.” The exhibition will feature new and previously untitled works and will be held at seven locations across Chicago: the newly renovated and expanded Public Theater, the newly renovated and expanded Art Institute of Chicago, and the recently completed Enniscorthy Museum of Art.“We are thrilled by the response to the inaugural series and are eager to receive your proposals,” said David W., chair of the 2018 and 2019 boards of trustees. “The Visible City’s team has done an outstanding job of building a strong community vision for the city, and we look forward to welcoming you to the event as we continue the legacy of MoCA as a cultural destination.”The 2019 iteration, “The High Museum,” featured work by artists such as Adam Pendleton, Tim DeSousa, and Tilda Swinton. The exhibition went on to win the 2019 Whitney Biennial Award, as well as the 2019 Cynthia Trem", "The next Biennial should take place in 2021 to coincide with the centenary of the birth of the artist-in-residence at the Guggenheim; the two projects are being presented as a way of renewing the museum’s relationship with the Guggenheim.\n\n\nThe National Museum of Art in Washington, DC, announced that artist Peter Wilt—a pioneer of American abstract sculpture and a major influence on the American landscape—has died at age eighty-eight.Born in New York City in 1919, Wilt came to the United States in 1940 to study with Frank Stella at the University of Minnesota. He eventually settled in Carrboro, North Carolina, where he met his wife, the painter Alice Eller, who became pregnant with their son. Wilt and Eller welcomed their daughter in 1941, yet the family relocated to the Washington, DC, area of the country in the early 1950s. Wilt continued to work in sculpture and architecture, taking up painting and drawing in the process, and in 1996, he received a lifetime achievement award from the National Museum of Art.In 2018, the artist was awarded an honorary doctorate from the Smithsonian, a prestigious award that is given annually to a distinguished scholar. He also received his", "The next Biennial should be announced soon. For more information, please visit the official website of the festival. If you are planning to go to the event, you will be able to do so only if you have a reservation for a specific time slot. To ensure a great experience, we ask that you arrive early and travel light. The show will be held at SACM, an exhibition space located in the city of Antwerp, Belgium, from October 9–October 12. The exhibition will be on view until November 21. Friday, October 17th: The Costume Institute, Los Angeles (La Caftata)For the tenth year in a row, La Caftata will present its Costume Institute Exhibition. This year’s exhibition will be held at the Museum of Modern Art in New York from October 17–October 21.After a weeklong campaign to raise over $45 million for the institute, which is in the process of creating a new venue for contemporary art in Los Angeles, the $35 million organization opened its new space, the Costume Institute, at 4695 West Twenty-Fifth Street in the city on October 21. The new museum will be led by John Skipper, the", "The next Biennial should be held in the autumn of 2020.\n\n\nThe global art-world trade fair, Art Basel Hong Kong, is planning to open at Sotheby’s Hong Kong in September 2020. The new event, which will be led by director-general Andreas Lüpertz and curated by his wife, Anna, will be divided into three online platforms, while the single-day event will also be available in several locales: Hong Kong, Kuala Lumpur, and Beijing.Announced in March 2019, the fair featured work by fifty-six artists, including Laura Owens, Eileen Atkins, Thomas Dolman, Kiki Smith, and David Salle. The event will also host an artist residency program, a photography/video exhibition, and a literary/art event.Sotheby’s announced that it will donate $50,000 to the Los Angeles County Museum of Art (LACC), which was founded by Marc-Andre Sauer and Petra Vuelta. In January 2020, the museum will also receive $50,000 from the Sauer and Vuelta Foundation.First announced in December 2018, the Los Angeles County Museum of Art (LACMA) is a new museum dedicated to the Los Angeles County Department", "The next Biennial should be held in 2022, and the museum’s current exhibition “Ascension of the Sun” will be on view in September 2020.\n\n\nThe Cleveland Museum of Art (CMA) has appointed Patricia O. Clark as its new executive director. Clark takes the helm of the institution from Sharon Holmes, who has helmed the museum since 2016. She succeeds Richard Mayhew, who departed in the summer of 2021 to become director of the Rhode Island School of Design.“Patricia is the right person at the right time to strengthen the CMA’s mission and our collection,” said Adam Voorhees, president of the CMA. “The CMA is growing at an unprecedented rate. With more than four hundred new exhibitions and an expansion of the current collection, we are reaching even more audiences and connecting even more people. She is a leader, a thinker, and a friend who will help us reach our goals for the next six years.”Clark joined the museum in 2015 as deputy director of curatorial affairs and chief curator. During her tenure at the museum, she oversaw several exhibitions, including the “Midnight Runners,” “Supernature: A", "The next Biennial should focus on the film-and-video-making process, with a particular attention to the medium of electronic and digital media, as a vehicle for feminist and anti-racist politics.”The selection committee for the 2020 edition, which will be held at the Museum of Fine Arts in Boston, will announce a selection of the next year’s work on June 3. \n\n\nThe summer of 2019 witnessed the largest single-day crowds in its history at the Venice Biennale. According to the organizers of the event, more than 8.5 million visitors to the Venice Biennale, which is staged annually in the Italian city, converged on Venice in July for an event that encompassed more than eighty artworks by eighty artists and featured more than three hundred installations. The Venice Architecture Biennale was the most popular of the three, with more than five hundred works and more than 70,000 visitors, which opened on June 14 and runs through October 28. Dubbed the Architecture Biennale, the event was organized by Studio Biennale, a subsidiary of Venetian architectural firm Fondazione Fondazio, and its general director, Maurizio Cattani, and featured", "The next Biennial should take place in 2021.Dissolving the statue will also allow Tallinn to become a hub for international exchange, with the city’s first-ever biennial exhibition, “Between the World and Me: The Presidential Biennial,” to open in 2021. A physical replica of the statue will follow in 2022.Following a group show in 2015 at the former Headquarters of the Soviet Union in Moscow, the city submitted a proposal to the Museum of Contemporary Art, Tallinn, to have its image erased from the wall of the city center. The show, “Between the Presidents,” eventually won the right to be displayed in the museum.In addition to the restoration of the statue, the city restored the facade of the Museum of Contemporary Art, and it also treated the building’s courtyard and added a courtyard fountain. In 2017, the fountain was renamed in honor of the city’s first mayor, Jussi Jaakkola.\n\n\nAn eighty-one-foot-tall granite statue of Ronald Reagan, a former president of the United States, has been toppled by a group of workers protesting his administration’s handling of the opioid crisis at the American Museum of Natural History in Boston.", "The next Biennial should take place in the city in 2022 and will be hosted by the Musee de Arte Moderna in San Remo, Italy. “I’m so pleased to be able to announce this year’s inaugural edition,” said Mira Dallazzo, artistic director of the Second Avenue Arts and Design Biennial in Long Island City, New York, and the inaugural winner of the $10,000 Ivanka Kuhn Prize. “The new venue will provide even more opportunities for artists to present their projects and for visitors to experience the biennial through their own art. I see the upcoming exhibition, ‘Composition 19,’ as a great time to celebrate the new partnership between the Biennial and the Museum of Modern Art.”The Biennial five-yearly winner, Christopher Wool, who lives near the Arts and Design Museum in Los Angeles, said: “The new arrangement will allow the Biennial to avoid the conflicts that have characterized its past, while still providing a home for the work of some of the most important contemporary artists of our time. The partnership will enhance the rich and idiosyncratic legacy of the biennial, and it will serve as a model for the future", "The next Biennial should open in 2021 and will be hosted by a different location. The full list of participating artists is as follows:Biennial theme: Cultural Violence”Artist theme: Modernity in TransitionArtist introductions: Kunstmuseum KunstBauhausBremen BauhausBorchardt-BruchbücherBucharest, HungaryBüroPractical Art Gallery (BPG)Bucharest, RomaniaBüro-Prix Maximilian Büro-Prix Maximilian+Sofia, ItalyBüro-Prix Maximilian+Sofia, ItalyBüro-Prix Maximilian+Sofia, ItalyCultural Anthropology of the FutureCultural Anthropology of the PastCultural Anthropology of the PresentCultural Anthropology of the PresentCultural Anthropology of the PastCultural Anthropology of the PresentCultural Anthropology of the PresentCultural Anthropology of the PresentCultural Anthropology of the PastCultural Anthropology of the PresentCultural Anthropology of the PastCultural Anthropology of the PresentCultural Anthropology of the PresentCultural Anthropology of the PastCultural Anthropology of the PresentCultural Anthropology of the PastCultural Anthropology of the", "The next Biennial should be announced as soon as possible.We would like to thank the board and the trustees of the Biennials, the Biennials’ founders, the board of directors of the National Arts Museum, the artists and organizers of the Biennial, and the members of the board of trustees for their dedication and support in the development of the Biennial over the last twenty years. We are also grateful for the support of our talented staff, all of whom have worked together to ensure the museum’s success over the last fifteen years; the board of trustees; and the many volunteers who have contributed to the museum.\n\n\nThe Solomon R. Guggenheim Museum in New York has announced that it will no longer recognize the Armenian Genocide in a statement released on Thursday, January 8. The museum made the announcement in response to a petition signed by more than 1,700 people in the United States and internationally. The move follows a wave of protests against the museum’s tacit acceptance of the violence of the 1915–1918 Armenian Genocide.As the number of signatures mounted, museum director Roberta Smithson announced that the museum would consider the petition for the first time next March. “We will consider it and take a careful and", "The next Biennial should be held on June 22–June 28, 2021. \n\n\nThe Museum of Modern Art (MoMA) in New York has released new guidelines on how it should respond to protests from activists protesting the museum’s affiliation with a white supremacist group. Under pressure from activists, the museum—which had previously chalked up the controversy as a minor disagreement that could be settled amicably—announced last week that it would begin removing pieces that align with the American Nazi Party, which advocates for the removal of non-whites from the United States.Upon learning of the decision, the American Nazi Party’s executive director, David Duke, declared: “We are ecstatic. We are ecstatic because it means we are going to start helping our fellow Americans without the bloodshed and the destruction and the destruction of our own communities.” He added: “We are just getting started. We are just getting started. We are just getting started. We have an important job to do.” According to the New York Times, the American Nazi Party has chapters in twenty-nine states and has members who believe that the Holocaust never took place and that America was created by non-white immigrants.The American Nazi Party is the second", "The next Biennial should focus on the history of architecture and design in the Americas from 1980 to 2025. The exhibition will highlight the newest, most diverse, and most complex artworks in the Americas.”The 2020 edition will be held in Miami Beach from March 19 to March 21, 2020 and will feature twenty-four works from twenty-nine artists who hail from twenty-nine different countries\u0097South America, Europe, Africa, Central and South America, Asia, Oceania, and the Caribbean.“The upcoming exhibition is a reflection of our commitment to pushing the boundaries of art to the limit and celebrating art in all its different forms: from the extraordinary to the everyday,” said Yoko Rokan, the deputy director of the Biennial. “The work of artists who came before us has been shaped by the different histories of their countries\u0097the history of their societies, the history of their societies and cultures, and the history of their countries. Thus, they are presented here.”The full list of participating artists is as follows:ArticlesArticles 1Articles 2Articles 3Articles 4Articles 5Articles 6Articles 7Articles 8Articles 9Articles 10Articles 11Articles", "The next Biennial should explore the history of modern art and how its practice has shifted, and continues to shift, to reflect the contemporary world. We will also consider how we can work together to address the challenges of reconnecting with the past and to create a new narrative of modern and contemporary art.”The exhibition will run from March 19 to March 21, 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it will hold its next event, “The Design and the Future,” at the Los Angeles location in 2019. The show will present new archaeological discoveries, the creation of new works, and the exhibition of works that have never been on public view, and will feature over fifty photographs by American photographer and theorist Edward Hopper.The exhibition will also introduce the public to the work of fourteen artists who are working to redefine what it means to be an artist. In addition, a new book, “The Art of Art,” will be published, and the exhibition will serve as a major new introduction to Hopper’s work. The show will be held at the Los Angeles County Museum of Art (LACMA), which is currently undergoing a $3.8 million renovation, from", "The next Biennial should be in 2020. Museum director, David McAllister, said: “The next edition of the Biennale will be different than the last, as we embark on a journey of some forty years as a museum. It will take us forward, and forward together. It will inspire us and make us question ourselves. It will challenge us and make us rethink. It will delight us and shake us in ways we never expected. And when the dust settles and the walls come tumbling down, the Biennale will be far from forgotten.” \n\n\nThe Museum of the City of New York (MoC) is moving the forty-fifth edition of the Biennale of Berlin from 2018 to 2020. The announcement follows a long and contentious process that began when Meirelles’s artistic director, Sander Goldsmith, asked MoC director Matthew Booth to remove the exhibition from 2018 to coincide with the reopening of the museum.The institution confirmed that the move was made in order to meet new environmental issues. “The Berlin Festival in 2020 will not be ready until at least October and will not be able to open before February, so the development of an interim exhibition has", "The next Biennial should be held in 2021. The move comes amid the global health crisis and may prevent the exhibition from opening on January 28, 2020.While the museum has not yet commented on the decision, it has previously explained that the reorganization of its collection in light of the pandemic is not without its challenges. The museum also confirmed that it will introduce two new exhibitions in 2021 that will be organized under the theme “Pangaea” and “Brazil’s legacy. In an interview with Artnet, the museum said: “It’s been a tough decision for us. We have a long-term vision for the exhibition that we want to present in 2023, and we’re moving forward with that.”In the meantime, the biennial’s opening date will remain unchanged. Artforum will continue to follow the Biennial in the event that it reopens.\n\n\nThe Metropolitan Museum of Art in New York has appointed Rowena Taylor, the director of the Museum of Modern Art (MoMA), as the new chair of the Metropolitan Museum of Art’s board of trustees. Taylor will take up the helm of the museum on January 4.“Rowena", "The next Biennial should take place in the summer of 2021. The exhibition will focus on the development of the scientific and technological aspects of the visual arts, and will include the first public presentations of works by the likes of Hieronymus Bosch, George Barkeley, and David Salle. It will have a budget of US$33,000 and will be organized by the trustees of the foundation.\n\n\nThe Museum of Fine Arts (MFA) in New York has extended its partnership with the Los Angeles County Museum of Art (LACMA) by six months, extending the opening of the museums’ first collaborative exhibition, “The Radically Adopted: The Southern California Film of the 1950s” (2019–2020). LACMA and the MFA will now jointly present the exhibition in December 2020.“The Radically Adopted: The Southern California Film of the 1950s” was selected from a shortlist of twenty-four entries for the 2019–20 Ed Clark Award for Excellence in Art, which is given annually to an artist who has demonstrated an outstanding contribution to art in the last five years, and was presented at the Venice Film Festival in May. “I’m thrilled that we’", "The next Biennial should focus on the history of the art, as well as the artistic process itself, and will focus on the interconnection of the body and the body part, the body and the mind, or the body and the environment, and will address the ethos and social and political environment of the institution in a way that is sensitive to the contemporary realities of Argentina.  Mariana, who is also the secretary of the Cordillera de Cultura y Cultura Artes, said that the biennial will continue to discuss politics and the environment in Brazil, and will present a selection of works by young Argentines and artists working in the country.Commenting on the upcoming exhibition, Mariana said: “We are delighted to be joining the passionate and dedicated team of curators, intellectuals, artists and activists who have long championed the work of this generation of artists. They are the ones who have created the conditions for our current achievements as well as for the future of art and culture in the country. We are confident that when the biennial’s next edition takes place, the exhibition will be an occasion for us to reflect on our shared history, celebrate our achievements, and reflect on the future.”\n\n\nThe Museum of Contemporary", "The next Biennial should focus on the history of art in the region and how art history has shaped the lives of many, including Margaret Atwood. The first iteration of the show, which will take place in London, will take place in February 2021. The first iteration of the exhibition will be held at the Museum of London; the second at the Institute of Contemporary Art in the Arts (ICA) in the summer of 2022. Originally scheduled to open in 2015, the first edition of the show, titled Art in the Life of Us, was canceled due to the Covid-19 pandemic. Museum director Maria Balshaw told Metro that the show was not meant to be a “single show.” She added that the museum has been working through the exhibition “for years now.” “The first time we did it, it was with a group of artists that I knew, we called the Primates, and it was a very special group,” she said. “We had no idea what we were doing, we were doing it in secret, so we just started with a group of extraordinary artists, and they were the stars and the rest is history.”The exhibition will include works by", "The next Biennial should be held in 2020. The institution is currently negotiating with the participating artists and is hoping to raise $45 million to organize its first edition, which will take place in the former United States embassy in Cairo from September 16 to September 20, 2020.Cairo’s Institute for Art and Architecture (AIA), which is located in a renovated old British Museum in the Egyptian city of Alexandria, received a $25 million donation from the Sargent-Charles-Henri-Baptiste family in London on Friday. The money will enable the institution to complete its expansion project and to launch a new exhibition space in the city.“We are thrilled that the Sargent-Charles-Henri Baptiste family has decided to support the project,” said Anneke Wirsing, head of the Museum of Modern Art in Berlin. “The project is now on track for a successful launch. We hope that this money will help the Museum of Modern Art and the wider project to create a new platform for great art, arts, and architecture in the city and beyond.”The Sargent-Charles-Henri Baptiste Foundation, which was founded in 1996 by the family to support the development of", "The next Biennial should take place in 2023. The ten-yearly event will also unveil a new development model for the exhibition. The Biennial will return to its original location in the capital of Abu Dhabi in 2022.\n\n\nThe Four Seasons Hotel in New York City is asking its guests to leave the Metropolitan Museum of Art on Wednesday as protesters from the group the No More War Coalition demonstrate outside of the institution. The protestors are demanding that the museum’s board of trustees appoint an administrator to care for the museum and prevent insolvency. The protesters’ demand that the trustees appoint an administrator to oversee the museum and prevent insolvency as a result of the ongoing war in Afghanistan.According to the New York Times, the board of trustees of the Met is currently assessing the impact of the war on the institution, which has about 1,500 employees and generates $5.5 billion annually. Michael L. Cohen, the board’s chairman, made it clear that any insolvency plan must take into account the Met’s financial losses as a result of the war. “We are in the process of assessing the impact of the war on the Met,” Cohen said. “And we will continue", "The next Biennial should be held in 2022.\n\n\nTeaching Art in the Age of Mechanical Reproduction (TAMART) has announced that it is planning to close its fifty-six-year-old flagship exhibition. After a decade of collaborations with a number of world-renowned artists, including John Akomfrah, Robert Irwin, Olga Gabau, Ursula von Rydingsvard, and Anna-Sophie Ernst, the gallery will close its doors for good. The announcement follows a year where the project underwent a dramatic transformation, transforming from an exhibition devoted to the work of young and established American artists into an international platform dedicated to the exhibition.“In 2013, we decided to open a new space dedicated to the exhibition of international artists,” said Christopher Hugh, president and founder of Artforum. “In 2016, we opened the TAKART platform, which brings you more than two hundred artists from twenty-six countries. In 2019, we opened the Janus Art Exchange, which brings you artists from fifty-one countries. In 2020, we opened the Biennial for Minimalism, and in 2021, we opened the Biennial for Art. In 2022, we will open a new platform dedicated to artists", "The next Biennial should take place in 2022. The 'future models' exhibition, which celebrates the work of artists whose work has been transformed by the recent exhibition at the museum, is being staged in conjunction with the museum’s fifty-sixth anniversary.The exhibition will be hosted by Johan Jonas and Anna-Sophie Nygren at the museum. The theme this year is “Future Models: From Earth to Air,” a joint project between the two artists.The exhibition will feature work from seventy-nine artists, fifty-two of whom are currently represented in the ’Art of Tomorrow.” The biennial’s quarter-finalists are John Cassavetes, Semmelweiss, Richard Diebenkorn, El Hadji Diyabu, Felix Frankfurter, Alejandro Grier, Hans Ulrich Obrist, and Sihan Wang.“This year’s exhibition focuses on the work of the significant twentieth-century African artists, most of whom have contributed to and are still at the core of the biennials,” said museum director Rene Magant. “We are pleased that these works will come to our museum again and again, to reflect", "The next Biennial should be staged in 2020. The number of works exhibited in the exhibition during the 2017 edition in Paris was also much higher: 17,213, an average of 13 works a day.\n\nOn its website, the exhibition featured work by artists such as Damien Hirst, Ray Peng, Maren Hassinger, and James Turrell, among others who had not previously been represented in the United States. The exhibition also added three works by American Indian artists, including a depiction of a hunting party, a Native American celebration of a hoeing season, and an abstract painting by American artist John Davidson.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Olivia Nuzzo, who currently serves as interim director of the museum, as its next director. She will take up the post in November 2020. Nuzzo, who has spent the past eighteen months leading the museum, has been a leader in advancing the museum’s ambitious expansion plans, which were first announced in 2013 and were spearheaded by director and CEO Adam D. Weinberg. She also oversaw the organization’s expansion into a new, expanded building that houses the museum’s permanent collection, proposes an increase in the number", "The next Biennial should be held at the Art de Paris in Paris in 2022.  The 2019 edition was held in Paris, and the exhibition was organized through KAM Gallery, the Paris-based contemporary art organization, alongside the Paris-based academic center the Musée d'Art et d'Histoire, which is owned by the French government.The next edition of the Biennial will be staged in the city of Lyon, France, and will take place in 2021. The event will be hosted by the city of Lyon and the invitation-only institution the Museo d’Artes in Madrid, Spain, and will run from March 13 to March 16, 2022.\n\n\nSince the mid-1990s, the Swiss artist Wolfgang Nothof has composed and arranged works filled with images, sound, and text. Nothof’s works have been exhibited at the Museum of Modern Art in New York; the Museum of Modern Art, Los Angeles; the Kunsthalle Basel, Switzerland; and the Museum St. Gallen in Rome. Among the works on display in the exhibition “Wolff Nothof” are his “Ascendante von Image,” 1993, an image—of a fist", "The next Biennial should be held in the spring of 2020. \n\n\nThe Museo de Arte Contemporáneo Estadio Nacional de Madrid (MASM)’s board of directors has accepted a proposal from the Falange Foundation for Venice to stage the organization’s next edition in Venice in 2021. The announcement was made on the eve of the ninety-fifth edition of the prestigious international art biennial, which is currently underway at the Museo de Arte Contemporáneo in Madrid.The full list of participating artists is as follows:João Lopes (Portugal)Fernando Alves (Brazil)Hélio Oiticica (Brazil)Fernando de Castro (Spain)Gabriella Cervantes (Brazil) Cara de Córdoba (Argentina)M. Lopes (Brazil)Gabriel de Castro (Spain)Nirvanjai (India)José Ramírez (Mexico)José Luis Pérez (Spain)Dario Césaire (France)Dario Iñigo (Spain)\n\n\nThe Museum of Contemporary Art (MoCA) in Atlanta has received a gift of fourteen works by", "The next Biennial should take place in 2022, when the second edition of the museum will be held in Algiers, Morocco. “The museum has been working in the same manner since its foundation,” said museum director Mona Hatoum. “The year 2022 will be the twenty-sixth anniversary of the museum and will bring a new edition of the Biennial, which will be on a larger scale and will present a larger selection of works. The newly-created position of director will be in charge of the museum from the next biennial until 2023.”\n\n\nThe New York–based arts organization the Alliance of Museums (AAM) is suing the New York City Department of Cultural Affairs (DCLA) to secure the release of James Levine, a seventy-one-year-old blind man whose wrongful conviction was based on a deplorable “falsification of a historic racial epithet.”The lawsuit, filed yesterday in U.S. District Court in Manhattan, alleges that the city did not properly investigate allegations of racial discrimination leveled by Levine and that it failed to act when a racial slur was allegedly thrown by a city employee at a Brooklyn restaurant in April 2019.�", "The next Biennial should be in 2020, and the 2020 iteration will be housed at the Museo de Arte Contemporáneo in Porto Alegre. The full list of pavilion sponsors is as follows: MAMCO ANALYPTICAS, INC. (Mexico City) MAMCO CONNECTIONAL, INC. (Mexico City) MAMCO DESIGNS, INC. (Mexico City) MAMCO DE PORTICO, PORTO Alegre (Mexico City) MAMCO MARINAS, PORTO Alegre (Mexico City) MAMCO PORTUGAL, PORTO Alegre (Mexico City) MAMOCRUITAS, INC., PORTO Alegre (Mexico City) MASICHERRAS CORP. (Mexico City) MASICHERRAS PORTUGAL, PORTO Alegre (Mexico City) MASICHERRAS REICHARD, PORTO Alegre (Mexico City) MASICHERRAS REICHARD, PORTO Alegre (Mexico City) MASICHERRAS REICHARD, P", "The next Biennial should be held in 2021, with a New York City edition to be staged in 2021. Brooklyn’s Albright-Knox Art Gallery will move from its original site in the city to make way for a $1 billion expansion. While the building of a new exhibition space for the institution will be part of the redevelopment plan, the transformation of the space is expected to be complete by 2022. In a statement, the gallery said: “We are delighted to receive the investment of $1 billion by the City of New York and the state of New York in making this the largest and most ambitious multi-year event in our history. The next Biennial will bring together some of our most important artists for an extraordinary event.”\n\n\nThe Galerie Lauritza in New York has appointed photographer Lucy Oxtoby as its next artistic director. Oxtoby, who photographed celebrities and political figures like Lena Dunham, Paul McCartney, and Michael Jordan, will assume her post on January 5, 2020.“This is an exciting time to join the institution, as we embark on a significant year,” Oxtoby said. “I am thrilled to be working with the Giuseppe Piazza", "The next Biennial should be held in 2021.\n\n\nMUNICH’s Jürgen Todt, the director of the Museum Monuments in Kassel, who was appointed by the city of Munich in 2017, has been hired to lead the German pavilion at the Fifty-Ninth Venice Biennale in 2020. According to the Art Newspaper, Todt will be based at the museum until 2024, and will have his first public appearance at the pavilion in 2022. Todt will assume his post at the institution on March 31. “The appointment of Jürgen Todt as the pavilion’s director is a high moment for the future of museums, and an opportunity to see the world through his eyes,” said Hannah Martin, the director of the museum in a statement. “He is very much a part of the museum’s culture and is a man of integrity who has been instrumental in bringing the works of art and architecture from the museum to the public. He has been a trusted advisor for many years and I am very confident in his leadership of the pavilion.”The Swiss museum, which had been without a director since August 2019,", "The next Biennial should be held at least ten years after the conclusion of the second biennial. “The decision to move forward with the second edition was made in light of the fact that the previous edition, in both its two editions, had been established in the same year, and that the exhibitors and the organizers had made great efforts to improve the exhibition in the second edition,” the organizers wrote. It also noted that the choice to move forward with the inaugural edition was not a random one, but one that was “considered by many of the participants, and was taken in order to give them the opportunity to participate in the next edition, which was organized in the same year.”The organisers also cited the increasing number of foreigners who were entering the country as an impetus for moving forward with the exhibition, and the decision to return the exhibition to the United States. “The exhibition is on display in the exhibition section of the museum, and was shown in the American Museum of Natural History in New York during the exhibition ‘Between Worlds’ (2017–18).”\n\n\nThe Noguchi Collection, which comprises twenty-two five- and six-thousand-workpieces by artists such as Peter Paul", "The next Biennial should take place in 2020, but the exact date is yet to be decided.The festival will be hosted by the newly established St. Petersburg Biennial Institute in partnership with the major art museums of the Russian capital and will be inaugurated with a free public exhibition in June 2020. The festival will also feature a series of roundtable discussions with leading international artists, artists' organizations, artists, collectors, and collectors’ representatives. The biennial will culminate with the exhibition “New Pangaea: Art and the Future of Modernism” at the museum in November 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to open a new 50,000-square-foot gallery in a former CVS on South Main Street in the city in March 2021. The new space will be called the MFA Gallery. Its inaugural exhibition will be “The Painters of Venice” and will feature approximately 150 works by fifty-two artists, including Eva Hesse, Jannis Kounellis, and Ulla and Victoria; sixty-one works by contemporary artists, including Adam D. Weinberg, William Gass and Peter Andre; and nearly two hundred works by artists from the Boston-based", "The next Biennial should take place in the spring of 2021. It is still unknown when the biennial will be able to re-open. The exhibition has faced many challenges since its inception in the late 1960s. The opening of the exhibition was delayed from 2021 to 2023 following the outbreak of Covid-19. However, as the pandemic worsened in early 2019, the Biennale de Lyon (formerly the Biennale de Monaco) announced it would re-open. The fourth edition of the fair, Art Paris 2020, was originally set to take place in March 2021. At the fair, which was originally scheduled to commence in March 2021, the first show of works by Russian and Russian-American artists was removed from its inaugural year. The event was also forced to move to the southern city of Antwerp, Belgium, after the organizers were ordered to close the exhibition by the Belgian government.In March 2019, the Biennale de Lyon issued a public apology for the exhibition and for the situation it created, emphasizing that it will continue to be a platform for important contemporary art works and enacting a number of initiatives aimed at making the fair more sustainable. “We sincerely regret that this has come to this,", "The next Biennial should examine the legacy of the late Pakistani artist Humayun Ali, who, in addition to pioneering the use of the term 'dissolution of form' in his paintings, also experimented with the performance of death and the uncanny. The festival will also focus on the relationship between art and social justice, with a particular interest in the work of Pakistani artists and the Muslim-American community. \n\n\nThe Art Newspaper has learned that the Museum of Modern Art (MoMA) in New York has been negotiating with an independent curator in Paris to take over the role of the museum’s curatorial board. The institution has hired Aidella Catellani as the new director, effective immediately. Previously, she was the curator of the first exhibition dedicated to the works of Salvador Dalí at the Museo d’Arte Contemporáneo in Venice from 2016 to 2020. Catellani comes to the museum from France’s Galerie Patek Philippe, where she has served as chief curator for the past two years. She succeeds Rémi Djawadi, who retired in the summer of 2020 after four years at the helm of MoMA.“Rémi was a visionary leader", "The next Biennial should be dedicated to the development of the new museum’s collection and exhibitions, which would be organized in partnership with the local community, and will inaugurate the institution's new campus in the city of San Yanzamán, a former Spanish colony, in the city of San Juan.\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Courtney Brown as its next director and CEO. Brown is the former CEO of senior management and chief curator of modern and contemporary art at the Museum of Modern Art (MoMA), where she oversaw the acquisition and restoration of the institution’s holdings and oversaw its expansion into a Los Angeles institution.“Courtney has a deep and diverse history at LACMA, having helmed the museum from its inception as a nonprofit organization in 1999 to its current status as a major cultural institution,” said director Richard Armstrong. “Her work has been central to LACMA’s move from its original mission as a ‘museum of contemporary art’ to becoming a leading contemporary arts destination in the city. And it has been instrumental in growing the museum’s collection, which has been recognized as one of the most important pieces of contemporary art in the", "The next Biennial should take place in April 2020, and the event will be staged at a large museum in Oslo. The event is also represented by the Hong Kong-based artist Sonamu Takal, who won a prize at the exhibition in 2014 for her work The Current of Light. The 2018 exhibition was titled The Unseen, a joint project between the artist and the Japanese architect Tadao Ando.In another piece titled The Air I Breathe, 2009, Kawamura depicts the artist Wahihua Jia who is considered one of the greatest nineteenth- and early twentieth-century Chinese architects. The work was exhibited at the Beijing Art Museum in the spring of 2019.The exhibition was curated by Lenore Bruce-Pearce, assistant director of the Kunsthalle Bern and the Kunsthalle Bonn, and is organized by the artist-run NGO Design Now.\n\n\nThe US-based multidisciplinary arts nonprofit the Milken Institute for International Development (MIED) has created a new position for artists in the arts that will offer mentorship and career-building opportunities. The organization announced the appointment of Kristen Wright, who previously served as a curator at the National Gallery in Washington", "The next Biennial should be held at Griffith Park, in December 2020. “We believe the future of art and architecture is best supported within the City of Melbourne’s exceptional cultural ecosystem,” said MCA director Elizabeth Gillett. “We look forward to working with the City of Melbourne and the private sector in supporting the next iteration of Melbourne’s Art of the Future.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that artist-in-residence Carmelo Baratta will host a series of talks, performances, and residencies in the museum on a biennial basis. The artist-in-residence program, which was created in response to the city’s 2016 earthquake and tsunami, is open to artists who are eighteen years old or older.Baratta, whose practice is grounded in the Latinx experience and works primarily in color, will speak on topics such as environmental justice, politics, and gender. Curated by Michelle Obama, the 2016 exhibition “We Are All In This Together: A Visual History of Women” will be on view until January 25, 2021.Baratta’s first program, which will be held at the Mira: The Met", "The next Biennial should be held in December 2020, and the last one as soon as possible. The first exhibition will feature works by eighty artists. Inaugurating the event will be a special exhibition of work by seventy-three artists. The second and third stages of the biennial will be held in the cities of Ann Arbor, October 31, 2020; Hamburg, January 12, 2020; and Linz, February 18, 2020.Tickets for the first edition of the biennial are on sale now, priced from $75.00, and will be on view from October 9 to February 21. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Steven Brown as its next executive director. Brown first joined the museum in 2018 as senior curator of modern and contemporary art. He has also held previous positions at the museum, including as associate curator of contemporary art in the Meijer Center for Arts and Design in New York and as associate curator of prints and paintings in the Meijer Center for Arts and Design in Massachusetts.“Steven’s extraordinary curatorial achievements and engaging, in-depth teaching style makes him a perfect fit for a museum that is committed to supporting the very best artists and academic scholarship,” said", "The next Biennial should be held in 2021. \n\n\nThe City of New York and Governor Andrew Cuomo’s administration are preparing to launch an ambitious new $1.2 billion redevelopment plan for the Big Apple, reports the Art Newspaper. The $1.2 billion plan, titled New Yorkers First, and was released on March 28, will overhaul the city’s iconic MKE building and bring it up to code and includes plans for a new public park, an expanded early childhood education program, and the construction of 875 public housing units.“The plan is ambitious, but it is not fanciful,” Cuomo said in a statement. “It is the right thing to do, and it will have the immediate and long-term impact of revitalizing our communities and preparing New Yorkers for a new kind of city. We can’t wait another twenty-five years to see what happens.”The redevelopment plan, which was developed in partnership with the architectural and design firm Gensler, was approved by the City Council last April and takes effect immediately. In order to make room for the expansion of MKE’s current exhibition venues, the city is planning to build a new 1,", "The next Biennial should take place at the Museum of Contemporary Art (MoCA), Chicago, in the fall of 2020. The museum has yet to officially announce its selection of works for its second edition, which will be curated by Avital Ronell, curator of contemporary art, in collaboration with Richard Prince. The museum is also planning to reinstall the Biennial’s collection in its new location, the Hirshhorn Museum, in Washington, DC; the Museum of Modern Art, New York; and the Margaret and Ira Dallenbach Collection in New York.The Hirshhorn, which opened in 1972, is currently undergoing a $250 million renovation, and Biennial 2 shows the Hirshhorn’s exhibition of works by David H. Koch. The Biennial will also feature works by Cindy Sherman, Joan Miró, Robert Irwin, and Tilda Swinton. Each of the Hirshhorn’s new partners will receive a total of $150,000.The two-day event will be held at the Hirshhorn from March 17 to March 19. The event will feature a variety of highlights, including work by a large group of American artists, including Frank Gehry, Helmut Newton,", "The next Biennial should be expected sometime in 2020.\n\n\nThe Austin Museum of Art (AAM) has received a $40 million donation from the foundation of the late artist and philanthropist Willem de Kooning, the founder of the de Kooning Foundation for the Arts (DWK), which has supported numerous important works by the artist, as well as the performance, film, and sculpture programs of the Contemporary American Art Museum in Boston, the Cultural Center of the Arts in New York, and the Center of Contemporary Art at Stanford. “AAM’s director, Pamela Sarsal, said the gift is ‘in recognition of the years of dedicated work that has been done by the foundation to maximize the impact of Willem de Kooning’s legacy in our own backyard,” according to Artnet. The donation comes four years after the foundation established a $50,000 endowment to continue its work, which includes a scholarship program for graduate art students at the University of Pennsylvania. The gift was also made through a gift from the de Kooning estate, which was gifted a collection of works by the late American painter Robert Irwin, a collector of de Kooning’s works, and", "The next Biennial should be held in 2021.\n\nIn celebration of its centenary, the American Council of Art has created a new award honoring those artists who have made significant contributions to their fields over a five-year period. The award will be presented at a biennial of the same name—the first was held in 2016. The twenty recipients will be selected by a jury comprised of John Martino, curator of modern and contemporary art; Kristen Meier, director of the Whitney Museum of American Art; and Ronald Balaks, a curator and art historian.“The American Council of Arts is thrilled to recognize the following individuals who have made significant contributions over their five-year series,” said John Martino. “We are pleased that these twenty-eight artists will be recognized for their contributions to the art of their choice, and we are especially grateful that these twenty-eight will be awarded this year’s prize. We have long believed that the American Council of Arts was an important center for the study and appreciation of Art, and the series will help further the spirit of the award by recognizing the thirty-three outstanding artists whose work has been featured in the exhibition.”The Biennial of Terreform, organized by the American Council", "The next Biennial should be in 2021. The board of trustees of the Institute for Contemporary Art (ICA), which was founded in 1937, granted a $50,000 prize to the artist-run art fair Art Basel Hong Kong in June and has proposed a new prize for art collectors that will be announced soon.\n\n\nThe Seattle Art Museum (SAM) has announced that it is reopening on October 10 after months of construction and is expecting up to nine million visitors to visit its new $650 million facility. The institution, which has been closed since December 13, is also planning to add more exhibits, a theater, and more galleries to the campus, and expand the institution’s collection. The move will set the stage for a major reopening in March 2022.During construction, the museum underwent a major expansion, adding new galleries and an interactive plaza designed by architect Frank Gehry. The building also saw the opening of the John and Patricia Glenn Gallery, which houses the archive of the Metropolitan Museum of Art, and an expansion of the exhibit hall. The museum’s present-day main building, the former site of the former headquarters of the Seattle Pacific Electric (SPE), is undergoing a $150 million expansion.The construction of the", "The next Biennial should be announced later this month and will take place in the summer of 2021. The exhibition will present the first work by a group of American artists to date, and will present two of the works in the collection. It will also include work by artists who have had exhibitions at the museum in the past, including Michael o n Daniel Craig, Marianne Kahn, and Mark di Suvero. The Biennial of Modern and Contemporary Art will be hosted at the Musée d Pompidou and will be free to the public.  The seventy-sixth edition of the Venice Biennale will take place at the Museo d Arte Contemporanea in Rome in early 2020.\n\n\nThe Chicago-based nonprofit Museum of Modern Art (MoMA) has appointed Daniel H. Weiss as its new deputy director. Weiss will be responsible for spearheading the museum’s relationship with the city of Chicago through a series of collaborative initiatives such as the Chicago Art Institute’s (CMI) Chicago Architecture Center, the Chicago Children’s Museum, and the Chicago Art Museum (CAM), and will assume his responsibilities on October 22.“Daniel Weiss is one of the most respected and admired executives in", "The next Biennial should not be out in the open, but should be held behind closed doors, with a select group of well known and respected people chosen to preside over the exhibition.  The next Biennial should not be out in the open, but should be held behind closed doors, with a select group of well known and respected people chosen to preside over the exhibition.  The first Biennial was held in Hong Kong in 1998.  The second was held in the United Kingdom in 2003.  The third was held in New York in 2009. The fourth was held in London in 2011. The fifth was staged in New Orleans in 2017.  The sixth was staged in San Francisco in 2018.  The seventh was staged at the Venice Biennale in 2019. The eighth was staged at the New Orleans Museum of Art in 2020.\n\n\nArt historian and curator Andrew Kopp, who has curated twenty-four exhibitions at the Museum of Contemporary Art (MoCA), Los Angeles (LA MoCA), the Museo del Barrio Artes Puebla in New York (MPAA), the Museum of Contemporary Art Los Angeles (MoCA LA), and the Metropolitan Museum of Art (MoCA), has", "The next Biennial should be held at the Biennial House in Beijing, in 2020. For the first time, the event will give the public a direct voice in the selection of the artists chosen for the seventy-fifth edition of the Beijing Biennale. The exhibition will be curated by Sohrab Mohebbi, the director of the Shanghai Gallery of Art and the Chinese Academy of Fine Arts, and will take place at the Beijing Art Museum from November 17 to December 21, 2020. The exhibition will consist of seventy works by twenty-six artists from twenty-six countries, including Denmark, Finland, Greece, Hungary, Northern Italy, Norway, Spain, and Sweden. The exhibit will be curated by the artist committee led by Wenyi Duany, a founder of the Chinese Academy of Fine Art and the Beijing Art Museum. The biennial will have a theme of the traditional concepts of food and fantasy, of travel and the natural environment, as well as new forms of interaction and creativity.  The exhibition will showcase the work of twenty-six artists from twenty-six countries, including Denmark, Finland, Greece, Hungary, Northern Italy, and Norway, including Hao Gao, Reem Duarte, A", "The next Biennial should be held in the autumn of 2020. Michael Scott-Allen (artist), Joel E. Miller (artistic director), and Mark Bradford (public intellectual) are co-organizing a new collaborative project, Triennale of Sculptors, that would examine how contemporary art, and the relationship between art and the visual arts in general, is rooted in the concept of preparation and the concept of history.“This is a moment of great change,” Barrett said of the exhibition’s opening. “It is a moment when the work of art is perceived as an extension of our lives and as being in some sense a part of our histories. But it is also a moment of opportunity, a moment of transformation.” The inaugural exhibition, “The Process,” opened on March 25 and ran through April 4. The second exhibition, “The Present,” opened on April 3 and ran through April 5. The third exhibition, “The Future,” opened on April 4 and ran through May 11.The festival will also welcome artists whose works were included in the inaugural exhibition and will include a special edition of the Biennial at the CNE, which will", "The next Biennial should be held at the local community center, which is currently being renovated by the private firm Gensler, in November 2020. The manufacturer has said it will invest $2 billion into the project.According to the New York Times, the community center will host twenty-five exhibitions, including twenty-one by artists and collectives with the Qatar Foundation for Contemporary Arts, and will have a museum dedicated to the life of the founder of the modern miniatures game Monopoly, the American board game, which is popular in the Gulf. The institution will also have a theater where the exhibition will be shown in the first and second-floor galleries along with an area for educational and cultural activities.  The biennial is part of the Qatar Initiative to Strengthen the Nationalities’ Nationalities’ Nationalities is a new initiative launched by Qatar in 2017 to increase awareness of the diversity of voices in the region. The program was initially inaugurated at the Museum of Modern Art, Doha, and has since been expanded to the Zaatari Cultural Center, Doha, and the AlUla Cultural Center, AlUla, and the AlUla Art Museum, Doha. The projects will target the descendants of migrant workers, students,", "The next Biennial should open in 2020. The next edition will take place in the eastern city of Düsseldorf, Germany, and will run from March 19 to March 21, 2021. \n\n\nThe Metropolitan Museum of Art (MoMA) in New York has hired Scott Mullins as director of the Minneapolis institution. Mullins will be responsible for organizing the museum’s five-year centennial celebration and for providing oversight for an expansion of the museum, which is currently undergoing a $1.5 billion expansion that will add a theater, classrooms, and more galleries.“We are thrilled to welcome Scott to MoMA,” said David Senator, the museum’s board president. “He brings an exceptional track record of success, having organized numerous exhibitions at the Minneapolis Institute of Art (MIA), including the fourteenth, ‘The Art of Disassembly’ (2019); “Paintings in Memory: A Centenary Celebration of the Art of Painting” (2017); and “To the Future: Modern Art in the Twenty-First Century” (2016).Mullins previously served as director of the Metropolitan Museum of Art in New York, where he oversaw a retrospective of photographs by", "The next Biennial should include an exhibition of biennial works by women artists, whose work has yet to be presented, and a presentation of biennial readings. The next edition of the Art in Motion biennial will be held at the O2 Academy in London (O2BA), and the first biennial to see the light of day will be held in the town of V, near the site of the infamous Nazi concentration camp, Birkenau, in September 2020.According to the London Review of Books, the 2018 edition of the Biennial was marred by a “sensationalist” climate change protest, a controversy over a work by an American artist who painted a life-sized rendition of the former British Royal Navy ship, the HMS Queen Elizabeth, in the Thames, and a “juvenile” display of drawings by three dozen juvenile artists, including two by Lucy Laudel, Alex Pappas, and Laura Owens.In a letter to the biennial’s organizers, Bertrand Russell, the chair of the board, said: “We are deeply concerned about the evolving climate of disruption and fear that climate action has caused. We hope that this year’s edition will be a window through which", "The next Biennial should be an international event,” said director Petra Kalogera. “We are working hard to present the best museum design in the world, and I look forward to seeing how many visitors will finally be able to experience the events of the past year in Eindhoven, and in museums where we have already invested in the development of the Biennial.”Last year’s exhibition “Firsts: Contemporary Art in the Age of Black Power” was held in Seoul and was chosen as the theme for the upcoming edition of the Biennial. Nominations were submitted by more than one hundred artists, including A.J. Hammond, Alan Shepard, Anthony Naimark, A.L. Benitez, Alberto Orel, and Angel Gabaldon. \n\n\nThe French Ministry of Culture has decided to withdraw the entire collection of the CNEAM museum in Paris from the Paris Peace Museum. The move follows months of protests against the institution, which was established in 1986 to protect the historic city of Louvre and the Louvre Palais de Tokyo, from the French government over its expansion plans. The move was made in protest of the ministry’s", "The next Biennial should take place in the autumn of 2022 to coincide with the centenary of the outbreak. “The problem is that, for a number of reasons, we are not able to move forward with the festival—its own programming, its exhibition programmes—and the exhibition programme itself is almost entirely missing,” said Milan-born curator Carlo Cipolletta, whose work is housed in the Biennale’s permanent collection. The exhibition is currently on display in the Italian museum, and will reopen in September.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has announced that it is restructuring its current exhibition “The Future Is Present,” which suspended its first edition “The Future Is Now” last spring after it was vandalized and set on fire by an unknown assailant. The exhibition, which followed New York’s Guggenheim and Museum’s Fallen Garden, was set to reopen on October 22. “The initial plan for the exhibition was to stage a new work by artist Michael Richland, but circumstances necessitated postponing the installation and reopening the exhibition,” said Hirshhorn director Megan McDonough", "The next Biennial should be held in 2020.  The Walt Disney Company, which owns the rights to the character Mickey Mouse, has long opposed the exhibition, insisting that it would hurt their business. In June, Disney withdrew its sponsorship. The American Alliance of Museums has also spoken out against the event, and in July, the organization withdrew from a major New York art fair. The organization’s board chair, Daniel H. Weiss, said that the move was not related to the protests over the years, but that they had been working on ways to move the exhibition forward. He also said that the decision was made because the fair would not be able to secure a new partnership with Disney. The Los Angeles County Museum of Art (LACMA) has also come under scrutiny for its embrace of Disney, which donated $1.2 billion to the institution in the 2017–18 fiscal year. As a result, the museum became the latest institution to pull its money from the Walt Disney Company. The New York Times reports that the LACMA’s board president, Michael Knapp, refused to renew the museum’s contract with the corporation, citing a disagreement with the company’s payment policy.", "The next Biennial should be held in 2021.\n\n\nPorto Alegre, Brazil, has declared a state of emergency after a series of fires that broke out in the city of Porto Alegre, on the state’s southern coast, on December 22, 2017, began as man-made and were deliberately set. The fires, which are still not fully contained, have destroyed at least fourteen structures and caused as many as one hundred thousand people to be displaced.Founded in 1888 by the Portuguese architect Zico Rodrigues, who also designed the structures of the city’s government buildings, this is the second major fire-related disaster to hit Brazil in as many years. In 2017, the region was hit by a massive tropical depression and fire swept through nearly every building that wasn’t destroyed by a structural failure. The fire also ravaged the capital, Porto Alegre, which has a population of approximately one million, and resulted in thousands of people being displaced.In order to determine whether the fires originated in the sewage plant and involved industrial waste management, the fire service has been working with experts from the city’s environmental protection agency, the Municipal Secretaria da Terra, to study the environment and to identify structures that", "The next Biennial should focus on the consequences of climate change and its impact on culture, and should include a discussion of the writing and artistic process as well as the exhibition and public experience of the exhibition.”Observatoire de Paris follows the Paris Climate Action Summit, which was hosted by the Central Council of the Louvre until it closed in December, and is hosted by the Fondation d’Art Contemporain de Lyon. Inaugurating its twenty-first edition at the city’s Museum of Fine Arts, the grand opening coincides with the opening of the country’s first museum dedicated to ancient art, the Basilica de Vatican.The next edition will be held in November 2021 in the city of Lyon.\n\n\nThe Institute of Contemporary Art (ICA) in Vienna is moving its first exhibition dedicated to the work of Austrian artist Ekaterina Trifkowitz to the Bergen in the Helsinki Archiv on February 22, 2020. The exhibition will now be held at the newly renovated museum in November 2021. The show will include works by 80 artists and will be organized as an interdisciplinary project, involving some 50 artists and instituting a “new level of abstraction” to the works. The inaugural event", "The next Biennial should consist of a multi-disciplinary exhibition of work in the form of collaborations with artists across the globe, which will also include an open-air platform for audience participation. The new format will include an interactive experience for visitors and will include a rotating cast of writers, artists, designers, and other visual artists working in the gallery and in the art world.The portfolio of the fifteen finalists will be announced at an event in Tokyo on September 30 and will be presented in Tokyo next month. ​\n\n\nThe Egyptian Museum of Art (EMCA) in Cairo has appointed Ahmed al-Tayeb as its new director. He succeeds Hisham al-Hashemi, who was appointed director of the International Center for Islamic Art in Cairo in April. Previously, Tayeb served as head of the Egyptian Pavilion at the Venice Architecture Biennale in 2011 and as head of the Egyptian Institute for Contemporary Art in Alexandria in 2018, when he was appointed head of the Egyptian Museum of Art (EMCA).Tayeb said: “I am delighted to be the new director of the Egyptian Museum of Art. The museum has been under my direct and close supervision since I arrived from the University of Cairo in 2004 and I am proud to have made the", "The next Biennial should be held in May 2020, when the crisis in Ukraine is scheduled to end.  The first exhibition, titled Race to Save Humanity, will be on display at the Palazzo Magazzino in Venice in July 2020. The second, titled The Human Adrenaline Pump, will be on display at the 3rd Biennale in Basel in June 2021.  The third, titled The Future of Art, will be presented at the Museum of the Fine Arts, Milan in January 2022. The fourth and final, titled The Concrete Garden, will be on display in the Museum of Modern Art, New York in April 2022. Inaugurating the fourth Biennale in 2020 was a retrospective of American sculptor Harry A. Salt, Jr., who created the first artificial island in the Pacific Ocean to house the museum. The island was completed in 1983 and consists of forty-seven glass spheres, each containing a Harry A. Salt sculpture.Salt’s sculptures, which are featured in the exhibition “The Concrete Garden,” were made in response to the architectural designs of the Biennale, which were made up of thirty-seven sculptures and a massive ship", "The next Biennial should be held in New Delhi in 2022 except for a few short months, when it will be moved to the National Art Museum Mumbai. The organisers have also informed the National Art Gallery of India that the 2019 edition will be held at the collection’s largest museum in Delhi, which has been renamed the National Art Gallery of India (NAGO).The exhibition, titled \"'Lineage: Art in the Age of Jawaharlal Nehru’s India’s Century,” will showcase Narendra Modi’s curating of the exhibition which will focus on historical events, including the defeat of the British in the First World War and the transition of power from British to Indian rule. The biennial was organized by Narendra Modi at the Centre for Contemporary Art, Mumbai, under the initiative of the National Art Gallery of India (NAGO) and will run from January 25 to February 29, 2021, the institution’s largest exhibition space in India. “It’s a historic event,” Narendra Modi said, speaking about the biennial, which will mark the centenary of the Indian centenary. “I’ve been following", "The next Biennial should have the capacity to present an exhibition of the work of a single exhibition, with the exhibition being organized by the artist as a whole. It should be a space for the exchange of ideas, to which the artist will invite the audience. The theme of the biennial should be “Performing Art: The Next Five Years” and should be selected by Chris Arena, the curator of contemporary art at the Diagon Center, in partnership with the artist, the author, and the curator of the biennial, John Elway. According to a release, the three finalists will now be announced. The exhibition will be staged at the Diagon Center in partnership with the artist’s Constructivist husband, the Dutch-born, Seattle–based architect Erman and his wife, the architect Jürgen Otto; at the Seattle Art Museum; and at the University of Washington in Seattle.The exhibition will be announced soon by the artist’s representative, Olivier Assayas, in Los Angeles. In September, the artist’s representative said the Biennial was “an attempt to take up the question of what was next after art,” but “it is not a question of what is already", "The next Biennial should open in August 2021, and the first in October 2022.”The 3-D-printed bionic arm, developed by the Swiss company Wyss, is not the only artificial limb being created by the company. With the help of a team of engineers led by Prof. Wolfgang Lüth at ETH Zurich, a team led by the German designer Markus Blom at the University of Bonn, and a team led by the Swiss artist Wolfgang Lau, the company created a 3-D printed arm for the musician Pearl Jam. “These three technologies are merging to create the first bionic arm,” the artist and cofounder of Pearl Jam, Pearl Canyon, Jamison, and the New School, wrote in a statement.The bionic arm will be powered by a bi-metal battery and will have a range of up to six kilometers. Its next iteration will also include a breathing apparatus that will allow the user to stay connected to the other arm. The device will be able to be inserted into a patient’s arm, and will have a 360-degree camera that will help the user navigate the world by using images from the camera. It will also be able to capture and store images, videos, and other data", "The next Biennial should be held in 2020 and will be on the occasion of September 19–September 22, 2020. The 2019 event, which was included in the 2020 edition, was held in Syracuse, New York. The biennial was also given a retrospective in 2020 and a curated exhibition in 2021.The 2018 biennial featured work by Anna Atkins, Mark Davis, and Olu Ose, among others, as well as works by Carol Davies, Toni Morrison, and Carlo Rizzoli, among others. The biennial was organized by Dale Davis Gallery with artworks by Cara DeMille, Lois Erickson, and James Cuno, among others.\n\n\nThe Frankfurt-based cultural center that has championed the city of Frankfurt, Germany, as a vibrant cultural nexus for more than sixty years, the Frankfurt Biennale, has announced that it will close permanently in April of 2020. Its fall exhibition, “Frankfurt,” will remain on view through April 8, and the monthlong event will be followed by a combination of events including the Frankfurt Art Museum (FUM), the Nationalgal", "The next Biennial should be staged at a location that has a large collection of the artist’s works, as well as the capacity to house the exhibition. The new exhibition, “Unfinished Business,” will be curated by artist-run organization Rineke Dijkstra and will run from March 22 to March 26.The second biennial, “From Spring to Autumn,” will be staged in the winter of 2019–20. The exhibition will showcase the work of thirty-six artists and will invite them to Berlin for an evening of talks and presentations. In preparation for this year’s biennial, the artists will collaborate with and present artworks by contemporary artists such as Alan Seroussi, Hélio Oiticica, Hannes Solm, and Alex Sanchez, and will stage at least three exhibitions in the coming months.The third and final exhibition will be “The Situationists.” The exhibition will focus on the early twentieth-century avant-garde, which aimed to merge surrealism and surrealism. The group will include Vilde Sørensen (1936–1947), Herbert Singer (1958–1968), Stefan Frank (1927–1968), and", "The next Biennial should be held at least five years after the date of the first edition.”\n\n\nThe J. Paul Getty Trust in Los Angeles announced today that Jack R. Guggenheim Museum curator and former dean of the School of the Art Institute of Chicago Andy Milner will become the next curator of the Museum of Modern Art (MoMA) in New York. Milner will take up the post on February 13.“In his new role, Andy will strengthen MoMA’s relationship with the Getty Museum by bringing unprecedented breadth and depth to its encyclopedic collection, by championing transformative exhibitions, and by connecting the Museum’s two locations, ensuring the Getty’s expertise is integrated into MoMA, and by building on the trust between the museum and the Getty,” acquisitions director Adam D. Weinberg said in a statement.Milner comes to the institution from the Getty in September 2019, where he has served as deputy director of curatorial affairs and curator of contemporary art since 2018. During his tenure at the Getty, he curated “Last Days: Modern Art in the Last Days” (2019), “Wangechi Mutu: A Fantastic Journey” (2019)", "The next Biennial should take place in 2021. The exhibition will be centered around the exhibition of Porchestra’s contemporary art as well as the exhibition of work from the artist’s previous exhibitions. “The exhibition of the work that is currently in the exhibition will be an opportunity for the audience to see new works in their immediate environment,” Pascal Thierry, the president of the biennial, told the Art Newspaper. “The future of the exhibition is to be decided by the artist. We will have a new exhibition in 2022.” The president of the biennial, Comte de Montlaur, added that the new venue will be “at the heart of the Biennale,” which he described as “a mission of the Biennale Central,” and will serve as a “virtual reality space,” a metaphor for the biennial’s future.\n\n\nAfter the two-year-long trial run for a new creative class offered by the Museum of Fine Arts (MFA) in Boston, Massachusetts, where Becca Raven-White is currently working as an associate curator, a group of artists who collectively call themselves the Bang, including Adam M", "The next Biennial should take place at a location that is accessible to the general public. This could include a library, a museum, or a school.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed John Nolen as its next executive director. Nolen will be the first African American to lead the museum since Craig Unger, who retired in January 2019, in charge of the institution for sixteen years. He succeeds Gerald Celente, who will remain involved with the institution for a further eight years.“We are extremely pleased that John Nolen will be the next director of MoCA,” said Andrew Goldfarb, chair of the board of trustees. “The past four years have shown that he is a leader who understands and champions the unique mission of MoCA, having led its transformation from a private museum into a public cultural destination with a dedicated staff and visionary artistic director. We look forward to working with him as he adds his expertise and vision to our growing collection and grows our museum.”Now in its seventh year, MoCA’s annual Biennial of Contemporary Art, “Outsider in Paris,” was suspended in November 2019 because of the Covid-19 pandemic,", "The next Biennial should aim to move beyond a “one-dimensional” portrait of the artist to a more inclusive and multi-layered exhibition. The project should also include a “contemporary perspective of the artist’s life in a contemporary context,” said Yaron Ben-Menashe, director of the Museum of Modern Art. \n\n\nAmerican Folk Art Museum, a major supporter of more than eighty American artists that is located in the old munitions plant in downtown Quincy, Massachusetts, has received a $10 million donation from the Charles and Lucille King Family Foundation. Established in 2007 by the Kings, who were longtime supporters of the museum, the $11 million gift will make up for a shortfall in the museum’s endowment due to the death of founder Henry Luce. The gift also supports a number of other initiatives, including the collection and exhibition of works by Norman Rockwell and Richard Anuszkiewicz, as well as the development of the American Folk Art Museum Collection and its collection of historical works.“The purchase of Luce’s paintings, sculptures, drawings, and prints means that these works will be in the museum in perpetuity and that American Folk Art Museum has an", "The next Biennial should be a transformative experience for all of us,a time for collaboration and collaboration of all kinds. It should be an opportunity to see the work of artists and to discover new ideas. It should be a celebration of the world we live in and a reflection on our own interconnectedness.”Afterwards, the exhibition will be open to the public for free admission through the Museum, which has been under renovation since 2008. The exhibition will also feature works by solo artists who are not represented in the Biennial’s collection; selected works by known and unknown artists; and a special exhibition of works by the Runaway Children’s Artists Collective.“The Runaway Artists’ exhibition is an important step in the revitalization of the museum and is an affirmation of the work and vision of the Biennial’s curators,” said museum director Elizabeth Strasser. “The exhibition is a reflection of the extraordinary breadth and depth of the Runaway Artists collection and is a hallmark of our rich and longstanding program. The activation of the artwork of Runaways is a powerful signal of the many people and projects that are being fostered by artists and curators at the Museum.”\n\n\nThe Museum of Fine Arts", "The next Biennial should showcase the work of the newly established artists who are currently in the process of graduating. “The new institutions also include a new venue for the exhibition of works by emerging and established artists, as well as a new platform for the promotion of works from the exhibition. The biennial will begin in March 2019 and will run for twelve weeks.”\n\n\nThe Museum of Modern Art (MoMA), the Museum of Art, and the Whitney Museum of American Art will begin closing down temporarily while they complete their construction projects, in an attempt to reduce the environmental impact of the controversial MOU between the institution and the city of New York. “We are committed to working with local, state, and federal governments to address the environmental and health impacts of our construction projects, and this process will continue in consultation with the community,” said Michael Govan, president of the institutions. The MOU, which was signed off on by Mayor Bill de Blasio in 2017, requires that half of the city’s public housing projects, including public safety, schools, and hospitals, be converted into rental housing for artists. In order to make room for the artists’ studios, six of the city’s existing City Hall", "The next Biennial should be held in the spring of 2022. The organization will announce the dates and locations for the event in the coming weeks.\n\n\nThe Museum of the City of New York has announced that it will introduce a new and upgraded version of its iconic free admission museum at Broad and Broad Street in Manhattan. The museum’s new pavilion, scheduled to open in the spring of 2022, will include a new collection of thirty-six works by artists from the Metropolitan Museum of Art, including Thomas Ligotti, Marcel Proust, Laurette Desmarais, and Willem de Kooning.The museum will also re-envision its existing building, which opened to the public in 1964, as a museum dedicated to the history of New York, and the building and grounds will be renamed. The museum’s inaugural biennial will be held between April and June of 2022.Museum director Tim Mariotti said: “We are thrilled to be able to present new works by artists whose work we have long admired and by artists whose work we have never encountered before. We have created a new pavilion to reflect this vision. Unlike our original pavilion, this new pavilion will be a true destination for"]