["The next Biennial should highlight the work of the National Council for the Arts (NCA), which has overseen the exhibition program since 1995, and future plans to participate in the prestigious Art and Architecture biennial. Inaugurating the National Gallery of Art, the Museum of Modern Art, and the Metropolitan Museum of Art, each year the National Council for the Arts will host a retrospective of an artist-made work. In 2020, the NCA will present a new exhibition of works by artists such as Anna Atkins, Walter de Maria, Robert Irwin, and Richard Serra. Atkinson, with her hand-drawn and movable works, is known for making works that are both reflective of and deeply personal to her surroundings. Her work is often found in museums, where it is studied and appreciated by an international audience. In a 2017 interview with Artforum, she said: “I am very much a participant in what I do,” adding that she usually works alone.\n\n\n\n\n\nMarcus Aurelius, SculptureCenter, San Francisco, California: The artist, who made many of his sculptures using only his hands, died on February 2 at the age of eighty-eight. The cause of death was exposure to", "The next Biennial should take place in 2022. \n\nIn the wake of the massive wildfires that have swept through the western United States, California, and the nation as a whole in the last few weeks, the Board of Directors of the Museum of Contemporary Art (MoCA) has agreed to split into two entities, the Museum of Modern Art (MoMA) and the Los Angeles County Museum of Art (LACMA). The move will allow for a $200 million boost in funding for both museums, which are currently closed since the devastating blizzard. The deal also resolves the long-standing feud between the institution and the Los Angeles County Museum of Art, which was sparked by a misunderstanding over a painting by artist Frank Gehry that was recently sold by the LACMA museum.The Los Angeles Times reports that the agreement between MoCA and LACMA will allow the stores to maintain a presence in the city in collaboration with the California Institute of Technology (CalArts). The LACMA museum will remain open and be able to host regular events and events, but it will only have an incubation center, and its outdoor spaces will be divided into two buildings: the museum will remain in the city, and LACMA will continue to", "The next Biennial should be held in September 2021. Rosenbach will take up the post in April 2022. The work will be curated by the American architect Frank Gehry and will be presented by the architect in collaboration with the São Paulo-based collective Pérez Artes, who will act as the exhibition coordinator and will receive seed capital from the museum. The residency program will also receive $1.5 million, which will be shared equally between the architects and the biennial. The biennial will work with the artist-in-residence, the artist-in-residence’s spouse, and the artist’s children. When asked about the role of the artist-in-residence in the development of the project, the museum’s director, Dario Catellani, said: “We are creating a platform to give the artist a platform to experiment with new materials and new technologies. As we work together to fabricate a new ecosystem that can support and preserve the works of our artists, the museum and the public, I am sure that we will find ways to support the artist and the community.”\n\n\nThe Art Newspaper, the London-based art journalism publication, has released", "The next Biennial should be on February 18th. The act of giving is the essence of the ceremony.\n\n\nGreek artist Giannakoula, a prolific painter and sculptor who experimented with the physical and the symbolic, died on November 27, 2020 at the age of eighty-nine.Born in Karis, near the northern city of Kynosia, in Crete, in 1903, Giannakoula moved to Athens in 1954 at the age of fifteen. After receiving his degree from the prestigious Polytechnic University in Athens, he went on to study at the prestigious Aristotle University in Athens, where in 1968 he published the exhibition “In the Image of the Spanish Civil War” at the Athenaeum. That year, he also received the Presidential Medal of Honor, which was established for the second time in 1975.Giannakoula’s work has been exhibited at the Fifty-Third Venice Biennale (2006), the Fifty-Fourth Venice Biennale (2008), and the Fifty-Fifth Venice Biennale (2011). His work is currently housed in the collections of the Museum of Modern Art, the Museum of Modern Art, the National Gallery of Art, and the Royal Academy of Arts.", "The next Biennial should take place in 2019, the artist said. “I was even more surprised to receive the invitation to this year’s Biennial from the mayor of Brno. Since Brno is in the Czech Republic and not in the Czech Republic, the format of the Biennial is much more regional; therefore, a Biennial is a Biennial.”\n\n\nThe Museum of Contemporary Art (MoCA), Chicago announced today that it is preparing to welcome visitors back to the institution on February 19, 2020, following a six-month closure due to the Covid-19 pandemic. The reopening of the museum will coincide with the opening of the Detroit Institute of Arts (DIA), the newest undertaking in the Detroit Institute of Arts’s (DI) master plan, and will be marked by a new \"Imagination Zone,\" a larger collection, new performances, and new installations. “The museum is continuing to work closely with the Detroit Institute of Arts’s staff, the community, and the broader Detroit community to make the most of a difficult time. We are confident that once the six-month reopening period is over, the museum will reopen with a renewed sense of purpose and energy,", "The next Biennial should be announced later this month.The museum will also unveil a series of six new works by Italian painter Carmine Cimolino, a cofounder of the New York–based firm Cimolino Art and Architecture; he will receive an award at the ceremony that will also take place at the museum. Cimolino will be the first artist to win the $10,000 Prize for his first commission and will also be featured in a retrospective of his work, “Carmine Cimolino: So Far,” on view until January 27, 2020.The Biennial will take place at the Museum of Modern Art (MoMA) in New York from January 7 to January 8, 2020.\n\n\nThe Taipei Fine Arts Museum (TFAM) in Taiwan has announced that it will hold an exhibition dedicated to the culture of the Taiwanese diaspora in March 2020. The exhibition will feature a selection of monographs and publications by forty-eight authors and will be organized in collaboration with the Foundation for Contemporary Art (FCA) and will be hosted by the curator of contemporary art, Nan Yinhui-chiang.The exhibition will highlight and expand on the themes of “The Future is Dias", "The next Biennial should take place in 2022, at which point the museum will be closing its doors for a few months to allow the city of Chicago to complete its renovation of Lake Michigan. “The next Biennial is a new kind of city,” Richard Deitsch, chair and curator of the exhibition, told the New York Times. “It is a city composed of the individual and the community in parallel, of visitors and residents in one city, and a city with a strong sense of community in many communities. I’m sure the architects and designers of the next Biennial will see that Chicago is a city of many communities.”\n\n\nThe Heinz Museum of Contemporary Art (HFA) in Philadelphia has accepted a gift of two hundred photographs by David H. Koch and two hundred works from the artist’s American Renaissance exhibition, “American Renaissance: Art and Society” at the Artspace in the city’s East Village, which opened on September 4. The works will be on display in a three-day exhibition opening on October 14.Inaugurating the exhibition, which is part of the museum’s Center for Art and Space, are a series of two hundred photographs by the Mexican", "The next Biennial should take place in the fall of 2020. The visit to the museum will consist of a series of exhibition presentations, lectures, and other public engagements. The exhibition will include new works by artists from the following: Namaste Kutu, Namaste Bapu, and Namaste Bikash. The 2019 edition, entitled Mata Massey, was held at the museum. Other works selected for the inaugural edition were Kuko Takahashi’s The Light in the Sky (2015), with Yoko Ono, and Prince Harald II of Denmark’s Helsinki/Oolite Garden. The exhibition will be followed by a two-month residency in the museum. “I believe this is a moment of great change for the biennial, and one that will bring together a number of artists in order to explore new ideas and new ways of having a meaningful discussion,” said Elizabeth Hurst, chair of the board of trustees of the Biennial Foundation.For the 2019 season, the museum received more than three hundred awards, including a $112,000 prize for excellence in contemporary art and a $71,000 award for outstanding museum engagement.", "The next Biennial should take place at the Red Sea Academy, in the coastal district of Sakhnin, in Shandong province, in March 2022. The chronological order of the festival should coincide with the birthdays of the artists.In an attempt to accommodate the many cultures and languages that compose the region, the 2020 event will be held at the Sakhnin Institute of Art, a contemporary art center established in 1959 as a result of a merger of two local arts organizations, the Sakhnin Art Development Club and the Sakhnin Cultural Association, in an attempt to create a more interdisciplinary experience. The museum has also collaborated with local and international institutions such as the Japan Foundation and the Japan Society and will host the 2020 iteration of the Sakhnin Biennial in the Sakhnin Museum.\n\n\nThe Museum of Contemporary Art (MoCA) Hong Kong announced today that Riku Hasumi and Chiu-Hsin Huang will represent Taiwan in the upcoming edition of the Taipei Biennale. The Taipei Art Market will also feature works by artists such as Koki Tanaka, Tri-X, Tung-Min, and Yianni Wang. The exciting announcement was made at an event titled “The New World,” an inter", "The next Biennial should be held in the summer of 2020. \n Artforum has announced the winners of its five-year awards, which recognize excellence in photography and art. The awardees are: Joan Crawford, Kameel Saeed, Owen D. Higgins, Yelena Shagal, Yasmina Noor-Khan, and Kara Walker. The 2019 awardees include Evelyn Kenner, Kathryn Borthwick, Paul Graham, Slavs, and Wangechi Mutu.The 2019 awards were: Kameel Saeed, The Breathing Tree Theater, The Bronx, and Los Angeles. Joan Crawford, The Bay Area Museum of Art, New York, The Black Sheep, Paris, and London. Kara Walker, Artforum, and the Paine Webber Museum in New York. The Brooklyn Museum’s demonstrated commitment to its exhibitions and programming has been recognized by two Honoraries, Misa Cohen and Emil Kornbluth. For the 2018 honor, the museum partnered with the American Initiative on Art to celebrate its fifteenth anniversary. For the 2017 honor, the museum presented the", "The next Biennial should be held in Tokyo in 2020.\n\n\nThe New York City–based nonprofit Art Times, which is backed by the Richard and Marian Berman Foundation, announced today that it has added another twenty-five artists to its growing roster of supporters. The organization will award ten free tickets to American Jews for doing community service at the Jewish Museum over the next two years.The organization is also launching the Be Not a Problem Fund, a new initiative that will issue free tickets to New Yorkers who care about an artist. The first round of grants will be made in early 2022 and will invite up to fifty individuals to the museum each year. The fund will distribute seventy-five tickets to be given out in one of four ways: 1) to a friend, family member, or someone in need of a good time; 2) to a nonmember visiting the museum; 3) for a fee; or 4) as a gift.The next round of grants will be made in early 2022 and will be focusseding on the history of art and the Jewish experience in America. The grant program will be funded by the Berman Foundation and the philanthropist and philanthropist Martin Gilens, who has recently been named chairman", "The next Biennial should bring together groups of artists, musicians, and other cultural producers of North America to examine and reimagine the history of the Americas and the world. “Rather than celebrate a particular event, the inaugural event should be a vehicle for understanding the history and future of our continent,” said Doğan. The prize jury noted the importance of the work of the next installment, “The Promise of the Americas,” a sixty-five-minute video installation by the Brazilian painter and filmmaker Marcela Cavalcante.The 2019 prize jury consisted of the artists Wangechi Mutu, Nia Mpagi Sepuya, and Maria Pizzejn, the Japanese artist and director Takashi Murakami, and the Belgian artist Jean-Luc Godard.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has received a gift of twenty-six works by artist Janet LaBouvier. The works, which were acquired through a fundraiser in 2017, are part of a collection that includes works by artists such as Robert Irwin, Thomas Krens, and Kenneth Turr. The collection also includes works that were previously excluded from the museum’s online viewing rooms", "The next Biennial should be called a day of celebration, not a day of mourning. It is not for the uninitiated, for the bereaved, or for those who wish to claim that the exhibition had nothing to do with the tragic events that unfolded a day earlier. The exhibit should have been inaugurated by installing the National Geographic Signature Gallery’s iconic Eiffel Tower on the lobby floor, and then moving on to the National Galleries of Canada’s Exhibition Gallery, the Centre Pompidou, and the Louvre.The French government did not send any of the monies it claims were allocated to the festival by the new donors. Instead, French Culture Minister Franck Riester announced that the money would go towards “transforming France’s image through post-2015 research and cultural endeavours,” and the government said that the same amount would be spent on “education and culture.”\n\n\nThe Walker Art Center in Minnesota announced today that Leah Greenberg has been hired as its new associate curator of contemporary art. Greenberg will lead the museum’s exhibition program with a budget of $30 million and is expected to begin her tenure in August.“Leah is highly experienced and has been", "The next Biennial should be announced by the end of the month. \n\n\nThe Hirshhorn Museum in Washington, DC, announced today that it will begin hosting a biennial of midcentury American art in 2021. The exhibition will consist of a selection of work by thirty-four groups, including the Los Angeles County Museum of Art (LACMA), the Museum of Fine Arts (MoMA), and the Museum of Modern Art (MoMA), the center’s largest gathering space.The Hirshhorn said that it is committed to helping grant and preserve the collections of the thirty institutions that make up the Hirshhorn Museum, the museum’s sister organization in New York City. The biennial will begin in the fall of 2021 and will run through the end of the year.“The Hirshhorn has long been known for its commitment to supporting the collections of California’s leading arts organizations, including the Los Angeles County Museum of Art and the Museum of Modern Art, and for its commitment to the artistic legacy of the late art historian H.L. Menken,” said David Weigel, president of the Hirshhorn. “Now the Hirshhorn Museum will have a new chapter to its long", "The next Biennial should have been held in 2021, but that was delayed by the coronavirus. The 2019 edition, which was held at the Museum of Modern Art, in New York, opened on November 28.  In a statement, the museum said: “The new National Museum of African Art is dedicated to the legacy of Nelson Mandela, the first president of South Africa, and its exhibitions and research programs will introduce new audiences to his work, reflecting his greatness and achievements.”\n\n\nAs the coronavirus continues to spread in the United States, the New York City Museum of Art (NYC MoA) is preparing to reopen with a bang. Starting tomorrow, the institution will be fully staffed with eighty-five employees, including sixty-nine on contract, and will be open to the public from 11 AM to 5 PM. “We are working hard to reopen as quickly and safely as possible,” said Michael Govan, director and CEO of the institution, which currently employs around three hundred people. “The city’s artists, collectors, educators, and institutions have told us they expect a significant impact from the opening of the museum, and we are prepared to support them. We are gearing up", "The next Biennial should be held on the occasion of the centenary of the foundation of the European Community. \n\nInstitutions that receive funding from the European Commission are required to hold a series of formal and informal meeting and consultation sessions with the European Commission in order to receive funding. The meetings are meant to give the Commission an insight into the current state of the artists’ workflow. Currently, the Commission only offers grants of €500 to institutions, but the initiative is open to institutions that are eligible for up to €5 million.\n\n\nThe Museum of Fine Arts (MA) in Miami Beach has received a $500,000 grant from the John D. and Catherine T. MacArthur Foundation. The grant, which comes with a three-year commitment that is nonrefundable, will help the museum raise funds to remodel its building and expand the museum’s collection.The grant was awarded by Larry and Suzi Berrada to Matt and Suzy Bostwick, and Rebecca and David Zaslavsky. The MacArthur Foundation is a major supporter of the arts and has given $1.2 billion to museum organizations since 2000. In honor of the partnership,", "The next Biennial should be held in 2020. A subsequent exhibition entitled “The Thought Experiment: Conversations With Robert Irwin” will be held at the Museum of Contemporary Art in Atlanta in 2021.\n\n\nThe British Institute (BPI) announced today that it has voted to leave the European Union, vowing to follow the lead of Berlin and Paris and pursue an agreement with the EU’s institutions instead of the UK’s renegotiation of its relationship with the bloc. The decision means that Britain will leave the European Economic Area (EEA), the Common Agricultural Policy, and the General Agricultural Policy, and will rejoin the European Union in March.Prime Minister Boris Johnson, speaking at Prime Minister’s Questions in the House of Lords, said: “I think it is utterly clear that we are leaving the European Union. . . . The BPI’s pronouncements on these matters have no basis in fact or logic. We are going to follow the lead of Berlin and Paris, and we will seek an agreement with the European Union, as we have sought for years, in order to protect jobs and growth and to secure the future of our economy.”The BPI’s chief executive, Katja Jakob", "The next Biennial should be held at least once every two years. The 2019 edition, entitled “Peace and Holidays: What the Future Holds” was curated by the Austrian-born, New York–based curator Wolfgang Pfeifer and will run from May 17 to May 21. The 2020 edition, titled “The Future Is Present: The Art of Living with Peace of Mind,” will be held at the Art Institute of Chicago from April 19 to April 22.The full list of participating artists is as follows:Beth Bove, New York, USABin Mani, ThailandJi-Ko Cho, SingaporeTanya Garcia, MexicoCity Lights, New York, USAVincent Garrido, MexicoKaiming Goenka, New MexicoBénédicte de Saint-Germain, New MexicoCindy Huertas, MexicoKazu Lipp, New MexicoNikolay Maksim, RussiaYoshitomo Kato, JapanHiroaki Nakayama, JapanTanya Nara, JapanLinda Ramsden, New South WalesJamie Sexton, New South WalesMariko Saitoh, New South WalesCaitlin Rochat, New South WalesS", "The next Biennial should take place in Geneva in 2021 and will be hosted by the Museum of Modern Art.“The importance of the study of the personality is an essential ingredient of the exhibition ‘Radical Intelligences,’” Ross Grossman, the curator of the exhibition, told the Art Newspaper. “We are open to the idea that this is a project that might be more of a contest between two cultures—a contest between two people, rather than a contest between many cultures.”\n\n\n\n\n\n\n[Update: September 13, 2020]A distressed Artforum reader writes: “I am a professional art collector and have a one-hundred-year-old painting that has been missing. It has been stored in a room at my house and is perhaps worth $2 million. I have tried everything to find it, including going to every art dealer in the U.S., Europe, and Japan, but have found that most have no record of it. I tried to contact the seller several times but have been unsuccessful. My questions are: 1. Did the painting come into your possession? 2. Was it damaged? 3. How long has it been missing? And finally, why has", "The next Biennial should be held in 2021. The Artists’ Legacy Foundation has also announced that the twenty-fourth edition of the Twenty-Fourth Biennial will take place in 2022 and the twenty-fifth in 2023. The upcoming edition, “The Other Side of the Door,” will examine the legacy of the artist-intellectual with a view to uncovering the paths and the fundamentals of art, architecture, and the visual arts. The 2020 edition of the biennial, “The Weird and the Beautiful,” will be held at the Geffen Contemporary in Berlin from November 8 to November 8, 2020 and the 2022 edition will be hosted by the Nationalgalerie in Brussels from November 17 to November 19. In the former, the show will be inaugurated by an exhibition of work by the Berlin-based collective 1011. The latter will span three days and will feature works by seventy artists. The 2020 edition of the Berlin Biennale was organized by the Berlin-based nonprofit organization Porta and was curated by Birgit Buber.The twentieth edition of the Berlin Biennale, “The End of the World as We Know It,” will take place at the Walter Benjamin Museum in New York from", "The next Biennial should take place in 2021 and will be organized in collaboration with the François Charles Beaudoin Foundation. The ten artists featured in the new exhibition are: Alain Guiraud, Guy Debussy, Claude Monet, Henri Matisse, Amedeo Modigliani, Wolfgang Oehlen, Hiroshi Nagel, and Guadalupe Rosales. The exhibition will be inaugurated by a exhibition of work by the Czech artist Olga Škova.The exhibition will feature works by the following artists:\n\n\nThe MNA Museum in Los Angeles announced today that it is planning to reopen with a new exhibition of work by the artist-run collective Autocar in January 2021. The retrospective, titled Autocar: From the Earth to the Sky, will focus on the following themes: air and space, air and water, and air and fire. The show will be hosted by the nonprofit nonprofit program Art and Art, which is affiliated with the Museum of Modern Art in New York, and will be curated by William Gibson.“The MNA Museum is a mission focused on collaboration and community building that is driven by a deep sense of empathy and a firm sense of purpose,” said Gibson", "The next Biennial should be held in January 2021.\n\n\nThe European Court of Art has ruled that the British Museum in London is unlawfully blocking an artist’s repatriation requests, a move that has been demonstrated in a number of cases involving works in its collection that were acquired through forced transfers. The landmark ruling on October 21 follows a complaint by the artist Thomas Harris, whose body was discovered by the Museum of Contemporary Art (MoCA) in London on June 5, 1915, in a fire that also left four of his colleagues injured.According to the court, the institution failed to honor four successive requests for the exhumation of the artist’s remains, which were made by David Smail, the director of the Tate; Thomas Farrant, the director of the Courtauld Art Gallery in London; and James Fisk, the director of the Museum of Contemporary Art, London. Smail has since said that the institution’s refusal to acknowledge the requests was due to a “political appointee” at the museum.Fisk’s lawyer, Paul Mpagi Sepuya, said: “We are confident that now that the court has taken a real and hard look at this case, that Thomas Harris will", "The next Biennial should determine the location of the exhibition, which will take place on the second floor of the Biennial, and take place in 2018. Projections suggest that the show will be moved to the new museum in 2020. The first Biennial was held in 2012 and was organized by the city of New York under the leadership of architect Daniel Libeskind. The exhibition included work by forty-eight artists, including Samuel Botsford, Ian Cheng, Peter Doig, and Tanya Gersch, and was curated by the artist-in-residence, Sahar A. Farah, and the artist-in-residence, John Galloway.\n\n\nThe Museum of Arts and Design (MAD) in New York has appointed Alex A. Goldstein as its next director. Goldstein comes to the institution from the Design Center in Manhattan and will assume her post in January 2021. In her new role, Goldstein will oversee the institution’s redesign and expansion, which is projected to add nearly five hundred galleries and a thousand objects to MAD’s collection, and will spearhead the museum’s public programs.“I’ve been involved in this field for fifteen years, and I’m thrilled to see", "The next Biennial should be in May 2020 and will bring together twenty artists and arts workers in the central city of Dusseldorf, Germany, and twenty-five invited artists and arts workers from the nearby town of Baden, Germany. The five-day event will also feature a residency program and a series of public performances.The event will be held at the German cultural institution in conjunction with the biennial biennial, which will be held in collaboration with the local community. The artist-run museum will also host a series of exhibitions, including a “Art of the Night” exhibition that will feature works by thirty-four artists and will offer an immersive experience to visitors.The biennial will begin with an introduction by Bertrand Goldberg, a Brazilian curator who has worked in New York for more than twenty years and will conclude with a reception for artists on May 3. The exhibition, titled “The Triennale,” is slated to run until October 27, 2020. The full list of participating artists is as follows:Anton Kern, GermanyAmanda Carlstrom, DenmarkAmelie Carlstrom, DenmarkAmir Khan, IndiaAmira Abdurraqib, IranAngha Benegal, LibyaChristopher Ellis, EnglandCher", "The next Biennial should take place in 2021. The biennial will comprise of thirteen exhibitions , including a retrospective of work by artists with whom Laura and I have a long-standing relationship; a solo exhibition by Vito Acconci, who will have his first solo show in the United States in 2022; and the biennial will open with an exhibition of work by Henryk Małkowicz, who will have his first public exhibition at the Biennial in the United States in 2020.\n\n\n\n\n\n\nFiled under: Modern Art, Trisha Brown, 2013,  New York, NY, Taylor & Francis, New York, NY, 2017, New York, NY, 2018, New York, NY, 2017, New York, 2018, New York, 2017, New York, 2018, New York, NY, 2017, New York, 2018, New York, 2017, New York, 2018, New York, 2017, New York, 2017, New York, 2018, New York, 2017, New York, 2018, New York, 2017,\n\nFiled under: Slab Museum of Art, Atlanta,", "The next Biennial should focus on the history of ethnography, with a particular focus on African art from the nineteenth century to the present day. The discussion may include the idea of “ethnicity as a self-organizing network of histories,’” the exhibition will also stress that “the artist and the audience are always the subject of the work.”While the Biennial’s 2017 edition featured a number of exhibitions that made wide-ranging contributions to curating and educational endeavors, the entry of new works by artists such as Susana Pilar, Cécile B. Aguera, and Ruba Gomes, among others that were presented in the exhibition are decidedly political in their form and vision.The exhibition will rise alongside the city’s Centro de Arte de Madrid (CAAM) in the Santa Teresa Theater on October 7, and will conclude with an exhibition of works by artists such as Kader Attia, Ashley Walker, Tony Abbott, and Angela Pate, among others that are represented in the Madrid Biennial Collection.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has finalized a long-term deal with the Yemeni artist Omar AlSaadi. The artist, whose", "The next Biennial should take place in the decaying, dilapidated, and leaky Art Nouveau building in the capital. The building, which was built in 1906, housed the estate of the late president Alexander Aleksandar. The biennial will be a joint venture between the museum and the city. The city is funding the project through a $1.2 million grant from the estate’s estate, and the biennial will take place in 2020.“In memory of the past and for the future, we are going to treat the estate with respect and we are going to show the collection and exhibit works in the exhibition, and we are going to organize a great exhibition,” said Aleksandar’s widow, Frida Kahlo.The biennial will aim to be a “bridge between the older and newer art world.” It will also include modern and contemporary art, and will focus on the legacy of Aleksandar. The last exhibition of the biennial, “Alexander Aleksandar: The Legacy of a Modern Man,” opened at the AstraZeneca Museum in Milan in June.\n\n\nThe Library of Congress in Washington, DC, has awarded the public-", "The next Biennial should take place in late 2021 or early 2022.\n\nAfter months of protests, the Cannes Film Festival board on Sunday suspended the event, which had been scheduled for March 9–March 11, for one day, April 1–8. The event was originally put on hold for two weeks to allow the festival organizers time to restructure their event around a new format and new creative platform, but the postponement also meant that the 2020 edition of the festival would be canceled.The board made the announcement after Director-General Olivier Assayas and executive committee member Marion Marechal-Bradfeuille of the Paris-based organization Code Pink submitted a letter to the organizers of the annual event, signed by more than fifty artists, activists, and writers, denouncing the decision as unjust and in contradiction with the festival’s mission.“The Cannes Film Festival is a festival of art, a community of artists and filmmakers, and the community at large, a festival of stories and a community of ideas and it is in a way a reflection of our time,” the letter read. “We reject the board’s decision as a breach of the festival’s promise to create an open dialogue between the board and the", "The next Biennial should have been held in late January, but due to the coronavirus outbreak in Japan and the resultant high number of cases in China, the exhibition was moved to March 29–April 3. The exhibition will now be taken over by the National Museum of Fine Arts, Beijing. The event will be inaugurated by a retrospective of the artist and poet Hiroshima: “Eleanor and Weeku Wai: The Last Man in the World” which will open on January 30. The exhibition’s illustrator, the artist-philosopher and writer Yasuhiro Takemoto, will serve as the keynote speaker at the event. The event will be held at the National Museum of Fine Arts Beijing from February 26 to February 28. The Taichung Biennial is currently running from March 3 to March 5. \n\n\n\n\n\nArt historian, critic, and curator Robert Rauschenberg, who opened up a new space of his in 2016 to carry out research and curate in the United States, will soon take over the Hirshhorn Museum and Sculpture Garden, the National Gallery of Art, and the Smithsonian American Art Museum in Washington, DC. He will be succeeded", "The next Biennial should be held in 2021 and the final in 2022.\n\n\nThe National Galleries of Scotland are planning to open a new twenty-four-hour museum, titled the National Museum of Scotland, in the city of Glasgow, at a cost of £1.2 million. The museum is being built by the Scottish firm Gendersmith & Chilson (SGCC), in partnership with the Glasgow-based developer T.J. Robertson, and will be located in the former National Gallery and Museum.The museum will house more than 1,500 objects from the National Gallery, which closed in 1974, the National Museum of Scotland, which was founded in 1951, and the British Museum. It will also include a restaurant, a gallery, and an educational center.“The building of a new National Museum of Scotland is the next stage in our ambitious plan to modernize and transform the National Gallery and Museum,” said National Museums Scotland director Elizabeth Ann Macgregor. “I am truly excited by this opportunity to build on the foundation of the National Galleries of Scotland and of Scotland’s seven-thousand-piece collection, with a new collection and a new exhibition. I will be a proud member of the National Gallery", "The next Biennial should be in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced that it has hired Sean D. O'Donnell as its new deputy director and chief curator of contemporary art. He succeeds Gerald Thomas, who retired in May after eighteen years at the museum.“Sean’s proven experience, breadth of experience, and dedication to curating and thinking about art make him ideally qualified to lead the next iteration of the Museum of Contemporary Art in Los Angeles,” said director Richard Armstrong. “We are extremely excited to have Sean at the institution. We know he will be a boost to our curatorial and exhibition program and to our audience relations as we continue to grow the museum’s international reputation.”Prior to joining MoCA in 2007, O'Donnell was a curator at the Brooklyn Museum and soon became the museum’s deputy director. In 2012, he became director of the Metropolitan Museum of Art, and in 2017, he was named the next president of the Metropolitan Museum.Prior to joining the museum, O'Donnell taught art history at the University of Pennsylvania from 1995 to 2001, and at the University of North Carolina from 2001 to 2008. He then worked at the Museum of", "The next Biennial should take place in 2019.”The second Biennial will be held in 2020. \n\n\nThe Taormina-based nonprofit the Mediterranean Foundation (MMF) in Italy has awarded the Renaissance site of the town of Palazzo delle Papesse in the Adige region of Naples a $30,000 grant. The organization also announced that it will spend an additional $10,000 on privacy and security measures.The grant—which was awarded for activities that’vehemently questioned the medieval site’s historical authenticity—involves archaeological excavations at the site dating to the fifteenth century, and is one of the largest in Italy. The site was chosen for its proximity to the Piazza della Scala and the historic port city of Venice, as well as its status as a major cultural and commercial center.“Palazzo delle Papesse is the perfect site for the 2019–20 season, and this year’s theme is the future of art and the Mediterranean,” said director Stefano Giunta. Giunta said the grant comes at a crucial moment for Italy: the government is considering revising the country’s antiqu", "The next Biennial should take place one year after the completion of the first, with a view to a 2020 staging. The biennial will also include a programme of exhibitions and events that will reflect the political and social and cultural traditions and the history of the city, as well as a programme of research and discussion that will engage with the current and future state of the Biennials.The announcement of the 2020 event, which will run from September 19 to September 21, coincides with the institution’s annual September 10-11 Arts Festival, which will be held at the Pier. Namdi Didi, the founder and chairman of the company, said: “We are very excited about the programme being presented to the new generation of Biennialists. The exhibition will be a reflection of the city, a celebration of its rich and diverse history, with a view to a future date of a biennial that will be transformative for the city.”He added: “We have always believed that a true biennial could not be conceived of without a strong philosophical underpinning of the history of the city and its people, and this biennial will be a clear affirmation of this belief.”\n\n\nThe Museum of Contemporary Art (MoCA),", "The next Biennial should be held in the Summer of 2021. The long-term goal is to open an Office in the museum to support the museum’s collection, research, and interpretation programs. Previously, the museum has presented its collection at various times as a gift to schools and local communities through the National Council for the Arts, the National Endowment for the Arts, and the National Endowment for Cultural Heritage. \n\n\nThe Hirshhorn Museum in Washington, DC, has appointed Jonathan A. Max as its next curator of the arts. Max first joined the Hirshhorn in 2016 as a curator of American art from the twentieth century. His curatorial projects include “The American Study Group,” a show of works by American and European artists, in 2016, and “Voices: American Artists Speak Today,” a symposium of artists from the Hirshhorn’s collection in 2018.Max will begin his new role by spearheading the Hirshhorn’s efforts to advance its exhibition program, connect with local audiences, and increase the volume of art it presents. He will also oversee the Hirshhorn’s renovation of its building, its expansion of its community outreach program, and its hiring of", "The next Biennial should be held in late March. Jan-Mar is better, but Biennial of Unseen will probably open in mid-March. The New York Museum of Modern Art, which recently announced that it will close its doors on March 29, has pledged to continue with its March 29 opening. The National Gallery of Art is planning to hold a March 21–March 23 exhibition dedicated to the history of art. The March 28–March 31 opening of the Biennial of the American People is also being revised to address the fallout from Covid-19.The March 14–March 17 exhibition “Baskets of the United States,” featuring works by nearly four hundred artists, is being relocated. The Venice Architecture Biennale, which will take place from March 13–March 17, will now take place from March 16–March 21. The Venice Biennale will also include a retrospective of a work by a group of American artists that is currently on display. The seventy-ninth edition of the Venice Architecture Biennale is currently on view in the Italian city of Venice. Art in the City is organizing a fundraiser for the Venice Children’s Museum and will donate 25% of the proceeds", "The next Biennial should take place in 2022, at an estimated cost of $100 million, and will draw about six hundred artists, including Damien Hirst, Hauser & Wirth, and Konrad Lorenz, as well as two hundred scholars and activists, including John Michael Greer, Malcolm MacKinnon, Milena Berger, Jorge Beresford, and Naomi Klein.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed David K. Williams as its next executive director. Williams, who has served as the museum’s senior curator of modern and contemporary art since 2015, will assume his responsibilities in January 2021. “David’s a compelling curator who has been instrumental in shaping the museum’s artistic vision for more than two decades, and I’m eager to work with him to help shape the next generation of leadership at the MFA,” said MFA director Richard Armstrong. “As we look to the future, David will strengthen the MFA’s curatorial team by emphasizing an open and collaborative environment while recognizing the importance of public engagement and community engagement in the museum’s mission.”Prior to joining the MFA", "The next Biennial should be held in 2020, during the first phase of the construction of the museum. In June 2020, a new exhibition, “Papaya Garden: Papaya in Sitka” will open in the museum. The exhibition will focus on the history of the island and the surrounding area. It will also include a new collection of ancient Korean objects, a restored ancient settlement, and a new kinds of permaculture. The museum will also be preparing to open a Pueblo-like museum that will be housed in the museum. The opening of the museum coincides with the opening of the new exhibition “The Past, Present, and Future of Southeast Asian Art.”The American National Biennial will organize its fifth edition in the United States in 2021. The 2019 edition featured work by forty-two artists, including Christo, Heaven, Andheles, Moggi, Tanya Sassen, and Zoya. The museum will also host a retrospective of the work of thirty-six artists in 2020. The exhibition will include twenty-six new works by thirty-two artists from the United States and Brazil, under the direction of Andrea Graziani.The first round of artists selected to represent the United States in", "The next Biennial should be held in 2021, and the fall of 2022 will be the year of its reopening. The project, dubbed The Labyrinth of the Future’s birth, will be open to the public from January 21 to January 24. The exhibition will arrive at a time when the number of visitors to Europe’s third-largest art museum has slowed considerably. The Frankfurt-based think tank Artforum estimates the number of visitors will be down almost 60 percent by the end of 2020. “The exhibition and the project have been a success,” said F.J. Heydt, director of the Frankfurt Art Museum (FAUM). “We are delighted that the exhibition will be able to rise to the occasion and to attract new audiences to the FAUM. The show will not only have a meaningful impact on the museum’s collection but also on the exhibition’s future plans.”The development of the project followed a year-long campaign by the artists, the academics, the curators, and the activists to pressure the museum to divest from the pharmaceutical company Novartis. The activists presented posters, held events, and wrote letters to museums, institutions, and corporations in an attempt", "The next Biennial should be held in 2021 and will take place in the city’s Punta de Corea (Pueblo de Corea), in the city of Navarra, in the state of Rio Grande do Sul. The exhibition will include work by seventy-four artists, including Amy Anagnos, Linda Barer, Simón García-Alarcon, Fernanda Németh-Santiago, and Perla De Sousa.“Biennial 1 is a great example of the important contribution that indigenous artists have made to the development of contemporary Latin American art,” said José Carlos de Zepeda, chair of the museum’s board of directors. “The agenda for this year’s Biennial 1 includes a number of initiatives that reflect the spirit and the studies of the past. We hope that this exhibition and the future of the Biennial 1 will be indicative of the vitality of the city of Punta de Corea and the impact indigenous artists have had on integrating art and culture into the lives of the Rio Grande do Sul people.”\n\n\nThe Institute of Contemporary Art (ICA) in New York has appointed John D. Gember, the cofounder and current director", "The next Biennial should be held in 2022, with the inaugural edition currently underway.  Commenting on the initiative, Ms. Edmonds said: “My years as an artist-activist have been an incredible journey, and as a result, I am deeply honored to have been selected to create the final edition of the Biennial. My vision for this year’s event is to combine the art and science of paleontology with the art and science of human relationships, and to bring together the worlds of science and art into one immersive experience.”\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has received a gift of eighty artworks from the Morgenstern Collection on behalf of the late philanthropist and scholar Lawrence and Mary Morgenstern. The works, which are valued at between $3 million and $6 million, include  The Black Frame, 2017, a sculpture by artist Zulfiqar Merali, which will be on view in the 2016 exhibition “Unseen: Modern Art in the Schuylkill Valley” (2019); “Typhoid Mary” (1934), a bronze sculpture by Willem de Kooning, which will be", "The next Biennial should be held at the State Museum, in January 2022. The Shire Hall of Fame in London is currently accepting submissions for its biennial “Spirits in Flight,” which will focus on “faith and faithless spirits,” beginning on March 25.In response to the upcoming event, the Shire said: “We are grateful to the Government for recognising the invaluable contribution made by the Biennial of Modern Art to Britain’s cultural landscape. We hope that this recognition will encourage other political and cultural bodies to consider the legacy of the Shire Hall of Fame as an important contemporary site for commemoration and a way of helping to shape future thinking about commemoration.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Mary Anne Carter has been appointed director and CEO of the facility. Carter will be responsible for overseeing the institution’s expansion and remodelling plans as it is reimplemented under the company’s new $8.5 billion renovation contract, which has been organized in collaboration with architect Roger W. Birnbaum. The partnership also involves the establishment of an international advisory council of curators and activists to advise MoCA on its expansion", "The next Biennial should provide a window into the human condition and explore the possibilities of art by exploring the human capacity for suffering.”The biennial will take place in Dubai from March 19 to March 21, 2020, and will be led by a group of artists from the United Arab Emirates. The artists are Hamza Nasr, Abu Dhabi; Nima Nabavi, Morocco; Nusrat Ghani, New Delhi; and Muay Thai world champion Mike Tyson.Commenting on the upcoming edition, Muhammad Salmawy, the director of the Abu Dhabi Pavilion, said: “The Biennale is an important milestone in the history of the UAE, and a strong signal of the durability of the UAE’s status as one of the most important and internationally-recognized contemporary art destinations in the world. By presenting the world in front of our eyes in the form of an exhibition that is curated by a large and dedicated international group of cultural professionals, we hope that the exhibition will further establish our position as a world leader in contemporary art.”\n\n\nA groundbreaking new museum dedicated to the Kurdish cultural heritage in Istanbul has opened with the opening of the Bandar Abbas Museum of Art. Located north of the European Parliament in the city of", "The next Biennial should bring together the full range of anthropological and conceptual approaches from the disciplines of art, design, dance, film, and photography, as well as the most pressing contemporary challenges posed by replicating the natural world in computer simulations and artificial constructs.”The eight-day event, which will run from March 16 to March 18, 2020, will feature new work by thirty-one artists, including Katsuya Nakamura, Zina Saro-Wiwa, Danilo Di Stéfano, Adriano Cattelan, and Diego Costa, and will be held in the Culture Centre, Porto Alegre, Portugal.\n\n\nThe Yangtze Biennial, which was canceled due to the pandemic, is back on track. The fourth iteration of the event, titled “Beyond the Infinite,” was held in the Maginot Line in the Yangtze River in Beijing on March 12–March 17. The exhibition, which was co-organized by the Beijing-based arts nonprofit Artwirtschaft, will continue after the pandemic ends on May 9.The tour, which included two shows at the Yangtze Contemporary Art Museum, hosted by the Beijing-based contemporary art curator and collector", "The next Biennial should be held in Rio de Janeiro in 2022. Prejudice was not the only reason why the exhibition was canceled; the architecture department was also struggling and was considering a move to the United States. “I really love the idea of a very personal exhibition in which the whole team is still here in Rio,” Marcelo Moro, the director of the museum, told the Art Newspaper in an interview in May. “I have always believed that there is a certain quality about art that is only possible in Brazil.”  The next exhibition will be “Parachute Art” in 2021.  The next exhibition will be “Kaya al Mundo” in 2018.\n\n\nThe Museum of Contemporary Art (MoCA), San Francisco, has appointed Carrie Rubin as its next director. Rubin comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as deputy director since 2018. She succeeds Susanne Vielmetter, who retired in August 2019 after sixteen years at the helm of MoCA.“Carrie brings exceptional leadership and proven experience to MoCA as we move into a new chapter,” said director Michael Govan", "The next Biennial should focus on the history of art in America. It should also recognize the loss of cultural heritage through the reopening of museums and the construction of new museums. The theme should be “The Art of North America.”The sprawling museum complex, dubbed the National Museum of American Art, is located in the former textile factory city of Portsmouth, New Hampshire, and is managed by the Smithsonian American Art Museum. The institution opened a branch in Washington, DC, in 1991, and the museum closed in 1998.The museum is currently home to more than 1,800 works by eighty-six American artists, including Claude Monet (c. 1947), Alice Neel (1929), Yoo Byung-kyo (1925), Claude Monet II (1879–1987), and R.H. McArthur (1908–2011), among others from the nineteen-eighties and seventies.A retrospective of the work of eight American painters, including George Andre, Thomas Ashby, Michael C. Johnson, and John Kennealy, is scheduled for December 2019.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to open a new division devoted to the work of emerging and midcareer", "The next Biennial should take place in the spring of 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA) has released the list of thirty-nine artists and collectives that are participating in the upcoming edition of the Frieze Los Angeles Biennial, titled 'Theorize: Themes and Concepts from the Art of Modern Life, 1910–1940'. Curated by Benjamin Waddington and Ranjani Raut, the exhibition will run from March 22 to March 25.“Theorize: Themes and Concepts from the Art of Modern Life, 1910–1940” is curated by Benjamin Waddington, Ranjani Raut, and Konrad Adenauer, and was announced by LACMA director Claire Minter. The event will comprise a ninety-minute lecture series by the artists and will showcase works by forty-two contemporary artists, including Raymond Boisjoly, Alighiero Castellani, David Chipperfield, Tiziana Catellani, John Galliano, María César Taveras, Marcel Duchamp, Hal Winograd, David H. Jones, Paul Klee, and David Mcintosh.“Theorize: Themes and Concepts", "The next Biennial should focus on the indigenous and the urban landscape of Buenos Aires. Artforum reported that the event will include twenty-five artists, including Lucía Berrada, Enrico Baralosa, and Diana Al-Vargas. The first exhibition will open at the Museo de Arte de Buenos Aires on November 3. The fourth Biennial will take place in the city in 2021.\n\n\nThe Pérez Art Museum in the Fashion District in New York has added three new members to its board of directors, Ginevra Pindell, the founder of the intellectual property and modern art photography and video art company Pindell Fine Art; Lisa Strahan, the former director of the Museum of Modern Art in New York; and Shimon Prokupecz, the founder of the design and hospitality company.The move marks the museum’s first foray into the entertainment and publishing sectors, and comes amid a cultural resurgence in New York following a three-year hiatus. The 75 percent increase in visitors to the museum is due to the return of the annual Pérez Art Museum Experience, an open-air event that provides an opportunity for the public to see and immerse", "The next Biennial should take place at the Recife Contemporary Art Center in São Paulo, Brazil, in January 2021. The exhibition will be next-generation and will run alongside that of the current, prior, and previous exhibitions. São Paulo is also home to the FIMS, the Archive of Modern Art, and the Crucifix Museum, which will present a special exhibition of works by artists and collectors during the event.\n\n\nThe Metropolitan Museum of Art in New York has appointed Carol A. Nolen as its next executive director. She succeeds Artsadia editor in chief Anton Kerns and is responsible for overseeing the museum’s collections and development. She will assume her responsibilities in January.“We are grateful to have Carol Nolen on board,” said James Cuno, the museum’s founding director and CEO. “She is a passionate collector who has led the Met through a transformational decade, and we’re confident she will continue to drive and inspire the museum’s collection and exhibition program.”Nolen, who began her career at Gallery Three in the late 1980s and has served as a director of the museum since 2008, also serves", "The next Biennial should be held at the Renaissance Nacional, in the city of Barcelona, in 2021. The next edition of the Art in the City event is scheduled for March 27–March 31. The next edition of the Cósalli Artografía event will be held in September, and the next edition of the Best Art in the World event will be held in November. The next edition of Art in the City will be held at the Riga Cultural Center from September 24–September 27, 2020. The next edition of Art in the City will be held at the Museo Nacional de Arte Contemporáneo in Madrid from September 27–September 29, 2020. The next edition of Art in the City will be held at the Museo Nacional de Arte Contemporáneo in Madrid from September 24–September 29, 2020. The next edition of Art in the City will be held at the Museo Nacional de Arte Contemporáneo in Madrid from September 27–September 29, 2020. The next edition of Art in the City will be held at the Museo Nacional de Arte Contemporáne", "The next Biennial should be called 'The Present'. This will be a project that will incorporate photography, sculpture, installation, performance, video, literature, and performance-based works. It should also include an exploration of the concept of the future. The first exhibition, “The Past and Present: Photography and the Making of American Art” will open in the Museum of American Art in 2020. The Detroit Biennial for the Arts, DBA Detroit, will start in 2021 and will run until 2024. The inaugural DBA Detroit Art Fair will take place in February 2022. The inaugural Museum of Art Houston Open will take place in February 2022. The inaugural Museum of Art Tulsa Open will take place in February 2022. The inaugural American Museum of Natural History, presented by the Museum of Modern Art, will be held in February 2022. The Museum of Modern Art Chicago will be held in March 2022. The Museum of Modern Art, presented by the architectural firm Gensler, will be held in March 2022. The Museum of Modern Art, presented by the architecture and design firm New World Architecture, will be held in March 2022. The Metropolitan Museum of Art, the architects of the reconstructed Metropolitan Museum of", "The next Biennial should be held in the spring of 2021, but the organizers have yet to confirm a date. \n\n\nThe British artist Billie Piper, whose lifelike figures embody feminine qualities and embody a sense of humor that is at once playful and poignant, has died at the age of eighty-one. Piper, who was known for her clay models of familiar objects—her famous Pop-art sculptures include her signature effervescent curtain, the great purple ball, and her striped, centrally located figure in a Star-Spangled Serenity shawl, among other works—was a prolific artist.Born in London in 1942, the daughter of a textile worker, Piper moved to her parents' hometown of Chichester, England, to study at the nearby Royal Institute of British Architects. In 1950, after receiving her bachelor’s degree in landscape architecture from the university, she returned to the university for her master’s degree in landscape design in 1951. In the same year, she married the architect Sir Tim Peake, and in 1953, Piper moved to New York to complete her master’s thesis, a monumental project that included the creation of the city’s Central Park. In 1977, her largest", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has added two new artists to its collection: photographer and filmmaker Mark Duggan, whose work explores questions of self and the world, and artist Cassandra Cogburn, whose work involves a variety of themes centered on women and gender. The museum announced the additions on Wednesday, March 3.Joining the already-great band of photography-makers is another group that has been making works and is known for their experimental, experimental approach to photography: the band's five-person group, which has five members, including drummer John Barlow, bassist Mike Watt, and guitarist Matthew Macgregor, is now officially a part of the museum. The announcement was made at a ceremony held at the museum on Tuesday, March 2.“With this announcement, the Museum of Contemporary Art, Los Angeles joins the growing list of historically important institutions that have announced the retirement of their longtime members,” Tom Bergin, president of the institution, said. “Mark and Cassandra’s work is expansive and evocative, and we could not be prouder to be able to present the first exhibition dedicated entirely to their work.”", "The next Biennial should be held in 2019. The next three years should be devoted to the artist-led biennial, called a biennial, that represents a single institution, the Museum of Contemporary Art (MoCA), in New York.The museum has received $3.7 million from the federal and state governments in support of its five-year $9 million expansion, which is expected to help it to break ground in 2021 and open in 2023.The Biennial of American Cinema, which is hosted annually at the museum, will be held in the museum from May to November and will be a joint venture of MoCA and the Bill & Melinda Gates Foundation, which was founded to fund the museum. The foundation will also contribute $1.5 million to the project.The biennial will present the work of eighteen artists, including Walter de Maria; Robert Irwin; and Frank Gehry. In addition to the artists who will be represented, the biennial will feature works by twenty-three other artists who are part of the Guggenheim’s long-standing David H. Smith Show, which will be relocated to the museum.The project will be spearheaded by curator of American modernism and contemporary art Dylan M. Durand and architect S", "The next Biennial should be held in the year 2021. The next one should take place in 2022. The next one should be held in 2025. The next one should be held in 2027. The next one should be held in 2028. The next one should be held in 2029. The next one should be held in 2048. The next one should be held in 2033. The next one should be held in 2036.  The next one should be held in 2041. The next one should be held in 2046. The next one should be held in 2057. The next one should be held in 2061. The next one should be held in 2065. The next one should be held in 2073.  The next one should be held in 2076.  The next one should be held in 2078.  The next one should be held in 2085. The next Art Biennial will be held in the year 2020.\n\n\nThe British artist and politician Ken Loach has been selected as the recipient of the $30,000 Ken Loach Award for culture. The prize is one of the largest monetary awards given by the Art Fund", "The next Biennial should have a theme of “life and death” and will be presented by the Los Angeles–based artist Justin Kurzel. To coincide with the event, the art center will welcome visitors to the venue by appointment only. The exhibition will feature works by twenty-four artists and will run until November 25.The Los Angeles Biennial, whose name was chosen by the artist Michelle Akers after she pitched the idea to the group of artists gathered at the venue, has reached a milestone: it has raised $4 million in funding. The $400,000 mark is the total amount raised in the first round of the project, which was launched by American Federation of Arts (AFA) president Deborah Rutter and the artist himself, and was raised by the members of the group Artists for Lifeline. The total amount raised in 2016 is $600,000. In 2018, the group will reopen with a biennial of works by thirty-one artists, curated by the artist himself, in support of the temporarily disabled after the Covid-19 pandemic. The exhibit will focus on contemporary issues of disability and will run from November 29 to March 14, 2020.The event, titled “", "The next Biennial should be hosted by the city of Chicago, which has pledged $30 million in support of the project, and will be called the \"Triennale of Chicago.\" The future of the exhibition, which will focus on the city’s South Side and will take place in phases, is unknown. Nominated for the 2019 prize by the city’s art committee, Integral Art, the exhibition will highlight collaborations between artists working in the area and explore issues of identity and migration. \n\n\nThe National Endowment for the Arts (NEA) is preparing to distribute more than $13 million to support the redevelopment of four historic Pennsylvania Railroad yards in Manhattan. The grants, which were made in 2017, will come with a price tag of between $5 million and $7 million and will be made through the Arts Rebate Program, a federal fund that disburses $1.2 billion in grants annually. The Arts Rebate Program, established in 1991 to provide financial relief to cultural organizations that were facing financial difficulties as a result of the Covid-19 pandemic, has distributed $1.4 billion to date and expects to distribute another $1.2 billion by the end of 2020. The NE", "The next Biennial should focus on how the centuries-old practice of anthropomorphization may be reconsidered in the twenty-first century as an instrument of social change and will include new exhibition designs and themes that reflect the diversity of its peer institutions, as well as its own aspirations. Juliette Floch, the director of the Institut für Kunstverein Berlin (IKB), said: “The theme of the upcoming Biennale is universal as a breath of fresh air. I think that this breath of fresh air is an important theme for us to remember in the present moment. I would like to see the Biennale in its most inclusive and multi-ethnic, yet diverse and multi-racial, form.”\n\n\nThe Los Angeles County Museum of Art (LACMA) and the Metropolitan Museum of Art (MMACC) have announced the opening of the first two years of their new partnership, which will launch in 2020 and extend to 2021. Lineartec, the company that makes the environmental monitors used in California’s environmental-monitoring programs, will provide the facilities for the first series of exploratory exhibitions, “Artists and Environmental Monitoring: Before the Great Recession,” which will take up", "The next Biennial should be in the spring, with a new exhibition every two years. The shortlisted artists will be announced on September 2. The deadline is October 15.  The 2019 winners will be announced in May.\n\n\nThe Museum of Contemporary Art (MoCA) is planning to bring more than 90 works by seventy-eight artists to Chicago this fall. The artists will be selected by a panel of curators, art historians, and experts and will each have a forty-minute run to counter the theme of the upcoming exhibition “Sustainability and Politics: Art in the Twenty-first Century.”The exhibition will follow “Blackout: Painting the Blackout in Vietnam” (2019) and “Selected Works from the New Art Movement” (2019), which explores the avant-garde in the United States through the lens of contemporary art-world conventions, and will comprise seventy-two works by seventy-nine artists. The exhibition will feature work by eighty-four artists from sixty countries and will be held in the museum’s new branch, the Contemporary Art Museum, in the former General Motors Building. The project has been in the works for more than two years, since MoCA", "The next Biennial should be held in 2021. “The quest for a definitive picture of the museum’s collection has never been more urgent, more challenging, or more rewarding than today,” says Burke. “With a new set of expectations and a new mission, we are ready to move forward with a new high.”\n\n\nArt historian Terry Eagleton has been appointed as the next president of the Royal Academy of Arts (RA), where he will assume the role of chief executive and head of the RA’s board of directors. Eagleton has been a member of the RA board of directors since 2002 and is currently its chair. During his tenure, he has helped the RA raise more than $18 million for its acquisition of properties and infrastructure around London. Eagleton’s first major investment, the former chairman of the Royal Academy of Arts, Halsey Hamilton, received a $10 million donation in 2017, and the institution plans to raise an additional $50 million for the RA over the next five years.“Terry is a leading international curator and has developed an exemplary collection of contemporary art,” said David Shiner, chair of the board of trustees of the Royal Academy of Arts. “His proven", "The next Biennial should take place in 2019.\n\nJanuary 19, 2020: The Museum of Contemporary Art Paris has announced that the twenty-fifth edition of the Los Angeles Biennial will not take place in the French capital next year. The show was originally scheduled to run from January 26 to January 28 and will now take place from February 14 to February 16. The show will be hosted by Fédérique de la Musique (France), with the collaboration of MCAParis (France), the BMC (France), and the Los Angeles County Museum of Art (LACC). “We are sad to announce that the twentieth edition of the LA Biennial will not take place in Paris in 2021,” said Patrick Brice, director of the LACC and the LACC, and “Paris is one of the most important cultural destinations of the people of Europe.”In addition, the biennial’s first retrospective in the United States—launched in 2007—was canceled last year and its second edition in 2018, titled “Mexico City: A Monument of Art”—which was organized by the Museum of Contemporary Art Denver and the Hammer Museum in Los Angeles—was canceled as well. The show was", "The next Biennial should be staged in the spring of 2021, and the first exhibition should be staged in the fall of 2021. The result is believed to be a twenty-two-hour biennial, featuring work by twenty-five artists from sixty-eight countries. The exhibition will also be shown simultaneously in Hamburg, the United Kingdom, and Vienna.The Biennial will be held at the Kunsthalle Basel from March 5 to March 8. The exhibition will be organized as follows:The exhibition will present work by forty-six artists from eighteen countries. The inaugural list includes Ricardo Renzi, Paolo Scarava, Kiki Smith, and Nari Ward, among others from Argentina, New Zealand, and Brazil. In addition, there will be a retrospective of work by forty-seven artists, including Siwai Tse, Vito Acconci, and Yinka Shonibare. The Biennial’s exhibition “Alberto Brito” will be held in the hotels of the Imagist Museum in Rome on March 12–March 15. For the first time in the history of the exhibition, a solo exhibition will be presented by a Brazilian artist. Pilar Correa is making his debut with a new", "The next Biennial should take place at the University Museum of the Arts in London in December 2020. \n\n\nThe Altitudinal Art Museum in Oslo, which was founded in the city of Næringskær, Norway, in 2010 as an extension of the British Museum in Oslo, has received a $83,000 donation from Norwegian businessman Richard Biggs. The gift enables the museum to purchase the painting, sculpture, and installation and to continue hosting more than three hundred exhibitions each year. The donation also allows the museum to continue operating under the stewardship of the Norwegian government. The $83,000 donation is a milestone for the museum as it heads into its second year of operations and comes amid an ongoing campaign to raise funds for the institution by individuals and organizations. The campaign, led by the nonprofit Næringskær Museumstjern (Næringskær Museumstjernspolizei), has received over $150,000 from several thousand donors. The institution received the support of the country’s Crown Prince, Øliver, who gave the institution $85 million for its construction and $50 million for the renovation, as well as the Norwegian Ministry of Foreign Affairs and the Norwegian Ministry for Culture.", "The next Biennial should be held in 2020, but the conference is currently unclear as to whether the event will be relocated. The 2020 edition is projected to draw 90,000 visitors.  Since the exhibition will run parallel to the presidential campaign, Aliéza also plans to stage a retrospective of the artist’s work at UC Berkeley in 2020. \n\n\nThe New York–based group that advocates for greater regulation of the petrochemical giants that dominate French and German politics—and yet are not held accountable for polluters—has received a major victory in its legal battle against France’s Suez Canal Authority (SCLA), which had already ordered the closure of six of the giant’s sites, including the petrochemical complex of Algiers, its largest industrial site in Europe, for two weeks. The Ministry of Culture agreed with the Group of Seven (G7), which represents French and German states, in its decision last August to suspend the construction of new tunnels and to suspend the opening of new natural gas pipelines from the complex. “The landmark decision has taken France and Germany to the right of the U.S. and the European Union in their commitment to protecting the environment,” said ", "The next Biennial should be held in Abu Dhabi in 2021. The 2022 edition in Tokyo is currently on view.\n\n\nFollowing a long-overdue review by the Art Newspaper, the Museum of Modern Art (MoMA) in New York announced that it is instituting a $500,000 fund to compensate galleries whose galleries have experienced losses due to Covid-19. The fund will be charged to galleries' personal accounts at the institution and will provide $500,000 in aid to compensate galleries whose collections have been damaged or destroyed by the virus, and $500,000 in aid to compensate artworks that were loaned to MoMA in a noncollecting capacity.The fund will be administered by the New York Cultural Fund and is one of several that were created in an attempt to mitigate the financial impact of the coronavirus. The funds were introduced in 2017 in the wake of the coronavirus outbreak in China and were intended to assist cultural organizations coping with the economic fallout from the pandemic. “After a thorough review of the MoMA board’s proposal, we determined that the institution’s compensation plan was not aligned with the Museum of Modern Art’s values and that we needed to address this in order to", "The next Biennial should take place in 2020 and will introduce a new series of exhibitions that will reflect on the themes of the last five years. The Biennial will combine programming and exhibition from various institutions to create a new unique experience that will include contemporary art, new art, and design, as well as contemporary music, film, and new media. The Biennial will take place at the Grand Palais in Paris from April 7 to April 11, 2020. “I would like to thank the Board of Directors of the Grand Palais, Les Réserves Mille et le Monde, Paris, for their initiative in supporting our vision for the Biennial,” said Laure Luckenbach, president of the Grand Palais. “The new format will allow Biennial Barcelona and the artist-centered programs of the Grand Palais to be realized in Barcelona and will allow the museum to become increasingly relevant to the city and its inhabitants.” It will also include a new book by the Barcelona-based architect İbrahim Boumedoura (whose firm Tesarque is responsible for the renovation of the Grand Palais) and a symposium on the history of art that will be staged by the artist-activists �", "The next Biennial should take place in 2019, and the exhibition should be open to the public. “I am writing to wish you and your colleagues a good and safe and successful 2019,” Angela Davis, chair of the commission, told the ArtsJournal. The 2019 event will be housed in the same building as the Museum of Modern Art, which closed in March 2019. The commission was established in reaction to the London riots, which were sparked by the UK’s Brexit referendum, which saw scores of protesters descend upon London’s St Paul’s Cathedral in March to protest the country’s departure from the European Union. The organizers of the exhibition, which will focus on the role of women in history and will showcase seventy new works, have said it will focus on “the women who have shaped the course of history, not the men who have shaped the past.”  \n\n\nThe Iranian authorities have arrested a man in the capital city of Tehran, a city of some six million people, on allegations of “massacring religious minorities” and sentenced him to two years and six months in prison for insulting religious institutions, the Press TV reported. G", "The next Biennial should be held at the Museum of Modern Art, New York, in 2021. The ten-year anniversary of the groundbreaking exhibition was marked with the installation of a new work by artist Matthew Yglesias, which reopened in September 2019. The next edition of the Arts Biennial will take place at the Museum of Contemporary Art, Miami Beach, in 2021, and will be presented by curator Andrew Kreps.\n\n\nAmerican painter James November Clark, known for his handmade works of social realism and his paintings that engage with the social and political concerns of a post-industrial future, died on September 30 at age seventy-two.Born in New York City in 1939, the son of a shipbuilder, Clark grew up immersed in American art and literature. He studied with artist-philosopher Sidney S. Rosenblum at the University of California, Berkeley, and then at the University of Chicago, where he received his undergraduate degree in 1951. Clark amassed a long-standing and distinguished career as a painter, often depicting the human condition through his own terms, often self-portraits, and a number of his biggest works, which focus on capitalism and capitalism-inspired design. Known for his abstract compositions, which often feature the artist himself, Clark", "The next Biennial should focus on the development of the platform for social justice, as a core task of the upcoming exhibition, “Black Lives Matter: Art, Activism, and Transhumanism” (2019).The forthcoming exhibition features works by seventy-nine artists representing twenty-seven countries\u0097from Finland, Germany, Italy, and Spain, among others. The biennial will run from March 24 to March 28, 2020.The shortlisted artists are:Benjamin Brittenham (United Kingdom)\n\nZoé Whitley (United States)\n\nLili C. Jerome (United States)\n\nFiona LeFanu (New Zealand)\n\nJohn Merrick (New Zealand)\n\nBenedict O. Crompton (Australia)\n\nRebecca R. Carter (United States)\n\nKamau Roscoe (Australia)\n\nAnselm Barlow (New Zealand)\n\nFranz Borthwick (United States)\n\nDavid Basheer (United States)\n\nAlice Borthwick (Australia)\n\nClara Black (United States)\n\nDavid Blackman (United States)\n\nCarlos Cano (United States)\n\nDiane C. Law", "The next Biennial should open in 2020. The 2019 event, which was organized and hosted by the local community, was held at the Skybar, a former state-run arts complex, and featured performances, lectures, and other programming from curators and artists from all over the world.The 2019 event, titled “Making the Future,” was co-organized by the local community and the institution. The 2019 exhibition, titled “Character,” was organized by the local government of Voorhees and the local art historian, and was organized by the artist-in-residence, Diane Haslam, as part of the Metropolitan Museum of Art’s reopening strategy. The exhibition was curated by the artist-in-residence, Brianna Rochford, and featured work by seventy-five artists from twenty-nine countries.The art historian Haslam’s new role will be a highly visible extension of the institution’s existing curatorial program, which has been overseen by Cassandra Johns, who retired in March 2019 after twenty-five years at the Met. She will take up the post on January 1, 2020.Commenting on her appointment, Haslam said: “I", "The next Biennial should be staged in 2021 and will be one of the last scheduled entirely in the city and will assume an environmental theme. After touring a number of museums in Paris, the exhibition will be followed by a special residency program and a masterclass for young curators in London. Yale Architectural Association president Mary Ellen Mark-Vietjen and her husband will also serve as the artistic directors of the biennial, which will be hosted by the Museum of Fine Arts in Boston. According to the New York Times, Mark-Vietjen was commissioned by the Events & Visitors Bureau (EVB) of the City of Chicago and will work with the city’s Department of Cultural Affairs, the Mayor’s Office of Economic Development, and the Department of Cultural Affairs to shape the theme for the exhibition.The Mark-Vietjen/Hodgkin-Littles Architects designed the exhibition’s spaces in the CityWalk of Columbus Circle, a former industrial complex in the heart of the city, in collaboration with architects Richard Liston and John Bueno. The ten-acre venue will host an artist residency program; an Open Studio for Young Curators; and a masterclass for future interns.“The Mark", "The next Biennial should be held at the Panama Museum of Art. The next iteration of the Art of the Studio, which will draw twenty-four artists to the United States in 2020, should be held at the Smithsonian American Art Museum. And finally, the Museum of Modern Art and the Whitney Museum of American Art will collaborate on a new series of exhibitions devoted to the development of American photography and its relationship to the rest of the world. Among the new projects, titled “International,” and “These Days,” it will feature photographs by twenty-one artists, including Louise Bourgeois, Cooper-Hewitt, Edvard Munch, Thomas Aitken, and Edwidge Danticat, and will open in January 2021. “This is the moment,” said Elizabeth I, the founder of the Smithsonian Institution. “The future belongs to the American people.”\n\n\nAfter the Venice Architecture Biennale announced that it would postpone the 2020 edition due to the temporary closure of the fairs, which have been closed since mid-February due to Covid-19, organizers issued a statement saying they were reopening the exhibition in two phases. Art Basel and the Art of the", "The next Biennial should take place at the Centro de Producem Modelo in Madrid in 2021, and the inaugural edition should take place in 2022. The next edition of the annual Venice Biennale will be held in the Palazzo delle Papesse in Venice in 2022. In announcing the twenty-four participants for the inaugural edition of the exhibition, the organizers said that the project “will be inspired by the idea of the new year and the universal society.” The exhibition will be co-organized by the arts and cultural institutions and the National Institute of Contemporary Art and History in Rome. The theme of the upcoming exhibition will be “The Future of Art.” The first edition of the Biennale will be held in March 2019.The inaugural edition of the exhibition, “Blueprint for a New Art Movement,” was organized by the Institut Mont-Maurienne in Paris, and first showcased the work of ten artists. The exhibition, which opened to the public on January 23, 2019, featured work by seventy-one artists. The twenty-six artists who were selected to represent Italy at this year’s Art Basel show in Singapore were announced in December of 2019", "The next Biennial should commence on Thursday, March 16. \n\nArt Basel Hong Kong has postponed the next edition of its Hong Kong fair, originally set for March 17–March 21, but is now back on schedule for March 20–March 22. The first show, titled Hong Kong Stories, will now take place March 22–March 24. In a statement, the fair said it is “still assessing the full range of possible impacts of the ongoing relief and economic crisis.” Eisa Fujita, director of Biennials Asia Pacific, said: “We are aware of the situation in Hong Kong and are actively supporting the local authorities to protect the exhibitors and the fair as a whole. Our thoughts are with the exhibitors and all those affected. We are taking all possible actions to ensure fair organizers and artists have a smooth and safe event.”An artist’s retreat at Art Basel Hong Kong was also canceled. The theme, “Prescription Addiction,” will be revisited at the upcoming exhibition, “Aspen: A Contemporary Experience,” in September.\n\n\nThe Sino-British artist Stephen Hackett has won the $25,000 Biennial Art of the Year", "The next Biennial should be held in 2022. The biennial was established after a group of artists, including Kiki Smith, Cara Stubbs, and the late National Poet Laureate Robert Rauschenberg, agreed to collaborate with a curator to create works that engage with issues such as social justice and memory. Among the works that will be staged this year are paintings by the late Nigerian artist Carmen Aluko, Dani Aluko’s tribute to the late American artist and activist Harry Haygood, and the work of Norwegian artist Sigfrid Svartholm, whose recent exhibition at the San Francisco Museum of Modern Art (SFMoMA) was marred by violent protests from activists who believed the work was a “die-in” ceremony.The next edition of the Biennial will be held at the San Francisco Museum of Modern Art from May 12 to May 13, 2022. The exhibition will also feature work by the Japanese artist Keiichi Nakayama and the Chinese artist Junnan Liu.\n\n\nThe National Gallery of Scotland has appointed Kate Wilson-Hadley as its first director. The appointment has been made with the approval of the Scottish government, which is currently negotiating a new ten", "The next Biennial should be held in the spring of 2021. The announcement of a new title for the show follows the announcement of SOUTHAMPTON\u0097a joint project between the Serpentine Gallery and The Whitechapel Gallery, held in partnership with Tate Modern in London. The show will be based on the work of Maurizio Cattelan, the Italian contemporary painter, and the works will be accompanied by an exhibition of works by Michiko Yamada, Yinka Shonibare, and Masato Morikawa.\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced that it will not move forward with the planned reopening of its iconic, closed space in the Westwood arts district, which has been the site of several riots over the last several years, in part because of concerns over the civil unrest that erupted following the 2013 coronavirus pandemic.The institution decided to shelve the reopening plans in January of this year, citing concerns that the move would hurt the cultural district’s remaining tenants, including the Joshua Helmer-designed Fabric Factory, which is slated to reopen this spring. LACMA has since faced a legal complaint from the community over the closure, and", "The next Biennial should take place in 2019. No other date has yet been set for the 2020 edition. The film festival’s final event, the Biennale de Lyon, will take place at the wonderful Grand Salon de Lyon in France on January 22–February 28, 2021. “The work that the film festival has done for the past twenty years has been to create a rich and unique aesthetic of the cinema,” said Natalie McGinn, director of the Film Institute of Toronto. “In order to continue that work and to design an exhibition as ambitious as this year’s, we’ve had to develop a new approach to creating works that can encompass multiple themes.”Muzio Hagi and Rossini with Kate Ortega, for whom the collaboration was created, will unveil a new sculpture at the festival. The pairing of the two artists was first announced in 2015, but the first work, titled Art and Stories, will be on view in the upcoming exhibition “Feminine and the City,” curated by Rossini. Photojournalist Greta Gerber will also present a new work, titled Ordinary Life and the City, at the show", "The next Biennial should be held in 2021, and will be inaugurated by a performance of the new exhibition titled “Theater of Operations.” The show will focus on the events of the Persian Gulf War (1941–48), and will include a new selection of paintings, a new presentation of new works by Málaga-born artist Emile Prouvé, and the first public exhibition of works by French surrealist Jean-Luc Godard.The Biennial will be inaugurated by a new performance initiative, “Dummy,” which will feature three contemporary artists and will run through March 16. The inaugural event will also include a show of work that is part of a larger project, “Theatre of Disruption,” and will run through March 21.Next year’s event will also include a retrospective of the work of the '80s American pop-soul artist Kid Rock, and a single-artist presentation of the work of Japanese artist Katsu Naito.\n\n\nThe Metropolitan Museum of Art, which recently announced its intention to shutter the museum from March 16 to March 22, has received a gift of over five hundred works by artists such as Bruce Lee, Renate Heran,", "The next Biennial should take place in 2020, with the proposed date to be announced in 2021.\n\n\nFor the past nine months, the British artist Graham Smith has been making paintings and sculptures for a series of exhibitions that take place at London’s Serpentine Galleries every other year. The annual exhibition, “An End of Art: Graham Smith” (will be held at the Tate until the end of March), will address the work of Smith and his peers, and will include works by at least eighty artists. The show will also include a “Pale King:” retrospective at the Serpentine in 2021.“The exhibition is about to launch in full, with immediate effect, with an exhibition of work by Graham Smith at Tate Britain,” said Graham Smith. “This is an unprecedented project, and it has been a huge privilege and a great honour to work with the team at Tate to produce the show. I am deeply inspired by the artists and the exhibitions they invite to join me in my space, and I am sure this will be a show of the best of our collections. . . . The artists invited to join us are simply spectacular, and the show has the potential to be a show of", "The next Biennial should certainly be a moment to reflect on the past and re-imagine our future. ‘We have several projects underway to reimagine the landscape for a future of greater interconnectedness and better connected lives.’  On Facebook, she wrote: “We are constantly celebrating the interconnectedness of the world and each other in ways that proceed from a conviction that what we do is something we should be proud of.”\n\n\nThe São Paulo Bicentennial has released the list of sixty artists who will participate in the fifteenth edition of the Brazilian Biennial, which will take place in the city of São Paulo from September 14 to September 17, 2020. The event in partnership with the Museario do Povo is organized in partnership with the São Paulo Foundation, the City of Rio de Janeiro, the Foundation for Civilization, the Municipal Government of São Paulo, and the Mayor of Rio de Janeiro, Jair Bolsonaro.For the past several years, the fifty-fifth edition of the São Paulo Bicentennial has been staged at the Museu de Arte de São Paulo (MASP) in São Paulo as well as at the Museu de Arte de São", "The next Biennial should be held in the fall of 2020.”The Glasgow Art Museum (Gammell Barracks) is also exploring moving forward with a redevelopment plan that would see a new building constructed in its historic location. The institution is currently reviewing the options that include the construction of a new exhibition space in the museum or the addition of new exhibitions.The Edinburgh Art Gallery is also planning to launch a new yearlong initiative, called the  Gallery for Photographers, to help photograph the city with more than one thousand exhibitions across a number of disciplines. “We are revisiting the design of the building to make sure it reflects the city with a new vision of the future,” said art director Simon McBurney. “We are also rethinking how we present and present the exhibitions in the gallery and how they interact with the city.” The Glasgow International, a contemporary art event that has been held in the city since 1990, is planning to hold a new edition in 2021. The event will include an exhibition of work by more than seventy international artists and will kick off with a reception at the Palace of Fine Arts on December 13.The Royal Academy of Arts (RA) in London is also working on a new architecture", "The next Biennial should be held in 2020, and the first will be held in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it will reopen its doors to the public in February 2021. In a statement, the institution said: “We are thrilled to be opening again with a bang, and to welcome in the world again the works by the artists who have shaped the trajectory of American art.”While most of the works on display are set to reopen in the spring of 2022, a few pieces, including the exhibition “Aristoteles and Proust” and “Feminine and Civilized” (2019), will remain closed until at least March/April.“The Future Is Here,” an exhibition that will mark the first time the museum has reopened since 1979, will also remain closed until at least March/April. Although the exhibition will reopen as a part of ‘Puerto Rico’s 150th anniversary, it will not open until the summer of 2021. The museum will also open a new $50 million center for contemporary art in the fall of 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles", "The next Biennial should be staged at the Museo del Banco de la Históri de Barcelona and will be organized as follows:The next exhibition should be held at the Museo de Arte Contemporáneo in Barcelona and will be organized as follows:The next exhibition should be held at the Museo de Bellas Artes and “Arte de Santa Marta” should be held at the Museo de Arte de Madrid and will be hosted by the Centre National de Arte Contemporáneo de Madrid and the Museo del Castello in Madrid. The next Venice Biennale should be staged at the Museo della Scala in Venice and will be held from April 13 to April 20. The next Metropolitan Museum of Art exhibition should be referred to as the Met and should take place at the Metropolitan Museum of Art in New York. The Venice Architecture Biennale is moving to February 2020, as originally scheduled. The twenty-second edition, which opens on March 3, 2020, will be held at the Museo della Scala in Venice and is being organized in partnership with the Museo dei Paschi, the Museum di Arte Contemporani,", "The next Biennial should be held in the fall of 2022. “I am delighted that we are able to announce that the exhibition will be held in the coming months, and will be able to share more information about the project with the public in the coming weeks,” said Johanna Muse, curator of the exhibition. The show will feature more than 1,500 works from the exhibition, which was organized and curated by Danish curator Kjetil Magnus. The Danish artist, who also curated the exhibition “Nils-Kristiansen: Aenarhus,” will be featured in the exhibition “Nils-Kristiansen: Aenarhus.” The show will also include a new collection of photographs by Pierre-Auguste Renoir, “Tit and Tanya,” which will be organized as a “tour in memory” of Renoir, who has been ill for several months and will open in September. Following the exhibition's completion in 2020, the exhibition was nominated for a Pulitzer Prize. Among the works in the show are “The Fat of the Land,” 1946, which was taken on the island of Aruba, and “The Painted Building", "The next Biennial should be returned to the French Government in 2021,   and should take place in Paris from 2021 to 2023. Historically, the exhibition has been held in Paris, and the exhibition’s founder, Pierre Bière, moved the exhibition there in 1992.  A statement released by the French Ministry of Culture reads: “The Paris Museum of Fine Arts (PMA) is ready to contribute to the solution of the problem of the future. Our new proposal will include a new exhibition dedicated to the history of modern art, with an aim of uniting the world.”\n\n\nThe Japanese artist Tadao Ando, whose luminous, evanescent sculptures embody a profound aesthetic inquiry into subjectivity and the extent of vision, has died at age eighty-three. In his writing on the art of image, he argued for the autonomy of the human eye from the rigid framework of the made-up world.Born in Hiroshima in 1932, Ando first studied with painter Yasuhiro Takemoto in the 1960s. In 1967, he joined the Studio Museum in Tokyo, where he would become a mentor and, later that year, a mentor and friend. After graduating from the institution in 1973, the", "The next Biennial should take place at a different location within the city, but the city’s art museum will remain on site. “The city has made an effort to coordinate the installation of the new programs and has worked with the artist to include his work in the forthcoming events,” city council president Bruce Harrell said in a statement. “I look forward to working with the artist to help promote the city’s art and to supporting the institution as it continues to thrive.”The Biennials are a series of events that engage with themes of the year, but also draw on biennial traditions from the city’s past. The 2019 edition, titled “20s, will take place at the Port of London. \n\n\nThe Duchamp-Arcy Art Museum in West Chester, Pennsylvania, has received an additional $100,000 from the John S. and James L. Knight Foundation in support of its 2018–19 fiscal year. The organization gave the Duchamp-Arcy $29,458 in support of operations and maintenance, including $52,000 for improvements to its building, facilities, and conservation, and $52,000 for the enhancement of its collection and collections,", "The next Biennial should take place in 2021.<|endoftext|>For the past few months, we've been paying close attention to the trajectory of the presidential campaign in the United States. It is, without question, the most important and consequential election in our lifetime. . . . The stakes are high. The politics are complex. We cannot afford to miss this opportunity to make a difference.” We thought we were witnessing a turning point in our lives and politics, one where we might finally be able to remove Donald Trump from the Oval Office. Instead, we are witnessing the triumph of the status quo.\n\n\nThe recent wave of violence in Charlottesville, Virginia—which has involved protests organized by various groups, including the Black Lives Matter (BLM) movement, the Unite the Right rally, and neo-Nazis, including the Ku Klux Klan—has led many to question the path that can be taken in the coming months. Will we once again see the resurgence of white supremacy and racial extremism in America? Will we see the rise of new forms of divisiveness and violence, fueled by grievances over economic inequality and climate change, that are incompatible with America’s founding ideals of a diverse, inclusive society?We can no longer afford to let this happen.", "The next Biennial should be held in 2021. The exhibition will not be affected and will be reopened in the summer of 2021. Artforum has reached out to Zimmer for a statement.\n\n\nAs the Metropolitan Museum of Art in New York City prepares to reopen to the public following a $300 million expansion, the museum is preparing to welcome visitors again in 2021. During the renovation, the Met also celebrated its first year of the new twenty-two-story, glass-enclosed museum. The reopening of the museum is part of a larger plan to make the Met’s collection more accessible to the public and to integrate more museums.In a statement, the Met said: “The new Met, the Metropolitan Museum of Art, and the Museum of Modern Art represent a radically different vision of the museum as an institution that presents the greatest range of contemporary art, and the most challenging work in our history. We are confident that these plans will prove a success for the museum, and we are grateful for the work of the newly appointed directors, Luis Miranda and Domenick Fusi, to make them a reality. We are also excited for the future of the museum as a public gathering space for artists, as well as the future of the", "The next Biennial should take place in 2020.\n\nThe next edition of the Salon Marcel Duchamp will be held in Paris, in 2022. The event, which will be hosted by the philosopher, artist, and writer Pierre-Auguste Renoir, will be held at the Saint-Saëns, a former slave market, and will aim to introduce a new chapter to the artist’s works. The third-largest retrospective of the artist’s work will be held in Oxford, England, in 2021. The next iteration of the Biennial will likely be held in the autumn of 2022. Maurizio Cattelan, the executive director of the Biennale, told the Art Newspaper: “I personally am thrilled that we are finally getting to this stage. With the special exhibition, we gather the greatest artists of our time together at the same time in the same place. It is no longer necessary to assemble them in different ways, in order to present their respective visions of the future. We hope that this will stimulate new and creative exchanges within our community, and that the upcoming editions of the Biennale will have the occasion to become an exhibition of the greatest artistic achievements of the twentieth century.", "The next Biennial should be held in the spring of 2020. The theme of the 2020 edition is “Time for Change,” and the exhibition will focus on the recent global events, such as the Paris Climate Accord, and the Black Lives Matter movement. The museum will also focus on the history of art and its relationship to current events. “The 2020 Biennial will be an exciting, ambitious, interdisciplinary exhibition that reimagines art through the history of the subjects it studies.”\n\n\nThe Metropolitan Museum of Art in New York has hired painter and sculptor Matthew McConkey as its new associate curator of European art. He will be the first person to lead the museum’s exhibition “Unseen,” a collaborative project between the museum and the University of Michigan (UM), which was inaugurated last fall. The exhibition, which marked the museum’s thirtieth anniversary, featured work by eighty artists, ranging from Kiki Smith to Alan Shepard, and was curated by Matthew Poledna, the Stuart Hindle Professor of Modern Art and Design at the University of Michigan.“We are thrilled that Matthew is joining the Metropolitan Museum of Art at this pivotal moment in its history,” said", "The next Biennial should be held sometime next year. “The museum is experiencing a renaissance,” Christie’s director Helen Gans told the New York Times. “It’s a very exciting time to be alive, and we are and will continue to provide an immersive and captivating environment for visitors to experience life from the point of view of our newest species, the figment of their imagination.” The auction house is still working on the design of the exhibition, which will be organized as an interactive exhibition with live performance, architecture, and installation. The full list of participating artists is as follows: 1. Hui Fang & Yoshitomo Hoshino (Hong Kong) 2. Sung-Min Lee (USA) 3. TJ Edwards (USA)4. Michelangelo Antonioni (Italy)5. Mark Borthwick (UK)6. Mai Fernandez (USA)7. Hannah Harris (USA)8. Andrew Hatfield (USA)9. Daniel Hausmann (Germany)10. James Hunter (USA)11. Michael Knapp (USA)12. Matthew Mead (USA", "The next Biennial should be held in the coming months. “We are planning a strategy for the future that will take into account the current situation,” said the art historian Dorota Oelekova; “We need to consider the future of Russia’s cultural heritage in relation to the emerging international situation, taking into account the fact that the current biennial, which was originally conceived as an international show, may not be able to continue in its current form.”In the meantime, the biennial’s organizers are encouraging people to tune in on Facebook or to watch online as the show will be live streamed online.  RelatedArt and CulturePost is a news and art website that is supported by a generous grant from the Kasmin Foundation. Its articles are published by portfolio companies such as Anonymous Group, Beyeler Gallery, GrassCutting, and ParaNorman Gallery. Donations in support of the arts can be made to the Kasmin Foundation, Beyeler Art Trust, GrassCutting, ParaNorman Gallery, and Anonymous Group. The Kasmin Foundation is also receiving a large grant from the ", "The next Biennial should take place in 2020.The new theme in the show will be 'How do you exist without art?', and will include a series of public performances, performances, and installations in which the paintings of the artists involved in the exhibition will be taken up and used as a platform for reflection. The new exhibition should be inaugurated by a series of exhibitions in the form of a sort of assemblage, by the artist-run studio Biennale Berlin, which will be inaugurated with a contemporary art exhibition at the Arthouse Berlin in 2020.  The new exhibition will be organized around an exhibition-based format, with the full range of forms and their materials from the artist’s studio shown in one show. The artist, a German curator named Rainer Bangert, will present the first exhibition, “Nina Bueno: The Roots of Unity” at the Biennale in 2019. The show will focus on the evolution of three works by Bueno regarding the creation of a new world. The works, which were completed in 1981, are part of a series about human possibility and the elimination of knowledge.“I am thrilled to present the works, which are part of a series of exhibitions that", "The next Biennial should focus on “world history through the works of the master Seung-Min Lee,” the winner of the first and last time the Biennials were held. The 2017 event, which took place in the US State Department’s National Museum of Women in the Arts, was canceled due to the Covid-19 pandemic.Censorship is a serious concern for the artists, who are seeking a change to the law that would guarantee the artists equal protection under the law. They also want the government to address the imbalance between the museums’ funding and their workloads, and to establish a public trust between the institution and the local community.The artists are asking that the government prioritize funding for cultural institutions, such as the National Museum of China, the Museum of Chinese in America in the US, and the Contemporary Art Museum Beijing, and not fund the construction of new buildings. If the government funds the construction of new buildings, the artists fear that the museums will simply be pushed further underground. A more ambitious plan to rebuild China’s cultural heritage sites through the construction of new museums is also being proposed, by architect Liu Xiaoyuan and the Beijing-based firm DMJ & Associates.The artists have", "The next Biennial should take place in the spring of 2021. \n\n[Update: March 31, 2020]The 2019 Bipartisan Art Museum Artists’ Commemorative Exhibition was held on September 25—the St. Louis Art Museum, which is currently closed until at least March, has announced that it will reopen in March 2021. “We are very excited about the prospects for the 2019 Biennial,” said Biennial director Tanya Bruguera. “As part of the biennial’s mission of celebrating the work of emerging and established artists, we wanted to ensure that the 2019 event would have the fullest possible impact on the museum’s collection and the community. We have made the decision to move the 2019 exhibition, which is currently on view in the back room, to the main exhibition space, where it will undergo a major expansion. The 2019 exhibition’s opening ceremony will be moved to the Martin Luther King Jr. Center for Human Rights and Art, where it will remain open until March 23.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has announced that it will not renew the contract of art historian, curator, and art historian Carlos Mench", "The next Biennial should, I believe, be held at the Museum of Modern Art, New York, in 2021. The next DTS-Conference, which currently takes place at the Venetian in Venice, Italy, is scheduled for February 2022. The forthcoming 2020 European Biennale, which will be held at the Tivoli Cultural Center in Venice from March 21 to March 28, is scheduled for March 24 to March 31. The 2020 Seoul Art Museum Biennale is scheduled for March 26 to March 29, and the 2020 Tokyo Art Museum Biennale is slated to commence March 23. The 2020 Hong Kong Art Festival, which will be held on March 10 and March 14, and the 2020 Hong Kong International Film Festival, which will be staged on March 16 and March 17, will both be held at the Walled City Art Museum, which is currently undergoing a $75 million upgrade. The 2020 Istanbul Art Biennale, which is scheduled for March 3 to March 10, and the 2020 Istanbul Architecture Biennale, which will be held in the legendary Taksim Square from March 3 to March 10, will also be held. The 2020 Rome Design Biennale, which was originally slated to run March 14", "The next Biennial should be held in 2018. \n\n\nA group of artists and collectors have launched a campaign to bring the two most recent editions of the B.I.G. Biennial to New York City, which were canceled due to safety concerns due to the Covid-19 pandemic.In a letter to the New York Times, the group Artists for the Future of New York, a coalition of artists including Paula Cooper, Richard Diebenkorn, and Tanya Bloch, called for the exhibition to be rescheduled. Instead of its February 2020 opening, the biennial should be held in 2021.The letter further argues that the cancellation of the biennial, which was scheduled to take place in September, was made in a way that would benefit the pharmaceutical industry, which was already slated to benefit from a temporary suspension of the Covid-19 epidemic while the government worked on a long-term solution, would not be impacted by the emergency, and would result in a higher attendance rate for its September event.The letter states that the problems facing the biennial are minor, and that postponing the exhibition would not be detrimental to the work of the artists represented or the work being presented at the event. It also points to the fact that", "The next Biennial should be staged at least once a year, and will be held on the second floor of the Albright-Knox Art Museum in New York, at a time when it will be in the process of reopening after it closed for a period of ten days due to the Covid-19 pandemic. “Since the museum’s first exhibition in 2018, the biennial has become a point of departure for visitors from around the world,” said John Schwalb, director of the Albright-Knox Art Museum. “We are eager to see how the biennial will present new and exciting exhibitions in 2020.”The 2020 edition, titled Theory of Mind, was curated by Kiki Smith, the United Kingdom’s director of gallery and exhibition development and public engagement, and will run from March 15 to March 17, 2020.\n\n\nThe Royal Society of Edinburgh has appointed Whitley Strieber, Caroline Atkins, Andrea Balsom, and Jasmine Barratt as its new Academy of Modern Art (Amaz) fellows, with a shortlist that also includes Christina Bellant, Nicole Stebbings", "The next Biennial should be held sometime between September and November 2021. The exhibition will be organized as a platform for the Argentinean artist Andrea Bertani’s work, which was exhibited at the Fifty-Ninth Venice Biennale in 2017.“This year’s exhibition is a reflection of the current international situation,” said artist Andrea Bertani. “It aims to reach a point of clarity in which we can begin to focus on the future.”The exhibition will feature work by sixty-five artists and collectors, including the Marcel Prouvé (1941–2019), the artist-in-residence (2018), the Capello Giunta (2018), and the Giunta family (2009–2019). The first iteration of the show will take place in November 2020, coinciding with the twentieth anniversary of the construction of the city’s Centro de Cultura Argentina. The second edition will be staged in July 2021, and the third in November 2022.The new exhibition will also introduce a new selection of works by artists from the former Argentinean colonies of Buenos Aires and Santiago de los Angeles, which were excluded from the past editions of the show. Buenos Aires native Franjoi Fernández,", "The next Biennial should have been held this spring—the first was cancelled over the coronavirus. \n\n\nA group of artists, designers, and other cultural workers in the French city of Lyon have received a cease-fire, curtailing hostilities between the country and Islamist militants, in an effort to prevent the spread of the virus, which has already killed more than 9,000 people in the country and is still being spread in the UK.The delegates reached an agreement after a three-day meeting in Paris on May 25, with several organizations, including the Federation of French Observatories of Islamic Art (FRANCE’s FAIM), the Kaya Foundation, and the Institute for Contemporary Art in the City of Paris, as well as several local residents, including a group of sixty residents of the city, protesting the cease-fire. The activists demanded that the militants be expelled from the city.The activists were protesting a French government plan to reintroduce the death penalty after a period of seven years—President Emmanuel Macron had called for the abolition of the institution in a speech in May—and the government’s decision to grant tax-exempt status to a number of Islamist organizations, including the Association of French Muslims, which they said encouraged violence against", "The next Biennial should take place in the summer of 2022, at the Ternopilum, in Rome. The theme will be “The Great Sculpture Hunt” and the program will address the issues of historical memory, the art world, and the role of art in society.The Biennial will be organized in the same way as the previous editions. The first edition concluded with the exhibition “Olympus and the Italian State: Art in the 1980s” in 1981. “For the past seventy years, the Ternopilum has hosted a great collection of Italian art in its archives,” said curator Roberto De Cesaretti, the director of the Palazzo Grassi and the Italian Architecture Biennial. “This edition will be a great continuation, to a great extent, of its space and of the museum’s profile; even more so, given the current situation in Italy. It will be a test of the museum’s ability to continue supporting the memory of the Italian state and of its art.” The 2020 edition, “The Middle: Art in Transition,” was organized by the Windmill Museum in Liverpool and will run from March 13 to March", "The next Biennial should take place in 2020. The 2020 model was chosen to provide additional opportunities for the creative and intellectual community to engage with the ideas and artistic work of the period.The 2019 Biennial hosted the first and most recent exhibitions of works by the artists of Italy’s Palazzo Grassi and Italian fashion, with the exhibition presented by the Italian fashion house LINDSAY SHAWNÄs daughter, ADRIAN SHAWNÄ, the artist’s first solo exhibition in the United States.The 2020 show will be curated by Rinek Siwaj, who will serve as curator for the biennial, from the public gallery in the town of Mantova in the Italian city of Mantova. This is the first time the Italian fashion house has hosted an exhibition at the museum. The show will feature work by twenty artists from Italy and five continents, including Sala Berlind, Valentino Cipolletta, Paolo Cipolletta, and Andrea Cipolletta. The panel of artists will comprise Giovanni Cattelano (editor of the Italian fashion magazine Dotti's Italian La Repubblica), Sabino Cipolletta (the Italian fashion designer),", "The next Biennial should take place in the fall of 2020. The theme of this year’s exhibition was “Art and Suppression, 1960–1965.”The exhibition will consist of twenty-four works, beginning with the artist-built city of Biennale II, which was inaugurated in Beijing in 1977, and ending with the first Surrealist paintings in Italy, Sidney and Louise Van Gogh’s The Polar Express, 1961.Commenting on the exhibition, Kunsthal Biennale Frankfurt chief Ulrich Prösch said: “We are delighted by the exhibition's exhibition of this year’s exhibition. The exhibition represents a new, contemporary point of view on art, and it is a good example of how the Biennale can be a platform for dialogue and collaboration between artists. The exhibition will be a great source of inspiration for future years and will help us to develop new ways of working as a team. We hope that the exhibition will prove a good guide to the next exhibition and, finally, it will give us some good news about its future.”\n\n\nTwo hundred artists from twenty-two countries are working to create an international platform for social justice and artistic expression in support", "The next Biennial should also include the exhibition “The Black Paintings of John Bellini,” an exhibition that will examine Bellini’s paintings from the 1960s to the 1970s.The exhibition comes at a crucial point for the Cleveland Museum of Art, which recently announced it will close the long-running program and begin a new phase of programming that will begin in 2022. The overhaul will likely involve the transfer of some of the collection to a museum that will house it in a converted barn, and it will likely include the creation of a new exhibition, “Beyond the Black and White,” that explores Bellini’s work in a different light.In an interview with Artforum editor-in-chief Michael Wasik last month, Bellini explained that his practice was driven by a desire to push his own work beyond the confines of the studio. He added that he wanted to focus on space and shape “the canvas” rather than sculpt it. “I’ve been working with paint for twenty years now, and the process isn’t very different from sculpting. Lots of paint, a lot of painting, a lot of sculpture, a lot of photography, a lot of photography in architecture", "The next Biennial should focus on: “What happens when science and art collide?” The panel will reconvene in January 2020. \n\n\nThe Victoria and Albert Museum in London has appointed David McAllister as its next chief executive. McAllister comes to the institution from the Royal Academy of Arts (RA), where he has served as director of exhibitions since 2015. He will assume his new responsibilities in January 2020.“The appointment of David McAllister as director of the Victoria and Albert Museum was a classic example of collaboration and consensus building,” said Martin East, director of the museum. “David has been instrumental in developing the museum’s collections programmatically, ideologically, and financially, and has been a valuable ally to the museum in challenging some of the most cherished preconceptions about art and science.”In his new role, McAllister will be responsible for managing the museum’s collection and operations, and for leading the museum’s international engagement. As director, he will bring a new perspective from which to view the museum’s collection and collection experiences.“David’s gift to the museum has enabled the Victoria and Albert Museum to become an international leader in", "The next Biennial should focus on “the relationship between art and politics,” said the exhibition’s designer, Nawa Bishara. “She will begin by reviewing existing exhibitions and works and then highlight new conceptual approaches to art and politics. The show’s inaugural biennial ‘Who Rules the World?’ will be on view until September 28.The event is curated by Nari Ward and Jennifer Schott; it will focus on the current state of political and cultural domination and the future of art and politics in South Asia. “The biennial hopes to introduce contemporary South Asian art to the West in order to draw attention to the lack of representation of South Asian art in exhibitions and to the current state of political and cultural domination in South Asia,” said Ward. The event will be held at the Hirshhorn Museum and Sculpture Garden in Washington, DC, and will feature works by seventy-two artists and collectives.\n\n\nFormer New York City commissioner of transportation Anthony Manaforts announced today that he plans to resign in August 2020 to pursue new career opportunities. In a statement, Manaforts said: “I am especially proud to have served as commissioner of transportation and Mayor Bill", "The next Biennial should be held at the Art Institute of Chicago next year. The 2020 iteration will be titled Representations. The theme of the show is the artist’s relationship with the body and the future of art. The inaugural exhibition will take place in the museum’s building, which opened to the public in April and has since become an exhibition space. The artists who will participate in the 2021 edition of the Biennial are as follows: Cajundjara Sengupta, Ajit Dutt, LA, USA; Ternarjuna Mistry, Bangalore, India; Karna Vasa, Mumbai, India; Javed Rajput, Hyderabad, India; and Arafat Ahmad, Ahmedabad, India.\n\n\nThe Russian artist Alexander Rublev, who in the 1960s was a pioneering proponent of the film as a medium for political and social change, has died at the age of eighty. Rublev’s paintings, which often depict the fate of political prisoners and activists, have been exhibited at the Museum of Fine Arts, Moscow (MoFA), and the Contemporary Israel Museum in Jerusalem (CIMAM), and have been translated into more than twenty languages.Born in 1941 in", "The next Biennial should be held at an appropriate location in the city for a period of at least two years, with the aim of developing new technical tools which will allow the public to better understand and experience the exhibition. The next edition of the CNE Biennial will be held in the city from January 29 to February 3, 2020. The 2022 edition will be staged in the French capital. \n\n\nThe Museum of Modern Art (MoMA) in New York has become the latest major arts institution to confirm the passing of a major work by artist Leon Black. The work, Civil Disobedience, 1965, was completed in just forty days. The announcement comes a little over a week after artist Martin Luther King Jr. gave a speech at the institution, which was founded by art dealer Sidney and Ira King of the King family, which will celebrate its sixtieth anniversary this summer.King, a long-time supporter of MoMA and a longtime collector of the artist’s work, was nominated for the $500,000 Leon Black Prize last year. He was chosen by a jury comprised of artist Hal Foster, art historian Matt Holloway, composer John Baldessari, and filmmaker Bradley Cooper", "The next Biennial should take place in the city in 2021. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has awarded the Metropolitan Museum of Art (MoCA) $2.4 million in aid for the restoration and conservation of the institution’s collection. The grant, which came from the Manhattan Borough President Eric Adams, was announced last month and announced the grant recipients in January. “The Met is committed to supporting the collection of works by and preserving the extraordinary work of African American artists in New York City,” said city commissioner Daniel de Blasio. “This grant will allow our talented staff and our artists to continue to build upon the Met’s legacy of presenting works by artists whose contributions will help us to move forward in the right direction.”After the Met received the $1.5 million grant, it began working with the Sloss Museum of Art in the Bronx to redesign its collection and began the process of selling works on its website. The museum also set up a $500,000 fund to cover unforeseen circumstances, such as natural disasters.In a letter addressed to the Met’s collection managers, David Talbot, Stephen Friedman, and Peter W. Mullan", "The next Biennial should take place in the Congo. This year’s iteration will include the first series of lectures on the Congo at the newly opened Institute of African Studies, Paris. The charter of the event, titled “Conceptualization and Exploration of Africa” and published by the Biennial de Paris, reads: “Conceptualization of Africa: A Practical and Realist Approach,” in part: “What is Africa?” The lecture series will focus on “the process of dispossession, degradation, and dispossession and how this process affects the life and existence of the African people and the African continent.”\n\n\nWhile the world struggles to come to terms with the ongoing crisis in Flint, Michigan, the city of more than 1,400 people in the United States is preparing to welcome visitors to its parks, recreation areas, cultural sites, and historic sites. Starting on Saturday, March 14, the city will unveil a new five-year strategic plan for its parks and public spaces. The grand opening of the Flint Art Museum and the Riverwalk in Detroit is scheduled for March 16, but the museum and its surrounding area are currently closed due to the Covid-19 pandemic.", "The next Biennial should be a celebration of our common heritage with the work of the artist-class. I am very hopeful about the work of the artists in this exhibition.”The exhibition will be organized in partnership with the museum’s contemporary art and design programs and will open in 2022. \n\n\nArt Nouveau, a major New York institution that focuses exclusively on the development of new, experimental works, has announced that its director Dillian B. Harris will step down after twenty-five years at the helm in October. After a decade as director, Harris promised to continue experimenting with new materials and materials-based works and to expand the museum’s collection.“Dilan is an extraordinary visionary who has shaped Art Nouveau with a simple and radical vision: to be an extension of the artist’s life and culture, to be an extension of his or her spirit,” Josh Rovi, the museum’s artistic director, said in a statement. “Over the last ten years, he has positioned the museum as one of the major cultural centers of New York. To me, this is a major milestone.”The New York Times reports that Harris holds the record for most years as", "The next Biennial should have been staged in the summer, but was pushed back for safety reasons, and the first exhibition was postponed until early September. The organizers have since been working with local subcontractors to create a new exhibition space in the city, which will host the staging of the exhibition in September 2020.The new exhibition will explore issues such as resource depletion and climate change. “The exhibition will present the history of our planet, and will engage with issues such as the global dispersion of carbon in the atmosphere, how it is stored, used and released, and how we can affect this system for the betterment of our planet,” said Zoran Popovic, the director of the Konrad Adenauer Foundation for Scientific Research.The exhibition will also introduce young curators to the history of the work, with an introduction by the Italian artist , who created his first museum exhibition in the city in the early twentieth century. He was commissioned to create the show in the city in 1955 and returned to the city in 1958 to create a series of works that were exhibited at the next year’s Venice Biennale.The new exhibition will be inaugurated by an exhibition of works by the Italian photographer, Paolo Barbera, and will be followed by", "The next Biennial should be held in 2022.\n\nThe territory will be greatly expanded, with a total area of 1,400,000 square feet, and will sit at a land border with China, the Central Asian states and Russia\u0097the landmass of the mythical planet Yotamintsev\u0097at a cost of $3 billion. The new monument will be inaugurated by a ceremony in the capital, Beijing, and will commemorate the 112th anniversary of the Russian army.Following the ceremony, a ceremony marking the event will take place in the Forbidden City, Beijing. The site will also host a series of concerts, films, workshops, and other events.\n\n\nThe London-based charity the Royal Shakespeare Company (RSC), which has partnered with Ebony Art Museum in London to raise funds for the Museum of London, has revealed that it raised over £7 million for the British Museum during a ten-month fundraising campaign. The nonprofit organization was inspired by the British National Party (BN), which has held power in the UK since 2015 and has yet to be defeated in a general election. The partnership between the two organizations is part of a campaign to raise funds for British museums, which is supported by", "The next Biennial should be held in 2020, and the Museum of Contemporary Art (MoCA) in New York will host a new exhibition of work by the late artist Paul Gauguin in 2021.\n\n\nIn commemoration of the biennial’s twenty-fifth anniversary, the Santa Monica Museum of Art (SMCA) in California unveiled a new collection of Paul Gauguin’s paintings and sculptures on August 29. The exhibition features work from the artist’s final ninety-three-works, a selection that comprises works from the ’70s to the ’80s, and includes works from the ’70s to the ’90s. The exhibition also includes a new selection of works made in Paris in the 1970s, a selection of works made in the ’70s by a select group of contemporary artists that had relocated to the city during the artist’s lifetime, and a selection of works made in the ’70s and ’80s.The show’s curatorial team, led by David Grynbaum, selected the works by the artist’s immediate circle, including Jules and Hamou, his brothers, and other members of the family, and the", "The next Biennial should be held in 2021, and the twenty-second in 2024. \n\n\nThe Metropolitan Museum of Art in New York has added more than sixty artists to its roster since it reopened in April following a $1.1 billion expansion and renovation project, New York Magazine reports. The institution also announced the appointments of Sophie Ashery, Prudence Cardona, and Hélio Oiticica to its gallery roster, and of Angel Perez to the gallery roster.“On behalf of the executive board, I’m excited to welcome these artists to the gallery,” said Met director James Eggen. “These are some of the most promising and promising artists in the country, and we are eager to partner with them to help them realize their visions for their projects.”The artists were chosen from a pool of twenty-six applicants who were nominated by a panel of curators, scholars, and arts professionals. Each artist was given a minimum of two years of experience in the field, and were asked to demonstrate their expertise with works that were selected for the exhibition “The Future Is Present.” The artists were then invited to submit their work to the gallery for a retrospective that would open in January", "The next Biennial should take place in 2019.\n\n\nThe Santa Ana Museum of Art (S.A.M.A.) in Orange, California, has received a $50,000 donation from the Irving G. Goben Foundation. The gift, which comes on the heels of a $150,000 donation from the J. Paul Getty Trust in 2016, was made in recognition of the institution’s commitment to supporting artists and the careers of emerging and established artists.“We are thrilled that the Goben Foundation will support this year’s Biennial,” said Mark Granier, president of the museum. “The Goben Foundation is a significant supporter of the Museum of Modern Art (MoMA), which dedicated $50 million to create the Art Institute of Chicago in 2016. The Goben Foundation also directed and invested in the building and renovation of the Museum of Modern Art, which is the heart of the collection. The Goben Foundation is dedicated to supporting the artists who are making important contributions to the visual arts as they continue to shape their careers, and we are grateful.”\n\n\nThe American Artist (A) has named Mishael Shani as its next president and CEO. Shani comes to the organization from", "The next Biennial should be held in the spring of 2020.  “We are extremely proud of the work we have done to create a platform for underrecognized artists to be showcased in the United States,” said Mark Penn, chair of the board of trustees of the Biennale. “The Biennale is an unparalleled achievement in its own right, but it was not made possible without the generous support of our community. We are grateful to them for their unwavering dedication and appreciation.”The 2024 edition of the Biennale will take place at Washington, DC’s Lincoln Center from March 15 to March 17. The event will also be hosted at a number of other locations and venues in the United States as well as internationally. The full list of participating artists is as follows:\n\nArts\n\nArchitecture & Design\n\nArt and Design, History, and Design, Modernism, and Logical Design, Museum of Contemporary Art, New York (NYC) Artifacts: Art and Design, New York (NYC) Artifacts: Art and Design, New York (NYC) Artifacts: Art and Design, New York (NYC) Artifacts: ", "The next Biennial should aim to bring the collection of the Swiss artist and architect Lutz Bienstock, whose massive spaces are filled with works that make use of social media, the Bauhaus, the twentieth-century, and the contemporary. Bienstock’s works are scattered throughout the museum, which is known for its extensive collection of art from the 1930s to the 1980s. In addition to the painting, sculpture, and installation work, the collection includes works by artists such as Bertru and Alexander Calder; Alejandro Campos, a Rio de Janeiro native, and his wife, Carmen; and Hélio Oiticica, a Buenos Aires native and a Los Angeles native.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Larry Achiampong as its new deputy director and chief curator. Achiampong comes to the institution from the Metropolitan Museum of Art, where he has served as lead curator since 2012. He succeeds David Strathair, who was promoted to head of the museum in April 2019 following his departure from the Met in January 2021, and will assume his responsibilities in September.“We’re thrilled to welcome Larry and look forward to working with him,” said Michael", "The next Biennial should be held in 2021, said Locarno. “We are committed to continuing our work with the community to bring awareness to the biennial’s importance, as well as the other eleven themes of the exhibition. The current exhibition is a strong reflection of our exhibition and exhibition experience, and our wishes to, on the opening of the exhibition, create new and more diverse works. The Biennial is a vital and rich platform for the Arts, and is an opportunity for the public to see and experience the work of contemporary artists.”\n\n\nThe Metropolitan Museum of Art (the museum) in New York has appointed artist and curator Matt Walsh as the next director of the museum. Walsh joined the Met in 1981 as a curatorial assistant and is currently the program director of the exhibition program. He is also a curator at large-scale performance and performance-based space Design & Movement, where he serves as artistic director.“I’ve been a big fan of Matt’s work for years,” said museum director Daniel H. Weiss. “He has been a true visionary behind the museum’s programming, and I’m excited to see what he creates next.”The museum added", "The next Biennial should take place at the Palazzo Grassi in Venice in 2022 and will be hosted by the Italian architect Carlo Cipolletta.\n\n\nThe Italian artist and academic Gerhard Richter, who was one of the most influential practitioners of the Gilded Age and the Sculpture Age and whose work is still being studied by scholars, has died at age eighty-eight at his home in Milan.Born in the city of Novara in northern Italy in 1923, Richter studied at the prestigious Palazzo Grassi Academy and at the Academy of Art in Venice, where he was a pupil of Giotto. In the 1950s, he moved to the city of Turin, where he worked as a professor of the art of cinema and as a curator of the Sculpture Age, while also teaching at the University of Milan.In a 1995 interview with Robert Schumann, Richter told the New York Times that he wished he had studied with the legendary Italian architect Ma’suza, who made the Sculpture Age landmark projects such as the MÜTRINA, a thirteen-thousand-foot sculpture of the Virgin Mary, in the form of a boat, and the MÜNICA", "The next Biennial should take place in Los Angeles in 2022. The 2018 event, titled “Our Place,” featured works by seventy-three contemporary artists in a special exhibition at the Los Angeles County Museum of Art (LACMA). The museum held a portion of the inaugural exhibition, titled “The Surreal Life of the Body: From Michelangelo’s The Creation of Woman, 1972, to Agrès Polidoro’s The Psychophysical Body of Pablo Picasso, 1968, at the Museum of Contemporary Art (LACMA), in the same year. The 2019 event, titled “The Body Artist,” featured work by twenty-eight artists. The 2020 event, “The Body in Time,” will be housed in the same building as the inaugural event. The 2020 Artists in Motion,” will take place in March, 2020. The 2020 Artists in Motion,“The Body in Time,” will be held at the LACMA Art Museum, alongside the 2017 iteration of the event. The 2020 event will also feature works by twenty-four artists. The 2020 event will include a residency program organized by the artist-", "The next Biennial should take place sometime after Labor Day, in the spring. During that time, the exhibition will include works by twenty-nine artists who have been selected by an international jury, which was chaired by the curator Martin Schoelkopf, and will include an exhibition of the work of artist Horst Seeger as well as a reconstruction of the locus classicus, a Roman abode of the ancient Roman people, within the Temple of the Immaculate Heart of Mary in Rome.“The Best of the Works of the Mecana Group is a great honor and pleasure to present to you, as we are honored to collaborate with you, and to present the works of twenty-nine artists who have made an indelible mark on the world. We hope to see you in June. We look forward to welcoming you to our exhibition in the spring of 2020. We hope you enjoy the show.”\n\n\nThe Netherlands has approved a new law that will allow the Dutch government to seize private property seized by Syrian authorities. The controversial legislation, which was passed by the Dutch parliament on Thursday, stipulates that a private party has the right to remove an immovable object that is held in detention, such as a person or", "The next Biennial should focus on “the process of the craft as it relates to its surroundings, with a view to promoting awareness of the interconnectedness of human life.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has announced that it is making a strategic move to shift its collection from its current location in downtown Los Angeles to the Santa Monica Museum of Art (SMO). The move is part of a $250 million capital campaign aimed at transforming the institution, which recently underwent a $150 million expansion.“We are not eliminating the museum, but we are moving it to a new home,” said museum director Marc Glimcher. “SMO has been an important center for science, technology, and art, and we are excited to build on the legacy of Henry Luce.”In a statement, the museum said it is “engaging a number of institutional and private sector players to further explore the opportunities for mass transit, sustainability, and transportation,” and that the board of trustees “have adopted a new strategic plan that outlines how we move forward in the next twelve months.” The plan also outlines how the museum will refocus on its history and future exhibitions and on the arts", "The next Biennial should take place at the Palazzo Mediterraneo in Venice, Italy, in April 2020. It will then return to New York for a second edition in June 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it will honor three women artists whose contributions are currently underrecognized in the United States: Christie J. Posen, Njideka Akunyili and Melissa Chiu. The show will be organized as follows: 1. The Anti-Sulami Affair, 2. Zora Neale Hurston: A Tale of Two Sisters, 3. Ralph Ellison: A Modern Day Rape (1962)\n\n\n\n\n\nCarrie Mae Weems, Warren Kanders, and Terence McKenna are among the artists whose works were featured in this year’s Whitney Biennial, which closed on Monday, March 6. The biennial, which was co-organized by the Whitney Museum of American Art and the Metropolitan Museum of Art in New York, featured works by forty-four artists and was organized as a way to honor the LGBT++ community and reflect on the history of the biennial.“I’ve", "The next Biennial should be held in 2022. \nThe biennial will focus on how art museums are responding to the economic and social challenges posed by the pandemic, with a view to understanding how art institutions, both large and small, moving into and out of collections, and the artistic practice of museums, can affect their cultural and financial well-being.  \n\n\nThe Institute of Contemporary Arts (ICA) in London has announced that it plans to move the exhibition “Paintings in Motion” from its venue in the city’s Portcullises to the Museum of London to commemorate the centenary of the birth of British artist Elyn Zimmerman. The exhibition, which is currently on view through March 7, will be relocated from its current home in the Barbican, London, by the end of the year. “Paintings in Motion” was founded by Elyn Zimmerman in 1939 at the London School of Economics. The exhibition has since expanded to include works from the Contemporary African Diaspora (CAFAD), including works by Ivana Naidoo, Nusseibeh Darweesh, and Saara al-Kindi, as well as works by artists whose work traces its history back to African", "The next Biennial should take place at the institute in the autumn of 2020, and will receive an initial grant of $10,000 from the J. Paul Getty Trust.The project was inspired by the work of artist and educator, Robert Irwin, in his exhibition “The Golem.” In an article published in 2014 by the artist in the June/July issue of Artforum, he described the preparation for the exhibition as a “disaster.” Biennial director Pamela Cahn-Armstrong said that the project is an “unfinished work.”\n\n\nThe Museum of Art in New York has unveiled a new series of exhibitions dedicated to the art of photography, each featuring thirty selections from a catalog that was acquired by the institution in 2017. “We are thrilled to present this new initiative, which builds on the museum’s global tradition of supporting the art of photography,” said Carolyn Polizzano, chair of the exhibition program. “With the acquisition of thirty photography exhibitions, the Museum of Art is continuing to expand its direct relationship with photographers, and to deepen our understanding of their artistic vision and craft. The new series will present a curated selection of photography exhibitions that reflect both new and extraordinary perspectives on", "The next Biennial should take place in the fall of 2020. The announcement was made at a meeting of the international committee of world experts on the history of art, titled “Reconstructing the Past: Art and the Origins of Human Art” at the Massachusetts Institute of Technology (MIT) in Cambridge, Massachusetts, on March 2.The exhibition will examine the history of art from the 12th to the 21st centuries, and will deal with art and art history from a number of different perspectives, including the past, present, and future. The upcoming edition of the biennial will include the works of thirty-eight artists and will be held at the Bande Ville in Zagreb, Croatia, from April 27 to June 22.The artist-run museums in the city of Zagreb, which was founded by Croatian immigrants in 1914, are working hard to promote their collections as places where visitors can be reunited with their ancestors. Among the museums participating in the upcoming edition of the exhibition are the Museum of Modern Art, the Museum of Modern Art, the Museo Nacional Centro de Artes in Madrid, and the Museo Política in Barranquilla.The upcoming edition of the biennial will take several cues", "The next Biennial should take place in 2020. The Biennial is a partnership between the Art Newspaper and the Art Newspaper of Canada. The inaugural Exhibition was held at the CMHC in Vancouver, Canada, in February 2017. The biennial will be held simultaneously in the United States and Canada.\n\n\nThe Ladies’ Own Art Museum (L.O.M.) in New York has received a gift of twenty-eight works from the Women’s Studies Center at Columbia College Chicago (CACUC)\u0097a campus-wide initiative that has fostered engagement and scholarship since it was founded in 2005.The gift arrived in the form of a set of three sets of new paintings by artist Annie Prouvé\u0097Sophia, who died in 1996\u0097in the form of a letter from UNICEF.“The series, which consist of works by some sixty artists from twenty-eight countries and territories, is a celebration of the decades of work that have been dedicated to women’s issues,” said L.A. County commissioner Tom Finkelpearl, chair of the city council. “This is a beautiful testament to the many women artists whose practice has inspired me as a city and a country", "The next Biennial should be held in 2030. Kunsthal Charlottenborg, the city of Oslo, said that it anticipates a 2019 opening and will have more information to share with the public, including when the next edition will take place.The art, which features around 1,500 objects from around the world, was selected by a jury of art-world experts, including David C. Dutton, director of New York’s Metropolitan Museum of Art; Øystein Hawke, president of the Norwegian Institute of Art; and A. Michael Kahler, a retired professor of art history at the University of Washington in Seattle. The jury was led by Fredrik Kräger, a curator at the Museum of Modern Art in New York; Anna Ludvig, director of the Museum of Contemporary Art Copenhagen; and Peter Morley, director of the Musée d’Arles, in Paris. “The show is not only an international exploration of the art world’s contemporary, but also an exploration of how art and artmaking are philosophical, politically and historically linked. We are eager to see what the future holds for the exhibition,” said Arne Laverrière,"]