["The next Biennial should take place in the fall of 2021. Schäfer and his colleagues believe that the image of a large-scale public installation of the works in a way that might participate in the political and cultural process, and engage with issues of climate change, will lend itself well to a global audience.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift that will allow it to reopen to the public for a second year in a row. The gift, which is valued at between $3 million and $5 million, is a public sculpture that will sit above the entrance to the former Liverpool Ship Canal, built in 1957, and will feature an excerpt from the novel The Last Unicorn (1954), a play about a magical unicorn called in honor of Shepard Fairey, played by Louise Brekely.Featuring the work of artist and activist Shimon Procter, it will be named after Daniel Quinn, a supporter of the Black Lives Matter movement who was killed by the police in Minnesota last month. Quinn was a devoted member of the arts community who was active in numerous civic organizations, including the nonprofit the Showroom, the Los Angeles Public Library, and the Los Angeles County Museum of Art, and was", "The next Biennial should take place at the Museum of Contemporary Art in Los Angeles. The next iteration of the 2020 event will be held in London in March.In a letter to the museum, the artist and avid collector said: “I enjoy this time of year to appreciate the beauty of the weather, the beauty of the people, the beauty of the scenery, the beauty of the people’s art, and the beauty of the sun. I appreciate that the biennial is a platform for me, a platform for the rest of us to come together. And as I am a self-taught artist, this is a platform for me to develop.”\n\n\nThe Metropolitan Museum of Art (Met), the Museum of Modern Art (MoMA), and the Whitney Museum of American Art in New York are among the major cultural institutions that are planning to shutter because of the coronavirus epidemic. The museums say the closures will save the public and museums millions of dollars in operating costs. However, the closures have raised concerns that the move will cause irreparable damage to the cultural heritage sites and the Met’s historic buildings.“We are acutely aware of the cultural and historical significance of the sites in New York City, and the impact of", "The next Biennial should also include a survey of British art from the 1950s to the present day, a presentation of a selection of work by the late British artist Willem de Kooning, and a discussion of the exhibition of The Destroyer in 2006 at the Biennale of London. The 2020 theme will be The Future Is Present. \n\n\nDedrick Birnbaum has been appointed the curator-at-large of the 55th Venice Biennale, which will take up the theme The Future Is Present, in 2020. Birnbaum comes to the Biennale from the Düsseldorf Museum of Art, where he has served as an assistant curator since 2003. He was recently commissioned as the curator-at-large for the 2017 edition of the Biennale, which is currently underway in Portugal.“This is a very challenging moment for art history,” Birnbaum said. “The opening of the show that was canceled has opened up a new dynamic, a new kind of interaction between art and the public, and I am eager to see what this new combination will bring.” His first show at the next edition of the show is slated to open in the fall of 2022.", "The next Biennial should take place in the spring of 2020, when the exhibition will be staged in conjunction with the biennial of classic and contemporary art, the Seattle Art Museum (SAM), which is slated to begin on February 16.The announcement follows the completion of a budget-neutral initiative to reinstate a pro-life museum in Oklahoma City. In the works of the artist-in-residence Atisha Harris, the museum’s location in the city’s historic Ellington neighborhood, which is currently being renovated, the institution will showcase the work of women artists on a mission to promote their creative practices.It is intended that the new museum, which will be located in the former Ellington Theater District and will feature a combination of public and private galleries, will become a space for dialogue with local, state, and federal lawmakers regarding issues of reproductive health and human life. The move comes in the wake of the wave of anti-abortion legislation that has been enacted in the United States since the beginning of the year. According to the Guttmacher Institute, more than one hundred states have introduced or are introducing legislation that would outlaw abortion, restrict a woman’s access to family planning services, and criminalize abortions. The American Civil", "The next Biennial should come as no surprise to anyone who has followed today’s events closely. After all, the US government, through the COVID-19 Emergency Response Fund, announced a $1.2 billion relief plan for the US auto industry on March 7. It also committed $600 million to states and local governments, and $200 million to shoring up the nation’s crumbling infrastructure.In support of the auto industry and the fossil fuel industry, the government has been slashing funding for vital public and non-profit arts and cultural organizations. The US Conference of Mayors (USCA), in Los Angeles, declared bankruptcy on March 15. The February 26 launch of the Mayhem Fund for Arts and Heritage, a $10 million emergency relief initiative, was also canceled. The Ford Foundation, the Robert Rauschenberg Foundation, and the Andy Warhol Foundation—all accused of fueling the climate crisis—filed for bankruptcy protection last week.As the world recovers from the COVID-19 outbreak, the International Committee of Museums (ICOM) is urging the United States to do more to protect the environment—specifically, by creating new laws that can be enforced and that provide billions of", "The next Biennial should take place at the Institut d'Études Politiques (EP), Paris, in 2020. \n\n\nLondon’s Tate Modern has announced that it will cease operations at the center, which comprises three buildings located on the site of Tate Britain, next month. The Tate said that the decision to cease operations was made following a “rigorous and in-depth review of the institution’s future prospects.”Tate director Maria Balshaw said that the decision “presents a challenge both exciting and unprecedented.” “It is a challenge that we cannot, as a society, take lightly.”Balshaw added that the decision “does not come as a surprise to us, or to anyone involved in the creative life of Tate, but it is something we have to confront. We must now look to the future.”Previously, the Tate has been able to open new exhibitions or branch out into new areas of research through the institution’s London and Scottish locations, as well as its new headquarters in China.\n\n\nBillionaire collector Pierre Pinault has been arrested in France for alleged fraud after the Paris court found that he stole more than $50 billion", "The next Biennial should commence in 2020.  The institution, which was founded in 1976 by a group of art historians, is planning to reopen in 2022. The Metropolitan Museum of Art, the New Museum, and the Metropolitan Opera House are also actively working to find ways to reduce their carbon footprints by shifting their programming to minimize consumption by the masses.While art museums and other cultural sites have made significant strides in reducing their environmental impacts, such efforts are not without their critics. Some environmentalists have argued that the museums are not doing enough to offset the climate crisis, and others have alleged that the reductionist practices of the institutions are in violation of the Paris Agreement. The United Kingdom announced this week that it is planning to pull the plug on its annual Great British Bake Off, which has dubbed for a reduction in greenhouse gas emissions. The event is set to kick off in February.\n\n\nBradley Kerkhoff, the former director of the contemporary art museum Philadelphia who was fired last month after he criticized its leadership and encouraged employees to speak out against his removal from the helm, has been appointed director of the Tucson Museum of Art (TMA) in Arizona. Kerkhoff has been the director of the museum for only five months, but his tenure has already sparked", "The next Biennial should be announced as soon as possible to avoid disruption to the academic year. The site for the exhibition will be announced in due course. The 2019 edition will be held at the Museums House in central London from October 20 to October 23. \n\n\nThe Museums Association (MA), an international organization representing more than 3,500 museum directors across the United States, has launched a new platform for online audience participation. The MA’s video platform, Artmd, will allow visitors to view a selection of videos by participating museums, including the Metropolitan Museum of Art, the Hirshhorn Museum, the Metropolitan Museum of Art, and the Whitney Museum of American Art. The platform will also present a curated selection of works by participating artists in a variety of media. The program will run for several weeks, from November 13 to November 23, 2020.“The MA’s Artmd platform is a great way for museums and collectors to display their works in an online format,” said James Cuno, president and CEO of the MA. “The platform has provided a new and unique audience level for the medium of video as well as a great way for collectors to engage with and explore highly-acclaimed works. We are proud", "The next Biennial should be held in the spring of 2022. The biennial will be a collaboration between the Museums House, the Sculpture Institute, and the Royal Academy of Arts. The six artists chosen to represent Britain at the 2020 event are Andy Massey, Jamie Squire, Ermanno Cattelan, David McManamon, and Yinka Shonibare. The 2019 edition featured the work of three British artists: Ben Jassal, David Hockney, and Robert Bridge. This year’s Biennial will be held at the Tate in London.\n\n\nAmerican artist Carlotta Dali, a pioneer of the modernist movement whose work explores the notion of form as well as color and form, has died at seventy-six years old. The artist's enduring legacy consists of forty-two paintings and drawings, as well as the monumental work The Birth of Venus, 1949, a performance piece composed of three sepia-toned Polaroids taken by Dali herself.Born in New York City in 1937, Dali studied under Frank Stella at the Yale University, where she eventually earned her bachelor’s degree in 1953. Dali went on to study under John Cage at the Los Angeles", "The next Biennial should be in 2020, and the first half of that year should be devoted to exhibitions, performances, and public programs, with the remainder of the year devoted to education and research.The next edition of the Museum Biennale will be held at the Biennale Foundation in Milan, the Museum Largo in Venice, and the São Paulo Museum of Art, the Museum Bultmann in Zurich, and the Museo Oeste in Porto, Portugal.\n\n\nThe Victorian-era textile and wallpaper maker John Janssen has died at age seventy-three at his home in London. The cause of death was emphysema, according to the New York Times, and the cause of death was almost certainly hypothermia.Janssen was born in Liverpool in 1932. After receiving his bachelor’s degree in 1929 from the University of Liverpool, he moved to London, where he studied under the tutelage of the British textile artist Alice Cooper. Janssen returned to Liverpool in 1943, where, having completed his degree in 1948, he enrolled in the art school at the University of Manchester. He enrolled in art at the University of Bristol in 1948, and then at the University of Sussex in 1951. He continued his", "The next Biennial should be held at least once a decade to include work by a new generation of artists. The next edition will also introduce a new stage, called the Biennial Hour, that will be a platform for new work, an event that will also include a series of talks that will strengthen the theme of the biennial, the historical events of the year, and the exhibition of works from the past.The biennial will be held in the exhibition hall of the National Museum of Modern and Contemporary Art (MMCA) in Cleveland from March 14–March 20, 2020 and will be modeled after the museum’s biennial in 1964. The museum will retain its core collection, but will organize a number of exhibitions and a number of events around the theme. The Central Library will also remain open and will continue to be a venue for programming.Inaugurating the museum is the installation of a new work by the artist Lourdes Cruz, whose work is based on a question of how we define art, and the German artist and architect Holger Heim, who is designing a new institution to house the collection. New content in the exhibition will be introduced in the second half of the year, the exhibition will open in October, and it will be", "The next Biennial should examine the long-term impact of the institution’s renovations on the museum’s collection, its collection of art, and the collection of public art. The biennial will be held in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is making several changes to its collection, including the addition of new works by artists such as Nadine Vermeer, Bref Kénow, and Judith and Wangechi Mutu, and the retention of works that have been in storage or that have never been viewed.The museum is continuing to rebalance its holdings of modern and contemporary art, which currently total more than twenty thousand works, in an effort to increase the museum’s holdings of work by African American artists. In June, the museum also unveiled its first community art project, an exhibition of work by black and indigenous artists that was inspired by a meeting between MoMA curators Rosalind Russell, Tanya Verma, and Michele Warren, and the Black Panthers. The work, titled Ain't No Man, was displayed in the exhibition “Beyond the Ellipse” (2018–19) and was selected for a 2019 Whitney Bi", "The next Biennial should take place in 2022.\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than 1,000 works from the Fine Arts Research Institute (FARI), which was established by John and Marian Macomber in 1978. The gift includes 1,000 photographs by Dorothea Rockburne, whose work is currently on display in the new collection, and forty-six works by artists who have been understudied or unknown to scholars.The donation includes photographs by Emma Death, whose work is currently on display in the new collection, and twenty-four works by artists who have been neglected or unknown to scholars. The works are from the series “On a Pangaea,” which Garth Davis (1907–1977) curated. The artist’s father was the late Louis Death, the founder of the New York–based Museum of Modern Art and the Alfred P. Murrow–designed studio where Death painted the works.In a letter to the Macomber family, John and Marian Macomber wrote: “We were immensely proud of the gifts that the FARI provided to the museum in the 1980s and 1990s, but our gratitude for the extraordinary support", "The next Biennial should take place in 2020. \n\n\nThe Brooklyn-based nonprofit The Rebuild Project, which strives to alleviate homelessness and promote social justice through art and design, has announced that it is taking down three buildings in downtown Manhattan and reopening the spaces in some of the buildings under the leadership of a single organization. The groundbreaking project, which will restore some of the spaces to historic use, is part of a larger redevelopment plan that will also involve the demolition of the nearby Power Plant and the construction of hundreds of apartments and townhouses.According to the New York Times, the organization will be implementing a new three-year strategy that will prioritize the creation of jobs and the reopening of other neighborhoods in the city, including in and around Fort Greene, which has been a hotspot for homelessness. The redevelopment plan was first announced in September 2019, and the first phase of the project, called the Project for Reconnecting Communities, was completed in October 2020. The second phase, called the Neighborhood Restitution Initiative, was completed last May, and the third phase, called the Neighborhood Rebuild, was completed this June.The agency will begin by demolishing the historic buildings in the Power Plant and will then convert a portion of the site into a community", "The next Biennial should take place at the Ritz in Berlin, and the next at the Museum of Modern Art, New York, in 2021.  In the meantime, the exhibition will continue to be organized as such, with the same team, the same curators, and the same budgets, until the exhibition of the exhibition space in Kiel in 2020. Thomas Jakob, director of the Monte Carlo Center for Contemporary Art and the president of the German State German Galerie Ludwig, said: “Over the years, the Ritz, the Rijks, and the Museum Ludwig have demonstrated their commitment to the exhibition and collection of contemporary art by building relationships with important contemporary artists in the German city of Kiel, and the collection of art in Kiel by a select group of artists from the city. I am very pleased that the Ritz and the Muse Ludwig are finally committed to the international promotion of works by the following artists: Alfred Paris, Joachim Neugroschel, Sara-Lynne Sanz, and Louis Vuitton.”\n\n\nAlexandra Boesky, the director of the Center for Biennial Studies at the Museum of Modern Art in New York, has been appointed the", "The next Biennial should feature the work of a select group of artists who have received the highest mark since the institution’s founding, including Felix De Pauw and Hans Ulrich Obrist, who will both be featured in a future edition. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has launched a $1 million fund for artists whose works were previously on display in the museum’s exhibition “Art for Peace,” which closed in January 2019, as part of its ongoing efforts to engage with issues of peace and conflict around the world. The fund will be administered by the Maya Fund, the nonprofit organization that works with indigenous artists in the US on a nationwide level.“The museum has long recognized that peace and art are central to understanding and celebrating human values and experiences,” said Maya Fund’s Executive Director, Noah Hershman. “With this new fund, we are able to support the work of a select group of artists whose work we are passionate about and believe has the potential to profoundly change our understanding of the world.” The fund was established in response to the current crisis in Puerto Rico, which has been beset by protracted conflict between residents of the US territory and federal", "The next Biennial should take place in September 2021. The 2020 edition will be held at the Guggenheim in New York from September 12–September 14.  The upcoming exhibition, titled Art, Politics, and the Presidency, will be held at the Art Institute of Chicago from March 11–March 13.  The ten artists who received the $3 million prize in 2018 will be announced in October.\n\n\nPhotosynthetic biologist Tejal Shah, who has been featured prominently in the recent international art and science fairs in China and the United States, has been appointed the new managing director of the National Museum of China Art and Science (NMCAS). Shah will take up the post in October.“Tejal Shah’s leadership and expertise in this field will be essential for NMCAS to be able to present a truly international level exhibition in the future,” said Museum Director Dr. Lawrence Guggenheim, who has led NMCAS since its founding in 1994. “Indeed, he has been instrumental in establishing the museum’s international reputation. He has done this by establishing an innovative, high-quality platform for exhibition-making that has attracted large international crowds, developing", "The next Biennial should inaugurate the new Science Museum, which will boast a 5,000-square-foot public space and a collection of 200,000 photographs taken by the artist. The institution will also host a series of exhibitions that will focus on the work of the artist’s contemporaries and showcase the work of artists who have contributed to Italy since the 1970s.Daniela Pindell, artistic director of the Museo del Biennale d'Artes, said: “In a time when cultural institutions are increasingly controlled by private interests, and when museums are increasingly detached from the urban fabric, it is of the utmost importance for a new generation of artists to be able to connect with their surroundings and their surroundings only, and to have their images and their stories told through means that are accessible to everyone. We are now at a critical moment, when an unprecedented number of artists is facing unprecedented challenges, so we are eager to present this important work of the past together with the future in mind.”\n\n\nThe Bicentennial of the School of Art, Architecture, and Design (Sappho) in Venice has announced that it has received a significant donation of twenty-five works from the late Italian architect Roberto Cicutto and twenty", "The next Biennial should have been the same, but now I need your help. I need your patience. I need your support. I need your creative input. I want to create something for the people of New Orleans.”He also expressed a desire to work with some of the city’s art workers to create more affordable homes for artists, and an art museum that will extend the reach of the city’s art. The institution will also have a café, a library, and a craft space. The first phase of the project is slated to run until May 2021. The second phase is scheduled for June 2021 and will be funded through a combination of donations, profits, and rents. The museum will also rely on donations for funds for the acquisition of works and other items, and will work with local businesses to connect to the Biennial’s programming.The building’s art-historical display will be curated by Artadia founder and composer Kamel Morsy, who previously curated the Venice Biennale. Morsy will work with artist Daniel H. Abraham, whose work is currently on display in “The Art of San Francisco,” to develop the theme for the Biennial. For the exhibition", "The next Biennial should make the work of the exhibition itself accessible to the general public. The biennial should aim to create a more integrated exhibition of contemporary art. It should also reflect the diversity of our society.”\n\n\nThe School of the Art Institute of Chicago (SAIC) announced today that it is meeting with students this fall to discuss the possibility of offering a new series of annual lectures on the history of art and architecture on the campus of the university. The program, which will be organized in phases, will be led by Clare Dimmock, the dean of the school’s art, design, and design history program, and will be led by a faculty committee.“The current tour of the campus is a great success, with more than 1,200 students having taken part,” said Domenick Glimcher, who will serve as cochair for the tour. “We know that there is much more work to do, and the current tour is a great success, so we are excited to continue to develop and deliver courses that are challenging students to think beyond the current construction and make the most of their time on campus.”Glimcher added that the tour will be structured around the “memory of", "The next Biennial should invite some of the artists who have produced most significant works from this time and will bring them together to address the challenges of our time.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has offered an additional $2 million to support artists in its next biennial. Applicants must be artists or creatives working in the cultural sector and have completed a two-year residency at the institution since January 2019. The deadline to register for the next edition of the MCA Divan is May 29.“We are thrilled to see how our artists are using the funds and are committed to working with all of our artists in support of their creative endeavors,” said Tom Schäfer, director of the museum and chair of the board of trustees. “MoCA’s artists are creating enriching and powerful work around contemporary issues, and the funding will allow them to extend their programs into 2020.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Cristina M. El Gigante as its next executive director. El Gigante succeeds Mary Ceruti, who has helmed the museum since 2016, and will assume her responsibilities on July 1. “Crist", "The next Biennial should be held at the gallery in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Charlotte Roesler as its new deputy director for curatorial affairs and chief curator. Roesler will be responsible for coordinating the activities of more than sixty artists and organizations that have participated in the museum’s annual “Art of the Year” award, which recognizes the most innovative work in the museum’s collection. She was also selected to serve on the board of the Frieze Prize for Art, and will take up the post this month.“I’m thrilled to be joining MoCA as it continues to create new and exciting works in its permanent collection with the art of the year award,” Roesler said. “The museum’s artists have shown us their work in exhibitions over the years, and we’re proud to support them in their pursuit of furthering their careers and creating new works as part of the acquisition process. I’m eager to collaborate with my colleagues and the museum in a way that will elevate the gallery’s mission, and help us meet the needs of our growing gallery.”Roesler", "The next Biennial should be in 2021.\n\n\nThe London-based nonprofit Art Fund has announced that it is raising funds for the next edition of the London Biennial, which will take place on September 15, 2020. The organization will distribute $1.2 million to support a range of projects, including the restoration of a Victorian railroad in south London, the development of a new exhibition format for the London Film Festival, and the preservation of the Central Library, which is slated to be demolished to make way for the construction of new housing. “The London Biennial is an extraordinary and enduring undertaking,” said Art Fund director Maria Balshaw. “This year’s event will be a landmark in the collection of the museum, at a crucial point in its history, as it enters its fiftieth year. We know that some of the most important work of the past will be lost to demolition, and so we are working with the government and local authorities to ensure that the biennial is preserved as an extraordinary collection and accessible to the widest possible audience.”The biennial will be inaugurated with the introduction of the new exhibition series “The London Underground: 1918–2019. For the first time, the biennial", "The next Biennial should take place at least six months from now, and should be a response to the current geopolitical situation. We hope that the world will join us in our efforts to address the global challenges of climate change, and that in the process we inspire more creative thinking, creativity and resilience.\n\n\nThe Carnegie Museum of Art in Pittsburgh has named Arsht Alder as its new executive director. Alder comes to the institution from the New Museum in New York, where she has served as associate curator of modern African art, and will assume the new position in January 2020. She succeeds Peter Wiltse Gibson, who retired in May after nearly four decades as director of the museum.“Arsht's approach to curating the Carnegie Museum of Art has been to create an ongoing project for a number of years that engages directly with the body of work and history of art in Los Angeles,” Gibson said in a statement. “Her work has been inspired by her own experiences growing up in the Detroit urban core and her years as a museum specialist at the Detroit Institute of Arts. Her dedication, enthusiasm and ability to prioritize the long-term success of the museum was unparalleled.”Gibson had previously served as a cur", "The next Biennial should be held in 2022.\n\n\nArtists who are collaborating to raise money for Hurricane Harvey relief organizations in the United States are creating new crowdfunding sites and offer rewards.Some have started offering rewards that can include physical goods, such as art, furniture, and photography equipment, while others are offering to compensate artists for lost income.On Monday, more than fifty artists—including Tarek Atoui, Adrienne Edwards, Craig Goodpasture, and Kiki Smith, as well as the artist-run crowdfunding platform KeepArtInTheTurn, launched rewards sites that promise rewards ranging from $10,000 to $100,000.“This storm has made clear that we are nowhere near being able to rebuild without your help,” said David McAllister, the CEO of the nonprofit Center for American Art. “We are working with a network of people who are united by a common goal: to help make sure everyone in Texas has access to relief funds, and that we are able to do so safely and effectively.”The relief efforts of the National Association of Home Builders (NADA) and the National Association of Realtors (NAR) are being assisted by a coalition of local,", "The next Biennial should take place in Beijing in the spring of 2020. The first show, titled “Taking Stock of the Present,” will cover the years 1917–1935, and will be on view until January 8, 2020. The second exhibition, titled “Ascension of the Spirit,” will be on view until May 28, 2020, and will run until October 30, 2020.The Beijing Biennale will be held in two phases. In the first phase, the exhibition will engage with concepts such as the infinite, the relationship between art and culture, and the art and culture as a unity. The exhibition will also introduce a new educational program, called the Beijing Art Talk, which will be presented by a Chinese artist from the West, and will present an exhibition of works by French artist Philippe Vuillard, whose works were exhibited at the Venice Biennale in 2006 and 2008, respectively.\n\n\nThe Pennsylvania Academy of Fine Arts (PAFA), the Pennsylvania School of Art (PSA), and the Pennsylvania Museum of Art (PMA) in Philadelphia have joined forces to create the first national center dedicated to the study of modern art and design, The Modern Art Museum. Its inaugural exhibition, “The Modern Icon,", "The next Biennial should take place in 2021. This is the year of the twentieth century, after all, and art is full of possibilities. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is increasing its budget by $15 million to $150 million in 2019. The institution currently has $125 million to spend this year. Its next budget cycle will begin on October 25 and run through April 10, 2020.“We are excited to see how this year’s budget will expand once we complete a major renovation of the museum and reopen to the public in May 2020,” said museum director Michael Govan. “We are fully committed to supporting MoCA’s unique mission of showcasing the latest and greatest art and arts in the city, as well as the vital work of California’s most respected and highly regarded artists. We are confident that this budget will deliver that opportunity and continue to deliver for the hundreds of artists who have made the Museum a home for their work since its founding in 1938.”The budget includes funding for MoCA’s 2019–20 season with a special event organized by artist and curator Anthony Burch. The event will take place at the MoCA in", "The next Biennial should be held at the city’s Art Museum in 2021, and the venue should receive a new City-funded $8 million grant from the San Francisco Arts and Circulator (SFAC), which is administered by the City of San Francisco.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, the Palm Springs Art Museum, and the Memphis Museum of Art in Tennessee announced today that they are teaming up to create one of the largest public investments in the history of their respective cities. The projects will provide $1.3 billion in relief to California’s endemic, chronic and seemingly intractable homelessness crisis, and will be coordinated through the city’s Department of Housing and Community Development.The organizations’ announcement follows the announcement of the cities’ first Homeless Connections Action Plans (HCAPs), which outline how the city can reduce its homelessness population by at least 80 percent and continue to host large scale events and social distancing programs in order to reduce the city’s annual bill by $1.1 billion over the next ten years.“We’re going to apply every conceivable resource at our disposal to try to reverse the trend of evictions and homelessness in California,�", "The next Biennial should take place in the spring of 2021. The theme of this year’s event, “The Future is Present,” is “The Last Human Being.”\n\n\nThe Museum of Art (MoA) in New York has appointed Amanda Sharp as its next director. As cochair of the board of trustees of the organization, which was formed in 1999, Sharp has curated numerous exhibitions and events that have explored art and art history in the United States and around the world. Previously, Sharp was the director of the Martha Graham Center for Art and the Visual Arts at the University of Central Florida, where she served as interim director for three years.“Amanda’s history at MoA is rich and inspiring, so we’re thrilled to welcome her to the organization,” said executive director Christopher Bedford. “Amanda’s leadership qualities, her vision for the future of MoA and our collection, and our community are truly inspiring. Her leadership is ideal for our new visionary and creative board and staff, which embodies the values and values of MoA and the greater Bay Area. We look forward to working with Amanda to ensure that MoA is well positioned to further expand and strengthen its", "The next Biennial should be held in the spring of 2021. \n\nFor the first time in its sixty-eight-year history, the Smithsonian Institution in Washington, DC, will be celebrating its fiftieth anniversary this year. The institution—which was founded in 1912 as part of the revitalization of the city’s Old Post Office—has been a center of cultural activity in the DC region since President Franklin Delano Roosevelt signed a landmark law in 1939 that established the National Museum of American Art. The building, which still bears his name, was completed in 1948 and was the site of numerous public programming and exhibitions, including the “American Artists” “Dream On: Tales of American Painting” (2013–14), “American Painters: Their Lives and Art” (2016–17), and “How American Painting Changed the World” (2019).In honor of the institution’s centennial, which will take up themes of the ’60s and ’70s, the biennial will comprise: The Making of American Art, 25 Years of Biennial Programming, “The Future of American Art,” and “The Art of American Life.”", "The next Biennial should have been dedicated to the sad and painful history of censorship in the Philippines. It should have been about the anti-democratic, anti-socialist policies and abuses perpetrated by the government of President Rodrigo Duterte. It should have been about the way the government is treating its own citizens, especially the poor and Indigenous, and is using the death penalty. And it should have been about the creative and innovative work of the artists and other curators who have risked their lives to make a statement about the human rights abuses that have taken place since Duterte assumed office in Davao City.Instead, the 20th edition of the Biennale of Sydney was hijacked by extremists in the Muslim-dominated country of Papua New Guinea. Led by the Islamic State, which declared a caliphate across parts of Syria and Iraq in 2014, the group of armed militants eventually overran the Australian town of Bali, and declared an Islamic state in the territory under its control. They have since besieged the Australian embassy in Manus Island, and have been threatening to launch attacks on government facilities in Sydney and Melbourne until the foreign workers are expelled.After refugees and asylum seekers staged a massive protest against the camp in Papua New Guinea on March 23, Australian Prime Minister Scott Morrison declared an emergency state", "The next Biennial should take place at a location that supports local, independent, and sustainable artistic endeavors. The artwork to be moved from the site should be transformative, and should be set in a location that provides access to a wide range of artistic practices. The theme of the exhibition should reflect the richness, diversity, and dynamism of contemporary South American art. The selected exhibition should be comprised of a variety of works, including work by artists who are excluded from the official list of the Biennial for this year’s edition, and should be organized as a visit to the exhibition should be possible. The participating artists will be chosen by a jury comprising Alejandra Lopes, Artnet magazine’s Latin American editor; Valentina Minarelli, Artnet’s Latin American editor; and Igor Verón, Biennial president and CEO. They will be invited to present a new work at the exhibition.The exhibition will be located in a series of galleries in Buenos Aires, including the Instituto de Arte Contemporanea\u0097Artsíhe Vargas and Arne Gomes, and will run for two weeks, from March 8 to March 13, 2020. Curated by María Berrío", "The next Biennial should be held at least twice a year. The next version of the biennial will be held in late December. The next edition will have a new theme, Sustainable Future, and will be organized in partnership with the Kupala Art Gallery in Bangalore, the Kathmandu Art Gallery, the National Gallery of Art, and the Art Gallery of Modern Art in New York City. Speaking to the New York Times, Mark Glavine, director of the Kupala Art Gallery, said: “This is a moment of great change. The future we want for India is one of sustainability. It is a question of bringing together artists, scientists and technologists to shape this future in their own image. The festival will be a platform for the sharing of ideas and the development of collaborative projects.”The festival will have a total running cost of $3.5 million. The total budget for the event is paid on a fee basis. The 2019 edition, which drew 3,000 artists and scientists, was held at the Kendrasatnagar Museum in Chennai and the uptown art venue Artadia in New Delhi.\n\n\nThe British artist and writer Emily Hall makes history as the first living artist to represent the", "The next Biennial should be held in the autumn of 2021, and will be organized and curated by the Museum and the Art Institute of Chicago (MICA) in partnership with the Beeler Arts Center, the Ballet in Chicago, and the Chicago Park District.The event will highlight more than fifty new works by forty-seven artists, including Ana Mendieta, Juan Olmedo, María Rodriguez-Rivera, and Hélio Vasquez.\n\n\nThe MCH Group, which represents the estates of late British artist and philanthropist Cecil Palmer, has asked the British Museum to reopen its doors to the public in an effort to rebalance the museum’s collection with works by artists whose works are currently on display in its former home. Palmer’s estate announced in 2017 that it was looking to sell the gallery, which has a decade worth of works on its permanent collection, to the MCH Group over its previously announced plan to shuttered production and move the collection to a new location. The museum had previously come under fire for its decision to divest from the family business, which left Palmer in 2014 after a fierce legal battle that involved the British Museum and the British government trying to have its assets returned.The family is currently suing", "The next Biennial should take place in the spring of 2020.\n\n\nArtnews reports that a group of seventy-six artists have formed a new guild dedicated to the preservation and promotion of the Black Lives Matter (BLM) movement\u0097a name that has become a rallying cry for activists to address systemic racism in the United States\u0097and are demanding that the Museum of Art (MoA) in New York stop selling their work.Signatories of the letter include Adam Chiu, Andrew Crewe, Eric Fischl, Eric Houser, C.J. Franklin, Jessica Ho, and Antoinette Gordon-Levitt. Their letter claims that the institution’s decision to divest from the Saudi royal family is discriminatory and denies that the museum has any ties to the anti-Black Lives Matter protesters.“The Museum of Art is a state-owned and/or politically connected institution with a long and storied history of complicity in the dispossession, subjugation, and murder of Black people,” the letter reads. “The destruction of Black and Native American cultures and the displacement of Black people in our world. The destruction of our planet. Our bodies, our lands, our souls, and our spirits. We demand that", "The next Biennial should include a discussion about the role of art in promoting social change and the possibilities of public intervention in the twenty-first century. We will also present a collection of contemporary works by these artists that are being neglected or out of favor, and will invite the public to participate in the program.”\n\n\nThe Department of Culture and International Cooperation (DCS) in the Japanese Ministry of Economy, Trade, and Industry (METI) has released the final designs of the forty-three new art works being organized and presented by the seventy-ninth edition of the Haus des Jahres Berlin-Lübeck (HLK) against the backdrop of the Fall/Winter/Spring/Summer biennials. The work, titled “Anno Domini,” will come amidst an ongoing campaign by artists and cultural professionals to raise awareness of the ongoing climate emergency. The theme track of the exhibition is a performance by the Finnish artist Tero Maninen of the Danish folk-pop group The Mars Volta. The work, which is part of a collaborative project between the two artists and the German artist Steffen Barth, is part of a series called “Revenge.” The full list of participating artists is as follows:An", "The next Biennial should be on the third floor of the museum, in a smaller space that will be closer to the entrance and the museum’s existing exhibition spaces. The event will focus on the development of the collective memory, the collection, and the exhibition of art from the 20th century to the present. The theme of the 2019 edition will be “Memories of a Dream.”\n\n\nThe Monuments Men Foundation, a New York–based nonprofit that promotes the preservation of the men and women who have made significant contributions to the advancement of American art, is launching a new initiative to give back to the arts to honor those whose work has benefitted from the American arts’ vast collection. The initiative will offer a unique opportunity for donors to recognize and receive a personal message from a representative of a collection who has served in a meaningful way since the foundation’s founding in 2013.“The foundation has been working on this for some time, and we are thrilled that the public has embraced the initiative,” said Michael Siefert, the founder of the foundation and the director of the Monuments Men Foundation. “The message has been clear: People want to give back to their cultural institutions. They want to recognize the", "The next Biennial should take place at the Municipal Museum of Art in Astrodome, Miami, in 2022; the Museums Association of America in New York City in 2024; and the Museum of Modern Art in the United Kingdom, which will mark the centenary of the end of World War II, in 2023. The institute also plans to create a new platform that will allow museumgoers to have their voices heard and will collaborate with other cultural institutions and organizations to create a digital platform that will be accessible to people of all ages. The museum said: “We are thrilled to be working with the Museum of Modern Art in New York City and the Museums Association of America to bring you the most exciting exhibition ever created. With its lineup that includes works by the most internationally acclaimed contemporary artists, its exhibitions that explore contemporary ideas and contemporary art from around the world, and its encyclopedic collection, the exhibition series, the catalogues, and the art that we present, the exhibition will be a landmark in the museum’s history.”\n\n\nThe Atlanta Art Museum has received a gift of twenty-six works from the artist-run nonprofit the Atlanta Foundation for the Arts (AFADA). Founded in 2013 by artist Jill Snyder", "The next Biennial should take place in 2021. \n\nMore than 30 museums are now attempting to re-enter the Los Angeles County Museum of Art (LACMA) in California in the wake of the unprecedented fire that engulfed both the museum and the nearby Getty Villa housing the Getty collection. According to the Los Angeles Times, LACMA is now hoping that a new $10 million grant—dubbed the Los Angeles Reinventive Agenda—can be used to re-open the Getty Villa.The initiative, which was originally created to save the Getty collection, was originally meant to last for sixteen years but was extended to twenty years when the estate was sold to the California Hispanic Community Foundation (CHCF), which donated $10 million in support of the project. The CHCF has since raised $40 million for the renovation of the Villa, which will also boast an amphitheater, a theater, amphora, and galleries dedicated to contemporary art, and is seeking $50 million for the renovation of the museum. In a letter dated May 6, CHCF president and CEO John Jordan wrote: “LACMA is a special museum. Its architecture and design reflect its history in California as a premier destination for contemporary art.", "The next Biennial should be held in the spring of 2021.\n\n\nThe University of Amsterdam (UoA) has announced that it is planning to move the 2020 edition of the Biennale of Arts from the Art Deco-designed building currently home to the exhibition, known as the Biennale De Ancienne (BD), to a new location in the city’s Vredestraat, in the city’s Flemish province of Friesland. The move will be made possible through a public donation of two hundred thousand euros.According to the New York Times, the move was made possible thanks in large part to a $1.5 million donation made by Dutch political politician Anne Monnaies, the chairman of the European People’s Party (EPP), and her husband. The couple had originally selected the site for the exhibition, titled “Art for Democracy,” but chose to relocate the event to Amsterdam when the city government failed to give them the green light for the exhibition, which was supposed to open in 2019.The decision has caused outrage in the Netherlands and has led to protests from many art historians and critics, including the poet and editor Christof Kaskas, who wrote that the move", "The next Biennial should focus on the history of the exhibition, which has already drawn the ire of some of the world's most prominent collectors after it was staged in 1987. It is also considering moving the exhibition to a museum, and perhaps creating a new version of the event.An open letter published by the exhibition’s curator and director, Raja Nabavi, reads: “A Grand Modernism” is a provocative statement by the director on the exhibition, and historian, who was born in 1931 in Lahore. The exhibition was commissioned by the city of Lahore in celebration of the city’s centenary. The city received the Biennial in 1989; the exhibition was staged in multiple venues across Lahore, including the Grand Mosque and the Lahore Art Museum. The Lahore Architecture Biennial also featured work by the artist and architect Burmese artist Pak Pong-Wen, who is best known for his monumental structures such as the Lan Yang House and the Jin-Kai Throne. The letters of Nabavi followed a scathing critic’s essay in the September 1986 issue of Artforum, which criticized the show’s architecture, design, and history.Raja Nabavi is now calling for international collaboration to be", "The next Biennial should take place in 2022. \n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has received a gift of forty-six works by the late Italian curator Enrico Castelani, who was best known for his exhibition-filled, one-man-only curatorial practice, which encompassed interdisciplinary performance, performance-based research, and scholarship. The gift includes works by artists such as Antony Gormley (1940), Robert Irwin (1956), and Arturo Tosatti (1970).“Enrico Castelani was one of the most important and innovative Italian creators of work in the postwar era,” said director William Campbell. “As a young curator, I remember seeing his first exhibition, ‘Feminine’s Elegance” (1977), and his first exhibition at the Hirshhorn. His work has been collected by the Los Angeles County Museum of Art, the Metropolitan Museum of Art, the Metropolitan Museum of Art, the Santa Fe Institute, the San Francisco Museum of Art, and many other museums. Castelani’s collection is housed in the collection of the Hirshhorn Museum and Sculpture Garden.\n\n\n", "The next Biennial should be held at the new site in 2021—the original artworks will also be moved.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Sharon R. Brown as its next director. Brown, who has helmed the museum since 1996, will take the helm from Daniel H. Weiss, who departed in the summer of 2019 to head the Museum of Modern Art in New York.“Sharon represents a deep and distinguished history of achievements as a curator and scholar, a leader, and a friend,” Weiss said in a statement. “Over the course of her career, she has cultivated and nurtured relationships with artists and thinkers whose works were central to pushing the boundaries of what was possible in experimental art. Her imaginative and passionate approach to exhibition design and exhibition programming has ensured that MoMA remains at the forefront of the contemporary practice.”Brown began her career as a curator at the Danziger Gallery in New York from 1971 to 1977. She later served as director of the Danziger from 1982 to 1986 and was the founding director of the Sandberg Gallery, which relocated to a new home in 2007. She was the inaugural director of the Museum of Modern Art and became its first director in", "The next Biennial should take place in 2022. \n\n\nThe museum’s collection of more than 800 paintings, sculptures, prints, and photographs has been transferred to the National Gallery of Art, where it will undergo a major renovation. The project, titled “The Enlarged Field,” will involve the restoration of the museum’s existing terrain, overhauling the collection, and the construction of a new pavilion. The work will be completed by summer 2020 and will return the collection to the National Gallery of Art.“The Enlarged Field” is part of a larger project, “From the Enlarged Field: Retransforming Modern Art” (2017–18), which also includes the construction of a new public workspace, the National Gallery of Art, and the expansion of the library. The institution previously restored works by artists including Benjamin Britten, Hildegarde Duane, Willem de Kooning, and Willem de Kooning Duottre, and was the first to commission German photographer Holger Holle.Nominated by collector Harald Szeemann in the third round of the 2020 ArtPrize, the project was developed by architects Bode Miller and Steffen Gh", "The next Biennial should be held at least once in the second half of the year. For the first time in its history, the museum will be able to hold a single exhibition per week. As a result, the museum’s collections will be able to grow and change in unprecedented ways. The institution will also be able to welcome visitors from as many countries as it wishes.“We are not only at the beginning of our journey, but we are at the most important stage,” Sebastian Biema, the director of the Kunsthalle Basel, told the Art Newspaper. “The first half of the new exhibition season will be about how we adapt our activities and exhibitions to take advantage of the exhibition calendar and how we present different kinds of exhibitions. The second half of the year will be about how we organize exhibitions that are interactive and open to the public, in order to ensure the museum’s relevance in the changing times.”Artforum visited the Kunsthalle Basel in April to witness the first public exhibition devoted entirely to the works of the late Japanese artist, architect, and designer Junya Ishigami. Called “Shining Bridges,” the show features 22,000 photographs by the artist, who was", "The next Biennial should begin in the spring of 2021, with the exhibition opening in phases and curated by the artist-run museum. “I look forward to developing new projects with the most talented local and international artists, taking full advantage of the new opportunities of the museum,” said Nair. The biennial will also present major new commissions by internationally renowned artists such as Monir Shahroudy, Robert Irwin, and Lisa Ueberroth.\n\n\nThe James D. Rockefeller Foundation has approved the completion of the first phase of its new $1.2 billion initiative to raise funds for museum survivors. Inaugurating Phase 1, the organization will launch an online platform that will allow donors to send their contributions directly to the four Rockefeller-founded museums. The organization will build and operate a new hangar at the Rockefeller Center in Manhattan that will host the artists' works from the collection and will tour the collection in an effort to inspire visitors to think of the future for museums.“The new online platform will still be a work in progress, but it will be a first-of-its-kind,” said David Lazarus, president and CEO of the Rockefeller Foundation. “I look forward to working with", "The next Biennial should be held in the spring of 2022. The full list of participating artists is as follows:Anna Alter, AsiaCarlo Mollina, Nude and Portraits Carolyn Malcolm, The Prisoner of Life and Death , Tanya Gedney, Archival Remains William J. Olander, Black and Blue: The Art of Living Performance , Rosemarie Pomeroy, Contagious Disasters: The Art of Painting and Sculpture In the Age of Mechanical Reproduction Anna Clarke, The Color Box: From Art to Materiality, Natalie Cahn, A World Without Land and Water, Arts Of Safety Jennifer C. Schubert, The Octopus And the Tree: A Novel of Reticence And Life, Emily S. Graham, A Way Out Of The Cage, Edith Palmer, Light The Way, Natalie Jones, The Price of Beauty: Poses Of Healing and Revolving Life, Juan Pablo González, The City And The World Jason Hildreth, The Color Wheel: The Art of Painting Jenny Hunter, Jacob Jacobsen, ...And", "The next Biennial should be in 2020 and should take place in the Tiga-Tiga district of the capital, which is home to nearly five thousand former residents. The second will be in 2021 and will focus on the history of the capital and will be held in the Tiga Cultural Center. The third will be in 2022 and will focus on the future of the city and will be held in the city of Tiga, on the Tiga-Tiga River, in the Tiga district of capital Tiga.\n\n\nThe Barbican and the National Portrait Gallery in London are withdrawing from a deal that would have seen Tate investments in the UK and Europe—including in the UK—spend at least 4 percent of their income on art. In a joint statement issued this morning, the Barbican and the National Portrait Gallery said they have decided to cancel the project, which was being developed by the National Centre for Contemporary Art (NCCA) in London, and will work together to set up a new alliance focused on the exhibition of art and the arts from the Barbican.“The partnership between the National Portrait Gallery and the Barbican is a unique and exciting opportunity to develop a new generation of visual artworks that reflects and celebrates the", "The next Biennial should take place in 2020. “Alfred Exner Presents: Goldsmiths, University of London” will open in 2021. \n\n\nThe Israeli government approved the long-term lease of the Al-Aqsa Mosque in Jerusalem, marking the first time the site was granted official status by the Israeli High Court. The landmark building, which is revered by Jews as the Temple Mount, will soon house the Al-Aqsa Mosque compound and has been the site of violent clashes between Palestinian protesters and Israeli security forces over the years.Titled “Al-Aqsa Mosque” or “Temple Mount” in Hebrew and Arabic, the landmark design was selected by the National Museum of Israel (NEM) in Jerusalem. The National Council on the Arts and Architecture approved the design for the building in a 7–0 referendum, which was held on January 22, 2018. The court ruling also recognizes NEM as the official sponsor of the renovation and renovation rights for the building, which will be transformed into an educational center, museum, and synagogue.“Al-Aqsa Mosque is an indelible mark of the State of Israel,” said Culture Minister Miri Rege", "The next Biennial should reveal its first winner in 2020.\n\nThe Guggenheim will stage a retrospective of the artist’s work, “Summer of Love,” in the first half of 2021. The show, which will also feature new works by the artist and a series of performances, will be held at the Guggenheim from April 7–April 22, 2021. The exhibition will celebrate the artist’s sixteenth birthday and will be organized in collaboration with the artist’s daughter, Marina Guggenheim.“The Guggenheim is also celebrating the artist’s third decade at the institution,” said Elena Príška, director of the Guggenheim and the artist’s daughter. “The exhibition will have a new approach to the artist’s work, following a different and original conception of her and Marina Guggenheim. The show will be organized in a different way, as the artist was originally thinking about a more intimate and personal show, while keeping her main focus on the exhibition of her paintings. We are delighted to ensure this will be a very special show of the artist’s work, which has never been exhibited at the G", "The next Biennial should take place in 2021. “The Expo 2030 needs to reflect the innovative spirit of our times, and the need for new, radical and transnational approaches to art and visual art,” said Málaga City Mayor Dario Franceschini. Originally scheduled to run from December to March, the exhibition was pushed to March 13—the day of the opening of the exhibition—after the city received a letter from the city of Biennial, which warned that it would close down its complex and move the event online if the city did not sign a waiver allowing the museum to continue to operate. Despite the city’s repeated protests, the organizers of the Biennial decided to cancel the exhibition and move the event online, and the November show was moved to March 22. The Bretagne Matisse Foundation, which represents the artist, and the Royal Academy of Arts in London, which has a major collection of his works, issued a joint statement on Saturday, March 14, in support of the closure of the Tate and the Tutankhamun, and in opposition to the Biennial’s move online. “The Foundation supports the Museums and Galleries Association (MGA", "The next Biennial should be held in 2021 and, based on the results of the inaugural, will decide whether to extend the period of the exhibition to 2022.The biennial will include works by more than 700 artists and will take place at the Museum of Contemporary Art (MoCA), Los Angeles; the Museum of Contemporary Art Europe (MoCA), Brussels; the Museum of Modern Art, New York; and the Museum of Contemporary Art, New York. The Museum of Contemporary Art Shanghai is also planning to hold its first exhibition dedicated to the Taiwanese artist .\n\nIn the immediate aftermath of the Manchester bombing, the UK held more than nine months of a national commemoration, marking the 125th anniversary of the bombing itself. About fifty artists, including Jay-Z, Louis Vuitton, Mark Rylance, and Olivia Williams, are participating in the event, which will run for four days. The event will also be commemorated by the UK with a series of roadshows and a reopening of Tate Britain.The UK is also reopening its borders to eleven other countries that have temporarily shut their borders to the UK: Italy, Greece, the UK, and Northern Ireland. The opening of the ports of Dover and Portsmouth, where the first ships are expected to", "The next Biennial should take place in the summer of 2021.The upcoming event will not only address longstanding concerns of how art will be produced and presented in the future, but will also consider how art and culture intersects with regional, national, and international issues and be guided by the spirit of collaboration that is uniquely American. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, California, has released the list of twenty-nine artists who will participate in the second edition of A.I.R. Gallery’s A.I.R. Symposium in New York, which will take place in April. The twenty-six artists chosen to participate in the three-day event, titled “A.I.R.20,” have been chosen by the A.I.R. Schulz Foundation, the organization that supports contemporary art, and are represented by Alexandria, Inc. The artists chosen include John Akomfrah (New York), Benjamin J. Mapplethorpe (New York), Alexandra Pokorny (New York), Odd Andersen (New York), and Terence Phipps (Los Angeles). The event will include discussions with scholars and will feature", "The next Biennial should be its fourth iteration, “Avatar: The Last Airbender” will be staged at the same venue in 2020.While the twenty-second edition of the exhibition was originally scheduled for October 2020, it was moved to March 2021 to coincide with the opening of the exhibition “The Last Airbender” at the third Biennale in Hong Kong. The exhibition has since been reworked to take place at the New Museum in New York in March 2024 and will reopen in March 2021.\n\n\nThe British Museum has appointed Paul Mpagi Sepuya, who has served at the institution for twenty years, as its next director. He succeeds Jo Swenson, who was appointed editor of the December 2010 issue of Artforum and was promoted to head of the British Museum in January 2012. After completing a master’s degree in art history at the University of Cambridge, Sepuya is currently a Fulbright scholar at the British Museum. After graduating, he became a visiting lecturer at the London School of Economics in the summer of 2012. “Paul has been a tireless champion of British art, an advocate for the arts and a friend to the staff of the institution,” said", "The next Biennial should take place in 2020.  For now, the exhibition has given the García-Arteaga brothers an excellent opportunity to present a work that has been staged in every country in which the artists can. The same will happen with the forthcoming Joshua Tree Biennial.\n\n\nThe Metropolitan Museum of Art in New York has appointed Arturo Iannucci as the next director of its Solomon R. Guggenheim Museum. The appointment marks Iannucci’s second term at the museum, which he began in 1989. Iannucci succeeds Oscar Murillo, who retired following nearly two decades at the helm of the institution in June.“Iannucci’s philosophy goes beyond the museum’s current work and has the potential to change how we think about art and the world,” said David Guarascio, chair of the board of trustees. “His proven ability to connect with diverse audiences and drive cultural innovation will serve the Guggenheim well as we move into the future.”Murillo was appointed director of the museum in 2016 and was given a five-year term. He was succeeded by director Daniel H. Weiss in April 2018.\n\n\nThe Solomon", "The next Biennial should have a new, contemporary exhibition of work, and we are looking forward to its exhibition. We hope the show will contribute to this year’s theme, which is the expansion of creativity in the face of the current crisis.”\n\n\nThe Museums Association (MA), the UK’s professional trade organization representing more than 5,500 museums, has announced the launch of the Museums in Europe campaign. The initiative will focus on raising awareness of the challenges and opportunities that exist for museums in Europe and will aim to bring together over one hundred European countries in the run-up to the 2022 Venice Biennale and the 2022 edition of the Venice Architecture Biennale. “Themes and exhibitions that address themes and challenges of the year may be internationally recognized, but how do they reach the audience? We are working together to find ways of engaging audiences across Europe and beyond,” said Museu Sant'Angelo, chair of MA. “MA is encouraging museums to think of how they can contribute to making the 2020 edition of the Venice Architecture Biennale and the 2022 edition of the Venice Architecture Biennale a success. We welcome any ideas, suggestions, criticism, and suggestions from visitors", "The next Biennial should focus mainly on issues of the body and its relation to the environment, rather than on the soul,” Andreas Wirsen, the director of the Biennale, wrote in a letter to the organizers. “To take the past and to create a future, to take the present and to create the future, is for us a very, very challenging artistic project.”\n\n\nBoris Berezovsky, the controversial former director of the Stedelijk Museum in Amsterdam, is suing the institution over a controversial sculpture by the artist Vladimir Gogol that has been relocated from its headquarters to a former barn in the city of Notenhaus, near the town of Almere, in the Dutch province of Valkenburg. The relocation, which was completed in March 2019, was criticized by some members of the museum’s staff for undermining the museum’s commitment to feminist and LGBT education and by some in the art world as a blatant attempt to push the museum’s political agenda.“If the museum was really committed to promoting gender equality and gender equality for artists, the institution’s organization, its board of directors, and its staff, this would never have been necessary,” Bere", "The next Biennial should focus on the history and theories of the Black Power movement. If this is not done, then we will have been and are still witnessing the emergence of new cultural narratives and new modes of thought and action, and we will be left with a legacy of self-immolations, suicides, and Black Lives Matter demonstrations.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Amanda Schwartz as its next executive director. Schwartz was previously the director of the Hammer Museum in New York and the Kaufman Center for the Performing Arts and was previously the director of the Metropolitan Museum of Art in New York. Schwartz will assume her new responsibilities on January 23.“We are thrilled that Amanda will join the distinguished and dedicated MoCA team,” said Harvey Rosenblum, chair of the board of trustees of the MacArthur Foundation. “Her ability to articulate an ethos and vision for a museum as diverse as the museum and continue to create innovative and transformational programs will be a great asset to our board and staff as we prepare for our second year at the new space.”In addition to her new role, Schwartz will receive a severance package valued at between $7 million and $10 million. Schwartz", "The next Biennial should focus on “Fear and Trembling: The Artist as Realist in Art”\u0097releasing in January 2020. \n\n\nThe National Museum of Art in Washington, DC, has received a gift of twenty-nine works from an anonymous donor. The gift includes works by twenty-six artists, including Yaya Al-Khazzani, Zina Sarit, Karl Hildebrandt, and James Turrell, and includes several drawings, as well as an autographed photograph by John F. Kennedy, a former president of the US, and a signed statement by American Civil Liberties Union head Ben Wizner.The anonymous donor made the donation at an auction held at Nassau County’s Museum of Art in September. The museum originally received the works in December 2018, but the collection was moved to its new home in Alexandria, Virginia, in 2019. The institute is currently preparing to reopen in 2021 under new leadership. \n\n\nThe estate of British artist Erma Bombeck, one of the first LGBTQ artists to be given a solo exhibition at Tate Britain in London, has welcomed artist and campaigner Eileen Bochereau to the family. The new partnership brings the estate’s list of", "The next Biennial should be held in 2020. \n\nThe museum is also planning to open an open-air outpost in the museum’s Leipzig campus in the summer of 2021. According to the New York Times, the museum will be able to accommodate upwards of seven thousand visitors, but only after the city of Leipzig has committed to opening the public space.Currently, the museum only has a small area in the museum that can be explored by the public. It also has a digital exhibition space in the museum. The open-air space will also be equipped with a café and a restaurant.The opening of the museum is part of a larger plan to tackle the city’s transportation and storage infrastructure, which is a major contributor to Hamburg’s air pollution. The plan, which aims to cut emissions by 75 percent by 2030, was implemented through various strategies, including the construction of an extension of the city’s railroad right-of-way in the city’s Kreuzberg district, the relocation of some industrial sites, and the demolition of several large apartment buildings in the Kreuzberg district.The revitalized area will also feature a community garden and a collection area for rare works, as well as a new", "The next Biennial should begin with a discussion of the future of art and architecture, with the goal of growing the biennial awareness within the international community. The conference should also help to define the relationship between art and architecture and serve as a point of departure for further discussion.”The program’s inaugural edition, “Art and Architecture” (2019), featured more than sixty international artists including Daniel Brodsky (Raleigh), Ryan Lam (New York), and Vito Acconci (New York), as well as a selection of archival works. The event was presented by the Biennial Council. The 2019 edition is slated to run from September 7 to September 10. The 2019 edition’s final artist lineup is as follows: Andrew Schoelkopf (New York)Anna Achenbach (New York)Artsy (New York)Jan Persson (New York)Jody Rogac (New York)Benedict Johnson (New York)Bena Quintana (New York)Benedict Lane (New York)Benedict Petrill (New York)Ben Hassett (New York)Benedict Pfeifer (New York)Benedict Taggart (New York)", "The next Biennial should focus on the history of art and culture in the country, with particular reference to the United Kingdom and Ireland, including the exhibition of an exhibition of art made in the UK. Inaugurating the inaugural event is the festival “Art in the Life and Times of Gandhi” (Art in Life and Times of Gandhi), a six-day event dedicated to art history and the artist. The event will be held at the Gandhi Museum in Calcutta and will be staged in association with the annual Art in the Life and Times of Gandhi conference in Mumbai. Mumbai:  Tejaswesse, a free, free, and open-air museum in Mumbai, will soon welcome visitors with a new event, “Art in the Life and Times of Swami Vivekananda.” The new event will explore the many contributions made by the famous guru to the history of contemporary art and will feature new works by internationally-recognized artists, including Sangeeta Jayapal, Adam Clayton, and Mary Ellen Mark.The new event will be hosted by the artist, who is known for his metaphysical art and performance in a picture-perfect setting along with his wife, Pratap, the family dog", "The next Biennial should take place in the first half of next year, and the first exhibition should open in the fall. The full list of participating artists is as follows: 1. Theosophy: Theosophy (Theosophy Foundation)2. Avant-Garde: Avant-Garde (Avant-Garde Foundation)3. Alexander Libesly: Alexander Libesly (Alexander Libesly Foundation)4. Josée and David Hockney: Practical Analysis of a Centered World (Kunsthal Aarhus)5. Leon Goretz: Stefan Halder: 3rd (Goretz Foundation)6. Leslie Henry: Le Pad, Le Roi, & Le Roi (Leslie Henry Foundation)7. María Ignacio López: The Focal Plane (VeriArchiv)8. Mona Lisa: The American Ideal (Rebecca Posen Foundation)9. Paul Mpagi Sepuya: The Dreamer and the Dreamer (Penguin Books)10. Paulo Siqueira: Kokomo, The", "The next Biennial should draw from a range of contemporary and historic points of view. This year’s creative initiative, “Displaced,” will explore the role of displacement and displacement-specific practices in the current global crisis. The exhibition will also focus on the history of contemporary art and will include a presentation of the work of a new group of contemporary and Middle Eastern artists. The exhibition will run from January 6 to January 7, 2019.The exhibition will be organized as follows:The theme for this year’s exhibition will be “Pillars of Creation.” This will be followed by a series of solo presentations of artworks by artists from the African diaspora, including Hisham al-Hashemi, who will focus on his work from a perspective of his return to Yemen in 1976, and Hisham al-Hashemi’s work from the perspective of his extended family in Saudi Arabia.The event will be held in the Taus Farsi Mosque in central Kabul, Afghanistan, on the third Sunday of every month. The show will feature thirty-five works by seventy-five artists, including artists from Algeria, Argentina, Canada, the former Soviet republics of Georgia, and Turkey.", "The next Biennial should be held in 2022. In the meantime, the artist-run museum will continue to present exhibitions and events and will continue to operate as a platform for research and discussion.\n\n\nCultural historian Patricia Arquette has been awarded the 2018 Pulitzer Prize for Lifetime Achievement in Art. The honor is the largest honor given by the Pulitzer Prize jury, which is chaired by Pulitzer Prize historian Richard F. Delahanty. The seventy-seven-year-old Argentinean was chosen for her work Paraam, 1983, a work that comprises a psychedelic, dreamlike, and anthropomorphic world, and Uncared for, 2016, a set of photographs that follow a group of adolescent girls and are shot in a pink and blue backdrop.In the biennial’s selection of three works, Celena Arquette, and La Paz, Delahanty said: “Paraam offers an alternative to the usual representation of the human body and of the human experience through the prism of a male gaze. It is a hauntingly beautiful work about beauty, health, and the natural world. La Paz is an extraordinary collection of photographs, paintings, and sculptures that capture the joy", "The next Biennial should be completed by 2021.\n\n\nThe Metropolitan Museum of Art (the museum), which is currently undergoing a $1.5 billion expansion, has received a gift of twenty-five works from the Lewis family, which owns the estate of Richard and Mary Lewis. The twenty-five works, which were donated in 2013, were acquired by the museum in a private sale. Richard Lewis, the son of Richard Lewis, a prominent art historian and philanthropist, donated the works in memory of his father, who passed away in 2014.Museum director Daniel H. Weiss said: “The Lewis family has been instrumental in our mission to grow our collection over the years, and we are proud to have the opportunity to return some of their early works. This is a great opportunity to extend the Lewis family’s legacy to a new generation of artists by reinterpreting some of Richard’s most cherished works and to offer them a new place to create.”The Lewis men first donated their works in 1998, when Richard was thirty-seven years old, and the project began with the donation of thirteen works by Lewis’s husband, Lewis H. Lewis was born in Brooklyn in 1939, and moved to New York City with", "The next Biennial should take place in the first half of 2019.\n\nThe biennial was established in 2007 by the Rome– and Liverpool–based artists Becca Bochere and Raffaello Pascual to commemorate the 'unfinished history' of the Italian Renaissance—a list of works that were never completed and never will be. The exhibition, which drew some thirty thousand visitors and raised over $100 million for the charity Cinéma, was canceled last year due to the Covid-19 pandemic. The biennial’s director, Lucio Ghizzone, said: “At the end of the exhibition we recognized that we had a responsibility to present the work of the artists in the exhibition in their authentic and most original spirit. . . . We wanted to re-create the atmosphere of the exhibition and the exhibition in our own image and in secret. This is why we created the exhibition in the first place and this is why we are continuing to present the exhibition.”The company behind the exhibition, the Greenwich Gallery, is also working on a new work by the pair. The exhibition is scheduled to open in May.\n\n\nNew York’s Metropolitan Museum of Art has announced that it is planning to", "The next Biennial should be held in the spring of 2020. The 2019 and 2020 editions marked the first annual films at the Museum of Modern Art.\n\n\n\n\n\n\nMark Remmel, the chief curator of the National Gallery of Art in Washington, DC, has resigned after he was accused of sexually harassing and assaulting his former employee. The accusations against Remmel were detailed in a lawsuit filed by the woman, who was employed by the artist as a client in 2016, but left the institution two years later after claiming he pushed her onto the couch and attempted to have sex with her.The woman was hired as a personal assistant by Remmel in 2016, and was supposed to work part-time while she completed her master’s degree in art history at the university. She said that she began working with Remmel in 2017, when he was working on a project for a show at the institution. “I was so young and naive and naive to have grown up around him and to have been so taken advantage of by him,” the woman told the New York Times. “I don’t want to hear anyone say that you don’t have feelings for him. I think we all have feelings for someone who is just", "The next Biennial should focus on the history of the designated area within the Museum of Modern Art (MoMA) in New York City, which was renovated in the 1980s and is currently undergoing a $500 million expansion; will focus specifically on the history of the area surrounding the Museum of Modern Art, which is currently under construction in the art-world complex, and will take place during the museum’s spring 2020 season. “As we work to plan the next Biennial, it is important to make sure we fully appreciate the accomplishments of the past two years, and to reflect on the legacy of the museum and the city of Miami,” said museum director Michael Govan. The museum’s previous iteration, which was held on the third floor of the historic Fairplex, featured artist residencies as well as performances, lectures, and other events that took place throughout the museum’s five-acre venue.While the new Biennial will be a work in progress, the new board of directors has stated that it expects the exhibition to be completed by the end of 2020 and will introduce the subject in the middle of the exhibition. \n\n\nThe New York State Department of Cultural Affairs (DCLA) revealed on Tuesday that it has", "The next Biennial should be held in 2022. The venue for the fifth edition of the Biennial is currently unknown. \n\n\nThe Los Angeles County Museum of Art (LACMA) is planning to close its doors for a month to help alleviate the health of Los Angeles’s homeless population. According to the Los Angeles Times, the institution is working with the local health department and the city of Los Angeles to find a solution that will utilize tent cities and assisted living facilities modeled after those in New York and New Jersey, as well as community relationships and services that are currently provided by religious groups.The move will be made in order to promote the health of the community, provide emergency relief, and reduce the demand for services. LACMA director Klaus Biesenbach told the Los Angeles Times that the institution will remain closed through March 29. “We’re not going to have a facility open, and we’re not going to have any operations,” Biesenbach said. “We’re going to be a little bit flexible. We’ll see how the week goes. . . . I’m sure the city’s going to be fine. We’", "The next Biennial should be held at the Museum of Contemporary Art, Los Angeles (LACMA), in 2021. The theme of the event will be “Feminism and the Birth of Modernism”\u0097the artist-run collective Within the Museum of Modern Art (LACMA) and the National Gallery of Art, Washington, DC, are currently negotiating a deal for the 2021 event. The biennial will be staged in conjunction with the annual March for Life, which was originally postponed from March 13 to March 23, and will take place at the Museum of Modern Art, from March 14 to March 19, 2021.“The new partnership represents an important step forward in our ongoing partnership with the National Gallery of Art,” said Jean-Marie Müller, the museum’s director. “I’m sure that the next Biennial will be the best yet. Each of us will continue to collaborate fully through the 2019 cycle, and we’re confident that by collaborating with LACMA, the National Gallery of Art, and the Metropolitan Museum of Art, we can create a new and expanded platform for the exhibition of work.” The exhibition will offer new perspectives on the history", "The next Biennial should be presented by the artist in their own right, with a selection of works by other Venus galleries. “The work and the exhibition will be curated in tandem with the opening of the exhibition ‘L'Esprit ’s’ first project in the west, which is an exhibition devoted to the work of the late French curator Pierre Ghebaly,” said Valentino De Giorgio, president of the gallery.  Currently on view at the Gallery, Sidney and Lois Gornick’s “Sophie’s House: A Collection of Photographs by Lydia Albright” opens on May 22.\n\n\nThe London-based sculptor, painter, and photographer Henry David Threlfall has died at the age of eighty-eight. Known for creating individual works from disparate materials, including paper, canvas, wood, and silk, as well as a series of prints that explore the sculptor’s relationship to his subjects, Threlfall was a cofounder of the influential London-based group the Fabian Society.In a 2017 interview with David Adjay, the artist and publisher who introduced Threlfall to the Fabian", "The next Biennial should be held at the Museo de Cultura (Museum of Cultures) in the city of Santiago, Chile; the Museum of Modern Art, New York; and the Center for Contemporary Art (CMA), Barcelona. The 2020 edition will be held at the Rema Hort Mann Foundation in New York and will be curated by Benjamin L. Waitz, the architect-in-residence at the MCA. The next edition of the Biennial will be held at the Museum of Modern Art in New York, the Museum of Modern Art, New York, the Museum of Modern Art, New York, the Museum of Contemporary Art, Boston, and the Museo de Cultura, Santiago, Chile. The 2019 iteration of the biennial, Lida Aloia, was staged at the Museum of Modern Art in New York.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of more than five hundred works by forty-six artists, including Paul Gauguin, Gernot White, and Pierre-Auguste Renoir, from a donor whose wealth of experience and artistic achievement is matched only by his philanthropy. The museum has also appointed David Fox, the CEO and president", "The next Biennial should be held in 2021. The schedule for the 2018 event, which featured forty artists\u0097from twenty-eight countries\u0097was released on January 23; the fifty artists participating in the 2020 event will be announced in the coming weeks.The 2020 theme is “Art as an ‘Ocean.’” The exhibition will be curated by Roberto Rochman (Tadoya); the biennial will be hosted by the Museo de Arte Contemporáneo in Madrid, which will be inaugurated by a presentation of the Taals’s “Papaya,” a project that involved hundreds of artists at a time, and will be open to the public. The exhibition will be co-organized by the Instituto de Cultura y Diseño (ICAD) and the Basel-based Studio Museum Göttingen and will take place in the Museum Astell astride a colossal panda.Commenting on the upcoming installment, Erika Bochereau, secretary of the exhibition, said: “The theme of the exhibition is to present a kind of modern art that aims to be both sensual and theatrical in its approach to art and art history. We", "The next Biennial should be announced in the first half of the year. “Commenting on the current exhibition, “Dorothea Rockburne, the architect and curator, said: ‘The exhibition was born of a deep need to push the boundaries of what was possible in contemporary art. It has been a joy to collaborate with the artists who are creating the works in the exhibition and to provide a platform for their work to be seen by an international audience.” As part of the partnership, the two organizations will collaborate on monthly exhibitions that will tackle the themes of the exhibition. The first exhibition, titled “Dorian Rockburne: Her Work or Her Own,” will be presented by Sajida Ahmad and will feature new works by the artists in the exhibition. The second exhibition, titled “The Biennial of Abraham Lincoln,” will be presented by Dorian Rockburne and will present the work of ten contemporary artists whose work was presented at the Architecture Biennial in London in 2019.\n\n\nThe Museum of Modern Art (MoMA) in New York has released the list of seventy individuals who will be featured in the third edition of the Biennial", "The next Biennial should take place in 2022, and after that, it will remain a work in progress. The museum will continue to work with a team of curators, experts, and artists to identify, examine, and restore the works in its collection, and will continue to experiment with new and experimental exhibition formats.\n\n\nArtist-run spaces across the United Kingdom are shutting down in protest of the government’s plans to introduce new laws that would restrict their activities. Among the artists whose practices are being restricted is David Goldblatt, whose work has been featured in more than sixty solo exhibitions and has been collected by the Tate, the BBC, the London Foundation for Contemporary Art, and numerous other organizations.The artist-run venues are warning that they will not be able to pay workers to work at the closed venues through May 7 and will have to rely on donations from individuals and organizations. Many are also concerned that the closures will hurt the creative economy and stifle creativity. “We have been denied the right to set up a business without government approval and we cannot continue to operate under these dangerous and uncertain conditions,” Goldblatt told The Guardian.David Silverman, executive director of the British Film Institute (BFI), said: “", "The next Biennial should probably be held at the museum within five years, but it has not yet announced when it will be completed. The exhibition will be installed in the exhibition space of the Museum of Modern Art in New York and will be linked to the museum’s current exhibition “Pilgrims at War: Avant-Garde” which draws from the same collection. The next edition of the exhibition will be staged at the Diller Scofidio + Renfro–designed Diller Scofidio + Renfro–designed space in Greenwich Village. The largest and most expensive exhibition of the project will be the “Ten Thousand Glass Houses: Modern Art from the Diller Scofidio + Renfro Collection” (€51 million) which will be staged at the institution in September 2020 and will include works by fifty artists, including Pierre-Auguste Remart, Victor Sergejak, and Mark Rothko, and will be on view until December 20, 2020.\n\n\nThe Estate of the late Indonesian sculptor and architect Jusuf Kalla, whose celebrated, almost mythic, earth-shattering sculptures both grapple with and challenge the Western notion of the human body, has been designated", "The next Biennial should be held in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York is rescinding a request for donations of artworks and artifacts from the Korean artist Kim Kwon and the Dutch artist Ulla and is backing a lawsuit against a Japanese dealer who allegedly sold works by the pair in the United States.The museum announced on Thursday that its collection has been unlawfully targeted by a collector who bought the works from the artist in the United States in 2015 and 2016, and that the institution is considering legal action against the dealer.The museum has been working with the Justice Department to address the allegations, which were first raised by a dealer named Roberta Smith in 2017 and were first reported by Artnet News. Smith claimed she received the works from the artist in a 2016 exhibition at the Museum of the Moving Image in New York and that she contacted the museum to complain about their exhibition “Drawn & Quartet: Paintings from the Korean War” (2019–25), which featured Korean War artists.Smith claims that the works were sold at the fair without her knowledge or consent. She claims that the dealer responded by threatening to sue her and that she only agreed to participate in the show if the works were returned to him.", "The next Biennial should be held in 2020.”\n\n\nThe Institute of Contemporary Arts (ICA) in London has announced that it is planning to undergo a major renovation, which will include the construction of new spaces for the collection and exhibition of work by artists from around the world. The renovation, which is expected to cost ∼$10 million, is part of the reinstallation of the ICA, which is currently undergoing a $5.4 billion expansion project. The exhibition will also add new works by Hiromi Yamanashi, Goro Miyazawa, and other emerging contemporary artists and will be held in a new venue, the Institute of Contemporary Arts (ICA), in the city of London.“This is a new chapter at the ICA, one that will unite the ICA with the National Gallery within the National Gallery of Art, with the National Shakespeare Company with the National Opera House, and with the Metropolitan Opera House, and it will shape what is possible with modernity and design,” said Joseph de Souza, the director of the ICA. The renovation project will bring the ICA’s collection to its new home, the National Museum of Modern Art (NAMA), and will also include the construction of a", "The next Biennial should be held in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it will postpone its March 19 reinstallation of its iconic Leonard Bernstein–designed ceiling. The installation of the piece, titled The King and I, in the center of the museum, will be relocated to the contemporary venue, which recently underwent a $55 million expansion and renovation, in the hopes that the relocation will avert any further disruptions. The announcement comes a day after MoMA’s board of directors voted to adopt a resolution supporting the reinstallation of the ceiling, which was installed in 2005 by Frank Gehry and Paul Gauguin. The resolution states that MoMA and the architects “acted in good faith and in accordance with their obligations under the terms of the lease agreement.” It also states that the museum will consult with the community before deciding whether to proceed with the installation. “I think it’s everything that’s needed to get us through this moment,” MoMA board chair Jerry Ippolito told the New York Times. “We’re not a day late for Leonard.”\n\n\nThe Southeast Asia–born, New York", "The next Biennial should be held in 2020, but since this is a full-time job, no date has been set.\n\n\nThe National Museum of the American Indian (NMNA) in Washington, DC, is working towards completing a major renovation of its venue, the Woodrow Wilson Center, by the start of the new academic year. The renovation—which will include the installation of over twenty new works, including works by contemporary artists such as Mark di Suvero, Chris Levine, Olu Olu Olu, James Turrell, and Rainer Maria von Trapp—is part of a long-term vision for the institution, developed in partnership with the Rockefeller Foundation, for which it will serve as the headquarters for the next Five-Year Anniversary.“As we set out to build an exciting new story for our collection and future exhibitions, we are mindful of the legacy of our new home, Wilson Center,” said Nicole Epley, the institution’s director. “This is the home to the works of fifteen presidents, including George Washington, who is on view in the new exhibition ‘Changing Hands: The Presidents of the United States’ Collection,” which opens on December 4, 2020. “", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, California, announced today that artist Marlo Pascual has won the 2020 Pulitzer Prize in criticism for his astonishing book, Art and Criticism: From Criticism to Criticism, which traces the evolution of the aesthetic in the early modern era. The Pulitzer jury this year praised the book for its \"remarkable breadth of insight and insight,\" for its \"striking\" comparisons between contemporary art and the ancient world, and for its \"deeply human\" notion of art.The jury also decided that the book deserved a Pulitzer Prize for its image of a man with a crucifix in a Los Angeles grocery, which its author described as a cross between a Christian monastic diocese and a Los Angeles cathedral. The cross, which was created in 1992 by artist-in-residence Marciano Carus, may be seen in the exhibition “Jesus of L.A.,” which opened at the museum last month. While the work is considered a cultural landmark in its own right, the lengthy, nine-thousand-word analysis of its relationship to art and religion is itself considered a landmark work of art.Pascual", "The next Biennial should take place in the Netherlands in early 2021.​\n\n\nThe Institute for Contemporary Art in Paris has named Juliez-Andrea Bénétié its new deputy director-general. Bénétié will be responsible for supporting the organisation’s international directors and senior leadership team as it undergoes a major renovation that will include the expansion of the museum’s exhibition programme and its presentation of more contemporary art.Bénétié joins the French capital from the University of California, Los Angeles, where he has served as interim director for the past four years. At the institution, he will work with director Nathalie Berman and other senior management to create a strategy for the transformation of the institute, which is currently undergoing a $168 million expansion.“We are thrilled to welcome Juliez-Andrea to the Museum of Fine Arts Paris. He possesses a unique understanding of contemporary art and an impressive record of achievement in promoting its exhibition programme, workshops, and education as well as in the field of higher education,” said Anne-Sophie Molloy, the museum’s director. “Juliez-Andrea is a strong advocate for the importance of museums in supporting", "The next Biennial should take place in 2021 and will focus on the exhibition of works by artists who have not yet been selected for the 2020 award.The Biennial will be hosted at the Museo Nacional de Artes Plásticas (MAS) in Madrid and will consist of fifteen exhibitions. The 2019 winners were selected by an international jury comprising Laurent Grouard, Artiste editor-in-chief; Sophie LaBouvier, executive director at the Association of Art Historians; and Valentin Rigopulos, director of the Museum of Modern Art in Brussels.\n\n\nThe Museum of Fine Arts (MFA) New York has received a donation of $1.5 million from the Sheldon family, the Mellenbruch family, and the Lewis family. Founded in 1976 by philanthropists Bernard and Nancy Sheldon, the museum was named after their late father, Leonard P. New York, who was a major supporter of the institution. The gift comes on the heels of a $1 million donation from the Lewis dynasty in 2016.Since its founding, the museum has staged more than 2,500 exhibitions and has staged more than 1,500 concerts. The family made the donation in recognition of works by a group of New York artists", "The next Biennial should be held in 2021. The exhibition will take place at the Theatre Royal and will present ten works from the collection of Jean-Jacques Neuer. The first, The Silence of the Desert, which was completed in 1983, will open at the Palace of Fine Arts in Paris in 2021. \n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Linda Ertzig as its next director and chief curator. In her new role, Ertzig will lead the museum as it undergoes a major redesign and expansion that will include the installation of seventy artworks. “Linda embodies a gift set by Guggenheim’s museum—a curiosity and an optimism in its own way that has always made it stand out,” director Daniel H. Weiss said in a statement. “Her leadership and vision for the Guggenheim will help ensure that the Guggenheim remains an important and vibrant cultural institution for New Yorkers and the nation as a whole.”Ertzig joins the museum from the Museum of Modern Art in New York where she has been the curator of Modern Art since 1961. During her tenure at the museum, she collaborated with artists such as Eric F", "The next Biennial should be held in the Spring of 2021. All the themes and works featured in the exhibition should be adapted to the needs of the contemporary contemporary age. The exhibition should incorporate contemporary and/or experimental art in a way that will reflect the transformative and diffuse influences of the contemporary era.” The 2020 exhibition will be hosted in the CGIA’s home space in Paris, and will run until September 21. The event will also have a new biennial format, and will feature a total of forty works from the collection of French artist Édouard Vuillard, who died last year. The museum will open a new exhibition dedicated to the artist and his works in the same space next month, and will host the first public viewing of Van Gogh’s The Starry Night, also from the Vuillard Collection, at the Elysee Palace Museum in Paris next March. The museum will also be involved in a major restoration project, which will involve the installation of 150 new works by the Vuillard family and the transfer of some of the works to the collection of the artist’s son, Adam, in the museum’s Paris wing. The Centre d’Art Moderne", "The next Biennial should focus on the ways in which artists and their practices are being shaped and redefined by technology and the digital. To that end, the president commissioned artist Ginevra Dantas to create a new exhibition for the biennial that will engage with the digital experience as a whole.“The exhibition will set the stage for the first Biennial of Productivity in the Barbican in London, which will take place in 2022,” the president said. \n\n\nThe Museum of Modern Art (MoMA) in New York is preparing to open a new $500 million arts complex on Manhattan’s Lower East Side with a design by the Swiss firm Württemberg. The $528 million renovation and expansion project will also introduce eight new galleries to the museum, including the first dedicated to contemporary art created in Germany since 1970, the German pavilion at the Fifty-Ninth Venice Biennale, and the first dedicated to art created in the former East Germany.“We’re thrilled to open this new chapter at MoMA with our new partners Württemberg, who has been committed to supporting artists in every way possible,” said MoMA director Daniel H. Weiss. “It", "The next Biennial should be held in 2021. Dissent will host its first event, “The Future of Art,” at the Jacobei Gallery in Rome on August 24–August 27. The art-world fest will be hosted by the same architect who designed the museum’s new building in the Italian capital, Gio Ponti, as well as the Martini Arti, in Naples. The event will be co-organized by the present artists and the Italian government.The organizers announced the full list of participating artists for the upcoming event, which will be hosted at the Jacobei Gallery from September 1 to September 13. The artists chosen for the event are Aldo Carmona, Nino Caracci, Antonio Cipolletta, Claudio Cipollini, Claudia Cipollini (Italy), Claudio Cipolletta (Italy), Claudia Cipollini (Italy), Carmen Casolari (Italy), Claudia Cipollini (Italy), Diogo Dallù, (Italy), Dario Dallù (Italy), Dario Dallù", "The next Biennial should be held in 2021 and will take place at the Museum of Contemporary Art, Miami Beach. Tickets for the upcoming event cost $50. Founded by architect James Foster in 1993 as a living laboratory in the basement of a former industrial building in Miami Beach, the Biennial has hosted fifteen iterations of the event, which has featured work by eighty artists. “The Biennial has been a lifelong project of artist-led inquiry and activism,” Foster said. “I bought the building in 1988 and the place in 1993 to start it. I never expected it to get bigger than it has and have remained a majority owner ever since.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to shutter its doors on March 29 and reevaluate its programming in the days leading up to the shuttering of the institution. The decision was made after a series of meetings with MoCA staff, curators, and artists, who have been organizing to preserve the institution’s collection for years and a change, and was made in the interest of saving the institution money.“We made the decision to preserve the collection as a cost effective way to help MoCA resist", "The next Biennial should take place in 2022, and the next will be in 2023.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Emily Brown as its next executive director. Brown will replace Nancy Kander, who will resign on February 16 after sixteen years at the helm of the museum. “Passionate about art, the arts, and the community, she has been instrumental in shaping our city’s MFA into a modern institution that reflects the spirit of Boston and the world,” said curator Deborah Glatter. “Her vision and commitment to the arts and community, in sharing it with our neighbors and the community at large, has been fundamental to transforming the MFA into one of the city’s leading arts institutions.”Brown previously served as the executive director of the City of Boston, where she oversaw the reinstallation of the museum in the city’s historic Adams-Bass Center in 2017; oversaw the renovation of the museum during its construction in the city’s dense Fenway neighborhood in 2018; and was the founding president of the International Association of Art Museum Directors.Commenting on her new role, Brown said: “I’m excited by the opportunity", "The next Biennial should be held at least once a year. •On the future of the Biennial, artist Lauri Markham said: “We may never know exactly what will unfold, and certainly not what will be selected for the 2019 edition. But we can be certain that the theme of the next Biennial will involve the themes of our time, both historically and conceptually, and will center around human flourishing.” \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has pulled a twenty-six-foot-tall statue of late Whitney Houston by David McAllister, the founder of the American art-world corporation the Public Art Fund, from its site in downtown Los Angeles. The move was made in response to a complaint that the work, titled “Until We Meet Again,” is “staggeringly disrespectful” to Houston, the first black president of the United States, and has a history of being   “disparaging, disparagingly pointed, and pointedly offensive.” The criticism of the work is not limited to the work of the Public Art Fund. Many cultural figures, including artists and activists such as Janet Mock, Lee-Anne McEnery", "The next Biennial should be held in 2021 and the final one in 2022.\n\n\nAt the exhibition “Art and the Future of Humanity” (2015), the Japanese artist Koichiro Takeda (1924–2016) created a series of paintings that combine sculpture, painting, and writing to examine the possibility of “living together.” The 2016 exhibition was “Living Together,” a retrospective organized by the artist, who was also awarded the $25,000 Koichi and Haruna Prize in 2016.The exhibition opened at the Science Museum of the First Japan Academy (Japan Science Museum) in Nagoya in December 2014 and ran until June 2016. During the exhibition, Takeda presented his first paintings since he first moved to the country in 1962. His current exhibition consists of five paintings that are part of a series that are part of a series that is part of a series that is part of a series that is part of a series that is part of a show that is part of a performance that is part of a production that is part of a novel that is part of a collection that is part of a documentary that is part of an exhibition that is part of a film that is part of a series that is part", "The next Biennial should be held in 2021, and the first iteration in 2022. The museum will also be remodeled and will boast of more galleries, a theater, and a café. The installation of the museum in such a large city as Berlin is unprecedented. Its development, which will come at a time of tremendous change for the city, was supported by a total of $44 million from the Max Beckmann Foundation, the Pergamon Foundation, and the Art Foundation. The new destination for Art Berlin, the Art Berlin Pavilion, and the Art Berlin Museum, which is currently under construction, will be inaugurated by a solo exhibition of works by the German artist Ebert Vogel at the Neue Museum in the summer of 2021.With the renovations of art museums, the future of the city is now uncertain. “The construction of the new museum is not only a task of cultural heritage, but also an opportunity for the city to show the physical manifestation of the cultural heritage,” Karolina Wojtas, artistic director of the city of Berlin, told the Art Newspaper. “We are already learning about the new museum project, which will be different from what has been set up in the past, and", "The next Biennial should focus on pan-African and regional histories, and should include the exhibition of work on eleventh-century African art. In its inaugural iteration, the exhibition was organized by the African Museum of Modern Art in Dakar, Senegal. The 2020 edition will feature work by artists from thirty-six African countries and the twenty-two United States.  The 2020 exhibition will feature work from forty-eight African countries and ten countries outside Africa, including Chile, Lebanon, Mauritius, Senegal, Palestine, Mexico, and Peru. The 2019 exhibition was curated by an international group comprising Luli Mzābo, Erma Bonzi, Michèle Chagnon, and Olu Ose. The 2018 exhibition was curated by Martin Loewy; the 2017 exhibition was curated by Simon Elliot; and the 2013 exhibition was curated by  KATHMANDU PORRAGONA.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Naima J. Keith, the first black curator to helm the institution’s twenty-fifth anniversary, as its next director. Keith, who currently serves as the curator of twentieth-century paintings at the Frank Gehry–designed Museum of", "The next Biennial should focus on multi-dimensionality and how art and design connect to the very fabric of our lives, and how the exhibition could explore the idea of the transformative influence that art has on our lives and on the world.”The exhibition, titled “Guerrilla Painting” and organized by the collaborative studio Nari Formal, will be held at the San Francisco Museum of Modern Art from April 3 to April 7.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of seventy-five works from the collection of painter and educator Sidney Hampton, which includes paintings by masterworks such as his The Colour of Magic (1937), 1977, and his “Sister,” 1995, for which he painted a version of the biblical story with a young nun, the sister of a fellow painter and educator, as the central image.The work, located in the collections of the MFA and the New England Museum of Art, was donated by a collector who was a student at the institution when it was still P.S. 124 in 1953. Chester Hamlin, the museum’s founding director, said: “Sidney invited me to join his family in celebrating the institution’", "The next Biennial should take place in 2021 and will involve thirty-nine artists from the San Francisco Bay Area. The inaugural exhibition will feature work by forty-nine artists and will open on October 18. Guests will include artists from all over the world.\n\n\nThe Metropolitan Museum of Art in New York has announced that it is planning a major revamp of its collection, which is currently housed at the museum, with a new exhibition series, workshops, and classes. The reopening of the museum will likely coincide with the opening of the new museum in the city’s Financial District. The plans were made in response to the coronavirus pandemic and the city’s need for more museums.Among the key changes are the appointment of five new members to the board of trustees: Egyptian-born Roberta Smith, the founder and editor in chief of the Egyptian monthly magazine Al-Hayat; Laurie Anderson, the director of the Serpentine Galleries in London; Roberta Smith’s daughter, Anwar Farid Smith, who will serve as the museum’s interim board chair; and Mark Duggan, a graduate of the institution and a former board president.“More than ever, the Met’s board and board of", "The next Biennial should be held in 2020, and the first in 2021.\n\n\nThe Chicago Architecture Center (CAC) has named Seth Stephens Director and curator of the next edition of the Lincoln Center’s Lincoln Center for American Art (LCA), entitled “After Lincoln: Art in Progress,” which will open in the fall of 2021. Stephens will helm the center alongside John D. and Catherine T. Jones, who will serve as its founding curator.“Seth’s work brings an array of perspectives to the Lincoln Center—from a critical and contextual point of view, to an exploration of the relationship between art and politics, and between institutions and the public,” said CAC director Hilma Betancourt. “His curating and organizing skills and impressive record in exhibiting and exhibiting in the Lincoln Center, which has been a foundational incubator for the Museum of Modern Art, make him perfectly suited for the job.”The institution also named Bethany Morrow as associate curator of photography. She succeeds Monica Zahn, who departed the Lincoln Center in September 2019 to head the Metropolitan Museum of Art in New York, and will begin her tenure in January 2021.“There is no greater honor than the opportunity", "The next Biennial should kick off next month in May 2020 and will feature thirty artists who have made important contributions to the art of architecture, including Tadeusz Koroteński, Chris Mark, Heiner Mayer, and Kanuša Marais.The 2019 edition of the exhibition featured thirty new works by forty artists, including Andy Warhol, Paolo Baratta, and Frank Gehry.\n\n\nThe National Museum of Fine Arts (MoFA) in Washington, DC, has added two new members to its board of directors: artist-in-residence Mary Ellen Brown and artist-in-residence Amelie Cota. The museum also announced the appointment of Anna-Sara C. Cichocki as its first director and Elisa L. Efre as its new deputy director.Born and raised in New York, Cichocki has been a living artist in Berlin since 2001. Her work has been exhibited in Berlin Biennials Berlin, Projekt-Bundeskunsthalle Berlin (2017), and the Museum der Moderne Berlin (2019). She is also a cofounder of the experimental art space the Planetary Institute, which has hosted the artist-in-residence, and has had solo", "The next Biennial should be held in 2022.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Markus Raetz as its new chief curator of modern and contemporary art. He succeeds Sarah Schellnhuber, who retired in March following twenty-six years at the museum, which has a permanent collection of more than 7,500 works.“We are thrilled to welcome Markus to the National Gallery,” Juliette Zwiers, director of the new institution, said in a statement. “His breadth and depth of experience, as a curator, author, and educator, will be an asset to the gallery, and our mission of sharing international and contemporary art will be enhanced by his expertise.”She added: “We are looking forward to working with Markus as he ensures the gallery’s contemporary collection of works from around the world, including work by renowned artists, is presented in a timely and accessible way. We are eager to work with him to continue to present the diverse histories and styles of art that define the gallery’s collection in a timely and accessible way.”Schellnhuber had led the gallery since 2011 and oversaw the transition to a new contemporary wing of the", "The next Biennial should be in 2021.  The next exhibition should be at the Museum of Contemporary Art Chicago in 2021.  The next International should be in the same year.  The next monographic exhibition should be at the Künstlerhaus in Frankfurt in 2021.  The next retrospective at the Metropolitan Museum of Art should be at the museum in 2020.  The next museum-wide event should be at the Metropolitan Museum of Art in 2020.  The next museum-wide exhibition should be at the Metropolitan Museum of Art in 2021.  The next museum-wide symposium should be at the Met in 2021.  The next museum-wide exhibition should be at the Smithsonian American Art Museum in Washington, DC, in 2021. The next museum-wide festival should be at the Smithsonian American Art Museum in Washington, DC, in 2021.  The next museum-wide celebration should be at the Metropolitan Museum of Art in New York in 2021. The next museum-wide ceremony should be at the Metropolitan Museum of Art in New York in 2021. The next museum-wide reception should be at the Metropolitan Museum of Art in New York in 2021.  The next museum-wide lecture should be", "The next Biennial should focus on how logistics, security, and the legacy of the Cultural Centre can be reconsidered to include greater community engagement and collaboration to address the challenges and challenges that currently confront the Centre.The new Biennale of California will take place in 2020. The Ujjain Art Gallery in Mumbai will embark on a project to raise $100 million to establish the first institution of its kind in India. The institution will host over seventy artists and will organize exhibitions in addition to hosting students and other cultural workers. The newly created Indian Institute of Art, which aims to provide an international platform for the study of indigenous art, is planning to launch a new section on indigenous art next month. The new section will focus on the history and theory of art and will be organized by S. S. Bhardwaj, associate professor of art history and politics at the University of California, Berkeley. The Centre for Contemporary Art (CCA), a newly created body, will be inaugurated by a five-day event in January 2021.“We are committed to fostering an environment for dialogue and debate that is inclusive and respectful and that enables the creation of new ideas and new ways of seeing, thinking, feeling, and acting,” said Andrew Broad", "The next Biennial should be held in late spring/early summer. Last year’s exhibition, “Merry Go Round: Art in Motion” was closed until June 29. The twenty-fifth Biennial was held in August and ran from September 6 to September 9.\n\n\n\n\n\nArt historian and educator Mona Cohen, one of the founders of MFA San Francisco, died on September 3. She was ninety-one years old. Known for her writings on art, design, and performance, which often addressed subjects that were outside of her own expertise, Cohen was a legendary teacher who brought her art-world skills to her students.Born in Los Angeles in 1938, Cohen moved to the Bay Area at age fourteen. She graduated from the University of Southern California in 1951 and began teaching at the San Francisco Art Institute (SFAI) in 1957. She taught at the institution until 1971, when it shuttered after a thirty-year run due to a financial dispute. In 1994, Cohen moved to New York to teach at the School of the Art Institute of Chicago, where she continued teaching until 1999, when she retired.Her work has been collected by the Los Angeles County Museum of Art (LACMA),", "The next Biennial should be announced by the end of the month. The curators, Richard and Sharon, have worked together since 2005, when Richard was a professor at the University of Delaware. They were not connected when this exhibition was conceived, but they were instrumental in bringing it to fruition. Richard has served as curator at the museum for more than twenty-two years and Sharon has curated exhibitions at the museum since 1988. The exhibition will also feature works by artists such as Ed Moses, Barbara Kruger, and John Paul Mitchell.\n\n\n\n\n\n\nThe Museum of Fine Arts (MFA) in Boston recently received a gift of fifty-five rare works from the collection of a group of collectors known for their high-quality art and their connection to the local community through the museum’s relationship with the Montauk family. The gift includes works by artists such as David Salle, Robert Irwin, Benjamin Salle, and Julia Salle, as well as works by artists whose works have been previously displayed at MFA but never on view.“The Montauks have been a powerful force in the arts for more than two hundred years,” said director Mark Bannister. “We are grateful to the", "The next Biennial should be held in 2021, and the twenty-fifth in 2021. Both of these dates are within a decade of each other. * Although the city of Chicago has not yet committed to any date for its reopening, it said that it was reviewing the city’s buildings’ construction and demolition plans in order to determine the best time to re-open.\n\n\nThe Museum of the City of New York (MOC) has received a gift of more than fifty artworks from private collectors, including works by the Italian-American architect Paolo Baratta and the Mexican-born artist Iñigo Cruz. The works—which were bought by MOC in the third quarter of 2019—also include works on paper by the Mexican artist Tomas Medina and the artist David H. Koch, among others.The gift, which includes works by Iñigo Cruz and Paolo Baratta, was made to MOC through a joint venture between MOC and businessman Jorge María Azar. The institution plans to donate the works to the Museum of Modern Art in New York City.“Jorge María has been an extraordinary partner in the development of MOC’s collection,”", "The next Biennial should include a presentation of the state of work in the field and a reflection on the way it might continue to move forward. The exact date is currently unknown.\n\nThe National Gallery of Scotland (NgS) has scheduled the first edition of the National Art Biennial, “The Art of Life,” for May 2021. The event will culminate with a reception in the summer of 2021. The seventy-three-year-old institution will stage the second edition, which will take place in September, in the autumn of 2024.This is the second year that the National Gallery of Scotland has held a biennial. The 2017 event featured work by seventy-five artists from twenty-nine countries and sixty-eight cities. The exhibition was organized by the National Gallery of Canada’s Centre for Contemporary Art and the National Art Centre. The theme of the biennial was “Life After Death,” and the twenty-two-day event will culminate in the opening of the new Pearl Street Gallery, which is currently under construction in Glasgow, on September 29.Last year, the exhibition attracted 3.2 million visitors to the museum. The 2019 event, which featured work by forty-nine artists from twenty-", "The next Biennial should be held in the autumn of 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Jane Panosian as its next director. Panosian will be responsible for the health, well-being, and well-being of the institution’s collections, the operations of the museum, and its staff. She succeeds Howard Ritzman, who has served as director of the museum since 2015.“I’m very excited to welcome Jane to the team at MoCA,” said director Bob Boilen. “At a time when we are growing our audience and our collections at such incredible speed, Jane is focused on bringing MoCA’s collection and exhibitions to a new level of excellence and accessibility. We look forward to working with Jane and her team. Her talent, passion, and energy will be a tremendous asset to MoCA as we continue to engage with and explore new ideas and creative approaches in contemporary art.”Panosian’s first project at the museum will be the renovation and expansion of the museum’s current building, which houses the institution’s collection. The project will include the rearrangement of the museum’s", "The next Biennial should be held in 2022. \n\n\nThanks to the European Union, the Bank of England and the European Court of Auditors, the British Museum and Tate will receive a total of £3.6 million in aid for the 2019–20 financial year. The sum is the sum of money that has been allocated to the arts by member states since the coalition government was formed in 2010. The funds will be given to the institutions in the form of loans, grants, loans guarantees, loan cancellation, loan overdrafts, interest-only loans, and loan rescissions.The artists and performers that have benefited from the EU’s assistance are Elton John, Amit Baratani, Aminé Avery, Lin-Manuel Miranda, Léa Seydoux, Kirsten Ennis, Jasper Johns, Adrian Piper, Gregory Oliver, Ricardo Alonso-Marín, Alexandra Petrovitch, Alexandra Sammary, Ella Steindorf, Aadila Kaskass, Chloe Sevigny, Samantha Stephens, Timur Tezuka, Timur B. Yayka, Arts", "The next Biennial should take place in the summer of 2022. The first installment, “The Diaries,” was held in June 2022 and featured photographs by David McKee, Charles Gordon, and David Salle. The second, “The Experiments,” was held in November 2022 and featured photographs by Ben Buchanan, John Crowley, and Chris Rock. The third, “After the World Trade,” was organized in November 2021 and featured photographs by Michael Rubens.\n\n\nThe Metropolitan Museum of Art in New York has acquired the coproduction rights to the Arabic-inflected painting Surah al-Kamil, which was painted in the late seventh century by the Iranian artist Mahmoud Ahmad Shah. The museum is the first institution to acquire the work. Its acquisition is part of a multiyear initiative to increase the circulation of the work in the United States. The program, dubbed the Metamodel, invited more than sixty foreign artists to the institution for a residency, which ran until September 2020. “The Metamodel is a step towards providing an international platform for the work of this work and other works by Ahmad Shah,” said Nicholas H. Foerster, director of", "The next Biennial should be held in 2021 and will take place in the Grand Palais, Paris. The event’s director, Kiki Smith, told the Art Newspaper that the museum has been working on the project for more than two years, but that the museum had not yet decided on a theme for the event.\n\n\nThe Danish architect and curator Ingvild Magnusson has been named the winner of the Norwegian Art Prize, which was established in 2011 and awarded in the capital city of Oslo. The €90,000 ($95,000) award is the largest prize Denmark has awarded to an indigenous artist in its six-decade history. The design and architecture professor, who previously served as director of the University of Copenhagen’s Institute of Design and Modernity, was presented with the award at a ceremony hosted by the institution in Oslo on Tuesday.Magnusson’s design, which incorporates gold leaf and arabesques from the Norwegian Highlands, inspired the architect’s 1920s interior, which was constructed in a series of glass and steel structures. The exhibition was curated by the Norwegian architecture historian Tilo Norden, who also curated the 2017 exhibition “Rendering the Future: Contemporary Architecture from Denmark�", "The next Biennial should be about “global culture,” said Hernán Díaz, president of the National Museum. “That has been the theme of the Biennale since it began in 1970.”The design, which was developed by the company Protégé, was chosen by a committee comprising the chief curator of contemporary art, Jean-Pierre Bière; the artist and curator Karel Appel-Zellweger; and the entrepreneur and collector Georges Apostu; the exhibition will be organized in collaboration with the Institut National des Arts et Littéraises de France (INAF), the French Ministry of Culture, and the French Ministry of Culture of Culture. It will take up the themes of ‘international collaboration,’ ‘confrontation and resistance,’ and ‘the shadows of art and the dreams of art.”The show will feature original works by twenty-five artists, including the Danish artist Mikkel Sæther, whose work was chosen for its “ecological logic.” They will also rework an existing work by the Belgian artist Michaël Bénétié, whose work is currently on display in the Biennale’", "The next Biennial should be held in 2021 and will be inaugurated by an exhibition of work by the artist, Renzo Piano, in the museum. The institution is currently working on the design of an entrance that will allow visitors to enter through a series of glass doors located in the museum.A spokesman for the exhibition said: “We are excited to see how this magnificent institution will evolve in the coming years. As it develops, it will transform into an even more remarkable exhibition of the work of the very best artists. The next Biennial will always be a unique, international platform for the enrichment of contemporary artistic practice and remain open to the public.”\n\n\nFrance and the United Kingdom recently declared war on ISIS in an attempt to stem the rise of the terrorist group across the globe. On May 24, British Prime Minister Boris Johnson declared that the UK was planning to leave the European Union in a historic departure ceremony, and the French president called the move a victory for freedom.While the decision sparked international outrage and frustration across the globe, Britain portrayed the move as a victory for freedom. “Our decision is a victory for democracy, for the British people, and for the battle against terror,” Johnson said. “This is a day when", "The next Biennial should be held in 2021. The rest of the set pieces will be a collaboration between the artist and the Biennial’s executive director, Marta González-Villar, and director, María Berrío.We are developing new strategies to support artists and their work in the run up to the 2021 edition, so we are working with the institution to be able to offer more accessible and convenient exhibitions. On the ground, we are monitoring the situation and working with the experts to ensure a successful and robust programme.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is pushing back the opening of its new location in the city next month, and a month later than originally scheduled. The California native, who is reportedly set to begin construction on the $125 million museum on June 25, has committed to moving the entire mission across the country. The institution has yet to announce when it will open, or when it will be able to move in full.“We are working hard to ensure MoCA stays close to the people and our community, while simultaneously ensuring we can continue to thrive as an independent museum in a city that is rapidly becoming one of the most livable in the country,”", "The next Biennial should be held in the spring of 2020. \n\n\nThe Visual Arts Foundation (VAF) in New York has welcomed Martijn de Vries to its staff. De Vries will be the first director of the Visual Arts Center (VAC) outside of the United States. He succeeds Mark S. Larson, who was hired to lead the center in February 2019 and who departed in March to join the New York City Department of Cultural Affairs.“The Art Newspaper reports that Martijn De Vries has joined the staff of the Visual Arts Center, bringing with him a wealth of expertise in the art world and design,” the organization said in a statement. “We are delighted to welcome him to the team and to support his work as he continues to advance the work of the Visual Arts Center, and our audience of twenty-five thousand.”The Visual Arts Center is a nonprofit organization that works with approximately one hundred artists each year, including the Guggenheim Museum, the Metropolitan Museum of Art, and the Whitney Museum of American Art. It is also a hub for exhibitions, education programs, and other programming that promotes contemporary art.In a statement, the Visual Arts Foundation said: “In order to address", "The next Biennial should take place in 2019. \n \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Adam Horowitz, a curator and avid collector, as its next executive director. Horowitz will be tasked with leading the institution through its first year under the new leadership of director Katharine Jennings.“We are grateful to Adam for agreeing to join us in this year’s fundraising campaign, and for his service as a leader in our collection and exhibition practice,” said principal curator Anne Fredrickson. “His accomplishments and passion for art make him uniquely qualified to lead the MFA through these challenging times.”Becky Rand, MFA’s director of collections, added: “We are thrilled to welcome Adam back to the board. He has been instrumental in shaping the MFA’s collection, exhibitions, and education programs over the past five years, and has been instrumental in strengthening the museum’s relationship with the Boston community. . . . We are confident that his leadership qualities, vision, and energy will make him a strong and talented ally for the MFA as we continue to build upon the foundation of the past five years, and to create new opportunities for Boston arts.�", "The next Biennial should be held in the spring of 2021. \n“I’ve been fortunate to be involved in World War II in a major way, and I’ve been able to make the most of the opportunities,” said Halber. The museum, which is currently closed until September 29, is currently working with the National Gallery of Art to provide additional exhibition space for “Animals.” The institution will also soon unveil two new works by David Salle. The first, a series of drawings by the artist which examine the relationship between black and white, will be on view in the spring of 2021. The second, a work by Salle, which consists of a series of reflections on the American Civil War, will be on view in the spring of 2022.\n\n\nThe Tate has appointed Caroline Edwin as chief executive of the British Museum. She will be responsible for supporting the museum’s public-facing and educational efforts and for leading the museum’s curatorial team across all of its locations, both in London and in the United States.  “Caroline is an experienced and accomplished leader, who has led institutions across Britain for more than twenty years, and I’m looking", "The next Biennial should be held at the town of Marrakech, in northern Morocco, in 2022. \n\n\n\nOn Wednesday, the Italian government announced that it will give American artist and philanthropist Peter Abeles a $6 million grant to restart a new arts center in the city of Pozzallo, Italy, which was badly damaged during the fighting in Syria, the birthplace of Osama bin Laden and Abu Bakr al-Baghdadi.The center will be established as part of a $8 billion package of projects that will help the Syrian arts. Among the projects are a school in a besieged city in the province of Homs, which will be equipped with a studio, an amphitheater, and a performance space; a library in a northern Syrian village, which will host a collection of works by American, European, and Israeli artists; and the creation of a center for sculpture, which will focus on the preservation of the heritage of Syrian art.“Alesses has shown great creativity in developing creative projects and in nurturing the Syrian art that he has produced,” said Marisa Bicchierotti, president of the CNA-ASTA Foundation, which is spearheading the project. “We are grateful to Peter for his generous", "The next Biennial should be held in the fall of 2020. However, the following year will bring a new exhibition, the 2018–19 Design Biennials, and the 2019-20 Exhibition Biennials. The exhibition series will now be held at the new Oosterhuis Biennial in the spring of 2021.The new Biennial of Arts, Design, Entertainment, and Media will be organized as follows:• Art Fair 2019: “Design and Art in the 21st Century”“Technology and Design: A Modern Story”“Design and Art in the 21st Century” will be held at the Oosterhuis Museum of Art in Amsterdam from September “17 to September ’17. The exhibition will be held in the Oosterhuis Art and Design Building. The Oosterhuis Biennial will have a new exhibition of work by the experimental artist Rachida Adilya, whose work was part of a series of public exhibitions at the Oosterhuis Museum of Art from March 2018 to March 2019.\n\n\nLoring Randolph, an American painter and sculptor best known for creating integrated landscapes that communicate her social, political, and religious presuppositions, has died at age eighty", "The next Biennial should include a closing ceremony and a public viewing of the exhibition. With the creation of the Biennial of German Image Art, the Federal Office for Culture and Craftsmanship (Bundesammlung) is working together with the Bauhaus to present a new series of exhibitions and personages. The exhibitions will focus on the integration of art and design in the twentieth century and will be led by Hildegarde Städels, the head of the Museum of Modern Art, Berlin; Haus der Kunst, Munich; and Sigmund and Joachim Kreuz, the founders of the company Kreuz. The exhibition will be organized as follows:October 3--September 10, 2019November 17--January 7, 2020SUNY Oswego: 2019–20! Reuniting with the Art Institute of Chicago through the free and open program, SUNY Oswego will present a series of exhibitions celebrating the work of participating artists, which will be organized as follows:September 27--September 29, 2019January 8--February 16, 2020New York: 2019–20! The exhibition will be hosted by the Art Institute of Chicago in association with the Museum of Modern Art in partnership with a", "The next Biennial should open in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco has welcomed Michelangelo Antonioni to its board of directors. The Italian-born, New York–based artist and educator announced today that he will serve as the board president of the museum for a two-year term. Antonioni will assume his new role in January 2021.“We are thrilled to welcome Michelangelo to the board of the MoCA,” said board chair Robert D. Peterson. “His leadership and leadership qualities both as an artist and educator make him a superb choice to continue to guide and guide the museum, as we continue to integrate art, design, and design in our programs for the next iteration of the Alamo Drafthouse.”Antronioni is currently a faculty member at the Fashion Institute of Technology (FIAT) in New York and serves as a founding member of the traveling commission exhibition series. He is also an adjunct professor at the Fashion Institute of Technology’s department of art history and design and the director of the fashion and design series, which is led by Emma Ryan.“We are all excited to see what Michelangelo will bring to the board of the MoCA", "The next Biennial should take place sometime between December and March, 2020. The third and final installments of the series will be presented in late March and early April. The fourth and fifth parts of the series will be up sometime between April and May, 2020. The fifth edition of the exhibition will be held at the Museum of Contemporary Art Chicago in late May, 2020. The Chicago-based artist will be the theme of the fifth, titled After Life, and will produce an exhibition that draws from her experience and reflections.“The artist in me has been embedded within many of [the works] for a long time, and they are in some ways a reflection of my life,” said the artist, whose practice spans sculpture, video, performance, video games, and painting—her works can be found in the collections of the Los Angeles County Museum of Art, the Museum of Modern Art and the Metropolitan Museum of Art, and the Whitney Museum of American Art, among other museums.  “I have been working on the material of life since I was a kid, and I have always been interested in making works that reflect that.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has issued a request for proposals for a", "The next Biennial should take place in the spring of 2020. \n\n\n\n\n\nSara Cahn, director of the Atlantic Institute for Contemporary Art, said: “I am honored to be working with Cindy Sherman and Mark Halperin of the Brooklyn-based, New York–based artist-run space the Shasteen Collective to extend the reach of its new program, the searing, watercolor-based platform Biennial, which opened in New York City this past April. The first iteration of the program—comprising of works in three orchestras and performed by artists from Hungary, Italy, and Poland—showed how a ‘narrative-based’ approach could be a powerful tool for challenging the observer’s understanding of art history and the art world.”Since the inaugural show, which debuted at the Shasteen, the project has received national and international acclaim for its innovative curatorial, strategic, and financial approach to organizing a national exhibition. The third iteration of the program is scheduled to open in the Spring of 2021.The inaugural exhibition comprised three works by the Prague-based artist-run space, which cofounded the nonprofit, the Prague Postad Gallery, with fellow artists in 2015. The works�", "The next Biennial should be held in the spring of 2022. The United States will send twelve artists to the exhibition.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles plans to move the surviving works of the late artist Frank Gehry from its historic location on Central Avenue to an adjacent site. The move is part of a multiyear master plan that aims to renew the urban fabric of the city through the installation of twenty-five million square feet of museum space. The museum will also be renovated, and the interior landscape of the institution will undergo a facelift. “For fifty years, MoCA has been dedicated to celebrating the connections and interconnections of contemporary art,” said architect John Moores, the architect behind the project. “Today, we are at the culmination of our master plan, moving the works into an urban setting and redefining what it means to be an architect.”The new museum will open on the third floor of a recently completed mixed-used project in the city’s North Park neighborhood. Over the next three years, artists will be housed in the museum’s former home in a transformed former McDonald’s, which is being transformed into a place where they can perform", "The next Biennial should focus on “intersection of the arts and life, in the city, and in the country,” Arturo Pascual, who is currently organizing for a reopening of the Museo de Arte Contemporáneo de Buenos Aires (MASB), told The Guardian on Monday. “I believe a general issue is that the art of the gallery is not taken seriously enough.” He added: “I am convinced that no other institution in the city of Buenos Aires is as important as the Museo de Arte Contemporáneo de Buenos Aires.”The decree also outlines a series of actions that are slated to take place in an effort to promote dialogue between the government and the private sector. Among the first steps taken are planning symposia and workshops that can be attended by a large number of collectors, and the creation of an online platform for the government’s consumption. The initiative will also involve the exchange of curiosities and information about artworks; a series of seminars and seminars for local academics, and the providing of three educational centers in the city.In the context of the government’s development of the Autónoma de Buenos Aires,", "The next Biennial should be held in 2021. The Museum of the Humanities, the Museum of Fine Arts, Mumbai, and the KAIST Foundation for Contemporary Art, Lahore, have been awarded the 2019 Museum Awards.The Rockefeller Foundation, which is supporting the Museum of the American Negro in Nashville, has announced that it is giving $5 million to the institution in support of the Museum of the American Negro. The organization, which was founded by C. Douglas Weston in 1892, is one of the most notable black cultural institutions in the United States. It is located in what is now the former Museum of the American Negro’s former home on East Ninth Street in New York City.It is a sad fact that the institution, which has had an open collection of more than 5,500 works by African Americans from the seventeenth to the twentieth centuries, has been destroyed in the name of a “racial justice plan.” The institution was slated to reopen in the fall of 2019. However, due to the coronavirus outbreak, the museum is currently closed until at least December 21, 2020, and has suspended all events with a view to December 20, 2020", "The next Biennial should be held in 2021, according to a statement by the Biennial Organizing Committee. Artforum has reached out to the Biennial for a statement.\n\n\nThe Metropolitan Museum of Art in New York has released the schedule for its inaugural 2019 edition, titled The Best of Friends. The event will run from February 26 to April 6, 2020. “Best of Friends is a collaborative, multi-media, experiential platform for engaging with the themes of friendship, beauty, and art, and the discipline of art and art history,” said Museum director Daniel H. Weiss. “The theme of friendship is an ideal combination of philosophical and playful, and the medium for creating what I believe is the best of art and art history, which is the art of human connection and the art of art as the vehicle for the most intimate of relationships.”The biennial is supported with funds from the Alexandrian Foundation, the Charles and Lucille King Family Foundation, and the Joslyn Foundation.\n\n\nThe Museum of Contemporary Art (MoCA), San Francisco, announced today that it will create more than thirty-five thousand jobs, bring the total number of positions up to fifty-nine thousand,", "The next Biennial should be focused on the development of public policy to address climate change’s adverse impacts on biodiversity; on the management of climate refugees; and on the conservation of the world’s oceans. The twenty-fifth edition will take place in Algiers in March 2021.  The fifteenth edition, which can be seen in the United States on November 23, 2019, is online, and the fifteenth in Germany on November 26. The twenty-sixth edition of the Biennale in Kraków, which is scheduled for March 31, 2021, will be held in Kraków in October 2021. The second edition of the Berlin Biennale, which will take place in February 2022, will be held in March 2022.The 2019 edition featured works by eighty artists, including Werner Herzog (Curator), María Berrío (Director), Thomas Hirschhorn (President), and Mark Heeley (Collector), as well as the return of works by the likes of Lee Krasner, Klaus Lütjai, and Kazuko Miyamoto. The exhibition was co-organized by curator Zoltan Panzarek and Berlin-based curator Anette Vinog", "The next Biennial should take place in 2020. The exhibition’s author, Robert Couse, states that the new format will be “as authentic as possible” but “at the same time will celebrate the resilience of the human spirit.”This opening in London is one of a number of significant changes that will be effected by the withdrawal of funding from the World Health Organization (WHO). The largest disruption of the biennial will be its removal from the capital, with the venue being moved to a more intimate location in Salford Square. The exhibition will remain on view through November 28.\n\n\nThe Art Newspaper reports that the New York City Department of Cultural Affairs has awarded the Seattle Asian Art Museum $10,000 in grants to help cover anticipated operating costs following the March 31 shutdown of the entire nonprofit institution. The funding stream comes on the heels of the city’s declaration of a $25 million emergency fund for Asian art and cultural institutions—the endowment remains open.According to a statement from the department, the grants will support the “prompt and efficient reconstruction and expansion of the museum’s collection and exhibition program to reflect the contemporary global landscape.” The announcement followed", "The next Biennial should be held at the Museum of Modern Art in New York, the Metropolitan Museum of Art, and the Museum of Contemporary Art, Los Angeles. Dr. Marc Glimcher, the director of the Rubin Museum of Art and the Art Institute of Chicago, is also on board, and will oversee the exhibition, which will be curated by Ian Chang, director of the Museum of Contemporary Art Los Angeles. “I’m eager to contribute to this project with the hope that it furthers the growing understanding of the art of the modern age,” said Dr. Glimcher. The project’s publication marks the twentieth anniversary of the exhibition “The Modern Art Connection: A Retrospective,” which launched in 2019. The twenty-first edition of the exhibition, “The Modern Art Connection,” was held in May and featured some thirty more works by artists who came to prominence in the 1980s. It also introduced the public to the work of young artists such as Naima J. Keith, Ezra D. Hicks, and Tony Perry, as well as the work of artists who were active in the ’70s such as Miles Davis, Frank Gehry, and Pierre-Auguste"]