["The next Biennial should take place in the spring of 2021. The full list of participating artists is as follows:Aaron PapeHannah-Jones’s installation Mirrored Worlds3· With Love3· With Love4· With Love5· With Love6.3    Hither and Beyond The Sky· With Love7.3Bianca Del Rio’s work LOCUST TOWARD THE SUNJohn Fouracre’s Studio / LandscapeHannah-Jones’s creation The Storm and the Tide LynxJulia Elizabeth Hirschman’s \"The Promise of Death\"Julia Elizabeth Hirschman’s nighttime workSara Harding’s Eternal PresentHayley Casteel’s work Gatherings of Flowers and BirdsThe Waters of Life and the Waters of DeathCatherine Murrell’s work The Time Machine3.5 Julie Pape’s Molecule GardenHannah-Jones’s installation Bouncing Back4.5Hannah-Jones’s work The Storm and the TideLynxJulia Elizabeth Hirschman’s \"The Promise of Death\"Julia Elizabeth Hirschman’s nighttime workHannah-", "The next Biennial should take place in June 2020, in time for the February 18–March 22 inclusive dates for the 2019 edition, and should offer new works and performances by artists who have not yet been selected by the biennial committee.The full list of participating artists is as follows: The Art of Life: Rügen Russula, Kunsthal Walter de Gruijthuizen in Berlin, July 7–August 2, 2019The Art of Life: Erscha Gptze, Kunsthal Walter de Gruijthuizen in Berlin, July 7–August 2, 2019Marine: Mariner & West, New York, July 30–August 2, 2019The Art of Life: Agnes Martin, New York, July 30–August 2, 2019The Art of Life: George & Mary Martin, New York, July 30–August 2, 2019The Art of Life: Cécile Prodger, New York, July 29–August 2, 2019The Art of Life: Joan Arsht, New York, July 25–August 2, 2019The Art of Life: Paula Scher, New York, July 26–August 2, 2019 The Art of Life: Alfred Stieglitz, New York,", "The next Biennial should be held in 2019. The institution will be rebuilt to resemble the original museum, which will reopen in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco is under fire for denying entry to two LGBT-rights activists: the British artist Ben Jones and the Palestinian artist Nima Nabavi. Both activists were refused entry to the museum on Friday, April 29, because they were not attending a special exhibition about the history of Palestine, titled The Power of the Past, in the exhibition “The Future of Palestine.”This is the second time that the institution has shut down a show featuring the work of two activists for violating its no-camping policy. On Monday, the museum said that it would be “flexible” during the exhibition. “As we work together toward healing the wounds of division and building the future as a community of solidarity, we will be flexible.”In a statement provided to the Art Newspaper, Jones and Nabavi said: “We are deeply concerned that this action was taken in breach of our rights under international human rights law and the museum’s commitment to protect the rights and freedoms of all the museum staff and visitors. We demand that MoCA immediately", "The next Biennial should take place in March 2020 and the biennial will be curated by Adriano Pedrosa. Since the festival typically dates from September to April, the 2019 edition was moved to April 18–March 22.The biennial will feature work by seventy artists and will feature a number of new projects. Among the works that will be exhibited during the exhibition are a reconstruction of an ancient Egyptian temple in Luxor from the artist’s 2005 exhibition at the Guggenheim in New York; a 12,000-year-old bronze sculpture of the Virgin Mary; and a digital work that depicts the life and death of artist Robert Irwin.“Since the biennial is a project, it’s important to have a flexible structure that allows us to bring back to the museum the works that feel most relevant to us,” said Biennial director Flora Cox. “The next Biennial will show the lives and works of seventy-three extraordinary artists in a spectacular setting that will be a reflection of the vibrant city of New York. The artists who will be featured in this exhibition are as diverse as the population of New York.”The full list of participating artists is as follows:1. Ada Arsht, ", "The next Biennial should focus on the concept of 'postcolonialism'\u0097as articulated by Vivian Madani in an interview with the Los Angeles Times earlier this year\u0097a concept that has been largely ignored in the United States, Europe, and Australia. Madani argued that postcolonialism is defined as a world where culture and art originate within and are not influenced by an imperialist or colonial framework. The next two Biennials are likely to be centered on the history of the First World War, the growth of contemporary art in sub-Saharan Africa, and the process by which art and architecture are increasingly being constructed within the structures and histories of colonial societies.The Biennial has repeatedly faced controversy since its inception. In 1999, the Arts Council raised serious concerns about the exhibition after forty-seven artists withdrew from the exhibition that year, citing its “indecent exhibitions and the exhibition of work that is racist, sexist, homophobic, trans-phobic, ableist, ableist, ableist, misogynistic, ableist, racist, ableist, ableist, anti-Semitic, anti-Semitic, anti-immigrant, anti-Black, anti-Jewish, anti-Israel, anti-human, anti-human rights”\u0097", "The next Biennial should have taken place in 2019. However, it was postponed due to the retrenchment of the Chinese Communist Party, and was rescheduled for 2020. In April, the China Museum of Fine Arts in Beijing cancelled an exhibition focusing on artists whose work was inspired by the Cultural Revolution and the Defence Ministry, and sent the works to the National Museum of Contemporary Art, Beijing (MMCA), for a retrospective in 2020. In April, the Chinese government committed to opening the museum to the public for the first time in 2021. “The country’s cultural heritage is a source of strength to the people of China and a source of inspiration for generations of Chinese intellectuals,” the government wrote on the museum’s website. “Cultural heritage and art form an important part of the Chinese identity, and are an important expression of China’s achievements as a modern and modern era nation, and are a source of pride for the many millions of people who have come to see the works of the great Chinese artists, and to choose from among their works.”In response to the state’s declaration of war against the museum, which follows a 2017 attack on the museum by a group", "The next Biennial should be held in 2022, and the first following in 2024. The German city of Bremen will organize the event, titled “The Future of Sunset” and will host a reception for the public in the city center on October 19. According to Artforum, the event is still in development, and no dates have yet been set.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that artist and New York–based collector Mihai Gu, who has represented China in the United Kingdom and the United States, has become the fourth member of its international board. Gu has previously represented China’s National Museum of Art in Beijing and the China Academy of Fine Art in Beijing, and is currently represented by the Hong Kong-based collector and art collector Yu Hong. Gu’s works can be found in the collections of the Shanghai Museum of Art, the Beijing Art Museum and the Beijing Art School, and the Beacon Art Museum, and are currently on display in the exhibition “China: Art and Culture,” which is currently on view through October 26.Gu has also represented China’s National Museum of Fine Arts in Beijing, the Beijing Art Museum, and the Beijing Art", "The next Biennial should be held in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to reconfigure the museum’s kaleidoscopic collection of early modern art into a new exhibition that will integrate more contemporary art. The redesign, called “Sensations,” will take up themes of modernism, aesthetics, and intimacy, and will showcase more work by artists who were active before the emergence of the current wave of artists.“This is not the end,” director Noah Horowitz said in a statement. “We are planning to keep moving forward and will continue to do so. The project will culminate in an exhibition of work by the entire exhibition series, curated by a panel of curators and experts, during the annual ‘s Dec. 19-Jan. 3 event.”The exhibition is being assembled from the works of nineteen artists, including Ed Moses, Takeda Kawamura, M B Hald: An American Vision, and Richard Diebenkorn: The B-Side, as well as two performances that have never been staged outside of New York. The museum will stage the first performance, titled “New World,” in 2021 and the second,", "The next Biennial should be held in the spring of 2020.\n\n\nThe Galleria Maricana in Rome has received a gift of 100,000 Italian Pimento from the Italian Minister of Culture, Dario Franceschini, as part of a multi-year project to raise funds for the Italian Cultural Foundation (ACF), which was set up by the Arts Ministry and the Department of Culture to combat the spread of Covid-19. The gift includes a set of twenty-six lamps, which were made in the town of Tarnovo near the city of Umbria in Umbria Province, in Italy, and are expected to arrive in Rome on January 19.“The gift is a great success in the project of the Minister of Culture, Franceschini, who has been working for many years to find a solution for the problems caused by the coronavirus,” Franceschini said. “As a result of this project, we are now able to completely avoid any future recurrence of this virus. It is a great success for the Ministry of Culture as well as for our artists and curators. We are confident that the future will be bright for the Arts in Italy, and for the region as a whole.”The ministry currently", "The next Biennial should focus on an exploration of the web of relationships between religion and science and how this intertwines with climate change and the rest of the biennial and the biennial as a whole.”\n\n\nThe Danish artist Lars-Erik Neuhaus, who is best known for creating and performing works steeped in environmental crisis and political conflict, has died at age eighty-nine. Known for depicting a bleak, interlinked web of interconnected, overlapping, and overlapping landscapes, Neuhaus created the sculptures in his studio at the University of Copenhagen, where he teaches at the university, the Museum of Modern Art (MoMA), and the Museum of Modern Art in New York.According to the New York Times, the artist discovered the work through a series of photographs by Alfred Stieglitz, a former collaborator who has since died of cancer. In 1963, the artist and photographer purchased two works, “Johannes Alth,” a series of swirling, converging, hued, polyester resin sculptures, and “Schönei Atherton,” a series of identical, but different, glass domes. The artist then used his own body as the backdrop for the series, which were exhibited", "The next Biennial should take place in 2020.”\n\n\nThe Solomon R. Guggenheim Museum in New York City has appointed Nicole Martin as its next director. Martin succeeds Alma O. Brown, who was hired as the institution’s first director in January 2019, and will assume her responsibilities on March 29.“Nicole brings over ten years of experience in the field of modern and contemporary art and will be instrumental in elevating the Guggenheim’s collection and program,” said Guggenheim director Joseph Moneaux. “In this moment of great change, we are eager to welcome her to the Guggenheim and look forward to working with her.”In the upcoming exhibition “Polaroid: Contemporary Art in America” (March 14–March 21), Martin will present a series of interviews with artists, including Mark Rothko, Joan Jonas, and James Turrell, and will present a selection of photographs from the Guggenheim’s collection. She will also present a public art project and will conduct curatorial talks. Martin also serves as a board member of the Brooklyn Museum, the Museum of Art, and the Museum of Modern Art in New York.Comment", "The next Biennial should come in 2021. Curated by Victor J.K. Li, curator of European art at the Museum of Fine Arts, Shanghai, the exhibition will focus on the work of twenty-four artists, including Mark Büttner, Jean-Luc Poujoulé, Konrad Zuse, and Edvard Munch, and will take place in the city of Xian in the \"Great Wall\" of Xian, in the province of Xianzhui, Fujian province, Fujian China.The show will feature work by twenty-seven artists, including Yuichiro Ozawa, in addition to the work of contemporary artists such as Simone Leigh, Berenice Abbott, and Lee Jernigan, as well as works by artists of Asian and Latin American descent. Commenting on the upcoming exhibition, Li said: “The first edition was a long-overdue event. It was conceptually ambitious and art-making was not limited by a narrow framework. Today, with a new and expanded Biennial, we are confident in our vision for the exhibition, which is aimed at opening new possibilities for the exhibition.”\n\n\nThe Corcoran Gallery in New York has sold its majority stake in a New", "The next Biennial should be held in 2022, but the decision to postpone it has been delayed. The museum believes that both the health of its staff and the public and the pressure from the government to reopen have made it imperative to address the situation now, in order to avoid a recurrence of the Covid-19 outbreak. The museum will conduct its first round of evaluations of its permanent collection in stages and will be open to the public from September 16 to September 17, 2020. The institution will hold its next round of evaluations in late October 2020. The museum has produced an additional report that outlines changes that may be made to the museum in the coming months, in order to better protect the collection and ensure that the biennial’s programming can be enjoyed by a wide and diverse community.  After the biennial, the curators will present a new exhibition, “Christmas in the City,” at the Gallery of Modern, which is currently undergoing a major renovation. The show will include selections from the new exhibition “A Celebration of Life” and will run for one week, from November 21 to November 23, 2020. The first exhibition is planned for the Museum of Modern Art (MoMA), which is currently undergoing a", "The next Biennial should include a themed exhibition and a collection of new works on women and the body. The Biennial will also strive to present the latest and greatest contemporary art in a global context.  Theçon’s founding committee consists of Bénédicte de Montlaur, French director of the Saône-Maritime Museum in Cannes, France, and Rory McAllister, director of the Tate Modern in London.The inaugural exhibition will feature a retrospective of the work of Israeli artist Amir Rashid, whose body of work ranges from simple geometric geometric compositions to complex and abstractly textured sculptural works. Rashid’s work will be accompanied by a performance and a film. Gareth Ehrlich, director of the California Institute of the Arts, in Pasadena, California, will serve as the inaugural and inaugural co-representatives of the Biennial. They will perform the work of the same name in the exhibition. The biennial’s inaugural exhibition, the “I’ve Been to the Pearly Gates,” will be staged at the Museum of Contemporary Art Los Angeles (MCA). The Biennial will open in October 2021 and will run", "The next Biennial should be announced by February 8, 2021. About the artist: An artist-in-residence at the San Francisco Art Institute, where he has taught since 2009. He is also a prolific writer, appearing in several books, including Artists: The Art of Everyday Life (Brooklyn Academy of Music) and Avant-Garde: Art and Struggle (University of California Press). The final piece in the exhibition will be a lecture on artists' practices translated into English. Awards: He was nominated for a Pushcart Prize in Paris in 2017 for his installation The Matrix & New York, 2015 for “The Life and Death of Christ,” and the Turner Prize for his work in 1988. In addition to the exhibition, the Biennial will host a series of book signings and public programming, a lecture series, a book club, and a retrospective. Current exhibitions at the Biennial include “The Art of Being Alive: Black and White” (2019); “The Black Book: Art and the Southern Black Experience” (2019); and “The Front: Art and the Black Experience” (2019).\n\n\nThe Gug", "The next Biennial should take place in the new exhibition space the Tange, which will open in the fall of 2020. The twenty-third edition of the Biennial will take place in the South African capital in the spring of 2021. The twenty-fourth edition of the Biennial will be staged in Pretoria in the spring of 2022.“We are incredibly pleased that the Biennial of South Africa is growing in stature and relevance,” said Yusuf Larmon, director of the Tange. “It is our intention to organize the biennial as an important platform for the participation of local and international artists, and to find new ways to collaborate with the local and international community. We recognize that the biennial is a developing medium, that it is in a very early stage, and that we must continue to evolve and experiment with new and innovative ways of working with artists and audiences.”Rekha Sharma, the artistic director of the New Art Research Center in New Delhi, said: “I am thrilled that the Tange will host the Biennial of South Africa in 2020. We were thrilled by the positive and timely support given by the government and the international community to our proposal that this be the platform for South African artist resid", "The next Biennial should be held at the Museum of Contemporary Art in the Arts (MCA) in New York, and organizers said that the exhibition should explore the ideas of a new kind of museum, one that fosters a sense of community among a community of curators by connecting them through artificial intelligence technology. The conference is expected to last between five and seven weeks and will feature more than fifty artists and curators from twenty-eight countries. The Biennial of Visual Arts is expected to take place in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Amy R. Martin as its next executive director. Martin comes to MoCA from the Los Angeles County Museum of Art (LACC), where she was the chief of curator-at-large and head of contemporary art. Previously, she served as director of the Art Institute of Chicago, where she helped organize the retrospective “NIRIN” (2017–18); “CHANGELES: The Divine Feminine” (2014–15); “TAMELESS: Works from the New American Years” (2014–15); “WELCOME TO MOCA” (2013); and “MATRIX:", "The next Biennial should be held in September 2021.\n\n\nBillionaire collector Thomas Paine, who amassed the rarest of contemporary art objects, donated his collection to the Smithsonian American Art Museum (SAAM) in Washington, DC, on Wednesday. The donation marks the first time the collection will be shared between the institution and a non-profit organization.“As we prepare to embark on a new chapter with the collection, we are very excited to work with the collection to advance the goals of the Public Art Fund and to create new opportunities for the collection to experiment with new techniques and create new works for the collection,” said David Mullen, director of the Smithsonian American Art Museum.While the gift was announced in May 2019, the collection had been largely unused for more than two years when he donated it to the museum. Its exhibition “Beyond Evolution: The Art of Art” opened in November 2019 and ran throughout the spring of 2020. The collection was moved to the National Museum of Art in Washington, DC, in February of 2020 and is currently housed at the collection’s new home, the Skirball Cultural Center in Akron, Ohio.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MCA),", "The next Biennial should be held in 2021. The official announcement of the date will be made in March of that year.\n\n\nThe French Ministry of Culture has appointed Bruno Fortin as the next director of the Montpensier Art Museum in Paris. Fortin, who has helmed the museum since 2014, will assume his post on January 30, 2021 and will work closely with director Atholène Berger, who will remain on staff throughout the museum’s next incarnation.“Bruno is a man of exceptional integrity and international reputation, with whom I have been working since 2016, when we opened the new museum in the old city of Strasbourg,” Berger said in a statement. “I’m convinced that he is the man for the job. I am ready and eager to see how the new museum responds to the demands of the community.”The appointment marks a turnaround for the institution, which is currently closed due to the Covid-19 pandemic. The museum had previously been charged with planning for the exhibition “Theater of Operations: The Gulf Wars 1991–2011,” a 2018 exhibition that featured the work of thirty-five artists, and staged a number of exhibitions that questioned the histor", "The next Biennial should be held in the year 2020, at which point the museum’s collection will have undergone a major refurbishment and the building will open to the public.\n\n\nThe art historian and critic Alain Badi, a staunch defender of the experimental and experimental, has been appointed director of the five-hundred-year-old Museum Taverne in Paris. He succeeds Marie Dinh-Quentin, who has led the museum since 1990, and will take up his new post on January 6.“Alain Badi is a visionary curator who has shown a distinct understanding of the value and importance of the role of the medium in creating a new understanding of art history,” said Jean-Louis Gassée, director of the museum. “Alain will work to ensure the Museum Taverne remains a source of inspiration and inspiration for all who walk through its doors.”Previously, Badi served as a curator at the museum. He helmed the museum’s exhibition program during a 2015 exhibition titled “The Language of Art: Langage, Spatio-FIG,” which opened at the institution in 2016. He also cofounded the institution’s painting and sculpture department in 2009", "The next Biennial should be held in the spring of 2020.\n\n\nIn a move that has the potential to reshape New York City (and the entire world), the UES Art Museum has announced that it will soon kick off its “Weekends at the Museum of Modern Art” program. The initiative will offer free admission weeknights from May through October and will consist of a series of immersive, outdoor activities that will explore the interconnected histories of art and people, including the historical recollections of a group of children who lived in a nearby former elephant pen and created a comprehensive brand-new work, “Monuments Men,” that will be on display in the museum’s new exhibition “Fashion” from October 24 through December 5, 2020. The collaboration between the UES and the NYC Museum of Modern Art (MoMA) was initiated by veteran photographer Ken Katsuyama, who began photographing the institution’s outdoor exhibitions in the late 1960s.“The Weekly Collection”—a collection of twenty works in various stages of their production—will be presented at the MoMA in the fall of 2020. The work will be accompanied by a traveling companion who will accompany Katsuyama throughout the", "The next Biennial should be released in November 2021, with the exhibition in February 2022.The institution will also include a new, interactive public sculpture, “Avant-Garde: Freedom of Vision,” on the first floor of the museum in November 2021, and “Bibliography: Free Reading,” on the second floor of the museum in February 2022. The exhibition will be organized as follows:1. “Avant-Garde and the Birth of Modernism”Opening with a lecture by Hermann Perman, editor of the journal Artforum, and Hans-Ulrich Obrist, curator at large for the exhibition, the exhibition will feature thirteen works by forty-three artists, including Raalt, Cai Guo-Ju, Olaus Magnus Astell, Michael Beschloss, Harald Szeemann, Emmanuel H. Koons, and Paulo Freire. It will also present new works by José Manuel Montalvo and Claude Ralph. The full list of participating artists is as follows:1. Hermann Perman, Artforum August 2017-January 20182. Claude Ralph, Architecture and Design", "The next Biennial should take place in the autumn of 2020. Advancement plans for the exhibition have not yet been announced.\n\nThe Pérez Art Museum in the Spanish city of Valencia has launched a new digital platform that will allow visitors to see works by artists such as M.C. Escher, Pablo Picasso, and Marta Modigliani in a digital format. The exhibition, titled \"La única y la Demóstica,\" will be presented by the museum in the fall of 2020 and will run simultaneously on both the internet and the Pérez Art Museum.Following a new agreement between the Pérez Art Museum and the National Museum of Modern Art in Barcelona, the Pembrokeshire Museum and the Art Gallery of Manchester, and the Pérez de la Plábaya in Spain, the Museum of Modern Art (MoMA) in New York will host the inaugural exhibition of new works by M.C. Escher, Pablo Picasso, Luis Buñuel, and Oscar Niemeyer in the fall of 2020.These works, which were only published in the United States in 1991, will be on display in a solo show presented by the museum in the fall of 2020.", "The next Biennial should be held in the spring of 2020. Artforum has reached out to the 2019 winners for comment.\n\n\nAfter a six-week investigation, the National Gallery of Art in Washington, DC, finally took the controversial step of removing a controversial sculpture by the late Chilean artist Ramón Bonifacio from its grounds in late April. The controversial installation, titled Soledad, was made in response to the US-backed military regime in Chile that began in 1998 and has been condemned by the United Nations, Amnesty International, and the United States’s State Department.“We took the decision to remove the work as a courtesy to the artist and his family,” said Mara Peralta, the director of the National Gallery. “The work is problematic in several ways. First, it is the work of a deeply unpopular and controversial figure; it was installed in the gallery without the artist’s consent or knowledge; and it is being displayed in public in an exhibition that is meant to be educational and to demonstrate how art can be a tool for social change. We have been working with the artist since July to address the issues raised by the installation and to develop a process that would have led to", "The next Biennial should take place in 2022.\n\n\nThe Frankfurt Art Museum (FAM) in Germany has announced that it expects to draw some three million visitors to its new 75,000-square-foot space in the city of Frankfurt, Germany, during its inaugural season. In a statement, the museum said that it expects to implement a number of changes, such as introducing free admission for groups of ten or more, improving accessibility, and extending hours.In addition to the changes listed above, the museum also said that it expects to make several other improvements to the museum, such as adding a theater and restaurant, renovating the museum’s galleries, and expanding the museum’s collection. Such a project has been in the works for more than a decade, but the institution has faced numerous setbacks: In 2011, the museum arrived at the end of its sixth season, but only after it spent more than two years renovating the building in which it had just completed its season.The new building will be inaugurated by a US blockbuster film, American Hustle, which will be shown in an indoor space that will have a view of the Grand Central Station. Following the film, the core of the museum will take over the space formerly occupied by the", "The next Biennial should be held in 2021.\n\n\nThe Museums Association (MA), an international group of British arts professionals, has welcomed five new members to the board of trustees of the annual contemporary art biennial. The four new members are Matthew Booth, Christopher Clayton, Sean Crowe, and Barry Warren. The biennial was founded in 1998 by the Association of Independent Curators (AIC), with funding from the English Institute, and is supported by the Sacklers, the former owners of the British publishing house the Simon Brand Group.AIC, which was founded by Richard Desmond in 1988, is run by a board of trustees comprising Matthew Booth, Sean Crowe, and T.J. Dobbins. The three remaining trustees are Peter Salter, Andrew Shorter, and David Ward.MA president Anne-Marie Schaefer said: “We are incredibly pleased to welcome these five bright and committed members to our board. They will play an important part in ensuring the biennial is a success and ensuring that it maximises its impact on contemporary art, both in and outside the UK.”\n\n\nThe Museum of Contemporary Art (MoCA) in New York has released the list", "The next Biennial should include the introduction of a new theme, “In the Presence of Other Worlds.” The biennial will be organized by the Museum of Modern Art in New York, which will close on March 31, and the Museum of Contemporary Art Los Angeles (LACMA). Submissions must remain on file for eight weeks and must be avaialble by February 2. This year’s biennial was curated by Chris Atkins, art critic for Artforum and Los Angeles and the Los Angeles Times. It will intensify in February 2019. The next iteration of the biennial will be staged at the Los Angeles County Museum of Art (LACMA) as part of “DRAWING WITH LAUREN.” The event will run from March 13 to March 17.\n\n\n\n\n\nSydney’s Art Museum has received a major blow to its board of directors after CEO David Levy announced that he plans to resign in March 2020. While his successor will be chosen by the board of directors, Levy has since indicated that he intends to serve through 2020. The announcement followed an effort to restructure the institution, which is currently undergoing a $75 million expansion and is currently closed to the public.", "The next Biennial should also see Panorama and the fine arts center present a new selection of works by the Chinese art of the late twentieth century. An extra lecture on the history of Chinese art and a Q&A session will also be organized. The two-day event will be held at the museum in the city of Nanjing, the capital of China’s western Jiangsu province, on September 22–September 26, 2020.\n\n\nThe Louisiana Museum of Art (LMA) in New Orleans has received a gift of twenty-six works by artist Heath Ledger. The works are all from the artist’s series “Big Five,” 1990–94, which was published by the nonprofit Art Press and the artist’s own collection. The announcement of the gift was made at a ceremony held on Saturday, May 8.“I’ve been a huge fan of Heath Ledger for a number of years,” said Mark Lamont, director of the Louisiana Museum of Art and LMA’s curatorial team. “His work seems to be in constant movement, evolving and shifting, and I’m excited to see what the next eighteen months bring.”Ledger previously received", "The next Biennial should be held in December 2022. The exhibition will be organized as a collection of all works produced by the four artists in the years 1974, 1975, 1978, and 1979. The exhibition will be centered around the theme, Life and Art, and the following elements are considered as a part of the theme: craft, craftsmanship, craft of course, craft of painting, and the exhibition will include a selection of works from the exhibition.In order to facilitate the exhibition “life and art,” the artists are asking for $170,000 for the first round and $100,000 for the second. The budget for the final exhibition was doubled. “We are at the beginning of the sea,” Schoelkopf said in an interview with the Art Newspaper. “We need to continue to work together on this subject, and at the same time to think creatively about what life should be, and how art should be perceived.” The exhibition is scheduled to run in the Government Museum of Culture in Prague, the Central Library, and the Museo d’Arte Moderno, from June 20 through June 28, 2022.\n\n\nThe Allen Memorial Foundation has announced that it is reopening", "The next Biennial should aim to include all works in the exhibition that are not currently on view in the exhibition or currently in development. It should then focus on the exhibition’s future. “Exhibitions are an indispensable part of a culture that is responsible for the exhibition of the work of the artist in the first place,” said Tjibbe. The 2018 edition featured work by Sara Cwynar, Yelena Mizhevich, and Lévy Gorvy Les Métals, among others.\n\n\nThe National Museum in London has appointed Brendan McInerney as its new director. He succeeds Joi Ito, who has helmed the institution for nearly twenty years, and is expected to take up his new post in January 2021.“Brendan McInerney is a capable and talented leader who has led the National Museum for over twenty years and is dedicated to bringing the museum and its collection to life for contemporary audiences,” said Ito. “After an extensive search, we chose Brendan for his vision, energy, and commitment for the museum. We are confident he will make an outstanding director of the National Museum and the National Gallery of Art.”", "The next Biennial should be held at least once every two years. The theme of the 13th event will be “the esthetics of art.”The twenty-fifth edition of the biennial will take place at the Palazzo Prada in Venice from September 16 to September 21, 2020. The a cappella group exhibition “Art I Never Saw” will be staged in the city from September 13 to September 16, 2020, with the exhibition opening on September 14.“Culture is the lifeblood of society,” Mair said. “The theme of this year’s biennial is ‘art that will never be seen.’ The exhibition will be a simulation of a museum, a collection of works that have never been shown before. The exhibition will be like a voyage to the unknown, through this century’s art and the next.”The exhibition will be organized as follows:The exhibition will feature only works that are currently in the collections of museums. It will also include a special special section devoted to the legacy of the late Italian architect Carlo Cipolletta, who created the Villa Maribara in the Italian city of Umbria. The segment will consist", "The next Biennial should be held in the autumn of 2020. \n\n\nThe Sisseton Museum of Art in New York is planning to open a new public space in the city next year. The institution, which has housed more than 1,000 works since it was founded in 1891, announced on Wednesday that it will launch the new public space, Sisseton Memorial Art Museum, in the city in its \"very near future.\"The announcement of the new institution came amid the announcement that the Sisseton Museum of Art will receive $20 million from the National Endowment for the Arts (NEA). The money will allow the museum to reorganize its collection with the goal of becoming more culturally inclusive. The new space will be located in a former textile factory, within a renovated industrial complex, and will draw visitors from the New York City area.The building, which was completed in 1994, contains one of the most important holdings of the American Renaissance, the movement of art and ideas in the twentieth century. It was chosen by the NEA as part of a strategic plan that aims to advance the museum’s mission of encouraging critical thinking about the role of art and the arts in shaping our lives. The Sisseton Museum of", "The next Biennial should invite at least forty artists and scholars, including Janez Jarc, Aiden Clark, and Mark Dixon; will host an open-air performance by a group of forty-three contemporary artists; and will be inaugurated by a panel discussion with João Moutar, José Bregista, and Gere Kavanaugh.\n\n\nThe Institute of Contemporary Arts (ICA) in Lisbon recently awarded the contract work of a curatorial team that will work on the renovation of the Palazzo della Scala in the city of Porto and will lead the project for the next three years. It is the second time the institute has awarded a contract work for the renovation of a building in the capital city in the last five years. The first time, in 2015, the work was for the renovation of an old cathedral. The work for the Palazzo della Scala was commissioned by architect and architect-in-residence Marco Neret, who is also the director of the Institute of Modern Art in Milan, and architect-in-residence Sabine Mermily, who also serves as chief curator of contemporary art at the Museu de Arte de São Paulo. The renovation of the Palazzo della Scala, which", "The next Biennial should be held in the fall of 2020. The next exhibition should take place in the spring of 2021. It is hoped that the installation, an in-depth investigation of the “dark side” of art, will draw new audiences to the city.\n\n\nAs Sydney’s arts and cultural sector gears up for its second year of the biennial, the city’s housing and rental board released its financial results for the five months ending March 31, 2018.Board president Tim Mogil and the Nordic artist-run organization Mishell Carthy, which has staged the annual event since 2015, said the financial results show that the Australian economy is continuing to grow, but at a slower pace, than had been anticipated. “We are seeing a modest but positive rise in the Australian economy, driven by continued investment in the arts and cultural sector,” Mogil told the Art Newspaper. The results also show that the biennial is benefiting from the same robust support from the government that had led to a gain in the arts sector in the first place—$2.1 billion in aid funding for arts and cultural enterprises in 2018—that had already helped push the economy to the highest rate in", "The next Biennial should be held at the city’s Art Institute of Chicago in 2021. As previously reported, the museum will move from its current home at 300 S. Santa Fe Avenue to an adjacent building, while construction on the new museum will begin in 2021.There has been some confusion about whether the upcoming event will be a reopening of the museum, or a reinterpretation of the museum. The organizers said that the new museum will be built to the same specifications as the museum it will replace.“The new museum will offer a virtual experience of Chicago that is as close to the museum as possible, with the same extraordinary collections, programs, events, and exhibitions, with the same incredible exhibitions and performances, and will be designed to be as close to the museum as possible,” said architect and founder of Renzo Piano Partners Mark Giorno.The museum will inaugurate with a tour of the museum, which will be reconfigured to incorporate a central lobby, an exhibition space, and a research library. The redesign also includes a new glass-enclosed garden that will extend the length of the building and will include a new public gathering space. The entire building will be reconfigured to host a new permanent collection of contemporary art that will", "The next Biennial should take place at the intersection of Lakes and Brandy Streets in Manhattan between November 5 and November 7, 2020.Hoffman Diller, who has spearheaded the project since 1998, said: “Our vision is to develop a new public space that will serve as a bridge between the worlds of art and the heart. Our building, which will be completed in the coming months, will be a living laboratory for future projects\u0097to create a new museum in the shape of a living organism. We have a long way to go, but we have a great idea and we are working hard to make it happen.”\n\n\nThe Museum of Arts and Design (MAD) in New York has opened its first LGBT-centric museum in Europe. Titled the Museum of Contemporary Art, the institution will be housed in a former factory on East Twenty-Third Street in Manhattan. The museum, which will feature works by thirty-nine artists, will be housed in a former clothing factory in a former Jewish deli. The museum’s inaugural exhibition, “Into the Past: Art in the Age of Resistance” (2019) will show pieces by artists such as Marc-Antoine Isa and Yinka Shonibare", "The next Biennial should take place at the Museum of Modern Art (MoMA) in New York in 2021. The questions that will guide the exhibition are: “How do we care for the past, and for the future, and for what might be, if we do not begin to think of nature as integral to the very fabric of the world,” Artforum editor-in-chief Elin Møller-Jørgensen wrote in a September 2017 Artforum. —Artforum is a division of the Santa Monica Museum of Art.\n\n\nThe European Court of Art in Luxembourg has ruled that the Austrian state can continue to ban the exhibition “The Politics of Destruction: The Final Solution to the Holocaust” (Thurs.–Mon., April 3, 2020) at the National Museum of the History of Modern Art (MoMA) in Vienna, which has been closed since October 2014 because of the coronavirus pandemic. The case involving the National Museum of Modern Art and the National People’s Congress of the German Democratic Republic (DG) is currently before the Court of Appeal in Luxembourg.The National Museum of Modern Art, which was founded in 1936 by the Austrian-Hungarian socialist Frank Köhler,", "The next Biennial should be hosted in the Dusseldorf city of Aachen, Germany, in November 2022. In April, Artforum contributor Sarah Scheffer was awarded a lifetime achievement award at the Venice Biennale.\n\n\nThe Chicago-based artist and activist Conal Watson has been named the winner of this year’s Artist-in-Residence award, which was established in 2011 by the Robert Mapplethorpe Foundation in recognition of his collaborative and visionary work in creating the Robert Mapplethorpe Foundation Workshop. Watson’s work, which is housed in the permanent collection of the Mapplethorpe Foundation, is comprised of projects that address issues of race, gender, and climate justice. Watson’s work has been exhibited at the Mapplethorpe Foundation’s pavilion at Solange Pindell’s MCA Show, the Mapplethorpe Foundation’s Artist-In-Residence exhibition at the Museum of Modern Art, and the Mapplethorpe Foundation’s inaugural residency at the Museum of Contemporary Art Chicago.“The Mapplethorpe Foundation Workshop is an important step in Watson’s ongoing commitment to challenge the", "The next Biennial should be the next tour de force, pointed out Adriana, who is conducting the 2017 tour and will be the first to announce its winner. The contest, which has been hosted by the New Museum for the past fourteen years, is one of the longest-running in the city and has also been won by the Los Angeles County Museum of Art, the Museum of Modern Art, the Peabody Essex Museum, the Peabody Essex Memorial Museum, and the Peabody Opera House. In 2014, the contest was selected for its use of the medium of photography, where a panel of judges selected fifty entries. In the first round of judging, the museum selected thirty-eight artists and fifty-two categories such as poetry, play, fashion, food, and music. The jury also considered the visual arts, visual culture, and film. The Art Newspaper winners\n\nArchitecture & Design, a New York–based nonprofit, was awarded $30.5 million in a settlement announced by the state of New York on Friday. The organization, which was founded in 1989 by architects Adrian and Irena Bianchi, in a former auto assembly plant in the Hudson Valley in search of a new way to make architectural products, received $", "The next Biennial should be held at a location that has an existing, established, and thriving community and will have a dedicated, dedicated, and energetic curator to oversee the project.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Marilyn Hotchkiss as its next director. Hotchkiss will be responsible for supporting the museum’s curatorial and collection-based programs, including its residency program, the museum’s existing public art program, and its upcoming thirty-fifth-anniversary celebration.“Marilyn brings a wealth of experience and knowledge to the museum, and we are excited that she will be an invaluable leader for the center’s art and culture program,” said museum director Alexander Luedecke. “The curatorial and collection-based programs of MoCA offer thousands of artists, curators, collectors, and institutions an opportunity to explore new ideas and approaches to exhibitions and programming, and to create new works that strengthen and deepen the museum’s collection. We are confident that this new leadership will help MoCA and the arts in a meaningful way, shaping the future direction of the institution as we move through the next twenty-first century.”Hotchkiss", "The next Biennial should be held in 2021. \n\n\n\n\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the reopening of the Museum of the City of New York (MoCA) in 2021. Under the direction of director Bernadette Schwartzman, the organization laid out the seven-year agenda for the institution, which is currently closed since the Covid-19 pandemic.“The ultimate goal of MoCA’s Department of Cultural Affairs is to be able to reopen as soon as possible,” Schwartzman said in a statement. “We have listened to the community and are making steady progress in establishing this year’s vision for MoCA. We are committed to working collaboratively with our partners to deliver a successful reopening of MoCA and have already begun reviewing and revising our 2020 plans.”According to the DCLA, MoCA has completed construction work and is in the process of developing the 2020 Design Review Plan. This will outline the institution’s reimagined design for the museum, which will be led by the artist-led group Project56. The plan is expected to be completed by September 2021 and will be finalized in late December.The museum", "The next Biennial should take place in 2020, but dates are still under consideration. The first, titled the festival of life, was held in New Delhi in September 2016.\n\n\nThe Levitt Pavilion at the Fifty-three Venice Biennale has announced that it will no longer participate in the biennial in 2020. “We are enormously grateful to the organizers and the many other cultural institutions who have endorsed our decision to stop supporting the exhibition,” the pavilion said in a statement. “We hope that this decision will enable us to fully appreciate the many great achievements of this exhibition, and that the new one will not suffer from the same mistakes and missteps that have been made in the exhibition’s past.” The pavilion’s initial invitation to participate in the biennial was rescinded in February of this year, and the institution said it was not given the opportunity to reprise the invitation in 2019. The pavilion was not the only Venice institution to come under scrutiny for facilitating the growth of the notorious “Junkie Kid” exhibition in 2007. The art district was also the site of the 2014 high-profile, multi-million-dollar libel case against Roberto Orte", "The next Biennial should be held in the Twelfth arrondissement in Paris, and the first exhibition should take place at a museum dedicated to the history of art in Madrid. \n\n\nThe Besso Art Museum in Venice has received a gift of over 400 works by the Italian painter Giacomo Becchetti, a man who has served as a model for the work of many artists who followed. The work, which is housed in the institution’s collection, was gifted to the museum by a group of collectors from a donor who is a friend of the museum’s director, Gennaro Cipolletta. The donor, an artist known for his generosity and for his philanthropic endeavors, gave the museum an anonymous benefactor who is a trustee of the museum. The donor also added a larger set of Becchetti’s works, which are currently on display in the exhibition “Giacomo Becchetti: The Life and Death of a Contagious,” organized by Andrea Dallori, in 2016.“We are thrilled to add these works to the collection, where they will remain in permanent display until the museum’s opening in 2021, when the seventy-ninth edition", "The next Biennial should launch at the same venue in January 2021. The donation, made by the British artist and director John Paul Jones, was made in honor of a lifetime achievement award he received in 2015. The ceremony, which was attended by Jacob, Tate’s director, and director-general, Hisham Mokeen, and the Royal Shakespeare Company, was organized by the British Foundation, the Royal Shakespeare Company, and the British Film Institute.“The partnership between Tate and the Royal Shakespeare Company is a long-standing tradition, dating back to the prince of Wales’s birthday party at Tate Modern in London in 1977, when the institution commissioned the Shakespeare Company to produce a new production of Julius Caesar,” said Tate director Hamish Anderson. “The partnership between Tate and the Royal Shakespeare Company is an important way in which Shakespeare is championed and presented to the world. The new partnership will help us to celebrate several important milestones in our history, notably the centenary of Shakespeare’s birth and the centenary of the Royal Shakespeare Company’s founding.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed James Egeland, who has taught at the institution since 2016, as its", "The next Biennial should take place in 2021 and will be hosted by the Museum of Contemporary Art, Los Angeles. The duration of the exhibition depends on whether it can secure funding from the state of California, the Mayor’s Council for Architectural Preservation, and the California Community Foundation. The event will also be curated by Kate Crawford, curator of modern and contemporary art at the Museum of Contemporary Art, Los Angeles, and Drew Engles, former director of the Museum of Contemporary Art, Chicago.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has acquired the multimillion-dollar rights to the Japanese anime manga series 'Akira and Saya,” and other works by the famed duo, which were created in the 1960s and 1970s and depict an imaginary world inhabited by the titular pair. The Japanese publisher, Aniplex, acquired the rights to the works in an agreement that was negotiated in 2013 and announced in March. It is the first time the works have been publicly acquired by a Japanese publisher. The agreement has been in the works for more than five years and is not a legal binding one.Museum director Matthew Teitelbaum said: “The Met has been working with Aniplex for many years to", "The next Biennial should take place in 2021. The Art Newspaper reports that the next edition will be held at the Museum of Modern Art from February 3 to February 14, 2021.\n\n\nThe US House Committee on Science, Space, and Technology has voted to lift the ban on funding the “obscene” British science writer and educator A. J. Alder, who died in 2011, by a vote of 229 to 192. The legislation, which was introduced by New York state representative G. K. Butterfield (D-New York) and is sponsored by several other members, such as Marsha Blackburn (R-Tennessee), Carolyn Maloney (D-New York), Zoe Lofgren (D-New York), Jared Polis (D-Colorado), and René Polis (D-New York), allows for the long-term support of the museum’s collection through at least 2024.The legislation was originally introduced in 2016 after a party at the Museum of Modern Art in New York in which Alder and the other members of the American Dyke Museum were guests took offense to a discussion of climate change with climate scientists. In an online petition organized by the museum, they denounced climate scientists and argued that", "The next Biennial should be inaugurated by a presentation of the work of a new group of artists consisting of Ana Mendieta and Marta Trevisan. The exhibition will focus on the impact of the Covid-19 pandemic on the lives and work of the two artists.The next exhibition will focus on the power of art through conflict and violence. The inaugural exhibition was inspired by the current tragedy in Syria, the Syrian conflict, and the conflict between Syria and Iran. The biennial will take the form of an assemblage show, featuring works by the artists involved. The biennial will run from November 7 to November 10, 2020 at the Saint Petersburg Biennale.\n\n\nAfter more than three years of making art, César Morales, a Mexican-born French American artist, died last week at his home in New Orleans. He was ninety-three years old.Born in New York City in 1941, Morales was raised in Los Angeles and New Mexico, where he studied at the University of California, Berkeley, and the University of Texas at Austin. After graduating from the University of Texas, he studied at the St. Louis Academy of Art, the University of Texas at Arlington, and the Art Institute of Chicago, where he met his", "The next Biennial should mark the occasion of the centenary of the establishment of the Medical Research Council in London, which was formed by the Royal Free Hospital in partnership with the Royal College of Physicians to collect and store the biennial’s biennial collection, biennial collection records, biennial exhibition catalogue, and biennial catalogue. The next event will be a presentation of 1,500 works from the collection.During its inaugural exhibition,  on April 27, 2017, the Biennial was given a new concept under the direction of Sue Lewis-Reeder. The exhibition was moved from the museum to the city of London, where it will remain for the foreseeable future. In a statement regarding the exhibition, the Biennial said: “The new exhibition is an extension of the renown of the Biennial and the ability to advance the work of our great collection, which spans four centuries and represents a new chapter in the history of art and science.”Established in 1902, the Joslyn Biennial was inaugurated by artist Johan Mattsson; architect Alfred Nisbet, who worked on the building of the Biennial; and Nils Stærk, a Danish architect and founder of the firm Lisson Constructions", "The next Biennial should be held in the spring of 2020. \n\n\nChinese artist Xianliang Yuan, a pioneer of the contemporary Chinese art movement, has died at the age of ninety-one.Born in Shanghai in 1931, Yuan moved to Beijing as a child and later studied under the legendary Wang Wei, who became the heart of the contemporary art scene in China and the US, including California, where he lived for the rest of his life. However, during the Cultural Revolution, the artist was imprisoned for a year and a half in a labor camp in Beijing, and in the early 1940s, he had to leave the country. His artistic practice begins in the 1950s with his work for the Chinese television series The Public Theater, making it one of the earliest works of modern Chinese art. Yuan returned to the US in the 1970s and settled in Los Angeles, where he began experimenting with new materials and with different materials, such as rubber, aluminum, and wood, to create works that speak to his upbringing. In 1987, following a break from his practice, he made his first film, The Surreal Life of Zhang Daqian (1966), a documentary about his art that won a Grand Prix at the Venice Film Festival in 1967", "The next Biennial should take place in São Paulo in the fall of 2020 and will be hosted by the Museu de Arte de São Paulo (MASP), the Museu de Arte de São Paulo (MASP), and the Museu de Arte de São Paulo, among other museums.“In this new situation, we are profoundly indebted to the victims of the destruction, the state, the federal, and the international terrorist groupings,” Paulo Folino, chair of the Kingless Council of the Institutions of Art and Architecture of the Kingdom of Brazil, said in a statement. “It is with the greatest gratitude that we express our profound appreciation to these four institutions for taking the risks and facing the challenges that we have, and for demonstrating a willingness to confront our past, and to shape the future, through a real and open dialogue.”The commission of the fifty-fourth edition of the Biennial will take place in the Museu de Arte de São Paulo (MASP), the Museu de Arte de S Paulo (MASP), and the Museu de Arte de São Paulo (MASP) in São Paulo, Brazil, in the fall of 2022. The exhibition", "The next Biennial should be held in the city in the autumn of 2021. The deadline to apply for the slots is November 22.The 2019 prize jury: Catherine O. Henry, Jennifer D. Evans, and Jody Rogachevski. The 2019 winner of the MFA Prize in Performance Art, Justin Hurwitz, will receive $500. The 2019 winner of the MFA Prize in Visual Art, Bruce Gilden, will receive $500. The 2019 recipient of the MFA Prize in Performance Art, Jeremy Horowitz, will receive $500. The 2019 recipient of the MFA Prize in Design, Mary Hall, will receive $500. The 2019 winner of the MFA Prize in Design, Callum Grant, will receive $500.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than 1,500 photographs by American photographer Frank Stella, who went on to become the first African American photographer to win the Pulitzer Prize in 1967. The gift, which was made by late LACMA trustee Dennis and Carolyn Stella, comes a year after the museum paid tribute to the photographer, who passed away on March 24 from cancer.“We are", "The next Biennial should be held in the city next year, with a new theme, a new show, and a new exhibition.The institution will also unveil a new curated program of works in the coming months.  In the meantime, local and international artists, musicians, writers, and other arts professionals are participating in a variety of exhibitions, performances, and other events to raise awareness and funds for the affected areas.  The artist-run organization Prospect UK, which has seen its annual arts fund dwindle to £6 million in the wake of the pandemic, announced on Thursday that it is increasing the amount it supports by an additional £1 million. The increase comes as the UK faces one of the worst recessions in its history and is being closely watched by the European Commission, which recently published a controversial two-year budget proposal which would see millions of social housing tenants lost their homes.Under the proposed budget, the government will invest an additional £1 billion into the arts over a three-year period, bringing the total investment to £6.8 billion—a massive boost to the UK’s economy. The money will be aimed at a number of areas, including arts and culture, education and skills, and transport and utilities.", "The next Biennial should be an opportunity for researchers, artists, and institutions to collaborate, to exchange ideas, to exchange experiences, and to engage in dialogue with the work of and through the exhibition. We hope that this first edition will be a success. \n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that British artist Shizuo Yamashiro has been selected as the winner of the 2019 Tate British Artist Award. The award, which was established in 1998 to support artists in the United Kingdom whose work is based in London, was established to reward the most outstanding British contemporary artists. One hundred and eleven artists were nominated for the award, which first went to Kit Sanders in 2005.The jury that selected the winners was chaired by Dave Chisnall, director of Tate Britain; Jonathan Culshaw, director of Tate Modern; and the South Asian curators Mohammad Shafiq and Mariya, and the curators K.J. Patel and Sharon Stewart-Kahn. The jury returned its nominations and recommendations by March 25 and the artists were chosen at a special awards ceremony at the Institute of Contemporary Arts (ICA) in London.\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles has declared that it will not renew any", "The next Biennial should begin with a series of lectures, workshops, and performances that will examine the various approaches taken to protecting and restoring the artists’ legacy. The theme, “Art and the New Paris,” will be a collaboration between artist and designer Theo Sarkis and Mihai Nistor, who will work in collaboration with Agostino Cipolletta.The exhibition will take place at the Musée d’Art et d’Histoire in Paris and will run until March 22.The exhibition will also feature a “Contemporary Art of the Abode of Buddha” and a compilation of works by twenty-four contemporary artists, many of whom were based in China and Japan. The catalogue is curated by Hannah Moores, the curator of Contemporary Art of the East, and the artist-in-residence, Patricia Liu.Commenting on the exhibition, Moores said: “Theatre is not a static environment. It is a dynamic, growing environment that responds to the changing needs of the performers within it. The show will give visitors a new perspective on the roles and laborations of artists and designers in the late twentieth century.”\n\n\nThe", "The next Biennial should be held in 2021, with the theme 'The Future of Man: Environmental Ethics in the Present'. The exhibition will also feature works from the artist’s previous show 'The Future of Art: A Case Study of Guy and Paul Gauguin’s The Color and the Shape of Things, 1932–33’s ‘The Future of Modern Art’ and ‘Nickels-Rand,’ which will open at the Art Institute of Chicago in 2021.\n\nThe Pulitzer Prize–winning artist Diane Arbus has been named the recipient of the $50,000 Cinéma prize for literature. Arbus will receive $50,000 in recognition of her lifetime achievement in her exploration of the modern American novel. The prize was established by the Cinéma Foundation in honor of Arbus’s lifetime achievement in art. Arbus first won the award for literature in 1984. She has since been nominated for the Pulitzer for Fiction twice and for the Pulitzer for Art once. Formerly the prize for poetry, Arbus first won the Cinéma prize for poetry in 1986. She is also the founder of the the nonprofit Diane Arbus for the Arts. The ceremony will take", "The next Biennial should take place in 2020.<|endoftext|>While the Ukrainian army, bolstered by tanks and artillery, seized control of major cities in the country on Thursday, President Petro Poroshenko declared victory and said that the government would grant amnesty to thousands of pro-Russian protesters who were arrested or detained during mass demonstrations against his reforms agenda. In an attempt to placate protesters, the president also announced that he would suspend the annual memorial service for victims of the conflict with Russia, but only for a year.The events of the past two weeks have given pause to many in Ukraine, who fear that the country will spiral into another civil war. According to the New York Times, more than 5,400 people have died since the conflict began in 2014, and millions have been displaced. As the violence in eastern Ukraine escalated, Ukraine called for international monitors to be deployed to the conflict-torn country. The European Union responded by suspending the commemoration and imposing fines of up to $15 billion on major European companies that help prop up the conflict-torn country’s economy, which is heavily dependent on fossil fuels.On Friday, March 15, European Union foreign policy chief Federica Mogherini declared that the suspension of the commemorations and the suspension of fines would be", "The next Biennial should take place in the spring of 2021, at the Museum of Contemporary Art (MoCA), and will be comprised of ninety-one works in the exhibition. The project will be supported with a $25,000 gift from the Shih-Chun family, whose philanthropy includes the construction of the Museum of Contemporary Art Shanghai and the addition of twenty-five works by American and international artists. The Biennial will be held at the Museum of Modern Art in New York, the Museum of Modern Art Shanghai, and the Museum of Modern Art, Los Angeles. The Ninety-eighth Venice Biennale will also feature sculptures by Armenian artist Nesiran İstikhan, who is best known for his monumental and stunningly lifelike Eroica sculptures, which are based on the themes of love and war. The exhibition will be held at the Museo de Arte Contemporáneo, in Venice, and will take place at the Museum of Modern Art, Los Angeles. The Venice Architecture Biennial will be held at the Museo de Arte Contemporáneo, in Venice, and will be held every five years. The Venice Art Museum will be held at the", "The next Biennial should be held at the Museum of Contemporary Art in Atlanta in 2020. The exhibition will feature thirty works by forty-three artists.\n\n\nThe Center for Contemporary Art (CACMA) in New York has opened its first permanent art museum in the United States, the Ann and Michael Farley Plaza, in the city’s Little Italy neighborhood. The $3.5 million venue, located at 890 East Twenty-Fourth Street, is managed by the David B. Jordan Foundation for Contemporary Arts and will host exhibitions and events in conjunction with the center’s inaugural exhibition “Heavy Breathing: Art and Artifacts in the City.”“The new museum—which will hold some 300,000 objects and will boast a public green roof, a playhouse, a sculpture garden, and an auditorium—is envisioned as a continuation of the current CACMA, which opened in 1986 in the basement of the former New York Public Library. The new space will be named after the two partners, and will be housed in the same building as the library. We are excited to be working with the Jordan Foundation to create a new custodian of these objects, and to celebrate the partnership’s forty-fifth anniversary together", "The next Biennial should be held at the Museum of Modern Art in 2021.\n\n\nThe Royal Academy of Arts (RA) in London has appointed director R.J. Watling as its next chair. He succeeds Simon Callender, who was hired as director of the Kensington Museum of Art in the United Kingdom in September 2019, and will take up the position in July.“I’m extremely excited to be tasked to lead the Royal Academy of Arts into the future and am looking forward to working with you,” Watling said. “I’m looking forward to continuing my work with the RA and exploring new artistic and social trends, creating new opportunities for young artists and local communities.”The academy’s first president, Ravi Shankar, prided himself for developing new ways for young artists to get involved with the institution and has worked to increase the reach of the academy since his retirement in 2017. He expanded its programming through a series of annual masterclasses, expanded its curatorial program, and organized major exhibitions. In addition, he created an online platform, RAI, that allows students to collaborate and exchange works and ideas.The announcement of the new chairman comes on the heels of the retirement of the", "The next Biennial should be held in 2021.\n\nInstitutions that have participated in the past two editions of the Berlin Biennial are Boston University, the Berlin Art Museum, and the Nationalgalerie di Mendrisi. The Nationalgalerie di Mendrisi will reopen as the Nationalgalerie della Scala in 2021, and the Nationalstalt Weltbau Museum in Kassel will host a new edition of the Berlin Biennial in 2022. The Massachusetts Institute of Technology (MIT) and the Museum of Modern Art in New York will stage their first biennial in 2021, and the Museum of Contemporary Art (MoCA) in Chicago will host a second edition in 2022.\n\n\nThe University Museum of Texas at Arlington (UMA) in Arlington, Texas, has appointed Karen B. Clark as its new executive director. Clark will take up the post on January 7, 2021.“Karen is a seasoned leader, respected throughout the state as one of the top minds in the field,” said university president Ray Anya. “Her leadership style, talent, and track record in working with communities and individuals will be a great asset to our growing collection and to making the museum a destination for people from", "The next Biennial should be held in the middle of the year, and the event’s director, Eric J. Garcia, said that the project will not be over after the 2019 edition. Over the next three years, the venue will feature all twenty-five of the biennial’s works and will invite the public to revisit the work in the spring of 2020.The 2018 edition, titled “The Evolution of Painting in the Eighteenth Century” was organized by the Biennale di Santa Croce, in collaboration with the Museo de Arte Contemporanea Siena. The theme of the exhibition was the evolution of painting from a set of tools based on wood and canvas to a more encompassing art form. The exhibition included work by a number of artists who have had great impact on the development of modernism, including Paolo Toscani, Monirûn Yilmaz, and Vito Acconci. The exhibition, which was curated by Francesca Sotero, director of the Museo de Arte Contemporanea Siena (MAS), Italy, and was curated by Mark Goldberg, the curator of modern art at the Metropolitan Museum of Art in New York.“", "The next Biennial should take place in August 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it will reopen in the fall following a $500 million expansion. The museum is currently undergoing a $1.6 billion overhaul, which included the construction of a new sixteen-thousand-square-foot building that will boast a new public art gallery, a new museum for contemporary art, and a new performance space. The renovation also added more than 1,500 square feet of gallery space for special exhibitions and the museum’s signature show, “The Dream House.”Completed in 1990, the museum was commissioned by former director Peter W. Larson, and designed by Samuel P. Morgan, the architect who designed the Museum of Modern Art in New York. The project was funded by the Rothschild Family Fund, which also invested in the renovation of the Edward Carpenter-designed World Trade Center in 2013.The new space will be inaugurated by a “Dream House” exhibition, which will feature paintings by artists such as Willem de Kooning, Ed Ruscha, and Paul Gauguin. The event will run concurrently with the upcoming retrospective of the same artists, “The Autobiography of An", "The next Biennial should take place in 2020. “At a time when we are witnessing unprecedented transformations in our cultural and biological environments, the tension between art and culture and the breadth and depth of the digital realm,” said Linda Weber, director of the Smithsonian American Art Museum. “We are excited to continue to work with our artists to strengthen the power of their stories through new media through an immersive, creative, and knowledge-based experience.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has announced that Sarah Sze, who has served as interim curator of the museum since June 2020, has been appointed chief curator of the institution’s new venue, the Museum of Contemporary Art (LACMA), which is opening to the public in 2021. Sze, who has curated the museum since 2012, will assume her responsibilities on February 10, 2021.“Sarah Sze is one of the most widely-recognized and beloved leaders of contemporary art and is dedicated to pushing the boundaries of contemporary art and bringing it to life,” said LACMA director Jose Arteaga. “She has an extraordinary track record of bringing innovative, contemporary and experimental art into LACMA, and we are", "The next Biennial should be held at the Rio de Janeiro Art Museum in August 2020. The museum had originally committed $25 million to staging the exhibition, but the project was stalled due to the coronavirus pandemic. The institution decided to cancel the exhibition in August, but only after the museum reassembled the exhibition in order to remove any evidence of its exhibition.The exhibition will return to the museum in 2020, and the construction of the exhibition will begin in 2021.\n\n\nThe Windjammer Foundation (Windjammer) has announced that it is launching three new initiatives to support local artists and small to mid-size visual artists in New York City: the Solomon R. Guggenheim Museum/Collection for Artists’ Experiments (S.G.A.I.), the Solomon R. Guggenheim Museum and Museum of Art’s Art of the Party, and the Solomon R. Guggenheim Foundation’s Arts & Culture Grant. In the wake of the coronavirus, which broke out in Wuhan in March, China announced that it was cutting back on production, cutting back on its annual grant. “We knew the S.G.A.I.", "The next Biennial should be called \"Shroud of Filament: Materialism and the American Imagination”\u0097the Joint Biennial with the Japan Foundation is currently on hiatus\u0097and should include works by a selection of artists selected by awardees, including artist and activist Monica D. Mitchell and photographer Zenobia Corea.According to the event’s inaugural list of artists, which is organized by awardee Nina Hingsley and David Littman, the 2019 edition will include work by forty-three artists, including Slavs of the Stone Age, Warhol and the late Indian artist Comrade Shanti Das; and the first works that will be exhibited in the new exhibition venue will be twenty-six pieces in the exhibition “Mirrors in the Sky,” a collaboration between psychologist Erik Eriksson and the Berlin-based artist Anna-Sophie Brätsch.Last year’s inaugural show, “Metamorphoses: Stories of a Ghost,” was held at the Museum of Modern Art in New York, and featured work by forty-five artists, including the early British and Irish painters John Singer, Rayyane Mimamal, and James Nesv", "The next Biennial should take place in October 2019. Šinés Niš, director of the Center for Contemporary Art, Prague, has stated that the event will “undertake a critical and systematic departure from the current museums’ traditions, which have been defined by the accumulation of the collection of recent years.”ÜThe next Biennial will be the last,” he told the Art Newspaper. “It will be a real challenge for us, as architects and curators, to adapt to the current digital world, but we believe that within the spirit of the American tradition, a great talent and a great community will help us create a new future.” \n\n\nThe Pérez Art Museum Miami (PAMM) has appointed Martha Rosales as its next executive director. The appointment was made official on Thursday, November 5, after PAMM’s board of trustees voted unanimously to extend her contract through 2021. Rosales will join the institution as executive director in February 2020.“Martha is a remarkable leader of an institution that has been a model for sustainable practices and a leader in the conservation and conservation of contemporary art,” said board chair Don Hernando. “Her achievements", "The next Biennial should be in the spring of 2021 and will launch with a panel discussion on the exhibition and special projects of the previous year.The biennial will be held at the Museums, College of Music, Arts and Design, and Energy Museum, as well as at London’s Centre Pompidou, London; the Galerie Lelong, Paris; and the Fondazione Giangiacomo, Rome.The Montreal triennial will be held in June 2021. The exhibition will include works by contemporary artists, including Kerstin Brätsch, Paul Gauguin, and Nils Østby; documentaries about art; and a selection of works by the remaining ten members of the Beaucoup Triennial. The biennial will also feature a new Memorial Biennial for Warhol and will open a new, permanent exhibition, “On Warhol’s Body,” at the Centre Pompidou on October 16.The art of Finland is also being recreated. A new exhibition of work by a select group of contemporary artists will open at the National Museum of Fine Arts, Helsinki in the summer of 2021. The exhibition will be organized as follows: “Thrill of the Hunt:", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Chicago, will unveil its redesigned space, known as the Walker Art Center, in an urban setting in the city’s historic historic Masonic Temple on Friday, August 13. The redesign, which was inspired by the museum’s last renovation, was made in partnership with the family of architect Frank Gehry and the Metropolitan Museum of Art, as well as the Chicago-based firm Gensler.“In the last eight years, we’ve made tremendous progress in transforming our urban core, opening exciting new venues, and expanding our program in powerful new ways,” said Marc Spiegler, the museum’s senior director of curatorial affairs. “We’ve even created new work by promising artists, including Amara Bou-hem, Mira* and Jumaja Bhabha, and we are excited to see how these works will affect the current programming.”The museum’s collection will undergo a major renovation, which will be integrated into the urban fabric of the downtown area and will include the installation of new programs, an expanded interactive gallery, and a reopening of the museum’s outdoor", "The next Biennial should be held in 2022. \n\nThe next Biennial should be held in 2022. \n\nThe next Biennial should be held in 2022.\n\nThe next Biennial should be held in 2022. \n\n\nAfter a lengthy and contentious legal battle, the Mexican government waived a compulsory purchase ban on new statues dedicated to controversial historical figures in the capital of Mexico City on Thursday, January 13. The move means that the work\u0097the controversial work by artist Iñigo Paz, titled La Raza Feminista (The Rise of Women), which was scheduled to open this month, will now enter its second month of its inaugural exhibition. The announcement came a day after the government declared the Louvre and the Pantheon a UNESCO World Heritage site.While the government initially pressured the two institutions to remove the work from view in March 2019, the institution refused to remove the work from view and instead moved it to its storage area, where it is currently stored. The government claimed the move violated the country’s national heritage law, but the institutions filed a lawsuit against the government for violating the law.The government dropped its lawsuit after the government considered the case of a man who was severely burned in a fire that broke out in", "The next Biennial should be held in 2021 and the last in 2022. The 2017 Biennials were held in Dusseldorf and Zurich, respectively. This year’s edition is being hosted by the Shaw Center for Contemporary Art, London; the SkaktiXCenter for Contemporary Art, Cambridge, UK; and the Driehaus, Berlin. For the 2018 edition, the show was co-organized by the Shaftesbury Archaeology Trust and the Skulpture Garden Museum.\n\n\nThe Taylors and Woodys of Venice have been named the winners of the $10,000 Piazza Artico Award, which was established by the Piazza Foundation to support projects that address the challenges and opportunities of being an artist in Venice. The Piazza Foundation is a nonprofit organization that supports the arts in Venice through its Piazza Foundation, which is owned and managed by the family of Adolpho Graziani, and Pirelli Castello, and whose grounds are located on the north shore of Venice. The foundation’s director, Francesco Cipolletta, said: “I’m thrilled by the outcome of the Piazza Artico Award. The history of art", "The next Biennial should focus on “communities of color” and will organize a “world view.” The biennial will celebrate the work of artists of color and will hope to show a glimpse of an “open future.”It will also include a discussion of how artists and activists are working to address the racism that permeates American life, and whether artists who are critical of the current political climate, such as Willem de Kooning, are still being ignored. “We are all here, watching, listening, and speaking,” said Jen Morrill, the director of the Baltimore Museum of Art. “And we will be in touch, as we always have been, to listen and to think.”\n\n\nThe Institute of Contemporary Arts (ICA) in New York has hired Paolo Tavares as its new chief curator of modern and contemporary art. Tavares will work with museum director Indira Naidoo and chief curator Peter Chiu to create a new role and an exhibition at the institution that will showcase the work of understudied, underrecognized, and under-recognized artists. “In an age of increasing polarization and widening gaps between communities, the overlapping interests of artists", "The next Biennial should be announced by the end of June. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of 3,500 works by the Georgian sculptor Andrée Chedid. The gift, which is valued at between $30,000 and $50,000, is one of the largest individual donations made by the museum in its history. The artist was born in the city of Kist, Georgia, in 1924 and moved to Boston in the 1950s. The gift includes works by more than eighty artists from the collection of the Beaux-Arts, the Jane Addams Collection, the William Henry Fox Talbot Collection, the John Edward Mitchell Collection, and the James Caughman Collection.“With a gift of the artist’s body and his work, Andrée Chedid provides a historical and stylistic backdrop for the African American experience in America,” said Mark Crouch, director of the MFA. The new collection will be inaugurated with a presentation of two new works by the artist at a ceremony on Tuesday, March 18. \n\n\nThe London-based arts organization Open World Art (OWA), which has supported David Adjay and his organization,", "The next Biennial should take place in 2021 and will be hosted at the Musée d’Art Moderne in central Paris. It will take place in conjunction with the twenty-fifth edition of the Paris Triennial, which will culminate in a special exhibition of works by new and established artists. The 2020 edition of the biennial will be held at the Musée Montmartre, in the city of Montpellier.The inaugural edition of the French pavilion for the Venice Biennale was held in the gardens of the Louvre in December 2019. In the future years, the pavilion will be organized in collaboration with the Centre Pompidou and the Musée d’Art Moderne.\n\n\nThe Museum of Fine Arts (MFA) in Boston has been hit hard by the Covid-19 pandemic. The Massachusetts institution had reported a loss of $9 million in revenue during the first two weeks of September, and on Friday, September 7, it reported that it is still recovering from the financial impact of the ongoing crisis. The $21 million in additional costs it incurred because of the coronavirus outbreak have been passed on to the state of Massachusetts.As the number of cases of the virus increases, so does the financial", "The next Biennial should be in May 2020, and the September 2020 event will still be hosted by the same architect and will be depicted in the same way as the previous exhibition. It will only be two hundred square feet in size. \n\nThe New York Public Library (NYPL) has released the first edition of the Award for Excellence in the Arts, an annual award that honors work in the arts that have received a Pulitzer Prize, a Richard and Helen Annenberg Foundation grant, or were selected by a jury. The work, titled “Theatre of Motion: Creation and Creation in Music” and curated by Laura Guggenheim from the award pool of $3.5 million, was awarded to David Eddings’ dance Ripple, and Aaron Siskind’s The Seagull, both 2019. The jury that selected the five finalists included Leon Black, Terence Blanchard, and Thomas Chiu, who was chairman of the award jury. The prizes are: the Richard and Helen Annenberg Foundation Lifetime Achievement Award for Art, the Gordon Guggenheim Foundation Lifetime Achievement Award for Art, the 2007 Gordon Guggenheim Foundation Lifetime Achievement", "The next Biennial should be a celebration of the female feather in the labrador retriever, the short-haired, ponytailed, Puerto Rican-born artist and activist Malala Yousuf, who was shot by the Taliban in 2012. The organizers of the Dutch pavilion, which opened in 2019, have yet to announce a date for the festival, which will take place in 2021.  Advertisement\n\n\nThe Museum of Modern Art (MoMA) in New York has provided the New York City Department of Cultural Affairs (DCLA) with thousands of photographs by Detroit-based artist Glennda Mayhew. The Doris Duke Foundation for American Art, which commissioned the works, donated the funds for the project.“The DCLA was impressed by the quality of the work and the authenticity of the results,” said Glenn Dorsey, the foundation’s artistic director and a former curator. “The collection reflects the core spirit of art and is a reflection of the city of Detroit. . . . We look forward to working with the artist and the Duke Foundation to create a new kind of museum for our city.”The artist’s work, which was acquired by the foundation through a partnership between the institution and the artist�", "The next Biennial should be a three-day event that will examine the contributions of individuals and groups to the history of art and understanding the contemporary global landscape. “The theme of this year’s edition is the Shared Future,” said Mark Stack, the curators of the seventyth Venice Biennale. “The goal of the exhibition is to be a forum for reflection and reflection on the future of art. This is a moment of transition, and it is up to us as curators to preserve it in our own way.” The entries selected for the exhibition include artists such as Ad Reinhardt, Gernot Von Künstler, and Jean-Michel Basquiat, as well as a selection of work by forty-one lesser known and more celebrated artists, including John Deakin, Marcel Duchamp, and Georges Apostuil, as well as a work by Yinka Shonibare.Commenting on the exhibition, Thomas L. Knebel, president of the Biennale, said: “The themes of the exhibition offer the audience a fresh perspective on the history of art in the twenty-first century, and that the art of the twenty-second century can be", "The next Biennial should focus on 'The Past and Future of the Body: Art and the Body, 1960–1975,' and should take place on the Columbus Art Museum’s campus.  A second Biennial, “The Body/Future: Art and Body/Future,” will be held in 2020.\n\n\nThe National Gallery of Art in Washington, DC, has doubled the size of its collection of forty-five years of work by artist Arne Glimcher—a monumental undertaking that more than quadrupled the gallery’s holdings. The museum now has more Glimcher works than ever, including work from the artist’s original series, “The Body,” and “The Future of the Body: Art and Body” (both 2019) and the artist’s first solo show in the US, “The Body/Future: Art and Body/Future” (2018).The George and Mary L. Wyman Foundation, which amassed the works over a twenty-year span, also announced that it has granted the Glimcher Foundation $2.5 million in support of its collection, and will now donate them to the National Gallery of Art. The donation includes forty", "The next Biennial should be held in 2021. Become an educational institution. Become a resource for our cities and countries. Become a platform for the arts and culture of Hong Kong and China. Become a tool for social change. Become a creative laboratory. Become a platform for the cultural exchange between Hong Kong and mainland China. Become a central location for the discourse of Hong Kong and China. Beijing Art Museum + Art Archives: The institution has announced that it will reopen in November. The opening of Panorama Palace of the Arts will coincide with China’s National Day celebrations. When: November 12–November 15. Where: Beijing Art Museum, Beijing. Tickets:  ・Advance tickets will be available on a first come, first served basis from March 24–March 31. Closed until March 27. Cities in China: The Beijing Art Museum will reopen on March 8.  Currency exchange, money transfers, and payment services in the region will remain suspended on March 15. \n\nUCLA Art Museum in Los Angeles announced today that it is planning to close down and undergo a $500 million renovation in order to achieve", "The next Biennial should take place in 2021. The forty-sixth will take place in 2023. The biennial’s next edition will be held in Tokyo in the fall of 2020. The Tokyo Art Show will run from March to April in September of 2022. The Tokyo 2020 Games will take place in September of 2022.The 2020 Tokyo Art Show will now be hosted by the Tokyo Metropolitan University Museum in the fall of 2022. The exhibition will be organized as follows:September 12–September 14: Tokyo Art Show. October 23–October 26: Tokyo Art Show: Tokyo 2020. October 28–October 29: Tokyo Art Show: Tokyo 2021. November 5–November 8: Tokyo Art Show: Tokyo 2022. November 11–November 14: Tokyo Art Show: Tokyo 2022. November 15–November 18: Tokyo Art Show: Tokyo 2022. November 19–November 22: Tokyo Art Show: Tokyo 2022. November 24–December 7: Tokyo Art Show: Tokyo 2020. December 5–December 8: Tokyo Art Show: Tokyo 2019. December 10–December 13: Tokyo Art Show: Tokyo 2022", "The next Biennial should focus on the concept of Beauty and the Body and the body in relation to the work of Art and Architecture. The next Biennial should be inspired by the subject of photography and how it was used to explore and express the spirit, the body and the soul of the photographer.  The themes of the upcoming shows include: The Body and the Soul of a Photographer, with a focus on the work of artist-photographers. Self-Portrait and Portraits, with a great interest for the work of artists who had a personal connection with the subject. The exhibition will be inaugurated with a special exhibition of works by the Danish photographer Lars Christian Østbye in the autumn of 2020, and will feature works from the collections of the Museum of Contemporary Art and the Museum of Modern Art. The exhibition will close with the curated exhibition “The Body and the Soul of a Photographer” at the Kunsthalle Bern in March 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to move the final exhibition of its new five-year cycle, “The Body and the Soul of an Economist,” from September to December. The move comes amid a long-term investment in", "The next Biennial should take place in 2020.<|endoftext|>Imbecile de Paris, France: From its inception in 1821, the city of Paris has identified with the original of its name. Following the monument dedicated to Napoleon III, the city moved to distinguish itself from a collection of French works dating back to 1816. The current iteration of the museum, Renfrew Square, was renamed in honor of the late French minister of religion and the poet Georges Bataille\u0097a reference to the original 18th-century site of the Bataclan theater.When the renovation of Château des Grands-Augustins was completed in 2012, the municipality of Paris installed a new statue of the town’s namesake on its central plaza. The work, dedicated to the town and its residents, commemorates the city’s founding fathers, Jean-Baptiste and Pierre Napoleon, who founded Imbecile de Paris in 1821. The work was presented by the artist to the long-suffering state of the region. The campaign for its reopening also included a multiyear fundraising drive.The campaign for a new monument commemorating Paris’s founding fathers is ongoing\u0097a new monument dedicated to the", "The next Biennial should take place in 2020, local organizers said.\n\n\nThe Institute of Contemporary Art (ICA) in Paris announced today that Mira-Mina Abou-Rahme has been selected to represent France at the Fifty-Ninth Venice Biennale, to be held in May 2021. It is the third major international art event that Abou-Rahme will participate in and will be staged at the Museo d’Artes in Paris. The event will be hosted by the city of Paris and will be organized as follows:-- The exhibition will be divided into three sections, each of which will showcase the work of one artist. The first section, “Art of the City,” will feature works by ten artists, each of which will be presented in their native city; the second section, “The People,” will feature works by twenty-five artists, each of whom will be presented in their respective country; and the third section, “Art of the World,” will feature works by seventy-five artists, each of whom will be presented in their respective city. “I am thrilled by this opportunity to present my work at the ICA in Paris,” said Abou", "The next Biennial should be held in June 2021. It is not clear whether the new event will be a joint project between Hong Kong and Paris; the exhibition will be hosted by the museum in partnership with the French Ministry of Culture. Artforum reports that the production team will also be led by Tarek Atouiler, the head of the Tunisian exhibition department; Iman Haddad, the director of the Saudi Arabia-based artist-run space AlEkalla; Nita Haddad, the director of the Bahrain-based artist-run space Al Faisal; and Yasmin al-Shaykh, a curator at the Saudi Arabian Embassy in New York. Commenting on the collaboration with France, Atouiler told Artforum: “We are delighted to partner with Paris and have helped them prepare this year’s exhibition for the first time. We are actively working to introduce new themes, including social responsibility and the role of artists in shaping policies and more clearly highlighting the connections between art and politics. We are working hard to create a practical platform for artists to engage more directly with their cities and more broadly to shape local and national narratives and solutions.”\n\n\nThe Sims has", "The next Biennial should take place in 2023. The exhibit will explore the history of the exhibition and the installation, as well as the creative process behind the works. Artist-in-residence roles will be given out across the city, beginning with the Main Street Art and Design District and ending with the Museum of Contemporary Art. This year’s event will take place in the city’s Time Warner Center from January 26 to March 7. \n\n\nThe Contemporary Art Museum Houston (CAMH), which was forced to evacuate its downtown campus in March due to the Covid-19 pandemic, has unveiled a new two-year fundraising initiative that will help pay for the immediate expenses of affected staff and visitors. The initiative, which launches this month with eight shows, was inspired by the museum’s initial fundraising drive for the Covid-19 pandemic. “In our inaugural edition, we will introduce a new fundraising option that will allow participants to bring their favorite works from the institution back to Houston and enjoy free admission for two weeks,” said David Feldman, CAMPH’s executive director. “This is the best way to avoid overcrowding and save the museum’s valuable space and", "The next Biennial should focus on “Dreamers,” a project that will involve five thousand individuals and fifty-two art institutions to create a narrative out of dreams to foreground the concept of dreams as a universal language, a ‘talking language’ that can ‘speak to us.’”Munich Art Museum, Germany: The museum has been working to open this year and is currently planning to open in March 2019. The museum will initially hold two exhibitions: “Dreams of the Dreamer” and “The Dreams of Salvador Dali.” The exhibitions will reopen sometime in May. Munich Speaks: The museum is planning to open in March 2020 and will present an exhibition of artworks by twelve artists in the spring of 2021. Spain’s Asturias Museum of Modern Art: The institution recently announced that it is planning to open in March 2020 and will present an exhibition of contemporary art in the spring of 2021. Germany’s Haus der Kunst: The museum is currently on track to open in March 2020 and is preparing for the arrival of tourists in 2020. Brazil’s Federal Museum of Art, Belo Horizonte: The museum", "The next Biennial should begin in 2021. “The necessity of innovative and experimentation in architecture and design is one of the themes that animate the exhibition, and the exhibition must respond to the critical current of modern architecture and design,” said curator Daniel Libeskind. The public will be able to enter the exhibition from the lobby of the Museum of Design in New York on January 3, 2021 through February 16, 2021. The exhibition, which will open in April, will be organized as a series of exhibitions. The first show will focus on the architecture of the United States, featuring designs by twenty-three artists. The second will focus on the history of architecture in the United States, featuring designs by fifty-six American architects, including Ed Moses, Walter de Maria, and Thomas Heatherwick. The third will focus on the history of architecture in the United Kingdom, focusing on modern buildings constructed in the 1880s. The fourth will take place in September and October. The fifth, “Sofa: The Modern Age” will open in November. The exhibition will be held at the Museum of Modern Art in New York through September 29. The exhibition will also focus more closely on the Chinese architect Kao Tung", "The next Biennial should take place in the United States at the New Museum in New York, and the next in London at the Royal Shakespeare Company. The first event, entitled   of the , will kick off on September 1 and run through February 19, 2020. The second exhibition will take place in the City of London, and will run through March 23, 2020. The third exhibition is Spring/Fall 2020, curated by Katsumi Matsuda, and will be staged by the London-based artist Susannah Grant. The fourth event is Lunar New Year, curated by Masao Miyazaki, and will be staged by the artist and curator Zaha Hadid. The fifth and final exhibition is BE/Make/Move 2019, curated by Mary Anne Mille and will be staged by the artist and curator Sarah Parrish. The show will also feature works by Yael Averill, Taisa Folkes, Christos Gage, and Alice Pape.The full list of participating artists is as follows:Amer Galay, FranceMarkus Radin, Germany and AustriaDaniel Balsom, Germany and AustriaTimothy Albrecht, Germany and AustriaMichael Black, Netherlands and AustriaLinda", "The next Biennial should take place in the summer of 2021. “When we think about what a future for our planet looks like, we don’t want to miss out on what an Earth looks like,” said Dorothea Rock, the director of the Biennial. “A future for our planet is a future for all of us. It is a future for all of us that has the potential to be beautiful and inspiring.”The themes of this year’s Biennial have been re-appropriated for the twenty-first iteration of the event, which will take place in the same locations as last year’s event and will feature works by sixty artists in thirty-five galleries. The theme this year is “life and the life of other places.” The 2018 event, “Theater of Immortality,” was centered around the concept of afterlife, with the theme “Entropy” meditating on the concept of the observer, the physical, and the immaterial. In its first year, Theatre of Immortality was inspired by the work of Basquiat and his body, and the artworks that were on display included a series of three-dimensional sculptures that address", "The next Biennial should take place in near future, with the goal of presenting a work that will be of great relevance to the current geopolitical situation and meet the needs of the audience.\n\n\nThe Metropolitan Museum of Art (the museum) announced today that it is planning to remove all four of its major works by Andy Warhol’s famous “Paintings on Paper” series from the public view. Having received a $10 million donation from the estate of Warhol’s son Jonathan, the museum has now decided to suspend production until it receives the $40 million it is asking for.Since the exhibition was created in 1972, it is considered one of the ’greatest works of artistic art of all time.” It is also one of the only works in the world that has survived the destruction of the iconic American painting by Warhol at the hands of the authorities. According to the New York Times, the museum was given three months to prepare for the exhibition “Paintings on Paper” (2019) and three months to prepare for the exhibition “Skyfall” (2015).The museum stated that it had already taken “some important decisions,” but that the delay in releasing “", "The next Biennial should take place in the city between April and May 2021. Among the artists who have expressed interest in the project are A. Al-Khair, Zakiya Al-Khair, Zina Sadiq, and Nusrat Mian. The exhibition will be hosted by the Museum of Fine Arts Abu Dhabi and will be curated by Sunil Gupta, director of the Abu Dhabi-based contemporary art center the Victoria and Albert Museum.\n\n\nThe New Commonwealth Fund for Art and Design (New Commonwealth Fund) has announced that it is canceling its award this year, but will continue to provide funding to artists who demonstrate innovative and compelling work in the arts. This year’s prize, which was presented by the London-based institution to the artist and designer Atif Nusrat, was scheduled to take place in October. The event was postponed due to Covid-19, which has made the global epidemic year once again a challenging one.The award ceremony was supposed to take place at the Allen Institute for Contemporary Art in California on October 31. However, the arts space announced that it was postponing the event and that the date would be re-arranged. In a statement, the institute described the move as “mut", "The next Biennial should take place in 2020 and will be hosted by the Museo de Arte Contemporáneo in Madrid. \n\n\nThe Barcelona-based museum Vigo, which received a $6.5 million donation from Spanish Prime Minister Mariano Rajoy in June, has been gifted a new exhibition, “The World Is Not Enough,” by Arturo Vigo. The show, organized by the Spanish architect María de la Rosa, will open in Barcelona’s Pérez de la Sextana on August 19 and will have a retrospective of the work, titled Feminine and Universal: An Experimental Feminist Theory of Culture, at the Prada Contemporary Art Museum in Milan in September. The gift brings Vigo’s total donation to $10 million. The works, which are part of a project by the Spanish architect to construct an exhibition space that would function as an incubator for thinking about the future and the cosmos, will be presented in the context of the exhibition “All for One: Invisibility,” which will feature contributions from artists such as Archaia, Ada Criado, Amina Dilen, Benedicta G", "The next Biennial should be in 2020, as the previous two were in 2002 and 2006. The new exhibition should focus on the work of Toccarlo, Toccarlo di Rosa, and La Monte Moretti, among others, and will be led by Nedrissa C. Althan, a curator and writer based in London who previously served as the artistic director of the Italian pavilion at the Venice Biennale in 2008 and 2004. “Brooklyn Academy of Arts is eager to continue our longstanding commitment to artistic excellence by continuing to present exceptional exhibitions,” said Brooklyn Academy president and CEO Mary Sitrin. “The new exhibition will encompass the collection and exhibition of the collection, as well as the history and development of the academy.”Also new to the show will be a new short-form, creating an immersive experience for those visiting the museum, in a series that will emphasize the museum’s history of African American art. The show will also include a new stewardship of the museum by Barbara and John Castle, the current owners of the estate. The show will be on view until March 7.The museum was founded in 1965 by the New York–based duo of Robert", "The next Biennial should be held in the first quarter of 2020. The next exhibition should be held in the second quarter of 2020. The biennials, which were founded in 2004 by director Kanwar Ghatak, who was transferred to the directorate of photography in 2003, are overseen by Rupak Lenski; Gaya Sarkar; Mata Natarajan; and Kiran Nair. Commenting on the biennial, Karnik said: “It is an honor to have been selected for the first installment of the Wangari & Kiyomasa series. I am greatly inspired by the work of all those who are passionate about their art and environment and the power of art to shape our world. Nodding to the theme of repair, the first exhibition of my work will take place in the forest of Bali in early February, and the second in the mountains of New Delhi in March. Together, the two biennials will be a reflection of our interconnected world and our collective ambitions.”\n\n\nA group of artists, artists, musicians, writers, and other cultural workers in the Philippines have launched an #ArtistsFightBack campaign after a spate", "The next Biennial should be held in the spring of 2020.\n\n\nThe Parsons Museum of Design in New York has announced that its inaugural event, “Project +1: Design + 1” will take place in February 2020. The event, which will be hosted by the Parsons, the Museum of Modern Art, and the New Museum, will be followed by a series of public lectures by design professors, workshops, and other events, such as Artforum’s October 21 exhibition “A BIPOC–designed world.”The event will showcase the work of thirty-eight international artists, including Frank Gehry, Adrian Piper, Masaccio, Hélio Fontana, Brian Parrish, Michael Segal, and Yinka Shonibare; features works by several of the year’s most celebrated contemporary designers, including Elizabeth Peyton-Sue, Graham Stuart-Jackson, and David Salle; and will feature a selection of works by twenty-four lesser-known artists. The exhibition will also feature the exhibition of work from the collection of artist and collector Richard Avedon. “The contest comes at a pivotal moment: the museum is planning to open a new wing dedicated to design in the fall of 2020", "The next Biennial should take place in 2020, and the 2020 edition will likely feature work by fifty artists from fifty countries. The 2020 theme will be “The creative life of an urban environment.”The venue will also receive $1 million from the Rebuild the Dream coalition, a coalition of more than one hundred civic, religious, and nonprofit organizations that seeks to spur the construction of 500,000 homes in the United States over the next ten years. It will receive a further $1 million from the Connecticut Economy Fund, which will disburse $200 million in grants to local arts and cultural organizations.The full list of contributors can be found here. \n\n\nThe Liverpool Biennial, which was canceled due to the coronavirus, has announced that it is reopening in March 2020. Titled “Commune”\u0097a reference to the term for a spiritual community of thinkers, artists, writers, and producers\u0097the event will also feature a residency program and other programming.“We know that not everyone will be able to make the trip to the Liverpool Biennial in March 2020, but we are sure that everyone will be able to find something to do in the city that will allow them to connect with the creativity", "The next Biennial should be held in 2021. The majority of the United Kingdom’s art museums were closed on Monday, leaving thousands of people without access to art, with the majority of museums still closed despite a nationwide health alert. The Royal Academy of Arts in London reopened on Wednesday, but only after the Royal Shakespeare Company cancelled its March tour. The National Portrait Gallery in London, which was forced to temporarily close last month for its upcoming Season of Performing Arts and is currently closed until March 13, reopened on Thursday, March 7. Art galleries and galleries that have not yet announced their reopening date are also expected to reopen in the coming weeks. Mariner Kemper, chair of the British pavilion at the Fifty-Ninth Venice Biennale, said: “Our galleries are working hard to plan and to reopen as quickly as possible. Our artists and staff are united in their determination to see the galleries through this difficult period. I am confident that we will be able to open the galleries and galleries in good time. I look forward to seeing the progress of the exhibition in the coming months.”The National Galleries of Scotland and the Scottish National Gallery have announced that now is not the ideal time for a re", "The next Biennial should take place in 2021. The ten-week event will focus on Portland’s local LGBTQ+ community and will feature around forty artists from across the city.  The 2018 edition, which took place in January 2019, showcased forty-seven artists. Those artists chosen to participate in the 2019 event include Sean Kelly, Alex Prager, Nari Ward, Kenan Thompson, and Magenta Butterfly. According to Artnews, Kelly will receive an additional $25,000 in sponsorship money for the event. Meanwhile, the 2019 edition of the biennial will be staged at the iconic Stanley Girls’ School in the Stanley District, which has hosted the biennial since 1991. The event will now be held at the Stanley Museum of Art, where it will take place from March 6 to March 8, 2020.The 2019 version of the biennial, titled “Away From the Sun,” featured forty-three artists. The exhibition was curated by artist Jane Panetta and featured seventy-two works that included work by eighty-one artists.\n\n\nThe Toronto Art Gallery (TGA) is launching a new online platform that will help raise funds for LGBTQ+ cultural institutions across the city. The platform, called the City", "The next Biennial should take place in 2021 and will mark the centenary of the event. The opening ceremony will take place at 5 pm on September 12 and will be hosted by Biennale Santa Maria di Villamil in Milan. The event will debut the new innovative technology MultiTask. For the first time the Biennale will use the technology to present a retrospective of a work. The full list of participating galleries is as follows:\n\nART Basel Hong Kong, China, 2019: “Spring/Fall,” Art Basel Hong Kong, China, 2019: “Spring/Fall,”\n\nCalthorpe Gallery, London: “The Future Is Now.” Australian Contemporary Art, Sydney: “Afternoon Tea,” George Museum, Melbourne: “In Absentia,” Granties Gallery, Sydney: “Walt Whitman”\n\n\nThe Museum of Contemporary Art (MoCA), London: “This is the Present,” its current exhibition at the venue, “The Future Is Now,” will open to the public on September 15.The London–based organization behind the exhibition, called “This is", "The next Biennial should be held in 2020. The curator, Perrin Peña, told the Art Newspaper that his organization will decide whether to pull the plug on the exhibition by May 21.  The full list of participating artists is as follows:STEAL LIFEWALL, Vienna, 2018Austria/Austria19.0/19:  H.O.M.N.G.S. Chile, 2019Chile2019:  Dionysus & the female skeleton, MexicoCity, 2019Turkey/United Kingdom: Cecilia and the Spherus Magna, Spain/Paris, France20.0/20:  G.L.A.S., New York, 2018FrenchSubmission: Just Another Day, New York, 2018Featuring: Frieda Alves, 2017Alex Ortega, 2015Arnold Braunschweig, 2018Arts Deco, 2018AustriaSubmission: Aurora Borealis, New York, 2018Artist Submission: Brian Anthony, 2017BARCELAND, SpainSubmission: The City of London, 2017(Artist/Artist only", "The next Biennial should now open in the spring of 2021. \n\n\nThe Wallach Art Museum in North Adams, Massachusetts, has received a donation of eighty photographs by artist and activist Eva Langret. The donation was made by artist and activist Dara Lindretta, who has advocated for the institution to divest from the fossil fuel and defense industries. The gift is one of many efforts made by Langret, whose husband and the organization they founded, Eva Langret Foundation, to pressure the museum to divest from companies that contribute to climate change, and will help to fund the exhibit “The Fourth Wave: Plant, Land, and the Climate Crisis” (2019–20), which will take up Langret’s legacy.“Although the first half of the exhibition details Langret’s own experiences during the Second World War, the latter half will be a reflection on the climate crisis and the ongoing threat it poses to our climate,” said Lindretta. “The climate crisis is not only about us, it is about our children and grandchildren. It is about us as a species, about us as a people, and about us as individuals.”The museum first announced its intention to discontinue fossil-", "The next Biennial should be held in 2022.\n\n\nThe National Geographic Society’s plans to move the Smithsonian’s American Art Museum (NAAM) from Washington, DC, to its new home in the capital city of Belo Horizonte in the country’s northeast have been put on hold amid the coronavirus pandemic. The move has forced a change of plans for many cultural institutions across the United States, including the Getty Center in Los Angeles, the Metropolitan Museum of Art in New York, and the Smithsonian American Art Museum in Washington, DC.Gillian Hayes, the president and CEO of the National Geographic Society, told Artnet that the decision to move the museum from DC had been in the works for several years. The move was delayed in October 2019, when the 21-month coronavirus outbreak began. Hayes cited the hospitalization of a young patient at the institution as one of the reasons for the move, and said that the move was made on the recommendation of the institution’s board of directors, which comprised three men and three women. The board also recommended the museum move to a larger university campus in downtown DC, but the institution voted against the proposal. “The board members want", "The next Biennial should take place at the Museum of Contemporary Art Chicago (MoCA), in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Chicago is planning to move five hundred artworks by twenty-eight artists\u0097including Sabrina Andujar, Billie Tsien, and Kaytranada\u0097from its current location in the Merchandise Mart on the Northwest Side of the city to its new home at 2380 N. Milwaukee Avenue.The changes, announced in a memo sent Tuesday, will involve the reopening of three existing buildings in the museum\u0097the former home of Richard Diebenkorn’s glass-enclosed sculptural masterpiece Arteski, which is currently being renovated by J. Paul Getty’s Los Angeles County Museum of Art\u0097and a fourth that houses the collections of the Getty and Museum of Modern Art.“The move will further the Museum’s commitment to enabling the artists we are privileged to represent to realize their creative ideas,” said Elizabeth Ross, director of the Museum of Contemporary Art. “I’m thrilled by this exciting new chapter of the artists’ careers.”Inaugurating the new museum is the dedication of four years", "The next Biennial should be held in 2021. The next Art Basel, which will take place in Dubai, is scheduled to take place in 2022. The Rock-Paper-Scissors 2020 edition is scheduled to run in 2021, but it has yet to be announced whether the event will be held in Dubai, Mexico City, Hong Kong, or New York.\n\n\nThe Asian art museum Shanghai (MAS) is planning to raise more than $500 million in the next six years to expand its collection. In a budget announcement today, the institution said it is expected to raise $155 million in 2020 and to set up a new fund for exhibitions and research in 2021.The announcement brings MAS in line with a number of international arts institutions, including the Museum of Contemporary Art (MoCA) Los Angeles, the Museum of Contemporary Art San Francisco, the Museum of Contemporary Art Tokyo, and the Museum of Contemporary Art Tokyo, which have been working to raise funds to expand their collections and support their exhibitions. The Japanese art museum Tokyo, which recently announced plans to expand its holdings to include more contemporary works, is also planning to open a new branch in the city next year.According to the New York Times, MAS has received $125 million from the Sichuan government and", "The next Biennial should take place in 2020. \n\nThe exhibition will mark the seventeenth edition of the Fifth Biennial.  \n\nThe English-language website Artforum.com has revealed that the fifty-ninth edition of the fair will take place in the United States in April. The 2020 edition will be hosted at the Metropolitan Museum of Art in New York from March 31 to April 2.Ahead of the event, museums will launch museum tours, and art dealers will present exhibitions. The US pavilion will also receive a $25,000 donation from the American Federation of Arts. The twenty-fifth Venice Biennale will be held at the Stedelijk Museum in Amsterdam in April. The 2019 edition of the Dubai Art Fair also featured the United Arab Emirates. The 2019 edition of the Venice Architecture Biennale featured Italy, Spain, and Romania.\n\n\nThe city of Hamburg, Germany, announced today that it plans to welcome visitors to the historic city once again in April 2020. The reopening of the Schädelplatz, which is located in the central area of the German capital, coincides with the annual Art Basel show, and will mark the third time the fair has been held", "The next Biennial should be officially opened in 2021 and will draw from 150 million filmed images taken by the artist each year.\n\n\nThe Guggenheim in New York has postponed the opening of its new, publicly accessible space, the DeBartos Performing Arts and Design (DPAD) in the city, which will be inaugurated in September, the institution said on Tuesday. The building, which is located at 486 West Twenty-Third Street, has faced considerable controversy since it was proposed by former developer Zaha Hadid in 2007 and built by architect Donatella Bocchino, a contemporary of Thiel, in 2009, when the artist was still in his thirties. According to the Art Newspaper, the building was slated to house a museum of modern art and a collection of forty thousand works from the artist’s extensive collection. The project was scrapped after the artist committed suicide in 2009.The Guggenheim announced that it would add twenty-three works by artists such as Elyn Zimmerman, Prudence Cameron, and Phyllis Rohde to its collection, which also includes works by the Dutch-born Icelandic artist Bjarni Benediktsson, whose psychedelic landscapes are in the exhibition “Artifice", "The next Biennial should be held in 2021. The museum will be reconfigured to host the festival in 2020 and the first exhibition of the new seventy-two-acre campus will open in 2021. The calendar for the event will be the same as the one it has always hosted, and the theme, “Life and Art” will be retitled “The Conversation.”The California Institute of Technology (Caltech), in Pasadena, California, has announced that it plans to reopen the iconic Observatory to the public in January 2024. “We are pleased to commit to launching the new museum in January 2024,” said Richard Levy, the director of Caltech. “The new museum will be designed to reflect the spirit and architecture of the Observatory and will include a new, large-scale installation of original works by twenty-three artists, including Kiki Smith, Mark di Suvero, and Rob Alm, as well as artworks by artists from the Pasadena collection. The new museum will be a major expansion of the Observatory and will serve as a major destination for visitors from throughout Southern California.”The new structure will be open to the public in 2020 and will be constructed in a desert setting in a remote location in the Santa", "The next Biennial should take place in the spring of 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Sarina Banderas as its next executive director. Banderas will take the helm from Agustín Arteaga, who left the institution in June 2019 to head the Los Angeles Museum of Art (LALA). While at LALA, Banderas helped to secure the future of the institution when it was acquired by the California-based private museum group, which plans to turn the institution into a research center for contemporary art and is currently renovating the former Santa Fe Railroad Station and will add more than 1,500 square feet of exhibition space.“I’m really excited to be working with Sarina,” said Arne Ghebaly, chair of the board of trustees of the museum. “She’s a terrific curator, an outstanding organizer, and an enthusiastic advocate for MoCA.”Banderas comes to the museum from the Contemporary Art Museum of Chicago (CAM) where she served as associate director of curatorial affairs and curator of modern and contemporary art. She replaces Kimerly Rorschach, who stepped down from the position in", "The next Biennial should be held at the beginning of 2019. The next two years should focus on international exchanges and the promotion of different artistic practices and their relationships to each other and the greater urban environment. The next three years should focus on the design of new and established museums to present the collection of the Director General of the Italian State, the Curator of the Italian Museum of Art, and the Curator of the European Museum of Modern Art, respectively. “The main goal of the Biennales is to create a new kind of international dialogue between Italy and the world,” said Stefano Domenici, the director of the Biennale. “The vision of an international cultural exchange and the anticipation of a new era in Italian art are the themes of the next three years.”The next iteration of the Milan Biennale will take place in the city in 2022.\n\n\nAs the coronavirus and the coronavirus-like illnesses in China escalate, the museums and cultural sites that have hosted international exhibitions and sold works in the last two weeks—including the Museum of Modern Art, the Beijing Museum of Art, and the Museum of Contemporary Art Shanghai—have canceled upcoming events and are preparing for the worst. From Tuesday", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced that it will move the upcoming eighty-sixth Venice Biennale to New York in 2021, following the example set by the Metropolitan Museum of Art—the largest museum in the United States. This is the first time MoCA has moved the event since 2005.While the move is not unexpected, it is an important move for museums that are facing financial troubles and are facing a shrinking audience. The event, which will take place at the Metropolitan Museum of Art in New York from March 20–March 22, 2021, is forecast to generate $15 million in revenue for the institution.The move is part of a plan that aims to mitigate the financial impact of the coronavirus while maximizing the sustainability of art and the environment. The exhibit will include work by eighty artists, including Carlos-Christo, Marian Ferrer, Michael Grant, and Gabriella Pica, among others that are currently facing pressure to relocate. The exhibition will also include a new scholarship program for young artists in partnership with the Institute of Contemporary Arts (ICA), the New York Academy of Arts, and the ArtSchool of the Arts.\n\n\nThe Fine Arts Museums", "The next Biennial should take place in 2020. The next iteration of the National Gallery of Canada will inaugurate the new museum in 2019.\n\n\nKenichi Hoshine, the CEO and majority owner of the Tokyo Metropolitan Museum of Art (TMA), has announced that he is pulling his $3.9 billion ($3.2 billion) plan to turn the MCA into a museum dedicated to the Japanese visual arts, and instead will create a $2.5 billion exhibition space that will house the collection of the Japanese government and will serve as a staging ground for international art. “I’ve always believed that a museum should be a living organism, a complex ecosystem that multiplies and recontextualizes the natural world around it,” Hoshine said in a statement on Wednesday.The plan calls for the construction of a new exhibition space in the museum, the expansion of the existing exhibition space, and the construction of a new library. The MCA will also undergo a massive renovation. The project is estimated to cost $100 million.Inaugurating the new platform will be a retrospective of the artist’s work, titled “100 Years of Hachiro Koike: The MCA Collection,” which will", "The next Biennial should take place in 2022.\n\n\nThe Los Angeles County Museum of Art (LACMA), the Museum of Contemporary Art, Los Angeles (LACMA), the Stedelijk Museum, the Little Company of Mary, and the Santa Monica Museum of Art (SMMCA) have reached an agreement that will extend the museum’s current programmatic agreement until 2023, reports the Southern California News Group.“Though the terms of the agreement have yet to be finalized, the extension will run through 2021: the first show of the new, three-dimensional installation, `Splinter,” will open at LACMA in 2021. In a joint statement, LACMA, the SMMCA, and the Museum of Contemporary Art assured the public that the event will not disrupt the future programming of their institutions. “As we enter a new chapter in our relationship with the City of Los Angeles, it is vital that LACMA, the Santa Monica Museum of Art, and the Museum of Contemporary Art Los Angeles remain in alignment with City policy and decisions, as we continue to present the most important works of art in the city,” said Mayor Antonio Villaraigosa. “We look forward to", "The next Biennial should be held in 2021, and the Festival of Lights in 2020. The National Art Museum of Singapore (Namma), which announced its plans to replace the opening of the National Gallery of Singapore (Namma) with an exhibition of contemporary art, is currently working on revising the schedule of its biennial. The institution also plans to hold a new exhibition of new work by artists and contemporary art collectors in 2021. Chinati: The Art of Human Performance, the biennial for contemporary art, will mark its 50th anniversary in 2022. The National Gallery of Art Singapore (Namma) was founded in 1946 by Charles Wong and Cheta Wong to promote the collection of contemporary art from the country. In the 1960s, the Gallery relocated to a new building in the National Gallery of Art, which was completed in 1972. It also expanded to become the Neslihan Museum of Art in Singapore, the National Gallery of Art Singapore (Namma), and the National Gallery of Art Singapore (Namma). In 2005, the Gallery launched its digital platform Chinati.com, which launched in 2007 and has since hosted more than 1,500 exhibitions and events", "The next Biennial should take place in 2021. The festival will be hosted by the Stedelijk Museum in Amsterdam, which will run the event along with the renowned Diller Contemporary Art Centre. The 10,000 Reaktion, an exhibition of contemporary art in the Potsdam region, will be curated by Bernardo Varejão. The event will explore the theme \"Becoming Human: The Transformation of Art and Society.\"The first Biennial will be held at the Museum of Contemporary Art, Miami Beach in November 2020. The second, titled The Family, will be held at the Sonnabend Gallery in January 2021. Titled, “The Family,” the event will feature works by ten artists chosen from around the globe in collaboration with the museum. The participating artists will be presented in a retrospective format, with the first show taking place in Miami Beach in November 2020. The second show, titled “NIRIN,” will be held at the Dallas Museum of Art in August 2021.The biennial’s inaugural edition, called the WELD, was staged at São Paulo’s Museum of Modern Art, which is currently undergoing a $50 million renovation", "The next Biennial should take place in July 2020 and will be presented by the City of London. The event will be hosted by the Tate in London and will be organized as a platform for an international conversation and discussion around issues of our time.\n\n\nThe University of Chicago announced today that it is teaming up with the Museum of Contemporary Art (MoCA) in Chicago to create a new cooperative, with the goal of bringing more students and faculty from the University of Chicago in Chicago to Chicago to work on museum projects. The collaboration is part of a new initiative, called \"The Architecture of the Future,\" that will launch in June 2020.A statement issued by the university reads: “As part of a new phase of UChicago’s historically important programming, the institution is partnering with the Museum of Contemporary Art to encourage a more diverse and inclusive future for the institution. In line with this vision, we have opened a new, new advisory service, the MoCA Architecture of the Future. Our new structure will deliver a shared platform for students, faculty, and the public to collaborate and understand the architecture of the future through the institution’s collection, exhibitions, education and research.”The new service will consist of a variety of tools and resources that", "The next Biennial should address the issues of carbon emissions and the body politic, and should take place at a location that is accessible to the general public’s needs. It should also focus on the multiple dimensions of visual art, including the design of the exhibition, the program of exhibitions, and the installation of works. “There is a need to re-conceptualize the exhibition as a medium for further inquiry and discussion,” said the director, Eva Schlössner. “This year’s Biennial will be a moment of departure, of transition, of renewal. We are counting on you to help us in this process.\n\n\nThe Architectural Association (A) has announced that it has endorsed a slate of ten artists for the upcoming edition of the Aichi Triennale, to be held at the upcoming event in Tokyo from March 21 to March 23. The 2020 participants include Yuki Kondo, Tara Less, Ruta and Markus Lösch, and Yuki Tanaka.The 2020 Aichi Triennale, which was organized by the Aichi Triennale Foundation in cooperation with the National Museum of Modern Art, will be curated by the renowned international curator at large, Masaoka Shigen", "The next Biennial should be held in 2021.\n\n\nThe National Gallery in London has revealed that it plans to divert some of its revenue from its flagship exhibition “The National Exhibition,” in which more than 1,600 works are presented in a single day, to support the British Red Cross. The £3 million event will now be held at the National Maritime Museum, where it will continue to be held through the end of the year.The shift was made after the institution received a donation of €3 million ($3.5 million) in support of its fight against the Covid-19 outbreak. The sum is part of a £11 million package that will be presented at the National Maritime Museum in March 2021, after which it will begin the process of moving the exhibition to a new venue.The National Portrait Gallery and the National Galleries of Scotland will organize the new exhibition, “The National Gallery in London” in January 2022. The National Maritime Museum will stage the first exhibition dedicated to the exhibition in the United Kingdom, “National Portrait Gallery” in November 2022 and the National Galleries of Scotland will stage the first exhibition dedicated to the show in Scotland, “National Galleries of Scotland” in March 2022.", "The next Biennial should take place at some point between 2021 and 2022, in an attempt to break the six-year cycle of the exhibition. The 2019 edition was staged at the Museum of Contemporary Art, Miami Beach, and was organized by the group the Museum of Fine Arts, Houston. The 2020 iteration will be held at the National Museum of Women in the Arts, Washington, DC. The biennial will celebrate the performers, the exhibition and its theme, and will be followed by a book launch party, a gala, and a gala dinner.  The 2022 edition will be hosted by the National Gallery of Art, Washington, DC. If the organizers are successful in their plan to hold the tenth annual Biennial, set to take place in 2020, the festival will move to the National Museum of American Art, Washington, DC. \n\n\nThe Amsterdam Architecture Biennale, which runs through March 14, 2020, has announced that it is suspending production and running of the event in an attempt to conserve water and energy and to minimize the impact of climate change. The end of the exhibition, which has drawn an average of twenty-five thousand visitors each year to the Dutch capital, follows a year in which the city commissioned a new", "The next Biennial should aim to examine the question of whether qualitative research, not in the sense of the arts, can serve as a vehicle for the development of an authentic cultural heritage.”The 2018 edition of the exhibition was curated by Simon Hoptman and Elin Østbye, and featured sixty works by twenty-six artists, including Becca Al-Khalili, Merah Boumeddiene, Avital Bode, Yael Aitken, and Daniel H. Hoffman.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is asking the California Coastal Commission (CCCo) to approve a $1 billion plan to repair and rebuild the ocean-front venue, which suffered a devastating fire on September 2, 2018, and is currently undergoing renovations. The $36 million project is the centerpiece of MoCA’s $3.1 billion renovation plan, which was released last month, and aims to revitalize the museum’s campus and enhance access to its Pottery Barn-era.“The museum’s design partners are committed to the project and work with MoCA to deliver a unique and exceptional entrance experience for visitors to the institution.” Max and Nari Ward, the founders", "The next Biennial should be held in 2020. However, the next Art Basel Hong Kong will only be held in 2022. While the exhibition will be hosted at a new location in the US, the organisers have announced that it will be relocated to the Hong Kong Art Museum. The exhibition will be moved to the Hong Kong Science and Technology Museum (HKSM), which is currently undergoing a major renovation, and will be staged at a new location in the city.An online petition, signed by ninety-three of the seventy-nine Art Basel Hong Kong exhibitors, reads: “We have been working tirelessly to present our exhibitors and partners the most interesting works at our booth. Unfortunately, due to the ongoing relocation of our exhibitors, we have been unable to present our booth at the recent Hong Kong Art Fair. In order to facilitate the exhibition, the management of the fair has agreed to share space with the next Biennial. We are extremely grateful for the support and cooperation of the fair’s sponsors, and our exhibitors. However, this is a matter for the fair organizers.We hope that this means that the next Biennial will be successful, and we look forward to presenting our exhibitors your extraordinary", "The next Biennial should focus on the history of the exhibition, its development and the exhibition’s current location; the exhibition’s future expansion; and the exhibition’s return to the US. If the Biennial is still held at the Mall, it will return in 2021. Faculties in New York and Oulu, Finland, will also receive funding from the city.“As part of our ongoing efforts to support artistic and cultural institutions in our city, we are delighted to announce that the Art Place in the City of New York will receive $500,000 from the City of New York,” said New York City commissioner of economic development Andrew Cuomo. “This is a significant amount of funding for the museum and a significant step toward the museum’s future. It is an important step in our ongoing efforts to strengthen and diversify the museum’s holdings of African and African American art, and in our ongoing efforts to engage with the varied histories and cultures of New York City.”In addition to funding the institution, the city also awarded $9 million in grants to four other local, state, and federal cultural organizations: the Bronx Museum of the Arts, the Bronx Museum of the Arts, the Bronx", "The next Biennial should take place in the fall of 2020. The exhibition will be curated by Huldrill, and will aim to present sculptures from the exhibition that are inspired by the artist’s early works.\n\nThe Swedish artist Karina Vossenhuber has won the Prix d’Art Moderne, the prestigious prize presented by the Paris-based organization. The fifty-six-year-old Danish artist was awarded the prize at a ceremony in front of a live audience at the Palais de Tokyo in Paris on December 23, the same day that the seventy-two-year-old Swiss artist Ludwig Loesser and seventy-two-year-old Italian sculptor Piero Ferretto were chosen as the judges.Vossenhuber’s installation The Fountain of Youth, which was commissioned by the Künstlerhaus in Kassel in 2007 with the aim of celebrating the early years of the artist, was selected for the prize. It is located in the exhibition “The Fountain of Youth, Modern Art,” which was launched by Künstlerhaus president and CEO Ulrike Kallmann and Künstlerhaus director Ulla Andronova in 2010.Loess", "The next Biennial should take place in 2020 and will be directed by Alexander McQueen, director of the new Biennial of the Moving Image (BMA), New York. The biennial is currently in the works of its curators, Yinka Shonibare and Alex Abadi, and will be inaugurated by an exhibition of new works by contemporary artists.The biennial will focus on the practice of the weaving of the silk tapestries of Victorian and Edwardian paintings, along with the production and reproduction of works on paper. In addition to examining the paintings and tapestries that are often overlooked in the study of Victorian and Edwardian art, the biennial will focus on the visual arts and the environment in which they were created. The biennial, which will highlight the biennial as well as an exhibition of work by contemporary artists, will also encompass the reconstruction of the Berlin Wall, the dismantling of Nazi-occupied buildings, the restoration and preservation of cultural heritage sites, and the results of a project to re-create the Löwenbräukalerie in Cologne. Among the works that will be restored are the demolished galleries, the collection books, original manuscript charts of works, and manuscripts.The Biennial of the Moving Image will", "The next Biennial should be made in 2022.\n\n\nAs the number of cases of the coronavirus in the US continues to rise and new regulations are put in place to prevent the spread of the virus outside of the US, the Art Newspaper has launched a new online publication, Artnet, which will provide daily updates on Cuba’s art and culture. Titled “In a World Of Its Own,” the online publication will focus on the island nation’s art and will focus on the effects of cultural tourism\u0097the country’s economy depends on tourism. “The collection of Cuba’s art by Artnet is a project of Cuba’s government and is a socialist project: it is not a commercial enterprise,” said Maria Barba, director of Artnet. “We are also working to create a platform for Artnet to translate the art produced by Cuba’s artists into Spanish. I think it is important to show that we are a country that is a stable and thriving democracy, not one that is in crisis.”The new online publication will be curated by Sebastian Rogers, editor of Artnet, and will", "The next Biennial should take place in Los Angeles in 2022, and three years later in St. Louis, where it will take place next year. The 2020 event, entitled “Get Up, Kids,” featured a mix of new and established artists, including Kiki Smith, Tierra, and Ali H. Marder.\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced the opening of a new digital platform that will allow the public to view and purchase more than three hundred works by forty-five artists\u0097a total that is expected to surpass the museum’s previous mark for artists. The platform, Artnet, has been in development since 2016 and will debut with the 2019 exhibition “Diana Al-Hadid and the Eyes of a Girl.”The new platform, which will be hosted by the Los Angeles–based organization High-TechGlassworks, will be powered by the same database that LACMA’s current online experience uses. The information gathered during the online viewing will be shared with the museum’s staff. The public will be able to purchase works through the platform through March 29.“Our goal with the 2020 collection is to make the experience of visiting", "The next Biennial should take place in 2019 and will follow a new format that will incorporate a retrospective of the artist’s work in collaboration with a selection of works made over a period of forty years. The twenty-second edition, scheduled to open in 2021, is also facing the possibility of a delay due to the Covid-19 outbreak.An artist’s statement on the return of the works said: “Next year, our work will be brought together in one place, at the same time and in the same way. This is a unique opportunity to show our work and to re-create our relationships with our artists. We are grateful for the view of the artist’s work, which is one of the pillars of our artistic program.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has received the largest donation in its history—its first gift came in the form of a $250,000 donation from the Tyler family, who are distinguished among contemporary art collectors for their generosity and willingness to support local arts programs. The Tyler Foundation contributed $150 million to MFA’s endowment fund in 2019, which is the largest single gift in the museum’s history. The Tyler Family also pledged $", "The next Biennial should mark the fifty-eighth anniversary of the founding of the museum. The museum also plans to introduce new exhibitions and a program of performance and visual art.\n\n\nAldermaston Biennial, Norwich, UK: Since its founding by American Carl Anton and British artist Bechdel Storr in 1979, the Aldermaston Biennial has exhibited work by more than fifty artists. The event was originally held at Aldermaston Academy in Norwich in 2013, before it relocated to the National Gallery in London, where it has remained since 2015.Organized by a board of conservators, and curated by renowned curator Sianne Ngai, the brief is to explore how art and architecture interact to shape and shape us. The project was inspired by the work of Bechdel and Anton, and their ambition to engage with the body and body shapes through the exhibition of their photographs, paintings, sculpture, photography, and performance. \n\n\nThe Kunsthalle Düsseldorf in Germany has withdrawn from the Chicago Architecture Biennial, which was set to take place in June 2019. Kunsthalle Düsseldorf announced on Monday that it will not proceed with the event, which", "The next Biennial should take place in 2022, the same year the first exhibition will open on the Old City’s grand façade.  Namdi, a Lebanese-born artist who has worked in Lebanon for more than thirty years, was detained by police in Kuwait last month after he allegedly tried to cross the southern border in an attempt to reach the United Arab Emirates. He was extradited to the United Arab Emirates on February 8, where he remains under house arrest.Following a twenty-four-hour hunger strike by Namdi’s family members, the Emirati authorities transferred him on March 5 to Lebanese border police for questioning. According to the Guardian, the family told the Lebanese daily newspaper Al-Mayadeen that “Namdi is a very weak boy, a very sick child. He has no energy, no appetite, no energy, no appetite. He has a cold, a fever, a sore throat, and a whole lot of pain.”Although Namdi was detained for a short time in Kuwait, his case has since been transferred to Lebanon, where he will remain until his detention is over. According to Al-Mayadeen, the girl who gave birth to him suffered a miscarriage and has no memory", "The next Biennial should open on March 22, 2020, but the organizers are looking to hold an exhibition of works in late May. The exhibition will include works by contemporary artists including Max Beckmann, Andrés Jerez, and Ondine Diem, among others that are currently on display at the Museo de Arte Contemporáneo Brasil.\n\n\nThe Centro de Artes (CAA) in Lima, Peru, has received a gift of twenty-four artworks from the Museo de Arte Contemporáneo Brasil (MASB), the largest museum of modern, contemporary, and modernist art in the country. The works, which were donated by Pilar Corradi (CRI), include a bronze sculpture in the form of a girl with her arms around a bamboo pole, which was created with acrylic and features a fictionalized account of the events that led to the end of the Third Reich, the construction of the new museum, and the arrival of the Centro de Artas, which will house the pieces for the hotel's former location in the capital, Lima.“The gift of twenty-four works is an important milestone for our organization,” said Corradi"]