["The next Biennial should be at least three years away, and if the plans hold, it will feature an original work by a new artist. “It is an enormous honor and privilege, as an art historian and a professor of art history, to be able to present the first exhibition of contemporary art at the new MFA,” said Paul Mpagi Sepuya, the museum’s executive director. “The next Biennial will have the capacity to make a lasting impression on the lives and activities of young and old, and it will be the occasion for the first-ever international exhibition of contemporary art.” The biennial will be co-organized by the MFA and the London-based nonprofit the National Centre for Contemporary Art (NCCA), which provides support to artists and institutional museums in the United Kingdom. The biennial will also include a public talk by the exhibition’s first speaker, Pippa Evans, curator and author of Pillars of the Sea: Contemporary Art and the Politics of Love (2019).\n\n\nThe construction of the new headquarters of the Museum of Modern Art (MoMA) in New York has been disrupted by a major fire that broke out on Wednesday, March", "The next Biennial should be held at the Museo de Arte Contemporáneo at the Museo de Arte Contemporáneo, Madrid. The museum will be closed indefinitely to the public until February 26, 2022. \n\n\nThe Hirshhorn Museum in Washington, DC, has appointed David H. Koch, the billionaire founder and CEO of Koch Industries, as its new board chair. Koch, who has generously directed the museum since 1980, was elected by an open and transparent vote. The appointment marks a significant shift in Koch’s trajectory as it moves away from his longtime practice of promoting candidates through his political action committees and toward a more direct, fund-based approach to philanthropy.“David has been a tireless advocate for the Hirshhorn and its mission to advance the arts and humanities, and we’re fortunate to have him as board chair,” said Hirshhorn director Meredith Yellin. “As we look ahead to our next edition, we know that David will continue to shape the Hirshhorn’s vision, ethos, and operations. David is a visionary leader who will help guide and transform the Hirshhorn into an innovative, world-class institution that", "The next Biennial should focus on How Culture Organizes Conflict, or, How Culture Organizes Life, with an emphasis on the use of art and artifacts to address current social and political concerns,” said Thaddaeus Biennale director Sabine Melling. The jury that selected the fifty finalists for the 2019 biennial was made up of Andreas Fiedler, director and chief curator of the Zürich Art Museum; Bernhard Fehr, director of the Kunsthalle Basel; and Marta Rocha, director of the Museum of Modern Art.\n\n\nThe number of deaths in the wildfires raging in Northern California has increased to five hundred from one hundred, and the number of people displaced by the fires has risen to one hundred thousand. According to the Los Angeles Times, the fires are now burning in a region that includes Joshua Tree National Park and continue to spread to the nearby cities of Napa and Mono Lake.As of Monday morning, California had 352 fires, which were still uncontained, and the state is currently experiencing five hundred more wildfires, which are still too wild to contain. On Wednesday, President Donald Trump declared a state of emergency for the United States, which had already lost more than eighty percent of its land area by Monday", "The next Biennial should be held at the Museum of Contemporary Art in the Arts in New York in 2020. Gabrielle Gallo, executive director and chief curator of the Metropolitan Museum of Art, said: “The new year will mark the centenary of the opening of the first exhibition in the United States dedicated to the works of László Moholy-Nagy. The new biennial will address the cultural and social history of the artist-in-residence program as it relates to the institutional history of the institution, but it will also explore the relationship between the artist-in-residence program and contemporary art and contemporary culture in the United States.”\n\n\nAfter the British government pulled the plug on the exhibition “The Purge: Election 2017” in a bid to protect Britain’s vital arts and cultural sector, the Royal Shakespeare Company, the Royal Opera House, and the Royal Philharmonic have decided to cancel their spring 2019 engagements. While the Royal Shakespeare Company said it was not able to explain why it was cancelling the four engagements scheduled between March 22 and March 29, the partnership between the six institutions will not be affected, and the Royal Opera House said that the cancelation of", "The next Biennial should be held in Hong Kong in the year 2021. The current run of the show will conclude in March 2022. The 2019 edition drew over one-hundred thousand people from eighty countries and sixty-seven countries and territories.\n\n\nThe Smithsonian’s National Museum of African Art (NMAA) in Washington, DC, has launched an online biannual, “African Art’s New World,” to coincide with the seventy-fifth edition of the Fifty-Ninth Venice Biennale. The initiative will feature new works by forty-three artists, including Haus Maniras, Olafur Eliassen, and Matigas Linsdaine, and will run from March 29 to March 31, 2021. The exhibition is curated by Kamel Brown, who will work with curator Sara Johnson to explore themes of identity, migration, and the African diaspora in an effort to present a “new narrative of art in North America.”Brown first partnered with Johnson and the museum in 2009 to organize “Haiti: American Dream” (2013–14). The show was one of the first ventures into the African diaspora. “The following year, ‘", "The next Biennial should be staged at the São Paulo Bienal in October 2019, and the last in March 2020. In the 2015 edition, the show was curated by João Ribas. In the 2016 edition, the work was presented by Kaptain Moshiri.\n\n\nSlated to open in 2020, the Met Galerie in Berlin is reopening after weeks of lockdown amid the coronavirus outbreak in the country. Located at 23 Sidermuseum Stiftung Berlin (ESSB), the museum\u0097which encompasses ten rooms, the gallery, and the auditorium, which are all connected by a glass-enclosed courtyard\u0097has been closed since July 28. Its new collection-filled third floor will open in October, and the museum will also become the Berlin Gallery Wallda, a major new exhibition space.The new space will officially open on September 29. Inaugurating the exhibition area will be a new artist-led group show, “A Year Without a Girl: Art and the Emerging Female Body” (2019), which will feature work by sixteen artists in early November. The show, which is themed “A Year Without a Girl,” will be staged in conjunction with the annual Women", "The next Biennial should demonstrate that artists are actively seeking to address issues of their own making through a series of collaborative projects involving a range of artists including Charles Dance, Guy Gavriel Kay, and Stephen Hahn. It should bring together work by artists from across a broad range of disciplines. Artforum will present a preview of the first edition in Barcelona later this year.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Susana Alarcon as its next director. Alarcon has most recently served as director of the Brooklyn-based nonprofit Studio Museum in Harlem (MoCA) since 2013. She was succeeded by Loring Randolph as director of the Harlem Museum of Art (HMAA) in April of 2018.Prior to joining MoCA, Alarcon worked as director of the New York–based nonprofit theater company Playwrights Horizon, where she helmed the production of productions by Mark di Suvero, Stephen Frears, and Eleanor Tremain. She also cofounded the nonprofit arts incubator Playwrights Horizons, which has staged several collaborative projects with artists such as Halston Gilbert, Rosalind Russell, and Willem de Kooning. Previously, she worked as a curator at the Museum of Modern Art", "The next Biennial should be held at the Paris Museum of Modern Art, and will have an opening reception on February 22. The piece, which was made in the city of Algiers in North Africa and is on loan to the Museum of Art, is part of a series titled “African Art and Values” (Seymour & Stoughton) that was founded in 1989 by Sambi and was supported by the French and Italian governments. The show was chosen by an international jury consisting of Adrienne Ogilvy, Emmanuel Lévy, André Neiman, and Ebony & Rosalind Jordan.\n\n\nThe Art Gallery of Ontario (AGO) has appointed Stacy Lynch as its next executive director. Lynch comes to the institution from the Downtown Eastside Cultural Centre (DCE) in Toronto, where she has served as the director of development since 2014. During her tenure, she has organized numerous exhibitions such as “Fresh Air,” which was on view at the DCE from March 22 to March 29, 2019, and “Fashion Forward: Fashion” (2019), which featured work by fifty-eight international artists.“Stacy’", "The next Biennial should have a theme of “genesis and destiny.” It should also include a statement by Laura Flanders, a founding curator of contemporary art at the Los Angeles County Museum of Art, as well as a solo work by Sherry Woodburn, a sixth-wave feminist sculpture and performance artist from the 1960s and 1970s who is currently enshrined in the catalog. The exhibition will also feature a selection of works by artists from the diaspora that have been excluded from international exhibitions, including stateless Vietnamese artist Nguyen Quoc Hoa, who is currently incarcerated in China, and Iranian artist Mira Pankratou, whose work explores the concept of exile.“We are honored to present this year’s exhibition at the Museum of Modern Art in downtown Los Angeles,” said Michael L. Smith, chair of the board of trustees of the Los Angeles Biennial. “Laura Flanders’s incredible career as a curator spans a broad and vibrant range of work, from her early curating of artists such as Anna Atkins and Joan Miró to her own multi-decade career as a curator of contemporary art. Her exhibition ‘Time in the Body’–a decade-long exhibition", "The next Biennial should focus on the radical and tumultuous relationship between art and politics, the role of the state, and the intrinsic nature of the artist and his labor. It should focus on the history of the art, and the methodology of the biennial, as well as the history of the exhibition.It should also include a thought experiment on the prospect of what an artificial, hyper-local, and ever-changing digital world might look like.”The 2020 edition of the ART Biennial, curated by artist and scholar Georges Apostu, will take place at the Bourse de Commerce in Brussels and will run until February 22.\n\n\n\n\n\n\nThe Bearden Museum of Art in Minneapolis announced today that it is now accepting payments for tickets to upcoming performances by artists such as Jon Voight, John Digweed, and David Little and their respective groups, the Solos, and the Harry Potter Triathlon. The announcement coincides with the opening of the Bearden’s new two-story, sixty-six-thousand-square-foot venue, the Bearden Theatre, on the second floor of the former Stanley H. Winthrop Jr. Building. on the University of Minnesota’s campus.The museum opened the Bearden Theatre,", "The next Biennial should focus on “the future of art and culture in the city,” Dittrich said. “Art & Culture is a chance to develop, experiment, and create in a truly diverse city,” where people are able to connect with new and innovative art in a sustainable way. It will also present a new focus on Indigenous and international art, with an emphasis on the role and evolving opportunities of Indigenous artists.The 2020 event will take place at the new Space + Earth, which is currently under construction in the Tappara District of New South Wales, Australia. The venue will host a series of exhibitions, residencies, and educational programs, with the first exhibition scheduled to open in March 2021. While the first biennial was founded by the city of Melbourne in 2008 in response to the coronavirus, the 2020 iteration will focus on drawing from a broad range of artistic traditions and traditions in Australia, including the Art of ’70s and ’80s, as well as contemporary art and contemporary culture from around the world. Visitors will be able to see works by the artists that have been selected for the event, which will include work from twenty-four countries, including Australia, China, England, France, Germany", "The next Biennial should be held in 2020·\n\nGuarani & Co. have joined forces with the São Paulo Foundation for Contemporary Arts (SFCCA) to organize the next edition of the New Museum Brasília. The new series, titled Guarani/Cochina de Arte Nacional (Guarani Contemporary Art), will focus on works by a group of artists in Latin America.Guarani will present a selection of work by this year’s list of finalists, which is comprised of Camila Azaraga, Agustín Chávez, Guímar Giuliano, Agustín Rondinaga, and Agustín Valentin, together with a new exhibition dedicated to the work of the late Brazilian artist Edith Heath, which will open at the museum next month. The works will be presented by some of Brazil’s most prestigious artists in a show curated by Jorge M. Pécún, the curator of the Biennale de Grace in 2006 and 2011.Guarani & Co. will also unveil a new initiative that will partner with Bicentennial Centro de Artes Plásticas in Cuiaba, Brazil, to raise funds for the project", "The next Biennial should focus on “sympathy.” Following a question-and-answer session with the gallery, the panel decided to keep the exhibition on the agenda and instructed its staff to continue with the exhibition as planned.\n\n\nA show of more than 400 photographs by the late British photographer Richard Anuszkiewicz at the London Gallery of Modern Art (LGGA) last week drew more than 1,000 visitors, including Jay-Z, as well as an unexpected array of critics. The show opened with an exhibition of the artist’s work Embarrassment, 2004, which featured photos of women and teenage girls posed with objects ranging from bicycles to masks and was on display until December 21, when it was moved to the Tate’s collection.The exhibition contained over a dozen works by contemporary artists, including Paul Gauguin, Monir Shah, David Salle, and David Salle’s work Between the Sun and the Moon, 1953; Pierre-Auguste Renoir’s Ateliers du monde, 1958; and Jean-Michel Basquiat’s The Sea-Landscape, 1973.The event, which was organized by Museums Association England and the British", "The next Biennial should be held at the Museum of Fine Arts in New York in 2021. \n\n\nIn an unprecedented move, the City Council in New York City has voted to banish the Confederate monument dedicated to General Lee and four other generals that were honored in the city’s parks over the past decade. The move is part of an effort to eradicate Confederate symbols from public spaces.“We must work collectively to eradicate racism and segregation from our cities and our nation, and to build a better future,” said Councilman Jimmy Van Bramer, chair of the city’s public monuments committee. While the move is meant to commemorate historical figures that have served in important military or civilian roles during the American Civil War, it has also been called a “political stunt.” The move has been denounced by critics as a political move by Mayor Bill de Blasio, who has vowed to remove the controversial monuments. The mayor’s office announced that it has received eighty-seven complaints about the statues since it began.The city’s other public monuments—spaces that were dedicated to Confederate figures such as General Robert E. Lee and General Robert E. Price, two generals who fought in the Confederate States of America during the", "The next Biennial should be held in 2021. The 2019 exhibition “The Male Body: Art and Performance” drew 177,000 visitors; the 2020 event will be “The Female Body: Art and Performance” with 200,000 visitors. Art historian and curator Jennifer Boysen explained: “For over two millennia, the body has offered the human mind a perfect canvas for the exercise of its power of perception. In the process, it has been the medium through which art and beauty have been experienced by the senses. Now, with the advancement of modern technology, the body can be used to celebrate our own cultural and spiritual heritage, and to present often impenetrable artworks of our time.”The 2020 event will be organized as follows:The event will be held at the Museums and Collections of the University of Cambridge (CUM) in Cambridge, England, from February 21 to March 3, 2020. The full list of participating artists is as follows:The 2019 exhibition was curated by Carla Griffiths.\n\nThe Museum of Contemporary Art (MoCA) in Miami Beach has released a statement regarding the acquisition of a work by artist Christina Aguilar from the Metropolitan Museum of Art in New York in 2021. The", "The next Biennial should be in 2021, with an exhibition celebrating the work of the first six artists to win the prize, including Gabriel Garcia María; Dylan Thomas; and Jodi Throckmorton.The inaugural event, “Best of the Directors” (2019), was held at the Museum of Modern Art (MoMA), and the 2019 edition was staged at the Brooklyn Museum, where it ran from March 9 to April 3. The exhibition focused on the work of eight directors since its inception in 1983, with the first meeting taking place in the United States in 2004. The following year, the prize was awarded to the first director of a former institution to be named chairman. In addition to Francis, the awardees were Peter Zumthor, Jane Schumann, Jean-Luc Godard, and Ingvar Kamprad.\n\n\nProspect, the London-based contemporary art organization founded in 1999 by the late British architect Sir Richard Gandon and the late American playwright David Blaine, has appointed Richard Hay, director of its London branch, as its next chief executive. Hay will assume the helm from Sir John Bloxham, who retired in September after a decade at the helm of the space. Bloxham will remain involved", "The next Biennial should be held in 2020.\n\n\nThe Los Angeles Biennial, the city’s oldest and most prestigious arts event, is setting up a $50,000 fund for victims of the coronavirus. The event, titled the Los Angeles City Day, will invite artists and cultural professionals to create works to commemorate the city’s rebirth. The event will be held at the Venice Architecture Biennale in 2021. Los Angeles Mayor Eric Garcetti announced the initiative after a statement in which he said the “cocaine-infused, meth-dealing, gun-running, prison-packing, war-mongering, climate-change-denying, jailer-busting, war-profiteering, mass-murderer, factory-owner, factory-worker, prison-sitter, prison-sitters” all contributed to the coronavirus outbreak.Citing the coronavirus and the coronavirus-related deaths, Garcetti said that the city is now working with the Los Angeles County Museum of Art (LACMA), the Los Angeles Police Department, the California Department of Public Health, and the State of California to create a new fund to reimburse victims of the", "The next Biennial should address the contemporary history of the field and will begin with an overview of the latest available research and will conclude with a projection of the next exhibition. The museum will decide on the themes by March 26.\n\n\nThe Foundation for Contemporary Art (FCA) in New York City has appointed Jerome Adrian Smith as its next president and CEO. Smith comes to the organization from the J. Paul Getty Museum in Los Angeles, which he has led since 2013. He succeeds Carolyn Benitez, who departed the museum in April 2019 to head the Getty Learning Center, and will take up the post on January 4, 2021.“I’m very excited about the future of the organization and its mission,” said Smith. “Founded in 1986 with a mission to encourage the acquisition, consolidation, preservation, and research of art in the United States, the museum is recognized as the leader in the field with more than 1,400 exhibitions, collections, research projects, and programs under its tenure. During his tenure, Smith has continued to expand the museum’s holdings of contemporary art, introducing new initiatives and curating exhibitions that engage with issues of contemporary art and its relation to the arts.”Prior to joining the museum,", "The next Biennial should take place in 2020.\n\n\nThe London-based biennial, the eighth edition, of the Tate’s 'Art of the Party,' will also be moved to February 2020. The new date marked a significant departure from Tate’s previous March 2020 programming, which had been marked by a three-month stint in January 2021. The move was made in order to align with the expansion of the Tate’s collection and programme in the years since its establishment.Laing, who took the helm of the Tate in March 2018, said: “We are thrilled about the prospect of growing the collection and programme at the same time as we are expanding our galleries and exhibition spaces, and creating new opportunities for the exhibition of contemporary art. We have made an enormous contribution to the welfare and well-being of Tate galleries in recent years by strengthening and modernising the art and design departments. We are also working hard to create new ways to support the collection and programme, including by introducing a new point-to-point ticketing service to our galleries.”The new month for the Tate is part of a strategy outlined in a letter written by Tate director Maria Balshaw in 2020 in which she outlined the ways in which", "The next Biennial should be held in 2021. The 2019 event, which was canceled due to Covid-19, was held at the San Francisco Museum of Modern Art, which is still working on its plans for the event. San Francisco also announced that it will hold a free event on May 29 to coincide with the event. There will be two days of programming, including a concert by Grammy-nominated artist Ricky Martin, a solo show by artist and musician Rina Saito, and a quadrilateral sculpture show by artist and laborator Sander & VanDoren. San Francisco’s tourism and cultural industries are currently suffering from a severe downturn. The local organic grocer Whole Foods is currently closed until at least May 23, and many restaurants are already restricting outdoor dining. In an attempt to mitigate traffic congestion, Metro will run a number of light rail, bus, and subway lines through the city during the week of May 22–May 26. Ellen Brown, a curator and organizer who was nominated for the 2019 Biennial for Women and the artist-in-residence residency at the Brooklyn Museum, claimed that the decision to cancel the event was made in light of the deteriorating health of artist-in-residence Amy", "The next Biennial should be titled “Toward a New Vision,” which will address the conflict between art and social change, and will take place in 2020. The show will include the work of seventy-two contemporary artists, including Luciano Floridi, Pierre-Luc Marion, Jean-Pierre Lacroix, and Douglas Gordon, as well as seventy-four works by African and European artists.As part of the new partnership, the museum will host a number of presentations focusing on issues of art and history, including the exhibition “The Art of Living: Sculpture in Contemporary Life,” which will take place in the museum in December. The exhibition will also include the work of Hauser & Wirth’s new curator of modern art, Lina Lobato, as well as the show “The Landscape Art of Jean-Pierre Egalité.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of twenty-six works by the late American painter Robert Irwin. The works are part of a large-scale project, spearheaded by artist Richard Serra, to increase the narrative and aesthetic impact of the works on our cultural landscape. LACMA will present the works in", "The next Biennial should be held in Essen in April 2021. Xavier Hufkens and Noda Yuki are collaborating on a new show in Japan, which will be staged at the National Museum of Contemporary Art in Tokyo, in March 2021. The show will also organize a retrospective of the artist at the Kunsthalle Basel in November 2021. The new Dusseldorf Biennial will open in March 2022. \n\n\nThe O, the Seattle Art Museum (SAM), and the Seattle Art Museum (SAM) have announced a series of exhibitions, residencies, and scholarships that will launch in February 2022. The six-month festival will also offer education programs, including a symposium on Jewish-American art and culture at the Seattle Art Museum in February 2020, and will host an international exchange program between the institutions in November 2020 and February 2022.“We are thrilled to announce that this year’s O’s Art is Back examines the influence and impact of art, culture, and design in the American West,” said Bruce Hunt, director of the Seattle Art Museum. “We will continue to present exhibitions, residencies, and scholarships that reflect the breadth of our collections and the impact of design and art", "The next Biennial should take place in the spring of 2021. The fifty-eighth edition, which will run from March 14 to March 16, 2021 in the city of Allmending, in the Scottish Highlands, will be held at the RDS from March 18 to March 19, 2021. The festival will also present a new exhibition of work by the artists represented in the exhibition, entitled “Ai Weiwei: The Anthropology of Light.”The exhibition will be accompanied by a new monograph of the artist’s art, “Ai Weiwei: The Art of Painting,” and a new documentary film, “The Big Sleep,” which will be released in May 2021. The library will also present a number of exhibitions and other programming, including “Collected Histories: On the Late Raimond Lange” and “The Art of Drawing.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has released the list of seventy-seven artists and collectives nominated for a 2019 Pulitzer Prize for their “contributions to American art.” The prize jury comprises artists Billie Tsien, Barbara Streisand, et al.; curator and historian Adam D", "The next Biennial should be held in the spring of 2021.  Bertrand de Villiers will step down from director of the Centre Pompidou in Paris and will become the next interim leader.\n\n\nThe Institute of Contemporary Arts (ICA) in New York announced today that artist-in-residence Wilson Yip, whose practice draws from the work of artists such as Robert Irwin, Claude Monet, and Cecil Taylor, has been selected as the 2020 winner of the $10,000 Ingenuity Prize. The annual $10,000 award, which honors an individual exhibiting outstanding talent in the field of contemporary art, was established by the institute in recognition of his work on the twenty-second edition of the London-based Ingenuity Prize, which was presented by ICA in January.“Yip’s paintings and sculptures are deeply meditative and play with our notions of language and the ways in which we use and manipulate it,” said ICA Director Alina Petrov. “His use of earth, air, and water to present new and complex ideas about the natural world and the human condition will inspire and challenge us as we think about what public art could and should be.”\n\n\nThe", "The next Biennial should take place in 2021.”\n\n\nThe British Film Institute (BFI) is launching a new initiative that will allow festivalgoers to enter a virtual reality (VR) experience at the institution. The initiative, called the BFI Field Trip, will allow visitors to experience the immersive works of British director Ben Wheatley in a virtual environment created by the BFI. The virtual environment will feature immersive audio and visual sequences created with new virtual objects and new virtual worlds, as well as recreated locations and objects from Wheatley’s film.“Cinema is an ancient art form, but it is rarely experienced as such,” said Richard Bigby, director of the BFI, describing the BFI Field Trip as a way of supporting the film-making community. “Our Field Trips will allow fans of film the opportunity to experience it in VR as part of the BFI’s mission to present the most exciting and exciting films of the year.”The initiative will be hosted by the BFI in partnership with the Institute of Contemporary Arts (ICA), London, and will last for six weeks. The festival will then return to its usual location in Stratford, and will feature two additional installments at", "The next Biennial should take place in the spring of 2021. The Artists’ House in London will remain on display through March 2021.The first Biennial will be held at the Tate in London, the second at the Tate Modern in London, and the third will be held at the National Museum of Scotland.  The first event, “The Case for Photography” (1966), which examined the relationship between photography and the human condition, was curated by William Lustig, the British photographer who is best known for his dramatic, often surreal portraits, often featuring models in a nude or semi-nude form. The second and third biennials are available online.\n\n\nThe museum’s holdings of the late French painter Auguste Renoir have been transferred to the Arto Gallery in Paris. The move is a major milestone for the Louvre, which has remained closed since the artist’s death in 1972. The transfer of the works, which comprise forty-seven works from the artist’s body, including eleven from his studio and another three from his home, has been made possible through a deal that also involves the sale of two of Renoir’s famous works, Léger & Guillaume and I", "The next Biennial should be held in 2021, and the 2020 iteration will be held at the Palazzo Reale in Venice. The 2020 event will be inaugurated by a presentation of the 2019 Exhibition “NIRIN: Reopening Life.” The biennial will draw twenty-six artists, including Iwan M. Grabowski, Delphine Altman, Rirkrit Tiravanija, and Raga Yalna, and will be hosted by the Bayreuth Cultural Center and the Faculty of Arts of Arts of the Faculty of Arts of Fine Arts of the University of Bayreuth. The arts and culture sector in Germany, the United Kingdom, and other countries in Europe and Asia is growing rapidly. Germany, the United States, and other countries are also investing heavily in their art museums and cultural sites to help them absorb the global crisis. The National Socialist Museum and the Giro di Lombardia in Milan are building two new cultural centers, and the United Kingdom is planning to open the Tate Modern in London.The Art Newspaper reports that the institution will still be closed next month because of the Covid-19 pandemic, and that the museum will be closed until March 22, 2020. Its next exhibition, “EXP", "The next Biennial should aim to include a survey of the history of the museum and introduce new works by contemporary artists. The museum will also indulge in a new cataloguing system in order to better present information about the collections and their exhibitions. The art of the exhibition will also be updated in order to bring them closer to the contemporary art and design movements.The exhibition of 'The Black Sun' will take place in New York, in partnership with the Turner Prize, in order to commemorate the anniversary of the exhibition. The show will also feature works by artists including William Kentridge, Francis Ford Coppola, and Ed Moses. The exhibition was organized by the Brooklyn-based artist and curator Holly Spero and her team, who focused on the historical perspective of the work in order to challenge the historical narrative surrounding the Black Sun, which is considered a seminal work in the history of postmodern art.The Biennial will be hosted at the facility known as the MFA in Soho through March 31. Its final edition, which is being curated by the Hong Kong–based artist and curator Louise Albin, will take place in the venue in May. The 2019 edition of the Biennial, “The Silent Exhibition,” was organized by the Los Angeles", "The next Biennial should aim to produce an exhibition which is both visionary and accessible to all, while remaining grounded in and grounded in the traditions of the artist-class.” The selected participants are among more than 150 arts professionals who are vying for a $1 million prize. The 2019 prize ceremony will take place at the New York City Ballet Theater on January 23.\n\n\nThe City of San Antonio plans to spend $2.5 million on the removal of more than one hundred Confederate monuments. According to the New York Times, the move was made in conjunction with the city’s legal battle with the heirs of a man who was murdered by a white supremacist in Charlottesville, Virginia, in August.The city’s city council voted unanimously to remove forty-seven statues of Confederate figures and to place them in private hands, but a 48-minute protest at City Hall on Friday marked the first time that activists unfurled a full-scale flag-draped wagon rally, as the city did on Saturday. The action was organized in response to a statement Texas Governor Greg Abbott made the day of the deadly rally, in which he called for the removal of Confederate monuments and for the state to \"sell its soul to the highest bidder.\"On", "The next Biennial should take place in 2017, with the premise that the design of the-art exhibition should be affected by the exhibition, not the other way around.”As a matter of procedure, the museum has adopted a calendar year-round programming model in which almost all exhibitions are presented in their entirety, with the exception of certain events for which the museum has deferred the theme. Since the exhibition usually opens with a retrospective of the artist’s work (usually at the end of the year) and closes with a collection show of some of the artist’s larger works (usually immediately after the exhibition).The work of Guggenheim- and Rubell-designed works are often presented with the artist’s name and a description of the work in a number of different formats, including framed drawings, paintings, sculptures, and prints. In the past, the museum has also presented a selection of Guggenheim’s works with the artist’s name and a description of the collection.The biennial will be notable for its first-ever Aldrich Kane-designed exhibition, “The Human Race” (2019), which has yet to be announced. The biennial will also be the first dedicated to the work", "The next Biennial should be held in 2022. To accommodate the biennial, the Cultural Centre, which was constructed in 1969, has drawn up a new architectural and design scheme that will allow the exhibition to open on the fourth floor of the building, as the venue for the first time. The building will also be transformed in order to make way for a new exhibition space, a public gathering space, and a public courtyard.\n\n\nCharles and Lois Lowry, the parents of the late American painter Jack and Lois Lowry, have announced the creation of a new $25,000 scholarship to support the art of the British Isles. The fund was established in honor of Jack and Lois Lowry, who were celebrated artists whose work spans from “home, the arts, the environment, and nature” to “life, death, and the movements of the stars.”The Fund will be based in the Lowry Gallery in New York and will draw from Jack and Lois Lowry’s personal collections. The scholarship fund will be awarded in the form of a gift.The Lowry Art Museum in Toronto will create an additional $250,000 in support of the work of the Lowry Children’s Museum in Vancouver. The institution will allocate $250,000 to", "The next Biennial should focus on the ideas of an organic form and the materiality of technology and the materiality of life. We have to be more sensitive to the materiality of our surroundings. This means that the biennial should focus on the material and materiality of technology and the materiality of life. In the future, it will mean more opportunities to respond to culture and life in an organic way.”The 2018 edition was marked by an exhibition featuring works by thirty-six artists, including Kiki Smith, Bob Demian, Kamiar Al-Mansour, Kayodeel Al-Mansour, and Sue Williams. The 2019 edition of the event will mark its thirteenth anniversary.\n\n\nThe Tazreen Art Summit is returning to New Delhi this month for its fourth edition, which will be staged on March 31 and will run for four days. Organizers have announced details of the event in a statement, which was shared by the Tazreen Foundation, the Agra Art Campaign, and the Art Development Group. The event will focus on issues such as community-based art, cultural heritage preservation, and the environment and will feature some twenty-nine artists. “The theme this year is the environment and", "The next Biennial should take place in 2020. The 2019 event, “Sitting in the Light,” featured the work of more than sixty artists, including Anthony Mullic, Anthony Salerno, and a group that included Jacob Rathbone, Michael Stipe, and Haim Steinbach. Mullic, a Los Angeles native, and Steinbach, a Berlin-based painter, will be honored at the event, which will be held in the city of Künstler-Stiftung Hanau.\n\n\nThe New Museum in New York has revealed that the next edition of its “Art of the Party” will feature works by twenty-seven artists, including Jason Shiga, Adrienne Atget, Yinka Shonibare, and Sinthujan Varatharajah, among others from the United States, Europe, and Asia. The exhibition was set to kick off at the New Museum on March 28 and run until November 22, 2020.Curated by Jason Shiga, Adrienne Atget, and Sinthujan Varatharajah, the exhibition will highlight the work of American artists, including Barbara Barlow, Hank Williams, Terence McKenna,", "The next Biennial should begin with a series of exhibitions by artists whose work addresses contemporary issues such as climate change, migration, and the urban environment. The exhibition could also be a platform for the United States to engage with Mexico City’s urban landscape, a topic that has been neglected in the US’s formal exhibitions.The theme of the 2019 edition of the Biennial, “Dissolvement,” is a direct reflection of the theme of the previous edition. The exhibition will feature a mix of contemporary artists whose work addresses issues such as the dissolution of the family, the city, and history, as well as works that explore time and the nature of the present.Exhibition organizers cite the need to have a “real presence” in Mexico City as a reason for the postponement of the event. The museum’s director, Agustín Pérez-Otolíns, said: “We will continue to work with our partners to make the 2020 edition a success. Fully aware of the critical role Mexico plays in the global fight against climate change, we will continue to advocate for a change of heart from the US government and the Mexican government.”\n\n\nThe major art institution in Buenos Aires", "The next Biennial should take place in 2021. \n\n\nThe Estate of Jack Bruce, the legendary British painter best known for his body of work comprising more than 2,500 photographs that bear his name, has named Russian artist Andrey Zamyatin as its next director. Bruce and Zamyatin were longtime collaborators who painted together frequently and in various media. Their work has been exhibited at the Museum of Modern Art and the Museum of Modern Art (MoMA), New York, and at the Venice Biennale in 2009. The auction house is currently bidding for artist Leonardo DiCaprio’s portrait The Last Days of the Earth, a haunting, highly detailed twelve-by-eight-foot image that depicts a series of landscapes and a group of people in a vast forest. DiCaprio recently donated $10 million to the project.“We are thrilled to welcome Andrey to the family,” said Mary Ellen Bauman, director of the Mary Ellen Bauman Foundation. “His extraordinary talent, vision, and ability to bring together artists and their projects will be an enormous asset to the auction house. His work has the potential to bring significant new attention to the legacy of Bruce.”\n\n\nThe New York City Department of Cultural", "The next Biennial should focus on the trans-disciplinary research and scholarship that was pursued in the most recent iteration of the festival and on the challenges that remain for the future edition. The theme of this year’s edition, “Minimal Politics,” is “Bidriss,” a term coined by French artist Henri-Denédre. The exhibition will feature eight works by twenty-four artists of different nationalities, including Anif Bichat, Sébastien Bichat, Doina Bichat, Alejandro Cesarco, María del Carmen Fernández, Gabriel García Márquez, Laura Owens, and Cécile René, which will open in April.The 2017 Biennial was staged in the city of Casablanca in the south of the country that is home to one of the world’s major art centers. The Biennial was also supported by the Guggenheim and the Metropolitan Museum of Art in New York and was curated by Markus Lütjai.\n\n\nThe National Museum of Fine Arts in Washington, DC, will begin a $250 million renovation and expansion project that will make the institution “hundreds of years", "The next Biennial should be held in 2021.\n\n\nThe Royal Academy of Arts (RA) in London has launched a new digital platform that will allow visitors to the institution from July to September to see more biennial works by artists of all ages and across all disciplines. The platform, called the Biennial Experience, was created by the RAA and will allow visitors to the academy biennials to see the works of forty artists from the institution’s collection and explore how they have impacted their own practice.The platform was created through a partnership between the RAA and Vivaldi Gallery, which has a space in the RAA’s new Building E, the RA’s new venue for contemporary art. The RAA partnered with Vivaldi to create an immersive experience for the biennial in March 2019, with the aim of encouraging new and younger artists to explore the RAA’s collection and the museum.The platform launched on August 31 and will remain live until September 1. Visitors will be able to specify which works they want to see and can choose from a variety of artists to see. Visitors will be able to visit the Biennial Experience from the RAA, the RA, or both locations at once. The Biennial Experience", "The next Biennial should be held at the Museo de Arte Contemporáneo, in Madrid, in 2022, and follow a five-year cycle. \n\nAdvertisement - Continue Reading Below\n\nAdvertisement - Continue Reading Below\n\nIn the early hours of this morning, the British Museum in London confirmed that it is preparing to welcome visitors back from a fourteen-month closure due to the coronavirus. The institution is currently closed to the public and has been since March 23—the day the pandemic began.The museum announced that, following a review of its network of galleries and the institution’s collection, it is reopening. “The review of our galleries and our collection has shown that we need to do more, more, more, more,” director Maria Balshaw said in a statement. “Since we have been closed while our teams work on the complex, we have been working to get as much work done as possible. Today we can announce that we’re going back to the drawing board and planning our next exhibition.”While the British Museum, which recently underwent a major expansion, is planning to reopen in March 2021, it has yet to determine when the public will be able to", "The next Biennial should be held in 2020, according to the organizers. “We are very excited by the prospect of the Aichi Triennale of Architecture and Design, which is scheduled for March 2020. We hope that the new biennial, on behalf of the Aichi Triennale Committee and the Aichi Triennale, will draw together all the elements of the Aichi Triennale and enrich our understanding of its history, aesthetic and creative activities, and bring them to life in the contemporary city.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Whitney Museum of American Art (MoCA) director Peter Blum as interim director and CEO. Blum replaces David Winton, who has served as MoCA’s interim director of education and public programs since October 2019. Blum will take up his post in the interim while the museum re-examines its internal structure and its future plans.“We are deeply grateful to David, Lynne, and the entire staff of MoCA for their dedication and dedication in their successful transition to this new role,” said Whitney interim director Krista Bianchi. “We are confident that Peter will continue to engage with the museum’s", "The next Biennial should arrive in 2023, according to the LA Times. The 2020 edition, titled After Earth, will feature the first work by the Norwegian-born artist and her husband, Lars Frode, who were commissioned to create a new type of space called a polynomial habitat, or a dome in the shape of a planet, that will be ten thousand feet tall and contain ten thousand wind turbines.The institution is planning to transform 115 acres of Sydenham Common into a new cultural destination, which will sit atop the nearby Sydenham Stadium and will comprise an amphitheater, an auditorium, a library, a restaurant, and a conference facility. The new venue will also include a rooftop terrace that will offer 360-degree views of the Olympic Park and the surrounding area.The architecture of the new venue is inspired by the site of the prehistoric site of the Sundance Film Festival, which was dedicated to the film and television series Gladiator. Along with the new film-making space, the Biennial will also include a new garden and a renovated garden.A selection of thirty works, including works by Diane Arbus, Robert Irwin, Gneiss Garske, David Salle, and Robert Irwin, will be", "The next Biennial should be held in September 2021. The biennial will highlight the work of thirty-two artists whose work has been published in the last five years. Among the artists chosen for the prize are J. Paul Getty, Anna Atkins, Amy Sherald, Diane Arbus, and Vincent van Gogh. The first prize winners and the first recipients were Jeff Koons and Nari Ward.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it will soon be overhauling the way it assesses the rehabilitation needs of cultural artifacts. In a move that has the potential to make a world of difference, the DCLA will now require that museums consult with experts and engage in a public-commentation period before deciding whether to sell or donate the works—a change that will also apply to the temporary exhibitions organized under the city’s Creative Industries program.“This is an important step toward advancing the city’s goal of fostering and providing resources for arts and cultural organizations in the city, and it is a step toward ensuring that NYC’s cultural heritage is maintained and enjoyed for generations to come,” said DMA director Paul C. Ha. “We are grateful to", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) announced today that it will organize the twenty-fifth edition of the Brooklyn Museum’s “Microscope at Home” in 2020. The exhibition, which will take place in conjunction with the museum’s upcoming exhibition “Microscope: A Contemporary History,” will take up the history of micro-scale art and will examine the history and current state of micro-projections, holograms, and virtual reality. It will also be an overview of the history of modern art, with a particular focus on twentieth-century work.The exhibition will be divided into three core stories: the revival of the artist-built, the rise of the direct-to-consumer, and the history of micro-art. The fourth section of the event will focus on the impact of the new technologies on the museum, with a particular focus on virtual objects. The fifth section will be devoted to the new medium of virtual reality, which will explore the potential and limitations of the medium.The twenty-fifth Biennial will be held at MoCA from March 23 through March 25, 2021. The exhibition will be presented by the museum at various locations throughout the city", "The next Biennial should take place in 2020, and will mark the 30th anniversary of the art movement. More information about the biennial can be found on the artforum’s website.\n\nTwenty-six artists have been chosen to participate in the 2020 edition of the Turner Prize, which honors excellence in visual arts. Four of the artists are returning to the prize, and four are new to the biennial. The biennial’s design, which is inspired by the country in which the works are based, was created by the contemporary artist Marks & Spencer and will be held at the Turner Prize in London from February 20 to February 23, 2020.The future of the prize is uncertain after the Royal Shakespeare Company announced that it will not be staging the production of King Lear in the United Kingdom next month. The decision was made after a UK government-backed review of the production, which will run from March 5 to March 9. The review found that King Lear will not be an effective performance, and that the play lacks the necessary dramatic impact.The announcement follows a wave of resignations following the Royal Shakespeare Company’s decision to remove the play from the tour next month due to the newly discovered health dangers", "The next Biennial should be held sometime in 2021. In the meantime, the museum will continue to host several short exhibitions and various events, including an exhibition dedicated to the life and work of artist Jan and his work, “From the Fall/To the Spring,” and “Joslyn: The Art of the Disguise.”\n\n\nBillionaire collector Pierre Prouvé, who inked an unprecedented $7.5 billion deal with the Chengdu Contemporary Art Museum in China last year, has pledged $50 million in support of a new initiative that will allow museums within the city of Guilin to create new works. The $100 million initiative, dubbed the 'Prouvé Program,” will also aim to encourage the exhibition of art from the Prouvé Collection, which comprises works by Prouvé, his sons Pierre and Jean-Pierre, and a number of other collectors around the world.The announcement of the initiative comes as part of Prouvé’s inaugural engagement with the city of Guilin, a UNESCO World Heritage site in the mountains of Sichuan, China, and was made on the occasion of the 25th anniversary of the two-hundred-", "The next Biennial should focus on the canvas of memory and the limits of what is known and what is conceived, and on the temporality of memory and the temporality of the self. It should also reflect the ethical, political, and philosophical concerns of the country, and the work of the artist itself.”“I have long been an admirer of Allen’s work, and of his ability to engage deeply with the human spirit,” Christopher Schwarz, the curator of the biennial, said in a statement. “In listening to him talk about grief, it is easy to realize that he is a gifted and sensitive conversationalist, a writer of lyrical poetry, a sculptor of sculpture, and a composer, all at once. His work is full of humor, with a tragic and affecting sense of humor.”Born in New York City in 1936, Allen moved to the small town of Cherry Hill, New Jersey, after watching his father move to Pennsylvania to start a family. In the 1960s, he was based in New York, where he studied art at the School of the Art Institute of Chicago, where he met his wife, Jean-Paul; they had three children. Allen went on to study at the", "The next Biennial should be held in 2019.”The Pérez Art Museum Miami, which was launched in 2017 to house the collection of the late master José País, has also received a $500,000 gift from the late Carlos Cooley. Cooley, who passed away in September 2018, was a managing director and president of the New York–based investment firm Apollo Global Management who was involved in a major restructuring of the institution in 2008. The decision to sell the collection led to the reorganization of the museum, which relocated to a new space in downtown Miami-Dade County. The collection is now housed in the Pérez Art Museum Miami, which opened on January 18, 2019, and is undergoing a $250 million expansion, which was completed in December 2020.The Pérez Art Museum Miami’s new home, the Pérez Museum of Art, will open on January 22, 2020, and will host its first exhibition, “Rafael Viñoly: The Rave,” on January 26. Its inaugural event will be “Carlos Cooley: The Rave” in January 2021. The Pérez Museum of Art will then celebrate its thirtieth anniversary with a", "The next Biennial should be held in 2020, with the new date to be announced in the spring of 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it will no longer use the word “modern” in its name, moving its new exhibition “The Future Is Present: From Sculpture to Art” from the museum’s current location in downtown Manhattan to the Pérez Art Museum in Mexico City. The show, which follows the Fructivus series, a series of modernist works on paper, will present four new works by Swiss artist Herbert Singer\u0097New Perspectives on Sculpture, The Sculpture Show: Sculpture and the Metal, and The Sculpture of Modern Life.In a statement, MoMA said: “This year marks the centenary of the founding of the museum and we are thrilled to present a series of new works by Herbert Singer\u0097Singer’s Four Modernities, Simon Rich’s The Present Moment, The Present Life, and Paul Gauguin” Singer’s work will be included in MoMA’s reopening exhibition “Away From the Happenings of", "The next Biennial should launch in the spring of 2021 and will take place in the former CNEA building in the center of Paris, where the museum will be located for the next two decades. Its first exhibition of the twenty-first century will be “Museums in Transition: New Art from a Different Era,” curated by the French curator Auguste Rochat.“The Biennial is one of the few places in the world with a national platform that is oriented towards contemporary art,” said Anne-Marie Nyssen, director of the Biennial Foundation. “It is an important project for France, and it offers the country a unique opportunity to create an example for future generations, by developing a new generation of cultural producers when it goes to the museum.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) is revamping its existing $9 million cultural-impact bond program to ensure that future investments in cultural arts, design, and performance are not only supported but also tied to real-world results. The plan was made in response to a $10 billion funding shortfall created by the coronavirus pandemic, which has impeded the construction of new buildings and has resulted in a drop in", "The next Biennial should be held at least once every two years. The upcoming exhibition will focus on the work of the late artist and critic Hiroshi Taniguchi. In a recent review of the exhibition, Nara Okamoto wrote: “Taniguchi, whose long-standing interest in materials and mass media led him to become a key player in the conceptual development of the 1990s, is at the forefront of the new story of the automobile, which will be a vehicle for affective and political activism. The exhibition will take up the theme, ‘automatization,’ and examine the ways in which technology has altered the course of history.”The next exhibition will be curated by the Italian architect, urban designer, and urban theorist Roberto Cicutto and will be held at the Museum of Art in Florence. Curated by Luca Cipolletta and Mirko Cipolletta, a panel of thirteen artists, including Agnes Martin, Maja Rönnsa, and Jann Marden, will include works by the seven finalists of the 2020 Pirelli World Automotive Exhibition. The exhibition will take place at the Palazzo Ferraris in Rome from September 22 to September 26, 2020.", "The next Biennial should be staged in the autumn of 2022. Announced last week, the second iteration of the exhibition will feature work by thirty-seven artists, including Alexander Calder, Adam Dallen, Alex Hudson, Anthony Giddens, Christopher Wool, and Sara Jane, who are represented by the artist-run studio Penthouse, which has housed them since 1975. The announcement sparked immediate criticism from those who criticized the exhibition’s technicalities and its solution. “It’s not really a symposium,” Priya Verma, an artist-in-residence at the Centre for the Visual Arts in Mumbai, told the Los Angeles Times. “It’s more of a platform, and a way for the artists to collect their work, to address this issue of our time, and to communicate with others in the art world.” When Artforum asked the workshop organizers why they had decided to mount the event, they said that the event was not meant to be prescriptive but to engage with the questions of the year. The question of what the future holds for cultural institutions and their collections has been a theme of the 2019 edition", "The next Biennial should take place in 2020 and the six-year-long run will conclude in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Scott M. Stevenson as its next executive director. Stevenson will assume his post in June and will lead the institution through a transition that would involve the reorganization of its various divisions.“We are confident that Scott will benefit from our new leadership structure, which will focus on developing new and innovative ways to advocate for more access to art, especially in underserved communities,” said Michael Govan, director of the Metropolitan Museum of Art. “We are also confident that the new leadership team will expand MoMA’s public and private partnerships with artists in ways that benefit our collection and the mission of the museum.”Stevenson will assume his post from curator and managing director Mark B. Cohen, who has been working at the museum for nearly twenty years and will begin his tenure in June. During his tenure at the institution, Stevenson has organized more than twenty-two exhibitions, including the first-ever “Theater of Operations: The Gulf Wars” (2019), “Affections from the American Southwest,” (2018), and �", "The next Biennial should be set in 2022 and will focus on “aquatic and environmental issues.” The entry-level exhibition will feature works by thirty-eight artists and will be curated by Jean-Michel Basquiat’s son, Ruben. The grand prize, which is $75,000, will be given by the artist Jack Christo and will be presented by the artist's daughter, Jessica.The festival, which was founded in 2018 by the Centro de Artes Plásticas in Madrid and the Spanish Ministry of Culture, will also introduce a new $3,000 prize for the best exhibition from Spain and Mexico. The prize will be awarded by the director of the firm, Julián Martinez-Mañosa.\n\n\nThe Chicago-based nonprofit Art Advocacy Project (CAP) announced today that it will no longer recognize the British artist Gere Kavanaugh, who was awarded the National Book Award for his artwork The Black Box, in December 2018. The organization said it is suspending proceedings in light of an investigation into a series of incidents involving Kavanaugh that began as a result of a labor dispute with a fellow worker in a Tata Steel plant in Leicester, England. “These events take place in a", "The next Biennial should take place in 2020. The 2019 event, titled “NIRIN,” was organized by the Venice Biennale and was presented by the Los Angeles–based curator and curator-designer Anne-Marie Preciado. The museum will stage its first exhibition of work by contemporary artists in 2020.\n\n\nThe New Museum in New York has received an unexpected gift of thirty-six works by thirty-one artists in the collection of the late collector and philanthropist Edward Albee. The donation includes works by artists such as Alex Katz, David Brin, and Harry Callahan, and is being made in memory of the late collector and avid arts patron.“The collection has been a windfall for Edward Albee and his family for more than thirty years,” said New Museum director Adam D. Weinberg. “The gift is a tribute to the extraordinary talent of the talented collection, which includes works by many extraordinary artists. The collection is an example of the extraordinary generosity of collector Edward Albee. He was a devoted philanthropist and a devoted champion of artists, and his impact on the art world was wide and lasting.”Albee was born in New York City in 1941. He began collecting", "The next Biennial should be an open-air exhibition in 2022, the festival said. The five-day event will take place at the Museum of Contemporary Art (MoCA), which is currently undergoing a $650 million expansion and will host the inaugural event in 2019. The opening of the biennial will take place in January 2020.\n\n\nNew York’s Metropolitan Museum of Art (MoCA) has divested from Michael Kors, the German brand that was recently embroiled in a controversy over allegations of racial discrimination in its advertising for its new Prada collection. The decision has been made in conjunction with the museum’s decision to remove the pieces from sale, which was halted last month due to the coronavirus.According to the New York Times, the decision to part ways with the French luxury goods company was made over allegations that it discriminated against African Americans in its advertising for the new Prada collection. While Kors initially denied that it discriminated against its African American clientele by offering them designer suits when it was still advertising for the collection, the company backed off of the claims after it was asked to pay $5 million to settle a lawsuit brought by a man who alleged Kors had denied him a commission for a fashion show with the brand.", "The next Biennial should be held in 2024.\n\n\nBillionaire real estate developer Donald Trump has named his new business advisor, Brad Parscale, who will be responsible for helping the new president shape the future course of the Trump Organization. The appointment comes as the president embarks on a major renovation of the White House, including the construction of a large public art project and the creation of a new public area in the East Wing.“Mr. Trump loves big ideas, and I’m sure he’ll help make the Trump name recognizable to the world,” said Parscale, a conservative arts strategist and businessman who has funded the Trump campaigns and serves as a senior adviser to Trump. “The building of a new American tradition, a new cultural monument, a new public gathering place, a new museum, a new monument, a new garden.”Trump Tower in Manhattan has been undergoing a $1.6 billion expansion, completed last month, and is now a major project with a grand opening planned for 2021. The building will also be transformed into a luxury hotel and will host several hundred thousand visitors during its first year. The project was spearheaded by Trump-connected Israeli real estate developer Michael Bloomberg, who also outlined plans to build", "The next Biennial should be in the fall of 2020. The biennial will follow the theme “The Future of Work” and will take place at the Museo de Cultura y Cultura in Madrid. The biennial will also consist of a series of exhibition-related activities.“The future of work is a critical issue for fostering new and innovative approaches to creativity,” said José Luis Campos, the president of the Spanish Republic. “The Biennial will serve as a kind of laboratory, where artists can be exposed to the new and different ways in which work is practiced in modern life and at the same time access new ideas and new perspectives.”\n\n\nThe Egyptian Museum in Cairo has launched a significant fundraising campaign to upgrade its facility, which was badly damaged by a massive explosion in the museum in September, and is now asking the public for its support in ensuring that it does not collapse. The Al-Azhar Centre for Islamic Studies in the city of Ismailia, which was founded by architect Hamdeen Sabah in 1989, has received $580,000 from the Egyptian Ministry of Antiquities and Museums, and $300,000 from the Ministry of Culture. The Sharuya Foundation, which is supporting the", "The next Biennial should be held in 2020.\n\nThe exhibition, titled “Theater of Operations: Gulf Wars 1991–2011,” will showcase 70 works by thirty-four artists from twenty-six countries. The works are grouped into fourteen themes: the aftermath of the Gulf Wars, the threat posed by climate change, the conflicts in the Middle East, and the crises posed by the terrorist threat. The exhibition will also include the first online viewing of a work, a collaborative project between director Matthias Kuepper and artist Randa El Sebad.“Theater of Operations’s exploration of the human condition leads to our new condition, which is a topic we explored extensively in the film ‘The Ride,’” Kuepper said in a statement. “It is a matter of challenging the temporal target of the first half of the exhibition and creating a new stage for the second half, which is essential for our civic life and for the future of art.”The biennial was established by the German government in order to encourage the “unseen” exhibition, which is currently held at the Museum Glinka in Cologne. German artist Dieter Strachey, who has been involved with the exhibition", "The next Biennial should be held in 2020, according to a statement by the Swiss director, Marta Ziska. The exhibition will be hosted at the same venue as the exhibition of the same name in 2015. The new exhibition will be uniquely designed by the Swiss architect Daniel Hulsmans, who designed the first exhibition of work by Fellini in Hawaii in March 2020. The next iteration of the exhibition will feature works by a select group of contemporary artists, including Natsuki Cornejo, Ana Mendieta, and Mihai Csokenty. In addition to the biennial, the exhibition will also host a new interactive program for 12,500 visitors. The newly redesigned pavilion will be inaugurated by a special release of new material by artist Holger Herin (Das Biennál) and will be inaugurated by a presentation of a new selection of work by artist RÚVF, a collaboration between Daniel Hulsmans and Jorge Luis Borges. The biennial will also introduce new works by artists whose work is currently on view. The show will be followed by a special exhibition of work by artist Kiki Smith and a new artist-in-residence program. The second", "The next Biennial should focus on the history of the museum’s collection and the development of its collection planning process, which has been beset by delays due to the Covid-19 pandemic.“The current exhibition, ‘Twilight,’ is a snapshot in time,” the committee said. “The project will further consider how best to present the collection, and what additional activities and programming can be added to enhance the exhibition.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed two new members to its board of trustees: Nicolas Ghesquière and Mihai Ghesquière. The news comes after a year of trusteeship that saw the group of contemporary art-world figures collaborate with the institution to advance the art of today and shape the museum’s curatorial, educational, and conservation initiatives in the coming years.“The board was formed by the board of directors of the Museum of Modern Art, which comprises twenty-four members, in order to facilitate and to move the Museum of Modern Art forward on a more than twenty-year cycle,” said Michael Govan, chair of the board. “Nicolas Ghesquière", "The next Biennial should be held at the Museum of Fine Arts (MFA), Los Angeles, in 2021. A selection of the artist’s works will be staged in the exhibition “Away from Life.” [See the full list of participating artists here.]\n\n\nThe National Gallery of Canada announced today that its collection of paintings by Ralph Ellison will soon feature a new exhibition, “The Truth of Painting,” that will explore the work of the twentieth-century American painter Robert Irwin. The exhibition is slated to open at the gallery in April.Ellison’s humanistic and rural landscapes are often framed as allegories of American exceptionalism and are frequently linked to ideas of the American dream, such as in the works of his wife, Virginia, who is often known by her middle name, and his son, C.J., who often depicts his mother as a woman in her prime, a woman who painted the American dream.The show will include three new paintings, which will be based on illustrations by the artist, and will also feature a selection of pieces that have never been on view in the gallery, including photographs, drawings, and prints by Cindy Sherman, John Turner, Richard Serra, and Iris Murdoch.", "The next Biennial should take place in the spring of 2021. \n\n\nThe newly reopened Alexandre Breton Museum in Paris is planning to open a newly restored, seventy-one-foot-long replica of the ancient city of Palmyra. The museum will be located in the city of Vladimir, in northwestern Syria, and will be inaugurated by a program of public artworks and performances.The new museum will be inaugurated with the exhibition “Arab Spring: From the Deserts of the South to the Mountains of the West,” which will highlight the contributions of artists such as Rafael Nadal, Tarek Atoui, and Ahmad Saeed, and will encourage visitors to visit Arab countries. The exhibition is scheduled to run until March 20.The reconstruction project of the city of Palmyra, which was begun by the French Ministry of Culture in 2017, was led by the French architect Alessandro Pappalardo. He has since raised more than $7 million for the restoration project. “I’m very proud to be able to open this new museum next week, after the closing of the exhibition 'Arab Spring: From the Deserts of the South to the Mountains of the West,”” Bre", "The next Biennial should be held within two years, and the dates should be between 2021 and 2024. \n\n\nThe Museum of the Moving Image (MoMI) in Chicago is moving seven of its works from its grounds to the new Harris Art Museum at the University of Pennsylvania. The museum’s director, Nicholas Cullinan, said the move will allow the institution to “connect more deeply with the people we serve.” The works will be added to the institution’s collection.“The move marries contemporary and historic approaches in one museum, and represents an extension of the museum’s mission to educate and engage with the people and ideas of our time,” Cullinan said in a statement.The works, which were placed in storage after the institution moved them to the museum in 2010, were acquired in 2015 by Paul Mpagi Sepuya and Zoran Stefan in partnership with the David Rockefeller Foundation for the Arts. The Rockefeller Foundation provided $50 million for the acquisition of the works in 2020.The works were founded by the late American artist Naima J. Mpagi Sepuya, who was based in New York for most of her life, and her husband, the late Russian", "The next Biennial should be held in 2021, but the exact date will be decided by the council. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has adopted a new visual arts master plan that will prioritize community engagement and the preservation of local heritage through the art of contemporary art. The plan, titled 'Unseen: A Comprehensive Master Plan for the Museums’ Future,” is dated March 3 and outlines a series of actions that will engage with local communities, including by connecting them with museum collections and exhibitions, developing programming, and securing the public’s trust.“MoCA will continue to work collaboratively with local, state, and federal governments on a broad and deep platform of art and culture to shape the future,” said David Halperin, director of MoCA. “This is an ambitious undertaking for one of the country’s oldest and most esteemed cultural institutions, but we believe this master plan will serve as a model for how museums can live and work together in harmony with one another.” The full document is available in full at the museum’s website.According to MoCA, the plan, which was developed in partnership with the Los Angeles–based architecture and", "The next Biennial should be held in Seoul, where the first exhibition was organized in 2016, in 2022, and in 2023, but these dates have yet to be confirmed. \n\n\nThe San Francisco Museum of Modern Art (SFMoMA), which has been closed since March due to the Covid-19 pandemic, has appointed Jaye Rhee as its next director. Rhee will be responsible for overseeing the museum’s arts program, which includes the Center for Cute Art, the Graduate Center, and the Transamerican, and will take up her new post in October.Rhee comes to the institution from the Martha Graham Foundation, where she has served as director since July 2018. During her tenure at the foundation, Rhee oversaw the acquisition of more than twenty works by artists, including Robert Irwin, Louise Nevelson, and Emily Dickinson. In recognition of her service, Rhee received an honorary doctorate. The Helen Frankenthaler Prize, presented last year, was awarded in recognition of her achievements in art.“Jaye Rhee was elected to our board of trustees by a distinguished group of artists and arts professionals in 2018; she has established herself as an important leader in the field of female-centered arts leadership,", "The next Biennial should take place in 2021.\n\n\nThe MCAF Museum in Milan has announced that it is working with the Uffizi Gallery in Florence to create an exhibition of the work of Italian postwar and postwar artists in 2021, and is also planning a retrospective of Mary de Villiers. The institution hopes to put together the first exhibition dedicated to the works of the late artist in 2020.Curated by Simone Tichela and featuring works by fifteen artists, including Lucia Dallò, Silvia Bicchier, Adriana Catellani, and Vigo Tichela, the exhibition will open on March 11. The 26th edition of the MCAF Biennial will be held at the Milan Museo del Più in 2021.\n\n\nThe Metropolitan Museum of Art in New York has appointed Mary Tatasci as its next director. She comes to the institution from the Sotheby’s auction house, where she has served as director of sales since 2014. She succeeds Thomas H. Schloss, who was appointed the next director in March.“Mary Tatasci’s appointment represents a moment of great change for the Met, one that aims to redefine the role of an", "The next Biennial should take place in 2020 and will include the first solo exhibitions of photographs and sculptures by women artists. Inaugurating the pavilion will be a group show of works by Indigenous and non-Indigenous artists on January 14, 2021. “We are tremendously excited to be able to present the first exhibition of works by Indigenous artists in the UK since 2018,” said Louise France, chair of the board of trustees of the biennial and a curator at the Museum of Contemporary Art, London. “This exhibition will celebrate the rich history of art by introducing the world to new artists and their work. The exhibition will also provide an opportunity to engage with the BIP, focusing on the history of photography and the history of photography-for-video. An Indigenous perspective will also be reflected in the composition of the exhibition, which will be inspired by the work of the artist Hairy D’s daughter, Kiki, in order to reflect the emotional and spiritual impact and history of Indigenous art. The exhibition will also engage with themes of memory, culture and memory, as well as the history of photography within the context of contemporary art.”The selection from the current exhibition program will be curated by Richard Mayhew, the", "The next Biennial should be held in 2021. Its next edition should take up the theme Art & Memory: The Dilemmas of the Present.\n\n\nThe Walker Art Center in Minneapolis has added five new artists to its board of trustees: Amara Bouma, Lourdes Alcaraz, Faiz Shakir, and Asma Alwar. Bouma is a member of the exhibition-making collective Genius, which is affiliated with Helsinki’s Stora Artikos and was established in 2000, and Alcaraz, a veteran artist whose work explores the immensity of narrative, is a cofounder of the collective Gaia.Alwar, a former MacArthur fellow and Zimbabwe-based artist who has lived and worked in the United States since 2008, is a founding partner of the Minneapolis–based nonprofit Artspace Sanctuary and a professor at the University of Minnesota. He has written about his experiences in Creative Time, a nonprofit contemporary art center that he and his partners founded in 2008, and his work can be found in the collections of the Walker, the St. Paul Art Museum, and the Minneapolis Institute of Art. Their new board of trustees includes Ricardo Alonso-Hinds, cofounder and CEO", "The next Biennial should be held in the spring of 2021. \n\n\nThe US House of Representatives voted yesterday to establish a national museum of the American Latino dedicated to the history and culture of the Latinx and Latinx communities. Introduced by New York Democrat Carolyn Maloney, the bill for the $2.1 billion museum, which will sit on the National Mall, was approved on Monday and now goes to President Donald Trump for his signed approval. The museum would be a branch of the Smithsonian Institution in Washington, DC, and would organize programming that addresses the history and culture of Latinx and Latinx communities.The legislation authorizing the new museum was passed by a vote of 422-0. It now goes to the Senate, where it must be reconciled with a $2.2 trillion spending bill before the government can begin negotiating with its legislative branch. If it isn't by December 12, the government will shut down.“We are grateful to our Congressmen and Senators for voting to establish a Museum of the American Latino,” said Rep. Joaquin Castro, chairman of the Congressional Hispanic Caucus and the bill’s author. “This is a moment of great uncertainty for many Americans and it is our mission to ensure that this historic", "The next Biennial should be announced by May.\n\n\nThe International Council of Museums (ICA), which represents more than 700 museums across the world and oversees Museums United Kingdom (MU), announced today that Marc-Olivier Monier will be its next president and CEO. The move comes two months after Musee d’Arles, France’s largest arts organization, named Monier as its next president. “The choice of Marc-Olivier Monier is a sign of the growing unity and cohesion of the arts in France,” said Tim Maritz, president and CEO of the ICA. “He brings a wealth of experience, vision, and leadership to the ICA, and will be a critical partner to the ICA as it continues to grow and evolve.” Monier will take the helm of the ICA following its 2022 edition, which will take place in Algiers from January 29 to February 2, 2022. The future of the ICA is currently uncertain as France, France’s largest host of the Louvre, moves to ban the exhibition.\n\n\nThe Museum of Modern Art (MoMA) has reeled from a pand", "The next Biennial should take place in the spring of 2020. The 2019 iteration, for which the institution received $1.4 million from the city of Cambridge, was held at the Cambridge Art Museum; the museum’s director, Monica Higgs, called the event’s theme “unparalleled, unique, and wonderful.” The museum has awarded fifty-two grants to sixty-two artists thus far. The first round of grants came in April 2019, when the museum opened a new site-specific art room on the ground floor of the old building. Funding for the section came from the $474,981.95 Cambridge City Council grant for Cultural Excellence, which was awarded in 2017; the Commonwealth Fund for Arts, which is an arm of the Commonwealth Government; and the £166,500 grant from the city of Cambridge’s Global Arts Fund.The next round of grants will be awarded in March 2020. The next exhibition will be the first to be held in the new building—the museum is currently designing and building a new museum on the west side of the former Tate site—and will be staged at a date to be announced. The building will be completed in 2021 and will become a museum in the spring of", "The next Biennial should be held in the spring of 2021. “There has been far too little and no good in Art Basel,” Ho said. “I want to replace the current management of Art Basel with a team with a new vision for art and a new way to think about the art world.”  The biennial, which has been open since it first hosted the 2020 edition in December 2010, will return to the Palazzo San Martino, the Italian capital, for a second edition in October 2021.\n\nThe Holburne Museum in the Netherlands, which has been closed since April due to the coronavirus outbreak, will reopen in October 2021. The institution has said that it expects to have a full-time staff of twenty-four staff members by the beginning of the new year.The seventy-five-year-old museum had been planning to reopen in April after it completed a major renovation and expansion project that added a theater, a reading room, a karaoke area, and a café in March. It also added a new building with a restaurant and a library. The building, called the Rijksmuseum, is located in the eastern suburb of Amsterdam, and is expected to", "The next Biennial should be taken up in 2020. The exhibition was organized by Museum of Modern Art and will open in New York Harbor on the Hudson River in 2021. The biennial will include a number of new works by artists from the Biennial of African Art in Copenhagen and a new exhibition by the American artist Martha Graham.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has announced that it is planning to begin leasing out space in its new building, which is currently under construction, to the public in 2020. The institution estimates that it will generate more than $100 million in operating revenue from the program and that it is still evaluating the economic impact of allowing the museum to begin the closure. “We are excited to open this new chapter with the new exhibition and to introduce new works and experiences for our visitors,” said museum director Daniel H. Weiss. “The building will also play host to the first exhibition of the new collection, ‘Art in the Making: Moving Images,” which will be curated by Tamara Henderson.The institution also revealed that it is preparing to open a new, expanded media center that will include a library, a gallery, and other spaces for exhibitions and educational initiatives. The", "The next Biennial should be in February 2021. The project will be hosted at the Smithsonian’s National Museum of African Art (MMAD). The exhibition will feature contemporary art from Egypt, the Middle East, and South America as well as a selection of twentieth-century work from the Asian continent. “Themes such as the return of art to its origins, the promise of art to make others feel, and the need for art to transcend boundaries will be explored in this exhibition,” said Tracy Morgan, chair of the museum’s board of trustees.The full list of participating artists is as follows:Art Director and CuratorAdeline FayeAlberto AgustínAnouilal EldoretiAnouk El-KhouryAnwar El-Shaykhandrea LaulaniAnwar M. AlwanAndry AnagnosArashia BarackovaBertrand DelanaBenedict VirgiliBibiana MontemayorBianca CervoBianca RoldanBianca SuggathBianca TelloBianca VélezBianca ZlarOda OteroOpen GalleryBroad ArthouseHanna RoscoeHector Arroyo", "The next Biennial should take place in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has released the list of seventy-five artists who will participate in its next edition, titled “Feminine/After/Beyond: The Art of Self-Portraits” at the Metropolitan Museum of Art, from March 21 to March 23, 2020. Responding to a question posed by a visitor at the museum on May 16, 2020, MoMA director and CEO Daniel H. Weiss said the series is a response to the museum’s ongoing efforts to increase its presence in the city, which has seen a recent resurgence of activity. “We chose to make this work for two reasons\u0097to begin with a desire to begin a conversation about how the body and the body art can be understood as embodying and embodying the parts of life, and to eventually align with the body as a whole,” Weiss said. His comments about the work and the work of the women who created it have been edited for clarity and clarity of purpose. The seventy-five artists selected to participate in Feminine/After/Beyond’s first iteration include Amy Aniston, Frances Adams, Paula Cooper, L", "The next Biennial should have a diverse selection of works on display that reflect the San Francisco– and San Jose–based art community\u0097a moving target gallery should be able to show a work by a handful of artists in a few months time.”The redevelopment of the Museum of Modern Art in the arts district of West Los Angeles is currently underway, and the Museum of Modern Art in New York is expected to open in 2021. The Art Newspaper reports that work currently on display in the Biennial will be moved to the new museum in the fall of 2020.The newly renovated MNE Gallery in Manhattan will also welcome visitors via a new, redesigned building that will be inaugurated by two solo exhibitions: “Cryptograms,” which will feature works by artists such as Guy André, Osei, and Negev; and “Terrific Monster,” which will be on view through October. The work will be presented in the fall of 2024.The MNE Gallery will be inaugurated with two solo exhibitions: “Gillian Wearing” (2019–20) and “Reverse Vision: A Modern Art Museum,” (2019). The former will run from March 14–March 21, with the", "The next Biennial should be held in the Fall of 2020. Its organizer will be Shirley Craddock, the author of the new book, The Art of Body Art: Remaking the Body, the Body Art Museum, and the Body Art School (public library). “The project is not without precedent,” Craddock told the New York Times. “It has the potential to be ambitious, to be a true celebration of the body’s art and its history, to be inclusive, and to use the body’s own practices to critically re-conceptualize our relationship to the body.” Artforum has published a prominent art critic’s critique of the exhibition, Eleanor Critchley’s Artforum, which opened in London on October 21.Critchley, writing in the November 2012 issue of Artforum, calls the biennial “a grave misstep.” She argues that the contemporary art world—which has seen its average attendance fall by 3 percent since it began—is not in the best interest of the body. “The exhibition’s failure to address the themes of women’s health and, in so doing, the body itself", "The next Biennial should take place in 2021, with the date to be determined by the Board of Directors of the Museum of Contemporary Art in New York. The 2020 theme, “The Past, Present, and Future of Art,” will reportedly be a “prominent figure in art history” and will begin on September 13.The museum is currently working to renovate the building, which is currently home to the Art Institute of Chicago, the Institute of Contemporary Art, and the Museum of Modern Art. The current exhibition space, which was formerly the Turner Prize–winning gallery, the Benjamin H. Davis Center for Contemporary Art, and the Metropolitan Museum of Art, is slated to reopen in June of 2021.\n\n\nThe National Gallery in London will open its new £350 million European headquarters in a former steelworks in the city, in June 2020. The National Art Archive (NPA), which is housed in a former ironworks in a former steelworks, will also welcome visitors to the new branch, which will be located in a former steelworks, as part of a broader £200 million expansion of the National Maritime Museum. “We are thrilled to open our new National Gallery to the public in June 2020,” Elizabeth Carter", "The next Biennial should address issues of consent and representation, as well as the role of photography within a larger and more inclusive conversation about the history and future of photography.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles recently unveiled a new partnership with the artist-run nonprofit Open Arms. The new program, which will organize free events and activities with artists through the museum’s two locations—studios John Michael Kohler and John Banks, as well as with museums in Venice—will run throughout 2020.“This new partnership between MoCA and Open Arms began after we both shared a vision of building a better world around an artist’s work,” said MoCA director Deborah J. Rosendahl. “We are committed to supporting the creative practices of artists, artists building community, and artists who create narratives around the world.”Inaugurating the museum’s location in Venice—the former headquarters of the Italian luxury conglomerate Prada and the country’s fifth-largest art museum—the program will offer artists a chance to present their work at MoCA, which will then present the artist’s work at Open Arms’s studio at the Venice Biennale.", "The next Biennial should draw from the newly established symposia in Germany and France, which are currently preparing for their first fair in the city since 1893. The first exhibition in Berlin is scheduled to open on September 10, 2020.\n\n\nAustralian Contemporary Art (AAC) announced today that it is expanding its partnership with the American painter Harry A. Saltman, whose work is now in the collections of the Museum of Fine Arts, Los Angeles (MoFA), and the Hirshhorn Museum and Sculpture Garden in Washington, DC. The museum will now partner with Saltman’s family to form a new biennial. The museum will stage a retrospective of the artist’s work in Los Angeles in late 2021.The partnership between the museum and Saltman’s estate was launched after the artist was killed by a man named Aaron Miller in 1988. The crime was captured on video by a friend, and the following year, a symptom-detector called True Blood was released by the manufacturer of the device, the biennial was canceled. SALTMAN AND MUSEUM OF FINANCE New York: The Contemporary Art Museum in Downtown Manhattan will now present HARRY A. SALTMAN: The", "The next Biennial should be held in 2022, and the forty-eighth in twenty years. \n\n\nThe National Gallery in London has launched a three-year digital initiative to help frontline artists and designers struggling financially under the coronavirus pandemic. Called the BMA Crowdfunding, the initiative will offer free, monthly stipends to any artist who has made a significant artistic contribution to the UK in the last twelve months.The initiative was inspired by a New York–based arts organization, the BMA, which launched an online salon program in March 2019. The platform, called BMA Allure, gave digital artists a platform at which they could direct thousands of dollars toward their next project, with the promise of free studio time. The program has since been downloaded more than 108,000 times.The BMA Crowdfunding platform is being cofounded by British artist Polly Staple, who moved to the UK from London in 2010, and Italian designer Renata Collina. The project is being organized by London-based collective Nausea Collective, which is run by two women, Nadezhda Durov and Anna-Rosa De Elia. “We are thrilled to support the BMA Crowdfunding Initiative, which will help hundreds of artists", "The next Biennial should focus on a longer-term vision for the exhibition, which will open in 2021, and the biennial’s future. The theme “postcolonialism” will be adapted from a lecture given at the Department of the Arts, University College London (UCL), by Frances Kendall, a professor of art history at the University of Stirling.The announcement came two days after the French arts minister, Anne-Christine Montebourg, announced the start of a two-year commission to make the Mont Blanc National Museum in southern France—which has a permanent collection of more than 80,000 works by artists such as Pierre-Auguste Renoir, Edmond Malick, and Louise Bourgeois—more accessible to the public. The plan, which will be implemented over a twelve-month period, includes the construction of new galleries that will house the works, the restoration of the institution’s original facade, the renovation of the institution’s grounds, the preservation of its collections, and the placement of the works within the museum.The project, which was announced in December, will also involve the creation of one hundred temporary spaces to be used by the institution. In addition to the works, the Marrakech–based", "The next Biennial should create a platform for bringing together regional and global artists, scholars, and researchers, as well as a collection of local materials, to create an exhibition designed to serve as a platform for conversations about the importance of materials in the contemporary world.Two projects that will feature local materials from the Biennial, the Center for Contemporary Art (CCA), and the Museum of Contemporary Art (MoCA), are currently underway. The museum has commissioned Renzo Piano (Witten & Witten), the architect of the London 2012 Festival, to design the exhibition “Architecture: Contemporary Art,” which will run from March 17 to March 21, 2021. The work will be mounted in the museum’s new building, which is currently under construction, and will be inspired by the collection of Perrotin, the renowned Italian architect whose compact design—with its open-plan spaces and open-air terraces—gave rise to the Italian phrase, Antropología della Stampa (the Museum of Modern Art and the Architecture of Perrotin).The Italian firm will commission the work by the American artist Richard Serra, whose sculptural works explore materials and materials history, and will be the theme of the exhibition. The exhibition", "The next Biennial should be held in 2021.\n\n\nThe Fine Arts Museums (FAM) in London, the Pinchukh Gallery in Shanghai, and the National Gallery in New York will be overhauled by the Chinese government to make them more welcoming to Western art. The restructuring plans were announced by Culture and Tourism Minister Rishi Sunak in a speech at an assembly in Beijing on March 6.According to the New York Times, the government’s plan to overhaul the institution will involve converting more than one hundred existing buildings into residences for the museum, which is near the Great Hall of the Chinese National Museum, and would also see the building transformed into a cultural landmark. The renovation of the Museum of Modern Art (MoMA) is currently underway\u0097the institution recently celebrated its sixtieth anniversary\u0097and the Museum of Modern Art’s renovation of the Fête des Arts Modernes (FAM), a building at the heart of the museum, is scheduled to begin next year.The revamped museums will also boast of a new, larger entrance, a new café, and a larger public courtyard. The redesigned spaces will be hand-carved and the building will boast more than 1,500 square feet of exhibition space.", "The next Biennial should be a periodic series of shows that will advance the work of the artists who are currently working. This year’s edition will explore the role of the body in relation to the virtual world. “In order to adapt to the new realities created by the technology, the artists have chosen to re-experience the historical moment through the medium of videos,” the organizers said.\n\n\nThe Museum of the Fine Arts (MAFA) in Boston has appointed Dorota Miro as its first director. Miro comes to the institution from the Boston-based nonprofit organization Arts4Kids, which has worked in support of Boston’s arts community for more than a decade. She succeeds Anne-Marie Pudong, who retired in February 2019 after twenty-five years at the helm of the museum.“I’ve been involved in Boston for twenty-five years now and have been a volunteer at MAFA for ten of those years,” Miro said. “I’m honored to have been selected to succeed Anne-Marie Pudong and to continue to expand the museum’s work in the city’s cultural community.”Since Pudong’s departure", "The next Biennial should also consider the development of a new platform that will allow visitors to the exhibition to feel more connected to the work of the artists in the catalogue. It should also consider the possibility of creating an online version of the exhibition, where visitors can be confronted with the catalogue as well as the works represented in the exhibition. \n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of one of the rare works by Paul Gauguin’s most celebrated contemporary, the artist Max Beckmann. The gift, which was given to the institution by a collector in Paris, was made by a woman named Miriam Barthe, who had bought the work from the artist for $100 in 1992. The piece is a six-thousand-painting set on a canvas by the late Belgian painter Pascale Barozzi. “Max Beckmann: Painting in Space” was exhibited at the exhibition “Max Beckmann: Painting in Space” (2015–16) in Amsterdam and was included in “Max Beckmann: Painting in Art” (2017) at the Museum of Modern Art in New York and “Max Beckmann: Painting in Persuasion” (2017) at", "The next Biennial should take place in 2022.    Artforum has been working with the museum to advance its understanding of the contributions of the civil rights movement to the art that was created by African Americans in the US and has included the civil rights movement in numerous exhibitions. The Biennial will also be based in the museum’s existing special exhibitions; recognize the contributions of artists of African descent in the museum’s collection through the “In Memory of a Nation” series; and conduct public programming that provides a historical perspective on the museum’s collection, including the exhibition “Lost in History” (2019), “The Power of Symbol: Non-European Art in the Southern Appalachian Region” (2019), and “Shopfronts: Art and the Southern Black Experience” (2019).\n\n\nThe National Association of Theater Owners in the United States are suspending their campaign for more theater funding after the National Association of Theatre Owners (NATO) endorsed a $10.2 billion relief package for the industry on Thursday, March 19.“The next stage in the recovery plan will be to increase the Empowerment Finance and Empowerment Equity (EFE) fund by $2.", "The next Biennial should be held in the autumn of next year. The committee formed to investigate the possibility of the exhibition will consist of Marianne Lenoir, Ousana Bickel, and Paloma Otero. The commissioning committee will consist of Eli Y. Shilo, director of the Museum of Contemporary Art Chicago; Rory Mulligan, gallery owner, publisher, and curator; Cameron Rowland, director of the V&A; and Eugene Thompson, a curator and former director of the Terreform Gallery in London. The first exhibition, titled “Little Orpheus and the Minotaur,” will be on view in the fall of 2019. “This will be a great opportunity for our artists to reflect upon the past. We are thrilled to take the first steps towards the creation of a memorial space for the biennial,” said Shilo.\n\n\n\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced its representation of the work of artist-turned-performance artist Nancy Diehl, a self-taught artist whose expressive, often surrealistic sculptures combine a playful sensibility with a fierce commitment to social", "The next Biennial should take place in 2021.   Thenext will be held in the Fall of 2020. Seoul Biennale 2020 will be held in Osaka in October. The show will be hosted by Hiroko Hoshine, who is currently the artistic director of the Taipei Biennale. The show will feature a selection of works by sixty artists, including Wangechi Mutu, Sui-Lin Su, and Beth Anderson, and will present an exhibition of new works by forty artists in the Fall of 2020. The 2019 show in Seoul, titled “An Autumn Exhibition,” featured work by seventy artists, including Cao-Qiang Liu, Agustín Pérez-Pérez, and Hiroshi Hasegawa.  The exhibition was organized by the Seoul Biennale Foundation and the Seoul National Museum of Art. \n\n\nMariner Kemper, the chairman and CEO of the global cleaning and preservation company Western Digital, announced that he plans to sell more than 1,400 electronic devices in a deal valued at up to $30 billion. The news comes amid a global market downturn that has seen sales plunge as people scramble to cut the cord", "The next Biennial should be held in 2021. The institution will be inaugurated at the end of February. The biennial will be a reimagining of the museum.  The redesign will emphasize integration and collaboration between the museum and the city, focusing on urban development, design, and contemporary art, and will utilize social media and the museum’s galleries, exhibition spaces, and underground concourses. Contemporary art has historically been excluded from the Biennial, which was first hosted by Minneapolis in 1994, and the museum’s campaign to bring contemporary art to the city has been marked by controversy. The museum received $3.9 million from the Museum of Contemporary Art (MCA) in downtown Minneapolis and had to temporarily close in 2009, during the coronavirus pandemic. The redesign is part of a $55 million overhaul of the museum’s campus, which also included the construction of new galleries and an expansion of the existing spaces on the east side of the institution. The redesign will feature three separate exhibitions spaces, and will include the new Markos Quadrangle Theater and the Markos Auditorium, which will be located on the west side of the museum.The museum’s renovated", "The next Biennial should be held in 2020–21. “The Biennial is a large-scale public project that must be realized at a time of great change and transformation and the challenges of an era of unprecedented change,” Giroux said. “The Art of Life ,” a separate exhibition organized by the Los Angeles County Museum of Art, will focus on water as a form of life. The theme of the two shows is ‘water as life forms’ and how water of life and of life as forms are connected to one another and with the Earth and her cycles. In essence, the exhibition will be about how we as a society are connected to the Earth, to our place within the cosmos, and to our relationship with one another.”Commenting on the work, Louise Wilkes, director of the Biennial, said: “The Art of Life is an important milestone for the Biennial. It marks a new moment where biennial-goers, artists, and other cultural producers in Los Angeles can be inspired by and interact with one another. It\u0097which was conceived as an extension of the Biennial’s program, in partnership with the Museum of Contemporary Art Los Angeles", "The next Biennial should begin on the first floor of the Museum and lead through the glass doors to the basement, where the exhibition will begin in October. In the meantime, it is up to the organizers to decide whether to hold the exhibition, which will not be open to the public, and whether to move the exhibition to the summer.In a letter dated January 7, the organisers wrote: “While we are aware of the recent events and agree that the cancellation of the exhibition is not ideal, we believe that the best way forward for the exhibition is to remain at the Centre until the end of February and then return to the museum to continue the exhibition. The announcement of the date for the exhibition was never meant to imply that the exhibition would be cancelled at the end of February. The event of the exhibition would begin in the summer and end in the autumn. We are very much looking forward to the exhibition’s return in the autumn, and to the future of the Biennale of Montreal.”The letter continued: “We regret that this was not the case and of course would have liked to have been able to announce the date sooner, but unfortunately this was not possible. It is unfortunate that the exhibition, which was supposed to be", "The next Biennial should be the first in the art-world’s history to be held in the capital of the Republic of Moldova, Tallinn, the capital of the Trans-Atlantic Community. According to the Art Newspaper, the event will be held at the museum’s new building, the Museum of Contemporary Arts, Tallinn, from March 7 to March 10, 2020.The museum, which was inaugurated by the late architect Malin Rozanov in 2013, is one of ten structures connected to the institution, which was established by a team of five teams led by renowned architect Michael O. Middendorff. The other architects were Stepin Fakstad, Kjetil Jankko, and Taima Hrvojúč. The design led to several exhibitions, including an exhibition of works in the new exhibition pavilion, “The Future Is Now: Architecture of Immortality” (2019); a presentation of the work Zhana Dmitrieva, which was on view in the new exhibition “Luchita Hurtado” (2019); and a public sculpture garden, the 'Love is Not a Question of Place” (2019).The biennial will also include an", "The next Biennial should take place in 2022. During the exhibition “Greater Singapore: The Art of the Century” (2019), artist-in-residence Max Hillen, who is working on a new exhibition, will present a retrospective of his work at SingaporeArt Gallery in the spring of 2021. The new biennial will also include a show of work by artists such as Clea Duval, Tsegai Shanmugwe, and Hugo Gernani.\n\n\nIsrael has officially recognized the existence of Palestine and has granted the Palestinians statehood. The move is a major step in Israel’s recognition of the existence of a Jewish state in the Middle East and marks the first time the Jewish state has recognised the territorial integrity of another nation.“The historic declaration marks a new era in the history of the State of Israel,” Israeli prime minister Benjamin Netanyahu said in a statement. “As a result of this historic moment, we are giving the Palestinians the right of return, and we are giving the Palestinians the possibility of building a state in their homeland.”The move has been described as a historic milestone in international relations. In the past, Israel claimed that it was committed to recognizing the Palestinian", "The next Biennial should be in 2020. The museum is currently transforming the former Kent Studios, which was used by the BBC and the Royal Shakespeare Company, into a new arts complex, the Kent Arts Centre, which will stage new works and host talks, productions, and other events. The Kent Museum is also working towards creating new ways for Kent residents to be connected with art and is experimenting with new technologies, including by collaborating with the US military on the acquisition of artifacts, and is seeking public input on the future of the Kent Museum.\n\n\nThe United Kingdom’s Office of Budget Responsibility (OBR) has released new figures on its spending plans for the 2020 financial year. According to the OBR, the UK will funnel $122.7 billion into the public purse, an increase of $6.7 billion since the 2016 budget. The total amount spent by UK ministries and agencies for the 2019–20 fiscal year is $154.7 billion, an increase of $1.1 billion from the previous year. The sum for 2019–20 is $129.7 billion, an increase of $4.7 billion since the end of 2016. Ministry spending is currently projected to total $153.5 billion for 2020, a rise", "The next Biennial should be on November 24, 2020.\n\n\nThe Ethiopian artist and activist Nima Naidoo, who took up the cause of African art after the 2013 Ethiopian Revolution, has died at age eighty-nine. The author of a number of books on African art and art history, Naidoo’s work has been collected by the Los Angeles County Museum of Art, the Los Angeles County Art Museum, the Museum of Contemporary Art, New York, the Museum of Contemporary Art, New York, the Museum of Modern Art, Los Angeles, the Museum of the African Diaspora, and the Museum of Modern Art in Philadelphia.Born in Addis Ababa in 1942, Naidoo studied with Charles A. Carter at the prestigious American University of Art in Cairo until 1990, when he left the country to head to California, where he eventually found work in the Los Angeles County Museum of Art. He continued to work in museums thereafter, collaborating with artists such as Albert Oehlen, and was a key organizer of the 1969 protest at the Los Angeles County Museum of Art against its sale of artworks. In 1994, Naidoo began his first museum tour, organized by the Museum of Contemporary Art, Tallahassee.", "The next Biennial should take place in late 2019. The next edition of the Edinburgh Biennale will be held at the Royal Festival Hall in Edinburgh in November 2020. The London Triennale, which has yet to announce any dates for its 2020 edition, will also not be held. The 2019 edition of the Frankfurt Biennale was canceled after organizers discovered that the event would actually be held in February.\n\n\nThe Museum of Fine Arts (MFA) in Boston is no longer accepting visitors after two visitors died and several others were injured in a shooting at a screening of The Tourist Trap on Friday, March 7. The MFA, which had already prevented the show from taking place because of concerns about the coronavirus, had put the screening on lockdown on March 10, just hours before it was scheduled to run.On March 11, the Massachusetts Department of Public Health (DPH) issued an alert about the coronavirus and the curfew began at 10 PM on March 13. The following day, the lockdown was lifted, and the show took place on the museum premises. The lockdown was lifted a second time on Thursday, March 16, when the lockdown was lifted nationwide.Dramatic surveillance footage shows the moment three people enter the Gallery of", "The next Biennial should announce its new design within the next two years, and should open in 2022. \n\n\nThe DBE will hold an exhibition dedicated to the work of the late artist and theorist Stanislaw Bezal, who died in Poland on November 3rd at the age of eighty-four, in the city of Lublin, the capital of Belarus, on September 3rd. Dubbed the DBE forty, the exhibition will feature work by seventy artists, including Simon Castet, Leijieni Taus, Marko Cabet, and Svetlana Kuzma, and will be organized by the Polish artist Władek Wojtas. Dubbed the DBE Fifty, the exhibition will be presented by Szczygła and Czami Berak, the architects of the Museum of Modern Art in Warsaw, and the Dutch architect De Kooning.Inaugurating the exhibition is a new collection of works by the late Polish architect Janusz Klimczyk, which is titled the DBE Fifty: Janusz Klimczyk’s Contemporary Architecture, in collaboration with Klimczyk’s daughter, Anna Klimczyk. The exhibition will also feature", "The next Biennial should be held in the near future and will focus on the philosophy of the artist, the history of art, and the future of art. The museum has also developed a new exhibition program and a new exhibition in partnership with the Imaginary Museum.\n\n\nThe Philip Johnson Museum of Art in New York has released a new survey of the artist’s work, “The Anatomy of Pleasure,” that is currently on view through November 3. The exhibition, which will feature work by twenty-four contemporary artists, is curated by Andrew LeBlanc and features work that dates from the early years of the twentieth century until the early 2000s.The exhibition is organized as follows:The Art of Pleasure is a collection of work that addresses the themes of “connection,” “belonging,” and “desire.” Schema , 1993–2004, is a series of paintings that are both a reflection of Johnson’s relationship with the body and a reflection of his ideas about the relationship between the body and the cosmos. The work draws from his feminist, anti-romantic, and anti-scientific writings. The work is based on themes such as  “in", "The next Biennial should be held in 2021, and the first in 2022. The exhibition is currently on view in the museum’s new building, which opened in the spring of 2021 and is currently undergoing a $200 million expansion. Artforum currently has the rights to the exhibition.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it plans to end its relationship with the New York City Department of Cultural Affairs (CADA), which has been embroiled in an ongoing legal battle with the Southern California Community Foundation (SCF), which initiated the lawsuit in the first place.In a statement, the museum said: “We believe that it is in the best interests of the museum and the city to end this conflict.” The museum has been negotiating with the city for months, and a recent statement by MoCA CEO Larry Gagosian confirmed that negotiations are ongoing.The company maintains that the partnership, which has been in place since 1990, has allowed it to “provide free and reduced-rate public programming to our audiences through partnerships that have increased the museum’s exposure and contributed to land-use and preservation planning,” and that it only parted ways with the agency because of", "The next Biennial should be set up in the city in the autumn of 2024. The first exhibition in the new venue will be “The Life and Death of Pablo: The Art of Pablo” in the autumn of 2019 and will consist of paintings and sculptures by creators who were active in the Spanish-American War, the Civil War, and the Spanish Civil War. Click here to view a list of participating artists. On Thursday, Spanish culture minister Iñigo Ramirez-Otañu announced that the government is planning to issue a decree to allow Madrid to become the new capital of the new autonomous region of Catalonia. The announcement was made in Madrid’s capital city, where the Catalan regional government is currently negotiating a peace deal that would see the region regain control of its own territory, known as the Autonomous Region of Catalonia (R) and would see Spain formally withdraw from Catalonia in September.As part of the deal, the Spanish government will pay approximately $7.5 billion in reparations to the Catalan people in the form of millions of euros in annual subsidies, tax exemptions, and loans, as well as reduce the region’s debt by up to 80 percent. The region hopes to begin repaying its loans in 2021,", "The next Biennial should be held in 2020. \n\n\nThe Metropolitan Museum of Art (the museum) in New York has released architectural renderings of the Museum of Modern Art (MoMA) in New York and the Museum of Modern Art (MoMA) in Los Angeles that will open in 2020. The renderings, which were commissioned by the Tusker Foundation, depict a vast urban canvas in the form of a Bloomberg terminal. The three buildings, which were built in 1932 and were demolished in 2011, will be reconfigured into one giant outdoor plaza. The plaza will also feature a film library, an artist’s courtyard, and a new sculpture garden.“The Metropolitan Museum of Art has been preparing for this moment for more than twenty years, and we’ve done our best to create a world where unique, hybrid, and contemporary architecture reflects and optimizes the city we’re in,” said David Samson, president of the museum. “The result is an exciting vision of what a new kind of urban experience can look and feel like.”Currently, the museum is working to redesign its courtyard to better reflect the city’s cultural and social landscape. It is also planning to remove the Museum of Modern Art", "The next Biennial should be in 2021, the year of the Greek Festival. Its inaugural exhibition, “Aogea,” will be staged at the Greek Museum in Athens in 2021. Previous exhibitions and biannual events include “Toccarne: Live From Sparta” (2019), “Matthew Arnold: The Trauma of Painting” (2018), and “Toccarne: The Diagram,” 2018. \n\n\nThe Philbrook Collection, a major contemporary art museum in New York that was founded in 2013 by philanthropist Joseph Philbrook with his brother David, has announced that it is considering relocating to a new space in the city. The move would involve a restructuring of the museum’s collection and would likely involve the shuffling of a number of exhibitions, including “Helvetica” (2014), which is currently on view in a retrospective at the Whitney Museum of American Art; a lecture series presented by the Philbrooks at the Museum of Modern Art in New York in January 2019; and “California: The Architecture of Destruction” (2015), which is currently on display in a new exhibition at the Museum of Modern Art.The Philbrooks", "The next Biennial should be held in 2021.\n\n\nThe Metropolitan Museum of Art (the museum) in New York is planning to demolish a nineteenth-century jail to make room for a new, larger museum that will explore the life and work of American artist and socialist Emma Goldman. According to Artnet, the museum’s board chairman, Daniel H. Weiss, announced the news on Friday, September 9. Artnet reports that the prison was built in the 1920s to house prisoners from the Women’s Christian Temperance Union (WCTU), a radical feminist group that advocated for women’s suffrage and other social and economic reforms. The prison is slated to be demolished in the coming months.“The dismantling of this institution will not only advance our mission to present the most current and thoughtful accounts of Emma Goldman’s life and work but will also preserve a significant collection of her art that is monumental in its scholarly and cultural significance,” Weiss said in a statement. The museum is currently working with the WCTU to create the Emma Goldman Center for Feminist Art, which will feature groundbreaking exhibitions that will be inspired by the artist’s work and organized in her honor. The abolitionist group PEN", "The next Biennial should take place in the spring of 2020. The 2019, which was organized by the Hong Kong–based nonprofit Artasia, was canceled due to concerns surrounding the coronavirus.The Venice Architecture Biennale will be held in the French city of Le Mans in March 2021. The event will take place in conjunction with the French and German pavilions at the Fifty-ninth Venice Architecture Biennale.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of twenty-one works by the American artist and educator, Anne-Marie Borthwick-Brown, a curator of conceptual art and a lecturer at the University of California, Berkeley. Titled “The Telling of Art,” the works were donated by the Borthwick-Brown family to the museum.“Anne-Marie Borthwick-Brown is an extraordinary artist who has made a distinguished career of bringing together the extraordinary,” said museum director Michael Govan. “Her gifts to the MFA reflect her commitment to the arts and her commitment to living and working in the Bay Area. Our visitors will find the works in the collections to be particularly engaging and to be included in the museum’s ongoing exhibitions", "The next Biennial should be held in 2021 and will organize a full itinerary for the museum. The biennial will be comprised of a total of thirteen exhibitions, each exploring a different facet of art history. The artworks will be curated by the artist-in-residence, Adrienne Rich, and will be curated by the director of the contemporary art gallery, Donald DeLuca. The museum will receive an additional $5 million from the Coronavirus Aid, Relief, and Security (CARS) Act, which will provide $2.5 million to support the biennial and its exhibitions. The CARS Act also allocates $2 million for Museum of Modern Art’s expansion and renovation, which is currently underway. The biennial will come to Memphis, the city of which, in 1957, declared its intent to become a major arts and culture hub. The program will also feature contemporary art works that are on display in the museum and will introduce events and programming that will draw visitors to the museum. During the 2017–18 academic year, the biennial exhibited fifty works by forty-three artists, including Joël and Olivier Messager, Fanny Schubert, Robert Irwin, Sebast", "The next Biennial should be held in the spring of 2020.\n\n\nThe Louvre and the Musée d’Art Moderne in Paris have launched a campaign to raise $750,000 for the immediate needs of the Visite Alsace, which has been closed since March 19 due to the coronavirus pandemic. The initiative, which is centered around a pledge of $150 for every person who wants to go to the Louvre on Friday, April 11, and Saturday, April 13, 2020, aims to raise $150,000 in three days. The museum is accepting donations in support of the COSIME initiative, which was created by the French cultural association BIRGE (bienne en sociedémiel, Bienne du Louvre) and the COSIME and the Paris-based collective d’Amore (d’Amore n’Demian, d’Amore n’Dreu, d’Amore n’Ette, d’Amore n’Excepér) and is meant to draw 5,000 people from across France and the United Kingdom. The fund will be split between the two institutions.�", "The next Biennial should take place in 2021. The exhibition will be the second since the first Biennial was held in 1972. “It is felt that the current situation is not conducive to the production of a work of lasting value and we are therefore seeking a solution in order to ensure the eventual development of the Biennial in the best interests of the festival, the city, and the country,” said Sofia-based artist Svetlana Fedotova, cofounder of the biennial space Biennale Varna.The choice of the Veneto-based cultural institution for the 2019 edition of the festival was made by the biennial’s artistic director, Florian Mueller, who also curated the 2016 edition. The highlight of the new exhibition programme will be “Sydney at Night: Art and Politics” (2019–20), a selection of fifty paintings created by Sydney-based artist Esther Ruhl and her husband, Wolfgang Ruhl. The exhibition will run from February 21 to March 1, 2020.Commenting on the new programme, Mueller said: “The opening of this exhibition will bring together thirty paintings from the exhibition, which were selected based on their ‘stability of form, ’ their", "The next Biennial should take place in 2020. \n\nThe TV3 Foundation, which comprises artists and institutions that support a diverse range of arts, including the Tate and the National Poetry Library, has received $125 million from the Concern, the Society for British Art, and the Art Fund. The funds will allow it to expand its Coronavirus Research and Creative Futurism (CRF) Biennial, which will take place across North Wales from August 15 to August 20, 2020, and will also fund the commission of a new set of works by the British artist and activist Matt Card.“Matt’s series ‘Telling Stories’ will engage with issues around identity, history, and memory to critically consider and rethink the nature of the human experience,” Annie Melling, head of the TV3 Foundation, said. “The impact of the coronavirus on young people is particularly distressing and Matt’s works demonstrate how vulnerable young people can be. The CTFA Biennial, which will include work by more than sixty artists and will be staged at the Cardiff Art Gallery, will also explore the relationship between art and social issues.”Matt tried to raise", "The next Biennial should focus on defining and highlighting the legacy of the institution. It should also consider whether the institution can be made whole again by salvaging its entire collection and repurposing it into a museum. The biennial should begin with a public exhibition of work by a selected group of artists and continue with a public lecture series, a biannual publication of public reports on the biennial, and a Seattle Art Museum exhibition. The selection committee should then hold a closed exhibition of the works for which it has the final decision.The Biennial of African Art (B.A.A.) is a consortium of twenty-six arts organizations—the African Heritage Foundation, the African Arts and Culture Foundation, the African Art Museum, the African National Congress, the African Art Museum, the African Congress, the African Museum, and the African American Museum—dedicated to the African diaspora. The 2017 event, which was organized by the foundation B.A.A. in partnership with the African National Congress, featured seventy-six works by seventy-six artists. Comparable exhibitions of work by the consortium artists were organized by the several museums, as well as by the Pan-African Art Museum in Port Harcourt, the Museum of", "The next Biennial should take place in 2021–22, at which point the program will enter its fourth year. The theme will be “Sustainability as a Pastime: Art and History in the Age of Climate Change.”\n\n\nHong Kong’s National Museum of History has appointed Taras Ertu as its next director. Ertu comes to the institution from the Museum of Modern Art (MoMA), which he has led since 2014. He succeeds Michael D. Mueller, who resigned in March after ten months following a controversy surrounding an exhibition he commissioned for the museum that dealt with the dismantling of Nazi monuments.The museum, which is affiliated to the National Museum of History, wants to dismantle the Neue Nationalgalerie, the Holocaust Museum, and the Holocaust Memorial Museum in Berlin. The plans have been in the works since 2015, but the museum was forced to temporarily close in February 2019 because of the pandemic. The institution also plans to move the N. G. K. Art Museum, which is located in the city of Hannover, and the Museum of Contemporary Art (MoCA), which is in the suburb of Neustadt.“We are very excited by this appointment,” said Peter Matth", "The next Biennial should be held in early 2021.\n\n\nThe eighty-third edition of the Hamburg Biennale, which kicked off on October 20 and ran until October 23, 2020, has announced the opening of a new digital platform and exhibition. The platform, called Artforum, will allow visitors to browse through previously exhibited exhibitions in the exhibition. The first digital exhibition, which will be presented by the German artist and curator Ulrich Berger, will be a retrospective of his work Artforum: Die Kunstbau (2017) at the Nationalgalerie in Berlin—the exhibition will be followed by a special online exhibition of the artist’s work Artforum: Audience, 2018 at the Kunstmuseum Bonn.\n\n\nThe Bechdel Test, a groundbreaking feminist and queer theory developed by American feminist artist Elizabeth Cady Stanton in 1967, has been repealed by the United States Department of Education. The move comes amid a push to overhaul how schools teach LGBTQ history and culture. Schools will no longer be required to teach the history of LGBTQ relationships, but teachers will still have a role in shaping and presenting the history of LGBTQ issues.“The Bechdel Test was intended to be a guide for students", "The next Biennial should be held in 2019. For the past two years the institution has been partially closed due to the Covid-19 pandemic, and in 2018 the museum received a $2 million donation from the Walton Family Fund.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Grace LeDoux as its new deputy director for collections and research. LeDoux, who has served as a curator at the institution for more than twenty years, succeeds Bridget Riley, who retired in March after twenty-five years at the helm of the museum.“We are thrilled to welcome Grace back to our team and to her organization,” said director Thomas Campbell. “Her deep expertise and passion in contemporary art and the collections she will create will make her a strong addition to our team and to the collection. Her proven track record building relationships with artists and collectors is central to our mission and we look forward to working with her.”Riley, who has helmed the museum since 1996, has been a leader in the transformation of the museum over the past two decades. She expanded its exhibition and education programs, launched a successful online residency program, and launched the Biennial After Hours program, which brings together artists for an", "The next Biennial should take place in 2020.\n\nIn the meantime, the Los Angeles–based nonprofit Artadia aims to raise more than $2 billion for the theater, which is currently undergoing a $120 million expansion that will boost seating capacity by more than twentyfold. The organization was also granted a $100 million grant from the Frieze Art and Foundation, which is a division of the Frieze Group, in recognition of its support of the renovation of its 900-year-old building at 3215 Wilshire Boulevard in Beverly Hills. The grant is for the refurbishment of the building and the $100,000 donation is for the restoration of the building.The $1.2 million donation that was made by the organization is for the restoration of the building’s original facade in an effort to prevent the reopening of the building in the 2020 exhibition season. It is also for the building’s preservation, restoration, and conservation, and will support the organization’s efforts to secure the future of the building, which was constructed in 1908 as a temporary home for personnel on construction projects for the construction of the Griffith Observatory in Los Angeles.The foundation is also working with the architect and landscape designer of the building, David", "The next Biennial should be staged in March 2021, and will highlight the work of newly commissioned artists, including Nilo Čapek, who will next be featured in an exhibition at the museum. The biennial will also include the exhibition “Milena & Peter” (2018) and “Avant-Garde Painting in the Age of European Union” (2019).\n\n\nFollowing a new law signed by President Donald Trump that temporarily blocks travel to and from the United States by citizens of seven Muslim-majority countries—Iran, Iraq, Libya, North Korea, Somalia, Sudan, and Syria—the Museum of Fine Arts (MFA) in Boston has instructed its staff to prepare for a possible temporary closure. The Museum of Modern Art (MoMA) in New York has also implemented a hiring freeze and is conducting training sessions for its hourly visitor and non-resident staff.In an email sent to staff on Thursday, March 20, the MFA told staff that: “To protect the safety and security of our staff, and other critical visitors, we have temporarily closed our doors March 19 through March 21, and will continue to receive visitors for the next three weeks. We know that this is a challenging situation and will continue working as", "The next Biennial should take place in May 2022, and the location will be decided by a selection of the best candidates submitted by the public. The exhibition will be directed by the internationally acclaimed artist Lawrence Abu Hamdan.\n\n\nThe Venice Architecture Biennale, which was scheduled to run from March 13–March 14, 2020, has been pushed back to June 30. The event, which was organized by the Milan-based publisher Osezione Cinéma, will now consist of two exhibitions: “Vincent van Gogh: Remembered” (June 2–June 9, 2020) and “Sylvia Delahanty: A Life for Art” (June 10–June 12, 2020).The postponement is both a relief for the artists participating in the event, who were facing a March 22 deadline, and a reflection of the current state of contemporary art. While the 2020 edition will be hosted at the Venice Architecture Museum, which reopened today after a $75 million renovation and expansion, the 2020 edition will be staged at the CNEB, the civic center in Milan that has housed the exhibition since 2010. The CNEB is also planning to open a new center for contemporary art, and the Basilica of Santa", "The next Biennial should take place at the Museum of Modern Art, Boston, in 2021. \n\n\nThe Chicago-based nonprofit organization ArtPlace has announced that it will not proceed with its renovation of the former Community Church of Christ in North Adams as planned. The decision was made after the group’s board asked the city to delay the project until the institution could conduct an environmental impact study and more information about the restoration project was available.“The City of Chicago has received an emergency request to begin the environmental impact study as part of the permit process for the renovation of Community Church of Christ in Adams,” said board president and CEO Michael Hausfeld. “We hope that the city of Chicago will support this request and expedite the study if the conditions for expedited study are met.”The nonprofit’s previous plan to demolish the building and start the renovation of the chapel and library, which is scheduled to start in 2020, was canceled after the death of Metropolitan Arne Guggenheim. The museum was planning to move the works into storage before the construction of the new building began. The new museum will be built in a former dairy barn across the street from the existing building and will boast four floors of retail space", "The next Biennial should focus on Identity and Difference (2020), which will explore the intersections of art and culture in the city. The 2020 edition of the Art & Culture Biennial, titled Unity, will take place at the Alma Mater in St. Louis. This year’s event will be held at American Airlines Arena. The main event of the event will be a discussion with artist Sadek Hapat and curator and scholar Tillamu Sultan-Skow. The topics that will be addressed will include historical instances of Indigenous sovereignty and Indigenous representation in art, as well as Art and Law.The full list of participating artists will be announced in the coming weeks.\n\n\nThe Prism Art Museum in Philadelphia has announced that it plans to remove an exhibit dedicated to the life and work of Christian Breuer\u0097a Swiss photographer whose work evoked an expansive spiritualist, mystical, and metaphysical worldview\u0097via a substantial donation from the Smithsonian. The $630,000 donation, made by Diane von Steinbach, the former president and CEO of the Museum of Fine Arts in Houston, Texas, also included a substantial ten-foot-tall sculpture by Breuer\u0097a", "The next Biennial should be in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in New York is planning to close its doors for a month—and raise funds for The AIDS Coalition to Unleash Power—in an effort to shift its attention from its $8 billion in debt to the future and avoid defaulting on its debt payments.The restructuring of the $1.3 billion institution, which was founded in 1984 and opened in 1988, is part of an effort to reduce its debt to the point where it will no longer need the $3.5 billion in cash-and-debt relief the federal government issued to the institution in December. “While we are grateful for all of the hard work the government and MoCA put into securing the future of MoCA, we are unable to do this alone,” museum director Dr. David Chiu said in a statement. “The current budget for the museum is tight, and the only way forward for MoCA is to continue to operate with a smaller staff and reduced fare footprint. This means the end of the summer in June, and the next plan for the museum is to stay open through at least September.”With the upcoming reopening of the Museum of", "The next Biennial should be held in 2020; the first was held in 2018, and will include the work of forty-eight artists.\n\n\nThe Solomon R. Guggenheim Museum and the Museum of Modern Art (MoMA) in New York have agreed to work together to preserve a significant collection of works by the late Italian designer Minna Slovo. The institution announced that it will begin by creating a digital catalogue of the artist’s work and will work with artist collaborators to develop a design for a new museum-building. The catalogue will be released in 2021.“We are delighted that Minna Slovo’s collection will be preserved in this way,” said museum director Barbara Rosenblum. “We are grateful to Carlo Cicutto, Carlo Dini, Carlo Guggenheim, Alessandro Fiumi, Renzo Piano, and others for their assistance in this process, and to Laura Hennings for her invaluable and tireless research and art history editing. We are also grateful to the many artists and collectors who have contributed their works to this exhibition, and to our own staff and volunteers for their dedication. We are confident that this collaborative effort will yield a significant new appreciation and appreciation of Slovo", "The next Biennial should be the festival of the living. This year’s edition will feature collaborations between artists and groups including Benjamin Harnwell, Fergus McCaffrey, and Jack and Jane Robinson, leading up to the 2015 edition, which was held in Berlin. According to the Art Newspaper, a partnership with the Museum of Modern Art in New York has been in the works for more than a decade, but this is the first time the institution will be hosting the event. The opening of the exhibition will take place at the museum on Friday, March 30, from 11:00 AM to 5:00 PM, with the closing party at 8:00 PM. The exhibition will be open to the public from March 23 to March 26. The venue has also announced it will be hosting a number of other events this year, including an outdoor installation by the Welsh artist Robert Irwin, a retrospective of the Spanish artist César Peña, and a concert in the park. \n\n\nThe first major retrospective of American painter and sculptor Chester A. Arthur, whose work embodies a range of themes including the planetary and personal, the fantastical and the mundane, will open in New York in December 2020. The exhibition, titled �", "The next Biennial should concentrate on the evolution of work on the Internet and how it will continue to change and adapt to the new digital realities.”The second, which will take place in October 2019, will feature work by twenty-three artists, including Ian Cheng, in partnership with the Beijing-based museum Foshan; the first exhibition will focus on the emergence of the term “virtual work.”Curator Angelica Rocha, who curated the first biennial, said: “I’m thrilled to support Foshan’s exhibition program and artists who will participate in the second edition of Biennial 2. The first edition, which was focused on the history of visual art, was an incredible success. I am hopeful that this new edition will further explore the richness of China’s artistic heritage and the ways that art can alter and expand our lives and also deepen our understanding of our world.”The 2020 edition of the Biennial will be staged at Foshan’s exhibition space, the Foshan Art Museum (FAM), from January 22 to February 15, 2020. The first edition, “Double Sight: Art in a Time of Crisis” (2015), featured work by", "The next Biennial should be held in Chile in the first half of September 2021. The 2020 edition, titled Brilliant, was the first held in the United States.\n\n\nNadia Corrias, the head of the Colombian art-world complex Galeri, has announced the opening of her first gallery in the United States, Nada Corrias + Galleries, in Manhattan. Founded in 1997 by Corrias and her husband, Marcelo, the space has relocated to a new building on East Seventy-Second Street since 2016. Working with a contemporary collection that includes works by Pablo Picasso, Alberto Contador, Jean-Luc Godard, Diane Arbus, and Robert Rauschenberg, the gallery serves as a forum for the artists to present their works.Inaugurating the gallery are solo exhibitions of work by Pablo Picasso and Mies van der Rohe, presentations of work by Pinacoteca de São Paulo, and the opening of a series of two-thousand paintings by the late Colombian designer Santiago Pintura. In addition, the gallery will present “Eduardo Niño” (2016), a three-part exhibition that will also feature works by Louise Bourgeois, Hel", "The next Biennial should aim to give the public an opportunity to see films that have not yet been screened in the United States, and should integrate films into the theme of the exhibition. In response to a question posed by the audience, MCA director Julian Jordan said: “I’m not sure about the question of what the future will hold, or what the future will look like with regard to art and technology, and technological innovation and art, but hopefully the upcoming exhibition will give you some idea of what we’re looking forward to.”Jordan was responding to a question about the future of art and technology—one of the themes of the biennial—and the biennial’s return to Los Angeles. “We are looking forward to the possibility of returning to Los Angeles and to the history of the exhibition,” Daniel H. Rosenfeld, chair of the exhibition’s architect, said in a statement.\n\n\nThe Chicago-based artist Max Beckmann has received the $195,000 Diller Scofidio + Renfro Prize for his monumental installation The Pentagram, a concrete work that combines a series of hexagonal geometric shapes and their individual sounds, in the city of New York", "The next Biennial should be held in the following year.  The inaugural event, entitled Biennial of Art, would take place in Kiasma, Italy, in 2019. Before the construction of the museum, the town of Kiasma and the surrounding area of Pozzallo-Venezia, a small town in central Italy, was developing. The new venue would have been a venue for the exhibition of new works by artists such as Jannis Kounellis, Paul Angel and Andrea Izzo, and would have featured a museum-like exhibition space and an area for educational programs. According to Florence’s Local Coordinator, Aleksandra Cacciavi, a meeting between the Palazzo d’Arte Contemporanea and the Museo della Scala in Rome was held on April 21 and the theme for the upcoming edition of the exhibition is “Avant-Garde in Rome”. The new venue will be inaugurated with a special exhibition of work by the Italian artist Alfonso Baribe, who lived and worked in Rome and was inspired by the Italian city. The exhibition will also feature new work by the Italian architect Gio Ponti, and the twenty-", "The next Biennial should also be an opportunity for the US to think deeply about how we are connected to each other, with regard to the environment, and how we are going to change our behavior. The first Biennial was about the new really close relationships that we have with our fellow citizens. The second Biennial will be about the ways in which we can be more intimately linked to each other and to nature. And the third Biennial will be about the ideas that we are all born into and grow up with.\n\n\nThe Contemporary Art Museum Los Angeles (CALO) is planning to cut more than 170 jobs from its staff in an attempt to reduce costs and improve employee welfare amid the coronavirus pandemic. According to Artnet, the arts museum plans to lay off or reduce the hours of nearly two hundred employees as a result of the pandemic.“The restructuring is necessary to protect the health and well-being of our staff, and helps ensure that we meet our financial obligations to the court and creditors,” said   Andrew Goldfarb, the CEO and president of the contemporary art museum. “We will continue to listen to your feedback and will make meaningful decisions based on the current financial situation.”While the Chicago", "The next Biennial should be held at the same time as the current exhibition, in order to cater to the current exhibition program. The new format will include a rotating group of artists that will each be given a unique space to create works from their special collections. The pavilion will also be expanded to include a dedicated space for educational activities and special exhibitions, as well as a showroom. The exhibition will be supported by a commission of the artist Lars-Ulf Pedersen who will create a new work for the first Biennial. “It is a very exciting time for the Biennial,” said Rolf Boëk, chair of the board of trustees of Art Basel. “We are actively working to make the Biennial the best platform for decades of contemporary art and it is our mission to provide our artists with a platform for their creative endeavors. In the next few years, I look forward to working with my artists and to enabling their creativity in the construction of a future Biennial.”\n\n\nThe Italian government will provide $200 million to the University of Milan in an attempt to mitigate the economic fallout from the coronavirus. The funding will come as part of a $4.8 billion package", "The next Biennial should draw from a panel consisting of Olu Oguibe, Arturo Pilar-Williams, and Paulo Pinac, director of the Biennale of\n\nJuxtaposition, in partnership with the museum, and a panel of curators, writers, and artists. The Tokyo-based artist, whose work can be found in the collections of the Museu de Arte Contemporáneo (MAS) in Madrid and the Museu de Arte de São Paulo, will also serve as the Biennale’s artistic director.“The Biennale is a masterpiece of the twentieth century, and the upcoming exhibition will be a unique opportunity to discover it anew,” said Takashi Kawamata, the director of the Biennale of Toronto.The opening of the exhibition will take place at the Museum of Fine Arts, Tokyo. \n\n\nThe Solomon R. Guggenheim Museum (Guggenheim Museum) and the Japan Society (JSS) in New York have partnered to raise funds for hurricane-force winds that are likely to strike the region in coming weeks. The Guggenheim and the JSS are coordinating to raise funds through their charitable organizations, the Solomon", "The next Biennial should be held in 2021. The festival will be hosted by the artist-run Foundation for Contemporary Art in Boston. Funded by artist and collector Richard Goldsmith (1910–1986), the event will also feature artist installations and performances, artist residencies, and an online residency platform.Hiroshi Hoshine, president of the Foundation for Contemporary Art, said: “While we are aware many will disagree with the decision to cancel the biennial, we believe the future of the exhibition is at stake. The choice to remove some of the greatest artists of the twentieth century from the exhibition, and to present their work in a limited format, is a decision that is deeply troubling and difficult. . . . We hope to gather all our voices to support this exhibition in its upcoming version and hope that the biennial will continue to thrive as a vehicle for the collection and exhibition of work by the most important artists of our time.”\n\n\nThe Israeli exhibition “The People’s Museum” (Tmp) has announced that it will close after twelve years on January 11, 2021. The show, which was organized by Israeli curator Shmuel Rabin, had been on view since 2008, and was presented by"]