["The next Biennial should take place in mid-March 2020.The biennial will focus on the practice and development of the contemporary art world, including the design, production, distribution, exhibition, and exhibition of works by women, men, and non-binary artists. The biennial will also include a survey of the history of art exhibitions and the exhibition of work by female artists. Among its curators are Kianmehr Qureshi, Sabrina Zoubir, and Anissa Harsha.\n\n\nThe United Kingdom is planning to take its air quality in unhealthy levels, and have its air quality in Europe and the United States worsen. The air quality in London has reached unhealthy levels for the fifth straight day, and according to The Guardian, the air quality in the capital is worse than in Beijing, Hong Kong, and the US. While air quality in the UK is generally considered good, there are still people who are suffering in factories and shopping malls due to the effects of the Covid-19 pandemic.On Thursday, the Office for Budget Responsibility (OBR) published its Autumn Statement for the UK, which states that air quality in the country is worse than in 2015. The OBR predicts that air quality in the UK will worsen further", "The next Biennial should be held at the Museo de Arte Contemporáneo in Madrid in the spring of 2020.\n\n\nThe Dusseldorf-based cultural space 3x3, which has staged numerous exhibitions, including the third edition of the Flemish pavilion, the Dusseldorf Biennale, and the Dusseldorf-New Year’s fiftieth anniversary celebrations, is expanding its programming in the city. The institution will present three new works by artists, including Antje Boecker, Paloma Tavares, and Neuer Freie Panorama, at the Kunsthalle Dusseldorf Frankfurt in the winter of 2020.“In the run-up to the thirtieth edition of the Dusseldorf Biennale, we were able to leverage the unique opportunities provided by our new , urban location and artistic space, the Kunsthalle Dusseldorf,” Arts Council director Marc Spiegler told the Art Newspaper. “The capacity to present works by artists of various eras and to engage with urban life that is as relevant and inextricable from our own time as we are is a truly exceptional", "The next Biennial should be held in the Spring of 2021.  Gavin Brown, the director of the Smithsonian American Art Museum and Museum of Fine Arts, said: “We are delighted to be able to welcome the American people back to the National Museum of American Art next year thanks to this year’s three-year grant cycle. We are confident that our new exhibition, ‘Four Years of American Art,’ will provide an engaging and thought-provoking experience that will engage with and celebrate the legacy of American art.”\n\n\n\n\n\n4 years after the Paris Earth Summit, the United Kingdom, announced today that it will phase out fossil fuels entirely by 2050, a dramatic shift from its current trajectory of driving ever-increasing amounts of carbon dioxide into the atmosphere, a task that the forthcoming United Nations Climate Action Summit in Lima, Peru, has been called the “most important environmental decision in the history of the planet.”The change in policy, announced by Prime Minister Boris Johnson, is the result of a painstaking analysis that took into account both the economic and ecological implications of the climate crisis. “This is one of the most important challenges of our generation,” Johnson said, “and one that", "The next Biennial should see the work of the fourth artist in the biennial series, John Akomfrah, whose works will be included in a forthcoming exhibition curated by the 'Truman Art Museum'. The party will take place at the Museum of Fine Arts, Boston, from September 19 to September 21, 2020. On the theme of the event, the invitation reads: “Beyond the Present: ‘Future Present.” The first exhibition will be “Beyond the Present: Futurism,” which will highlight the work of eight artists who explore “future phenomena” through midcentury art and how they shape contemporary art. The second, which will be curated by the same curator, will air on January 8, 2021.“With such a robust and diverse collection of world art, it is a real treat to be able to present this collaborative series of works,” said Andrew Hauptman, chair of the museum’s board of trustees. “In the first exhibition, John Akomfrah, Frank Gehry, and Alfred Stieglitz present an avant-garde and experimental work, especially in its time, but also in its location, in the heart of the city,", "The next Biennial should be held from March 20 to March 22, 2020.  The show will consist of a series of public events that have been organized around themes such as the Black Lives Matter movement, art and culture, and the environment. The first Biennial exhibition, which was organized by the New York–based artist Tarek Atoui, took place last month in New York. The exhibition marked the opening of the artist’s first solo exhibition in the US. Atoui’s exhibition, titled “Idea and Control,” was curated by artists Amedeo Arradondo and Charlotte Brontë. The show features works by artists such as Kamel Obama, Xia Yansong, Rosy Central, and Jean-Michel Basquiat.\n\n\n\n\n\nInstalling a new water-treatment plant on the grounds of the Ministry of Culture and Sports in Beijing will reportedly cost China National Petroleum at least $9.5 billion, according to the Beijing News. The $8.7 billion plant, which will be two-thirds the size of the Ministry of Education\u0097the ministry is currently constructing a new glass building\u0097will be installed in the capital’s Huang", "The next Biennial should focus on issues of state power, the body politic, and the environmental crisis. The program’s theme of “Apocalypse Now: From the Earth to the Moon” will be revisited in the film . Alliance's inaugural exhibit, “The Rise of Empire,” will be on view at the biennial’s inaugural edition in San Francisco on September 21, and the London site will host the show the same week.Other shows that will be staged at Alliance are “The End of History?” (2019), a collaboration between the artist and the British artist Joana Fernandes; “I­ncontro!” (2019), a digitally enhanced, digital recreated Italian Renaissance painting; and “How to Be a Thief,” (2019), a seven-channel video art installation by the artist and the photographer Stella Creasy. The entire installation will be displayed alongside a selection of works by art and cultural critics Jacques and Louise Goldie’s “The Adaleti” (2019), a twenty-eight-by-eight-foot photograph that illustrates human depravity—a work that is drawn from the artist’s own personal", "The next Biennial should be organized in 2021, and the first in 2024. \n\n\nThe Institute of Contemporary Art (ICA), the London-based nonprofit that supports emerging and established artists and has supported more than 1,500 artists in the last ten years, announced that its former director Ben Wheatley will be its next chair. Wheatley, who will assume his post on June 4, will oversee an ambitious program that will encompass a total of twenty-six exhibitions, produced by artists and institutions, over a period of ten years.The ICA’s board of directors voted unanimously for Wheatley’s appointment, which was announced June 4. In addition to announcing his appointment, the board also considered a number of other factors, including the ICA’s current operations, the ICA’s current artistic and educational priorities, and the ICA’s relationships with the artist community.“Ben Wheatley’s leadership and vision for the ICA has been inspiring and transformative, as he introduced the ICA’s first exhibition, “The Human Element: 40 Years of Art,” in 2019, and helped to shape the ICA’s current programming, which began with the inaugural exhibition “", "The next Biennial should take place at the Terrebonne in Paris in December 2020.\n\n\nThe Museum of Modern Art (MoMA) is planning to open a new research center dedicated to the work of American Marxist-radical Benjamin R. Tucker. Titled the Tucker Center for American Marxist Art (TAM), the new museum will be located on the third floor of the Museum of Modern Art and will be funded entirely by donations from artists and activists.TAM will bring together eighteen artists, including Adrienne Atget, Carol Reid, Judith Suss, David-Dieterich Zweig, and Alexander McKee, to examine the impact of social conditions at the time of Tucker’s death on their works. The center’s inaugural exhibition, “This House is a La Carte: American Art in a Marxist-Leninist Society,” will be on view in January 2021. \n\n\nThe Art Newspaper reports that the Institute of Contemporary Art (ICA) at the University of Leeds, UK, has appointed Monash University artist and curator J. M. Robertson as its new director. Robertson succeeds Gerald Kaufman, who has been the director of the institute for the past twenty-six months, and will take up", "The next Biennial should be held in 2021. “The current event series is a great success,” said Sadao Maeda, director of the Museo de Artes Stradales in Madrid, and a former winner of the Nobel Prize for art. “It is my mission to continue this tradition in a new way, by bringing you the latest work by some of the most important contemporary artists.”\n\n\nThe David Rockefeller Fund has given the Smithsonian American Art Museum (DAAM) $1 million to help offset the financial impact of the museum’s decision to move the Whitney Museum of American Art (MCA) to a new home in downtown Manhattan. The grant was made in recognition of the institution’s commitment to preserving and promoting the works of the late American industrialist and philanthropist, whose legacy includes the construction of the giant steel works of the Chrysler Corporation. Rockefeller was an avid collector who gave generously to virtually every major institution in the country. His will will also cover any possible losses as a result of the move. “David Rockefeller was a man of vision and forethought, a gifted organizer who was devoted to elevating the museum in his lifetime,” said Bradley Roach", "The next Biennial should take place in Sheffield in 2022. \n\n\nThe Museums Association (MA), which represents more than 4,400 arts institutions in the UK, has announced that it is demanding changes to the public sector in the UK from May 2020. The action, called for in a letter dated April 14 and signed by more than 2,500 members, will consist of a series of points of order, which will be considered by the UK government before the end of the month and will be followed by a second round of funding that will last until June 2020. The first round of funding was set to run from May 2020 to March 2021 and provided £8.5 billion for the \"cognitive, physical, social, and spiritual\" needs of the UK’s museums. The second round of funding was set to run from March 2021 to April 2021 and provided £14.2 billion for museums, with £10 billion earmarked for special projects. The letter states that the UK’s general assembly has already failed to address the long term challenges posed by the UK’s museums, and that the government has failed to deliver on its stated commitment to revamp the museums’ bodies. MA says that the", "The next Biennial should be held at the same location in 2021. The opening of the Biennial will take place on February 5, 2021. The event will feature programs that will include lectures by leading scholars from the Uffizi School of Architecture and the Department of Cartography, the Museum of Modern Art, the CNA Museum of Contemporary Art, and the Museum of Modern Art.The first edition of the Biennial was organized by the Italian modernist and architect Gianfranco Mazzuchetti and was titled Augusto Medoff: The 2nd Floor,  in 2009.The next version will be organized by the architect Roberto Cicutto and will take place in 2020. \n\n\nBy submitting your comments, you are acknowledging that you have read and understood the statement of the exhibition organizers, the recommendations of the exhibition committee, and the guidelines of the exhibition. The intention of the exhibition was to present a new look at architecture developed over several centuries\u0097in this case, between the eighteenth and twenty-first centuries\u0097and to show how the art of designing can shape the future.“The Biennial gave the opportunity to build on the foundation of the exhibition provided by the history of architecture, but in the way", "The next Biennial should be held at least once every two years. The first iteration of the event would be hosted at London’s National Portrait Gallery as part of the UK’s annual Arts Council campaign, “Between the World and Me.” The second iteration would take place at the National Museum of Scotland as part of a partnership between the institution and the National Galleries of Scotland.The announcement of the partnership, which was announced on June 7, comes amid a global resurgence in the art world. The Art Newspaper reports that the first half of this year saw a total of 3,979 exhibitions, the largest number since 2006, and a strong increase in art-world visitors. The number of artworks on display will be decided by an international jury comprising Wolfgang Deibendorfer, the director of the Sainsbury’s in London; Trevor Paglen, editor of Tate Britain; and artist-activist Mayank Chaubey.The jury will assemble in the summer of 2021 and will then award the inaugural Biennial Prize to an artist chosen by the jury. The winner will be determined by a jury comprising Berthold Hoffmann, director of the Friedrich-Alexander-Institut für Kunstbau", "The next Biennial should focus on “organic photography” and not “photography as such,” said designer Lutz Biesenbach. “The exhibition should be a combination of photography exhibitions, publications, a series of photographs that are instilled in the viewer through the exhibition.” The upcoming edition will be curated by Oskar Eustis, a curator who previously organized the third Biennial in Oslo in 2015 and was hired by the Philadelphia Museum of Art as its inaugural director of photography. “The new role is a real challenge to me, especially in the current climate,” said Biesenbach. “The exhibition ‘Celestial Flux (2017)’ will be the nucleus of the exhibition.” The exhibition was shown at the Philadelphia Museum of Art in 2017 and will also be included in the first edition of “Photography in the Age of Mechanical Reproduction” at the Lawrence Museum of Art in Kansas City, Missouri, in 2021.\n\n\nFilipino artist Irma Magana has been named the winner of the 100-Year Anniversary Award, which was created in 2000 by the Manila-based philanthropist and collector Mme O.", "The next Biennial should be held in the spring of 2021, and the first exhibition should be staged in the fall of 2022.  The first organiser to accept a prize for design is the architect Simon LeVay, who will receive the $150,000 Grand Prix d'Art Moderne.\n\n\nThe Reel Art Foundation, a New Orleans–based nonprofit that works with artists, art institutions, collectors, and artworld professionals to raise funds for arts initiatives, has awarded $10 million to thirty-two artists. Thirty-seven of the recipients were selected this month, and twenty-eight were artists from New Orleans. The institution is also working with the Reel Art Foundation to launch the “New Orleans Artist in Residence” program, which will build on the New Orleans artist residency network by selecting twenty-five artists to reside in New Orleans for a period of twelve months. “The foundation is thrilled that this year’s biennials selected thirty-two artists who exemplify the Reel Art Foundation’s mission to foster a sense of community among artists and their peers in New Orleans,” said Mark VanderPlaschke, director of the Reel Art Foundation. “The artists selected", "The next Biennial should be held in 2022. The twenty-seventh is scheduled for the same date, and the twenty-eighth will go on view in 2024.\n\n\nActor and activist Aneulii Bhabha, an Indian American writer, filmmaker, and educator, has been selected as the 2020 recipient of the International Kanya Award for Lifetime Achievement.Bhabha, who passed away at the age of eighty-three in New York on March 3, was approached by the Dalai Lama to help promote a book she was writing about the Tibetan spiritual leader, Her Holiness the Dalai Lama. The intention behind the assignment was to have Bhabha become a subject of her own art and to create a way for the future Dalai Lama to be depicted in the work.Bhabha was chosen from a shortlist of three finalists by an international panel comprising actors and writers Anna Atkins, Ali Bopia, and Mira Neshat, and curator Monika Goolagari. Her book, A Step Back, is currently on display in the exhibition “Dalai Lama: Part 1” at the Museum of Modern Art in New York.\n\n\nSolomon R. Guggenheim Museum in New York has", "The next Biennial should be held in 2020? \n\n\nAmerican painter Frank Oz has died at age seventy-eight following a twenty-nine-year illness, which involved an outbreak of meningitis. He was born in New York in 1941 and grew up in Brooklyn, New York, where his parents were immigrants from the Philippines. Oz was the third child of a Jewish mother and a Catholic father, the eldest of two boys. Throughout his childhood, he often pictured himself as the son of God. When his father died in 1960, the family moved to Europe, where his mother, a Dutch immigrant, became a homemaker.The family returned to the States in the early 1970s, where Oz studied painting at the University of California, Berkeley, and his father continued to paint. Oz moved to Los Angeles in 1983 and began making work with a vintage paintbrush called a Zippo with his late brother, Jim, who became one of the founders of the company. Born in 1988, the project took shape as the family moved from one house to another. The family would eventually settle in the Los Angeles suburb of Sherman Oaks, where Jim served as a manager at the painter-distributor autevapor.com. The father-son duo", "The next Biennial should take place in 2020. Its inaugural exhibition, a collaborative collaboration between J. Paul Getty and Annie Pateman, will be held at the Museum of Modern Art in Los Angeles. \n\n\nMore than 140 artists and collectors have joined a class action lawsuit against New York Governor Andrew Cuomo over the state's opioid crisis, bringing the total number of plaintiffs to more than 600. The suit, which was filed in federal court in Manhattan on March 29, claims that the state is violating the National Labor Relations Act (NLRA) by reclassifying certain types of retail sales as exempt from its mandated minimum wage and overtime provisions.The lawsuit argues that the state is violating the National Labor Relations Act by forcing employees to work more than 40 hours a week and by requiring employers to pay employees at least $2,000 if they are laid off or fired during the course of a year.“This is the largest blow to workers we have seen in our nearly thirty-year history, and it is just the latest in a series of attacks on working people that have taken place across New York State,” said Andrew Stern, an attorney for the plaintiffs. “This lawsuit represents the beginning of a process that will send a clear message to Governor Andrew Cuomo", "The next Biennial should mark the 70th anniversary of the first publication of the French Painting Academy, the Paris-based nonprofit. The festival will also include a new collective exhibition of work by the late Greek designer Bernardo Bienni\u0097's young Parisian collaborators, Jean-Luc and Louise Bourgeois, and Pierre Bourdin, the founders of the Italian contemporary art movement. Learn more about the project here. \n\n\nThe Art Newspaper has launched a new digital edition, which will be hosted by the French weekly newspaper Le Figaro, on November 26. The twenty-four-hour digital platform will feature interviews, articles, videos, essays, and publications by the leading French artists, including Philippe Léger, Pierre-Auguste Merz, and Luca Pascale; will feature biennials and other events by contemporary artists, including Olivier Assayas and Roy Lichtenstein; and will give readers a daily glimpse into the studios and residences of the six living French artists: Eric Dupont, Alexandre Kamm, Bryan Lee, Lévy Gorvy, and Michel Houellebecq.In addition, the platform will present artists' works and engage with contemporary topics, such as the future of art and architecture,", "The next Biennial should take place at the Artsammlung in Berlin in 2021, the Art Newspaper reports.  Director Joachim Neugroschel has also stated that the exhibition will likely move to a new venue as it focuses on considering new ideas of the museum.\n\n\nThe Museum of Contemporary Art (MoCA), Chicago, announced today that it will open a new seven-acre, fully restored building, designed by architect Hadley & Brennan, in the museum’s former location on the South Side of Chicago, the Arts District, later this year. The museum will also restore the original Raoul Wallenberg–designed building, which was completed in 1987 and is currently home to the Raoul Wallenberg Collection. The reconstruction project, which will involve the restoration of the building’s exterior and interior, and the expansion of the museum’s collection, will also involve the purchase of three former industrial sites and the construction of a new public gathering space.“We are extremely excited to open the new doors of MoCA with the same vision and spirit that this building represents,” said Kim Gordon, a former chief curator of the collection and a cofounder of the arts advocacy group Creatives In Action. �", "The next Biennial should be held in 2021.[Update: March 10, 2:55 PM] The 2019 edition of the Biennale was canceled due to the Covid-19 pandemic. “We are deeply saddened by the news that the 2019 edition of the European Biennale will not take place,” said Edoardo De Laurentiis, chair of the European Commission’s culture and media department. “The change of plans is a serious step that is meant to avoid cancellations and to ensure the agenda of the next edition remains unchanged. The announcement of the date of the next edition is not connected to this change of plans, but is only a consequence of the fact that we are actively trying to prepare for the possibility of a future edition. We hope that this will be the case for the future editions of the European Biennale.”Speaking about the upcoming edition, Artnews said: “The upcoming edition of the European Biennale will focus on the current global situation on the ground, both through interviews and performances, and will take account of the current challenges and opportunities. The theme of the exhibition will be ‘At the same time as we live, we think of other things.", "The next Biennial should be held sometime in 2020.  The 2020 event will be hosted by the same venue that has hosted the Biennial for the last twelve years. The theme of the event will be “The Future is Alive and Well,” and the team behind the event will include Lise Bains, director of the NGO Art in Society (formerly ART), and indigenous artist and scholar Nia Varejão; the biennial’s first director, Jairo A. Dos Santos; and Dr. Alun Verma, the presiding partner of the National Art Museum in New Delhi.The exhibition will showcase the work of twenty-six international artists and will be organized in the same way as the Biennial. The artists presenting work in the exhibition include Mañana Anwar, Noor Nizami, Ashok Ganesh, Nagarika Ganesan, Moukhtar Hossain, Prahlad Mahanta, Vishal Prasad, Nadita Morcha, Merry Shaw, Lhany Jones, José Paolozzi, Kamal Shah, André Bazan, David Schmitt, ", "The next Biennial should be set up within six months of the first,” Matthias Klump, head of the newly created museum, told the Art Newspaper. “I have already given my opinion to the museum in order to ensure that we move ahead with the first exhibition. I need your help in this regard.”\n\n\nThe Futurama exhibition at the London Biennale has received a major boost in its drive to raise $40 million for the capital campaign for its new £93 million venue, the Futurama Pavilion, which opened to the public last week. The funding has allowed the museum to cut the estimated $35 million budget for this year’s event by a third. The decision to accept the Poster House, which will house the exhibition’s permanent project, has also reduced the museum’s exhibition space needs by half. The redesigned Pavilion has also allowed the museum to move some of the production of the show, which will be moved to the basement of the building, to the west of the country, thereby saving money from transporting the works from London to the Pavilion. The Poster House will be inaugurated with an exhibition of the show’s work in 2020. The show", "The next Biennial should take place in the summer of 2021. The exhibition will be hosted by the Museum of Modern Art, where it will be presented as part of the exhibition “The Age of the Spectacle.” The full list of participating artists is as follows: 1. Gillian Wearing (1950–1977)\n2. Billy Paul (1939–1977)\n3. Julia Christie (1939–1977)\n4. Diana Flemons (1939–1977)\n5. Sue Harrison (1939–1980)\n6. Junya Ishigami (1939–1980) 7. Enrico Leitner (1939–1980)\n8. Kenneth M. John (1939–1981) 9. Garry Winograd (1939–1981)10. George Martin (1939–1981) 11. Jacob McCarthy (1939–1981) 12. Billy Moore (1939–1981)13. David Barlow (1939–1981)14. John Baldessari (1939–1981) 15. Susan Brown (1939–1981", "The next Biennial should open in 2020, with construction scheduled to start in 2021. “Unlikely but not impossible,” said Düsseldorf Mayor Holle Watz, who recently announced a €4 million fund for the project. “At the moment, the plan is to relocate the exhibition to another location. However, we have decided to move it to the future.”The museum’s current exhibition, “The Fate of Man: From the Fate of the Family,” is on view in the exhibition “In Defense of Man: Modern Art from the Occident” until March 9.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Maximilian Roesler, formerly of the Federal Institute of Technology in Berlin, as its next director. Roesler comes to the institution from the Museum of Modern Art in New York, where he has served as general director since 2017. During his leadership, he oversaw the installation of new works by artists such as Pierre-Auguste Renoir at the Brooklyn Museum and oversaw the renovation of the institution’s permanent collection.Roesler is succeeding Daniel Barenblit, who stepped down after a decade at the", "The next Biennial should take place in 2021 and the twenty-second in 2022.  Although it is believed that the first exhibition will be staged in the Museum of Contemporary Art in London in 2022, the new structure will extend the lifespan of the institution and will provide additional programs and exhibitions, such as the upcoming exhibition “Theosophy” (August 26–September 3). The two-thousand-piece show will be a wide-ranging exploration of the ideas, concepts, and the practices of contemporary art. Titled “Power and Vision” and organized by Shira Goodman and Graham Jarvis, the exhibition will include works by artists such as Richard Anuszkiewicz, Zaha Hadid, and Jean Nouvel; biennial essays by artists such as Inder Modi, Rebecca Watson, and Paul Mpagi Sepuya and Osei Yuasa; and a selection of biennial photos.“Power and Vision” will address power and ritual through the work of the artist‐in-residence, the artist-in-residence’s family, and the artist’s own family. The show will also take a critical look at the form of art and its relationship to power and politics.\n\n", "The next Biennial should be the most ambitious in its history. It will also include the earliest work on the subject by artists and will take place in the city of Epirus in northwestern Greece. It will be a partnership between the University of Uppsala and the University of Tartu.The first edition of the Biennial, called “Eco-Birds” in 2015, brought together artists and academics from thirty-six countries to explore the idea of “ecological justice.” The biennial was also criticized by some of the countries represented—including China, which declared that “the exhibition was against nature and of no possible ethical value.” In an attempt to placate China, the Venice Architecture Biennale rejected China’s request for the exhibition to be moved to Shanghai.\n\n\nNew York’s Metropolitan Museum of Art (MoMA), the Rockefeller Center, and the New Museum in New York are teaming up to create more than 500 new affordable housing units for artists and small businesses in Manhattan. The investment will fund the construction of five hundred new affordable housing units at the four institutions, which will share the same site as the Rockefeller Center and will share the same elevator. The Met, which recently announced", "The next Biennial should take place in 2021. Art historian and historian Judith Butler described the exhibition in a New York Times essay as “the greatest exhibition of art in the history of the world.” The opening of the exhibition was canceled a few weeks before it opened, but the changes in the work were not well received by critics. A review in the February 1977 issue of Artforum claimed that the changes were subtle but “ambitious.” Boschow added that the exhibition “came about as close to the original vision as an art museum can.” According to the New York Times, the change in the exhibition was not well received by many critics who felt that the new interpretation of the work was closer to ‘social realism’ than the original. In an interview with Artforum in October 2018, Butler praised Boschow’s work for “helping to open up a new world to painting,” but noted that “to say that this is a ‘radical new conception of art is an understatement.”  In February 2019, the museum withdrew the exhibition “Social Sculpture,” a collection of more than seventy works that was supposed to", "The next Biennial should explore and extend the work of artists who have contributed to the development of this exhibition’s history, and should consider the ways in which their work may be included in future editions of the exhibition. The 2018 exhibition, “The Work of Art and Art History,” was organized by Sianne Ngai and presented by artist-in-residence, Ng-An Lui, who is no longer involved in the show. The exhibition commenced on December 1, 1987 and featured works by forty-six artists. The exhibition reached its peak in the autumn of 1988, with the special exhibition “Summer of Love” (1988) featuring work by forty-nine artists and twenty-five artists from the United Arab Emirates. The exhibition returned to the United Arab Emirates in 2010, where it will be staged until at least 2021. In 2017, Ng-An Lui’s work was included in the twenty-fifth edition of the Biennial, and in 2018, Ng-An Lui’s work was selected by artist-in-residence, Nawaf Sobhan, for the 2019 exhibition “Art and Culture in Transition,” at the London-based Barbican", "The next Biennial should aim to “refocus” on the role of the ­artist and to “draw attention to the ‘problem of political and cultural history.’  The exhibition will stage more than fifty works by artists from Argentina, Bolivia, Brazil, Chile, Colombia, the Democratic Republic of Congo, Nigeria, and South Africa, and will be curated by Isabel Otero, the artistic director of the Rizal Museum of Art, in Buenos Aires.The six-month event, “Between the World and Me: Art and Artifacts,” will run from April 8 to April 10, 2020. \n\n\nThe National Gallery in London, which recently unveiled a new collection of more than four thousand works by contemporary artists and established new programs to address the gap between its exhibition-going public and its collections, has seen a surge in visitors over the last twelve months. According to the gallery, the number of visitors has increased by 26 percent since April 21—the day the museum announced its new partnership with the South Korean conglomerate SK Group to build a new $75 million museum in the former textile industry building, where the National Gallery currently has a show entitled 개서띘사", "The next Biennial should focus on “the future of art in India and the impact the work of artists such as Ramesh, Narsimha, and Kunal Bahl has had on the institutionalization of cultural diversity across India.” Titled “Art and Politics in a Time of Crisis,” the exhibition will take 12 weeks to complete and will be staged at various cultural spaces across the city.The exhibition, which was commissioned by the city’s civic body, will be divided into 20 multi-stage narratives. Each of the three main stories will comprise of an artist’s “campaigns,” a “reoccupation” or “symbolization” of an issue or a “thought,” and will be accompanied by a “thought experiment.” The first part will showcase the work of Kunal Bahl. The second part will focus on the work of Ramesh Mukherjee. The third part will showcase the work of Kukkum Martelli.“The future of art in India and the impact the work of artists such as Ramesh, Narsimha, and Kunal Bahl has had on the institutionalization of", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Alexandra Schonfeld as its new deputy director for collections and exhibitions. Schonfeld will be responsible for leading the museum through its $6 billion expansion and reopening, dubbed the Art of the Party, and will be based in San Francisco.“While the Art of the Party will be a critical component of MoCA’s future, we are excited to see how Alexandra will translate her experience and expertise to guide our collection and exhibitions, and to drive the Art of the Party program,” said David Pedrosa, cochair of the expansion committee. “We look forward to working with her and collaborating with her to present a truly exceptional exhibition for the second half of 2021.”The announcement of Schonfeld's appointment follows the completion of the first phase of the expansion, dubbed “The Big One;” with the opening of two new rooms in the museum\u0097The Gallery and the Showroom\u0097on October 6, 2021. The first phase opened in March and ran through November, and the second phase, “The Final Cut: Finding Art in the End,” opened in", "The next Biennial should be held at the Salzburg Castle in October 2019. The exhibition will be a collaboration between the FIM RIAC, the Meijer Foundation, and the Biennial Lifepaths. The biennial will feature works by artists such as Giacomo Pascual, Carlo Rosi, Margherita Vergara, and Agnes Martin.  Originally scheduled to open in 2019, the exhibition was rescheduled for 2020. The 2019 edition featured work by twenty-seven artists, including Jann Wenner and Urs Fischer.   The 2019 show consisted of fourteen works, the largest event of its kind. The biennial will therefore be able to hold a larger audience.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has appointed Sarah Oliver as its next director. Oliver comes to the institution from the Metropolitan Museum of Art, where she was the deputy director of curatorial affairs, where she has served as the director of public relations since 2017. She succeeds Michael W. Hujar, who has served as the museum’s director of education and public engagement since 2018.“Sarah has spent the last two years leading the Museum of Modern Art in Washington,", "The next Biennial should also include a new series of performances by artists that are collaborating across art and design to address issues of climate change and the power of design as a vehicle for social change.”In a statement, the Biennial said: “The deadline for the exhibit is coming up, and the exhibition will be open. But we will do our best to examine all possibilities to make sure that the exhibition, which will be a work of global importance, will be a work for everyone.”Curated by Kathy Huertas, the 2019 exhibition “Satoshi and the Computer,” will be on view until January 28, 2020.\n\n\nThe Museum of Contemporary Art (MoCA) is among the city’s major cultural institutions that have pledged to reduce their greenhouse gas emissions in an effort to limit the damage caused by climate change. The proposal, which was made in a letter sent to the president of the United States by more than 1,600 cultural and environmental leaders on January 28, commits curators and artists to working with a carbon capture and storage (CCS) system that would collect and store the greenhouse gas emissions from their operations.The letter reads: “The future we envision for our planet and our species is", "The next Biennial should take place at the New Museum in New York in 2022. Exhibitions may be moved to any time between the years of September and November depending on the museum’s financial needs.  The $100,000 Grace Hopper and Lawrence Weiner Biennial will culminate with a new exhibition, “The Three Musketeers,” at the Hussey Museum on November 21. The Art of Mimi Warr, a collaboration between the Hussey Museum and the Oklahoma Contemporary Art Center, will mark its centenary in 2020. The Art of Marc-Olivier Majerus, an exhibition that explores the art of sculptural performance, will be presented at the Art Institute of Chicago in 2021. Majerus’s work consists of more than 300 replicas of works by the Hussey Museum staff, who collectively created the works since its founding by its then-chair, David Logan, in the late 1960s. “The Museum’s relationship with the Hussey Museum dates back to the earliest days of the institution. Its founding was the culmination of a decades-long vision to engage with the art of", "The next Biennial should be in January 2020, with a design by Andrew Kreps, the curator of twentieth-century art and the former director of the Museum of Modern Art. The event will be hosted at the Institute of Contemporary Art (ICA) in New York, which will reopen on March 22.A group of artists and curators have formed, not for the first time, to protest the closure of the museum: Artforum reports that activists are currently participating in a walkout at the museum, which has been closed since March 13 due to Covid-19—the novel coronavirus. Activists have also advocated for the museum to remain closed until the coronavirus is contained. The institution has said that it expects the closure to last at least two weeks. “We are not here to continue to work with the virus,” said Michael J. McCarthy, the director of the Museum of Contemporary Art, in a statement. “We’re here to continue to create works and to be part of the city’s life.”\n\n\nVincent van Gogh painted the first-ever self-portrait, a self-portrait that survives to this day. The work, which was part of his", "The next Biennial should take place in 2021, according to the organizers; the promoter of the event, the American nonprofit Center for Art and Culture, is trying to raise $200,000 to stage the event. \n\n\nThe Palestinian Authority (PA), which has been embroiled in violence since it was formed in 1949, is planning to extend its borders with Israel in an attempt to create a buffer between the Jewish state and the West Bank. The announcement follows months of protests against the plans, led by the PA, the Israeli government, and international human rights organizations, and came amid violence between Israel and Palestinians.The PA has long argued that extending its borders would be in the national interest and has been accused of persecuting Palestinian citizens in an attempt to make up for the territory lost during the creation of the state of Israel. However, the plan has faced resistance from Israel, which considers the PA a terrorist organization, and has been opposed by most of the PA’s political factions. The PA’s leader, Mahmoud Abbas, has called the move a “historic mistake” and has vowed to veto any legislation that would extend Israel’s borders.According to the Israel Campaign for the Academic and Cultural Boycott, the PA’s plan", "The next Biennial should have been held in the spring of 2022. Instead, it was postponed until the start of the next academic year. The organizers say that the decision to postpone the exhibition was made in order to focus on the issues of the year: “The upcoming exhibition will not only address the current moment, but will also be a reflection of the year ahead.”The move has led to multiple complaints from local art dealers, who have since threatened to pull their works unless the organizers reschedule the event. The organizers say that the decision to postpone the exhibition was not made lightly and that they had not indicated why they could not begin the exhibition as planned.Following an open letter penned by a number of civic leaders, including the mayor of Beijing, Li Keqiang, and the city of Tianjin, the organizers announced that the exhibition would resume on July 21, with ten new works by the twelve artists featured in the exhibition. The reopening ceremony will be held at the Kunsthalle Basel in Switzerland the same day as the exhibition.\n\n\nThe Los Angeles County Museum of Art (LACMA), the California Adventure Center (CAFC), and the Los Angeles Police Department (LAPD) are suing each other over the public release", "The next Biennial should take place in 2020.”  \n\n\nAmerican Ballet Theater (ABC) is planning to move the upcoming season of its new series The Great Engagement to June 30, 2020, following a long-overdue revamp of its corporate culture. The move follows the announcement last month that the touring company—which has staged more than five hundred engagements across the United States since its founding by the Chicago-based artist and educator Mark Halper in 1967—was preparing to transition to a new four-weekform, the remainder of the season to June 23–June 26.The abrupt shift in dates follows a creative and financial crisis that has affected every facet of the company’s business, caused turnover in senior management posts, and strained relationships with its principal artists, Richard Diebenkorn and Alan Silver, and its principal directors, Jeffrey Seller and David Wagner. The New York Times reports that the management team’s decision to postpone the 2019 season, which was originally slated to run from March 15 to March 19, was made in the wake of the pandemic. The postponement has been widely criticized, including by the artistic directors of the New York Philharmonic, which pulled the annual event from April 5 to April", "The next Biennial should be held at the Ende University in the Haarlem- University of Thema, the Brandenburg Gate in Berlin, and the Palais de Tokyo in Paris in 2022.\n\n\nSouth Korea has reopened its first exhibition dedicated to Korean-American artists following the country’s March 5 coronavirus outbreak. The show, titled “Oolite Future,” was curated by director Kim Eun-sung and will run until March 12. Curated by Kim Eun-sung, Hwang Seung-kye, Kim Mim-keong, Kim Eun-sung’s son, Lee Seung-kye, and Kim Eun-sung’s daughter, Lee Hyun-ae, the event will include work by thirty-six Korean artists; thirty-five works from American artists; and two new works by American artists. A retrospective of the same artists’ work will open in November.“We are deeply gratified to be able to present this exhibition as part of our dedication to the cultural and artistic heritage of the United States,” said Lee Eun-sung. “We hope others will join us in our celebration of American artists and their contributions to Korean", "The next Biennial should take place in 2020.\n\n\nThe AlmineArt Foundation in Moscow has received a gift of forty-four works by contemporary artists from the Collection of the late collector Anatole Shagalov. The works are from the collection of the late wife of Russian director Natalia Shagalov, whose two-decade tenure spans from 1964 to 1977.Shagalov was one of the first collectors to open a museum in the former Soviet state in the 1970s. The institution, AlmineArt, now houses twenty-six works by twenty-nine artists, including Nadezhda Durov, Lina Gubenko, and Ursula and Christa Halberstadt. Though Shagalov passed away in 2010, his museum is still active—its current exhibition, “The Ceremony of Memories,” premiered at the New Museum in New York in 2011.\n\n\nThe Art Newspaper recently revealed that the prestigious Swiss pavilion for the first edition of the Fifty-Ninth Venice Biennale will be vacant next year due to the pandemic. The institution confirmed that thirty-five works by thirty-one artists will be taken over by SculptureCenter in partnership with the Swiss Federal Office of", "The next Biennial should be held in the city, in the Autumn, sometime next year. The theme will be “The Future of Life” and the inaugural exhibition, “The Future of Love,” will be open from June 17 to June 20.\n\n\nThe Museum of Contemporary Art (MoCA), California, has acquired the estate of El Paso-based artist Richard Avedon. The museum acquired the eight-thousand-piece, twelve-story, twenty-four-room, six-thousand-workpiece, and thirty-six-tonne works from the artist’s estate in July 2019. The museum’s board of trustees approved the deal in a vote that was held on August 7, the same day the estate filed a lawsuit against the institution claiming that the board was illegally approving a multimillion-dollar profit-sharing arrangement.Avedon’s works were acquired from artist-in-residence Terrance Mitchell, who died of cancer in 1996, and are currently on display in “Life After Death,” a new exhibition that is currently on view at the Contemporary Art Museum San Diego (CAMSEC), which is in the midst of a major expansion project. The museum will", "The next Biennial should be held in 2020. “We are now in the process of making the case for a new biennial to take place in 2021,” said Biennale CEO Tomás Frattina. The revival of the biennial comes at a critical juncture for the artistic landscape of the Italian city. According to the Art Newspaper, in 2019, the city council approved a seven-year budget of €1.4 billion for the biennial, which will encompass all of Rome, including the Pantheon, the Colosseum, the Pante del Sol, and the Forum, and will be led by a committee comprising leading cultural figures from the biennial and city government representatives.The election of Francesco Cipolletta, who has led the city of Rome since 1997, as mayor of the city of Venice in May 2020 marked the first time the city of Rome was re-elected since the late communist dictator Benito Mussolini swept to power in 1943.\n\n\nThe New York Institute of Technology (NYIT) will reinstall the institution’s sculpture program, on the heels of a three-year hiatus, in 2021. In a city where the number of installed works has declined by an average of", "The next Biennial should be held in Fall 2018, and the institution will announce further plans for its new location in the coming months. \n​\n\n\n\nThe Museum of Arts and Design (MAD) in New York has appointed Anna-Sophie Leon, a curator of modern and contemporary art, as its next executive director. Leon will assume her post on August 22 and will succeed Ruth D. James, who retired on June 30.“We are thrilled to welcome Anna-Sophie to MAD and are grateful to her for her leadership and experience,” said director Patricia Salter. “As a devoted collector, she has enriched our collections and curated many groundbreaking exhibitions, and brought innovative and compelling exhibitions and programs to our theater of the absurd. We are grateful for her persistence and vision in leading MAD to new heights and are confident she will continue to deliver innovative and compelling exhibitions and programs in a prominent position.”James will continue to serve as executive director while she undergoes treatment for cancer, and will assume her responsibilities on August 22.Commenting on her new role, Leon said: “I’m honored to be chosen by the board of trustees to lead MAD into its next decade. I’m committed", "The next Biennial should take place at the New Art Museum in New York next year. \n\n\nThe newly elected President of the United States of America, Donald Trump, has appointed Christine Boot to the position of director of the National Museum of the American Negro. Boot will assume her post in January 2020.“In her new role, Christine will oversee and build upon the work of the National Museum of the American Negro, which is already one of the most important cultural centers of the South, and will provide strategic direction and resources to advance the museum’s mission,” said Michael L. Williams, chair of the board of trustees of the Smithsonian American Art Museum in Washington, DC. “The National Museum of the American Negro is a national treasure that should not be neglected,” said Boot. “I look forward to building on the work of the National Museum of African American History and Culture to advance the African American experience and build upon the National Museum of Art’s collection of the African diaspora.”Born in 1961 in Atlanta, Georgia, Boot now serves as the executive and artistic director of the National Museum of the American Negro. The museum is currently undergoing a $1.5 billion expansion that", "The next Biennial should focus on the history of digital art in the Americas, with a particular interest in the region\u0097and the current political climate. It also hopes to re-establish a deeper regional relationship between Los Angeles and Mexico City, an initiative that has been stalled since 2015.The event will be hosted by Los Angeles’s High Museum of Art, along with the Solomon R. Guggenheim Museum and the Santa Monica Pier. The exhibition will be curated by Nathan Rabin, director of the Guggenheim. The first edition, which will include work by fifty artists, including Piero Manzoni, László Moholy-Nagy, Oscar Cesarco, and Urs Fischer, will open on March 29.\n\n\nThe Vatican City government is mulling over a move that would allow museums and other cultural institutions in Italy to remain closed until the coronavirus has been contained in Europe. Months of protests by Italian cultural workers have led the Vatican, which has one of the worst coronavirus outbreaks in Europe, to alter its plans.According to the Art Newspaper, the Italian government is now discussing the possibility of rolling back the restrictions placed on museums by the European Union in an attempt to help Italy cope with the coronav", "The next Biennial should be a showcase of all the work that has been created by artists in the last ten years. \n\nThe 2013 edition of the biennial, titled Art, was marked by the departure of curator Kiki Smith; of the festival; and of the entire architecture and design space. “The art in Biennial 2013 was a little chaotic, a little inconclusive, and a little unfocused,” Smith told the New York Times. “I tried my best to make a show that included all the elements that the art world has always wanted to include: large-scale installations, performances, lectures, performances, photography, videos, concerts, performances, television, television, television, television, television, television, television, television, television, television, television, television, television, and television’s future.”Few other events have so illuminated the contemporary art world’s relationship to technology and culture—or the current state of the art, as we know it, the digital. For several years now, the Brooklyn-based firm Anachronistic Projects has been working—in collaboration with over thirty artists—to create a digital exhibition that will showcase their work. Called Art, it will", "The next Biennial should be held in 2020. The official announcement of the new format will be made by the National Gallery of Art, Washington, DC, on March 6.\n\n\nThe Kitakyushu Biennial, which was in development for eighteen years but only began on August 3rd, has broken ground on a new exhibition. Titled hongan biman (travellers from different parts of the world), the inaugural exhibition will be organized as follows: Artist Biennials. Exhibitions will consist of twenty artists from the Kitakyushu region of Japan, as well as from China, China, Japan, Korea, and Korea. The show will consist of a wide range of art works, including photographs, sculptures, installations, works on paper, and performance.“Trying to move beyond the Japanese visual arts, and also the Western visual arts, has always been a challenge for me,” said Sokko Nakamura, the curatorial director of the National Museum of Modern Art and the Kitakyushu Museum of Art. “I see this new exhibition as an attempt to do away with this distracting and confusing distinction.”The fifty-third edition of the Kitakyushu Tri", "The next Biennial should take place in the summer of 2021. According to Artnews, the exhibition will be hosted at the Centre Pompidou in Paris. The first edition of The Seven Wonders of the Ancient World, which was organized by the Museums Association, will be held in Qatar in September 2020. “The future of our cities, the future of our civilization, lies in the hands of these artists, in the hands of the people, in the hands of our governments, and in the hands of our future generations,” said Danil Corluka, president of the Association of French Contemporary Art (AFCA). The Art Newspaper reports that the exhibition, which will focus on the history of art from around the world, will be curated by Artwork France and will take up themes and subjects such as mobility, materiality, and the environment. The first edition of The Seven Wonders of the Ancient World, which opened in January 2020, attracted more than 1,150,000 visitors, including Hugo Boss, the SBS Asia News Network, and the London Film Festival. \n\n\nThe Los Angeles County Museum of Art (LACMA), the Los Angeles Museum", "The next Biennial should be held at least once every two years, with the goal of eventually creating a new work.  For the current exhibition, curated by Jean-Michel Basquiat, the artist restructured his exhibition in order to better reflect the complex and precarious history of art.\n\n\nThe Los Angeles County Museum of Art (LACMA) is teaming up with the Museum of Contemporary Art (LA) to foster a new generation of artists through its Insider Program. Introduced in 2020, the program, which debuted at the LA County Museum of Art (LACMA) and the Museum of Contemporary Art Kansas City, is a partnership between the two institutions that aims to develop and present groundbreaking work by emerging and established artists.Established by president and CEO of the LACMA institution, Kate Fowle, and LACMA director and CEO Robert De Niro, the program is a way for the museums to extend their collections' reach by engaging with local, regional, and national artists. De Niro and Fowle have been collaborating with Insider on various projects, including a series of artist-designed, free public tours in 2020, and in 2017, the two collaborated on a project that involved teaching twenty local artists by the same artist", "The next Biennial should be held in 2020.\n\n\nThe Institute of Contemporary Art (ICA) in Rome announced today that it was instituting an overhaul of its structure, its programming, and its visitors' experiences in an attempt to foster greater diversity and more inclusivity in the institution’s exhibits and its collections. The plan, which addresses three main factors that contribute to an exhibition’s success, includes the reduction of the size of the exhibition and the introduction of new programs and project spaces designed to be more accessible to the public.According to a statement released by the institute, the reform aims to “implement a new, more unified, and flexible ICA. It also aims to promote an exhibition of works that are presented in a more harmonious, interrelated, and attractive way, which is in line with the radiance of the ICA.”Though the institute initially proposed reducing the number of days that the ICA appears on the calendar by three months, it ultimately decided against the change, explaining that the goal was to focus on “creating a more balanced ICA, one that reflects the full range of the ICA’s collections and that will be able to represent all the ICA’s collection", "The next Biennial should take place in the spring of 2021. The museum is currently working with artist-run spaces such as the Phallus Project and the Chimney and the Sepulchre to implement new educational initiatives, promote the work of emerging and established artists, and present more of the collection. The first exhibition will focus on the artist-built city of Venice, known for its vibrant, magical mosaics. \n\n\n\n\n\nSuellen Artesenses (SA) has published a new research paper on the effects of 5,10,15, and 20 nanometre telescopes on the climate change deniers in the United States, in conjunction with the biennial Art Congress. In the research paper, which is based on data from the US Climate Investigations Program (CAP), the Southern Methodist University, the climate researchers Susana Barroso and Zanele Muholi demonstrate that climate scientists have been grossly underestimating the climate impact of human activities.“The problem with climate scientists’ work is that they’re not experts,” Barroso told the Los Angeles Times. “They don’t understand that energy, heat, and water are the raw materials that make up life. So they", "The next Biennial should be held in 2022, when the museum will be fully renovated. Its reopening date will be pushed back to 2020 and the biennial will return to the Tunisian capital city of Algiers.\n\n\nThe Minneapolis Art Museum and Minnesota International Film Festival announced that it has received a gift of more than three hundred works by nineteen contemporary artists from the collection of the Dutch artist Peter Dreher. The donation includes works by Rachel Weisz, Emily Hall, Amy Alkad, Carlo Cifuentes, Jean-Luc Nancy, Teague Oostholt, Othmane Oostholt, Johanna Oostholt, Herman Rockwell, and David Robertson.The museum also announced that it has received a gift of fifty-three works by Berlin-based artist and collector Hans Jørgensen. The works, which were donated by his son, Simon, are included in the museum’s collection and are on display in the museum’s collection gallery as part of a three-way exhibition of the artist’s work; the Peter Dreher/Hans Jørgensen Collection is on display in the Peter Dreher–Simon Jørgensen Museum; and", "The next Biennial should take place in 2022 and will take place in the downtown area of the German city of Heidelberg. The exhibition will be hosted by the Heidelberg-based museum and will be led by the curator of contemporary art, Bernd Imhof. The twenty-first and twenty-second editions of the exhibition will be held in 2022 and 2022, respectively, and will be presented by the Heidelberg-based institution and the city of Heidelberg. The fifth edition of the exhibition will be held in 2021 and will be presented by the Berlin Art Museum.\n\nThe Museum of Fine Arts (MFA) in Boston has received a $10 million donation from philanthropists Shervin Pishevar, David and Charles Evans, and Larry Fink, who together pledged $10 million to the institution in support of its new $50 million building, which will make the museum a national treasure. Pishevar, the founder of the nonprofit Foundation for Cultural Alliance, which supports cultural organizations working with and in partnership with the arts, and Evans, a cofounder of the investment firm Apollo Global Management, have long shared their passion for the arts and for supporting creative industries. Pishevar described the gift", "The next Biennial should be held at the Art Museum of Chicago, which recently announced it will not be able to organize the event due to a lack of funds. Next year, the museum will hold a series of exhibitions dedicated to work by underrepresented artists. The 2020 edition, titled “Toward an Ethnographic and Cultural History of Blackness,” will open on September 22. \n\n\nThe Black Box Theatre Company, the New York nonprofit that provides arts and cultural programming to low-income black and African American families, announced today that it is laying off all eighty-two part-time and full-time staff members of the eighty-six-person company, which operates out of one of New York City’s largest commercial spaces, the Black Box’s former space in Gowanus, Brooklyn. The layoffs will be made across all departments, with the elimination of more than four hundred full-time positions across seven departments: business, customer service, operations, and training.The move follows a wave of cultural layoffs that have hit the New York City theater community as the city’s health-care system struggles to keep up with the surge in COVID-19 cases. According to the New York Times, the NYC", "The next Biennial should be on March 5–March 7, 2020. The 2019 edition was held in the UK’s National Museum of Britain, and consisted of twenty-eight works.  \n\n\nThe museum in charge of the largest collection of Islamic art in North America announced today that it is planning to open a new space dedicated to the art of the sixteenth-century Spanish Sufi thinker, philosopher, and mystic, the artist Ismael El-Dahab.The new museum, which will be constructed in the city of Madras, in the alpine foothills of the Andaman and Nicobar Islands, and will boast of seventy-five thousand works, will be inaugurated by a public screening of a group show of the artist’s work, titled What Is Life? In Despair, (Los Angeles: Sotheby’s, 2019), at the Los Angeles County Museum of Art (LACMA), on January 28.“The exhibition was organized by the artist’s daughter, Ismael El-Dahab, who had the idea for a museum in the first place. We were inspired by her work and the way she captures the essential beauty of life through her exquisite and complex paintings", "The next Biennial should be held at the Ace Hotel in central London, in the city’s city centre, on September 23. Current director Michael Reynolds said: “The sixth edition of the Global Citizen Award will be a landmark event, marking the end of an era. It will celebrate the work of ten ten outstanding artists and will draw from a diverse range of sources—from the works of artists who have never before been included in an award and whose work has not yet been presented before—to provide a truly international platform and a platform for their future work.” In recognition of the work of the current and former winners, the biennial will receive a prize of up to $3,500, which will be distributed by the Ace.\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Ruth Paltrow as its next chief executive and chief curator. The appointment comes a month after the museum announced its intention to sell off its cultural assets and remodel the grounds of Tate Britain, which will move to a new home in St Martin’s Green in 2020. The institute’s director, Maria Balshaw, will take up the post in November.“By moving to the new site and building a", "The next Biennial should be held in the Winter of 2019, and the date of its closing will be announced in the Spring. The biennial will be preceded by an exhibition of works by artists and collectors who have made notable contributions to the museum’s collection. The biennial will also include an exhibition of works on loan from the museum to the University of St Andrews.“The museum is extremely fortunate to have been able to present the exhibition of works by some of the most important artists of the twentieth century, and to have the opportunity to present these works in their entirety in the presence of the public,” said Anne White, chair of the biennial team and curator of modern art. “We are also delighted that the exhibition will be open to the public for free on Monday 29 March 2019, the last day of the exhibition. We thank everyone who has taken part in the exhibition, and look forward to presenting the works in person in the coming months.”The biennial’s inaugural edition was held in the museum’s new home in the Arts and Culture Complex, the university’s arts and culture hub, in the city of Glasgow. The museum opened to the public in 2014.\n\n\nThe Ritz,", "The next Biennial should be held in 2021.  \n\nFor the last twenty years, the United Kingdom has been hosting major international art events at its Royal Festival Hall, as it grapples with a massive public health crisis caused by the coronavirus (Covid-16). Since the coronavirus was discovered in Wokingham in March, it has been moving to the north of England, the south of Scotland, and the east coast of England, affecting people from Wales and the north of England.According to the Independent, the coronavirus has spread to every part of the United Kingdom, affecting more than 1.2 million people. According to the BBC, the number of people infected is rising rapidly. The coronavirus has been blamed for causing a spike in cases in the United States, but so far the outbreak in the UK has been confined to the west of England, with cases being reported from Lincoln, Camberwell, Lewes, and Oxfordshire.The coronavirus is spread mainly from person to person, but it can also be spread through close contact with infected faeces. There are currently more than 158,000 cases in the United States and five coronavirus-related deaths—including those in California, Washington,", "The next Biennial should be held in 2022. A selection of works by the winners will be presented at a later date.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for how the city can hold off-site exhibitions of works by artists whose works are currently on display or scheduled to be on display in the future. The guidelines were developed after an exhibition at the Museum of Modern Art (MoMA) last month, when a group of artists were scheduled to participate in “Heritage Cities: Art on the Move,” which highlighted the city’s art museums.Organizers of the exhibition, which was part of the city’s $1 billion reconstruction of the Museum of Modern Art, decided to cancel the show after the organizers learned that the works, which were part of a larger exhibition, “Heritage City: Art on the Move,” would be removed from the museum. “We respect the decision of MoMA, and have taken the decision not to proceed with the installation,” said commissioner Timothy Rub, who added that the department’s review of the works prior to canceling the show had concluded that the exhibition was not a good match for the museum", "The next Biennial should take place in the autumn of 2022. In the meantime, the museum will assess the situation with the institutions involved in the exhibition.The museum is currently restoring the museum’s holdings of national and international artists, including Arnold Bode, Piet Mondrian, and Kiki Smith, as well as expanding its collection of African art by exhibiting works by contemporary artists such as Albin Mpagi Sepuya and Anselm Kiefer.\n\n\nNursing school teachers in the United Kingdom are protesting a new law that will require them to work from home during the coronavirus pandemic because it is a “job killer” that will “eat into mental and physical health.” Since the coronavirus is spread mainly from person to person, many schools are facing financial losses and the majority of cases are in remote areas of England and Wales.Since the school strike began on March 22, more than 160,000 workers in England and Wales have joined the action. Among the striking workers are teachers, midwives, nurses, physical therapists, carers, and other human-resource personnel employed by schools such as Kings Academy, Birkenhead, and Ealing Broadway, where thirty-six staff members were diagnosed", "The next Biennial should take place in the spring of 2021, with the exhibition marking the anniversary of the signing of the Convention and the outbreak of World War I. The 2020 theme is the Order of the British Empire, for which the Royal Shakespeare Company will stage the first production in London in more than seventy years.\n\n\nThe Flemish government has ordered the reorganization of the country's cultural sector in an attempt to stem the growing burden of the country’s growing number of drug overdose deaths. The new regulation, which was adopted in the Federal Public Protection Act on Tuesday, requires three quarters of new funding to come from the European Union; the remaining two quarters from other sources. The legislation also requires a threefold increase in the government’s budget for the culture sector.In a statement, the Federal Chancellery, the ministry of culture and of culture and education, and the federal parliament said the bill “ensures a sustainable and strong cultural sector and ensures that cultural production is properly oriented towards economic and social inclusion.” The reform, which requires legislative approval, will take effect in March 2021.The government hopes the change will decrease the number of drug overdose deaths; however, the exact measure has not yet been determined. The", "The next Biennial should be released sometime in 2021 and will consist of ten exhibitions based on the themes of the twenty-fourth and twenty-fifth Biennials, which will also be presented by artists of various nationalities.\n\n\nThe National Endowment for the Arts (NEA) has released guidelines for the distribution of $4.5 million in funding from the Cleveland Museum of Art’s Prestel Fund. The funds will go toward transforming the Oklahoma City institution into a cultural resource for Ohio communities. “The goal of the Cleveland Museum of Art is to be a positive and transformative cultural resource for the people of Cleveland,” Paul Mpagi Sepuya and Michael Pfeifer, cochairs of the Cleveland Arts Partnership, said in a joint statement. “We are grateful to Cleveland’s residents and local arts and cultural organizations for their enthusiastic support of this project. We look forward to working with the Cleveland Museum of Art and the surrounding community to create a lasting legacy for the Prestel Fund and the Cleveland Metropolitan Community Foundation.”Since its inception in 1986, the fund has distributed $3.8 million to help cultural organizations in the Cleveland area, including the Cleveland Clinic", "The next Biennial should take place in September 2020, with an opening of the exhibition in March of 2021. The 2019 show, “The Garden of Life,” comprised twelve works by artists such as David H. Ghent, Wolf Kahn, and Jodi Throckmorton, and was held at the Art Institute of Chicago.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it has created three new statutory grants for arts and cultural organizations. The new $2 million awards, which are available to arts and cultural organizations that are performing at least twenty-five hours of programming per week, will be distributed through the DCLA’s Arts and Cultural Economy Grant Program, which was established under New York City’s New York City Cultural Affair (NYCCA), and will total $3.5 million. The National Endowment for the Arts (NEA) was awarded $1.5 million and will distribute the funds through the Pace Arts and Cultural Fund, which was established by the Pace family, which also owns the Metropolitan Opera, and will distribute the $1.2 million Grant for Public Benefit, which was established by the Dellons and will be", "The next Biennial should be held at the newly renovated East Bank Galería de las Americas in Madrid on March 19-March 21, 2020.\n\n\nThe Vienna Art Museum (VIM) in Austria has welcomed three new members. The institution announced today that Oskar Schlegel, Tobias Pfeifer, and Andrea Palma have been appointed as co-chairs of the upcoming edition of the German-Austrian Biennial. Schlegel will be the first to lead the museum in the presence of its new building, the Kunsthalle Potsdamer Straße, and the Kunsthalle Basel in Switzerland, which is currently undergoing a $51 million renovation.Pfeifer will lead the Frankfurt art center Art Bau, which will hold its inaugural event in the new Frankfurter Kunsthalle in August. During his tenure, the Frankfurt-based artist will also have the opportunity to present his first solo exhibition in the new exhibition space. In December 2019, he received the prize for his art at the Venice Architecture Biennale.Palma, who has lived in Vienna for more than twenty-five years, will lead the Frankfurt art center Art Basel, which will be inaugurated in June 2020. After", "The next Biennial should be held in 2021. The announcement follows the reopening of the city’s museums and the announcement that it will not be closed next year as originally planned.\n\n\nThe National Geographic Society is planning to move its headquarters from its current home in Washington, DC, to a new location in Mexico City, reports the Art Newspaper. Postponed from July 1, 2020 to April 7, 2021, the move will involve a series of renovations that will determine the layout of the building, the location of the museum, and the exhibition space.The move will allow the Smithsonian Institution—which has a current exhibition space in the building—to increase its footprint in the city of Mexico City, which hosts more than 3,500 exhibitions annually and is home to the National Museum of Mexico City (MMAC).“The National Geographic Society is an important part of the National Geographic Family,” said National Geographic CEO, Mary Anne Carter. “We are excited to commit to Mexico City and to work with the City of Mexico City’s residents and civic leaders to make this a truly National Geographic–designed museum. We will continue to work closely with the local community and Mexico City’s government to ensure a museum that belongs", "The next Biennial should be held at the Museum of Contemporary Art in the Arts, New York, in 2021.\n\nThe Colombian artist Andrés Manuel Gómez-Velasco, whose work explores the idea of time and the rhythms of motion, has died at the age of eighty-eight at his home in the capital Bogotá. He was known for creating works that address time, rhythm, and time-based art, which often addresses the uncanny.Born in San Pedro Sula, Gómez-Velasco studied at the Santander Institute of Art History, where he studied with Suriname-born artist Rayyane Farago, before working for years in the art department at the University of the Andes. He also worked as a street painter and cartoonist, and became a teacher before cofounding the studio in the city of Medellín. Gómez-Velasco’s work is part of a small but vibrant group that emerged in the 1980s that blends surrealism, painting, and sculpture. “In the late 1980s, I was invited to teach at the Andes Institute. I was not sure what I would do, but I decided to make a mural", "The next Biennial should be in 2021, and the date will be announced in a statement from the biennial. The 2020 iteration of the event, titled “The Matrix,” ran from August 5–August 7.\n\n\nThe Third Bank of the Netherlands at the Hague announced today that it is reorganizing its board and is preparing to introduce new governance structures with a view to fostering greater transparency and accountability. Although the institution did not specifically mention the term “privatization” in its statement, the bank is planning to redefine its terms of use so that they no longer apply to the “next generation of artists.” “If you are a next-generation artist, we want to let you know that we are in touch with you,” the bank said. “We are open to communication with you and to the next generation of artists through our platform. The new board will focus on promoting opportunities for new ideas.” The bank’s new board members include Robert van der Vorst, chairman of the bank’s European division; Susanne Moschino, the bank’s director of international trade; and Marcel Sjöstrand, the bank’s director of", "The next Biennial should take place in 2021, and the twenty-fifth in 2021.\n\n\nThe Tate Research Center in London has appointed Ashley Fitt, a conservationist, thinker, and curator, as its new director. She will succeed Dame Alison Stern, who has led the Tate since 1996, and will assume her responsibilities on September 1.“Ashley has the ability and passion to bring new and stimulating ideas to the museum, and to shape its future direction,” said Diana Coventry, chair of Tate’s board. “Her new role and the institution’s long-term trajectory are directly in line with our long-standing values, and in line with the Museum’s long-term vision. She has demonstrated extraordinary ability and ambition in building and sustaining the RSC, and she is clearly passionate about what she does. After a successful career in government and academia, Ashley returns to the RSC to bring home a new collection, new exhibitions, and new projects, and to expand the museum’s international reach.”Stern, who has helmed the Tate for twelve years, will remain on staff as director of the Tate Research Center and chair of the board of trustees, which comprises ten people including", "The next Biennial should be held in . . . 2021. Our next edition will include a wide-ranging program of poetry readings, presentations, and performances, the first in the series since our 2012 exhibition. In addition we will introduce new works and focus on contemporary issues, reflecting the current conditions in the contemporary art world. We are deeply impressed by the work and presentation of the artists who have participated in the exhibition. We are also enormously proud of the work of the other curators and artists on this year’s exhibition. Our exhibition “The Art of Weaving,” which was held in January 2019, was quite a success and was nominated for a Pulitzer.\n\n\n\n\n\nSits atop a massive, rambling, and geometric edifice, the Arc de Triomphe in Paris—a monument to Jacques Huyghe, a French master of abstract sculpture whose work involved carving and fabricating works that are sometimes interwoven and sometimes appear as if they are made of nothing but spirals, circles, and ellipses—and extends for a further seven hundred feet into the Parisian night sky. The structure, called Arcadia, is comprised of nine concentric rings, each with a pedestal of eighteen-carat diamonds", "The next Biennial should also take place in the city in 2021. Southwestern Art Museum (S.W.A.M.): Developed in partnership with the W.A.M. Foundation, the Biennial will focus on themes of the twentieth century, including social change and the relationship between the physical and the cultural. It will also present an exhibition of work by a group of artists, including John Barry, Katharina Celant, Martha Cahn, and Paul Gauguin. The Hartford Museum of Art: Hannah B. DeCordova, Mary DeAngelis, and George E.M. Baran, who were named the inaugural directors of the Hartford Museum of Art in 2017, have announced plans to construct a new museum, which will be located in the historic former mill buildings, on the grounds of Yale University. The project is being organized by local partners Amanda Pope and Nicky Barnes.The Massey-Lemmer Museum of Art at the University of California, Los Angeles: The museum’s board of trustees announced on Tuesday that the institution will hold an exhibition of work by David Salle, Paul Gauguin, Jean-Luc Godard, and others in the history of the institution", "The next Biennial should premiere in October 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to shutter its doors for a period of six weeks in early December to allow the city to infuse some $500 million into the city’s cultural sector. In a letter dated December 7, the museum’s board president, John Gilliam, said the decision was made in the interest of the institution, which has faced mounting criticism for supporting the city’s arts institutions in the form of loans and grants since it was founded in 1933 by wealthy industrialist and philanthropist Eli and Edythe Broad.“MoCA is deeply committed to supporting the city’s arts and community,” Gilliam wrote. “The Broad Foundation and Eli and Edythe Broad have made it clear that their support of the arts is not mutually exclusive with their support of the city’s cultural institutions. It is our mission to support the city’s arts and push them forward with a level of philanthropy and creativity that is unparalleled in the country.”While the Broad Foundation has issued multiple guidelines on how institutions and cultural sites can receive funding, the guidelines state that MoCA must", "The next Biennial should take place in 2021 and will be led by the French curator Pierre Fiffeur and will be hosted at the Musée du Quai Branly in Paris. The new theme, “The New World Order” will be a blend of history and contemporary social issues and will focus on the themes of power, religion, and the relationship between people and the environment. \n\n\nThe Chanel Fund has appointed Sarah Wintour as its inaugural Creative Capital Fellow. The Cannes– and Berlin–based, New York–based organization has awarded $17 million since it began in 2014, with the first round of grants totaling $6 million awarded in 2019. Wintour will be working with William L. Barr, who has helmed the fund since 2012, to curate a ​​series of collaborations between artists and the charitable organization.“Sarah Wintour’s contribution to the Chanel Fund’s mission to support the creative and artistic work of underrecognized and underrecognized artists is inspiring and humbling,” Barr said in a statement. “The Chanel Fund was created to foster an understanding and appreciation of the extraordinary world of contemporary art and to provide a resource for the destitute or", "The next Biennial should take place in 2021, and the show’s final work, the retrospective “Art for Life,” will be released this fall.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Laura Owens as its next interim director. Owens will assume her responsibilities on October 14. She succeeds Carrie Severin, who served as the National Gallery’s director of curatorial affairs and was the first woman to head the institution.“Laura’s vision and ability to build on the National Gallery’s legacy while steering through a complex and difficult transition was a perfect fit with the National Gallery’s mission,” said National Geographic’s director, Deborah Glaser. “Laura brings a wealth of experience across expansive disciplines in art history, and we are confident she will continue to drive the gallery’s goals and actions with the speed, agility, and dedication she demonstrated throughout her tenure.”A scholar and educator, Owens has taught at the institution for more than twenty years. She is currently chair of its department of art history, and she was previously the curator of modern and contemporary art at the Washington, DC-based nonprofit Nara Mendieta�", "The next Biennial should be held in May 2021 and will be organized as an international exhibition. Dubbed “Between the Sun and the Moon” (Light and Space), the show will be based on a short story by the late author and automatic translator Elyn Zimmerman, which will explore the connections between the sun, the moon, and the earth. The show will focus on the center and surface of the sun and explore the concept of “parallelism” (also known as the same or parallel realities). Its inaugural exhibition will feature works by the artists Gabriel García Márquez, Leila Fadel, and Ikon Seaworld.\n\n\nThe American artist and activist Dadaist Karl Lagerfeldt has died at age ninety-three. Born in New York City in 1936, Lagerfeldt grew up in a Germanic American Jewish community, studied German at Harvard University and the University of Chicago, then studied at the University of California, Berkeley, before going on to study in Berlin. He ultimately studied at the Museum of Modern Art (MoMA), where he met his wife, Norbert, and began a four-decade-long show at the gallery. In 1967, MoMA began a show of", "The next Biennial should be held in 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Dorota Bojic as its next director. Bojic comes to the museum from the Boston-based nonprofit ArtPlace, which she began in 2015. The nonprofit is working with the city of Boston and the Massachusetts Department of Cultural Affairs (DCLA) to organize the fifty-ninth edition of the Boston Art Biennial, titled Just England, and will begin hosting the event in November.“As the director of a contemporary art museum, Dorota brings an unique perspective in guiding the museum through a challenging and challenging exhibition calendar, planning for critically endangered exhibitions, and building and maintaining a strong collection,” said Harriet H. Robinson, the museum’s interim director of curatorial affairs. Bojic succeeds Peter Gallagher, who led the museum for twenty-five years, and will take up the post on January 15. “Peter has been instrumental in the museum’s journey to become a world-class contemporary art museum, championing exhibitions and programs that connect audiences across the globe,” said Bojic. “He has been a champion of", "The next Biennial should be held in the spring of 2021.\n\n\nThe La Brea Tar Pits, home of the now-defunct Museum of Arts and Design, in California, have been purchased by the Tacita and James LeBretta family, who purchased the historic site from the Tacita and James LeBretta, the founders of the Abu Dhabi-based investment firm BlackRock, for $1.6 million in a real estate deal that also saw the sale of several other buildings on the property. “We are thrilled to be able to contribute to the legacy of our beloved landmark and to continue to grow the Museum of Arts and Design through our exhibitions, education programs, and exhibitions,” said museum director Dan DiGenova. “We look forward to continuing our mission of engaging with the world through our art and to furthering our collection and exhibitions on the history of contemporary art through the acquisition of future works by this and other great artists.” The Tacita and James LeBretta are also looking to expand the Museum’s collection in the US so that it can better recognize the broader range of Asian art of the twentieth century. The family plans to open a", "The next Biennial should be held in 2020. The institution has already announced that it is reopening in January 2021.\n\n\nA few weeks ago, the French government announced that it intends to introduce a series of regulations designed to protect the cultural and artistic heritage of the country’s ancient sites by 2025. The new laws, which are currently being drafted, would stipulate that sites designated as “endangered” by the country’s antiquities authority, the Ministries of Culture and Tourism, and the Cenotaph would be given at least five years to determine whether they are “in danger of being deaccessioned by the industrial or commercial sectors.” The legislation is expected to be introduced sometime in the first half of the year.France’s Culture Ministry has already begun phasing out antiquities from sites it owns and has plans to dismantle more than 1,400 sites, but the move has faced fierce opposition from the French government and several of the country’s most prominent cultural figures. On Wednesday, May 27, the Ministry of Culture unveiled plans to take the antiquities authority even further.In a press release, the ministry said that the changes would “protect the cultural and artistic heritage of our country", "The next Biennial should be in 2020 to inaugurate the new museum, which will be inaugurated in 2018. \n\n\nThe Museum of Fine Arts (MFA) in Houston has appointed J. Paul Getty’s son Matthew as its next interim director. He succeeds Stephen DeRose, who has led the museum since 2009.“Matthew’s leadership and experience in the field of contemporary art will be critical as we embark on a transformative transformation as part of the ongoing transformation of the Museum of Fine Arts,” DeRose said in a statement. “We are fortunate to be able to collaborate with Mark’s passion, intelligence, and creativity in bringing our future vision forward.”DeRose will step down as director on August 1 and will assume the role of acting director until the institution reopens in the fall. During his four-year tenure, he has worked to develop and improve the permanent collection, expanded its exhibition-viewing experience and educational offerings, and launched the exhibition program. He also initiated the Biennial Legacy initiative, which aims to create a unique collection of art and artifacts from the Getty’s collection in order to be accessible to the public, and has worked to improve the museum’s infrastructure and", "The next Biennial should be held in the spring of 2021. \n\nThe Hong Kong-based contemporary art museum, the Hong Kong Art Museum (Hangar), will open a new exhibition space in Beijing in June. The exhibition will feature work by forty-five international artists and will run for twenty weeks.The newly renovated space will boast four exhibition spaces and will offer a variety of contemporary art experiences, from lectures to screenings, workshops, and lectures. The Hong Kong Art Museum was established in 2014 by Maria and Wai Hui Huang, who have been working to create a new contemporary art space in Beijing for more than five years. The museum opened in a former steel factory in the city’s Hsinchuan district and was completed in 2019. In June, the museum reopened to the public following the restoration of the original building and several new exhibitions and public areas.The newly commissioned exhibition, “Hong Kong: Contemporary Art from Asia,” will be presented by the Hong Kong Academy of Arts, Hong Kong Art Museum, Hsin Tong University, the National Museum of Fine Arts (MoFA), and the National Taiwan Museum of Art. The exhibition will be accompanied by a new book, “Hong Kong: Contemporary Art from Asia�", "The next Biennial should take place in September 2021. The 2019 event, which was organized by the San Francisco Museum of Art (SFMoMA), was canceled due to the Covid-19 pandemic. The biennial will now be led by architect-philosopher Dusan Kamić, who will take up the role of director. The 2019 event, which was organized by the SFMoMA, was canceled due to the Covid-19 pandemic. The biennial will now be led by architect-philosopher Dusan Kamić, who will take up the role of director.The 2020 event will be held at the Museum of Modern Art (MoMA), where the 2020 exhibition will be organized. The 2020 event will be held at the Museum of Modern Art (MoMA), where the 2020 exhibition will be organized.The 2020 event will be held in the spring. The 2020 exhibition was originally scheduled to begin on September 24.\n\n\nThe Oolite Arts, a new contemporary art gathering held in Japan, is canceling a proposed third edition for February 2019, citing the worsening health crisis in the country as the reason. The cancellation follows a wave of cancellations and relocations in the cultural sector caused by the", "The next Biennial should be a collection of works by women artists for the first time,” said special exhibitions curator Anathema Mulk, who is board member of the Royal Academy of Arts, and whose work is exhibited in the upcoming exhibition, “The Silent Revolution,” at the biennial.Mulk explained that the theme of the exhibition is “to be found on the threshold of a new kind of secret society,” that will explore the idea that consciousness and the body are interconnected. Its work will also be presented at the exhibition, “The Body Art of Art,” which is scheduled to open in October.\n\n\nThe prestigious San Francisco Museum of Modern Art (SFMoMA) has appointed Elizabeth Wozniak, an artist-in-residence and the founder of the eponymous label Woolly World, as its next director. Wozniak came to the institution in 2016 as an assistant curator of contemporary art, where she has worked since 2015.Wozniak joins SFMoMA from the Metropolitan Museum of Art, where she served as curator of twentieth-century and contemporary art from 2011 to 2016. During her tenure, she curated exhibitions such as “Museums and Contemporary Art�", "The next Biennial should be held in the spring of 2022. The Seattle Fair will also hold an additional edition, “The Future Is Present,” in the autumn of 2022. The next Art Basel Hong Kong exhibition, “Future Sight,” will be held in the spring of 2022.The New Art and Climate Event, which was created with the goal of addressing climate change, will resume in the spring of 2022. The Next Art and Climate Biennial will be held in the spring of 2022. The Tokyo Triennale will be held in the spring of 2022. The Beijing Art Biennale will be held in the spring of 2022. The Shanghai Art Biennale will go on as scheduled. The Venice Architecture Biennale will be held in the spring of 2022. The New York Art Biennale will now run from March 26 to March 29, 2022. It also has added three additional cities to its schedule, Tokyo, Hong Kong, and New York, and will reveal its revised schedule for the event in the coming weeks. The Netherlands added three additional cities to its list of participating cities and has extended the opening of the event to March 29. The six-city fair is now slated", "The next Biennial should focus on the revival of polymath theory through the work of a selection of leading practitioners\u0097for many years, only a handful of visitors to the museum were able to taste the ground upon which the theory was based. In this way, the exhibition will honor the long-standing and mass-produced theory of the period, and will serve as an opportunity to expand the exhibition’s scope and reach by presenting the works in a new way.The exhibition will also be dedicated to two contemporary artists who have been pressing the boundaries of classical and modern art by positioning themselves in the tradition of the late Hamburg-born Paul Klee. Klee’s work is both sensitive and utterly idiosyncratic, bringing together the forces of nature and of the artist himself. The exhibition will feature works by the artist and three other artists from the Frankfurt School, Karl Lagerfeld, Hildegarde Georg and Wolfgang Lüpertz. “We had a great time making this exhibition,” said Monica Pappas, director of the Frankfurt School. “The Biennial of Paulo Cervantes will be an extension of that for us, and a continuation of our long-standing commitment to the exhibition of the work of the late Paul", "The next Biennial should be on December 10–December 12, 2020, and will include works by the seventy-five artists who participated in the inaugural edition.  The 2019 edition, which was curated by Junya Miyagi, epitomized the spirit of the Biennale in its diversity of representation. He introduced a new exhibition format that included solo presentations of work by one artist, a rare occurrence in the ninety-five-year history of the event.The 2019 edition featured works by seventy-three artists, including Alison Cameron, Sarah Davis, Ed Moses, Christian Meier, Ed Ruscha, Peter Sohn, Rindam Singh, and Anna Wintour. The exhibition, which marked the first time the Biennale has opened to the public in Europe, drew an additional forty-two artists, including Charles Ray, François Oppenheim, and Wang Wei.The 2019 edition was organized as part of the 2018 World Biennale, which was held in the capital city of Beijing, and was curated by Igor and Yuki Kondo. The theme of the show was “Photograph and the Body.” The exhibition, which was organized in partnership with the National Museum of", "The next Biennial should be held in 2021 and will be the first of its kind in Europe, with the participation of no fewer than twenty-five artists from thirty-six countries and territories. “The prize exhibition will be the essence of our program, and its exhibition will be the cornerstone of our program,” said Ulla Boudreau, the president of the Biennale de Lyon. In addition, the current exhibition will be supplemented with an updated, expanded catalogue of works on paper, a digital catalogue of the event’s opening reception, and an extensive online exhibition. Inaugurating the Biennale will be a new platform for research and a new exhibition of the works of the full-time participating artists. The platform will also feature individual and group exhibitions. It will also include a new series of artist interviews, public programs, and other events.Commenting on the 2020 theme, Chris Kitching, director of the Biennale, said: “The new format of the biennale will give you an opportunity to view the works in context of a contemporary contemporary and contemporary art. You will find yourself wanting to be close to these artists, to be with them and to be around them. We have created a", "The next Biennial should be held in 2022.\n\n\nThe Urs Fischer Collection in New York has announced that it is reopening with a new exhibition, Triumph of the Mind, on January 23, 2020. The event will be preceded by a new fifty-eight-minute documentary, The Beat, which is slated to open at the New Museum on March 13, 2020. The documentary will focus on the archives of the Jewish museum in Jerusalem and will include forty-eight never-before-exhibited works, as well as performances, illustrations and films that were created by a select group of contemporary artists.The exhibition will be curated by Agnès Varda, director of the Kunsthalle Basel, and will examine the development of the conceptualist and avant-garde in the late twentieth century in a different way than the exhibition it replaced, The Beat, which—in keeping with the indefinite nature of the institution—will remain closed until March 15. The event will also include a discussion with the American artist Michael John Standish, who was selected to participate from a shortlist that included Hal Foster, Peter Hujar, David Kautsky, David Goldin, and John Graham.The exhibition was first announced in September", "The next Biennial should be held in the spring of 2020. • The sculpture “Theatre of the Oppressed: Art and Politics,” by Alexandra Kopp, will be exhibited at the Museum of Modern Art, New York, in March 2021. • The show will be staged in the United States and Mexico from January 21 to March 22, 2021. The first show of the MFA will open at the MFA’s new home on September 19.\n\n\nThe National Museum of Art in Washington, DC, has received a gift of forty-nine works by fourteen artists whose works were among the exhibits in its “2016 National Art Museum” survey. The works, which were donated by artist-collectors David and Amanda Feldman, were acquired by museum director Christa Roesler. The museum also acquired thirty-three works by thirty-two other artists and collectives.Among the works that are currently on display are David Winton’s work The Star-Spangled Banner, which was donated by the late owner of a Los Angeles carnival; James Turrell’s work The Rollicking River, which was purchased by the family of Hank and Mira Lub", "The next Biennial should be a combination of lectures, panels, and dissections with the cast and crew of the docuseries, which premiered at the Brooklyn Museum last year. A statement from the biennial reads:“Throughout the twenty-first century, the exhibition was a platform for the work of the creative and it has been a pleasure and joy to present the work of the docuseries in biennials.”The biennial’s artists include James Turrell, the creator of the personal project space Venison House; Alex Katz, the founder of the gallery M+A2; and the artist-collector-turned-performance artist Andre the Giant, who is best known for his sculpture “The Giant Molecule,” 1964, which is housed in the MCA.The London-based collective said that it is “disappointed that all the panels, documentaries, and dissections will be curated by us, who were chosen for our ability to work collaboratively with the one and only Andre through an open competition and have the privilege of being given a platform to present the docuseries to the world.”The group said in a statement: “We have been given the opportunity to present the people responsible", "The next Biennial should take place in 2021. \n\n\nThe March 2019 issue of Gassen Vision, sponsored by the Stockholm Biennale Foundation (SBM), has announced the winners of its second edition. The biennial, which is organized by Michael J. Martensen, will be held at the København Museum in Copenhagen from March 23 to March 28, 2020. The exhibition’s inaugural section, “Eddie Cantor: Centered,” will feature an exhibition of work by sixty-seven artists and collectives. The section’s twenty-third section, “Larry Achiampong: A Mix of Art and Nature,” will present a symposium with the artist.The biennial’s inaugural section, “Sydney Collective,” ran from January 4 to January 10, 2020 and featured forty-six artists representing twenty-two cities in Australia, including Adelaide, Brisbane, New South Wales, and Sydney. The half-hour exhibition featured performances, readings, installations, seminars, photography, and installations, and was organized by the Sydney Contemporary. The exhibition marks the twenty-fifth edition of the Sydney Writers’ Biennial, which will be held in December", "The next Biennial should be held in the third quarter of 2021. The first exhibition, “Introduction: Theory and Narratives,” was held in the fourth quarter of 2017. \n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is planning to cancel the fifty-eighth edition of the Whitney Biennial, “The New York Reader,” as scheduled. The announcement follows a report published by the Art Newspaper, which found that more than 75 percent of Biennials attendees who had previously bought tickets for the event were not resolded the tickets.The institution said that it is currently assessing the impact of the cancellation on attendance. The first quarter of 2019 saw a decrease in attendance, after which attendance fell again, this time precipitously so. The second quarter of 2019 saw a rise in attendance, but the majority of participants were not fans. The biennial has since found itself in the crosshairs of the United States Attorney General’s office, which is looking into whether the move violates the Sherman Anti-Trust Act.The Biennial of Modern Art will continue to be held at the museum until January 6, 2020. “The decision to cancel ‘The New York Reader", "The next Biennial should have been held before the 2020 Olympics and held at the Olympic Stadium. The decision to hold the exhibition in March was made after the Aichi Triennale, which was due to take place in March, cancelled its Tokyo and Oikonomi fairs in March. The exhibition was supposed to run from March 15 to March 19, but was pushed back due to the Covid-19 pandemic. The current exhibition will be on view until March 20. In the days leading up to the exhibition, organizers worked out how they would move the exhibition, which is one of the largest gatherings of contemporary art in Japan, around the country. They convinced the public to stay home on March 14, which was also the day before the exhibition opened.\n\nAfter the Japanese government announced that it would begin phasing out coal-fired power plants, including the Fukushima Daiichi Nuclear Power Station and the Sendai Nuclear Power Station, which were damaged by a massive earthquake and tsunami in 2011, an online petition launched by Greenpeace decried the move as an attempt by the government to make the environment less dangerous.The petition argues that shutting down the reactors is not in the national interest because shutting them down would merely allow the", "The next Biennial should consist of a physical exhibition of works from the collection that have not yet been published or otherwise completed, as well as a video essay on the work by the master of the three-dimensional art and one of the most important twentieth-century architects. “The exhibition should coincide with the opening of the new biennial, which will be inaugurated by the exhibition ‘Vertical/horizontal”\u0097a virtual exhibition, organized through the virtual reality industry, of the works of the fourteenth-century Italian sculptor Cesare Prada,” the Biennial director, Emilia-Alto-Veneto Luca Sesto, said in a statement. “The exhibition should be the first public presentation of the works in the collection, and it should include the appreciation of the contribution of the artist.”The upcoming exhibition will focus on the history of the exhibition floor, which is currently being renovated, and will feature the works of fifty-eight artists, including Jean-Luc Moulène, Robert McNamara, Abigail and Markus Küng, Samuel Pepys, Pierre-Auguste Renoir, and Wangechi Mutu, alongside works by contemporary Italian artists such as Cristina", "The next Biennial should be held in 2021.The exhibition is being organized by the Galerie Lelong in collaboration with the newly established biennial duje, biennale de lausanne (BUA), with the support of the Galerie Lelong and the Museaux d’Artes du Monde. The twenty-eight-member jury comprising Nihal Lanthimuthu, Yuval Luria, Alfred O.J. McDougall, Cécile B. Jordan, Alfred John O. Russell, John R. Loring, Ruth Sherwin, Charles Berlind, and Hans von Holst, will make their selections by voting in person from the twenty-eight countries of the world. The final jury will comprise retired judge Joanne B. Swallow; curator Graham Edwards; and Shirley Anne White, director of the British Film Institute.Swallow, who won the Prix des Arts et Lettres in 1996, said: “A lot has changed in the last ten years. But I still think it is a very important exhibition, and one that shows the breadth of visual art. The artists", "The next Biennial should be held in 2020. The museum will decide whether or not to extend the programme\n\nThe Pushkin State Museum in Moscow, which recently introduced a new child-care program that aims to divert the attention of visitors from the museum and the State Museum, opened a new exhibition dedicated to the contemporary art of the Russian Far East, titled The Art of Crimea. The exhibition, which will run for seven weeks, will feature works by forty-seven artists from Kazakhstan, Kyrgyzstan, Russia, and Tajikistan. The list of curators is as follows:Igor Bondarev, Kazakhstan, 2019\n\nImran Ahmad, the director of the US–based Institute of Contemporary Art (ICA), London, has been appointed director of the Barbican Center for Contemporary Art in London. The announcement marks the first time a British cultural figure has been appointed director of a major contemporary art institution in the UK. Ahmad will have his first official day in the role in January.“The appointment of Imran Ahmad as director of the Barbican Center for Contemporary Art in London is a landmark step in the evolution of the Barbican as we move towards a new era as part of the redesign, transformation and remaking of our", "The next Biennial should be held in 2021 and the first in 2022.The project team is also working to have the museum reworked to accommodate the latest safety and security precautions. A new exhibition, “How We Live Now: A Biennial History of Material Culture,” will be presented in 2022. The museum’s former director, Lieut. General Achim von Bruning, retired in the summer of 2019 after he was diagnosed with cancer. He was succeeded by Max Perutz in August. The museum is currently undergoing an expansion, which will likely be completed in 2021.\n\n\nBritish Museum director Maria Balshaw has announced that the institution will move the final exhibition, “The Lives of Other Paintings,” from its London location to the South Bank in November 2022, and that it will create at least one thousand new full-time digital and virtual roles across its curatorial and educational departments, as well as create 180,000 new works.In an attempt to reshape the museum’s exhibitions and education across platforms, and to make the building more accessible to the wider world, the two-story Balshaw Gallery will move from its current home on Stratford-on-Avon to a", "The next Biennial should take place in September.\n\nA statement issued by the Los Angeles–based artist-run nonprofit, Artadia, said: “Since the project was conceived and launched by the excellent team of artists who collectively comprise the LA–based collective, LA Biennial, we were committed to presenting an exhibition that engages with the themes of LA, but that also addresses the current crisis by presenting a work that answers the urgent call for social justice and social change from the art-world.”The Venice Biennale has remained under wraps since March 13, when the exhibition was scheduled to close to the public. The Venice Architecture Biennale, the Venice Cities, and the Venice Documenta have all been continued.\n\n\nThe University of Akron has been awarded a $15 million grant from the Russell Sage Foundation. The $12.5 million award will help cover the costs of the construction of the Russell Sage Center, which will host a new exhibition of art annually and be inaugurated by the artist-run nonprofit the Gallery for Contemporary Art. The organization also received a $5 million donation in support of the renovation of the Lenoir–Rhyne Building, the former home of the Museum of Fine Arts, Boston, and the Gardner", "The next Biennial should begin in 2022 and end in 2023.” The art biennials were chosen from a group comprising art historians, jurists, and curators, who were nominated by the public. The winner was chosen by a committee made up of senior curators at the Art Biennials; Joseph and Mary Beard, founders of the Art Museum in New York; Josef Alberts, director of the Konrad Adenauer Foundation in Frankfurt; Saar Hahn, director of the Fraunhofer Institute for Ornithology in Munich; and Sylvia Morley, curator of modern art at the Museum of Modern Art in New York.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) is planning to sell the historic former San Francisco Ship Channel in California to private developers for $3.7 billion. The San Francisco Examiner reports that the sale includes the land and the original building, which sits atop a former concrete plant that was used by the United States Postal Service until it closed in 2013. More than 250 artifacts from the ship channel, including documents from the Declaration of Independence, the Constitution, and the United States Declaration of Independence, are slated for public display in the museum’s new building.", "The next Biennial should be held in 2021.\n\n\nThe United Kingdom’s culture and arts department is currently working on organizing a 2019 edition of the Triennial, which was canceled due to the coronavirus. The 2019 edition, titled The Future is Present, was supposed to take place in March and featured twenty-three artists, including Christo, Cian Clark, and Nomaa DiDomenico, and was slated to run from March 15 to March 22. Organizers have since been working with members of the Royal Shakespeare Company to organize a March 15 performance. In a statement, the department said: “The Triennale is currently working with the Royal Shakespeare Company (RSC) to develop a date and venue both within the United Kingdom and across the globe for a 2019 edition of The Future is Present. The programme will be announced in early May. We are committed to working with all our partners to secure the best possible date and venue for the 2019 programme, which will include the best contemporary and historically informed work from a diverse group of artists.”The 2020 edition of the Triennale will be held in Helsinki in March 2021, and the 2021 edition in London in March 2022.\n\n\nThe", "The next Biennial should take place in the autumn of 2020. \n\nThe Arts Council England (AC), which organises the 2020 edition of the Venice Biennale, has released the list of fifty-three artists who will be featured in its third edition at the Venice Architecture Biennale on October 26–November 17. The event will be staged in conjunction with the two-and-a-half-month Festival of Italy, which will take place in Milan the Friday of the week preceding the exhibition.The forty-one-person panel that selected the artists for this edition of the Venice Architecture Biennale was led by Nusseibeh Saboor, curator of contemporary art at the Museum of Modern Art, the University of California, Los Angeles; Arturo Albanese, curator of contemporary art at the Museum of Modern Art, the University of California, San Diego; and Daniela Bonci, director of the Centre d'Alto Mare. The twenty-five-person jury comprised artist-playwright and curator Benjamin Harnwell, art historian and director of the Centre d'Alto Mare; architect and curator José Carolina, executive director of the House of Architecture at the University of Warwick; and artist-activist Valentino Fus", "The next Biennial should be held at the Museum of Modern Art, New York; the Museum of Contemporary Art, San Francisco; the Museum of Contemporary Art, Tokyo; the Museum of Contemporary Art, Los Angeles; and the Museum of Contemporary Art, New York.\n\n\nThe Durham Art Museum (DAM) has appointed Andrew Renwick as its next director. In the newly created post, which was created through a merger of the Durham Art Museum and the New Art Gallery of the University of the Arts, Renwick will lead the Durham-based organisation as it embarks on a renovation and expansion project.Renwick comes to the institution from the Windows on the West Coast arts complex, which he ran from March 2019 to March 2020. He previously served as director of the Arts and Culture Research Group at the National Gallery of Art, where he oversaw projects on the role of art in the British political and cultural landscape, and as assistant director for information and communication at the National Galleries of Scotland, where he oversaw research and curation for projects that included “All in the Family,” the Edinburgh International Festival, and “Walt Disney: Inside the Magic Kingdom.” “With excitement, I’m excited to work with my", "The next Biennial should be held in 2020.By the end of the twenty-first century, the art world is undergoing a renaissance. We are living through an unprecedented global phenomenon, the Great Recession. Art is no longer a luxury good; it is a necessity. Among the most pressing issues of our time, art and developers are coming together in new and innovative ways. Art is transformed by the internet and the people we trust. Art is reshaped by the power of artists and their creative energy. In the coming years, Art Basel Hong Kong’s 2020 event should play an important role in the revitalization of the art sector in Hong Kong.“We are working hard to make the 2020 edition a success,” said Lara Canty, director of Art Basel Hong Kong. “The next edition will feature a truly unique lineup of artists whose work embodies the spirit of Hong Kong and will bring them together with the artists and audiences of Hong Kong. This will mark the first time these artists will be together in person at the Hong Kong Biennale, and the first time they will work together in such a high-profile way. The artists are eager to share their experiences and their unique styles with the audience of Hong Kong, and we", "The next Biennial should be held in 2021. The theme of this year’s event will be “life and art and games and beauty.” The inaugural exhibition, “Art as Animal, Animal as Life,” will highlight work by twenty-six artists, including Irma Albizu, María Berrío, Sissela Daigle, Gabriel García Márquez, and James Olander. The exhibition will feature works by twenty-four artists including Osmanabad Ali, Fathy Rehfeld, and Farshad Khilji, and will be inaugurated by a performance by the Vienna Triennale Trio, titled “Life is a Spontaneous Creation.”The art of the exhibition will be curated by Alexander Luft, the director and curator of the Vienna Biennale, and will open on April 6.\n\n\nAmerican painter and sculptor Beatrice Eli-son has died at the age of ninety-eight, following a years-long struggle with cancer.Born in New York City in 1941, Eli-son studied at the School of the Art Institute of Chicago and the Harvard Graduate School of Design. She then married painter Alfredo Marighet, whose", "The next Biennial should focus on “radical new modes of collaboration and reflection,” the exhibition said, “and explore the relation between creativity and the physical world.” The 2021 event’s director, Aziz Ahmed, has said that the previous two editions of the Biennial have been centered around “art, science, technology, and art history. The future of the exhibitions and the wider context of the exhibition is now,” and the exhibition’s 2030 edition will be centered around the theme “More Creativity,” which Ahmed described as “a celebration of human creativity and the great constraints that lie beyond the reach of technology and science.”\n\n\nThe French art historian and contemporary conservationist Georges Apostuil, who was instrumental in establishing the French Academy of Fine Arts in Paris in the 1950s and early 1960s, died on February 28 at the age of eighty-eight.Born in the city of Toulouse in central France, in 1941, the first eight years of his life were spent in a French boardinghouse run by his mother, a devout Catholic who raised him in a devout Catholic household. In the 1950s, after Saint-Rémy-de-Proven", "The next Biennial should be staged in 2021, the university said.In a statement, the institution said that the decision was made following discussion with the director of the Biennial and with the campus’s board of trustees. “We are grateful to the board of trustees and the community for their confidence in our ability to deliver on the invitation and to the institution for the opportunity to present the work of the most important artists of the twentieth century,” the statement reads.\n\n\nThe Museums Association (MA), an international organization of more than 1,600 cultural institutions, is demanding the closure of thirty-six museums in the United Kingdom over the last twelve months due to the coronavirus. The group includes twenty-nine British art museums, including the Tate, the National Art Gallery, and the London School of Economics, and twenty-six European museums, including the Musée d’Art Moderne in Paris and the Musée d’Art Contemporain in Geneva. According to The Guardian, the museums face an indefinite closure period of twenty days, meaning that no official closure order can be issued until the thirty-six institutions have been closed and closed for twenty consecutive days. The museums are currently closed until March 17,", "The next Biennial should focus on Bernie’s work, which has a significant contemporary relevance. The first Biennial had already presented a selection of B. P. and T. S. The exhibition, entitled “Queer Visualities,” inaugurated a tradition of biennial presentations and featured works by other artists. In the ’70s, several artists were chosen to participate in the following year’s “The Next Platform: Artists, 1972–1976” (1972). In the ’80s, George and Lynne Werner organized a show of work by several artists, including Herbert Singer. For the first time, the exhibition was organized by a woman, and the first artist selected to represent the United States was American painter Edward Kienholz. The twenty-seventh edition of the show opened on May 20, 1983, at the San Francisco Museum of Modern Art and followed the same format as the previous editions.\n\n\nNew York City Councilman Jimmy Van Bramer and the advocacy group New Yorkers for Racial Justice (NYCRJ) have launched a new project to counter the racist legacy of the Metropolitan Museum of Art (MoMA) in the city. The organization, which has released an open call for proposals", "The next Biennial should consist of one month of programming that reflects the theme of the year, and can include a presentation of a work by an artist that is not represented in the exhibition. The artist whose work will be featured in the biennial should have an award ceremony in the city of Santa Fe, New Mexico, and the biennial should be organized by participating artists. The winner of the award will be chosen by the Los Angeles County Museum of Art.“Our vision for the next Biennial is to celebrate and build upon the artistic and cultural legacy of the artists who have shaped the contemporary American landscape,” said Florence Sheehan. “The program will invite and build upon the themes of the exhibition, which have been historically central to the artist’s work, and the Biennial, which have been the focal points for the artist’s most recent projects.”The next iteration of the Biennial will take place in the city of Santa Fe, New Mexico, in 2021. \n\n\nThe Museum of Arts and Design (MAD) in London is revamping its collection strategy in order to increase the visibility of contemporary art. The arts wing of the museum has agreed to invest $1.5 million in the visual arts", "The next Biennial should be on the scene of the 2010 Black Lives Matter protests at the George Washington Bridge in New York. “We must continue to push for change and extend our understanding of the role of the museum,” said Hsieh. The biennial will also unveil a new collection of work by Texas-based artist Jamilee James and the Montreal-born and based artist Akili Smith.“We are thrilled that Biennial Montreal is continuing our work to change racial inequities and build on the legacy of a great museum,” said Smith. “It is a project that we hope will inspire us all to think of new and better ways for artists, scholars, and visitors to see and experience the work of our elders.” Smith will unveil the work in the month of March.\n\n\nThe Solomon R. Guggenheim Museum in New York has named Natalie Naru as its inaugural director and CEO. In her new position, which is funded by $30 million from the Solomon R. Guggenheim Family Foundation, Naru will be responsible for developing and implementing a new program designed to strengthen the role of African American artists in museum presentations, curation, and public engagement. In her", "The next Biennial should be held in 2021, but the organizers are still waiting for the governments of the Netherlands, Belgium, Luxembourg, and Switzerland to commit to awarding the award.The show’s upcoming edition of the twenty-first Venice Biennale, curated by Antony Hudek, will be held in March. The event will take place at the Venetian Hotel Corte and will be hosted by editor Jan-Paul Radom, curator of contemporary art Hujar, and the public at large.\n\n\nAfter years of negotiations, the Los Angeles County Museum of Art (LACMA) will become the next home for the ever-popular Merry Go Round, the iconic annual event that pits a group of artists—most of whom are Los Angeles–based—against one another. The institution announced this week that it will present the inaugural edition, which will take place in September, at the LACMA Art Museum, from September 24 through October 5. “We are thrilled that this year’s Merry Go Round will mark the occasion of the twenty-first edition of the MGA,” said Museum director Steve Whitley. “The show will be a true celebration of the rich art of", "The next Biennial should be held in 2022.\n\n\nThe National Maritime Museum in Athens has announced that it has received a donation of twenty-nine paintings from the German artist Ulrich Hoffmann. The donation comprises twenty-three works by the artist, who was born in Munich in 1929, as well as a selection of his photographs and drawings, which are slated to be presented at the Museum in 2021. The works were acquired by Hoffmann in 2007 after he bought them at a garage sale in the city of Cologne.Commenting on the donation, National Museum director Hermelindo Dariusi said: “The Hoffmann family has long been associated with the National Museum and the collection of Hoffmann’s works is a great tribute to the institution. Ulrich Hoffmann is a truly important and important work in the history of art. His work is a source of inspiration to many who know him and to many who have studied with him. In order to keep this work in the collection, our priority is to make the acquisition as easy as possible for the public. Ulrich has such a strong reputation that he can easily be identified by the actor Kurt Russell. Ulrich Hoffmann’s works are in the public collection since 1997 and are currently", "The next Biennial should take place in January 2021, and its fifty-ninth should appear in March 2021.Following the reopening of the biennial in March 2019, the exhibition’s organizers decided to postpone the event, which was initially set to open in May, to April 2020. This has meant that the biennial will now be held from March 21 to March 24, with the first performance taking place in March 2020.In a statement, the organizers said that the decision to delay the show was not an “issue of principle or of talent, but of practicality and budgetary considerations.” They added: “The long-term future of the exhibition lies with the museum and the central role it plays within the city. We thank our guests for their understanding and support throughout this difficult situation. We hope that the new and important work of the Biennial will please them and the audience of the show in a meaningful way.” The announcement of the postponement has been met with disappointment by some of the artists whose works will be featured in the show, such as Michael Kwan, whose work Gravity’s Rainbow, 2019, was to feature Cindy Sherman and Michael Stipe\u0097the duo is", "The next Biennial should have been held in Prague in January 2019, but was pushed back because of the Covid-19 pandemic. The shortlist, which includes the Los Angeles-based artist Mark di Suvero, the London-based curator Mary-Kate and Ashley Foster, and the Hong Kong-based artist Gao Wenliang, will each receive $50,000. The full list of artists who will receive $75,000 in support of the Art International’s work in support of the Covid-19 response is as follows:\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed director Amanda Levin as interim executive director. She will serve a three-month term beginning February 14 and will be based at the institution for the next twelve months.“I’ve been enthusiastic and enthusiastic about the museum’s new leadership team since they were appointed last month,” said Levin. “I’m a fan of the leadership team’s work ethic, commitment to diversity, and ability to bring people together for a shared purpose. We need Amanda to make the MFA a truly global destination for the arts in the years ahead. I’m confident that when the", "The next Biennial should take place at the Museum of Contemporary Art Los Angeles in the fall of 2020 and be followed by a new project at the New Museum in New York in 2021. The first exhibition, Art and the Body, was curated by artist and biennial curator Salah El-Khoury and will open in the fall of 2021. The second exhibition, On the Edge of Forever, will open at the Museum of Contemporary Art Chicago in the spring of 2022.\n\n\nThe American Civil Liberties Union (ACLU) in New York City has filed a complaint with the state attorney general alleging that the New York Civil Liberties Union (NYCLU) violated the National Labor Relations Act (NLRA) by failing to appoint a replacement for Andrew Cuomo, the outgoing head of the State Department, who was forced to resign after he resigned in March 2019.According to the complaint, which was filed in the Southern District of New York on April 3, the New York Civil Liberties Union (NYCLU) failed to inform employees of the organization about the October 2020 reopening of the government’s public schools, failed to compensate employees who were laid off or who were furloughed in March 2019, and failed to", "The next Biennial should take place in late Spring 2021, in the grounds of the Museo de Arte Contemporáneo, in the capital of Santo and the Santo and Cagayan regions of the Philippines. The event will highlight the work of thirty-four artists, selected from a pool of twenty-two artists, from the Philippines and China, with the theme “Love and Art in Contemporary Contemporary Asia-Pacific”.\n\n\nThe Museum of Contemporary Art (MoCA), London, is investing more than $10 million in the restoration of one of its most-used spaces, the Tate’s north tower, which collapsed in April at the height of the coronavirus pandemic. The institution had hoped to begin the work this spring, but the start date was pushed back further, to later this year. The restructuring, which involves the rearranging of the building’s interior with the aim of moving some of the museum’s collection and exhibition programs online, was funded by a $5 million gift from Richard Goldsmith, the former director of Tate Britain, and the Richard Goldsmith Foundation, which received the sum in partnership with British Prime Minister Boris Johnson.“The grant will allow MoCA to", "The next Biennial should be held in 2020.  As Alternative Culture and Politics in the Contemporary West Collapses: “In a World Gone Wrong,” Derek Ciancik, Oskar Eustis, and Anne-Marie Harrison, with Diana Gabaldon, will curate the 2019 edition. The 2020 edition will be led by Reuben Arsht and Jessica Morgan. The 2019 event included performances by works by artists such as Nick Cave, John Carlos, and Tanya Boone, among others from the United States, Europe, and Australia. \n\n\nThe Royal Academy of Arts (RA) in London announced today that Adriana Achoo has been appointed as its new chief executive and director. She succeeds Anwar Ali, who retired in March after twenty-three years at the helm of the academy, and will take up the post in September.“I’m delighted that Adriana has been appointed to the role of Chief Executive and Director of RA,” said Sadiq Kahn, chair of the RA board of trustees. “In her role as Chief Executive, she will continue to drive the growth and development of the RA across the", "The next Biennial should be held in 2021. For its past two editions, the event was hosted by Smithsonian American Art’s institutional wing in Washington, DC—the National Museum of Art—and was meant to celebrate the United States’s 150th anniversary. However, owing to the coronavirus outbreak, the exhibition was moved to the National Museum of Art in Washington, DC. Commenting on the new venue, Charles A. Hennessy, the biennial’s director, said: “The National Museum of Art, with its rich collection of more than five thousand works of American art, is the ideal location for the next Biennial. Established by and for the American public, its collections are a significant resource for scholars and the general public. The closing of the National Museum of Art will allow the National Council on the Arts to focus its attention and resources on the work of the current generation of artists and create a more cohesive and inclusive national collection.”\n\n\nThe Milwaukee Art Museum (MA) is launching a new digital platform that will provide local, state, and federal governments with comprehensive, on-site, and cross-posting services in the event of a major power outage. The platform, called Art", "The next Biennial should be held in the United States cities of New York, Boston, and New Haven, Connecticut. \n\n\nThe Art Newspaper has published an unusual review of the new art-world exhibition, “The Oxford Biennial,” which is part of the Oriel Art Museum’s 2019 edition. The review is an attempt to reconcile “The Oxford Biennial” with its previous title, “Oriel: A Contemporary History.” It was organized by the Art Newspaper on behalf of the publisher and author, William Blake.Blake, who died on December 14, 1957, wrote: “The Oxford Biennial is an attempt to reconcile the biennial with its previous title, The Oxford Art Museum, the contemporary art museum founded in the late nineteen-sixties in Oxford, England. The exhibition will present a new selection of works by contemporary artists from the New World and will explore the role of art in our lives, especially in the twenty-first century.”The review has drawn widespread criticism. Louisa Albergotti, editor of Artforum, denounced the review as “disinformation,” “highly defamatory,” and “offensive,", "The next Biennial should take place in London in 2022.  #artworldcontinued #artworldcontinued  Last year, the British artist Luke Pickering created a new work for the Biennial entitled Forbidden Art, which won the Carbuncle in October 2016. The piece, titled Forbidden Tree, is a towering, granite sculpture of a tree that is surrounded by a network of red and orange vines. The work was commissioned by British artist Philip Pulliam and is part of a series for the upcoming edition of the biennial. The biennial will also feature interviews with artists from the London-based Blend Gallery, a public space dedicated to experimental art in the city, and the artist-run nonprofit Artspace London.In addition to the biennial, the 2020 edition of the Fab Four\u0097Owen Booth, Paul Gauguin, Jean-Luc Godard, and Jean-Luc Paré\u0097will also take place at London’s Serpentine Galleries. The exhibition will also feature the work of Michele Latour and will present the first solo exhibitions of work by the Belgian artist Christine Rosenblum and the German artist Helge von Bruenchenhein. “", "The next Biennial should be held in 2019, and the first show will be held in 2020.\n\n\nThe British Museum has received a gift of 375 artworks from the Peter Wollen Collection in London. The exhibition, “Saturnalia,” will travel to the National Gallery of Art in Washington, DC, and will reopen in 2021. The collection is comprised of works that were created during the waning years of the Italian Renaissance, the Renaissance, and the Renaissance Italica, as well as pieces from the Middle Ages, the Renaissance, and the Renaissance Venice.“It has been the aim of the Wollen Collection to develop a relationship with the National Gallery of Art, especially in the years since its founding; and our collection is delighted to be able to present its artists’ works at its beautiful institution,” said William F. Walshe, head of the collection and collection manager. The museum also revealed that Daniel Defoe will serve as the final exhibition curator of the twenty-fifth edition of the Royal Academy of Arts. The event, which will be held at the National Gallery of Art from March 22 to March 28, 2020, will bring together some seventy artists from twenty-four countries. Defoe will present work by forty", "The next Biennial should be held in a year to be determined.  Among the artists who have been nominated are John Perkins, Junya Ishigami, Mark Liman, Kate McKinnon, Michael Ondaatje, Joshua Wood, and Kathrin Nielsen. The list of past winners is as follows: Artist Prize Winners Meredith Monk\nBiennial Biennial Prize Winners\nThis year's winners will be announced on May 17, 2020. If you are interested in supporting a visual arts institution that is currently struggling because of an outbreak of the novel coronavirus—and if so, you can do that right now—you can donate to the National Art Museum of Scotland as part of its annual Arts and Cultures Fund. If you want to support artists and their projects, you can also donate to the National Poetry Library as part of its annual Literary Fund. The National Poetry Library has created a page for writers and poets who are facing financial hardship or who are facing homelessness. If you are a writer or a poet who is facing financial hardship and would like to help them, you can donate to their fund here.The National Poetry Library also has a page for writers whose creative practices are", "The next Biennial should be held at the Museum of Modern Art, which is currently undergoing a $2.8 billion renovation; the Museum of Contemporary Art, Los Angeles; and the Museum of Witchcraft and Druidry, which is currently undergoing a $2.5 billion renovation.The 2019 edition of the Biennial will take place in the Museum of Modern Art, which is currently undergoing a $1.7 billion renovation.\n\nThe Museum of Modern Art (MoMA) in New York City has announced that the institution is reopening to the public on May 5, 2020, at exactly one hundred and seventy-eight hours after it reopens in May 2019. The institution’s new digital platform, MoMA Live, will offer visitors a first-of-its-kind experience as the institution reopens. The digital experience, which will launch with a special performance by the contemporary group Haim and Amir, will be presented as part of the institution’s first major redesign in twenty-five years.“This redesign will showcase the museum’s incredible history and present it in a way that is as relevant as possible to our time,” said architect Lorenzo Fusi, who designed the renovated building on West", "The next Biennial should focus on the importance and paintings of the past.  The arts will be the backbone of the Third World in Asia.\n\n\nAmerican painter Richard Anuszkiewicz has died at age eighty-eight at his home in Brooklyn, New York, following a yearlong illness.Born in Springfield, Massachusetts, in 1924, Anuszkiewicz studied under Robert Irwin until the latter pulled the plug on the program in 1977. In 1982, the New York Times reported that he was working on a new series of painting portraits, some of them completed in a crudely lit environment, that would be shown in an exhibition at the Museum of Modern Art in New York in 1986. The workmaking units of Anuszkiewicz’s oeuvre span the period of the evolving American painting movement, from Beaux­tun to Surrealism, from the '60s to the ’70s, and from the visual arts to the social sciences.In 1971, Anuszkiewicz married his daughter. The couple had five sons and two daughters, but the youngest, Jody, died tragically of brain cancer at age five shortly after birth. In 1994, the elder brother of one of the", "The next Biennial should include a project by artist of modern art Dusan Kuzma, whose new installation , 'Atlas, Stretched,” is on display in the exhibition “See Through,” curated by Günther O. Hollein and featuring a selection of work by artists who have had exhibitions at the museum. The exhibition will be held at the museum until June 23.The second Biennial will take place in 2020, with the biennial’s two most recent works, a performance by the American artist Hermitude Kennedy and the artist’s work from 2010, which will be on display in the exhibition “Sixty Years of Performing Arts” for the first time. The sixth and seventh Biennials will be held in 2021 and 2022, respectively.Commenting on the selection of the works, Deana Haggag, president of the Cleveland Art Museum, said: “This is an exciting time for the city of Cleveland to welcome more than three hundred artists and cultural organizations from forty-five countries to our city. We look forward to welcoming the world to the Cleveland Institute of Art in 2020 and the 2017 biennial, and to seeing where the city’s artists and cultural", "The next Biennial should be held in 2021’s edition, which will be held at the Palazzo Reale in Venice. “We had the opportunity of collaborating with the MSF to create an exhibition of the work of the MSF and the MSF-affiliated artists, such as Mihai Mihai, Zoya, and Stefan Städelschläger, and here we are presenting the work of the artists who have been affected by the epidemic,” said Pia Massimo, the chief curator of the MSF’s Dusseldorf branch and president of the Fine Arts Council in Italy.The exhibition, titled “Sending Stories: The MSF Artists and the Struggle for Human Rights,” will be presented by the museum in collaboration with the Pia Biennale. The exhibition will open on September 24 and run until November 30. The final iteration of the event will feature the works of 128 MSF artists.\n\n\nBy Tiffany Butler\n\nA group of artists across the globe are preparing to stage a protest at the United Nations next week in solidarity with the international human rights abuses being carried out by Israeli forces, including widespread destruction of Palestinian homes and communities, the deliberate", "The next Biennial should be held at the Art in the City of New York: the Hudson Yards Museum of American Art. Amagansett Artists Residency Program is also continuing with seven artists: Charlotte Becker, Alexander Calder, Alexander Graham, Benedict G. Donahue, Pablo Picasso, Enrico Cipollina, and David H. Koch. The slots will be filled by artists whose works will be included in the biennial’s next iteration. The six-month residency program, which was established in 2007, is a partnership between the Museum of Modern Art and the City University of New York and is supported by the David Rockefeller Fund, the Art Newspaper Foundation, and the Samuel Âs Trust. \n\n\nThe History Museum in Seattle filed a legal complaint against the University of Washington over an incident last month in which an undergraduate student, who was participating in an art-centered university-wide seminar, was kicked out of the museum because he refused to leave the institution after he claimed a public safety officer activated his stun gun on the student.The complaint states that the student had been visiting the museum with his girlfriend, who was visiting with her mother, when", "The next Biennial should take place in the fall of 2020. The exhibition will take up themes such as gender, history, and mythologies and will focus on the perceptions of young artists in the Philippines.\n\n\nThe British artist Peter Sellars—whose hauntingly lifelike paintings depict the voyages of his late wife, artist-in-residence Elizabeth Barry, and their eleven children—has died at age eighty-eight at his home in London. She was eighty-six years old. The cause of death was cancer, according to the New York Times.Born in London in 1932, Barry was raised in the British state of South-East England. After marrying Belgian playwright Van Gogh in 1935, the couple relocated to the Netherlands, where Elizabeth married Danish playwright Herman Giddens. In the late 1940s, the couple moved to Paris, where Elizabeth began knitting, sewing, and painting. While at Paris’s Montmartre studios, the couple met German painter Hans Hofmann; the couple relocated to Berlin, where Hofmann became a mentor and friend. Throughout their five-year visit to the city, the couple’s three sons were born and grew up.The couple’s Paris residency, which runs from 1976", "The next Biennial should focus on “feminist and queer theory, activism, and practices,” the publication reads.The biennial will also introduce a new section in the exhibition “Intersections of Art and Politics” that will study the intersections of art, politics, and theory.The work of the artists who are participating in the exhibition will include works by Steven Brearly, Olu Oguibe, Jeff Koons, Anna-Marie Madden, Nari Ward, Joe Turner, Oscar Murillo, and Ed Moses, as well as works by Jackie Fan and Julia Fries, and will be shown in two exhibitions. The show will open in Shanghai in October 2020 and will remain on view until March 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Juliet Hudson as its next executive director. Hudson, who currently serves as director of the collection of John and Vinnie Sadler and as a curator of contemporary art, has been a trustee of the museum since 2012. She succeeds Roberta Smith, who retired in February 2019 after eighteen years at the helm of the museum.“I’ve been a trustee of the MFA for more than twenty years, and I�", "The next Biennial should take place in 2021, in the autumn, in the city of Paris, as part of the Paris Art Biennial (PAB). “I want to see the Paris Art Biennial become a true institution,” Jean-Luc Biennale, the interim president of the Biennale de Lyon, told the Art Newspaper. “I want to make sure that there is an end to the loss of cultural life and an end to the damage that has been done to the institution.”The Biennale of London is currently preparing for its first edition, titled “London, 2020.” The event will take place at the Royal Festival Hall from September 8 to September 11, 2020, and will feature some twenty artists. The first phase of the event, which will run between September 16 and September 19, 2020, will feature thirty-six artists, and the second phase will run from September 20 to September 23, 2020.Its next edition will be staged at Cardiff Castle from September 19 to September 21, 2020. \n\n\nThe Italian government approved plans on Monday to forcibly reduce the annual salaries of senior executives at Italy’s major telecommunications companies, the Communication Union and Telecom Italia, by around 25 percent", "The next Biennial should be held in the year 2021. However, the status of the exhibition remains uncertain owing to the ongoing suspension of the exhibition.\n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco has appointed Melissa Adler as its next director and CEO. Adler comes to the museum from the Los Angeles County Museum of Art (LACMA), where she has served as director since 2016. During her tenure, she has organized numerous exhibitions, including “The Levee,” which opened in February 2022 and has been on view at the museum since March.“Melissa is the right person for the job, given her track record and track record of innovation, her track record with the LAXART, and her track record at LACMA,” said museum director Sianne Oyler. “Melissa is a leader in the art world, who has led successful exhibitions and organizations as complex as the Sistine Chapel and the Metropolitan Museum of Art, and who has the vision and the ability to bring innovation to this side of the bay.”The announcement marks the completion of a year-long search for a new director. During the search, MoCA curators invited twenty-four artists to consider"]