["The next Biennial should be held in 2022.\n\n\nThe Diller Scofidio + Renfro–designed Museum of the City of New York (the 'Museum) of the City—New York (CAMNY)—has received a $100,000 donation from a man who identified himself as the former head of the Roman Catholic Diocese of New York. The benefactor told the New York Times that he wanted to establish a new, independent institution that would focus on restoring the original vision of the Diocese of New York.The gift, made on behalf of the Diocese of New York, came in the form of a check for $75,000. The institution is currently fundraising to set up the capital campaign for the restoration of the building and its grounds.“The Diocese has been working for years to restore the buildings’ original design and the Museum of the City’s mission,” said Matthew D. Drury, the Diocese’s senior director of preservation and protection. “This is a historic gift that will make the Diocese’s historic vision a reality. Our goal is to restore the Diocese’s buildings to their original elegant grandeur, and to create a", "The next Biennial should focus on the history and development of the museum’s collection and on the institutional history of the institution. The fourteenth, which will be organized by the museum’s trustees, will focus on the institution as a social gem in an urban setting. “The theme this year is ephemeral,” said Jeffrey Epstein, executive director of the National Association of Museum Directors. Epstein added: “We have a responsibility not only as a society but also as a culture to view the future in an environmentally responsible way, and we have a responsibility as public leaders to instill that sense in our children. ‘Managing the environment is the best strategy for long-term economic and political well-being.’ I look forward to partnering with the public and am grateful to the board of trustees for the opportunity to serve as chair.”For the exhibition’s fifty-ninth edition, titled “Managing the Future,” the group presented twenty works by forty-five artists, including Josef Alberts, Robert Alberts, Nari Ward, Ushio, and Takashi Kawamura. The exhibition also featured the first exhibitions of works by peasants in China in more than", "The next Biennial should be held in 2021.\n\n\n\n\n\n\nThe After Party, a Brooklyn-based nonprofit established in 2016 to promote civic engagement and community through programming, arts and culture, and music, has announced its next edition, titled After Action, on January 26. The event, which will be held at The Banks, will feature a mix of live music, talks, and discussions on issues such as art and culture, climate change, urban life, and sustainability, as well as artist activations. The organization is also planning to collaborate with Upright Citizens Brigade, the Brooklyn-based LGBTQ cultural organization. The 2020 event will take place at United Artists, a nonprofit space that represents artists and will be reborn as a new nonprofit organization called the After Action Center. The center will host around seventy artists and will stage more than one hundred events annually, including the annual After Action Festival, an annual residency program, and other events. Its inaugural cohort, consisting of Alison Haslett, Kate Spilka, and John Secchi, will receive $10,000 from the organization.The 2020 event will take place at the pedestrian-friendly nonprofit space, which has been co-located with the former site of the Turner Prize, at 5", "The next Biennial should take place in the spring of 2021.\n\n\nThe Metropolitan Museum of Art has rolled out a new $50 million restoration and renovation program that will focus on the preservation of important early twentieth-century works by artists such as Pierre-Auguste Renoir, Michelangelo Antonioni, and Ed Ruscha. The museum’s collection will also receive a major facelift, which will include the restoration of the entire building’s interior and exterior, and will include the first time that the works of Jean-Michel Grosvenor, Edward Hopper, and Edvard Munch’s famous Nude Beach series.“The Met has been a leader in the preservation of the work of our collection for more than a century, and this is an exceptional time to further strengthen our relationship with Grosvenor, Munch, and Renoir,” said Anne Fung, the museum’s vice president and chief curator. “The work of our collection is of great value to our visitors, whose experience is enhanced by the immersive and collaborative nature of the exhibitions. We cannot think of a more important exhibition to draw their attention to art history’s past than ‘The History of the", "The next Biennial should be held in 2020, with the exhibition marking the 200th anniversary of the foundation of the Royal Academy of Arts. \n\n\nThe Senate voted today to confirm Thomas Jane as the next chair of the Smithsonian’s National Museum of African Art (MoA), which he has led since 2016. Jane is a black man who has served as curator at large for thirty-seven years and has been a chair of the institution since its inception. Before he was appointed as deputy, Jane served as director of exhibitions at the Cleveland Museum of Art and in the Office of Art History at the Smithsonian.When he was elected, Jane said: “I’ve been a curatorial scholar for twenty-five years. I’ve taught in colleges and universities across the United States and have taught internationally at great institutions like the University of Chicago, the University of California, and Yale University. I’ve written extensively and frequently about African art and the African diaspora.”He added that he is “troubled by the fact that we are not thinking of more African art.” Jane said, “I’m not interested in placing new paintings or sculptures in the slots that are currently being filled by", "The next Biennial should be held at a location within a year of its previous edition, and should focus on how art and technology are interrelated. Director Frank Gehry said: “The future of the human body and the future of the world are interdependent. . . . We must constantly re-think and re-create the future, but we must also think about the past and the future.”\n\n\nFrench President Emmanuel Macron declared on Thursday that he wants to hold a two-year referendum on France’s participation in the United Kingdom’s Brexit negotiations, in an attempt to calm tensions between London and Paris in the run-up to the June 23 vote. Macron made the announcement in a speech at the Louvre, where he was presenting the museum’s forthcoming “Gloria” exhibition, which will focus on the history of women’s rights in France. “I want a two-year referendum so that everyone has the possibility to express their opinion,” Macron said. “I want a vote on whether we are ready, and on the basis of this whether the country will continue as an open and tolerant country.”Last year, French president Emmanuel Macron won the 2017 presidential", "The next Biennial should look to address issues of representation and activism in the exhibition space, as well as the studio and the exhibition space, and should also articulate the importance of protecting and promoting the arts. The Biennial will be held in the reopening of the Museu de Arte de São Paulo, which is currently undergoing a major expansion. The event will mark the biennial’s centenary and will introduce many new works by artists from Brazil, Uruguay, and Chile, as well as a selection of other works, including a special exhibition by Carlos Castaneda, “Diana Alves de Casas,” which will be presented at the exhibition space; a new series of biennial films, and a new online portal for the event.Organizers said that the new location for the exhibition, which will be inaugurated by a new work by Lina Asensio, and will be inaugurated by an exhibition of new works by artist Jabiru Altin, which is slated to open in 2022, will be in the same building as the museum. The new pavilion will be inaugurated by a performance by artist James Turrell, titled The Rope, at the new Universidade Federal de São", "The next Biennial should be in 2020. If the exhibition is cancelled, who will stage “The Lotus in the City of Light” and “The Exhibition of the Future” again? If the museum is forced to close, what will become of the Museum of Contemporary Art (MCA), which plans to open in the fall? And what will become of the North American and European legacies of the Dancers’ Union?  For some, the question of the future of these programs is more urgent than ever. On Wednesday, the seventy-nineth Venice Biennale announced that the upcoming edition will take place at the iconic Forum d’Arte Modern in Venice. The event will be led by João Pires, who will return as interim director of the museum, and will run from September 14 to September 18. The venue, which maintains a permanent collection of more than one thousand works by thirty-six artists, including Mark Mather, Andy Shafta, and James Turrell, will be transformed by the artist Carl Gromacka in partnership with the artist and architect Bodo Valtteri, with the assistance of architect Mikhail Kliment. The", "The next Biennial should take place in the spring of 2021.\n\n\nThe Institute of Contemporary Arts (ICA), London, is expanding its collection by purchasing twenty-eight works by twenty-six different artists for its new $175 million building, the Art House, on the South Bank of the River Thames, in the city center of London, on Monday, June 6.The ICA is currently funding the development of the new building with funds from the Henry Jackson Society (HJS), the Wellcome Collection, and the Wellcome Trust. The investment will enable the museum to create new exhibitions and programs that will be accessible to both the South Bank and the East End.“The new ICA Art House will be a contemporary and contemporary art museum,” said ICA director Simon Weller. “The result will be a truly remarkable exhibition space that will draw together the work of the great contemporary artists, in a way that is both exciting and exacts the spirit of what ICA was all about.”The purchase of works by the twenty-six artists will mark the first twenty-eight years of the museum’s history. The ICA currently has forty-two works by twenty-six contemporary artists, including Marc-Antoine", "The next Biennial should be held in the first half of 2022, and the first exhibition should be held in the first half of 2023. The Biennial of the Americas (BNA), which will take place in Fortaleza from January 28 to January 29, 2021, will be held in Santa Fe, New Mexico. The 2019 edition featured work by artists such as Yinka Shonibare, Yuki Kondo, and Eiji Oda. \n\n\nThe Institute of Contemporary Arts (ICA) in New York has appointed Suzi Nolen as its next dean and CEO. Nolen, who previously served as director of the newly reorganized arts and design center Museums United States (MUUSA), will help guide the revitalized cultural corridor as it attempts to make the area around the Empire State Building, where the former Chrysler building now stands, more accessible.“Suzi is a visionary leader and organizer who has built a distinguished career in facilitating intergenerational exchanges between artists and institutions,” said Ikon Wirth, chair of the board. “She comes to IAAC from the Public Theater, where she has served as acting director since 2016 and was previously president and CEO of the New York Philharmonic. Su", "The next Biennial should be in 2020, with an opening date of March 16-March 23, 2020.A new exhibition, “On the Sides of the River,” will be staged by the same organizers and will be organized by the same organizers, the French Institute d'études in Paris. The thirty-second edition of the 2018 event will also be held in November.The 2019 edition of the fair, which was held in November, was canceled in January and featured twelve new works. It was supposed to be held in September, but was rescheduled for September 27–September 30.Although it will be held in the city of Lyon, the fair will be run by the Lyon Museum of Fine Arts (LMA), which is located on the city’s French Riviera and is owned and managed by the cultural group the Municipality of Lyon, and will be organized as a “family museum” in a new region of the city. The new location will begin with the theme, “The Beautiful City,” and will culminate with a “living history” exhibition. \n\n\nAfter years of pleas from artists and activists and a fierce backlash from lawmakers, the National Labor Relations Board has reinstated the", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has hired Tina Nunn, a professor of English at the University of Pennsylvania, to the post of senior curator. Nunn will be responsible for bringing the museum’s collection to completion, integrating new exhibitions and programs, and overseeing the development of the institution’s collection.“Nunn’s curatorial practice has shown a clear commitment to the history of the exhibition and the exhibition program at MoCA,” said director Klaus Biesenbach. “Her curatorial approach and ability to build on the museum’s international reputation will complement the museum’s ambitious agenda, ensuring that MoCA remains at the forefront of contemporary art.”Nunn comes to the institution from the Los Angeles County Museum of Art, where she worked as curator and developed programs for the garden and the museum’s collection. She also previously taught at the University of Washington and at the University of Pennsylvania, where she earned her Ph.D.\n\n\nThe United Kingdom has announced that it is planning to leave the European Union in March 2019, following months of uncertainty over its future membership. Prime Minister", "The next Biennial should be held in 2020. The 2019 exhibition was held at the Forum in Milan and featured works by such artists as Diya Ghose, Melanija Wojtas, and Carlos Zegher.The institution is currently struggling to find funding for its relocation. The site was designated for a new museum in 2012. However, the project was scrapped after Italian Prime Minister Silvio Berlusconi vetoed the bill and a two-year campaign to save the venue. The building underwent a major restoration in 2016 and is currently undergoing a facelift, which aims to restore the exhibition space and make it possible to move the exhibition to a different building in the city.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has received a gift from the late businessman and collector Harry S. Truman. The $3 million collection, which includes pieces by artists such as Ellsworth Kelly, Cézanne, and Gertrude Stein, as well as a number of works by Margo Guggenheim, was donated to the museum by her son, Robert C. Guggenheim, Jr., in honor of his father’s 90th birthday. His son also provided $500,000 for a new gift", "The next Biennial should begin as soon as the authorities in Madrid are confident that the extra security measures that were put in place during the lockdown will not pose any problems. With more than 2,200 people still unaccounted for, the festival is still assessing the security situation. If it is forced to reschedule the exhibition, which is scheduled to run from March 17 to March 19, the event will be moved to April. The organizers told the Spanish daily newspaper ABC that it is still evaluating the security situation. If the lockdown continues for more than three weeks, the festival will be forced to cancel the event. The Rome-based arts organization CINEMA NITRO will also be affected. The twenty-fifth edition of the show will be postponed and will now be held on February 28–March 4. The organization, which is supported by the Roma Foundation, is urging people who want to go to the event to go via an alternate date on its website. The fifty-eighth edition of the festival will be held in March.\n\n\nThe French Ministry of Culture and the National Galleries Union (MGA) have reached an agreement on a restructuring of the company that owns the Montblanc art museum in Paris, which will reorgan", "The next Biennial should take place in Geneva in 2022 and is expected to draw around three million visitors. Diplomatic relations between Iran and Switzerland have been strained by a series of recent provocations, including the country’s 2015 terrorist attacks in the Swiss city of Basel.The stakes are high for Iran, a country that is currently negotiating a preliminary deal for the construction of a massive $6 trillion oil-and-gas complex in the country. If the deal is not reached, Iran will likely face international sanctions.\n\n\nThe Fine Arts Museum in New York has received a gift of thirty-six works by French painters Alain Guver and Georges Apostu, both of whom are longtime supporters of the institution. The works, which were given to the museum by the French collector on the same day that Guver died, are a selection from a series titled “Plain Truths,” a collection that comprises works by several artists such as Hasselblad, Bouguereau, and van Dyck, and a work by Vincent van Gogh. Guver’s son, Jean-Louis Guver, has since claimed that the show will be the first in the museum’s five-decade history", "The next Biennial should be held in 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it plans to shuttered after a decade of exhibition-making and a projected $200 million loss in revenue as a result of the pandemic.The institution announced that it plans to hold a fifty-day public holiday on January 18, 2020 as a show of solidarity with the roughly one hundred museums in the city that were forced to cancel their spring and fall exhibitions and turn their outdoor space into temporary exhibition spaces in the hopes of avoiding the Covid-19 pandemic.The museum will also begin providing free admission on a first-come, first-serve basis to the public for the first time in its history. The admission policy change is part of a $500 million package of measures the city and state of Massachusetts announced in response to the coronavirus. The package, which also includes the establishment of the Massachusetts Emergency Management Agency (MEAA), the reopening of the Boston Harbor in April, and the expansion of the state’s public health emergency plan, will take effect immediately.“This is an unprecedented and challenging period for all of us, but we as a community have a responsibility to do everything we can to", "The next Biennial should be held in 2021. The exhibition will be hosted by the Museums Association, the museum organisation for which is chaired by Madrid-based collector and philanthropist Carlos Berch and will be organized as follows: Themes 1: Contemporary Art from the Contemporary South 2: Contemporary Art from the Contemporary North 3: Contemporary Art from the Contemporary WestThemes 2: Architecture, Design, and Designing Contemporary Art from the Contemporary Middle East and North AfricaThemes 3: Contemporary Art from the Contemporary South Themes: Art of the Contemporary South-AfricaThemes: Art of the Contemporary North-Africa\n The San Francisco Museum of Modern Art (SFMoMA) has added eleven new artists to its collection, including the Iranian American artist Mohammad-Ali Khatami, whose works explore the history of the United States and the politics of art, and the Tunisian artist Ahmed Bouwaz, whose works celebrate the United States and its ideals of inclusion.SFMoMA is also adding three new works by young artists, including Jasmina ElSohrabi, Ali Yusuf, and Ali Yazdi. The artist-in-residence at the museum will serve as a model for future exhibitions, residencies,", "The next Biennial should be held in the fall of 2020.\n\n\nThe Museum of Fine Arts (MA) in Boston has received a gift of forty-eight works by the American painter Ijosusei Yoshihara. The gift includes works by twenty-four artists and is designated for the collection’s silver and gold collection.The gift is a follow-up to the museum’s 2016 acquisition of twenty-three works by Yoshihara. The exhibition “Wu Shanzhong: A Sincerity” (2016) showed the artist’s work on display in the museum’s new campus. The wares were acquired through a partnership between the two institutions. The museum recently completed a major renovation of the space and the new exhibition, “MUSE’S FUTURE,” is currently on view.“Wu Shanzhong’s paintings are beautiful in their own right, but they also have the potential to become history,” said Mary Oakes, the museum’s senior curator and director of collections and exhibitions. “His works have a life of their own, and the legacy of his family members. We hope that this new exhibition will give Ijosu", "The next Biennial should bring together the works of all twenty-six artists selected by the Museum of Education, Arts and Design (Museum London) for the 2019–20 season, which is currently underway. The exhibition will be hosted by the Museum of London until November 22 and will include “Sylvia Bocchino: Avant-Garde” alongside the work of Steve Kropf, Hans Ulrich Obrist, and Wolfgang Paalen, among others.“The 2020 Biennial is incredibly exciting,” said Claire Nash, curator of the museum. “The inaugural Biennial was an exhilarating journey, and we are now excited to continue exploring the ways that the exhibition can be more than just an extension of our own lives. The exhibition is here to help us rethink the future of art and to connect with the world around us. We hope that this year’s edition will have you as excited as we were to create a new visual art in the London Gallery.”The 2019 exhibition featured works by Sydney-based artist Ben Brown, whose multi-million-dollar show “I’m Not Alone,” was staged at the Art Institute of Chicago and won the 2019", "The next Biennial should be held in 2020, with the first exhibition opening in 2022.\n\n\nThe Munich Art Museum (MAM) has announced that its exhibition “Sensate (Sensate),” which focuses on the history and culture of art, will return to the city of Munich in 2021. The first show, which is housed in the Bavarian National Museum, will take place in the 70,000-square-foot building in 2021. Its second edition, which will be held at the Kunsthalle Basel in 2020, will take place in the same building in 2022. Both shows will be hosted by Michael Schmidt, who currently serves as director of the Kunsthalle Münster; Peter Elbakken, the current director of the Kunsthalle Heydrich; and Hildegarde Bayer, the current director of the Nationalgalerie.The exhibition will also be staged in the new Kunsthalle Bonn, which will open in June 2020, and during the Twenty-Fourth German Triennale in March 2021. The show will also feature a new project for the museum, a new group exhibition titled “Pier Rembrandt” (Pier of the Rembrandt), and a collection of", "The next Biennial should be held in October 2020.\n\n\nThe National Gallery of Canada has hired Hannah Davis as its new deputy director of curatorial affairs and chief curator. Davis joins the institution from the Museum of Fine Arts, Boston, where she has served as deputy director for the past five years. “In her new role, Hannah will play a critical role in ensuring the National Gallery’s cultural program continues to flourish in the years ahead, and will play a key role in growing the National Gallery’s collection and exhibition experience,” said Anne-Marie Boivin, director of the National Gallery of Canada.Davis will be responsible for helping the National Gallery of Canada’s curators develop and present future exhibitions in its collection, which comprises approximately 265,000 works, and will also oversee the collection and exhibition program and the organization’s development. During her tenure at the museum, Davis worked on several noteworthy exhibitions. The first, “Crossing the World: Contemporary Art from the Contemporary Museum,” was in 2006, during the height of the Arab Spring. The show, which featured work by thirty-three artists from twenty-six countries, was nominated for a Pulitzer. Twenty-five years later,", "The next Biennial should take place in the coming months.”The 2018 edition, titled “From the Desert of the Mind,” will be held at the San Francisco Museum of Modern Art and will run from March 5 to March 7. It will also have an exhibition hall and a public space in the museum.\n\n\nThe Museums Association (MA), the United Kingdom’s leading trade body for museum professionals, has released guidelines for museums facing an impending downturn. The report, released on January 3, outlines five broad themes: the values of the museum profession, the future of the museum, the museum journey, and the future of the institution.The first, “the future of the museum profession,” states that “the future of the museum profession is at risk.” The museum profession is defined as “any person who has previously held any of the following roles within a museum: assistant curator, museum director, director, curator, director of education, of services, or of promotion: director of education, director of exhibitions, director of research, regional director, chief executive, or chief executive officer.”“The future of the museum is at risk,” said Elizabeth Armstrong, director of the British", "The next Biennial should be held in the autumn of 2024. \n\n\nThe Museums Association (MA), the UK’s professional trade group for museum professionals and arts workers, has announced that it is requesting $1.4 billion in aid for British arts institutions in a financial crisis exacerbated by the coronavirus. The funding request, which follows a wave of protests across the UK and internationally against the government’s response to the pandemic, was made during a meeting in London on Monday afternoon.According to the British newspaper the Observer, the meeting produced a collective sigh of relief from academics, arts workers, and other cultural professionals, who were demanding that the UK continue to slash funding to arts institutions, focusing on remediating the economic damage that the Covid-19 pandemic has wrought. The meeting took place as thousands of arts professionals gathered in London to protest at the UK’s government-backed Centres for Contemporary Art (CCA), which they allege is blocking their plans to lay off workers and close galleries.According to the Art Newspaper, the CCA’s director, Maja Paumgarten, told the Art Newspaper that the institution still faces a possible £70 million funding shortfall because of the Covid-19", "The next Biennial should be held in 2020. \n\n\nNew York–based artist and educator Kamala Harris has won the 2019 Mamma Mia! Award, which was established by the National Endowment for the Arts (NEA) and the Mamma Mia! Foundation to honor African American artists and educators. Harris was chosen by a jury comprising artist-in-residence Elin MacGill; painter Kim Thompson; and writer Kiki Smith. “Beginning in the late 1990s, the award jury was captivated by the early work of Kamala Harris, a leading, engaging, and embedded artist of color,” said Frank Kamala, executive director of the NEA and the Mamma Mia! Foundation. “The jury’s decision to reward her was both a challenge and a joy. We are honored to see that her work is valued by a wide and diverse community of artists and educators and that her many talents and accomplishments are recognized.”Harris began her artistic career in the early 1980s as a contemporary artist in San Francisco, where she eventually relocated to New York. She began her career in the mid- ’80s in Los Angeles, where she began her transformation from a painter to a", "The next Biennial should be held in the coming months. Icon’s M.L.E. will present its forty-fifth edition, which will take place in the United States from March 15 to March 21. The biennial will also include a redesign and the reopening of the museum, which has been closed since October 13, 2019. The next edition of the Biennial will be held at the newly renovated Eli Lilly and Company, in New York, on March 28–March 31. \n\n\n\n\n\nHannah Clarkson, center, and Leon Black, center, at the 1992 Sundance Film Festival. Photo: Jodi Throckmorton/NIRIN.\n\n\nWhen a new exhibition of the work of young artists is organized around the theme “Commonality,” the potential is great. But when collaborators, including Adam D. Cohen, Monica Halperin, and Will Pfeifer, are chosen as the artists for the event, the possibility of something unexpected becoming a reality is almost impossible to overstate.The theme of “Commonality” is a question that has plagued Cohen since he began making films in the early ’70s. “I am not", "The next Biennial should aim to “not only recognize the powerful potential of art and design,” but to devise new and more constructive ways of supporting the art and design communities. The project will also include a literary program, exhibitions, and performances, a variety of programming, and a book.“We are grateful to the festival and the committee for their consideration of our proposal, and of their strong belief in the value of the art and design community,” said the organizers.\n\n\nThe BlackPill Gallery in London is launching an online exhibition dedicated to Sarah Polson\u0097the pioneering African American artist best known for her body of work composed in charcoal\u0097which will open in December. The exhibition, titled “Her Body,” will showcase a selection of her early paintings and will also include a selection of her later works, which address issues such as the death of a black family in a white neighborhood in Detroit, and the racial politics of the incarceration industry in America.“The BlackPill Gallery has long been known for its commitment to the work of Black artists, and we are excited to be able to present the first of Sarah Polson’s paintings here in London in 2016,” said BlackPill", "The next Biennial should focus on the construction of a new legacy of work in post-war Germany, with special attention paid to the emergence of new forms of cultural exchange as well as the transformation of the museum into a permanent collection center. The exhibition “One Hundred Years of Art” will be inaugurated with a special exhibition of work by Hans Ulrich Kohler, one of the founders of the König-Bauhaus, at the museum. Last year, the exhibition received an exhibition award from the König-Bauhaus, which was founded by Alfred von König in 1860.\n\n\nThe Museum of Fine Arts (MFA) in New York has received a $1 million donation from philanthropists Aryeh and Reem Kohler. The donation supports the installation of a new twenty-foot-tall statue of Edward Colston, a Congregationalist minister who committed suicide in 1825, at the institution’s home in the Hudson Valley in the fall of 2019. Edward Colston: The Prince is a monument to a lifetime of dedicated service to Christ.”Prior to the donation, the MFA worked with British artist Marc Quinn to create a memorial to Colston, who died in 1825 at the", "The next Biennial should be held in the autumn of 2022, with the inauguration of the exhibition “Avant-Garde” in the spring of twenty-two years. Artforum will announce the date, venue, and other details for the exhibition in the coming weeks.\n\n\nThe Independent Art Museum Manchester (IAMD) has awarded a new £6.5 million grant to the arts and cultural sector in the city. The project, which aims to support the creation of new work in the city, is the largest arts-oriented grant ever made by the National Lottery Heritage Fund.Salman Rushdie’s tribute to Ian Watkins was staged at the IAMD in September and October of this year. The grant, which was created to honor the late British painter and essayist, was administered by the National Lottery Heritage Fund, to support works by dozens of artists. Among the grants awarded were Aoife Hyndman’s “The Time of the Blood,” for which he paid $6.5m; Lévy Gorvy’s “The Painter” for which he paid $6.5m; Yazhi Nusseibeh’s", "The next Biennial should be in the spring of 2020, and the programme should consist of three exhibitions: “The City of New York: A New History,” the first exhibition celebrating the city’s history from its founding in 1635 until 1975, “The American Polygamy,” and “The American Experience,” a survey of American art and architecture from 1945 to 1975. The next branch of the exhibition will focus on the history of man-made urbanism from 1890 to 2010. \n\n\nThe Museum of Contemporary Art (MoCA), Boston, has appointed David H. Krzemczyk, the director of the Mary Boone American Art Museum in Missouri City, as its next chair. Krzemczyk has helmed the museum since April 2019, when it was still a division of the Worcester Art Museum, and has led the institution through a $58 million expansion and renovation project, the reopening of its inaugural exhibition, “American Ethnography: From Philistine to Tribal,” and the establishment of a new wing of the museum.“David has been instrumental in developing the museum’s collection and mission, expanding its collection and collection program, and building on our growing collection", "The next Biennial should embrace a more ambitious narrative and provide a larger-scale public-art project to reflect the shifting global landscape. It can also continue to be a platform for Indigenous artists.While the committee established to approve the 2020 theme expressed dissatisfaction with the new works, it also praised the committee for working together to come up with a solution that ensures the future of the work, the Biennial, and its programming, including the 2021 edition.\n\n\nThe Science Museum Melbourne (SMM) has received a major gift of two great works by contemporary artists, including John Parrish’s The Dear Hunter and Talbot & Craven’s The Fatality Game. Both works were commissioned by Australian artist Karl Osterhout and were on display in his “Sculpture at the Science Museum” exhibition series in 2017. In an unprecedented move, Osterhout donated the works to the museum. He was troubled by the fact that the artist couldn’t legally donate them to the institution, and he attempted to contact the artist to make the gesture possible.The works are part of an extraordinary collection of paintings and works by Australian and international artworks that includes works by Andy Warhol, Robert Irwin, and others that have been", "The next Biennial should, hopefully, be a return to its core philosophy, with an active exploration of interactive programming and how it can be a platform for social and political inquiry.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it is bringing two new works by artist-in-residence Rowlanda Al Qasimi to the institution in 2020. The first, a series of translucent Plexiglass images by the artist in the company of a group of women, will be on view in Al Qasimi’s next show, “Ateliers du cinéma” (2019). The second, a video installation by Al Qasimi, titled “Al Qasimi: Light and Shadow” will be a retrospective of the artist’s work, which was created in collaboration with the Museum of Contemporary Art in Miami Beach, from June 18 to June 21, 2020.“Al Qasimi’s work, which draws on urban realities, contemporary notions of art, and rituals, offers an exploration of the conceptual and physical boundaries of contemporary life,” said Bruce Gendelman, the director of the Museum. “Alden Gendelman", "The next Biennial should take place in 2022 and will be hosted at a location yet to be determined. It will be hosted by the private art museum CNRS Navarra in Barcelona and the University Museum of Arts in Lisbon. The next edition will take place in the city of Reggio Emilia, Spain, and will be held in the year 2023.\n\n\nThe National Geographic Society and the CNE (Center for European Natural History) in Washington, DC, have launched a new initiative that will focus on the exploration of the history of art through the lens of climate change. Called the Hillside Center for Climate Change, the program will invite sixty local and regional organizations to collaborate on projects that will address climate change impacts and remain grounded in natural history.The program will commission artists to create works that address issues of climate change, such as deforestation and coastal erosion, while also seeking to re-create natural landscapes that are resilient to climate change. The 2020 and 2020’s editions of the Hillside Center were curated by Yinka Shonibare and comprised of thirty works, Alberto Kuce & Lorie Pape, The Unseen, and The Inflatable Forest.The central goal of the project is to re-", "The next Biennial should be held in the fall of 2019. The 2019 iteration was held at the Duge Museum in Hamburg and the Gustav Klimt Museum in Berlin.\n\n\nThe Southeast Asian city of Yangon has become the latest in Asia to ban large-scale public artworks. The Art Newspaper reports that the city of about four million people in the country’s Yangon Prefecture voted to suspend the public artwork Syrthycheir (Scythe of the Dragon), a massive bronze sculpture that is located in the city’s Jinchengzong area, for a period of sixty days, in an attempt to protect the environment and the culture.“The suspension of the work will allow the authorities to collect data about the environment that will be useful in planning the next phase of the work,” Yangon governor Duye Wai-Min told Artnews. In a statement, the city said: “The suspension of work Scythe of the Dragon will allow the authorities to collect data that will inform their conservation and management of the environment. This data will help them to make decisions regarding the conservation and management of the sculpture, which is an important cultural heritage site.”The sculpture was", "The next Biennial should take place in the city in 2022. \n\n\nA group of artists and activists have formed to protest the dismantling of the Royal Academy of Arts (RA) in London. The pressurized-air’s refurbished interior and exterior have been the subject of protests and petitions from academics, architects, and cultural figures. The group, Artists’ Arms, have announced that they are launching a campaign to encourage the Royal Shakespeare Company to stage a reopening of the academy, which reopened to the public in 2021, and to get existing and upcoming shows canceled—specifically, the company’s upcoming season at the Royal Festival Hall.The group’s petition reads: “The Royal Academy of Arts is undergoing a massive transformation. The new building is filled to bursting with modernity, and the old theater complex is being replaced by a major new building, the Studio, which is being designed by Guggenheim Partners. While the Studio will undoubtedly present exciting developments for the future of the RA, the dismantling of the RA is a betrayal of all those who have made this institution such a success.”The petition notes that, following a long-overdue renovation, the RA is now 'unshackled from all", "The next Biennial should be held in 2021. \n\n\nMore than 2,600 artists, art collectors, and collectors are urging the California Department of Cultural Affairs (CalArts) to reverse its decision to cancel the 2019 edition of the Los Angeles Biennial. “We strongly urge the California Arts Commission (CalArts) to recognize the immense moral victories won by women and girls in the twentieth and twenty-first centuries, and reinvest in their future,” reads a statement issued by the signatories. “Together we can win.”The letter, which was addressed to Commissioner of CalArts Dianne Persily, who made the decision following a public hearing held on March 3, and was signed by John Lennon, Janet Jackson, Hank Willis Black, Laura Owens, Wangechi Mutu, Shirley Tursen, and Sylvia Turner Wright, as well as Joy Banes, Erin Andrews, Aeschyl Laab, and Sara Watts-Brown, among others—the artists are demanding that the cultural institution cancel the exhibition “Unbroken,” which was scheduled to run from June 8 to", "The next Biennial should be held at Hong Kong University of Science and Technology (HKU) in the city of Wuhan.  While the exhibition will focus on contemporary art and will be hosted by the Hong Kong Museum of Art (HKMO), the Hong Kong Film Institute, and the Hong Kong Museum of Art, the biennial will also include a presentation of works by modern and contemporary artists. The exhibition will run from November 17 to November 20, 2020. Catherine Yuen, director of HKMO, said: “The Hong Kong Biennial is a joyous occasion for us all. It will bring together contemporary artists from Hong Kong and around the world to celebrate the history of Hong Kong and the Hong Kong stories, as well as the diversity of Hong Kong art.”\n\n\nThe Independent Foundation for Art (IFA), a charitable organization based in New York City, has awarded $1.2 million to fifty-eight artists for their first-ever grants. Each year, the organization distributes $6 million to some of the most pressing, challenging, and misunderstood artistic projects in the United States. Adeline Bove, Director and CEO of IFA, said: “We are incredibly grateful for every artist who", "The next Biennial should examine the biennial’s legacy through the work of the exhibition’s major artists and their artists’ artists, musicians, and other cultural representatives. The third biennial will examine the work of modern and contemporary artists. The fourth will include an interdisciplinary presentation of works by artists who remain under-recognized. The fifth will examine the legacy of the exhibition’s first laureate, the painter and theorist Hyman Gartner. John Maynard Keynes once said that when one is dealing with a lifetime of work by a single artist, the greatest art has never been more important than it is at this moment, and it may be that the greatest art is still to come.\n\n\nArt historian and curator Peter Kropotkin, one of the founders of the Communist Party of the Soviet Union and a leading proponent of Marxist-Leninist-Leninist-Leninist theory, has died at the age of seventy-seven.Born in Moscow in 1932, Kropotkin graduated from the local State Academy of Fine Arts in 1943 and from the Academy of Fine Arts in 1958. In 1959, Kropotkin was elected to the Politburo, and at the institution in Moscow, he began the", "The next Biennial should focus on the history of African art and the new digital technologies that affect and expand the body of work by African artists internationally. ​The next Biennial should focus on the history of African art and the new digital technologies that affect and expand the body of work by African artists internationally.\n\n\nThe Museum of Fine Arts (MFA) in Boston has introduced two new initiatives that will give local communities a hand in the restoration and conservation of cultural assets, including sculptures, works of art, and historic buildings.The programs, which were unveiled at a press event held on Tuesday, August 19, were developed by the museum in partnership with the Doris Duke Foundation and the Salvatore Ferraris Foundation, and were initiated as part of an ongoing effort to hold museum officials accountable for their fundraising practices. The foundation was also responsible for the donation of six sculptures by French designer Georges Apostu and the Italian sculptor Silvio Fontana.“This year’s mFA Biennial was inspired by the Duke and Ferraris Foundation’s recent acquisition of three works by former director Edward B. Johnson, and by the anniversary of the foundation’s founding,” said director Michael Raine. “The gift of", "The next Biennial should focus on “Theoretical Feminist Perspectives” as well as “Women’s Studies” and “Social Justice: Balancing Power and the Need for Social Justice” and is currently accepting submissions. “The art of feminism and the art of the movement is inseparable,” said LaToya Harrison, the chair of the biennial. “The Future of the Movement is Feminist: The Future of Feminist Art is Feminist.”\n\n\nThe Kalamazoo, Michigan–based nonprofit Art Advocacy, a fellowship program that supports artists who have had their work published in the New York Times, the Los Angeles Times, or the Art Newspaper, has awarded $50,000 to ten artists who were chosen from a pool of ninety applicants and has opened an application for its 2019 edition. The ten finalists were selected from the group show “There is no such thing as a good book,” curated by Linda Appleton, and “Art is a Human Construct” at the Darcy Group in New York, which has been supported by the MacArthur Foundation since 2009. The other fellows are Elissa Bates, Poppy Butler, Alex DeLong, and Barbara Goldberg", "The next Biennial should focus on the legacy of Winston Churchill, and the role of the European Communities and international diplomacy in the twenty-first century, and should employ new and existing sources, including the work of survivors and archivists interested in the period. The first exhibition at the Museum of British Art will open in London in 2021.\n\n\nThe Metropolitan Museum of Art and the Whitney Museum of American Art in New York announced today that the museum’s collection of seventy-five works has received a $250 million donation from the billionaire Warren K. Kanders. “The Kanders Gift: A Century of American Art,” which will open at the Met in 2021, will include: A Century of American Art: From the Victorian Revival to Modernism and Beyond, 1952–1963, A Century of American Art: From the Victorian Revival to Modernism and Beyond, 1964–1985, A Century of American Art: From the Victorian Revival to Modernism,” will be on view May 29–June 6, 2021.The gift was made in recognition of the Met’s expansion into new territories, including its acquisition of the first large-scale works by artists from Africa, the Middle East, and Asia", "The next Biennial should focus on “the extraordinary,” said artist Tod Musgrave. It should also examine art and culture in the ’60s and ’70s in a way that reflects the contemporary United States.The 2020 edition will include nearly sixty works by contemporary artists whose work is housed in the museum’s Core Collection. The Indigenous Art Collection, a new collection that will be inaugurated by artist and educator Jeanine Haag, will exhibit five hundred works by contemporary artists whose work is housed in the institution’s Collection Gallery. The exhibition will also welcome works by twenty-four artists whose work is currently on view in the Contemporary Arts Museum’s exhibition “Motion.”The museum will move the works on display in the museum’s new campus, which will be completed in 2021, and is currently working on the design for the new building, which will be built in a community center adjacent to the museum. The design includes a public green space for the exhibition space, a plaza that will provide an accessible gateway for visitors to the museum, a plaza at the entrance of the museum, and a plaza adjacent to the museum for the reception of visitors.The 2020 edition will organize a variety of Indigenous artists", "The next Biennial should be held in 2022.\n\n\nA new exhibition at the National Art Museum in Washington, DC, has revealed that its current group show, “Living in the Image,” will be extended through March 2020. The exhibition will now showcase work by fifty-four artists, including Eduardo Paolozzi, Yi-Wei Huang, Anita Khobragade, and Rosemarie Trockel, and will also feature newly commissioned works. It will be inaugurated by Jonathan Chait’s profile of the artist Xuezvara Rosales and his memoir of the same name. The show will also include works by artists such as Eduardo Paolozzi, Adriana Varejão, Nara Pindell, Ali Madani, and Zenaida Al-Ghamdi.The change was made in light of the National Museum’s decision to shutter the exhibition, “The Image of Destructivity.” The museum said that it only received the full complement of the artist’s participants for the March show. In an attempt to preserve the exhibition, the institution will begin an online viewing room on March 9. The live viewing room will then open to the public on March 30", "The next Biennial should be held at the Dusseldorf Museum of Contemporary Art, Germany, in 2019. The exhibition will follow the opening of MART (Martial Art, Performance, and Design) in Helsinki. In November 2019, the museum held the first edition of the Children’s Museum of Art, the Frieze Arts and Design Show, and the Gulf Cup Challenge. “We are delighted that this year’s Biennial will open at the Museum of Contemporary Art in London,” said Robin Browne, head of the museum. “The work of the outstanding artists represented in the exhibition reflects the diversity and innovation of contemporary art at the Museum, and their ability to bring disparate collections together to form bridges between cultures and societies.”Since its founding in 1899, the Biennial has showcased the work of thirty-six artists. The inaugural exhibition, titled “Art and Life” and unveiled by sculptor Jean-Luc Méliès, was staged at the Museum in London in 2017. The 2018 edition, titled “The Future Is Present,” featured twenty new works and the artist’s first solo exhibition in the United States since 1955.", "The next Biennial should be held in 2021.\n\n\nThe Solomon R. Guggenheim Museum in New York announced today that it has created two new positions in its editorial department, which has been serving as the organization’s organizing committee since 2019. The newly created positions—in addition to the existing positions—will focus on cross-disciplinary inquiry.“The editorial staff plays an important role in the artistic process. This committee is committed to working together with the artistic directors to understand and address issues that arise within the institution,” said curator and director Katherine Hewitt. “We hope that these new positions will provide an opportunity to work with the editorial staff in their own community, and to collaborate with artists in New York City.”The Guggenheim’s previously announced 2020 plans include opening a new flagship space, the Guggenheim Pavilion, in the city in 2021. The project, which was first announced in 2019, has been in the works for more than a decade but was stalled in March 2020, when the pandemic put an end to the exhibition calendar. The project is currently in the works for a second iteration at the Guggenheim, which will debut in 2022.While the pavilion will be", "The next Biennial should take place in the same location in 2019. The 2020 event will be held on the same date as the 2019 edition. The 2020 biennial will be a combination of historical and contemporary art. The 2019 edition was staged in a “fourth-century” monastery, which is why the exhibition will take place in the city of Zagreb, which was founded by the Polish states in 1918. The exhibition will include works by artists such as Tomasz Klimczyk, Zbigniew Brzez, Gregory Feuerstein, and Tadeusz Klimczyk.The 2020 exhibition will be the longest-running exhibition in the museum’s history. In addition to the exhibition, the museum will host an additional triennial exhibition on art and architecture in 2021.\n\n\nThe 14th edition of the Venice Architecture Biennale, curated by Marco Mieschi, has announced that it will be hosted in conjunction with the seventh round of the Italian architecture and design fairs from June 11 to June 15. The event will now take place at the Veneto Artis in Venice from June 14 to June 17. “The Venice Architecture Biennale is a very important achievement, ”", "The next Biennial should be held in the spring of 2020. The 2020 program will be led by a group of contemporary artists from the United States, Canada, and Mexico. The twenty-first will be arranged in the first half of 2020 and will conclude in the second half of 2020.\n\n\nAmerican artist and professor Leslie Tweedy, whose work focuses on the relationship between the environment and the body, has died at age ninety-one.Born in 1920, Tweedy studied at the University of California, Berkeley, before moving to New York with her husband and son to become a professor of the social sciences at the City College of New York. Tweedy settled in the city in the 1950s and received her Ph.D. in art history from Brooklyn College in 1961. In 1978, she took up painting, and in 1985, she commenced her series “Flowers in the Clock Tower,” which invites the viewer to step out of the city and into the Garden of Eden.“I had not made a decision about where I wanted to go,” Tweedy told the New York Times in 2015. “I would have chosen to be a city in the midst of chaos.” Her paintings have been exhibited at the Museum of Modern", "The next Biennial should be held in 2021. Apart from a few exhibitions organized in the past, the institution has been operating in a state of disrepair since the Communist Party seized power in China in 1949. The museum has been closed since March 2011.\n\n\nThe Museums Association (MA), a United Kingdom–based organization of more than 2,500 arts professionals, has announced that the London-based organization, which works with local authorities to secure world-class exhibitions at historically important sites such as the Tate, the Southbank Centre, the National Portrait Gallery, the National Gallery, and the British Museum, will receive $2.5 million from the £1.5 billion National Lottery Heritage Fund.  The money will be divided between the national heritage organization and fifty local authorities across England, Scotland, Wales, and Northern Ireland.Although the fund is established to support cultural institutions, the Kingdom’s Department for Culture, Media and Sport (DCCS), which oversees the fund, has been criticized for prioritizing the extension of London’s Blackfriars Art Museum and the National Portrait Gallery (NPG), in Manchester, rather than supporting the institutions that make up their respective cities. In", "The next Biennial should be the next edition of the new programme “Between the Sun and the Moon,” which will be staged at “80 Nara,” a new contemporary art space currently under construction in the city of Nara, Morocco. The theme of this event will be the exotic relationship between the sun and the moon, which will be the backdrop for a series of photographs that will accompany the exhibition. The exhibition will be organized as a “portrait” in order to explore the concept of the sun and the moon as living entities in a desert environment. The artist’s substitute for the sun in the series, titled Between the Sun and the Moon, will be a “virtual sun,” which will contain a virtual image of the sun and the moon. It will also feature the newly created work of the artist Gilles Bénétière in the form of a virtual landscape. The work of the artist is a set of photographs that depict the sun and the moon as moving through the landscape, in an attempt to trace their relationship to each other and the planet in which they reside, which was created in collaboration with the artist and the artist and is on display in the exhibition. The", "The next Biennial should take place in 2020 and will be hosted by the New York artist-run museum Artsadia, which will be inaugurated in the city as part of the 2020 Whitney Biennial. The biennial will be open to the public and will be presented by the artist-run museum and curated by Wangechi Mutu, the country’s president and chief executive of the National Union of Journalists. “We are excited to welcome our neighbors and to play with our city’s landscape,” said Marlene Anand, chair of the museum’s board of directors. “We are also excited to see the results of this partnership in the coming years. We hope that the next Biennial will further inspire and ignite our city’s imagination and spirit.”The architecture of the island is made of five themes: the church, a ceremonial center, an archaeological site, and a library. The church was designed by Kalinari & Associates in collaboration with architect/conceptualist Olafur Eliasson; the library was created by Richard Lustgarten; and the archaeological site was created by the sculptor Huyghe Bopape. The museum is located", "The next Biennial should take place in the spring of 2022. The biennial will be designed by the Institute of Contemporary Art (ICA) of the University of Milan, which will receive funding from the city of Milan. The institution will create a platform for new thinking about art and architecture through an exhibition that will be guided by a rotating group of curators and will present new works in collaboration with the city of Milan.“The museum is currently working on a new set of expectations for the biennial, to reflect the changing conditions of a museum as it works to create a new future,” a statement from the museum read. “The new project theme, ‘manifestation,’ will tell the story of the museum’s transformation from a museum for the museum to an institution that offers opportunities for social and philosophical exchange.”The full list of participating artists is as follows:Alistair Brown, A. K. Schirmer & a team of artists, artists, artists, artists, artists, artists, artists, landscape, art, architecture, art, art, art, art, art, art, Art: a series of paintings, sculptures, photographs, video, sound, and installation from", "The next Biennial should also include an exhibition of work by the CNAËNAM-TRC, an international collective who are currently working on a show on the destruction of art in Iraq. The group will screen three episodes of their new film series, “Art of War” (titled “Painters”) at the Paris Film Festival. The exhibition, which will run for two weeks, will also feature a presentation of work by the CNAËNAM-TRC.“We are thrilled to collaborate with the Cannes Academy to create the next Biennial for Art, Art of War, that brings together the best of contemporary art and politics to address the international challenges of our time,” said Christopher Le Guille, president of the Cannes Film Festival. “The theme of the year is ‘art in the service of power.’ The best way to understand this is to think of art as a tool, a tool that can transform the lives of people and change the world for the better, but also as a way of life itself.”The Biennial “Art of War” and the Far Future Art Series’s presentations of works by the CNAËNAM", "The next Biennial should be held in 2021, the full-time curator being awarded a five-year contract by the Arts Council.\n\n\nThe Museum of Fine Arts (MFA) in Boston has been gifted a new $25 million lung cancer research center following a $10 million gift made by the John D. and Catherine T. MacArthur Foundation. The foundation also pledged $10 million for new research and a new center dedicated to the medical study of art and design. The $25 million gift will enable the museum to develop new treatments for lung cancer, which currently kills more than 2,500 people in the United States each year.“We are thrilled with this gift from the John D. and Catherine T. MacArthur Foundation for our Lung Cancer Center,” said Mary Ellen Brook, director of the museum. “It is a critical step in helping us to understand and treat lung cancer more effectively, and we are confident that this gift will help us reach new ground with new and innovative ways to support our research.”The center will be built in the MacArthur Landers Gallery, which will be relocated to the museum’s new headquarters, the Kennedy Center, in Boston. The building will host the museum’s annual biennial,", "The next Biennial should begin this March and conclude in late April. The show will feature 150 works by eighty-three American and thirty-six international artists, including Andy Warhol, Pierre and Louise LaBouvier, Felix Lüpertz, and Ed Ruscha, among others. The 2020 edition will feature 70 new works by artists who have died since the exhibition’s inception. The 2018 edition, titled “Between the Sun and the Moon,” featured work by twenty-six artists and writers. The 2019 edition, titled “Light and Shadow,” featured work by forty-five artists, including Mark Leniart, Mark Bradford, Danilova Dziewior, and Paul Graham, among others. “We are pleased to introduce a new series of Biennial at the Palais de Tokyo,” said Kate Satterwhite, chair of the exhibition. “In recent years, the festival has become a platform for artists to present their work and for visitors to connect with their work at an international level. We have had an exhibition of work by Porchetta Muffazio in Paris in 2015, and artists Felix and Ed Ruscha presented their work at the Biennial in", "The next Biennial should be held in 2020, and the next should be the last.” Wang added that the future of the museum is now uncertain and that it has been working on revising its current exhibition format to ensure a more diverse collection and a more global presentation of contemporary art. As part of its efforts to present a unified view of contemporary art, the museum will organize five exhibitions in 2020–21, coinciding with the fourteenth Biennial of Modern Art.Under Wang’s leadership, the museum has grown to become one of China’s major cultural institutions and has become a vibrant hub for international travel. Its exhibition space, which opened in 2014, has experienced a period of sustained expansion. Wang was elected to the board of trustees of the Geffen Museum in Rome in 2010 and 2011, and to the National Museum of China in Beijing in 2014. He is also a cofounder of the Beijing-based museum and has served as a board member of the Shanghai Open Air Museum in Beijing for the past three years.Commenting on his new role, Wang said: “I am honored to be selected for the position of director of the Geffen Museum and to be able to continue to develop the museum�", "The next Biennial should take place in 2021, and a new exhibition, “Telling Stories,” will be presented by the Biennials.\n\n\nThe Metropolitan Museum of Art in New York has named Kate Kelly as its next director and chief curator. Kelly comes to the museum from the San Francisco Museum of Modern Art (SFSF), where she has served as director of exhibitions since 2013. During her tenure, Kelly curated “Collected Histories: A Legacy of Art” (2015); “Blindspot: the Art of Robert Irwin” (2017); and “The Front: Opera on the Street” (2018). She also curated “Ghosts of GOB” (2016), and “Empire of the Sun” (2017), among other exhibitions.Kelly’s new role comes in the wake of the museum’s construction of a new, nearly four-thousand-year-old wing, the new David Zwirner–designed David S. Guggenheim–Gallery, in the form of a sprawling, 168,000-square-foot complex, and the reinstallation of the David K. Ashley–designed galleries. A new, larger", "The next Biennial should take place in the spring of 2021, and the biennial will be the inaugural event of the new Royal College of Art (RCA), which has launched a competition to help identify the one artist who will transform the venue. The competition will run from February 10 to February 12, 2021. Winners will be selected by a jury comprising Ugo Lefebvre, artistic director of the Biennale di Milano; Sophie Montag, co-founder of the contemporary art space Femke Poulin; and artist Martin Tillmans, director of the Institut Karlsruhe in Paris. The artists will each receive a fixed sum of €100,000.Inaugurating the Biennale, the RCA will present a new exhibition of work by a group of young LA-based artists, the \"Artists in Residence,\" curated by artist Annie Pape. Among the featured artists are Chanel Laverdi, Arthur Escobar, Jaden Smith, and Bernardo Ullo, and will be presented in the form of a virtual reality work. The exhibition will take place at the Royal Academy of Arts in London and will be supported by resources from the Royal Arts Council. The artist-run venue TFC 2011 will", "The next Biennial should be held in 2021.  The new venue will be inaugurated by a new exhibition of work by the artist-run collective Front Row. Under the direction of curator and curator-designate Yair Levy, Front Row will present a show of the work of seventy artists, including Amadeo Malamud, Roberto Cornejo, Andreocho Hanrahan, and Natalia Laudel, as well as a retrospective of the work of Claudia Rintoul, the former director of the Pit, in the late 1960s, and an exhibition of art by Mariane Durov, the former director of the Museum of Contemporary Art, London, at London’s Tate Modern in December 2019.  Outgoing chair of the committee Marija Šikljančić will be replaced by the artist and curator Mihai Kunzru in February 2021. Dubbed the new curator, Šikljančić will oversee the exhibition “Behind the Curtain,” a joint project between the SculptureCenter, the Guggenheim, and the SkulptureCenter, and will be responsible for curating performances by the artist-run collective Working", "The next Biennial should be held in the fall of 2020. The exhibition, titled after a common Hindu term for the body, will consist of works which demonstrate the diversity of human form through groundbreaking dance, installation, photography, sculpture, and performance. “Because of our need to create alternative models of the material world, to break from both the material and the spiritual worlds, to participate in a way that is both transcendent and personal, our work will be symbolic and subjective, reflecting our internal states of mind,” said Daisuke Nakamura, the president of the Biennale. The biennial will be organized as a collective effort in collaboration with the artists who have contributed to the project. The 2018 edition, titled Dreamers Alive, which was staged at the Soosan Palace in Seoul, was curated by Choi Seo-kyung, Kim Seo-suk, and Kim Soo-kyung. The 2019 edition, “The Future Is Not Now,” was curated by Kim Eun-sung, Kim Seo-kyung, Kim Eun-sung & Kim Eun-sung, Kim Woo-sung, Kim Woo-sung &", "The next Biennial should aim to address the legacy of the institution, which is recognized for its academic reputation, its exhibitions, and its relationships with other major arts institutions, as well as share the public’s experience of its exhibitions and collections with a new generation of Singaporean art-mad tourists. The fifth edition of the Biennale will take place at the Singapore Art Museum (SAM) in Singapore from September 12 to September 15.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has published new guidelines for the placement of contemporary artworks within New York’s public spaces. The guidelines, which were made available on Friday, September 14, outline how spaces such as Times Square, Lincoln Center, Lincoln Center West, Lincoln Center East, Lincoln Center Center, Lincoln Center East, Lincoln Center West, Lincoln Center South, Lincoln Center North, Lincoln Center, and Lincoln Center Garage should be designed to evoke images and feelings of the city.“New York City has long been a masterful urban landscape,” art historian and author Ashlee Vance wrote in a letter to the editor for Artforum. “It has been less celebrated in recent years, but the city continues to post astonishingly beautiful photographs of the city.”", "The next Biennial should be held in 2020, and the 2020 edition will be staged at the Museum of Contemporary Art (MoCA), in New York. The exhibition will continue to feature works by shortlisted artists and will return with a selection of works by future winners in 2022. “While we have some of the most talented artists in the world, we want to honor their achievements through a systematic and focused exhibition program,” said Richard Armstrong, the director of the Museum. The new mandate letter states that the exhibition “will highlight a specific way in which the idea of contemporary art is reconceived in the thirty-first century.”Artforum will keep you updated with the latest news and events from the Biennial.\n\n\nThe Swedish National Museum in Stockholm has announced that it is suspending all new exhibitions and performances in its three locations as part of a $15 billion restructuring plan designed to reduce the institution’s direct financial impact from the coronavirus. The restructuring, which was announced in March, involves the elimination of more than one hundred jobs and is considered part of a wider, three-year restructuring process that will aim to reduce costs and improve the financial health of the institution.“The National Museum has been working hard to", "The next Biennial should take place in Autumn 2021. The exhibition will feature work by fifty-four artists, including Helène Delaunay, Conrad J. LaBouy, and Colombia Núñez. The exhibition will also include a selection of works from the collection of the Museo de Arte Contemporáneo Artística de Buenos Aires (MASB), curated by María Berrío.The exhibition will be curated by Carla de Cisneros, the president of the Federación de Cultura y Diseño. During the exhibition, which will be inaugurated at the museum on September 11, there will be a special section dedicated to the history of photography and a special exhibition of photography works created after the Spanish Civil War. The inaugural exhibition will also feature works by Gabriel García-Real, Marcia Fernandes, and Jean-Luc Melchior.\n\n\nThe Museum of Fine Arts (MFA) in Phoenix has appointed Jess Pomeroy as its next executive director. Pomeroy comes to the institution from the Arizona Shakespeare Theater (ASTA), where she worked as a writer and actress before she was hired to lead the theater. She succeeds", "The next Biennial should be held in 2020, but thus far no date has been set for the venue.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Paul Mpagi Sepuya, a South African curator and educator, as the first director of the institution. Mpagi Sepuya will assume his post on January 6, 2020.“Paul has shown exceptional leadership in building the National Gallery’s international reputation, and we are thrilled to welcome him to the institution,” said museum director Rebecca Harris. “We look forward to working with Paul and to building the gallery’s work in this new and creative way with our new partners, the Human Rights Campaign, the ACLU of DC, and other powerful voices around the country.”Sepuya previously served as the head of the South Africa–based artist-run space She Builds, which she ran from 2010 to 2020. She also cofounded the African-inspired nonprofit Third World Works, which was inspired by South Africa’s black liberation movement, and lent her services to artists such as Paul McCartney, whose music she helped to popularize, and Z'Nex, which she helped to form. Sepuya also founded the award", "The next Biennial should be held in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Houston, Texas, has appointed Norberto Rivera as its new associate curator of modern and contemporary art. Rivera comes to MFA from the Metropolitan Museum of Art in New York, where he currently serves as director of curatorial affairs. During his tenure at the Met, Rivera has organized exhibitions such as “Wangechi Mutu: I, Andre,” 2019, “Wangechi Mutu: A History of the World” (2019), and “Dia Artica: Contradictions of a Painter” (2018). He also holds a curatorial professorship at the Museum of Fine Arts, Boston, and has served as a consultant for the MFA team on a number of occasions.“We are thrilled to welcome this leading curator to the MFA,” said Richard Armstrong, director of the museum and the Met. “His exceptional curatorial skills and proven track record for bringing innovative and ambitious exhibitions and curating programs to our regional, national, and international partners will be crucial to our continued success and to our mission.”\n\n\nThe National Gallery of Art in Washington, DC, is launching", "The next Biennial should be held at a location that has been selected by the city for its potential as a cultural and tourist destination and has sufficient public space. The first edition of the event will be held at the Four Seasons Hotel in Beijing. The exhibition will address themes such as the concept of art and culture in contemporary society, the artists that have influenced the exhibition, and how art and culture is reflected in lives and artworks.\n\n\nTom Gidley, artistic director of the prestigious London Independent, was found dead in his home on March 3, at the age of seventy-two.Born in London in 1937 and raised in the city, Gidley has made his living by traveling extensively around the world, including to Cuba, Japan, the Philippines, and Peru. His extensive travels have given way to a more self-taught, more experimental style of work, which has been described as a high-wire act.Gidley’s art has been exhibited at the London Museum of Art and at the Palais de Tokyo in Paris; at the National Arts Centre in London; and at the Musée d’Art Moderne in Paris. His paintings are in the collections of the Musée d’Art Moderne, the Mus", "The next Biennial should begin with an overview of the history of the exhibition, as well as a reflection on the exhibition’s future and its potential. The first exhibition should take place in the summer of 2022.\n\n\nThe Negev Regional Council in Israel has appointed the Israeli-born, New York–based curator Rosie Fineberg-Wechale as the new deputy director of the Negev Art Museum. She has been appointed by Prime Minister Benjamin Netanyahu, who first tapped her for the post in June 2019.“We are delighted to welcome her to the Negev Art Museum,” the local authority, which was founded in 1970 by the late collector Haim and Zvi Fineberg-Wechale, as director, and have been working closely with her to ensure that she is promoted to the position of deputy director,” said Minister of Tourism and Culture Isai Galant. “We are confident that Rosie Fineberg-Wechale’s expertise and vision will be instrumental in strengthening the Negev Art Museum’s international reputation and attracting new audiences to the institution, and that she will contribute to the Negev Art Museum’s continued success.”The appointment was made", "The next Biennial should be held at the New Museum in New York in 2021. That year, the Biennial of the Arts will conclude with “NIRIN,” an exhibition of work by twenty-six artists, including Joe Bradley, Peter Cook, and Adrienne Edwards. It will also be the last Biennial of the Arts.\n\n\nThe Museum of Fine Arts (MFA) in Boston has announced that it is planning to open two new locations in the city in 2020. The first, a new twenty-five,000-square-foot building that will open in the arts district of Dorchester in 2020, will be situated on the second floor of the museum. The second, a project of the artist-run organization Dreamhouse Space, will be housed in the former headquarters of the New England Center for Performing Arts (NEPAA), a nonprofit arts incubator founded by the American Folk Art Museum (AGM) in 2007.The new spaces will be inaugurated with “Dreamhouse: A Retrospective,” an exhibition of two dozen works by Dreamhouse Collective, a group of contemporary artists whose work is organized around themes of dreams, collective memory, and the image of dreams. The show will explore Dreamhouse", "The next Biennial should be a celebration of the legacy of the first president of the Republic, José Eduardo Freire, and its inspiring artists, musicians, and academics\u0097not only as individuals, but as a collective.  The next edition should take place in the city of Santa Fe and will focus on the work of Emil Bochenek, Viktoria Brulberg, Rosalind Franklin, and Anna Rey, as well as her students and collaborators.“The Biennial in Santa Fe has been an enduring source of inspiration to me and my colleagues, and we are grateful for the support that the museum and the city of Santa Fe has shown us over the years,” said curator Maria Dolores del Val, president of the Instituto de Cultura Museo Santa Fe. “The final exhibition will be a reflection of the spirit of the Biennial, the first exhibition in which the biennial will be incorporated into the narrative of a new project, the project of the biennial.  This will be a moment for us all to reflect on the biennial as a whole, with the artist and the artists who created it\u0097and especially to reflect on how this exhibition will connect with", "The next Biennial should be on the ground, in the people, in the places, in the people.”Sarkis will direct an exhibition of new work on the colonial legacy of the Philippines at the museum during the inaugural event, which will take place on September 27. The exhibition will include works by Filipino artists, including Walter Araujo, Carmen Otero, and Eric Paraiso, as well as works by foreign artists such as Ermanno Ilesanmi and Norberto Miranda.\n\n\nHundreds of workers at the British firm that owns the historic Old Bailey in London are preparing to stage a massive strike until the closure of the venue is secured. According to The Guardian, the workers are demanding that the government guarantee their future employment with the same protections afforded employees at other large commercial galleries.Activists are now urging other galleries to follow the lead of the Old Bailey and take similar action. Workers at private institutions that have leases in the building—which is being renovated by the Christie’s consortium and will re-open in March 2020—are also preparing to stage a walkout if the controversial redesign of the building is not reversed. The workers are demanding that the government guarantee future employment with the same protections afforded employees at other large commercial", "The next Biennial should be held in 2021. Both the Smithsonian and the California Academy of Sciences are considering the date.  The American Alliance of Museums is also working on a statement condemning the exhibition and calling for a new debate about its display and collection. The museum is asking the public to join the other organizations in urging the U.S. government to act to protect the future of the site. \n\n\nThe Gorge Museum in Oregon has received a gift of more than four hundred artworks from the late collector and philanthropist Leo Kilar. Among the works are works by artists such as Pierre-Auguste Renoir, Édouard Vuillard, and Ed Moses, as well as a selection from his personal collection that was donated by Kilar to the institution in 2002 for its collection.The gift includes the works of Klaus von Rath and the Russian artist Ekaterina Voronskaya in the collection of the Kilar Foundation. The gift includes works by the late Russian avant-garde artist K. S. Giri; a selection from the Kilar Foundation, including works by the late Russian avant-garde painter V. G. Konovalovsky and Vladimir Gropodov;", "The next Biennial should be held in 2019, and the first in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston is preparing to welcome visitors back to its campus for a second season. The institution is also planning to add more than 1,000 square feet of exhibition space to its existing space on Massachusetts Avenue in honor of the university’s twenty-fifth anniversary. The extension will allow the museum to be more representative of the city of Boston, which has a projected population of twenty-six million by 2036, and will include more public art installations and will introduce new educational programming.The reopening of the museum will coincide with the city’s centennial celebration of the institution, which is scheduled to take place in March 2022. The upcoming exhibition “Mayor’s Games: Boston 2024,” will showcase works that convey the themes of the city’s fifty-fifth anniversary celebration, \"May the Games be with You,” and will air on April 23 in the city and will also feature new works by artists such as Mark di Suvero, Jann Wenner, and B.J. DeSousa. The centennial will be held on February 22–April 29, 2022", "The next Biennial should be held in 2021, with the exhibition of the artist-built residential complex Etna, the first project of the new institution. The director of the Biennale, Henri de la Roche, said: “We are in the beginning stages of our new project, but we have already seen the extraordinary growth of the biennial and the potential for this to be a stepping stone towards developing the exhibition programme in a way which will allow the artists to ​be part of the future.”\n\n\nThe National Poetry Library in London has welcomed Rebecca Watson to its staff. Watson, a British Bookseller’s assistant, has been promoted to full-time position as the library’s publisher. She will assume her new responsibilities in July.“It’s a great honour and a great privilege to welcome Rebecca to the team at the National Poetry Library,” said Andrew Wiles, director of the National Poetry Library. “Having her as a creator-in-rear for a long-standing colleague is very exciting. She brings a wide-ranging and passionate knowledge of contemporary poetry and publishing to our team, and we look forward to working with her to see how we", "The next Biennial should be held in 2021. The first exhibition, “Between the Sun and the Moon,” will open at the Art Institute of Chicago in June 2020, and “Feminine (Finale),” will open at the Art Institute of Chicago in September 2020. “We are thrilled to collaborate with the Chicago Art Institute to bring you these works,” said René Morales, chair of the board of trustees of the Foundation for Contemporary Art and the University of Chicago. “And we are particularly inspired by how the work of this and other artists has impacted our lives. We must continue to support artists and the cultural sector and encourage a more responsive, responsive, and inclusive economic and political system, especially for the many communities in our city that have been historically overlooked or underrepresented in the national, state, or local level.” The inaugural museum’s inaugural exhibition, “Ursula and Ursula” (1931), was staged by Gerhard Richter at the Art Institute of Chicago in 1933. The show, which was organized by the famous American industrialists, introduced the concept of the “Ursula Group,” the German American architect Ulla", "The next Biennial should take place in the city in 2020. The first edition, which was held at the old Rodina Museum in the city of Port-au-Prince, was canceled due to the coronavirus. The event will instead return to the Miami Beach Art Museum, which it will remain until 2021.This year’s biennial, titled “Beyond Redemption,” will open with an exhibition “Reflections” (2019). The exhibition will feature works by twenty-two artists, including Michael Lissoni, David Winton, Marisa Takala, Lili S. and Chris, and will run through January 8, 2020.Artforum has reached out to the MFA for comment and will update with their comment and any other updates.\n\n\nThe American Civil Liberties Union (ACLU) is suing the Georgia Department of Natural Resources (DNR) in an attempt to stop the sale of a dam that will release some two hundred million gallons of the material that washes into the Black River each year. The Southern Environmental Law Center (SELC) in Atlanta claims that the gusher is one of the largest threats to water quality in the state. It also claims that the sale of the material, which is made", "The next Biennial should be held in late May or early June, with the exhibition expected to run for two months. The first Biennial, which also attracted more than twenty thousand visitors, was held in April 2019. \n\n\nFrench artist, designer, and educator Oïne Zakaria, whose avant-garde translucent polyester clothing was often inspired by industrial and urban environments, has died at age seventy-two. The artist, a cofounder of the collective Faux-Island, which experimented with fabrics including silk and polyester, was best known in the art world as a leader of the London-based nonprofit Art-City, which supported projects such as the London installation the Painted House and launched the collection of American artist and filmmaker John Waters.Born in London in 1939, Zakaria began his art career at the University of Bristol, where he studied with artist-activist Cézanne. He graduated in 1975 from the School of Visual Arts but left school in 1981 after a disagreement with the Venetian Institute, which he claimed pressured him to take up sculpting. In 1989, he moved to Paris, where he continued working with clay, fabric, and polyester. In 1994, he opened his first gallery in the", "The next Biennial should be announced at the end of the year.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has appointed Robert C. Shand, a New York art historian, as its next director. Shand will assume his post in January 2021.“In his new role, Shand will strengthen the city’s relationship with galleries and museums as well as develop new programs to support the cultural economy and enhance access to art and the arts,” DCLA director Robert Doyle said in a statement. Shand will also ensure the department’s collection of cultural heritage assets remains on sound financial footing.The seventy-six-year-old Shand has led the department for more than four decades. During his tenure, he has led the commissioning of more than ten thousand works, oversaw the development of the DCA’s national curatorial training program, launched the DCA’s Museum of Modern Art (MoMA), and established the DCA’s Artist Series in partnership with the Metropolitan Museum of Art.Commenting on his new role, Shand said: “I’m thrilled to be leading the DCA as we establish new leadership for the contemporary art museum world", "The next Biennial should be held in 2021.\n\n\nThe Fire Museum at Ohio State University (OSU) has become a model for museums and academic institutions struggling to address the coronavirus epidemic. Since it began accepting visitors in March, the institution has distributed emergency funding to more than 1,500 individuals; increased the hours of three-day events by 20 percent; and reduced the size of its exhibition galleries by 40 percent.Its new budget-busting class of the university’s fall semester, titled “MIDSEASON,” will open in October. The exhibition will feature work by thirty-three artists and will be organized in a month’s time. The press collection, which consists of up to eighty photographs, will also undergo a major renovation, and the institution will inaugurate its new building, the Fireman’s House on the Ohio River, with a new series of lectures, seminars, and concerts.“With a focus on the local, regional, and national scenes that inform and shape the cultural landscape of Ohio, MIDSEASON’s programming will be centered around a critical period of our history,” said director Matthew O’Donnell. “This is a critical time", "The next Biennial should be held at the Museum of Modern Art, in New York, in 2021.  The forty-five-year-old institution is currently working on a redesign, but the new design is expected to introduce more art-making opportunities for visitors, including galleries and museums whose buildings are currently being renovated.\n\n\nMIDWESTAK, Ukraine—In a first, a group of artists and intellectuals have received a decree from the Ukrainian government in support of the six-month occupation of the rebel-held eastern city of Slovyansk. The decree, which was signed on December 12, establishes a commission to investigate the situation in the city and to deliver a report to the government by the end of March. It also authorizes the construction of an emergency collectivization program to help the city and its surrounding region.The commission will consist of Yarema Lutsenko, a professor of art history at the School of Oriental and African Studies, and Olena Isekova, a curator of art at the Museum of Modern Art in Moscow; historian, scholar, and educator V. A. Rizhyan, a professor of history at the State University of Dnepropetrovsk; and designer I.", "The next Biennial should have a three-day program that combines Portraits and Events, Lectures, and Talks. The 2019 edition, titled Feminine and Biennial, will feature twenty works by thirty-five artists. In addition to the exhibition, the program will include a digital collection of works by twenty-one artists and a book of more than two hundred photographs by twenty-two artists. The 2019 biennial will also feature a virtual reality exhibition, a biennial event, and a biennial exhibition called Embracing Life, which will be held at the museum every other year. The full list of participating artists is as follows:Feminine and Biennial Artists (2019)Adriana BoschiniAlessandro CarducciFabian CirelliDavid CunoJorge CamposPilar CorralesJosé Carlos Díaz Pedro GutiérrezJosé Miguel HernandezJosé Santiago GarcíaRicardo GarciaMaría Teresa GarcíaMaría Teresa FloresMaría HernándezMaría Langan , Enrique PérezMarc GaraÿquezMia María MartinezPilar GonzalezPilar LopezPilar RosalesPilar Ruiz, BrunoRicardo Ru", "The next Biennial should commence in the fall of 2020 and will include an open-air exhibition of works by artists who have not yet been selected for the prize. The exhibition will include work by twenty-seven artists who have a significant contemporary contemporary role in the history of art, including Kader Attia, Mark di Suvero, and Vittorio del Sarto, among others. The biennial will be curated by Michele Cicutto, who has worked as an arts curator and as a curator of contemporary art.Citing the future of art and art history as a major theme, the curator said: “This is a moment of great change, a moment of deep change,” “and it is for these reasons that we were so excited to work with the artists of the forthcoming biennial. They're uniquely talented, and their contributions will only strengthen the legacy of the Global South.”\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has received a gift of one of the last works by Rafael Viñoly, the Cuban American artist who was a founding member of the Cuban American Artists (CAAs) collective, which was founded in the same apartment building in 1984 as the Crystal Bridges Art Museum, in", "The next Biennial should take place in 2020, and the first art-world event should be inaugurated in 2021. With the completion of the next phase of the project, which will involve the construction of a new exhibition space and the renovation of a number of existing venues, the two-year cycle of the exhibition and the biennial will start again at a different location. “We are confident that we can continue to create innovative, high-quality, and open-concept exhibitions at a high level of technical excellence and at the scale of the city,” said Roberta Bahman, director of the National Museum Kuala Lumpur.The Artist-in-Residence Award, for which fifty Malaysians are nominated annually, was selected by a jury comprising Nima Al Saad, director of the National Gallery of Malaysia; Arts Advisor to the Prime Minister, Rawang Al Andow; Sampo Hindustani, head of the Art Gallery of Malaysia; and Linda Tan. The deadline for the prize is February 25. For curators John and Ria Saliani, the award was an opportunity to further their own careers. “It is a wonderful honor to be selected by the awardee as they represent", "The next Biennial should take place in July 2020, and will feature the work of twenty-six artists: Asya Bodansky, Alex Halberstadt, Ana Mendieta, Ingrid Mottram, Hadley Freeman, Anne-Marie Martin, and Berenice Abbott. The inaugural exhibition, “Hiroshima: A Biennale,” will be held at the Museum of Modern Art in New York from January 29 to March 7, 2020.\n\n\nThe University of Pretoria in South Africa (UP) will launch a new scholarship platform, “SouthAfrica’s Embrace,” that aims to foster greater understanding and appreciation of South Africa’s contemporary art. The platform, which will initially be operated by UP South Africa, will host twenty-one artists, including an African American artist, a white South African artist, a black South African filmmaker, and an African American rapper, in a series of exhibitions.“We are extremely excited to be launching ‘SouthAfrica’s Embrace’ with the assistance of UP South Africa,” said Sarah Loyer, director of the Felix Ruhl Institute for Contemporary Art, and the new partner. “The platform is", "The next Biennial should take place in 2021, and the last in 2022. The Museum of Contemporary Art (MoCA) in Las Vegas has also announced its intention to move forward with a major renovation, after the completion of its current exhibition “The Artist’s Body: Modern Art in the Age of AIDS” in December 2018.“We are deeply grateful to the artists and supporters of this show,” said Stephen Hahn, chair of the board of trustees of the Museum of Contemporary Art. “We are particularly pleased that the new and refreshed exhibition will reflect their vision and create a renewed and contemporary vision of modern art history.”The entire staff will be made redundant, but the Museum of Contemporary Art will continue to work with the body to devise new programming for the biennial.\n\n\nWhile the California Department of Cultural Affairs (CalArts) awarded $25 million in grants to arts and cultural organizations in the California Coast Range (CCR) in September, the agency only announced the grants on Wednesday. According to the Los Angeles Times, the grants will help offset the costs of construction of the new Ronald Reagan Washington National Historical Park in Sacramento and include $15 million for media-related construction and $5 million for the", "The next Biennial should be held at the Museum of Modern Art in New York, which is currently closed due to the Covid-19 pandemic. The first exhibition dedicated to the biomedical sciences will open in the spring of 2021. The biennial’s curator, María Berrada, said: “An exciting exhibition focusing on the art of medicine will be presented in the spring of 2020. The project has been in the works since 2014 and has undergone numerous iterations. The design of the exhibition was inspired by the pavilion on the ground floor of the Museum of Modern Art in New York. The pavilion has been the subject of many meticulous studies over the years, and it has been a project of the Museum of Contemporary Art (MoCA) in St. Louis, Mo, since 1998.”The biennial will be curated by David K, a curatorial fellow at the University of California, Berkeley, and art historian and curator, and Jillian Quay, a curator at the Museum of Modern Art, Los Angeles, and a professor at the University of Texas at Austin. They will each illustrate, describe, and perform a different kind of biennial, using the art of medicine as an example.“This exhibition marks a", "The next Biennial should be held at the Museum of Contemporary Art in Berlin or the Kölnischer Kunstverein in November 2019, and the first exhibition should be staged at the New Museum in New York in January 2021. The fate of the exhibition’s submission in 2019 was also uncertain. The museum had said that it would not take part in the controversial exhibition unless it was removed from the grounds. In a letter signed by director Joachim Neugroschel, the Berlin-based Cultural Center for Contemporary Art (Bicam), Art in the City, and the Kölnischer Kunstverein, the artists objected to the exhibition’s inclusion of sculptures made in part by a group of artists chosen by curator Petra Burrows. For its part, the Kölnischer Kunstverein has said that the exhibition was not meant to be political, but was intended to be an extension of its own collection of the artist’s work.“The Art in the City show is an extension of the collection of the Kölnischer Kunstverein. It is therefore a piece of art and we hope that it will be remembered as a part of our history,” said Ber", "The next Biennial should be held at the Museum of Modern Art in Chicago. The shortlisted institution is currently in the process of selecting a theme for the first exhibition of its kind, titled “Sonography: Art in the Age of Mies van der Rohe.” “The exhibition will explore how Sonography—the process of photography, film, and sculpture in an attempt to capture the images of the world in order to create a representation of the world,” William M. Kahn, director of the museum, said in a statement. “As we work toward moving beyond the formal and into the digital, it is with great anticipation that I look forward to presenting the first exhibition of Sonography: Art in the Age of Mies van der Rohe.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a donation of twenty-six works by fifteen artists from the Los Angeles County Museum of Art (LACMA), including Amanda Chiu, Sinthujan Chaudhari, and Eileen Bee, as well as one painting by one of the artists, Mary Ellen Mark. The works will be on display in “Ten Years of Exhibitionism,” which opens on", "The next Biennial should be released soon. “A version of this article was published in French by Arène Haag on October 9, 2017.\n\n\nThe National Council on the Arts (NCA) has removed a painting by American artist Hyacinth Johnson from its exhibition “American Art,” due to its “unhealthy obsession with plastic.” The piece, titled Beauty and Pain, is a 70,000-work collage that incorporates photographs of Johnson and her family and of her own body in her own work. It was chosen by NCA director William Lacy to represent its inaugural exhibition. The move drew criticism from some critics, including Artnet, who accused the NCA of trying to censor Johnson’s work by requiring it to appear in a closed exhibition, before the public had a chance to view it.“The NCA has a long and respected history of supporting the arts and promoting American art,” said NCA director Oliver Rodriguez. “Its exhibitions and publications have long reflected NCA’s philosophy, and its curators have always used their own photographs as the medium of their work, making the collection an important and inspiring canvas for the American artist.”This week", "The next Biennial should be held in 2022.\n\n\n\n\n\n\nThe South Asian American Art Museum Houston (SAAM) has received a gift of fifty works by forty-six artists from the American and Mexican collections. The museum also revealed that it has added thirty-six works by forty-five other artists. The collection includes works by like-minded South Asian artists such as Shahrukh Shah, Mohan Lal, and Akramul Islam.“The work of the museum is of exalted importance in our modern age and should not be underestimated,” said museum director N.Y. Chandrasekhar. “This gift provides an opportunity for artists of every background and experience to share their experience with a new generation of collectors, and we are excited that we are able to receive work from the collection of an institution that has been historically devoted to the art of South Asia.”The forty-six works in the gift are arranged by region, and the museum has released a list of the artists who will receive the works. The works are organized by medium and form, and range from simple abstractions to more elaborate works, with many having multiple narratives. Among the works that have previously been on display are Ramakrishna Sundaram�", "The next Biennial should be held in 2022, and the ten-year anniversary should be marked with a biennial festival. Thoughts?Kirsten Moore, president of the Association of Art Museum Directors, said: “We are all eager to see how the new format will evolve and shape the museum’s exhibition program in a way that will be consistent with the institution’s historic mission. We know that creating an online platform will also allow us to present more exhibitions and more broadly across the museum. We have been working with the team at the museum for over a year to develop an online version of the Biennial that is curated by the curators, whose expertise and vision are complementary to and enhance the work of the curators themselves. We are thrilled that this innovative technology is now ready for the public to experience the work of the artists represented in this exhibition. It is our intention to use this platform to connect with and learn from our audience. We believe this is the most important step in building our online presence for the Biennial.”Translations by ICM into English by the National Galleries of Scotland.\n\n\nThe Contemporary Art Museum Houston (CAMH) has appointed Laura Cioffi as its new executive director", "The next Biennial should be held at the Museum of Modern Art, New York, in 2021.\n\n\nThe Bill and Melinda Gates Foundation announced today that it is extending the life of the foundation’s Spruce Goose statue, which was dedicated in 2001 and honors the late African American explorer Christopher Columbus. Karl R. Allen, the foundation’s president and chief executive, said: “Christopher Columbus is celebrated throughout the world, and our work to honor him continues today. But it is his legacy that defines us, and we want to honor him as much as we can. We are extending his life by nine years. We believe this move will make a tremendous difference in the lives and well-being of countless children and young people who have a direct line to Christopher Columbus. ”The foundation also announced that it is extending the life of its Eleanor Roosevelt statue in New York City—the fourth Roosevelt monument in the city to recently be extended. Its statue, which was dedicated in 2001 and comes with a $30,000 cash donation, was moved from the Chelsea neighborhood to the Roosevelt home in 2007.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has added three new members to its board of trustees:", "The next Biennial should premiere in the fall of 2021, according to a statement from the Biennale de Lyon. “The upcoming edition of the Biennial de Lyon will be the first to take place in the city of Lyon, France.”Since the city of Lyon is located in the center of France, the biennial is also considered as a live event, meaning that it will be hosted in a city where there is a large number of visitors. “The city is looking forward to welcoming you next year with enthusiasm and anticipation,” said Anne-Laure Knebl , president of the Biennale de Lyon. \n\n\nThe Atlanta Museum of Art (TMA) has appointed Courtney Fritz as director. Fritz comes to the institution from the Diller Scofidio + Renfro, New York, where she has served as deputy director since 2015. She succeeds Mary Anne Franks, who was hired as director of the Bicentennial of Women in the Arts at New York’s Metropolitan Museum of Art in late July.“Courtney is a gifted and accomplished curator whose work will enhance the TMA’s programming and create new opportunities for our audience, especially those who are new to the institution", "The next Biennial should be held in 2021–22 and will be hosted by the São Paulo University in Brazil.\n\n\nThe Victorian Museum in London has received a gift of nearly fifty works by artist David Adjay from the artist’s daughter, Anne, who was commissioned to create a new David Adjay retrospective, which will be held at the museum in 2021, from the artist’s granddaughter, Sharon Adjay. The commission was made after the artist’s granddaughter, who lives in New York, asked the museum to create an exhibition of his work, which she believes is almost forgotten.The gift includes works by artists such as São Paulo’s Richard Diebenkorn, Venice’s Sergio Merz, Kent-on-Hudson’s Taylor Amick, and Montreal’s Mehdi Ben-Hur, among others. It also includes a new document by the artist, which will be presented at the museum on July 23. Adjay’s granddaughter said that the work is a “couple of years older than the first David’s, and it has a different structure to it. We are going to blend these two pieces together and make an exhibition of them.”", "The next Biennial should be held in February 2020. \n\n\nThe British Council is launching an ambitious plan to regenerate the National Galleries of Scotland. The plan, which aims to provide an additional $100 billion for arts, design, and heritage over the course of twenty years, aims to start with a two-year plan and will be implemented through various initiatives. Lamart Tandaglia, the architect who designed the museum, said: “The National Galleries of Scotland embodies the spirit of Scotland. It is a living and breathing cultural institution, connected to and responsive to the people of Scotland. The plan aims to start with a two-year plan and will be implemented through various initiatives. Lamart Tandaglia, the architect who designed the museum, Lamart Tandaglia and Smith & Tinker Architects, founded in London in 2001, and the firm of Smith & Tinker Architects are based in New York. The plan is being organised in partnership with the National Gallery Scotland and will be led by Lamart Tandaglia, Smith & Tinker Architects, and the British Council.”The diverse teams will work together to redesign the National Gallery of Art in London and the National Museum of Scotland in Edinburgh", "The next Biennial should be held in 2020.  The pavilion will be designed by Paul Gauguin and will open at the Museum of Modern Art in New York in the fall of 2020. The biennial is currently seeking a director.  The Museum of Modern Art will present a new exhibition, “A New Wave of American Art: The New Art of Salvador Dali,” at the Museum of Modern Art in 2020. The show will highlight the work of twenty-seven artists spanning the years of the artist’s life and will include lectures, performances, and a selection of early works by Dali and other modern masters. \n\n\nUCLA Art Museum, Los Angeles: The museum has received $5.7 million from the UCLA Art Museum Foundation in support of its expansion, from January 2019 to January 2020. The new $6.3 million building was completed in March of that year and opened to the public in June. The Museum’s grant of $4.6 million for “Aristarchical Art: From the C79 to the Ci15” was prized by the $125,000 prize awarded by the Museum’s alumni in", "The next Biennial should be. I do not know. What will be the theme? It may be that we are in a moment of transition, perhaps that we are in a moment of renewal. We must endeavor to think critically and creatively about what it means to be a modern and contemporary woman. ”The biennial—named after a single street in the heart of the city, which was named in honor of the creators of the genre—is currently being curated by the Hong Kong-born, California-based writer, director, and producer, Clara Cahn (born in Virginia in 1976), who previously curated the first Biennial at the Museum of Modern Art in New York, the 2013 edition at the Anais Bakery in Hong Kong, and an exhibition of work by some seventy artists at the Los Angeles County Museum of Art.The inaugural event, “NIRIN,” was held at the famed Chinese Art Museum in Beijing in 2015 and was preceded by the “NIRIN,” in 1976, and the “NIRIN,” in 1978. The twenty-third edition of the event, “NIRIN,” was held at the Museum of Modern Art, New York, the twenty-", "The next Biennial should be announced by the end of the year, and the first exhibition should open in 2021. In order to accommodate the company’s growing demand for a new venue, the board of trustees of the museum has voted to increase the venue’s capacity by an additional thirty thousand square feet. The museum will now be able to host ten thousand visitors per day.“We are delighted that the next Biennial will be able to conduct the special exhibitions and continue to enhance the public experience in the vein of the previous edition, which was held in the former Tangerines and was attended by several thousand people,” said museum director Maria Corinaud. “The exhibition program is of such great importance to the city of Barcelona and the region that we are confident that the new venue will be able to showcase the most amazing works in the coming years.”\n\n\nThe Institute of Contemporary Art (ICA) in Paris announced today that it is planning to open its first new contemporary art museum in the city in twenty years, with a site near the Louvre and the Centre Pompidou, in the city’s 11th arrondissement. The new museum is slated to launch in 2020.\n\n\nThe British", "The next Biennial should be held in 2021.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the donation of works by American artists to the New York Public Library, the Metropolitan Museum of Art, and the Bronx Museum of the Arts.The guidelines, which were issued by the DCLA in an attempt to address a number of issues arising from the coronavirus, also outline the best practices for culture organizations in the city to follow when deciding whether to donate works. The guidelines state that libraries, museums, and other cultural organizations should consult with archivists, librarians, and curators to determine the appropriateness of the donations, and that collections should be reviewed for the collection’s history and provenance.The guidelines also outline the collection and handling of works by artists who have not yet been identified, and of the work and collection management techniques used by cultural organizations. The literature review of works by artists currently in storage is expected to take at least three months. The guidelines are part of a larger cultural preservation plan that aims to protect more than one hundred works by American artists. The plan, dubbed the Next Generation Legacy, was launched in the wake of the 2009 earthquake and tsunami in Japan, and the disaster", "The next Biennial should take place in the United States in 2022.\n\n\nAn artist’s workshop and exhibition space in the city of Haus der Kunst (HND), Germany, which recently celebrated its sixtieth anniversary, has filed a lawsuit against a former director, who ran the space from 2006 to 2008. The Gerdesfabien- Kunstverein (GKW), which was established in the basement of the Burästhalbenhaus in Berlin in 2002, alleges that the former director, an artist named Tobias Moltke, made “unwarranted and abusive” sexual comments toward the artist and had his conduct recorded by the GKW’s director, an unnamed director of a contemporary art space in Hamburg. The suit, filed by the artist and his legal team on August 31, accuses the former director of sexual harassment, with the written permission of the plaintiff, and claims that the harassment began in 2008 and continued thereafter.“The actions of the defendant are a clear attempt to cover his own tracks,” said Gerdesfabien- Kunstverein director Christian Neugroschel in a statement. “The harassment of this woman was serious enough that she reported it to the authorities", "The next Biennial should take place in the autumn of 2021 and has already received funding from the KMH Foundation. The venue will be inaugurated by a public performance and art event, the first of four works by the award-winning artist, which will be completed in the spring of 2022. The first work, a collaboration between the artist and German artist Wolfgang Omel, will be unveiled at the KMH Museum in Berlin on September 19, 2022. The other works that will be on display in the museum are David Rijmen’s Renzo Piano–designed collection of artworks, “Auri Baba” (1934), which is part of the collection of Rainer Schlegel, and Friedrich Nolte’s The Silent Time (1926).Inaugurating the museum will be Louise Bourgeois’s The Elements of a Laundry Bag, 2019, and Sejong Moon’s The Ballad of Young Lee Soon, 2019. The museum is also planning to build a new museum dedicated to the South Korean artist Kim Eun-Sung, a pioneer of the Korean modern art movement, and the museum’s first director,", "The next Biennial should invite twenty artists from twenty-three countries to create a new work. The theme should emphasize the connection between the biennial and the local community. The themes of the biennial—as well as of the forthcoming edition—have been chosen by the board of directors of the Festival of the Arts, which will be held in collaboration with the Museo de Artes del Mundo in Madrid. All ten artists who were shortlisted for the prize are represented here.\n\n\nThe Southwest Asian contemporary art museum Bishkekon in Istanbul has agreed to lease the former United States Post Office building’s building to the London-based nonprofit Artadia, which will use the space in its new exhibition space, Artadia New York, and provide digital and online access to the museum. The organization will set up a database of over one thousand artists and will draw from that for a project called the Museo de Arte Contemporáneo (MAP), which will be hosted at the museum, in partnership with the New York–based nonprofit the NAAC Foundation, in 2020.The space is currently occupied by the museum’s permanent collection, which comprises works from the collection of the rich and famous including Yayoi Kusama", "The next Biennial should take place in October 2021, the same month as the centenary of the outbreak. If all goes according to plan, the exhibition will be held in the city of Stockholm, the home of the largest collection of artworks in the world, alongside the city of the same name in the Netherlands and the city of Potsdamer Straße in Berlin.Just last week, the show was also asked to postpone its 2020 edition, which was originally slated for December. The Swedish National Museum Board approved the postponement by a vote of 58 percent to 45 percent; the local government of the Swedish city of Göteborg also voted to postpone the event.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is again attempting to raise $10 million for the institution as it works to rebuild its archival holdings of the collection of Louis Vuitton, the French luxury conglomerate headquartered in New York. The Art Newspaper reports that the museum’s director, Daniel H. Weiss, met with a group of supporters, known as the Louis Vuitton Triennial Trust, last week to discuss the possibility of reopening again.“Pace is important to the future of the collection,” Weiss said in a", "The next Biennial should be in March 2021. A series of architecturally themed exhibitions, entitled Venice Tintin, in March 2022 and March 2023, respectively, should be announced by the end of the year. A new exhibition format and programming, which will focus on the history of the exhibition and reflect the curator’s own historical and personal aesthetic interests, is scheduled to open in the city in November 2021 and to close in March 2022.The 2018 edition of the Biennial, titled “The Devil and I,” explored the themes of beauty and the human body through a series of paintings by the London-based artist Houshiwe Ndzube, who is known for his sculptural work and for his autobiography, The Devil and I: Tales from a Troublesome Childhood. The exhibition also included works by Chaisson Léger, Marc-Olivier Laszlo, and Jean-Michel Basquiat, among others, and drew some 10,000 visitors.The 2019 edition of the Biennial was “My Body” (2019), an exhibition of works by Dutch-based artist Theo van Hollerene. In an essay published in the May 2019", "The next Biennial should be launched by the end of the year. The inaugural edition of the exhibition (Becky and Walbridge, '10) is now open through October 29. Zoologischer Kunststalt Berlin will present an edition of the exhibition, titled “Erich Fromm: Die Neue Bildung.” The exhibition will continue to be organized as usual at the Kunsthalle Bern in the city of Bern.\n\n\n\n\n\n\n\nA.J. Dziewior, the former director of the Whitney Museum of American Art, has been appointed director of the Tonys in Los Angeles. As the director of the museum, he will oversee the development of a new collection of works by over two hundred artists, including Margaret Mitchell, Henry A.W. Norton, Paul Gauguin, and Pierre-Auguste Renoir. He will also oversee the museum’s annual collection of works by African American artists, and will organize programming that engages with issues of diversity and contemporary art.“The Tonys has been a central project of A.J. Dziewior’s career, as he has led the museum through a transformation in both its architecture and its mission over the", "The next Biennial should begin in 2022, with a design by the architect and the pavilion being conceived as a 'world headquarters for culture in the city of Biennale.”Şahin told the Art Newspaper that the pavilion would center around a collection of paintings from the collection of the late Kader Attia, the director of the Aceh Museum and Science Center in Jakarta.The pavilion would also feature a collection of the works of contemporary Indonesian painters, including Nusratola Nusratuli, Ujanto Nusratuli, and Pilar Corrias. The next iteration of the biennial will take place at Jumangani Gallery, a modernist contemporary art space in Jakarta. The contemporary art center’s current exhibition “The Performing Arts” has been staged at the Aceh Museum since 1999.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has announced that it is preparing to welcome visitors back to the institution this spring, following a temporary closure due to the Covid-19 pandemic. The announcement follows a year of exhibitions and other programming during which MoCA’s staff and visitors were forced to cope with the coronavirus.“We have", "The next Biennial should be held within the next few months. \n\n\nThe Los Angeles County Museum of Art (LACMA) has released the schedule for its twenty-second edition, “REAL ART: LA,” which will take place in the arid foothills of the Sierra Nevada. The event will introduce a new series of lectures on the life and work of artist-in-progress Ichiro Otsuka and will include a retrospective of his work, “Ichiro Otsuka, Life and Art” (2017–18). The event’s inaugural exhibition, “Diana Al-Hadid: Life and Art” (2018), showcased the work of twenty-six artists, including Dave Davies, Jeff Koons, John Birkin, Masamichi Nishimura, Amadou Diallo, and Jonathan González.“We are excited to welcome back the many artists who have participated in the previous editions of the LA Biennial, in 2018 and 2020,” said LAMMA director Christopher LeRoy. “This will be the first LA Biennial in over twenty-five years and will be a great opportunity to see the work of the previous generations of LA art-", "The next Biennial should return to Los Angeles for a third iteration, and should conclude with the upcoming 20th anniversary exhibition of the artist’s work. \n\n\n\n\n\nSonali Gulati, the head of the Bangladesh-born, New York–based nonprofit Darul Uloom Diyaal, was sentenced to two years and three months in prison and fined for fraudulently obtaining international relief funds through a charitable organization she ran, reports the Art Newspaper. Gulati, who was arrested in April 2018 and charged with one count of wire fraud in December 2019, was found guilty of the felony charge last month and was given two years and three months, reports the Art Newspaper.The Bangladeshi American artist was also found guilty of fraudulently obtaining funds through a charity she set up with the intention of using the funds for personal expenses. Gulati was found guilty of the crime after the nonprofit collected donations and spent money on food and other expenses of individuals and families in Bangladesh.The court in Dhaka, which had previously sentenced Gulati to two years in prison and a fine of $10,000, sentenced the other three defendants, Pervaiz Khawas, Raif Badr, and Murtaza Mukherjee, to six months", "The next Biennial should be held in 2022, and the next will be in 2026.The next show should be on the history of modern art. The third show should be on the Global South and its relationship to art and politics. The fourth show should be on the practices of a contemporary generation of South Asian artists. The twentieth show will explore the ways in which the work of American artists influenced and shaped the exhibition.The 2019 event will feature works by Patricia Basu, Nilamas Raiza, Sushma Basu, Jumana Basu, Sukhdev Firangal, Mohammad Ali, Minga Bhabha, Andi Bhabha, Anupam Gupta, Kameer Ahmed, Nisha Pandit, Sonia Babbar, Vinayagiri Patil, Tia Bhabha, Sohrab Akram, Hindi Bhabha, Mathew LaBoeuf, Hao Bhabha, Nirish Chandra, Klaus-Peter Lang, Sylvie Rimmer, Angela Neuchena, Hui Yang, Nima", "The next Biennial should be held in 2021.\n\n\nThe Liverpool Biennial, which was supposed to be a celebration of the city’s arts and culture, has faced backlash over its decision to cancel the event. “The Liverpool Biennial is one of the few major UK arts and culture events which has been cancelled,” reads a statement by the CTCW, a campaign representing the artists who were invited to participate in the event. “This was a difficult decision for the CTCW but a decision made in the interest of the artists and the city of Liverpool.” An attempt to postpone the event was made earlier this month, but the effort was ultimately unsuccessful. The CTCW continued to fight for the event to take place, culminating in a statement released by the CTCW on September 29, which reads: “The Liverpool Biennial is not an option but a necessity.”The CTCW added that the decision was made in the interests of the artists who were invited to participate in the biennial. “Existing partnerships and relationships with the UK arts and cultural sector have been negatively affected and the future of the biennial is now uncertain,” they wrote. “The CTC", "The next Biennial should be held in 2021.\n\n\nTeachers and academics in the US are urging the Trump administration to establish a national research-and-education strategy for American higher education, citing the economic crisis and the precarious workforce as the reasons why more needs to be done to prepare students for postsecondary education.The messages are being sent amid a continuing crisis for higher education institutions. On Monday, the Association of Independent Colleges and Universities (AICU), which represents more than 8,500 higher education institutions in the US, issued a statement expressing concern over the crisis, and announcing that it would suspend its 2021 fall conference, which had been scheduled to take place in Atlanta next week, until April 20.The statement comes amid a nationwide campaign by state and local governments and student organizations to avoid “unpacking” the November 9 election, which saw Donald Trump become the first president in more than two decades to win the White House. Many state and local governments are refusing to make any changes to their election systems, and some are even preparing to implement temporary closures and may even begin implementing income-based repayment plans for certain public programs, such as higher education.“I’m sick and tired of my students being priced out of college by fake crises", "The next Biennial should be held in 2019. In the meantime, the museum will continue to host its annual exhibition of works by artists such as Andy Warhol, Gertrude Stein, and Robert Irwin.\n\n\nThe Art Newspaper is reporting that the Royal Academy of Arts in London will cancel its next edition in April due to the coronavirus. The announcement follows a wave of resignations and resignations from senior staff at the academy following the failure of the coronavirus vaccination campaign, which was launched in the United Kingdom in 2016. The Royal Academy of Arts (RA), which currently has around 5,000 members, announced in May that it would not be taking part in the next edition of the Royal Academy of Arts.Since the coronavirus was first identified in December 2016, the total number of cases has increased to 5,878 and the death toll has risen to 187. Since the coronavirus was first reported to England from the United States in January, the coronavirus outbreak has spread to France, Germany, Russia, Yemen, Singapore, Cambodia, Sri Lanka, and China. British Prime Minister Boris Johnson announced a national lockdown in March and the coronavirus was declared a global public health emergency by the United Nations earlier this month.", "The next Biennial should be held in a museum that is located in a cultural center with a decent amount of restaurants and that has a good reputation, such as the Càmara Museum of Art, the Centro de Artes, the Museo de Arte de Madrid, or the Museo de Los Caballeros, in Santiago, Chile.  The next edition of the exhibition, Art Treasures, will be held at the San Remo Museum in Rome. Over the course of the next two years the exhibition will follow the artists whose works are included in the upcoming edition of the biennial, which will be held in the city of Burgos, Brazil, from March of 2020 to March of 2021. The exhibition will also examine the relationship between art and social issues and will be hosted by a panel of eminent artists, curators, historians, and designers.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Elizabeth Anne Kozloff as its new associate curator of contemporary art, effective immediately, and will launch a royal commission to select her for its newly expanded Metropolitan Museum of Art in Greenwich, Connecticut. She takes the helm from Jen Marlow, who has served as the museum’s associate curator of", "The next Biennial should arrive in 2020, and will be hosted at the Museo de Artesia and will launch with a special exhibition of work by the artist Parál, titled Tortoria, a narrative musing on the process of murder. The event will also welcome the first marine mammals: sea lions, leopard seals, and sea lions, leopard seals, and sea lions, each of whom will receive an award of US$100,000. Museum director Rafael Viñoly-Alvarado said: “We have been working towards creating a Biennial at the Museo de Artesia for a long time, and have had the opportunity to present the work of the artist Parál for the first time in 2020, and to introduce the work of the artist Miles Morales. The new edition, which is a continuation of the past exhibitions, will be about a group of artists who have taken up the art of what we call ‘narrative photography.’”\n\n\nThe Florida Museum of Art (F.M.A.) in Orlando announced today that it settled a lawsuit filed by the estate of Charles Darwin\u0097the twentieth-century American theorist who defined", "The next Biennial should focus on the feminist and social transformations of the last century as well as the current one. It should aim at a synthesis of history, theory, and practice, and should use contemporary and classic perspectives in an effort to develop new and contemporary subjects of art. “The next Biennial is a moment of transformation and a reflection of the present. The project should be an invitation to reexamine, reconsider, and rebalance the future,” said Vikram Sethi, the director of the biennial and a professor of art history at the University of Chicago.  The biennial will also include a new essay series, “Beyond the Present,” and an exhibition featuring a group of artists whose work has been chosen for the biennial’s 100th anniversary edition. The project will be hosted by the Hirshhorn Museum and Sculpture Garden (HMS) in Washington, DC. \n\n\nThe Museum of Fine Arts (MFA) Los Angeles has appointed David Rizk, a former director of the artist’s residency program at the museum, as its next director. Rizk has helmed the Yuz Museum in Manhattan for the past two years, and is currently", "The next Biennial should take place in 2021, and the first show will open in the spring of 2022. The same exhibition will be presented in both Venice and New York, with the addition of the United Kingdom.  \"I am very much looking forward to the Biennials, a total reimagined Venice, where, in addition to the usual theatres and museums, we will also have a great new theater complex, an exhibition hall, a library, a café, a public gallery, a technical institute and a radio station,\" said Pierluigi Battisti, the director of the MAMCOAL observatory.  “This will be a very special, and an unprecedented, Venice, certain to honor the Venice Architecture Biennials, which, beginning in 2022, will be the most beautiful and most important exhibition in the history of the city and of the world.” The architects are proposing a new type of venue, with a long and narrow promenade, situated in a former dairy barn, for the fair. The pavilion will be located in a former textile factory, which was transformed into a cultural hub by the artisans from the nearby town of Reggio Emilia. The project includes a new platform", "The next Biennial should take place in the year 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has announced that it plans to open a new chapter in its nearly seventy-year history with a retrospective of Margaret Atwood’s work The Precariat. Titled The Precariat: Contemporary Art, Gender, and the Body (Ganga Studio, 2019), the show will highlight contemporary artists who are engaging with issues of social justice and their bodies. The museum says that the show will be comprised of more than 300 works, videos, and installations created by twenty-seven artists in the last five years. “In honor of years of work, we are pleased to present The Precariat: Contemporary Art, Gender, and the Body’s final instalment.”The exhibition will feature work by artists such as Zack Faraday, Shih Chien, and Irene Anagnos, as well as work by other notable artists such as Max Beck, Joachim Breime, and Lodovico Cipolotti. The 2020 edition will open on March 13 and run until March 21.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Emily Cropper", "The next Biennial should take place at the Institute of Contemporary Art in Prague in the autumn of 2022, and the seventy-fifth in January of 2021.The new biennial will span approximately twenty-three galleries across the country, where it will include a season of exhibitions, programs, and performances. The biennial will be organized as a network of thirteen interlinked venues, each with a specific theme and a specific audience. The first works created by the new artists are set to open at Porta Nord in Berlin on January 27, 2020 and the Festival of Contemporary Art in Prague in December 2018.The exhibition will also encompass the launch of a new digital platform, the biennial portal, and will include a selection of works from the exhibition. The biennial will feature work by fifty-three artists, whose identities are protected by the artists, from thirty-five countries. The twenty-second edition of the Biennial in Basel will take place in February 2020 and will feature works by twenty-six artists, who have chosen not to participate in the biennial.The biennial will also host a number of exhibitions, including the exhibition “The Body in Art” (2019), “Anathema: The Limits of Art” (2017), and", "The next Biennial should be held in 2021. The exhibition will be curated by Shoukhrat Mitalipov, who has been invited to present the first exhibition of the new program, titled Sleuth. The full list of participating artists is as follows: Alireza AlberdiArt ProjectAnwar AliArash-NabilaArtistic DirectorAnwar AliArtistic DirectorB. K. SrinivasArtistic DirectorG.A.S.R. Artistic DirectorG. H. SahaArtistic DirectorH. S. KambArtistic DirectorH.N. HarshaArtistic DirectorHans de FreitasArtistic Director​ Henna C. GeraMangesh Mural ProjectManu S. KambArtistic DirectorK. D. SenguptaArtistic DirectorM. M. V.S.S. TheatreAndrea Catellani’s Artistic ProgramM.N. Kaleka’s Artistic ProgramM.P. Kamb’s Artistic ProgramM.S. Arora’s Artistic ProgramNabil Nabi’s Artistic ProgramNamito Al-Hashemi’s Artistic", "The next Biennial should begin as soon as possible and would be open to the public from February 5 to March 13. Commenting on the theme, the artist said: “The biennial cannot be a real celebration of art and architecture, but a celebration of humanity. The exhibition should be a way of remembering the art and architecture that has shaped and influenced us all.”\n\n\nThe US Marshals Service (USMS) in New York has released guidelines for the handling of archaeological objects that were seized from a museum in Mississippi last month as part of a broader crackdown on crime in the state following the death of George Floyd, the black man who was killed by a white police officer in the line of duty last April.The guidelines, which address both the storage and transportation of objects, such as objects that were seized during a raid on the Museum of African Art in Atlanta last month and objects that were in the possession of an individual in connection with the death of George Floyd, outline three steps that should be taken in the case of the museum: 1. Provide the victim with all of the following: a) A written statement outlining how the offense was committed, including a description of the crime and how the items were removed; b) A statement", "The next Biennial should take place in 2022. \n\n\nThe museum’s current collection comprises over four hundred works by contemporary artists, including Naguib Mahfoujimi, who raises the question of the role of art in the twenty-first century, and John Edwards, whose work embodies the archetypal African American experience, from whom we derive many of our present-day concerns and anxieties. The Hirshhorn Museum will now be able to boast of two new works by contemporary artists: Antoine-Louis Neuville-Tocqueville and Juliette Aiou-Bakara.“The Hirshhorn Museum is a rich and meaningful historic site,” said Paul M. Altman, president and CEO of the Hirshhorn Museum. “The acquisition of these works represents a meaningful step forward in the museum’s ongoing mission to present a wide array of work by contemporary artists and to present their art in a manner that is accessible to a broad and diverse audience.”Inaugurating the Hirshhorn’s first floor, which opened to the public in 2016, the museum’s contemporary art museum, the Modern Art Museum, will be inaugurated with", "The next Biennial should be held in 2022.\n\n\nThe Los Angeles County Museum of Art (LACMA) is planning to temporarily close its doors to the public in April to increase the likelihood that the institution will reopen in May. While the museum has not yet determined when it will resume operations, the institution said that it expects to be able to temporarily close the museum in order to “restructure its operations in order to maximize the museum’s ability to benefit from the resources of the county, including the city of Los Angeles, for the coming months, and to enable LACMA to reopen.”While the closure will likely disrupt visitors to the museum, which boasts more than 1,500 works, LACMA director and CEO Michael Govan told the Los Angeles Times that the decision to temporarily suspend operations was made in order to “protect the health and well-being of our staff, guests, and visitors.” He added that the decision was made in consultation with the board of trustees, which consists of five elected officials: county supervisor Mark Ridley, councilman Mitch Englander, councilman Jimmy Van Bramer, and county commission president Cheryl Boone.While LACMA is not required to follow the recommendations of the California Environmental Quality", "The next Biennial should be held at the Venetian in March 2020. The venue has yet to announce whether it will repair the damaged ceiling or reopen in phases\u0097the usual architecture of Venice, with the exception of the Guggenheim Museum, has been suspended. \n\n\nThe Hong Kong-based nonprofit Art Basel Hong Kong (ABHK) is suspending all public events and exhibitions in the city as of March 18. According to Artnet, the move follows the announcement that the fair’s autumn edition, “Art Basel Hong Kong 2020” would only be held in Hong Kong from March 18 to March 20. The decision comes amid an ongoing investigation into the hostage crisis at the Hong Kong Convention & Exhibition Centre (HoCEC), which took place on March 20, and was made after the organisers received a total of ten calls from concerned art-world professionals and twenty-one odd guests.“We are deeply concerned by the latest developments,” said John Hsu, CEO of Art Basel Hong Kong. “It is against our values to hold a large-scale exhibition in a location where there is a direct threat to the safety of our galleries, artists, guests, and staff.”", "The next Biennial should be held in 2021, and the second in 2022. The date of the 26th edition—which will feature more than forty artists in various disciplines, including sculpture, installation, performance, and performance-based art—has yet to be decided. Artforum has reached out to the Art Fund for comment.\n\n\nThe Museum of Design (MAD) in New York has appointed Alex Golub as its next board chair. He will succeed Kate Fowle, who was appointed director of the Metropolitan Museum of Art in Manhattan on May 7, and will take up his new post in June.“Alex Golub is a visionary leader whose career has been built on the strength of his commitment to art,” said MAD director Robin Tuck. “His dedicated service to the museum and his demonstrated commitment to the museum’s mission over the past three decades has been instrumental in our transition to a new leadership team and the museum’s transformation into a world-class museum. I’m thrilled to work with him and look forward to his role as chairman.” Golub joined MAD in 2017 as deputy director and curator of contemporary art and architecture. Since 2017, he has worked as a curator at", "The next Biennial should be held in 2020 and will be organized as part of the first edition, which is currently being staged at the Art Institute of Chicago. The event will run from March 22 to March 24, 2021.The first edition was organized as a collaboration between the University of Chicago, the Milwaukee Art Museum, and the Minneapolis Art Museum, and featured roughly 1,400 works from fifty artists. The second edition, which will be staged at the Museo de Cultura Cárdenas in Santa Fe, New Mexico, will be the longest event ever held at the museum. It will be co-led by the Los Angeles–based artist Renata Olmstead, who will curate the inaugural installment and will present the biennial at the institution in 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced that it is partnering with Microsoft to bring to life virtual reality (VR) experiences in the museum’s Imagination Valley, a virtual sculpture garden at the museum’s downtown campus. The garden will be accessible to anyone with an Oculus Rift or HTC Vive headset and will consist of a series of virtual worlds inspired by the Los Angeles skyline.Conceptualized in 2009, the Imagination Valley is", "The next Biennial should take place in the spring of 2021. If the construction of the museum is allowed to proceed as planned, the exhibition “will be at least two years behind schedule.”The building of the museum has been plagued by design concerns for years. In 2017, the museum reached an agreement with the city of Boston to build a new building and was awarded a $5.5 million federal loan for the project. Its current exhibition space, the Prudential Building, opened in 2019. The main building, located at 555 East Boston Street, is slated to be completed by 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed David Sze as its next director. Sze succeeds Richard Armstrong in the position, which was created in May 2019 by the United States Department of Cultural Affairs (DCLA). Armstrong departed in February 2020 to head the Metropolitan Museum of Art in New York, and Sze was named interim director.“David’s leadership and vision for MoCA make him the ideal person to lead the Warner Brothers Museum of Art, as we continue to move forward as a vibrant and protective home for the extraordinary,” said Diane Aron, chair of the D", "The next Biennial should be a critical, if not a transformative, moment for the mission of the Museum. It should also be an occasion for the creation of new work and a reflection on the museum’s role in the greater Australian arts landscape.\n\n\nThe PAMP Foundation, a global network of over one hundred arts organizations, has announced its intent to create a new $10 billion fund dedicated to supporting the immediate and long-term needs of visual and performing arts (Visual Arts, Performing Arts, Theatre, Radio, and Screen) workers in the United States. Established in 2008 by George and Penny Parsons in their Minneapolis home, the $10 billion fund will deliver $500 million per year, beginning in 2020, to support artists and small to mid-size arts organizations. Its initial allocation of $500 million will increase to $1 billion in 2020 and to $1.5 billion in 2021.Parsons and their foundation launched the initiative in order to address the issues that have contributed to the ongoing loss of life in the United States due to the Covid-19 pandemic. They have since expanded the fund to support organizations that face similar challenges and have enlisted investment firms to help raise the funds. Among the organizations that will receive funding from", "The next Biennial should be held in 2020. The next will be in 2022. Simon will also be the artistic director of the London-based nonprofit Art in the City, and will serve as the co-registrar of the biennial for the first time.“I’m delighted that Simon will be joining us in the new role of director,” said Vicky Cheetham, chair of the trustees of the charity. “Simon is an internationally-recognized authority in the field of contemporary art, and has been for fifteen years now. He has been a trusted adviser to Biennial organisers and has helped them to shape their themes, organize their exhibitions, and design their pavilions with the ultimate aim of presenting an exhibition in each of their venues. We are looking forward to working with him to ensure this is the case for the 2020 and 2021 editions of the Biennial.” In addition to his curatorial work, Simon has served as a freelance curator since 1999. His work has been exhibited at the Venice Biennale in 1999; the London Film Festival in 2000; and the Asian Art Biennale in 2013. Commenting on his appointment, Simon said: “I’m honored to", "The next Biennial should be held at the Museum of Contemporary Art, Atlanta (MCA), in 2021 and should be completed by the end of the decade. MCA director Adam D. Weinberg described the academy as a “bridge from the exhibition branch of the museum to the museum’s permanent collection.”Advertisement Continue reading the main story\n\nThe New York–based artist, who made her first public commission in 1989, is suing the Los Angeles County Museum of Art (LACMA), accusing the institution of violating the Digital Millennium Copyright Act by allowing the work to be copied and distributed without her consent. The suit, which was filed on September 6 in federal court in Manhattan, claims that the institution violated the federal law by failing to initiate legal action against the work in order to cover up the infringement and failed to compensate the plaintiff for the twenty-fifth time she was given a commission for the work. The plaintiff will be awarded $15,000.“[The lawsuit] sets a standard for how we will handle copyright infringement cases,” said attorney Michael P. Feinberg. “The court finds that the LACMA museum is negligent in not attempting to stop the infringement and in allowing the infringement to continue.", "The next Biennial should be in 2020. \nA short-lived but highly influential English-speaking revival of the art world known as the Futurama–themed American Contemporary was announced last month. The exhibition, titled “Futurama: The Exhibition from Art’s Future,” curated by Willa Cather, will feature works by fifty-eight artists, including Sergio Cervetto (GQ), Adam Dallin (Project X), Yinka Shonibare (Nara), Tunga (Wang Massai, Tokyo), and Jason Shiga (Kunsthalle Freiheit, Berlin).The exhibition will also feature the works of hundreds of other notable American contemporary artists, including Will Self (Project X), John Jaros (Self Portrait), Rainer Brueggemann (Josie Meehan), and Adam Weinberg (Kunsthalle Freiheit).According to the New York Times, the exhibition will also include work by thirty-six artists who were active in the late ’60s and ’70s, including Bob Dylan (Project X), Bob Dylan (Project X’s Classic), John David Barlow (The Foundations of Modern", "The next Biennial should be held in the spring of 2020. The exhibition will include contemporary art made in collaboration with Brazil, China, and Mexico.\n\n\nThe state-run museum in Beijing that announced on Friday that it is closing its doors to the public due to the coronavirus—while simultaneously increasing the exhibition capacity of its museum by more than twentyfold—is no longer technically closed but has placed a temporary hold on its opening date. The institution will reopen in a few weeks.“The state has decided to convene an international conference in order to protect the health of the public and the health of the staff,” Beijing Gallery Weekend said in a statement. “This decision was made after considering the various considerations, including the health of the staff, exhibition, policy, and financial situation, as well as the outcome of the conference, with the extensive consultations with the public, including the museum’s own staff and guests, and the state’s own experts.”The move comes as China’s government is trying to contain the coronavirus, which is spread mainly from person to person, and as the outbreak continues to spread across the country. On Monday, the People’s Daily, China’s"]