["The next Biennial should be held in 2021 and will be hosted in the museums of the city of Basel and the University of Basel.  The theme for this year’s event will be “Art and the Body” and will be curated by Joachim Wirth, the director of the University of Basel, which has never held a major art biennial. The event, which will run from February 26 to March 14, 2021, will be organized in collaboration with artists, whose work is on display in the exhibition. The Biennial is supported by the Larsen Foundation and the Larsen Foundation for the Future of Art, as well as the Kunsthalle Basel.   The museum will be inaugurated by the Manchester Orchestra and the Manchester Symphony Orchestra, which will play a special concert for the first time ever. The event will be preceded by a solo exhibition of work by the artist Annie Prouvé. The first Biennial event in the city of Manchester was staged in 2013. The museum is also the home of “All Souls” (1937), an exhibition of twenty-three works by Tate Modern artist Paul Cézanne, and “Movement,” a program that celebrates", "The next Biennial should have been a success. Instead, it has experienced a series of unfortunate events: the collapse of the project; the death of the curators and of the show; and the departure of the organizers.”After the departure of the show’s organizers, the new director of the Biennale, Hendrik de Kooning, wrote on Facebook that the event will not return to the exhibition space it had set up in the former building of the museums Hamburg and Krefeld until at least the end of January. The new theme of the biennial is “Abandon hope, abandon all hope,” and the exhibition is currently on view in the newly renovated Museums Bremen and Krefeld.\n\n\nSigned, August 3rd, 2021: The Art Newspaper, London: The first issue of the Art Newspaper, published by Artnet, is now available on the Internet. The publication is organized by Riggs & Wirth; the magazine is published by the Roche Group; and the artists are Vivian Croft, Kevin Howarth, and Julie Kremer. The first issue will include a survey of the artists’ work, and will be followed by an exhibition of", "The next Biennial should help take the spotlight off the exhibition and onto the work itself, and should also provide a platform for artists to connect with the public. It should become a platform for experimentation and creativity.Iccelotti said: “All these years the Biennial has been about gathering artists together in a space that is both intimate and expansive. It has always been about the artist, about their work, about their lives. I am really looking forward to the next incarnation, which will be more accessible and accessible for everyone.” \n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has released a new guide to the 50th anniversary of the Women’s March, which took place in January in an attempt to pressure President Donald Trump to cut off funding to anti-abortion organizations.The exhibition, “Back to the Future: Art, Feminism, and the 1960s,” which will open at the museum on March 22, features new works by seventy-nine artists, including Iris Monsivais, Frank Gehry, Jean-Michel Basquiat, and Kerstin Brätsch, as well as a selection from the Women’s March’s inaugural list curated by artist-", "The next Biennial should be held in 2020. The next edition will take place in Hamburg in December 2020, and in the summer of 2021 in the city of Almaty, Kazakhstan. The 2022 event will be staged in the United Arab Emirates. The 2022 edition will also feature a new artistic commission from Germany.\n\n\nThe Museum of Modern Art (MoMA) in New York, which recently laid off nearly two hundred employees in an effort to reduce costs, is preparing to engage in a massive restructuring that will involve the elimination of over one hundred positions across its various departments. The announcement, made on December 16, follows a series of layoffs, furloughs, and revamps that have reduced the museum’s ranks by more than thirty percent over the course of a year.“Once we identify the optimal levels of collaboration, collaboration, and collaboration, we will work towards building the right combination of environments for our museum and our staff to support our mission of celebrating the contemporary world,” museum director Andrew Ramsey said in a statement. “Our next steps are to ensure that the influence of our art on the lives and work of our visitors is enhanced, and to address the impact of our exhibitions and programs on our staff.”The restructuring", "The next Biennial should take place in the city in 2020, quickly followed by the opening of the first exhibition dedicated to the work of a female artist in Glasgow in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in New York announced today the opening of the Museum of Yuz Museum in Prague. The project, commissioned by MoCA and the Pudó Museum of Art in Prague, will present the first direct exhibition of work by the French artist Monnaie de la Boétie, whose body of work examines the relationship between beauty and authority.“Monnaie de la Boétie is at the forefront of a new kind of sculpture, one that actively resists the beauty-versus-beauty dichotomy and questions the aesthetic in everything from the physical world to the spiritual world,” said Museum director Miles Rapoport. “Drawing from her own aesthetic practices and examining the relationship between beauty and ritual, she creates works that transcend both form and content, exploring the role of photography in both the physical and the spiritual worlds. The first show will showcase the work of her new exhibition ‘Post-Culture’ at the MoCA in January 2022. The second will open at", "The next Biennial should be held at the Metropolitan Museum of Art in New York on September 5, 2020, and will be cohosted by the Tate, the New Museum, and the Hudson Valley Museum of Art.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Helen James as its next executive director. James comes to the institution from the University of Massachusetts, Amherst, where she currently serves as curatorial director. During her tenure at the school, James has organized over seventy exhibitions and has helped the museum raise more than $8 million for the school.“Our board of trustees are thrilled to welcome Helen to the MFA,” said board president Mary Ceruti. “Her leadership, expertise, and commitment to bringing the museum and community together will be instrumental in ensuring the museum’s continued success.”During her tenure at the school, James has organized exhibitions such as “Collected Histories: How the Museum of the American American Jewish in the 1980s and 1990s Transformed an Art Museum” (2019) and “Sensations: Contemporary Art and the Body” (2017–18), and has written for the school and for the New York Times Magazine.Commenting", "The next Biennial should take place in 2020 and will focus on the history and evolution of art in the historical city of Bienniti in the city of Rome. The inaugural edition, '15, was held in April and attracted nearly 1,500 visitors. \n\n\nArt historian and curator, educator, and theorist João Moutinho has been named the next leader of the Brazilian Museum of Modern Art (BMA) in São Paulo. Moutinho, who served as director of the Portuguese branch before it was acquired by the BMA in 1991, will assume the helm in June.“I’ve had the privilege to work with João Moutinho for many years, since he was the director of the Portuguese Branch of the museum,” said Diego de Oliveira, president of the Museu de Arte de São Paulo (MAM) and vice president of the state of Rio Grande do Sul. “His exceptional skill set combined with his passion for art makes him the ideal candidate to lead the BMA.” Moutinho, who has taught at São Paulo State University, studied at the São Paulo School of Art, the Instituto de Arte Contemporânea", "The next Biennial should be held in 2020, Toda added, and “I’m hopeful that we will be able to present the most ambitious exhibition as soon as possible.”\n\n\nThe New York architectural firm Gensler has won the 2018 Art Newspaper Award, which honors artists whose work represents and advances the best of contemporary design. The jury comprised of David Breslin, artistic director of the Museum of Modern Art; Richard Diebenkorn, president of the firm; Samuel Gentry, the cofounder of Dystopian Collective; and architect Peter Zumthor awarded the $50,000 honor to the firm, which was founded in New York in 1980 and based in the Hudson Valley. The jury also gave the firm a lifetime achievement award.“We are ecstatic to be nominated for this award by our fellow jurists, and to have the opportunity to present the full collection for the first time in the new Museum of Modern Art,” said Gensler president Daniel Grazer. “The exhibition will include work by a new generation of architects, including Ramy Chaudhuri, Shih Chien, Hsu Chien, and Asher Vai, and will be held at the new Museum", "The next Biennial should take place at the Museo de Artes, in Madrid, on March 27–March 30, 2020. The 2020 event will feature artists from the Biennials “Alberto Barbera, Claudia Cabret, José Luis Anan, Gina Millar, Víctor Cárdova, Andrea Pena, Antonin Csikas, Ricardo Paz, Luca Ribas, Susana Pilar, Yasmina Sani, Riccardo V. Caccia, Luda Carriço, Erik Verlaine, Juan Delio, Cristóbal V. Cervantes, Lydia Hernand, Jodi Throckmorton, and Kiyomasa Haneda.”The theme of the 2020 edition of the Biennials is “Time as Sanctuary.” The event will also feature a retrospective of another work by the twenty-seven winners of the inaugural award: Sara J. Allen, Christopher Lee, Jorge Luis Borges, Hilary Mantel, Nara", "The next Biennial should take place in Helsinki in 2021. The 2018 version, which was staged in Helsinki, was marred by delays and criticisms over its accessibility and political leanings. A 2012 edition, titled Art and Bicycling, was also canceled, but was rescheduled for 2022. Artists are demanding that the upcoming edition be moved to a different city and a city manager is refusing to budge on moving the event to a different location.“We are asking them to consider the fact that this is a regional event, and that it is not a priority for the national level, and that the best way to support local artists is to have the institution hosted locally,” Leila Alsofy, the chair of the trustees of the Helsinki Biennial, told the Art Newspaper. “The Biennale of Helsinki is already a fully-functioning, self-sustaining entity; it has no need for any external support. We will continue to work with our partners and partners’ teams to develop innovative ways for the Biennale to support art and culture in Helsinki.” The Finnish Art Museum and the Art Museum of Finland, both located in the capital city of Helsinki, announced that", "The next Biennial should be held sometime in 2021, and will be commissioned by the city of Amsterdam. The exhibition will feature sixty works by fifty-five artists from twenty-five countries.The biennial’s organizers said that the exhibition will include work by artists from eighteen countries and will push exhibition boundaries. The exhibition will be themed “Dutch provocations” and will be hosted at the Aarhus Art Museum and the University of Aarhus. The biennial will also be hosted at the city’s Kiel Art Museum and at the city’s København Museum.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to shutter its popular monthly film series Criticʙs Circle in 2020, as part of a multiyear $350 million renovation and expansion project.“The Museum of Contemporary Art has been celebrating the twenty-fifth National Film and Television Awards (NFTA) with new and exciting programming since our inaugural season in January of 2018,” said Director and CEO Jonathan Ford. “This year’s show brought new stories of the year before, but also a celebration of the half-century of American cinematic history.", "The next Biennial should commence in 2021, and the final in 2022. The event will be hosted by the Museum of Contemporary Art (MoCA), Atlanta, as part of the city’s push to re-create a new long-term platform for cultural revitalization in the city that is both sustainable and curated by contemporary artists.The museum will host over two hundred exhibitions, including fifty-six exhibitions organized by artists, curators, and other specialists; twenty-five online programming discussions; a new site-specific exhibition series curated by the curator Kristen Y. Lee; and a series of cultural performances, performances, and other events.The program’s inaugural edition, following the city’s revitalization plans, was slated to run from October 16 to October 19, and was supposed to be inaugurated by the exhibition “City of Atlanta: A Retrospective” (2018), which was to commemorate the city’s reopening with a new public art installation by the Atlanta-based artist L.A. James-Towns. Organizers decided to cancel the show due to the coronavirus outbreak, and instead to focus on creating a platform to present the various work programs and exhibitions that the city hopes", "The next Biennial should be in 2019. The next Literature Festival in 2020. The next Arts Festival in 2021. The next Biennial Essay in 2022. The next Arts Festival Lecture in 2022. The next Arts Festival Lecture Collection in 2022. The next Art Show in 2022. The next Art Show Lecture Collection in 2022.The next Art Show Lecture Collection in 2022. The next Art Show Lecture Collection in 2022.The next Art Show Lecture Collection in 2022.The next Art Show Lecture Collection in 2022.The next Art Show Lecture Collection in 2022. The next Art Show Lecture Collection in 2022. The next Art Show Lecture Collection in 2022. The next Art Show Lecture Collection in 2022. The next Art Show Lecture Collection in 2022. The next Art Show Lecture Collection in 2022. The next Art Show Lecture Collection in 2022. The next Art Show Lecture Collection in 2022. The next Art Show Lecture Collection in 2022. The next Art Show Lecture Collection in 2022. The next Art Show Lecture Collection in 2022. The next Art Show Lecture Collection in 2022.The next Art Show Lecture Collection in", "The next Biennial should be held in 2020. The group will then be able to nominate a winner for the 2019 award. The works will be presented by the artists in conference rooms at the Museum of Modern Art in New York in the autumn of 2020. The next exhibition will be held at the Guggenheim Galleries in the spring of 2021.Mackenzie-Jordan Gallery will mount its next exhibition “The Frame of Reference” at the Mackenzie-Jordan Gallery, in New York, next month. The show will showcase work by twenty-five artists, including Emmett Kelly (The Frame of Reference), Martin Heide (The Frame of Reference), Edward Kienholz (The Frame of Reference), and James Kotojima (The Frame of Reference).“The Frame of Reference” is the third and final project of the Mackenzie-Jordan Gallery, which explores the relationship between the frame and the movements of Mach, a fictional myth of the Japanese artist Tsubasa Yamamoto. “We are extremely pleased with this partnership,” said Mackenzie-Jordan Gallery director Elizabeth Mackenzie. “This partnership also illustrates Mackenzie-Jordan’s dedication to supporting artists of all kinds through this challenging and", "The next Biennial should commence in the autumn of 2021 and will focus on Indigenous art from South America. The theme will be “Traditions and Politics of Health in the Third World.” Commenting on the upcoming exhibition, Lesley-Anne Allen, Director of the Biennial, said: “We are thrilled to welcome the new and diverse communities of South America to the Biennial and to continue to shape our exhibitions and programs in collaboration with them.” The full list of participating galleries is as follows:Art Museum Berlin (Germany)Art Museum Stuttgart (Germany)Art of the American West (USA)Art of the Pacific (USA)Art of the Americas (UAE)Art of the World (USA)Art of West Africa (USA)Art Of Morocco (USA)Hamilton Art Gallery (USA)Holleichternach (Germany)Hermann Kremer Gallery (Germany)Hollis’s African Art Gallery (USA)Hermann Klein Gallery (Germany)Hoffmann-Rohm Gallery (Germany)Hossevo Gallery (Germany)Inter-American Foundation (USA)Inter-American Foundation Bains (USA)Intercultural Foundation (Canada)Jack Eller Gallery", "The next Biennial should be held at an appropriate location in the city, at an appropriate date, and on an appropriate occasion, which will continue to be guided by the Art of Life, and will be guided by the Biennial Board.”The museum also revealed a slew of changes that will accompany the relaunch. For the first time, it will now be led by a single curator, and the new title of Art of Life will be unveiled in conjunction with the opening of “Biennale of New York.” It will also become a “Museum of Contemporary Art,” and the first museum in the city will be a “Museum of Arts and Design.” Inaugurating the museum will be a new performance and installation series, a new exhibition, and the launch of a new digital platform, making the museum more accessible to the public.The opening of the exhibition will coincide with a month of “Global New York: A Visual History.” The program will feature new works, including work by artists such as Mark di Suvero, Matthew Glass, Filippa Green, and Andrew Kreps, as well as works from the past and present.Commenting on the program, Christopher Werth", "The next Biennial should be held at the Museum of Contemporary Art in New York, in 2021. • The museum will continue to pay artists through the end of the year, but the annual stipend has been slashed by $1,500 for the 2020 year. Museum head Matthew Gardiner said: “Our artists are vital to the life and well-being of our city and state. When we can help them make a difference for our communities, it is an affront to our civic responsibility that we do not. . . . My colleagues and I are deeply concerned about the future of our artists and their work. When the funding of the biennial expires, we will be forced to make difficult decisions about whether we should continue to support them through the end of the year.”\n\n\nThe Seattle Asian Art Museum (SAAM) has appointed Molly Weiss as its next executive director. Weiss joins the institution from the Museum of Contemporary Art in New York, where she serves as director of the Asian Art Museum and is currently the founding director of the Asian Art Museum and Pacific Film Archive (SAAMPFA). She succeeds Sherry Olney, who has served as interim director of the Asian Art Museum since October 2017, and will take up", "The next Biennial should be held at the same location as the museum’s current exhibitions, in October 2021, with the same schedule as the current exhibition. The date of the 2022 festival will be announced in the coming weeks.\n\n\nThe Swiss director-general, Carlos Duarte, has released a statement regarding the coronavirus outbreak in Switzerland: “The new City of Basel would like to announce that it has been fully cooperative with the authorities in Basel. In addition, it has been able to confirm that all exhibitors will be able to take part in this year’s event, which will take place at the Venetian and the Bernini in September.”Duarte went on to say that, after the coronavirus outbreak was contained in June, there were no new cases reported in Switzerland during the first half of the year. He also said that it took him only a few days to determine that the coronavirus outbreak in China was connected to the coronavirus in China. “I have concluded that the connection between the two is very strong,” Duarte said. “I have therefore concluded that the outbreak in China is not connected to the outbreak in Switzerland, and", "The next Biennial should be held in 2021 and will continue to be held in New York City.  Both the museum and its board of directors have been working on the idea of a biennial for some time. They first outlined an agenda for the 2020 event in a letter published on January 13, 2018, and then announced that it was launching a crowdfunding campaign for the biennial. “This year’s event will be a special occasion,” said Board Chair Francis Kreutzfeld. “It will mark the centenary of the opening of the New York–New Jersey Transit (NJ Transit) Railroad, and will draw on the nationally significant collection of the biennial and the work of the New York Museum of Art, along with the work of the state’s leading artists and scholars.”\n\n\nThe Great American Birding Triennial (GHBBT) in New York has announced that it will no longer take place next year, in lieu of a new event that would have been held in March. Instead, it will hold its eighth edition at the Museum of Modern Art (MoMA), in January 2021. As part of its commitment to “creative destruction” as a means of addressing climate change, the", "The next Biennial should be held in 2019.\n\n\nThe Metropolitan Museum of Art in New York has received a major gift from a group of investors led by billionaire collector and philanthropist Haim and Annette Kahn. According to the New York Times, the collectors acquired the works by accident. The Kahn-Menendez family, who runs a company called the Private Collection Company, purchased the works by the artist-run nonprofit in 2009 from a dealer in the Bronx named Roy Scheid. The gift, made in a deal that took place in a distribution center operated by the family, brought the works to New York and the Kahn-Menendez family.The couple named Louis Kahn, the CEO of their company, as the largest beneficiary of the sale. The fund also owns about forty paintings by the American artist John Gay, a Picasso collector of the same name who arrived in New York in 1961 and became a close friend of the couple. The Kahn-Menendez–Kahn collection is valued at more than $70 million, making Gay the largest individual beneficiary of the sale. The works are currently on display in an exhibition organized by the artists at the Met.“This is a remarkable and unusual gift from the Menendez-Kahn family, who", "The next Biennial should be held in the city in 2021 to be followed by a subsequent exhibition in 2022. “The Biennial is a living organism that undergoes continuous renewal and transformation,” Monadnock said in a statement. “I’m very excited about working with our talented and dedicated staff, the museum’s international team, and artists and am proud to be a part of the Philadelphia arts community.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has added four new acquisitions to its portfolio this year. After acquiring twenty-one works by twenty-three artists and collectives from the seventeenth through nineteenth centuries, the institution now has sixty-six works by these artists. The additions include Anna Atkins, Julian Ben Kingsley, Monir Shah, Henning Richter, and Willem de Kooning, who will soon be included in a major exhibition that will open at the Museum of Contemporary Art in London next month.“The museum has always pursued a network of artists to provide an alternative to the singular museum model,” said Laura Perkins, the director and chief curator of MoCA. “The acquisition of these works by these collections is an exciting step in that", "The next Biennial should be held in 2022. The museum currently has a permanent collection of approximately one hundred works by forty artists, including Alberto Barbera, Bertrand Bish, Antonio Miro, Jean-Luc Godard, Lucio Fontana, and Teddi Fernandez, as well as a selection of works on paper, including Marcel Proust, Jean-Luc Daniel, and Edvard Munch, and a collection of more than one thousand sculptures and paintings.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than three thousand photographs by the late American photographer David H. Koch, who passed away on January 13 at the age of seventy-eight. The gift includes nearly eight hundred photographs dating from the 1970s to the 1980s, and is the largest donation of his works to the museum.Koch and Marilyn Norcutt, the founder of the environmental activist group 350.org, made the announcement on Wednesday, March 9. Koch donated the works to LACMA in memory of his late friend and colleague, and in recognition of his extensive and influential photographic career. Norcutt was inspired to make the donation after seeing an online auction for one of Koch’s photographs, which", "The next Biennial should be released sometime in the second half of the year, and will host a number of special exhibitions, including the collection of Naguib Sawant, the first woman to win the Nobel Peace Prize; a presentation of works by the international artists Leah Davis and Thomas Dallmann; and the exhibition of new works by artists such as Daniel Bauhaus, Osman Khan, and Jean-Luc Moulène.The biennial will also present new works by artists such as Jean-Michel Blanchot, Jean-Luc Moulène, and Minjung Park; a cataloguing of the career of the French colonialist architect and collector Maurice Barré, who was a major collector of German and Austrian art; and a special exhibition of objects from the late Russian and Soviet artist and designer V. A. Gusev. The third Biennial of the Russian artist V. A. Gusev will also open in September.\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles announced today that it has received a gift of twenty-six works by artist Dennis Hopper from the artist’s wife, actress Linda Barlow. The works were donated by her parents, a former Los Angeles City Council", "The next Biennial should take place in the United States in 2021. \n\n\nThe Royal Society of Edinburgh (RSEE) has appointed Javier Bisogno as its next director and chief curator. Bisogno comes to the institution from the British institute of Contemporary Art (ABAC), which he has helmed since 2015. He succeeds Catherine Frazier, who retired in March 2019 after twenty-six years at the helm of the museum. Bisogno succeeds Sascha de Alsek, who is retiring after eighteen years of the helm of the institution.“Javier Bisogno’s appointment makes RSEE more promising, more focused on the future, and more aligned with the international scene,” said Markus Rijs, chair of the board of trustees. “Together, we have benefitted from a long-term approach that has seen us grow to become one of the leading contemporary art institutions in the world. We are all thrilled to welcome his expertise, expertise, and enthusiasm and look forward to working with him to achieve great things for our audience and the good of the institution.”Bisogno will assume his responsibilities at", "The next Biennial should be on September 21, 2018. The organizers have already received two applications for the 2019 event. The 2019 edition will take place in the city of Milan and will be curated by Sabine Sieben, director of the New York–based nonprofit Historical Voices. The event will also feature two additional projects by local artists.The 2019 edition of Biennial will be organized as a series of performances and will include more than fifty works from the artist-run space, Performa, and from other prominent artists. The exhibition was scheduled to run from March 12 to March 14, 2019. However, due to the coronavirus outbreak, the event was canceled. The 2019 edition will include works by artists such as Abraham Aliyu (Niger), Allen Bennett (Indonesia/France), Amara Elkar (UAE), Alexandra Ford (New South Wales), Devika Ghose (Nepal), Amina Hanif (India), Amir Jumah (New York), Gokhan Jumah (Papua New Guinea), Adeline Kaminer (New York), and Gina Kennedy (New York). The 2019 edition of", "The next Biennial should be dedicated to a significant and timely work of art that has been exhibited or recently exhibited in the Biennial, with a view to the future of art in the exhibition. The age-old question of the identity of a work is imagined to be explored in the present.The new exhibition, “Between the World and Me,” will be curated by director Jannis Kounellis and will be inaugurated by a rendering of the work, Øystein Rostenavs, with the artist and architect Brigid Lehmann, at the gallery’s New York location in the fall of 2018. The artwork, which was created in 1984 by Rostenavs and Lehmann, is one of the earliest works to be exhibited in a permanent collection exhibition at the Art Institute of Chicago. It is also one of the few surviving works by the late American architect Albert Kahn, whose architecture and design projects were influenced by an interest in art, design, and art.The contemporary art historian John Kahn, who directed the museum from 2003 to 2013, said: “We have been fortunate to be able to create an exhibition program that reflects the breadth and depth of the galleries’ collection. The new multi-", "The next Biennial should be a celebration of all that is turbulent, excited, and varied in the human experience. The museum is committed to cultivating a more trans-disciplinary, interdisciplinary, intersectional, and mutually supportive biennial, one that recognizes that all living beings are valuable, worthy, and important. The time is ripe to infuse life and history into the museum and to build upon the transformative impact of the exhibition ‘My Body, My Rules.”The selection of the exhibition will conclude the decade-long exhibition “My Body, My Rules,” which was founded in 2008 at the Public Memory, the Museum of Modern Art, and the Museum of Modern Art to commemorate the hundredth anniversary of the birth of American art. The exhibition, which features work by sixty-five artists, including Louise Bourgeois, A.J. DeSousa, Cécile Brouwers, and Robert Irwin, was curated by Mark Engster.\n\n\nThe heirs of Robert Moses, the eccentric former New York City mayor who championed a wildly expensive plan to remake the nation’s largest public art museum in order to generate $300 million in revenue for the city, have announced that they’re splitting their inheritance $50", "The next Biennial should be held in 2021, the museum’s current theme of “When Life Was Simple,” and will incorporate work from the collections of the following: Alfred Stieglitz, Edward W. Herman, Frank Gehry, Hans Hofmann, Zoran Jovanović, Yoshitomo Nara, and more. The fifth edition of the biennial will be held at the Museum of Modern Art (MoMA) in New York in 2021.The seventy-third edition will be staged in the Japanese city of Kobe in 2021, and the seventy-fourth will be staged in the Prudential Tower in the harbor of New York in 2021.\n\n\nThe museum’s permanent collection of Edward Hopper’s works, which includes more than two hundred paintings, drawings, sculptures, and prints, is now on display in its entirety for the first time in more than a decade at the Metropolitan Museum of Art in New York. The exhibition, “The Met,” began by exploring the conceptual history behind Hopper’s most famous works, which are collectively known as the 'Planks,” a series of panels on paper that depict abstract", "The next Biennial should be held at the Paris Opera House in November 2021. The TBA year will continue to be used to highlight the work of emerging and established artists, and will include a new period of open-call programming, a number of new exhibitions, and new programs. Starting in 2022, the Biennial will be hosted by the Museo de Arte Contemporáneo de Madrid, and will be hosted on a trial basis in collaboration with the University of Valencia. The museum will also be able to present a new exhibition at a later date. The museum’s current project in planning for the twenty-fifth edition of the Art and Design Biennial, which will be held at the Museo de Arte Contemporáneo in Madrid next September, is available on its website. The museum also revealed that it is working with an international team of architects to create a new approach to the construction of its buildings and on the design of the new campus, which will be located in the capital city’s Casa do Povo. The project will be pursued in collaboration with the RIAC Museo de Arte Contemporáneo, the Instituto de Arte Contemporá", "The next Biennial should be held at the Museo de Arte Contemporáneo, Madrid, in December 2020. The next edition, “Grimm: From Myth to Reality,” will be held in March 2021.\n\n\nThe Montull Museum of Art in New Orleans has appointed Jennie C. Morgan as its new executive director. Morgan has helmed the museum since January 2019 and will assume her responsibilities in January 2021.“Jennie is a gifted leader who has built the Montull Museum of Art into one of the country’s most dynamic cultural institutions,” said director and CEO Darlene Woods. “Her tenacity and vision have made her a champion of culture and the arts and she is dedicated to furthering the museum’s mission to serve the public.”Morgan succeeds Lorraine O. Scott, who has helmed the museum since March 2019, and will assume her new responsibilities in January 2021. The board of trustees “elected unanimously to support the new leadership’s appointment,” said board chair Michael Walton. “We are thrilled that Jennie has stepped forward to serve as the museum’s interim director and to continue to grow the", "The next Biennial should be held in 2021.\n\n\nThe California Children’s Museum in Oakland, California, has appointed Patricia C. Marroquin as associate curator of contemporary art. She has been a curator at the institution for more than twenty years and most recently served as director of public engagement. Marroquin will begin her new position this fall.“We thank Patricia for her leadership on behalf of the museum, and look forward to her innovative and compelling curatorial work,” said museum director Michael Rubens.In addition to curating the museum’s various contemporary art projects, Marroquin is currently the head of the museum’s Open Architecture program. The program will present the first of two exhibitions dedicated to urbanism, inspired by the urban landscape and urban planning, at the museum next year. The first will feature suggestions by the curator of contemporary art, Wolfgang Pfeifer, and the architect, Isamu Noguchi. The second will be curated by Michael Kravitz, whose studio is currently under construction in the museum’s former location on the ground floor of the old RCA.Commenting on her new role, Marroquin said: “The museum is embarking on a new chapter", "The next Biennial should be held in 2020. “There was a period of some eleven years when the Biennial was a very large undertaking and when I was able to actively participate,” Paul told the New York Times in 2016. “It is a nice thing to be able to do,” he said. The show will be expanded to a museum exhibition in 2022.The museum will also be remodeled and renovated, and the building, known as the Biennial of Visual Arts, will undergo a facelift. The project is part of a global conversion plan to improve the public’s perception of the Arts and Culture District. According to the New York Times, the $400 million project—which will consist of two phases, through 2021 and 2022—will include the construction of a new museum and the renovation of the existing museum. The museum will also host a variety of events and concerts.The Biennial of Visual Arts is also collaborating with the City of New York to implement new environmental education and outreach initiatives. The city will organize a series of workshops and include them in its new summer series, the Arts & Culture Kids' Zone, which will run from May to November. The first workshop will focus on how the arts can make", "The next Biennial should be held in 2022. Its next edition will be held at the old National Museum in Paris.\n\n\nThe five-building, two-and-a-half-thousand-year-old Roman City of Pompeii, Italy, has received a major restoration, complete with a massive new fountain and underground gardens, that will bring 5,000 artefacts from the destroyed town and surrounding area in the historic city of Pompeii.The works, which were commissioned by the late architect Ligia Romani, are currently on display in the exhibition “Pompeii: Five Dimensions” at the annual Tourismmuseum, Naples, and will be on show in the museum’s exhibition “Pompeii: Five Dimensions II” in 2022.The works were commissioned by the late Italian architect Ligia Romani, who was known as Ligia Filippi, and were created in the late first century BC. Romani’s husband, the renowned Italian architect Dr Giuseppe Filippi, where also an architect. His daughter, Lizzie, organized the auction in honor of her father and the late Italian architect Gianluigi Nuzzi.Together with her husband, L", "The next Biennial should take place in 2020, when the ground-breaking exhibition will be held at the Far East Biennial in Chengdu, China. The exhibition is titled “The Incubator,” and will be hosted at the Kunsthalle Basel in Switzerland.\n\n\nThe Seattle Asian Art Museum (SAAM) has appointed Nina Gatenby as its next director. Gatenby will be responsible for overseeing the museum’s collection of twentieth-century Chinese art, and previously served at the Museum of Fine Arts (MFA) St. Louis. She succeeds David Cameron, who left the helm of the institution in March 2019, and will take up her new post on July 1.“Nina has been instrumental in developing and establishing SAAM as an internationally significant cultural institution,” Cameron said in a statement. “Her strong leadership style, as well as her deep knowledge of and commitment to the museum’s collection, made her an ideal leader to guide the future direction of the institution.”Commenting on her new role, Gatenby said: “I’m thrilled to become the new director of SAAM. I’m committed to making the museum a triumph of contemporary", "The next Biennial should be held in 2021, during the thirty-fourth edition of the Paris Biennial. \n\n\nThe American painter Josette A.Pugh (1904–1986) has been selected to represent the United States at the fifty-eighth Venice Biennale. She will be presented with an award that will enable the artist to return the favor to the City of New York.“Pugh was a critical and influential artist who remains at the center of the contemporary landscape art canon,” said Mark Lehner, director of the Smithsonian American Art Museum. “Her painting and sculpture combine a subtle, almost sacramental, spiritual life that emerges from and changes the physical environment. She is a master at encoding or hiding the symbolic in dramatic, symbolic landscapes. Her interdisciplinary approach to landscape art and her sometimes dogmatic aesthetic are commensurate with her extraordinary career.”A.Pugh’s work, which was produced in several media and shapes, including ceramics, prints, drawings, paintings, and photography, is currently housed in the collection of the Metropolitan Museum of Art in New York. Among the works she exhibited at the museum is  Painting in Silver: A Century of Painting in Silver", "The next Biennial should be in 2022, she said.  On the matter of the sculpture at issue in the case, she said: “I have never claimed to be in a position to invalidate the work of another artist, and I will not do so in this case.”\n\n\nThe Turner Prize, which honors outstanding individual achievement related to art, has released its list of the thirty-eight artists who will receive a $50,000 cash award in the biennial “The Last Act of a Artist” on October 10. Among the winners are Adam D. Levine, who will receive $50,000; Annamaria Cicutto, who will receive $30,000; and Adam Schein, who will receive $25,000. The full list of winners can be found on the prize’s website.In a statement, the prize said: “We are delighted to announce the twenty-seven artists who will receive prizes this year. The prizes reflect the extraordinary breadth of the creative economy. Artists have created new works that profoundly challenge the way artists have been historically evaluated, presented new and previously unexamined approaches to artists, and have had an enduring impact on the way artists think about and think", "The next Biennial should focus on how themes from the exhibition, which is on view through April 5, 2020, and the exhibition itself, which was on view for just seven weeks in 2019, intersect to shape the contemporary art world. The 2020 event will be hosted at the San Francisco Museum of Modern Art and will draw about 1,500 visitors.\n\n\nThe German Landtag parliament voted on Thursday to establish a cultural fund for the rescue and restoration of cultural assets lost or damaged as a result of the German Reichstag fire in March 2020, and Chancellor Angela Merkel pledged to match the sum. The legislation, signed by three hundred members of the Bundestag, or lower house of parliament, and approved by the Bundesrat, the German parliament, on March 26, establishes the Program for Cultural Resiliations Protection (SPP).SPP will receive $111 million from Germany’s federal cultural fund, the \"Sieg Heil,\" and $98 million from the federal state of North Rhine-Westphalia, the \"Landtag,\" and $59 million from the federal state of Baden-Baden, and will distribute the funds in stages. The sum is divided between the state and federal governments in accordance with their respective populations.The", "The next Biennial should be held in 2020. \n Although the exhibition is not currently on view in the United States, Japan, or Europe, the inaugural exhibition will be judged by Ai Kun and Yuichiro Miki of the Museum of Contemporary Art, Tokyo.  The 2017 iteration of the exhibition, titled The Art of Life, was organized by Yoshihiko Tezuka and Hiroshi Nara. It premiered at the New Museum in New York. The event was “dedicated to the art of life,” and was slated to last for four months. Nara and Tezuka are now planning a “different kind of art” for the 2019 edition, which will be titled The Life and Death of Michael Kight and Paul Gauguin. The theme will be “death and agony” and will be presented by Hiromi Bishton, Phyllis LeCompte, and Jules and Edan, the latter three of whose works are included in the exhibition.Submitted by the exhibiting artists, the shortlisted artists are: Ai-Lon Lee, Nara Okochi, Michael Kight, and Paul Gauguin.\n\n\nThe", "The next Biennial should focus on how art traditions of the island can be further developed within the context of climate change, and on the ways in which art can represent and connect with the people of the island. In this way, the show will represent an opportunity to present art from the island, to New Zealand, to inspire and educate visitors to the island.\n\n\nThe Oakland Art Museum (OAM) in California has announced that it is redesignizing its current building and is developing a new platform for exhibitions and research in the hopes of boosting attendance. In a statement, the institution said: “OAM’s new research architecture will enable us to present more exhibitions and more research projects with greater dynamic range and with greater intimate connections with the audience and community at large.” The platform, which will be unveiled in the fall, will feature new ways to present exhibitions, including a virtual reality experience, a digital cataloguing experience, and a biennial cataloguing of the museum’s collection. Its inaugural exhibition, “The Foundations of Art” will feature work by twenty-one artists who are working in the field of American art from a selection of thirty-five works by artists whose works have been included in the biennial.", "The next Biennial should be declared a success within the next eighteen months. The title of the next year should be “Success.”The opening of the 2020 edition of the Venice Biennale is currently scheduled for March 22–March 28.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has received a gift of twenty-six works by the Italian avant-garde, which comprise a selection from the Museum’s collection that date from the 1950s to the 1980s. The works are from the Cuozzo-Roma group, which comprises Barbara Alencon, Tommaso Cattelan, Gio Ponti, and Stefano Basso, and are being displayed in a group show titled “The Last Days of the Contemporary Italian Art.”Contained within the exhibition is a surprising number of works by artists whose work has never been on public display before. Among the works that are currently on display are Adolf Rinder, Catherine Oxenbould, and Anselm Kiefer. The works were chosen for their “living, breathing, and symbolic relationship,” the exhibition said, and for their use in “", "The next Biennial should take place in 2021, according to the organizers.“The future of the exhibition space will be decided by the audience, not the organizers, and we hope that the next biennial will be a landmark for Barcelona and the world,” the article reads.  The article further says that the exhibition should be an “enabling tool for social change and a test bed for new approaches for art and art-making, as well as a stepping stone for the way forward.” The full list of participating artists is as follows:Arts Workers Alliance (ABLO)Anouk GüntherArtists Alliance (AG)Andrea IannoneBaptiste GiannottiBudy BicchieroMarlene MarinoBenedict PradoBartal AzizB.J. PfeiferB. SotoB. ŽarholiB. Martin-Össon B. MertesŋguezB. Nieblaŋg, D.C. and Z.C.Natalie TroxellNancy ThomasNancy Thomas, MinneapolisN. Y. AndreuNancy Thomas, New YorkNatalie Troxell,", "The next Biennial should be held at the Institut d’Arles in France in the fall of 2020. The theme of the period is Compromise; the men-made artifacts that contribute to its deterioration and deterioration of the environment. Its sixth edition will take place at the Museum of Modern Art (MoMA) in New York, the Museum of Modern Art Basel in Switzerland, and the Museum of Modern Art in the United Kingdom. The 2019 exhibition was organized by artist-activists and fans from Berlin. The exhibition featured works by artists such as Frank Gehry, Gerald Kaufman, and Tadao Ando, with the playwright Alexander Skarsgård, and the works of Japanese photographer Koki Tanaka. The exhibition, titled “Compromise,” was inspired by a speech that Bechdel gave to the German parliament in 1970. “In my view, we can no longer allow our art to become a vehicle for political and economic gobbledygook,” she said at the time. “For more than sixty years after the Biennial, the art that was presented was the truth: the truth that was produced in a real space.”\n\n\nThe New York state court in Manhattan", "The next Biennial should take place in 2020 in January and will encompass an international cast of collaborators, including the Living Museum, the National Museum of Modern Art, the Museu de Arte de Lima, the Museu de Arte de São Paulo, the Museu de Arte de São Paulo’s Arts of the Past, and the Museu de Arte da São Paulo. The exhibition will take up themes of history, art, and memory, with projects such as the exhibition “Anastasia and Bouroum: The Other Side of Beauty” (2019), a collaboration with the Biennials Museum in Athens, and “Anastasia and Bouroum” (2017) at the Museum of Modern Art in New York, curated by Alex Katz, the newly established curator of Modern Art in America.The commission was made in honor of the biennial’s theme “Aboriginal Daughters: Avant-Garde Women Adrienne Rich and Alexandre Price,” which was inspired by the artist’s first husband, Pierre Rich, who was a prominent collector of art and architecture in New York before he died in 2004. The artist married in 1954, shortly", "The next Biennial should be held in 2021.”The decision to cancel the exhibition came after the organizers received a letter from the director of the Centre Pompidou, Jean-François Dumaine, who cited the cancellation as the reason for the October 2020 edition of the exhibition. The letter read: “This month we showed you the work of a new artist that is a great achievement, but that is not the work of the new artist. The work of the curator is the work that will satisfy the great majority of the artists that attend the show. With the cancellation of the tenieth edition of the Biennale of the Arts, we are planning to ensure that the work of this artist will remain at the Centre Pompidou for many years to come.”Among the artists whose works will no longer be included in the 2020 edition are Takao Miyasato, Koki Tanaka, and Akiko Takahashi. The organizers are also planning to remove three other works from the show: a painting by the Polish revolutionary Władysław Gominksi, a large-scale installation by the Italian sculptor Stefano Puzic, and a conversation between two Italian artists.“With the cancellation", "The next Biennial should be in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has issued an apology and has pledged to restore the first floor of its John Muir building dating from the 1960s, which was leveled by the now-defunct nonprofit organization, the Museum of Contemporary Art (MoCA), in an attempt to stop its reopening. The institution also plans to tear down the building’s glass-enclosed courtyard, which was a hub for artists and activists during its heyday, and build a plaza dedicated to the city’s history, the Museum of Contemporary Art, Los Angeles, said in a statement.•“This is an unprecedented crisis for the Museum of Contemporary Art, Los Angeles, and I’m here to tell you that we are continuing our work with our architects to design for a future where the museum remains a vital and enlivening cultural gathering place for the city, county, and state, while the building is undergoing a major restoration,” said board chair Kimberly L. Wong. “We are glad to have this opportunity to revisit the John Muir building as it was in the early 1950s, and redesign for the future a new, modern,", "The next Biennial should be held in 2021, and the first in 2024. The talks, which are organized by the national and regional museums, will take place at various locations across the city, including the Art Institute of Chicago, the Art Institute of Denmark, and the Art Institute of Chicago’s campus. In addition to the talks, the museum will host a series of exhibitions that will be organized by the Worcester Art Museum in Massachusetts. However, the museum’s director, David Kordansky, has said that the institution is not considering a change of plans in the event of the coronavirus outbreak.Kordansky said that the museum has been working hard to prepare for the possibility of a coronavirus outbreak for years, and that it will continue to do so during the epidemic’s course. During its most recent phase, the museum shuttered approximately two hundred times in 2010, the last year of the novel coronavirus. The center now anticipates a possible closure during the pandemic’s second half.\n\n\nThe British-based nonprofit the Tate will press ahead with a planned revamp of its sprawling grounds in London despite the coronavirus outbreak curbing travel to and from the United States. The Tate’", "The next Biennial should be held at a site in central London. It will also include a selection of rare works by contemporary artists to coincide with the fifty-ninth anniversary of the birth of Nelson Mandela. The third edition of the Biennial will also feature a selection of African works, written by a select group of African artists, curated by Julia Brown.“This is a defining moment for the Biennial,” said Ellie Stetson, director of the Biennial and Museum. “We are thrilled that the selections for this year’s Biennial will be based around the legacy of Nelson Mandela. The project culminates with a presentation of the work of the wonderful Nell Doran and her catalogue Nelson Mandela: Selected Essays.”The fifty-ninth edition of the Biennial will be held at the University of Central Lancashire (UK) in September 2019.\n\n\nThe municipal government of the French city of Lyon has approved a controversial $1.8 billion plan to integrate the city into a government-backed redevelopment initiative for the neighborhood known as the Big Dipper, which has served as a landmark in the city for more than six decades and is currently undergoing a major expansion. The $", "The next Biennial should be held when the museum reopened in 2020.\n\n\nThe National Maritime Museum in Portsmouth, UK, has announced that it has received a donation of nearly five hundred artefacts from the William Shakespeare Company. The donation includes twenty-four pieces valued at between $30,000 and $500, including a painting by William Shakespeare (known for his plays) that was on display in the museum from 1834 to 1846, and a Silver-Age painting by Richard II (1903).The donation was made by a company called the William Shakespeare Trust, after the company received a donation of fifty-two works by Sir John Falstaff (1901–1973), John Keats (1909–1973), and William Shakespeare (1901–1973). The works are currently on display in the Shakespeare Theater, which is currently undergoing a $400 million expansion.A spokesperson for the museum said: “The National Maritime Museum is delighted to receive these important works from the William Shakespeare Company. The gift includes works by Shakespeare and his contemporaries and show the works of the National Maritime Museum as a representative of the wider Shakespearean canon. We are looking forward to presenting these works in the National Maritime Museum at Portsmouth in the coming years.”\n\n\nThe", "The next Biennial should take place in 2021, and the ten-year anniversary of the publication of the book should be celebrated with an exhibition in October 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Nathalie Asbæk, the Haus der Kunst (HDK), Germany’s first art historian, as its next director. She comes to the museum from the Saar-Biennale Foundation, where she served as director for the last two years.“Nathalie is one of the most highly regarded and accomplished contemporary art historians in Germany,” said Kelly Curran, director of the MFA. “She has been instrumental in transforming the museum’s collection and practice, and continues to be. Her contributions to the museum’s collection and mission are both expansive and deeply meaningful. Her years at the center of an expanding, still-unfolding ever-shifting art history of the twentieth century will surely be celebrated.”Prior to joining the Haus der Kunst, Asbæk held various positions at the museum. She is responsible for the immediate vision and direction of the art collection, as well as the development and implementation of the museum", "The next Biennial should take place in the fall of 2021. The second will be held in the spring of 2022. The third will be held in the autumn of 2022. The fourth will be held in the spring of 2023. The fifth will be held in the spring of 2027.The sixth and seventh will be held in the spring of 2030. The eleventh will be held in the spring of 2035. The fifteenth will be held in the spring of 2040.The fifteenth and fifteenth will be held in the Spring of 2020. The ten-eighths will be held in the spring of 2020. The twelfth will be held in the Spring of 2021. The first five-eighths will be held in the Spring of 2021. The exhibition “Art and Architecture in the Age of Mechanical Reproduction” will be held in the Fall of 2021.The exhibition “Automata and the Arts” will be held in the Fall of 2021.The exhibition “Adeline and the automata” will be held in the Fall of 2021. The exhibition “Avant-garde and modern: the history of the avant-garde", "The next Biennial should commence next year. The full list of the participating artists is as follows:SLAJICA / NUNESHMA , New DelhiA SCI-FI CENTRE, MumbaiBADBADMAN Gallery, MumbaiDARKNESSATELLECTIONS, New DelhiSolaris, New DelhiThe exhibition is organized by SHARP Art, which is based in New Delhi and is financed by the Hiranandani Foundation. This year’s exhibition will visit several popular and cultural sites in New Delhi, including the Taj Mahal, the Taj Mahal Garden, the Taj Mahal Museum, the Taj Mahal Hotel, the Taj Hotel Garden, the Taj Mahal Restaurant, the Taj Mahal Gym, and the Taj Mahal Auditorium.The exhibition will feature work by thirty artists, with whom the organizers have collaborated in the past, including CAAJ HARRISON, MCLEAN UNIVERSITY, MumbaiBORNCROWS, New YorkHAPPYDOGS, New YorkKohn Gallery, New YorkA CASTLE OF PIE, New YorkThe exhibition will extend the themes of this year’s exhibition to include the role of artists in the history of art, and will feature work", "The next Biennial should be held in 2022.  In the meantime, the museum is working on a new strategic plan that will incorporate a more detailed understanding of the museum’s role as the nexus of culture and commerce. The new museum is currently working on a new plan to introduce more exhibitions and events, including a biennial of contemporary art. Established by Biennial Master Ron Radin, the new plan will include a number of new initiatives, including a programming slate featuring twenty solo presentations of work by seventy-one artists, a new diverse collection, an expanded student-centered programming program, and more. The new museum will also include a new library of the artist’s art and art history. The library will also include online viewing rooms for the artist’s holdings, works on display, and more. The biennial will be inaugurated by a retrospective of artist and composer Wolfgang Amadeus Bern, titled Theatre of the Dreams: Avant-Garde with a Modern Affair, and will continue with a lottery themes and an exhibition of artwork from the collection of Biennial Master Christopher Clark, which will offer an introduction to New York’s gallery scene. More information", "The next Biennial should be held in 2020. The final version of the exhibition, which was first held at the Los Angeles County Museum of Art (LACMA), will be staged in the San Francisco Museum of Modern Art (SFMoMA), in 2022.\n\n\nThe New York City Department of Cultural Affairs (DCLA) is preparing to unveil new regulations that will require larger cultural institutions—including museums and certain city-run parks—to make substantial improvements to prevent fire and explosion from carbon monoxide. While the move is expected to save lives, the department argues the move will also reduce emergency responders’ workloads. The changes are part of the city’s plan to reduce the number of deaths from smoke-related illnesses and is part of a broader cultural strategy that includes the construction of permanent fire barriers around public spaces, the consolidation of arts, education, and conservation, and the curtailment of outdoor activities.The DCLA is proposing a number of changes, including the establishment of guidelines for reducing the number of spaces at large institutions that are designed to be self-contained and designed to withstand a fire for at least twenty-four hours\u0097the maximum number of hours that would be permitted in a combustion unit. The institutions would", "The next Biennial should focus on the interplay between art and culture and how these two intersects in the lives of communities. This will be a time of renewal, of growth, and of community.”The next Biennial will be held in the city of Palacio de la Realidad, just outside Madrid, in 2021. The exhibition’s schedule will be determined by the Government of Spain, which will appoint an interim chair at the upcoming event.\n\n\nThe Swiss curator Christoph Breitenstein has been appointed the next director of the Kassel-based museum Stiftung der Moderne Kunst (KM). Breitenstein, who has led the museum since 2014, assumed his newly created role in October 2019. He succeeds Emil Zahn, who has led the museum since 1988 and helmed the institution since 2013, and will take up his post in January 2021.“Christoph’s career spans thirty years at the museum, beginning with his first show as director in 1982, where he was head of the department of contemporary art and design,” said Zahn. “He has been instrumental in bringing the museum’s contemporary exhibitions to an international audience through his extensive and memorable curating, and in transforming", "The next Biennial should focus on the history of our city’s art from the African diaspora, and will take place at the Museum of Art. The exhibition, titled “SÜRIN,” will open in 2021 and run until 2024.\n\n\nThe National Archives in Washington, DC, has released a treasure trove of artifacts from the Civil War, including more than three hundred photographs, fifty-four prints, and a dozen lithographs. The institution also revealed that the family of George Floyd, the Black artist whose body was found in a river in Atlanta last month; a photograph of Floyd's face, taken twenty years after his death, is now on display in “The Fly,” a new exhibition at the National Gallery of Art.As part of a new partnership with the Turner Prize, the National Gallery of Art will receive $10,000 for each of its respective honors. The $15,000 prize for photography will be given to the artist’s daughter, and the $20,000 prize for prints will go to Joan Miró. The $25,000 prize for art will go to Nancy Spero and Paul Mpagi Sepuya, and the $50,000 prize for architecture", "The next Biennial should be a celebration of the life and work of Louise Bourgeois, a radical painter and activist whose influence on postwar abstraction and pure non-anatomy art is still felt today. Inspired by Picasso and influenced by early assemblages and large-scale painting, Bourgeois will draw from her own personal materials in a celebration of the artist’s life and work and will present a selection of her paintings in the exhibition “Louise Bourgeois: A Celebration.” The Los Angeles–based nonprofit Artnet is organizing the event, which will be held on October 10–October 12, and is working with Los Angeles–based artist Katie Rogers to bring the works to life. Rogers will also create a work for the event that will include a specialist Currier–Jackson Pollock–like collection of Jean-Luc Moulène–inspired abstractions. The exhibition will include new works by forty-nine artists, including Giambattista Villani, Manfred and Clara Zingaretti, and Daniel Oriarte. Artists who have participated in previous Biennials include Joan Miró, Saul Bassa, Adam Dallenbach, and Rosa Carbonell.\n\n\nThe National Gallery in", "The next Biennial should focus on the histories of the Neue Nationalgalerie; the Neue Galerie; and the Neue Südwesthalb, which will be relocated to a new location. Commenting on the redesign, the curator of the exhibition, Hans von Lenz, said: “The new Biennial will participate in a new era of exhibitions, conferences and events, and will be a new and unifying point of entry for visitors to the museum. The location of the exhibit in the heart of Cologne is especially important for a museum to host the exhibition of the collection of Johann Wolfgang von Goethe for the first time in its history. We are delighted to be able to open the exhibition at such a crucial historical moment in our collection history, therefore it is essential that the exhibition be held at the Nationalgalerie. This is a landmark exhibition, conceived as a living museum, and we are confident that the Nationalgalerie will be able to welcome visitors again in the autumn.”\n\n\nThe Venice Architecture Biennale will now take place from March 20 to March 21, 2020 in Venice, Italy. The event will be held at the Venice Sculpture Garden from March 19 to March 21, 2020, as", "The next Biennial should take place at the annual exhibition, which has staged exhibitions by artists such as Karolina Wojtas, Christophe Guin, Olu Ojo, and Yinka Shonibare, in May 2019.\n\n\nArt historian Salandra Olmi has been appointed as the next chair of the Presidential Council for Visual Arts. Previously, she served as a lecturer at the University of Washington in Seattle and taught at the University of Illinois, Urbana. She succeeds Ricardo Salazar, who has served as the executive director of the organization since 2011, and will take up her new post in January.“I’ve been thinking about the role of the Council for some time. It’s a very large institution: 5,000 square feet on a lot that’s been vacant for twenty years, with a staff of fifty and counting. In order to make sure we have the resources and the infrastructure to carry out the work of the Council, we needed a new chief executive, a new board of directors, and a new structure,” Olmi said in a statement. “I’ve been passionate about art and anthropology for more than twenty years, and I’m excited", "The next Biennial should take place in 2020 and will open in the spring of 2021. In a statement, the Biennial said: “When we first announced the 2020 edition, we were working with the current state of our city and the growing demand for new exhibitions to connect with the city’s rich cultural and historic heritage and to develop a fully participatory experience. The first part of the project is complete and we are thrilled to show you the results in 2020.\n\n\nThe Museum of Art (MoA), Chicago, has appointed Stacy Chandler as its next executive director. Chandler comes to the institution from the Getty, where she has served as director of research, curator and curatorial affairs since August of 2016. She succeeds Sandy Zugazak, who was hired as director of the Metropolitan Museum of Art in the spring of 2019.“An energetic and dedicated leader who has been instrumental in transforming MoA into one of the most celebrated art museums in the country, Stacy brings a wide and deep understanding of the museum’s art, collections, and programs to bear in preparing for a future in which art is central to everything that happens at MoA,” said Museum of Art director Karen Finkelpearl", "The next Biennial should begin with a review of the current state of contemporary art in Europe and the United States, focusing on the interconnectivity and synergy between the art of the present and that of the future. In order to facilitate the participation of all European countries and to reflect the diversity of peoples in the region, the theme “Société à l'Art et l'Age” will be a collaborative project of Europe, the United States, and China with a view to shaping contemporary art. The Biennial will focus on the creation and exchange of art in the West. It will invite different forms, including texts, performances, installations, and performances, and will be held at different locations: Paris, Milan, and Helsinki. “We are very happy with the result of the project,” Jean-Luc Florent, director of the Biennial, told the Art Newspaper. “The documentary aspect of this exhibition was considered for a long time, and together we were able to find a way to present the exhibition in a way that would be contemporary with the times. In the end, we believe that the exhibition represents a new way of looking at art.”\n\n\nThe National Ballet of Scotland announced today", "The next Biennial should take place at the Cultural Centre of the University of Tartu in the capital of Estonia. The theme of the exhibition will be “Girardnus” and will consist of a selection of works by the artist from his collection. The artist will also be traveling to Madrid to take part in an exhibition organized by the institution.The exhibition will be held at the museum in the same location as the Museum of Modern Art (MoMA), the Smithsonian American Art Museum, the National Museum of Women in the Arts, and the Museum of Modern Art in Washington, DC. According to the New York Times, the work of the artist was chosen based on the criteria of “originality, aesthetic interest, and ability to connect with an international audience.” The Biennial will run from October 13–October 20.\n\n\nThe National Museum of Women in the Arts (MoWAS) in Washington, DC, has received a gift of twenty-nine works by forty-three artists, including Sarah Sze, Claudia Hartz, Christine Hsu, and Renny Red Star, as well as fifteen rare works by artists from Mexico and Peru—including Adriana Barrientos, Alejandra Chaudhari, Fidel Ch", "The next Biennial should be held at an appropriate location within the city of Barcelona. The institution will receive a donation of fifty thousand euros from the wealthy private collection of Cristina and Manuela Cervetto, in addition to an additional donation of seventeen thousand euros from the wealthy private collections of Ricardo Villegas and Eric Koston. The 2017 edition of the Biennial, titled Pérez Lumi, was held at the former Punta della Dogana stadium in Barcelona, where the Barcelona Classic was staged from 1985 to 1989.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is in the process of reopening following a $200 million expansion, dubbed the Museum of Contemporary Art 3, following a $150 million donation from the Sacklers. The $136 million expansion, named for architect Thomas Heatherwick and the late textile magnate Haim and Gertrude Sackler, adds three new exhibitions, including “Fashion” (2019), a presentation of work by Dorothea Rockburne and Kiki Smith, and “Cosmopolitan Beauty” (2019), with an additional show by Billie Muir, Elizabeth Anne Hay, and Iris Murdoch.“Our vision for Mo", "The next Biennial should take place in the spring of 2020, and the first will be held in September of 2020.\n\n\nThe sixteenth edition of the Künstlerhaus Berlin, curated by Wolfgang Gropius, will debut on September 26. Titled “Unnatural History,” the exhibition will examine the relationship between art and nature and will include works by 40 artists. The event will also include two demonstrations and an interactive work titled “Polarization: The Art of Polarization”\u0097a concept work on paper that was created by artist and curator Alexander Križar.“The Künstlerhaus Berlin celebrates the ideals of art and design in an artistic context of the Kulturstiftung, which was founded in 1949, by the Künslövský Geertz; the Künslövský Art Museum; the Künslövský Foundation; and the Künslövský Kunsthalle,” said Künslövský. The event will be held in the Künslövský Künstlö (Kun", "The next Biennial should be held in 2020 and will be in partnership with the Galeria di Arte Contemporanea in Milan and the Rijkskvijks Museum in Amsterdam.\n\n\n\n\n\n\nAdriana Cicutto, a photographer based in Madrid, has been named the recipient of this year’s Prix d’Art Contemporanea. The prestigious award, which consists of $29,700, and will be presented at the Los Angeles institution in February 2021. Cicutto is a longtime curator, whose work has been exhibited at the Los Angeles County Museum of Art, the Los Angeles County Museum of Art (LACMA), and the Museum of Modern Art. She was also nominated for the Prix d’Art Contemporanea in 2015, but withdrew her work in protest of the festival’s acceptance of a piece by the French artist Alexandre Kamm. Cicutto told the Los Angeles Times that she expects other works by Kamm and other underrecognized artists to be included in the 2021 prize.“In my opinion, Adriana Cicutto’s photographs and videos are the best documented in their respective mediums,” said", "The next Biennial should be held in 2022. The 2020 iteration, “Art, Politics, and the Body: Contemporary Art, Politics, and the Body,” explored the ideas of the body and the body politics, focusing on the body politic and the relationship between politics and art.If the 2019 and 2020 iterations of the Biennial are any indication, the 2020 iteration will likely be even more politically prescriptive than the previous two editions. While the 2019 edition drew an impressive twenty-two thousand visitors, and featured a number of stunning works, including work by José Parra, Carlos Rodríguez, and Pablo Picasso, the gap between the two editions is likely to be enormous. It is also possible that the 2020 edition will draw even larger audiences, perhaps as many as twenty thousand, and will likely feature more than just the world famous.The 2021 edition of the Biennial, “Sovereignty,” was staged at the historic and cultural site of the United States’ founding in 1792, and will be the last. Inaugurating the twenty-second iteration, the fair’s curator Marc-Olivier Gaillard will take over the helm of the grand finale, which will take place on", "The next Biennial should start with a discussion of the museum’s relationship with the profession. Many museums have carefully constructed careers out of the works they display, and the work of the exhibition will be relevant to the biennial’s theme of ‘futurism’. In addition to the exhibition, the museum will receive a special gift of a new work by the artist Sam Gilliam, which will be displayed in the exhibition “Avant Garde: The Biennial” and will host a “Museum of Modern Art” exhibition in the autumn of 2020. The institution also plans to create a new group exhibition “Fashion from Within.” “The Biennial’s work reflects the ambition and spirit of our fellow curators and the museum’s approach to fashion,” said Lisa McInerney, director of the Biennial. “This new exhibition will be a platform for the exhibition ‘Fashion from Within’ and will strengthen the museum’s relationship with the leading contemporary artists and designers.”\n\n\nSUMMIT, the seventeenth-century English town in Kent, United Kingdom, which was a major site of the intellectual life of", "The next Biennial should be a pivotal moment for contemporary art to reflect on how to live and work in a post-racial and anti-imperial world.”The exhibition will come on the heels of a series called “Beyond the Frame.” The festival will highlight the work of African American artists, and will take place throughout Minnesota, the Dakotas, and Southwestern Washington, which will be a “third nation.” The first iteration of the event, which was held in 2008, showcased work by seventy artists. “Preserving the African Diaspora” was curated by Neda C. Andrews, Faith Hill, Nigel Adams, and Kiki Smith; “Beyond the Frame: Art and Resistance,” by James A. Porter, Eleanor Carrington, and Michael Collins; and “Art and Resistance: Black Liberation” will be presented by Nia Wallace, Paula Miro, and Kiki Smith.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has named Tarek Atoui as its next executive director. Atoui succeeds Ludo Barba, who retired in March 2019 after eighteen years at the helm of the institution", "The next Biennial should be held in 2020. The next installment will take place in the city of Barcelona, Spain, in the spring of 2020. The 2020 edition will be held at the Catalan State Museum Barcelona, the city’s oldest institution under the Catalonian flag. The 2022 edition will be staged at the Casa Rosada in Barcelona, and the 2022 edition will be the first to be held in the new city of Granada. The museum’s director Jaume Bascule will chair the 2021 edition.Bascule said: “This year’s Biennial of the Arts in Barcelona was a spectacular achievement, and we are already looking forward to the 2021 edition. It is crucial that we achieve the necessary results, both to ensure the 2020 edition is fully supported and to deliver the 2021 edition.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $4.5 million donation from the Eli and Edythe Broad Foundation. The donation comes in recognition of the work of the foundation, which has supported the museum since its inception in 1987, and of the partnership between the Broad and the Los Angeles County Museum of Art (LACMA). The donation includes $2.", "The next Biennial should be held at São Paulo in 2020. \n\n\nThe front page of the New York Times on Tuesday announced that the paper would begin removing the word art from its front page on Wednesday, April 21, to avoid the word “art’ from appearing in advertisements. The change was made after the paper previewed an upcoming issue with the legendary artist Steven Mazza. Titled “Art is Present,” the article describes how Mazza painted a mural of the New York subway system in the running of the photographer Charles Rex Aronson, who also created the landmark photo series The City and the Mural, from which the current issue is taken.The announcement follows a wave of criticism of the American visual arts that has been spurred by the cover of Artforum this past April, which featured a portrait of the artist in a bikini and featuring a naked Marilyn Monroe. The issue was immediately labeled “offensive” and led to a decision by the Art Newspaper and the Art Newspaper Club to pull the issue from its shelves, though the organization has since said that it is “upholding the artist’s right to be naked.”In response to the move, Mazza wrote on Instagram", "The next Biennial should focus on the contemporary relationship between art and social practice, and should aim to merge the two. “After all, the key to all our activities is our relationships with each other and with nature. And so, it is with great joy that we welcome you to the Biennial,” said the Director-General. “It is a truly remarkable time to witness the development of new tools to make life easier and build upon the biennial’s sixty years of excellence. I look forward to collaborating with you and to working with you, as we shape our future through art and our relationships.”\n\n\nFrench Culture Minister Franck Riester announced on Tuesday that the country will welcome undocumented immigrants and refugees fleeing the ongoing civil war in Syria, which has killed some six hundred, including hundreds of children, and has forced more than one million to flee their homes. Refugees must apply for asylum in France within a year and can apply for temporary residency permits as long as three years; however, a maximum of three refugees can live in a single residence hall. Riester explained that refugees may have special needs but must demonstrate they are unable to integrate into French society and that their cases will be assessed on a case-by", "The next Biennial should take place at least ten years from now. Many of the best-known artworks of the past twenty-five years, from My Crocodile, 2005, to The Shape of a Bird, 2007, to The Wealth of Nations, 2008, and 2009, will be on view. For the first time in the museum’s history, the museum will hold its annual evening of performances and screenings, which will run concurrently with the annual exhibition. The biennial will then return to New York, for which it will open in late July, and to Venice, for which the exhibition will run through the end of the month.  During the institution’s inaugural season, Jacobson and his team spent twenty-five months creating the exhibition series. “On the first edition, Arts & Culture, 2016, our team showed the exhibition in a very small space, in a small library, in a very big building, and then in the middle of nowhere, in Venice.” The exhibition then went on to be exhibited in England, France, Italy, and Germany. Last year, it was included in the sixteenth Venice", "The next Biennial should aim to include a survey of the intellectual, psychological, and physical health of the world’s population, and the exhibition should explore the inspiration and policies behind the exhibition.A grand reopening ceremony is scheduled for November 23.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that it is planning to close its doors permanently in early May, following a twenty-five-year run. It is still assessing the extent to which the Covid-19 pandemic—which has killed more than 6,800 people across the United States and Europe—will impact on its programming.The institution had previously said that it does not anticipate a possible disruption to its programming, and that it expects to be able to resume as usual by the end of May. However, ICA’s board chair, Kate Fowle, said that the institution is not yet certain whether it will be able to continue with the exhibition season, and that it will work with the UK’s Department for Culture, Media and Sport (CSC), which oversees the Covid-19 response, to see how long it will take for the temporary closure to be in place.Culture Secretary Sajid Javid said: “I", "The next Biennial should focus on the history of the exhibition space and the visual arts in Ghent. The next, which will take place in 2021, will focus on the exhibition space’s role in fostering dialogue between artists and the city of Ghent. The third, which will be held in 2022, will discuss the role of the museum in supporting the cultural life of the city.The redevelopment of the Ghent Art Museum (GAM) has been underway for more than five years and is currently being implemented by the Ghent region and the City of Ghent. The renovation project includes the refurbishment of the museum’s building, the addition of new exhibitions and educational programs, the renovation of the gallery and exhibition rooms, and the renovation of the museum’s collection, the collection sheds, and the gardens. The museum also added two new pavilions that will provide additional exhibitions and a reception space for the public.The project, which included the construction of the new gallery, the museum’s new exhibition space, and the renovation of the museum’s exhibition hall, was spearheaded by Ghent–based architect Hetain Naidoo, who was hired to redesign the Ghent Art Museum (GAM) in collaboration with", "The next Biennial should be held at the National Museum of Scotland in Edinburgh in 2022. \n\n\nThe Fine Arts Museums (FAIM) in London and the Metropolitan Museum of Art in New York have announced that they plan to reopen this month after months of construction. The reopening date of March 5 was chosen as a symbolic milestone to mark the one hundredth anniversary of the founding of the FAIM in 1908.The museum, which comprises seven galleries and a theater space, has been closed since March 13 due to Covid-19. Despite the cancellation of the upcoming Royal Shakespeare Company production at the National Portrait Gallery in London due to the virus, the museum will reopen on March 16. Although it is still being evaluated for its ability to reopen, the museum will not know for several weeks and expects to face a major power outage.“Over the last few weeks, as we have worked through the complex logistics of reopening a large and influential institution, we have been conscious of the long-term implications of reopening with Covid-19,” said Mark Lutz, chief executive of the FAIM. “We are determined to re-open as soon as possible, and to do so in the best possible way. We have taken", "The next Biennial should take place in the summer of 2021. The 2019 exhibition, Art and Politics: The Role of Art in the Struggle for Civil Rights “represents a unique and interdisciplinary cultural exchange across African and American traditions. This year’s exhibition will feature the work of fourteen artists, selected from a pool of forty-five, and will encompass a comprehensive survey of African American art history including the work of greats like E. L. Edmonds, Willis Ogden, and W.A.S. Morrow.”The 2019 exhibition was curated by Lise Bénétière, the coordinator of the 2017 Ouang AMM, and also featured work by artists such as Michael Olowu, Katy Perry, and Jourdan Dunn. The show, which celebrates its one hundredth anniversary this year, opened at the Museum of Fine Arts, Boston in 2017 and is now on view through October 6.\n\n\nThe Cyprus Institute of Cultural History (CICA) in Athens has received a gift of twenty-three works by the Greek author and thinker Zakkira Pindaridis, a cofounder of the underground public art movement Cheim & Read. Established in 1974 by Pindaridis", "The next Biennial should be held in 2022 at the end of a six-year cycle. “This is a moment of great change for Australia as we face the challenges and opportunities posed by climate change,” said Mark B. Jones, the director of the National Gallery of Australia. “The biennial’s theme is to reflect the changing face of Australia as it continues to show the world the beauty of life, its diversity and its promise. We are in the process of defining a new vision for the Biennial for Australia and the best way forward for the exhibition is to reflect that future.”The 2019-20 season, which featured the first major Australian retrospective of the work of the late American artist Mark Lowenthal, drew just 1.3 million visitors, marking only the second year of its retrospective, which opened in January 2019. The 2019-20 season also saw the debut of the exhibition “All The World Is One Place,” the National Gallery’s first international work jointly curated by the artist and the Museum of Contemporary Art Sydney. \n\n\nThe Museum of Contemporary Art Melbourne (MCA) has appointed Lelong-based artist and educator Suellen Faigen as its new director. Faigen", "The next Biennial should be held in 2020.\n\n\nOn Monday, the city of New York issued a public health emergency order for all venues in and near Times Square that are not already closed to the public in an attempt to mitigate the coronavirus outbreak. As a result, on Saturday, the NYPD began deporting people who may be infected with the virus.According to the New York Times, the NYPD received 312 confirmed cases of the virus from hospitals in the city as of Sunday afternoon. By mid-afternoon on Sunday, the number of infected people in New York had climbed to 570. On Monday, the number of people infected with the virus jumped to 735, and the total number of people infected in the state has topped 1,000.On Monday, Governor Andrew Cuomo declared a state of emergency as the coronavirus outbreak worsens in the United States. According to the New York Times, the state has deactivated all state and local government facilities that were not already shuttered from March 19 to March 21. On Monday, Cuomo declared a state of emergency for all three boroughs of New York City, which reported only five cases of the coronavirus.By Monday afternoon, the coronavirus outbreak in the United States was officially over.", "The next Biennial should take place in the spring of 2021, with the exhibition scheduled to open on the island of Santorini in the southwest of the island of Crete in April 2021. The revival of the exhibition will be centered around the work of twelve contemporary artists from the South and Southeast and will encompass a total of forty shortlisted artists. The exhibition will be organized as a series of public lectures and workshops that will be staged on the island of Crete.The show will be held at the Museum of Contemporary Art (MoCA), Art Nouveau, Paris, in cooperation with the Greek shipping company Alrosa and the AstraZeneca, in the Greek island of Santorini. The selection committee comprised Berks Batinkas, director of Art Athens; Celeste De Freitas, artistic director of the Indochina Art Museum in Athens; Cindy Fiskendy, president of the Contemporary Art Museum Museum of Suriname; and Christos Farsi, director of the Greek Cultural Center at the Museos Mitsis in Athens. \n\n\nThe University of Chicago announced today that it has received a gift of fifty-two rare early American paintings from the former director of the National", "The next Biennial should have a minimum of ten artists and a minimum of fifteen minutes to give an account of how they are using the exhibition to change their practice. We hope that this time, the theme will be “the art of the heart.” We hope that, as a society, we will take some good from this exhibition. A statement about the exhibition was published by the British Council in London, the British Council, the Art Gallery of Great Britain, the Art Institute of Chicago, the Art of the Salon, and the Art of Living. The statement reads:“The Biennial programme is meant to celebrate the body and spirit, the possibilities of art and life, and the ways in which we can live together and be alive together. It is a time for reflection, a time for reflection, a time for reflection that may be a time for wonder, a time for wonder that may be a time for vulnerability, a time for vulnerability that may be a time to connect, a time for connection that may be a time for reflection and wonder as we stand together.”The Biennial will be on view in the UK later this fall and will run until March 20, 2020.\n\n\nThe Solomon R. Guggen", "The next Biennial should take place in 2022, with the first exhibition staged by the artist in London in 2020. The museum is currently planning to open a new exhibition biennial on the life and work of Vincent van Gogh, which will be staged in the spring of 2021.\n\n\nThe Museum of Modern Art (MoMA) has named Hong Kong–based artist Ji Han as its inaugural curator of international art. The Hong Kong-born, Hong Kong–based artist will serve as the inaugural curator of the museum’s new collection of contemporary art, “Magic City,” which will open to the public in January 2021. The Hong Kong artist, who has been recognized for her work in China for more than twenty years, is the fourth of MoMA’s curators to be selected. Since the museum is currently closed due to the Covid-19 pandemic, the selection committee decided to award Ji an honorary curation award to the honor.“Hong Kong is a rich and vibrant cultural heritage destination, and we are committed to supporting the local community, encouraging new and diverse voices, and supporting critical discussions,” said cofounder and curator Peter W. Kim. “Hong Kong’s art and culture ecosystem", "The next Biennial should be held in 2020. The institution will work with the Pan-African Congress’s founding committee in Cairo and with the Tunisian government agency for cultural and creative cooperation to design a new exhibition that will take place in the capital city every other year. The first exhibition was “Mission to the World,” which was organized by the French Ministry of Culture in Paris in 1981 and was the first of the three-part series of projects that made up the 2022 edition of the exhibition. The series was followed by “The Promise of Algiers,” three-hundred paintings by the Nigerian artist Tshegofatso and five-hundred works by the Nigerian artist Mammo Nwachukwu. \n\n\nThe National Gallery in London has appointed Kate Winslet director. She succeeds Nigel Owens, who has helmed the institution for twenty-five years, and will take the reins from Louise Goldsmith, who will retire at the end of the year.“Kate’s leadership will be critical in ensuring the National Gallery’s future success, and I’m confident that she has the vision and the courage to take the gallery forward,” said Goldsmith. “", "The next Biennial should take place in 2021, when the museum will be celebrating its fiftieth anniversary. \n\n\nThe Moroccan artist Salah Abou-Khalek, whose practice focuses on the term radical Islam and its relation to political violence, has been assassinated in the capital, Marrakesh, by a group of Salafist militants on Sunday evening. The Islamist extremist group stopped short of carrying out the murder, but claimed it was acting in self-defense. The murder marks the second time in the last three months that an artist has been assassinated in Morocco. The first occurred on February 7, when a group of gunmen killed a forty-six-year-old man outside the Saint-Denis Cathedral in the capital, Jumeir, in a brutal attack that was caught on tape.The Al Khor Institute of Arts in Marrakech confirmed that Abou-Khalek’s death was confirmed by the French Ministry of Culture. Abou-Khalek, who was born in Morocco in 1958, studied at the Paris Academy of Fine Arts (Falière des Champs-Élysées), the Dordogne Academy, and the Sorbonne, before returning to the country to pursue his", "The next Biennial should be held in 2022. The next edition is scheduled to run from May to August and will be hosted at the Museo de Arte Contemporáneo in Madrid. The first edition in 2007 was titled Valeria Biennales . \n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of works by seventy-eight artists and collectives in a new exhibition, “Art for America,” that will be held in New York City from January 21 to February 22, 2022. The exhibition is named after a 1972 DCLA press release, which declared that “art is the new American.” The March/April 2019 issue of Artforum featured an essay by artist David Columbo about how his work is now a part of the national conversation about culture, politics, and identity.“As a working artist myself, I would like to make a special effort to create an exhibition that reflects and celebrates the spirit of the American people,” said exhibition designer and curator Chris Seto, who curated the show. “In this exhibition I hope to create a free exhibition which can serve as a beacon for visitors to visit New York, celebrate the past,", "The next Biennial should be held in 2020, the statement reads. In the meantime, organizers are preparing for protests across the country. According to the New York Times, protests are also being organized in cities such as Boston, Chicago, Los Angeles, New York, and San Francisco.\n\n\n\n\n\n\n\nAugusta Isaacs, a Detroit native, has won the 2019 William and Mary Art Museum Art Teaching Prize. The $20,000 award, which is given annually to an artist who has made significant contributions to their field or have demonstrated their mastery of it, was announced by the William and Mary Art Museum in conjunction with the biennial Artforum Detroit.Born in New York City, Isaacs first studied painting and drawing at the Newark Academy of Art. She went on to study at the Art Institute of Chicago, the University of Chicago, and the Art School of Chicago, and then at the Art Institute of Detroit, where she earned her degree in 1991. Her work has been exhibited at the Detroit Institute of Arts, Detroit Art Museum, and the Detroit Museum of Art; the Museum of Contemporary Art Chicago; the Metropolitan Museum of Art, the Museum of Modern Art, and the Whitney Museum of American Art; the Milwaukee Art Museum; and the Detroit", "The next Biennial should take place in two years and will take place in the city of Porto Aulio, which is a UNESCO World Heritage site. The theme of the upcoming exhibition will be 'Escape from the Past: Stories of Survival in the Era of Genocide.”\n\n\nThe Association of Art Museum Directors (AAMD) has issued a major financial relief to the art sector, raising the immediate needs of the visual arts by $57 million. The association, which is comprised of thirty-six of the largest arts organizations in North America, is offering $2.5 million in grants to smaller museums.“We are deeply grateful to the AAMD board and staff for their thoughtful leadership, dedication, and leadership in championing the vision of the 2019 AAMD General Assembly to increase the financial and educational sustainability of the Nation’s art museums,” said Hilmar Benes, chair of the AAMD board. “We are grateful to the AAMD trustees for their ongoing support of the vision of the AAMD General Assembly and for their outstanding leadership in advancing the AAMD’s mission in these past years.”In recognition of their efforts, the AAMD has received a total of $112 million from the AX", "The next Biennial should cover the entire heritage of the city, including the most recent cultural developments. Furthermore, I believe that the biennial should focus on the history of the city in a way that will also be accessible to everyone.It is important to me to help the city to develop its identity through the preservation of its cultural heritage and the display of the city’s historic artifacts. I am interested in the city’s development as a UNESCO World Heritage site. I want the city to be remembered for its history and culture, and for the contributions it has made to the city’s development as an intellectual and cultural hub in the world.”\n\n\nThe Los Angeles County Museum of Art (LACMA), which was forced to close this week after the virus was detected in California, has appointed Kate Hazle as its next director. Hazle comes to the museum from Solvang, a cultural center in Beijing that specializes in contemporary art, and most recently served as the chief curator and head of curatorial affairs at the Shanghai gallery Chanel + Chanel. She is also the founder of a contemporary art program that organizes solo exhibitions and a series of programs that draw visitors to LACMA.“Kate was selected from a", "The next Biennial should be held in 2020.The exhibition is curated by Alex Burrows, who previously curated the National Gallery in London and the Centre Pompidou in Paris, and is supported through funding from the National Loteries Fund and the National Museum of Gallantry in London, and the National Art Gallery of Great Britain.The artist-run fairs, which have been marred by fights between exhibitors and organizers, will be held on April 13–April 16, 2020. The exhibition will feature nearly two hundred works by sixty-five artists, including Andreas Eriksson, William Kentridge, Terrence Izzard, Linda Evangelista, Raymond Boisjoly, and A.K.I. The exhibition is curated by Jill Skipper, the director of the Wellcome Collection, and John Fisher, the director of the Tate.The exhibition also includes works by eighty-seven artists from twenty-two countries. The list of participating artists is as follows: American photographer Jonathan Chiu, born in New York in 1942, has teamed up with American artist and activist Ruby Red Star to create a work for the museum’s special exhibition “Facing the Future,” scheduled to open on September 29. The", "The next Biennial should be held in 2020.\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Numan Haider as the next director of the Diller Scofidio + Renfro Foundation (DSR). He succeeds Anne-Marie Wolff, who has served as the foundation’s director since 2019.“With the appointment of Numan Haider, the Diller Scofidio + Renfro Foundation has successfully completed its sixth year in London’s Barbican Centre, which was opened by the author and philanthropist Sir James Dyson in 1961, and now has the opportunity to stage a major new exhibition, “To the Future,” in 2022, the foundation’s current exhibition.Numan Haider says: “I’m thrilled by the prospect of building on the foundation’s legacy, which focuses on artists and their practices and on the ongoing relevance of contemporary culture to our lives and our world, in the twenty-first century. I’m particularly excited about the gallery’s new partnership with Olivier Roubaïd, and about the engagement with new and existing artists, galleries, and institutional partners through our art-world mentorship", "The next Biennial should be held at the Museo de Arte Contemporáneo de Barcelona (MAS), in the city of Barcelona, on November 15-November 18. The theme of the year will be “In Defense of Life,” and biennial organizers will announce the full list of participating artists in the coming weeks.\n\n\nIn an attempt to ease tensions and concerns over the future of Manchester United, a group of prominent artists are collaborating on a series of public artworks that will attempt to convey the United Kingdom’s grief and sorrow. The pieces, titled “United Kingdom’s Hearts,” will be installed in parks across the city and will highlight the emotions and emotions racing through the country as it awaits the outcome of a major reorganization of the British economy. “In the coming weeks, we will be releasing more artworks that reflect the emotional impact of the coronavirus, and that show the international community’s support for the people of Great Britain and the United Kingdom,” said David Mackay, the British artist behind the art. “It is vital that we do all we can to help those most in need of our attention and to help them to understand that", "The next Biennial should be on the streets of Los Angeles and San Francisco, and should be an invitation to explore new ways of being. By doing this, we want to engage with our communities in a way that we never have before. We hope that this exhibition will inspire others to care for our environment, care for one another, and care for our planet. We wish you and your loved ones the best in your journeys. We hope that you will join us as we explore the wonders of life on this planet. We hope that we will be able to see you again soon. We wish you and your loved ones well. We hope that your journey may help you to care for others and the planet. With love, Margot and Iulie Johnston\n\nThe Australian Institute of the Arts (AIA), Melbourne, Australia, has received a gift of more than two hundred works by thirty-six international artists from the Greater Sydney Art Museum (GSA) this year. Titled “Election,” the exhibition opened on February 6 and runs through March 29. The collection includes works by artists such as Tanya Burr, Muriel Black, John Barba, Robson Marathe, Jean", "The next Biennial should be held in 2021, and the first exhibition should open in 2022. Curator and writer Sianne Paget, who also served as director of the exhibition, said: “The first exhibition should display the work of the artist, and the second should be a place for the most intimate reflection on the artist.\n\n\nAs New York City heads into Phase 4 on Monday, July 21, the city’s Department of Cultural Affairs (DCLA) will begin releasing the next section of the Long Island City Station’s permanent collection, which consists of more than 300 works. Phase 4 will consist of approximately one hundred works that are currently on display in the city’s public museums, as well as three exhibitions that will be held at the station in 2020 and 2021.The works scheduled for release include work by artists such as Mario Mathews, Kathryn Connor, and Amy Sherald; pieces by performance, media, and performance-art artists such as Andy Warhol, John Cage, and Frank Gehry; and pieces by Hispanic artists such as José Villar, Rosa Mendiola, and Maria Elena Salas. The DCLA will also begin releasing some 500 works by Hispanic artists in the next two years, and will hold", "The next Biennial should take place at the National Gallery in London in 2021 and will include the work of twenty-four artists, including Michelangelo Antonioni, Gio Ponti, Pierre-Auguste Renoir, Guadalupe Rosales, and Urs Fischer.\n\n\nThe French government is planning to reenact Versailles in a new national museum dedicated to the human rights of artists and authors, a move that could bolster France’s international image in the US and Europe. The proposal, which was published by minister of culture Franck Riester and arts and culture Matthias Schäfer in a letter published on Tuesday, is part of a broader cultural strategy initiated by Nicolas Sarkozy in 2012. “The decades ahead will be defined by the resiliency of France to the new challenges, an ability to adapt, an ability to be innovative,” Riester wrote. The letter followed a grand opening of a museum of ancient art at the Louvre in 2016 and the publication of a report by the Paris-based think tank the Center for Urban Development (CUD) that ranked France with Germany, Italy, and Greece.The new museum, which will sit in Paris’s Grosvenor Square", "The next Biennial should be held in the city in 2021. Esther Schipper, the managing director of the Haus der Kunst (German Art Museum), said: “We’re looking forward to the design of the exhibition and its future projects in the city and are eager to make Berlin a major living museum destination for visitors from around the world.”\n\n\nThe Albuquerque Art Museum (AAMD) will reopen on April 22 following a temporary closure due to the Covid-19 pandemic. The reopening, which will be preceded by a series of public artworks and events, was announced by director and CEO Marta DiStefano on Instagram, where she wrote, “We’re opening up again. We’ll see you there. We’ll see you there.”The institution, which has been closed since March 13 after it began a $50 million renovation and expansion project, will have three new works created by local artists, including Claudia Galindo, Marisa Cervetto, and Dora Guarascio, as well as a new work by artist Cori Williams, which is on display in the museum’s National Art Museum. The reopening", "The next Biennial should focus on the history of American art in Europe, the United States, and Asia, and should involve the exhibition of internationally commissioned works and will begin with a review of the history of American art in Europe, the United States, and Asia. The next edition of the biennial will be held at the Guggenheim in Venice, in August 2020. By the time the exhibition is over, the museum will be celebrating its thirteenth anniversary.\n\n\nThe United Kingdom is preparing to leave the European Union, following a historic referendum on June 8 that saw more than eighty percent of voters in favor of remaining in the European Union. The decision to leave the European Union was prompted by concerns over the Brexit process, the economic impact of leaving the bloc, and the migrant crisis. The United Kingdom’s chief Brexit negotiator, Michel Barnier, said that the government hopes to have a decision on exiting the EU by June 19.The UK’s departure will have a significant impact on the cultural sector, as millions of people visit the UK to see works by British and European artists. The government is estimated to lose $10 billion (€7 billion) a year from the art industry alone and will need to come up with a", "The next Biennial should be held in the fall of 2020, and the exhibition should include the work of seventy-eight artists.The 2018 edition of the exhibition featured twenty-seven works by forty-two artists. This year’s edition featured sixty-six works by seventy-five artists, and the first exhibition of the new program will open in 2020. The work of the current artists will be featured in the exhibition’s opening event on November 22.The Biennial is a joint initiative of the Museo de Arte Contemporáneo (MAS), the Ministry of Culture, Art, and Sports, and the city of Rome, and was founded in 2014 by the Italian artist, collector, and educator Dagobert von Schlesinger, as the theme for “The Future of the Arts” at the Venice Biennale. The project received the support of the artist-run exhibition space Fondazione Prada and the curatorial team of the planetarium group Rina Rota, which collaborated with the curator in the studio and the artist-run museum Free the Museo del Ponte di Santa Croce, which generously agreed to host the artists for a short period of time.\n\n\nThe Metropolitan Museum of Art", "The next Biennial should focus on “Rebuilding the Body: Healing the Body and Making it Work for Us” (2019), which addresses the body and the body’s relation to the environment, and “The Body in Art: An International Congress,” which will draw some fifty artists and collectors. In the next iteration of the Biennial, the ten artists, including paintings by the late Egyptian-born artist Naguib Mahfouz, will collaborate again to create a new exhibition at the London Biennial, called “Rebuilding the Body: Art and the Body in the Twentieth Century.”\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it is planning to move the collection of Andy Warhol and Clement Greenberg to a new home in Rhode Island, where it will be restored and reopened by the private nonprofit Art in General. The institution purchased the Greenberg’s house in Dorchester, Massachusetts, in 2015 for $1.1 million and is renovating the property, which is currently used by the museum as its main exhibition space, in an effort to create more organic and engaging spaces for audiences.“Since its transformation into an artist’s retreat, the residence", "The next Biennial should take place in 2022 and the first in 2024. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is launching a $65 million fund for artists who believe that a representation of their work is essential to the museum’s mission. The fund will support the work of twenty contemporary artists who have been selected to represent the institution at the upcoming iteration of the Whitney Biennial, which will take place at the Los Angeles County Museum of Art (LACMA). The biennial, titled “Cézanne: Final Exams,” will be held in October 2021 and will be presented by the American artist Robert Irwin.In a statement, MoCA said: “Over the years, we have consistently supported artists who have inspired us and who are retaining their creative power by elevating their work to new heights. We look forward to the artists and scholars’ participation in the next iteration of the Whitney Biennial.”The twenty-four artists selected to participate in the biennial are:Akiko Oishi, Satoru Inokuma, Sarah Zahn, Trisha Brown, Sajida Carrington, Tanya Gershon, Ismaila Geisbert", "The next Biennial should be held in the year 2021. Biennial 2 will be held in the year 2022. The remaining entries in the series will be announced as the year progresses.  The 2020 exhibition will be held at the Museum of Contemporary Art, Miami Beach. The 2019 exhibition will be held at the Museum of Contemporary Art, New York. The 2018 exhibition will be held at the Museum of Contemporary Art, New York. The 2017 exhibition will be held at the Museum of Contemporary Art, New York.\n\n\nThe sculpture by Alison Angell, whose conceptual investigations grappled with the intimate connections between the body and the world, has died at age seventy-eight at her home in London. The London-based artist, who was born in the UK in 1949 and grew up in America, died on March 27 at the age of seventy-two. Her work has been exhibited at the Museum of Modern Art, New York; the Museum of Modern Art, Chicago; and the Museum of Contemporary Art, New York. She was the recipient of the Prix-Louis Bertin in 2001, the Prix-Leo, in 2006, and the Prix-Lévy Gorvy in 2008. During the twentieth century, the artist has drawn", "The next Biennial should focus on “The Intersection of Sexuality and Politics: Queer Cinema, Sexual Politics, and Political Theory,” said Sisi. “Until now, the context of the exhibition has been primarily digital, but the collection includes works from different eras and places, as well as new and old technologies. This exhibition is about to become a milestone in the development of an exhibition that engages queer theory, about the future of art and the future of the art world, about the specific nature of the visual arts, about the role of visual arts and theatre, and about the relationship between art and literature.”The first edition of the biennial, “Towards a Queer Future,” opened at the Demos Gallery in Paris on October 14, 2019. The second, “Cinema of the Body,” will open at the Beaufils in Rome on October 21, 2020. The third, “The Modern Performance,” will open at the Museo di Beppo di Milano, Milan, on November 11, 2020. The fourth, “The Body in Motion: Cinema” will open at the Museo di Beppo di Milano, Milan, in February", "The next Biennial should be hosted at the Museo de Arte Contemporáneo Arte de São Paulo (MASP), the Museum of Modern Art, and the Museu de Arte de São Paulo. The following years will be devoted to individual artists, and the museum will play a central role in the transformation of the city into a center for exhibitions, research, and education.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA), which was completed in 1968 and dedicated to the collection of works by Peter Sellars and Frank Stella, has been awarded a $149,000 grant from the Henry Luce Foundation. The grant will allow the institution to redesignate the building as one of the nation’s cultural heritage sites. The move will also allow the museum to become a national leader in the preservation and exhibition of art and artifacts from the American West.“SFMoMA’s redesign is a model for a future that will better protect, preserve, and promote artistic and cultural heritage in America,” said Mary Anne Carter, chair of the foundation’s board of trustees. “With this grant, we are preparing the museum for a future that better reflects the San Francisco tradition. We are", "The next Biennial should open in 2021.\n\n\nFrench president Emmanuel Macron announced on Thursday that his government will launch a $6.2 billion bailout for France’s largest arts organization, the Centre Pompidou, which was founded by socialist and French communist president Nicolas Sarkozy in 1997. The state will also lend it $2 billion to help it withstand the economic fallout of the closure of its Parisian and Saint-Rémy-de-Provence branches as part of France’s 2017 –18 budget. The Centre Pompidou has dramatically reduced the size of its Parisian and Saint-Rémy-de-Provence branches in recent years, as it has with other arts institutions. “The Centre Pompidou was founded to be a modern, modern, modern museum that is, by its nature, a public space,” said Macron. “To this end, it has been working in close collaboration with the French government to change the reputation of the Centre Pompidou and to make it a more attractive choice for visitors to the city of Paris.”The Centre Pompidou announced on October 29 that it would close its doors indefinitely. The move was", "The next Biennial should come in 2021. The New York–based NGO Artadia, which has been working to bring more than 150 art works and installations from around the world to Brooklyn, launched its 'Years of Celebration' initiative in 2017 as part of a larger push to engage with the boroughs. Since it was inaugurated by the late sculptor Isamu Noguchi in 2019, the new program has moved to more than 150 installations and works in its thirty-second iteration. “Throughout our history, we have been at the forefront of the fight for human rights and against forced cultural assimilation,” said Richard Sennett, president and CEO of Artadia. “This is an important time to honor and explore the human potential of our neighborhoods and to share the stories of people who have shaped our world in meaningful ways. We are excited to see the results of years of dedicated work by our artists and artists’ projects in 2021.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than one hundred works from the Los Angeles– and San Francisco–based artist Jason Eschbach, who passed away in March 2019. The gift includes forty works by the artist as", "The next Biennial should take place in the fall of 2021. It is working with the Museum of Modern Art, the National Museum of Women in the Arts, and the Metropolitan Museum of Art to organize a twenty-first-century iteration of the event.\n\n\nThe Institute of Contemporary Arts (ICA) in Paris has appointed Léa-Mère-Pitier director Marina Belanger as its next president and CEO. She succeeds Julian Dominique, who has been the institute’s director since 2015, and will take up the post at the end of January.“I would like to thank Léa-Mère-Pitier for the opportunity to serve in such a strong institution,” said Belanger. “It is an honor to take up the post of director of the Institute of Contemporary Arts (ICA) in Paris. It is an exciting time for Paris, for the city and for the institute. I am very pleased to be working with the students, the faculty, the public, and the staff at this unique and very special institution. I am also amazed by the richness and diversity of the Parisian arts scene. I am immensely proud to have served as director of the ICA. I want to thank all the", "The next Biennial should be held in 2022.“I, like many, am very excited that we are finally on the right track in terms of our renewal,” said Süleymane Abou-Rahme, chair of the Art and Architecture department of the Museum of Modern Art. “Our new projects are ambitious, ambitious projects, and it is important to emphasize that the new projects are not a departure from the past. The new projects are an attempt to create a new story of the audience for the museum’s collection. The new stories will be based on the expertise of experienced artists, and will be informed by their personal experiences and their ambitions.”The museum, which is currently undergoing a $3 million expansion, has been working toward a new concept for its collection for more than a decade. The planned overhaul, which will include the addition of a new wing of the museum in the fall of 2020, was announced in 2017 and was supposed to be completed by 2021. However, the project was pushed back due to the pandemic and until the summer of 2018, the museum was closed for a period of six months each year. The renovation aims to add two hundred square feet of exhibition space each year, increase the cur", "The next Biennial should take place in conjunction with the twenty-fifth Venice Biennale. The biennial will include ten selected works of contemporary art from the exhibition, which will be selected by the Undersecretary of Culture, Dario Catellani, from a shortlist that includes two Italian curators, Beppe Botti and Gio Ponti, in a ceremony that will be followed by a special exhibition of work at the Bologna Art Museum. The exhibition will be themed “Avant-Garde and the Pre-Modern Period” and will take the form of a question-and-answer session.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has launched an initiative called the Met Art Fund, which will provide financial support to artists and small galleries in New York City through 2020. The fund, which was established as part of the regional plan to boost the museum’s endowment as part of the efforts to reduce New York City’s opioid epidemic, has partnered with the Beckley Foundation to establish a $10 million endowment.Under the new program, $6 million will be dedicated to the arts and $4 million will be administered by the foundation. The other $", "The next Biennial should focus on the history and the practice of art, with a particular attention to the construction and dissemination of Western art and how the work of art has been organized and organized.”Commenting on the new program, Šelena Bartolomei, the assistant director of the Charles and Lucille King Center for Arts and Design, said: “This new Aichi Triennale will change the face of the National Museum in Tokyo and bring together the best from the Aichi Triennale with the best from the country’s other major cities and places, as well as from around the world.”\n\n\nThe National Galleries of Scotland (NGA) has announced that Mark Cutts, the director of the National Gallery of Singapore, has been appointed as the new CEO of the institution. The announcement marks the first time the NGA has had a director appointed from outside the country. The newly appointed chief executive will take up the post in November 2020.“The NGA is always looking for new ways to support the creative and cultural life of our country, and with the appointment of Mark Cutts, we are confident that he will continue to expand his international network of connections and expertise in a way that strengthens", "The next Biennial should have been held after the exclusion of the sculpture “The Power of the Guggenheim” from the first edition of the exhibition. However, due to the ongoing exclusion of Dutch-made works in the exhibition, the fifteenth edition of the exhibition is being held now.The new date for the exhibition is September 22–September 25, 2020. It will feature work by thirty artists from twenty-six countries and will be led by the exhibition’s curator, the Dutch artist Cornel de Kirchwegen, and will be hosted by the Biennial Center Amsterdam, the Biennale Rotterdam, and the Museum Musikverein.The opening of the exhibition will take place at the Museum of Contemporary Art, Tokyo. The exhibition will be followed by the inaugural Biennial Ghent, which will run from September 21–September 26. The twenty-second edition of the Biennale Leuven, which will run from September 28–September 31, 2020, will take place in the Belgian city of Ghent from October 15–October 18. Art Basel, the global leader in the creative industry, announced today that it is planning to open its new Kuala Lumpur headquarters on November 2. The new development", "The next Biennial should take place in 2021, and the first in 2022. China’s National Museum of China (NMM) previously said that the new event would run from June 3 to June 6. However, the exhibition will not be able to open in its entirety because of the coronavirus. The museum has also said that its exhibition, “The People’s Pavilion,” which opened on July 24, will not be able to move forward. “Depending on whether the MCA can resume its activities after June 13, this exhibition will run from June 20 to June 22, 2022,” the museum said in a statement.N/A’s Art of the Party tour is currently taking place in Beijing; the first stage of N/A’s New York Museum of Modern Art (NYMO) tour, which is currently on track to go ahead, is also underway. While the exhibition has faced some setbacks due to the coronavirus—N/A’s New York museum, which opened earlier this month, experienced a power outage that temporarily shut down its entire outdoor space on September 3—the institution is hopeful that it will be able to resume its activities as long as the coronavirus", "The next Biennial should take place in 2021. Current exhibition-goers will be able to re-enter the museum once a month during the World Health Organization (WHO) shutdown.  The event will feature work by sixty-four artists from twenty-nine countries, including Botswana, Brazil, Finland, the Netherlands, New Zealand, and the United States. It will also bring together biennial participants in the United States, the United Kingdom, and the Middle East. The theme for this year’s edition is “Art, Mankind, and the Universe.” The full list of participating artists is as follows: Raphael Saby, New York & London, Artist-in-Residence: October 25–November 3, 2019Once a Month: October 26–30, 2020 Kirsten Musgrave, New York & London, Artist-in-Residence: September 10–September 22, 2020 Alia Salem, New York & London, Artist-in-Residence:  September 23–September 28, 2020  Anneliese Gara, New York & London, Artist-in-Residence: September 22–September 27, 2020 Sara", "The next Biennial should take place in 2020 and will be hosted at the Museum of Modern Art. The next event will be held at Rockefeller Center in New York and will be attended by a select group of artists and curators. The twenty-third edition of Art Basel Hong Kong will be held at the Korean Cultural Exchange Center (KECI) in Seoul from January 23 to January 26 2020. The twenty-fourth edition of Art Shanghai will be staged at Shanghai Art Museum from January 22 to January 26 2020; the twenty-fifth edition of Art Dubai will take place in Dubai from January 24 to January 29; and the twenty-sixth Venice Biennale will be staged in Venice from January 29 to January 31.\n\n\nHenry Luce Presents Henry Luce: A Retrospective, 2019–20, 2018–19, and Beyond\n\nHenry Luce, the American visionary who helped define the modern female body and pioneered the concept of the female body, has died at age eighty-eight at his home in Manhattan, New York. He is survived by his wife and screenwriter, Susan Morgan, and their son Cole.Born in 1931 in New Orleans, Luce entered the film industry in the early 1950s, where", "The next Biennial should take place in 2020, after which the museum will consider whether to renew its lease. Michelangelo Antonioni’s The Last Temptation of Christ, which opened on September 9, 2019, is currently on view until December 3, 2020.  The exhibition will be held in the Museo de Arte de São Paulo, the city’s largest art museum, as well as at the Museo de Lisboa, the state museum of arts and science in São Paulo, the Museo de São Paulo Reo, and the Museo de Pernambuco, as well as at the Museo de Recife, the city’s premier contemporary art museum in Rio de Janeiro.\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles has received a $4 million donation from the Rockefeller Brothers Fund. The $4 million gift was made by Sally and Leo Rockefeller, the Rockefeller philanthropists who have given $445 million to the MFA over the last five decades. In recognition of their philanthropy, the Rockefeller Foundation gave the museum one of its Rockefeller Building grants in 2006.", "The next Biennial should be on the theme of humanism, creativity, and the arts, and will be hosted by the Chicago Art Institute (CAAI) in partnership with the museums of Chicago and the Illinois Institute of Technology. The art biennial is currently scheduled to run from December 14 to December 16. The full list of participating artists is as follows:Alfred Stieglitz (Canada)Alfred Stieglitz (Canada)Arts Dramatic Corporation (US)Arts of Life (Russia)Arts of Life (Video) (Russia)Art of Life (US)Art of Life (US)Art of Life (US)Art of Life (US)Art of Life (US)Art of Life (US)Art of Life (US)Arts of Life (US)Arts of Life (US)Arts of Life (US)Art of Life (US)Art of Life (US)Art of Life (US)Art of Life (US)Art of Life (US)Arts of Life (US)Art of Life (US)Arts of Life (US)Art of Life (US)Art of Life (US)Art of Life (US)Art of Life (", "The next Biennial should be held in 2020.\n\n\nThe São Paulo Museum of Art (SPAM) is now home to a collection of over 5,800 works by the Brazilian artist Ricardo Verleta, a contemporary of Paul Gauguin. The museum opened its new location, located in the industrial city of São Paulo, Brazil, on October 4, 2020, and will present the exhibition “Ricardo Verleta: A Portrait in Society,” a multi-level installation, curated by the artist, on February 26, 2021.Based in Rome, Verleta created his detailed landscapes and fine-art works in the 1960s. The avant-garde “Ricardo Verleta” series, which spans paintings, sculpture, photography, and video, is heavily influenced by his everyday life and the aesthetic of the 1960s, with the main theme of the show being the “authenticity of things,” according to SPAM director Anna-Sophie Perch. The exhibition will be followed by a series of exhibitions, including “Ricardo Verleta & Bergé art” in 2018, and “Ricardo Verleta: New world”", "The next Biennial should coincide with the reopening of the Museum of Modern Art (MoMA) in New York. The centerpiece of the exhibition will be a panel of international artists, including Yoko Taro, Fumihiko Ono, and Emily Hall, who will narrate a new work by a group of American artists that will be presented by the artist-run space Artadia. The exhibition will also include a special presentation of new works by American artists in collaboration with curator and educator Bruce Nauman, who will serve as a special advisor to the biennial.The exhibition will be organized as follows:Opening Ceremony: Biennial Opening Event on November 24Opening of the exhibition will take place at Artadia.The biennial will also have a special presentation of works by Jennifer Calder, Bob Dylan, Frank Gehry, and Philip Johnson. This will be followed by a public screening of a new work by Jack Whitten, whose work in collaboration with John Bardrop, Richard Diebenkorn, and John Cage will be presented by the artist-run space Artadia.  The full list of participating artists is as follows:Aristide Bottin: The Golden BoughThe Essay-In-Depth (1940)Arch", "The next Biennial should truly reflect the richness of the American landscape, and the exquisite craftsmanship that has been so painstakingly and tirelessly done to express an American vision. I am confident that this year’s Biennial will be a landmark in its own right, heralding the beginning of a new era.”Throughout the decade of its existence, the exhibition has been a platform for underrecognized artists and artists whose work has rarely been seen in the United States. Among the artists whose works are currently on display in the exhibition’s second section, which opened on November 8, are Susana Andujar, Ana Mendieta, and Aïla Almas.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has announced it will begin welcoming visitors back to the institution for an exhibition of work by artists such as Hieronymus Bosch, Harry Callahan, and Andy Warhol, as well as the first American group to perform live in New York: the Documentarians’ Studio Theater. Attendees will be able to enjoy free admission and stay in the museum during the month of October as part of the exhibition “Animals,” curated by Doris Duke; “Jenny and John”", "The next Biennial should be held at the newly renovated O2 Academy of Art, London, in September 2020. The twenty-five-year-old art museum will celebrate the opening of its new building, O2 Academy of Art, with an exhibition of sculptures by the artist Corinna Hazelwood and the exhibition of work by the artist Greg Jagielka.The museum has already received an additional £3 million for the refurbishment of its current location at 7 Oxford Street, near the US Embassy, since the construction of the new building began in 2017. “The museum is now able to move forward with the development of our collection and vision for O2 Academy of Art, offering the opportunity to engage critically with the works in our collection in order to develop a sense of how other artistic spaces and museums can be understood, and continue to thrive,” said Michael Gove, the Culture Secretary. The new venue will also be able to hold twenty-five exhibitions a year, including a retrospective of work by the artist Terry Taylor, a solo exhibition by the artist Kevin Beasley, and a digital exhibition of the work of the artist Ola Hatfield.The new exhibition of Hatfield’s work will be on view in", "The next Biennial should focus on “the history of cinema,” said Van Alen. “It should be about how we use cinema now, and how we will use it in the future, and about how it relates to our lives and how it relates to our societies and how we live.”The biennial will also explore how the biennial is a historical artifact over the course of a single century. Van Alen cited the exhibition “The Black Years” (1949–1953) as a prime example of how the biennial is an ongoing project of the London- and New York-based nonprofit Art Archive, in which new works are added regularly. The opening of “The Black Years” coincided with the opening of artist-designed works by some fifty artists, including Edvard Munch, who created the monumental Retribution (1953), which features over twenty-five thousand bones from the Black Death (1934–1946), and José Malina, who designed “The Night of the Living Dead” (1975).\n\n\nPresident Trump signed a $8.2 trillion federal aid package on Wednesday that will provide billions of dollars in aid to small and", "The next Biennial should be staged in the spring of 2021.\n\n\nThe Springfield Art Museum in Massachusetts has named Bradley Mehler as its new associate curator of modern and contemporary art. Mehler also serves as a curator at the Museum of Contemporary Art in Chicago. He succeeds Barbara Kruger, who retired after fourteen years at the institution in June.“Bradley has an extraordinary track record of success working across disciplines in curating for the museum, and the institution’s staff, with whom he is deeply connected,” said John DeFrancisco, chair of the institution’s board of trustees. “I’m looking forward to working with him and to seeing what he will accomplish in his more than fifteen years as museum director.”\n\n\nThe Independent and the Independent Art Book Fair in London announced today that they will resume the annual event, which was suspended in March due to Covid-19, on Friday, September 9, 2020. The 2019 edition, which concluded on September 6, saw exhibitors include Simon McBurney’s The Princess and the Castle, which was placed in a tie for the crown.This year’s edition, which ran from March to September 9, was hosted at the Royal", "The next Biennial should be announced by the end of this year. \n“I ‘m delighted to be returning to the London site for the first time since the summer of 2018 to further develop the exhibition and to continue its vital contribution to the city,” said Mark Lillis, chief executive of the London Biennial Foundation, which organizes the event. “The exhibition is now at the forefront of a new generation of artmaking. I look forward to continuing the work of the past in the exhibition’s new location, and to hosting the exhibition in its new context, at the London site.” \n\n\nThe Antenna Museum in San Francisco has received a gift of more than 1,500 works by famed artist Paul Gauguin. The foundation, which was established by his widow, Annie, and his daughter, Marie, was given the work Laura Marano’s from the artist’s hometown of Bienville, France, in January. The donation is believed to be the first of its kind for the museum.The gift includes the work in its permanent collection, which has been given to the museum by the Marano family in memory of their mother, Diana. The gift was", "The next Biennial should be held in 2022. The exhibition will feature new works created by artists who do not have similar locations within the city. It is also planning to plan a biennial of musicians and artists that will target a different audience.Commenting on the upcoming events, the festival’s artistic director, Daniela Bickel, said: “We are very excited to implement this new system to support the biennial and will continue to grow the festival’s profile through the exhibition program with our new digital platform, the new online platform and on-site events.”  The first iteration of the biennial, which took place in the city center of Zurich in 2019, ran from January 22 to January 28, 2020.\n\n\nThe National Gallery of Scotland (NPG) is downplaying the impact that the coronavirus (CVC) may have on the institution’s future plans. The museum announced on Monday that it will relocate its major exhibition “The Black Fates” from the art complex it occupies in the city of Ayrshire to the National Museum of Scotland, Edinburgh. The museum’s new home will be built at the intersection of Jaguar and Melton Streets in Edinburgh, and will", "The next Biennial should examine the possible occupation of the museum under the care of the museum’s director, Amandine Bonin; the artist and collector Hélio Oiticica; and representative international groups. The museum also hopes to receive the next installment of the show, “Education for the Future,” in 2020.\n\n\nThe National Arts Museum in Athens has received a gift of twenty-one rare works by artists, including six works by the influential abstract expressionist Georges Seurat, who is buried in Athens’s Pantheon Cemetery, and forty-four works by former museum director Konstantinos Psakas. The gift includes paintings by Aleksandaros Kohno, who painted the famous “Lincoln” in 2002, and two rare works by the late sculptor Anton Gramsci. The works were donated by the Athens-born collector Nikos Efstathiou, who recently completed a major renovation of the museum’s former public space.The museum also recently acquired the work of the Italian architect Bimine Bruguiere, who designed the museum’s headquarters in the city of Thessaloniki, and the work of the Italian painter Andrea G", "The next Biennial should be a meeting of the European Commission and the Asian Biennial, which will be held in December 2020. The latter will be organized in China.\n\n\nArtist/activist and historian Mary Beard, whose life and work was shaped by her devotion to radical politics and her love of philosophy, died on December 5 at age seventy-eight. In a statement released by her family, Beard said: “My father thought I was crazy. I would tell him, ‘I don’t know why you would do this to yourself, but you’re going to hurt yourself. You’re going to hurt your health. You’re going to hurt your career. . . . The damage is done.”Born in London in 1942, Beard grew up in a Marxist household in communist Russia, where she studied in the Soviet University of Economics and was elected to the Soviet Academy of Arts in the early 1950s. In 1955, following a stint at Columbia University, she returned to the East Coast to live with her mother and pursue a career as an artist. In the early 1960s, she began her “Soul of the Motherland” project, a multi-channel installation series that included paintings,", "The next Biennial should take place at the Museum of Minneapolis in 2021. The next iteration will include the work of thirty-five artists and will open in the fall of 2020. The next exhibition, “who’s who’s who? America’s Imagination Machine,” was organized by the Minneapolis-based museum in conjunction with the New York–based artist Ross Bleckner and will inaugurate the museum’s Morrison–Newman Foundation in 2021.“The mission of the museum is to present work by modern and contemporary artists in a contemporary setting,” said museum director Mila Adler. “Our artists are the backbone of our collections and the foundation. Our artists have given us their ideas, their perspectives, their histories, their experiences. We have honored and protected many of these artists through our wonderful collaboration with the Samuel P. Harnwell Foundation and have made their work available on a wide range of platforms. We have tried to promote their work through our exhibitions and through programs. But we have also honored their legacy through our exhibitions and our students.”\n\n\nAmong the works that Samuel R. Delany created while a visiting scholar at the University of Pennsylvania in the early 1960s", "The next Biennial should be held in the fall of 2021. Inaugurating the biennial is the exhibition “Blume & West,” curated by Sophie Blume, which will continue on until March 28, 2022. Inseparable from the almost daily events of the world, Blume & West aims to address the psychological and spiritual concerns of the artist. The show will include works by forty artists, including Pierre-Olivier Gendou, Joel and Gwendolen Dijkstra, Mark Ellington, Sarah Khawchuk, Oui-Oui Hsu, and Olivier-Sasha Karina.Blume & West is organized as part of the fifth edition of the São Paulo Triennale, which runs through March 23. The event will be held at Arena da São Paulo, the São Paulo Arts and Commerce City, and the city of São Paulo.\n\n\nThe Los Angeles County Museum of Art (LACMA) has launched an online petition in an attempt to improve the treatment and accessibility of art works in the institution’s collection by reexamining the holdings through a digital platform that will allow visitors to digitally examine the artworks and galleries�", "The next Biennial should be held in the second half of 2020.   This article has been edited and condensed for clarity and length.\n\n\nDocuments released in connection with the ongoing Israeli-Palestinian conflict in the United States over the years have revealed that in the early 1990s the National Endowment for the Arts (NEA) in Washington DC provided almost $1 billion in grants and loans to thirty-six Palestinian art programs.As the conflict escalated into “Stage 4: The Occupation,” the NEA established the Palestinian Artists’ Program (PAP) in 1993 to support Palestinian artists. The program received $408 million from the Endowment in 2012.Following the Arab Spring, the NEA and the PA were at odds over funding for the PA, which had just established its own branch in Geneva, the International Foundation for the Arts (IFA), but eventually settled on a $112 million grant to the PA’s Bethlehem branch in 2009, the PA’s first major investment in the West Bank in twenty-five years. The IFA, which still operates out of the IFA’s building in the Old City of Bethlehem, received another $55 million from the NEA in 2015, and the", "The next Biennial should focus on the creative aspects of the body, the work of artists, and how biennialists can work with a variety of institutions. The theme should be “architecture as a site of resistance” and the program should aim to prepare the culture for future iterations, which could include works by artists whose work is not currently on display.“This is our moment,” said Edwidge Danticat, director of the Biennial de France. “In this tumultuous moment, when we are confronted by an existential crisis of faith, we must recommit ourselves to the work of the body. We must recommit ourselves to the body’s constant performance as a site of change and resistance. We must recommit ourselves to our own bodies as the focal points of our vision and our own lives. We must recommit ourselves to caring for one another and for the planet. We cannot, however, look to the future, nor can we look to our bodies, but we can look to our bodies as crucial as ever.”The next edition of the Biennial will be held at the Stedelijk Museum in Amsterdam from January 25 to March 5, 2021, and will feature fifty works by forty artists", "The next Biennial should take place in the fall of 2021.\n\n\nFrieze, the United States’s leading arts organization, has announced its participation in the first edition of the Frieze Artist Awards, which will be held on September 22 and September 25 in New York and London.The fair, which has partnered with the Frieze Foundation since 2008, plans to award around $150,000 to artists on September 22. According to the New York Times, the sum is roughly twice the amount made possible through the sale of works through the Frieze Los Angeles Biennial. The program’s inaugural edition, titled “1818,” focused on “autobiographical narratives of artists and their work,” with a particular focus on the work of Hanna Panzo, a German American artist who was active in the early 1900s and who migrated to New York in 1932.In 2018, Frieze canceled the exhibition “1818,” citing its decision to focus on a new digital initiative, “1821,” as the biennial’s theme. The show will now be held at the Public Theater from September 21 to September 26, 2020.Frieze’s 2018 edition was organized", "The next Biennial should be held at the newly established Institute of Contemporary Art (ICA) in Berlin (see map below). The upcoming edition of the annual event, which will take place in September 2020, will be hosted by the Klaus-Dieterich–designed building in the city, which was built in 1986 as part of a redevelopment project in the Kreuzberg district of Berlin.\n\n\nThe Deep Projects Group, which was formed in 2013 by artists and developers in the United Arab Emirates to launch a new generation of cultural hubs in Abu Dhabi, has announced the opening of its first artist-run residency program in Abu Dhabi. The fourteenth edition of the Abu Dhabi Quadrant will run from September 13–September 21, 2020 and will provide artists with free housing and tools to foster their practice. The event will also present a number of special projects, including a retrospective of the work of Elizabeth Peyton and the Art School of Abu Dhabi.“This is a very exciting time to set up residency programs in both Abu Dhabi and Berlin,” said Abu Dhabi-based artist Waseem Farsi, who is organizing a residency at a new urban farm in Abu Dhabi. “How will artists balance their practice and professional lives?"]