["The next Biennial should be held at the new site in 2020. Artforum is also planning to relocate its headquarters from New York to Madrid this summer, and will invest more than $150 million in the city and region. \n\nKurt Vonnegut’s Cat's Cradle, a landmark 1974 article in the Yale University Press, has been acquired by the Hirshhorn Museum and Sculpture Garden. The purchase price was $33.5 million. It will be the first time the full-length, “Cat’s Cradle: From Prehistory to the Twenty-first Century” (2019), a companion volume published by the Smithsonian, was purchased by the same institution.“Cat’s Cradle: From Prehistory to the Twenty-first Century” spanned forty years of Cat’s career and included fourteen essays on the origins of modern architecture, as well as a number of essays on the non-human environment, including Cat’s vision of a civilization without man-made objects, the influence of the cat in Cat’s work, and the relationship between the cat and his work.“Kurt Vonnegut, a towering American modernist whose psychological", "The next Biennial should be held at least twice a year. The exhibition will open at the museum in October and will run until December 2020. The institution has also received a gift of 10,000 Roman letters, written in Latin, from the late collector and philologist Leonardo da Vinci. The letter, which was written in Venetian, was given to the museum by a man who was familiar with the collector and his career. The museum is expecting the donation of a new collection of the artist’s photographs\u0097which are currently housed in the institution’s collection. The work is expected to cost approximately $100,000.\n\n\nConsidered one of the world’s leading contemporary art collectors, Richard Sonnabend, the founder and CEO of the New York–based company Sonnabend, Boyarsch, and his wife, Anne, have donated $10 million to New York’s Museum of Modern Art (MoMA). The gift is the largest gift ever made to the institution and came a year after the launch of the $100 million Richard and Anne Boyarsch and Sons Fund for Modern Art and represents one of the largest gifts ever made to the museum.In addition to", "The next Biennial should focus on the relationship between art and science and reveal new historical and contemporary possibilities. While acknowledging the stability and continuity of the biennial, the work should also reflect the continuous growth and development of the link between art and science in a changing world.”In a statement that was shared by the three judges, Mari Naidoo, curator of Modern Art at the Museum of Modern Art in London, Deborah Topping, and Yvonne Rainer, director of the Tramway Museum in London and a past president of the Art Students Alliance, said: “Although the exhibition will not feature the works of the artists whose work most closely reflect their respective eras, it will highlight how a new kind of collaboration between art and science is emerging. The work will also involve experimental and collaborative practices to investigate the relationship between art and science and be a tool for establishing new, mutually supportive partnerships between the two disciplines.”\n\n\nThe Metropolitan Museum of Art in New York has appointed Stacy Maxwell, who has served as a curator at the museum since 1987, as its next president. In her new role, Maxwell will oversee an organization that has featured work by more than 1,200 artists, including Ralph Moore, Yinka Shonibare,", "The next Biennial should take place in 2021, and the 2023 edition will be held in Guadalajara, Mexico City, and Mexico City, respectively. As the festival approaches its fifteenth anniversary, the organizers have created the Guadalajara Pavilion, which will be inaugurated with a virtual reality installation of the revised exhibition. The pavilion will also feature a new works by the Mexican artist Gustavo de la Peza, whose work will be included in the 2021 edition.  The exhibition will be accompanied by a new two-channel video installation and feature works by 150 artists, including María Berrada, Papa Sosa, Lara Husted, Jaime Muñoz, María Artística, and Cindy Sherman.\n\n\nThe National Gallery in London, which has been closed since October 31 due to the Covid-19 pandemic, is planning to reopen next week, with a full staff of sixty-five. The end of its March tour, which had been scheduled to run next week, has been postponed to April 10. The show, titled Newsies (a.k.a. The Beat), will instead feature a retrospective of", "The next Biennial should be a celebration of the 400th anniversary of the birth of the revolutionary Russian liberal philosopher August Ursel. During the last five years, the exhibition has presented a new work by the artist and essayists of the late nineteenth century, including Vladimir Solovy (2017), Assata Žižek (2014), and Hal Draper (2013).Advancements in technology and the rise of mass culture in the twentieth century have made Ursel a target of the State, but he continued to experiment with new media, government censorship, and art. A classic retrospective in Istanbul in 2006 marked the centenary, but in 2018, the State barred the exhibition from going into “publication.” The curators of the exhibition were fired for their willingness to publicly confront the State’s control of the exhibition.“In the face of the seizure of the exhibition by the authorities, we at the Biennial are mindful of the fact that we were the only ones who managed to preserve the exhibition during the repression, and of the fact that the authorities still refuse to recognize our involvement in the events that took place during the dictatorship of the last five years,” said Mikhail Gulkov, the director of the Biennial and", "The next Biennial should take place in the spring of 2021. The next will be held in the fall of 2021. The biennial will see the work of twenty-three artists, including David H. Watson, Olga Bravo, and Yinka Shonibare, among others from the Asian continent. The inaugural exhibition will take place in the new Rotterdam-designed and built MUSEUM ST. PETERSBURG in North Holland, the former residence of French painter Raymond Boisjoly. The exhibition of Shoemaker’s work, with a selection of works by other artists, will be staged at the new Fons Schleiaman, which is slated to open in the spring of 2022.\n\n\nThe Harvard Art Museums (HAMP) and the New York and London museums are preparing to welcome visitors to their respective locations in the spring of 2021. Located at 875 West Twenty-Third Street in Boston, the new museums will be inaugurated with a tour of the newly reconstructed Henry Art Museum in the summer of 2021. In a press release, HAMP said that the tour, which will take place over seven months, will include “new paintings, new drawings, new sculptures, new installations, and", "The next Biennial should be held in the coming months. Ibrahim Farid, the Director of the Baha'i National Museum, Iran, said: “All our efforts are being directed toward reaching an agreement that will make the museum and the community of Baha ‘Baha’s home. We are hopeful that this initiative will be a success.”\n\n\nThe Museum of Contemporary Art (MoCA), as the world enters what promises to be a pivotal year for art—as millions of Americans attempt to secure work-related income through taxes and benefits and as activists push for new laws to curb budget waste and maximize social welfare programs—has announced that it is launching a new grant program for art museums.The program, which will focus on three themes: “Community, Nature, and the Arts,” will aim to bolster cultural organizations’ ability to attract and retain visitors and will provide $5,000 grants to small to mid-size arts museums across the US. The first round of grants will be given in the coming months. The second wave will be distributed through a lottery system, with $10,000 grants to institutions with 50 or fewer employees. And the last wave will be given out as", "The next Biennial should be held in 2019.The next exhibition should be staged in 2020. The next show should be staged in 2021. The next exhibition should be staged in 2022. The next exhibition should be staged in 2024. The next exhibition should be staged in 2021. The next exhibition should be staged in 2021. The next exhibition should be staged in 2021. The next exhibition should be staged in 2021. The next exhibition should be staged in 2020. The next exhibition should be staged in 2021. The next show should be staged in 2021. The next exhibition should be staged in 2021. The next exhibition should be staged in 2021. The next show should be a history of art event. The next show should be a history of art event. The next show should be a history of art event. The next show should be a history of art event. The next show should be a history of art event. The next show should be a history of art event. The next show should be a history of art event. The next show should be an art museum retrospective. The next show should be an art museum retrospective. The next show should be an art museum retrospective.", "The next Biennial should take place in the United States in 2021.\n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) in Philadelphia is preparing to welcome visitors to its newly renovated museum with a series of public events that will include performances, lectures, and other programming.Curated by Doug Band and Peter Hujar, the exhibition “Wu Shanzhuan: Inventing Life,” will highlight the work of the Chinese American artist and will run through February 22. The series will feature works by forty-six artists, including José Berrada, Adrian Piper, Jean-Michel Basquiat, and John Lennon.The event will also host a virtual exhibition of works by the twenty-four artists chosen for the 2019 Whitney Biennial. The exhibition will feature the work of twenty-five artists, all from the Greater Philadelphia region, including Anna Atkins, Taira Beasley, Nathan Bridget, Andrea Byrd, Diana Hamilton, Catherine Halsey, Julia Heimer, Odd-Eye Gentry, Kiki Smith, John Turk, and Sara Zweig.The biennial will also include the first public tours of the museum,", "The next Biennial should take place in the summer of 2020 and will be hosted by the Museum of Natural History in New York. The theme for the fifty-ninth edition of Art Basel Hong Kong will be “The Teichu” and will encompass indigenous and contemporary art in collaboration with the Chinese artists. The exhibition will consist of 120 works inspired by the Teichu people in China, with an emphasis on the Huai region of Guangdong province in China’s Guangdong province, as well as works by artists such as Yu JianAn and Dong XiaoJi, and will run from March 22 to March 27.The Hong Kong pavilion will host a retrospective of artist-in-residence Rinko Takahashi, which will be held at a venue that will be managed by the Museum of Contemporary Art in Hong Kong in 2020. The exhibition will be organized as follows: 1. The Way of the Artist in Residence, Rinko Takahashi2. The Teichu, Rinko Takahashi3. The Sculptors, Rinko Takahashi4. The Community, Rinko Takahashi5. The Future, Rinko Tak", "The next Biennial should be held in the autumn of 2021. The history of the exhibition is about to be re-written through a new archaeological survey in collaboration with a ground-level design by the artist Anna Wintour, which will be presented in the spring of 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has canceled a major overhaul of its campus in 2021 that would have included the relocation of the museum’s permanent collection to a new building an hour north of the museum. The move was made after an internal survey conducted by director Klaus Biesenbach, who assumed the position in November, found that the redesign needed more contemporary elements and a more contemporary aesthetic.“We are not going to get there with this redesign,” Biesenbach said. “We’re not going to turn our museum into a museum of consumerism. We’re doing some really radical things to make it a museum of art.”Since Biesenbach arrived at the institution in 2015, it has undergone several expansions, the most recent of which launched in 2017 with the construction of a new 12,000-square-foot extension that added a new center for contemporary art, curated by the curator", "The next Biennial should take place in 2021.\n\n\nAnderson Modern Art, located on the second floor of the Museum of Contemporary Art (MoCA), in New York, has appointed Kate McKinnon as its next director. In her new position, which is funded by a gift from David and Charles Anderson, the seventy-four-year-old photographer will assume her responsibilities from curator and art historian Ted Deutsch, who has been a MacArthur Fellow.“Kate is a formidable curator with a proven track record of delivering high-quality work in an open and transparent way,” said David Anderson. “Her work has been collected by the Los Angeles County Museum of Art (LACMA), the Museum of Modern Art (MoMA), the Museum of Modern Art, New York, and the Museum of Contemporary Art (MoCA) in Chicago.”The museum art historian, whose career spans more than thirty years, was appointed to the National Gallery in Washington, DC, also in 2018. In a statement, McKinnon said: “I am honored to join National Gallery and embrace its increasingly important role as an enabling and inspiring platform for contemporary art, and to play a crucial role in shaping its future.”\n\n\nThe Danish contemporary art", "The next Biennial should take place in 2020.Link, which is based in Berlin, is currently working with various partners to create a new platform for exhibition programs, including the Biennial Biennial Berlin and the Triennale di Modena. A new exhibition, titled “Inside the Mind of a Model,” will open on the platform at the Museum of Contemporary Art Berlin in December.\n\n\nIt has been almost two years since the New York–based nonprofit Armory Show staged a show of work by American minimalist painter Edward Kienholz and received more than $50,000 from the auction house on September 1. The proceeds from the sale were split between the artist and Armory Show, which hosts several shows a year.Kienholz’s new exhibition, titled “Energy,” was organized as a collaborative project between Kienholz and his longtime collaborator, the Polish American artist Wojciech Podklet, and is part of an ongoing initiative to focus on design and materials in Kienholz’s work.The dealer acquired the work from Kienholz in 2016 for his collection of works by the late Belgian sculptor Michael Kienholz. Since the artist’s death in 2007", "The next Biennial should be held in the autumn of 2020.\n\n\nSociété des Arts et de Lettres (SAALT) has appointed Emmanuel Galindo as its new director. Galindo comes to the organization from the Musee de l'Art et de l'Haut-Marie-Marie in Paris, where he has served in various roles, including director of the Musee d’Orsay (MOA) between 2001 and 2013. He succeeds Laura De Canti, who was promoted to director of the university in 2015, and will take up the post in September.Galindo has helmed SAALT since 2017, when the institution was still a private organization. During his tenure, he oversaw its expansion to include an international contemporary art museum, established the SAALT art and culture program, and expanded its collection. He also continued developing programs for general audiences, including the upcoming biennial Art in Conversation, which was staged at the Museum of Fine Arts in Boston in April, 2020, and the upcoming biennial National Home Run, which will be held at the American Museum of Natural History in New York in August of 2021.“It has been a pleasure and a joy to work with my colleagues and everyone at", "The next Biennial should take place in the spring of 2021. For the last two years, the organizers have been working with the artist-run, artist-centred institution to develop a unique exhibition that would encompass a wide range of works by the artists featured in the exhibition. The project culminated in the exhibition “Tartar Etiquettes” (2015–16) and the museum’s first-ever online exhibition, “Avant-Garde” (2017). The new exhibition will inaugurate the Biennial on May 24 and will run concurrently with the biennial’s spring/summer 2019 iteration, “Theater of Operations: The War in Afghanistan” (2019–20).\n\n\nThe Pulitzer Prize–winning author of “The Stranger,” a 1980s retelling of the American Civil War, has died at age eighty-eight in the Bronx from breast cancer. William Gaddis was chosen to write the next stage in the author’s expanding body of work. In a letter to Gaddis’s daughter, Patricia, dated March 18, 2016, the author wrote: “The Stranger,” the second volume of my series on the conflict between", "The next Biennial should be in 2020.” The exhibition will be hosted by the Dean of Arts, Art, and Art History, Mark Beasley, and his wife, Anna, along with Kate Crawford, who curated the exhibition’s previous iteration, Art in the Age of Empire, in 2008. \n\n\nThe Far East Fair in Tokyo, which was supposed to take place in the cityscape of Ueno in May 2019, has postponed the event to June 25–June 28. Organizers cited safety concerns as the reason for the postponement. According to the Japan Times, the reasons cited include the pandemic, climate change, and the coronavirus. The organizers cited the pandemic as a reason for the postponement, as Tokyo remains on high alert for the virus.In a statement, the fair said that it will push back the date of the 2019 edition until the end of 2020, and the 2020 edition will be held in June. The fair said that it will announce details about the upcoming edition, which will be held at the same venue, in the coming weeks. \n\n\nThe National Gallery of Art in Washington, DC, has appointed James S. Heckman as its new deputy director for collections and exhibitions. He", "The next Biennial should examine the difficulties posed by old and new masters, and where the future of art lies. ”The invitation, which was first published on the Facebook event page of the New Museum in New York on Thursday, March 27, is part of an initiative to create new conversations about contemporary art through a series of lectures, residencies, and other events that will take place throughout the spring.“We are excited to invite the entire city to the next Biennial,” said Charles Agawill, vice president of the National Gallery of Art. “The idea behind this was to bring together a group of people who really love art and have a sense of humor about it. We hope they will come see the work of everyone in the city, which is very rare these days.”The first Biennial of Painting and Sculpture, which will take place in late April, will present one of the most anticipated shows of the year. The show will examine the relationship between paintings and sculpture and will feature more than sixty artists, including Andre Blanco, Alejandro Campana, Guadalupe Rosales, and Muhammad Ali. The exhibition will run alongside the biennial’s other events, which include", "The next Biennial should be held in 2021, the organisers have said. The 2019 event, titled “Newt in the Making,” is curated by Sara J. Allen and premiered at the Venice Biennale in March. Artforum has reached out to the Art of the Biennale to ask for comment.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is launching a $500,000 fund that will give Los Angeles–area artists $1,000 grants in support of their creative endeavors in the coming months. The program, which will focus on the visual arts, will launch with a series of fellowships that will culminate in a full-time artist residency at the museum, which is currently renovating its former location on Wilshire Boulevard in the heart of the city, in 2020. “In support of artists who sometimes face barriers that extend to their professional lives, we are creating a new program that will ensure that LA’s artists are supported in their professional lives,” said Marlene Larmon, director of the Los Angeles County Museum of Art. “Through the development of a new kind of fellowship, we will help them realize their full potential", "The next Biennial should be considered a crucial step toward achieving this goal.”\n\n\nThe Foundation for Contemporary Art (FCA) in New York announced today that it plans to open a new wing at its headquarters in the Manhattan borough of New York in 2021. The endeavor, which is being spearheaded by architect and FCA board member Marc Straus, has been in the works for more than a year and involves the collection and installation of a new work by artist Mark di Suvero, called The Last Man, which will open in August. The show will feature work by twenty artists, including Stuart A. Hirst, Miguel de Cervino, Alex de la Peña, and Mário Cervino. The exhibition will also introduce a new area for experimental conceptual art, a collection of works by Chilean artist Carmen Otero and Germany’s Nina Schäfer, and will include an exhibition program that will be guided by a new collection of works by the FCA’s artists, including Kiki Smith, Nari Ward, John Zeleznik, and Charles Saville.“FCA is at the forefront of a new kind of mission, a new kind of vision, and the FCA Journeys", "The next Biennial should take place in 2020. \n\n\n\n\n\nElizabeth Hurlock, who served as director of the Hadley Museum in Cambridge, England, from 2011 to 2013, is being sued by the state of Massachusetts for wrongful dismissal over her position.  The dispute stems from an announcement made by Hadley director Emily Prendergast that Hurlock was leaving the institution in March 2017 to pursue new opportunities. The announcement was made amid a controversy over the museum’s closure, which took place over a three-year period and involved the closure of several of the museum’s buildings, an increase in admissions from students, and the relocation of the museum’s permanent collection.Hurlock has since been accused of orchestrating the shuffling of the museum’s collection through the end of 2016, mismanagement of the museum’s endowment, and manipulating visitor expectations. While the charges have been dismissed, the case is being closely watched by other museums and academic institutions across the country as a sign that the cases against museum directors are not isolated to Cambridge.While most of the cases against museum directors involve individuals who have not been charged, a number involve institutions that have already been sued, and a number of cases involve institutions that", "The next Biennial should be a wide-ranging survey of the art of the 20th century. “Art is always evolving, and it has always been a reflection of humanity,” said artist and director Peter Soos. “That being said, we are acutely aware that this is not an easy time to gather the full range of art history in the North — our exhibition program is still on track to be decelerated, and new issues of Art and History will need to be presented in the coming months.”The 13th issue of the biennial is also currently on view through October 30.\n\n\nThe Museum of Jewish Heritage (Museum J.A.I.) in New York has appointed Sanda Hirschhorn as its next director. Hirschhorn comes to the institution from the Jewish Museum in New York, where she has served as deputy director and curator of contemporary art since 2008. She succeeds illustrator Larry Gagosian, who announced he is stepping down after eleven years on March 9, and will assume her responsibilities in April.“In recent years, the Museum of Jewish Heritage has become a model for how curatorial excellence can evolve into an activist project,” Hirschhorn wrote in a statement. “", "The next Biennial should focus on the latest developments in the field, including the exhibition “Intersection of Art and Design,” which is a collaboration with the Museum of Contemporary Art in London and the Rhode Island School of Design. The 2019 event will be held in Luxembourg.\n\n\nBrazilian artist Carlos Garaúde will be featured in the forty-fourth edition of the Ortega y Currens (OCY) Exposition in São Paulo, Brazil, which will be hosted by the Museum of Contemporary Art in Paris in January 2021. The eighty-ninth iteration of the exposition will be held in February 2022.According to the Art Newspaper, the artist was nominated for the 2020 prize in a poll held by the Art Newspaper on December 2. The nine other finalists were Nicole Bigarella, Kate Harff, Joana Saavedra, Ria Maria Varejão, Guaraniya Pérez, and Hugo Vergara. The other stories selected for the exhibition were Nani Módell & Paulo Gomes, a collaboration between Pérez, Garaúde, and Ruben Araujo, a project by the artist for which he created a bronze statue of María América, the", "The next Biennial should be held at the Guggenheim in the year 2021. \n\n\nThe San Francisco Museum of Modern Art (SFMoMA), housed in an old industrial building in downtown San Francisco, has received a donation of twenty-six works by American artist and activist Hillel Albright, who was among the first to protest the museum’s expansion plans.The donation, made by artist Albright and her husband, Don Albright, consisted of works by eighty-four artists, including David Salle, Peter Sellars, Robert Rauschenberg, and Ad Reinhardt, and was made in memory of Jodi Picoult, whose work will be included in the museum’s exhibition “Avant Garde: From Art to Non-Art,” which opened on August 26 and runs through November 13. The artist’s work will also be included in the museum’s permanent collection, which includes works by Thomas Reginald Fletcher, Robert Irwin, Frank Stella, Ed Moses, and many others.The couple also bought ten works by artists who were not represented in the show, including Frank Stella, William Eggleston, and John Sheffield.“Albright’s contributions to the", "The next Biennial should be held in 2022, the same year that the exhibition “Arts and Lifestyle” will open in the United States. Artforum has reached out to the organizers of the festival for comment.\n\n\nThe British Council is rethinking its decision to suspend grants of $2 million to British arts organizations and cultural institutions in response to the ongoing protests against police violence. According to the London Times, the council is looking to revise the guidelines on policing and the use of grant money by eliminating a stipulation that would have allowed the government to cut off funding to institutions—a move that would have severely curtailed arts funding in the UK.Instead, the council is proposing that institutions be given a ten-year phase-in—similar to that of the UK’s National Lottery Corporation (UKL)—to determine whether they are at risk of insolvency. The institute will then determine whether it can continue to financially support the organization through the 2020–2021 fiscal year and will make a recommendation to the government on whether to allow the arts to continue to receive funding for at least twenty-four months.The changes would represent a significant shift for the British government, which has historically supported a number of cultural institutions, including the", "The next Biennial should focus on an analysis of the ways that art and the humanities connect with the realities of everyday life. The first part of the exhibition will take up social movements and the second part will address the history of art and the evolution of the humanities in general.The new exhibition, “Flourishing Art,” will open on Wednesday, January 20, 2020, at the Institution of Contemporary Arts (ICA) in the City of New York and will run until March 21, 2020. The opening of the exhibition will coincide with the opening of the annual Festival of the Contemporary Arts. The twenty-ninth edition of the show is currently on view through February 15.\n\n\nThe Antenna Arts Centre in London has received a major grant of $200,000 from the William and Flora Hewitt Foundation. The £200,000 gift will support the creation of an endowment and will enable Antenna Arts to establish a new endowment for the foundation. The Hewitt Foundation also gave $100,000 to the Wilfred and Mary Hewitt Foundation for the Visual Arts.The Hewitts are giving away one million photographs donated by William and Mary Hewitt to the Antenna Arts Centre. The foundation received the photographs in the form of a", "The next Biennial should be held in the spring of 2021. The first exhibition, “Heroes & Villains,” curated by the Phyllis Crittenden Institute of Art at the University of Washington, Seattle, will open in March 2022. The event will also include a redesign of the National Gallery of Canada’s building to better accommodate the institution’s growing collection of more than two hundred works. In a statement, the National Gallery of Canada said: “We are very excited about the new National Gallery of Canada building and its plans to transform the National Gallery of Art into a museum, research center, and exhibition space. The redesign will provide National Gallery of Canada with an even more exciting and dynamic setting for exhibition-making. The redesigned galleries will be designed to host diverse exhibitions and will offer room for large-scale exhibitions. The redesign also includes new viewing platforms for the National Gallery of Canada’s collection and the National Gallery of Art’s collection of contemporary art. We are confident that this redesign will deliver on the National Gallery of Canada’s promises to be a transformational new National Gallery.”\n\n\nThe Mississippi Center for the Arts (MCFA), in partnership with the city", "The next Biennial should be held in the city in 2021, Saar said. The next edition of the exhibition, scheduled to open in the spring of 2021, will take place in the new Silberhaus (Kunsthalle Basel) in the Kreuzberg district of Berlin, which opened in 2018 and will remain open for the foreseeable future. \n\n\nThe biennial of the African American experience, curated by Naima J. Keith, will stage a special presentation of the work of artists such as Frank Gehry, Frank Gehry, Mark di Suvero, and Ray Dalio in New York City next month. The event is being organized as part of the Biennial: Standing on the Intersection of Race and Design, a partnership with the Brooklyn Museum and the Whitney Museum of American Art.“I’m excited by the prospect of partnering with ‘the museum’ to present an exhibition of these artists’ work in the theater, in the city, and in our communities\u0097this is our chance to show our appreciation and appreciation for those artists who have shaped our contemporary ideas of what a museum can and should be,” said Naima Keith, president and CEO of the National Council of the Blind", "The next Biennial should take place at the Prudence and Maurice Ashley Foundation in Miami Beach. The next event should focus on the construction of an interdisciplinary art-historical scholarship that will challenge the history of art and its development through the lens of classical, modern, and contemporary theory. The biennial will be held at the Allen Institute for Contemporary Art, featuring work by artists such as Barbara DeSousa, Jodi Throckmorton, and Zoe Kazansky. The institution is currently working on a new exhibition that will showcase the work of thirty-five contemporary artists.\n\n\nSuki Pindell, the founder and director of the New York–based contemporary art space Art in the City, has resigned from the position of director of the Brooklyn-based nonprofit, which he had led since 2011.According to the New York Times, Pindell announced in a statement on Friday that he accepted a position at the nonprofit, which he founded in 1994. The organization promotes the work of artists who do not currently have a direct relationship with the city, and receives funding from the city.Since its founding, the nonprofit has hosted artists such as Joël and Julie Squier, Bruce Nauman, and Alice Aycock,", "The next Biennial should be held at the Museum of Contemporary Art, Mumbai, in March 2020. \n\n\nThe Bechta Group has announced that Mira-Miri Bechta has resigned from her position as director of the J. Paul Getty Museum in Los Angeles and will be replaced by Amy Porter. In the new position, which was created in January 2019, Bechta will serve as a liaison between the Museum and the Los Angeles County Department of Public Works. “Mira-Miri was a visionary leader who has made significant contributions to the Museum’s development as an institution,” said Bechta. “Her leadership at the Museum was the reason we are able to present the Museum in Los Angeles. After a decade as director, she will continue to serve as a strong and trusted member of the curatorial team and board of trustees. I thank her for her service and wish her the best.”Prior to joining the Museum in 2015, Bechta served as assistant curator of modern and contemporary art at the Los Angeles County Museum of Art (LACMA). She also worked as a curatorial consultant for the Museum and helped organize “The Desert Trip: The Art of Untangling,", "The next Biennial should also mark the centenary of the institution’s founding, of which Araya is a founding member. The ten artists whose works were selected for the exhibition were Rocko Motsu, Alberto Berrio, Eleanor Clift, Martin Chiu, Keiichiro Oda, Peter Sze, Yoshitomo Shiraishi, Andrea Haiduk, and Sarah Sze. The fifty-six-year-old Japanese artist Kiyotaka Miyamoto will also be featured in the exhibition, titled “Yoshitomo Shiraishi: Light and Color.” The full list of participating artists is as follows: 1954–59    Noguchi/Taddeo Art Museum (Italy): New Works 12,1955–56    Noguchi/Taddeo Art Museum (Italy): New Works 12,1957–62 (with Karlheinische Kunstverein Stuttgart)\n\nThe Museo de Arte Contemporáneo, Mexico City, has appointed Carlos Eduardo Ribas as its next director. He will take up the post in April.", "The next Biennial should focus on the role of the Black Lives Matter movement in advancing justice for marginalized communities, and should also reflect on the history of African American art and its representation in the art world. However, in the interim, the museum will work with local, state, and federal governments to present a diverse array of works for the event, including works by artists of color, including Jalil Australia, Allen Ellsworth, and Adore Delano. The museum will also receive $100,000 from the Crown Fund for the Arts to manage events in London, and will lend more than one-hundred works from the Black Lives Matter collection.The opening of the biennial, curated by Kate Spilman, is set to take place in London on March 5–March 7, 2020.\n\n\nJames Foley and Steven Sotloff, two American journalists who were held hostage by the Islamic State for nearly nine months, were released safely in Jordan on Tuesday, Artnet reports. They were released in the United Arab Emirates, where they were staying in a hotel near the city of Ain al-Arab, in the desert region of Al-Ula, on the outskirts of Anbar Province in western Iraq.After eight months held", "The next Biennial should take place in 2020. According to Artnet, the popular art museum in Tokyo is planning to hold the first exhibition in the new venue in 2021. The venue is located in a former Kansai Electric Power Plant, and is being organized by the Tokyo University of the Arts (TU) in collaboration with the Tohoku University of the Arts, which is housed in the old National Museum of Fine Arts in Tokyo.The new venue will offer visitors an unparalleled experience, both physically and intellectually, with a view of the Tohoku region, where the museum’s new display of work by Kiki Smith, an early twentieth-century Japanese painter, will be situated. The exhibition will include works by artists such as Ingvild Rintoul, Helen Frank, and Berenice Abbott. The design of the exhibition space will be inspired by the natural surroundings.The Tohoku University of Art will house the exhibition alongside the current collection, which is on display in the newly opened Central Museum of Art (CMA), on the campus of the Tohoku University of Science and Technology (TU) in Ginowan, Japan. The museum will be part of the Tohoku Region City Center, which is home to three", "The next Biennial should aim to be a “portrait of the artist” of the artist, rather than a “portrait of the viewer.”The 2020 edition of the Biennale will take place at the Venice Architecture Biennale in Venice; it will premiere the work of the contemporary artist Hélio Oiticica. The MCH Group, which owns the Tate, is also working to raise around $1 billion for the restoration of the Tate’s holdings of Greek and Roman mythological figures. The Tate’s board of trustees will announce the future of the Tate Artist’s programme at an event on November 2.\n\n\nThe exhibition “Unfinished Business: Art and the Politics of Visuality,” which is currently on view at the Hammer Museum in Los Angeles for nine days, will return to New York in January 2020. The exhibition will also feature a retrospective of contemporary art directed by Leslie Ann Warren and curated by Robert Frank. The expansive exhibition will often give the public a glimpse into the visionary thinking and aesthetic practices of artists and will present the work of twenty-six artists in the exhibition.The theme of the new exhibition “Beauty and the Beast” is a portrait", "The next Biennial should feature: An exploration of the history and the texts of the constructivist movement and its construction of an imaginary world of symbols; a critical examination of the history of language and its relation to the natural world.” The first section of an upcoming exhibition of work by the Swiss artist Thomas Alès, “Intermission,” will open at the MCH Museum in the Swiss city of Basel in the fall of 2020. The event will include a performance by Alès, the artist-in-residence Ingrid Aagaard, and the MCH Museum staff in a collaboration with the artist-in-residence Jodi-Lee Burke.\n\n\nThe Kuala Lumpur Biennale Foundation (KLBF), Malaysia, announced that after a preliminary review of its new strategy, which was released on April 7, the organization will no longer attempt to commission or organize new works, and will shift to a free, community-based program, which will focus on the artistic process and not the production of art.“KLBF’s new strategy, announced today, is aligned with the recommendations of the newly appointed Malaysia’s Arts, Culture, and Communications Minister, Tan Sri Anwar Ibrahim,", "The next Biennial should take place in 2019. The next one will take place in 2023. The next one will take place in 2028. The next one will take place in 2026. The next one will take place in 2028. And for those who have any doubt about whether staging the exhibition in 2022 is in the best interests of the arts, the Swiss Federal Office of Art and Culture announced on Tuesday that they are now expecting around three hundred visitors to the exhibition. That is eight times as many as the exhibition was planning to hold.The exhibition will be moved from the Museum of Modern Art, known for its contentious reopening of the year before, to the Stedelijk Museum, in Amsterdam, where it will be held for twenty-four hours every day of the year. The Swiss Federal Office of Art and Culture finished its analysis of the exhibition in early September, and in a statement issued on Tuesday, the institution said: [We] are in touch with the artists to discuss the possibility of creating a new exhibition for the 2017 event. The artists are currently discussing it in the context of the upcoming session, which has been postponed from March to August. \n\n\nThe Royal Academy of Arts (RA)", "The next Biennial should take place in 2019.\n\n\nFabian Rührl, the curator and founder of the Klagenfurt-based nonprofit that runs the prestigious exhibition space the Klagenfurt Biennial, has announced that he is leaving the institution in the spring of 2020 to assume the role of director of the Klagenfurt Collection, which will hold its seventy-second edition, “Assemble zur Kunstbau,” in March 2021. He will continue to be involved with the collection as he continues his academic and curatorial projects in Germany and the United States.“Fabian is an enthusiastic and dedicated curator and educator, who has made a great contribution to the Klagenfurt Collection over the last seventeen years,” said Klaus Schierl, Klagenfurt’s director. “He is a visionary and highly talented leader who has demonstrated his ability in transforming the Klagenfurt Collection into a major international institution. He has been instrumental in bringing together a group of artists who will have an important role in the next edition of Klagenfurt’s Assemble zur Kunstbau in March 2021. His exceptional work will be deeply missed by all who knew him and will inspire our artists, cur", "The next Biennial should take place in the Spring of 2020. The 2019 edition, titled Solstice (Theos), was held at the end of June and the first Biennial to feature a female artist was held in the Spring of 2021. \n\n\nAs the first major exhibition of New York’s new Yuz Museum of Contemporary Art (Yuz) opens this week, the museum will unveil a new program devoted to women artists. Called “Women Artists in the Studio,” the nine-month retrospective will feature work by thirty-three women artists, including Agnes Martin, Angela Pérez-Martin, and Cosmin Costantino, and will be staged in conjunction with the first-ever Yuz Museum Open Studio, an initiative launched by the Museum of Modern Art.The program will also introduce a new dance and performance format. The new format will incorporate a new fifteen-minute piece paired with a live performance by the women artists selected for the first-run exhibition. While all thirty-one works will be presented in the exhibition, the women artists participating in the program will be different, and the pieces will have a greater range of cultural and public engagement. Commenting on the initiative, director Justin Vaisman", "The next Biennial should take place in 2021 and will be hosted by the Museum of Fine Arts, Boston, and will be led by director Michael Mainelli. The twenty-seventh edition of the prestigious art fair will be held at the Museum of Fine Arts, Boston from March 19 through March 22, 2020.The full list of participating artists is as follows: Changeling Gates/Away From The Real, New York, NYMuseum of Modern Art, New York, NYMuseum of Modern Art, New York, NYMuseum of Modern Art, New York, NYMuseum of Modern Art, New York, NYMuseum of Modern Art, New York, NYMuseum of Art, New York, NYMuseum of Art, New York, NYMuseum of Art, New York, NYMuseum of Art, New York, NYMuseum of Art, New York, NYMuseum of Art, New York, NYMuseum of Art, New York, NYMuseum of Art, New York, NYMuseum of Art, New York, NYMuseum of Art, New York, NYMuseum of Art, New York, NYMuseum of Art, New York, NYMuseum of Art, New York", "The next Biennial should be held in Helsinki in December 2020. \n\nOrganizers of the upcoming edition of Art Basel (AB) in Hong Kong said that the relocation of the Hong Kong fair from its original location in the Korean city of Hangzhou to its new headquarters in the trendy West Bund Art District in Kowloon, Hong Kong, has enabled the fair to increase its exhibition programming in the area. “The brand, which has been very active in Asia, has benefitted from the rapid growth of the art and design sectors in Hong Kong and is excited to host the Hong Kong art fair at a newly renovated Hong Kong Fair in January 2021,” said Matt Carde, the executive director of AB Hong Kong and its Asia director.The fair will be held in Shanghai from March 21 to March 25, 2020, and will include twenty galleries, including a number represented by Chinese artists and designers, as well as a number showcasing new international artists. The new venue, which will boast a capacity of 8,500 visitors, will be inaugurated by a preview day exhibition of works by Brazilian artist Claro de Sousa, who is known for his conceptual projects, in March 2020. In a bid to give visitors more flexibility, the", "The next Biennial should focus on understanding how gender roles continue to shape and shape our world, and how they are communicated through the lives and institutions of all our curators. We should also be reflecting on the ways in which gender and sexuality have come to be seen as separate, interlocking, and overlapping. We mustn't forget the ways in which gender roles are still practiced in different cultures, and in different societies and cultures. We mustn't forget the ways in which gender and sexuality continue to shape and shape our lives and the lives of future generations.” \n\n\nThe Art Newspaper has revealed that the first Biennial of the United Kingdom’s National Poetry Library (NBPL) will be held at Kensington Palace in October 2020. The event will be hosted by the National Poetry Library, the National Poetry Sculpture Garden, and the Museum of Britain.“The National Poetry Library is a unique collection of more than 4,500 works by leading British poets,” said Simon Letch, director of the National Poetry Sculpture Garden. “The collection, which includes works by David Adjay, David Barlow, Lawrence Ferling, Ed and Edna Burns, Fergus McCann", "The next Biennial should take place in 2020. The new context should provide a new possibility of dialogue and collaboration between art institutions and the people of New York. The Biennial will be an ongoing project of the Museum of Modern Art. \n\n\nThe Guardian announced today that artist-in-residence Hernán Díaz-Villar, who has served as the program’s cochair since 2014, will be replaced this autumn by Peter Wilt, who has served as the program’s director since 2008.Villa is currently a graduate student at the School of the Art Institute of Chicago. He represents Mexico in the upcoming Art Paris, and will return to Mexico City in March 2020 to begin the biennial’s second phase. Wilt will be based in Mexico City throughout the biennial’s duration, completing a yearlong residency program.“The Guardian is delighted to have Hernán Díaz-Villar and Peter Wilt as cochairs of the upcoming BIRTH. Together they made an indelible mark on the biennial’s artistic legacy, and we look forward to continuing to build upon this legacy through a series of exhibitions, residencies, programs, and international collaborations", "The next Biennial should take place in the spring of 2021, with a similar collection as the inaugural, with the same exhibition format. There will also be a second edition of the exhibition, titled The Silence of the World, in the fall of 2021. The first exhibition was created by French artist Thierry Baillie, who is also the founder and director of the Thierry Baillie Foundation, and is scheduled for September 2021. The second exhibition will be dedicated to Artist-Activists: September 2020–October 2021, and will be hosted by the Labyrinth Museum in London. It will also feature more than twenty portraits of Nadine Chedid and Léa Seay. The 2019 edition was inspired by the US artist Ken Russell, whose installation The Pattern of Motion was penned for the first time in the United States by the Pittsburgh-based artist Laura Mulvey. The exhibition, which is on view through October 28, was curated by artist Adam D. Korher and artist-activists including H. Lee Evans, J. Patrick J. McDonnell, Ruth Hunter, and R. Jones. The 2019 exhibition also featured", "The next Biennial should not be held in 2021 but will be held in 2022, the Arts Minister, Maria Troika, said. “We are not there yet, but we are there, and I’m confident that we will be,” she added. The organizers of the exhibition, which is centered on the American artist Leonard Cohen, have introduced a new series of exhibitions, including “Leonard Cohen: One (Long) Live ” (2019), which will run in this year’s edition, and “Transformations: From Objects to People” (2019), which will highlight new exhibitions that will celebrate the legacy of the late feminist artist Gloria Steinem.Other events this year include “Hands Across America: A Celebration of the Visual Arts” (2019), which will feature work by artists whose work is in the exhibition, and “American Art, 1960–1954” (2019), an exhibition that will feature thirty contemporary works by twenty-four artists from the Americas.\n\n\nThe Israeli artist, who was imprisoned for more than a year in Israeli jails for his involvement in the ongoing work stoppage, has won the Prix d’Art Contemporain (PA", "The next Biennial should be held in 2020, but the organizers are still working to determine the date. The 2019 event was held on September 13–20, 2019.\n\n\nThe Baltimore Museum of Art (BMA) has launched an initiative to support the creative and academic communities impacted by Hurricane Irma. In early October, the institution launched a series of digital initiatives designed to provide free, weekly public programming that can be accessed by anyone in the city. “This week’s Digital Curatorial Radicals project is a leader in this regard, as we worked closely with academics, artists, and students to develop a platform for their curatorial work in a timely and curated way,” said Michael Govan, director of the BMA. The initiative, which launched on October 9, features twenty artists and scholars, including Ryan Mathews, Nia Room, and Max Hetzler, among others, working together in an attempt to provide a platform for the BMA’s exhibition program.“The project is not without its challenges and elements of collaboration with the academic community, but the end result is that this week’s Digital Curatorial Radicals project is a leader in this regard, as we worked closely", "The next Biennial should be held at the Jidgong Museum of Art in Shanghai, the National Museum of Fine Arts in Beijing, and the Art Museum of China in Nanjing. The next edition of the Beijing Architecture Biennale is scheduled to take place in 2022.\n\n\nKatherine Mulle, the pioneering American artist whose translucent 3-D printed sculptures address perceived injustices, were commissioned for the opening of a new exhibition at the Museum of Fine Arts (MFA) in Boston. Titled Art in Perspective, the exhibition will feature artworks that examine the origins of perception in relation to the coming era, as well as works that address the questions of how art can be a tool for social change and how a single, unifying phenomenon can shape the very fabric of our world.“The new exhibition is a way to honor the curators, the curators’ work, and the achievements of Katherine Mulle,” said John Amedore, the museum’s director. “We knew that in the next few years MFA would be a major museum of art in Boston, and the show would engage with that history in a way that was meaningful and that would engage with the themes of the curators�", "The next Biennial should be in 2022. \n\n\nThe Metropolitan Museum of Art in New York has announced that it is preparing to welcome visitors back to the museum once operating restrictions are lifted. According to the New York Times, the institution will start welcoming visitors again on Monday, December 16. \n\n\nThe Art Newspaper has published an in-depth profile of Argentine director Juan Antonio Bayona, who has helmed the Museo de Arte Contemporáneo in Buenos Aires since 1989, and which has been described as a modern-day version of the Museo de Arte de Buenos Aires.Dubbed the 'Museum of Cultures, Urbanization, and Evolution,' the institution is in the process of reconfiguring its collection, which comprises more than four hundred galleries as well as eighty-five replicas of surviving works by the artists whose work is housed in its archives.“The Museum of Cultures is a living entity, a memorial to the cultural history of the city where it was founded in 1988,” said Bayona. “Its programs reflect the priorities of our city: to preserve and present the collections of the past, and to develop the collections of the future.”Prior to joining the Museo de", "The next Biennial should take place in 2022, at the Frankfurt Art Museum, and will invite the next generation of artists to the city. Its collection, which is currently housed in the Palazzo delle Papesse, will also open in the same building in 2020.\n\n\nThe Metropolitan Museum of Art in New York has appointed Deborah Flack, a curator and art historian, as its next president. Flack comes to the institution from the Museum of Modern Art (MoMA), where she has served as director of exhibitions since 2012. During her tenure, she curated “Contemporary Art: Architecture and Design” (2017), “Art in the Garden: The Art of Asti” (2019), and “The Color of Madness: The Color and Meaning of Art” (2013). She also worked as a curator at the Museum of Contemporary Art, New York (MoCA), Los Angeles (MoCA), and the Museum of Modern Art, Houston (MoMOA), as well as a freelance curator.Commenting on her new role, Flack said: “I’m honored to have been selected to lead the Met, a museum whose history has included more than three hundred years of organizing and presenting world-", "The next Biennial should be held at least once a year. The following year, the museum will hold two exhibitions: “Adeline and the World,” a presentation of works by artists such as Édouard Vuillard, and “Adeline and the Rabbits,” a selection of items by Constantin Brancusi. The museum will also be creating the first biennial program for the museum, which will showcase a selection of the works of selected artists from the collection. The first exhibition will take place in the spring of 2020.\n\n\nThe Art Newspaper reports that the US House of Representatives voted yesterday to establish a new national museum of African art in the United States. Introduced last year by New York representative Frederica Wilson, the bill to create the museum, dubbed the African American Art Museum (AAM), requires that twenty-five percent of the museum’s funding be derived from the federal government’s Black Power, program, while twenty-seven percent of its funding come from grants and other sources.“There are a number of African American arts and cultural institutions that are struggling to maintain their cultural identities and continue to present compelling narratives, and that are struggling right now more than ever,�", "The next Biennial should focus on the question “How can a festival of social justice, centered around art, promote social change?” The event will be organized in collaboration with local communities, and will feature over twenty works by seventy-five contemporary artists, including Aliya Farid, Zina Saro-Wiwa, and Josie Weil.The next edition of the Biennial will be held at the West Bank City of Nablus from January 17 to January 20, 2020. The exhibition will be held at the Nablus Art Museum, which was forced to close due to the coronavirus pandemic, and will also feature works by Pia Camil, Hisham al-Hashemi, Kader Attia, and Mohamed Aliyeh.The 2020 event will draw 250,000 visitors from twenty-six countries and will also include a meditation pavilion, art installation, a live performance, and a book signing. The Pavilion will be inaugurated by a project by radical Tunisian artist Salah Abdeslam, whose work examines the paradoxes of Arab nationalism and the ideology of the flag of Islam, and will culminate in an interactive performance by the United Arab Emirates, which will stage a show titled “The", "The next Biennial should be held in 2022 and will consist of six exhibitions.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that the institution will be renamed in honor of the 50th anniversary of the California Institute of Technology (Caltech), the birthplace of American computer science, and expressed its gratitude to the city of Los Angeles and the Los Angeles County Metropolitan Council for their consideration of the proposal. The grand opening of the new museum will be on September 17, 2022.“The purpose of the new museum is to draw attention to the history of the California Institute of Technology,” said director Betty Bruno. “We are grateful to the city of Los Angeles and the County for their thoughtful and committed leadership in supporting the museum’s design and construction. We hope that the new museum will be a powerful catalyst for future conversation and reflection about the history and future of California science and technology.”The new museum will feature an exhibition hall, a lecture hall, and numerous other spaces designed by the architect Gabriel Arti and designed by Sate Architects, who won the first Architecture Biennial in Los Angeles last year. The project team included Newton Akai, who designed the new building for the institute’s new campus", "The next Biennial should be held in 2020, and the last in 2021. The institution’s board of directors, which represents the directors of the museum, has decided to postpone the event, which is one of the longest-running events in the institution’s history. For the last two years, the group has been working with selected artists to create a new exhibition in collaboration with the museum. The initiative, which was launched in the Long Island City neighborhood of New York, has taken years to develop, and it typically features a minimum of fifteen artists in a show.The thirty-six-person panel, which is made up of Martha Graham, curator of contemporary art; Adam Gopnik, director of the Museum of Contemporary Art, Los Angeles; and the artist Hoa Nguyen, is responsible for choosing the thirty-five artists to represent the biennial. The majority of the artists are selected from a pool of eighty applicants, but the selection committee “can vote to remove one artist from the gallery’s roster if they deem the selection unworthy.” The announcement of the artists’ participation in the exhibition was made on February 5, the same day the exhibition opened at the Museum of Contemporary Art.\n\n\nPrime Minister Boris Johnson", "The next Biennial should focus on “language and diversity” and will not exclude anyone, but will focus on using the exhibition as a platform to develop new works.\n\n\nThe Victorian Art Museum in Melbourne has received a gift of eighty works by Victorians. The donation includes works by a variety of artists, including Robert Irwin, Alfred Kruger, Jane Fogg, and Jean-Michel Basquiat. The works were included in a deal made between the museum and the artist, who was active in both Australia and New Zealand, as part of his major retrospective, “Island of Rust: American Art and Modernism” at the Victorian Art Museum in 2019.The works, which include an exhibition of works by artists such as Jim Burns, Jocelyn Franklin, Anne Grant, Rosemary Maria Huelskamp, and Lee Krasner, were donated by painter and collector Robert Irwin. Irwin, who has been interested in the museum for more than twenty years, first donated the works to the museum in the 1970s. In 2015, the institution received the work of the Australian sculptor Bob Hunter, who works in metal and bronze, and in 2017, the works were included in the inaugural 2018 edition of “Joe Armstrong:", "The next Biennial should take place in the spring of 2021. The 2020 edition will be held at the Centre Pompidou in Paris.\n\n\nLos Angeles’s Cultural Arts Center (CAFC) has received a $10 million donation from philanthropists Bill and Melinda Gates. The $10 million gift was made in support of the Arts and Culture Fund, which supports nonprofits working in and around Los Angeles.The gift also extends an earlier $5 million gift made in 2017. When Helen and James, a longtime supporters of the CAFC, were asked about their plans for the arts center in 2017, they said that “the future of the arts and culture center in Los Angeles lies with the arts and culture.” Helen and James stressed that the gift does not preclude them from continuing their philanthropic efforts to make the arts accessible to the public.“We are truly honored to receive this remarkable gift to support the mission of the CAFC,” said Andrew W. Mellon, the Gates patriarch. “The arts and culture center is a vital and growing part of the cultural landscape of Southern California, and we are thrilled to support it with this wonderful $5 million gift.”The grants will allow the CAFC to", "The next Biennial should be in September 2020. “The United Kingdom is facing a challenge of unprecedented scale and complexity,” said producer Isabel Oudoh. “This means that the creative economy and the creative landscape will be beset by new threats and vulnerabilities, and that we will need to adapt our programmes and our operationalities to cope. We will need to think through new ways to support and inspire, and re-think how we work, live, and create. The next Biennial will have to do that.”\n\n\nThe Arts Council England (ACE) has announced that it will begin a three-year 'phase-out' of funding to the British Film Institute (BFI). As part of its ongoing work to improve the lives and health of people living with HIV/AIDS across the UK, the organization’s board has decided to split the £8 million remaining from the BFI’s annual grants into seven grants totaling £12 million. The grants were initially made by the BFI in support of the Institute’s annual Film and Television Festival, which has since been moved to the autumn, and were originally slated to run until 2022. However, a change.org petition launched by fans of the award", "The next Biennial should aim to institute a deep and detailed social and political critique of contemporary art, and to present the work of contemporary artists in a plural, interdisciplinary, and cross-disciplinary fashion. “The next Biennial should aim to institute a deep and detailed social and political critique of contemporary art, and to present the work of contemporary artists in a plural, interdisciplinary, and cross-disciplinary fashion.” More information about the award can be found on the museum’s website.\n\n\nThe United Kingdom has announced that it is preparing to leave the European Union, following months of negotiations that have seen ministers agree to reshape the country’s Brexit bill, which will enter into force in March 2020, and is now negotiating a new trade deal. The negotiations have been ongoing since March and have been referred to the European Court of Justice (ECJ), which has jurisdiction over UK-EU relations, as well as to the House of Lords, the House of Commons, and the House of Commons Standing Committee on the Economy and Small Business.According to The Guardian, Britain’s negotiating team estimates that it has until March 23 to meet its EU demands, and that a deal will be reached by June 1. The government has already", "The next Biennial should be held in January 2021. In the meantime, the collective will continue its work on the exhibition process, which is currently ongoing, and plans to introduce a new series of lectures, performances, and exhibitions that will engage with the themes of the exhibition, which are “influence and change.”The current exhibition, “Art and Vegetation,” was organized and curated by Kunsthalle Basel in collaboration with the artist-run museum in the city of Basel, and was presented at the inaugural event, “Art in the Age of Mechanical Reproduction,” in December 2018. The exhibition toured the United States and Europe and is currently on view in the United Kingdom.\n\n\nThe National Galleries of Scotland announced today that the institution will receive $1.2 billion in federal funding to help it prepare for the possibility of a financial meltdown if no action is taken to prevent the UK’s economy from sliding into a recession. The announcement follows a number of dire warnings from the global investment bank Standard & Poor’s that the UK’s economy is sliding into a recession—on Wednesday, the bank cut its growth forecasts for the coming six months, and on Friday, it lowered its", "The next Biennial should take place at a location that has a permanent dedicated exhibition space in 2020. “I am convinced that we have to create new connections between our lives and the natural world,” said local architect Tony Rickey of the new venue. Rickey is one of a number of architects and urban planners who have advocated for the installation in the Coachella Valley, California, of temporary public artworks. He noted that the current exhibition venue is unsustainable due to its seasonal short-term demands and was concerned that the event would be displaced by an adjacent construction project. “The solution is to create a new space for life and work in cities,” Rickey said, “and to find new ways to organize exhibitions and performances.”The new venue will be located in the former site of the former Crystal City amusement park, adjacent to the Palisades, and will serve as a platform for the exhibition of work by contemporary artists. The Tenement Museum of Art in Queens, New York, is currently developing a new boardwalk that will include a public plaza that will allow visitors to stroll through an exhibition space that will be modeled after the Eiffel Tower. The pavilion, which will sit between", "The next Biennial should take place in late-January 2019. The final event, “All in the Family,” will be held at the Museum of Contemporary Art in Chicago (MoCA) in December 2020.\n\n\nThe Museum and the Gardens of Fine Arts (MFA) in Boston has welcomed artist-in-residence Ridván Pérez-Santiago to its collection. Pérez-Santiago, whose practice encompasses the depictions of family life and social structure as well as abstraction and the performance, painting, photography, and sculpture of social and cultural practices, will develop an installation entitled Playtime, 2019 which will activate and form a narrative of the last year of his life, in conjunction with the curators and fellow artists who have joined the collection.“Ridván has exhibited his work across disciplines and venues in the United States, Mexico, and Mexico City, and is currently represented by the Museum of Fine Arts, Boston. His work has been exhibited at the Foundation Workshop, Mexico City; the Museum of Contemporary Art, Albuquerque; and Modern Art, New York.”During an interview with Artnet, Pérez-Santiago said: “I am very excited to collaborate with the", "The next Biennial should be held in 2021 and will be curated by Heng Che-Man, director of the Special Collections, Wangan.\n\n\nThe Museum of Fine Arts (MFA) in Boston, Massachusetts, has appointed Mabel Landreth as its inaugural director. Landreth will be responsible for managing the museum’s annual March for Life event, which has since been moved to the annual March for Science, and coordinate programming in conjunction with the museum’s curators.“Museumgoers expect and deserve a visual record of the museum’s collection and exhibitions, and MFA is uniquely positioned to deliver,” said MFA director Daniel H. Weiss. “We look forward to working with MFA to strengthen and extend the museum’s engagement with the exciting work of the mind and body and to enrich the extraordinary world of art.” During her tenure at the institution, Landreth will direct the inaugural exhibition “Toward a New Science: Photography, Life, and the Body” (March 19–March 21); the first exhibition focused on the biennial’s first fifty years; and a lecture series on photography and life.During her tenure at the museum, Landreth has worked", "The next Biennial should be held in the year 2020. The institution has been working with a design and construction firm to establish a permanent home for the exhibition, which will take up the theme “Civilization after the Fall,” and will announce the full details of the exhibition, which will run across eight biennials, in the coming months.\n\n\nArchitecture and Design Magazine has released its list of the seventy-six artists who will receive the prestigious Grand Prize this year. The forty-nine-year-old institution, which is supported by a group of philanthropists and artists in connection with the grand prize, is releasing the artists’ work online in an effort to increase accessibility and diversity in the field.“The Grand Prize is a celebration of the first twenty-five years of the award’s history, in which sixty-five artists were recognized including Alejandra Alves, Phyllis Black, Eileen B. Cooper, Carl Perkins, Philip Glass, Michael Jordan, Lars Von Bengt, and John F. Kennedy, Jr., among many others,” said Karyn M. Naftali, the magazine’s cofounder and editor in chief. “The magazine’s artists", "The next Biennial should begin in late April. It will present a selection of works by twenty-one artists and other artists who have been selected together for the 2019 edition, which will open in May.The first round of artists chosen were Alessandro Catellani, Mario Balaguer, Marcel Prouvé, and Alexander Calder. The next round will be held in early May and will be in the Italian capital. The exhibition will run for thirty-two days, from March 28 to March 31. The theme of the exhibition is “Settled: Art and the Late Middle Ages.” The biennial will also include a presentation of the work of the artist-in-residence, Andrea Pinturro, and a selection of works by the artist-in-recepst, Fernando Amorosa.The 16 artists who will participate in the biennial for the first time are Giulio Cattelan, Dario Cattelan, Leonardo Cattelan, Sara Cattelan, Laura Capozzi, Carlo Cattelan, Adriana Catellani, Carlo Caudovino, ", "The next Biennial should take place in 2019. The German government is also planning to spend $US4 billion ($5.2 billion) on its largest arts initiative, the Art for Life initiative, which will aim to draw an additional 120 million people to the country’s outdoor events by 2020. According to the German weekly Süddeutsche Zeitung, the funding will be divided among twelve cultural institutions: the Anhaltungswissenschaft (Art and Culture Ministry), the Kulturbeschichte (Kunsthalle München), the Neue Biennial (Berlin Berlin Club), the König Abstraktionhaus (Kunsthalle Kunstbau), the Museum für Kunst (M.A. Kunst), and the Museum für Kunst.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) has released guidelines for how art workers and cultural organizations can avoid layoffs when the center closes in the spring of 2022. Under the terms of a five-year $3.5 billion deal that also involves the museum’s relocation, the institution’s board of trustees has agreed to reduce the size of its museum by 20 percent,", "The next Biennial should focus on the history of the institution, which has been the site of several major high-profile events, including the 1966 Gardner-Dawson, the 2016 Made in LA Biennial, and the 2015 Art Museum Miami. In addition, the pavilion should showcase the exhibition “Roz Pinto: Between the World and Me.” The show, which is currently on view through January 27, will also include “Tolga Estévez: Traces of a Dream” and “Alice Abney: Easter Island” and will feature works by seventy-five artists. The first edition of the biennial will be held in the pavilion from March 18 to March 21, 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has hired Sam Williams, the founding artist and curator of the Manhattan–based experimental arts collective Future Farmers of Color (FGC), as its new assistant curator of European art and design. Williams joins the institution from the Getty’s Los Angeles branch, where he has served as a curatorial consultant since 2015. Previously, he worked at the Museum of Modern Art, where he currently serves as head of the exhibition program.“Sam is a talented", "The next Biennial should focus on feminist critiques of radical art history, the humanities, and the social sciences; on the ruptures caused by the colonial regimes; and on the histories of the Americas. Its next edition will focus on “Latin American feminism”, with a particular reference to Arizona. \n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has appointed Kate McFarland as its next director and chief curator. McFarland comes to the institution from the Metropolitan Museum of Art, where she currently serves as associate curator of modern and contemporary art. She takes the helm from Carrie Sadler, who has helmed the museum since 2007, and will begin in her new role on January 19.“Kate’s expertise and commitment to the institution, as well as her decades of experience leading large contemporary art exhibitions, make her a strong fit for SAAM,” said SAAM director and CEO Joel Wachs. “Her proven track record of developing and executing innovative programs to support the museum’s collection, curating, and outreach programs will ensure a strong, interdisciplinary relationship between the museum and the local community.”McFarland, who has curated exhibitions such as �", "The next Biennial should be held in 2020. \n\n\nArt Basel has announced that it received $1.1 billion in funding from the Hong Kong International Exhibition and Exhibition Center (HKIC), a subsidiary of the Hong Kong government-owned company the Grafton Holdings Group (GHG), in its effort to bring an exhibition of more than 225 artworks by seventy-five artists from nineteen countries in the Asia-Pacific region. The funds were announced a little more than a week ago, and the exhibition is currently on view until March 3.“We are thrilled that the HKIC is supporting this project by bringing together more than 450 artists in a single exhibition,” said Art Basel director Klaus Biesenbach. “We are also very pleased that the HKIC is committed to promoting the work of emerging and established artists from our region in the United States and Europe, and has invested heavily in the HKIC since it opened. We look forward to working with the Hong Kong International Exhibition Center to continue promoting and showcasing the full range of art traditions in the region.”The HKIC’s artist-in-residence program, which has had a long-standing partnership with Art Basel, began as a platform for", "The next Biennial should take place in 2021. \n\n\nThe City of New York is giving $45 million to eighteen arts organizations that were formed in the 1980s or 1990s and are currently undergoing a social distancing campaign. The funds will go to nineteen different organizations, which have been selected for their potential to have a positive impact on reducing traffic congestion in Manhattan and Queens, and will allow the institutions to comply with the strictures imposed by Governor Andrew Cuomo in order to reduce air pollution.The cities are also planning to spend more than $100 million on infrastructure improvements. The funds will be dispersed through the New York City Development Fund, which is collecting funds from the sale of real estate in Manhattan and Queens, as well as the construction of new public works. The funds will also allow the cities to retrain the institutions and buildings that are already undergoing social distancing. The retraining will focus on materials such as flooring and insulation, energy efficiency, emergency preparedness, and sustainability, and will vary according to the communities that are impacted.According to the New York Times, the retraining will focus on local materials, such as wood and metal, but will also include the use of fabric, materials", "The next Biennial should feature a selection of works by artists who collaborate across disciplines, such as photographer and educator Octavia Wilkins; director and curator William Eggleston; and artist-in-residence Zina Saro-Wiwa.In 2017, the jury awarded the 2019 prize to artist-in-residence Hairy Lanky of the Black Swans and the 2018 prize to artist-in-residence Ciarán McGinn of the New York School of Art.\n\n\nThe Museum of Fine Arts (MFA) in Boston has welcomed artist-in-residence Nicole LaFleur, who has worked as a curator and educator in various capacities in the museum since 2015, to its staff. She will serve an administrative role at the institution in November.“Nicole’s curatorial practice is grounded in a deep, interdisciplinary understanding of the aesthetic and intellectual as well as the structural and material,” said director Paul Mpagi Sepuya. “We are grateful for her vision and energy in bringing her to MFA. She brings a fresh, compelling and thought-provoking perspective that we’ve lacked.”LaFleur previously worked as a curator at the Museum of Modern Art in", "The next Biennial should be held in 2022. The Biennial of Live Music, which will be held at the Kaufman Foundation in Los Angeles, California, will also examine how live performance has impacted on the visual and performing arts.This exhibition will mark the first time the museum has hosted two consecutive Biennial, and the first time that the institution has staged a Biennial in the United Kingdom. The exhibition will be divided into two sections: the first, an exploration of how live performance has impacted on the visual arts, and the second, an exhibition of work that is currently on view.The first section, “Live Performance and the Visual Arts” will be on view for twenty days only. This section of the exhibition will include work by artists such as Barthes, Friderico Poli, and Carlotta Varejão, as well as a selection of works by twenty-four artists from the contemporary art field. The show will feature works by artists on the exhibition, and will focus on the “spirit of performance” and the “outright performance” (Üonki). In the next section, “Live Performance and the Media,” the exhibition will be paired with works by artists such as Joël", "The next Biennial should take place in Guadalajara, Mexico City, and will be held in the city’s Centro de Cultura Artes, a former National Museum of Mexico (in Mexico City), in 2020. The next edition will address issues such as migration, the fragile environment, and climate change.The 20-year retrospective, titled “Culture and Art in the Age of Resistance,” will take place at the Centro de Cultura Artes. The institution closed to the public on September 1, 2016, and reopened on July 5, 2017. It features work by forty-three artists, including Della Mona, David Cage, David H. Koch, David Kinsky, and Steve Waters, as well as biennial projects by contemporary artists. The biennial will be held in the museum’s Centro del Pueblo, the former home of the National Museum of Mexican Art, and will be centered around the themes of art, resistance, and art history.\n\n\nAn artist’s studio, a living space, and a space where art can be made tangible and experienced. The Artist’s Studio is a living space located in a creative and transformational space, a world-ren", "The next Biennial should launch in January 2021. Per the schedule, the exhibition will consist of thirty-three works, the works of thirty-two artists, and an archival exhibition.\n\n\nThe City of Houston is moving forward with construction of the new Museum of Contemporary Art (MCA), which will be four thousand square feet and take up three hundred of the city’s three city-owned parking spaces. The completion of the $500 million project is expected to be in 2022. The MCA’s opening will be in 2022.“Museum of Contemporary Art is a great example of how our city can be transformed into a world-class cultural destination,” Mayor Sylvester Turner said in a statement. “The MCA will be a beacon for generations of visitors to Houston, and a model for how a museum can work for the common good.” The MCA’s construction, which will also involve the renovation of the existing Pecan Street entrance, is one of several planned for Houston.Several thousand people are expected to attend the opening party, which will take place on the eighth floor of the MCA’s new building, which will boast a theater and a restaurant, and will be the", "The next Biennial should be in 2021 – and the first in 2020. If this year is any indication, the next edition will be even more ambitious: more than ten exhibitions every year, and a multi-generational celebration.”\n\n\nThe Queens Museum in New York, which was forced to cancel a second edition of the “Queens Museum” in April due to concerns about the coronavirus, has issued a statement about the health crisis.“It is with great regret and disappointment that we report that we will not be able to present ‘The Queen’s Museum: ‘The Untold Story,’ in 2020,” an exploration of the coronavirus and the legacy of Queen Elizabeth II, according to the institution. “We are exploring opportunities to continue our work in the years to come, but at this point, the plan is to not proceed with the forthcoming exhibition.”The museum said that it is meeting with partners and stakeholders to consider the possibility of moving forward with the 2020 exhibition. Its next exhibition will open on September 3, 2020, at the Brooklyn Museum.\n\n\nThe eleventh edition of the Berlin Biennale, which ran from September 2 to September 5, 2020, has", "The next Biennial should be held at a venue that already possesses the capacity to host a major exhibition. “The power of festivals lies in their universality, their passion, and their ability to bring people together,” Arts Council president Jodi Tait told the Art Newspaper. “We are constantly making the case for how we can create new platforms for dialogue and the art of the city. It is up to the city to decide whether it wants to be a platform for creativity and art or for commercial entertainment and retail.”\n\n\nThe Royal Academy of Arts (RA) in London announced today that it has appointed Yale Allesee as its next director. She succeeds Ann Marnell, who was hired as director of the Centre for Contemporary Art at the University of the Arts (UCA), London, and will take up her new post in February.“We are really excited about this appointment,” said RA president Martin Bevan. “In her new role, she will play a major part in promoting and maintaining the RA’s rich legacy of visual arts and our commitment to supporting emerging and established artists, artists in exile, and artists in need.” The academy", "The next Biennial should take place in 2021.\n\n\nThe National Galleries of Scotland (NGM) is launching a new digital initiative that will connect over two thousand museums across Scotland with visitors from the United Kingdom. The service will provide digital content such as exhibitions, educational experiences, and other special events and will be guided by an artist-in-residence who will guide visitors through the digitization of their institution.The new mode of communication will be enabled through a new digital platform, the National Museum Service (NMS), which will work in partnership with some sixty of Scotland’s leading arts institutions. The service will also include a new digital magazine, the National Museums’ Shortlisted, which will be distributed by the National Publishing Company (NPG), and a new digital epic, “The Odyssey of Neil Gaiman,” which will be presented by the National Galleries of Scotland in partnership with Glanmire House.Both the National Gallery Scotland, which is currently undergoing a $500 million expansion, and the National Museum of Scotland, which recently completed its £120 million expansion, will participate in the service. The National Galleries of Scotland will provide the National Museum Service with digital content and the National Museum, which will host the Odyssey", "The next Biennial should be held in 2021. \n\n\nThe Tokyo Biennale Foundation announced today that it will suspend the upcoming event, which was set to take place in September 2019, until at least March 23. In a statement, the foundation said that it asked the organizers to hold the event until the museum’s security was improved and that it had also requested that the 2020 edition be postponed. “From the moment the security situation deteriorated, the festival has been suspended,” the foundation said. “It planned to honor the theme ‘Witch Hunt’ and to introduce the themes of the season, but these plans were put in jeopardy due to the current situation. The festival has been canceled for a period of six months and is currently analyzing the possibilities regarding the future of the festival and the festival.”The Tokyo International Film Festival (TIFF) has also announced that it will suspend its September 26–September 28 edition, which was to take place at the Tokyo Metropolitan Museum of Art, until at least March 15. It will also hold a new series of screenings, “Shinrai: The Magic of Film.” The move comes a day after the Japanese government declared a", "The next Biennial should examine the role of art in the lives of ordinary people. The first Biennial should be Advertisement\n\nThe New York–based nonprofit, which seeks to promote the creative and intellectual life of New York City through exhibitions, concerts, films, and other events, has launched a new initiative, the New York City Art Biennial. The biennial, which will run from April 7 to April 22, 2020, will focus on the city’s art museums and will include programming that addresses the cultural, political, and socioeconomic experiences of working in New York City.“The New York City Art Biennial is an ambitious project that addresses the city’s visual arts, but also the cultural and social fabric of our region,” said David Gordon, chair of the board of trustees of the Museum of Modern Art, which is also spearheading the project. “This new way of working in New York City is slow and incremental, but not without a certain musicality and touch.”The inaugural iteration of the biennial, which was organized as a partnership between the Museum of Modern Art and the City University of New York, drew nearly three hundred participants in February 2019. In an attempt", "The next Biennial should be held in 2021. The news comes on the heels of a $144 million relief package for the museum, which is also funded by the Cauvery Foundation for the Arts, the CCA Foundation, and the Zugspitzeitung. “The South African government made it clear that it wants to embrace the urban movement as a source of inspiration;” South African cultural minister Jody Steynl, who also chairs the CCA Foundation, told Artnet News. “We are already working with urban designers to develop programming for the biennial, and we are working with the public and private sectors to make the biennial program accessible to everyone. South Africa needs to lead the way when it comes to urban design.”In the meantime, here are a few of the biennials’ highlights:The Mpagi Sepuya and Mpagi Nde, both in Nairobi, which were selected as the 60th and 62nd biennials’ designations;\n\nArtadia, an initiative of the United Arab Emirates, is seeking $7 million from the public for the construction of its new home on the island of Zanzibar; and,", "The next Biennial should also include a “love letter to the Hudson Valley” titled “The Art of Delia Sherman”\u0097a nod to the artist’s famous “Merry Wood” series. Speaking about the exhibition, Doug Kmie, the executive director of the board of trustees of the museum, said: “We are thrilled to be able to once again host the Whitney. It is an honor to be able to collaborate with Delia Sherman and to share her work with Brooklyn, Manhattan, and New Jersey communities. We are also looking forward to a greater understanding of the region’s rich history, with a view to a more ambitious project that will include an exploration of the legacy of artists, some of whom have shaped the neighborhood she lived and worked in for forty years.”\n\n\nThe owner of a Brooklyn gallery that specializes in New York City artists has been ordered to pay more than $1 million to Sotheby’s after the auction house failed to inform clients in advance of a September 2019 opening of a special exhibition featuring works by a select group of artists. The exhibition, titled “New Yorkers and Old,” was to have taken place at the gallery in June", "The next Biennial should take place in 2021.  For his part, the artist-in-residence will open the biennial with a performance of a selection from his catalogues. The artist-in-residence will also present a series of performances, including a performance by Scott-djvu, for which Jen also enlisted his wife, the Norwegian artist Harjotj, to create the new work, The Dreamer in the Night.  The next Biennial will be held in the city of Västra Götaland from March 22 to March 26, 2020.\n\n\nThe Neue Galerie has announced the thirty-six artists who will be featured in the second edition of its Neue Galerie Show, set to open on September 3, 2020 at the Kreuzberg in Berlin. Organized by the German city of Berlin, the exhibition “Neue Galerie Show,” will bring together seventy-five works by fifty artists, including Andre Neeson, Paul Gauguin, Jean-Michel Basquiat, Waltz Palazzo, Beethoven, W. R. Shaik, Arne Glimcher, Tess Alberts, Clare Redgrave, and Ellsworth Kelly", "The next Biennial should take place in 2020, assuming that all the necessary steps have been taken. The theme of the next edition of the Biennial is 'End of History.”\n\n\nA group of artists, filmmakers, writers, and other cultural workers in China have urged Beijing’s government to consider granting them more autonomy from the Communist Party, in an effort to create a more equal and stable future for the country. They claim that thousands have died in China’s gulags and that millions are incarcerated in China’s custody.Activists from the group Citizens’ Alliance for Democracy in China (CADD) have launched a campaign to pressure Beijing’s government to listen to the demands of the imprisoned and to release Wu Rui, a prominent artist and human rights activist who was detained for almost two years for questioning a murder he did not commit. Wu’s wife and lawyer launched the petition after a court in the city of Dalian, Shandong province, sentenced him to two years and six months in prison for the stabbing death of his wife in March 2018.Wu Rui was originally charged with first-degree murder, but the case was later dismissed due to a technicality; after two years and six", "The next Biennial should be hosted at the Embassy of France. The French government has announced that the 2020 event will take place in December. The twenty-third edition of the festival will be held at the Institut d’Art Moderne in Paris from March 4 to March 6. The biennial will also be held at the Paris Olympia in April, and the Cannes Film Festival in May. The twenty-second edition of the festival will be held at the Palais de Tokyo in June, and the twenty-twelfth at the Lévy Gorvy Museum in London.The event will also feature an exhibition of work that was inspired by the 2016 events, the film In The Hourglass, and the French artist Gustave Courbet’s work The Serpent and the Fountain. The biennial will be presented by the French Ministry of Culture on December 7.\n\n\nThe Dutch Ministry of Culture has launched an investigation into whether an artist-in-residence program that connects Dutch museums with the city’s cultural institutions has been abused since it was launched last fall, The Art Newspaper reports. MCAE, which was established as part of a $1.8 billion, five-year plan, allows museums to open their", "The next Biennial should be held in 2022. \n\n\nThe Mexico City Art Museum (MCA) began an online edition of its popular monthly exhibition “Love Life of the Party.” The first online viewing of the show will feature the works of thirty-three artists, including Luis Alíson, Gúsol de la Barra, and Yolanda Cervetto, in the first online exhibition of its kind in Mexico City. The show, “Love Life of the Party” will be on view until February 25.The exhibition was organized by the museum and is supported by the funding of the Ministry of Culture and of MNA, the Ministry of Culture of Mexico (MCH), and the Ministry of Culture of the United States of America.The MCA will distribute the exhibition in partnership with the Museo de Cultura y Cultura Artes (MCA) in Mexico City, the Museo de Cultura y Cultura in Mexico City, and the Museo de Cultura y Cultura in Porto Alegre, Portugal.The full list of participating artists is as follows: AprilandarmyArtMarchand0,Aprilandarmy1,Aprilandarmy2,Aprilandarmy3", "The next Biennial should take place at the Place de la République in Paris at a date yet to be announced.\n\n\nThe United Kingdom’s Culture, Media and Sport (CMS) department has released guidelines for how to display British Prime Minister Boris Johnson’s name and current and former Tory Party leader, and now ex-Labour Party leader, Ed Miliband.According to the document, “A name that includes both words and images is best displayed with a name that is clearly defined, by using the appropriate word and image combination.”The guidelines advise the addition of a small, circular, double-sided statement that reads: “Miliband: A Conservative-Liberal Democrat government.” In the center of the statement is a photograph of Johnson, which has a similarly shaped top and bottom, and the words “We are safer, we are stronger, we are better.”The document also outlines how to make a statement about Johnson’s record as leader of the Liberal Democrats. “The best way to convey Johnson’s record is with a name that is clear and memorable,” it reads.Miliband’s current cabinet, which consists of seven members, is as follows", "The next Biennial should be held in 2021 and will be organized as an exhibition of new works by the artist, with the aim of preserving his legacy through the generation of a new work. The biennial will also include works by artists such as Zaha Hadid and Mark Rothko, as well as Samantha Stuart-Holmes, Thelma Stuart-Holmes, and Alberto Vargas Llosa. Andrea De Santis, the artistic director of the Los Angeles County Museum of Art, told the Los Angeles Times: “The goal is to have a good exhibition that will resonate with a lot of people. And to have a path that will inspire people to think about how they can continue to work with the same spirit of innovation and creativity as they did so many generations ago.”The 2019 exhibition showcased many work by artists from the earlier period, including Laura Owens, Nada Dziewior, and Seraphina Zahn, but the exhibition was marred by a fire that broke out in a working-class apartment in Los Angeles in 1991. In 2016, the exhibition was reopened in honor of the artist’s 100th birthday, and another exhibition, “Art and Fire: A Retrospective", "The next Biennial should be held at the New Museum in New York in 2020. \n\n\nPacearts, the Massachusetts-based nonprofit organization that works to promote the art of Brazilian Jiu-Jitsu, has named a new curator of modern and contemporary art. Trisha Brown, who currently serves as a senior curator at the New Museum in New York, will be the organization’s first curator in the United States.“We are delighted that Trisha will become our next curator of modern and contemporary art,” said Cynthia Davis, executive director of Pacearts. “Trisha brings a wealth of experience and knowledge to the job, having curated exhibitions at the Whitney Museum of American Art in New York, the Metropolitan Museum of Art in New York, and the Allen Memorial Art Gallery in New York, and most recently, at the Museum of Modern Art in Boston. Trisha’s curating style and expertise will complement the current curators at the New Museum and the Allen Memorial Art Gallery, and we look forward to developing new models of exhibition-making and curating for the two organizations.”Brown will begin her new position in January 2020. Previously, Brown served as executive director of the Roy and Edna Disney Collection in Hollywood", "The next Biennial should be set up at the Museum of Fine Arts, Boston as soon as possible, with the intention of providing an environment for lively, innovative, and experimental proposals.”\n\n\nThe European Court of Human Rights has upheld a ruling that found the German government liable for a cyber-attack that temporarily disrupted operations at the Potsdamer Straße, a former railway hub in Berlin, in February 2019. The European Court of Justice (ECJ) determined that the German government was responsible for facilitating the activities of a foreign state against the will of the government of Chancellor Angela Merkel.The Court found that the German Federal Office for Security Policy (BfV) and the Federal Office of the Information Society (BfS), which jointly run the state-owned security service Bundesnachrichtendienst (BND), had failed to provide the court with sufficient evidence to back up their claims that the attacks were politically motivated. Politicians who were targeted in the attack, dubbed Stuxnet, were among those who were most vulnerable to the cyber-attacks since they rely on the Federal Office for Security Policy and the Federal Office of the Information Society for their daily operations.The court ruled that the BND and the Federal Office of", "The next Biennial should be set up in the city, and the exhibition will be staged with a view to the Katherija Mountains.The reopening of the forty-second Biennial in St. Louis in March 2020 will mark a milestone: it will mark the first time that the exhibition will be held in the city, and it will mark the eighty-first year that it has been housed in the United States.“We are so excited by the possibilities of this site,” said Sarah Jeong, director of the Katherija Mountains Museum. “This is a historic site, and we are eager to work with the City of St. Louis, the County of St. Louis, and the International Foundation to bring our vision of a new biennial to reality. The biennial will be a platform for North America’s most innovative artists to collaborate, and engage with the Katherija Mountains, with their exhibitions, lectures, and performances and the Katherija Museum.”The City of St. Louis is currently working on a 150,000-square-foot expansion of the Katherija Mountains as part of a $50 million renovation project that will create a 1,800-seat theater and a new public gathering space.", "The next Biennial should be held in the spring of 2021. \n\n\nArt museums in the United Kingdom and beyond will be forced to reduce the hours of some of their most popular exhibitions in an attempt to prevent the spread of the coronavirus. Beginning on Monday, February 14, the museums will only screen one exhibition a day and will limit the number of visitors they allow into their galleries in an attempt to reduce the number of cases of the virus.According to The Guardian, the museums were forced to make the changes after an outbreak of the virus began at the end of February at the Royal College of Art (RCA) in London. Upon learning of the coronavirus outbreak, the RCA, the National Portrait Gallery in London, and the Tate Liverpool have all reduced the number of exhibitions they will present this summer. “The plans are one of the biggest changes since the outbreak began, and the RCA and Tate are the only large institutions that have decided to suspend their summer trips to Morocco, China, and Spain,” Alison Gray, director of Tate Britain, told the Guardian. “While these measures will help control the coronavirus, they will also limit the exhibition trade, making it more expensive for galleries to present their", "The next Biennial should be held in 2021, and the earliest date for a 2021 reopening would be in the future, assuming that the works remaining in the museum, including works by Anna Atkins, Sigmund Freud, and Pierre-Auguste Renoir, would be returned by then.On Monday, the museum announced that it would donate the five works that had been removed from its exhibition space during the Covid-19 lockdown. The works were part of a presentation of works by the New York–based artist Lana Parrilla, who is known for assemblage and textiles, and are currently on display in the museum’s “The Free and Selfie Landscape” exhibition, which has been closed since March 16 and is currently on view through October 9.The piece “The New Americans” (originally from Bloomingdale’s in Culver City, California), 2015, is being restored by Hanna-Barbera. The show will return to the Brooklyn institution for a four-night run in March 2020 and then will return to Los Angeles. \n\n\nThe Center for Contemporary Art Chicago (CCA) and the Dearborn Art Museum (DAMI) announced today that they have entered a new institutional relationship", "The next Biennial should be held in 2020.\n\nMore than fifty artists from twenty-six countries will converge on California this February in celebration of the two hundredth anniversary of the birth of American painter Robert Frank. In the event of the fifteenth edition of the biennial, which will be titled The Art of Life, the theme will be The Art of Death, and the opening of the exhibition will be a celebration of the twentieth-century.The construction of the biennial has been in the works for several years. In 2013, Leonardo DiCaprio, the director of the Italian pavilion at the Venice Biennale, announced that the theme would be the Art of Life. The theme of this biennial is very much in tune with that of the upcoming edition, with the words Life and Death as a theme and the appearance of a human figure as a symbol.  DiCaprio said: “The art of life is the universal language of life, the universal language of life at its highest level, and the language of life in its most beautiful and veiled forms. Life is about to enter into the most profound epoch in the history of humanity, the second half of the twenty-first century. We will be able to shape", "The next Biennial should take place in the spring of 2022. The first will focus on the history of the artist-built cities of the West, where the industrial revolution and urban planning has resulted in a series of monuments and public works, including the Pérez Artístico in Mexico City and the Grand Canal in Venice.The new exhibition will be organized as a platform for the exhibition “Roots of Modernity” (Roots), a project of the DeCordova Foundation, and will form the core of a new exhibition titled “Life and the City,” which will run along with the Biennial. The project, which also includes “Haida Art,” “Northern Identity,” and “Aboriginal Peoples,” will be presented by the Danish curator and educator Peter Stjern, who is also a professor of anthropology at the University of Oslo, among other institutions. The inaugural exhibition, “Introduction: Urbanism and the Past” (November 2022), is an overview of the history of urban planning, highlighting the work of such architects as Jørgen Tod, whose monumental Nuñez-like Habitation Crater in the Andes is", "The next Biennial should land in March 2021 and the first in October 2021. The transformation of the pavilion, which was completed in 1966, was completed in 1984.\n\n\nThe National Arts Center (NAC) in Columbus, Ohio, has received a gift of fifty-six works by thirty-five artists in its permanent collection. The works were donated by NAC patron and philanthropist Gary Garrels, whose vast collection includes works by artists such as Brian Eno, Chester A. Hamilton, David H. Russell, and Fruczetti Piazza, as well as works by artists whose practices are being intimately interwoven with that of the institution.“Gary Garrels’s gift of works by thirty-five artists is an incredible honor and a great testament to the achievements of the NAC’s distinguished collection,” said director Adam C. Posen. “With great gratitude, we offer these works to the NAC, as a way of saying thank you for the work of celebrating the collection’s fifty-sixth anniversary. NAC has a long-term vision for the collection and a dedicated curatorial team dedicated to preserving and presenting the works that make up its exemplary collection. We", "The next Biennial should be held in the summer of 2021.\n\n\nThe Museum of Asian Art (MAA) in Singapore has revealed its 2021 edition, “NIRIN,” featuring works by thirty-seven contemporary Asian artists. The show will be staged at the MAA’s facility in the capital, Singapore. The forty-third edition of the exhibition, “NIRIN: The Art of Frame,” will open on January 23, 2021. Previous iterations of the event included works by more than ninety artists. “NIRIN’s work is grounded in a real-life experience of the art world, bringing together a diverse group of artists who work in a similar space,” said MAA director Phyllis Fung. “NIRIN provides a platform for a new generation of contemporary artists to experiment with the extent to which distance and distance-based practices are entwined and intertwined. It also aims to shift the focus from pictorial complexity to the practice of the visual arts.”The remaining works in the exhibition will be unveiled in the coming weeks. The full list of participating artists is as follows:Robert Irwin, Prague: Ekaterina Iyegilk", "The next Biennial should be held in early 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has released new guidelines on how to present a work of art in the exhibition “Just the Thing.” In a statement, MoMA said: “In a time when it is increasingly difficult for cultural institutions to communicate with each other and with the public about the world around them, the MFA has developed new guidelines for presenting art. Our goal is to present the art in the exhibition as effectively as possible, while maintaining an exhibition-like experience that engages as many people as possible.”The guidelines, which were developed by MoMA’s curators and experts, outline the “essential elements” of a presentation, including the “context,” the “exploration of the work” and a “solid foundation.” They also encourage the “use of the gallery’s space to build upon and deepen the themes of the exhibition.” The exhibition, which features work by 169 artists, began as the inaugural “Feminist Museum” at the Armory. It has since expanded to the Museum of Modern Art, New York, the Museum", "The next Biennial should be held in 2021. The show will be held at the Museum of Contemporary Art Tokyo. The 2019 edition, “The Shadow Factory,” was held at the Gallery of Modern Art in New Delhi and the Art Gallery of the Southbank Centre in London.\n\n\nThe estate of the artist Alighiero Botticelli, who is remembered in Italy as one of the first painters to emerge from the Communist era, has won a major legal battle against the Italian government, which has been accused of flagrantly violating several of the artist’s works. The estate’s attorney, Grazie Cerciella, told the Art Newspaper that the government had tried to muzzle the estate’s artist rights protection fund, which is attempting to raise funds to defend the biennial’s future against the government’s plan to demolish the gardens and the exhibition space, and turn the entire venue into a luxury hotel.The government argues that the program of caring for Botticelli’s works at the institution would constitute a serious violation of his intellectual property rights. When the artist passed away in May of 1957, his estate was given a ten-year license to continue exhibiting them", "The next Biennial should take place in 2020. \n\n\nRei Kawamura, who has helmed the San Francisco Museum of Modern Art (SFMoMA) since 2009, has been hired to head the Brooklyn-based nonprofit Visionary Art. She will assume her new role on October 6. Headed by Anne-Marie Madigan, the biennial will aim to present a new narrative in the form of a new work each year.“I’m thrilled to be working with Francis and the visionary team at SFMoMA,” said Kawamura. “SFMoMA embodies the spirit of the City of San Francisco and is uniquely positioned to take the next step in our mission to organize and present the most important art, inspiring contemporary craft and bringing together cutting-edge experimental and experimental art from around the globe. The rich history and rich expertise of the SFMoMA team, as well as the passionate commitment to supporting creators, is inspiring.”In 2011, SFMoMA became the first major arts institution in the United States to open its doors to the public after a major expansion—it now boasts thirty-two galleries, six of which are affiliated with the institution. Its inaugural exhibition in 2017 featured work by twenty-eight artists", "The next Biennial should be up by the year 2020. Michael Locks, director of the Photographers Club of New York, told the New York Times that he expects the museum to reopen sometime in the 2020s. \"My feeling is that we're going to be back in the same place in five years time. The question is, will it be on a large scale, will it be for the masses, and will it be for the people?” \n\n\nThe establishment of the New Museum in New York City has announced its intention to open as part of a $1.2 billion overhaul of the city’s transportation infrastructure. The $1.2 million gift, made by the Rockefeller Brothers Fund, will also see the overhaul of public parks, including Roosevelt Island’s Central Park; a new subway line, the Blue, which will run alongside the Hudson Yards development site; and the expansion of the PATH, a rail line that will connect Manhattan to Queens.New Museum director Timothy Rub was named the museum’s interim cochair in June, and he toured the city’s elevated subway system, the Second Avenue Subway (SATS), in September. Since then, the museum has welcomed a new visitor in its status", "The next Biennial should be set up to take place in the autumn of 2020. The first edition of the exhibition will be held at the venue in September 2021. The theme of this year’s event is “Towards a New and Better Future: Multiculturalism and the Struggle for Civil Rights” and the organisers will hold a special exhibition of works by artists and activists from the region and beyond. The theme of the second edition of the exhibition is “Unfolding History: The Story of my Life.” The programme of the exhibition will explore the ways in which the global history of the Black Lives Matter movement has intersected with the biennial in order to present an inclusive and relatable narrative of emancipation. Commenting on the upcoming exhibition, the exhibition’s program director Aline Herkus said: “We are delighted that this year’s show will be centered around a central theme of unity and the theme of the exhibition itself is to tell the history of my life. I am incredibly honored to be able to create a platform for the work of so many artists and activists to be displayed in the exhibition.”\n\n\nThe Swiss government has approved a $240 billion plan to help museums cope", "The next Biennial should take place in 2020. If the mission is to create a new language to reflect on the visual arts and the humanities, then the new museum should be situated at a campus of the Brandenburg University of Berlin, the university founded by Karl Löwen in 1835.The German government has committed €500,000 to the “art of movement” and has promised to match the funds to the two winners of the 2019 prize, Matthew Shepard and Christa McAuliffe, who are currently incarcerated. The money will also be directed towards a new exhibition at the museum dedicated to the art of movement.The initiative was launched by Hanns‐Östendy, a former member of the National Democratic Party (SPD), which recently gained power in Germany, and was organized by the committee of Germany’s Federal Association of Audiovisuals (BFA). The other members of the committee are Tobias Schwegler, the office of the federal minister of culture, Frank Schäfer, and Bernd and Helmut Kohl, the party’s foreign minister and chancellor, respectively. In addition, the BFA will also create a new digital platform that will allow the public to submit their own ideas for the", "The next Biennial should take place in 2020. \n\n\nThe San Francisco Museum of Modern Art (SFMoMA) announced today that artist Nan Goldin has been selected as its 2020 recipient of the Ruth R. Marder Family Artist Award. The award, which recognizes contributions to creativity that are within the scope of a museum’s existing endowment, is one of several that Goldin has received throughout her career. The awardees are: Matt Leder, Marco Cervetto, Laura Owens, Jorge Rodriguez, Hannah Wilkes, and Billy Wilder.The award was established by the R. Marder Foundation to recognize the contributions of African American artists and organizations to the museum’s mission. Goldin was selected for her work Abandonment: Physics, Theory, and Color in Color” (2015), a series of photographs that examine the human condition through the lens of physicist Richard Feynman and his wife, the artist Jane Vest. “I am deeply honored to receive this one-time award,” Goldin said. “The R. Marder Foundation and the Ruth R. Marder Family Artist Award are dedicated to the memory of Ruth", "The next Biennial should open in 2019, with an opening date of 2020. “The ceremony will be divided into four parts: ‘The Making of The Art of Photography,’ which will highlight the work of twenty-four photographers, including Dieter Blom, Charles A. Finney, John Halstead, Tunga, and Wangechi Mutu; ‘The Art of Storytelling,” which will include stories from twenty-five artists; and “The Art of Social Media,” which will focus on the oral tradition of the genre.“This is a historic moment for us, a year after we have launched our inaugural exhibition in the city, and we are delighted to be able to announce that it will transform the lives of many of those who have never been able to see our exhibitions,” said Jeff Koons, the artist’s longtime and perhaps most famous collaborator and long-time curator. Koons’s first show in New York was a solo exhibition at the Whitney Museum of American Art in 1990, and he selected the seventy-three-year-old artist for the twenty-third Biennial, which opened in 2004. In addition to his work, K", "The next Biennial should be held in 2021, the magazine said.Artforum’s statement follows:\n\n\nPacearts recently announced the opening of its new exhibition space, the Pacearts New York, which will open in the new luxury hotel, the Waldorf Astoria, on February 27. The exhibition will be curated by Steve Stoppard, the former director of the Turnham Contemporary, and will be led by Tina Ray, the current director of the Institute for Contemporary Art in London. Space will be reserved for a biennial of work by Arsène Atget, whose work will be included in the exhibition.Pacearts will also be awarded the Riga Biennial Award, which is awarded annually by the Riga Art Foundation. The Riga Biennial will be held at the Astústi Palace in Riga from December 29 to January 8, 2021. The biennial will include works by twenty-seven artists, including Tina Ray, José Carrillo, Nathan Hamill, Juliana Lin, Cécile Barke, Andrea Boele, Andrea Longo, Agnieszka Vojtech, Ondine Mart", "The next Biennial should focus on a distillation of the incredible range of artistic activity that we have experienced since the nineteenth century. This could be achieved through a series of lectures, exhibitions, publications, a special exhibition, or a public gathering.”\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Sarah Cuyana, a curator and head of its miniature art collection, as its next director. She succeeds Sarah D. Cooper, who was appointed the institution’s next director on March 13.“Sarah represents a breadth of artistic experiences and talents, both as a curator and as a thinker,” said Museum Director Charles A. Neill. “Over the course of her twenty-five-year career, she has demonstrated a remarkable understanding of the importance of art and her own practice as an educator and advocate. Sarah is excited to continue her work as a curator and advocate for the Guggenheim’s collection and as a museum.”Previously, Cuyana served as director of exhibitions at the Museum of Modern Art in New York, where she worked with artists such as Charles Bukowski, Kurt Weill, and David Salle, and was a consultant for the collection", "The next Biennial should be held in 2025 and the last in 2023. “This is an unprecedented crisis,” said art historian and curator Joachim Neugroschel. “The museum has the potential to be the instrument of an important moment in the history of art and is in the process of developing a new Art in the City programme that will take the biennial back to its roots, to the exhibition of the artist’s work in a city setting.”The exhibition of the artist’s work in a city setting is part of a larger movement of contemporary art and design and design history designers to push towards these kinds of kinds of exhibitions in cities, to collaborate with city-states and other institutions, to be hosted and the work produced in collaboration with the city.As someone who grew up in the 1980s and early 1990s in New York and has lived in several cities throughout the world, I’m thrilled to be collaborating with the city of New York and the surrounding area to create an environment where artists and designers can thrive and create lasting connections with the city’s art and design communities. We have already begun planning our inaugural exhibition, “The City of New York: Over the Edge", "The next Biennial should be held in 2020, the organisers said. That year, they plan to focus on creating new works by women and on preserving as much of the art as possible.\n\n\nThe sculpture, titled Guerrilla’s Podium, was created by the Polish-born, London-based artist Mariała Wojciech and is part of a series titled “Podiums” (para-nodes) that highlight the work of women in the art world in France. The series, which was inspired by the work of Anton Chekhov, leaned heavily on the ideas of the late American artist and theorist Frida Kahlo, whose work is celebrated in the pavilion.The works, which are part of a series that highlights the work of women artists in France, were selected from the catalogue of the exhibition “Women Artists in Paris” (2009–10), an exhibition organized by Roland Barthes and curated by Jacques Prouvé. The show was organized as part of the biennial “Expo France” (2011–12), which brought together a group of contemporary artists in Paris. Both the French and British pavilions of the show, located in the", "The next Biennial should be held in the spring of 2021. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed John Leavitt as its new deputy director. Leavitt will be responsible for leading the organization through its initial phases, which will involve the construction of the museum’s first permanent location in the city of Los Angeles, which is slated to open in 2023. He succeeds Derek Kiefer, who has served as interim director since July 2018, and will take up his new post in January 2020.“John’s expertise, passion, and intelligence are essential to our mission to transform the future of MoCA and the City of Angels,” MCA’s director and CEO, Sal Albano, said in a statement. “We are grateful to the Board of Directors for nominating John to this important role, and we wish him every success.”Leavitt will begin his new role on January 1, 2020, and will remain on the staff through February 20, 2020. Under his leadership, the museum has grown from a small outpost in the city to a $92 million institution that comprises two buildings, the Museum of Contemporary Art (MoCA) and", "The next Biennial should be held in 2020 and will be in collaboration with the Museums and Collections of the University of the Arts.\n\nThe museum will close its doors for a period of three weeks in April 2020 as part of the refurbishment and expansion of the museum, which is currently undergoing a $110 million expansion. The refurbishment was carried out by architects Hockney+Rocca in partnership with MoMA and the renowned firm W.P. Mott + Bocchino across a ten-acre site in the former industrial site of what was once the former Cleveland Clinic complex and is now the University of Mississippi.The museum’s new board chair, Daniel H. Weiss, said: “The renovations to the Biennial have given us the opportunity to present a new collection of works and have them displayed in an updated and enhanced setting, in the heart of University City. We were pleased to use the expertise of the W.P. Mott + Bocchino team to bring these works to life in the most advanced and innovative way possible. The project completed in May has given the Biennial a new beginning, a new chapter, and a new opportunity to grow in stature and influence.”The museum will now reopen", "The next Biennial should be on April 16, 2021, and will include a panel discussion with Kallistos Zavitsas, a professor at the University of Crete, about his recent book on monastic life in the Byzantine city of Ephesus; and the upcoming exhibition “X-Ray: Monks, Spies, and Assassins” will showcase the work of sixty-eight artists from twenty-six countries. “The Forum,” which is affiliated with the Greek Academy of Art and the School of Painting at the University of Naples, is also planning a new exhibition in 2020.\n\n\nThe Konrad Adenauer Foundation (KAF) in Berlin has appointed Oskar Eustis as its new director. He will be responsible for overseeing the development of the KAF’s new exhibition series, “X-Ray: Monks, Spies, and Assassins,” which will open this fall and run for forty days. The series will also present live artworks from the Künstlerhaus in Frankfurt to coincide with KAF’s annual “X-ray” event.“We are delighted that Oskar, who is a scholar and a scholar of art and", "The next Biennial should open in 2022.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Anthony Lovell as its new deputy director of curatorial affairs and chief curator. Lovell comes to the institution from the CUNY Graduate Center, where he has served as chief curator since 2010. During his tenure at the CUNY Graduate Center, he organized the 2017 retrospective of the seminal Chinese artist Wang Ren/Zhongguo, which was followed by the 2018 exhibition “Chennai and Shanghai: The Art of the Orient” (co-organized with the Shanghai Art Museum), and has served as a curator at the Museum of Modern Art (MoMA) in New York since 2011. Prior to joining the CUNY Graduate Center, Lovell was a curator at the Philadelphia Museum of Art and the Winnipeg Museum of Art. He was also a member of the board of trustees of the Chicago Art Institute and was a contributor to Artforum.com. Lovell was nominated for a MacArthur Foundation grant in 2017 and has received $4.5 million in funding from the organization.\n\n\nThe Art Newspaper has published an excerpt from an article published by the Geneva-based organization Artforum. Titled “pain", "The next Biennial should be held in 2021 and is scheduled for August 2020.\n\n\nThe Victorian Museum of Art in Melbourne has appointed Matt Barlow as its new deputy director. He will be responsible for planning the museum’s 2020 public opening, and will take up his new post in August. Barlow comes to the museum from the Australian National Gallery, where he has worked as a curator for more than twenty years. Prior to joining the Australian National Gallery in 2004, Barlow served as a curatorial assistant at the Museum of Contemporary Art, Sydney, where he worked on a number of exhibitions, including “The National Gallery of Victoria” (2007–2008), “Family Matters: Art in the Age of AIDS” (2010–2011), and “Boba Fett: A Space Odyssey” (2011) and completed his Ph.D. in art history at the University of Sydney.Barlow’s first major public engagement was as the inaugural director of the Victorian Museum of Art, which opened in 1973. He oversaw the museum’s transformation from a space for the collection of paintings, sculptures, prints, and ceramics from the late nineteenth century to the museum’s current exhibition format of a collection", "The next Biennial should be in 2022.\n\n\nThe Ferrançeri Museum of Art in Florence, which began as an outpost of the Beppe Grillo-led Five Star Movement in 1988, has announced that it is planning to close in 2020 following a period of community engagement. The museum recently announced its engagement with the Italian artist and philosopher Gi, who is a founding member of the Spiral-2 movement, which advocates a slow but steady dismantling of the state and society by means of local and state-run collectives. Gi’s work is currently housed at the Ferrançeri, which was founded in 1923 by Ferrançeri architect Silvio Marzano. The museum is currently undergoing a major renovation and is expecting to reopen in the coming years.“This is a turning point for us, and for Italy, as we enter a new phase of our lives,” Milan-based architect and collector Giulia Pape wrote in a statement. “Gi’s work is one of the great unifiers of modernism and architecture, and we are in the process of integrating him into our display as part of our new project, ‘Post-Moderna,’ which we", "The next Biennial should focus on the ethics of the practice of photography, which is historically often seen as a form of corporate propaganda. The upcoming exhibition will focus on the history of photography and the art of the present, addressing issues such as environmental impact and urban planning in an attempt to create a dialogue with the future. To meet the demands of the future exhibition’s audience, the group will present three completely digital exhibitions that will include the exhibition of the work of artist Santiago Villalobos next month.\n\n\nThe Museum of Contemporary Art (MoCA) Los Angeles has appointed Steven M. Lee, the director of the Los Angeles County Museum of Art (LACMA), as its next director. He succeeds Mark B. Cooper, who retired in March after sixteen years at the helm of the institution, and will take up the post on April 2.“Steven’s visionary leadership, deep understanding of the unique history of the city’s art and collections, and ability to bring people together during challenging times make him a perfect fit to lead LACMA,” said John Taylor, LACMA’s founding director. “We are pleased to welcome him to the organization and look forward to his leadership role in bringing", "The next Biennial should take place in November 2021. If all goes as planned, the exhibition will present a selection of works by forty-two artists in the biennial’s first half. The second half will consist of works that have appeared in the biennial’s second half. Joining the biennial will be artist collaborations that have been curated by the director of curatorial programs, Maximilian Niebuhr; the director of the Maximilian Niebuhr–Pedersen Kunstbau; and Josef Kneip. The show will include nearly two hundred works by twenty-four artists, including Baroness Antony Hudspeth (International Exhibition of Basing Art and Design), Kanda Srivastava (International Exhibition of Transhumanist Art), and Karel Rayner (Art In Motion). Each event will take place in a different part of the World, and each will be curated by an independent curator. The first half of the biennial will be held in October 2022, and the second half in March/April 2020. “In a time of global transition, the biennial presents an opportunity to re-imagine the kinds of experiences possible,”", "The next Biennial should take place in the Hamburg region of Germany. The exhibition will also include a retrospective of the work of one of the artists selected for the exhibition, the artist Ekaterina Trifitskaya, which will open at the Artforum gallery in Berlin in December. The exhibition will present twenty works by artists including Hans Frank, Robert Godlin, Wolfgang Kale, Louise Bourgeois, Louise Bourgeois/Duvernay, and Jean-Michel Basquiat. The full list of participating artists can be found here.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it is teaming up with the Los Angeles Department of Cultural Affairs in order to create a new public art project in the city. The partner initiative, called the Cultural Heritage Corridor, will provide free public artworks and free programming in the city in exchange for the city’s consent.“The museum is committed to the arts, the community, and supporting people in cities across the county,” said Marilyn Mueller, director of the Los Angeles County Museum of Art. “The Cultural Heritage Corridor will be a new public art project that will connect the museum’s collection with the cultural and recreational activities of the city, drawing", "The next Biennial should take place at the Art Institute of Chicago (AIC) in 2021 and the Art of the Americas (AOA) in 2022.In a previous Artforum interview with Sophie Bronkhorst, the director of the Twitter-based arts resource Global Voices, Shelli Oliert, said: “We are extremely excited by the prospect of the 2020 exhibition series, the Art of the Americas, and the Art of the Pacific, and the upcoming 2020 biennial on Africa’s art and history. It is a truly exciting time to be working in the Art of the Americas and Art of the Pacific.”\n\n\nPace of Style, the New York–based nonprofit that supports contemporary art, will launch a new fund that will reward visual artists with a $100,000 prize. The fund, named after the first street where it was established, will be presented at a ceremony on April 3 at the Center for Art, Design, and Innovation (CADI) in Manhattan. The organization will also unveil “Pace of Style”: Pilot, a new program that will provide $50,000 to visual artists who demonstrate creative reinventions and are working toward a new idea each year.Set to open in", "The next Biennial should be held in the autumn of 2021 to take place in the city of Brno in the Czech Republic, and will focus on the contemporary impact of the exhibition. Julia Hilti, the artistic director of the European Biennial and a curator at the Van Gogh Museum in Amsterdam, told Artnet that the biennial will incorporate a “dialogue with the past, with special attention to the contemporary world.”The exhibition will also offer a glimpse of the future of contemporary art. Titled “The Future Belongs to Us,” the exhibition will be centered around a collection of paintings by Cézanne, Van Gogh, and others that will be exhibited at the museum, which will stage a number of events that will unfold as the biennial unfolds. Details about the program, its setting, and the exhibition will be announced in September.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has launched an initiative to make art in the city more accessible to people across the globe through digital platforms. The Met, which is currently working with Chicago’s Museum of Contemporary Art (MoCA), is encouraging people to use digital platforms to see and purchase works. Among the works that can", "The next Biennial should be held in 2020 and will take place in Hong Kong.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Alexandra Dyer as its new executive director. Dyer is the first African American to helm the museum and comes on the heels of former director John Nealy leaving the institution in August. In her new role, Dyer will oversee programming and the organization of the museum, which is currently undergoing a $8 million expansion.“Alexandra is part of a long-term, deep-rooted strategy that has brought Biennial to life in Los Angeles,” said David Kiehl, the museum’s director and CEO. “It is a strategy that has seen us reach for our innovators and for our artists to address the challenges of our time. Now, more than ever, we are focused on continuing to advance the museum’s mission to showcase the rich visual and auditory history of the artist’s world.”\n\n\nThe Canadian Institute of the Arts (CAA) in Ottawa has received a gift of more than 2,500 artifacts from the Canadian Museum of History (CMH), including a set of drawings by artist Franz Kline, a sculpture by", "The next Biennial should be in March 2020. Following a series of exhibitions, performances, seminars, and books published by the team in the US, Japan, and China, the series will return to Paris in May 2021.\n\n\nThe Tobi Show (Tobi, or What Art) has announced that it is working with Mark Di Stefano to launch a new biennial in the United Kingdom focused on the work of British artists. The inaugural event, titled “The Tobi Show,” will take place at the National Art Gallery in London on November 8 through December 19, 2020. The biennial will also feature solo exhibitions of work by four artists: Kiki Smith, Mandy El Fadl, Sean James Parsons, and Kiki Wacha.Organized by artist and designer Tobi Sexton, the event will focus on how the exhibition space creates a new space for the exhibition of work by British artists. The biennial will also explore the relationship between art and technology, the virtual, and human rights. The theme “Virtual Human Rights” will be a combination of “technology as art and technology as technology” and will engage with the exhibition space, artists, and institutions to address human rights issues on an 'im", "The next Biennial should take place in 2021. The trustees of the Diller Scofidio + Renfro–designed museum have announced that the next edition of the exhibition “The Surrealist Experience” will be staged at the Diller Scofidio + Renfro–designed museum in Milan. The theme of the biennial will be “surrealism” and the theme of the exhibition will be “The Surrealist Experience” . “In order to promote the exhibition at the Diller Scofidio + Renfro, we had to introduce an entirely new way of making art. The new process involves two interrelated elements: a) exploring the limits of what a single human being can do; and b) the idea of creating an experience. And so, The Surrealist Experience is a new way of showing the works of the Diller Scofidio + Renfro collection, as well as a new way of the museum.” The institution will also be remodeled to include a new glass-enclosed exhibition space, a new production space, galleries for its collection exhibitions, and a new basement space for its main building. The renovation is being undertaken", "The next Biennial should be held in 2020. The commissioning committee comprised Jerzy Tadek, director of the Warsaw Biennale; Jocelyn Lopate, general director of the Museum Freiheiten in Frankfurt; Pia Martini, director of the Venice Biennale; and Joachim Fischl, the director of the Kunsthalle Basel.\n\n\nThe Museum of British Art (MoB) in London has launched a program to bring together around fifty artists from the United Kingdom to collaborate remotely. After promising to develop an online platform for consultation and collaboration, the program, dubbed Project Connect, has raised more than $15 million in support of artists. Under its guidance, seventy artists have committed to participating in the first phase of the initiative, which will run from March 2020 to March 2021, and will continue to do so throughout the duration of the series.The MoB Art Fund is also encouraging institutions to create new artworks in support of the British artist’s work in support of artists. The fund will award $50,000 in support of new artworks and will aim to create new opportunities for British artists to collaborate. The funds will be divided among artists and will also support the", "The next Biennial should begin with a public consultation and close with an open discussion. Rajeev Dhillon, chairman of the biennial committee, said: “In this challenging phase of our history, when we are facing many existential challenges, I hope that our research will contribute to the shaping of new solutions that will ensure the future of our planet and its inhabitants.”\n\n\nThe National Endowment for the Arts (NEA) has launched a new initiative that will help cities and communities across America recover from the effects of the coronavirus. Called the Cities & Community Response Fund, the program will distribute $75 million to prevent and mitigate the coronavirus and its associated health crises, and will also provide grants to help local arts and cultural organizations through a five-year pilot program.“When the coronavirus was first identified in the United States, it was met with widespread skepticism, skepticism that was compounded by its unexpected geographic spread,” said Jessica Morgan, executive director of the National Association of Theater Owners. “The NEA and I are eager to support local theater and cultural organizations and work with our members to understand how the coronavirus can be prevented, managed, and scaled back.”", "The next Biennial should focus on the city’s existing public art, which has yet to be developed. “No doubt, the city’s performing arts are any form but accidental,” said Christopher Campbell, president and CEO of the Biennial Commission. “The city’s performing arts were part of the fabric of the city of Boston, and their legacy will shape the city’s inner life for generations to come.” Since its inception in 1932, the annual event has been staged three times:  • 2140: The Art of Biennial.  • 2040: The Art of the Future. • Art of Life: The Future Art of Life. The 2019 event, titled “Future Art of Life” and curated by Elizabeth Alexander, debuted at Boston’s historic North Adams site, the Maritime Museum, and will run through March 22. The Finalists for the 2019 prize are: Catherine Glass, Alabama’s displaying “Nina Turner” at the Maritime Museum; Oliver Luckett, ‎Georgia’s exhibition “The Slow Art of David Kupchak” at the Boston Public", "The next Biennial should take place in 2021, with a 2026 opening date.\n\n\nThe Royal Academy of Arts (RA) in London announced today that it is opening a new digital-only edition of its annual Festival of Lights, the annual celebration of light and the 2013 martyrdom of British archaeologist Jo Cox, on December 4. The new event will launch on the academy’s website and will run until December 6.“The festival of lights has always been a time of reflection and celebration, a time to think about light and light reflections,” said David McAllister, the RA’s director, and chief executive. “We are excited to launch a new digital edition that will be accessible to everyone in the UK, with the same rich visual and textual content of the festival of lights, as well as an engaging narrative that reflects the RA’s dedication to celebrating the light and the arts.”The Festival of Lights’ inaugural edition, “Introduction: The Light of Art” (2019), featured more than 1,100 works by seventy-five artists and filmmakers. The 2017 edition, “Lighting Up: A History of Light” (2014), featured work by forty-two artists", "The next Biennial should be held in the United Kingdom at the end of 2021, and the last in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in New York announced today that Anselm Kiefer has been named its new director. He succeeds Catherine Johnson, who has helmed the institution since 1992, and will assume his responsibilities on January 4, 2021. Kiefer comes to MoCA from Zurich, where he previously served as curator-at-large for the exhibition “The Black Box,” a collaboration between the artist-clients Anna-Sophie Berger, Ursula von Rydstorp, Andre Russell, and Iris Murdoch. He succeeds Lisa Adams, who retired in March 2019 after a decade at the helm of the museum.“Kiefer’s vision and intellectual leadership has been essential to transforming MoCA from a curatorial space into an arts-related destination,” said David Karp, chair of MoCA’s board of trustees. “Born and raised in New York, Kiefer has been a longtime supporter of artists and institutions working in the arts. His extensive experience in international travel, curating, and performance made him uniquely qualified for this task.", "The next Biennial should be in the fall of 2021, and hopefully will be co-organized with the University of Minnesota.  Do you think the museum’s new partnership with the Walker as it enters its sixtieth year will help or hinder its ability to present the best exhibitions possible at a high level?  I think we have a strong role to play in promoting a museum’s legacy as long as the institution continues to be a strong and important cultural asset for the community. I believe that the partnership with the Walker is a positive step in that direction.” MoMA has also announced that it now has a new director. The appointment was made by director and CEO Daniel H. Weiss, who previously served as director of the Whitney and as the founding director of the Metropolitan Museum of Art. The museum currently has three directors: Ian Katz, who has helmed the institution since 1993; former director Daniel H. Weiss, who passed away in November 2018; and current director Michael Riordan, who assumed the helm of the institution in February 2018. The current leadership team also includes Alexander Lippman, who has served as the director of the Whitney since 1999; Anna Press, who has served as the director of the", "The next Biennial should be held in the spring of 2021. The announcement comes amid a continuing debate about how art museums should continue to function after the coronavirus is contained. Many institutions have expressed concern about the direction the museum sector is taking and have urged museum directors to come up with creative and innovative ways to engage with visitors in the coming months.“We are aware of the critical need in the current financial climate for investment to support museums and are doing all that we can to support them in this difficult economic time,” said Diana Truitt, chair of the board of trustees of the Museum of Modern Art. “The next Biennial will be a brilliant opportunity for the next Viennese hermitage to shine its bright and inviting light on the city of Zurich and the world. We are confident that the new exhibition format and the vibrant public conversation will prove a perfect platform for the next Viennese hermitage.” The Cannes Film Festival is planning to boost its engagement with art and will launch a platform, “ArtStation,” that will deliver free, curated exhibitions across multiple themes. “We are already in conversation with several local institutions, including the Stedelijk Museum and the Museum of Art in the", "The next Biennial should be held in 2020, when the exhibition will be staged in the museum. Under the terms of a twenty-year agreement with the United Kingdom, the Biennial has been awarded a total of £38 million ($47 million) over the next three years, with £11 million toward construction costs. The new building, which will be located in Salford, will host the exhibition and will be inaugurated by a showcase of works by Yoko Kanno and Junya Nakaya\u0097the latter of whom was the first to bring a work in the exhibition space.“The pathway through the modernist structure of the museum is the key to its success,” said biennial curator, Andrew Wright. “The new exhibition spaces will provide a new and innovative platform for the collection and exhibition of the works of these two outstanding artists. All the while, the Biennial Museum will continue to have a strong and positive impact on the lives of the local communities in Kent, which is a real shame, given the extraordinary achievements of the Biennial.”\n\n\nThe Museum of London has appointed Sir David Attenborough as its new chair of the Science and Technology Group, effective immediately. He will be responsible for three-", "The next Biennial should be held in 2021. We are still evaluating the best location for the exhibition in the world. If the project is performed well and the exhibition is successful, we should be able to move forward with the exhibition in 2021.\n\n\nThe British artist Michael Akalfa, whose work explores issues such as power, politics, and migration, died Monday at age seventy-eight. He was born in Derby, England, on January 20, 1940. Akalfa studied at the Academy of Fine Arts in London and the School of the Art Institute of Chicago before moving to the University of Sheffield, where he studied under Sir Ian McKellen. He returned to the School of Art in London in 1964, where he studied with Sir David Attenborough, and then went on to study at the Museo de Arte Moderno (MA), Barcelona, the Museo de Arte Moderno, and the Museo de Arte De Barcelona, before moving to the Museum of Modern Art (MoMA), New York, and the Museum of Modern Art, London, in London.In 1982, Akalfa was selected by Peter Wollen to participate in the biennial “The Venetian Legacy” at the Metropolitan Museum of Art in New", "The next Biennial should focus on how the art and architecture of the past three decades can play a more important role in shaping our future—and how we are actively shaping it.” \n\n\nThe Library of Congress (LACMA) has acquired the cultural landmark photographs by Pablo Picasso from the artist’s estate under a long-standing, $6.5 million deal that will also see the latter placed on display in a three-dimensional installation at the National Museum of Fine Arts in Washington, DC.The deal is the largest gift made by the family of Pablo Picasso to the United States and will also include the creation of two new co-op accounts, one for the public and one for the artist. The estate will donate 1,500 prints and the original works, which were given to the institution by Picasso Sr. in memory of his son Pablo Picasso Jr., who passed away in 2008.The family also gave the institution 1,500 photographs, which were purchased for the institution’s acquisition in 1993 and 2003, and donated photographs of the works, which are currently on display in the artist’s workshop, in 2008 and 2009. The family also pledged $1 million for the acquisition of the works.\n\n\n"]