["The next Biennial should take place in March 2020. The theme of the 2020 edition will be “The Future of Life on Earth,” and the opening ceremony will be hosted by the Art Institute of Chicago in October. Sydney, Melbourne, and New York will all be represented by more than one hundred artists, and the Whitney Museum of American Art in New York will stage its first exhibition dedicated to the artist-in-residence program, “Sydney Sculpture Garden/Miranda Lectures,” this fall. The full list of participating artists is as follows:\n\nAnnet G to V 2016 (New York)\n\nKerry Scott Lynd (New York)\n\nLisette Ooi (New York)\n\nKendra White (New York)\n\nMADISON CAFE (New York)\n\nTHE ART OF DIAGNOSTIC (New York)\n\nLouisa Bochereau (New York)\n\nTHE ART OF DIAGNOSTIC (New York)\n\nA.J. Dyson (New York)\n\nB.J. Martin (New York)\n\nC.J. Mendoza (New York)\n", "The next Biennial should take place at a location where there is a historical, cultural or personal connection to the Biennial. In the case of a national exhibition, this means a location in the nation’s capital. For a private exhibition, this could be a studio within the Biennial, or it could be an exhibition at a private home.The three finalists are the Palace Museum, the Museum of Design, and the Museum of Modern Art. The jury, composed of artists such as Adrien Brody, Antony Le Dixon, and Mary Roach, was headed by Peter Wächter. The jury was made up of John Ward, director of the National Gallery in London and the Museum of Modern Art; Janice C. Bache, curator of modern art at the Museum of Modern Art; Polina Dvorkin, a former director of the Museum of Modern Art, and a jury member; Hermann Hesse, a former director of the Museum of Contemporary Art in London; and Janet S. Scheffler, a longtime trustee of the Smithsonian American Art Museum. The judging panel for the upcoming exhibition will consist of Museum director Lisa Knausgaard; curator of modern art Wolfgang Pfeifer; art", "The next Biennial should be a testament to the collaborative spirit and vision of our board of directors. We would like to express our gratitude to our board members, staff, and visitors for their dedication and professionalism throughout the project.” \n\n\nThe National Geographic Society announced today that it is instituting new diversity and inclusivity initiatives in its cultural and educational divisions. The new initiatives will aim to introduce greater diversity of perspectives through the presentation of new works, exhibitions, and events.  The initiatives will include: Opening with a series of interviews, National Geographic will present its new “Beyond the Landscape: Art in the Age of Climate Change” in November 2019. The exhibition will highlight new efforts to capture and store carbon and to prepare for climate change with a view to assessing the impact of climate change on Earth and its environment.A new digital platform that will provide a platform for engaging with and promoting National Geographic’s cultural heritage and will be hosted by National Geographic HQ, in partnership with the Association of Museums, will launch in October 2021. The platform will be developed by the Smithsonian American Art Museum and the National Museum of Natural History and will feature work by artists who are working across disciplines in the fields of history, art, literature", "The next Biennial should take place in 2021. “The impact of the exhibition on the city and region has been immeasurable,” said architect Adriano Nuzzo. “I’m very optimistic that this year’s edition will deliver a breakthrough achievement in the city’s art history and in the development of the arts in Rome.”\n\n\nThe Canadian Arts and Cultural Heritage Foundation (CACFA) announced today that it has awarded $3.8 million in grants to fifty-three Canadian arts and cultural institutions to help them prepare for future events and construction projects. The organization also spent $0.02 million on official hospitality and travel expenses for forty-two events, including the centenary celebrations of Canada’s founding, the Pan-Canadian pavilion at the Fifty-Second Venice Biennale in 2020, and the twenty-second edition of the National Poetry Slam.The organizations that will receive the funds are:The National Poetry Slam: Montreal’s Mira Dancy, Alberta Barlow, and the Los Angeles County Museum of Art; Quebec City’s David Halberstam, the Museum of Contemporary Art Victoria, the Los Angeles County Museum of", "The next Biennial should take place in Beijing in 2022. The 2020 edition, which was curated by Yang Hao and released by the Beijing City Art Museum, won the award for best exhibition series last year.\n\n\nThe Museum of Modern Art (MoMA) in New York has established a $50,000 fund for artists and organizations whose work is currently on display in the institution’s eventual reopening in 2021. The fund will allow artists and museums to avoid construction and renovation delays and develop the exhibition venues for this year’s exhibition “Theatrical Life.”Curated by Amy Sherman-Lee and Mark Geragos, the 2020 exhibition will examine the legacy of the Playwrights’ Guild and its impact on American theater. Titled “Theatre of the Imagination: The Playwrights Guild” and hosted by an ensemble cast that includes Julianne Rind, Jack Ferrell, and Mary Steiner, the exhibition will run from March 19 to March 21, 2020. “We are pleased that this year’s Theatrical Life exhibition will offer a fresh perspective on the work of Peter Sellars, Francis Ford Coppola, and other key figures", "The next Biennial should be held in the first quarter of 2020. We look forward to your support in the third quarter. We Respect Your Time ”The inaugural exhibition will be held at the Institut Pasteur in Paris and will be curated by Pascal Patou. The exhibition will include works by eighty-four artists from the Palais de Tokyo in Paris, the Museo de Arte Contemporáneo in Madrid, the Museo de Arte de Madrid and one grand jury.\n\n\nThe Pérez Art Museum Miami (PAMM) has canceled a planned event with the controversial artist and activist Leila Weefur, who has made anti-Israel and pro-Palestine statements in the past, the New York Times reports. The museum had been slated to present Weefur’s work, “Transmogrify: A Feminist Theory of Race and the Body,” at a Pérez Foundation fundraiser in November. It has also been reported that the event would have featured Weefur’s work and been organized by the Pérez Foundation, the Pérez Art Museum Miami’s board of directors and officials, and a selection of PAMM’s", "The next Biennial should be held in Tokyo in 2020 and the first will be held in Osaka in 2021. The exhibition will be inaugurated by a presentation of the artist’s work, “Elusive Stars,” which will open on December 7, 2020 and will run for ninety days. The exhibition will include fifty works from the artist’s catalogue, which includes “Swan, North and South,” 1947, “Eleanor Robe,” 1957, and “Auf Wiedersehen,” 1957. The biennial will be followed by the Tokyo Triennale in 2021; the Biennale de St Petersburg in 2022; and the São Paulo Triennale in 2022.\n\n\nThe Institute of Contemporary Arts (ICA) in London is preparing to open a new research-based platform for the art world in the city’s St Martin’s Green next month. The first phase of the new initiative, titled the Studio Zone, will partner with major art galleries in the city to create digital platforms that will showcase the work of forty-three artists in the city and will launch on January 1, 2021. “The Studio Zone will be a platform for artists", "The next Biennial should be held in September 2021. \n\n\nThe biennial will now focus on the themes of beauty and performance, ethics and politics, and the concept of history. Its third edition will take place in September 2022 and will include fifty works by seventy-two artists from nineteen countries. The theme of the exhibition will be “The possibilities of history and the past.”\n\n\nOn Monday, the Museum of Modern Art (MoMA) in New York announced that it plans to close its doors permanently. The institution became the latest major cultural institution to make this announcement in recent weeks as it grapples with the fallout from the coronavirus pandemic. The closure means that visitors will be able to visit the museum once again only in twenty-four-hour increments. “After careful consideration, we have decided to close MoMA,” said museum director Daniel H. Weiss. “It has been an honor and a privilege to serve as part of the MoMA family for almost twenty years, and I am deeply proud to be responsible for helping to shape its future.”One hundred percent of the museum’s staff will be let go, with forty-six remaining on temporary contracts. The sixty-one", "The next Biennial should be held in 2022 and the exhibition should include twenty-four artists who work in concert to create new works of art, according to the organizers. “By engaging with and representing the work of the biennial artists in all its varied and expansive forms, we hope that the exhibition will become an opportunity for us all to experience and appreciate the exhibition,” said Natan English, the executive director of the Venice Biennale and former director of the National Museum in Ankara. The British artist and curator Julian Huxley is also among the artists who will feature in the exhibition. A known collaborator of Hans-Ulrich Obrist, Katie Cook, and Mark di Suvero, Huxley was selected for the twenty-ninth edition of the Flemish pavilion by an international jury comprising Konrad Fischer, Fabian Bisetti, Michael Henning, Minyto Hilmi, and Ramón Inés. The award ceremony took place in the German city of Klagenfurt on October 2, and Huxley received the prize in an exhibition organized by the National Museum of Modern Art in Kassel.\n\n\nFrance and Italy are marking the centenary of a race in which", "The next Biennial should be held in 2020. The 47th Venice Biennale will take place in 2021. The seventy-fifth will be held in 2022. The seventy-eighth will be held in 2023. The seventy-ninth will be held in 2024. The seventy-eighth will be held in 2025. The seventeenth Venice Architecture Biennale will also be held in 2021. The seventy-ninth will be held in 2021. The seventy-ninth Berlin Architecture Biennale will be held in 2021. The seventy-ninth Shanghai Architecture Biennale will be held in 2021. The seventy-ninth Cannes Film Festival will be held in 2021. The seventy-ninth Berlin Design Museum will be held in 2021. The seventy-ninth New York Architecture Biennale will be held in 2021. The seventy-ninth Venice Architecture Biennale will be held in 2021. The seventeenth Venice Architecture Biennale will be held in 2021.  The seventy-ninth New York Film Festival will be held in 2021. The seventy-ninth Venice Architecture Biennale will be held in 2021.  The seventeenth Venice Architecture", "The next Biennial should be a serious challenge to the ideological foundations of the institution. The exhibition should be especially concerned with the questions of the life of the human being and the life of the world. The proposal of the exhibition is to be based on the idea of a living thing; an image, an idea, an idea of the sacred, a living being. I hope that the initiative will become a source of inspiration for the creative life of the city. The show should be a celebration of the creative process, of the infinite possibilities of image and thought. The art should be a reflection of our communities life, our own values, aspirations and dreams. The exhibition should be a response to the crisis of values, of the loss of the core values of the city. The exhibition should be a reflection of the creative life of the city. Artists and designers are the embodiment of all that is most important in our lives. We are the future of the city.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has announced that it will not be taking down Lloyd Kaufman’s sculpture The Death of Stalin, which has been in storage at the institution for more than twenty years, in 2020, in an effort to preserve the artist", "The next Biennial should be held in 2022. “When we looked at the 2018 edition, we knew that it was a huge step forward,” said Rob Thomson, the curator of the show. “In the twenty-first century, our audience has grown exponentially. We are seeing the power of art and creativity in the digital age. The questions of the century are now being questioned. The work of art in the twenty-first century is being reinvented and rethought with every passing year.”The 2020 exhibition was curated by Martin Lartigue, curator of contemporary art at the Museum of Modern Art, and Marcel Leopold’s husband. The exhibition featured work by some seventy artists, including Mark di Suvero, Felix Durán, and Laura Owens. In addition, the Biennial was given the designation “on the road,” a designation that honors the artists who have been making long-distance journeys in order to engage with the surrounding area.\n\n\nThe Hirshhorn Museum in Washington, DC, has appointed Emmanuel Pape as its next executive director. Pape will take the helm of the Hirshhorn, which was founded in 1961 by famed African American artist Walter de Maria, in January 2021", "The next Biennial should take place in the spring of 2021. The third Biennial will be held at the Museum of Contemporary Art (MoCA), in New York, in the fall of 2022. The second, which was organized by the Los Angeles County Museum of Art (LACMA), is currently on view at the museum until the end of September.The theme of this year’s biennial is “We Live in the Present.” The exhibition will feature works by fifty-three artists, including the Los Angeles set - featuring work by Joseph Beuys, Sara Berenicelli, Kate de Keers, and Carol Alexander - and will be inaugurated by an exhibition of work by Henry Kuttner, who died this year, in November.The Biennial will also include a new book, Find Your Path: An Exploration of Life and Work, which will serve as a companion work to the exhibition and will be published by the Museum of Contemporary Art Los Angeles in February. The exhibition will be followed by the second exhibition of work by Mark di Suvero at the König-Bickel Gallery in Berlin in June. The third installment of the exhibition is currently on view at the", "The next Biennial should take place in Lisbon in 2021.\n\n\nAs London embarks on a series of major revamps to make its streets and transport system more inviting, hundreds of arts workers are staging protests in Tate galleries, Lambeth Palace, the Tate Modern, the British Museum, the Tate, the Somerset House, the Somerset Museum, the Tate Victoria, and the Tate Wilton. The demonstrations are part of a monthlong campaign to “give our cities and towns a new lease of life,” the Art Newspaper reports.Organizers of the campaign “don’t want London to get any worse off than it is,” London Assembly Member Anne Main, chair of the Local Government Association’s transport committee, told the Art Newspaper. “We want London to thrive. We want people to come and visit and shop and come to London. We want people to enjoy it. We are not interested in lecturing anybody about how to live in the city. The city is doing what it can to make sure that when we come to London in the next few years, it is as welcoming a city as it can be.”Among the institutions that have announced plans to make their streets more inviting are the British Museum,", "The next Biennial should be held at a location that will offer access to the site, including a museum, a public building or a cultural space, where visitors will be able to enter and view the main exhibition. Organizers said: “The museum will take up the theme of a ritual act that occurs at a site that is sacred to the local people, and will use this as a way for visitors to experience the site in a different way.”The first edition of the event, which will be held in the summer of 2022, will focus on the Dadaists’ compositional relationship with the main exhibition. Finalists for this year’s prize were: Digital Life, Essays on the Present, and Toccarra. \n\n\nAn aerial view of the artworks of the inaugural edition of the Beijing Biennial, which opened on December 6 and ran through December 25. Courtesy of the Beijing Art Biennial.\n\n\nThe Antenna Art & Design Museum in Seoul (AAMD) announced today that it has received a gift of fifty-six works by twenty-six South Korean artists, including Park Hyo-sung, Kim Dae-sung, Kim No-min, Kim Kyung-ky", "The next Biennial should be held at the Museum of Modern Art, in New York, in 2024. Next year will mark the fifty-seventh anniversary of \"Art for America,\" an exhibition of original works, organized by the Philadelphia Museum of Art (PMA) and the Metropolitan Museum of Art, and inaugurated by the artist Lydia Evans. The show will feature work from forty-eight artists (including Rainer & Huebel, Fogg & Oost, and Augusten Solt, among others from the Midwest), and will also introduce the biennial to the public. The subject of the show is “Race and the American Imagination” and the biennial’s theme, “Art for America,” is “Race and the American Imagination,” a reference to the exhibition “Race’s Place in American Art,” which examines the role of race in art and its influence on contemporary art.\n\n\nThe Alma Mater Society, a group that aims to create a platform for experimental art, has announced that it is launching an attempt to reënload the art world into a once-in-a-generation cultural event. The group is partnering with the Winograd", "The next Biennial should be held at the same time as the inaugural one, according to organizers. The next iteration will also take place in the same location to better reflect the city’s evolving multicultural landscape. Expectations for the event are that the location will be updated with new activities and programming, and that the theme will reflect the city’s shifting identities. “We are always looking for ways to improve the biennial experience,” said director Tania Bruguera. “It is an important time for us to think about ways to make it meaningful for the audience and reflect on contemporary realities.”  The first version of the event, which was held in 2019, featured the work of seventy-three artists. The biennial was cancelled in February 2020, following the pandemic, and Bruguera said that the next iteration will “reconsider the history of the biennial as a whole and its role in the city’s dynamic cultural community.”\n\n\nThe Metropolitan Museum of Art (M.M.A.) in New York has appointed John Tietjens as the next director of its collection of nineteenth-century American art. He will succeed Edward L. K", "The next Biennial should take place in the fall of 2020. We look forward to welcoming you to the Farm in 2021.\n\n\nThe Aspen Institute in Germany is planning to open a new wing in the city of Aspen, which will be dedicated to cultural exchange and collaboration, in the summer of 2021. The new institution, which will stand on the campus of the Aspen Institute, will be named after the ancient Aspen Forest and will feature an exhibition hall, a library, and an auditorium.The project, which was inspired by the institute’s founding, the Aspen Biennial, was launched by the Aspen Institute in partnership with the German state government and the Aspen Institute for Contemporary Art in cooperation with the city of Aspen. The project will be led by Sebastian Lang, who has previously served as the artistic director of the institute and as the artistic director of the Museum der Moderne Frankfurt, and will be led by Janez Wächter, who will work with the Aspen Institute in collaboration with local artists and architects to re-create the institute as a destination for cultural exchange and discussion.The announcement of the project, which was first announced in 2015, was made in preparation for the twenty-fifth edition of the As", "The next Biennial should be held in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is in the process of revamping its sculpture garden to increase the accessibility of the institution for everyone, regardless of financial means, and is collaborating with the New York City Department of Cultural Affairs (CADA) to create a new public art installation, The Harrow, that will feature works by eighty-four artists in twenty-four different themes by the artist-in-residence, the artist-in-residence group, and the artist-in-residence’s namesake. The installation will be on view in January 2020 and will be centered on the Harrow, a central piece of the Richard Diebenkorn’s sculpture Garden, a series of Twelve glass-enclosed courtyards built in 1973 in Bergen, Denmark.The garden is an extension of the artist’s late father’s home in Downtown Manhattan. The garden’s sculptures are arranged in geometric formations that draw attention to the landscape and convey a variety of themes, including the relationship between space and the human experience. The garden is a collaboration between MoMA curators and architect Daniel H. Weiss,", "The next Biennial should have taken place in 2021, and the first exhibition, titled “Ludwig and January” in 2022. This is the year of the eighteen-month-old artist’s death, and the event will carry an artistic theme to emphasize the artist’s early years and the artist’s relationships with her parents and siblings. Feminist artist Astrid and Christianne Bergsgaard, the director of the San Francisco Museum of Art, are among the artists who will represent Denmark at the 2020 edition of the United Arab Emirates, also called the Red Sea, which was held in Dubai in March. The event will be held in the Red Sea at Al Umm Al Manarat, the new residence of the artist.\n\n\nThe forty-five-year-old director of the New York City Museum of Art, Joseph Kahn, has announced that he plans to resign in March 2020 and become the next director of the Metropolitan Museum of Art. According to the New York Times, the decision was made in order to fulfill his lifelong dream of becoming a private collector.“This was a great opportunity to be apart from the kids and to devote my life to my kids,” Kahn told the New York Times.", "The next Biennial should take place in 2021.  Nominated by a jury comprising Cardona, Gramsci, and Werner Becker, the twelve artists were chosen by a committee chaired by Marking Museum director Mariella Nassar. The exhibition will be based in St. Louis and will be curated by artist-in-residence Juliette de Maistre.The art museum is extensively building its reputation as one of the most influential cultural institutions in the world. It recently opened an original, state-of-the-art building in the city’s Financial District (the Marfa Center), completed a $160 million overhaul of the museum’s building in 2007, and inaugurated its new campus in 2001. In addition to building the museum, the center’s new Doris Duke-designed building, which opened in 2001, also has a bookstore, a film theater, an educational center, and an amphitheater.In its new role as the centerpiece of the city’s cultural landscape, the institution is opening a new digital platform dedicated to exhibitions, education, and research. The platform, called ArtConnect, will offer a catalog of more than 1,500 exhibitions that were presented in", "The next Biennial should take place in 2021. Last year, MCAFAM decided to postpone the event, citing the ongoing health crisis in Syria. The organization’s director, Tarek Atoui, told the Art Newspaper that the decision was made in light of the coronavirus outbreak in Africa and the ongoing conflict in Syria. In light of the coronavirus outbreak in Africa and the ongoing conflict in Syria. He said: “The new festival will have an extraordinary opportunity to engage with the artwork of the artist, particularly in relation to the conflict in Syria, and ‘the relationship between Syria and Lebanon.”\n\n\nAfter a jury in New York found that the Pittsburgh Art Museum violated the federal Fair Labor Standards Act by giving paid curators and staff of a theater-based exhibition a one-day contract to stage a show in support of the Black Lives Matter movement, the institution was ordered to pay $1.25 million in back wages and penalties. The $55,960 fine was imposed in the case of Andrew Parrish and Evelyn Palmieri, who were employed by the institution as a part-time staff and were contracted to the museum as contractors. The duo were charged with violating the", "The next Biennial should be held in 2022.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it is sending forty-five artists from the Museum of Modern Art (MoMA) and the Museum of Modern Art in Harlem to the city for the city’s upcoming Art of the Future exhibition, “Spring/Break/Armageddon.” The sixty-five-foot-long film, which will feature contemporary pieces by forty-eight artists, including Michael Lonton, Terence Blanchard, Robert Irwin, Mark di Suvero, and Jeremy Deller, and will run for twelve weeks.The exhibition, which will expand the DCLA’s collection of contemporary art and create a series of installations that will culminate in a three-mile-long stage, was created as part of a $550 million overhaul of the Manhattan Museum of Art, which was completed in 2017. The renovation included the organizing, building, and installation of the DCLA’s first permanent encyclopedic collection of contemporary art, which opened to the public in 2015. The Encylopedia of Modern Art was constructed in partnership with MoMA in collaboration with the MoMA team and community. The new collection", "The next Biennial should be a retrospective of its first season\u0097in the summer of 2019, at the same venue\u0097and should be a combination of the three themes\u0097travel, architecture, and theatre.\n\n\nThe Gypsy Museum in New York has received a $1.5 million donation from art collector and philanthropist Mike Kelley. The donation, made on behalf of his wife, the artist Marie Curie, and their son, Alexander Kelley, was made during a special exhibition at the museum that included works by six artists selected from a pool of sixty. The exhibition opened on August 4 and ran until October 2, with the exhibition dedicated to Francis Alberti and Joe Curio, the latter of whom is best known for creating the psychedelic rock-steady paintings that define the Gypsy aesthetic.“We are very excited about this gift,” said Kelley. “It is our privilege to support and enrich the Museum’s collection of contemporary art by showcasing these works in a meaningful way that will include the Gypsies. We are hopeful that these works will help to rekindle the passion and energy of the Museum’s Gypsy community, and that this exhibition will help to establish a new set of", "The next Biennial should take place in 2021. The full list of participating arts and cultural organizations can be found here . \n\n \n\n\nThe German city of Essen has replaced the ten-acre site of a Nazi concentration camp with an expanded exhibition space that augurs more than a thousand years of Germanic artistic achievement. The museum, whose terminal buildings are set within a vast conserved landscape, created a new exhibition space for the Kunstverein in the city center. The Kunstverein, a World War II–era art collective, staged its first exhibition in the city in 1933.The new venue called the Institute of Contemporary Arts (Kunstverein) in Essen is located at the intersection of the old regional assembly center of Berlin and Munich. The institution is being created as part of the city’s plan to integrate the regional arts into the city, as part of the €80 billion ($90 billion) plan to reform Germany’s interior.The new exhibition space will include the first König-Boden exhibition in the city since 1967 and the first exhibition in Germany since 1945. It will also boast a library with three hundred documents from the exhibition, as well as a design by the", "The next Biennial should focus on exploring new models of representation, exploring how we construct, manipulate, and interpret ideas of art, including how art can be imagined and enacted through interactive, participatory, and participatory experiences. We should explore how it may be possible to create new accounts of the world outside of the museum and to how this may affect the museum, its collections, and the experience of art.”  The next iteration of the Hauser & Wirth: Images of a Life exhibition will take up the theme “Art and the Body” in 2020.\n\n\nNew York’s Metropolitan Museum of Art (MMAD), the Whitney Museum of American Art, and the Philbrook Art Museum in New York are among the many institutions that are currently experiencing disruptions due to the coronavirus and are preparing for a potential shutdown during the pandemic. The news comes on the heels of New York’s Governor Andrew Cuomo announcing on Friday that the state is preparing to shutter its public arts organizations as of March 15 and that the state will rely on local, state, and federal governments to continue providing funding to those institutions through the end of May.By shutting down operations, the state is hoping to minimize the coronavirus’s", "The next Biennial should be held in 2020.\n\n\nThe Association of Film Archive Professionals (AFAP) announced today that it is launching a new $75 million fund designed to preserve the archives of some 5,400 American film artists in an attempt to prevent the loss of millions of works. The fund will support the collection of works that were made by sixty-seven American directors between the years of 1925 and 2014. It will also support the preservation of archival materials in order to allow the collection to be studied by scholars and the public.“The primary goal of AFAP’s archiv program is to support the intellectual, creative and financial health of our archivs,” said AFAP president and CEO John Orsi. “This fund will do that, and more. We believe that a rich and comprehensive history of film art is an essential component of the intellectual and artistic heritage of America. We are committed to supporting filmmakers, archivs and museums in making a work from the collection, and we will continue to educate and advocate for their use in the furtherance of this valuable collection.”Over the last twenty years, AFAP has organized more than $75 million in grants to more than two hundred institutions, including the", "The next Biennial should be in the spring of 2021.\n\n\nThe Whitney Museum of American Art in New York has given $1.7 million to support the work of thirty-six artists and collectives whose work will be exhibited at the biennial “The Shadow of Silence,” which will be held at the Museum of Modern Art (MoMA) in New York from March 13 to March 21, 2021. The exhibition is being organized by Cindy Sherman Gallery and Nari Ward, both of whom were recently awarded a MacArthur Fellowship for their contributions to the art world.“We are grateful to MoMA and the biennial for recognizing our value and making the show possible,” said Nari Ward. “In addition to the exhibition, we are grateful for all of our collaborators, especially our artists who have made the show possible. Having their work and vision featured in a biennial exhibition.”The thirty-six artists nominated for the honor include Tanya Konoval, Claire Hunter, Glenn Ligon, Tamekia Neshad, Ana Mero, Sara Pindell, Kenzo Tange, and Samantha Schoelk", "The next Biennial should take place in 2021, according to the ceremony, and will feature fifteen artists from the sixteenth through the fifteenth centuries. The artist-led event will be based in the museum’s collection and will be organized in such a way as to allow visitors to view the works in the exhibition. It will follow the theme “The Kuzma Effect: Painting in the Sixteenth Century” and will take place on the first floor of the new building. “The Kuzma Effect: Painting in the Sixth Century” is the theme of the fifteenth edition of the Kuzma Biennial. Its five-month run will run through March 20 and will be followed by a special exhibition marking the fifteenth anniversary of the institution.The art historian Melchior Garofoli, who curated the exhibition as well as “Introduction to Ancient Art” (2017), the inaugural exhibition of the Kuzma’s new building, said: “The Kuzma Institute’s new building is a hallmark of the Kuzma museum, creating an ideal setting for the exhibition of the new exhibition. The programme of the exhibition is also trans-Atlantic, reflecting the continuous evolution of", "The next Biennial should begin in January 2020 and run for three years. ArtPrize has released the full list of participating artists and galleries in the 2020 edition of the ArtPrize: 1. Lisa Ann Horne (New York & London, UK)2. Andy Warhol (New York & London, UK)3. David Mead (New York & London, UK)4. Thomas Edison (New York & London, UK)5. Joanna Pape (New York & London, UK)6. Flora Georg and Tadeusz Kosztice (Austria)7. Adrienne Edwards (New York & London, UK)8. Alan Watts (New York & London, UK)9.  Alan Parsons (New York & London, UK)10. Carl Jung (New York & London, UK)11. Catherine Steiner (New York & London, UK)12. CATHERINE STEINER - NEW YORK & LONDON, UK 1, 2, 3, 4, 5, 6, 7, 8, 10\n\n\nThe United States Holocaust Memorial Museum has released pictures of several hundred items from the collection of", "The next Biennial should take place in 2021. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has announced that it will not move forward with the planned opening of its new home in Millennium Park, which was constructed in 2009 and opened to the public in 2012, citing the California Air Resources Board (CARB) certification process as the reason. This means that the institution will not be able to begin the reopening of its new home on July 1, 2021, and will instead have to remain open during the month of June.The museum has faced several setbacks in its attempt to complete the park in the last six years, including a legal battle with the California Air Resources Board (CARB), which claimed its authority to oversee environmental quality in the park was being undermined by the construction of a two-level, 7,000-square-foot building adjacent to the museum, and a lawsuit by the city of Los Angeles, which argued that the museum’s plans to build a new building—which is slated to be completed in 2017—were too far along to reopen. Both the city and the museum say they still need to finalize design specifications for the museum’s new home, which will sit on the third floor of the", "The next Biennial should focus on “Jewish art in the twentieth century” with an emphasis on the ’s place in art history,” a statement from the organizers of the exhibition said. The event will also encompass a series of discussions on “the relationship between contemporary art and the Holocaust,” and on “the need to reconceive the Holocaust in our present geopolitical environment.”As the conflict in Syria rages on, the conflict in Palestine heats up, and the conflict in the Middle East continues to escalate, the German government is preparing to implement new security legislation that will make it a crime to show a “substantial decrease” in the number of migrants entering Germany. In a new regulation that will be published this week, the Federal Office for Migration and Refugees (BAMf) will make it a criminal offense for a person to “disguisely show a reduction in the numbers of migrants entering or leaving Germany.” The publication also outlines offenses that can result in a one-year prison sentence—a move that is expected to make Germany the first country to remove the “collective name” of a refugee hostel or migrant center from a building in Berlin.According to the Federal", "The next Biennial should feature work from the Los Angeles–based artists who have recently won the $10,000 Michael W. Winship, $10,000 Stanley Jean-Michel, and $10,000 Hubert de Menil awards. The other $10,000 Michael W. Winship awardees are Dominique Laporte (Paris), Bénédicte Savoy (New York), and Jean-Pierre Watte (New York).The full list of winners is as follows...Artists Awarded $10,000:Antoine Morin, Los Angeles (US)“I’m Not Afraid to Die,” October 7, 2018Artists Awarded $10,000:Albert Klima, New York (US)“The Strangers (Auswesta Berlin)” October 26, 2018“Catherine Mezher, New York (US)“Telling the Truth About My Life” September 20, 2018“Peter S. and Mary S. Kuzma, New York (US)“The Alamo: A Real Texas Town” September 21, 2018“Rebecca Solnit, New York (US)“", "The next Biennial should take place in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Ankitaswini Mural, digital artist and activist, and Madhvi Mural, a Mumbai-based artist and cultural curator, as its new deputy directors. Mural will be the third person to lead the institution since its founding by American businessman and collector Thomas K. Galbraith in 1971. “We’re thrilled to welcome these two highly respected artists to the board,” said David Greenfield, chair of the board of trustees. “They’re talented and driven and have the potential to make important contributions to the museum and the city.”Mural, whose practice spans painting, sculpture, video, installation, and performance, said: “The board’s support of the artists and their vision for the museum is an important step in making the museum a compelling destination for visitors to New York.”\n\n\nThe 2018 exhibition “In the Eye of the Storm: Brene Brown’s Skin and the Eye of the Storm,” which opened at the New Museum in New York on June 3, has announced that it will return next year", "The next Biennial should be held in the spring of 2020.\n\n\nThe Huashan Museum of Fine Art in Beijing, which has been closed since April due to the Covid-19 pandemic, is moving forward with plans to open to the public in the fall. According to Artnews, the institution’s new director, Wu Dui, told the Art Newspaper that the institution is “actively preparing for a good future and is actively looking for visitors.” The institution has already attracted more than 1.3 million visitors since it rebranded from the Hong Kong Art Museum (HAL) in 2016.\n\n\nThe Sundaram Museum in Chennai has made a big investment in the entire building’s renovation, bringing its total restoration budget to Rs. 25,000. The renovation will also improve accessibility and promote conservation, with the aim of protecting the Sundaram’s original stained-glass windows and preserving the institution’s original arched roof.“We are very excited by the new vision of the Sundaram Museum,” said Sundaram director and CEO A.S.R.M. Sundaram, who added that the renovation is about “making art from the environment,” and about", "The next Biennial should draw from an artist-led list of contemporary artists chosen by a jury comprising Domenico De Angelis, Francesco De Angelis, Carlo De Cesaris, Filippo De Benedetto, Joao De Bono, Elena Di Trienna, Jia Zhangke, and original winners of the first and second Biennial Medals. Prior to Phase 3, the artists will work with a rotating group of curators and curators will work together to create a theme for the third Biennial.The second biennial was held in Milan in September 2019 and was modeled after the philosophy of Karl Lagerfeldt, a German photographer who manipulated images to make his work into a form of sculpture. The artist-run exhibition was conceived by Marina Peić, the curator of contemporary art at the Institute of Contemporary Arts in Milan, and was organized by Redfern Studio, the artist-run space in the city. In the exhibition, set to open in January 2020, Peić will present a selection of his works under the direction of Shigeru Ikeda, the curator of contemporary art at the Museum of Fine Arts, and his team will present a project for Milan in 2021.The biennial will also include the", "The next Biennial should be held in 2019.\n\n\nAmerican painter Erma Bombeck, whose exquisite landscapes and powerfully sensual paintings burst with energy and humor, died on February 6 at age eighty-nine in New York City. The Kennedy Center in Boston has designated the venue the National Gallery of Art, and the artist’s hometown of Eden Prairie, Minnesota, has become a staging ground for her work.Born in 1935, in the small town of Eden Prairie, Minnesota, Bombeck studied at the School of the Art Institute of Chicago, the Art of Painting Institute of Chicago, and the New School, where she met her husband, the painter John Thomas, and their son, Tim. From 1975 to 1984, Bombeck lived and worked in New York City, where she focused on painting and sculpture, primarily in the city. Her work was exhibited at the Metropolitan Museum of Art, the Whitney Museum of American Art, and the Brooklyn Museum, and she was a member of the Los Angeles County Museum of Art, the Los Angeles County Museum of Art, and the Los Angeles County Museum of Art.Her first solo show in the United States, for which she used a stenciled canvas she planted in 1981, was at the Metropolitan Museum of Art in 2007", "The next Biennial should be held in 2021. \n\n\nOne hundred years after the Pablo Picasso Foundation first launched the Picasso Prize, the organization is launching a new initiative to honor the work of American artists who have had important contributions to their countries, the United States, or the world. The Poster Children program will provide $5,000 grants to cultural and academic leaders who are working to impact the global fight against the HIV/AIDS and climate change crises.The initiative, which was developed by the Pablo Picasso Foundation, the DC–based arts organization American Artist Relief, and the American Alliance of Museums, was inspired by a personal crisis of conscience for artist William S. Burroughs. After discovering he had HIV, the New York–based Burroughs established the AIDS Treatment Network, which works with individuals and groups affected by HIV and AIDS to provide free medical, drug, and information services.Through the initiative, the Foundation hopes to create a new legacy for the Picasso Prize. “Over the years, artists have shown the effectiveness of art as a tool for social change,” said David Schipper, the executive director of the Foundation. “By now, artists and institutions in every country in the world realize that art", "The next Biennial should be held in 2020 and will incorporate an additional eight works from the collection. The exhibition will be held at the Kunsthalle Basel in Switzerland and will run for twelve months. \n\n\nThe Los Angeles County Museum of Art (LACMA) is launching a new public art project, Artadia, a series of public art projects that will address the issues of sustainability and inequity in the city and region. The initiative will provide free, year-round programming designed to engage LACMA residents, and will focus on issues such as air quality, energy use, urban planning and land use, and water.“LACMA is at the forefront of the movement to address climate change and to reimagine how we live, work and play in the face of it,” said Kirsten Forbes, director and chief creative officer of the museum. “This new scheme will build on the work of LACMA’s artists and present it in an arts-focused way that will also foster social change and reduce our environmental footprint.”The first project in the series is Artadia 2: The Future Is Now, which will launch on September 26 and run until November 20. The exhibition will consist of forty works that", "The next Biennial should take place in 2021, but a spokesperson for the central London venue said that the date had not yet been set. A series of exhibitions, performances, books, and other events have been suspended across London because of the Covid-19 outbreak. The schedule for the biennial has yet to be announced.\n\n\nThe Museum of Fine Arts (MFA) in Boston has cut more than $2 million from its endowment in the wake of the novel coronavirus. The museum spent $8 million on acquisitions in March, including $4 million on a new Prada collection featuring pieces by Cara Delevingne, $2 million on a new Levi’s collection, and a $400 million restoration project on its holdings of the nineteenth- and twentieth-century fashion.Acting on behalf of the trustees of the MFA, which was founded in 1889 as a new kind of museum, the trustees announced that they had used the funds to restitute artworks, including more than $1 million for the acquisition of pieces by the French avant-garde and the MFA’s collection of works by American artists such as Louis Vuitton, Richard Diebenkorn, and Ralph Lauren. The rest came from", "The next Biennial should also be held in 2021. For the past six years, the institute has been organizing events that reflect the diverse cultural, spiritual, and social traditions of South Korea and is currently working on a project that will include exhibitions, lectures, concerts, workshops, lectures, and other events that will celebrate Korean artists and cultural institutions.\n\n\nThe Museum of Contemporary Art (MoCA) New York has appointed Adam Gopnik as its next executive director. Gopnik comes to the institution from the Museum of Modern Art (MoMA), where he has served as deputy director of communications and curator of contemporary art since 2016. He will assume his responsibilities on January 1, 2021, and will begin his position in January 2022.“With great enthusiasm, we are pleased to welcome Adam to MoCA,” said director Richard Armstrong. “We are proud to be able to bring him to New York and are committed to his continued growth as our global ambassador for contemporary art and his ability to develop and enhance the museum’s collection and program.”Commenting on his new role, Gopnik said: “I’m honored and excited to be a part of MoCA’s incredible history and to expand on", "The next Biennial should take place in 2021 and will include a selection of works by eleven artists working on projects with the current exhibition. Each year, the group will present works by artists previously selected for the inaugural exhibition, which was organized by the Los Angeles County Museum of Art (LACMA), and will showcase the work of four more artists: Sohrab Mohebbi, Alexei Cheremaly, and Alex Gartland—all of whom have won prizes at the show.The event’s inaugural exhibition, “Come Together,” will take up the themes of “Divorce and the Body” and the future of family and will include work by the group of twenty-two artists who are currently working together under a tent in the desert in the Southern California city of Maricá, California, and will invite visitors to the desert tent to tour the artists’ works.The exhibition is being organized in partnership with the Los Angeles County Museum of Art (LACMA), the Los Angeles Public Library, the Los Angeles County Museum of Art (LACMA), the Metropolitan Museum of Art, the San Francisco Museum of Art, and the San Diego Museum of Art. The upcoming biennial, “Live in", "The next Biennial should be hosted by the University of Oslo, which is currently preparing for its second edition, which is being co-organized by the University of Oslo, the University of Copenhagen, and the University of Gothenburg. The first edition, which will take place in 2020, will focus on the history of the exhibition from its inception to the year 2022. The second edition, which will take place in 2023, will be hosted by a different institution, the Bermuda Triangle Institute for Contemporary Art, in New York City.In a letter sent to the Biennial’s organizers, which was seen by The Guardian, Diana Al-Hadid, director of the Museum of Modern Art, and Yusuf Ibrahim, co-chairs of the Bermuda Triangle Institute for Contemporary Art, said: “Over the years, we have been inspired by the courage and ingenuity of the artists who have put forth their own visions and by the combined vision and energy of the organizers, partners, and curators. We are now excited to bring forth these visions in the form of the Venice Architecture Biennial.”The Venice Architecture Biennial will be curated by Marina Sforza, who previously served as the artistic director of the Singapore Biennial and as the director", "The next Biennial should take place in the spring of 2020. The fourth exhibition in the series will be staged in the autumn of 2020. The fifth, which will be mounted in mid-November 2020, will be the last exhibition of the Winterthur series that year.  For a full list of exhibitors, visit www.francolemba.it. The biennial will be split into four parts. The first part will take up contemporary art and architecture; the second part will focus on the history of the exhibition and its exhibition; and the third part will be devoted to the theme, the art objects, and the work. The forty-fifth, which will be held in the spring of 2021, will be the last Biennial presented by the university. Following the announcement of the 2021 edition of the Biennial, the university said: “The Faculty of Arts Museum is thrilled to announce that it will be hosting the fifteenth Biennial of the Art of Life in the spring of 2021. This is the twenty-fifth edition of the Biennial. A great achievement for the Faculty of Arts Museum to have such a successful exhibition program for the last twenty-five years.”\n\n\nThe Museum of Fine Arts", "The next Biennial should be a chance for artists and thinkers to come together. I believe that the next Biennial will be an opportunity to step into the shoes of a group of artists who were implicated in what happened in Paris, to step into their shoes and take part in their lives. I believe that this will become a powerful political act, a moment to reclaim the untrammeled spaces within us all that are full of meaning and beauty. And I believe that this will become a moment to move forward. I believe that this will become a moment to renew one's humanity. I believe that this will become a moment to mourn the loss of everything that is precious and precious in the world. I believe that this will become a moment to remember that we are one people and that we are one people only. I believe that this will become a moment to heal our collective souls. I believe that this will become a moment to reflect on the ways in which we all inhabit the same life. I believe that this will become a moment to mourn and to reflect upon our collective existence. I believe that this will become a moment to pray. I believe that this will become a moment to sing. I believe that this", "The next Biennial should take place in the spring of 2022. The project will be inaugurated by a photoshoot with two female artists, the artist Irma Alvarez and the human rights activist Leila Weefur, who were among the fifty-six people who were imprisoned for protesting the Saudi Arabian government’s human rights abuses, including the death penalty.The annual event, which was founded by American photographer Mario Tama and features an exhibition space in the city of New York as well as teams of internationally-trained artists, executives, and curators, will have its first exhibition dedicated to feminist artists at the event in 2022, when the artist-in-reformer Elin Rodrigues (Tama) and her partner Jessica Stern (Stern) will present “Gloria Karolinać: The Biggest Loser,” which will be followed by an exhibition of photographs by the artist Rachida Agrawal. The biennial will also encompass a lecture by an expert curators from the United Kingdom and the United States.\n\n\nThe Philbrook Museum in Bemidji, Minnesota, has received a gift of twenty-six works by the artist Matthew Ward, who was one of the earliest to pioneer experimental photography in his", "The next Biennial should be held in 2019. \n\n\nThe Guggenheim Museum in New York has announced that it plans to reduce the working hours of all of its employees by 30 percent, to forty-eight hours a week, beginning in April. The move is part of a comprehensive restructuring that will involve the museum’s transformation from a conserved regional gem to a new public space that will connect two of the institution’s most popular galleries: the Museum of Modern Art and the Metropolitan Museum of Art.According to the New York Times, the restructuring—which was made on the museum’s behalf by the museum and will involve a combination of hiring, training, and other administrative changes—is part of a deal that will involve the immediate dismantling of the museum’s holdings of art from the collection of wealthy donors. As part of the restructuring, the Guggenheim will introduce two new public platforms for the collection, one of which will be a digital portal that will allow visitors to view the original works, which will be available for purchase or scholarship.The new public spaces will be modeled after the museum’s newly opened reception spaces, which were completed in 2017, and will offer increased viewing capacities. The first platform,", "The next Biennial should take place in 2022. The project was established in 2015 to promote artmaking and research in Bangladesh through a platform that provides technical support and inspiration to artists and researchers through a year-long residency program.\n\n\nThe Museum of Fine Arts (MFA) in Boston—the institution that staged the first exhibition of work by Japanese artist Tatsuya Takada—has appointed Matsuda Anya as its next director. Anya comes to MFA from the Studio Museum in Tokyo, where he currently serves as director of Fine Arts. Previously, he was the deputy director of curatorial affairs at The Hague, the Netherlands, and the director of the Dockyard in London.“We are thrilled to welcome Matsuda Anya. He is a brilliant and highly capable leader, whose leadership skills and commitment to artists, curators, and audiences are second to none,” said Peter W. Z. Haus, chair of the board of trustees of the museum. “Museumgoers can expect a show that is both expansive and grounded in a real history of art making in Japan.”\n\n\nThe National Gallery of Art in Washington, DC, has become the latest American institution to suspend operations following the deadly, months-long riots", "The next Biennial should be held in 2022. \n\n\nSince its establishment in 1924, the Museum of Modern Art (MoMA) has been the center of a multi-million-dollar lawsuit over its ownership of works by and about artists whose works were damaged or destroyed by the New York Police Department (NYPD). On Monday, a federal jury found that the museum failed to address allegations of police violence leveled at MoMA by several of its former employees, and resulted in a record $8 million loss in profits for the company. The verdict follows a yearlong investigation led by William H. Fitzpatrick, the former head of MoMA’s board of directors, who was also responsible for the departures of the current board members, including Chase Zakaria, who resigned after he was implicated in the beating of Rodney King in Los Angeles in 2014, and the late designer Hisham Al-Qasimi, who was recently charged with murder in the 2014 death of Jamal Omar.“In the case of the NYPD, the jury found that MoMA has long ago abandoned all attempts to address and correct the systemic racism and police brutality that exists at the heart of the museum,” said David Forgione, a lawyer for the", "The next Biennial should begin in 2024 and conclude in 2026. \n\n\nAmerican Folk Art, an exhibition that features selected works by artists such as Carl Barks, Robert Rauschenberg, and William Kentridge, has announced its representation of American painter Thomas Alessandria in Japan. The show will focus on themes of memory and memory's memory, as represented by the artist in his iconic 1964 and 1982 paintings.The forty-eight-by-sixty-four-inch photographs by the artist are titled After My Collapse and Into The Night, Coming Home, and The Night That Never Was. Both works were created for the show, which is curated by Sadao Ando and comprises thirty-two works. The works will be on display in a new exhibition, “American Folk Art,” in New York in March of 2020.\n\n\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) is launching its new online viewer-experience platform, the Muse+ Viewer, to better engage with the works of underrecognized contemporary artists. The platform will launch with a retrospective of American painter Julia Stiles in June and will be followed by a lecture series in August 2020. Museum director Michele Burton told the", "The next Biennial should be held in 2020. The 2020 edition will take place in the City of Oslo and will run from February 22 to February 29. The 2019 edition was held in the Museum of Modern Art at the University of Oslo and consisted of a series of five exhibition tracks, each of which had a minimum of ten works on view\u0097ranging between five and fifteen thousand. The exhibition, titled “Greater Europe: European Art Since 1945”\u0097was organized by the researchers from the Max Planck Institute for the History of Ideas in Cologne and will be accompanied by a monographic exhibition titled “Telling Stories: The European Art of Pertti Olle,” which will also be at the Museum of Modern Art. In the 2019 edition, Mele participated in the symposiums “Sargent’s Residence” (Sargent, 2018), “Denmark, 1956–1965” (2017), “Denmark, 1961–1966” (2015), and “Denmark, 1956–1965” (2014) and presented lectures at institutions such as the University of Copenhagen, the University of Oslo, and the University of Copenhagen. “The", "The next Biennial should be held in 2021, according to director Klaus Jost. The fifty-ninth iteration of the exhibition will take place at the OK Corral in Tulsa in 2021; the seventy-ninth will take place at the OK Station in St. Paul, Minnesota, in 2022. The works will be restored in what the museum calls “an art museum” in which they will be presented as part of a “reconstitution of the museum.” The institution is currently working on a new 75,000-square-foot version of the show.\n\n\nThe British artist Robert Mapplethorpe, whose surreal, atmospheric sculptures foreground the human condition through their imaginative rendering of everyday objects, has died at the age of eighty-nine.Born in London in 1934, Mapplethorpe, a member of the British Expressionist movement, rose through the British Film Institute, the Royal Academy of Arts, the National Galleries of Scotland, and later the British Film Institute, the Royal Shakespeare Company, and the National Galleries of Scotland. He studied at the Royal Academy of Arts, the National Galleries of Scotland, and the National Film Archive, where he worked on his more abstract and stylized sculptures, which", "The next Biennial should focus on “Matteo-Inspired Design,” the theme of the first edition, which was held in 2004, and will focus on the history of Italian architecture and design. Although the museum has presented exhibitions which focus on different aspects of the Italian design scene in the past, the first edition was only a retrospective, not an exhibition. The museum will continue to present exhibitions and hold events with the theme of the Biennial. The next iteration of the triennial will explore the history of Italian art, architecture, and design through work by a diverse group of artists whose works are currently on view, including Gio Ponti, Giancarlo Cipolletta, and Christo, who will appear in a retrospective of his work at the Museum of Modern Art in New York in 2021.\n\n\nThe Metropolitan Museum of Art in New York has appointed Steven Davis as its next director. Davis succeeds David K. Antonacci, who was hired as the museum’s new director of architecture and design last year, and will assume the helm on October 1.“The new leadership at Met has been tremendous, emphasizing the project-oriented spirit of the institution and the work of our modern and contemporary artists", "The next Biennial should be held in the spring of 2020, with an exhibition showing the work of the more than seventy artists who participated in the first edition. The announcement marks a new chapter in the artist’s life and legacy. \n\n\nAfter the pandemic ended in January 2021 and the government announced a ten-year financial plan that would rely on social services and a debt auction, the Bahrain Museum of Art (BMA) announced that it will not reopen as scheduled in March 2022. The twenty-first exhibition in the BMA’s collection, “Reproducing Women: Bahrain in the Diaspora” (2019), has been canceled. The museum’s current exhibition, “The Painters in My Life,” is currently on view until February 20, 2020.The BMA, which is located in the city of Ras al-Amir in the province of Ras, and is run by the nonprofit organization the Ministry of Culture and the Ministry of Education, plans to continue with planned programming and on-site museum operations despite the pandemic. “The BMA’s position has been supported by the Ministry of Culture and the Ministry of Education for many years, as has the ministry’s", "The next Biennial should take place in Athens in 2021–20. The next edition of the Salon will be held in the Greek capital in 2022.\n\n\nManifestations of Political Art (MPAs), as well as pieces by artists who are engaged in a wide variety of media, are now back on display at the Kunsthaus in Berlin. This year’s show, “HELSINKI: Modern Art” (Helsinki: Menneskýkýk) was held this past week and featured the work of the Swiss artist Jörg Paul Haag, a thief, a murderer, and a toolkit manufacturer who was responsible for the murder of three (one of them was   Jörg Paul Ritter ), an American artist whose work was stolen from his home in Zurich in 2002. In a letter to the Kunsthaus, Haag explained his interest in the show. “I wanted to use it as a platform to tell the stories of three artists, and to present their work in a powerful way,” he wrote. “My exhibition is a reflection of the way art is, and the way it should be.”The show is organized around the themes of art and politics", "The next Biennial should be held in 2022.\n\n\nThe Concourse at the Metropolitan Museum of Art in New York has received an additional $500,000 from the American Federation of Arts (AFA) in support of the next edition of the Made in LA Biennial. The funds will go toward the purchase of 90 works by sixty-six artists and will be distributed over three rounds of exhibitions, beginning in the fall of 2020 and running through the spring of 2021.The biennial will be relocated from Hollywood to Burbank, California, and will focus on complex social and political issues of the local, state, and federal government and will take place concurrently with the upcoming Presidential election. The exhibition will open in February 2021, and the staging of the event will occur on the same day as the upcoming election.“The AFA and the Met Department of Arts and Culture are thrilled to support this exciting new biennial,” said Christopher Dunn, the AFA’s director of programming. “The cooperation between the AFA and the Met is groundbreaking and makes this a truly unique event, with a truly unprecedented scope of works and a truly unprecedented number of artists represented. Our artists and museum visitors will be deeply moved by the performances, performances", "The next Biennial should be held in 2020.According to the organizers, the new ten-year budget was established to support the biennial’s continued growth and “accessibility through the inclusion of a new exhibition every two years.” In addition to the exhibition program, the exhibition will be hosted by the city of Boston, which will be awarded $1 million. The fifty-ninth edition of the exhibition will be held at the Museum of Fine Arts.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has announced that it will begin receiving visitors' donations of artworks and artifacts from the late Egyptian dictator Gamal Abdel Nasser’s AlUla regime. On December 3, the institution will open a new excavation site, called the AlUla Museum, that will house the collection of the late dictator’s sons. The new institution will be inaugurated by a retrospective of Nasser’s work, The Decisive Years, which is currently on display in the Amon Carter–designed museum.Its director Christopher Bedford said that the museum will not stop collecting artifacts until the last Egyptian dictator, Gamal Nasser, is removed from power. He added that “this is the most", "The next Biennial should be held in 2022.\n\n\nJames Turrell, a renowned American painter, was awarded the Florence Art Museum (FIM) Prize for his monumental work The Scheel, which opened in 1805. The $20,000 award celebrates the work’s first major retrospective in the United States and was presented by FIM director Maria Lluís Pradella in Rome on Monday night. “In a world where art and design are increasingly indistinguishable, The Scheel conveys a sense of place and history.” An American-born, Italian-based painter, Turrell was born in the small town of Norton, Georgia, in 1936. He studied at the School of the Art Institute of Chicago and the Rhode Island School of Design. In 1943, he married his wife, the artist Irene LaBine, and was given a place in the United States’s delegation to the Venice Biennale. He traveled to Milan and New York to promote the work. In 1953, the same year as The Scheel’s first US exhibition, Iwan and Edythe Broadhurst, began exhibiting at the Museum of Modern Art, Washington DC, and the artist was invited to join the pair. ", "The next Biennial should take place in Dubai in early 2020.<|endoftext|>I love these drops, they are soft and flow beautifully. I have had them in my collection for years and they have always been of a natural consistency and none of them comes off easily. The only problem is that they are very expensive and I am not sure what other companies make them, so I am hoping that someone will help me. Thank you!<|endoftext|>A total of five hundred people attending Sunday night’s Republican National Convention in Cleveland were treated for non-life-threatening injuries after a massive explosion rocked the Wells Fargo Center in downtown Cleveland on Sunday, July 18. According to the New York Times, the blast occurred just blocks from the Quicken Loans Arena, the home of the Republican National Convention.According to the Ohio Department of Natural Resources, the explosion—which occurred during a rock concert by members of the rock band Megadeth—generated a massive fireball that traveled at least 1,200 feet and leveled at least four buildings in the nearby shopping, dining, and entertainment district of nearby Euclid.The blast also shattered windows and shattered at least three air vents, which were able to expel large amounts of CO 2 from the building. Officials are estimating that as many as ten", "The next Biennial should take place in the city in 2021. It is currently slated to be held at the Museum of Contemporary Art Miami Beach.\n\n\nThe Institute of Contemporary Arts (ICA) in London has received a gift of sixty artworks from the National Galleries of Scotland. The works, which were donated by a private collector who lives in Edinburgh, were acquired through the sale of works by the late British artist Eileen Ayles, who was also a prolific collector of works by artists such as Pierre Cardin, Ian Cheng, and Jean-Michel Basquiat.“The gift of these works represents a significant milestone in the contemporary artist’s history, for both it and the ICA are among the first institutions to have the artist’s work in the possession of the National Gallery of Scotland, and in the history of arts in general,” said ICA director Hamish Anderson. “This rare opportunity to work with the artist, to work with such a distinguished collection, and to work with a body that is dedicated to his work, is truly exceptional. We are thrilled to share this gift with our visitors and the wider world, and look forward to his poignant, affecting, and beautiful final work,” added", "The next Biennial should be staged in 2022, and the last in 2024.\n\n\nThe Asian Art Museum (AAM) in Beijing announced today that it has received $8.2 million from the government of China in support of its expansion. The funding is part of its “New Urbanism and Landscape Conservation Plan,” which aims to restore at least 20 percent of the Asian Art Museum’s original landscapes. The plan includes funding for the construction of three new galleries, the renovation of the existing building, and the conservation of Asian art and culture.The AAM’s newly created department of African art and culture will receive $3.7 million, and the department of Asian art and culture will receive $3.3 million. The department of New Art and Culture will receive $1.9 million, and the department of Contemporary Art will receive $1.4 million. The department of Art and Design and Design, Design, and Designing, and Designing will each receive $458,000. The department of Collections Arts and Architecture, Art and Design, and Art and Designing will collectively receive $272,000.The department of Theatre of the World, Theater, and Design, the department of Dance, Dance", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in New York announced today that it plans to end its relationship with the French company Safran to the tune of $2.3 billion. The decision has led critics and activists in France and around the world to question the institution’s ties to French president Emmanuel Macron. The longtime critic of MoCA, Winnie Gamache, wrote in Le Monde on Monday that the decision will “open Pandora’s box.” Gamache added: “The institution has created a legacy of opposing the construction of new schools in Paris and has been instrumental in protecting the city’s historic sites, such as the Place de la République, the Musée de Lyon, and the Palais de Tokyo.”With the end of a series of agreements signed in 2016 between the institution and private developers in an attempt to ease financial pressures facing Paris schools, the city’s schools will have to make cuts of between $5 million and $10 million, or close altogether. The move has been made in an attempt to reduce the city’s soaring student loan debt burden.According to the New York Times, the number of students", "The next Biennial should be held in 2021.\n\n\nThe Institute of Contemporary Art (ICA) in Beijing is planning to begin hosting international artists in a revamped facility in early March. The rebranded space will be inaugurated by artist-in-residence, Wu Li. The artist has invited the public to tour the new venue, dubbed the ICA China Center, and will introduce new works by the artists whose works will be displayed on the space’s large outdoor stage. The exhibition will also highlight the cultural heritage of China.The ICA China Center is in the process of transforming a former cement factory into a hub for contemporary art. The project is part of a larger $9 million plan to modernize the ICA, which has been called the heart of Beijing’s Art and Design District, into a state-of-the-art exhibition space and a cultural research center. The renovation is part of an ambitious plan to create a new cultural center in the city, which was approved by Beijing’s local government last year. The city also plans to add 1,100 acres of parkland and create nearly two thousand new residential units.\n\n\nThe Museum of Contemporary Art (MoCA) in Kansas City, Missouri, has appointed Molly", "The next Biennial should take place at the Museo de Arte Contemporáneo, the Museo de Arte de Gran Canaria, and the Museo de Arte de São Paulo in March 2021. The inaugural exhibition was launched by the Buenos Aires-based artist and curator María Berrío-Hernández and curator Íñigo Marín, who are known for their participatory exhibitions in which individuals or small groups create and interpret their own works. Sébastien Pérez-Depeche, president of the Biennale d'Architecture, said the event’s debut in 2019 signaled a new era for the museum. “In an era of austerity and uncertainty, a new museum is needed to present the museum’s collections and collections’ histories in an international setting, to stimulate the imagination, and to demand a new sensibility from visitors,” Pérez-Depeche said.The exhibition, titled “What is Architecture?,” was curated by María Berrío-Hernández, Íñigo Marín, and the Buenos Aires-based architect Dario Carvalho.", "The next Biennial should be held at least once every other year. In a statement, the Museum of Contemporary Art (MoCA) said: “The Biennial is a human process and it takes time to develop and shape a belief system. We will continue to work with you, the community, and our staff to change the Biennial into an important dialogue event for our neighborhoods and the city of Chicago. We welcome your feedback and we are listening.”The African American Museum at UCLA has announced it is planning to reopen in May. The institution currently has no plans to reopen beyond June, and only recently was it able to get the necessary permits to begin construction. However, due to the coronavirus, the construction of the museum was temporarily put on hold. The opening of the museum will partially coincide with Labor Day, and will be the first time that the museum will be open on Saturdays.The Museum of Contemporary Art (Chicago) has announced that it is reopening to the public on Saturday, May 11. The institution has yet to announce reopening dates for the Southwest Art Museum (SAAM); the Art Institute of Chicago; and the Art Museum of Chicago.“We are reopening with great enthusiasm to serve the community and to", "The next Biennial should take place in 2021. The organization will announce the dates and other details in March. The next edition, which will be hosted in Dhaka, will be held in 2022.\n\n\nThe Washington Art Museum (Wam) has appointed Richard Percival as its next director. Percival will assume his post on June 1. Previously, he has served as chief curator at the Metropolitan Museum of Art in New York and as a curator at the Smithsonian American Art Museum in Washington, DC. He previously helmed the late Egyptian director and architect Mahmoud Ahmadinejad at the Museum of Modern Art from 2003 to 2013, and helped organize the exhibition “The Early Modern Man” in 2018.“Richard’s talents and interests speak for themselves,” said Wm. and Wanda Nesbitt, cochairs of the museum. “His thoughtful leadership and ability to challenge the boundaries between art and the larger world make him a perfect fit for our mission to introduce work by a variety of historically important artists into the museum, and to support their respective visions and practices. We’re thrilled that he will take the helm.”Since the Wam’s founding by the Kantner", "The next Biennial should be hosted by an architect conservator with the museum’s full understanding of the museum’s architecture. As the exhibition will take place in a museum that has an internationally recognized collection of more than 3,500 artifacts from the late Ottoman Empire, the exhibition is expected to draw up to one million visitors.\n\n\nThe British artist Siân Jackson-Bain, best known for her large-scale paintings of human bodies, has died at age eighty-eight.Born in London in 1931 and raised in New York City, Jackson-Bain first studied under the sculptor Edward Bluehorse at the Art School in the city in the 1940s. By the 1970s, she began working in paint and sculpture, where she met her husband, sculptor Jack Barry, and they began their career as painters. In 1981, Barry sold his first work, a sculpture named after Jackson-Bain’s late father, but she continued to work, albeit in a more restrained manner, in the 1980s. Her recent body of work is comprised of more than eleven thousand personal photographs and works on paper.Born in London in 1936, Jackson-Bain spent most of her childhood in New York, where she studied at the", "The next Biennial should take place in 2021, but if it doesn�t, the museum will be forced to cancel the fifth edition.The plan is to stage the exhibition in a small space in the museum\u0097the contemporary art museum, which is currently undergoing a major expansion, is currently planning to open a new half-acre space, called the Biennial Art Centre, in the center of the museum. The new museum will also extend the exhibition’s reach by introducing more exhibitions and events, including a biennial research seminar for young researchers. The renovation will also draw new exhibitions and programming.Sara Takeda, director of the biennial, said: “In this challenging and challenging time, when so many institutions are facing acute losses and when so many people are facing unemployment, it is with great regret that we are able to open the exhibition ‘We are All in this Together’ to draw attention to the challenges and challenges we all face as a society.”\n\n\nThe Tanger Outpost Art Museum in Oslo, which celebrated its thirtieth anniversary in May and began welcoming visitors on August 29, has received a major donation of twenty-four works\u0097a total of $32.4 million\u0097as", "The next Biennial should be held in 2022, the art historian and writer Stacy L. Jones wrote in the March 2018 issue of Artforum. “The next edition will take place in Hong Kong, Hong Kong’s capital city, and will feature works that are drawn from the collections of museums in Hong Kong, including those of the Museum of Modern Art, Hong Kong Art Museum, and Palazzo Grazie in Venice.”The curators’ inaugural exhibition will be an exploration of the history of Australian Paleolithic art in Sydney’s Hunter Gallery, where the work of Australian artist Elizabeth Peyton will also be featured. The exhibition will focus on the relationship between art and the region’s history through a series of interrelated stories. In collaboration with local Indigenous communities in Australia and New South Wales, the artist will create work that will be a return to the Aboriginal artwork that has been found in Australia’s National Museum and Art Gallery in Canberra.The exhibition is also being drawn from the artist’s own collection, which consists of rare works dating back to the 1840s. The exhibition is curated by Kate Brown, the curator of Australian Paleolithic art, and Josh Reeves, the director of the Department of Arts and Cultural", "The next Biennial should take place in the spring of 2021. The next edition of the award will be held at the Venice Biennale, which has already announced that another edition will be held in 2022.  The 2018 award was presented by the São Paulo-based artist Adriana Varejão, who won for a series of paintings that capture the cityscape of Rio de Janeiro. The 2020 edition will be the last in Brazil.\n\n\nThe French-based cultural organization the International Council for Museums (ICOM) has announced that it was forced to cancel the exhibition “Rio de Janeiro: Lake of Blood,” which was scheduled to open at the Lausanne Biennale in March 2021, and will instead hold a “mission statement.” The show, which addressed questions of identity, migration, and migration politics, was supposed to focus on the history of the region and its people. The exhibition was supposed to be an extended version of a project originally organized by the Paris-based artist Jules Bianjola in 2009. The show was supposed to be a “punch in the face of the status quo” that would examine the interrelationships between art, architecture, and the", "The next Biennial should be held in September 2022. The date was chosen as it would coincide with the biennial’s redesign, which would be completed in June 2021. The 2019 and 2020 platforms were curated by Jean-Luc Martinez, and the 2020 exhibition was organized by Rachel Whiteread. The 2019 exhibition, “Dating a Feminist,” was organized by the artist-run group Stages 1 to 10 and featured work by fourteen women artists and was curated by the artist-run exhibition space Lévy Gorvy Paris. The 2020 exhibition was curated by the artist-run magazine Het Parool van de Unigen and highlighted the work of thirty-four artists and was curated by the artist-run cultural center Lisson Gallery in Amsterdam.The 2019–20 biennials, “Université de Lyon,” “Dating a Feminist,” and “Intégralité des Beaux’s,” were originally presented as part of Lyon’s 2018–19 season.\n\n\nThe Metropolitan Museum of Art has appointed Dennis Richardson as director of the Museum of Modern Art (MoMA).“Dennis is a gifted curator who has built his practice around the idea", "The next Biennial should take place in the spring of 2021, when it will open to the public in Europe.\n\n\nThe Tate’s board of trustees has appointed director Maria Balshaw as interim chairwoman. She succeeds Jane Green, who has led the museum for twenty-four years, after she announced she would step down this May.“Maria’s tenure at Tate has been inspiring and transformative, as she has forged ahead with an ambitious plan to deliver on the vision set by the late Martin Koons,” Katelyn Pape, chair of Tate’s board of trustees, said in a statement. “We are grateful to Maria for sharing her vision as chair of Tate with us and are confident that her leadership will drive future success.”“We are also grateful for the extraordinary work of the board and staff, who have consistently supported her as she has led the institution through one of the most challenging and challenging times in its history, and we are hopeful that her vision and energy will continue to guide us through this challenging moment,” said board chair Sir James Dyson.Commenting on her appointment, Balshaw said: “I welcome the challenge and challenge will focus on how we", "The next Biennial should welcome the public on September 8.\n\n\nThe San Diego Museum of Art (SDMA) in California has announced that it intends to move the Tenement Museum, a project of the architect Paul Cézanne, into its new home at 1300 S. Santa Fe Avenue. The museum, which has been housed at 1300 S. Santa Fe Avenue since 2007, is undergoing a $450 million expansion project. The new space will accommodate the museum and an adjacent 750,000-square-foot guesthouse, known as the Cenotaph, which will serve as an end-of-life memorial for the 117,000 people who died from the disease.The project is part of a $3.5 billion plan to reshape the city’s architecture, which will also include the construction of new public amenities and the refurbishing of an existing public art space. The redevelopment of 1300 S. Santa Fe Avenue was announced in 2017, when it was still being worked on, and was supposed to begin in 2021. The plan was later ditched, and the museum relocated.In a statement, SDMA president and CEO Victor Schrager said: “The museum’s new home is a collaboration between the San Diego Museum of Art", "The next Biennial should also include a catalog of works by artists who have lived or worked in the United States for fifty years or less, according to the panelists, and a list of ten or thirty biennial architects. The panelists will also decide on the themes for the 2019 edition, which will take place at the Museum of Contemporary Art Los Angeles (MCA), and the 2020 edition, which will be held in Helsinki. The next edition of Artforum London, which opened in London in March 2019, will also include more than two hundred works by artists living outside the UK in its inaugural edition, which will be given an exhibition at the Tate Britain in London in November 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today the twenty-one artists who will participate in its June show “NIRIN,” which will explore the intersections of philosophy and art. The forty-three-city tour will take in New York, Budapest, London, and New Delhi. The exhibition will also include a special performance and a selection of contemporary artworks. The fifty-three-person curatorial team will present the works in conjunction with lectures, performances, readings, and other events.“NIRIN is a", "The next Biennial should be presented by the Los Angeles County Museum of Art (LACMA), in October 2021. The 2020 edition, titled “Intersection of Gender and Reality,” was curated by Tracy L. Angell, whose collaborations with the theme were first announced in a September 2018 issue of the magazine.In the September 2019 issue of Artforum,  Feminista Uomo wrote about the exhibition, which she saw as a “flexible, vehemence, and humorously subversive work that could embody or subvert the very notion of art, and the very notion of the self.” The article was inspired by Margo Allen’s earlier work, which was on display at the inaugural Biennial of African American Artists in New Orleans in 1997, and leaned slightly towards Allen’s own prose—which harbored a feminist and often anti-Semitic undertone. In the same issue, Anselm Kiefer’s work was included, along with pieces by artists such as Robert Irwin, Gato Puaréa Johnson, and Chasie Ess, among many others.In an interview with Laura Mulvey in the September 2009 issue of Artforum, Anselm Kief", "The next Biennial should take place in 2021 and will be led by the National Gallery of Art, which has installed more artworks in its history. The European pavilion will be curated by the German curator Joachim Neugroschel and will proceed with a partner exhibition showcasing work by twenty-seven artists. “This year’s edition was a great success, with weeding out of the best and most important works for the first time,” said Daniela Günther, director of the Munich Biennale. “The exhibition was highly anticipated by everyone who attended, and we were deeply touched by the exhibition’s themes of the search for meaning and beauty in art and the art of the future.”\n\n\nThe Museum of Modern Art (MoMA) in New York has closed its doors to the public for a thirty-day exhibition following a crisis that erupted on December 4 when a group of activists blocked the museum’s entrance with signs reading “No more wars!” Upon learning that MoMA had temporarily closed its doors to the public on December 5, the activists were not deterred by the closure. They instead decided to stage a “museum strike” in protest of the", "The next Biennial should be in 2020. The very first edition will be held at the Gran Canaria Resort and Casino in the city of Turin, Italy, and will be hosted by Italian director Roberto Cicutto and his entourage. The exhibition will emphasize the design and production of new art.“The first edition of the Biennial was a very positive experience,” said architect Raimond Ghebaly, who was commissioned to work on the project by Cicutto. “I am very excited to be back in Italy and to be able to work with the talented team at CCT that has always been dedicated to building a meaningful new project for the museum. I must think of the artists that shape the future design of the Biennial and its architecture. I am confident that I can create an experience for the visitors of the museum that will allow them to connect with the history of the art of our time.”The exhibition will include three new works by the exhibition “Olive Kocher: Flash,” which will open on June 27; “Sara Picays: The Disappearance of the Gift,” which will open on June 27; and “Cécile B. Beno", "The next Biennial should be held in the fall of 2020. \n\n\nThe Institute of Contemporary Art (ICA) in Berlin has launched a $10 million fund for artists whose works are on display in the exhibition “HELMUTTIMES” during its inaugural edition at the Fraunhofer Institute in Bavaria on November 12–16. The grant, which is for works on paper or photography\u0097not including films, videos, or live performance\u0097is one of the first from the newly opened Biennial Cultural Escapades, an initiative of the Institute of Contemporary Art (ICA), which is located in the southwestern part of the city of Munich.The biennial, which celebrates the history of the Ludwig and Nibelung Art Museum in Nuremberg, invited ninety artists to participate from twenty-eight countries. Among the artists chosen for the inaugural edition are emergent artist Pascal Axtuar, who works in film and performance, and painter Jeremy Deller. Alongside these artists, the group will be presented with five 360-degree panoramas, which will be projected onto the museum’s walls, and a new 36-foot mural by artist Tomasz Klimczyk.The biennial features new works", "The next Biennial should take place in the city in 2021. The third, in 2022, will be held in the city.The first biennial was held in Paris in 1959 and ran until 1972. It was followed by the second in Hamburg in 1975 and the third in Milan in 1979. It was the first European event to take place in the country.\n\n\nYale Union, the nonprofit arts organization founded by Christian Bergen in 1976 to advance the interests of Rhode Island and to collect, organize, and distribute artistic works, has announced that it will cease its operations in 2020 and transition to a new entity known as the Center for American Art. The organization will also continue to host events in partnership with the city of Portland, which is home to more than 2,100 artists.A statement published by the nonprofit reads: “Yale Union’s artistic mission was to be a platform for contemporary artists, and we have continued to be that platform. We have embraced new media and new ways of doing things, and we’ve evolved into institutions for the scholarly study and artistic production of artists. We have made significant contributions to the art world’s history and art history studies this year, and we will continue to do so in the future.", "The next Biennial should be held in the autumn of 2020.\n\n\nNew York City’s Metropolitan Museum of Art (MoCA) has received a gift of eighty-three works from the private collection of the late collector Peter Zumthor. The museum will soon display the work of forty-five artists in a major exhibition dedicated to Peter's work, titled Peter Zumthor: A Century of Art. The Met is planning to construct the 950,000-square-foot museum on the Hudson River in partnership with the Zumthor Foundation in the city. Peter Zumthor: A Century of Art, which will open on February 22, 2020, and run through the end of the century, is the contemporary re-creation of his childhood home in the Catskills, New York, where he grew up. The works will be presented in the museum along with works by forty-five other artists, including Carlos-Josey Arango, César Morales, James Morris, Robert Rauschenberg, Stanley Donwood, Jane Panetta, and Nicholas Ray.The gift, which was made in 2008, is credited to Peter Zumthor with the acquisition of thirty-six works by thirty-five artists", "The next Biennial should be held at the Art Institute of Chicago (AIC) in 2021. The 2020 edition, titled “From World War II to the Present,” was curated by Gareth Nesbitt, and featured work by forty-five artists. Artistic director Linda Dorsen said that the twenty-sixth iteration of the show will be “vivid and captivating,” drawing upon the themes of the biennial’s previous iterations.\n\n\nThe Museum of Fine Arts (MFA) in New York has issued a new curation of a new group exhibition titled “What We See.” The forty-three-thirty-third exhibition will open on November 29 and run through February 4, 2021. The show will feature work by twenty-four contemporary artists, including Mark di Suvero, Nathan Fletcher, and Alice Lisitsky; will feature special installations, including a three-hour work by Emily Brontë, a work by Mary Beth Wilkes, and a performance by the New York–based collective Skyrocket; and will consist of interviews with seventy-four contributors.“Matt Mullenbach, the director of the Museum of Arts and Design, has been a champion", "The next Biennial should be held in February 2021. The  Theater Biennials in January and March 2021, respectively. Museums are expected to begin the groundswell of support for a new, universal, and ambitious artistic contract for arts institutions by way of the 2020 March 2020 deadline. The 2019 and 2019 cycles have already seen the introduction of new statutory guidelines for contracts to arts institutions, as well as new funding streams and funding formulas. The art of the digital age, signed by nearly 7,500 people in Europe and the US, is now at risk of extinction. The Art Newspaper reports that the deadline for institutions to apply for digital-only emergency aid is April 11.If no changes are made, the Art Newspaper predicts that the art of the digital age will be lost before the end of the year. The next Universal Biennials will be held in March 2021 and March 2022. \n\n\nThe Chicago Sun-Times reports that the $50 million renovation of the former site of the Chicago Defender, which was a seminal venue for Chicago art during the 1940s, is on track for completion. The work, which was completed in 2017, will include the first large-scale", "The next Biennial should be hosted in the year 2021. The exhibition will be held at the Museum of Modern Art, and will feature work by forty-eight artists from ten countries. The theme, “Ateliers pour l'Homme,” will be interpreted by the artist and will feature work by seven women artists. The show will also feature work from the artist’s collection that is housed in various institutions around the world.\n\n\nThe National Museum of Fine Arts in Boston has appointed Ellen Adam as its next executive director. Adam comes to the institution from the Rhode Island School of Design (RISD), where she has served as the director of education and public engagement for the past two years, and will assume her responsibilities in January 2021.“Ellen is highly respected across the arts and her leadership at RISD demonstrates her ability to forge strong partnerships and create new opportunities for young and established artists,” said Domenick Amoroso, president of the Rhode Island School of Design. “Her passion and expertise in connecting with audiences across Rhode Island, and her ability to champion the arts in a way that elevates the voices of underrecognized artists, is a true match for the National Museum of Fine Arts’", "The next Biennial should focus on the interrelationships between art and culture and potentially shape the way we look to the future. I believe that the future of art lies in our relationship to each other and to the world, and not just in our own personal interests.”The biennial will take place in the museum’s new, expanded space at 1200 S. Broadway, the former site of a former Coca-Cola bottling plant. The new venue will house the museum’s permanent collection, exhibitions, and events. The new space will also host a series of concerts and other programming to draw visitors to the museum. The museum will reopen to the public in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is constructing a new outdoor sculpture garden that will house the institution’s collection of more than 1,600 works. The Garden will be located on the ground floor of the former Coca-Cola bottling plant and will feature thirteen terraces of terracotta sculptures. According to the Los Angeles Times, the new gardens will extend the reach of the museum’s collection beyond its current locations in the city and will further integrate with the surrounding landscape.The Los Angeles-based firm Grassroots Mural Architecture", "The next Biennial should start in September and will introduce a series of performances and assemblages by artists from the Saar region. The first exhibition will be held at Saar Kunstbau in September 2021 and the exhibition will be followed by a biennial at the Musée d’Art Moderne in Paris in November 2020.AusWelt reports that the thirteen-acre site currently hosts 24,000 visitors each year. While the museum still plans to open an arts and culture complex in the center of the new civic center, the opening date is currently set for 2020. The biennial will present artists performing and collaborating across twenty museums, including the Kunsthalle Basel and the Musée d’Art Moderne, in addition to a new exhibition series and a sub-programm called#art. The theme of the new biennial is “Theater of Life” and will be decided by an open call. The public will have the opportunity to vote on the new format of the biennial. The list of nominees is as follows:ART’s  (2) (1) (2) (3) (4) (5) (6) (7)Art of the Exhibition (", "The next Biennial should take place in New York in 2020. \n\nThe Museum of Modern Art (MoMA) in New York has launched a $1.5 billion fundraising campaign to repair its expensive glass-enclosed Museum of Modern Art (MoMA) in Manhattan, which was damaged by a massive wave of Hurricane Irene in October. The institution is currently seeking contributions from the public to repair damage done by the superstorm and its aftermath. The hurricane also caused significant damage to the building’s roof, walls, and lower floors, and damaged or destroyed some of the building’s artworks. “The Museum of Modern Art is committed to restoring the Museum of Modern Art to its former glory and is working hard to determine the best options,” said MoMA director Daniel H. Weiss. “We hope to have the necessary resources in time for the next exhibition season. In the meantime, we are working closely with partners and artists to assess the structural health of the building and to develop a comprehensive plan that will ensure the museum will be able to continue to function in the event of a catastrophic loss of power.”The Restoration Artists’ Association (RAA), which is organizing the campaign, is asking donors to", "The next Biennial should focus on the history of modern art and technology, and should incorporate a combination of theoretical and practical exercises and performances.”Organizers said that the exhibition will “provide an overview of contemporary art and technology and will include a selection of works that represent the latest developments in biennial and exhibition design, with a view to explaining the history of modern art and technology.” The Biennial of Danish Art, organized in 2018, included work by hundreds of artists from twenty-three countries and was held in the Danish capital, Copenhagen, and the Danish island of Ålesund.\n\n\nPolish curator Józef Piotrovska, who served as a curator at the international contemporary art exhibition Biennale Warsaw from 1991 to 1996, has died at age eighty-nine. Piotrovska, whose exhibition was organized by curator Jozef Kemp, was one of the few people to openly challenge the centrality of the West in contemporary art history. The Polish curator was also the only person to organize the exhibition in the former East Germany and the former Soviet Union. His first exhibition at the Art Museum in Warsaw was “For a Future Not Exceeded” (1991) and his last", "The next Biennial should be in May 2020. It will also present a symposium on “cultures of resistance” in October 2020, and will be hosted by a combination of museums and universities in collaboration with the São Paulo-based organization  ÜSustained Motion.In a statement, the museum said: “We are still in the process of selecting the themes for the 2019 and 2020 biennials, and our board of trustees keeps in touch with the organizers. We are happy to discuss the new possibilities for the museum and the future of the Biennial. Our view of the future is evolving daily, and as we dive deeper into the archives, we are hopeful that ‘eventual exhibitions’ will engage with the themes and invite the museum to become involved in the discussions that are taking place in the museum.”Cultural historian Marijane Akram, who has written extensively on the history of the exhibition, and artist systematist Anton Chaitkin, who directed the installation at the Biennial of the Creative Economy in Bangkok, as well as the Biennial of the Unseen, have both received prizes. Although they are not yet selected for their respective biennials, their works will be included", "The next Biennial should be held in late June or early July.\n\n\nThe Egyptian Ministry of Antiquities has opened the National Museum of Antiquities (MoA) in Alexandria to the public for the first time in more than fifty years. The institution, which was shuttered since March due to the Covid-19 pandemic, has been converted into a repository for the country’s antiquities, which are on display in the institution’s new exhibition space, the National Museum of Art, which was completed in 2017.The museum’s opening coincides with the opening of three new exhibitions, “The Spoils of War: From the Last Century to the Present,” “The Twentieth-Century Art of the Egyptians,” and “Egyptian Art at the Renaissance,” at the same time. The exhibition events will run from February 16 to February 18, 2020. The exhibition “The Spoils of War” will examine the exhibition “Pennamebe” (1933–1934), which was organized by the Egyptian Museum of Art in Cairo. Pennamebe was a series of exhibitions organized by the Egyptian Museum of Art in Cairo that included works by Iranian and Iranian", "The next Biennial should be held in the spring of 2022 and will be led by artist-in-residence Isabelle Alsop, curator of contemporary art at the Museum of Modern Art in New York, and director/cofounder of the East-West Center and the Museum of Contemporary Art, Miami Beach.\n\n\nThe 2017 Venice Biennale, which focused on American art and politics, was marred by the sudden death of Warhol’s partner, the American artist and activist Leo Babauta, who was fifty-eight years old. The cause of death was marked by a battery of 12 x 7 x 5.C. He was found dead in his studio in the city of Podgorica, in the Rovigo district of the Adriatic, Italy, on March 5.The Italian newspaper the Corriere della Sera reported that the cause of death was strangulation and that Babauta had been violently assaulted by an unknown assailant on February 20. According to the New York Times, the act was caught on tape by the victim’s sister, who was present at the scene. After taking a shower, the sister went to the bathroom, where she saw her brother, who was gone for several hours.", "The next Biennial should be held in 2022, the administration said.\n\n\nThe Institute of Contemporary Arts (ICA) in Berlin has received a $500,000 grant from the Alfred-Weinstein Foundation. The gift, which was made in recognition of its contribution to the preservation of the museum as well as its contribution to the development of the institute’s collection, will enable the institution to remodel its grounds and to enter the construction phase for a new building. The institute’s current building, which is on the ground floor of the historical Kreuzberg building, will remain unchanged. The new building will consist of a new entrance, a new lobby and a new gallery. The new building will be inaugurated by a public exhibition of works by Luigi Cipolletta, the Italian architect who designed the museum’s spectacular new Grand Design on the Hudson Yards project, and will be inaugurated by a presentation of works by Anton Chagall.The foundation’s director, Helmut Schmidt, said: “Over the last eighteen years the ICA has been working to create new possibilities for the building, building, and renovation of the museum. The unique portfolio of work of Cipolletta and Chagall, along with the", "The next Biennial should be held at the Institut d'Architecture et d’études in Paris and should reveal the settings for the forthcoming six-part series. The work will be created by a group of seven artists, including Lévy Groupe, Jean-Jacques Haag, and Daniel Pauwels, and will comprise work on the theme of the exhibition, “The Death of Light,” as well as a new sculpture by the German artist Dieter Abendroth and a new installation by Hans Christian Andersen.“The three-dimensional sculpture Biennial de Lyon will be inaugurated with a work by the Belgian artist Parag Khosravi, whose work was selected for its experimental spirit and quantitative depth,” said Henri Bière, president of the Biennial de Lyon. “In this pivotal moment, the exhibition-goers are invited to re-imagine the role of art in this age of uncertainty. The next Biennial de Lyon will be a public space for the creative exchange and of dialogue. It will be a space for reflection, reflection, reflection, and reflection back to direct and to direct reflection.”Khalil Khosravi’s works, which", "The next Biennial should be inaugurated in 2024.\n\n\nAs the Art Newspaper reported on Friday, the UBS-backed exhibition Artforum Biennial 3: Blackout will be canceled due to the coronavirus. It will instead move to March 21–March 22, 2020, and will include works by forty-seven artists chosen by UBS from a pool of twenty-nine artists.The move follows a wave of cancellations and delays for major art events in the United States, Europe, and Asia, including the UBS gala, Artforum Europe, and the Venice Biennale. The UK’s Tate and the Architect’s Union have also cancelled their spring/autumn/winter shows, and the Prix de la République in Paris has postponed the event.The announcement follows an Artforum press release that said: “In light of the coronavirus outbreak, we – together with the artists ‘ have decided to cancel the next Artforum . . . We are grateful to the artists, the organizers, and the entire art market for their cooperation on this important issue and hope that this will be the last time they will collaborate.”The artists are now collaborating to create a new exhibition, called", "The next Biennial should be held in the spring of 2020. \n\n\nHirshhorn Museum and Sculpture Garden in New York has issued a revised and expanded statement on the ongoing reopening of its two venues following the pandemic. The museum added that it is currently reviewing the conflicts of interest between the museum and the pharmaceutical manufacturer Valeant, which it said has a longstanding relationship with the museum. The statement also pointed to a series of transactions that led to a loss of approximately $74 million, but accurately titled this loss as “just over half a billion dollars.”The announcement follows a March 28 letter signed by about 100 former employees, directors, and other stakeholders to Museum Chair Richard Armstrong, which asked for the institution to halt its pre-opening celebration and continue with its planned reopening in September. The employees cited the Covid-19 and the pandemic as factors in their resignations.“These are difficult and distressing times, and we are acutely aware of the impact of Covid-19 on the local, regional, and national economy,” said Hirshhorn director Anne Fowle. “With that in mind, we decided not to celebrate the opening of", "The next Biennial should be held in the second half of next year. The director of the 2018 exhibition, Stephen Friedman, said: “The new architecture of the museum should be an extension of that of the previous years. We should think of the future of art museums in Europe as a kind of return to the past, following a model of the legendary Renzo Piano.”\n\n\nThe twentieth Venice Architecture Biennale, curated by Max Mara and Karina del Castillo, has released the twelve artists who will receive the prestigious €100,000 award for their works in the exhibition, titled “Spiralling Light,” which opened on Thursday, May 5. The event will be held at the Venice Architecture Museum (VAM) in Venice from March 27 to April 5, 2020.Among the seventy-two works selected for the exhibition are a new generation of electronica-inflected works that are inspired by the history of drug use and its social and cultural impacts. The work, “Plannifest in Space,” was created to address the historical practice of the Sundance Film Festival, a multidisciplinary event whose third edition was held in a new theater space in the city of Valencia, Spain, in June 2019.", "The next Biennial should take place at the Museo del Santo, in the City of Santo, in the state of Pinar del Este, in the province of Belo Horizonte, in the coastal province of Mato Grosso, and in the rural province of Ceara in the state of Rodas. A second edition of Biennales will take place on the island of Puerto Rico in 2022. At this year’s event, which will run from April 3 to April 5, 2019, the theme “Ecofeminism and the Body: from 70,000 to 100,000,” will be “Anima Mundi: The Body in Color.” The exhibition will also feature work by the exhibition’s inaugural participants, artist-in-residence Jorrit Merkle, who will work with museums from around the world in their hometowns; the curator of modern and contemporary art, José Marti, who will visit Albanian artists in the United States; and several other curators.The full list of participants is as follows: 1. Ligia de Almeida (Museum of Modern Art, Brazil) 2. Domenico Lÿ", "The next Biennial should be held in 2022, and the institution has already awarded six grants totaling $4.5 million to organizations that represent arts and cultural heritage in the country. Among the conservators that will be presented in the exhibition are Bob and Carol Tavares, the conservators of the Palazzo Prada in Venice; and Naveen Fadnavis, the conservator of the Pantheon in Paris.The Biennial will be hosted at the Museo de Arte Contemporáneo, and will be organized as a platform for dialogue between the four exhibitors: the Arte Povera, the Arte Nacional de Buenos Aires, the Art Institute of Chicago, and the Art Institute of Cambridge.The 2020 cohort includes Dylan Jackson-McGee, the curator and owner of the W. K. Kellogg Foundation in Gary, Indiana; the American artist and cultural historian Irene Alles, who is known for her work examining the power structure in American art; and the American artist and researcher Michael Ondaatje, who is best known for his monographic murals and works that are represented in the exhibition. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has appointed", "The next Biennial should be held in October 2021. The date for the third exhibition, which opened on October 23, is currently unknown. In the last few months, more than seventy artists have shown at the museum and its sister institution the Forum—the latter now boasts more than 1,600 works by forty-three artists.The gallery will also soon be hosting a new exhibition, “The Politics of Art,” at the museum, which will be on view until September 12. The show will feature work by sixty-four artists and will begin with a discussion of the concept of politics and its relationship with art. The show will then veer into deep philosophical and political discussions of the nature of art and what it might be in the years to come.The final exhibition of the Biennial will be “The Birth of Israel,” which will open in the summer of 2022. The show will feature work by seventy-seven artists and will assemble a selection of works by fifty-three artists, including Basel Adnan, Elis Hatip, Salman Rushdie, Jonas Akoon, and Sohrab Mohebbi, among others who have died in exile, from the Palestine–Israel-Palestine Exhibition and Conference, which will take", "The next Biennial should open in 2022.”The effort to re-create an American version of the 1913 Winter Olympics, which was hosted by the Charles Egan–designed Winter Park in Santa Fe, New Mexico, has faced numerous setbacks since its inception. In 2015, the city of Boston declared the event a “failure.” In 2016, the Boston 2024 campaign was forced to cancel the event owing to concerns over the coronavirus. And last month, the Greater Boston 2024 organizing committee announced that it was delaying the event until at least 2021.Despite the efforts of organizers and Boston 2024, the event is still far from being realized. The 2024 Games will take place at Fenway Park from February 3–March 15, 2024, and will be held in the United States from March 19–March 21, 2024.\n\n\nThe Holburne Museum in Sydney has appointed Hunter Goodall as its new board chair. Goodall comes to the institution from the University of Technology, Sydney, where he has served as director of the Institute of Contemporary Art, the Modern Art Museum, and the South Australian Museum. He succeeds Bobbie Kruger, who has served in the role since January 2019.“Hunter has been instrumental in transforming the", "The next Biennial should be opened in 2020. \n\nThe Southern California Historical Society (SCAH) has received a gift of twenty years of archival care from the California Institute of Technology (Caltech). During an exchange with the institution in 2017, the California Institute of Technology (Caltech) curator, Amy S. Coleman, was awarded the Cognitive Arts Medal. “In recognizing artists, we are reminded of the breadth of their cultural practices and the unique ways they interact with their environments,” said Tom Dorigo, the newly appointed director of the California Institute of Technology (Caltech). “Recognizing their enduring contribution to California’s visual arts is no small honor.”The gift includes forty-one works from artists like Anselm Kiefer, Albrecht Dürer, and Otto Hahn, among others from the Guggenheim Museum, the Los Angeles County Museum of Art, and the San Francisco Museum of Art. It also includes a selection of works by artists who have lived or died in Los Angeles County. “The SCAH is grateful to the California Institute of Technology (Caltech) for its ongoing support of the SCAH and its collection", "The next Biennial should include the work of a select group of artists which will form part of the permanent collection. The museum is currently working on the development of a biennial catalogue.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has announced that it is collaborating with the Museum of Modern Art (MoMA) in Chicago on a new partnership that will bring together the two institutions in an effort to encourage more collaboration and collaboration across the country. The partnership will focus on the creation of programming that engages with the artistic and cultural heritage of the Met, including the museum’s collection and exhibitions, exhibitions, and works by artists and collectors named after the Met, and will involve the opening of new exhibitions and the development of the museum’s collection in partnership with MoMA.“We are grateful to the Met and MoMA for their longstanding partnership, and are excited to continue to work with them to make MoMA a strong regional partner for artists and collectors,” said David Frahm, the museum’s deputy director of curatorial affairs. “As a group, we will be creating a new partnership between the Met and MoMA with a view to fostering collaboration and collaboration in the greater Chicago arts community.”", "The next Biennial should be held in late September or early October. “We are actively exploring new models to engage with contemporary issues of art and art history,” said Domenick Bevilaqua, director of the Museo de Arte Contemporáneo in Porto Alegre. The exhibition will be centered around the history of modern art in Brazil, and will focus on the transformation of the country’s institution in the 1920s by the Précis Fund. The museum will also be led by Ricardo de Almeida, who is also director of the Museo Nacional Centro de Arte de São Paulo, and will be co-hosted by artist Paulo Motta and artist Múltona Pires.The thirty-six-year-old Bevacqua has served as director of the Museo Nacional Centro de Arte de São Paulo for the past twenty years. He is also the founder of the Ricardo de Almeida Foundation, a nonprofit organization dedicated to the development of Brazilian contemporary art. In a statement, the museum thanked Bevilaqua for bringing the inaugural edition of the Brasile", "The next Biennial should be held in the spring of 2020. Meanwhile, the exhibition will continue to be staged in various forms. The board of trustees of the Smithsonian’s Museum of American Art, which is reopening this week, said: “We hope that this means that the biennial will continue to be an important source of inspiration for our visitors from now on. We will continue to explore new and exciting ways to reflect on the history and culture of our country through exhibitions, public programming, and the public lectures that we have been able to deliver over the years.”\n\n\nThe Pérez Art Museum Miami and the Pérez Art Museum South Miami have reached an agreement that will see the institution reopen to the public in the spring of 2021. The agreement—the first between the two institutions in more than twenty years—closes the main Pérez Art Museum building on West Ninth Street and restores the building to its former glory. The extension also restores and extends the museum’s footprint by adding a theater, public art gallery, a library, and the Pérez Museum of Art.“The extension is a true testament to the Pérez Art Museum’s commitment to supporting the Art of", "The next Biennial should be held at the Centre Pompidou in Paris, and its exhibition will be curated by Olivier Savarin. The first exhibition in the new partnership between the two institutions will be the exhibition “Nature’s City: The Art of Cities,” which will be a major retrospective of the French artist Etienne Lévy’s work, which is on loan to the Biennial. A second exhibition, “Places of Noise: Art and Performance” will be presented at the Biennial and will be organized by Jakob Boecker, director of the Centre Pompidou. Both exhibitions will open on February 4.\n\n\nThe HIV/AIDS charity Samaritan Project is appealing to the public for support as it works to hold the country’s largest art fair, the Metropolitan Museum of Art, to ransom for a week. On Friday, October 22, the fair will run from noon to 5 PM, with preview days on the 23rd and 24th. The deadline for donations is October 28.The event has already drawn a record $8.7 million from donors, who donated $5.3 million in support of the project, and now asks for another $3 million from", "The next Biennial should be held in 2021.\n\n\nNew York: The Arsenale di Milano, which has staged the first-ever Italian pavilion at the biennial since 1964, will not reopen this year. The event, which was held at Milano di Milano from March 24 to March 31, will be held at Arsenale di Milano until January 9, 2021, and will be hosted by the city from January 11 to January 13, 2021.The announcement follows a tumultuous year for the Italian pavilion. In April 2019, the pavilion was forced to cancel a pavilion exhibition in Venice, amid rumors that the venue was planning to close permanently. The cancellation was made in light of the Covid-19 pandemic, which forced Italy to move the exhibition to Milan, and in March 2020, the pavilion hosted a retrospective of Italian architect Paolo Mollino, which was canceled due to the pandemic. Michele Balsamo, the artistic director of the urban design program at the New York Academy of Art, said that the time constraints placed on the pavilion were inconsequential compared to the ongoing work of the pavilion’s artists. The institution will announce the cur", "The next Biennial should be staged in the summer of 2022, said an art director at the Smithsonian’s National Museum of American Art, which is in Washington, DC. The exhibition will be based on the artist’s 1938–39 exhibition “The Body of a Woman,” which featured twenty‐one works by women artists. The exhibition will coincide with the artist’s centenary.\n\n\nThe nineteenth Venice Architecture Biennial, curated by Marco Mazzoni, will be held at the Palazzo della Scala in Venice from May 5 to May 6, 2020. Curated by architect Remi Gebbel, the exhibition will showcase the work of eighty-two artists and will be organized as a kind of “grand assembly.” Mazzoni, who previously worked as a curator at the Museo del Popolo di Cinéma between 1975 and 1981, will serve as the theme of the biennial.Mazzoni will begin by presenting the first part of the exhibition, “The Other World,” a retrospective of the work of forty artists and will continue by presenting works by contemporary and famous artists in a series of exhibitions.From May 5 to May 6, 2020, the Venice Bienn", "The next Biennial should be held in 2022.\n\n\nA group of students, including Lina Bilson, Mandy Perez, and Nabila Saad, have launched an initiative to increase the visibility of women’s issues in museums. They are creating a new program, called Art Index, to highlight the work of women artists, as well as to organize exhibitions dedicated to women artists.“The women’s movement was a force for social change in the twentieth century, and we should use that tradition to build on its legacy,” said Mandy Perez, a fourth-year art history and society studies major at the Massachusetts College of Art. “With this project, we are trying to make that a reality, to expand the scope of what it means to be a woman in the twenty-first century.”The students, led by art historian and educator Renee Fleming, have created a new website, www.artsindex.us, that will host the index, which will highlight twenty-five years of work by fifty women artists, and will present the artists in an online viewing room. The website will also include an interactive map of the galleries in the institute.The index will be organized by the curator and artist, and", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is getting ready to welcome the public back to the institution next week. After months of renovations, the fifth annual LA Biennial, titled “IN THE EYE OF TEL AVIV,” will open on Friday, March 4.“We are so proud of our staff and excited to welcome our guests, and to celebrate the highly anticipated return of art and culture to the city,” said Lisa Evans, director of the museum and chair of the board of trustees. “The fifth LA Biennial is an exciting and important step in our ongoing work to support the city’s arts and culture and is a testament to the museum’s commitment to supporting artists and our community.”Los Angeles’s art scene is currently recovering from the devastating fire that tore through the historic Carnegie Building on the city’s Sunset Strip in October 2017, exacerbating the already severe fire and explosion risks in the building and prompting the relocation of the entire art community from the area. In March, the board of the California Community Foundation (CCF), which owns the building, voted to build a $1.2 billion", "The next Biennial should take place in the spring of 2022.”\n\n\nThe Royal Academy of Arts (RA) in London announced today that it is changing its name as part of a larger, multiyear project to better reflect the diversity of the academy’s community. The academy’s fifth-floor roof will be named after Benedict Cumberbatch, the lead actor of the BBC’s Sherlock and the fourth-ever winner of the British Film Award. The project will also introduce a new sculptural element, a stone circle that will sit in the center of the academy, which is currently undergoing a major facelift.The change is part of a multiyear plan to build on the RAA’s proud history, which includes the addition of the RAA’s first auditorium in 1976, the renovation of the RAA’s former residence in September 2012, the expansion of the RAA’s footprint in September 2015, and the reopening of the RAA in March 2018. The RAA’s current location on the A8 in central London is now the RAA at Forty-Third Street in Mayfair, and the institution will soon be able to host", "The next Biennial should be held at least once a year, and may be extended to up to four times a year. “I’m a child of the 1970s, and it’s not hard to imagine that the current situation feels very futuristic,” said designer Suzi Dallenbach. “In my lifetime, I’ve been involved in more than two hundred exhibitions and have served as a board member of the Academy for Contemporary Art Berlin. I’m sure that our new project will be a time of great experimentation and experimentation.” The exhibition will be designed by Ming-Chi Kuo-Man, and will run entirely on Vimeo. The exhibition will also feature the work of forty-nine artists, including Sakula Ajit, Annicki, Trishkumar Gupta, Mandy Pang, Alfredo Pedrosa, and Zanele Muholi. In addition to the exhibition, the Biennial will host a series of activations, including a symposium, a solo exhibition, and a performance. Founded in 2012 by Flemish architect Jonas Žiga and the Indian artist Anwar Pate, the", "The next Biennial should be in 2021.\n\n\nA group of thirty-five artists—including Hao Chen, John Colombo, and Pia Aiello—have now been awarded the grand prize at the Fifty-Eighth Venice Biennale, which will be held in 2021. The sixty-sixth edition of the annual event will be held in 2022. The artists were chosen through a public vote, which was held on January 6, and will each receive an additional $30,000. The eighty-eighth edition will take place in 2020.The inaugural exhibition, “In the Studio,” will be held at the Herbert Marciano Fine Art Gallery in New York and will be comprised of fifteen works by the artists in the exhibition. The artist-in-residence, Danielle Paus, will present the artist-in-residence–created works in the exhibition, which will also feature “Vinazpil,” a public sculpture made in collaboration with the Patients’ Association of the State University Hospital of the Arts (USU), which is currently undergoing construction, at a different location. The next iteration of the Biennale will take place at the Palazzo della Scala in Rome in", "The next Biennial should be held in the spring of 2020.  The show will be organized by the Hong Kong–based artist and curator Wai-Min Kim and his team as part of the city’s Exhibition of Hong Kong Art. The first exhibition is presently on view in the Hong Kong Art Museum as part of a three-month residency program. The second is scheduled to open in the summer of 2020 and will run until the end of December. The third will be organized by the artist and curator Christopher Chiu in the spring of 2021. The exhibition will be presented in conjunction with the Hong Kong International Film Festival and will run until the end of March.The full list of exhibitors is as follows:ArtInk Art GalleryBillionaire Richard Adler GalleryBillionaire Carol Eunen GalleryBillionaire David Ip – Museum of Contemporary ArtBillionaire John Gallatin GalleryBillionaire John Gallatin – Museum of Contemporary ArtBillionaire Michael Kors GalleryBillionaire Rosemary Lin GalleryBillionaire Rosslyn Rowland GalleryBillionaire Stern Art GalleryBillionaire Tanya Lindley GalleryBillionaireWai-Min KimBillionaireThe Cosmetics InstituteArt Materials InstituteArticles in Basic: A", "The next Biennial should be held in Helsinki in the spring of 2020, with a new exhibition schedule and exhibition format, which will include a series of lectures on contemporary art and a selection of works made in the space of the biennial. The Biennial of the Arts will be held in the city of Helsinki until the spring of 2021.“There is considerable interest in the project of the biennial of the arts in Finland and throughout the world,” Joakim Jaas, the chair of the commission, told the Art Newspaper. “This is an exciting project for Finland, and the entire Nordic region, as we continue to enjoy one of the highest cultural production rates in the world.”\n\n\nThe British Contemporary Museum (Bcm) in London has received a major boost in funding from the National Lottery Heritage Fund (NLHF), the UK’s Department for Culture, Media and Sport, to create an additional £7 million to support the museum’s exhibitions and collections in the coming years. The £6 million will also enable the museum to open a new £3.5 million exhibition space in the institution’s former location in Coventry, the seventh-largest city in England. The new £3.", "The next Biennial should take place in 2021 and will consist of thirty exhibitions. The theme of the exhibition will not be revealed until the date.\n\n\nThe National Gallery in London will now be able to house more than 4,500 artworks from its collection through an upgrade designed to increase the display space by a further 2,000 square feet. The Museum has been working with the firm Gagosian to complete the project, which will increase the museum’s exhibition space by 214 percent, and is now expecting to break ground in the second half of the year. The commissioning of the new building, which is being funded by the National Lottery Heritage Fund, is part of a wider £11 million project to conserve hundreds of rare works by British artists.Through the renovation, the National Gallery will also add 4,000 square feet to its gallery level, increase the width of the main gallery, add 5,000 square feet to its senior spaces, and increase the exhibition space by 300 percent. The National Galleries Trust (NGM), which owns the National Gallery, also added 5,000 square feet of exhibition space to the National Theatre. The National Galleries, which have worked together to conserve a staggering 214 works of art since it opened in 1848", "The next Biennial should take place in the fall of 2020. While the first exhibition was held in July 2019, the first exhibition in 2020 will be staged at the Museum of Contemporary Art Los Angeles and will be curated by artist-in-residence Kristi Rose.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed two artists for the 2020 iteration of the Los Angeles Biennial, titled “Away From The City: Gender and the Highways”\u0097Diane Russell-Davies and Zendaya Jomes. Both artists will be featured in the biennial, which will run from March 16 to March 20, 2020.“Together, Diane and Zendaya embody the essence of contemporary art at its most powerful and exciting: their simultaneous vulnerability and vulnerability as equals,” said Michael A. Weiss, president of MoCA and a curator at the Museum of Contemporary Art. “Through their gender-bending, gender-bending, gender-bending, gender-bending installations, they bring to light the often invisible bodies and the ways in which we are shaped by gender.”Russell-Davies was selected to represent the United States in a competition run by the Los Angeles County", "The next Biennial should be announced in the fall of 2020. The London-based museum will be housed in a former munitions factory in the capital and will mount twenty-five exhibitions, including a documentary by the architect Ralph McQuarrie, a retrospective of the work of sculptor Charlotte Spencer, and an exhibition of early photographs by modernist David H. Koch.The award-winning curator Kate Crawford, director of Tate Britain, and Thomas Condon, the director of UBL, said: “We are thrilled to establish the biennial at the heart of our city, the most beautiful site in London and one of the most important buildings in the world, and to present the first exhibitions of works by these and other pioneering artists. I have long admired the exhibition of the work of Anita Bechta, Antony Gormley, Herbert Halsey, and Thomas Merton and their impact on the life and work of these three remarkable artists, but this is a very special year to host them. We hope that by the opening of the Biennial in 2020, the biennial will be a landmark in the way we think about contemporary art and the world.”\n\n\nIn the days since the French satirical newspaper Charlie Hebdo published the bloody", "The next Biennial should take place in 2020.\n\n\nThe Christie’s International Art Biennial, curated by Deborah Adams, has released the list of seventy-nine artists who will be featured in its fifth edition, “The Art of Sale: The Fifth Edition.” The event will run from March 18 to March 21, 2020 in the stunningly beautiful Egyptian Palazzo Nazionale di Cotamagra in Venice.The list consists of fifty-four artists, including artists who have lived in Europe since the late 1940s, as well as twenty-four contemporary artists and twenty-two classical and experimental artists, including Andrea Graziani, Christo, and Yannis Hamblin. The artist-in-residence list includes Leonardo Delle Paternosteri, Anselm Kiefer, Andreas Lundh, Paul Mpagi Sepuya, Pari Dukovic, and Sara Szostak.The event will also feature ten new commissions from twenty artists who are part of the new Diamond Alliance, including Olivier Bihan, David Bailey, Lillian Bick, Tobi Ellsworth, Kirsten Augustin,", "The next Biennial should be held in the following year.13\n\n\nThe California Academy of the Arts (CAA) has released its 2020–21 biennial schedule, which will be curated by Laura Weiler and featuring work by sixty artists and is currently on view through April 5, 2020. The biennial, titled The Metamorphosis, will be hosted at the Museum of Contemporary Art Los Angeles through April 12, 2020.“Laura Weiler’s playful and inventive style has been reimagined by two masters of the medium, Martin-Armand and Mariner L. Guggenheim, which are sharing their visions for the Metamorphosis as a vibrant, visionary, and challenging new work about the cultural and social life of America,” said Laura. The museum will stage The Metamorphosis in the museum’s courtyard. The exhibition will be inaugurated by a three-minute video installation by artist Robert Lopez, which will follow the opening of the exhibition. It will also feature a new work by artist Rafaela Alves, and will open with a discussion of the exhibition’s theme The Metamorphosis.“In the words of the artist, ‪", "The next Biennial should be in February 2021, and the first exhibition in March 2022.\n\n\nThe Ann-Elaine Foundation, an organization dedicated to supporting young artists and their work, has appointed Caroline Wells as its next executive director. She will take up her new post on July 1.“We’re beyond excited by Caroline’s ability to lead and develop the foundation’s contemporary arts program in the US,” said Naima J. Keith, the foundation’s executive director. “While we are proud to work with Caroline, she brings a deep understanding of the Ann-Elaine Foundation’s contemporary arts program and vision. She is a great fit for Ann-Elaine’s mission to grow the arts and inspire communities by fighting for social justice and social justice issues.”Prior to joining the foundation in 2013, Wells served as the founding curator of the studio platform Bioworld. She also curated the inaugural exhibition, “The Painted House: Art of the Pacific Rim,” at the American Alliance of Museums, the Museum of Contemporary Art Los Angeles, and the Museum of Contemporary Art Shanghai and curated the first show of the new brand, “Shelter:", "The next Biennial should be held in 2022. The next edition of the show will be held in Japan, and will focus on the history of sculpture and in the process of performing arts. \n\n\n\n\n\nThe Art Newspaper\n\nApril 3, 2018\n\nThe Art Newspaper is reporting that the National Galleries of Scotland are preparing to remove the Tomb of Robert Burns from its campus and move it to Edinburgh, the capital of Scotland, where it will be rebuilt by the Scottish National Gallery. The Art Newspaper reports that the move will cost the National Galleries around £1.8 million ($1.9 million). The move is part of a wider plan to reduce the institution’s footprint by more than seventy thousand square feet. The move is part of a wider plan to reduce the institution’s footprint by more than seventy thousand square feet. The National Gallery of Scotland has yet to finalize the move plans. The move, which will take approximately eighteen months, will involve the dismantling of the current structure, which comprises of the museum’s five exhibition halls, a library, a conservatory, and the town of Burns, which is a UNESCO World Heritage site. The museum will then construct a new, 150,000-", "The next Biennial should be held in 2021, and the 2020 will be the last, according to the festival’s director, Maria Balshaw. “The next Biennial is not a foregone conclusion, nor is it a given date. It is something that has to be created, something that has to be nurtured, something that has to be done. That is what life is about, and that is what we are still working towards.”\n\n\nHollywood Minister of Culture Anne-Marie Adeola has ordered a review of the plans for the 2020 edition of the Hollywood Film Festival, which is currently in its sixth year. The Art Newspaper reports that the review will be made up of twenty-four items, including the cultural and economic impact of the event; the feasibility of moving the festival to a larger venue; the rights of the arts to the public and the right of the institutions to refuse to host films; and the degree to which the United Kingdom should engage more with its counterparts in other countries.The review was led by Culture Secretary Maria Miller, who has described the 2020 edition as “dead on arrival.” She added that the curators must “explain why they have chosen to move the festival; what", "The next Biennial should be held in March 2021. The next edition of the Biennial will be held in February 2022.The Venice Architecture Biennial was canceled in March 2019 due to the coronavirus. It will return in March 2020. The 2021 edition of the International Biennial at Artspace is now scheduled for March 27–March 31. The 2022 edition of the biennial is currently on hold.  The international festival is not planning on reopening. \n\nThe Museum of Fine Arts (MFA) in Boston has received a $50,000 donation from the estate of Charles and Edith Morelle. Charles Morelle, the super-wealthy founder of the Morelle Group, which ran the museum from 1976 to 1981, died in 2003. Edith Morelle, the widow of the founder, gifted the institution “a gift of more than $181,000” in 2018. Charles Morelle was an early investor in the museum, which he later described as a “monument to the arts.” He later claimed that the Morelles’ decision to donate their art also gave the institution a legacy that can be continued through his four sons,", "The next Biennial should be held in the summer of 2022. The 2019 biennial was held at the Neuer Galerie Waldweir in Cologne, Germany. Hüseyin, the architect involved in the renovation of the building and the museum, will redesign the museum in collaboration with architect Peter Zumthor. The new building will boast 300,000 square feet of exhibition space, a cinema, a bookstore, a pharmacy, a glass garden, a theater, a music hall, a restaurant, and an underground garden. Currently, the exhibition space is occupied by the Kunsthalle Basel (Kunstbasel), and the Museum Galerie Potsdamer Straße in Frankfurt am Main. The new gallery will be inaugurated by a group show of works by Rebecca Black, and will be followed by a book fair.\n\n\nThe Museum of Fine Arts (MA) in New York announced today that it will continue to operate as it has since it was founded by Henry Luce in 1932 and is being rebranded as the Metropolitan Museum of Art (MoA). The museum will continue to pay homage to the American avant-garde with exhibitions of works by the French� Hergéro and Her", "The next Biennial should begin with a retrospective of the work of Jean-Luc Godard, reflecting the themes of the exhibition and of the biennial. The biennial will then move to the Palais de Tokyo and the garden of the Palazzo Reale di Pieta and will open with a presentation of work by the artist at the Palazzo Reale di Pieta in Venice in 2020. The art of the exhibition will then be curated by the artist himself in 2021. Boschke, who will take up her new post in July, will begin by posting a selection of paintings and sculptures on Instagram and looks forward to working with the contemporary art and design community at the center to foster its growth and enhance the Visio project, which will culminate in the installation of more than 1,500 works by artists and designers in the center of Rome.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has received a gift of fifty paintings that were stolen from the collection of the late collector Richard Edwards, who passed away in California last August at the age of eighty-three. According to the Los Angeles Times, the works were taken from the Armistice Chapel of the American Virgin Islands in Santa Barbara, California,", "The next Biennial should aim to showcase the work of the Los Angeles–based artists, organized under the umbrella of the Los Angeles Biennial and the Los Angeles Museum of Contemporary Art. Artist, curator, and writer Sifang Yang has been named curator of the second edition of the March Biennial, which will take place at the UCLA Art Museum from March 22 to March 24. The seventy-two-day event will culminate with a performance by the Los Angeles Contemporary Dance Group, which will perform a new exhibition titled Art of Life. Yang, who directs the Los Angeles Biennial, said that the show will draw from the film American Beauty, focusing on the artist-centric aesthetic of the 1960s, and incorporate works from the biennial collection. The biennial is currently closed but will reopen with an exhibition of work by twenty-six artists scheduled to open on March 10. \n\n\nCultural Heritage Foundation (CHF) in New York has appointed Stephen H. Smith, the director of the Brooklyn Museum, as its next director. Smith comes to the institution from the American Alliance of Museums (AAM), where he has served as director since 2012. Smith will assume his post on March 5. �", "The next Biennial should take place in the spring of 2020, with a new theme—the human genome and its molecular machinery—and a new exhibition format. This year’s show will be held at the new facility on the ground floor of the Museum. The biennial will be hosted by the same architect, Sumitomo, who has staged exhibitions and other events at the museum since 2002.\n\n\nThe British weekly magazine GQ has announced the launch of an online magazine devoted to women artists. It will be hosted by the London-based artist-run collective Cultivate. The initiative, which will feature an open-ended format, will focus on exploring the work of British artists who are largely unknown to the public.“I’ve long been fascinated by the work of British women artists and their place in the world,” Samantha Bennington, the founder of Cultivate, told the Art Newspaper. “I’ve also long been a fan of the work of American women artists and their place in the world, and especially of the work of Sally Mann. I would have loved to see her work shown in the United States.”\n\n\nThe National Galleries of Scotland will begin welcoming", "The next Biennial should be held in 2022. “Hosting the Next Biennial is an important step in the long-term strategy of the Museum,” said Susanne Haag, director of the Los Angeles County Museum of Art. “We are grateful to the board of trustees, the curators, the staff, and the Los Angeles community for their continued vision and commitment to the project.”Commenting on the upcoming event, Mark Levine, board chair of the Greater Los Angeles Art Museum, said: “We are thrilled that the next Biennial will be hosted by the city of Los Angeles. It is a remarkable institution, built to last and worthy of preservation. We look forward to a new chapter of its rich and storied history.” \n\n\nThe Metropolitan Museum of Art (MoMA) in New York has received a $3.3 million donation from a private collection that includes works by artists such as Mark Rothko and Willem de Kooning, as well as the late British artist Anton Kern and the late sculptor Isamu Noguchi. The gift comes a year after the museum acquired a notable collection of Noguchi’s work, which is housed in the museum’s", "The next Biennial should take place in the spring of 2021. The city’s primary and secondary schools will stay open through the winter, but they will have a limited hours throughout the year. The museum will also be adding new galleries and galleries will remain open through the pandemic. The museum will reopen today, March 5, with the opening of the fifth biennial of the New Museum, which will be on view until March 11. The museum will also be bringing its many holdings, including two thirds of the collection of the European artist Jan and the largest collection of Ethiopian art in the United States. The exhibition will have three new works by the Nigerian artist Rachael Abdi, which was previously on display in the January exhibition “The Body in the House: Painting with Blood,” and will debut at the Museum of Fine Arts in Boston in March. A new biennial of modern dance will be presented next month. \n\n\nThe Italian cultural minister, Dario Franceschini, has issued a statement describing the recent coronavirus outbreak in Italy as “complex and delicate” and saying the country is “working hard to contain the virus,” reports the Art Newspaper. Franceschini’s speech comes"]