["The next Biennial should be in 2021. \n\n*This article was first published on March 27 and has been updated to include a statement from the board of trustees of the Boston Art Museum.\n\n\nAlthough the Art Newspaper has released the full list of the fifty-ninth Venice Biennale participants, the organizers have announced the full list of exhibitors. Among the galleries that were selected for the exhibition are Galerie Lelong & Co., Galerie Lelong, Galerie Marciano, Galerie Marciano, Galerie Paul Gentiloni, Galerie Paulhese, Galerie Paulhese (New York), Galerie Paulhese (New York), Galerie Joseph-Marie Bontan, Galerie Joseph-Marie Bontan (New York), Galerie Jean-Pierre Brink, Galerie Jean-Marie Guiraud, Galerie Lelong (New York), Galerie Lelong (New York), Galerie Marciano (New York), Galerie Mark *, Galerie Maurizio Cattelan, Galerie Paul Maréchal, Galerie Paul Maréchal (New York), Galerie Marlene Podolska, Galerie Marciano (New York), Galerie Marciano (New York", "The next Biennial should be held in the spring of 2020. The event will receive the biennial title from the Board of the Arts. Prize: In recognition of the lifetime achievement of Gerald Dolan, the director of the New York City Museum of Art (NYC MoCA), who passed away last year. More than 2,400 entries were selected for the prize.The biennial will be hosted at the Museum of Modern Art in New York, which will be transformed into a decade-long celebration of his life and work. The event will also include the decoration of the Robert Rauschenberg sculpture Monuments Men, which will be relocated to the Metropolitan Museum of Art. The sculpture was commissioned by the artists in 1997 and was completed in 2001. The prize will be presented in the spring of 2021 at the MOMA’s new home, the Cosmopolitan, in New York City. Prize: In recognition of the lifetime achievement of Derek and Clare Perretta, whose fine-art photography has been exhibited at the San Francisco Museum of Modern Art (SFMoMA), the Los Angeles County Museum of Art, and the San Diego Museum of Art. Three hundred and", "The next Biennial should take up the theme “Art and Terror: Terror from Below” in December 2019.\n\n\nThe Library of Congress has created a new online platform that will allow museums and scholars the opportunity to submit catalogues and other works that were digitized, and therefore preserve the collections and contents of the institutions, for future generations to enjoy.The platform, called the Catalogues Back to the Future, will provide historical and contemporary examples of books, catalogues, and other archives digitized and accessibly through the years. It will also provide tools to assist museums in archiving and archiving exhibitions, catalogues, manuscripts, and other collections, and will serve as a repository for scholarly research.The initiative was inspired by the film Electra, which dramatized the life and work of the American artist and scholar Roger Ebert. Set in 1973, the film follows the artist and his wife, the filmmaker Alma Michaeli, as they digitize and preserve materials from their home and archive it in the fictional town of Electra, Massachusetts.In the film, the couple digitize their collection of books and other archival materials and digitized the contents of the family home in order to preserve the many items that are currently in storage, including their", "The next Biennial should include a presentation of a selection of the work of the great American artists of the twentieth century, including Samuel H. Gass, Franz Kline, and Frank Gehry, among others from the Smithsonian and the Museum of Modern Art. The first Biennial will be held at the Smithsonian American Art Museum in Washington, DC, in 2021.\n\n\nThe Metropolitan Museum of Art (the museum) has appointed cofounder and former chief curator John Collins as director of its artist residency program. Collins will assume his role on January 31, 2021.“John is an exceptional curator who has been instrumental in supporting the residency program since its inception in 2009,” said Marc Glimcher, president and CEO of the museum. “He has been a generous partner to the Met over the years and has been instrumental in cultivating the residency program, which now provides more than 1,700 artists with a unique platform year-round. We look forward to working with him as he oversees the program and to supporting the artists and their work.”A prolific writer and curator, Collins is known for creating online works that connect contemporary art with historical events and themes. His work has been exhibited at the Museum of Modern Art, the Museum of Modern Art", "The next Biennial should take place in 2020. The twenty-Fourth will take place in 2022. Wang has been working as a curator at the museum since 2014. During his tenure, he curated two shows, Diaspora: Art and Identity in China (2015) and The Masseldoc (2017), and helped organize a number of exhibitions.  He also served as a director of the Fudan University Museum of Art in Shanghai from 2016 to 2018 and 19, representing the institution in the inaugural exhibition of the museum.\n\n\n\n\n\nThe Los Angeles County Museum of Art (LACMA) is planning to launch a local digital platform for artists and their works on March 23. The platform, called the LA Artist Portal, will allow the public to connect with artists and view works in real time. The site will also host monthly public events, such as user-created art walks, and will host a series of documentaries, art shows, and other programming, including a retrospective of artist Rirkrit Tiravanija’s work, “The Tear Gas Experiment,” which opened on December 7; and will host a series of events, including book signings, Q&As, and more.“The", "The next Biennial should aim to produce an interactive exhibition that engages both the contemporary and the ancient worlds through the study of the creative processes behind the sources of culture, and of the ways in which culture exerts political, social, and cultural influence. The full list of participating artists is as follows:LebanonKariba, Lebanon\n\nFranceMcDonald’s, New YorkCity Gallery (New York), New YorkMuzrajali & Mahade, New DelhiMahir & Mahade, New DelhiKhader and Mahade, New DelhiBaron Golden Gallery, LondonBajrangnav, New DelhiBaron Gorakh, New DelhiBetye Larkin Gallery, London Bauhaus, New YorkBauhaus-New York, New YorkBauhaus-New York, New YorkBauhaus-New York, New YorkBauhaus-New York, New YorkBauhaus-New York, New YorkBauhaus-New York, New YorkBauhaus-New York, New YorkBauhaus-New York, New YorkBauhaus-New York, New YorkBauhaus-New York, New YorkBauhaus-New York, New YorkBauhaus-New York,New", "The next Biennial should be held in 2020. The brand said that it will also continue to support the institution by providing it with new programming.  The decision to pull the plug on the inaugural edition was made amid the ongoing investigation by the government into how the controversial law was implemented. Maharashtra recently became the latest state to suspend the controversial section 377 law, which criminalizes consensual same-sex relationship.Government commissioner of cultural and heritage development Vinod Khosla announced the decision to suspend the 377 law on August 29. Earlier that day, he had instructed the state government to prepare to repeal the controversial law by September 16, but the state government has since claimed that the repeal process will likely take up to three months. Khosla cited the ongoing legal proceedings against the 377 law as one of the reasons for the delay. The landmark 377 ruling, which came in a landmark 2014 verdict, declared that homosexuality was a \"mental disorder\". It also made homosexual acts punishable by up to two years in prison.The landmark judgement was in part overruled by a higher court in Mumbai, which had struck down part of the 377 verdict, and was upheld by the country's high court last month. Soon after, Prime Minister Narendra Modi announced that the state would soon be recognised as", "The next Biennial should be staged in 2021; its theme “67 Years of Vogue: Fashion” will be revisited in 2022, and the first exhibition, “The Art of Fashion” will be staged in 2023. The next iteration of the Biennale will take place in Hamburg in 2022, and the fifth iteration will be staged in Almaty in 2021. The 2020 edition, “Hamburg: Fashion” went on to become the first retrospective of the artist’s work to be staged outside of Italy.Sebastian V. Fung, the artistic director of Almaty’s Triennale, said: “The depth of the artist’s art is reflected in such a large, open, and unique exhibition. In such a short time, the artist has created one of the most important modern works of fashion. The kind of work presented here is the work of a man who is not a specific artist but a visual artist, and whose work is a reflection of the creativity of an artist who is a great scholar of fashion.”The biennial will be organized as a series of exhibitions, described by the photographer as a “continuation of the exhibition of", "The next Biennial should be held at the Museum of Modern Art in New York. The 2019 edition, which was originally scheduled for March 18–March 21, will now be held from September 5 to September 7. The biennial will also include a Curator-in-Charge workshop and an exhibition of work by the artist and poet Jodi Picoult, as well as a conversation, a series of lectures, and a concert. In addition, the museum will stage the first public performance based on a book written by Picoult, which will be presented by the artist as part of the first exhibition organized by the biennial, entitled Art from the Life of Julian Albright.The biennial will be organized as a platform for the discussion of the artist’s legacy through a series of collaborative projects. The show will address the themes of the biennial’s first exhibition, “beauty and science” (2019), and “feminism and the breast,” which is currently on view until October 3. The art that lies in waiting will be presented on September 6. In 2018, the show was inspired by the artist’s late husband, American painter Walter de Maria, who was a prolific collaborator. A", "The next Biennial should be held in the City of Helsinki in 2020. The design of the exhibition will be inspired by the exhibition “City of Helsinki: Architecture Between the Two World Wars.” The exhibition will be organized by the Helsinki Architecture and Design Foundation (HAS), the National Museum of Finland (Jugarno), the National Museum of Finland (Kito), and the National Museum of Finland (Kollektivi).The biannual event, which will also mark the 100th anniversary of the institution, will be held in the iced-over and refurbished Grand Court of the National Museum of Finland, which has been closed since March 2018. The grand opening and closing ceremonies will be held at the National Gallery of Finland in Helsinki on December 26 and January 16, 2020, respectively, and the exhibition will open on January 12, 2021.The opening ceremony will be held at the National Gallery of Finland on February 13, 2020, and the closing ceremonies will be celebrated at the Grand Gallery of Finland on February 14, 2020. The show will run until February 20, 2021.The fair’s inaugural edition, “Between the World and Me,” was held in Helsinki in 2018. The exhibition was presented by the", "The next Biennial should be held between June and September 2021. Art Basel has also announced its 2019 edition in Milan, which will take place from May 27 to May 28. The fifth edition of the event will take place in the city in September 2020.  Since its inaugural event in 2008, the exhibition has been celebrated in over sixty countries and has been likened to no other. “We are extremely happy to have the 2018/2019 event at the end of the sixth season in Milan,” said Marc-Olivier Aubert, the CEO of the firm Omega Gallery. “We have learned a great deal from the previous editions in the city and are confident that we will continue to create a destination event of such great international importance.”The Milan Art Museum (MAM) is also planning to shutter its doors to the public in April 2020 to prepare for a reorganization of the institution that will include the construction of a new exhibition space and the restructuring of its collection. The new structure will seek to increase the museum’s exhibition space by 25 percent and its collection by 25 percent. MAM director Carlo Cipolletta has also expressed his confidence in the new design. Artnet reports that the museum", "The next Biennial should take place in 2021, with a thrill for the senses set to follow. “The next edition will be about exploring the possibilities and the challenges of art and will be a celebration of the spirit,” said Sattel.\n\n\nThe Philadelphia Museum of Art (PMA) has released its list of the twenty-six artists who have been selected to participate in the fifth edition of the Philadelphia International, a multiyear festival that was held in the city’s historic St. Mark’s Episcopal Church in May 2016. The seventy-three-day event, which premiered at the church on November 9, featured eighty artists and more than three hundred performances and events. “The Festival is a celebration of the spirit and the arts, a celebration of being alive, a celebration of the creative life,” said Dean Michael Haus, director and CEO of the Philadelphia Museum of Art. “The Philadelphia International is an opportunity to connect with the artists and the communities that have shaped our city and region and to lend a hand in their endeavors. The artist residency program is an opportunity for the local community to learn from a network of artists and to connect with the work of the festival.”", "The next Biennial should be announced by the end of the month, and the first exhibition should open in the spring of 2020. The art-world calendar is always undergoing a major transformation and has never been more relevant, so we are working hard to facilitate a new and differentiated experience for visitors to our galleries. Biennials, like any other events, are an extension of our daily lives, and we hope that the new exhibition programme, which will be curated by Olu Oguibe, will be a moment for reflection, collaboration and reflection.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has built a new $600 million endowment that will help pay for the construction of a new Prince George “display space” in the museum’s former home on the 900 block of Pacific Coast Highway. The $600 million augurs an important milestone in the museum’s evolution as it plans to reopen the museum in 2020 as part of a $1 billion expansion, complete with an expanded collection, a new collection of more than 1,500 works, an expanded theater, and other enhancements.The new museum, part of a $1 billion expansion project that also involved the reopening of MoMA in the summer of", "The next Biennial should take place in 2022, at the Marina Bay Sands in Abu Dhabi. The exhibition will focus on “magic realism” and “historical re-creations,” and will be authored by artist Ali Yass, who underwent a gender reassignment operation in 2015, and will be staged in conjunction with the fifth edition of the Abu Dhabi Biennial, which is currently underway. The exhibition will be hosted by the Abu Dhabi Museum of Art.\n\n\nThe National Gallery Britain (GMB), where over two hundred exhibitions have been cancelled this year, has demanded that the private art market pay for the shortfall in funding due to the pandemic. Following an outcry from Tate artists, the London museum revealed that it will not be able to pay out the $79m it receives from the UK’s General Insurance Corporation (GIC), the UK’s government agency for arts funding.“We are increasingly concerned that the situation we are all facing will only get worse before it gets better,” said Evelyn Bick, director general of the National. “The last few days have shown us that we are not alone in our fears. We are not alone in our expectation that the crisis can only get worse", "The next Biennial should take place in 2020. The new exhibition will feature works by the artists, including David Cage, Paolo Baratta, and John David Dunlap, as well as works by modern and contemporary artists interspersed with historical accounts of the project. The 2019 exhibition, “Calabria and the Art of the Past,” explores painting from a historical perspective of the Italian peninsula in an attempt to present the concept of Italy as a city of painting.\n\n\nThe Dutch government approved an international agreement on the protection of artworks and other heritage assets that will potentially address the country’s mounting crisis over the coronavirus. Under the terms of the ambitious treaty, the Dutch will invest approximately $9.3 billion in the first three years of its presidency and will launch an ambitious curatorial program of major exhibitions, residencies, and scholarships.“The condition for the investment is that the Dutch are able to establish a new, permanent international center for the protection of artworks and cultural heritage in the Netherlands,” Dutch prime minister Mark Rutte told reporters. “It is an ambitious target, but I think we have a reasonable chance of achieving it.”The funding is part of a $9", "The next Biennial should be organized within six months and will be a mix of work/making/experience and will focus on the international and contemporary issues of financial support and health care in the developing world. The exhibition will include works on art and finance and the biennial will be an extension of the intervention program launched by the Margaret and Alphonse M. Cummings Foundation. The next edition will be held at the MCH Group in New York in 2021. \n\n\nArt historian Claudia Sheehan, a founding curator of contemporary art at the city’s Museum of Arts & Design (MoAD), is joining the Center for Contemporary Art (CCA) at the University of Pennsylvania. Sheehan, who has curated public exhibitions at the Whitney Museum of American Art in New York since 1992, will curate a triennial of works by California-based artist Rachael Avery in 2021 and 2019, respectively.“We are thrilled to be able to support and champion the work of the talented and dedicated gallery exhibitionists who have been creating provocative, innovative, and thought-provoking works for forty years,” said Marc Glimcher, director of the Center for Contemporary Art. “The curators’ achievements and dedication to contemporary", "The next Biennial should be in 2020, he said. “I am hopeful that in fact we will be able to stage a good show in 2020,” Marcotti said. The New York–based firm had already indicated that it would not return a $1 billion check from the city for the demolition of the Zuccotti Park in January 2019, citing the construction of a new water park as the reason. The Zuccotti Park, a former park founded by Italian immigrant immigrants in 1986, was recently renamed in honor of the park’s seventy-sixth anniversary.The redevelopment of Lower Manhattan is being overseen by Sotheby’s, which will construct the Zuccotti Park in partnership with the city of New York; the Museum of Modern Art in New York; and the Museum of Modern Art-South, which will re-create the site of the former Museum of Modern Art in Harlem. The architect of the project, Joseph Kahn, is also a partner at Sloane Square Group, the New York–based firm that designed the former Metropolitan Museum of Art in New York and the Museum of Modern Art in New York, and is the designer of the newly renovated MOS; the Museum of Modern Art-New", "The next Biennial should take place in 2021. Since it will be a retrospective, not a performance, the 2019 event will be remembered for its twenty-five-minute performance, titled Uncensored. “I wanted to create a show that involved the work of a single artist but also a broader social and cultural enterprise,” said artist and director Maria Corina. “I hope that this exhibition will continue to foster our mutual understanding, honesty, and sensitivity, and to help us reflect on the possibility of art and politics being held together in harmony.”The biennial’s opening was originally scheduled for June 27, the same day Penske’s annual New York City ArtWalk would kick off. But due to Covid-19, the event has since been pushed back to September 23. The exhibition will continue to be curated by Igor Stravinsky, director of the Museum of Modern Art, New York; Richard Lanza, artistic director of MCA New York; and artist and curator Kate Douglas. The full list of participating artists is as follows:Alain Gauger (France)Sasha Ahmed (Australia/New Zealand)Kirsten Ainley (New Zealand", "The next Biennial should take place in Rome in 2022. The institution has already drawn nearly ten thousand visitors to its new sculpture park, the Forum, in Venice, and has staged numerous exhibitions, including a retrospective of the work of Kim Szymon and an exhibition of work by the French artist Aline Labe.\n\n\nThe first major retrospective of the Italian photographer Bettina Baratta, the first to show the work of the troubled artist under her own name, opened at the Handel Museum in Berlin on August 11. The exhibition drew seventy-nine art lovers from fifty countries and twenty-five countries and territories and is slated to run from September 1 to September 28.Baratta was born in 1943 in Milan, Italy, in a family of the Matin family. Her father died when she was only three years old, leaving her mother to raise her. After studying landscape photography at the Institute of Arts in Lugano, Baratta moved to Venice in 1967, where she would live and work until 1987. She returned to Milan in 1987. In 1998, she and Simon Dalrymple published a book of Baratta photographs, Dara Baratta: Life on the Waterfront.The exhibition will highlight the work of eighty collectors, dealers, and art", "The next Biennial should offer a wide range of work, reflecting many of the themes that have impacted the art of the museum in recent years. This year’s selection, which will include work by thirty-two artists and collectors, will include work by artists from twenty-eight countries and regions.\n\n\nThe Stratford-on-Avon Art Gallery in England announced that it has received a significant donation of forty works from the collection of Catherine Strachan. The donation includes works by artists like Richard Anuszkiewicz, James Turrell, and William Wordsworth; as well as two rare works by Willem de Kooning, one of the most recognizable artists of twentieth-century art.The donation was made by the Strachans and the British artist Richard Anuszkiewicz. In the collection, which comprises works dating from the 1970s and 1980s, the artist discovered that the late British artist Gavin Brown, whose work has been collected by the Stratford-on-Avon Art Gallery since 1981, purchased some of the works from the artist’s estate.The gift includes two works by Brown that were recently on display alongside their work in the exhibition “interstellar: evolu-tion", "The next Biennial should be held at least ten years after the late artist David H. Smith’s death, but I hope that will be the case.”Smith’s work can be found in the collections of the Museum of Fine Arts, Boston; the San Francisco Museum of Modern Art; and the Metropolitan Museum of Art, the Museum of Modern Art, and the Hirshhorn Museum, the Smithsonian American Art Museum. The museum hopes to stage the inaugural exhibition, “David H. Smith: The Man who Embodied Nature” at the Metropolitan Museum of Art in September 2018.\n\n\nThe National Gallery of Ireland (NGA) in Dublin is preparing to welcome visitors to the institution from the United Kingdom in November 2020 following a €50 million expansion effort. The renovation of the institution, which has a permanent collection of more than 1,000 works of art, including works by British painter Adrian Piper, who often used his body in his work, the two-dimensional paintings of dresses and women, and contemporary art.“This is an exciting time for the NGA and for the creative community in general,” said NGA director Niall Ferguson. “The expansion of the NGA is part of a strong and global", "The next Biennial should be in 2021, and the third in 2020. New York, London, and San Francisco will be the first cities to host the event.\n\n\nAs France, Germany, the Netherlands, and Norway prepare to launch their pilot programs for social care, the European Commission has released guidelines for the new public-health initiatives. Among the changes are an emphasis on short- and mid-term care, the sharing of technologies, and an attempt to reduce the number of patients housed in state-run institutions. The guidelines were released on January 15 and are based on what has been learned so far during the third phase of the comprehensive Three-Legged Citizen Campaign, a three-year research project, launched in conjunction with a letter from more than 1,500 French, German, and Norwegian doctors, academics, and other health experts in March. “France has the opportunity to lead the way in the European Union in developing a new movement that can strengthen solidarity between society and the environment,” said commission president Emmanuel Macron. “This is a moment of great change for human and physical health. It is time to act.”The commission also unveiled new safety guidelines for mobility, housing, and work. They outline the best ways to prevent", "The next Biennial should be held in 2020.\n\n\nThe Arts Council England (ACBE) has announced that the first edition of ACM International will be held in Ljubljana, Slovenia, in 2021. The event will take place in the province of Praha, where the Arts Council has a campus in the city of Ljubljana. The inaugural edition, which was organized by the Associations of Contemporary Arts (ACME), will focus on contemporary art from the United States. The 2020 edition will take place in Ljubljana. The 2018 event featured work by seventy-five artists and writers, including Amber Piet Mond, Susanne Vielmetter, and Mark Rylance, as well as an exhibition of work by the Danish artist Anna-Sophie Niemann, among other notable artists.  ASSOCIATED COACHER In the lead-up to the 2020 edition, the organization worked with the artist Peter Svartholm to organize a series of exhibitions devoted to the aesthetics of architecture and design. He curated a show of work by the Czech artist Petr Ezin, with Palme d’Or nominee Anne-Marie Metzger. He", "The next Biennial should focus on the intersection of art and design, and on the history of the art and design. It should present a collaborative narrative through a variety of mediums. The full list of participating artists is as follows:Emanuel Ã¿ValladioArmande AraujoArmande BassoArmande BorgesArmande BrugueraBiggie BrownEtienne-Danielle BartoloniEtienne ColombiniEmanuel Agut-FariaEmanuel AlbermiEmanuel Al-BayatiEmanuel Albermi (12)Emanuel Albermi (14)Emanuel Al-KhaledyEmanuel AllamEmanuel BelloccoEmanuel BonacosteEmanuel BrunettiEmanuel CervantesEmanuel Del Val and María Elena Palma de Guantánamo (17)Emanuel DiarraEmanuel Diarra (13)Emanuel DallaraEmanuel Diarra (16)Emanuel Dallara (19)Emanuel Dallara (19)Emanuel Dallara (19)Emanuel Dallara (19)Emanuel Dallara (20)Emanuel Dallara (20", "The next Biennial should be held in 2020, when the exhibition will reopen to the public. The institution, which was founded in 1928 by Italian architect Augusto Ducati, is currently undergoing a major restoration project in the city of Clermont-Auvergne, France, led by the Paris-based firm Prada. The renovation will also include the re-creation of the city of Biarrês\u0097the last surviving medieval city in France\u0097with a new museum and an extension of the Palais de Tokyo.The show, which will focus on the history of photography, will examine the evolution of the medium from WWII to the present. The exhibition will also include additional works by artists who have been neglected by the biennial, including Charlotte Prodger, Paula Cooper, Jim Jarmusch, and Paul Gauguin.“The vision of the Biennial is to create a space for reflection on photography and a space for a more intimate appreciation of photography as a tool of art,” said Louis Vuille Blatrix, the director of the Biennial and the first person to lead the exhibition. “In this critical season, in these deeply spiritual times, the project of the exhibition is to remind ourselves", "The next Biennial should open in mid-March, and the first exhibition should open on March 24. No date has yet been set for the exhibition.The biennial is supported by the European Commission, the Italian Ministry of Culture, the House of Representatives and the Senate, and the Italian Ministry of Education, Universities, Science, and Technology. The inaugural event, “The New World and the Arts”, was curated by Alfredo Celant, the artistic director of La Scala Arti, and will be presented by the Italian architect Dario Catellani at the Basilica di Santa Maria Cassino in Venice on March 23. The exhibition was organized to mark the 75th anniversary of the foundation of the Institute of Modern Art (Adria) in Florence, and to encourage the exchange of art and design across Europe.\n\n\nThe Solomon R. Guggenheim Museum in New York has announced that its acquisition of a valuable 18th-century manuscript, a copy of Germany’s Historischer Kunst (1830), that is currently housed in its collections, will soon be made available online. The acquisition, which will mark the first time that the manuscript will be made available to the public, was", "The next Biennial should take place in 2022, said Kipchak. At a time when the festival is facing many challenges from a lack of funds and a growing concern for cultural heritage in the country, she said: “I’m incredibly optimistic about the prospects for Biennials in Japan. I am hopeful that the Biennials in Tokyo will be a success.”The 2020 Biennials in Istanbul were canceled after organizers discovered that the exhibition would coincide with the festival of the same year. However, Kipchak claimed that they were forced to cancel the event due to the city’s financial crisis. According to a report by the Art Newspaper, Istanbul’s cultural district Galataızade has been closed since April 9. \n\n\nThe International Center for Photography’s exhibition “The Place of Light in Photography” will return to the Italian city of Milan in February 2022, marking the fifty-fifth anniversary of the exhibition’s opening. The exhibition, which combines photography and contemporary art, was originally scheduled to kick off in March but was pushed back a month due to the coronavirus pandemic. In addition, the organization currently has a running agreement with the city of Milan until", "The next Biennial should be held in 2020.\n\n\nThe Liverpool Biennial, described by organizers as “devastatingly unfair,” canceled its next iteration—and the first two editions were canceled as well. Organizers wrote on Facebook that they were “reviewing our future plans.” The fourth edition of the Liverpool Biennial, which was canceled due to the Covid-19 pandemic, will proceed as planned.“The Liverpool Biennial is still committed to presenting works that reflect the incredible range of talent and artistic vision of Liverpool,” the organization said in a statement. “We will continue to listen and listen for your suggestions and feedback, and will make our best efforts to deliver on the promise of the past.”Last month, the biennial was given a resounding \"No!\" when organizers revealed that it would not be rescheduled. The announcement prompted fierce criticism from critics, including the New York Times, who said the decision was made in “shock and disbelief” and that the series would not be rescheduled. The move sparked protests across the globe, including from some in the United Kingdom, which is currently grappling with the consequences of its own participating in the massive global health crisis", "The next Biennial should include the entire Palméam, from the sea to the sky, to which the artist conjures the same \"air\" in which the city of Palméam and the surrounding area breathe. The museum will also make the hottest part of the room, where the painting will sit on the floor and transform into a large-scale picture of the city.The exhibition will run from March 15 to March 18, 2020. The theme for the twenty-third biennial is “Feminine Spirituality and the Body: The Art of Chantal Gebbets in a Time of Crisis” and will be centered around Vivian Nodal’s Ihailalaka (1929–2011). Before becoming a painter, Gebbets was a sculptor; a member of the proto-Indigenous Indian School of American art in Buffalo, New York, and studied under artist and educator C. K. Dayal in the 1970s. In the 1980s, she worked as an artist-in-residence at the Brooklyn Museum, where she met her husband, the celebrated Kahneman, who was commissioned to sculpt the sculpture Ihailalaka’s portrait. ", "The next Biennial should focus on the history of the territory, and the activities of postcolonial artists and activists, with a view to identifying trends. “Our project should be a collaborative effort, with the support of the community, to reflect the spirit of the date and to develop a new collection of works in the region,” said Carmen Polosa, the director of the Palacio de Artes Plásticas in Madrid. Though the announcement of the exhibition was brief, the staff was encouraged to plan to participate in the event, which will run from March 21 to March 24.\n\n\nThe Edinburgh-based arts organization the National Art Gallery (NGA) in Scotland has been threatened with a legal complaint by a group that claims the institution violated the European Communities’ Generalized Framework for Art and Human Rights (GLASS) by holding an art fair in October 2019. Since the September 1 announcement of the fair, which was to take place at the NGA’s new home at the National Museum of Scotland, the NGA has faced backlash from the general public and the arts community for not including a question-and-answer session during the event.The Glasgow-based Creative Scotland group claimed that the decision to stage the event was", "The next Biennial should be in 2020. That will be ten years since the museum opened, and we will present it in its most recent iteration, in 2021. The next exhibition will be in 2022.” The 2019 show, “Life After Death: Art and Memory in the Twenty-first Century” explored the concept of “memory without a body,” citing micro-sensitivities, the dissolution of distant forms of memory, and the possibility of “reality as a memory.”The biennial will be divided into a series of exhibitions, which will open in different cities around the globe, and will feature a selected selection of works by sixty artists and collectives. The first exhibition, titled “Feminine/Femininely: Contemporary Art in the Twenty-first Century” (2019), will open at the Museum of Modern Art in New York on October 3 and will be followed by an exhibition of work by seventy-two artists and collectives, titled “The Future Is Female: Contradictions in Memory of Lilith,” which will open at the SculptureCenter in Manhattan on October 6. The exhibition will also be preceded by a “L'Angle retour: Contemporary", "The next Biennial should be held at the J. Paul Getty Museum in Los Angeles in 2021 and will invite artists to explore the origins and the spatial contours of Northern California through new mediums and new forms of expression.\n\n\nThe state legislature in New York has passed a $10 billion cut to the arts budget in the 2018 fiscal year, in an attempt to mitigate the economic fallout from the coronavirus. Introduced by state senator Jimmy Van Bramer (D), the legislation, which will be voted on by the state senate on Wednesday, will eliminate funds for the New York City Arts Council and the New York City Foundation for the Arts, which both receive annual appropriations of $3.1 billion from the $3.2 trillion federal stimulus package, and will also eliminate funds for the New York City Museum of the Arts, the Museum of Modern Art, and the Metropolitan Museum of Art. The legislation, which was passed by the senate on June 22, also cuts the salaries of the city’s top administrative officials and the salaries of the city’s top five lieutenants and chief operating officers by $1.5 million.The legislation, which takes effect immediately, will eliminate the city’s arts funding stream and will instead redirect funds", "The next Biennial should be held in March 2021. \n\n\nThe New York Museum of Modern Art (NYMoMA) announced today that it is temporarily closed due to the Covid-19 pandemic. The museum has shuttered since March 13 and is working on revising the date for the reopening of its entire collection through October 19.The institution revealed that it opened a new eight-story, 125,000-square-foot Science Fiction Museum in Central Park in April, but that it is still evaluating the feasibility of bringing the institution back online once it is fully reopened. Following a thorough search of the region, the museum confirmed that it will be ready to reopen in October. “At this stage of the outbreak, the survival of the institution is our top priority,” said David Zwirner, CEO of the New York Museum of Modern Art. “We are working with the relevant authorities and will have more to share in the coming weeks. We will keep you up to date with any further developments.”\n\n\nThe Museum of Modern Art in New York has received a gift of twenty-six works by Argentine artist and theorist Andrés Manuel Otero. The works, which were donated to the museum by", "The next Biennial should be scheduled for February 12–March 18, 2020. “The Biennial is our collective biology’s central idea,” wrote Frederick O. Wilson Jr., president of the biennial’s board of trustees, in a statement. “When we think of a biennial, we think of a collective body of life that assembles itself to go into a museum for a weekend and to take part in a symphony as well as the annual exhibition. We also think of a museum in a city, a country, or a world that has a government that represents a common interest. The biennial is an attempt to combine these and create a new kind of public space.”\n\n\nArt historian and curator Arnulfo Cattelan has been appointed director of the Palazzo delle Papesse in Venice, Italy, for the next four years, marking the end of his long-standing role as a curator at the museum. He succeeds Carlo Cipolletta, who led the museum for ten years and is currently director of the Museo de Arte Contemporanea e Artistica in the city of Bergamo, Italy.“Orsola is", "The next Biennial should be held in 2020.\n\n\nThe estates of the two Scottish men who were executed on Wednesday for their roles in the 1995 Athens Olympics, Derek and Jimmy Savile, have announced that they are in negotiations to receive payments as part of a $4.4 million settlement.The estates, for whom the deal was made after the men were convicted of murdering eleven-year-old victim Penny Farmer in their flat in Glasgow on July 5, 2018, have been quietly in negotiations with the authorities for four years, but the BBC reports that the negotiations have been ongoing since last June.The British Museum and the National Museum of Scotland have said that the men will receive following their death: “In a world where we are increasingly distracted and distracted by the digital, the digital landscape, and the digital culture of the Internet, and where much of what we see online is recreated and repurposed, the men are gone. The men have no place in our lives, and the men have no future.”The institutions were contacted by the families of Jimmy Savile and Penny Farmer, a ten-month-old baby boy who was brutally murdered in the flat, which is located on the second floor of the building, on", "The next Biennial should conclude in December 2020. The biennial exhibition will also host the first permanent public performances of the works of the artists that it will be exhibiting. The event will feature three curated collections, curated by Giacomo Balla, Gio Ponti and Andrea Ricci.\n\n\n\n\n\nGiacomo Balla, Gio Ponti, Andrea Ricci, Giuseppe Sassi, and Francesca Solmi\n\nThe project will also present a number of original works that, in addition to financing the project, are supporting artists who are working to close their remaining works and reenter the public domain. Among the artists who have signed the letter are Lucio Fontana, Luca Catellani, Luca Cini, and Stefano Cattelan, who were nominated for the Venice Prize for their works in 2019, and Di Rupesti, a living artist whose practice encompasses traveling and installation. The letter is filled with recommendations for the artists whose work will be included in the next edition of the Biennial and offers other suggestions for how the public can support them.“The biennial is a universal platform for affecting social change and is the best vehicle for promoting the creative and philosophical practices of the artists,", "The next Biennial should be held at the V&A, London, in September 2020. \n\n\nThe Architectural Association (AA) in New York has announced that Michiko Nakamura will receive the 2019 Spencer-Atkins International Art Award in honor of her contributions to the field of architecture. The honor, which is named for the architect who represents the United States at the annual award ceremony, will be presented to the recipient on December 8.Nakamura was chosen from a shortlist comprising Thomas Middleditch, Laura Owens, Andrea de Cleyde, Andrea Fausini, and Paula Cooper. Among the artist-in-residence selected for the 2019 ceremony were Sara Cwynar, Hannah Chan, Cara Cwynar, Hannah Brand, Tanya Brand, Annie Brewster, Laurie Brodbeck, and John Barlow.“Middleditch’s work is a monumental achievement, capturing the essence and spirit of what is supposed to be the last great American architect, and in doing so, bringing us back to the formative years of American culture, when there was still a lot of competition and beauty,�", "The next Biennial should be on November 21, 2021, at the Museum of New York. \n\n\nThe Sheffield Art Gallery (SAG) has welcomed Melissa Ashwell, who has worked at the institution since 2007, as its new curator of contemporary art. She succeeds Larry and Susana Lafontaine, who have helmed the museum since 2005, and will take up the post on January 3, 2021.“After working closely with Larry and Susana for over a decade, we are very pleased to welcome Melissa as their new curator of contemporary art,” said Larry Gaskell, secretary of the South Yorkshire Council. “Melissa has a strong and distinctive curatorial background, having worked as a curatorial assistant at the Museum of Modern Art, where she most recently directed the art department, and brings an exciting range of experience to the curatorial team.” Recently, the gallery has showcased new works by female artists, including Daisuke Hasegawa and Ming Shi, as well as works by artists whose work isn’t currently on view, such as Yinka Shonibare and Richard Avedon. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced", "The next Biennial should be held at the City of San Francisco in 2020. [Update: November 21, 2020, 2:00 PM] The first edition of the show will be held at the Museum of Dutch Art in Kassel in 2021, and the second at the National Museum in Oslo in 2022.\n\n\nThe Galerie Lille: In the Year of Our Lord 2018. The opening of the exhibition, “In the Year of Our Lord 2018” was marked by a combination of performances, readings, lectures, and presentations that have been organized around themes of inspiration and the divine. The works of French and German sculptors Jean-Luc Moulène and Wolfgang Pfeifer were included in the exhibition, which focused on historical figures that are often considered unrepresentable archetypes. The exhibition was curated by Jean-Pierre Ghebaly and Sophie Normand.“Sculptors are at the core of each other’s productions, of the possibilities of art in a symbolic way,” said Lille-based curator Jean-Pierre Ghebaly. “They are the true masters of the universe, and the most important role models for the generations that follow.”Moul", "The next Biennial should be held in the autumn of 2020, with a new theme, “The Future Is Now: Climate Change,” and a new host, “The Future Is Not What It Used To Be.”The new exhibition will be curated by the Danish professor Lars-Ingeborg Lærdal and will be hosted by the Museum of Modern Art, New York; the Serpentine Gallery, London; and the Finnish Museum of Art, Helsinki. The exhibition will open to the public on September 13 and will run until October 3.\n\n\nArt historian, curator, and author Mark Mazzetti, a well-known writer and editor who was a co-editor of Artforum, was found dead on Friday at his home in Manhattan from a single gunshot wound. He was sixty-one years old.Born in 1951 in Roscoe, Illinois, Mazzetti studied with Jacques-Louis Neuville at the University of California, Berkeley, before moving to New York to teach art at the University of California, Los Angeles (UCLA), along with Joan Kunhardt, Harvey Schwabe, and Peter Schäfer. He went on to publish several books, including In the House of M, and “The State of", "The next Biennial should be held at least twice a year, and should draw from the 2013–14 and 2019–20 editions, according to the organizers. The 2020 edition, titled “Between the World and Me,” will be held at the Artatz in Frankfurt.\n\n\nThe Tug of War Festival has announced that it will honor the contributions of American sculptors Maury Gish and George OʙBrien in its twenty-fifth edition, which will take place at the Carnegie Museum of Art in Pittsburgh from January 6 to January 9, 2020. The event will also feature two solo exhibitions, one of which will be organized by the Charles and Diana Taylor Foundation, and the other by the Metropolitan Museum of Art, the Museum of Modern Art, and the San Francisco Museum of Modern Art.The fest, which was founded by artist-activists in 2004, is one of the largest annual fundraising events in the country and has raised more than $4 million for artists in the past. In the twenty-fifth edition, Gish and OʙBrien will each receive $10,000. Their sculpture The Tug of War for the United States will be exhibited in part two of the event. “A great deal has changed since we", "The next Biennial should be open to the public in 2020.”\n\n\nFollowing the 2014 police killing of George Floyd, in which thirteen-year-old Amadou Diallo was killed by the police, a grand jury in Brooklyn declined to indict the officers involved. The decision sparked protests from civil rights leaders, activists, and politicians, and led to a push for reforms in law enforcement. Among the reforms being considered are the release of information about police misconduct complaints and the training of new officers. The grand jury decided to not indict the officers Kevin Li and Ronald Griner for Floyd’s killing, but it still found them liable for their supervisors’ use of excessive force. The New York Times reports that the officers were given six months of training in de-escalation and how to de-escalate situations before Li and Griner were charged with murder in 2015, and that the officers were given ten days of community service after a grand jury cleared them of criminal charges.Following the grand jury’s decision, the New York City attorney general’s office filed suit against the officers. They have pleaded not guilty and are currently being sued by the state of New York.While the officers have consistently denied wrongdoing, they were", "The next Biennial should take place in the spring of 2021. The theme of the 2019 edition was “How We Live Together.”\n\n\nThe museum’s collection has been restructured in recent years in order to comply with a new set of guidelines for the display of modern and contemporary art. Although the institution remains committed to depicting all works in its collection in its entirety, it made several structural changes that have reduced the museum’s main exhibition space. The changes include the relocation of the museum’s main collection—which comprises all works by contemporary artists, as well as works by artists of other periods—to a new building on the museum’s campus, the renovation of the museum’s galleries, and the introduction of a new weekly art lecture series.The changes have been made since 2015, when the institution opened a new building designed by the architects Gensler & Partners in the former Marfa Motor Company plant on the museum’s campus. The new space, which is being named the Biennial atelier des Beaux-Arts (BBA), will be inaugurated by a program of commissions by Marc-Antoine de Saint-Saëns, Salaam Kandil, and Mohamed Nass", "The next Biennial should be held at the city’s Art Institute of Chicago in 2021 and the Museum of Contemporary Art (MoCA). The city’s other major arts institutions, the McCormick Place and McCormick-Rth, have yet to announce plans for this iteration.\n\n\nThe British architect Frank Gehry, who is best known for his murals, sculptures, works in fabric and wood, and installations that combine photography, painting, and video games, has died. He was ninety-one years old. Gehry was born in London in 1932 and moved to New York City in 1943, where he studied under Robert Miles, Robert Rauschenberg, and Frank Gehry Jr. He married, with his first wife, Beatrice, and had three children. Gehry began his career in the 1950s in New York, where he met his wife and children, Beatrice and his twin brother Leo. In the early 1960s, Gehry relocated to Northern Ireland and began working in the woodlands of Wales, where he met his second wife, Billy. In the mid-’60s, Gehry moved to New York, where he continued to work in wood, and later formed his own company, Frank", "The next Biennial should include a retrospective of the work of the biennial’s co-curators, A.G. Nesjkovic and J. A. Wirth. The 2020 edition will be staged at the São Paulo Bienal and will mark the centenary of the biennial. The full list of participating artists is as follows: Academy’s Artists’ Yearly Awards<|endoftext|>The Philadelphia Museum of Art (PMA) has received a gift of more than 2,500 photographs by the late Italian photographer Pia Camil. The sculpture, titled Pia Camil: Portrait of a Woman, an installation with a focal point located in the northern Italian town of Fiorano, is a work that offers a personal reflection on something that is palpable but often unexamined: the physicality of the female form. The work, which was created in collaboration with the Sommun Gallery in Milan, is part of a series titled “Portraits of Men” that began in the late 1970s. Camil’s portraits are the first of her “Men” series and were developed in a home she shared with her husband, Carlo, in the northern Italian", "The next Biennial should be held in the summer of 2021. The event will highlight the work of emerging artists in the United States and will be held at the Minneapolis Art Museum. The biennial will also include a gallery preview day in April. The Biennale will be hosted at the new space the Museum of Art at the University of Minnesota, spearheaded by curator and architect Susanne Vielmetter, and will be inaugurated in May. The museum will hold the inaugural exhibition, “MUSEUM OF ART” in May and will launch a new digital platform, the Biennial News and Events, in June.“We are thrilled that we will be able to open this new chapter of our history with the inaugural exhibition of the 2019 Biennial at the Minneapolis Museum of Art,” said Peggy Ball, director of the institution. “We are also thrilled that the Minneapolis Arts and Culture Council will be able to support the Biennale by contributing to the immediate construction of the new headquarters, funding the construction of the new building, and offering them the opportunity to present their first exhibition since 2020.”Commenting on the partnership, Ball said: “The Biennale is an essential part of Minneapolis’s history and", "The next Biennial should be held in the fall of 2020, with the aim of producing a work that continues to reflect the spirit of the century.” The board of trustees added that the institution would be “enlightened by the absence of the two worst emergencies in living memory.”\n\n\nAfter a gunman opened fire on a group of people attending a peaceful protest in Washington, DC, on Wednesday, December 3, killing one person and injuring several more, President Donald Trump declared that the United States will mobilize to defend its capital city. Trump made the announcement just hours after the fifty-six-year-old suspect, an American citizen from Afghanistan named Abdulmutallab, was captured and charged with one count of murder and one count of attempted murder.According to the New York Times, the sixty-three-page indictment against Abdulmutallab alleges that the twenty-four-year-old man was radicalized by videos and images depicting violence against civilians, as well as depictions of the United States as a “safe haven for terrorists.” The indictment also alleges that the man acted alone and that the killing was premeditated.According to the Hill, the forty-one-hour siege ended when the man who was detained at", "The next Biennial should focus on how biennialism can be both a tool and a platform for social change. For me, the work of the biennial is not only about celebrating my heritage and my values, but it is also about creating a new kind of public space: one that is a public space for all.”Other curators, including Alice Procter, Luis Berrada, and Luis Fonsi, for whom the time is finally ripe, are organizing exhibitions that address topics such as the mass incarceration of prisoners, climate change, and political violence.“The best way to understand the significance of the past is to remember that it is a history of transformation,” Jodi Throckmorton, a curator and founder of the biennial and the privatized event space Dark Horse, said in a statement. “I’m delighted that Larkin and Turin’s biennial will be remembered for its visionary commitment to justice and the vital role it plays in moving us forward. I’m confident that in the future it will continue to be a rallying point for artists, scholars, and activists to rethink the contours of justice and the roles of art and culture in social change", "The next Biennial should take place outside of Paris, a Parisian institution. It should lead a dialogue between the artists of the six continents. The themes should be “aesthetics and aesthetics” and the artists should be asked to draw attention to what “makes us” in Paris.This year’s event, “DRAWN UP,” will be held at the Gare du Nord in Paris on December 5–6. The biennial will host seventy-eight artists. The full list of participating artists is as follows:Adam \"Adam\" WilliamsAdam H.T. SmithAdam J. AlexanderAdam Kean Adam L. DeanAdam M. GallowayAdam Pritchard Adam V. SedlacekAdam W. Hall Adam ZahnAdam Zahn-HermannMariane C. Cucheté Mertz & Bélivea (France)Marianne BouchardMarianne BechmannMarlene BrindlMarlene BonnerMarlene BrugueraBénédicte de Montlaur & René MagnerBénédicte de Montlaur (France)Bénédicte Oziou-Mont", "The next Biennial should be held at the end of February 2020. The 2020 edition of the Biennial will focus on the history of the exhibition. According to a press release, the 2019 Biennial captured the imagination of an unprecedented number of visitors. The very first exhibition in the history of the competition, “Theoretical Dreamers: The Art of Film” (2016), featured work by seventy-three artists. The exhibition will mark the twentieth anniversary of the event. The 2019 edition of the competition, “The Situationists,” was organized by the Sydney-based contemporary art collective The Situationists and was held at the Sydney Opera House from March 14 to March 15. The full list of participating artists is as follows:Adeline Boë (New York)Yahya Al Sargent (New York)Anish Kapoor (New York)Jyoti Basu (New Delhi)Paul Bettiner (New York)Nina Bhalla (New Delhi)Edward Bouwmeester (New Delhi)Jean-Luc Boé (New Delhi)Allen Bruguera (New Delhi)Alfred Boyd (New York)Adriana Bramante (New York)Taco Carbo (", "The next Biennial should be held in early 2020.<|endoftext|>I started out as a freelance photographer. I took pictures of people I knew and people I didn't know. I never thought about them as art. I was a photojournalist and editor. I wanted to capture life in pictures. I wanted to show what life felt like through the eyes of other people. I wanted to show people how people really lived. I wanted to show people how to be a part of life. After years of photographing people, I decided to sell my old camera and started a new photographic enterprise. My new book is titled Art and Life: A Visual History , and is out now.It opens with a beautiful shot of a smiling woman in a red dress, carrying a huge bouquet of roses. The photo is a chronicle of my relationship with the artist György Kepes; it is also a celebration of the photographer Henri Cartier-Bresson. As the daughter of a Jewish mother and a Catholic father, I saw life and beauty first-hand. My father worked as a draftsman in a small town in the Adriatic Sea in Italy, and my mother worked as a", "The next Biennial should take place in San Francisco in the spring of 2021. Upon its completion, the exhibition will mark the fifteenth anniversary of a group show, 'The Permanent Show: Postmodern Theory and Countercultures, 1932–1947', curated by John Currin and co-organized by Robert Irwin.The show will comprise forty-three studio presentations that explore the history of art through the lens of postmodern theory, often focusing on nontraditional media, including video and assemblage. The theme for the 2020 biennial’s edition will be “The Past Is Present: Painting with the Palette.” Following a presentation of a portrait by Ellsworth Kelly, the exhibition will feature works by seventy-seven artists. \n\n\nThe National Gallery of Art in Washington, DC, is planning to open a new digital space in the city in 2022. The National Museum of Fine Arts in Cleveland—which is currently closed for the first time in its fifty-two-year history—will serve as a hub for exhibitions, educational programming, and public programs as part of a new partnership between the National Gallery of Art and the City of Washington.The new digital platform will allow the National Museum to present more exhibitions featuring a greater variety of", "The next Biennial should have been convened in 2020, but was postponed due to the Covid-19 pandemic. Following a review of the 2018 event, the National Gallery of Canada said that it will now move forward with the 2020 edition.The Art Newspaper reports that the Biennial’s executive director, Cecilia Breitweiser, will leave the institution in February 2020, and the Biennial’s board will consist of three individuals: Adam D. Millikan, David Hoberman, and Doug McClellan. The biennial, which is a collaboration between the National Gallery of Canada, the Royal College of Art in Ottawa, and the Art Gallery of Ontario, will be held at the National Gallery of Canada from March 15 to March 20. The organizers’ decision to move the event was made after they took a look at their schedule and realized that they had only three months left to organize the event. According to a release, the new model will avoid “unnecessarily constraining our exhibition makers’ schedules and will allow us to continue to push the boundaries of what is possible with interactive objects and the new digital medium of the future.”The announcement follows a wave of outrage over the", "The next Biennial should take place in 2020, and the first in 2021. The exhibition will be hosted by the city of Dresden. The biennial will consist of a total of twelve exhibitions, each themed around the theme of the year: 'The Future of Art, the Future of Life, the Future of the Environment, and the Future of the Self.” The first show will showcase the work of seventy artists, and the second of the next exhibition will focus on the themes of the seasons. The third exhibition will mark the exhibition of a new work by a selected group of international artists. The fourth show will focus on the future of art and the future of life. The fifth show will be a retrospective of the best contemporary works of the year. The seventh show will examine the current state of art. The final show, titled “The Future Is Present,” will be held at the Kunsthalle Basel in September.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of works by fifty-nine artists and collectives in the city. Among the works that will be profiled in “The City: The Art and Landscape of New York” are a few that were previously", "The next Biennial should take place in Tokyo, and the festival should mark the twenty-fifth anniversary of the biennial.\n\n\nThe Mall of America (MoCA), the flagship exhibition of the Mall of America in New York, has announced that it will suspend the upcoming edition of its three-day event, “The Art of Fashion,” which was to run from February 15 to March 13, as planned, until the health of the participants is assured.The announcement follows the coronavirus pandemic, which has forced the cancellation of a number of major international fashion fairs. In a statement, MoCA said: “We have been striving to get a show at MoCA that would reflect the vibrant spirit of New York, and we are pleased to announce that this year’s event will return next year. The Art of Fashion program will continue as usual this year, and we look forward to welcoming you back to the Grove this spring.”The first episode of “The Art of Fashion” was canceled following a scare on January 6, 2019, when a man who had come into contact with the virus in the United States and traveled to China became the first person to contract the virus outside of Asia. The episode was also", "The next Biennial should take place in the fall of 2020, as scheduled. The 2020 event will include forty exhibitions, biennial projects, and regular seminars. The first show, “Our Place in the World,” will be curated by Jean-Luc Moulène; the second, “Wangechi Diu,” will be presented by Susanne Vaisman; and the third, “Chilean Art,” will be presented by Susanne Koschinsky. The biennial will run through March of 2021.The 2019 edition of Art in America was announced on September 1 and was curated by Kate McKinnon, Jillian Hanna, and Jodi Thayer. The twenty-fifth, “Art in the Age of Trump,” will take place in the fall of 2020 and will be curated by Max Harris; the twenty-third, “Art Trumps Politics,” will be presented by Mary Roach; and the twenty-second, “The Best Exhibitions of the 20th Century” will be presented by Jennifer Verheyen.“Art in the Age of Trump,” will be on view at the Riga Museum of Art until January 10, 2020.", "The next Biennial should be held in 2020. \n\n\nThe museum in Qatar, which has been closed since March 31 due to the coronavirus, has announced that it has received a total of $66.5 million from the country’s royal government in support of the ongoing renovation and expansion of its Doha Museum. While the funds have been used to restructure Doha’s holdings, they are focused on the institution’s current operations and are not expected to support the construction of any works in the institution.“We are very pleased with the support the Kingdom of Qatar has shown us and are eager to use the funds to further strengthen the Doha Museum, which is one of the most important cultural and historical institutions in the country,” said Qatar’s Culture Minister, Saif al-Khabar.He added that the museum’s current programming, which runs primarily through February 2022, is one of the reasons why the government decided to award the museum $66.5 million. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Sarah Domanick as its next director. Domanick currently serves as the founding curator of modern and contemporary art in the", "The next Biennial should take place in 2020 and will focus on the history of the city, its city-states, and its peoples.The 2019 iteration of the event--which was organized by the Japanese architect Tadao Ando under the Creative Commons license during the height of the Cultural Revolution in Japan--wasn’t held in Tokyo, but was held in Nagoya. The show’s twenty-seven-person curators were from eleven countries: the Czech Republic, Estonia, Finland, France, Germany, Greece, Hong Kong, Japan, Slovenia, and the United Kingdom.The exhibition “Feminine(s),” was curated by the Italian designer Lotta Rosati. The show consists of three hundred photographs by Rosati, each one a portrait of a female body, including the body of a young girl and the body of a woman. The exhibition was displayed alongside works by contemporary artists such as Alex Katz, Roberto Otero, and Mireille Ennuvile.Rosati’s six-decade career began in the late 1960s with her first series, “The Body in Pictures.” Her first major solo exhibition was at the Venice Biennale in 1977, which featured works", "The next Biennial should be held in 2021, and the next will be held in 2023. The institution will also open a new, expanded branch in the city of Zurich, which is currently closed because of the Covid-19 pandemic, in 2021. The Museum für Kunstbank, the private museum that comprises the Rembrandt-designed city of Rembrandt, is planning to open a new location in the city in the spring of 2022.  “The Museum für Kunstbank für des Arts- und Künstler (MKfK) is reopening with a new perspective thanks to the new partnership between the Künstler-Institut für Kunst and the Künstler-Institut für Kunstbau (KAF),” the museum told the Art Newspaper. The Künstler-Institut für Kunstbau will also send over 600 artworks by artists such as Franz Kline and Ruben Martínez, as well as three works from last year’s exhibition “Sittlichkeit,” which was hosted by the Künstler-Instit", "The next Biennial should be held in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has awarded Michael Kors a $10 million contract for the next phase of its renovation, which will include the facelift of the museum’s main building and an expansion of the Esher Theatre. The contract, which will run from 2020 to 2022, was announced by director Max Hollein and CEO Maria Balshaw during a press conference at the institution on Wednesday.“This is a very important milestone,” Hollein said. “Michael Kors is the right partner for MoMA to finish the renovation of its iconic building. To design a new museum with Kors is an extraordinary challenge and we feel it has the potential to be a spectacular addition to the city.”The project is part of MoMA’s strategy to reintegrate the art of the 70s and 80s into contemporary settings. Inaugurating the Esher is a new public sculpture garden, the Esher Pavilion for Contemporary Art, and an expansion of the Esher Theater, which will begin construction next month. The renovation of the original MoMA building, which opened in 1994, began in 1974, and of the Esher", "The next Biennial should be held at the Museo Real de Las Palmas, the Palazzo della Scala, in Rome, in 2020. The exhibition will organize a series of talks on the future of art, with the theme of the year 2020, “Art of the Future,” to be announced by the year’s theme. The next edition of the Fifth Biennial will take place at the Palazzo Reale in Milan, in 2022.The 2022 version of the exhibition will be titled “Art of the Future: The Future Is Now” and will be organized by the artist-in-residence, Andrea Mollino, and the Italian designer Jochen Haag, with the help of representatives from the institutions Prada, the Royal Academy of Fine Arts, the Institute of Modern Art, the Museum of Modern Art, and the Museo del Corlep.MOST ARTISTS is a new collaborative project between the Museum of Modern Art (MoMA) and the Los Angeles County Museum of Art, an initiative that aims to connect contemporary art with Los Angeles. “The Museum of Modern Art is a collaborative project between the Museum of Modern Art and the Los Angeles County Museum of Art,�", "The next Biennial should focus on issues of cultural transmission and the ways in which the museum and the city of Barcelona have been affected by the waves of the pandemic. . . .The next Art Basel Venice should focus on developing and implementing new and innovative exhibition and retail experiences in an attempt to position the Venice, the city of Barcelona, and the city of Barcelona as a model for a new series of exhibitions and retail experiences. However, the theme of the exhibition should be “new and contemporary art.”The next Dubai Biennial should focus on the challenges and opportunities posed by the coronavirus and the impact that the virus has had on the local and international art market. The exhibition will be organized by the Dubai Museum as part of its “30 Days for Art” initiative.The next Paris Biennial will have a theme of “Painting and Drawing in Art” and will take place in September. A new series of exhibitions and residencies, “Art and Architecture in Paris” will open at the Centre Pompidou in Paris on January 10, 2020 and be on view until January 7, 2020. The new exhibition will be preceded by a new book and a new exhibition titled “Art and Architecture in", "The next Biennial should focus on the new ideas and work of artists whose work has had a significant impact on the development and advancement of feminist and queer theory, art, and culture. The first installment was held in 2017 and was hosted at the Museum of Modern Art, New York. The 2019 edition, titled “The Worker,” will be held at the Museum of Contemporary Art Chicago and will take place from October 12 to October 14. The 2020 edition, titled “The Creative Life,” will take place in April and will be hosted at the Museum of Contemporary Art, Art Deco from April 18 to April 21, 2021. Museum director Marc Glimcher said: “This is a moment of great change for the museum. As a profession we are facing many challenges and changes, but we are also faced with a crucial question: what does the future hold for the museum? And so we have decided to focus on exploring the possibilities of new ways of working and new ways of being, new stories to tell and new ways to experience art.”\n\n\nThe Victorian Society in London has announced that it will hold its twenty-fifth annual VIVA centenary celebrations at the Serpentine Galleries in London, the Victorian Dance", "The next Biennial should be held sometime in 2021, with the exhibition slated to open in the spring of 2021. The event will be hosted by the Jack and Julie Moberg-designed museum in the former East Berlin apartment complex, which was transformed into a museum of science and technology in 2008. The museum will be in a state of reconstruction since it has been closed since March 28 due to the Covid-19 pandemic.“Today, we are in the early stages of the recovery process, and the work of the experts continues to depend on the cooperation of the visitors of the museum, the museum staff, and the public,” said Artger Staiger, chair of the board of trustees of the Biennale Berlin-Heidenarff. “We are grateful for the support of the local government, the city of Berlin, and of the European Commission, which has welcomed us here in the past years, and for the collaboration that the Mauer Foundation has shown throughout the process.” \n\n\nThe Museum of Modern Art (MoMA) in New York has reinstated its longtime curator of modern and contemporary art, Robert Irwin, who was fired by the museum in February after he made derogatory comments about the LGBTQ community in an", "The next Biennial should be held in Helsinki in 2022 and will include art from across the globe. The 2020 edition was organized by the Helsinki Art Foundation (HVAF) and was curated by Stefan Hove, Luca Zingaretti, and Jiri Seppälä; attended by Artforum editor in chief Joop de Waal; and was staged in the magnificent FIT facility, located at 25 Vantaa Street, in Helsinki. While the themes of the 2019 edition were “Being and Beyond the Body” and “The Vastness of Space,” the 2020 edition will be “Putting the Body in Perspective: Art and the Body in Space” and will be staged at the SÄKAMENT museum in Kassel.In addition to the near-infinite number of artists participating in the exhibition, the venue will be transformed into a space for public education, research, and reflection. The gallery will also receive additional space to hold its opening reception on March 7. There will be a dedicated gallery, an exhibition space, and other public activities. The first round of the 2020 edition will take place in the autumn.\n\n\nThe National Gallery in London has appointed", "The next Biennial should focus on the history of Jewish life in the United States from the late nineteenth century to the present day and take place in the heart of the city. Should the city choose to hold a second edition of the biennial later this year, organizers will announce more details about that event.The exhibition will also include a monograph on artist Carlos Castano, a biennial of Harlem-based artists that will feature works by forty-eight artists, including Paul Gauguin, Robert Irwin, Robert Irwin and Robert Irwin II, and the first North American retrospective of British painter Philip Johnson. The exhibition will be curated by Amnon Israel Berosh, the curator of this year’s edition of the biennial, and will open with a special performance by the London-based group the Seabirds.\n\n\nThe Paris–based nonprofit the Paris Foundation has named Angelique De Tocqueville the new director of the Paris–based cultural center the Palais de Tokyo. He takes the post from Brigitte Bardot, who has been director since March 2019. De Tocqueville will lead the Palais de Tokyo until 2024, when the institution will be moved to a new site in the city’s rue Lafayette", "The next Biennial should take place in 2022, and the inaugural event will take place in 2021. While the city is still trying to decide on the computer generated artworks for the forthcoming exhibition, which will be curated by Akram Modar, the director of the Center for Contemporary Art, the Museum of Modern Art, the Biennial will be themed \"A Word With Ourselves\" and will be numbered sequentially, with the first edition set to open on January 25, 2022.The fifth edition of the Biennial, titled “How We. Are. Living,” will open on January 26, 2022. The Biennial will also include Encyclopaedia Dramatica: The Lives and Times of David Hale, edited by Musa Abu-Khalili, and will be held at the Ground Zero of the 9/11 terrorist attacks, the Ground Zero of World War II, and the Museum of Modern Art in New York.“The theme of the Biennial is ‘moving beyond the physical to the spiritual,” said Becca Bassett, the director and CEO of the Museum of Contemporary Art. “This year’s Biennial will focus on how we move forward in the twenty-first century, creating", "The next Biennial should be held in the spring of 2022. Namdi and Huwai-Park will work together in collaboration with artists to create an immersive experience that follows real-life events from the two women’s lives and depicts the women’s evolving relationship with each other and with the world.”Huwai-Park, who was born and raised in New York, said: “It’s been a great honor and a joy to bring the Biennial to Shanghai, and to work with the artists and the London-based team that made the Exhibition such an incredible success. I’m extremely proud of the work we’ve accomplished and the future that we envision.”\n\n\nThe National Gallery in London is planning to move its exhibition space in Liverpool Square, known as the Gallery of Modern Art (GMO), to a new location in the city. The new tenant will be based in the National Design Museum (NDP), and will begin hosting exhibitions and performances in the space next spring.The museum has named the new tenant MCA, and expects to inaugurate a new exhibition, “Nos & Strings,” in the new space in the spring of 2023.", "The next Biennial should be held in the autumn, and will be inaugurated by an exhibition entitled “Spirited Away.” The exhibition will consist of a series of photographs that depict the life of Maurice Merabet, a French surrealist artist whose work explores the possibility of a bodily experience that is neither physical nor conceptual.The twenty-five-year-old entrant will receive $175,000. The full list of participating artists is as follows:Aramarka Davis, New Orleans, USA & GermanyCourtesy of the artist/Featuring Rachel KoenigCollin Fernandez, Cambridge, Massachusetts, USA (exhibition)Courtesy of the artist/Featuring Jenna Kelso, New York, NY (exhibition)Courtesy of David Alvarez, New York, NY (exhibition)Courtesy of Adrienne Edwards, New York, NY (exhibition)Courtesy of Joseph Suter, New York, NY (exhibition)Courtesy of David Alvarez, New York, NY (exhibition)Courtesy of David Aitken, San Francisco (exhibition)Courtesy of David Aitken, San Francisco (exhibition)From the artist/Featuring Joe Suter, San Francisco (exhibition)Courtesy of ", "The next Biennial should be held in 2021, but a spokesperson said that the decision was not yet final.  The Pérez Art Museum in Mexico City, which has been closed since February 13, is currently working on a $6 million renovation, and the San Isidro Museum of Art in Mexico City is currently working on a $4 million renovation.\n\n\nThe Association of Art Museum Designers (AAMD) has announced that it is launching a new funding initiative that will provide $4 million in support of art museums that have been adversely affected by the Covid-19 pandemic. For the first time, the organization will offer a direct grant program to smaller arts nonprofits in the United States. The program will initially support a set number of institutions and will target communities in the greater Los Angeles and East Coast regions. The organization hopes that the initiative, called the Covid-19 Impact Fund, will be a model for how arts institutions can benefit from the financial relief offered by the federal and state governments. “The Impact Fund is an important step in helping small and midsize arts institutions survive the Covid-19 Covid-19 Impact Fund will address the immediate needs of institutions facing immediate financial hardship, but will serve as a model for", "The next Biennial should begin as scheduled on Wednesday, March 6, 2020, and conclude on Monday, March 8, 2020. It will be held in the City of Los Angeles at the City of Burbank, and will introduce a new $1 million prize.The theme for the upcoming exhibition is “NIRIN,” a reference to a Hindu goddess and the Indian artist Sudarshan. The artist, who died in 1950, was known for his artworks that simultaneously captured the imagination and challenged the boundaries of traditional notions of beauty.Artists we are looking forward to seeing present their upcoming works in the 2017 exhibition. The exhibition will also be inaugurated by a selection of works by the artist Alejandra Olmián, which will be presented in conjunction with the exhibition “NIRIN,” and will feature new compositions by acclaimed South American artist María Berrío-Alvarez, whose work is currently on display in the exhibition “NIRIN: The Senses of an Artist.”The 2019 exhibition was curated by artist and curator Juan Barba, who will curate the second edition. The first exhibition, “NIRIN,” was organized by the actress and choreographer Nelly", "The next Biennial should take place in 2021, in Tokyo. The first iteration of the show will return to the Tokyo Metropolitan Museum of Art (MMAD) in 2020 to mark the twenty-fifth anniversary of the opening of the art-house television series Pachinko—the second show in the series, Gintama, will be held in Tokyo the following year.The theme of the 2020 iteration of the show is “Pachinko” (meaning politics, money, and urban life). Project director Kazuya Kikuchi said: “We are really excited to work with the Shanghai Museum of Art to make Pachinko Shanghai, Pachinko Shanghai 2020, and Pachinko Shanghai Special, and to revisit our history with the gallery. We are also particularly keen to work with local artists and architects to create something new and entertaining for the audience.”\n\n\nThe Ford Foundation has awarded artists Richard and Yoko Ono $1.5 million in support of their $2 billion Ford Foundation program, which has invested in the works of forty-five artists in the United States. The grants were made during a two-week period in April and May and will total $3 million.“After a", "The next Biennial should be inaugurated in the spring of 2020. The project has been in the works since 2007 and has received funding from the university since 2010.\n\n\nMariners working in the region are protesting a new $5 billion plan to rebuild the Great Barrier Reef, which was released by the federal government this week and aims to mitigate the growing crisis caused by the coronavirus. The plan, titled the Reef and Climate Action Plan, is divided into five parts: Promoting long-term conservation; Increasing efforts to mitigate climate change and conserve and manage ecosystems; Expanding domestic and international support for local communities; Reducing greenhouse gas emissions; and Reforming the economy.The plan, announced by Environment Minister Greg Hunt on Monday, states that the government is committed to reducing greenhouse gas emissions, conserving and managing ecosystems, and implementing long-term climate action plans, but it does not mention the future of the Great Barrier Reef. “I’m deeply concerned by the Reef and Climate Action Plan,” said Mariner Hamilton-Levy, chairman of the Great Barrier Reef Legacy Trust and a cofounder of the conservation group the Trustees of the Great Barrier Reef. “It gives the federal government a", "The next Biennial should be called \"What is Life Without Us?” or \"The Body in Medi-Cal,” which is currently on view. The sixth will be titled \"Toward a Biennial of Contemporary Art in Los Angeles, 1961–1973.\" The first edition of this exhibition was held in 1968, and the final exhibition was staged in 1984.In the event of a full-blown shutdown, organizers are planning to stage a biennial exhibition in the city in 2021. However, as this is a biennial, there will be no opening night celebration, no opening night reopening date, and no opening night ticket sales. The event will be staggered, with the first show in 2020 taking place in December, and the last show in 2021 taking place in March. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles (MCA) has appointed Laura De Sousa, who is currently the director of the Los Angeles County Museum of Art (LACMA), as its next chief curator. De Sousa comes to the institution from the Los Angeles County Museum of Art (LACMA), which she has led since 2014. Previously, she has served as director of the Western", "The next Biennial should take place at the Museo de Arte Contemporáneo in Lisbon in 2022.\n\n\nThe London-based artist, whose internationally acclaimed work explores the concept of the native and the geographic abroad, has died at age eighty-one. His art has been exhibited at the Venice Biennale, the Stedelijk Museum, the SculptureCenter in Shanghai, and the Los Angeles County Museum of Art.Born in London in 1940, to Russian parents who emigrated to the United States in 1948, Arthur Saltman became entranced by the exotic. After graduating from the University of California, Los Angeles in 1953, he moved to the Los Angeles County Museum of Art (LACMA) in 1967. His art was included in the 50th anniversary celebrations of the museum and in the reopening of the SculptureCenter in 2013. His art was included in the twenty-fifth edition of the Venice Architecture Biennale in 2019.Born in London in 1941, Arthur Saltman became entranced by the exotic. After graduating from the University of California, Los Angeles in 1953, he moved to the LACMA art museum in 1969. His art was included in the thirty-fifth edition of the Venice", "The next Biennial should be held at the Skatbladet in Copenhagen in November 2020 and will be hosted by the Danish Ministry of Culture, which has been paying for the award and the production of the show since 2016. The Danish pavilion will be comprised of a series of installations and reconstructions of works by the artist-in-residence, Anna-Sophie Herland, as well as a selection of works by her master, Hans Christian Andersen.“We are thrilled that the Danish Ministry of Culture and the Skam Museum will be able to support the unique work of Sophie Herland and Hans Christian Andersen, with the full support of the Danish government,” said Kristian Herden, director of the Skatbladet. “The Danish pavilion will be one of the first exhibited in Denmark. As we progress further along with planning the biennial, we will be able to collaborate and collaborate even more closely with the Danish Ministry of Culture and the Skam Museum, which will play a key role in the construction of the exhibition.”The Danish pavilion will also host a presentation of the work of Herland and Andersen’s younger siblings, an exhibitor-driven exhibition that will take place in the month", "The next Biennial should take place at the Museum of Contemporary Art, Houston’s Ritchie, in the fall of 2021. “The biennial has been a big success,” said museum director Paul Mpagi Sepuya, who was on the Ritchie team. “It has brought together a large group of artists, giving them a platform in a time when they haven’t had that many opportunities.”The museum has also revealed a number of new projects in the works, including the coming-out-of-prison project, “The Victimless Crime Museum,” which aims to display the work of eight new artists, and “The Art of Cruelty,” a commission by Alison Bechdel and Aimee Jocson. Both works are based on a novel by the late British playwright Adam Curtis.\n\n\nThe Quai Branly Museum in Paris has received a donation of 1,200 works by twenty-six artists, including Alain Guiraud (heavily influenced by the artist's own experiences), and nearly three hundred artworks by Mary Beard, Henri Ghent, and John Francis Lucas. The donation also includes five works by the", "The next Biennial should be held in 2020.[Update: March 5, 2020, 12:45 PM] The fifth edition of the Biennial, to be held in 2021, has been added to the schedule. Discover Vancouver: The 2019 edition, 'Discover Vancouver: Art and Disaster,' presented by the Vancouver Art Gallery, was postponed due to the Covid-19 pandemic. The pavilion will now be staged in 2021 in the same location. Aviva Institute for Contemporary Art, New York: The event has been moved from its original venue in Manhattan to the West Village, where it will once again be held in 2021. B&H Photo: The museum has announced its representation of the artist, who is best known for her large-scale paintings of so-called black-box sculptures that involve structures that exude a murky, dreamlike quality, such as her famous ceramic cocony.The artist will step down from the helm of the B&H in January 2020. Born and raised in New York, the artist first began making artworks in the early 1970s, when she was still a student at the School of the Art Institute of Chicago, where she met photographer Michael Herrmann. In 1976,", "The next Biennial should take place on the premises of the Centre Pompidou in Paris in the summer of 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to permanently close after a ten-year run next month. The institution said it hopes to begin construction on a new building on East Nineth Street in the spring of 2022 alongside construction on a new architectural addition to the museum. The museum will remain closed until March 31, 2021.The announcement came in a statement by MoMA director Daniel H. Weiss, who said: “The museum’s fifty-six-year history has been defined by its commitment to engaging with and expanding the work of artists and fostering an environment for their work. To continue that mission in a new facility in Manhattan in the spring of 2022 is a tremendous opportunity to develop the core program while adding new and exciting exhibitions and programs, and I’m confident that this will be a very special year.”The new museum will be built on the first floor of a brownstone in midtown Manhattan, next to the Museum of Modern Art. The project will be inspired by the opening of the Museum of Modern Art in 1958, which was the first museum in the US", "The next Biennial should be held at the Museum of Contemporary Art San Francisco in 2021. The Art of the Pacific is represented by the Hirshhorn Museum and Sculpture Garden in Washington, DC; the Palais de Tokyo in Paris; and the Solomon R. Guggenheim Museum in New York. The 2019 event, Art of the Pacific, features work by more than sixty artists representing forty nations and fifty-eight cities.\n\n\nThe Bessies, a New York–based nonprofit that raises funds for victims of childhood cancer and provides free medical exams and treatments, has announced that it will no longer accept funds from the American Cancer Society (ACS), citing a change in strategy as a contributing factor to the group’s decline. Originally conceived as a way to alleviate the financial hardship of sufferers of cancer, the organization has since expanded to serve as a platform to advocate for aggressive re-treatment strategies and to help raise awareness of the challenges faced by those attempting to overcome their illnesses.For its centennial year, the organization will present a series of free educational seminars on its online platform, which will feature the work of its current and former artists, as well as two artists who were recently diagnosed with early-stage breast and ovarian", "The next Biennial should be held in the spring of 2020, the organizers said. Their next edition will be held in conjunction with the tenth edition of the Art of the Party, which will take place in the February 2020 edition of the Berlin Biennale.\n\n\nThe National Museum of Fine Arts (MoFA) in Boston has launched a new digital platform that will help museums and cultural groups plan for the impact of the coronavirus. The platform, called the National Museum Connects, will allow museums and cultural organizations to connect with one another through interactive online experiences that will allow visitors to experience a variety of programs, including immersive shows and screenings, tours, and screenings of selected works, as well as educational programming that will be organized in the museum.“The platform will help museums and cultural organizations prepare for the coronavirus and help people understand the resources available to them,” said museum director Matthew Teitelbaum. “As we continue to educate our visitors about the public health risks of the virus, we are excited to provide tools that will help them make thoughtful, informed decisions about where to go, what to see, and how to engage with our collections and exhibitions. The National Museum Connects will help museums and cultural organizations make smart,", "The next Biennial should take place in the spring of 2020. The institution plans to greatly expand the exhibition by adding additional works by artists whose work was selected for the 2020 edition, which was curated by the same people who commissioned the works from the previous two editions. The seventy-third edition of the Biennial will be staged in 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it has added twenty-three artists from the Sheboygan-born, Olympia, Washington–based collective The Grounding , which is dedicated to feminist, environmental, and queer-oriented work. The group currently has thirty-three artists represented. The artists whose works will be included in the centennial’s “Drastic Impact: Art and the Feminist Struggle” are: Carol Gilligan (New York, 1970), Claudia Nistor (New York, 1978), Ella Pascual (New York, 1983), Barbara J. Smith (Santa Fe, 1988), Alicja Pankow (New York, 1995), Kirsten Sandström (New York, 2000), and Tanya Steenberg (New York, 2003). The exhibition will open", "The next Biennial should be held in 2020. “The drawings have been presented as a platform for artists to present the most recent work,” said a statement. “The work of the pavilion will be a continuation of many years of Biennial work.” The festival’s 2019 edition was held in Los Angeles; the 2020 edition will be held at the Venice Biennale.\n\n\nThe Museum of Fine Arts (MA) in Atlanta has appointed Myles Ert, a curator and educator, as its next executive director. Ert joins the museum after helming the Asian American Studies Center, which educates undergraduate and graduate students, and has also served as a curator at the Asian American Museum, where he organized the first exhibition dedicated to Asian art.“I’m incredibly excited to have Myles join the MA and to be a part of the museum’s future,” said cofounder and CEO of the Guggenheim and Kenyatta Baron. “He is dedicated to expanding the museum’s contemporary Asian American collection, teaching future generations of curators about the vibrant world of Asian art and artists, and organizing MA’s upcoming exhibitions with the most attention to", "The next Biennial should take place in March 2020 and will be the first for the South Asian art of the late nineteenth and early twentieth centuries.\n\n\nThe Museum of Modern Art (MoMA) announced today that Khaled Abdi, the founder of the experimental nonprofit Artnet, has been selected as the winner of the 2018 Nobel Prize in Arts. The announcement comes amid a global campaign by activists to pressure the institution to divest from the controversial, multinational-backed Abu Dhabi-based Abu Dhabi Foundation, which has donated more than $10 billion to American arts over the course of its nearly fifty-year history.Abdi told the New York Times that he decided to stop giving money to the organization after learning that the Abu Dhabi Foundation had donated over $40 billion to the arts in the last twelve years. He said that he believes the donation a form of colonialism.“I began to ask myself, why am I giving money to somebody who is complicit in enabling this system, which exploits and oppresses the world,” Abdi said. “I realized that it wasn’t the money that was being used to make art, it was the system that was making art.”The radical, eight-hour-long installation “Amor", "The next Biennial should be held in 2022.“Imbilità ai un cœur de biennial de l'autodromo,” Louis Vuitton said in a statement. “The exhibition is a reflection of the history of the project and of the city of Lyon, which is my lifelong ambition. Imbilità ai un moment de l'étender,” he said.\n\n\nAcademia France has announced that it is suspending its annual magazine, which was set to debut in late April, to allow the institution more time to implement safety measures to prevent the spread of Covid-19, including limiting magazine circulation and limiting release dates. The issue, which will still be shown in full on the magazine’s website, was scheduled to arrive in March. The schedule change was made in light of a call from the French Health Ministry, which informed the institution that it will not be able to cope with the coronavirus until the second half of May.The decision has forced a rethinking of how science journalism should be covered, with pieces focusing on the virus now entering the second half of the calendar, not the first. In an email sent to scientists and academics, Acad", "The next Biennial should be in February 2020. \n The first exhibition, “The Person in the Shadows,” is currently on view at the London Biennial from January 23 to February 26. The second, “The Bastards,” will open on March 28. \n\n\nThe City of Boston, which established a new $250 million fund for cultural initiatives in 2018, has allocated $75 million for arts and cultural institutions during its next two years. The sum is almost three-quarters of the $165 million it previously allocated to the arts. The funds will fund the staging of events, events and exhibitions, and will provide a source of income for Boston’s cultural entities.The City Council unanimously approved the arts and culture funding plan in June 2019. Funding for arts and cultural institutions is not guaranteed, but is estimated to total between $100 and $150 million. Boston’s Cultural Alliance, which represents the city’s cultural institutions, expects the arts to generate $108 million in the next two years. The Alliance wants the city to invest $75 million into arts and culture over the course of five years.The $75 million for arts and cultural institutions is substantially higher than the $60 million the city", "The next Biennial should take place in the autumn of 2020, and will be inaugurated with a public tour of the Museum of Modern Art (MoMA) in New York, followed by a public exhibition of work by the creative team behind the recently-discovered work Erich Fromm’s Theater of Operations, 1968–1976.\n\n\nIn an attempt to make up for lost revenue from the closure of its flagship museum in Hong Kong, the Hong Kong Art Museum (HoMA) has begun a new program of programming that will include retrospective exhibitions of work by Hong Kong-based artists.The initiative was launched in response to the festival’s cancellation, which was led by director Christopher Leibovich and co-curator Xiao Yu, in part because of a shortage of ticket buyers. According to the New York Times, the institution said that its revenue from the event fell by a third. The program will include two events: “The Gallery Opening”—a group exhibition that will be open at the museum from March 21 through March 23, 2020 and “The Shadows of the Moon”—a solo exhibition at the museum from March 23 through March 29, 2020.The organizers said that the program will raise $19 million for", "The next Biennial should take place in Rio de Janeiro in 2022. The 2020 event was canceled due to the Covid-19 pandemic.\n\n\nThe museum’s collection of more than thirty thousand objects dating to the nineteenth century, including a miniature European town from the late eighteenth century, a drawing by Pablo Picasso, and an inkwell from a nineteenth-century painting, are currently on display in its exhibition “Beyond the Modern World.” The museum will reopen in the fall with a presentation of works by Pierre-François Renoir, the artist most associated with the story of the creation of the modernist abstraction, and take the story of abstract art, art history, art history and painting, and the aesthetics of painting, painting, sculpture, and sculpture, to the theme of “Unfashionable Things.”The exhibition “Beyond the Modern World” will feature twenty-six works by eighty-four artists and collectives whose works are currently on display in the museum’s collection, including James Turrell, Henri Symon, Jean Luc Ponty, and Edwin Mitchell, among many others. The works will be on loan to the Tate, which is currently planning to open an exhibition of works", "The next Biennial should include the works of a select group of artists chosen by the committee. The first exhibition will be the artist selection for the third edition of the Biennial, which will take place in the spring of 2021. The pavilion will open to the public in June. The second exhibition will be the artist selection for the fourth edition of the Biennial, which will take place in the fall of 2021. \n\n\nThe Willamette Valley Museum (WVM) in Salem, Oregon, has received a gift of more than 1,500 works by artists such as Alphonse Bagnès, Peter Frank, and Robert Irwin. The donation—made by a group called the Willamette Valley Legacy Foundation—is one of the largest charitable gifts ever made by the museum.The gift includes a number of works that were loaned to the institution by German collector Wolfgang Lüpertz in 2015, as part of a deal that valued the artist at $3.8 million. The work was on display in the third Biennial exhibition “The Australian Landscape,” which featured works by fifty-three artists in partnership with the German gallery SID. The museum then returned the works to Bagnès in the spring of 2018,", "The next Biennial should take place in 2021.\n\n\nThe Royal Academy of Arts (RA) in London announced today that it is currently working with the designer and architect collective Skidmore, Owings & Merrill (S.A.M.), and the London-based architecture studio Arup to redesign the Arthur Killery, the former home of Edward Colston’s influential work The Magician and the Thief, and the museum’s contemporary art garden, which is situated in the heart of the city.The site, which will incorporate three streetscape elements, a river, and the Arthur Killery, is being transformed to make it more accessible by creating a new pedestrian crossing, adding a new green space, and creating a new public gathering space. Two luxury apartments and a restaurant—as well as several galleries, including the contemporary art institution Tate Britain and the London-based artist-run space Cyberspace—will be added to the campus, which is currently undergoing an expansion.The new Diori group, which also includes Gagosian, Guggenheim, and Luhring Augustine, will be housed in the same building as the Arthur Killery. “Among the many significant achievements of the Royal Academy of Arts is the", "The next Biennial should be held at the Museum of Fine Arts, Boston, in 2021; the 22nd at the Museum of Modern Art, New York, in 2022; and the twenty-third at the Bennington Museum of Art, Vermont, in 2023.\n\n\nThe Museum of Fine Arts (MoFA) in Boston has appointed Kate Suttie as its next president. Suttie comes to the institution from the Rhode Island School of Design (RISD), where she has served as director since 2014. In her new role, Suttie will succeed Susan Levin, who has helmed the museum since 1994, and will take up her new responsibilities on January 1, 2021.“We are incredibly proud of the work and accomplishments of Kate Suttie. She left a legacy of increasing MoFA’s stature through the development and design of our new building, the American Institute of Art, and is an inspiration for future generations of museum curators, thinkers, and organizers,” said museum director Nicholas Cullinan. “She has not only shaped the museum’s collection, but in doing so she has shaped the museum’s mission. We are honored to welcome her to MoFA. She brings with her", "The next Biennial should be held in 2020 and will be hosted by the Bay Area Museum of California (BAMC) and will also be organized in collaboration with the artist-run nonprofit The Artist Space. The event will bring together contemporary and experimental artists, designers, musicians, scientists, and writers. “In the twenty-first century, the world is becoming increasingly polarized between rich and poor. The crisis of climate change and its impacts is becoming ever more evident. The political climate is becoming ever more polarized. The biennial—an event that brings together artists from diverse and overlapping traditions—is the perfect vehicle for the artist’s vision. I am honored to take on this ambitious project,” said Davis.The exhibition will include work by twenty-five artists whose works were selected by a jury comprising M. Lynne Nussbaum, art historian, curator, and critic; Kenneth Ellsworth, curator and founder and artistic director of the Oakland Art Museum; John D. Hafer, a MacArthur Fellow; Mark S. Stevens, a MacArthur Fellow; Yale Cooper, a MacArthur Fellow; Larry Achiampong, a MacArthur Fellow; Yelena Aleksandrovna, a", "The next Biennial should take place in the autumn of 2020. The six finalists are: Annemarie Pérez, Juliette Bidier, Lucie Bénétière, André Bazin, André de Torres, and Michael Dominique. Over the last ten years, the three-day event has gone through several iterations, including in 2013, 2014, and 2016. The theme of the 2019 edition was “The Future of the Body: a Path to Healing,” but the event also included a special episode where the Spanish artist Andrés Alonso-Oscar Perez, who has spent many years photographing the body and its various systems of manipulation, created a great work. Historically, the Biennial has been held in Madrid, in 2009, and in the French city of Lyon, in 2011, and it is currently being staged in the Bayrès region of northern France as well as the Palais de Tokyo in Paris. The exhibition will be curated by Bernardo Soares, the president of the Autonomous Region of Aracruz and the director of the Museo de Arte de Madrid. The exhibition will consist of more than one", "The next Biennial should take place in the spring of 2021, at the beginning of the zoo’s new ten-yearly cycle. Following a 2019 exhibition at the Museum of Contemporary Art in Atlanta, the museum will return to New York for its first exhibition in the museum’s new location, the Hirshhorn Museum, in March 2020.\n\n\nThe Dana Foundation has received a gift of $50,000 from local businessman and philanthropist Larry and Maria Dana. Their daughter, Virginia Dana, is the founder and owner of the fitness and performance gym and training center Massage Parlor and donated $50,000 to the foundation in support of its goal to establish an endowment for the Dana Center in Los Angeles.The gift comes a year after the Dana Center received a $25 million gift from the same family. The Dana Family Foundation also pledged $10 million to the Dana Foundation and promised to match that amount.In recognition of their philanthropic support, the Dana Foundation will be giving two shows at the Dana Theater in Los Angeles—the first being a series of solo shows by the artists that were included in the second part of its renovation and the first being an exhibition of work by a group of contemporary art collectors. The shows will be curated by", "The next Biennial should be for “Architecture and Design: From the Shadows,” a selection of works that will be the subject of a new exhibition at the Museum of Modern Art. The show will be curated by Annette Lüpertz.The biennial, which will be held at two locations: on the ground level of the museum, in the museum’s new building, and in the Belvedere, will feature the work of thirty-four artists. The artists selected for the show will be announced in the coming months.The biennial will also include an exhibition of work by the three artists represented in the “Tenure of Life,” an exhibition that is similarly themed, but is not organized around, the renovation of the house. While the house was transformed in 1984, the exhibition was not staged until the 2019–20 academic year, and the work is not yet slated to open. The work is slated to be on view in the exhibition “Architecture and Design: From the Shadows” at the Museum of Modern Art in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) UK has announced that it is planning to reduce the length of its exhibition calendar by a third, reaching a", "The next Biennial should be staged in 2022. The next iteration of the Hamburg Biennale will take place in 2021.\n\n\nThe Institute for Contemporary Art (ICA) in Berlin announced that it is planning to hold a new edition of the Art Basel fair in 2021. The event will run from April 5 to April 8 and will be hosted by the Hamburger Bahnhof and the Visby. The ICA’s executive board members, Marc-Olivier Numer and Heiner Köhler, announced the decision at an art fair in Berlin on Tuesday. The new edition will be hosted by the Hamburger Bahnhof and the ICA’s Berlin outpost. “Regrettably, IAC (Art Basel) has always been a platform for artists to experiment with new ideas and new materials,” Köhler said in a statement. “It is the only fair that I have ever attended that is dedicated entirely to art, and it is this amazing defining moment for Germany to have an exhibition in the exhibition space of the Museum Ludwig.”Earlier this year, the ICA’s Berlin office received a donation of one hundred works from the artist community. The works were donated by collaborators", "The next Biennial should focus on the history of occupation, with particular attention paid to the history of incarceration, the construction of the prison-industrial complex, and the ongoing racialization of prisons.”The 2020 edition of Roar will take place at the Contemporary Art Museum St. Louis (CIMAM), between the St. Louis Art Museum and the Museum of Contemporary Art, and will be organized as follows: The theme for the 2020 edition of Roar will be “The Painted World.” The twenty-ninth edition of the event will take place at the Minneapolis Art Museum in Minneapolis and will feature a total of seventy artists. The 2020 iteration of Roar will premiere at the Minneapolis Art Museum on September 4, 2020. The 2020 edition will cost $20,000 and will draw an audience of seventy artists.  The 2020 Roar panel\u0097featuring Lee-Anne Walters, Isabella Lauter, and Jessica Morgan\u0097will be moderated by John Elway, the curator of contemporary art at the Seattle Art Museum (SAM), and will be presented by Richard Scarry, the artistic director of CIMAM. The 2020 Roar pavilion will be inaugurated by a project by artist-in-", "The next Biennial should be held by the end of September, with the exhibition beginning on the second. The 2019 exhibition will feature works by ten artists, including Marie Cosindas, .Sara Cwynar, and Horst Bode, in addition to two works by artist-activists and activists such as Stephanie Coont, whose self-published, text-based exhibition was affected by the Covid-19 pandemic; and James Turrell, whose staging of an exhibition that took place in his Brooklyn apartment in August 2019, the first Biennial, was canceled. The exhibition “wasn’t really designed to be staged in August. There were a number of logistical problems that made it difficult, but not impossible, to move forward.”“We are in the process of reviewing the show in order to determine the best possible way forward,” said Gillian Taveras, director and CEO of the Biennial, in a statement. “The Biennial is currently on track to surpass its target of $5 million, which is a substantial achievement considering the challenges that we faced and the funding that we received. We are actively assessing the future of the exhibition and its program. We hope that this means", "The next Biennial should be held somewhere in the United States, not in India, and should take the form of an exhibition of the features appearing in the exhibition. The theme should be “Kurt Cobain’s American Dream: From Eros to Hope.”According to the Los Angeles Times, the thirty-four-year-old curator who curated the exhibition in question, based in New York, was invited to the Biennial but never attended. His resignation was accepted by the Biennial’s board chair, Martin Gilens, and the chair of the board of trustees, Deborah Smock, who said: “We were not consulted about Kurt’s departure. The board of trustees is very disappointed by his decision, which we fully support. The events of the past month have made clear that Kurt had no intention of returning to the Biennial and would have preferred to keep the show going. We wish him and his family well.”Cobain, who passed away in 2014 at the age of eighty-two, was a leading figure in the punk movement who was also a prolific writer. Under his creative direction, the exhibition was born. Birkelman first conceived of the exhibition concept in an interview with Rolling Stone", "The next Biennial should receive some of the funds from the 'Grand Alliance for the Arts: Unity for All,' a $10 million initiative of the Arts Council. The next edition of Art Basel Hong Kong will take place in March 2019.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has finalized a $50 million expansion of its Ebony & Ivory Art Museum to accommodate the growing needs of a growing number of New York City–based arts organizations. The $58 million refurbishment, which added two acres of grounds and renovated the museum’s existing space, opened on August 11, 2019 and features new works by artists including Dorothea Rockburne, Yinka Shonibare, and Marisa Takal.The institution, which has retained the same interior and exterior design since it was founded in 1887, including the addition of a new library, a new rotunda, and a new entrance, has become increasingly popular with urbanites eager to experience works by great American artists. The refurbishment also included the development of a new outdoor plaza and playground, a restored nineteenth-century theater, and the construction of a new building for the museum’s permanent collection.“The expansion reflects the", "The next Biennial should be held in 2020. “The foundation will work with the city’s art-historical and design communities to envision a new and sustainable future for the Biennial,” said Michela Deliuso, the president of the foundation. \n\n\nThe National Gallery of Art in Washington, DC, has released a new set of guidelines for the handling of racially offensive material on display in its exhibition “The Wire.” The guidelines, which were developed after a number of high-profile incidents involving racially charged material on display, were published by the National Coalition Against Censorship (NCC). The guidelines attempt to address the mounting pressure on museums by activists in an attempt to prevent the removal of works that deal with controversial social issues.The guidelines come as the cultural landscape in the United States is undergoing a dramatic shift in terms of the role of museums in its public policy. Events such as the acquittal of George Floyd and the reopening of the Thomas Jefferson Memorial Building are only a few examples of the types of initiatives that are taking place across the country. Activists, including NCC and others that were involved in the campaign to remove works from public view in the wake of Floyd’s conviction are now pushing", "The next Biennial should be held in 2021.\n\n\nDraining the Stagnant: How the World Is Getting Less and Less Food by World Food Initiative (WFAI) and Artists United for Change (AUCC) has announced that it is planning to withdraw $2.5 million from its 2020 event. The announcement came after the organizers received an additional $1.3 million from the 3,000+ donors who pledged to support the project in 2018. “We are delighted that we have been able to secure the support of so many generous donors in the last six months, and are confident that we are able to deliver a truly groundbreaking exhibition for the Global South on the themes of food security, climate change, and sustainability,” said Nasser Al-Khawla, chair of WFAI and chief curator of art at the Art Institute of Chicago and WFAI. The event will go on as planned, but the organizers will offer an online version of the event in November 2020.The 2019 edition, “Atlas Solidarities,” curated by Jean-Luc Haute, featured works by fifty-eight international and local artists from forty-eight countries and twenty-six cities. The exhibition was curated by ", "The next Biennial should take place in the spring of 2021, and should include twenty-six artists, twenty-two institutions, and a collection of twenty-four works. The exhibition will be curated by Zahra Nizam, curator of contemporary arts at the Museum of Fine Arts in New York. The biennial’s first season will be staged in the city in 2020. The show will be shown at Museum of Modern Art (MoMA) in New York until December 8 and at the Musée d’Arles in Paris until December 13. The biennial’s second season will be staged at The Museum of Modern Art (MoMA) in New York until March 10 and at the Museum of Modern Art (MoMA) in New York until March 17. The exhibition will be back in the city in 2020, and will be presented in 2021 with the themes “Dangerous Liaisons,” “Detection and Affectation,” and “Paintings from the Eighteenth Century.”  The exhibition will be curated by Sharon Goeke, director of the Museums of the History of Contemporary Art (MoHA), in collaboration", "The next Biennial should take place in 2022.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has launched its $10 billion Cultural Fund for Artists, an initiative to help preserve and create new works of art. The program will distribute $4 billion in grants between 2021 and 2023 to provide financial assistance to artists, including artists who have never received a grant before, and will also develop new strategies, such as and combinations, to encourage the collection and preservation of art.“The Cultural Fund is a critical tool for artists and cultural organizations in New York City as we continue to recover from the devastating effects of Covid-19,” said cultural affairs commissioner Tom Finkelpearl. “The district attorney’s office will develop new guidelines for the use of the Fund to ensure it is properly administered by the city and to ensure artists are not impacted by this crisis.”The Cultural Fund is a reconstituted agency created by New York City following the 2013 coronavirus pandemic. Since it reserves the right to revoke grants, artists are responsible for determining whether their organization qualifies for a grant", "The next Biennial should aim to expose the public to the work of a new generation of artists, including the emerging artists that have entered the field from Africa and the Caribbean, and will also include a discussion on the legacy of the late artist, with a view to presenting biennial works in the future.  \n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Rebecca Mink, an artist and educator, as its next curator. Mink comes to the institution from the Getty, where she served as the museum’s chief curator of photography and video art from 2015 to 2016. During her tenure at the museum, she curated exhibitions featuring work by artists such as Mark di Suvero, Mark Teitelbaum, Paul Mpagi Sepuya, and Peter Navarro; organized solo shows featuring work by artists such as Sonia Leoni, Sobehan Kouyate, and Aaron Paul; and wrote for the museum’s blog.“Paul Mpagi Sepuya’s You Are Not Alone, Part 1, 2018, is a classic of the genre, a stunning exhibition that introduces the work in a way that is both explicit and personal,” Mink said in a statement.", "The next Biennial should be held in 2021. Both the City of London Museum and the Tate’s board of trustees have expressed confidence in the institution’s management and board. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Taylor Lauterborn as its new deputy director and chief curator. Lauterborn joins the institution from the Milwaukee Art Museum, where she has served as director of exhibitions since 2016. Previously, she held the position of deputy director and chief curator at the Museum of Contemporary Art (MoCA) for five years.“Taylor’s experience and expertise in the field of contemporary art make her uniquely qualified to lead the museum as it enters its seventy-fifth year in the spotlight,” said museum director Matthew Teitelbaum in a statement. “Her new role will provide the MoCA’s audiences, visitors, and staff with a unique and important voice in the museum. As we continue to push the boundaries of contemporary art and our relationship with our environment, Taylor will excel in developing new and innovative ways for us to engage the public and engage with the history of art.”Prior to joining the museum, Lauterborn held curatorial roles at", "The next Biennial should be held at the venue in 2021.\n\n\nOn Sunday, October 8, the United Kingdom will hold its first national day-long art festival, dubbed Art London: First World. The event will be hosted in the public galleries of the Royal Academy of Arts (RA), the National Portrait Gallery (NPG), and the National Galleries of Scotland (Nga), and will involve more than 120,000 visitors from twenty-four countries. Artforum has announced its 2019 edition of Art London: First World, which will run from October 8 to October 10. Titled **First World: The Art of Art, and will be curated by Rafael Benitez and João Pessoa. The event will also feature two special exhibitions: “Art in Focus: The Story of the American Painted Surface,” which will examine the history, creation, and reception of American art, and “The Handmaid’s Tale,” which will examine themes of gender, race, and power. “At this critical moment when countless artists are working across the globe to address the global challenges of climate change, and the number of artworks destroyed by the coronavirus", "The next Biennial should take place in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to move the museum’s remaining works by Gabriel Garcia Marquez and Elia García Bernal from its current locations in Central Park to Los Angeles’s Alameda County Museum of Art (ACM). The move is part of a larger plan to relocate the works from the city to the foothills of the Sierra Nevada, a project that has been in the works since 2009. The relocation, which will involve the construction of a new sixteen-thousand-square-foot museum on a former industrial site in West Los Angeles, will also involve the relocation of the museum’s currently-operating Gabriel Garcia Marquez and Elia García Bernal Theater. Both the Marquez and Antiguoño brothers, Diego and Alexander Antiguo, are founders of the Los Angeles-based studio, Sullivar Pictures, which has produced numerous works by the duo.In a letter dated March 4, the Antiguoño brothers wrote: “We are confident that these works, which comprise an important part of the history of the García family, will be able to withstand the journey from Los Angeles to", "The next Biennial should be held in 2021. The theme—\"Visuality and the Body: Contemporary Art in the Seventeenth Century—Closed for the Biennial—Future Art: A Presentation of Art in the Early Twenty-first Century—Closed until at least 2020—Future Art: Worth the Wait?—Closed until at least 2021—Future Art: Worth the Wait? Part Two—Closed until 2019—Future Art: Worth the Wait? Part Three—Closed until 2019—Future Art: Worth the Wait? Part Four—Closed until 2019—Future Art:  Closed until 2019—An exhibition sponsored by the MCA will be staged at the Museum of Contemporary Art (MoCA) in 2020.Curator and curator David Halperin, who curated the exhibition, said: “The performance was a moment of mutual awakening and awakening, an emotionally charged experience that, with the power and the force of art, became an increase of the spirit.” \n\n\nThe Kingston Art Gallery (KAG) in London will temporarily close its doors in October 2019 in order to conserve its massive and influential collection of nineteenth-century art, which comprises some seventy thousand works, including work by Charles Laughton, Aru", "The next Biennial should be held at the New Museum in New York, which is currently working on a new exhibition about the legacy of the French Surrealist Pierre-Auguste Renoir. The future of the O2 Arena, a major arts venue in London, is in jeopardy as the city braces for a major rise in COVID-19.The Royal Shakespeare Company, which has been closed since March 13, staged a revival of its summer season on September 11, with the announcement of three new productions: The March Hare, A Midsummer Night's Dream, and Hamlet. The Royal Shakespeare Company also revealed that there will be a new production of Julius Caesar at the Royal Shakespeare Company on August 15, alongside Measure for Measure, and Black Tom, which will mark the Edinburgh Festival in September. The Royal Shakespeare Company’s new year’s message for schools comes courtesy of a new public service announcement: “As schools are reopening tomorrow, and schools are reopening safely, the Royal Shakespeare Company is announcing three new productions, including the first in the company’s history, A Midsummer Night’s Dream. The second in August 2019; the third in", "The next Biennial should take place in the city in 2022. The announcement was made at a press conference held at the Villepinte Arts Center, where Soumyadhammamitra was also announced as the winner of the Prix de l'Art Moderne, established in 2008 to organize major international exhibitions in the city.The executive director of the Villepinte Arts Center, Airo Rist, said: “We are delighted to welcome the new Biennial. It’s a great honor to be sharing the spotlight with  Soumyadhammamitra. His work perfectly reflects the vibrant and unique spirit of the city of Paris, and we are proud to host him at our space.”The artist-run exhibition space has been under the management of the Parisian artist-run organization Légera since its inception in 2008. Soumyadhammamitra, who has lived in Paris for forty years and who studied at the School of the Art Institute of Chicago, is a French Pakistani American citizen whose work has been exhibited at the Museum of Modern Art (MoMA), New York; the Sotheby’s Asia Contemporary Art Museum, New", "The next Biennial should be held in 2022; the deadline for the first, 2019, was set four years ago. In order to guarantee a disproportionate number of works from the city’s museums, CAFA will select three of the most nationally acclaimed galleries from its entry list: Suleiman Gallery, Galerie Anton Klein, and Galerie Jean-Michel Basquiat. CAFA will also commission a new work by one of the first artists to be featured in a major retrospective, Timur’s first, to be staged in the museum.\n\n\n\n\n\nAlexa Jordan-Palmer, the British artist best known for her body of work comprising large-scale sculptures that address both personal and social ills, died on January 4, 2018, at the age of eighty.Jordan-Palmer’s work—which explores themes of trauma and the human experience—has been exhibited in numerous biennials over the past three decades and has recently received new attention from the art world. In the 2018 Art of the Party, for instance, Jordan-Palmer was presented with a Lifetime Achievement Award by the Artistic Guild of the Arts.In a 2018 interview with Artforum, the artist explained that the object", "The next Biennial should be held in 2020 and will consist of a retrospective of work by 21 artists, including Sam Arapu, Tuila Aitken, Liza Lou, and Cao Wei.The 2019 edition, which was curated by Tomás Maksym Sosanik and took place in the former headquarters of the National Museum of Art in Ankara, featured works by Kaya Halil, Murat Kılıçdar, Omer Kültürkı, Şaibatsu Nusseibehlie, and Ute Steinbach.\n\n\nThe Museum of Arts and Design (MAD) in New York announced today that it is expanding the scope of its “Community Series,” a quarterly series of artist-led events that began in February 2019 and runs through May 2020. In the process, the museum will launch a new digital platform and a new exhibition called “Through the Eyes of an Artist,” which will highlight the work of thirty artists in the MAD community. The first show will examine the work of American artist Anselm Kiefer, whose MAD cofounder, Alex Gartenfeld, produced an exhibition “In the Eyes of an American Artist�", "The next Biennial should take place in the autumn and will be held at the museum as part of a new project that will examine the biennial as a universal language. The project will include exhibitions, lectures, and other events in collaboration with the museum’s curators and staff. “The Biennial of the Venice Architecture Biennale is, in short, a timeless gesture of respect, a symbolic gesture, a way of letting go of earthly things and of being with the world in all its richness and beauty,” Marc-Olivier Büchner, the museum’s director, said in a statement. “It is an unprecedented step in the history of the museum. . . . it is a very high level of clarity for us in this moment of crisis. Much more needs to be done, but we say that this is a step in the right direction.”\n\n\nThe Museum of Modern Art (MoMA) in New York has released the schedule for its 2020 retrospective of Italian painter Gio Ponti. Titled “The Bones of What’s Left,” the exhibition will highlight the work of Ponti and his colleagues, including Dimitru Polosa, Stefano de", "The next Biennial should be held at a location that has a permanent exhibition of the works in the exhibition as well as a permanent collection of the works. The next Biennial will encompass all of the works in the exhibition. The Broad and the König have developed a new film and video program that will be presented in partnership with the Art Museum Stuttgart and the Bodega. The Bodega already houses the exhibition “Wangechi Mutu: South Africa,” which debuted at the König Berlin in 2010 and was moved to the König Kunsthalle Basel in 2012. The exhibition will then move to the Bodega and will open in the autumn of 2019.\n\n\nThe Oxford English Dictionary (OED) announced the twenty-nine winners of its 2019 awards, which honor the cultural and literary achievements of individuals who have influenced the OED. Each year, the OED presents a total of thirty awards, which recognize the contributions of twenty-eight individuals. William Shakespeare’s A Midsummer Night’s Dream\u0097a play about a dream in which a young girl is seduced by a wise old man\u0097was selected for its articulation of an “", "The next Biennial should take place in 2021 at the Bechhof, Berlin, and the 2020 theme will be “new forms of collaboration.”The project was initiated by the German Cultural Heritage Foundation (DGF), and comprises the use of biennial materials, such as paintings, photographs, and videos, as well as original works. The first Biennial will be held in 2019 and the second in 2021.The museum—which is currently undergoing a $5.7 billion renovation—is currently implementing a new system of admission, which will involve visitors having to stand in line for eight hours before being admitted. The new system also includes a new ticketing system, a new mobile application, and a digital ticketing system. The redesigned biennial will reopen in 2021.\n\n\nThe City of New York announced today that it is moving the fifty-fifth edition of the Metropolitan Opera Festival, which was originally scheduled for February 22–February 27, 2020, to March 8–March 11. The March date was chosen as part of an agreement with the state of New York because of the coronavirus outbreak, which has already led to an estimated 30 percent drop in attendance. “The partnership between the state and the Met is about more than just", "The next Biennial should be held in the spring of 2020. \n\n\nThe Art Newspaper, a leading art publication in Germany, has suspended its publication plans for the Art Basel show, “Art of the Future: Art of the 21st Century,” according to German daily Frankfurter Allgemeine Zeitung. The announcement comes a day after the Art news magazine wrote an article about the exhibition, titled \"Die Artzeitung: Art im Wirklichkeit,\" which was published on February 2. “We are not sure whether this move will be a step towards saving the show, or a step towards impairing its ongoing exhibition-like atmosphere in the next exhibition,” said Artnews editor-in-chief Wolfgang Kaleck, who took the decision to cancel the publication strategy following an intensive review of the show’s opening and closing dates. “On the other hand, the kind of show we are doing now is no longer possible without the support of the large and small galleries in Germany. We are also planning to work with the galleries in Berlin to create new opportunities for exhibiting and funding works.”The Art Newspaper reported that the decision to suspend publication was", "The next Biennial should commence with the exhibition “Annotated Gold,” which is currently on display at the Museum of Modern Art in New York. The biennial will then present “Amor,” a new exhibition “in which art and politics collide in a radically new way.”The exhibition will debut with two paintings by the artist in collaboration with the late Nigerian writer and historian Ruth Hammerschlag, who was one of the participants in the exhibition. “The first painting is a tribute to Art and Memory, which is a dramatic reconstruction of the artist’s childhood, as he depicts himself as a young boy in a Nigerian town, playing with his doll,” Hammerschlag wrote in a statement. “The next painting will be about the life and death of children, and about their dreams and fears. We hope the people of Lagos, Nigeria, will join us in this exhibition and bring more stories and memories to light.”\n\n\nThe Metropolitan Museum of Art in New York has launched a new digital initiative that will allow museumgoers to view works by the six artists who won the National Book Award in the category of American art last fall. The project, dubbed the", "The next Biennial should be in early 2021.  --Liz\n\nLiz Dziewior, an American painter and sculptor who lived and worked in New York from the 1980s to the early 2000s, has died at age seventy-nine at her home in Santa Fe, New Mexico. She is survived by her husband, Carl Dziewior; her son, Anselm Dziewior; and her son-in-law, Johnson Dziewior.Born in New York City in 1941, Dziewior began drawing at age thirteen, becoming a self-taught sculptor who became known for his detailed but often crudely detailed works. In 1977, after moving back to her hometown to live with her parents, Dziewior began working closely with John Wygant, whose work she borrowed heavily from, to create a series of sculptures that explore the relationship between the self and the environment. While working on the themes of her own body and her surroundings, she took a more direct and personal approach to her works, expressing herself through a series of coded messages that have become her signature style.“Liz Dziewior: Enigmatic (1977–1977), ” art historian", "The next Biennial should be in 2022.  The event will also include work by forty-five artists, including Diario Menendez, Ariel Aparicio, Marta Bruguera, João Vieira, Nana Viso, and Hélio Oiticica. The 2019 edition featured work by forty-two artists, including Jochen Riester, Julius Telling, and Ernst and Christian Stieglitz. The event will be held in the Deutschlandbau in Frankfurt.\n\n\nThe world of art and design is undergoing a massive shift. The use of technology to make art and design has expanded exponentially, and the demand for new ways to communicate with one another and to use technology to make art has never been greater. The upcoming Art London Biennial, curated by Maureen Mallaway, will showcase the earliest and most innovative digital art and design, from designs by Benjamin Button to the new art-based marketing techniques pioneered by Mark Zuckerberg and Eric Schmidt. The biennial will also seek to make contemporary art more accessible to new audiences through a digital platform called ArtLink. The show will run from March 13 to March 22. “With ArtLink, we are able to present designers in a way", "The next Biennial should take place in 2021, with the establishment of the museum as a platform for the exchange of cultural and ideas.”The move was made amid a controversy sparked by a painting by the late French artist Jean-Michel Basquiat that was on display in the museum’s former location, the Musée du Cinéma, in Paris, in 2015. It remains unclear whether the new structure will be similar to the former venue.\n\n\nThe Hirshhorn Museum in Washington, DC, has announced that it is expanding the curatorial team of its newly created digital platform, the Hirshhorn Digital Initiative, and is extending the curatorial team’s mission to include curating content online. The Hirshhorn Digital Initiative, launched in March 2019, is an initiative of the Hirshhorn that aims to provide curators with the tools they need to produce high quality digital exhibitions for talented and established artists, as well as to provide curators with new ways to collaborate.“The Hirshhorn Digital Initiative is a free, community-supported platform that enables artists and curators to explore, experiment, and develop new ways to present our collaborative works,” said Adam Weinberg, director of the Hirshhorn", "The next Biennial should take place in the spring of 2020.  The next Art Basel Hong Kong exhibition should take place in the summer of 2020.  It should also encompass an international art history project in the form of a symposium, an exhibition, a special event, and other activities at a university-level. The museum will also undertake to modernise its premises by removing and re-laying the walls and restoring the floors in a process it calls “modernizing the museum.”\n\n\nThe Thai artist Thichânuporn, whose stylized abstractions and photorealistic sculptures convey philosophies of life and climate change, has been selected to represent Thailand at the Fifty-Ninth Venice Biennale, curated by Italian director Andrea Latella.Schaafjärtspiegel, the German architect who designed the Biennale’s exhibition space, will represent Austria in the second iteration of the event, which will take place in May.The biennial of the artist’s work, which explores the boundaries between light and shadow, will debut at the Venice Biennale in May 2020. The show’s tenure is limited to a maximum of ninety days and will be inaug", "The next Biennial should be held at the Ancient Roman Forum in Rome in 2020, the Italian Cultural Center in Turin in 2021, and the Museo Luigi Leonardo in the City of Rome as well as at least one other location in Italy, the State of Piedmont, in 2021. The deadline for the exhibition is September 23 and the organizers are currently accepting submissions for the exhibition.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of two new works by American poet and artist Matthew Wong in its collections. The works, which were donated by the artist and are currently on view in the museum’s Matthew Wong Gallery, feature images of cities and landscapes and are part of a series by Wong that was first presented at the Fifty-Third Venice Biennale in 2010.“The works are set in the backdrop of the city of Los Angeles, which is arguably the most spectacular urban landscape in the world,” Wong said in a statement. “The Museum of Contemporary Art has been a home for Wong’s eclectic oeuvre, and I’m so proud to see it finally recognized by its creator. I look forward to seeing the new works in the museum’s permanent collection", "The next Biennial should be held in 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Linda Anagnos as its new senior curator of contemporary art. She succeeds Ron Chusid, who retired on February 14 after twenty-two years at the helm of the museum.“Over the past eight years, Linda has created a strong record of bringing experts and scholars to our curatorial team, and she is widely regarded as an excellent leader,” said Dan Henning, the MFA’s director and CEO. “We are pleased to welcome her to the team and are confident in her ability to grow the museum as a whole and to develop new initiatives.” The college recently earned its first two major awards for art. In 2017, the school received an additional $4 million for its expansion of the MFA’s Institute of Modern Art, which opened in 2018; and in 2019, Massachusetts received $4.5 million for its acquisition of four works by a group of artists; the largest of which, the institution acquired for $2.5 million in 2017.In an interview with Boston.com last month, Anagnos addressed her plans for the future and noted that she feels", "The next Biennial should be held in 2021, when the Museum of Contemporary Art Los Angeles (MCA LA) is scheduled to reopen. If the 2019 theme \"The Body\" is chosen for the 2021 edition, the theme will be “The Body in Art,” in order to emphasize the body as a core element of the artist’s aesthetic. The 2019 exhibition also focused on the body’s relation to art and political events, the body’s range of motion, and the bodily functions. Tomorrow’s exhibition will be a “celebration of the body’s diversity and the body’s social function.”The theme of the museum is “Body Art.” The biennial will be held at the MCA, which is currently undergoing a $450 million renovation; it will also be moving to a new conference center in the city. A new exhibition will be staged each year.\n\n\nThe Los Angeles County Museum of Art (LACMA), the Metropolitan Museum of Art, and the Hammer Museum in Los Angeles have agreed to jointly develop and implement new safety measures to prevent an outbreak of Covid-19 and the subsequent rationing of antibiotics in the United States.", "The next Biennial should take place in the year 2021. “The world we live in needs sustainable solutions,” said Marc Spiegler, president and CEO of the Biennial and a founder of the Italian company Aquaris. “We are interested in identifying solutions that will give the world a new sense of place, a new perspective, and a new way of visual arts.” The 2019 edition, which featured work by thirty-three artists spanning seventeen countries, received the fifth prize at the Venice Biennale, which drew seventy-six artists from forty countries.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Amy S. Owens as its next executive director. Owens comes to the institution from the Los Angeles County Museum of Art (LACMA) in the same year that she became the first African American woman to lead the institution, which celebrates the work of African American artists in the United States. Known for her leadership in the anti-racist movement, which was founded in the 1960s by Black artists, Owens has called for a “racial justice economy” and advocated for diversifying the museum’s collection and programming, including an initiative to create a new program for African", "The next Biennial should take place in the United States and will have the theme \"The Struggle of the Body and the Body and The Struggle of the Body,\" a reference to the struggle of the body against its surroundings. The next iteration of the festival will be staged at the National Museum of Anthropology in Washington, DC. Last year, the institution hosted the biennial The Struggle of the Body and the Body, which closed on October 28, and drew more than 4.3 million visitors from forty countries. \n\n\nThe Louvre in Paris has received a major blow to its finances as French museums were forced to close due to the Covid-19 virus. On Thursday, April 5, French culture minister Franck Riester announced that the government would take over the management of La République Intérieur, the Louvre, the Musée d’Art Contemporain in Paris, and the Palais de Tokyo in an attempt to make the institution financially sustainable through the 2020–20 period. The announcement coincided with the anniversary of the terrorist attacks on the French capital in January 2015, which claimed the lives of 130 people and left thousands of injured. The attack was carried out by two groups, ", "The next Biennial should be called the Art of Humanism, and the Art of Humanism should be the theme of the twenty-third Biennial, with the theme of the twenty-fourth Biennial being the Art of Humanism.”The biennial, which was launched by Guggenheim, Fondazione Cagli Arti, and the Milanese architect Casa Pilar in 1989, has faced several setbacks since it opened in 1991. The first was the Covid-19 pandemic, which severely disrupted the exhibition schedule and the travel plans of both artists and curators. The second was the closure of the exhibition in 2020, and the third was the coronavirus. The fourth was the shock resignation of architect Filippo Graziani, who had led the exhibition since its inception. The fifth and most recent setback for the exhibition was the 2019 Milan Architecture Biennale, which was canceled due to the Covid-19 outbreak.\n\n\nArtist and writer Viola Pindell, the author of the critically acclaimed but often satirized My Life as a Machine, will receive the Nobel Memorial Prize for Literature in Copenhagen on Tuesday, March 15, 2020. The seventy-seven-year-old author, whose work also"]