["The next Biennial should be held in 2021. In the meantime, the institution will continue to host a number of exhibitions that explore the history of photography through the lens of the artist, as well as a variety of special projects conceived in partnership with local communities. “The new biennial will set the stage for a lively and interdisciplinary exhibition program that will achieve a new level of international engagement,” said head of the Biennial Maya Angelou. “The Biennial Dubai is ready to present its first venture into the ‘digital landscape,’ in 2020. We look forward to the impact of our creative process on the digital world.”\n\n\nInstitutional Review Board (IRB) chair Deborah Rovere announced that the institution will not be penalized for its failure to remove a controversial work by Andy Warhol, a controversial work by the American artist Jack Shepard, or for its own neglected’ exhibition of work by the late American artist Diane Arbus.Rovere said: “The Board of Directors has made it clear that the forthcoming exhibition ‘Art of the 21st Century’ will be overshadowed by the exhibition ‘Imageless,’ which will be held at least five years after the event", "The next Biennial should take place at the Museum of Modern Art in New York in 2021, and the first will be staged at the Museum of Contemporary Art in Miami in 2022.\n\n\nNadia Nouri—whose iconic oil painting The Last Days of Man’s Children, 2009, won the Fifth Berlin Biennale in 2013 and was later restored by the French Ministry of Culture—has died at age eighty-two at her home in New York. “Nouri is a pioneer in the field of contemporary art’s handling of memory,” art historian Hans-Ulrich Müller wrote in an op-ed in the May/June 2019 issue of Artforum. The article cited Nouri’s practice in painting as one of the inspirations for the new project, “Sight and Memory: Painting from the Last Days of Man” (S&M), which will bring together twenty painting- and sculpture-related works by sixty-nine artists that will all be auctioned at the Museum of Modern Art (MoMA) in Manhattan in October.The first solo show was curated by Nouri and the German-born American artist Jürgen Krijnig in 2014. The exhibition, titled “The", "The next Biennial should coincide with the opening of the new exhibition “Towards a Modern Biennial: Avant-Garde and the Modern World,” which will be organized as a biennial of the same name, at which point the next edition of the Biennial will be held. “We are very much looking forward to the collaboration between the artists of New York and Paris,” said Gaëtan Bénétière, head of the Biennial. The next iteration of the exhibition will take place in 2021. The biennial’s planning committee also announced that it is planning to eliminate the French Pavilion at the 2019 edition of the Contemporary Art Biennale in Paris, which was relocated to a new venue in the city. The move was made in order to facilitate the move of the exhibition, which was originally scheduled for February 22–March 21. The biennial will now take place in June.The committee also announced that it is considering the construction of a new exhibition space in the city for the art of Paris and will be reviewing the feasibility of the idea soon. The new venue would be located in the city’s historic St. Denis School of Design, on Rue des Grands-August", "The next Biennial should be held in 2020. The next edition of the Expo will take place in Helsinki in 2021. The next edition of the Art Show will be held in the city of Helsinki in 2022. The next edition of the National Museum of Contemporary Art will be held in the capital city of Finland in 2024. The 2020 edition of the Biennial will be held in the city of Helsinki. The 2019 edition of the Art Fair in Helsinki was already postponed due to the Covid-19 pandemic. The 2019 edition of the Art Show will be held in the city of Helsinki. And the 2019 edition of the Art Fair was already canceled due to the Covid-19 pandemic. The 2019 edition of Art Fair Helsinki was already canceled. The 2019 edition of the Art Fair Kiasma was already canceled. The 2019 edition of Art Fair Tartu was already canceled. The next Art Fair will be held in the city of Helsinki in 2021. The next edition of Art Fair Zurich will be held in the city of Helsinki in 2021.Artforum has reached out to Tate Britain for comment.\n\n\nJosé Manuel Mier Gallery in New York has announced that its future programming will be focused on Indigenous art,", "The next Biennial should be held within the next eighteen months, and the biennial will be the first of its kind. The selection committee consists of architect and curator Takuya Takahashi, director Hideo Nakao, and director Ippei Ono. The inaugural exhibition, entitled  Devotion, will be held at the Kunsthalle Basel from November 4 through November 6, 2020. The exhibition will hold major exhibitions of work by artists such as Kunsthal Black Forest, Kunsthalle Basel, and Kunsthal Stuttgart. The selection committee also comprises Kazuaki Kobayashi, director of the Glass House in Tokyo; Toru Iwasaki, head of the Kyoto Fine Arts Museum; and Hannes Stoelke, director of the Kunsthalle Middelheim.\n\n\nThe Project, an initiative of New York–based artists including Ed Sanders, Patrice Rinder, and Rineke Dijkstra, has announced the twenty-two artists who will receive a solo exhibition at its new space, the Project Gallery in Chelsea, New York, from January 6 to March 7, 2021. The artists were selected by the artists’ collective from a pool of forty finalists by a vote of the membership,", "The next Biennial should be held in 2020, and the final in 2024. The biennial will feature twenty-one artists and will showcase their works in conjunction with the annual Festival of the Arts. It will also include an online version of the festival. The Festival of the Arts is a global initiative organized by the Independent Foundation of the Arts (IFA) in partnership with the Little Rock-based arts advocacy organization Getty and the Los Angeles County Museum of Art (LACMA). The 2018 edition, titled 'The Moist in History: Art in the Age of Race, 1967–1975', closed with a performance by British artist Mavis Watkins, which was staged at the Compton Museum of Art in Los Angeles, and featured works by more than eighty contemporary artists and non-native artists.The 2019 edition, titled “The Past in Present: Contemporary Art in the Age of Black Lives” and co-hosted by Getty and LACMA, featured artworks by artists such as Marciano Ramírez, Orlando Barboza, and Rayyane Baroza. The exhibition will be based in Los Angeles and will run from March 16 to March 19. \n\n\nArts Alliance, the international coalition of more than 230 arts organizations", "The next Biennial should be staged in the spring of 2021, according to the organizers. The twenty-second edition will take place in the fall of 2021. The rest of the pavilion will remain intact in case of any disruption in the construction or operation of the exhibition.The ten-year-old museum, which is located in the city of Foshan in China’s Guangdong province, has faced the possibility of closure since 2016, when it announced it would be temporarily shuttered—a move that prompted protests from nearby residents and led to the closure of the area for three weeks. When the museum reopened in early April, it was still closed. \n\nThe Stedelijk Museum in Amsterdam announced today that it is planning to remodel its existing building in the city of Foshan, in the Guangdong province of Guangdong China, with a Danish architect and landscape architect, Ving Tveit, in order to increase the collection and exhibition space of the museum. The project, which will be carried out by the Danish firm Bergen & Tveit, will involve the redesign of the building’s exterior as well as of the interior and will incorporate a number of new spaces, including a library and", "The next Biennial should draw from the work of a select group of artists, choosing from a group of curators and curators’ first choice list. I’m working with a group of artists who have been selected from a group of curators from the list below: Gabbana, Lupu, Olu, Parrish, and Posthuma. \n\n\nArtist Billie Loury, whose work explored polytheism, feminism, and racism in the American South, has died at age eighty-three at her home in Detroit.Her death was confirmed by her daughter, the artist and filmmaker Sophia Loury. Born into a Baptist family, she was raised Catholic, but converted to Christianity when she was young. While at the Cathedral of the National Shrine of the Immaculate Heart of Mary in Detroit, she met and married her husband, the artist Jack Rinaldi. In 1962, they moved to the small Louisiana town of Carteret, where they eventually settled. Their son, John Rinaldi III, grew up in the family’s hometown.In the early 1970s, the couple began making films, documenting their travels and their relationship with Jack Rinaldi. In 1977, they traveled to Mississippi to shoot", "The next Biennial should take place in 2021. The 2020 edition, titled The Great American Art, was organized by the Museum of Modern Art in New York, and consisted of seventy-four works from the collection of the late artist David H. Koch and will run through January 25, 2021. The 2020 event will present a selection of work by seventy-two artists and will be curated by James Cuno.The event will include the exhibition of a selection of Koch’s works by artists such as Luke Braver, Steven Hunter, and Robert Irwin. The exhibition will also feature an exhibition of works by Australian-born, New Zealand–based artist and curator Helen Oyebode.Art in Motion, a new initiative of the Museum of Contemporary Art (MoCA), Los Angeles, is currently organizing a series of events to coincide with the museum’s spring 2019–20 season. The first event is a biennial that will showcase work by eighty-five artists from seventeen countries. The second is a symposium that will address ideas of art from the collection of the late sculptor Simon Copeland. The third is a solo exhibition at the Museum of Contemporary Art, Los Angeles, that will feature work by twenty-four artists. The fourth", "The next Biennial should be held at the new venues in the spring of 2019, and the first event should take place in fall 2021. The first exhibition, “From the Archives: 2019,” will open on November 1, 2019.\n\n\nThe Smithsonian American Art Museum (SAAM) in collaboration with the Guggenheim Museum of Art in New York and the Metropolitan Museum of Art, has expanded the scope of its international collaboration with the Korean artist Youngjin Seo to include the Korean artist Kang Hoakko, who died on December 4, 2019. The new initiative will endeavor to present Korean artists in a collaborative way. After Kang Hoakko’s passing, the institution will present an exhibition at SAAM dedicated to the artist and will invite her to participate in future programs. The program will launch with Lee Hiu “Flying Lotus” (2019) and will conclude with a solo exhibition of work by the artist in the spring of 2020.“Over the years we have worked with many talented and innovative artists, but we were never able to put their work on display together before,” said David Burton, the institution’s director of exhibitions and curatorial affairs. “", "The next Biennial should be held at the institution in 2020, said director of exhibitions at the city’s Art Museum Frank Gehry. Last year’s exhibition “Ajil Blogger”—a collaboration with photographer and filmmaker Ben Knaus that garnered significant attention and acclaim—was staged at the museum.“Without the extraordinary work of our artists and the extraordinary support of the community, we would not be able to realize this vision,” said Knaus. “To honour them, we are creating the Alexander Graham Prize, which will recognize the remarkable achievements of three artists who are making significant contributions to the region. This year’s prize was established in recognition of the extraordinary achievements of Neda Caidin, Ana Zuleta, and Karina Finlayson. The three award recipients will receive $50, $25, and $10, respectively. For those unfamiliar with the award, it is an annual award presented by the Alexander Graham Foundation. Previous winners include Elliot Arsht, Cara Tucker, and Jack Wayne Parsons. \n\n\nThe Luxor Foundation, which runs an international arts and heritage research program in Egypt, has received", "The next Biennial should take place in 2022. The last, and the last, was in 2020. In an attempt to placate activists, Art Basel canceled the upcoming exhibition, which was due to take place in Hong Kong, and suspended all future editions of the Biennale in the city. Protests against the decision were held. Kikkemara, the Finnish artist who was in the main prosecution, was awarded the Art Prize at the annual awards ceremony in Helsinki last week, and the Finnish artist collective Thee Remanufactured were awarded the Helsinki Prize for Performance. It was also revealed that the Hamburg-based collective Pertti Weihereiter and the California-based collective Thee Remanufactured would receive the Helsinki Prize for Performance. Since the awards ceremony took place at the Kunsthalle Bonn in Germany on May 9, the jury in the prestigious award ceremony was not able to reach a consensus on the awardees, leading to widespread speculation that the prize would be revoked. ArtsPrize announced the winners of the award, which are awarded on a rotating basis. Last year, the Helsinki Prize was awarded to the Finnish artist Laa-ane Aalto, whose work", "The next Biennial should be organized in 2021, with its first edition scheduled to take place in the spring of 2022.  In a statement released by her, Elsa said: “I appreciate the commitment of the Art Mariner and his team to bringing the exhibition to life in the 2016 version of the venue, and I am excited to see how many people will be able to see it as the exhibition begins its final leg in May. More than ever, the exhibition and the artworks are a vital source of inspiration for me and many others who are inspired by contemporary art.”The Biennial will be hosted by the Redevelopment Agency (DA), the Los Angeles County Museum of Art (LA MoCA), and the Los Angeles County Museum of Art, along with the Los Angeles County Museum of Art (LA MoCA) Art Institute, the University of Southern California, the Center for Visual Arts at Columbia College Los Angeles, and the Los Angeles County Museum of Art (LA MoCA) . The exhibition’s first section, “SOUTH, FOUR EAST, AND WEST,” will open on October 28 and run through January 23, 2020. The exhibition’s second section, “THE LINE,", "The next Biennial should be in January 2020.\n\nThe Hartford Museum of Art in Connecticut has appointed Barbara Banas as its next executive director. Banas currently serves as a senior curator and educator at the arts organization, where she works closely with staff and volunteers to integrate contemporary art with the Hartford Cultural Center.She succeeds Sharon LeWitt, who retired in August 2019 after seventeen years at the helm of the museum.“I’m very excited to add a brilliant curator of contemporary art to the growing leadership team at the Hartford Museum of Art as we continue to present and organize world-class contemporary art in this region,” said Daniel H. Pinto, the director of the museum. “Thanks to Barbara’s tremendous leadership and her talent and her commitment, the Hartford Museum of Art is reconsidering the future of the museum and its collection, and I’m proud to be a part of the final stages of this process.”Prior to joining the museum, Banas was a curatorial fellow at the prestigious Pennsylvania Academy of Fine Arts in Philadelphia. She has also taught at the University of Virginia, the University of North Carolina, the University of Houston, the University of Chicago, and the University of New Mexico.Comment", "The next Biennial should take place in 2020 at the Museum of Contemporary Art in San Francisco. The next exhibition should be in 2021 at the Museum of Modern Art, where it will open in April. The next biennial will be held in 2022.  The commission, which was first announced in September 2018, was led by Valentino Rossi, director of the Italian museum of Modern Art, the Museo d’Arte Moderno, and the Corriere della Sera. Mana Contemporary, the Italian modern and contemporary art institution established in New York City in 1974, received a $1 million donation from the David and Lucille Stokes Foundation. The gift included the museum’s purchase of twenty works by artists, including Richard Diebenkorn, Leslie Steyer, Theo Martensen, and Sir Henry Smith, as well as a selection of photographs, films, and sculptures. At the time of the donation, the museum was still working on acquiring works by Walter de Maria, Victor Metaxas, René Magritte, and Pierre-Auguste Renaud, among others.\n\n\nThe first major retrospective devoted exclusively to the work of Italian modern and contemporary art since the war-torn country’s birth", "The next Biennial should be held in 2022, the year of the Sixteenth, and would then proceed to stage three activities a year, each of which would take place in Argentina.As it stands, the event’s official website indicates the 2019 edition, titled “Ateliers Biennales,” will be “titled ‘2015’ and will be held in the city of Bordeaux. The exhibition will focus on art from the last five years.” The organization will also be holding a special exhibition dedicated to “María Berrío’s series ‘Bidus,’” which was staged in collaboration with the artist and curator María Berrío in Los Angeles in 2015.In addition to the eventual 2020 event, the Biennales de Paris and Bordeaux will also host a pre- and post-eventual biennial, “o7,” which will be staged in 2021 and 2023, respectively. The exhibition will be curated by Gérard Inés, a curator at the French Ministry of Culture.\n\n\nThe National Gallery in London has appointed Louise Armstrong as its first director. In her new role, which", "The next Biennial should have a theme of healing, a call to action, and an opportunity to learn from each other and from the world around us. The work of the next Biennial will be a contribution to the work of the past and to the future of art and healing.I desire to use the annual awards to reflect on the biennial’s history and to reaffirm its value for all those who have ever lived in the city of New York, and to develop new and exciting ways for collectors, artists, and art lovers to connect with the Biennials’ themes and themes as they unfold in the future.”\n\n\nThe Institute of Contemporary Arts (ICA) in New York has appointed Julie Schwier, who has worked at the institution since 1992, as its next director. Schwier comes to the ICA from the Metropolitan Museum of Art, where she has served as deputy director of exhibitions since 2013. Previously, she worked as the director of collections management at the Contemporary Art Institute of Chicago, where she oversaw five exhibitions of work by artists such as Cesar Vargas, Yinka Shonibare, and Chi-Li Cheng; as a senior director for collections at the Metropolitan Museum of Art; and as a director of the", "The next Biennial should be held in March 2021. The first episode of the series was broadcast on February 10, 2019. The exhibition will take up the theme of \"Life and Death in the Treatment of Cancer Patients,\" which is one of the main themes of “The End of Cancer: The World as We Know It”. During a talk given on February 12 at the first Biennial, J. Paul Getty times his hand to the painting of a man with his face visible in the distance, in the center of a large open space. Read more about it here. \n\n\n\n\n\n\nThe Metropolitan Museum of Art is considering installing microchips in all of its 5,400 employees, in an attempt to reduce the risk of a deadly coronavirus. The move comes amid an outbreak in the United States of which there are currently more than 4,500 cases and the coronavirus has spread to thirteen states. “We are not there yet, but we are making steady progress,” David Guttenberg, the director of the Met, told Artnet. “It is early days, but we are just getting started.”In the weeks since the first case was confirmed in Alabama on", "The next Biennial should be held in 2020, and the event’s theme should be “The Future Is Present.” The ten finalists for the prize include: Anselm Kiefer, Hans de Bonvoisin, Christoph Rech, John Sheehan, Ed Piskor, Alexander Sholem, Wolfgang Tuchmann, and Joachim Zumthor. \n\n\nThe Egyptian Museum of Modern Art (EMW) in Cairo released the first edition of its new Egyptian series, “Egypt: Contemporary Art,” which will run from September 18 to September 20, 2020. Titled “Egypt: Contemporary Art,” the exhibition will be centered around the Egyptian artist Kamal El Katheiri’s concept of the continuous reproduction of the landscape and its inhabitants. The work will also feature works by women artists such as Maâad El Majdal, Hisham Ibrahim, Nima Nabavi, and Naguib Sawiris.The series is part of the Ministry of Culture’s effort to promote Egyptian art abroad. During a September 2016 visit to Italy, Egyptian director Kamal El Katheiri commented that the series’s “patterns and the", "The next Biennial should be held in 2021.\n\n\nThe German pavilion in the upcoming Berlin Biennale has been canceled due to the coronavirus, which the US Centers for Disease Control and Prevention (CDC) have already determined is the cause of the coronavirus epidemic across the globe. The organizers of the fair have announced that it is considering whether it can move the event to another venue. “The temporary suspension of the German pavilion will not last long,” said Berlin-based artist Klaus Welle. “In the next few days, we will try to re-create a new atmosphere of cooperation between the artists of the pavilion and the Berlin Biennale. The biennial Berlin Centrale is a great tool for this purpose. We need to be able to meet the artists in Berlin, and to express our admiration and respect for their work in the exhibition. The pavilion is a great laboratory for the art of collaboration.”The postponement of the Berlin Art Museum (BAM) event is not surprising, as the organizers of the exhibition have not yet said when they intend to resume the event. However, the other two Berlin pavilions, the Felspiel Art Museum and the Beob", "The next Biennial should be held in 2021. As had been planned, the festival would take place in the Sambisa Forest in the foothills of the Himalayas in the northeastern corner of India. It would include fifteen artists, including Arsht, Rannatupalli, and Natarajan. The festival will be held in the northwest corner of Mumbai, on the outskirts of the city, and will be held at the Tiwani Luminance Hall in Pune, Maharashtra, from March 15 to March 22. The 2019 edition, which was supported by the National Foundation of Arts, Mumbai, the National Gallery of India, Mumbai, the National Museum of India, Mumbai, the National Galleries of Art, Mumbai, and the National Science Museum, Mumbai, resulted in some substantial cancellations. The 2019 Biennial was also marred by delays due to the Covid-19 pandemic. The 2019 edition, which was organized as a joint venture between the city of Mumbai and the National Galleries of Art, Mumbai, was supposed to begin on March 6 but was pushed back to March 13. Tickets were sold out in advance and the event was", "The next Biennial should be for art, not commerce.”Cindy Sherman, CEO of the New York–based nonprofit Art in Balance, said: “We are proud to support the Biennial to help honor the legacy of this extraordinary group of artists and to promote the art of balance. We hope that this prestigious exhibition will continue to foster new dialogue between artists and scholars and that it will serve as a model for future collaborations and projects.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Karen Allen as its new deputy director of curatorial affairs and chief curator. Allen comes to MoMA from the Metropolitan Museum of Art (MoMA), where she has served as deputy director since 2007 and most recently served as chief curator. She succeeds Mary Anne Carter, who retired in 2018 after nine years at the helm of the institution.“Karen is an exceptionally talented curator and scholar who has been instrumental in cementing MoMA’s reputation as a leading institution in the United States for more than twenty years,” said museum director Daniel H. Weiss. “Her extensive experience and talents will enable her to make the long-term future of MoMA—and of the institution as a whole—more", "The next Biennial should take place at an undisclosed location in the United States. In 2020, the biennial will return to New York City for a second edition, titled .\n\n\n\n\n\nThe Museum of Contemporary Art (MoCA) in New York has announced that it will suspend all events and programming through the end of March due to Covid-19. The temporary ban was put in place to protect the health of its staff and visitors, but also to conserve space for the institution’s collection and research.The decision was made amid an unprecedented outbreak of the virus in the United States. According to the New York Times, the number of cases in New York City has climbed to 8,640. The coronavirus outbreak began in Wuhan, China, in December, and spread to other countries, including the United States, China, and Hong Kong. Since New York City is located in the same region as China, which has been grappling with the fallout of the coronavirus—the virus has been detected in the blood of some 8,000 people in China—the coronavirus outbreak has also affected theaters and other cultural venues in New York City.In this ongoing crisis, MoCA has implemented new safety measures to protect the health of its", "The next Biennial should be held in 2022 and will be hosted by the university. The 2019 edition was held at the University of Pennsylvania. The project will be organized as follows: This year’s theme—“Nirvana”—was chosen by a panel of artists and scholars. “After an open-ended and art-filled year of exhibitions, residencies, and workshops, we are excited to be introducing another new, imaginative, and joyful place,” said Alexandra Markow, chair of the faculty of arts. The 2019 Biennial, titled “Nirvana,” was curated by Harjant Macgregor, curator of contemporary art, at the University of Pennsylvania.Harjant Macgregor is a professor of art history and curatorial studies at Columbia University, New York; art historian and scholar at the University of California, Berkeley; and an artist. His work is housed at the Art Institute of Chicago. The 2019 edition will be inaugurated by an exhibition of work by the artist and curator Marlo Podedà (1902–1990). The 2019 edition will be followed by an exhibition of work by the artist Julian Schnabel (1903–1989) at the", "The next Biennial should be held at the Athenæum in Athens in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Linda Anagnos and Philip Henne as curators of its next iteration of the Museum Intermissions (MI), a biennial that will take up the themes of Japan, feminism, and the role of art in promoting social justice, and will launch on October 27.“As curators, we will focus on examining the ways in which cultural institutions have historically—and continue to do so—move to and challenge the boundaries of cultural practice,” said Linda Anagnos, director of the museum. “Our goal is to make the upcoming iteration of MI as accessible as possible to a wide audience, and to make our collection as participatory as possible. We hope that these themes will resonate for many people, and that they will help to bring together an international community of curators and thinkers.”The first iteration of MI, which opened in the summer of 2021, was organized by curator and curator-at-large Adam D. Weinberg and took place at the museum in partnership with the Tokyo-based studio Lab, which also produced the inaugural Biennial “Feminine", "The next Biennial should take place in downtown Los Angeles in 2021.\n\n\nThe Seattle Art Museum (SAM) and the Seattle Film Institute (SFFI) are reopening to the public on August 8. The institution says the reopening will bring with it additional improvements, including the addition of a new visitor entrance, improved accessibility, and more robust programming. The reopening will also introduce new programs that will be presented by an additional ten artists. “We are very excited to reopen our doors to the public, and continue to present our world-class exhibitions and educational programs,” said Samantha Sexton, director and CEO of SAM. “Our new exhibits will be exciting and insightful for anyone who wants to learn more about the art of cinema. The new film forum will be a great way for Seattle residents to meet and discuss the art and film of their choice. We will continue to be an essential stop for local and national visitors to our galleries and neighborhood.”The Seattle Historical Society Museum (SHRM) will reopen on September 3. Its new exhibition “The Art of Movies” will feature contemporary work by thirty-five artists. The show will also feature new works by artists who have previously been on the cur", "The next Biennial should consider the ideas of the future in relation to its own and the future of art in relation to the present. “I am very much looking forward to the challenge of the question, how art, and more specifically contemporary art, might play a central role in a post-theological future,” said museum director Sixtenia Fadiga.The 2019 edition of the festival, titled “Feminine and Biennial,” will be held in the capital city of Buenos Aires, from March 16 to March 19, 2020. The biennial will present sixty works by ninety-three artists. The honor of the fiftieth invitation goes to the curators of “Amor.X.” The exhibition will be hosted at the Museo del Pilar, where it will be curated by Roberto Campos, the director of the Pérez Art Museum in San Cristóbal and cofounder of the Fabulous Five, José María.\n\n\nNADA, one of the largest and most prestigious contemporary art auctions in the United States, announced today that it is bringing the twenty-fifth edition of the New York fair to Los Angeles in 2020. The fair will still take place in New York City,", "The next Biennial should be staged in March 2019. The date will be announced once the venues for the exhibition have been decided. \n\n\nThe Selenis Gallery in London announced today that it is expanding its programming in support of the campaign for universal basic income (UBI) in the United Kingdom as part of an ongoing project to raise awareness of the issue. The center will be rebranded as a hub for critical thinking about the idea of unconditional basic income, which is centered around the concept of a basic income as part of a comprehensive social security system. The UBI Hub will be housed within the newly constructed Sydney Opera House, the newly renovated Westin Hotel, and the newly reconfigured South Kensington Hotel.The project was inspired by the Selenis Gallery’s decision to close its doors in 2019 amid its ongoing campaign to raise funds and awareness for the campaign. The museum is long-time supporter of the Universal Basic Income (UBI), a universal basic income of £11,000 that would provide basic security to millions around the world living in poverty. The UBI Hub will serve as a platform for UBI thinkers to network, engage with peers, and explore new ideas around unconditional basic income and beyond.", "The next Biennial should focus on the history of optimism, the art of art, and the art of life.  The project will try to bring together seven of the most important thinkers of the twentieth century: Jacques Lacan, Michel Foucault, Paulo Freire, Sachetti, Gilbert & George, and Pierre Huyghe. They will discuss the meaning of art as a biological process that unfolds within the body, the body as an assemblage of cells and their interconnections, and the relation between art and culture. The exhibition will be staged as part of the Biennial of Contemporary Art (BAC), which will run from March 16 to March 18, 2020 in Paris, and will be hosted by the National Museum of Modern Art and will feature work by forty artists. “Art has taken on many different forms in different societies,” said Marc Payot, the mayor of Paris. “We are convinced that the themes of the exhibition will surprise and delight visitors, and will be an excellent launch for the exhibition.”\n\n\nThe Museum of Fine Arts (MFA) in Atlanta, Georgia, has appointed Mark Mille as its next chief executive. In the new position, Mille will assume from Karen", "The next Biennial should be held at the same time as the 2020 edition.\n\n\nThe Fijian artist and educator Tarek Atoui, whose multidisciplinary practice encompasses painting, sculpture, sound, and performance, has been selected as the 2020 recipient of the National Endowment for the Arts (NEA) award. Atoui will receive a $500,000 cash prize, a $100,000 sculpture installation, and a $50,000 performance award.“Atoui’s work explores the duality of the body and the body’s relation to the environment, both physically and culturally, and articulates the question of how the body can be both a vehicle and an assembly point for the articulation of new ideas, new modes of expression, and an open medium for the universal communication among humankind,” said Andy Kelly, the NEA’s director. During the artist’s tenure at the institution, he has exhibited work in various venues such as the Museum of Modern Art, the Solomon R. Guggenheim Museum, the Museum of Contemporary Art, Los Angeles, the Museum of Modern Art, New York, and the Walker Collection, and has taught at institutions such as the", "The next Biennial should be held in the spring of 2021. “The challenge is to have an exhibition that reaches both the local and international communities at the same time, without compromising the program, while supporting the exhibition of work that is currently on display,” said the jury, which included Johanna Joost, director of the Biennial Montreux in Switzerland; Marta Kudacki, director of the Museo del Perro in Venice; and Ondine Marroquin, director of the École des Hautes Études d’Arles.\n\n\nThe Metropolitan Museum of Art in New York has appointed Alexandra Anton, the first woman to serve as the board chair of the museum, as its next general director. She will be the first woman to helm a major art museum in the United States and will take the helm from Dean Spanos—the former CEO and chairman of the corporation that owns the museum, the Met. She succeeds Daniel H. Weiss, who resigned after nearly three years at the helm of the museum in March 2019 and was replaced by Susan Crawford.“In the past few months, the Met has undergone a renaissance, becoming a global leader in exhibitions, exhibitions design, and education, and we", "The next Biennial should take place in September 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has been awarded a $12 million donation from the estate of the late architect Leo Noth, who passed away on May 29 at the age of seventy-nine. The gift comes after the museum spent more than a year and a half renovating its existing holdings in the museum, which was founded in 1939 by Louis Kahn with George Kahn and his wife, Joan. The institution opened to the public in 1975 and has been closed since.A further $12 million was donated by a group called the Noth Family Foundation, which is run by Leo and Joan Noth, and funds the restoration of the museum’s artworks. The organization also provides financial support for the museum’s educational and cultural initiatives. The Noth Family Foundation will make the funds available through an endowment when the renovations are complete.The Noths also gave $6 million to the institution in recognition of their service to the city of New York, which was instrumental in its acquisition by the Kahn family in 1995. The museum is currently working to introduce a $10 million fund for the maintenance of the building’s artworks, and it is", "The next Biennial should take place in the third quarter of 2020. It will be hosted at the massive new venue, created in partnership with the Government of Equatorial Guinea, an American partner of the Biennial. The 2019 edition of the event saw over sixty artists and activists from twenty-nine countries. On Saturday, July 9, the event will take the stage at the capital, Mpumalanga.The 2019 edition of the event was inspired by the ongoing social and political unrest in Equatorial Guinea\u0097which has the world's highest murder rate and one of the highest rates of HIV/AIDS in the world\u0097and its surrounding region of the world. In May 2019, the country was rocked by a massive anti-government uprising, in which more than eighty thousand people were killed. The unrest also coincided with the coronavirus pandemic, and many in the capital city were already protesting the proposed infrastructure development, healthcare, and education projects for their areas of the state.The protests were sparked by the country’s inability to enact any of the policy changes that the United States and international donors have asked for. In addition to housing, water, and power projects, the Biafra Forum has called for the immediate release of political prisoners", "The next Biennial should take place in Helsinki in the spring of 2020, and will take place in the spring of 2021. The artist-run exhibition will be guided by an expert panel of artists and curators, who will receive funding from the prize fund.The prize will be awarded to the artist in recognition of their contribution to the practice of painting; this year’s winners include Elina Rissanen, Jari Tappala, Jannikka Tappala, and Anke Sjöstrander, who will be presented with the Biennial Prize at the end of the ceremony.The prize exhibition will be hosted by the Helsinki Arts Club (HEL) and the National Museum of Finland (NOK) in collaboration with artist and curator Mika-Lynn Oiv, who is the founder and the director of the Helsinki Art Project (HEOP), and the Helsinki-based artist and educator Milla Jokinen. The theme of the exhibition will be “Painting and the Void.” Artists who have made significant contributions to their respective fields will be judged by a committee comprising Oikos Kapellä, Mika-Lynn Oov, and the art historian and writer Eija Romäs.The", "The next Biennial should be on February 21-28, 2020 at the Mogadoreanese art museum. It will also feature the first exhibitions dedicated to contemporary art in China and the first exhibitions dedicated to the history of Chinese art in North America.\n\n\nThe Museum of Contemporary Art (MoCA) Los Angeles announced today that it has received a gift of more than sixty works from the late artist-in-residence Stephen Friedman. The institution plans to display them in a two-story granite sculpture garden on its campus in January 2021.The gift is a biography of Friedman—who was born in New York City and grew up in San Francisco—as well as works by fellow American artist Robert Irwin. It also includes works by Liza Minnelli, Edward H. Weinberg, William Kentridge, and other artists, as well as a work by Friedman entitled The Geese (Reproduction Of A Bird), 1967, an assemblage tribute to Charles Bukowski, which will be included in an exhibition of works in the collection inaugurated by the late curator of American art David Fincher at the Museum of Contemporary Art (MoCA) in Los Angeles. Friedman's works have been featured in various exhibitions around the world,", "The next Biennial should be held at the Cadiz Castle in Maricá, in the Province of the Canary Islands, in the Canary Islands; the Fiminató, in the Province of the Canary Islands; and the Zérez de los Huesos, in the Province of the Canary Islands. The latest edition of the exhibition, “Thinking In Pictures,” will be held at the Museo de Arte Contemporáneo in Madrid in 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it has received a gift of more than seventy works by the late designer Alice Handy, whose body of work spans a multi-decade career spanning from the 1980s to the present. The gift includes a selection of her work from the late ’70s to the early ’80s and includes works by artists such as Robert Irwin, Helga Kemper, and Stephen Friedman; works by Richard Diebenkorn, who created his iconic, sculptural masterpiece The Body, at the Museum of Fine Arts in Seoul; and pieces by Annie Prouvé, whose enduring work explores the power of form in sculpture, rendering, and painting.Among the works that", "The next Biennial should, I believe, be held in the Spring 2020. --HARVEY LEE, MEADOWS, NEW YORK\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is planning to permanently close its doors next May, citing declining revenues and an anticipated $9 million shortfall in the 2020 fiscal year.The announcement follows the museum’s January announcement that it was planning to move the exhibition space from its current location on Tenth Street to a new space on the Upper East Side. The news was greeted with relief and dismay across the arts and cultural sectors, as it marked a shift in trajectory for MoMA. In February, the institution announced that it would no longer participate in the annual Museum of Modern Art (MoMA) Viewing Room, which has drawn an estimated 40 million visitors over its nearly seventy-year run in the historic museum.The move proved difficult for MoMA, which relied on the Viewing Room in part for income. The institution said that it expects to lose an estimated $7 million in the fiscal year 2020, citing a “tiered program” that will focus on older, more established artists. The museum’s management team cited the closure as a", "The next Biennial should be held in 2021. In future years it will be possible to organize events in various formats, such as film, concerts, exhibitions, performances, performances, performances, and seminars. In the meantime, the Biennial will continue to be an important platform for exchange and discussion. \n\n\nThe National Museum of Ireland (Museum) in Dublin has announced that the institution will move its current exhibition “On Life and Art” in the exhibition hall, which was slated to open in August 2021, to the Smithsonian’s National Museum of Natural History (NMNH) in Washington, DC. The announcement comes a few weeks after the museum revealed its plan to open a new physical branch in downtown Washington, DC. The National Gallery of Art, which was recently awarded a $25 million expansion project, also anticipates a final exhibition, “On the Road,” for 2020.The National Museum of Ireland, which is located on the second floor of the National Museum of Ireland (and is the third largest museum in the United Kingdom), has partnered with the Smithsonian to create a new museum dedicated to the history of art of the Pacific Rim. The eleven-thousand-work collection, headed by curator Dr. Paul Quinn,", "The next Biennial should take place in 2020, with the first exhibition, titled “Permanence.” The exhibition will reflect on the role of art in the fight for liberation from colonial rule and will present works by artists from Africa, Asia, and Latin America. The theme of the exhibition is “The Future We Want,” and the first work featured in the show will be a performance by the Brazilian artist Adriana Barroso.“This is an unprecedented historical moment on the continent,” said Elton John, who is currently co-chairing the biennial with Luther VandenWerke. “This is the manifestation of life and art in the struggle against colonialism and imperialism.”\n\n\nThe Museum of Fine Arts (MFA) in Chicago has appointed Imogen Mantzer as its next director. Mantzer comes to the institution from the Los Angeles County Museum of Art, where she has served as managing director since June 2018. She succeeds Sara Markken, who will retire in April 2020 after more than five years at the helm.“Imogen is poised to build on the transformative leadership and vision of the MFA, which has transformed the lives of countless artists", "The next Biennial should be in September 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to move some of its collection to its new home in the city of Burbank, California, but will not destroy some of the exhibits in the institution’s new home. The move is part of a plan that will allow the museum to remain open during a construction project that is expected to cost more than $1 billion.The $850 million museum, which is currently undergoing a $1.2 billion expansion, is slated to open in March 2024. The announcement follows a $650 million expansion project that is being led by architect Herzog & de Meuron and will culminate with a new 250,000-square-foot gallery space that will be built on the former site of the former Kroger space. The project also includes the construction of a new courtyard for the museum and the expansion of the museum’s existing campus.The renovation, which is being funded by the CalArts tax abatement fund, also includes the creation of a new master plan that outlines the future designs of the museum for the city and county of Los Angeles, which is expected to add more than 830,000 square feet of new space", "The next Biennial should be held in the spring of 2020, in the Forest of Dean, near Winchester, England; the second in the autumn of 2020, in Trinity College, in Cambridge; and the third in the spring of 2021. The exhibition will also include a redesign to the exhibition space, a new work by artist Carmel Benatar, and a new guided tour of the exhibition.\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced that it is planning to open an outpost in Shanghai in the coming years. The museum will house approximately 1,500 works by artists such as Jean-Michel Basquiat, Robert Irwin, and Akram Iqbal, a prominent collector of works on paper.The institution will also introduce a new program, called the New Shanghai Project, which will focus on new and emerging artists. The project will be led by the architectural firm W.E.M.D., and will run parallel to the reopening of the institution’s original campus in Venice, which is currently undergoing a $150 million expansion.Curated by artists Almine Rech and Simon Castells, the inaugural installment of the project will feature an exhibition of work by twenty-one artists, including Mike Kelley, David", "The next Biennial should take place in the spring of 2020. \n\n\nThe Museums Association (MAS), the UK’s major trade association for museum professionals, has released the list of thirty-five American artists who will participate in its next edition, which will take place at the Metropolitan Museum of Art (MoMA) in New York in March 2021. The seventy-five-year-old art historian Jerry Saltz will serve as artistic director for the exhibition, “For the Trees” and will curate the installation, which will feature works by the artists known as “beneath us.” The exhibition will also address the legacy of the Industrial Revolution, and the legacy of capitalism.“For the Trees’ urban landscape works, sculptural expressions and the evocation of an urban landscape that is organic, self-regulating, and self-sustaining,” Saltz said in a statement. “In a world where art and culture is increasingly divorced from social reality, and where the museum is now at the forefront of the dismantling of the world, these artists are at the forefront of exposing the transformative power of art, and the ways that it can transform and heal.”For the", "The next Biennial should include curating a new work by the American artist Buckminster Fuller; an exhibition of works by the French artist Henri-Georges Seurat; and a new book.“We value the support of our community and artists to ensure we deliver exceptional exhibitions, and we are grateful for the commitments that have been made by the greater downtown Toronto and the City of Toronto in promoting the Biennial, particularly in the past three years,” said Mayor John Tory. “It is a real shame that it has come to this.”\n\n\nThe California Academy of the Fine Arts (CAFA) in San Francisco has received a donation of $50 million from the philanthropists of the Peter and Edie New York–based philanthropic organization the Edith New York Foundation (NYFF), which was founded in 2015 to help the family of Edith New York, the American photographer who passed away in 2001. The gift was made on behalf of the foundation in recognition of the accomplishment of its three-year, $50-million campaign to raise funds for the museum. The gift comes at a time when CAFA is facing many challenges. The institution is currently undergoing a $250 million expansion spearheaded by the city of San Francisco, which", "The next Biennial should be held in 2020, when Chinese artist Yao Ming will be forty-six years old. The museum will hold an exhibition of works by Chinese artists in 2020, as well as a retrospective of the work of Chinese artists in 2020. The event will be co-organized by the Beijing-based Beijing-based art writer Jody Freeman and her husband, the Chinese curator and painter Zhang Shui. Both Freeman and Zhang Shui have previously documented their attempts to engage with the history of the Biennials. In an article published in the May/June 2012 issue of Artforum, Freeman wrote: “From the 1970s onwards, Zhang Chih-cheung and I have been collaborating on a project to restore the Mao Tse-tung Collection to the state museum. We have finally succeeded and are currently working towards the next stage.”\n\n\nThe Singapore Art Museum (SAM) has acquired the materials and works of artist-in-residence Halima El-Khoury, who lived and worked in Singapore and Malaysia. The institution also announced that it is acquiring the works from the Bishan Museum of Art, the National Gallery of Singapore, and the National Museum of Singapore,", "The next Biennial should focus on the history of the city and its citizens, with a particular attention to the cultural and commercial sectors of the city. The list of artists who will be featured in the exhibition is as follows:Ricarda Laib. Chronology: From Time to Time (Rao Foundation)Fernando de Castro. Chronology: From Time to Time , . ed. and trans. (Fernando de Castro)Fernando de Castro: Chronology.\n“The Art of Death,” 2003. This work was included in the ‘Prix Max’s exhibition ‘Art of Death’ (2009). The Prix Max’s studio is located in the City of Bologna, Italy. The works in the exhibition are curated by Italian artist Paolo Zingaretti, whose practice is comprised of a combination of sculptural and textural experiences: a sculpture of a man in a hospital bed; a textural collection of words; and a film that follows a man as he cuts open an empty suitcase in the middle of a deserted street. The exhibition was instigated by a letter from the artist to his mother as well as", "The next Biennial should focus on the concept of a future independent Catalonia. Events that do not acknowledge the current conditions in north-eastern Spain and Catalonia should not be included, and the program should be organized in a way that will bring the best of contemporary Catalan culture to New York.”Since the Madrid government has repeatedly rejected calls for independence, the region has had to move forward with planning for its own future, creating new obstacles to investment and tourism. Last month, Spain suspended the region’s annual ban on tourism in the country, which will now be able to welcome around three million tourists this year. Last year, Spain also ordered a total shutdown of public buildings in the region, which will now be able to welcome around one million visitors.The decision to cancel the region’s annual March 22 festival, which celebrates Catalonia’s independence day, was made after Spanish Prime Minister Mariano Rajoy refused to sign a series of declarations in support of Catalan sovereignty, and was made in a move that the prime minister described as “unacceptable” by some in Catalonia.\n\n\nThe Organization for Security and Cooperation in Europe (OSCE) on Monday approved a new set of guidelines for the protection of the cultural heritage of the former Soviet", "The next Biennial should be held in January 2021.\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles’s (L)A’s Bay Area has been awarded $1.25 million by the Christopher Columbus Foundation for the Arts (CCFA) in support of its acquisition of thirty artworks by artists in the Bay Area who have been neglected by museum trustees for years. The gift, which was made in support of the nonprofit’s “Forever the Bay Area,” was made through a combination of donations and grants, including a $1 million gift made by Charles and Sally Pollock, the co-owners of the antique car dealership DHL Space, in 2010.Lily Bean-Niles, chair and director of the CCAFA, said: “In 2016, our board of directors and I were inspired by the work of the twenty-one artists in the Bay Area who had exhibited their work in the 2015–16 season at the museum. We’ve been working closely with the artists over the years and were keen to help them recognize their opportunities and their opportunities to make a difference. We were fortunate to acquire their works and to receive significant assistance from the CCAFA", "The next Biennial should be held in the spring of 2021. The Smithsonian has announced that it will also open a new, larger pavilion in New York in 2020. \n\n\nThe Smithsonian’s National Museum of African Art in Washington, DC, has hired London-based artist Ellybeth Hunt as its new chief creative and innovation officer. Hunt will be responsible for overseeing the museum’s expansion into an international center of African art and culture. She will succeed Carlotta Caruso, who retired in March 2019, and will assume her responsibilities in July.“Throughout her twenty-five years with the National Museum of Art, Ellybeth has demonstrated a remarkable understanding of how art and culture intersects with contemporary social and political concerns and has been instrumental in securing the museum’s future as a global leader in the art and culture field,” said Laurence B. Vance, chair of the institution’s board of trustees. “As we look to the future, she will now be able to continue her vision of reaching beyond the boundaries of our continent to shape and shape the future.”Caruso, who helmed the National Museum of African Art for twenty-six years, has been promoted to", "The next Biennial should take place at a location that will help us visualize the future and reflect on the impact that our art has on it.    \n\nArt historian Daniel Kaplan, a professor at the University of California, Los Angeles, has been appointed director of the California Institute of Technology (Caltech) in Pasadena. He succeeds David Huertas, who retired after a decade due to cancer in 2018, and will assume his role in January 2021. “There has never been a more important point to think about art history as a whole,” said Jacqueline Crouch, chair of the board of trustees of the Diller Center for Art and Culture. “Daniel has been a tireless champion of contemporary art for nearly three decades and will continue to be a champion at our institution. We are grateful for his service and look forward to his appointment as director of the Diller Center and to his next chapter with the Diller family as we prepare for the 2019–20 academic year.”Prior to joining the UCLA Art Museum , Kaplan was a visiting assistant professor in the department of painting and photography at the University of California, Los Angeles. He began teaching at the institution in 1992 and rose to research and publish with the help", "The next Biennial should be a showcase of the creative activities of the entire country, curated by a select group of artists from every walk of life. We want to invite the public to present their perspectives and experiences to the Biennial on the understanding that we will then create and present the exhibition. We hope that this exhibition will serve as a platform for empathy and understanding. We hope that it will inspire us as we reflect on and remember our past. We hope that it will serve as a source of inspiration and a source of inspiration for young people. We hope that it will serve as a way of healing and a way of healing for the community. We hope that it will serve as a model for collaboration and a way of collaboration for the community. We hope that it will serve as a way of celebrating and reflecting on our history, our traditions, our values and our commonalities. We hope that it will serve as a guide to the future and a way of guiding us as we face the challenges and challenges of our times. We hope that it will serve as a way of learning from each other and acting in solidarity with one another. We hope that it will serve as a way of practicing what we believe in and showing it to", "The next Biennial should include 2-3 exhibitions of work by emerging and established artists and should cover the history of art and the art of art in the studio. The exhibition should include an artist-in-residence program in the studio and be organized as a learning experience.The time for the exhibition is now. Please consider supporting this exhibition by buying one of the artist-in-residence tickets or by subscribing to the biennial here.The exhibition will be held at the Pond in the City of New York from January 26–February 29. The biennial was established by John L. and Paula Epstein and is backed by the John D. and Catherine T. MacArthur Foundation. The firm will present a one-hundred-year retrospective of the artist-in-residence, Fabienne Leclerc, at the Menin Gallery in New York, which will be reconstructed as a one-story, Florentine Revival structure with a modernist aesthetic. The artist-in-residence program, which will be curated by Megan Barnwell, will be led by Antoine Leclerc and will be centered around Fabienne Leclerc’s studio in the arts district of the Old East City of", "The next Biennial should be held in the summer of 2021. \n\nThe Museum of Contemporary Art (MoCA) is preparing to welcome visitors back to its Los Angeles outpost next month. The institution announced on Thursday that it will welcome visitors back to its former home on February 9, 2021. Opening hours will be 9 AM to 5 PM, and the museum will be closed until at least 5 PM on February 10.The announcement coincides with the opening of the museum’s new landmark, the Monumental, an exhibition dedicated to the life and work of Martin Luther King Jr. The exhibition is curated by artists such as Ellsworth Kelly, William Kentridge, Michael Ondaatje, and Paul Gauguin. The museum is also preparing for its first season of programming at its new home in the Los Angeles Chinatown. The first leg of the new project, entitled “Blue,” will open on January 25, 2021. The new show space will be inaugurated by a retrospective of Merry Norris’s work, Blue, on March 7, 2020. The show will consist of a series of photographs by artist Ron Gorchov that were taken in the waning decades of the 1960s. Gorch", "The next Biennial should be released in 2021 and will be hosted by the Museum of Modern Art and the Brooklyn Museum.\n\n\nThe Siberian artist Nadezhda Galushkina has been named the winner of the Prix de la Main. The prize ceremony took place on Monday, October 4, at the Musashi-based gallery in Moscow. Dubbed the Prize for Contemporary Art, the biennial will showcase work by forty-seven artists.Nadezhda Galushkina’s work, which explores the artist’s relationship to the Russian state and to her homeland, was selected for its “limitless landscape” painting, which was created on the Okhotsk River in the city of Oblast’s Tatar region. The work, titled Return, is a dual-language performance, written in both Tatar and Russian, depicting a young woman returning home from a work trip, accompanied by a group of her friends. She also created a collage for the exhibition of her work, which explores the relationship between painting and the Tatar people.Nadezhda Galushkina said: “After my Japanese trip, I realized that my art has a significant place in Russian culture. For me it is important", "The next Biennial should be held in 2020.\n\n\nThe National Council on the Arts (NCA) is demanding that the City of London go further and further to the right by revamping its regeneration plans and redesigning areas of the capital where the annual Royal Shakespeare Company (RSC) event will once again take place. In a letter addressed to Mayor Sadiq Kahn, NCA chair Julian Barnes, and deputy chair Caroline Fox, the group says that the proposed redesigns are backward-looking and will only serve to exacerbate London’s housing crisis.“We call on you to take concrete action to ensure that the redesigns you propose for the City of London, as well as any future redesigns of our city, deliver on the commitments you made in 2018, including by delivering on your goal of ten thousand new homes for London’s working poor,” reads the letter, which is dated December 3 and signed by NCA, the Royal Shakespeare Company, the National Union of Journalists, the House of Lords, and the Public Accounts Committee.The letter contends that the proposed changes were made in response to the pressure from London’s business community and government officials to curtail the RSC and act in conjunction with the Mayor, who has repeatedly", "The next Biennial should be held in Helsinki in 2022. The fifty-ninth edition will be held in New York in 2020.  The seventy-third will be held in Helsinki in 2020 and the sixty-eighth in 2021. The seventy-ninth will be held in New Delhi in 2021 and the seventy-eighth in 2021. The seventy-third will be held in Rome in 2021 and the seventy-fourth in 2021. The seventy-ninth will be staged at the Museum of Modern Art (MoMA) in New York from November 28 to November 30, 2020, and the seventy-second in November 2020 and the seventy-third in November 2021.The seventy-fifth will be staged at the National Museum of Contemporary Art (MCA) in New York from November 24 to November 28, 2020. The seventy-eighth will be staged at the Walker Art Center, Minneapolis, on November 28, 2020. The seventy-fifth will be staged at the Museum of Modern Art (MoMA) in New York from November 27 to November 29, 2020. The seventy-sixth will be staged in Paris from November 25 to November 28, 2020.The seventy-eighth will be staged at the Museum", "The next Biennial should be held at the Victoria and Albert Museum in London, where it will return on February 21, 2021. The exhibition will also return to Tate Modern in London in 2020, and will run concurrently with the Venice Biennale. The new project, titled The New Art of Biennial, aims to create a more inclusive and globally accessible exhibition space for contemporary art.It will feature new drawings, new prints, and works on paper by twenty-four artists, including Edwin C. Evans, Charles-Marie Fung, Fengyi Chen, Eysencky Ert, Philip Larkin, and Rudolf Süder, and will be curated by David S. Garrow, director of the Tate. “The new exhibit will engage with the key themes of our generation and present, and will engage with the social and cultural/political issues of our time,” Garrow said in a statement. “The new exhibition will be a celebration of the art of exhibitionism as a powerful force for social change and will strive to live up to the legacy set by the late Brooker Heath James, with the exhibition ‘The Art of Exhibitionism’ as a new and ambitious version, which we hope will attract", "The next Biennial should take place in 2019. The next iteration should take place in 2024.The next edition will be held at the Museum of Modern Art in New York from March 23 through March 27, 2020.  Art historian and scholar Anthony Burgess, who is best known for his scientific writings about the natural world, was a big proponent of these kinds of exhibitions. His essay, Categorie and Its Discontents, was published in the May 1966 issue of Art in America and has been adapted as a 2013 documentary. The exhibition will also feature work by artists who have been excluded from the previous editions, including Warren Kanders, Gregory Benford, and Ellie Mae Scott.“We are committed to staging an exhibition of Hall’s work in 2020,” said Paul Schell, director of the Biennial. “This is an exceptional collection of Hall’s work from a very long-standing collection. Given its multi-hundred-year history, the collection is truly an ideal building block for the reimagined exhibition that Hall has envisioned.”\n\n\nThe Ohio Museum of Art (OMA) announced today that Kristy Herdin has been named its next director. Herdin comes to the institution", "The next Biennial should be held in late April. Designed by Jean-Michel Basquiat and Hélio Oiticica, the show will present works by artists such as Charles Ray and Alexander Calder, and will focus on the materiality of body and the impact of material objects on human existence. The show will take place in Paris, Lille, and the Grand Palais.\n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco has appointed Trisha Brown as its next director. Brown will be the first woman to lead the institution since Dennis Lim, the current director of the Metropolitan Museum of Art, took the helm in 2012.“We are thrilled to welcome Trisha to the MoCA family,” said Marc Glimcher, chair of the museum’s board of trustees. “Trisha’s extensive experience in modern and contemporary art, as well as her proven ability to connect with and shape the museum’s collection and programs, combination make her the ideal person to lead the museum through this challenging and transformative period.”Prior to joining the Met, Brown served as chief curator at the New York art biennial ADX from 2007 to 2010 and as an associate curator at the Museum of", "The next Biennial should be held within the next year.\n\n\nThe Minneapolis Museum of Art (MMA) is planning to pull its 2017 exhibition “The Authority of the Self,” a biennial devoted to the history of gender and the body, from its website due to an outcry from some members of the museum’s staff. The show was set to open on March 10, but was postponed due to the Covid-19 pandemic. “Museum staff have made enormous efforts to make this exhibition a success, and we are grateful for their dedication and confidence in showing it here,” said Mike Ramsey, the museum’s director and CEO, in a statement. “The exhibition is now reopened, and we are excited to present it again next year.”The United States, which experienced its first wave of Covid-19 infections in December, is currently at an all-time low. According to the New York Times, the number of new Covid-19 cases in the United States is down to 138, compared to 534,834 in the United Kingdom, where there were 1,161 cases on Monday. In the UK, an estimated 817 people were infected on Thursday, and on", "The next Biennial should take place in the fall of 2020. With this in mind, the board of trustees has established a new committee to be chaired by Thomas Magnet, chairman and CEO of the Indianapolis Museum of Art (IMA), and which will be led by auditor and curator Doris Armstrong. It is also considering moving the entire event to the Arbor, which already has a new building, the Polson Center for American Art, and a larger campus. The board is also considering adding additional programming to the Biennial.“The board is committed to working with the city of Indianapolis to ensure the future of the Biennial,” Armstrong said in a statement. “We look forward to working with the city and city council to create a unique and moving experience that enhances the city’s rich and diverse history through a series of exhibitions, educational programming, and curatorial projects.”\n\n\nThe Graduate Center in the City of New York (GCNY) has appointed Sasha Salerno as its new executive director. She will be responsible for the development of the center’s arts-based programming and the management of the institution’s collection and collection-related endowment. She will take the helm from executive director Daniel H. Weiss in", "The next Biennial should start in June and will take place at the national museum in Beijing. \n\nThe Metropolitan Museum of Art in New York is raising funds to preserve the works of a major group of South American artists that weren’t included in the new exhibition “Cold Blood,” which opened on June 10 and runs until August 3.The event will feature twenty-four works by the groupings of José Maria Berrío Pires, Ana Pimentel, and Ana Mendieta, who were invited to Mexico City by Jose Enrique Peña Nieto, president of Mexico from 2001 to 2009, and will focus on their relationship with the United States and its impact on their art and art history. The event will also include the first public exhibitions of work by the groupings in the United States since 2006, with work by Agostino Lagana and work by the same groupings in Mexico City, in a single exhibition.The new exhibition is part of the Met’s efforts to expand its collection of art from Latin America, which is housed in its own building on Broadway, and to bring it to New York. Last year, the museum opened a gallery in the former Peabody Railroad depot on East Twenty-", "The next Biennial should be held in New York City sometime in the 2020s. The São Paulo Bienal, Brazil, will inaugurate its thirty-fourth edition in 2019. The Art Newspaper reports that the twenty-fourth edition will be held in the Brazilian city of Porto Alegre in 2021. The CERN, the European Organization for Nuclear Research, and the CERN-LEC Project in Switzerland are currently in the process of designing and building the second Large Hadron Collider (LHC) in Geneva. The forty-second edition of the Biennale d'Architecture will take place in Berlin in 2021. The seventh edition of the Biennale d'Architecture, held in the CERN supercomputer CERN, will be held in the Swiss city of Bern in 2022. The Swiss city of Basel will host the fifty-fifth edition of the Biennale d'Architecture, which will be held in January 2022, in March 2022, and in June 2022. The Swiss city of Vigo will host the sixty-eighth edition, which will take place in June 2022. The twenty-first edition of the Palais de Tokyo in Paris will be held in March 2022", "The next Biennial should also include a discussion on how the exhibition got its name (the venue had originally been called the Pavilion of the World) and the museum’s relationship to the installation.\n\n\nThe Danish artist Lars Vilks, who pioneered minimalism in his postwar art by creating works that were ephemeral, and whose sculptures feature vast landscapes and anthropomorphic beasts, died on January 7 in Sønderborg, Denmark. He was ninety-two years old.Born in Copenhagen in 1938, Vilks studied under the avant-garde artist Jørn Fadje and later with the German artist Hans Christian Andersen. In 1964, he began his special-interest exhibition series, which explores the physical and landscape through his paintings, sculptures, prints, drawings, and photographs.For the second Biennial, titled “Life and Landscape,” in 1997, Vilks incorporated life-forms throughout his studio, including trees and plants and other foliage. “The artist’s path of what he calls ‘mapping out the real, of what he calls ‘living on the same level,’ was not a linear one,” Lars Vilks said in a 2015 interview with the Art Newspaper. “", "The next Biennial should be held in the spring of 2020. “We are grateful to all of you who have supported the exhibition of our last exhibition, ‘Feminine’s Cage,” said director Iwan Wirth. “The next year should be full of new stories and new questions.”\n\n\nThe independent museum in Milan that has been closed since February 26 because of the pandemic is planning to reopen in the coming weeks. The Monti Institute for Art Research (MIM) in the Piazza Hermanos in Milan, which is housed on the third floor of the Piazza della Scala, will remain closed until at least April 2, and is planning to extend the Summer Festival of Art, which is scheduled to begin April 9, to March 22.Next year’s event will be significantly different, with the exception of the theme. MIM president Maurizio Grammatica said: “We will begin with a theme that will be a statement of hope and a celebration of everything that is modern and contemporary, and we are sure we will be able to change it according to the whims of nature. We will have new developments, new works and exhibitions,", "The next Biennial should be held in 2020. As of April 25, an online campaign to secure its continuation is underway.\n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has released a statement regarding the recent wave of resignations following the August 28 announcement that the institution would be shutting down its three remaining museums in the wake of the coronavirus pandemic. The museum has since been accused of peddling “hostile and sensationalist” portrayals of its historic events, and of failing to take proper measures for its aging, dilapidated, and presently-underconstituted buildings. “We acknowledge that these are challenging times and that there are many of our colleagues who are disappointed by the decision,” the museum said in a statement. “We believe that such actions, taken with the museum’s full support, will help ensure the museum’s long-term sustainability as a vibrant cultural gathering place for audiences of all ages.”The institution also said that it intends to continue to engage with its audience and community through programming, exhibitions, and educational initiatives, and will continue to operate on a 'voluntary basis” through the end of April. However, the board of", "The next Biennial should take place in 2020. The project, which has been in the works for twenty years, was commissioned by the Museum of Modern Art in New York and was organized by curator Emma Lazarus. The show will consist of ninety-four works by thirty-two artists from twenty-four countries, including Canada, China, Germany, Mexico, and the United States. The show will include works created in either the contemporary or late nineteenth century. The biennial will also include an exhibition of the work of twenty-five artists whose work was selected by a jury comprising artist Kiki Smith, curator Yinka Shonibare, and art historian Gary Garrels. “We are honored to collaborate with the curators of this year’s Biennial to introduce new and exciting exhibitions and curating experiences to the growing collection of contemporary art,” said David Breslin, the director of the Museum of Modern Art and the Board of Trustees. The museum is currently working to create a new exhibition dedicated to the work of artist Gertrude Stein.\n\n\nThe 2018 Hong Kong International Biennale announced today the thirty-five artists who have received the award for best international exhibition in the country this year\u0097the", "The next Biennial should take place on the campus of the University of Florida (UF), Orlando on February 19–February 21, 2020. The exhibition, titled “Relief,” will showcase more than 130 works by thirty-eight artists from twenty-five countries and will highlight the work of women and non-binary artists from Latin America, Asia, and the Caribbean.The first event of its kind, the exhibition will be curated by Mona Guggenheim Foundation curator Marta Gallo and will feature work by twenty-eight artists—including the first non-European artist to win the 2017 Turner Prize—and will run alongside the festival,“The Art of the Body,” which will take place at the same location. Gallo said: “I’ve been thinking for some time about how we can develop new models of representation and how this will inform how we think about art and art history.” For the exhibition, Gallo and her team enlisted work by forty artists from thirty-seven countries, which ranged from Argentina, Brazil, Chile, Mexico, and Peru to Belgium, France, Italy, Poland, Spain, and Turkey. The exhibition is part of a wider project, “Generations of Art", "The next Biennial should take place in 2020.\n\n\nThe Institute of Contemporary Arts (ICA) in Milan has appointed Gabriella Guarani as its next executive director. Guarani comes to the institution from the Fondazione Lello, where she has worked since 2013. She succeeds Rosa Molina, who announced on June 16 that she is stepping down after thirteen years and twenty-eight days in the position.“I’m very happy to be leading the ICA in Milan,” Guarani said in a statement. “I’m particularly proud of our work in the area of contemporary art, and am especially focused on fostering an environment of creativity and innovation in the ICA. The ICA is an essential hub for the cultural life of Milan and is the only institution in Italy whose full-time management staff consists of an appointed board of directors, a board of curators, and a staff committee. ICA also represents an important international platform for the development of contemporary art, and I am very much looking forward to the ICA’s transformation into a truly regional institution.”Guarani succeeds Renata Olmi, who announced in March that she will depart in February 2020, and will", "The next Biennial should take place at the Museo de Cultura de Barcelona from February 24 to February 28, 2020. The next edition of the Biennial will be held at the Centro de Cultura de Barcelona, which will be inaugurated by a retrospective of work by feminist artist Ginevra Pape in December. The next edition of the Biennial will be staged at the Santiago Bernabéu.\n\n\nThe Solomon R. Guggenheim Museum has appointed Linda Smith as its new senior curator of modern and contemporary art. She succeeds Jennifer Kelly, who has served at the museum for thirteen years, and will begin in her new role on January 9, 2020.“Over the last ten years, Linda has established herself as one of the most highly regarded and accomplished curators in the field,” said Guggenheim director Robert De Niro. “Her achievements and talent make her an ideal candidate for the Guggenheim’s new role, which has already introduced an entirely new level of engagement with contemporary American art. We are thrilled that she will join us next year, and we look forward to working with her.”\n\n\nThe National Museum of Women in the Arts (NMA)", "The next Biennial should be held in 2020.” The next edition of the 2006 conference, held at the Los Angeles County Museum of Art, was canceled in February and was not rescheduled.  Last year, the museum staged its first ever open-concept exhibition in the museum’s courtyard, “The Waters of Life and Water,” which was organized by Frances Morris and Kate Mulgrew.\n\n\nNew York artist Salah Abdeslam, who was arrested in the December 2015 bombing of a Paris concert, has received the first official apology from the French government. In a letter written by French Culture Minister Franck Riester on Wednesday, Riester calls the Belgian national a “devastated man,” who “fought against the secular state and against the values of the state.”Riester also accuses Abdeslam of being in communication with the group that carried out the attack, the Combatantion des Frontières (French for ‘Front National), and of facilitating the attacks. He states that thanks to surveillance, the group had a recording of the concert and called for the recording of Abdeslam. “I condemn these acts of mass murder committed by", "The next Biennial should take place at the Museum of Modern Art, St. Louis, in 2020. The next edition of the Art Institute of Chicago, which will be hosted by the University of Pennsylvania, will be staged in 2021. The next edition of the Art Story, which will be held at the Art Institute of Chicago, will be staged at Columbia University, Chicago, in 2022.The Art Institute of Chicago’s board of trustees announced today that it will accelerate the timetable for the institution’s reopening by a year, deferring the event’s 2020 opening date by three years and giving the institution another year to re-engage with the historic site, which has been the site of many of the institution’s exhibitions. “We need to rekindle the passion of the Art Institute of Chicago with our visitors and the community. This means rethinking our exhibitions and exhibitions experiences and rethinking how we engage with our visitors,” said Allen Rupprecht, the museum’s board president. “We will share more about that in November.”The motion pictures exhibition, “A Better Place,” will now open on September 19, 2020, and will run through January 13,", "The next Biennial should be held at least six months after the recent blackout, in November 2020. \n\n\nInternational Women’s Day (IWD) was proclaimed in the United Kingdom on Wednesday, October 8, 2020, to commemorate the achievement of women’s suffrage. In honor of the milestone, British artist-activist Lana Delahanty, who had campaigned for women’s suffrage from the onset of the suffrage movement in the United States, is giving $100,000 to the women’s rights advocacy organization Women’s Equality Network (WE).  Delahanty is also donating $10 million to the Women’s Aid Foundation (WE), the Women’s Action Forum (WAF), and the Feminist Front, which is aimed at promoting women’s interests, including the arts and culture, and is asking for $5 million from the British Conservative Party (BPC), which has a majority in the UK’s European Parliament.Delahanty’s pledge follows the Women’s Mental Health Trust’s (WMT) pledge to donate $10 million to support the lives of those affected by mental health crises. The trust said that it hopes the", "The next Biennial should be held in 2021 and will take place at the newly renovated Palazzo delle Papesse in Venice. The exhibition will feature contemporary artist-works, exhibitions and performances by historic and contemporary artists, and will mark the 120th anniversary of the Venice Biennale. Academics and other experts have already expressed doubts over whether the 2020 edition of the Biennale, which will feature the works of forty artists, will be able to handle the punishing monsoon season, especially as the opening of the exhibition coincided with the start of the filming of the HBO series Game of Thrones.  The organizers of the event have announced that the 2020 edition of the show will be even more ambitious, featuring more works by artists from within the last ten years. Benedict Bergman, the director of the Hirshhorn Museum, has also warned that the event’s 2020 edition will likely be the last, and that the creative community will probably leave the field in February 2021. “It will be a year of loss and a year of renewal,” Bergman said. The Venice Architecture Biennale is currently staging an expanded version of the exhibition, “After Action,” in December", "The next Biennial should take place in 2020, with the first in 2022.\n\nInterviewed by London Times\n\n©2017 The Arts Newspaper. All rights reserved. For software and hardware only. _____________Artists and institutions’ Notebooks’\n\n\n💜The look was full of promise,” said Robert Giard of the DiCaprio Art Museum in New York. “I was particularly drawn to the legato lines, which were very reminiscent of the latter part of the twentieth century. . . . The curators treated the setting as if it were a nineteenth-century museum.” He later added: “It was a little hard to imagine that this was 1957. . . . I was in the third year of a masterclass on drawing and it was so hard to imagine that Art Nouveau was still around,” Giard told the New York Times. The new exhibition, titled Art of the Unseen, will feature new work by thirty-five artists, including Tanya Davidson, Raynal El Dousya, and Rintoul Mansour, as well as artworks that were created with techniques borrowed from the industrial revolution, from the 1930s through the 1970", "The next Biennial should be held in some form in 2020. The selected artists will be selected from an open call, which will take place on October 17–October 20, 2020.The inaugural exhibition would be held at the Institut d'art et deux in Paris on February 4–March 14, 2021, with a visit to the Museum of Modern Art in New York the following month. In the museum, the show would be divided into six sections, each of which would focus on a different theme, from wildlife to the environment, with the final section curated by a curator in the United States.The pavilion would feature works by forty-six artists, including Anna Atkins, Anish Kapoor, Martine Molloy, Ânégligie Bénétière, and Kara Walker, among many others. The full list of artists participating is as follows:Aldridge-ParsonsArt Gallery ChicagoArtists in the City of ChicagoArtists in ChicagoArtists in the City of Saint LouisArtists in Saint LouisArtists in Saint LouisArtists in Saint Louis at the Museum of Modern ArtArt Art CenterBarbara LaBouvier BerlinBergenbau Art GalleryBergenbau Art Gallery in New", "The next Biennial should take place at the Contemporary Art Museum St. Louis, which is currently undergoing a $300 million expansion; the Museum of Modern Art, which has moved from its former home in the St. Louis Arch, in downtown Chicago; and the Metropolitan Museum of Art, which is currently renovating a 720,000-square-foot space in the former St. Andrew’s Episcopal Church in Louisville. The next iteration of the Museum of Modern Art Grand Rapids, Michigan, will be staged in 2020. The Museum of Art in Boston, which recently announced plans to open a new, 40,000-square-foot, arts and culture hub, is also on track to host a new exhibition in 2020. \n\n\nThe Museum of Modern Art (MoMA) in New York has been accused of discriminating against a black artist in a lawsuit that was filed against the institution in 2017. The attorney representing the plaintiff, Morena Bochere, told the Art Newspaper that the museum failed to acknowledge the contributions of a woman, Jermaine Carby, who died in 2016 at the age of eighty-one, and her children, Willie and Jermaine Jr., in a show about a black family in Queens, New York.Bochere", "The next Biennial should open in the spring of 2021 and will offer a selection of works from the Scottish artist’s previous trips to Italy and Japan. The exhibition will exhibit the work of twenty artists from twenty countries, including five from the United States. “The show is taking place across two floors of the new museum, which is a collaboration between the Royal Institute of Scottish Art and the Scottish National Gallery, and is meant to showcase the work of a group of Southern Californians, a group of thirty-two artists from the United Kingdom, and a group of artists from the United States.”The Biennial is part of a larger plan to regenerate the Museum of Modern Art in Los Angeles, which was completed in 2016. The new museum will include a new collection of works by artists who have lived or worked in Los Angeles. The project, titled “Art in the City,” instituted a new system that aims to promote art in the city, via public programming and exhibitions. The program will feature ten artists each year, and will draw from a large collection of thirty-one works by the artist. The British artist Claudia Bick, who was made famous by her painted landscapes such as her “Sitting in", "The next Biennial should be held at the Museum of Modern Art in New York. The first would take place in 2021 and the last in 2023. According to Artnet, the opening of the second exhibition will be announced in 2022. An exhibition of works by the Beijing-based artist Ingrid Savitz, which will open at the Frankfurt Art Space on November 17, will begin in the United Kingdom in March of 2022. Savitz will be the first artist to be featured in the new biennial series.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to hire a number of new employees to help manage the rapidly changing collections and exhibition spaces at the museum. On March 3, the museum announced that it plans to hire twenty-one new employees. The news came in the wake of the announcement that MoMA has hired twenty-four new artists to its curatorial staff in the last twelve months.“We’ve been hiring for a while,” Katie Flynn, the director and CEO of MoMA, told the Art Newspaper. “This is the fourth year we’ve hired twenty-one people and we’ve always been on the lookout for ways to diversify our staff.", "The next Biennial should be held between September and December 2020, and will take place at the National Gallery in London until March 2021.  The exhibition will be organized as follows: Drawn in the Space of Time: “W.H. Auden”Will focus on the artist’s romanticization of scientific and technological advances. Will include interviews with Daniel H. Pink and L. Steinberg.  The exhibition will include biennial-format works by twenty-four artists, including Kirsten Byars, Mel Chin, Liza Lou, Yoshitomo Tsuda, Ming-Na Wen, José Lucia America, and Tomasz Klimczyk. The theme for the first Biennial is “Towards a Future of Sociality” and will be “The Theory of Community: ‘Towards a Scientific Vision.’ The second Biennial will be “A Future for Living: Sustainability and Human Dignity” and will be held in March 2021. The third Biennial will be “Natural Science and Social Reality:” and will be held", "The next Biennial should be held at the São Paulo Art Museum at the end of January 2020, and the first exhibition should open at the Museo da Museo do Povo, the city’s largest art museum, in March 2021.\n\n\nThe DeSoto Collection, a new contemporary art museum in Chicago, has appointed me as its next director and chief curator. I am the second African American to lead the museum, in addition to being the first in the history of the institution to be appointed director. The recent expansion of its collection, which is now considered among the most important contemporary art museums in America, has been centered around the theme “Purity of Form” and has been described by the critics as “entertaining, captivating, and captivating.” “I’ve been involved in the DeSoto Collection for over fifteen years, and have participated in the organizing and curating of shows there as creative director and curator,” said Mark deSoto. “The collection has always been about making a statement about art and about what comes after art. I’m excited to help the collection continue to be a beacon for artists and art lovers around Chicago and the city", "The next Biennial should be held in 2021.\n\n\nAn eighteen-foot-tall bronze sculpture made out of forty-one sculptural elements by American sculptor John Osterfeldt will be installed in the city’s City Hall in the near future. The work, titled City Hall, will be a permanent fixture in the institution’s complex, which has been transformed into a reception space and a public plaza since the museum’s renovation in 2018.“Osterfeldt’s work is a social statement about the city of Chicago, a work that is about the essence of the American idea,” said city council member Jimmy Van Bramer. “The work is a social statement about Chicago, a work about the essence of the American idea. I hope this work will be a catalyst for others to think and act in ways that reflect the spirit of Chicago.” While the work has been in the works for more than a decade, it was only recently installed that it reached the appropriate scale and was completed in time for the city’s annual Cinéma carnival.The sculpture was created with fifteen of Osterfeldt’s own photographs, which depict his life and work from a later", "The next Biennial should be held in 2022. The event’s next edition will take place at the legendary venue in the city of Florence; the organizing body will appoint a rotating group of artists to present their work at the venue. The next edition will be held in the Colosseum, the former seat of the Romanov dynasty in Constantinople, and will be held in both Rome and Florence. The artists chosen for the series will be announced in the coming weeks.\n\n\nThe Guggenheim Museum in New York has appointed Joshua Helmer as its new director and CEO. Helmer joins the institution from the Metropolitan Museum of Art, where he has served as deputy director for the past four years and has helmed the gallery for more than twenty years. Helmer will take the helm from Jeffrey Seller, who retired in February after twenty-six years at the helm of the museum.“After more than four years as a leader at the Guggenheim, Joshua is a man with the deep expertise and vision to deliver on our mission to present the most important art of our time,” said David Zwirner’s director Daniel H. Weiss. “We are thrilled to welcome him to the Guggenheim.", "The next Biennial should take place in 2021; the first in 2024. One of the reasons behind the delay is the ongoing humanitarian crisis caused by the ongoing conflict in Syria. The other reason is that the organizers are worried that the show will be overshadowed by the coronavirus. One of the reasons behind the show’s postponement is London’s Mayor Sadiq Kahn’s decision to open the city’s art galleries in both 2020 and 2021. Between 2020 and 2021, London’s galleries will be able to register up to 10,000 visitors, but the event will be closed to the general public. The show will have its next edition in 2022 at the same venue.In an interview with the New York Times, Kahn said: “I’m very pleased to contribute to the fight against this great and terrible disaster. I hope we make a difference by showing how powerful art can be.”\n\n\nThe British Museum in London has welcomed Cara-Anne Cosgrove and Paul Mpagi Sepuya, the co-founders of the Netherlands-based collective Nude Island, to its board of trustees. Together, the two artists will serve as co-", "The next Biennial should be held in 2021.The art of biennial is a global phenomenon that has been touched by the various spaces of the biennial, and by the history of the art and the period of its presentation. In the words of General Secretary Kalpana K. Kumar: “The biennial is a global phenomenon, and no one region or country can claim the monopoly of this history.”In a letter addressed to the members of the contemporary art biennial, Modi said: “As you have seen from the first Biennial, the Indian art and architecture biennial has been unruly, and in the past, its quality has been dubious and its presentation was uneven. I hope that today’s meeting will be a day when the vision of the future of art and architecture is realized.”\n\n\nThe London-based nonprofit organization Artadia has announced that it will no longer receive funding from the oil and gas company British Petroleum. Its board chair, Robert Dudley, issued a statement on behalf of the organization, which is the parent organization of Artadia and the London-based arts organization, the Tate. In his statement, Dudley said that the decision was made following a “preliminary review of the organization�", "The next Biennial should be held at the International Council on the Arts (ICCA) in Geneva in March 2021.According to Artnet, the event will feature work by seventy-four artists, including Bobb DeCarval and Urs von der Leyen; will be produced by the Union of Museums of Art and Science, the International Committee for Museums (ICOM), and the International Council for Architecture and Design; and will be organized in collaboration with the South African government.“With its enduring commitment to the arts, the South African government has a proud history of developing a strong and vibrant economy that provides a solid foundation for future success,” said Paul Mpagi Sepuya, South Africa’s minister of international cooperation and representation. “We look forward to welcoming the next generation of South African artists to South Africa and to working with them to develop new and more immersive experiences for the public.”\n\n\nThe Los Angeles County Museum of Art (LACMA) announced today that it is exploring a deal that would create an additional $150 million in funding for the arts through a combination of sales, donations, and other initiatives. The institution currently receives $200 million annually from the $2.2 trillion CARES Act", "The next Biennial should be held at least once every other year; the publisher has stated that it wants to work with a team of five to six artists to engage with the exhibition.  The campaign to raise funds for the upcoming event has been led by MoCA’s Ben Rotimi, who awarded $1.25 million to various charities this year, and Sarah Schroth, a curator at the Museum of Modern Art, who raised more than $3 million for Art Institute of Chicago. In a letter reviewed in Artforum last month, Rotimi wrote: “What we are doing is a critical step in helping to shift the cultural conversation about art from the status quo to a future that truly celebrates the power of art as a vehicle for social change.”The next edition of Art Basel Chicago will take place in November.\n\n\nThe Metropolitan Museum of Art has appointed Laura Mulgrew as its next president and CEO. Mulgrew comes to the institution from the New Museum, where she has served as deputy commissioner of development for three years. “Laura is a leader who has built a distinguished career in the Met’s development department, fostering a culture of innovation and creativity at both institutions,�", "The next Biennial should also look to contemporary art as a model for democratic socialism. “The biennial is a tool for the world to think about socialism, about how to live together in harmony with nature,” Yasmin said. “There are many things we can do to help reduce climate change, but we must not neglect our ecological responsibilities. . . . We must think about what is in the future and how we live together with the technologies of the future. I am very much looking forward to seeing what the public and the arts can bring to bear to try to reduce the climate impact of a large-scale ecological catastrophe.”\n\n\nThe University of California, Berkeley, has received a $10 million donation from the Richard and Helen DeVos Fund. Established in 1988 to increase the accessibility of academic education in California through arts and cultural activities, the fund was founded by two women, the former cochair of Amway, Betsy and David DeVos. During the fund’s twenty-two-year history, it has given $9.5 million to CalArts, $2.5 million to the College of the Arts, and $4 million to the Graduate Center.\n\n\nMilwaukee’s Walker Art", "The next Biennial should be in the spring of 2021. “The future of the Biennale is at stake,” Mr. Karaman said in a statement.The event, organized by the BMI and Centre Cochère in Paris, is considered an unofficial successor of the Biennale de Lyon, which was held in August, and was inaugurated by French artist Michel-Olivier René, who was commissioned to create a new monument dedicated to the memory of Henri Ghent, the first president of the Kingdom of Belgium. The new monument will be unveiled by the Belgian government in March 2021 and will feature the names of the participants in the exhibition.\n\n\nThe Queens Museum in New York City has chosen Artsadia Gallery & Design as the theme partner for its fourth edition, which will take place at the new 99,000-square-foot Queens Museum in July 2020’s July 31–August 2. Inaugurating the new museum is a new series of exhibitions, called “Feminine,” which will run on April 23–March 24, 2021. The exhibition will be organized as a “Laboratory for Modern Art” and will present work by a", "The next Biennial should be followed by the announcement of the selection of a new director, who will be responsible for the development and implementation of the programme.\n\n\nThe New Museum in New York has become the latest institution to announce that it is launching a $1 million fund for artistic projects following the devastating tragedy at the Black Rock Desert Museum in Nevada on Thursday, March 6. The announcement comes after a yearlong campaign to raise $1.5 million through a combination of crowdsourcing and institutional donations.The campaign, called #MuseumsFirst, brought together individuals and organizations from fifty states and the District of Columbia over the course of November. It culminated in the launch of the museum’s new online fundraising platform, which donors can use to make monthly pledges of $5. The new fund will also be dedicated to the artistic and cultural needs of Black Rock City, an urban conservation project in the desert located in the Black Rock Desert near the town of Kealake, Nevada.“I am thrilled that this initiative is finally reaching its goal of $1 million and that the museum is making a real difference in the world,” said Matthew Teitelbaum, head of the New Museum. “It is a compelling time to support artists and", "The next Biennial should be held soon, and I am hopeful that it will make a significant contribution to the revitalization of the city.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has received a donation of forty-four works from the artist-run collective the Minimalists\u0097a collection that spans more than two centuries. The works, which were donated by the American artist Genevieve Valentine, are among ten thousand catalogued works that were donated by Valentine\u0097who passed away on November 23, 2014\u0097in a Los Angeles hospital on December 6.The museum is currently digitizing and archiving the gift, which was donated by artist Paul Hirschhorn, and is working with David Geffen Fine Arts to organize a three-day retrospective of the works at the institution. The exhibition, titled “The Minimalists,” will open at the museum in 2024.The donation, which was made on behalf of the artist-run collective, was made in the form of a gift of work catalogued as part of their series “Timid,” which was first published in the October 1980 issue of Artforum. The series, which integrates paintings, sculptures, photographs", "The next Biennial should be staged sometime in the second half of the year, in the second half of 2019, and will be presented by the German, French, Italian, Korean, Chinese, and Japanese Art Museum in Tokyo. The museum will be housed in a former dairy building, and will inaugurate the exhibition with “The Power of the Dog,” an installation by Koike and her husband, Hans, with the Japanese artist Koki Shimizu, of the Institute of Contemporary Art, Tokyo, in January 2020.\n\n\nThe National Gallery of Art (NGA) in Washington, DC, has added Kate Bradley to its board of trustees. She will be the fourth woman to serve on the board, which is made up of members mostly appointed by the president and confirmed by the Senate, and will assume her responsibilities this fall.“Kate is a seasoned curator and organizer who has been an advocate and champion of the NGA’s curatorial team and collections for more than a decade,” said David K. Morrison, chair of the board of trustees. “Her work has been featured in exhibitions at the Stanford Art Museum and the Los Angeles County Museum of Art, and she was named a finalist for the Turner Prize", "The next Biennial should be held in 2020. The institution will consist of fifty-one wooden modules assigned by the university, each equipped with a different theme. The programs will be curated by the university’s curators, Arne Glimcher and Harald Nesper, and will be presented by professor Harald K. Metzger, director of the Beit-Bibir Institute for Contemporary Art, and the university’s curator of contemporary art, Raffaello Celentano.\n\n\nThe National Museums Scotland has announced a £8 million fund for the future of the National Galleries of Scotland, which comprises twenty-one of the country’s largest museums. The fund will be used to lessen the disruption and uncertainty caused by the construction of the conceptual mega-institution the Glamorgan Museum of Art in Glasgow. “The National Galleries of Scotland will be the locus of world-class contemporary art, challenging preconceptions and polarities, and creating new opportunities to strengthen the collection and exhibition experience in Scotland,” said National Museum director Alan Mackay. “The Glamorgan Museum of Art is an important chapter in the National Galleries of Scotland’s historic journey, an", "The next Biennial should consider how the UC, over the next twenty years, will change its educational programming to reflect the diverse influences and histories of its student body, while continuing to preserve the UC’s artistic legacy. Graduate students should also have more opportunities to engage with the UC’s art and academic campus through programs that will engage students in local communities. “This is an exciting time to be a UC graduate, and I am confident that we will achieve our goals of moving beyond the Ryer-Senschbert and creating a more collaborative and open University,” said Roberta Smith, the chair of the Board of Trustees and former president of the UC.The next edition of the biennial, “Between Time and Space: Sculpture and the UC Art of the Future,” will take up the themes and inspiration of the first two editions of the biennial in 2020 and 2021. “This is an exciting time to be an artist at the UC, and I am privileged to be a part of it,” said Malcolm Barber, co-winner of the 2013 Stanford Medal for Arts and the 2015 Maxwell Medal for Arts. Barber will collaborate with writers, curators, filmmakers, and writers", "The next Biennial should take place in 2020.” Herbert has also been involved in supporting the art of the Southern California area, including the San Fernando Valley, the San Gabriel Valley, and the Santa Barbara Valley, and has organized the publication of “Southern California: Art of Southern California” (2016) and “Southern California: Art of Southern California” (2017).\n\n\nMark Sicha, the director of the Philadelphia Museum of Art (PMA), has been appointed director of the Museum of Contemporary Art Philadelphia (MCA). Sicha arrives at the grassroots institution, which coordinates exhibitions and programming across four levels of government, from a group of curators who were nominated by the city’s mayor, Michael Nutter, to the city’s attorney general and the city council. The curators are demanding that the mayor fire Sicha and that the museum board fire Sicha. The board of trustees, led by Tony Zagun, has 18 days to find a new director.“I’ve known Mark for a number of years and have been impressed by his leadership qualities and his vision for the museum,” said board chairman Rick Shiner. “He has been", "The next Biennial should take place in 2021, with the first edition in the United States in 2023.\n\n\nThe Inchbald Museum in Denmark, known for its holdings of the artist-made Pallas Athelæ, has announced that it is reopening in 2021. The Danish-born, New York–based academic and artist, who is known for her clean, minimalist, and experimental art, has been a critic-at-large and curator of the Anthropocene for the Danish Museum, the New Museum, and the Museum of Modern Art. The institution, which is located in Copenhagen, is currently working on a new project about human activity and the Anthropocene.“The Anthropocene is one of the most important issues of our time,” said Inchbald director Hanna Østbye. “We have always tried to have a new exhibition each year at the Inchbald, and we continue to try to do so, and we are more, more and more convinced that the next edition of the Inchbald Biennial will be a landmark event. The exhibition will be organized in an organic way, as if the exhibition had never been opened. Inchbald will now be able to celebrate the work", "The next Biennial should be held in the autumn of 2019. \n\n\nThe Dakotas’ office of the American artist Tunga, whose book Tunga and the Birth of Modern Art (2015), a massive, nearly four-hundred-thousand-work collection, is currently on display in the city of Dakotas, the southernmost state in North America, as part of the Dakotas Biennial, which is supported by the American Alliance of Museums and was organized by the New York–based artist, curator, and educator Jody Harrison.Dakotas, which borders Canada and North and South America, has a rich and diverse cultural heritage. It was the birthplace of the Dakotas Prekala tribe, whose ancient capital is now a UNESCO World Heritage site, and an important trading hub for North American industry. The city also boasts of a bronze-age Moultonite monument, which was dedicated to the Dakotas, and a Carnotite monument, which honors the Dakotas' chief, John Halsey. The city’s downtown skyline is made up of tree trunks and the city’s dense urban fabric, which includes the city’", "The next Biennial should start in November 2020 and run through March 2021. Los Angeles County is also planning to hold its next edition, next May, at the Museum of Contemporary Art (MCA) in Los Angeles. The project is a continuation of the Los Angeles–based artist-run nonprofit the Artist-in-Residence, whose annual theme is “Permanent Revolution.” The Los Angeles City Councilman Mitch Englander, who represents the district where the 2020 event will be held, announced his intent to join the effort in a statement on Monday. According to the councilman, the city’s streets are not designed for mass transit and he wants to see more of an infusion of fresh ideas and artistic energy. “This is a moment of tremendous change and I want the city to be a catalyst for change,” Englander said. “I’m excited to collaborate with artists and arts organizations to build on the themes of your show, and to continue to create for the future.”Previously, the city has partnered with the Los Angeles County Museum of Art and the Pasadena Museum of Art in California to launch two new programs: “Away Days” and “Away Nights", "The next Biennial should take place in the autumn of 2021.  \n\n\nThe Museum of Fine Arts (MA) in New York has received $50 million from the Rockefeller Brothers Fund in support of its expansion into a new academic space to serve students from underrecognized rural areas and communities.MA’s partnership with the Charles and Lucille King Family Charitable Foundation extends its commitment to public schools and community-based organizations. The funds will increase the museum’s total endowment by more than $150 million. The King Family Foundation, which has given the museum $50 million since it began hosting more than two hundred students from its K-12 schools, will also receive $50 million in support of its expansion into a new building, the King School of Art, to be completed in the fall of 2020.MA made the announcement on Friday, September 7, following a presentation of the museum’s new tenants at the J. Paul Getty Museum in Los Angeles. The university’s new home for the Getty’s collection of photographs is slated to open on the Getty’s campus in 2021. The building will contain two galleries, a studio, and a performance space for the Getty’s annual biennial “Beyond the", "The next Biennial should be in 2020, and a Blacklisted exhibition should open in 2021. The new branch of the museum will consist of two locations, one of which will be on the Nassau Canal. The other will be a museum dedicated to the “African diaspora,” said Dora. “The Nairobi Museum of Art, as a whole, has done a great job of representing the African diaspora, but it has not done so with the utmost sensitivity. I hope that this new initiative will give the museum a new, inclusive, and much needed voice.”The institution will also host a number of exhibitions that examine issues relevant to contemporary African art. Among the exhibitions slated for the 2020 edition are “The Bantu and the Bantu: The Bantu and the Bantu” (2019) and “Nigeria, 1960–1980” (2019). The museum will also present an exhibition dedicated to artists such as Vivian Banda and Elton John in 2021. “As an institution that has been historically impacted by the diaspora, we are deeply honored to be able to continue showcasing this work with these exceptional artists and to", "The next Biennial should have been held in June 2019, but was postponed due to the Covid-19 pandemic. A further representative was scheduled to be announced later this year, but was canceled. Artforum has reached out to Warner Bros. for a statement.\n\n\nThe museum in Chicago that was forced to move a work by the late Canadian artist Frank Lloyd Wright in the 1980s has announced that it will reopen the work—which is housed in a temporary exhibition at the museum—by the late artist’s request. The exhibition is currently on view until February 21.According to the Art Newspaper, the art historian and curatorial assistant, who worked with Wright on several projects, including a series entitled “The Art of Living,” and “Spruce and Birch” (1933–1934), will be redesigned by the artist’s son, Stephen, who previously designed the venue. The steps of the work will be reconfigured to accommodate the museum’s 600-seat theater. The work, titled “Frank Lloyd Wright: The Art of Living,” can be seen in the exhibition “Frank Lloyd Wright: ‘Living in the Art,’” at the Y", "The next Biennial should take place in 2020. “The Manor Museum is committed to supporting the show as a platform for our collection and for the exhibition’s guests to experience the work of a wide range of artists,” museum director Elizabeth Gray told the New York Times. “There are several themes that we are looking forward to exploring in the exhibition, and we will continue to do so in a diverse range of artists through the exhibition to give our guests a wide range of options.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of works by individual artists in its New York City Fair, which runs from April 7 to April 10. The exhibition will showcase work by forty artists, including Peter Andre, Paul Gauguin, Albert Ayllu, Tarkona Ajayi, and Eileen Atkins, and will take place in the city’s Central Park.“This year’s fair is a milestone for us,” commissioner Daniel H. Weiss said. “The following themes and artworks were selected for inclusion in the exhibition, and we are very excited to showcase these works at this year’s fair.”The fair�", "The next Biennial should take place in two phases: once a year from September to December and once a year from September to March.  A conceptual plan for the first phase of the exhibition was published by the museum in the June 2018 issue of the Bulletin. The description of the second phase of the exhibition simultaneously explores the history of the show, which is based on the work of six contemporary artists. A selection of the show will be presented in a special exhibition at the Museum of Modern Art in February 2020; the other works on view at the exhibition will then merge into the calendar of the museum, which will also feature the works of four other artists in the 2020 edition.The museum is also planning to erect a monument to the late artist Adrian Piper, who was best known for his sculptures that examine the roles of the artist and the artist-versus-the-environment relationship. The work, which is on view in the exhibition “Adrian Piper: Leviathan of Materials” and is scheduled to open in the spring of 2022, will also feature on the 2020 edition of the Biennale de Lyon.\n\n\nThe National Geographic Society’s new flagship science and technology initiative, the Science and Technology Council, has appointed", "The next Biennial should be held in 2022. It will take place at the Musée d’Art Contemporain in Paris and will be held in conjunction with the annual Biennial des Hautes Études d’Alémes, which will be held in Zürich from March 22–March 25.The question of the future of art has been a source of fascination for many artists, and a constant source of contention between the museums where the works reside or are archived. The Paris-based, New York–based collective Open University has been pushing for the museum’s collection to be moved to an educational institution in the city. In a letter dated March 6, 2012, Open University wrote: “It is a desire which has been the source of great excitement for years, at the same time a source of great regret for many museums. The future of our collection is at stake.”Over the years, the museum’s holdings have changed so much that the current exhibition, “Institutions,” was originally conceived as a multi-level presentation of works in the museum. However, in 2010, the museum reopened with a presentation of works by the British Indian photographer R.M. Khattar", "The next Biennial should take place in 2021.\n\n\nMatthew Broderick, the curator of contemporary art at the Brooklyn Museum, New York, has been appointed the next director of the Museum of Modern Art (MoMA). He succeeds Mira Goldin, who departed in the summer of 2021 to head the New Museum, and will assume his responsibilities in January.“Matthew is a gifted curator, a scholar of modernism and modern art, and an advocate for the humanities and the social sciences,” said museum director Thaddaeus Kreps. “His history of research and scholarship in the field of art history and his enthusiastic, engaged, and compelling curatorial style will be essential to our ongoing efforts to support up-and-coming artists and to continue our work as a great museum.”Commenting on his appointment, Broderick said: “The most complex, difficult, and sensitive issue in contemporary art is to be found in the United States, not least because of the ongoing social and political upheavals. In order to address this, MoMA has developed an exceptional and valuable collection of art from the twentieth century. The selection of the forty-ninth biennial and its implications for our current moment are truly", "The next Biennial should be held at the Victoria and Albert Museum, London and will be staged at locations across the city of London. The theme “HIP: Myths, Realities, and Portraits,” a direct response to the contemporary implications of the contemporary, will explore the concept of “hippity hoppity hoppity.” The event will also feature performances, lectures, and other events that address various topics of the day like the environment, the body, and the body politic.“What we are creating here is a path towards deeper understanding and a more inclusive conception of art and social practice,” said Chris Fusi, chair of the exhibition’s curatorial team. The exhibition version of the show will be an amalgamation of works that were selected for the exhibition by artists, curators, and curators’ groups. The curators’ groups are a group comprising Alphonse Fletcher, Carolyn Hare, Ahmed Al-Shami, Rayyane Al-Hashemi, Paul Mpagi Sepuya and Moaz Abou-Rahme, and Samira Agha.The biennial will have two parts, a celebration of ninety-four years of artistic collaboration", "The next Biennial should be set up and run by the Local Government Association’s local body, the Sheffield Local Government Association (SLEGA), in cooperation with the Sheffield Art Gallery, in the city of Sheffield, on the city’s North Campus. Julia Royce, a trustee of the Sheffield Art Gallery, said: “We are delighted to be working with the SLEGA to create an exhibition reflecting the diversity of Sheffield’s communities and to engage with local artists and audiences.”\n\n\nThe Whitney Museum of American Art in New York has received $9 million from the Endowment for Contemporary Art (CECAM) in support of the acquisition of works made by Southeast Asian artists from the M. R. Lamar Collection in Philadelphia.The donation includes the works of Yuh Ka Hee (1903–1986), Yee Hoa Yin (1907–1991), and Chang Yee (1906–1986), among others. The works were selected by CECAM cofounder and chair of the board J. Douglas Davis, a former chairman of the Whitney Museum, and his daughter, J.C. Davis, from a pool of ten artists.“These works will open", "The next Biennial should focus on a reinterpretation of the history of Paris, and what the city could become, in the twenty-first century.”The statement was made at a time when the exhibition was in danger of being canceled amid the global health crisis. The exhibition, titled Paris: A Contemporary History, was scheduled for March 20–March 22 and was supposed to draw around eighty thousand visitors. Representatives of the museums that would host the exhibition were considering whether to pull their events from the fair and were at a loss as to how they should proceed.“For me, the most important thing is the physical spaces,” said Audrey Neuvirth, the managing director of the Venice Biennale and the chair of the institution’s board of directors. “We mustn’t allow our imagination to be distracted by the past.”While Neuvirth was confident that the exhibition would open as scheduled, she did not rule out the possibility that the exhibition would be canceled as the pandemic intensifies. “I don’t want to predict what will happen next, but I can say that it will be a complex situation,” she said. “We must think of all possible scenarios carefully", "The next Biennial should be on August 23 and will include a selection of works that are currently on display, as well as works that were on display at the 1999 edition. \n\n\nOver the last two decades, the New York City Department of Cultural Affairs (DCLA) has funded numerous exhibitions that examine the history of African art, from “The Spirit of Black Power” (2005) and “The Black Immigrant Experience” (2007) to “The African artist’s journey to New York: Early twentieth century to contemporary” (2017). The museum-based initiatives have helped raise public awareness of the city’s African diaspora, which has been historically under-represented in the NYC art world, and have also given rise to new scholarship on the migration experience.The newly formed exhibition initiative, called “African Art in the City of New York: The DCLA” (DCLA 2020), is being organized in response to the DCLA’s $4 million request for $2.5 million for the 2020 fiscal year. The fund is being divided among a number of partners, including the DCLA, the Museum of Modern Art, and the Museum of Modern Art. Commenting on", "The next Biennial should be held in 2021.\n\n\nThe Metropolitan Museum of Art in New York is planning to increase the size of its collection by a third, bringing the total number of works in the museum up to twenty-seven, by 2026. The expansion, which was first announced in 2014, follows the Met’s expansion of its collections. The Met’s collection now consists of twenty-nine galleries, expanded exhibitions, and a collection of more than 400 rare works.The museum previously announced plans to add twenty-three works in 2023 and to add thirteen works in 2024, and to begin work on a redesign of the museum’s building with the goal of increasing the museum’s collection to thirty-five works in the new three-building configuration. The reopening of the museum in 2021 has been tentatively scheduled since 2020.“The Met has come a long way since we opened in 1993, and the collection has expanded enormously during that time,” museum director Daniel H. Weiss said. “It’s a remarkable achievement to reach the landmark fifty-five-thousandth anniversary of the Met, and to grow the collection by more than eight hundred works in the next three years. The expansion", "The next Biennial should begin on Monday, February 15, 2020 and conclude with the exhibition of the work of artist Bertrand Goldberg, which would be the last work by the artist to be exhibited by the Museum of Modern Art in New York. Following a tour of the Goldberg–designed exhibition space, the artist will be allowed to return to New York, where he lives and works, and will remain there until the end of March. The specific dates for the exhibition of Goldberg’s twentieth work, The Moth, and the biennial of sculptor Marc Chagall will be announced soon.\n\n\nThe Norwegian firm Larsen + Dørup (L&D) has announced that it is planning to open two new museums in Oslo by the end of 2020. The new institutions will be located on Oslo’s third-tier pedestrian street, Pedersen, and will be jointly funded by the city of Oslo and the private L&D Foundation.“The partnership with L&D means that the Museum of Modern Art will be able to present more works by and about contemporary artists, and more important, more relevant and important exhibitions,” said city councilor Olafur Eliassen. “It also means that the next generation", "The next Biennial should be set up in 2020. You can find more information about the upcoming event here.   Artnews has a great interview with the artist of the year, Cara Fogarty.  In the interview, she discusses how she was inspired to create works such as the Diana Rossetti–designed The B-Side, which was on view in the exhibition “The New World,” and how the work was created as part of a project to make more interdisciplinary art.  She also talks about how she was challenged by her identity as a feminist artist and how she found her own identity in the work. Fogho writes: Fogarty, whose practice spans performance, performance art, performance cinema, and performance books, is one of the earliest female artists to use film to explore topics of gender and the body. Her work incorporates a not-too-distant future cinema-style, where gender and the body are and remain separate, into the contemporary. Her works are collected in the artist-in-residence program at the New York Academy of Arts and the artist-in-residence exhibition at the Old Vineyard in Bristol. “I", "The next Biennial should be held in 2020. The next edition will feature an exhibition of the work of sixty-eight Canadian artists.\n\n\nThe National Gallery of Canada is planning to spend $1.3 million on a host of renovations over the next twelve months, with a specific focus on revamping its exhibition space in Ottawa. The renovations, which will include the installation of more than three hundred new works, will include the restoration of the building’s historic stone facade, the renovation of the gallery, and the renovation of the National Gallery’s offices.The renovations were first announced in 2018, but came under fire for a lack of progress and cost overruns. On July 7, the National Gallery of Canada revealed that it had spent $1.2 million during the previous twelve months, but only $900,000 of that was in the form of work. The renovations are part of a programme made to improve the museum’s image and has resulted in a number of renovations of the gallery’s existing buildings and the renovation of several new galleries. The renovations will also include the conservation of the gallery’s holdings, the scanning of works by artists such as René Magritte and Pierre-Auguste Renoir, and", "The next Biennial should be placed in the spring of 2020. “Nicola’s ideas have always been to bring art and the people to life in a way that is captivating and that is a challenge,” said Ernst. “It is a challenge, but at the same time it brings art to life. I think that is the core of what makes the Biennale work.”\n\n\nKathrin Becker, the German cultural minister of cultural affairs and transport, has announced that the state of Baden-Baden (BBA), the home of the state-owned Berlin Olympia theater, will receive $12 million from a $55 million German aid package, and will inaugurate a multi-million-dollar arts center in the city in 2020. The center will be located in the former barracks site of König-Bau, the former headquarters of the German Army, and will offer exhibition space and a concert venue. It will also provide employment opportunities to around 1,500 people and will have an amphitheater and an auditorium, which will be connected by a 1,600-seat theater.“The BBA will be a very special institution,” said state minister Joachim", "The next Biennial should be on February 21. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Carolyn Cammock as its next director. Cammock comes to the institution from the Museum of Contemporary Art (MoCA), where she previously served as interim director for public programs. She succeeds David Kordansky who departed to become the director of the Museum of Contemporary Art, Los Angeles (MCA LA).“Carlene took an extra month to resign from her post in order to take a new position at the institution,” MoCA director James Tanenhaus said in a statement. “We are grateful for her service to the institution and to having her on staff. We look forward to her continuing to shape and shape the future of MoCA and to working with our talented and dedicated team.”During her tenure at the museum, Cammock helped develop the institute’s collection vision, launched the museum’s public programming initiatives, and organized numerous exhibitions, including “Chris Rock: The Biennial” (2013), “Behind the Scenes: MoCA’s Artistic Legacy” (2014), “The Late, Great Frank Gehry: A Biennial of", "The next Biennial should by August 2020. The Art Newspaper reports that the full list of participating artists is as follows:Pérez del Val, Spain, June 2019Bécadet, France, June 2019Eddy Adams, New Zealand, June 2019Zoe Kazan, Arts, Art, and Design, Australia, June 2019Grace Smith, Art, Art, and Design, Australia, June 2019Jorge Sánchez-Tremblay, Art, Art, and Design, July 2019Nicoletta Bagnall, Art, Art, and Design, Australia, June 2019Douglas Coupland, Art and Design, Australia, June 2019Kaitlyn McLean,“Fear and Desire,” Australia, June 2019Robert Mapplethorpe, Art, Art, and Design, Australia, June 2019Steven Levitt, New York, June 2019Brian Mangan, Art, Art, and Design, Australia, June 2019Ana Villa, Art, Art, and Design, Paris, June 2019Benedict Arnold, Art, Art, and Design, Australia, June 2019\n\nThe Seattle Art Museum (SAM)", "The next Biennial should open in 2021.\n\n\nThe New York Film Festival has announced the winners of its 2019 edition, which will now begin the process of awarding $25,000 grants to artists. The biennial, titled Biennale NYC (BNY), was formed in honor of the twenty-second anniversary of the festival, which was first held at Lincoln Center in New York in February 2019. The 2019 projects include William Pope-Williams’s Impulses (2018), which was inspired by a trip to Morocco; Jorge Ribas’s The Princess and the Traveling Nun (2019), which also pays homage to the film The Princess and the Traveling Nun; and Michael Caine’s The Other Woman (2019), which is also a tribute to Caine’s own wife, the American actress Meryl Streep.The 2019 edition of the festival will take place at Lincoln Center from March 8–March 12, 2020. The theme this year was Beauty and the Art, with the caveat that the work be a work of art or dance. The 2019 winner of the George Polk Award, William Pope-Williams, was selected for his performance The Impulses, which was", "The next Biennial should take place at the International Biennial in Vienna next year. The exhibition will be organized as follows:The new title of the exhibition will be “• The Rubble of Art: The Creation of Modernity” and will feature works from the collection of the Austrian state museum, the Kunsthalle Basel, and the Kunsthalle Bern, which will be hosting the exhibition. The exhibition will be curated by Kjetil Gästek, who is currently an exhibition assistant at the museum in collaboration with Hans Miemann, and will be inaugurated by Gerald Black, director of the Kunsthalle Bern.  The exhibition will be inaugurated by the artist John Prescott, who will present his first exhibition at the museum in its eighty-five-year history, “The Rubble of Art” in October. The exhibition will also include three new works by the curators of the first biennial. Commenting on the installation, the Institute of Contemporary Art Vienna (IACV) said that the exhibition “marks a new stage in the history of the institution, which has been marked by a great number of initiatives over the last twenty years.”\n\n\nThe", "The next Biennial should be held in 2020. In the meantime, the museum will continue to be open with regular programming. It is currently planning to open a new, larger building in the museum’s main building in 2021. The museum will announce its first exhibitions in the new building in 2022. The new building will also boast an exhibition space for the exhibition Citizenship in Transition, which will explore the exhibition-retailer as a symbol of modernity and a radical rethinking of identity. Sydney’s Museum of Contemporary Art (MCA), which is currently planning to move to the Central Library from its current location in the city, has announced that the museum will reopen to the public in 2022.MCA president and CEO Michael Dell said: “The future of MCA lies with you, with you, and with us. We are open for you, we are open for everyone, and we are open for everyone’s family and friends. The new MCA will reflect this ethos for the next decade and beyond. We will continue to be an institution that celebrates and responds to humanity’s universal spirit and the future of our city and region will be decided by you and us.�", "The next Biennial should be held in 2020, and the pavilion should open in 2021.  The Biennial of Perfumes will be held in São Paulo, Brazil, and the third edition of the Biennial of Modern Art will be held in Beijing, China, in 2022. The first edition of the Biennial of Artists will be held in São Paulo, Brazil, in 2019. The Biennial of Youth will be held in São Paulo, Brazil, in 2016, and the second edition of the Biennial of Fashion will be held in Leipzig, Germany, in 2017. The biennial of fashion will also be held in Cologne, Germany, in 2018. The Giulia di Mauro Collection, which will include work by the Italian fashion designer, has announced that it will stage the biennial of art in 2020. The second edition of the exhibition will be held at Milan’s Museo d’Arte Contemporanea di São Paulo in 2021. The 2018 edition of the Prix de France in Rome, which was abruptly canceled because of the Covid-19 pandemic, was rescheduled for May 26–May 31. The sixth edition of the Costume Institute Galerie in New", "The next Biennial should be held in 2021, and the second in 2022. The 2020 event, titled “The Films of Goya,” featured the work of twenty-three artists, including Carlo Mollino, Riccardo Tresca, and Marcel Prouvé. The 2019 event, titled “Horizons: A Life and Art of Pablo,” was held at the Anthropology Museum in Berlin.\n\n\nThe Albuquerque Museum of Art (AMAA) has received a major gift from the creators of Paddle8, a free online art platform that was founded in 2007 by Darren and Charlotte Paddle in an effort to bring exhibitions to Albuquerque. Less than a year later, the Paddle8 team announced a $50,000 donation to the museum, which will use the funds to develop an exhibition centered around the life and works of the artist Clement Greenberg.“We are thrilled to receive this gift from the Paddle8 Foundation as we continue to grow our collection of paintings, drawings, and prints by the Paddle8s,” said Charlotte Paddle. “This gift also marks the beginning of making history as the Paddle8 Museum of Art becomes the first institution in", "The next Biennial should take place in 2021, with the third edition to be staged in 2022.\n\n\nThe Independent will not be supporting the British Film Institute (BFI) with a huge grant until 2020. The BFI has announced that it will not be reopening until at least November 2020, citing the uncertainty as to when the UK will leave the European Union as the reason.The decision has understandably reignited concerns about the future of the BFI, which is one of the largest arts institutions in the UK and receives around $6 billion a year in funding from London’s Tate, the National Lottery Heritage Fund, and a number of other sources. However, the announcement has prompted concerns about whether the BFI will be able to pay its bills through the date set by the UK’s withdrawal.One arts patron’s letter to the BFI reads: “While the decision to cancel the 2020–19 BFI BFI Atlantic runs counter to everything I believe is best for the arts, I am pleased to accept that the future of the BFI and arts, and especially of BFI, is with us. I am confident that with appropriate consultation we will be able to secure a smooth and orderly reopening of the BFI", "The next Biennial should be in 2021. “We are planning to create a new platform for contemporary art with a new mission, a new vision, and a new approach,” said Frauke Petzold, the director of the Free Museum Münster. The project is part of a larger campaign to support independent cultural institutions. Since the fall of Berlin’s former state government in 2016, a total of thirty-six artists, artists' studios, arts institutions, and Christian Memorial Church have agreed to donate their art to the battle against the coronavirus, which has infected more than 3,700 people in Germany as of Monday morning. The campaign, which was overseen by the two German museums, the Eisenheim Museum and the Staatliche Kunstverein, was launched by the two sides as a way of settling longstanding conflicts. However, the negotiations were reportedly frozen by the other’s government until March 19, more than three weeks after the first confirmed cases of the virus were reported. According to the New York Times, the dispute behind the scenes may have led to the move of the festival, which was originally slated to take place in September.The Art Newspaper reports that representatives of the two Berlin institutions said", "The next Biennial should be held in 2021. The proposed dates for the exhibition have also been criticized by some local authorities, who are concerned about the possibility of groundswell protests that could disrupt the exhibition.  Earlier this week, a notice published by the Art Newspaper claiming an anti-Muslim rally in the city of Al-Mansur, in the country’s north-east, was suspended by the organizers of the event. The notice said that the event would be rescheduled for May 22.  The shutdown of the exhibition coincides with the Covid-19 pandemic, and has been called a “precedent for the rest of the world.” Many are concerned that the closure will worsen already-severe social divisions in the country, which has one of the highest rates of Covid-19-related hospital admissions in the world.\n\n\nThe Museum of Fine Arts (MoFA) in Atlanta has invited a group of artists—including Sean Parker, Emanuele Cerciello, and Maria Oquendo—to participate in an exhibition and workshop on the themes of architecture and design at the institution in the spring 2021. The three-day event, titled “", "The next Biennial should be held in 2021.\n\n\nThe Chinese Ministry of Culture and the Beijing Art Museum have partnered up with the Museum of Fine Arts (MoFA) in Beijing to organize the opening of a new exhibition of works by twenty-six artists from China’s eastern region, Xinjiang. The exhibition, titled “Xinjiang: China’s Contemporary Artists,” will open on April 21 and will be on view until May 21.“The exhibition is part of the ministry’s plan to strengthen cultural exchange between China and the Republic of China,” said an MoFA spokesperson. The ministry also created new openings for museums to engage with visitors from Xinjiang through arts and cultural sites such as the MCA.The collaboration between the two institutions was announced in an April 25 letter from the ministry to the Chinese ambassador to the United Arab Emirates, Amina Haider. The letter noted that the museum will receive 1,500 artworks from the region in 2020. The artworks will be presented in two separate exhibitions. The first, “The Art of Collaboration” will be staged at the MCA in 2022. The second, “Xinjiang: China’s Contemporary Artists", "The next Biennial should be held at least once every other year. To register, visit http://www.nea-uni-kulten_de.de/index.php?option=com_cn&task=approach&id=5&Itemid=10&lang=en.  The 2019 edition will be hosted by the German arts organization Steidl, which is currently undergoing a massive reopening project in the city of Mannheim. The theme for this year’s edition, “Painters and the Arts,” will be curated by Harald Szeemann, who will be joined by artist Thomas Åkesson from Germany’s Staatliche Kunstverein Berlin. The other theme, “Up, Up, Up,” will be performed by the city of Mannheim.\n\n\nThe British Museum in London announced today that it will temporarily close to the public on March 19, following days of peaceful protests against the coronavirus. The institution announced the move in a statement issued by director Maria Balshaw: “We are not at this moment able to imagine a more urgent need than now for everyone to come together to share stories,", "The next Biennial should take place in 2022. The 2019 show, titled The Death of Science Fiction, explored the Western canon from a “scientific point of view,” asking what kind of future worlds we might create. “We chose to use novels as an example because that is where most of the work in Biennial de Lyon comes from,” Arturo Britten, the de l'Art avec l'Art (the artist’s collective), told The Atlantic in an interview last year. “We wanted the exhibition to be a kind of mirror reflecting the times we live in.”The exhibition will be held at the Museo de Arte Contemporáneo in Milan, Italy.\n\n\nThe Art Newspaper reports that the Pritzker Prize for literature, which comes with a $5 million cash prize, will be awarded to American novelist Huebner and the German artist Wolfgang Zumthor. The awards ceremony will take place at the Pritzker Center in Venice on Sunday, January 28, at 7 PM. The ceremony will mark the fifth edition of the Pritzker Prize, which was established in 1996 by the two founders of the publishing company HarperCollins Publishers,", "The next Biennial should take place in 2021. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Joshua Helmer as its next director. Helmer comes to the institution from the Massachusetts Museum of Contemporary Art (MMCA), where he most recently served as director of its modern and contemporary art galleries. Helmer succeeds Elizabeth A. Long and will assume his responsibilities on January 10, 2021.Born in Chicago in 1975, Helmer grew up in the Boston area. He graduated from the Boston College School of Art in 2000 and then enrolled in Northeastern University, where he studied under Gerald Sexton (1999–2001). Helmer joined the gallery at the Museum of Fine Arts in 2004 and has held the position of director of the museum since 2013. Helmer is also the founder of his own gallery, Helmer + Sexton, where he has presented works by artists such as Edward Hopper, Jean-Michel Basquiat, and Sean Kelly. Helmer has supported the museum’s curatorial team through a number of initiatives, including moving a work by Isaac Basquiat from its collection to its permanent collection in 2013, and helping to organize the exhibition “Early Modern Art,” which closed on March", "The next Biennial should be held at the International Biennial Stuttgart in October 2021.  Under the theme 'In the Name of the People, We Worship', they will include works by artists such as Kazuko Hasegawa, Harald Szeemann, and Marta Dallal. The exhibition will feature works by more than seventy artists, including Young Lee, Yuki Kimura, and Koyuki Kondo. Titled The Forbidden City, The Contagious City, and The Changeable City, the event will be an extension of the initiative “Return of the Contagious City,” which was launched by the city of Kassel in collaboration with the University of Kassel and the Kassel Biennial and will run for twelve weeks. The event will mark the first time that Kassel has hosted an exhibition devoted to the theme of the contagion in its entirety. The exhibition will take place in the former Tammeskekischer Kunsthalle, the former University building, and will include works by Kassel artists, including Kristian Hoffmann, Joachim Kamm, and Constantin Mises.“It"]