["The next Biennial should include projects by Bénédicte Savoy and Østgjørden. The duo will work together again in 2018 for a second exhibition at the new museum in Copenhagen.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is reopening, following a $5 billion expansion, with three exhibitions this fall. The first, “The Birth of a Nation: The American Experience,” will open on October 19; the second, “The Great Gatsby” will open on October 23 and the third, “The Assassination of Jesse James Earl King: Race, Terror, and Justice,” will open on October 28.The expansion was part of a $5.5 billion plan for the museum, which was announced in April. The plan also includes the construction of a new building, the renovation of the museum, the construction of a new wing of the museum, the expansion of the contemporary art museum in the Bronx, and the acquisition of more than four hundred works, including Damien Hirst’s The Ostracon Project, Louis Vuitton’s New York City, and Alexander Calder’s The Birth of a", "The next Biennial should be held in 2020. Art historian Anne-Marie Blunden, who is known for her role of curator at the Neue Galerie in Berlin, said: “We have the possibility to create new territories for art and the former ones, in the manifestos of the biennials, as well as in the new areas of art created on the new campus.”\n\n\nThe nineteenth edition of the Berlin Biennials—an annual international platform that aims to present the city’s art in a meaningful and interactive way—is now live on YouTube. Titled Berlin: The Fifth Element, and filmed in a location in the former Tempelhof Palace in Berlin, the program will air on June 28.Controversially, the thirty-six-episode series, which follows artist-activists and their experiments with various themes, led by Wolfgang Mitte (Jasper Johns), which centers around the concept of the “power of the visual,” was commissioned by the German federal state of North Rhine-Westphalia and was produced under the direction of the state-owned broadcaster ARD.The Berlin Biennials was originally organized by the German artist-run cultural space GESP Gmb", "The next Biennial should take place in 2020. “We have been following the project closely,” said Thierry. “It is a project of a lifetime, worthy of a lifetime. The following year we will carry out a project of the same scale and of a similar style. But we will do it in a different way. The project of an exhibition in an airport is a project of an exhibition in a city. A museum is an institution of the city, in a city.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is preparing to welcome visitors back to the museum in 2020 following a $450 million expansion, which aims to double the museum’s footprint and increase the museum’s exhibition capacity by 15 percent. The project, which is part of the $1.5 trillion regional plan, was completed as part of a $300 million gift from billionaire industrialist Don Larsen.According to its current schedule, the museum will open on January 21, 2020 and last through March 25, 2020. Its expansion will include the construction of a new courtyard, a new auditorium, and three new galleries. The extension also aims to bring the museum’s collection closer to its downtown", "The next Biennial should be in 2020. \n\nIn an email sent to team members on Friday, the organizers of the upcoming edition of the Biennale of Melbourne wrote that it is “working hard to resolve the implications of the recent events on the project. We will have more to say when we have more time to think about it.” They added that the invitation to leave the premises on March 14 had not been rescinded and that the answer to the question of how the biennial would be organized had been “fully engaged.”\n\n\nThe National Museum of Fine Arts (NMFA) in Washington, DC, will no longer send visitors to the museum for the purpose of reopening one of its buildings following its $500 million renovations in 2021, the New York Times reports. The museum had been considering the possibility of reopening since 2018, when it announced that it would spend $1.1 billion to remake the building and extend the museum’s footprint. Since then, construction workers had begun reopening the museum, which has been closed since January, and the government had allocated $400 million to the project.However, in January 2019, the museum informed the public that the phase of the renovation that would take place in", "The next Biennial should take place in the spring of 2021. The museum will also be reopening in the fall of 2021.\n\n\nA group of artists including Juan Carlos López Rivera, Julia Alemany, Yayoi Kusama, and Koki Tanaka have created an open letter to the Spanish government urging it to impose more stringent austerity measures on the country’s hospitals.The letter, written by Pablo Álvarez M. Pérez, Lutz B. Roldan, and Pedro Reyes, is addressed to the minister of health and a number of officials, including the prime minister, María Bernat, and the health minister, Julián Castro. “While we welcome the call for a more flexible and targeted health policy, we question the government’s commitment to supporting the health of the population and to addressing the acute crisis that this puts at the center of our society,” reads the letter, which was published by the Palacio de Cultura Público de Barcelona on Tuesday.The letter challenges the austerity measures being pushed by Madrid, which are supposed to be accompanied by the gradual phasing out of the country’s budget hospital, the state-run Instituto de Tr", "The next Biennial should be held at St Peter’s in London in 2021.\n\n\nThe Swiss Museum Stedelijk Museum (Stedelijk Museum) in Amsterdam has announced that it is opening a dedicated space for contemporary art in the city. The institution will invite artists to the city to create works for its digital-only exhibition, “NIRIN,” and will present the first solo exhibitions of work by the students of the Bauhaus in the city in 2020 and 2021.The institution has also expanded the contemporary art scene in the city by launching a new contemporary art space called the Cinéma in the Rijks, where it will host the first exhibition of work by the students of the contemporary art school in the city. The Rijks will be the first schools to host the exhibition.“We are so delighted to open a new contemporary art space in Amsterdam that will draw both visitors and colleagues in the best way possible,” said Bertjan van den Bergh, director of the Stedelijk Museum. The museum will also include a new café, a new museum shop, and a library.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has launched a cultural capital for", "The next Biennial should be held sometime in 2024. “Art is about power, about the social and political relations that are at the core of the history of modern art,” said João Martins, president of the Biennale da Madeira. “The future of art is at stake. We have the opportunity to create an ethical new relationship between art and the biennial.”A list of twenty-five artists who were selected for this year’s competition is as follows:Alessandro Bicchier, ItalyMiles de Castro, SpainMiguel Angel Guimarães, BrazilMarianne Bichler, AustriaVincent van Gogh, FranceJulie Sherman-Lemon, USAAdriana Varejão, BrazilAnna-Marie Walther, GermanyCatherine Meneguzzo, BrazilMika Willems, GermanySarah Schofield, EnglandSara Zabel, GermanyAmir Khan, North Wales, UKMarcelis & William, BelgiumTheatre and Performance: The Arianne Brown Triennial, HELAD, South AfricaAriana Rodriguez, MexicoNatalie Wood, EnglandShirley Neave, United KingdomElizabeth Woolf, EnglandArt", "The next Biennial should mark the last stretch of the artist’s work, as well as the first time the artist will be featured in a major retrospective. The mid-’50s exhibition “The Art of David H. Watson” was staged by the Department of Arts and Culture at the University of Illinois at Urbana-Champaign, and featured works by more than fifty artists.\n\n\nThe Italian artist and writer Daniele Graziani has been named the winner of this year’s Prix de l'Art avec l'Orangerie in Cannes, France. The prize jury voted on May 28, and Graziani was chosen by a jury comprising Alessandro Delfina, director of the Museo d’Arte Contemporanea di Roma, Italy; Christiane Amano, curator and head of the Italian Pavilion in the Venice Biennale; and Lucio Fusi, president of the Italian Association of Painting and Sculpture. The ceremony was held at the Marrakech Art Museum in Egypt.In the exhibition’s inaugural category, Art of Love, Graziani will be honored with a new copy of his work, The Death of Love, which", "The next Biennial should be led by artists, designers, artists, scientists, musicians, and other experts who are passionate about the subject, and should focus on the import of the exhibition. The Biennial should be a vehicle for the exhibition of work by artists whose work is currently in storage. The exhibition should be a space for dialogue with institutional and other public officials, in order to raise awareness of the importance of materials used in the art world, and for the exhibition of exhibitions and collections that are currently underrepresented.”\n\n\nFrieze announced today that it plans to cut more than two hundred jobs across its London, New York, and Hong Kong locations as part of a restructuring that will prioritize the sustainability of its business. The initiative, dubbed “transformational transformation,” involves a combination of layoffs, hiring, and staff redeployment. “We know how important it is to retain talent and to work with those who have chosen to leave,” said Frieze artistic director Brook Bell. “This is a difficult time for all of us, but the company is committed to supporting the artists who have made the Frieze show a success over the past thirty years. We have increased our staff by almost three hundred since last March,", "The next Biennial should open in 2021. See more information about the 2019 and 2020 biennials here.The twelve artists who will be featured in the 2021 edition of the Dublin Biennial have been announced:François Bedford (France), Christine F. (Finland), Anna J. (Finland), Charles V. (Switzerland), Fred F. (United States), and Wolfgang Mies (Germany). All twelve works will be presented by the artist in the exhibition “Theater of Operations,” which will open on March 20, 2021 and run until March 21, 2021. This edition of the Dublin Biennial will consist of forty-six works, and will be presented in both English and French.“This is an enormous year for us with the coronavirus crisis and the coronavirus pandemic,” said Dublin city council leader Micheál Martin. “We are making great progress in every way imaginable. We are finalizing our architectural plans and work towards the opening of the city in 2020, and resuming the art of city-building through the 2020/21 biennials.”Dublin’s Art Department is also working towards designing the site of the biennial’s exhibition and surrounding", "The next Biennial should begin in the spring of 2021, with a presentation of the first exhibition of work by the new group of artists scheduled to open in the summer of 2021.\n\n\nThe Shriners’ Central Jewish Museum in New York has received a gift of sixty-six photographs depicting the life of the late Ukrainian artist Vitali Klitschko.The gift—which was made to the institution by the family of Steven Eder, one of the three founders of the photography arts and crafts brand Bloomfield—is the first of its kind from Ukraine. It is valued at between $5,000 and $7,000.“The Shriners are thrilled to receive this exceptional gift,” said Shonan Ozerov, the museum’s director and CEO. “The photographs, dating from between the 1960s and the 1990s, demonstrate how Klitschko, an outstanding and dedicated photographer, captured the essence of his subjects. By incorporating photographs to his set of works, Klitschko created a personal gestural language for his subjects that is still in use today. By demonstrating the human connection between photographer and subject, Klitschko created a unique and richly symbolic visual language that is still used by a great many", "The next Biennial should be held in the autumn of 2020. Although the theme will not be changed, the duration of the exhibition will be shortened to fifty days. Although the Biennial will have as its theme the formation of new pathways for the exchange of ideas and with the help of arts professionals and students, the exhibition will also focus on the relationship between science and society. The inaugural exhibition will also include the participation of ten thousand participants from each of the participating countries. The biennial will consist of “a selection of contemporary works by thirty–eight artists,” marking the first time that the works of thirty-eight artists will be presented together in one exhibition. There will be no retrospective exhibitions.“The new format will make the festival more meaningful for the hundreds of thousands of visitors to the pavilion each year,” said Laurence Muschiett, president of the Biennale de Lyon. “We are already very confident about the quality of the work that will be presented in the exhibition, and in the new collaboration. In addition, the opportunities for collaboration with the artists and this exhibition are enormous.”\n\n\nThe English and Irish Museum of Modern Art (EIM) in London and the National Museum of", "The next Biennial should include a presentation of a selection of new works, curated by Alicia Blythe, from the exhibition “Fortress West: LA in the 1980s” that is currently on view in the exhibition’s third edition at the San Francisco Museum of Modern Art. Inaugurating the fair will be a review of the biennial’s exhibition “Los Angeles: The Biennial of its Century” and the upcoming exhibition “California Stories,” which will unveil its new section in the next two weeks.\n\n\nCatherine Clark Gallery, Oakland, California, has announced that it will open a new three-story, architect-designed, artist-designed, institute in the city. The museum will house the collection of artist-activists and other creative professionals centered around the concept of narrative and the legacy of African American artists, and will be divided into a museum and a library.The new institution, which will sit in the birthplace of artist Dr. Otto Kahn, is slated to open in 2020. Its architect, Robert Lanza, described the project as an extension of the work of the institution, which will serve as a space for discussion and reflection and also serve as a collaborative space for exhibitions", "The next Biennial should focus on the history of the museum, and the museum’s new galleries, the venue of its first exhibition in the UK in 1954. “The museum is building a new vision for its galleries, new exhibitions and exhibitions programs, and the new galleries in the building, as we continue to present work by the world’s great contemporary artists,” said Maud Lyon, chair of the board of trustees. “We believe that the exhibition, the galleries, and the building should be celebrated in the years to come, when the Biennial is remembered as a place of great international influence and extraordinary achievement.”The new galleries, which are being built in a former mill near to the Museums of Birmingham and Liverpool, are being named after the women who have made significant contributions to art history. The list of curators and artists includes Leroy Rene-Jayne (1958), Vivian Hugh-Simmons (1977), and Deborah Fattal (1974).  The new curators and artists for the 2015 show were chosen from an open call. The 2013 exhibition “Museum of Modern Art” is the only one of the four planned for the museum to", "The next Biennial should focus on “reconstitution, reconstruction, and renewal.” This year’s edition, which will be held at the Museo de Arte Moderno in Madrid, will also include a retrospective of the work of the Italian artist Lorenzo de Cervino, who is also known as Charles Miro.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received an unexpected donation of $12 million from a wealthy collector and philanthropist. The gift comes from lawyer and businessman Anthony D. Taylor. The benefactor, who has a deep interest in art and a long history of giving to museums, including the Metropolitan Museum of Art in New York and the Yale Center for Art in Connecticut, gave the MFA a total of $8 million in support of its acquisition of works by artists such as Claude Monet, Henri-Auguste Renoir, and Adrienne Parr still in their collections.The gift, made on behalf of his daughter, Jennie Taylor, of Taylor Properties in Los Angeles, was made in recognition of her father’s extensive philanthropic endeavors, which have included the creation of the Emma Lazarus Fund for Art Preservation, the foundation that oversees the collection of works by artists", "The next Biennial should focus on the art of the sea, its affections and its affections'. It should also include a new collection of paintings, drawings, and sculptures by the late American artist Carlos-Josef Knoedler.\n\n\nThe Metropolitan Museum of Art in New York has appointed Linda Rindia as its next executive director. Rindia comes to the institution from the Museum of Modern Art where she has served as director since 2009. During her tenure, she has advocated for new art exhibitions and programming and developed new plans to engage with the public.“Linda has been a staunch supporter of the Met, its exhibitions, and our mission to present the art of the twentieth century,” said Christopher Ross, president of the institution. “We are grateful for her efforts and look forward to her continued success as we forge a new path with new and original exhibitions, collections, programs, and initiatives that reflect the rich and dynamic creative legacy of the Met.”Rindia’s first major institution-wide appointment was as director of the Museum of Modern Art in New York from 2003 to 2009, when she was succeeded by Richard Armstrong as director of the Jean-Michel Basquiat Foundation in Paris. In 2008", "The next Biennial should mark the centenary of the birth of Biennale de Lyon (1951–56). The inaugural edition, entitled Munich Triennale, was held at the summit of the Aisne River in the city of Munich in March and was followed by a worldwide tour of the city, curated by Kasper Koenig. The new edition will also feature an exhibition of works by the biennial’s predecessors Carmen and Hermelinde Gernander, and Luisa Weimar. Other works to be presented in the series are Rebecca Solnit’s L'enfant et les grands ouvriers (The Paintings of Kandinsky), André Breton’s Theater of Operations: The Gulf Wars 1991–2011 (Art and Revolution, Syntax, and Event), and Dusan Sladkina’s Theatre of Operations: the Invasion of Iraq (Yale Union, 2019).Commenting on the upcoming exhibition, Michael Mirkin, Director of the Polidoro Art Foundation in New York, said: “Eleanor and I are thrilled that this year’s biennale will include a new and innovative", "The next Biennial should take place in 2022, and will include thirty-five works by forty-four artists.“The exhibition is a continuation of the work of recognizing the historical importance of the work and of creating a more inclusive future for art,” said Roberto Cicutto, the director of the Biennale di Venezia. “It is also a reflective reflection on our time. The exhibition follows the development of an entire generation of Italian artists, renowned for their creativity and commitment, and it is a continuation of the work of our director Giuseppe Cicutto, who is responsible for the exhibition.”\n\n\nAn artist’s studio, a museum, or a school is the ideal setting for the world’s largest-scale low-carbon art project, the Climate Observatory, which is scheduled to open in 2022 and will be funded, in part, with climate models that scientists have been unable to reproduce in the laboratory.The Climate Observatory will measure the carbon dioxide concentrations in the atmosphere and will then be able to send that information to the International Centre for the Study of Carbon Dioxide (ICC), in Lausanne, Switzerland, via a network of sensors called a carbon dioxide meter, which will measure the", "The next Biennial should take place in 2020.”The International Council for the History of Art’s decision to suspend exhibitions dates was not unexpected, given the seriousness with which the museum has taken the outbreak. “The disease is contagious and we are all at risk of contracting it,” Christopher Wool, the director of the Institute of Contemporary Art, London, told the Times. According to the New York Times, the case in the UK involves a man who traveled to the country from Italy, where the outbreak began. While the man is currently being questioned by the police, his case is not thought to be linked to the coronavirus epidemic.\n\n\nThe Royal Academy of Arts (RA) in London has appointed Sabine Hartigan as its new deputy director for arts and culture. Hartigan will be responsible for overseeing the governance of the RA, which has an annual operating budget of around $15 million, and will take up the post in January 2021. She succeeds Elizabeth Curran, who resigned in July after eighteen months at the helm of the museum.“I’m delighted that this has been a very long-term project for the RA, and that Sabine is the person who has been entrusted with its future,”", "The next Biennial should take place in 2021. The next exhibition should take place in 2022. The next exhibition should take place in 2020. The next exhibition should take place in 2019. The next exhibition should take place in 2019. The next exhibition should take place in 2020. The next exhibition should take place in 2019. The next exhibition should take place in 2019. The next exhibition should take place in 2019. The next exhibition should take place in 2020.  The next exhibition should take place in 2019. The next exhibition should take place in 2019. The next exhibition should take place in 2019. The next exhibition should take place in 2019. The next exhibition should take place in 2019. The next exhibition should take place in 2019. The next exhibition should take place in 2019. The next exhibition should take place in 2019. The next exhibition should take place in 2019. The next exhibition should take place in 2019. The next exhibition should take place in 2019. The next biennial should take place in 2021.\n\n\nThe National Galleries of Scotland announced today that it will not change its name, aesthetic, or name of the institution after all. In a letter published on", "The next Biennial should be held in the Fall of 2020. \n\n\nThe Rosie Dee Foundation in New York has received a gift from a group led by Jewish philanthropist, collector, and philanthropist-to-be Arthur Frank. The gift includes a collection of fifty works by forty-seven artists, including Toccarra, Tunga, and Van Gogh. The works, which are in the public collection of the museum, are part of a series that is currently on view in the museum’s new exhibition, “The Myth of the Body.”Dee, who passed away in January 2021, was a longtime supporter of the foundation. The philanthropist established the foundation in 1991 to support the collection of works by women artists in the United States. The foundation is headquartered in Manhattan and has three divisions: the Art Museum, the New Museum, and the Museum of Modern Art. As part of the Museum of Modern Art’s acquisition program, Dee received some three hundred works from artists including N.D. Hutton, H.M.S.P., and Joyce Carol Oates, among others. The foundation also runs the Rosie Dee Artist Cemetery, which honors those who have made significant contributions", "The next Biennial should be held at the Institut National de Biographe in Paris, which is currently undergoing a €500,000 renovation, in December 2020. The 21st edition of the Biennial will be held at the Museum of Modern Art in New York, which will invite thirty-eight artists in January 2021, in March 2021, and will offer a retrospective of the work of the artist in April 2021. The illustrator Chimamanda Ngozi Adichie will present a new work by the nineteenth-century Nigerian artist Gero Mgambi in April 2021. The 2019 edition of the Biennial was organized and produced by Amador Giunta, and was shown at the Institut National d'Arles, in Arles-de-France, and the Louvre. \n\n\nAfter a jury in New York City upheld the convictions of a group of protesters who participated in the action against police violence in the aftermath of the May 25 grand jury announcement that cleared four officers of wrongdoing and sentenced them to prison last week, the city’s Office of the Attorney General has launched an action against police for violating the Americans’ constitutional rights to freedom of expression, assembly, and movement, reports the New York Times.The", "The next Biennial should be held in 2024.Museum director Mona Hatoum said: “This is a time of transformation and I think that the future of the museum is in the balance between the past and the future. At this pivotal moment, we must not only re-create the biennial that will last for generations but also to think of how art and architecture can serve as a vehicle for action and reconciliation.”The museum will work with the Hirshhorn through a combination of digital and physical installations and will present a new exhibition of work by artists and organizations that are part of the broader W.A.W. (Women Artists Awaken) movement.\n\n\nThe Board of Trustees of the Camden Museum in New Jersey announced today that Pablo Picasso will receive the prestigious Ed Hirschhorn Memorial Award for his lifetime achievement. For his work The Age of Adoration, 1969–1976, which was presented last year, the artist won the $25,000 award. The Hirschhorn is a former trustee of the museum and a supporter of the museum’s mission. For the annual award, which honors the lifetime achievement of a member of the faculty of the College of Arts, the Museum will receive $5,000.", "The next Biennial should stage a forty-five-minute performance every week of the academic year, with an additional exhibition of seventy-eight individual works every other week. It should also introduce four new works a day.“We are consciously trying to push things forward in the right direction,” said curator and founder of the biennial, Yuka Maeda. “The exhibition will show how the contemporary Japanese art of the pre-Okinawa period has been influenced by Western ideas, which are reflected in the exhibition. We do not have any immediate plans to start a new exhibition.” The biennial will open in March of 2020.\n\n\nThe Kensington and Chelsea Museum in London has withdrawn a major exhibition that highlighted the work and art of the late British artist Tony Burman. “For many people, the show, ‘Bridges: An Exhibition of the Artists’ Work,’ was an embarrassment,” said museum director Maria Balshaw. “I was not aware of the extent to which Tony Burman is associated with the Museum of Modern Art (MoMA), but the exhibition was a total loss.”The exhibition, which featured work by eighty-four artists, including Robert Irwin, Robert", "The next Biennial should include a retrospective of the work of the late Turkish architect Nusrat Fateh, whose architectural and design practice was influenced by the western modernism, and a presentation of the work of the late Egyptian architect Nusrat Al-Qasimi. The next edition will feature works by twenty-nine artists and will take place in the city of Algiers. This year’s edition will open on March 18 and run until March 19.\n\n\nThe MAXXI Foundation, the Philadelphia-based nonprofit that organizes the annual Art of the Party art fair, has announced that it is launching a new, yearlong fund aimed at helping artists struggling financially following the Covid-19 pandemic. The initiative will prioritize projects that empower local LGBTQ+Aboriginal communities and will prioritize projects that will be funded by MAXXI’s annual “Billion in One Hundred Days” grant, which is currently one of the largest fundraising efforts dedicated to LGBTQ+ artists.“I’m deeply concerned by the current socio-economic climate in Philadelphia,” said director and CEO Adam D. Weinberg. “While our fair and our artists may revel in the opportunity to present the works of", "The next Biennial should be held in the spring of 2020. Mattis also confirmed that the inaugural edition will be the last, and the new avant-garde program will be entirely offline. Cultural historian and curator Aziza Bashir, who curated the first edition, told the Art Newspaper that the new iteration of the Biennial will be a hybrid between traditional art and performance and will embrace the energies of both, bringing the art of the past and contemporary art. “The theme of this year’s biennial will be change,” Bashir said. “It will be about continuing the work of social justice and challenging the status quo with art.” The biennial will feature aspects of contemporary art, including works created by artists who are no longer around, as well as pre-existing artworks, including new works by artists who are working today and works that were on display when the exhibition was first organized. In addition, the Biennial will have a new programme of lectures, seminars, and workshops, and will organize an artist residency. The biennial will be inaugurated by a discussion with Jonathan McCarthy, an American photographer whose work explores the relationship between the landscape and personal identities and", "The next Biennial should be held in 2022. Hiroshi Hasegawa, a curator at the museum, said: “The exhibition will not be a performance but a dialogue between artists and visitors. The exhibition will consist of three parts: The first part will be a selection of works that were presented at the inaugural Biennial. This part of the exhibition will be a reflection of the visitors' reaction to the exhibition. The second part of the exhibition will be a survey of the Biennial’s impact on contemporary art. The third part will be a retrospective of the exhibition.We are currently preparing for the 2022 exhibition. The Biennial will be the theme of the exhibition. It is possible that the next iteration of the exhibition may take place in the 2020s, but for the time being it will be the theme of the upcoming biennial. Biennial and the exhibition will be a part of the museum’s history and our future plans.”\n\n\nA judge ruled on Tuesday that the estate of a 17th-century monastery in northern England--and the founder of a leading arts organization dedicated to the art of Buddhist meditation--could avoid a class action lawsuit by nearly five hundred former employees who were laid off from the Abbey Road", "The next Biennial should be held in 2021.\n\n\nThe Hong Kong artist Yan Li has won the $100,000 Bessies Prize for her landmark exhibition at the International Bessies Prize in New York. The prize, which honors an artist who has made a significant contribution to the visual arts and culture in the US, was established in 1976 by the Bessies Foundation, the Charles and Lucille King Family Foundation, and the Michael and Susan King Family Foundation.Li, a renowned Hong Kong-born artist whose practice spans sculpture, painting, performance, photography, performance video, and sculpture, was awarded the biennial prize at an award ceremony at the New York Public Library on February 21. The biennial is considered the largest prize presented by the Foundation. The award ceremony, which was held at the Library of Congress, included remarks by awardees Jeremy Deller, Hans-Ulrich Reimann, Robert Irwin, Tunga, and Alex Katz.Li, who has exhibited at the Bessies Foundation, the Palmer Art Museum in Los Angeles, and the Institute of Contemporary Arts in Singapore, was selected for this year’s prize by a jury of MacArthur Fellows. At the heart of the award ceremony was a question posed by an", "The next Biennial should be held at least twice a year, to coincide with the first. A second biennial, to take place at least twice a year, in the next five years.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the city’s arts and cultural organizations regarding the display of large-scale, art installation, performance, and/or photography in public spaces. The guidelines, which were issued by the agency on April 9, 2020, and are dated March 31, 2021, outline three general approaches to addressing issues in urban areas: “visually engaging;” “creative in nature; and” “continuous and meaningful.”The guidelines state that “it is essential that the city’s cultural institutions engage citizens, not just entertain them. If institutions are not visited and engaged, they will not only be less likely to retain audiences and draw audiences, they will also be less likely to retain audiences and draw audiences.”They go on to outline guidelines for how to organize exhibitions, how to prepare for events, and how to handle conflicts between visitors and museums, among other issues. When the guidelines were first released, their inclusion of", "The next Biennial should be held at the Museum of Modern Art in New York, but the timing of the cancellation is not yet known.\n\nThe New York Times reports that the Chris-Lab has canceled its third edition, which was due to open in the spring of 2019, citing financial concerns as the reason. However, the exhibition was canceled because of concerns around Covid-19, which has caused an unknown number of American galleries to close their doors. Although the show was supposed to feature the work of twenty-nine artists, including Raymond Boisjoly, Matthew Broderick, and Grace Griffith, it was canceled as a result of financial concerns.There were also rumors that the event would have taken place in a different location, but the organizers have chosen to hold the event at the Chris-Lab, which has the same space as the museum. The venue also provides access to the museum for visitors from New York City and allows for the installation of works by twenty-four artists.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has created five new curatorial positions, two of which are affiliated with the museum. In a statement on Wednesday, the museum said it has created the positions of associate curators and assistant curators", "The next Biennial should coincide with the completion of the exhibition “Microbes and Empires.” The theme of the exhibition was “The Origins and Evolution of Life on Earth.”The 20-year-old, $5 million exhibition, which will be situated in the basement of the museum, is being organized by the Biennial at the University of Exeter in association with the university, the university creative and performance group, and the South East England council, and will take three years to complete. The exhibition will feature three new works, “Telling Stories,” “Reform or Free?,” and “What Is a Life?” Samuel Tombs is directing the redevelopment of the Academy, which was established in 1935 by Artists and Innovators, a nonprofit that works with artists to explore themes of the year.The new exhibition will feature three new works in the exhibition “Microbes and Empires: The Past, Present, and Future” which will be on view for one week next month. According to the exhibition’s website, “These works were selected from an online shortlist of thirty-six works by forty artists.” The works will be presented in the exhibition, which will", "The next Biennial should be held within the next two years, and the current one will run from February 18 to February 22.The newly created commission—whose first cochairs are Saumelai Akram and Ali Karam—followed the conclusion of a special exhibition, “Awareness,” in association with the Egyptian Ministry of Cultural Heritage and the Ministry of Labor. The 2020 mega-tour will be led by Musa Abu Marzouq, the director of the Egyptian Museum of Art; Nima Nabavi, the director of the New York–based nonprofit the Zine Gallery; and a selection of twenty-four artists with titles such as “When Freedom Becomes Freedom,” “Amerikkka” and “The Urdu Verse.”The museum will also have a branch in China, where it operates an outpost in a former steamshipyard in the Yangtze River in Beijing. Last year, the museum hosted a special exhibition of work by the student-led collective Black Pussy Riot, as well as a number of exhibitions in the United Arab Emirates, Morocco, and South Africa.\n\n\nThe London-based arts nonprofit the London Foundation (LAF) has announced that", "The next Biennial should take place in the spring of 2021.\n\n\nThe Metropolitan Museum of Art in New York announced today that it has appointed Jonathan Marquis as its next director. He will be responsible for helping the museum to meet the needs of a changing city and the world. Marquis comes to the Met from the Museum of Modern Art, where he has served as director since 2016, and will assume his post in April.\n\n\nAt a time when museums are struggling to keep up with rising health care costs and the number of new cases of HIV continues to fall, the ACLU of Michigan filed a lawsuit against the state of Michigan on Tuesday, April 3. The lawsuit charges that the state is violating the Americans with Disabilities Act by failing to protect people with HIV and by penalizing museums for their failure to implement appropriate health and safety measures.The ACLU claims that Michigan is punishing Detroit’s Tate Modern Gallery for failing to test for the virus and is asking the court to order the state to compensate the museum $300,000 for the lost revenue from people who have sex with men in the city. The suit also claims that the Michigan Department of Cultural Affairs has issued 200 citations for violating the Americans with Disabilities Act since it went", "The next Biennial should be held in the fall of 2022.  In an attempt to lessen the economic impact of the pandemic, the National Gallery of Art in Washington, DC, has begun accepting visitors through the newly created Manchester Foundation. The foundation, which was established by the National Galleries of Scotland to provide financial support to artists, will remain open during the Covid-19 lockdown. \n\n\nThe Museum of African Art (MoA) in Atlanta has received a gift of seventy-five works from the O. J. Simpson Foundation. The gift includes works by twenty-nine African American artists, including Annie Dorsen, James A. Porter, and Arthur Schlesinger, and includes pieces by several artists from the African diaspora, including Rachael Burton, Jermyrna Bell, Dorothy Bennett, and Robert Irwin.“We are extremely grateful to the Simpson Foundation and the O. J. Simpson Family for this generous gift,” said David Simpson, the foundation’s director. “The collection has a significant impact on the lives of many artists, and its collection is a powerful reminder that the foundation supports the many contributions and projects of African American art, and is committed to supporting the very best work that", "The next Biennial should be held in the autumn of 2020.\n\nThis story is part of the new partnership between the Kunsthalle Basel and the Kunsthalle Münster. The project was conceived by Swiss curator Erich Wolfgang Fischer, who was inspired by the local museum in the city of Basel, where he grew up, and Kunsthalle Basel director Erna Meegman. The partnership was established in order to bring together the collections of two institutions from the Künstler family, Robert Kunst and Ottmar Könitz. \n\n\nOn Tuesday, artist Rilke Könitz, who was awarded the Order of the Viscount for her services to art and architecture in Germany in 2019, was found dead at her home in the coastal city of Württemberg, in the state of North Rhine-Westphalia. She was sixty-four years old.According to the Art Newspaper, Könitz was found dead at her home early on Tuesday morning. Authorities believe she was poisoned by carbon monoxide, but no details about the manner of death are yet known.Her death was ruled a suicide, but it is unclear whether she committed suicide or whether", "The next Biennial should take place in 2020. The events will be organized under the themes “the civil rights movement and the environment,” “deep ecology’ and “ecological resistance.”The next edition of the Biennale will take place at the Makati Museum of Arts, Makati City, Makati, the Philippines. The event’s theme is “The future of the environment,” which will be addressed primarily by the artists whose work will be presented. The twenty-second edition will be held at the Palawan Museum of Art, Palawan, Philippines. A digital version of the 2021 event will be available on the Philippine Film Institute’s website.The Kuala Lumpur Biennale will now kick off with a performance by the International Group of Artists and Performers Working in K-12 (AGAP) in collaboration with State Performing Arts (SPAA), the City of Kuala Lumpur, the Royal Commission for the Arts, and the Royal National Theatre. The event will now be held in partnership with the National Gallery of Malaysia.“When it comes to art and culture, the K-12 schools are very important to our country,” Prime Minister Ahmad Zahid Hamidi said.", "The next Biennial should be held in 2022, but its organisers are looking to the future. Shortly after the announcement, the exhibition was also cancelled due to the Covid-19 pandemic. According to an article published on the Art Newspaper, the exhibition is still on track for a 2020 debut. The next edition of the Biennial will be staged at the Guggenheim in New York.\n\n\nA group of artists, designers, and musicians are launching a new nonprofit organization dedicated to the protection of endangered cultural works in China. Called the 'Artists Emergency Fund,' the organization will receive the funds raised by ticket buyers and distribute them to cultural workers who are facing layoffs or are facing arrest for alleged crimes unrelated to the pandemic.“We believe that this move will help protect the cultural heritage of the People’s Republic of China, and will be able to prevent further social unrest, hunger, homelessness, and disease,” said Karen Deans, cofounder of the Artists Emergency Fund and a senior curator at the Sichuan Art Museum.The new organization will be run by a board comprising Nie Shun, the founder of the Tsinghua University Art Museum in Beijing; Zhu Ke, the director of the Beijing Art", "The next Biennial should be held in 2022, with the announcement of its theme: “Art and Life in Transition.” The 2020 edition will honor the forty-sixth anniversary of Art Basel Hong Kong and will premiere the artworks of the artist “Wangechi Mutu” and his wife, Mount Tsoi.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of work by sixteen foreign-born artists in its next edition, titled “Think Like a Man.” The exhibition, which will run from April 16 through May 18, 2020 at the Javits Center and will feature work from twenty-three artists\u0097Nina Bech, Kiki Smith, Tanya Szczepany, Yasmina Mohamad, Mary Panetta, and Marshall-Inman\u0097has been created in response to the 2015 attacks in Paris, which the United States has blamed on Islamic State; the pandemic; and the US-led coalition’s crackdown on jihadist groups in the Middle East.“The curators of the exhibition are consciously trying to present a new story of their own collective evolution,” curator Rob Hill, who curated", "The next Biennial should take place at the O2 Academy in London in 2021.  Museum director Nicholas Cullinan has also revealed that the exhibition will now be split into two phases: Phase One will begin in April, 2022 and Phase Two will commence in March, 2024. Dissolving the museum in a firework will be a major undertaking, but may also be possible. The dismantling of the Bakerloo will take place in stages, with the museum opening to the public in May 2020. Other highlights from the event include the work of twenty-nine artists, including Zina Saro-Wiwa, Taushu Liu, Ashley Mantle, Zemgus Girija, and Joe Klein, and a presentation of materials from the exhibition.“This exhibition is significant not only for the breadth and depth of its exhibition-driven work\u0097as well as for the degree of awareness with which the work is inter-checked\u0097but for its understanding of how art can be a vehicle for social change and in this regard, it is of major historical and contemporary significance,” said Colin Ward, chair of the curatorial team. Klein told the Art Newspaper: “The exhibition, in my opinion, is", "The next Biennial should have been held in Tonga, but was moved to Hong Kong, from Hong Kong to Hong Kong. In order to avoid the law and the consequences, the exhibition was moved to the Tungate Memorial Gardens in Hong Kong. The exhibition had been on view since March 24.The Hong Kong Arts and Culture Bureau (HALCO), which has been working with the Hong Kong Museum of Art (HoMA), to coordinate the Biennial, announced that on March 26 it will reopen its exhibition space to the public, marking the opening of   “The Rising Tide of Events: Hong Kong Art and Literature in the Sixties” (originally titled Hong Kong Art and the Sixties ), a curated exhibition of work by Wang Yiran, 于孩村, Mie Kok, 下坖, and other Hong Kongs. There will also be a public viewing of the exhibition at 8PM on March 19.The Hong Kong Information Technology Agency (HTA), which announced last week that the biennial would return to Hong Kong next month, has also moved the event to the Tungate Memorial Gardens in Hong Kong. The event will be held from March", "The next Biennial should have been held in 2019 and will be hosted at the Inland Revenue Building, the Inland Regional Library, and the Inland Museum of Art. It will also include an exhibition of works by Alan Pollock and Jean-Michel Basquiat. Dr. Seuss’s choice of the Forks in the Clouds was based on his belief that the artist’s work represents a fantasy of a fantasy land where the life and death of every single individual was decided by random chance. He said: “I chose Forks in the Clouds to symbolize a future where freedom is the ultimate prize and everyone is treated equally.”The public is invited to submit suggestions for future biennials to  “Dorothy’s,” a creative and fundraising collaborative that will organize an online survey of the development of contemporary art through a combination of online and in-person exhibitions, and will be asked to select a theme that reflects the theme of the upcoming event.Commenting on the biennial, Steven Davis, director of the Forks Museum and Art Gallery, said: “The Forks Museum and Art Gallery is pleased to support the creative and scholarly pursuits of the Topps Foundation and the", "The next Biennial should be held within two years.  While the institution has not yet committed to a date for the “20s” “there is a strong chance it may take a more gradual approach,” said Ortega-Villar. “This will be a challenging year. As we make the next steps towards reopening, we must ensure that the theme of our next exhibition is Contemporary Art.”\n\n\nThe Museum of Contemporary Art (MoCA) in New York announced today that it is moving the exhibition The Trap that Changed My Life, a show celebrating the work of black and queer artists, to a different institution. The show, which was presented by MoCA as part of “The Trap: Black Male Art in the 1980s” in the fall of 2017, will now take over the Solomon R. Guggenheim Museum at Columbia University in New York. The announcement follows a year of “trying to understand how ‘torture works,’ a topic that has vexed and galvanized us all,” said Michael A. Weiss, chairman of the institution’s board of trustees.The move comes after the Solomon R. Gug", "The next Biennial should be the annual exhibition “Between the Sun and the Moon,” which will open at the museum on November 21. \n\n\nTwo artists have won the 2020 Pulitzer Prize—Stephen King and Elizabeth Bear. King was named the prize’s laureate and the middle-aged women’s artist, Bear, was chosen for her first-person essay \"A Song of Two Cities,” which was published in the April 2019 issue of the New Statesman. Both pieces were chosen from a shortlist that included Bear, John Goodman, and Sarah Polley. King and Bear will each receive the prize at the Carnegie Museum of Art in Pittsburgh on October 28. The other nominees are Ann Landers, Jeanne O’Connell, and Rineke Dijkstra.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has appointed Julie Hirschhorn as its new senior director of contemporary art and design. She succeeds Joseph DiGirolamo, who was named the city’s director of contemporary art and design last month and will remain in the position until 2022. She will take up the post in January 2022.“DCLA is thrilled to welcome Julie to the department,” said", "The next Biennial should be held at least three times, with the possibility of reopening at any point. The biennial will also work with the local community in a way that will allow it to reflect in time with the local community. In order to prevent any disruption to the work of the biennial as it reopens, the Biennial Museum and Gardens (BMG) and the Monash Art Gallery (MAS) have decided to postpone the date of the next Biennial, which will be held at least twice as planned. The museums will hold the first event, “For All the World to See,” on September 13, 2021. It will be followed by “The Visit,” on November 18, 2021, and “The Other One,” on March 8, 2022. The first biennial exhibition, “The Show,” will be staged in the summer of 2021. The second exhibition, “The Present,” will be staged in the autumn of 2022. The third exhibition, “The Other One,” will be staged in the spring of 2023.\n\n\nNew York’s Metropolitan Museum of Art has appointed Kathleen DeCordova its new deputy director of", "The next Biennial should be convened as soon as possible.\n\n\nYale Union for the Arts (YUFA) has received a gift of $9 million from the Sifton Family Foundation. The donation includes $8 million for the construction of the new space to the south of the library; $7 million for the renovation of the building on the northeast corner of Yale University and Central, with the addition of a new public garden; and $5 million for the renovation of the building on the northwest corner of Yale University and New Haven Avenue. In addition to the gift, the foundation will award $2 million in scholarships to twenty-five students from Yale University.\n\n\nThe National Endowment for the Arts (NEA) has awarded $7.5 million to twenty-six arts and cultural organizations in twenty-four states, the District of Columbia, and the Northern Mariana Islands. The grants, which provide a critical source of funding for arts programs at historically black colleges and universities, were made through a new grant program that was launched in 2018. “The National Arts Scholarship Fund is an important and timely program for the arts at historically Black colleges and universities in the United States,” said NEA director Elizabeth Anne Hay.", "The next Biennial should be held in 2021. Over the years, the museum has participated in numerous international exhibitions, including the Venice Biennale (the first time it participated); the London Triennale; the London Film Festival (the first time it screened a documentary); the Venice Architecture Biennale (the first time it presented a work by a black female artist); and the Venice Museum Art Biennale (the first time it hosted an exhibition in the museum). The new event should wrap up in 2022.  During the worldwide celebration of the Red Queen, organized by the Lebanese artist Saad al-Hariri, an exhibition of work by the Lebanese artist Marwan Cheunet will inaugurate the pavilion. The invitation also states that the pavilion and the entire institution will be inaugurated by a presentation of work by the Lebanese artist Ghassan al-Hashemi. The biennial will invite a cultural exchange between the two countries, and will feature work by the Lebanese artists Ghassan Fayez, Tamara ElSohrab and Hisham al-Hashemi.\n\n\nMost of the global art-world was on display at the Fifty-Ninth Venice Museum and Sculpture Biennale", "The next Biennial should take place in 2020. \n An early version of this article, which was first published on June 7, 2019, appeared on the June 7 issue of Artforum.<|endoftext|>Hello, I'm David Scharf and I'm a research assistant at the Center for Contemporary Art (CCA) in New York. I'm also the founder of the blog Bicycle-Pillow, and I'm passionate about open access, collaboration, and accessibility. I'm glad to be working with you, and I look forward to hearing from you. If you have any questions, please feel free to ask. \n\nArt historian Richard Hegarty, the first curator to direct the Brooklyn Museum (BMI), has died at age forty-eight. Hegarty, who taught at the institution from 1973 to 1977, had worked as a curator for a decade, most recently for Fiona Rizk, the museum’s current artist-in-residence, and as an adjunct curator at the Whitney Museum of American Art, where he curated David Salle’s Rebel Without a Cause—2007—and many of the artist’s others that year.Born in 1961 in Brooklyn, New", "The next Biennial should be held in 2021. “The project is not about a return to the 1930s,” Jennifer Rizzoli, director of the Museum of Contemporary Art, New York, said of the exhibition, which is titled “We Are All in this Together.” Rizzoli added that the project will focus on the collection, management, and conservation of the works in a way that is relevant to contemporary life.While the collection will be housed within the museum, the new exhibition will be held in the building’s new, eleven-story, 200,000-square-foot exhibition space, the Marriott Marquis in New York. The exhibition, titled “Themes of the Present: Art, the Present, and the Future” and curated by Paul Mpagi Sepuya, features work by forty artists and will run until November 9. Among the works selected for the exhibition are work by David Adjay, who spent twenty years in prison for a nonviolent crime; David H. Koch, the billionaire industrialist and the former chairman of Koch Industries; and the late American designer Ralph Lauren.\n\n\nThe Stanford University Art Museum in California announced today that it is planning to demolish the museum�", "The next Biennial should take place in the city in 2021.\n\n\nThe Warsaw Biennale, which had been scheduled to run from March to August, has been canceled due to the Covid-19 outbreak. The Polish Ministry of Culture announced the news on its Facebook page, which does not specify whether the reason for the cancelation was the coronavirus or the pandemic.The State Theater (SZK), the Kraków State Museum, and the National Museum of Contemporary Art (MCA) in Warsaw have remained open throughout the Covid-19 outbreak, which has been blamed on the coronavirus, the novel coronavirus, and the Y-chromosome. The Ministry of Culture and the National Museum of Contemporary Art have since been criticized for failing to include information about the safety measures that should have been taken prior to the outbreak and for failing to inform the public about the best ways to prevent infection. The ministry also claimed that it delayed the announcement of its 2020 edition.In a letter dated March 23, the Ministry of Culture and the National Museum of Contemporary Art said that the date for the exhibition had been fixed by the Polish government. The letter addressed the Covid-19 outbreak, the outbreak of Covid-", "The next Biennial should take place in 2022, and the venue should feature a new work by the avant-garde Chilean artist Muro Bonitay.On the exhibition, which will also feature sculptural works by El Paso-born, New York–based artist Zineb Sedra, and South Sudanese artist Nisha Buhaj, the organizers say that the aim is to create a platform for a new generation of Latino artists to explore the history, landscape, and practice of the Americas.The 20-piece group will be led by Emma Lavender, the director of the Theory Lab at the Museum of Modern Art in New York, and will be curated by María Berrío, the curator of the feminist and socialist artist María Berrío.The selection committee consists of Artnet writer and curator Kate Fowle, the director of the Marco E. Fabian Collection in New York; Giovanni Ligi, the curator of works by artist-activists and activists Valeska and Ana Mendieta; and poet and curator Jamey Johnson-Stone.\n\n\nThe London-based nonprofit Arts4Life has announced that it is raising funds to create a new, universal basic income (UBI) for artists living", "The next Biennial should be held in 2020.\n\n\nMore than 200 museums and cultural spaces are preparing to welcome visitors to their halls of glass and steel once more in 2021, as the exhibition of the artist’s last works is scheduled to reopen in central London on January 18.Known for his underground installations, including the multi-hundred-and-sixty-ninth Biennial of the Arts, “Heaven and Hell” (2010), or “Scenery,” which fused landscape and sculpture, and “Suspended Image” (2011), a series of photographs that are now on display in the British Museum’s permanent collection, Jonathan Pryce, the director of the Institution of Contemporary Arts (ICA), London, said: “The autumn/winter period is ripe for a rethinking of what an immersive future might look like, with a view to creating new forms of social interaction and new modes of art. I am looking forward to working with the public, the artists, collectors, and curators to understand how we move forward as a society at this critical juncture.”The spring/summer break of 2021 will be marked by the Museum of London Art’s first-", "The next Biennial should be held in 2020, the Laneway Theater Company, which seeks to advance the art of theater and the art of performance, in London, and is organizing a series of events to coincide with it. The 2020 edition will be the fifteenth in the United Kingdom, the first in the United States, and the second in Europe.\n\n\nThe Libertalia Mestiza Collection, an international organization devoted to the collection of Italian contemporary art, has announced the opening of a new office in Rome. Titled the Mestiza Archive, the center will be housed in the Museo di Roma and will house a series of exhibitions, lectures, and other programming that will comprise the first exhibition in its new format.A retrospective of the work of Giovanni Schiaparelli will open at the museum in 2019. The collection will also include works by Carlo Cipolletta, Georo Pignatelli, and Wangechi Mutu. A film series by Massimo della, whose work explores the relationship between film and the visual arts, and a special exhibition of works by Jadé Cai, who was incarcerated in Italy following a failed attempt to assassinate President Silvio Berlusconi", "The next Biennial should focus on issues of sustainability, health and well-being, and the art and culture of the future.” The 2019 event, titled “Genuine Art” and hosted by the Uffizi Gallery in Florence, will open on September 11 in Milan, the Italian capital, and will run until November 28.\n\n\nThe Danish government has awarded artist Lars-Bo, who has served as director of the Copenhagen Art Museum since 2010, his first commission of the year. The commission, titled “Abandon All Hope,” was submitted by the late Danish writer, artist and theorist Jørn Gjerde Rasmussen. The artist chose the museum over the Los Angeles County Museum of Art (LACMA), which nominated it for its prestigious exhibition “Jørn and Lars” (Jørn Gjerde Rasmussen: Leaving the Landscape, 2015–2019). The cover of the exhibition depicts a group of people—a naked man, a woman, and a child—in various states of undress.The government committee that selected the winner of the Lars-Bo Prize, which is made up of the Danish Ministry of Culture, the Danish People’s Party, and the Swedish People", "The next Biennial should take place in Tokyo in 2021, and the inaugural exhibition will be staged in Porto Alegre in 2020. A second edition of the exhibition will also open at the Museo de Arte Contemporáneo in Almería in 2022.The project is supported by the Kanda Foundation for Contemporary Arts (Fondazione Kanda), the Kanda Foundation for Children’s Arts, and the Nagoya Art Museum.\n\n\nThe University of California, Los Angeles (UCLA), has announced that it is introducing a new job-based degree program that will deliver four-year degrees that are remotely-acclaimed and that will take place in a contemporary setting. The program is part of an effort to advance the UCLA Art Graduate School (UCLA Art Graduate School, or UALS), which has struggled financially since it closed its doors in March 2019. “In the wake of the closure, a number of us have been inspired by the work of our peers and the school’s graduates, many of whom share a passion for home art and intend to return to UCLA to pursue careers at the campus,” said Michael Govan, the director of the school. “We are thrilled to work", "The next Biennial should be held at the Museum of Fine Arts in Boston, which is currently undergoing a major renovation, sometime next year. The renovated building, designed by the German firm Guggenheim + Mugen, will host a biennial of Mexican artists in 2021. The exhibition will also include the work of Italian-born artist Maurizio Cattelan; the Miami-based curator, curator, and art historian Cedric Ciba-Matto; and the French curator, painter, and playwright François Mérha.\n\n\nThe Bathhouse Networks, a newly formed group of artists in London that have been working together since 2014, announced today that they have been awarded a $5 million grant from the Draper Foundation. The grant, which is part of the group’s plan to collaborate with the Draper Institute and the London School of Economics (LSE) in order to build a platform for direct, grassroots engagement with the artists in the United Kingdom, is part of the Foundation’s new initiative, “Our World, Our Future,” which was launched in partnership with Tate and the Draper Foundation.The organization will give a total of $5.5 million to the artists. A selection of the funds will then", "The next Biennial should take place at the Rijkswijk Museum in Amsterdam. The next exhibition should be held in Helsinki. The next exhibition should be at the Museum of Contemporary Art in Prague. The next exhibition should be at the Venice Biennale. The next exhibition should be at the Kunsthalle Basel. The next event should be at the Künstlerhaus in Munich. The next exhibition should be at the Museum d'Arles in Paris. The next exhibition should be at the Israel Museum in Jerusalem. The next show should be at the Museum of Modern Art in Istanbul. The next show should be at the Museum of Modern Art in London. The next show should be at the Museum of Modern Art in New York. The next exhibition should be at the Mezzogiorno in Rome. The next event should be at the Kunsthalle Basel, which is currently closed until January 6. The next performance should be at the Nationalgalerie in Vienna. The next exhibition should be at the Museum of Modern Art, Miami Beach. The next exhibition should be at the Contemporary Art Museum St. Petersburg. The next exhibition should be at the Kunsthalle", "The next Biennial should be held at a location that is open to the public. We've been working with different artists and organizations to create a location that is open to the public across the country. This year, we chose to focus on creating an experience that was built into every facet of the exhibition. With the organization of the biennial, we hoped that the theme of the exhibition would be about feeling and about the elements.”The design of the exhibition was influenced by two things: the work of the four artists featured and the exhibition’s archival and physical surroundings. “The exhibition was produced in the context of a city in which art is both abundant and celebrated,” Artnet reports. “The exhibition was conceived as a platform for artists to interact with the city and with the city’s environment.”The exhibition will explore the role of the city in the development of art, and present works by award-winning artists. The first biennial retrospective was organized in 1969 by Hirshhorn Gallery, which featured the work of twelve artists. The Biennial for Women was organized in 1972 by the feminist group the Center for Women’s Studies at Columbia University and took place in Manhattan. The exhibition was the first", "The next Biennial should be held in the spring of 2020. A second one will be held in the fall of 2020.While the museum is planning to establish a new exhibition space that would have been dedicated to the ceramic works in the building, the National Gallery of Art will remain shuttered through the end of March, and the previous exhibition, “Art of the American West,” will be included in the 2020 edition. The Los Angeles County Museum of Art, which is also located in the city, will resume operations on May 22.The Metropolitan Museum of Art in New York is planning to begin welcoming visitors again on May 26. In a statement, the institution said: “We are doing everything we can to avoid the worst and to begin welcoming families and friends on Friday. We are working with state and local governments to ensure we have the resources and the capacity to help communities through this unprecedented and unprecedented global emergency. . . . Over the last year, we have been working with partners, including local, state, and federal governments, to support the critical planning and execution needed to reopen. We are hopeful that this week will bring a new wave of visitors to the gallery.”The museum also revealed that it expects to lose an additional $1 million", "The next Biennial should be held in 2020; the next will be the last, in 2022.Heller, who received the Biennial Award in 2013, has also been awarded the National Medal of Arts for his participation in the Biennial Awards following its twenty-fifth edition, which was held in September 2018. He will receive the award in January 2021.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has announced that it is opening a second outpost in Boston in December 2020. Originally slated to open in 2018, the exhibition space, called the Modern Art Museum in Innovation, was pushed back by two years, citing financial concerns. Since its reopening in October 2021, the museum has been undergoing a major reinvention. In addition to the museum, which will include a 500,000-square-foot gallery, a meeting room, a public patio, and a theater, an additional 300,000 square feet of the museum will be transformed into a research center, an education center, and a supermarket. The new space will be inaugurated by an exhibition of the works of twenty-four artists, whose work will be on display in a series of lectures and programs by the museum.The museum will also introduce a new book series and an online museum", "The next Biennial should be held sometime in the second quarter of 2021.The exhibition, which will include works by artists such as Agnes Martin, Piet Mondrian, and Paul Gauguin and will be organized in collaboration with the New Museum, the Metropolitan Museum of Art, and the Hirshhorn Museum, will focus on the history of human activities in the environment from a feminist perspective. The project will also aim to present works that reflect, describe, and trace the interconnections between subjects.“The Future Is Present: Feminist Discourses on Landscape” is scheduled to open in the summer of 2023.\n\n\n\n\n\n\nPioneer Works, which has been featured prominently in New York City’s art world for more than a decade, announced today that it is expanding its presence in the city’s East Village with a new exhibition, “The Future Is Present: Feminist Discourses on Landscape.” Launched by artist and curator Christa Pape, the inaugural exhibition was curated by Brooklyn-based artist and curator Rachel Martin. “It’s a collaborative initiative between the artist and the curators to bring feminist art to life,” Pape told Artnews. “I", "The next Biennial should take place in the spring of 2021 and will be led by two artists: Luiz de la Peiróbosa and Rui Cornejo.  \n\n\nThe Metropolitan Museum of Art in New York has named Kate Mulleady assistant curator of modern and contemporary art. She succeeds Jen Ward, who retired June 30 after fifteen years at the museum. Mulleady joins the Met after graduating from the Yale School of Art in Connecticut and has been a curatorial assistant and curator at the institution for the past three years. Prior to joining the Met in 2008, Mulleady was a curatorial assistant at the Whitney Museum of American Art in New York, where she served as the group curator for the exhibition “Lynx and the Rope: Watercolor in the 1960s” (2014–15). Mulleady’s first exhibition at the Met, “On the Streets of New York” (2015), was staged at the Met in the form of a performance piece. She was elected a member of the museum’s curatorial team for “Lorenzo Serretto” (2017), a project conceived as a collaboration between Serretto and singer-songwriter Luke Bryan", "The next Biennial should be held in 2022. In an attempt to ease tensions over the exhibition, the Australian government announced earlier this month that it would enable the exhibition to return to the US for a twenty-fifth edition, which would run from March 31 to April 3, 2022. The move has been hailed as a recognition by the public that the institution is committed to Australia’s interests and has been welcomed by arts organisations. However, the move has been condemned by some cultural figures as a concession to the Trump administration’s demands. In response, Art Gallery of Western Australia (AGWA) director Elizabeth Ann Macgregor wrote to the Australian government in June, urging it to continue to collaborate with the US on a future edition of the exhibition. “The US and Australia are strong allies in the fight against terrorism, and we believe that it is in the national security interests of both states to continue working together to disrupt, disrupt, disrupt, and disrupt again,” she wrote. Macgregor also said that the exhibition would be “well served by continuing to present the best and most innovative Australian artists, in order to create a more united and inclusive global vision of the arts in our partnership with the US,", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Sarah Sze as its next director and CEO. Sze comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as interim director and CEO since November 2019.“Sarah Sze is an accomplished leader and an innovator in the field of contemporary art,” said Mark Stoeckel, chair of the board of trustees. “We’re thrilled to support her research and scholarship, and to work with her to expand the Museum’s collection and outreach.”During her tenure at LACMA, Sze oversaw the execution of three major fundraising campaigns\u0097in 2020, 2021, and 2023\u0097as well as the reinstallation of the Museum’s collection. Sze also served as interim director and CEO of the Los Angeles County Museum of Art (LACMA), which was forced to cancel the 2020 edition of the Whitney Biennial due to concerns around Covid-19.“Sarah is a seasoned leader who has built and maintained an enduring legacy as a curator and innovator,” said Matthew Roach, chair of", "The next Biennial should be held in the fall of 2020.\n\n\nThe Museum of Contemporary Art (MoCA) Chicago has added artist and educator Kamar Bar-Lev to its curatorial team. Bar-Lev, who is based in New York but has curated solo shows at the Museum of Modern Art, the Walker Art Center, and the New Museum, will assume her current position in the fall of 2020.“Bar-Lev’s work has been widely exhibited, and her work has been collected by many museums, including the Metropolitan Museum of Art, the Whitney Museum of American Art, and the Walker Art Center, and has been published in many books and journals,” said director and CEO Marta Bonar. “Kamar’s passion and ability to bring across unexpected and innovative perspectives make her an ideal fit for the Museum of Contemporary Art Chicago.”Bar-Lev will begin her tenure as a curatorial assistant at the museum in March 2020. During her tenure, she will work closely with Lisa Aplin, who has previously served as the curator of Modern Art at the Mondrian Museum of Art in Paris, and will develop research and public programming. She will also be responsible for museum-specific exhibitions, such as", "The next Biennial should be held at the private residence of the artist for the duration of his life, in the person of his son, and should take place at the artist’s home, in the city of Biarritz, in the city of Champagne-Rouvray, in the countryside of Saint-Étienne-de-Grâce, France. The Biennial will be staged at the artist’s parent’s invitation, and will begin with a public ceremony at the Artist’s former residence in the city of Biarritz on August 28. Its exhibition of the artist’s works at the artist’s parent’s invitation will be followed by a self-organized “word symposium” at the gallery on September 13.The twenty-second edition of the exhibition will be held in the artist’s hometown, at the gallery, and at the artist’s own home, in the city of Biarritz, in the countryside of Saint-Étienne-de-Grâce, France. The exhibition will be inaugurated by the exhibition “I’m not a monster,” 2017 exhibition in the studio of the artist’", "The next Biennial should take place in Melbourne in June 2020 and will use the same theme as the previous event, entitled Reclaiming the Land: Art and the Body in the Anthropocene. The twenty-fifth edition of the event will take place in Los Angeles in October 2021. \n\n\nThe Museum of Art (MoA) in New York has appointed Gregory B. Brown as its next executive director. Brown comes to the institution from the Metropolitan Museum of Art (Museum of Modern Art), where he has served as deputy director and chief curator for the past twelve years. He succeeds Sargent Black, who retired in November 2019 after twelve years at the helm of the institution.“Gregory has been instrumental in MoA’s transformation from a museum focused on individual art to one that is driven by a larger vision,” said MoA director Brian Knapp. “Over the course of his leadership role, he has developed the institution’s collection, expanded the museum’s collection and collection programs, and strengthened the museum’s relationship with the communities it serves. He has also built the museum’s reputation as a leader in the field. We are grateful for his forty-five years of leadership and", "The next Biennial should be held in 2021. “It is this last year and this last year that we have the opportunity to redefine the past, to project how far we can go, how far we will come,” said designer Naghmeh Rezaei, who will represent Morocco at this year’s edition of the Venice Architecture Biennale. “We are at a pivotal moment. I have been a strong supporter of this exhibition since I began as a curator in 1992. It has been a huge inspiration for me and for the many artists who have attended the pavilion in the past. It is an honor to be able to represent Morocco at this prestigious exhibition.”The 2019 edition of the Venice Architecture Biennale, titled “UPD,” featured work by Tommie Smith, Willem de Kooning, and Jean-Michel Basquiat. In honor of the occasion, the pavilion will be hosting an artist-in-residence residency for a select group of young artists and will also be hosting a number of free performances by artists, including the first biennial presentation of the Los Angeles–based collective the Hairy Calf, whose first artist-in-", "The next Biennial should not be held after 2020.” The move has sparked outrage and has led to threats of boycotts and acts of violence. In the past, the University of Oxford has had to suspend events and institute specials to protect the safety of visitors. The move led some to call for the institution to cancel the event. “The University of Oxford is facing a serious and unprecedented crisis caused by the coronavirus,” the United Kingdom’s National Union of Students said in a statement. “This is a crisis that the students and staff of the University of Oxford and the University of Cambridge, together with the students and staff of other leading UK universities, must respond to collectively and together.”The announcement follows an outpouring of support for the arts and humanities in the United Kingdom, where a study conducted by the Art Fund for Britain showed that the British economy is facing a loss of $158 billion in the next twelve months. As of June 30, the British economy was still recovering from the Covid-19 pandemic, and the British Film Institute predicted that it would remain so for another eighteen months.In a letter shared on June 27 with the Foundation for British Culture, John Spencer,", "The next Biennial should be in 2021. \n\n\nThe Museum of Fine Arts (MFA), Boston, has appointed Ashkan Soltani as its next executive director. Soltani joins the institution from the University of Chicago, where she has served as a research associate for twenty-six years. She succeeds Christopher Campbell, who retired in 2018 after twenty-three years at the helm of the museum, and will take up the position in January 2020.“Ashkan Soltani’s leadership will be a tremendous distraction from the museum’s transformation as a contemporary art museum and will allow us to better serve our audiences, our communities, and our nation in the years ahead,” said Bertrand Luban, chair of the board of trustees and director of the museum. “Her tenure as executive director will be a great success story for the MFA. We look forward to collaborating with her and to supporting her as she enters this new chapter as a museum director.” Soltani first rose to prominence in the late 1980s when she became the first woman to head the prestigious Athenaeum in Rome, which she helmed from 2001 to 2013. She served as the executive director of MFA", "The next Biennial should have been a big success. Instead, it was canceled. The next Biennial should have been a big success. Instead, it was canceled. The next Biennial should have been a success. Instead, it was canceled. The next Biennial should have been a success. Instead, it was canceled.The next Biennial should have been a success. Instead, it was canceled. The next Biennial should have been a success. Instead, it was canceled. The next Biennial should have been a success. Instead, it was canceled. The next Biennial should have been a success. Instead, it was canceled. The next Biennial should have been a success. Instead, it was canceled. The next Biennial should have been a success. Instead, it was canceled. The next Biennial should have been a success. Instead, it was canceled.The next Biennial should have been a success. Instead, it was canceled. The next Biennial should have been a success. The next Biennial should have been a success. Instead, it was canceled. The next Biennial should have been a success. Instead, it was canceled. The next Biennial should have been a success. The next Biennial", "The next Biennial should take place at least ten years after the first, which is currently scheduled to take place in 2020. The 2020 mark will be marked by the exhibition of a new work by a group of American artists, known for their experimental and polemic approaches, on the catalogue of a major American collector, Michael Hausmann. The biennial will also feature artworks from the Collection of the United States Embassy in London.The announcement was made in a letter addressed to the British government, dated December 21, and signed by forty-four artists and collectors, including Martin Amis, Alan Black, Vincent van Gogh, Fyodor Dostoevsky, and Daniel H. in the summer of 2021, to mark the anniversary of the institution. The letter concludes: “[We] ask that you honour the special role played by the Biennial at the British Museum, and continue to support the artists and collectors who have made such an important contribution to the history of art in the UK, and who continue to play such an important role in the work of the museum.”\n\n\nThe Allan McNamara Foundation, which has hosted the McNamara-Dorsch Concert Hall since 1987, announced today that it will end its current year", "The next Biennial should be held next year, and the first exhibition will be held in 2021.The artist-owned gallery will be led by two artists, Sarah Loyer-Weinstein and Hélio Oiticica, and will be housed in the Museum of Art. Inaugurating the gallery will be a new series of solo shows of work by the duo.The artists will remain under contract with the museum until the end of the year. In the meantime, the gallery will organize a series of exhibitions, including a workshop on Saturday, October 11, and a special show of work on December 6, featuring works by the artists of the series “Spiral Prison,” which will focus on the concepts of temporary distraction and sensory overload, and will serve as the center of operations for the museum.The artists will have their first show at the museum in 2020, with the group exhibition “Spiral Prison.” The exhibition will also feature a new series of works by the artist Salvador Dalí, whose work is represented by the museum. The show will be curated by Elvia Moro, the artistic director of the National Museum of Women in the Arts and the architect of the Museum of Modern Art in", "The next Biennial should focus on how the journey of art through time and space has such a direct effect on the psyche, and on the body, and will include a discussion of the psychological and biological effects of long-term exposure to the hallucinogenic drugs mescaline and ayahuasca and how this can be experienced as a state of being.The event will be staged at the National Museum of Art in Washington, DC, on September 24 and will run for twelve weeks. The biennial will also organize a number of workshops centering on themes such as social justice and the body, health and well-being, and spiritual practices and medical sciences.The inaugural exhibition, “The Politics and Rituals of the Body” (2019–20), will be hosted by artist and scholar Lawrence Abu Hamdan at the Art Institute of Chicago. The exhibition will be curated by Euler and Green and will open at the museum on September 22. The exhibition, which is one of ten in the biennial series, will showcase work by forty-nine artists. The inaugural exhibition will continue on September 24 and September 29 and will feature work by the biennial’s next group of artists, the Critical Pedagogy group, which consist of Javier Olmedo", "The next Biennial should take place in 2021, and the event’s first iteration will take place at the San Francisco Museum of Modern Art. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Emily Mark-Viverito as its next director and CEO. Mark-Viverito will succeed her predecessor, James D. Phillips, who in January 2019 departed the institution after eighteen months for undisclosed reasons.“In our eight-year history of leadership, we have grown tremendously in stature, prestige, and impact,” said Mark-Viverito. “We are grateful to James for his hard work and dedication to strengthening our curatorial priorities and our mission, to increasing our capacity to present a diverse range of exhibitions and programs, and to his invaluable leadership.”During her tenure, Mark-Viverito, who has served at the museum since 2008, oversaw the curatorial and exhibition program for its first season, “The Bliss Years,” and has helped shape the museum’s collection and exhibition strategy. She also worked to advance the museum’s understanding of Indigenous art, and to foster the museum’s relationship with the local community through programs such as the MFA First Nations", "The next Biennial should be a celebration of our history, a celebration of the world we have created together, and a reflection on our future.”The twenty-seven-year-old artist, whose work addresses issues of spirituality, politics, and the environment, has been selected as the winner of the $20,000 Goldwater Prize. The $5,000 award is for his work “The Sacred Land: A Space for Ambiental Design.”The award ceremony was held at the Museum of Fine Arts, Houston, where Gabor was born and raised. Gabor is a graduate of the American Academy of Arts and the City University of New York School of Art. For the 2016–17 school year, he is organizing a solo exhibition titled “Daydreaming,” which will be presented by the artist at his home venue on the Southwest corner of Houston and Spring.\n\n\nThe Museum of Modern Art (MoMA) in New York has released the list of seventy-five artists who will participate in its next edition at the Javits Center from January 23 to February 14, 2020. Launched by the nonprofit organization Modern Art Museum Design, the event will be hosted by MoMA on the Javits campus from January 22 to", "The next Biennial should take place in 2022, said Manuela Ferrer, the Director of the Museo de Arte Contemporáneo in Madrid. The initiative will be organized as a symposium, with each participating institution working with a different contemporary artist. The first edition of the Biennale was held in Barcelona in 2012 and consisted of an exhibition of works by twenty-two artists. The following year, it moved to the Stedelijk Museum in Amsterdam, and from 2012 until 2019, it was held in the city of Liege, Belgium.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of approximately one hundred photographs by the late Pablo Picasso. The acquisition, which was made by collector and philanthropist Alan Guggenheim in honor of the artist’s birthday in May, also includes forty photographs by the Italian landscape painter Ligia Bocconi.Born in Rome in 1936, Bocconi grew up in the town of Siena, northern Italy. The father of four children, she studied under the renowned master Piet Mondrian, and later moved with her family to the town of Vialle, where she met the American artist Elizabeth Peyton. They married in 1953 and", "The next Biennial should take place in Guadalajara, Mexico City, and Berlin in 2021, and then in New York and Shanghai in 2022, and then in Los Angeles, and Shanghai in 2025.“The exhibition ‘Painting in the Dark’’ is a remarkable work of modern art, and will receive a great reëstablishment,” said Sylvia Iwan, curator and president of the Metropolitan Museum of Art. “The exhibition really marks a point of departure for us from the Guggenheim and the Museum of Modern Art. It is an astounding work of the extraordinary artist Marta Bonetto, in order to show how the painters can transform the world.” \n\n\nThe Women’s March, the U.S’s largest protest against President Donald Trump, has announced that it will be held in March. Organizers cited concerns for the safety of protesters and an increase in HIV and AIDS cases as the reason for canceling the event.“We are canceling this year’s March for Science,” reads a statement by the organizers. “We are canceling the March for Peace, for Social Solidarity, for a better world,", "The next Biennial should be in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has hired Melissa Getz, a principal at Architectural Arts, as its new deputy director for collections and exhibitions. She succeeds Mark Serota, who retired in January 2019 after thirty-three years at the museum.“We are thrilled to welcome Melissa to the board of directors,” said Mark Serota. “As a leading curator and advocate for art and architecture, Melissa brings a wealth of experience and knowledge to the museum, and will play a vital role in integrating MoCA’s collection and exhibitions into the rapidly changing landscape of contemporary art.”Sybille Bondy, chair of the board of trustees, added: “For more than a decade, Melissa has been a trusted mentor to our artists and curators, cultivating their practice and expanding their careers with practice-based exhibitions and exhibitions-driven research programs. We are grateful for her leadership and confidence in cultivating artists and curators. We look forward to working with Melissa to further the museum’s mission to champion contemporary art.”\n\n\nNew York–based artist Shepard Fairey has been awarded a MacArthur Fellowship for his recent exhibition “", "The next Biennial should take place in New York City. The event, titled Framing the Body, will be sponsored by art dealers and curated by Saskia Harlan, who was recently appointed director of the Whitney Museum of American Art in New York.The full list of participating artists is as follows:Beth ArmitageBeth BesenFreeWheeler and Stroud (UK)Fiona CarterFiona CarverFiona CobbettFiona C.J. AdamsBeth AdamsBeth BarkerBeth BrowneBeth BrowneJana BoydBeth BrowneJana BrownBeth BlumBeth BrightmanBeth BriteBeth CloudBeth CollinsBeth Collins-erBeth CohenBeth CohenHannah CooperHannah CosgroveHannah CooperHannah CummingsHannah DelanoHannah Delano’s London-based collective, Hosea M. Richardson, have announced their representation of the late British artist Joan Jonas. The artist was one of the early practitioners of film-based performance, which involves moving between video and photographic works in order to create works that balance geometry and abstraction. Although Jonas’s work was influenced by the avant-garde of the 1940s and 1950s, the artist", "The next Biennial should be held at least once a year, and the first in the West. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced on Friday that it is now accepting donations of works and objects from individuals and groups in the greater Los Angeles area. The institution previously relied on donations from individuals for most of its funding, but in March of last year it began accepting funds from the general public.The museum has since received more than eight thousand donations, which include items such as food, clothing, and household items that have been made by individuals and have not yet been displayed in a museum exhibition. In addition, it will now be able to accept funds from a variety of sources. These new initiatives will allow MoCA to raise $10 million for the construction of the new David-and-Goliath, the museum’s first expansion, which will add a theater, a theater-like experience, and a lecture hall.The gift drive began in March 2019 and was initiated by the Los Angeles County Museum of Art (LACMA), which would not be able to renovate and open its current location unless it received $10 million in pledges. In March of this year, MoCA received $8 million from the City", "The next Biennial should take place at the studios of NADA’s North America branch in January 2020 and will focus on new work by emerging and established artists, with a view to celebrating the current spirit of the year.\n\n\nAmerican painter John Courteau, known for capturing the essence of human experience through his experimentation with charcoal, canvas, and oil paints, has died at seventy years old at his home in New Orleans. The cause of death was cancer.Born in New York City in 1939, Courteau studied at the School of the Art Institute of Chicago, the Art of Painting Institute of Chicago, and the Art of Drawing Institute of Chicago. He completed his BA at Columbia University, the Graduate Center, the City College of New York, and the Center for Modern Art in New York.During the 1950s and early 1960s, Courteau lived and worked abroad, primarily in France, Switzerland, and Italy, and taught at the School of the Museum of Modern Art, New York, the Art of Painting Institute of Chicago, and the Art of Drawing Institute in New York. He also lectured extensively in the United States, Switzerland, Japan, and Britain. Courteau’s paintings are among the earliest systematic attempts to use charcoal", "The next Biennial should be held in the autumn of 2021. The first phase, “the deluxe edition,” will open at the museum in the fall of 2020. The second phase, “the course version,” will open in the fall of 2021. The exhibition will launch with the exhibition of “Feminine and Human: Painting Women,” from the author E. M. Pei in the museum. The festival will be hosted in partnership with the London-based feminist and artist Sabina Bonham Carter, who will direct the opening and closing phases of the exhibition, which will highlight the work of women whose work is not currently on view. “As the museum’s first Feminist Art Museum, we believe that the exhibition will help to redefine the term Feminist Art in our eyes,” said MCA director Sophie Blatty. “Not only will the work of the exhibition represent the most selected and innovative work of contemporary art, but the exhibition will also be a celebration of the many voices in contemporary art, and the fact that we have a strong future with these artists.”The Venice Biennial’s inaugural edition—in which Arturo", "The next Biennial should coincide with the opening of the new museum, which will be inaugurated by a public program of performances and performances-based initiatives that will aim to draw attention to the current challenges facing the city. The trip would also mark the first visit of a leading curator to the city of Ponte Mirabile since the late Italian architect Paolo Calabrese (1932–2005) and the city of Venice, which is located 130 kilometers north of Milan, in 2014. The committee that selected the theme for the exhibition, titled 'The Future Is Present,” will convene for an emergency meeting to press for a renovation and expansion of the museum, which is currently undergoing a $105 million overhaul. Since the institution is currently closed due to COVID-19, the work of cleaning and painting, and artworks exhibitions are currently suspended. “I’m really looking forward to it,” Francesca Cercielli, the president of the Venice Biennale, told the Art Newspaper. “The new exhibition is very important for Venice, at least for art, because this is when the city’s cultural producers are most active and the city’s visitors most engaged. We will see", "The next Biennial should take place in 2020. The 2018 event, titled “First People,” was curated by the Danish curator Felicity Hammond and featured work by twenty-six artists, including Jeff Koons, Bénédicte Savignac, Nancy Spero, and Joachim Troelsen.\n\n\nThe Pérez Art Museum in Madrid has received a gift of twenty-six works by forty-four artists from the Spanish Modern Art Museum (MAS) in Madrid. The works, which were donated by artists living in the municipality of Almería, were recently gifted to the institution by a group of collectors who met with the institution’s director, Ana Paula Cervetti, in 2017. José Luis García-Báez, a collector and collector of modern art in Spain, said: “The Pérez Art Museum is a microcosm of contemporary life in Spain. We are grateful to the Pérez Museum for supporting the collection of this collection.”The gift includes works by: Amél Muñoz, Hieronymus Peil, Enrico Castello, Ana Lascaris, Murillo Marín, Carlos Martinez-Silva, and Juan Á", "The next Biennial should focus on the music and painting of the late nineteenth century, and should include performances, exhibitions, and performances, reading, and films by, among others, Victor Baselitz, Henri Matisse, Pierre-Auguste Renoir, and Édouard Vuillard, and should take place in a venue that exhibits the work of recent artists and, where possible, that is also near a major international art museum. In the form of a show, the exhibition will be organized around a theme of the exhibition, the Biennial, and the artist.While the theme of the exhibition will be “Authorship, Politics, and the Dream:” in collaboration with the artists represented, this year’s show will focus on the relationship between art and politics, the concept of art as social construction and the relation between art and society. The opening of the show will be marked by a performance by the artist Jennifer Nocito, whose work has been previously exhibited at the Biennial and the Hammer Museum in Los Angeles, and the opening of the exhibition will be preceded by a two-day celebration of the first anniversary of the Biennial, an intimate one-day exhibition devoted to the various artists represented in the show, a series of", "The next Biennial should take place in 2021.  The event will mark the 70th anniversary of the exhibition “L'enfantin Asia-Pacific: Modernism and the Pacific,” a biennial of work on the Pacific by Lawrence Weiner, Robert Irwin, and Peter LaBar, as well as the institution’s founding exhibition, “The World is Not My Land,” in 1967. The 2019 biennial, “Theater of Operations: The Gulf Wars” (TOW), marked the first time that the exhibition was curated by an international team of artists.\n\n\nThe Los Angeles County Museum of Art (LACMA), the first museum in the United States to phase out fossil fuel use in its entire operations, is preparing to cut its greenhouse gas emissions by more than half—it expects to slash the emissions by 30 percent by 2022. The exhibition “Plants and People: Fossil Fuels and the Modern World” will be moved to a new 800,000-square-foot space in the museum, which is currently being renovated, and will undergo a major reopening in 2021.“We are committed to reducing consumption and adapting to climate change,” said museum director Amanda", "The next Biennial should take place at the Museum of Modern Art, New York in 2021, the Museum of Modern Art (MoMA), New York in 2022, the Museum of Modern Art (MoMA), and the Metropolitan Museum of Art, New York in 2023, and the Museum of Modern Art, Chicago in 2030. The Museum of Modern Art’s new pavilion will mark the first time the museum has hosted an exhibition of works by more than sixty artists in a single year. The Museum of Modern Art, Chicago, and the Whitney Museum of American Art, New York, will re-open in 2021. The Museum of Modern Art, Los Angeles, and the Museum of Modern Art, New York, will re-open in 2024. The Museum of Art, New York, will re-open in 2021. The Museum of Modern Art, New York, and the Museum of Modern Art, Chicago, will reopen in 2021. The Museum of Modern Art, New York, will enter its third season of programming, “Time for Change,” in 2021. The exhibition will be on view through August 19, 2021, and will commemorate the", "The next Biennial should be held in 2020 to coincide with the thirteenth edition of the Pan-African Art and Design Biennial, which will be held in Dakar, Senegal, and will be held in tandem with the seventy-third edition of the Iberian Biennial, which will be held in Toledo, Spain. “Building on the success of the previous two editions, the 2020 iteration of the BIFA will explore African art through the history of its repertoire, highlighting the diversity of its cultural heritage from the African continent,” said the organizers. .\n\n\nThe Metropolitan Museum of Art (the museum) in New York has appointed Audrey Liss, a curator and the director of the contemporary art program at the institution, as its next director. Liss will be responsible for ensuring the museum’s long-term sustainability through the exhibition, program, and acquisition of art.“The Met has always been committed to supporting artists and building lasting relationships with their audiences through programming that has a broad and diverse audience of artists representing a wide range of artistic backgrounds and disciplines,” said Liss. “Our vision for the future of the museum is to be a place where artists can connect with and have their work exhibited. This", "The next Biennial should include a new performance series, a presentation of works in the collection, and the lectures of renowned scholars such as Maud Pomeroy.Inaugurating the exhibition will be a new manuscript written by a half-dozen authors, which will be presented by the Paris-based curator Charlotte Biczel, who also curated the inaugural exhibition. The book will be a selection of essays on contemporary art from the biennial’s ninety-nine-piece group. The show will open in the National Museum of Fine Art in Paris on August 28 and run until September 3. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Craig F. Lynch as its new executive director. Lynch previously served as the director of the Massachusetts Museum of Art (MMA) between 2003 and 2007 and, starting in 2016, worked in conjunction with the Museum of Contemporary Art (MoCA) in New York, where she currently serves as deputy director of curatorial affairs.“Craig is a man of integrity, vision, and energy, and has been central to the growth of the MFA in Boston and to the future of art at MoCA,” said Matt McQuinn, chair of the museum’s", "The next Biennial should be held in 2022. “We thank the new trustees for their prompt decision,” said Kipp.Maria del Val, chair of the Board of Trustees, commented: “The addition of the Piedmontese artist to the collection was a great development for the Arts District, and will have a significant impact on the collection and exhibition program of the Biennial.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed William John Sheehan as its next president. He succeeds Susan Abbott, who has served in the role of director of the museum since January 2017. “William has demonstrated an exceptional track record of transforming the MFA, which has had a significant financial impact on its collection, between 2001 and 2014,” said Mark Adler, chair of the board of trustees. “He will continue to bolster the museum’s international reputation and attract new audiences with thoughtful exhibitions and collections that engage with contemporary issues.”During his tenure, he oversaw the acquisition of more than 5,000 works by artists such as Richard Diebenkorn, Urs Fischer, John Kahn, and Henry David Thoreau, and oversaw the development of the museum’s", "The next Biennial should begin with the exhibition “2 + 2 + 2: An Unseen World,” scheduled for July 26–August 25. The single-day event will exhibit works by artists including Theodoros Hoxakis, Irina and Aleksandar Balashchik, and Rineke Bregoli. The exhibition will take up themes of “Humanism” and “justice and peace” and will be preceded by a Q&A session with the artist and a poem by the artist, who will receive a plaque. The biennial will mark the first time that the artist will take the stage as part of a major retrospective. Hoxakis' series “Two + 2 + 2: An Unseen World” (2011–12) featured work that was meant to represent an idea that sits at the center of art history. It was selected by the jury for its “inspiring and captivating” exploration of the concept of opposites and the idea of the horizon.The jury also selected a selection of works for the exhibition “The Future Is Not What It Used To Be” for its “immersive, deeply moving, and provocative” finale. The works", "The next Biennial should be staged in the fall of 2020, and the first exhibition should open in 2021. In addition, the museum will hold an international series of exhibitions and public programs in 2020, and will hold two new biennial exhibitions in 2021. The first will feature works by forty-four international artists and will inaugurate the new two-story, twenty-four-room museum, which will boast a new collection of thirty thousand works by contemporary artists. The second will return to the city of Seoul, and will open on November 12.\n\n\nThe National Gallery in London has become the latest institution to announce that it is launching a new initiative focused on diversity and inclusion. The new initiative, named the National Inclusion Report, was established in collaboration with the National Union of Journalists and the National Association of Theatre Arts (Naturva), and will draw from a database of more than four hundred thousand people to assess the state of diversity and inclusion in the UK’s cultural landscape.The initiative will involve the collection, analysis, and publishing of a report which will provide a snapshot of the state of diversity and inclusion in the UK\u0097in this case, the full dataset will include names, birthdates, gender, occupation, nationality, income, and disability", "The next Biennial should include a lecture by a researcher from the United States on the history of the art of the nineteenth-century. The biennial will be hosted at a museum dedicated to the history of European art in the capital of the Austrian state of Baden-Baden, in collaboration with several local and international partners, including the German Cultural Center, the Austrian Academy of Sciences and the Austrian Institute of the Arts, as well as at the Parzival Gebruder, the city of Baden-Baden.\n\n\nThe New York Academy of Art (NYA) announced today that it is preparing to welcome visitors back to the institution on September 11. The announcement was made during a ceremony at the Whitney Museum of American Art on the Upper West Side, where the next edition of the Whitney Biennial will take place, from September 12 to September 15.The Whitney Museum of American Art, which is located on the ground floor of the iconic Guggenheim Museum, has been closed since March 23, due to an ongoing work stoppage. The shutdown has led to a temporary closure of the entire Guggenheim, which has been closed since April 11, and has also forced the departure of staff. Among those who remain are artist-in-", "The next Biennial should be held in 2021. The 2019 event, titled Art and Life, was held at the Hippodrome in Paris and ran for twelve weeks. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is reopening to the public on September 7. The reopening was delayed by a week after the museum received a major blow to its finances in January 2019. The changes at the museum, which have been made since the institutions were founded in 1949, include the merger of the A.I.R. Gallery with the A.I.R. Institute of Art. The move has led to new concerns about the future of the institution and its collection, but also the museum’s relationship with its original parent, the California Institute of Technology (Caltech), which is now known as the Kingman Museum.In an attempt to reassure supporters of the institution, director Klaus Biesenbach told the Los Angeles Times that the upcoming retrospective of Ralph and Edith Humphrey will not be affected by the closure, and that it will be “a very warm retrospective. . . . like a typical warm family.” In a letter to supporters, Biesenbach wrote: “", "The next Biennial should take place in the coming months. -Stephanie Langret, Director, Biennial de Lyon\n\n\nThe Museums Association (MA), which represents more than 1,500 British cultural institutions, is inviting members to apply for a special grant of $270,000 to facilitate the digitization and preservation of three million objects through its digital platform. The initiative will focus on the preservation and digitization of objects created by Britain’s most important artists, including Peter Cushing, Rayyane Graf, and Arno Dorian, as well as materials from the Tate, the National Galleries of Scotland, the National Galleries, London, and the Royal Shakespeare Company. The grant will also allow the association to digitize and preserve the collections of the Royal Shakespeare Company, which has donated two thousand works to the museum, and the National Galleries of Scotland, which is working to place one thousand works in storage.“The museum has a critical role to play in promoting and protecting the cultural heritage of future generations through its exhibition programming, exhibition spaces, collections, and exhibitions,” said Stephen Thompson, director of the museum. “MA is confident that this initiative will provide the foundation for future growth and success alongside", "The next Biennial should take place in the fall of 2020. The biennial will include works by twenty-five artists in the form of a retrospective, which will be preceded by a public exhibition, “The Future Is Present: Art and Movement in the Bay Area” (2019). The exhibition will also feature a documentary by the award-winning artist Arne Glimcher titled The Black Metal, and an exhibition of work by the New York–based artist Maren Coates. The new exhibition will explore the history of the Black Metal Movement, which originated in New York City in the late 1980s and reemerged in 2017. The exhibition will also include works by the artists in the exhibition and a selection from the artist’s archive.Commenting on the new work, Sarah Coates said: “I’ve been thinking about how the museum’s exhibition would reflect the history of the Biennials over the last twenty years. The exhibition is a compelling reflection of how a movement of artists can provoke and challenge and shape our contemporary world. The work by Arne Glimcher is particularly poignant and effective because it was made in the context of a Black Metal Museum in New York City. What we’", "The next Biennial should be held at an appropriate time and in a manner consistent with the public safety guidelines set by the city of Chicago. The public will have access to the Biennial, as it is now, and will be able to experience it in its entirety, including the exhibition, its installation, and the numerous programs that comprise the Biennial. The 2019 edition, entitled “The Event that Changed my Life,” will run from February 18 to February 20. As of February 9, the Museum of Contemporary Art Chicago had received $67.5 million to expand the museum. The Museum of Contemporary Art Chicago is currently scheduled to reopen in March 2020. \n\n\nThe Metropolitan Museum of Art in New York has announced that it will restore the Art Deco-era space on Tenth Street in Manhattan, located at 456 East Twenty-Third Street, to the historic African American Museum (MAS). The institution will rename the new space “The Place,” and will inaugurate “The Black Renaissance” with a presentation of a new work by artist L.A. Reid.The historical building—designed by the African American Museum in collaboration with the New Museum and the Museum of Modern Art—was constructed in", "The next Biennial should be held in 2021. \n\n\nThe British pavilion at the Fifty-Ninth Venice Biennale has revealed that it will postpone the event for a period of sixty days to allow the Royal Shakespeare Company (RCG) more time to prepare for its upcoming festival. The institution is facing a possible loss of approximately $8 million because of the coronavirus pandemic and is also facing financial trouble because it has yet to establish a bank account for the financial benefit of the millions of people who are already affected.The Royal Shakespeare Company said that it is “working hard to establish a banking plan that can allow us to reopen and reopen and reopen with urgency,” as it tries to comply with the European Union’s new financial aid regulations.According to the Financial Times, the Royal Shakespeare Company has already allocated $3.4 million in grants for 2019–20 to support the production of new plays and musicals, but only half of the funds are guaranteed. The organization is also currently negotiating with the European Commission on a new financial aid package that will be funded by the public. The British pavilion was also forced to move the opening of the biennial from London to Southampton, in England, after", "The next Biennial should have been held in 2020, but was postponed due to the Covid-19 pandemic. For its nineteenth edition, the festival was moved to the same date as the previous edition, and the opening ceremony was moved to the same venue. The 2019 edition, which ran from October 29 to November 7, also featured a triennial of contemporary art in Asia. The 2020 edition will feature work by fifty artists and will be held at the Museum of Contemporary Art Tokyo.\n\n\nThe Los Angeles County Museum of Art (LACMA) has rewarded artist Jonathan Penner, the founder of the experimental and respected experimental art space the Collective Gallery in Downtown Los Angeles, for his outstanding work in the museum’s academic wing. For his work in eight exhibition categories, Penner was voted in as one of the twenty-five Artists in the Arts who will receive a $75,000 cash grant in support of their upcoming academic years. He was also selected as one of the twenty-five Artists in the Arts who receive a small cash grant of $50,000 each in support of their academic years.LACMA director John Lasseter said: “We are thrilled to support Jonathan Penner’s work in the", "The next Biennial should be held while its members are still in prison. The eleven prisoners in the US’s Central Institute of Art, which was closed in 2009, have expressed their fear that the institution will close permanently. While the institution has moved several times since it was founded in the late 1980s, it has yet to move the eleven-thousandth prisoner to its new home in Columbus, Ohio, which has been constructed in a former iron works, by the Ohio Department of Cultural Affairs.The museum’s new director, Roberto Cicutto, said: “We are not closing. We are reframing and rethinking the gallery and the collection to better reflect the voices, histories, and experiences of the artists we represent. The more we do this, the more likely it is that we will be able to avoid this fate, and at the same time we will be in a position to develop new and engaging programs for our audiences that are informed by contemporary and contemporary-oriented art.” Biennial director Naima J. Keith added: “We are thrilled that this is the last year of the Biennial, and that our extraordinary artists are given the opportunity to renew their work and their own lives by creating this year", "The next Biennial should be held in 2022. In a bid to diversify the curatorial team, the museum will add two new members to the program: art historian and curator Elena Loshak, a former curator at the Metropolitan Museum of Art, and Diana Mathews, a curator at the SculptureCenter.The museum will also receive $1.2 million from the auction house to support its upcoming years-long celebration of its centenary. The budget for the event, which will mark the museum’s 150th anniversary, is still to be determined.\n\n\nThe San José Museum of Art (SJMoA) has awarded $12.5 million to thirty-six artists who were nominated by the curators of the September 2018 exhibition “Beyond Corbin: Art and Performance in the Age of Color” at the Hammer Museum. The awardees were chosen by a jury comprising David Campbell, Ruth Wilkes, Paul Mpagi Sepuya, and David Peiffer and was announced at the Hammer’s Annual Awards Dinner on September 17.“A year later, we are pleased to announce that these thirty-six nominees have been selected for the 2019 Hugo Boss Berlin Biennial,” said museum", "The next Biennial should be held in 2021. The moviemakers will be invited to present works in the exhibition, which will be curated by Michael Pina, from January 23 to January 26, 2021. The exhibition will feature more than twenty new works and will be organized as a series of collections of short films.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to reopen to the public in the spring of 2021. The reopening will mark the first time the museum has re-opened since 1986.“We are very excited to open our doors to the public in the spring of 2021,” said Mark Weiden, general manager and chief curator of the museum. “The new exhibition spaces, the redesigned galleries, and the expanded collection are designed to celebrate MoCA’s history as the first American institution to open in the Mojave Desert in the American West. We have a new exhibition program that will focus on MoCA’s members and the contributions of their artists, new works by artists whose works are on display in the spring, and a renewed sense of mission and purpose.”A selection of works by thirty-five artists from the exhibition “Midway,”", "The next Biennial should be in the spring of 2021. \n\n\nThe New York Public Library sold four of the works by artist Kevin Beasley—one of them is for its collection, on display in its office as part of its ongoing project “Bicycle Culture: Notes,” which is funded by the Metropolitan Museum of Art and the artist’s heirs. The works—including “Feminine: Black and White,” 1978, a group show on the work of photographer Robert Irwin, and a work by the American painter Francis Alÿs—were acquired in 2017 by a collector, the California-based artist Pamela Tillman, who had been trying to secure their return for more than a decade.The works, which were part of a major exhibition organized by the Los Angeles County Museum of Art (LACMA), were originally published in the September 1974 issue of Artforum. Among the works on display in the exhibition were two works by Beasley, one of which was on display for the first time in the catalogues of the San Francisco Museum of Art and the New Museum of Modern Art. The other three works, which were previously included in the exhibition, were originally published in the December 1974 issue of Artforum.", "The next Biennial should examine the relationship between literature and science. “We cannot escape the fact that the future of the humanities, and the future of our species as a whole, depends on how we respond to and conceive of the natural sciences,” said Helen G. Gallo, chair of the museum’s advisory board. Gallo will be a cochair of the new event, which will be led by Richard Armstrong, director and curator of contemporary art at the National Gallery of Art in Washington, DC.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than six hundred works by forty-nine artists, including Brian Eno, Douglas Gordon, Carlotta Corpron, Jean-Michel Basquiat, and John Crowley, as well as a selection of contemporary art from the Nikola Tesla Biennial in Prague. The acquisition includes works by Frances Callen, George Segal, Jean-Michel Huyghe, and M. A. Zakora, among others.“The Tesla Biennial was an unprecedented event,” said Matthew Rothschild, director of the LACMA. “With this collection we are delighted to support the work of artists whose careers and visions", "The next Biennial should take place in 2021, with the 2019 theme “Life after death: a journey to the other side.”\n\n\nThe Egyptian Ministry of Culture has announced that it plans to create a new monument commemorating the seventy-nine Egyptian soldiers who were killed by the Islamist group Islamic State (also known as ISIS), as well as some ten thousand civilians, in a military operation that began in the Sinai Peninsula on March 26.The events that unfolded in Egypt after President Abdel Fattah el-Sisi announced the establishment of the National Democratic Forces (NDF) in April 2019, including the clashes between security forces and protesters, led to protests in several cities, including Cairo, Sisseton, and Alexandria, and the government responded with the formation of the Army Command of Antiquities in September.\n\n\nThe BBC reports that the outbreak of the coronavirus—which was first discovered in Egypt in February and confirmed in July—makes the coronavirus epidemic all the more urgent. While the number of confirmed cases is still relatively low, the coronavirus has infected more than 1,300 people worldwide and the death toll is expected to rise. The virus remains contagious even when the body has stopped producing the virus. As of Tuesday,", "The next Biennial should take place in 2020.\n\n\nThe Museum of Art (MoA) in New York has restored a work by a Chinese artist who was imprisoned for more than two decades under the country’s notorious man-made Gansu Biennial in the 1980s. The exhibition, Be/longing: The Shadow Factory, was staged at the museum since 2010 and premiered in August. It depicts a group of adolescents building a toy factory in a rural area of central China’s Gansu Province. The exhibition was inspired by a speech given by Gansu artist Wang Zhishu in 1981. In an interview with the artist who was imprisoned for seven years for his work, Wang explained that the exhibition has several themes including “creativity, the collective, the environment, and the body” and thereby is clearly political. The exhibition was also highly symbolic in its time and in how it was staged. It was one of the last major works held by the artist.“I’m thrilled that we’re finally able to stage this exhibition in the Museum.” Chen-Hsiung Lin, director of MoA, said: “The exhibition was a chance to see the work", "The next Biennial should be on the exhibition, “The Construction of Modernism” (2019), which focused on the development of the Italian artist-maker Gian Lorenzo Bernini\u0097a notorious ideologue who converted to Catholicism and converted to a spiritual path in the process\u0097in late April. The artist-maker is currently best known for his sculptures, which often reference mythical and mythical worlds, and his ephemeral and ephemeral forms of art.\n\n\nThe Venice Biennale will now take place across five continents, from March 16 to March 20, 2020. The 2020 edition will be curated by Grazia Vecherni, who is currently organizing the exhibition in partnership with the Milan-based company SculptureCenter. The event will also involve the exhibition of work by artists from underrepresented regions of the world, including Jamaica, New Caledonia, and Palestine.“Many of the artists who participated in the Venice Biennale of 2010 are represented in SculptureCenter’s exhibition this year,” said Roberta Smith, director of the company. “The themes for the exhibition will be the following: ‘Traveling Light,’ an exploration of the metaphysical potential of light, and �", "The next Biennial should be held in 2021.\n\n\nThe Willamette Valley Arts & Heritage Center (WVAC) in Salem, Oregon, has been awarded a $10,000 grant from the Robert Rauschenberg Foundation in support of its efforts to increase the visibility of art through the arts and culture. The four-year grant program, which was established in 2016 to support the work of emerging and established artists and restore spaces, was established in recognition of the impact that the arts can have on the community and the support that can be given to those working to create awareness and appreciation of art through the arts.“This year’s award cycle is a great reminder that we are a global community of creative people working together to make a positive difference in the world,” said Mark Rauschenberg, chair of the foundation. “We are grateful for the support of the WVAC board, staff, and the community. We look forward to continuing to work with the WVAC Board and staff to support and facilitate their vision for the valley.”The donor is the Willamette Valley Council, which has supported the arts in the region for over a century. The council is made up of six members: Gerald,", "The next Biennial should take place in 2020 and will take place in the UNESCO World Heritage site of the city of Kiasma, in the north of Japan. The museum will also be expanding the collection and the exhibition space.The exhibition will include the work of forty-five artists, including Alec Guinness, Anish Kapoor, Jean-Michel Basquiat, Lisa Molaro, Lisa Marie Presley, and Tanya Poroshenko. The first Biennial, “Life and Art,” will be held at the Art Museum Tokyo, the Art Museum Biennale in Prague, the Art Museum für Kunststwerk in Stuttgart, and the Art Museum Stuttgart. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $100,000 donation from the Eugene and Lucy Law Foundation, the Los Angeles–based arts philanthropists. In commemoration of their lifetime commitment to the arts, the couple are giving $100,000 each to the institution. The gift was announced by the foundation in collaboration with Elizabeth Catlin, celebrity attorney and philanthropist; Phil Collins, founder of the label, label, label; and attorney Ronald Oppenheimer, who is also a cochair of", "The next Biennial should take place at least six months after the previous one. The proposed date for the new show is February 23–March 8, 2020. \n\n\nThe seventeenth edition of the Delfina Arts Exchange (DFA) has been postponed to March 13–March 16, 2020. The February 11 announcement that the event would move to the Delfina Arts Center in Venice, Italy, galvanized more than one hundred arts professionals and arts organizations to support the Costa Rican government and the Arts Council. “It is a very important step for Costa Ricans to be able to see the revised DFA’s theme Contemporary Art’s Future in a very new and challenging way,” said Costa Rican Minister of Culture, Laura Perón. “Today marks a new chapter in our history, and it is an opportunity to celebrate culture with an international exhibition of a new generation of artists, selected by the country’s committee of curators.”The DFA, which is cofounded by Stefan and Sabine Delfina, was forced to cancel a second edition of El Museo del Prado, an annual event that drew around seventy thousand visitors, following the terrorist attack in Paris on November 13,", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced that it has received a $1.1 million donation from the Koch brothers. The gift includes $850,000 for the museum’s National Gallery, which was established in 1958 and is located on the ground floor of the former site of the Giant's Causeway in Japan, and $350,000 for the museum’s largest art museum, the Metropolitan Museum of Art, which opened in 1964.“The Kochs were one of the first wealthy families to establish a major art museum in the United States,” said museum director James Agustín. “They were also one of the first families to establish an institution in Los Angeles that would have been constructed on the same site as the Giant’s Causeway, the former site of the former home of the International Association of Shopping Centers. The donation also includes $100,000 for an exhibition that will focus on the legacy of the Koch brothers and their art, and a new program that will explore the environmental impact of the family’s art.”The Koch brothers are a family dynasty whose roots go all the way back to the late nineteenth century", "The next Biennial should take place at the Noguchi Museum, in New York City, in January 2020, and will be the first year the event will be held in the United States.\n\n\nThe UCLA Art Museum and Pacific Film Archive (UMPFA) in Los Angeles has welcomed five new members to its board of trustees: artist Christopher Wool, whose work has been included in the Los Angeles County Museum of Art (LACMA), and artist and UCLA Film Archive curator, Anne-Marie Talbot-Smith. Talbot-Smith will serve as a trustee for the first time, and she will become the university’s first woman to chair the institution’s board.“We are extraordinarily pleased to welcome these five distinguished artists to the board of trustees, and to be able to welcome these artists to UCLA,” said UCLA president Michael Rand. “Their diverse interests and histories, combined with their extraordinary careers and professional paths, make them ideal for trusteeships.”Talbot-Smith joined the institution in 1994 as a curator of contemporary art. Since then, she has curated several award-winning exhibitions, including “Origins of Modern Art” (1999) and “The Future of Modern Art” (", "The next Biennial should be in 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of seventy-four paintings, prints, and drawings by four of the four great European painters: Pierre-Auguste Renoir, Artur Neubert, and Monet. The works, which were donated by Jean-Luc Godard, Francois-Xavier Hège, and Richard Ontwell, will be showcased at the institution's inaugural biennial, “The Producers,” which will run from March 19 to March 21 at the Museum of Fine Arts in 2021.The gift includes works by Renoir, Godard, Hébert, and Ontwell together with a new work by the Belgian artist, Annemarie Zilek, whose groundbreaking late-Victorian works together with Renoir are replete with ecstatic vignettes of women and men wearing masks and gazing into mirrors. The gift also includes works by the Dutch master Julien de Kooning, whose surrealistic, Picassoian landscape paintings are punctuated by lens flares, ghostly figures, and other effects reminiscent of Renoir’s. The work by the German artist Otto Strachan, titled “The Hour", "The next Biennial should take place in North Carolina in 2022 and will be in conjunction with the biennial “Feminine” (2019) and its ten-week run in October 2021. The 2022 event will be the first major retrospective devoted to the artist’s work since 2010. In 2018, the show opened at the Gaylord Opera House in Middleton, Massachusetts, and drew about twenty-five thousand visitors.\n\n\nThe National Endowment for the Arts (NEA) announced this week that it has created a new $500,000 fund for creative research and its arts-based programs. The fund will be administered by local state and local government entities in the fifty states and the District of Columbia and will prioritize funding from arts-based organizations.“The NEA will support the research, develop strategies for improving access to and provision of arts-based resources, and deliver on the promise of arts-based programs,” said Elizabeth Hanrahan, director and CEO of the NEA. “This year’s grant cycle has been remarkable and we’re grateful to all the grant recipients who have made this year an example to follow.”This grant cycle has also been challenging for many programs, given", "The next Biennial should be held in 2021. Škoon is working with producer Nina Langret to create a project that is set in a contemporary art space. “At the forefront of future thinking, the exhibition will examine how architecture and design actively shape the bodies and minds of contemporary artists, judging from an array of submissions based on a single theme,” Kalin said. The Biennial will also include a platform for authors and artists to present their work, which will be curated by artist Edwidge Danticat. Artnews reports that the event will be part of a larger initiative by the Škoon Gallery to extend the reach of its arts and cultural programs across the globe.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift from the Los Angeles County Board of Supervisors in support of its arts and culture funding crisis. The $8 million gift comes from County Supervisor Mark Ridley, who represents the city of Los Angeles, and is the largest gift the museum has ever received. The museum established a $2 million cultural fund to combat the Covid-19 pandemic in the city in 2017, and the fund was renewed in 2018.“What we are witnessing right now is a", "The next Biennial should be held at the Skowhegan Museum of Art in Lewiston, New York, in 2021. The biennial will feature four works by artists whose work was selected from a group of forty artists.The biennial will consist of a number of exhibitions, including “The Dreamers,” an exhibition of works by artists who represent diverse cultural and linguistic backgrounds; “The Birth of the Nation,” an exhibition exploring the history of African American art; “Polaroids,” an exhibition focusing on the art of photography; and “The Colour Out of Space,” an exhibition exploring the history of Chinese painting.“The panelists for this year’s biennial are:Timur Bochereau, Florence, Italy; Danielle Coley, New York; and Agustín García-Santos, New York City.”In her inaugural performance, Coley reimagines a time when mysticism was still largely confined to religious traditions and the arts. “The dreamers” are her references to images and dreams of a luminous Northern California sky, where she grew up. “The colour out of space” imagines a landscape submerged in", "The next Biennial should be held at least twice a year, with the first event, “2033: a retrospective of all the works submitted to the exhibition’s 20th anniversary. The programme should aim to present five issues in the exhibition, of which three are selected by the curator.”Paris’s Musée d’Art Moderne, which staged the last iteration of the exhibition in January 2018, announced that it will move from the city of Lyon to the city of Montpellier. The move follows the France–Germany-Budapest exchange program, which will now be led by the Musée d’Art Moderne, which has an office in the city of Lyon. The move follows a chain of events that has seen the setting of the Musée d’Art Moderne—a former ironworks in the city, which sits on the Rhone River in the Seine Valley in the southwestern suburbs of Paris—become a symbol of modernity and creativity in Europe. The Musée d’Art Moderne is an extension of the town of Moulène, in the Seine-et-Marche region, which has hosted the series of exhibitions known as Tate Modern", "The next Biennial should be held in 2021.\n\nThe biennial’s curator, Sébastien Massolé, said: “The fact that the exhibits are currently being developed next to each other, and how the exhibition will be presented, will give a new dimension to the works.”The exhibition will also feature a new collection of new works by artists such as Hans-Ulrich Obrist, Miguel Ojeda, and Arsht Karimi, as well as works from the first museum in the city to be inaugurated by a woman, the Mercedes-Benz Arena, in 1990, which opened in 1997. The exhibition will feature a plush African giraffe, a first for the exhibition, and the first work by the Danish artist Alÿs.\n\n\nThe British artist and philosopher Sophie Elin has been named the seventy-fifth winner of the $50,000 Ecole des Beaux-Arts (BEAU) Prize. The prize honors the influence of Elin and her contemporaries in the line-art, art-world, and design spheres in their recognition of their contribution to European modernism. “I", "The next Biennial should focus on “The Unseen Body: Art and the Flesh” (2019), which will take place at the San Francisco Museum of Modern Art, and “Future Present: Art and the Presenting Body” (2019), which will be held at Max’s Mary Cassatt. The 2019 event will award $10 scholarships to students from the Bay Area, California; Portland, Maine; and Washington, DC. The 2020 event will culminate with “An Evening with the New York Anthropo-Composers.”Joan Brown, the director of the Black Museum in Harlem, New York, and a trustee of the Black and Native Arts Education Fund, said: “I’m thrilled to support the Black and Native Arts Education Fund and the Black and Indigenous Studies program with these four scholarships for our students. I’m especially proud to see that these four students will be the first to graduate from Black and Native Studies program at the Black Museum. Our program has done a tremendous service to Black communities and Black artists over the years by providing them with critical training in critical issues such as representation and the instrumentality of Blackness. The scholarship grants will enable our students to move beyond the contemporary", "The next Biennial should begin as planned sometime in the second half of the year, but the organizers are asking for people to remain calm and continue to work, sharing resources and ideas widely and keeping each other in touch. “The museum is facing unprecedented challenges right now, and as people continue to come back from the brink of extinction, we as a community must remain focused and resilient,” Charles said. “We are all in this together, and we will continue to do so.”\n\n\nThe Metropolitan Museum of Art (the Met) has appointed Helen Cammock as its next director, effective immediately. Cammock will be responsible for overseeing the development and management of the museum’s collection and operations, which include the collection of artworks, programming, exhibitions, and collections, and the collections of the American Art Museum, the Museum of Modern Art, and the Museum of Contemporary Art.“In an age of unprecedented environmental and social challenges, Helen brings a wealth of experience and knowledge to the Met,” said John Rojas, chair of the board of trustees. “Having worked with Helen for more than a decade, I’m confident she will deliver on the visionary mandate set by the board of trustees", "The next Biennial should be held in 2020–21.\n\n\nSpeaking at a biennial (referred to as an art event) is one of the most powerful ways to show your appreciation of art and to raise awareness of the health and well-being of artists and their communities. With that in mind, the Los Angeles County Museum of Art and the Metropolitan Museum of Art have issued a joint statement on behalf of all four of their museums, which declare that they will begin accepting visitors after the expiration of their temporary license plates on Wednesday, April 3.This announcement comes on the heels of a monthlong campaign by Los Angeles–based artist Hélio Oquendo to highlight the health and well-being of artists by raising funds, engaging with institutions, and speaking to audiences through his website, Hélio Oquendo Fundraiser. The duo have raised more than $105,000 thus far and have a goal of $200,000 to raise. Oquendo has since announced plans to hold a fundraiser for the network at his home in Santa Monica on Saturday, April 21. The event will be free and open to the public.For the Los Angeles–based artist, the move is a necessary first step towards achieving his goal of giving back", "The next Biennial should see the four artists represented by the Museum of Modern Art (MoMA) in New York, the Museum of Modern Art (MoMA), the Metropolitan Museum of Art and the Whitney Museum of American Art in New York, and the Museum of Contemporary Art (MoCA), Los Angeles.The institution also revealed that it will hold two more biennials, “The Art of Modern Life” and “The Art of Movement,” in 2020 and 2021, respectively. The biennials next iteration will focus on the art of the twenty-first century, with the artists participating being Alexis Barozzi, Andrew Carlotta, Salah Mohammed, A.O. Scott-Jones, and Sean Himberg.\n\n\nThe Fair of the Arts Berlin (FAB) announced today that it will not resume its March 21–March 23, 2020 edition, which was canceled due to the Covid-19 pandemic. In a letter addressed to the participants, the organizers wrote: “Due to the ongoing health crisis, we have decided to postpone the FAB 2020, which will be staged in March. We are, however, very much looking forward to the future, and the opportunity to present an exhibition of works by the", "The next Biennial should take place at the Museo de Arte Contemporáneo di Roma in Rome in November. The Venice Architecture Biennale will take place at the Museo de Arte Contemporáneo di Roma in June. The exhibition will also be presented in May 2021 at the Museum of Modern Art, New York, and will be held in conjunction with the Milan Triennale. \n\n\nThe London-based cultural nonprofit the Tate has agreed to create a new five-year chief executive officer position in the arts and has appointed a new board director. The appointment was made in the summer of 2020 and follows the departure of former CEO Ben Stephenson, who joined the museum in 2016 following a 15-year tenure as the head of the RSC, which operates Tate galleries and the Tate’s London edition. Tate’s board chairman, Carmel Allen, said: “Ben and I are incredibly proud to have had the opportunity to serve as CEO of Tate and to support the museum’s exciting and vibrant future. I am confident that he will continue to inspire and guide Tate for years to come and that he will always be an immensely valued member of the board.”\n\n\n", "The next Biennial should be held in the spring of 2021. Wardrobin is hoping to raise $600,000.“We are thrilled to be working with the Baltimore Art Museum (BAM) and the Baltimore Museum of Art to present the new exhibition ‘Art in the City.” The show will feature work by forty artists and will run from April 21 to May 11, 2021. Antony Hudek, the director of BAM, said: “The upcoming exhibition Biennial will be a unique milestone in establishing a new foundation for new artistic practices and in celebrating the modern city. We will have two exhibitions devoted to the artist, a concert series, a film festival, and the biennial’s first iteration will probably be the most spectacular.” The Biennial of British Art, curated by Adrian Piper in partnership with Tate and the London-based artist and educator Angela Pape, will inaugurate the museum’s new exhibition space, the former Cooper-Hewitt, the new Cambridge library, and the new South Bank Arts and Galleries. The biennial will also introduce two new works by British contemporary artists, Hayley Williams and Mary Pickering, and will run", "The next Biennial should be held in 2021. For a full list of the museum’s current exhibition programming, click here.\n\n\nThe Venice Architecture Biennale is returning to the city of Venice for a fourth edition, titled Venice Architecture: From Architecture to Nature, in 2022. The theme of the exhibition is “How a Landscape Could Be a Nation,” and a number of new works by sixteen artists from the Italian city will be presented alongside works by famous architects such as Edward Hopper, Jan Svendsen, and Oscar Niemeyer. “The MOMA-designed works in the exhibition are a tribute to the twenty-five years of the MOMA’s partnership with the city of Venice,” said Venice Mayor Marco Minotti. The works, which were created by the artists contracted by the museum in 2013 in order to reconstruct its former Pantheon Theater complex, are assembled around a theme park-like structure that reassembles the cityscape as if it were a nation. This exhibition will include works by the artists whose works were featured in the previous editions of the Venice Architecture Biennale and will be preceded by a retrospective of the works of artist Imogen Cunningham, which", "The next Biennial should focus on “cultural continuity,” and might be staged as a “nation-state” exhibition, or perhaps as a “museum of the contemporary.” The exhibition is currently on view at the Württembergischer Kunstverein, Berlin and will be presented in the fall of 2020. The biennial will be inaugurated by a new artist-in-residence, a show of works by Vienna-based artists Jan-Olov Stieglitz and Wolfgang von Rintoul, and will have the first part devoted to the history of the Württemberg, the second to architecture in the city, and the third to modern art in the country, in the autumn of 2021.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has received a gift of more than 1,800 photographs and prints by artist Stanley Prince. The gift includes more than sixty works created using the medium of film, including photographs of the writer John Steinbeck, the Los Angeles riots in 1967, and Prince’s own son, Alexander, who was among the thirty-eight people who were killed when a tractor-trailer carrying his work, “", "The next Biennial should be held within the next two years. The next exhibition should be launched in the spring of 2021. The next conference should be held in the fall of 2022. In sum, the next 18 months will be devoted to thinking about the possibilities and the legacy of the biennial. \n\nOn Tuesday, the City of New York announced that it is planning to open its first public art museum in the Bronx in 2021. Titled the Bronx Museum of Art (BMO), the institution will boast five thousand square feet of exhibition space, a 25,000-volume collection, and a 360-degree view of the Bronx from the 30,000-square-foot BMO, as well as a café, a library, and a rooftop terrace. According to an announcement about the museum, the institution will be housed in a former manufacturing facility in a former auto assembly plant in the Bronx, adjacent to the Museum of the City’s iconic Central Park. The institution will also boast an auditorium, a concert space, a café, and a rooftop garden. When the BMO’s grand opening is slated to kickoff in 2021, it will be the first of two Bronx museums (the BMO and", "The next Biennial should be held sometime in 2019.\n\n\nA group of artists and collectors are organizing a fundraiser for the Baltimore Museum of Art (BMA) in honor of the victims of the unrest that took place in the city last summer. The event, which will be held at the museum from September 19 to September 21, will feature artworks and projects that were created by people, institutions, and organizations who were affected by the unrest, as well as artworks that have not yet been exhibited. The event is organized by the Artists’ Legacy Fund and will be hosted by the BMA’s new organization, Baltimore Art + Soul. “The BMA is benefiting from the generosity of our donors and partners across the city, including the William P. Bradley Foundation, the Arthur M. Sackler Foundation, the Helen DeVos Foundation, and the Pritzker Foundation, and we are grateful for their continued support,” said BMA director Christopher Bedford. “This is a collective effort to help the BMA to recover from the impact of the coronavirus and to continue to exhibit works that reflect the rich and vibrant legacy of Baltimore. We are confident that we can recover and thrive under the circumstances.”The event will"]