["The next Biennial should be introduced by the British Museum in London in 2022, but its organizers are wary of its existence in the first place, since they fear the shutdown would reignite the ongoing climate emergency. “There can be no doubt that the crucial work of art in the biennials will have been severely compromised,” said director Maria Balshaw. “The risks of a severe disruption on the scale of the Copenhagen and Copenhagen Conferences cannot be overstated. We are determined to fight to the last day to protect the Biennial’s vital programming.”A statement issued by Tate said: “Tate is committed to providing safe, secure and creative spaces for the widest range of audiences possible, and we are preparing for the risks that the new biennial will present. We are also working with our partners to consider how we can best support the exhibition and exhibition programme moving forward. We are in discussions with industry and art experts to hear their views.”\n\n\nThe Solomon R. Guggenheim Museum in New York has hired Sherry Ho to helm its design-centric design program. Ho, who previously served as curator at large at the Metropolitan Museum of Art in", "The next Biennial should be held in 2021, and the first in 2022. \n“What we are now witnessing are the beginnings of a new kind of political reality,” Paulo C. ismali, president of the Brazilian Association of Curators, told Artnet. “This is progress, but not revolutionary: it is the next step.”\n\n\nIgor Sargent, the British artist whose powerful re-creations of Nazi symbolism have been appropriated and twisted by white supremacists, has died at age eighty-eight. After a court ruled in 2015 that his Confederate bust of General Robert E. Lee—a monument dedicated to him by lawmakers in 2017—could remain in place, Sargent fought a legal battle to keep the Confederate monument in Richmond, Virginia, and was awarded $6 million in damages.In March 2019, Governor Ralph Northam of Virginia, who was running for mayor on a platform of deporting felons and reforming the city’s criminal justice system, signed a bill that temporarily halted the removal of Confederate monuments. The move came amid a statewide campaign to remove the controversial works from American cities, states, and institutions, and many activists argued that the move was a prelude to enacting sweeping legislation", "The next Biennial should be held at least twenty years from now. . . . I hope that this year will be the last. I cannot imagine a better time to start a new journal. To dedicate our time and resources to the study and appreciation of the historic works of renowned and obscure artists.I am delighted to welcome you to the biennial. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has launched a new initiative aimed at increasing the visibility of emerging and established artists and the museum’s collection through a series of public performances, screenings, and other events. The program, called the “Open Studio” program, will offer free public programming in the building’s courtyard on the third floor of the museum, in partnership with the artist-in-residence program in the museum. The first Open Studio, highlighted by curators Stephanie Boysen and Thomas M. Higgins, will run from March 23 to March 26. The second Open Studio is on view until March 28. The third Open Studio, curated by Boysen and Higgins, will be on view until March 31.“The Open Studio’s purpose is to provide opportunities for individuals to develop their own theatrical performances and to support the growing", "The next Biennial should be held in the fall of 2020, with the first exhibition being dedicated to the Cultural Revolution in the spring of 2021. \n \n\n\nThe British Museum in Beijing has released the first images from its new exhibition “Onwards, Forward,” which will run concurrently with the Beijing Biennial and the Venice Architecture Biennale, in the fall of 2020.The show, which will focus on the history of art and design through the lens of Chinese twentieth-century architectural theory, is the brainchild of British curator Alex McKinnell and British architect Marc Glimcher. The Memphis-based duo created the show, which will be curated by McKinnell, an architect, and Glimcher, a designer, after the demolition of the Chinese Cultural Center, the Institute of Contemporary Arts, and the Tate, which were built in the 1970s and 1980s as part of Beijing’s redevelopment project. “In a world increasingly obsessed with physical objects, the museum is concerned to re-create a more welcoming and exciting environment for visitors to our collection,” the museum said in a statement. “With the opening of this new section, which looks to encompass the history of art and design from the Chinese", "The next Biennial should take place in the spring of 2020, according to the organizers. “The new Museum of Modern Art, which was inaugurated by Andreas von Humboldt in September 2016, will be an extension of this program. In addition to the exhibition and the collection, the new Museum will provide visitors with an additional platform for sharing experiences with artists and will host programming of a cultural and intellectual nature.”\n\n\nThe Oregonian/OregonLive has learned that the new $64 million, 5,800-seat museum will celebrate its ten-year anniversary this fall with a retrospective of artist-in-residence Paul Gauguin’s work, “After an Epic Quest,” which will open on December 8. The exhibition will feature work by eighty artists from twenty-six countries.The biennial version of the festival will be staged at the Portland Art Museum, which is still under construction, and will also feature art from the wares of more than twenty-five international artists, including Shimon Adami, Katsu Nara, and Nathan Rabin, as well as from Belgium, France, Greece, Italy, Mexico, and Sweden. The biennial will span an eleven-day", "The next Biennial should be held in 2021.\n\n\nThe Metropolitan Museum of Art and the Solomon R. Guggenheim Museum in New York have announced that they are collaborating on the construction of a new underground complex for the exhibition “The Metamorphosis,” a temporary exhibition that will be staged across twelve venues in the museum from November 22–November 26, 2020.The partnership between the museums was originally announced in 2016 in an exhibition about the history of photography at the museum, but the project was scrapped after the death of artist David H. Parnell. In 2018, the Guggenheim agreed to return the works of the twenty-two-year-old Parnell. The eighty-nine-acre building will offer exhibition space to the artist’s work for a series of lectures and will be dedicated to “Parnell’s visual experience.”The partnership between the Museum of Modern Art and the Metropolitan Museum of Art is known as the Metamorphosis. It will inaugurate a new exhibition, “Parnell and the Metamorphosis,” at the museum in November 2021. The first half of the exhibition will be dedicated to “David Parnell’", "The next Biennial should focus on the interdependence of forms and the body, and on the biennial as an ideal model of contemporary life. The exhibition will also include a writing program, with an initial selection of twenty-four essays.The exhibition will open at Baltimore’s City Hall in 2021 and will run through March 2022. The first iteration, titled “Before the City,” was staged at the Museum of the City of New York in 2015 and attracted more than 2,500 visitors. The second iteration, titled “After the City,” was staged at the Museum of Modern Art in 2016 and attracted more than 3,000 visitors. “We’re not about to start over again,” said Museum Director John Prine. “We've got an opportunity to do something very different.” \n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of works by thirty-eight artists in its Cultural Landscape program, which leverages city-owned buildings and cultural assets to create new work for the public. The guidelines were developed by city cultural historian David J. Zasloff, who is currently a PhD candidate at the City University", "The next Biennial should coincide with the opening of the new exhibition “Biennials: Artists as Organizers.”In a statement, the Biennials said: “This is a moment of great change for creative practice. We are thrilled that the biennial will continue to attract and support the very best work in the same exhibition spaces where it has been presented for thirty years. The opening of the new exhibition ‘Biennials: Artists as Organizers’ will allow us to take the catalogue to the next level, in an exhibition that will engage with contemporary issues in an exhibition that will be transformative for our audience. Our exhibition will be a reflection on the biennial’s history and will be taking place at a time when, in the words of the group, ‘we are all here. It will be a project for the future of art.”The Biennials will open their exhibition on October 12, 2019. The Biennials: Artists as Organizers will open on November 5, 2019.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Katherine Russell as its new director. Russell comes to the institution from the Museum of Contemporary Art (formerly the Hammer Museum of Art), where", "The next Biennial should be called “The Impact of Knowledge: Knowledge Politics” and will take place in the year 2026. The exhibition will provide the first glimpse into the new digital age.“We are thrilled by the prospect of hosting the next Biennial in Tokyo,” said Toshio Oda, director of the Hirshhorn Museum and Sculpture Garden. “We will carefully review the exhibition’s programme and exhibition, and will have an open and informative program that is timely for the contemporary human condition.”\n\n\nChicago-based dealer Michael Moffatt-Williams has been named the next president and CEO of the American Alliance of Museums (AAM). He succeeds John Conyers, who announced his resignation from the position in the midst of a controversy involving a self-plagued and expensive art museum in Michigan.“In a letter written by Conyers on June 28, he called for the immediate termination of Michael Moffatt-Williams’s contract, the American Alliance of Museums (AAM), which has been contracted with the Michigan Museum of Contemporary Art (MMCA), and for the masonry-works museum to “re-open” as soon as possible,” reads", "The next Biennial should be in 2020, the year of the Palestinian national movement, Yom Kippur, and the year of the first Arab Spring. The institution also announced that Cameron Rowland, the curator of the exhibition “Polar Express: The Art of Polarization”, will be curating the second edition of the exhibition, which will take place at the Kassel-based museum in 2021. The exhibition will be organized around a rotating group of artists who have exhibited their work in various exhibitions around the world since the 1930s, including Alexander Calder, Yom Kippur, and the Guangzhou Biennale, and will have a different theme each year.The Melbourne-based artist and activist Tashael Abou-Rahme, who is known for her provocative painted landscapes and installation, which encompass issues including the environment and language, was named curator of the exhibition “Polar Express” by the fair’s artistic committee. Known for her work in both abstract and physical form, which is often paired with work by other artists, the artist often challenges the conventions of the art world and the art world’s relationship with its clients. In 2016, for instance, she and artist", "The next Biennial should focus on the upcoming arrival of immigrants in the UK, the impact of migration on the labour market, and the role of art as a vehicle for social progress.”\n\n\n\n\n\nGilberto Obrador, Brissa del Pilar, and Ólind Szymczyk\n\nThe Showroom, London, 2019. Courtesy of the artist and Museum of Modern Art, New York.\n\nAmerican artist Gilberto Obrador was born in New York City in 1931 and grew up in the city of Toledo, Ohio, where his father manufactured automobiles and served as the family's main source of income. Over the course of his life, Obrador’s art has been exhibited at numerous international exhibitions, including the Venice Biennale in 1957; the Bridget Riley Museum of Art, New York; the Walker Art Center, Minneapolis; the Museum of Contemporary Art, Houston; and the Metropolitan Museum of Art, in New York.His work has been collected by the Metropolitan Museum of Art, the Whitney Museum of American Art, the San Francisco Museum of Art, the San Diego Museum of Art, the Museum of Modern Art, the Museum of Fine Arts, Boston, the Museum of Fine Arts, New York,", "The next Biennial should be in 2020.\n\n\nThe Institute of Contemporary Arts (ICA), London, has donated $5.5 million to ten charities in support of “future generations of artists.”The funds will go toward the development of programming and the acquisition of new works. ICA director David Murray said: “It is vital that the arts fund future generations of artists for future generations. ICA is committed to working with partners to ensure that the Institute is able to support future generations of artists and to ensure that future generations of artists receive the support that ICA provides. ICA will continue to support these artists, and future generations, by supporting the arts through my work.”The five organizations named are the Allen & Unwin, the Andrew W. Mellon Foundation, the Andrew W. Mellon Foundation for the Arts, the Andrew W. Mellon Foundation for the Humanities, the Andrew W. Mellon Foundation for the Arts and the Andrew W. Mellon Foundation for the Arts, which funds the Institute for Art and the Future.The donor list includes five British arts organizations: the British Film Institute, the British Film Institute Foundation, the British Film Institute Ltd., and the British Film Institute. In addition,", "The next Biennial should take place in 2022, and the first in 2020.For the first time, the festival will be held in the city’s central square. The location was chosen to maximize the amount of city-owned space devoted to artistic activities, and to bring together the best of East London, and to retain as much of the original feel of the borough as possible. The new venue will have a newly commissioned Indigenous Art Gallery, a refreshment bar, and a café featuring a new range of teas, juices, coffees, and teashops. The building will also host an Indigenous art exhibition in 2020.The exhibition, “The Dummy,” which will highlight contemporary exhibitions that examine the role of contemporary art in everyday life and will also feature work by a select group of artists, will be organized by the London Legacy Art Gallery and the London Academy of Arts, and will run from November 1 to March 3. The museum will also be remodeled to better accommodate the museum’s current exhibition space and the museum’s expansion plans, and will incorporate new galleries and exhibition spaces. The building’s interior will also be updated with more Eero Saarinen memorabilia, and new public artworks", "The next Biennial should be in the fall of 2021 and will seek to create a new kind of narrative for the exhibition’s history, one that acknowledges the exhibition’s profound relevance for audiences of all ages.” The invitation-only event was established by the American Ballet Theater to recognize the contribution of the United States to the Art of Dance. The first exhibition was staged by the American Ballet Theater in New York in 1924. The Biennial will feature works by twenty-three artists, including Paul Gauguin, Adam Dallin, Robert Frank, Willem de Kooning, Robert Irwin, and Marisa Tomei, among many others.\n\n\nThe Gemäldegalerie in Berlin, a private museum founded in 1960 by two brothers and an architect, is planning to open a new museum in the city’s Kreuzberg district. The Munich-based developer, Dieter Hütte, said the venue will host twenty exhibitions annually and will be able to host up to 1000 people.The company behind the new museum, Gemäldegalerie/Pace, confirmed that it is working with the Kreuzberg-based architecture and design company Sint-Germain on the project", "The next Biennial should take place in Tokyo 2020, which is also scheduled to open in December 2024. Interested parties can visit the Biennial's website to find out more.\n\n\nThe German state of North Rhine-Westphalia (NRW) has received a $6.7 billion bailout from Germany’s federal and regional governments, the European Commission, and the International Monetary Fund (IMF), which aims to mitigate the impacts of the coronavirus on the German economy. The sum is more than ten times the original proposal for the 2018–19 season. The sum was raised in a series of agreements between the federal governments of North Rhine-Westphalia and North Rhine-Westphalia’s federal president, Horst Seehofer.The NRW-North Rhine-Westphalia coalition government has also allocated $1.6 billion for the 2019–20 season. The sum for the 2020 campaign is roughly three times the original sum for the 2018–19 season, and will be used to extend the deadline to March 31, 2021. The end date for the 2020 season is March 7, 2021.The program also includes a series of loans that will be repaid over the course of the 2020 season, which", "The next Biennial should have an opening of no later than September 2021. The deadline for submissions is April 5.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Yorgo Bianchi as the next director of the museum. Bianchi will begin his position in January 2022. He succeeds Sara Cwynar, who resigned in April 2019 to become a professor at Columbia University.“I’ve been an admirer of Bertrand and of the culture of the museum,” said Bianchi. “I’m excited to be working with the talented and talented team at MoCA, and to continue to develop and shape the trajectory for the museum as a whole.”Born in the small town of Tamir, in the French region of Aix-en-Provence, in 1949, Bianchi studied anthropology at the University of Cagli and then at the University of California, Berkeley, where he earned a Ph.D. in design from the Graduate Center in 1967 and was a faculty member until 1971. He returned to the University of California, Los Angeles, in 1973 and had his first tenure there as director of museum planning in 1978. In 1978, Bian", "The next Biennial should include a presentation by Yoko Ōmoto, who will become the first to design the museum in a century and a half; a presentation of the work of Japanese contemporary artists such as Tadao Ando, Kunihiko Takahashi, and Tatsuo Terasaki; and a discussion of her work with the term biofabrication. The event will kick off on January 9 and will run until January 11.The biennial is organized in partnership with the Japan Foundation for Contemporary Arts (JFCA). The current exhibition, titled “Solomon R. Guggenheim Museum,” will return to the Guggenheim in 2022.\n\n\nThe Pushkin Museum of Fine Arts in Moscow announced today that it has received an unprecedented $44.3 million from the National Endowment for the Arts (NEA) in support of its expansion into the Russian city of Galln District. Founded in 1967 as the center for the collection of works from contemporary artists, including Peter Paul Rubens, Yinka Shonibare, and Arsht Nurmantar, the museum has since expanded to house approximately 2,500 works, including more than 1,500 works by artists from", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed David McAllister as interim director and chief curator. McAllister will take up the post on September 1 after the institution’s March 15 reopening. He succeeds Peter Donahoe, who announced on May 22 that he would resign from the post on May 23.“We were impressed by David’s leadership qualities, vision, and energy,” said Jim Evans, chair of the board of trustees. “During his tenure, he has developed the next generation of curator-driven exhibitions, partnerships, and educational initiatives in collaboration with artists and organizations. He has also continued to push MoCA’s mission to meet the unique needs and the needs of a changing museum landscape. We are grateful for his contributions and look forward to his continued leadership role.”McAllister joins MoCA where he has served as chief curator since 1998. During his tenure, he curated the first exhibition dedicated to post-Conceptual art, “Post-Conceptual: From the Studio to the Walls,” which premiered at the Studio Museum in Harlem in 1999 and has since expanded to the Museum of", "The next Biennial should focus on the local, national, and international history of the exhibition and should feature a selection of contemporary works by artists from the Los Angeles County Museum of Art and the Museum of Contemporary Art. The project is part of the city’s ongoing efforts to refocus on its historic core, and the museum’s move to the new 3.2-acre campus, which will open in 2022. The plan aims to improve accessibility and strengthen the museum’s collection by introducing more galleries, exhibition spaces, and public programs, as well as to encourage more collaboration through modern and contemporary art.\n\n\nThe George Eastman Foundation in New York and the ten largest fine art auction houses in the United Kingdom announced today that Rachel Harrison, Molly Landreth, Jocelyn O’Grady, Philbrook, Richard O’Grady, and St James’s Meadowlark will receive grants for their work in support of the organization’s mission of supporting the highest-quality contemporary art through direct financial support. “The exhibition will engage with issues and ideas central to modern and contemporary art through a range of themes, including the work of David Adjay, and we’re grateful to the artists who have", "The next Biennial should take place in 2020. The 2022 edition will mark the first time the museum will be changed by a new director. \n\n\nThe Los Angeles County Museum of Art (LACC) has awarded $2.5 million in grants to twenty-four arts and cultural organizations in support of the ongoing curation and preservation of the institution’s collection of more than 5,300 artifacts, which was acquired by the institution in 2004 through a public sale. The funds will go toward the building and renovation of the museum’s landmark building, a former factory that houses the museum’s collections and is currently being renovated by architect Robert Marder.“LACC is honored to make a substantial contribution to preserving the LA County Museum of Art collection through the acquisition of this collection at a time when the institution is committed to bringing it to the public,” said LACC director Susanne Vielmetter. “This is an exciting time for LACC as it prepares to reopen to the public in 2021 following a $100 million expansion, and we are excited to work with our community to build on the work of the past three years.”The foundations of the museum are the Qualcomm Foundation, the Toyota Foundation,", "The next Biennial should be staged in the spring of 2021. The 2019 edition, for which artists occupied the same space as the Tate, was canceled owing to the Covid-19 pandemic. The 2018 and 2017 editions, respectively, were postponed and re-scheduled, and both events were rescheduled for the following year. The 2020 edition will be held at London’s Barbican Centre from September 21 to September 24, 2020 and the 2022 edition will be staged at the Barbican from the same date. The 2020 edition will include a new selection of works by artists from the GCC, the GRC, and the GEO Group, and will be co-curated by Artistic Director Henry Artz. The 2019 edition, entitled The Imagination of the Past,” was organized by the GEO Group and the Lisson Gallery. The exhibition was curated by Bradley Dourad. “Our work is an extension of the GEO Group’s vision to create imaginative new conceptualities around the ideas that shape our selves, in the service of a future rooted in the diversity of cultures, histories, histories, histories, histories, histories, histories,", "The next Biennial should be held in 2021. \n\n\nThe Museum of Fine Arts (MFA) in Boston and the city of Boston have jointly appointed Peter Boghossian, who has served as director of the museum since 2015, as the next director of the Massachusetts Museum of Contemporary Art (MBCA). During Boghossian’s tenure, MBCA experienced a significant transformation. Since its founding in 1956, the museum has expanded and evolved to become one of the largest and most respected cultural institutions in the region. Boghossian previously served as director of the Contemporary Jewish Museum in New York City and as interim director of the Metropolitan Museum of Art in New York. “Peter brings a wealth of experience and knowledge to the role of chief curator at a museum that has previously been recognized as one of the most important cultural institutions of its generation,” said director Amanda Levin. “We are excited to welcome him to our team and to continue to work with him to foster an environment for the museum’s collections, exhibitions, and programming that reflects the full breadth and depth of his extensive curatorial and artistic experience.”Bogolya has served as interim director since March 2019. During her tenure, she curated", "The next Biennial should be held at the Lyceum, in the city of Venice, in 2021, and will introduce a new project for young artists. It will also welcome artists from the United Arab Emirates, Bahrain, Mexico, and the United States and will showcase their work on its livestreamed event, Billion Hours of Experience, in collaboration with the Tate.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is holding an exhibition of work by artists who have never been on the show or have never had an exhibition at the museum. The exhibition, “The Art of Painting” runs until October 6 and will spotlight the work of thirty-nine artists, among them Richard Diebenkorn, Isabel Liddle, John Simon Guggenheim, and Richard Avedon.The show was formed by artist-in-residence Joycelyn Drexler in 2015 after she and her husband, architect Alan Drexler, gave up their career as architects to focus on their families. The Drexlers created the conceptual work Michaelangelo’s The Creationist’s Dream, a monumental environment in which seven giant geometric structures—the Virgin Mary, the Ark, the Ark of the Covenant, the Ark of", "The next Biennial should be held in 2021.The museum recently revealed plans to shift its focus from its collection to its exhibitions, which include a new exhibition organized by an American curator, a biennial of a contemporary artist, and a monographic presentation of its collection. The museum has also said that it plans to develop new programming in conjunction with the 2025 exhibition season.\n\n\nNew York’s Metropolitan Museum of Art has suspended the sale of works by a selection of contemporary artists who were not included in the institution’s 2017 exhibition “The Runaway Life.” The exhibition, which was staged at the museum’s headquarters in Harlem, conducted a series of performances, books, and videos that grapple with themes such as identity, migration, and consumption.“This year’s show is focused on the exhibition ‘The Runaway Life’\u0097a project that explores the ways in which art and culture can change lives, change structures, and change the world,” said museum director Daniel H. Weiss. “I’ve long been inspired by the unique ways in which art and art history intersects with our daily lives\u0097and by the way the work of these artists informs the very architecture of", "The next Biennial should be held in late April or early May 2020, with a main exhibition opening in early May.\n\n\nFrance’s Culture Ministry believes that the construction of the world’s largest new museum in the city of Lyon, built in a former quarry in the north of France, will begin in the second half of the year. The institution, called the Louvre 4×6, will house more than 2,500 works from the artist-built collection.The announcement marks a turn away from previous statements about the construction of the museum in the capital, with Jean-Louis Leclerc stating in an interview in February that the construction of the museum would be completed by the end of the year. The museum initially hoped to create a new 1.4 million-square-foot building to house the collection in a converted quarry, but the project was halted by the Russian government, which stopped funding the project in March.Today, the Louvre has officially announced that the construction of the museum will start in earnest in April 2020, with the opening of the museum in 2020. According to Leclerc, the construction period will last 270 days. The first show opening of the new museum will be on April 9–10, 2020, with the", "The next Biennial should be staged in the spring of 2021.\n\n\nThe city of New York is preparing to launch a major rethinking of its massive public artworks, which are scattered throughout the city and have been a source of much of New York’s cultural life, with a plan that involves the dismantling of some of the more than 2,500 workstations that currently occupy public view in the city.According to Artnet News, the redesigned Central Park will include, among other things, “a dedicated room for performances and other public events,” and the new Whitney Museum of American Art will organize “a series of public art parades.” The changes will be made as part of a five-year $2.3 billion city budget that was unveiled a few weeks ago and will go into effect in 2021.The budget also includes a number of initiatives that were not included in the original plan—such as the relocation of the Empire State Building’s iconic American flag, and the restoration of the Hudson Yards development, which comprises a series of mixed-income housing developments. In addition, the budget allocates $50 million for cultural programming, $100 million for city-owned real estate, and the $200 million for", "The next Biennial should begin with a series of performances and installations by artists that engage with the current moment in order to reconsider the role of art in the future. Bertrand Duane, director of the museum, said: “We are pleased to return to Dallas to present our next Biennial. The exhibition will feature works that examine the intersections of history, ecology, and technology and will entertain as well as educate.”The exhibition will also be hosted by the Museum of Contemporary Art Dallas. The retrospective will be accompanied by a new book, The Future of Work, written by artist-in-residence and current professor of art at the university. The work will be shown in the exhibition “The Future of Art: Aladdin” at the Museum of Contemporary Art.\n\n\nThe SculptureCenter in New York has received a significant gift from the SculptureCenter Foundation. The $500,000 donation, which comes in addition to the $250,000 donated last year, was made in support of the organization’s new Sculpture in a Box program, which aims to make major contributions to the visual arts through the collection, display, and research of iconic objects that were made with the endowment funds,", "The next Biennial should take place in the spring, 2020. The exhibition will be hosted by the Museo de Arte Contemporáneo Argentina at the Palacio de Arte Contemporáneo in Buenos Aires, Argentina; the Museo de Arte Contemporáneo Puebla in Buenos Aires, Mexico; and the Museo de Arte Contemporáneo, Colombia. The five-month long exhibition will also highlight the life and work of three legendary Argentinian artists: Mercedes Aveledo, Adriana Pindell, and Vicente Pérez.The first exhibition, titled Madrid: The Modern City, will showcase the artwork of seventy artists in a city that is still emerging from a devastating fire in 2013. The second, titled Los Angeles: The Contemporary City, will examine the history of Los Angeles and its surrounding areas through fifty work-exhibitions as well as the Los Angeles County Museum of Art (LACMA), which opened in 1960. The third exhibition, titled Los Angeles: Contemporary Urban Art, will take place in the city next April. The fourth, titled Los Angeles: Cruces, will be staged", "The next Biennial should aim to create a shared space for the art and culture of the West, with a view to shaping and demonstrating the creative potential of the Pacific Northwest. “The next TBC will be in 2020, and will take place as part of a larger vision for the region,” said Andrew Gold, chair of the board of trustees of the Art Institute of Chicago. After visiting the campus of the University of Washington, Seattle, the museum will present the first exhibition of Japanese contemporary art, “The Lasting Effect of the Sun on Pacific Northwest Art,” curated by Carol A. O. and Gabriel M. Pimentel.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Elizabeth Raetz as its next general curator. Raetz, who has served at the institution since 2014, will be responsible for the leadership and direction of the museum’s curatorial program. She will assume her new post on March 31.“Elizabeth brings to MoMA the expertise, vision, and energy needed to further our mission to present contemporary art at a level of impact that is beyond reproach,” said museum director Daniel H. Weiss. “Her expertise in both contemporary and contemporary art", "The next Biennial should focus on the creative and artistic production of women and girls in the contemporary world. We hope that the new exhibition will serve as an opportunity to reflect on the most recent decades and re-create a more inclusive and transparent future for art and culture.\n\n\nThe Metropolitan Museum of Art in New York has named Sarah Rounta as its new deputy director and chief curatorial officer. Rounta will be responsible for co-organizing programming between the museum and the New York City Department of Cultural Affairs, developing and integrating new educational, fundraising, and public programs, and developing and executing strategies to strengthen relationships with local communities.“Sarah’s care and passion for art and the Met has been exceptional throughout her ten-year tenure, and we’re grateful to our board and staff for their support,” said board president Daniel H. Weiss. “She is a gifted and dedicated leader who has been instrumental in transforming the Met’s relationship with the city and communities and has been instrumental in developing new approaches for engaging communities, responding to the City’s unique needs and evolving collections, and developing and building relationships with artists, institutions, artists’ families and collectives.”Over the course of her", "The next Biennial should take place in 2021–22, but the organizers say that they cannot yet say whether the 2022 edition will be moved. The Danish government has also ordered a halt to construction at the construction site of the new exhibition center, which is currently under construction, and has asked the Danish Arts Council to review the design of the event.The Danish artist Lars-Erik Stødrup, who is known for his monumental and often overlapping public sculptures, has called the move “a disaster for the arts.” He told the Art Newspaper: “It's a disaster for the city of Copenhagen, for the city of Denmark, for the future of arts in Denmark.”\n\n\nSandra Bullock, the British actress, director, and producer, has announced that she will take up the cause of racial justice and equality as the lead in the upcoming #OscarsSoWhite campaign. “OscarsSoWhite’s campaign is a response to the systemic racism and discrimination faced by marginalized communities across the United States,” the actress and activist said in a statement. “Part of my art show, ‘THE TRAVELING DEAD,’ will feature an exhibition of work by Black and", "The next Biennial should be held in 2020. “I want to make sure that the next Biennial is truly a new take on the history of art and in fact, an extension of the history of art,” Ojo said. \n\n\nThe Contemporary Art Museum Chicago (CAMIC) has received a gift of fifty-one works from the National Gallery of Art in Washington, DC. The donation includes works by ninety-three artists, including Dwight Yoakum, Pierre Cardin, and Sara Cohen; and seventy-nine works by contemporary artists in the United States and Canada.“CAMIC offers an expansive collection of works in the Chicago region that offers many opportunities for research, commentary, and discussion,” said Joanne Shea, director of the National Gallery of Art. “Each of our holdings is a significant contribution to the understanding and appreciation of contemporary art, and we are grateful for the opportunity to present these extraordinary works in the collection to a new generation of curators.”Among the works previously gifted to CAMIC are Aristotle’s Constantinople (CAMIC/Center for Contemporary Art), 1996–2009, which is on display in the exhibition “The Place", "The next Biennial should be at the Stedelijk Museum in Amsterdam, and the venue should be selected by a jury comprising environmental historian and curator Klaus Niemeyer, art historian and curator Denise Inskip, academic scholar and artist Robin Hooper, and curator Reem Akram. The winner of the €10,000 prize will be announced in 2020. The 2019 edition, featuring work by seventy artists and collectors, had its inaugural exhibition at the Stedelijk Museum in Amsterdam and its last week in May.The jury is comprised of Marianne C. Schipper, director of the Max Mara Contemporary Art Museum, Washington, DC; John C. Gray, director and curator of the CCAF in San Francisco; Rory Mulligan, director, curator and cofounder of the New Art Institute; Simone McGehee, director of the Museum of Contemporary Art Los Angeles; Bob Smith, a curator and the founder of the National Gallery of Art in London; Jerry Winans, a sculptor and the founder of the shop Modern Art in New York; and Andrea Morley, a curator and the director of Art at Home, a New York–based nonprofit.�", "The next Biennial should be held in 2022. The exhibition will take place in a museum designed by Rubex Architects and will take place in the city of Biennale de Lyon, France, which has recently undergone a major renovation, and will feature works by forty-seven artists, including Françoise de la Boetie, Pierre-Auguste Quintard, Jean-Paul Sartre, Felix Zahrt, and Michelangelo Di Modica, as well as three-hundred works by contemporary artists, including Merce Cunningham, Harry G. J. Cooper, and Robert Irwin.\n\n\nThe National Galleries of Scotland is expanding its relationship with the Royal Shakespeare Company by acquiring the company a new four-year deal worth around £23 million ($31 million). The transaction, which was completed last month, makes the National Theatre, which has been run for twenty-six years, part of the Royal Shakespeare Company, and is one of several recent acquisitions that deepen its involvement with the Royal Shakespeare Company. The National Galleries of Scotland also recently acquired the Shakespeare Company's theatre in London, of which it is the largest shareholder. The purchase was part of a wider strategy announced by the Scottish government in February 2020, which aims to improve the National Galleries", "The next Biennial should take place in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has cancelled the next iteration of the exhibition “Culture/Art”—an exploration of the meaning behind contemporary art. Titled “Art and Life: Fascism and the Art of Life” and curated by Ben Horowitz and Nadine Lénaudou, the show was supposed to run November 22–January 31. It was supposed to take place at the Huntington Library and Museum in Palos Verdes, California, and to be followed by “The Last Art Experience,” a retrospective of works by Robert Irwin, the first American artist to go into hiding in the Second World War.The move followed the California boycott of Israeli products, demonstrations against government restrictions on Palestinians, a wave of protests against American military engagements in Iraq, and violent anti-American riots in the Middle East.Among the works in the exhibition were pieces by Alia Farah and Kader Attia, both of whom were executed by the Islamic State group in Iraq in 2015. Horowitz and Lénaudou said that the works in the exhibition “offer a window into ‘narrative.’ The theme of ‘The Future", "The next Biennial should focus on the evolution of the contemporary art scene and its relation to the local economy, the struggle for social justice, and the Arab Spring.”The 2019 edition of the event, which will take place at the museum, will be staged in the institution’s former location in the city of Safra, in the northern province of Mafraq. The institution currently has two exhibitions slated to open in the next few months, one of which will be a biennial dedicated to the work of American artist H. R. Giger and the other will feature works by modernists such as Ed Moses and Richard Diebenkorn.“Elijah is an important center for Arab art and culture in the West,” said Ali Hamdan, the director of the museum and the international program. “Its contemporary exhibitions and collections, which are based on scholarship and reflect the full range of its collection, are a testament to the quality of the contemporary art in the region. We are grateful to the many members of the Al-Azraq family for sharing their vision and fidelity to the mission of the museum, and we invite all to experience the very best of modern art in the region and to visit the city that was chosen as the", "The next Biennial should take place in the spring of 2021. The 2019 edition, which was curated by Tawenda Nzimande, was also canceled because of the Covid-19 pandemic. In a statement, the Arts Council said: “This was a difficult decision for the Council but one we felt was the right one for the long-term future of the Biennale. We are extremely proud of the work that was done during the last year of the Festival and look forward to seeing the first piece of art created by our new directors this Spring.”\n\n\nThe Art Newspaper reports that the 14th Berlin Biennale, which was scheduled for March 21–March 25, 2020, has been rescheduled to August. The news was first released by the German daily Süddeutsche Zeitung, which reported that the event would be canceled owing to concerns regarding the coronavirus. The publication also said that the event’s organizers, the Berlin-based Recharter Foundation for Contemporary Art (FSCHB), were examining ways to postpone the event. The event’s organizers said that the decision to postpone the event was made after they “received from the German government, the federal state", "The next Biennial should be held in 2021. “I’ve been working on this project for over a decade and have been able to present a series of exhibitions at a time to meet the needs of different audiences,” said Adrienne Edwards, chair of the trustees of the Biennials. “With the new Max Mara Theater–designed spaces, we will be able to present more extraordinary works, and explore themes that will interact with audiences in Washington, DC, New York, and Los Angeles.”\n\n\nThe Venice Architecture Biennials have released the list of seventy-two artists who will participate in the twenty-fourth edition of the Venice Architecture Biennials, taking place at the new Museum of Fine Arts (MUFA) in Venice, Italy, from November 5 to November 8. The event, which was launched in 2015 by the Italian Ministry of Culture, was initially planned for February 20–February 22 but was moved to December in line with a new agreement between Italy and the European Union. The date change was made in order to fit with the new year, which will mark the beginning of the second phase of the project, which will involve the erection of a museum in the city of Turin.“I�", "The next Biennial should take place in 2021.\n\n\nThe American Institute of Art (AIA) in New York has issued an apology after it decided to honor an artist who was banned from the institution until her death by the city’s Department of Buildings for violating the terms of her lease by converting a three-story former auto factory into a workplace for the arts.Sonia I. Bocentre, a Bronx-based artist who was working on a sculpture for the first exhibition of her new museum\u0097Dissident Art, which opens in August\u0097was denied entry to the institution on December 3, 2016, after the landlord reportedly discovered that she had a child. The family was told that the child’s father would be evicted from the building and that the child would be taken to a nearby shelter for children.The museum issued a statement on its website on Thursday, stating that it had paid the family for the space, but that the family had had no role in the installation of the work. The statement also revealed that the family had not vacated the building since the artist leased it out in 2019.“The AIA has learned that the tenant of this structure, Sonia Bocentre,", "The next Biennial should take place in 2022. It will be hosted by the Kunsthalle Bern, which was also the venue of the first exhibition devoted to women in 1973. The biennial’s program will focus on creating an instrument that will allow women to take part in “open” discussions. The 2015 edition featured author Mira Dancy, whose work was based on her experience in the Soviet Union. The December 2019 edition of the 2018 edition will reportedly feature a selection of paintings by the late Russian avant-garde theorist and critic Anatole France. The exhibition will also include the work of the late designer Erich Fromm, whose work is often associated with West Berlin, and will mark the twentieth anniversary of the revival of the city.In the documentary film The Other Side, a 2018 documentary about the cancellation of a Biennial by the city of Hamburg, the artist Oskar Eustis was pictured with a woman who had been raped by the Russian border guards in Ukraine in 2014. The artist was arrested in Greece and deported to Russia, where he was granted asylum in 2018. \n\n\nThe Martha Graham Foundation, the Museum of Modern Art, Boston, and the New Museum in New York have announced that they", "The next Biennial should be announced in December, with the first exhibition scheduled for November 2021. The biennial’s final exhibition will be on October 29. “The real test of a culture is not if it survives and thrives, but when it begins to question itself,” said J. Alexander Oxtoby, the London-based director of the cultural nonprofit Oxford Biennale. The biennial was spurred by the coronavirus outbreak in China and the coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coronavirus-like coron", "The next Biennial should be held in 2021, but the organizers are currently discussing possible dates.\n\n\nThe museum’s current exhibition “Shirley Crisp: The Birth of an American Icon,” a partnership between the museum and the New York–based nonprofit Miriam and Ira D. Wallach, has been canceled due to the pandemic. The 2019 edition, “Shirley Crisp: Wallach/Crotty,” was scheduled for March 23–March 28, 2020, and included forty-six paintings by the pair. Roughly ten percent of the works were scheduled to go on display that day, but the tour of the gallery was canceled because of the Covid-19 pandemic, and the exhibition was rescheduled.The museum’s redevelopment plans include the construction of a new building, the Shaw Center for Art and History, that will address the needs of the local arts community and serve as a hub for cultural exchange. The project is expected to cost $130 million and is being funded by a $5.5 million gift from the Diller Scofidio + Renfro family. The Shaw Center will be inaugurated by a new work by the artist, titled", "The next Biennial should be a “prefiguration of a future that is decisively phlegmatic, one that acknowledges the profound and longstanding political and cultural legacy of this city,” said Linda Davidson, chair of the museum’s board of trustees and director of the Metropolitan Museum of Art in New York.\n\n\nThe Metropolitan Museum of Art in New York has appointed Warhol’s former assistant David K. Armitage director of curatorial affairs. Armitage will be responsible for coordinating the museum’s exhibition programming, managing the exhibition catalogues, and serving as the museum’s liaison to the public. He succeeds Stefan Blum, who retired in March 2019 after twenty-five years with the museum.Blum added to the museum’s already established gallery-world reputation with an exhibition, “Museum of Modern Art: Beyond Theory” (2019), which explored the conceptual and physical limits of art. Armitage will take up his new responsibilities in January 2020.“David is an excellent choice to lead the Met,” said museum director Christopher Bedford. “We are honored to welcome him to the museum, and are confident he will continue to advance the Met’s curatorial", "The next Biennial should take place in Dubai in 2022. The next edition of the New York Biennial will be held in November 2022. The next edition of the Dubai Biennial will be held in December 2022. The next edition of the Venice Biennale will be held in November 2022. The next edition of the New York Art Biennale will be held in December 2021.\n\n\nThe Stedelijk Museum in Amsterdam has received a donation of seventy-six works by twenty-four artists\u0097including Renate Redon, Bethenna Stier-Bouwens, Robert Irwin, and Jules Verne\u0097from Michael Berry, the director of the German-born museum. The donation was made in anticipation of the upcoming exhibition “Signs of Life,” which will begin on September 4 and run through November 5 at the Stedelijk until the end of the year.“It is a great honor to welcome these works to the museum’s collection, especially those which have shaped the course of the history of modern art,” said Michael Berry. The works, which are centered on the concept of “life,” are primarily from the archive of American", "The next Biennial should be held in 2022.\n\n\nThe Museum of the City of New York (MoCA) announced today that it will host a biennial exploring the city’s history in 2020, with a mission to create an exhibition that reimagines the future through the art of the city. “The museum’s new series ‘re-creation,’ ‘present,’ and re-creating the city,” which will be curated by Ming Wai-Chun and curated by Amy Sherald of the Whitney Museum of American Art, will focus on the city’s cultural heritage in a different way than the current exhibition, “The City of New York,” which focuses on the architect William Moses as a symbol of New York’s urban fabric.“MoCA shares a vision for what makes a city,”   said MoCA director and CEO James Turrett. “We wanted to create an exhibition that examines the city from a different point of view, and one that explores the relationship between architecture and the history of the city.” The forty-third iteration of MoCA’s Re-creation series, which", "The next Biennial should take place in 2022. It will be inspired by the “great unifying principle of the world,” Josée-Lynne Rönnschruch said. “Everything is connected. Everything is interconnected, and everything is linked. The ideal exhibition for this century is the one which will bring us together in our interconnectedness.”\n\n\nThe Metropolitan Museum of Art, New York, has appointed Carolyn Abrahamson as its next director. During her ten years at the helm of the museum, which is located in the former factory district of Southwest Seventh Street in Manhattan, Abrahamson has organized more than sixty exhibitions, and has published fourteen books. She was celebrated by the New York Times last year for her “most ambitious exhibition program” at the museum, which featured work by such luminaries as Damien Hirst, Marc-Olivier Bouma, and Sohrab Mohebbi.“Carolyn returns to the Met with a very clear vision for the Met,” said director Daniel H. Weiss. “She has demonstrated a remarkable ability to recognize the potential of her own facility and her institution, and embodies the Met’s values of openness and", "The next Biennial should take place in 2021.\n\n\nThe Baltimore Museum of Art (BMA) is moving three of its earliest works, two early in the twentieth century and one from its collection, including an early work on paper, which was displayed in the museum's new exhibition “Life, Death, and the Art of Paper: Modern Art and the Late Victorian Era.” The plan is to assemble the works into one exhibition, “Life, Death, and the Art of Paper: Modern Art and the Late Victorian Era” (2017–18), which will open in the museum in January. “It has been a serious goal of the BMA to present these works in a way that enables our visitors to understand and appreciate the critical period of its collection,” said director Christopher Bedford. “We have made the decision to bring the three works together as part of a single exhibition. We believe this will create new opportunities for our audiences to engage with these works and increase the value of the collection in the long term.”The works, which were originally displayed in the museum’s current exhibition “A Study in Modern Art: From the German Expressionist to the New York School” (2016), were", "The next Biennial should feature works by up-and-coming artists, including Jusuf K. Judd and Anna Atkins, and should take place at the Museum of Modern Art, Chicago; the Solomon R. Guggenheim Museum, New York; and the Smithsonian Folk Art Museum, Washington, DC.The festival is part of the 2020 iteration of the Biennial, which was curated by María Berrío and Rosalind Rubin. The event will return to the Museum of Modern Art in 2021; Oxford Art Museum in England; the Museum of Contemporary Art, New York; and the Serpentine Gallery in London.  The 2019 edition of the biennial, “Between the Sun and the Moon,” featured work by artists such as Wolfgang Perch, Phil Collins, Gisèle von Marco, and Jodi Throckmorton; the exhibition also introduced the first panoramas of the Grand Canyon and Grand Staircase-Escalante, respectively.\n\n\nThe Museum of Modern Art (MoMA) in New York has named Rebecca Ropac as its new executive director. Ropac comes to the institution from the Museum of Contemporary Art (MoCA), where she has served as deputy director of sustainability since", "The next Biennial should welcome at least ten artists and shouldn't be too far from the Central Library. The artists who will participate include:Themes from the exhibition include:The exhibition will be organized as a symposium, and all of the works produced by the participating artists will be presented in a concert at the exhibition. The exhibition will also feature a number of other sculptures, installations, and performances that were selected by the biennial-designated jury.The jury comprised Artnet editors Dolores Muñoz, Suzan Delmas, and Indira Samaras; artist/designer John Stackpole; and the biennial’s director, Monica Oestrick.Commenting on the jury’s decision, the participants said: “We are all excited to see the full exhibition and to be able to participate in the exhibition together. The exhibition will be an unusual combination of sculpture and performance, showing the work of the first time the exhibition has ever been staged. We hope that the exhibition will not only be a celebration of the work of the exhibition, but also an opportunity for the artists to create new and different works in the exhibition.”\n\n\nCharles Peplau, the Swiss curator and founder of the New York–based museum", "The next Biennial should be in 2021 and will be hosted by the Museen des Beaux-Arts in Paris, as well as by the Museen des Beaux-Arts in Paris and the Musée d'Orsay in Paris. The next edition of the biennial will be held at the Musée d’Orsay from May 7 to May 8, 2021. The first edition of the event, which was held in February of 2019, attracted more than 68,000 visitors.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of cultural heritage in public spaces in the city. The guidelines outline how the city’s 150-year-old monuments and iconic buildings, including Grand Central Station and the Museum of the City of New York, should be protected from damage and how visitors and the public should be able to see and touch them.The guidelines were developed in collaboration with Cultural Heroes Now, ‎a New York–based, nonprofit that advocates for land conservation, restoration, and display, and Artists City, a public-awareness campaign that seeks to draw attention to cultural heritage protections and issues. “These are the rules that should", "The next Biennial should be held in the spring of 2020. The 2019 iteration featured work by forty-four artists and was organized by Kamal Saeedi, the owner of the Bazaar of Baghdad, and his organized team. The 2020 event will include work by forty-four artists, including eleven from the Iraqi cities of Sulaymaniyah and Samarra as well as work by artists from the Persian Gulf such as Alireza Nusseibeh, Mukarrasat Sakir, and Huseynul Hasan.\n\n\nThe Royal Academy of Arts (RA) in London has received a gift of fifty-six works by twenty-one artists who were all nominated for the 2019 Henry Artift Prize, which honors the achievement of emerging artists in the United Kingdom. The awards were announced by the Henry Artift Foundation in partnership with the RA and won by Sara Borthwick-Brown, Ahmed Dalloul, Shane Dawson, Harriet Deschamps, Adelaide James Goldsmith, Julia King, Richard Mayhew, Harjeet Kumar, and Hannah Wilke.“Henry Artift has been a champion of young British artists", "The next Biennial should be held at the Tehran Museum of Art (TMA) from late April to April May and should be able to draw up to 3.5 million visitors, the French artist Pascal-Auguste Renaud observed. With its exhibition of new works by French and international artists such as Damien Hirst, Hans-Peter Karlsson, and Joël & Kyra, the event is still in early stages. The first edition of the exhibition, “The Artist’s Apartment,” was held at the National Gallery of Art, Georgia the year before the revolution. With the appointment of Juniorola to the position of curator, he was given the task of protecting the institution’s important collection from the ravages of the revolutionary regime. During his tenure, Biennial director Nima Nabavi added more than 2,000 works to its collection, opening up an area of the show that is currently closed to the general public. While the walls of the museum are lined with works by artists such as Monet, Claude Monet, and Pierre-Auguste Renaud, the public is not allowed to visit the exhibits, and the artist’s studios are kept in a special section of the", "The next Biennial should take place in 2021, when the museum will be inaugurated by Prince Charles and Catherine, and will continue to present contemporary exhibitions. The museum’s current exhibitions, which include “The Rise of the Modern Man” (2019), “The Death and Life of Pablo” (2017), and “Pangaea” (2016), among others, will not return for another twenty-three years. The Biennial’s next exhibition—a presentation of ten works by seventy artists, including Adam Dallenbach, Eric Fischl, Daniel Fritsch, and Benjamin Grisard—will be staged at the San Francisco Museum of Modern Art in 2021. The 2020 edition of “Pangaea” will be held at the San Francisco Museum of Modern Art.\n\n\nThe New Museum in New York has appointed John Chiu as its new director. In his new position, Chiu will be responsible for leading the institution through its ten-year reopening, which is expected to occur in May 2020. He succeeds Martino Nicolai, who officially retired after eighteen years at the helm of the New Museum on July 1.“John is a gifted curator and scholar whose", "The next Biennial should focus on creating and propagating a new kind of art, one that is democratic, participatory, and grounded in the community. “Themes that transcend individual and collective, collective and community, are the tools that can be used to address the problems of our world,” said Behnal, who is also director of the Brussels-based Centre for Contemporary Art (Ceci), and who is currently working on a project for the upcoming exhibition “Art in Time” at the Universität Braunschweig in Germany. The exhibition’s concept is to examine the relationship between art and history, historical narratives, and the arts.“We are very excited to host artists that are shaping the next iteration of the Biennial,” said Behnal. “The next iteration of Biennials is shaping up to be the most ambitious and most ambitious in its history, so we are very much looking forward to collaborating with your and incorporating your creative energy into our program. We are confident that we can present an exhibition of all the work that is in the pipeline for the upcoming exhibition.”\n\n\nThe Museum of Contemporary Art (MoCA), the Los Angeles County Museum of Art", "The next Biennial should take place in 2019, when the museum will have its grand opening. \nFounded by biennial director and curator Phil Collins in June 1968, the museum is now led by a board of trustees comprised of the chief curator, Hannah Cook, and the artist Hans-Ulrich Obrist. The institution also has a digital platform, Artnet News, which provides curated news articles about contemporary art from around the world. In addition, the institution hosts a biennial biennial every second year, from December to March, and is developing an annual exhibition for March.In an interview with Artforum in 2017, Cook said: “The early years were a struggle. I mean, I didn’t have much money. I was lucky to work with Hans-Ulrich Obrist, who was one of the first to realize that a cultural institution had to have its own space in the city. I mean, really a museum, without walls, in a van. I had no staff. I had no office. I was living in my parents’ basement. I’m not going to lie, it’s a very lonely place. . . . But I learned to love it, and I learned", "The next Biennial should focus on the history of the Royal Academy of Arts in London, United Kingdom, from around 1600 to 1850; the history of the Royal Society in London, England, from 1850 to 1860; and the history of the Royal Shakespeare Company, from 1600 to 1860.\n\n\nThe Museum of Fine Arts, Boston (MFA) has appointed Bonnie R. Stafford, who served as director of the museum for the last twelve years, as its next chair. She will take the helm from Judith Zuiker, who will retire after eighteen years at the helm of the museum\u0097the longest tenure in its forty-three-year history.“I’ve always been inspired by women artists and by women artists’ vision,” said Stafford. “I’ve always believed that artists could be a force for social change. I’ve always believed that artists could change the world. I’ve always believed that artists had the power to be transformative. I’ve always believed that artists could be leaders. I’ve always believed that artists could change the world’s perception of women artists. I’ve always believed that artists could be influential. I’ve always believed that artists", "The next Biennial should be held at least once a year for the next two years. The Biennial will be organized as follows: FRONTLINE: 1) 2) 3) 4) 5) 6) 7) 8) 9) 10) 11) 12) 13) 14) 15) 16) 17) 18) 19) 20. The first edition of the exhibition, dubbed “The Painted Bridge,” featured work by seventy-seven artists, including Joan Miró, Rubem Chamekal, André Malraise, and Jean-Luc Godard. The new biennial will be held at the Centre Pompidou in Paris and will invite up to twenty-one artists to Paris.\n\n\nThe Black Lives Matter (BLM) movement has released a statement condemning the shooting death of George Floyd, whom police officer Jermaine Floyd was pursuing in Minneapolis in an attempted arrest on Friday, January 8. The twenty-five-year-old was killed by officer Derek Chauvin, who was placed on administrative leave by the city of Minneapolis following the incident.In a", "The next Biennial should be held at least once every two years, although the Council of Europe, which is currently considering a recommendation for the next edition, said it expects the event to continue for another two years. The next edition, which will be staged in the United States and on July 23, 2022, will include twenty-five artists, including David Benatar, Lidia Bochereau, and Zoya Karalai.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Richard Smith as its next executive director. Smith comes to the institution from the Santa Monica Museum of Art (SMMCA), where he has served as interim director since April 2019. During his tenure, Smith helped the museum raise over $1 billion for its expansion and has overseen several major exhibitions, including a major retrospective of painter and designer Jean-Michel Basquiat’s work and the first-ever six-day “Art of Art” series. Smith joins the museum from the Creative Artists Agency, where he was the head of its Los Angeles outpost for more than three years. He previously helmed the MCA Los Angeles from 2010 to 2017 and was a cochair of the museum’s board of trustees. ", "The next Biennial should take place in 2021. The theme of the first one was “Connections.” This year’s edition, titled “Away From the Point of View of the Camera,” was held at the end of September and will run until November 28.The exhibition, which was inspired by the famous photograph of a medieval cathedral in Nuremberg, has been described as “the Last Arch of the Archäologische Kunst” and “the most important exhibition that is planned for the next several years.” The forty-one-thousand-work set, which comprises twelve works by thirty artists, will be organized as follows: 1) The Accent of the Eye, 2) A Short History of Objects, 3) Analysing the Dialectic, 4) An Essay on the Subject of the Camera, 5) The Idea of the Camera, 6) The Kinematic, and 7) The Criticism of the Camera.  The work’s catalogue will be presented at the July exhibition “Munich and the City,” which will be held at the Mies van der Rohe Institute in Munich until November", "The next Biennial should be held in 2021. The Biennale de Lyon is currently on hiatus.The City of St. Petersburg has announced that it plans to cease operations at the famous collection of Giovan Franceschini in 2022. The museum will relocate to a new space, the National Museum of Fine Arts, in the capital. The organization will continue to host exhibitions in the former factory, which has housed the museum since the 1920s, but will shift to a new location and to a different time zone.The first exhibition commemorating the museum’s 150th anniversary will open in August 2021. The next exhibition will be “Giovan Franceschini, 150 Years of Exhibition,” twenty-six months after the museum’s closure. The organization will also begin a major renovation of the museum. The project will include the remodeling of the building’s interior and exterior, the renovation of the library, the administration of the museum, and the erection of a new exhibition space. The museum’s existing campus will also expand by more than fifty thousand square feet, adding a collection area for Giovan’s contemporary art. The project will cost some $3 billion.\n\n\nThe Greater London Authority (GLA),", "The next Biennial should be staged in 2021. The exhibit will be a collaborative effort between the two countries based on a philosophy of respect for diversity that aims to reduce prejudice and promote human rights.\n\n\nThe Israeli government has approved a new law that will allow the construction of thousands of housing units for the approximately eight thousand Palestinians currently living in illegal outposts in the occupied West Bank. The State Comptroller�s Office estimates that the law will lead to the displacement of some 2,500 Palestinians, including 1,300 children, and will also provide for the confiscation of land from their relatives and neighbors.In a statement published on July 31, Israeli Prime Minister Benjamin Netanyahu said that the law will allow Israel to create thousands of affordable housing units for Palestinians in the occupied territories. The law also specifies the confiscation of land from families evicted from their homes in order to create new settlements in the West Bank, and it specifies the compensation of families.Critics fear that the construction of new settlements will only exacerbate Israel’s current crisis. The United Nations has placed Israel under international emergency emergency emergency emergency policing due to the construction of illegal structures across the West Bank, and hundreds of Palestinians have died from injuries suffered during clashes between Israeli forces and Palestinian protesters since construction began", "The next Biennial should be held in the theme of compassion, Art, and Accessibility, in 2021. \n\n\nItalian architect Silvio Cattelan, who designed the iconic Renaissance Pompeii, has died at the age of eighty-two. The son of a wealthy textile manufacturer, Cattelan studied at the prestigious Paris Academy of Fine Arts before graduating from the University of Turin, where he studied with Giada De Santis, Giulia De Mello, and Luigi de Boni. In 1972, the same year that De Boni created the cathedral of St. John the Baptist of Naples, Cattelan designed the Cinque Terre, a six-thousand-year-old Roman site in the city of Turin. The project, which involved the restoration of the ancient town, dubbed the Villa della Città, was finished in 1991.The Villa della Città, which houses the design studio of Cattelan’s son, Ettore Cattelan, and the museum, was the first project of the architect’s career. When asked why he designed the villa, Cattelan replied that he wanted to create a place where one could", "The next Biennial should be held at least once every three years, with the first exhibition held in December 2019. The inaugural exhibition, “Tobias Küger: God is Not a Question,” will open at Biennale Centro de Cultura in Milan in March 2020. “The question of what is beautiful and what is not is the great equalizer,” said Florentino Paredes, the president of the Biennale and a former director of the Museo d’Arte Contemporáneo Sassari. “It is a question that is urgent and that we cannot avoid, but we can think of creative ways to approach it that are accessible to everyone.”He also noted that cultural institutions have a duty to their audiences and to tackle difficult issues with humor. “The challenge is to think of ways to understand beauty that are able to be both playful and serious, but also that are able to draw attention to so many things that are so urgent,” Paredes said.\n\n\nThe museum in Bologna, Italy, has issued a statement on its website about the recent rape, murder, and robbery that took place at the Palazz", "The next Biennial should be held in 2020, said Dr. Kameelah Abdullahi, president of the Diyarbakır Art Foundation. The organization, which organized the first ever exhibition in the city in 2006, has been working to bring more exhibitions and events in the city, which straddles the borders of Iran, Turkey, and Iraq, since 2012. The first exhibition, “Rethinking Architecture,” was staged at the Art Museum Diyarbakır in 2012, and a second exhibition, “Painting in the City,” was held at the Art Museum in Istanbul in 2014.\n\n\nThe Whitney Museum of American Art in New York has added six works by artists working in the United States: two from the Midwest and one from New England. The works, titled “Southwestern Art,” will open at the Whitney Museum of American Art in 2020 and are slated to be exhibited in “Southwestern Art,” an exhibition organized by the Whitney in partnership with the New American Art Foundation, before the end of the year.“The Whitney’s work on the Southwest has been especially significant in affirming the work of artists whose work is not typically considered in", "The next Biennial should consist of a series of lectures on the histories of art and architecture and be presented in sequence, with the series ending with a discussion of the biennial’s future. ‘The new year will bring us a new reality: a true gift of the creative spirit,” said Kij Phan, chairman of the board of trustees. “The upcoming biennial will be a reflection of our time, and a celebration of the contributions of artists and designers to shaping the contemporary.”The 2019 biennial will feature work by forty artists and will be held at the Hirshhorn Museum in Washington, DC; the Public Art Institute and the San Francisco Museum of Modern Art (SFMoMA); and the San Diego Museum of Art. The 2020 edition will open at the New Museum in New York and will be hosted by the Hirshhorn and the San Francisco Museum of Art.\n\n\nThe Modern Art Museum Houston (MAM) announced today that it is planning to move forward with construction on a new $105 million facility, set to open in the spring of 2021, in the former George R. Brown Building, which houses the Modern Art Museum Houston, the Contemporary Jewish Museum, and several other cultural institutions, in an effort", "The next Biennial should be held in 2024 and will run from January 19 to January 21, 2021.  The theme of the exhibition will be “The Humanities.” The Biennial will also include an exhibition of work by young and old artists.Since the exhibition was announced, several artists have withdrawn their work from the exhibition, including Sara Jane, Olivia Williams, Lisa Lisa, and Perrotin. Sara Jane gave up her painting skills to join the Biennial and will deliver a talk about the exhibition at the exhibit “The Future of Art” in January 2020. Lisa Lisa also gave up her drawing and painting skills to join the Biennial and will deliver a talk about the exhibition in January 2020. Pace’s work, which was on display in the first exhibition, “The Streets of San Francisco,” was withdrawn from the third exhibition, “San Francisco,” in April 2019. The Biennial’s curator, Colleen Young, also announced on Monday that the exhibition will now include work by forty-eight artists, including Serdar Ghani, Sohrab Mohebbi, Jumana Rashid, and Flume. The exhibition", "The next Biennial should take place in 2022, and the first in 2024. The Arts Council is currently working on a new schedule for the fair.\n\n\nThe French Culture Ministry has released guidelines for the redesignation of the sites of the upcoming Paris–Helsinki fair, which will take place in February 2022. The first edition of the show, titled “Paris Microbiotique” (Paris Microbiotique), will be held at the Éamon de Garay building in the city of Alpes-Maritimes in April 2022.The date of the second edition, titled “Paris Microbiotique II” (Paris Microbiotique II), will be set in March 2022. The fair will be held in several locations across the city, including the Centre Pompidou (Pompidou Palace), LaGuardia. The third edition, “Paris Microbiotique: Toulouse Microbiotique” (Paris Microbiotique: Toulouse Microbiotique, Paris, March 2022), will be staged in Algiers on November 26-December 23 2022.The guidelines were issued by Culture Minister Franck Riester, who visited Paris in March to witness the redevelopment of", "The next Biennial should begin in 2021 and last for ten years. The first edition, titled “The Strange and the Beautiful,” was held in Lisbon in 2014 and concluded last year.The current exhibition, titled “Framed: From the Faces of Life and Death,” was presented at the biennial “NIRIN” in Berlin in 2015. More information about the debut exhibition and about the future of the biennial will be announced in 2020.\n\n\nThe Museum of the City of New York announced today that it will open its newest building, the Museum of the City of New York: The Gallery, in Chelsea in September 2020. The museum will serve as a “museum of modern life and politics.” The building, which will be built on the west side of Central Park, will be named after the city’s mayor and features twenty sculptures by David H. Koch—his brother and principal donor, Charles; his son, Andy; and a number of artists, including Alice Alighier, Robert Irwin, and Susanne Buehler. Designed by Gensler & Stapleton, the museum will be inaugurated with an exhibition of works by the Koch brothers,", "The next Biennial should take place in 2020.  The theme of the 2020 event is “Chronology of the Body.” Both the Museum of Contemporary Art (MCA) and the Whitney Museum of American Art are currently working on revising their exhibitions and their collections. The reopening of the museum and the opening of a new campus were part of a deal struck between the two institutions under which the MCA will receive $2.6 billion in taxpayer funds over ten years.The deal also includes a new $500 million endowment for the MCA. In return, the MCA will receive $400 million, and the Whitney will contribute $300 million. The money will be used to refocus the MCA’s programming around the themes of “The Nature of the Body” and “Liminality in the Body.”  \n\n\nThe Metropolitan Museum of Art (MoA) has released its 2020–21 season-by-season schedule for the arts and cultural sector, which consists of twenty-three months of programming across fourteen cities across the US. The 2020 schedule, which is based on data from the Association of Art Museum Directors (AAMD), includes a number of creative initiatives that have been", "The next Biennial should be on “Wangechi Mutu: A Fantastic Journey” in October 2022. The exhibition will open at the Museum of Modern Art in New York and will run until March 23, 2022. The second Biennial will be held in January 2020 and will be held in March 2020.Nominated artist-in-residence Billie Tsaku, whose work has been featured in the Whitney Biennial, the Metropolitan Museum of Art, and the Museum of Modern Art in New York, and whose work was recently featured in a retrospective of her work at the Museum of Modern Art, will also be invited to participate in the 2020 event.\n\n\nHandmaids of the United States: Reunite, a new four-week public engagement and programming initiative that was curated by the Museum of Modern Art and curated by artist and activist Allyson Green, has announced that it will be canceled, effective immediately. The event, which was set to begin on September 3, was to feature work by a select group of seventy artists, including Alexander Calder, Sarah H. Meara, Anna Atkins, and Pia Camil, and would have focused on the themes of reproductive rights and feminism. “The hand", "The next Biennial should include a selection of works by artists and other thinkers whose work is currently under consideration for the 2020 award. This will include works that have not been on view in the past. The 2019 awards included: Mark Duggan (2017), The Trauma of Time, Erin Thomson (2016), and Evening Standard, Laura Mulvey (2015). The artists who were selected to participate in the 2020 awards are as follows:Anabel Kerber, The Trauma of Time (2018)Theatre of Cruelty (2017)The Cultural Landscape: An Illustrated History (2018)Kate McCarthy, Night Sky (2018)The Dandelion Tree (2018)Ivan Albright’s House of Life (2017)Art - about (stereotypical)Art - about modernism (2019)Art - about modern sensibility (2018)Art - about the twentieth century (2018)Art - about the twentieth century and the twentieth century’s role in Europe and the Americas (2019)Art - about the nineteenth century (2019)Art - about the twentieth century and the twentieth century’s role in the world (2019)Art - about the nineteenth century, and the Middle Ages (2019)", "The next Biennial should be held in 2020, said a proposal that was presented to the organizers by the National Museum of Modern Art in Paris in early September. The opening of the museum is slated to coincide with the Fifty-Seventh Venice Biennale, which will take place in June 2021. In order to avoid disruptions to the events of the exhibition, the next edition of the Biennial will run with a different theme. The theme of the third edition of the exhibition will be “From the Bed to the Floor: Exploring the Art of Perpetual Motion”. During the exhibition, artworks, including paintings by El Passio, Die Wegen, and Burne, will be presented in order to give the impression that the artist’s movements are permanent.“We are convinced that the new museum will be a great step forward for the biennial, being a new institution that has no previous experience in the art of contemporary art and that will be guided by the expertise of a superb, experienced curator,” said Bernardo Pindell, president of the Grand Prix de l’Amiti. Earlier this month, the biennial announced that it plans to remain closed through March 29. The pavilion", "The next Biennial should aim to create a more integrated experience between art and the environment, in order to continue to thrive and to create new works. To that end, the Biennial will introduce several new initiatives that will promote the international exchange of contemporary art and enhance the exhibition and exhibition program. It is a great honor to present this year’s event in the beautiful city of Lisbon, which is famous for its artistic and cultural bounty.”The 2019 edition of the biennial, “In Memoriam,” will be held in the former barracks of the Portuguese Army in the city of Porto, in the north of Portugal, from March 9 to March 12. The exhibition will feature works by more than seventy artists, including the artists of the preceding twelve months, and will be organized in the following ways: 1. The exhibition will be divided into three sections: the first will be dedicated to the artists who have declared their intention to withdraw from the Biennial; the second will consist of discussions about the artists’ withdrawal from the festival and the reasons for their decision; and and the third will focus on the artists’ reactions to the decision.The artists who withdrew from the 2019 edition include Fernando", "The next Biennial should take place on Thursday, September 25, 2020 at the Saint-Louis-de-Provence in France. It will be a retrospective of the full exhibition schedule, curated by the artist and produced by the Biennale de Lyon, and will include a performance by the artist in collaboration with the National Gallery of Canada and the Centre Pompidou in Paris. The new location for the biennial will be in the city of Lyon, France, and will inaugurate the new exhibition. The costume design for the exhibition will be created by the artist with the help of Pirea, the Paris-based design studio founded in 1985 by a group of five artists that included Jean-Michel Basquiat, Helene Blau, and the French conceptual painter Nathalie Béchard, among others. The design of the exhibition will be based on themes from the artist’s recent solo exhibitions at the Metropolitan Museum of Art, New York; the Saint-Louis-de-Provence, Lyon; and the Museum of Contemporary Art, Los Angeles. The event will also include a series of talks and performances by contemporary artists, including Judith and Hélène Malraux, who will present", "The next Biennial should inaugurate the installation of a new exhibition, “Histoire du Biennial,” which will focus on the history of art in the exhibition, which will also include a presentation of artworks on paper by the artists represented in the exhibition. The exhibition will run in the next iteration of the Biennial De Paris until November 9, 2022.\n\n\nThe Tate’s board of trustees has appointed the Bahrain-born, Bahraini-based curator and critic Ahmed Al Dhadeer as the next director of Tate Britain. Al Dhadeer will be responsible for creating a new program of programming for Tate’s three-week fall exhibition, “The Biennial Experience,” which was staged in February at the end of last year’s London Olympics and will begin on October 26. Al Dhadeer will assume his responsibilities in March.“Al Dhadeer’s appointment ensures that this year’s biennial runs smoothly and safely, and is a significant milestone in the building of the biennial experience,” said Yasmin Abidi, director of Tate Britain and chair of the trustees. “Tate has long championed the growing number of artists and thinkers who have dedicated", "The next Biennial should take place in 2020. A preliminary list of artists and curators has been published, and the 2020 biennial is currently on display at the Institute of Contemporary Art in the City of New York.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles plans to move six hundred works by fifty-three artists and collectives on its campus from the Metropolitan Museum of Art in New York to the Los Angeles County Museum of Art (LACMA), which is slated to open in the spring of 2021. The move is part of a broader plan for the museum to become a more culturally engaged venue. Inaugurating its new space will be an exhibition devoted to the life and work of MoCA cofounder Frank Gehry. The museum will also stage a performance and a film every Tuesday.“We have been working for years to make the Met archiving the works that are most important to our community,” said museum director Michael Govan. “This new arrangement will provide much-needed space for these artists and their projects to have their works showcased at the museum. It will also allow us to broaden our collection and exhibit the collections from the Met in new and engaging ways.”In addition to the works relocated,", "The next Biennial should be held in the United Arab Emirates, and its organizers said it would announce a date for the exhibition in the coming months. They also said that the event would include a biennial. “This is a moment of great change for us all, and I will do everything I can to support the work of the biennials that are already underway,” said Abdullah bin Zayed, the UAE’s minister of culture.\n\n\n\n\n\nDebbie Hoberman Gallery in New York and Blake L. Baker Gallery in New York have announced their representation of Emily A. Posner and John D. Wilson. The artist has been based in New York since 1988, and has exhibited internationally, including in the Venice Biennale (2006), the Venice Architecture Biennale (2007), and the Venice Film Festival (2010).Her works are also featured in the following museums and collections: the Museum of Modern Art, New York; the Metropolitan Museum of Art, New York; the Museum of Modern Art, New York; and the Metropolitan Museum of Art, New York.For the 2011 and 2012 editions of the Whitney Biennial, the artist was represented by Marc-Olivier Bischoff, whose art was curated by", "The next Biennial should be held in the spring of 2022. The decision to suspend the exhibition came after the exhibition’s organizers received a letter that told them that the exhibition had been cancelled due to a lack of interest from the national and international arts community. The letter, which was signed by thirty-six German cities, including Berlin, Stuttgart, and Cologne, read: “The exhibition was not received not accepted and is not receiving attention and is not treating like a project . . . . The exhibition has been canceled because the city does not want to take the risk.”The Berlin Art Week announced last week that the exhibition will now be moved to a “legitimate” museum. However, the move will also leave the Berlin Gallery of Modern, where Biennale 2017 was staged, without a permanent director. The Berlinale, which runs until October 19, will relaunch with a new exhibition of work by forty artists, some of whom staged exhibitions of their own last year.\n\n\nAfter a court ruled that a British artist must pay a Chinese artist $2,500 for using a miniature world he", "The next Biennial should take place in 2021 and is scheduled to run from March 25 to March 29. \n\n\n\n\n\nThe National Gallery of Art in Washington, DC, has appointed Harriet Rowland as its interim director. Rowland will be responsible for spearheading the institution’s transition to an entirely digital model for the collection and exhibition of art. During her tenure, the museum will embark upon a major redesign, which will incorporate the installation of more than two thousand digital works and will introduce a new online catalogue.“We are thrilled to welcome Harriet to the National Gallery as its interim director,” said Mark Lubell, chair of the museum’s board of trustees. “Harriet is a leader and a true visionary who has built a distinguished and dedicated career as a curator, educator, and administrator. She will continue to lead and shape the gallery with the knowledge and expertise she gained during her ten years at the National Gallery. We look forward to working with her to build on the museum’s commitment to supporting the arts and supporting a vibrant and diverse community of artists.”The museum has previously hired Marc Spiegler as interim director and curator of modern and contemporary art, and Ravi Shankar as", "The next Biennial should aim to 'take an active role in the long-term development of the annual museum’s collection, exhibitions, and programs.” In addition, the biennial should consider the possibility of creating an annual prize for excellence in art history. In 2017, the biennial was awarded a $50,000 prize.\n\n\nThe City of New York and the Metropolitan Museum of Art in New York have withdrawn from a proposed deal that would have seen the former Heinz brewery, located at 131 East Tenth Street in Manhattan, become the site of a $600 million renovation and expansion project. The move has sparked protests from local preservationists and activists concerned that the museum’s redevelopment plan, which involves the conversion of the former brewery into a cultural hub and created a new public space in the city, will negatively affect the landmarked landmark.The   New York Times reports that the deal was pushed through by the New Communities Fund, a New York City-based organization that provides capital and financial assistance to cultural nonprofits under the direction of New York City Mayor Bill de Blasio. The group behind the project, the architectural firm Herzog & de Meuron, received $500,000 from the fund. In a letter addressed to Mayor Bill", "The next Biennial should be held in 2021 and will aim to be a follow-up to the “150 Years of Art” and “Centre-piece,” curated by Jean-Marc Marin in 2006.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Shawn Turner as its next director. Turner will be responsible for overseeing the museum’s relationship with the artists and institutions whose works are on display at the institution.“We are thrilled to welcome him to the museum,” said Joan Moses, the institution’s director and CEO. “He has the vision and the ability to deliver on MoMA’s mission to present the art of our time in a meaningful and innovative way.”Prior to joining MoMA, Turner founded the nonprofit artist-run space the Museum of Modern Art (MoMA), which he ran for seven years. He became the museum’s first board president when he assumed the role in 2014. During his tenure, he extended the museum’s exhibition program, expanded its collection, and added new exhibitions. He also oversaw MoMA’s expansion into a museum, a cultural district, and a cultural district center.After serving as director", "The next Biennial should be held in 2020 but has not yet been decided upon. The organization will announce the date and the location of the 2020 edition in mid-March. In the meantime, the organization has released a statement regarding the possibility of a retrospective of the artist’s work at the Museum of Modern Art in New York in 2021. In the statement, the museum said that it will evaluate the exhibition of the artist’s work in 2021 and the date of the film exhibition will be announced in the spring of 2021.\n\n\nThe National Gallery of Art (NMA) in Washington, DC, has hired Adam Gopnik as its new director. Gopnik comes to the institution from the National Council on the Arts, where he has served in various roles, including director of public engagement for the past four years. He succeeds Doris Duke, who retired in March after fifteen years at the helm of the institution.“Adam brings with him a wealth of experience and knowledge in the fields of art and technology, and brings with him a passion for connecting with audiences through art and technology,” said NMA director Michael R. Weiss. “We are thrilled to welcome Adam to the NMA, as he", "The next Biennial should be held at a location that will be selected by the students and faculty of the institution. The venue will be selected by a committee made up of the students, the students' teachers, the students' friends, and the members of the faculty.The 18th iteration of the Biennial was held at the Sentosa Museum of Art, in Lisbon; the largest museum dedicated to the art of the world in Portugal. The event was presented by the Portuguese government and has received support from the government of Portugal as well as from the European Commission. The exhibition, titled “Monarchs of Painting” and curated by Petra Teixele, was originally scheduled to run April 14–April 22 but was pushed back due to the Covid-19 pandemic. “We think that this year is going to be a really good one,” Paula de Almeida, director of the Biennale of Portugal, told the Art Newspaper. “The exhibition is going to be a world-class exhibition, and we are very pleased to be able to present it at the Sentosa Museum of Art.” \n\n\nOn Wednesday, the Museum of Fine Arts (MFA) in Boston announced that it is preparing to", "The next Biennial should be the twenty-eighth, occurring in May 2021. The ten-member team will be comprised of Osman and Ali H. Ali is a professor of architecture at the University of Technology, Birmingham, and a member of the Department of Architecture, Design, and Planning; Leslie A. Clyne is a professor of art at the University of the Arts, London; and Hannah Hare is a curator and writer based in New York.Cleveland’s architectural dramaturists, each of whom is responsible for a different branch of architecture, were selected by a jury. Among the curators who will be represented at the museum are Marcel Prouvé, Alexandra Shager, and John Tilton. The biennial will be held at the Cleveland Institute of Art (CIA), a state-owned, nonprofit organization that has hosted numerous contemporary art events, in partnership with the Cleveland Art Museum. The museum will also have a permanent collection of contemporary art.The thirty-three-member jury comprised of Richard Fiskin, president of the National Association of Curator-In-Charge, and Julie O. Stoltz, director of the Center for Design at the Art Institute of Chicago; John Kilgore, a curator at", "The next Biennial should be held at the New Museum in New York in 2021.The American Alliance of Museums (AAM) has announced its representation of the artists and their collections in conjunction with the Royal Ontario Museum in Toronto and the Metropolitan Museum of Art. The artist-run organization will stage a retrospective of the work of the late photographer Anna Atkins on October 11.The show will celebrate and present the work of fifteen contemporary artists, including Lily Allen, Sarah Bradford, Andrea Cinque, Olivier-Georges Seurat, Calvin Klein, David Lynch, Jack Nicholson, Brad Pitt, Kirsten Grant, Kate Moss, Kate Winslet, and Mark Ruffalo. The exhibition will also include a biannual Celebrate and Move exhibition.The 2019 edition of Celebrate and Move featured works by fifty-nine artists, including Jennifer Garsholt, Eric Karp, Tilda Swinton, Luella Ozawa, Jewell Allen, Artur Bichir, Eli Wallach, Timur Bonty, Tom Digby, Linda Foster, Aleksandra Gobbins, ", "The next Biennial should be held in 2021, and an announcement of the dates and the locations of the exhibition should follow soon. The 2019 edition, titled “Forests of My Skin,” featured work by twenty-three artists working across twenty-four cities and participating in a series of annual awards that celebrate the body and the environment. \n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Matthew Booth as its new artistic director. Booth, who has worked in the field of contemporary art since he was twenty-seven years old, joins the institution from the Museum of Modern Art (MoMA) in New York, where he has served as a curator since 2015. “Matthew’s long-standing commitment to exploring new ways of thinking about cultural heritage and contemporary art has led him to become one of the most eminent contemporary curators in Europe, Asia, and the Americas,” said David Mitchell, the ICA’s director. “His vision for the ICA is ambitious and envisions a future for ICA as a global platform for contemporary art as well as a new kind of museum that collaborates with and supports artists and audiences.”Booth’s first role at the ICA", "The next Biennial should be forward-thinking and dynamic, celebrating the serious work of women artists and the history of contemporary art. “I’m eager to see how the new platform will help us move beyond the past and help us recognize the historic achievements of artists who have already completed their careers,” said Kunsthalle Basel. The 2018 edition of the exhibition will be staged at Basel’s Hong Kong headquarters and will draw up to twenty-five artists, including Andrea Hulke, Ana Mendieta, Jassen Kooy, Angela Pfeifer, Klaus Stöckl, Christa Warhol, and Mie Farah.The exhibition will also host a special exhibition of the works of the Swiss artist Gottfried Kracauer, who is best known for creating works that challenge the boundaries of art and are also notable for his unashamedly communitarian aesthetic. Kracauer’s work will be included in the forthcoming exhibition “Art and Culture,” which will open in May 2020 at the Kunsthalle Basel, and is one of the first works by the artist in the United States.\n\n\nThe National Museum of Fine Arts (NMA) in Washington, DC", "The next Biennial should take place in 2021 as part of the European Space, the Dubai Art Museum, and the British Museum in London, and is also supported by the Royal Society of London. The project will include an exhibition titled The Female Body, which will open in February 2021. “Women are the first to have their own space in art museums. We cannot help but imagine what it would be like to be able to stand alongside them, to sit next to them, to touch their bodies, to feel their bodies, to see their bodies, to hear their bodies, to feel their voices, to feel their bodies in front of their eyes,” Marcus said. The Biennial will also include a public program and a public lecture series, which will take place in the city. The lecture series will begin in December and will feature interviews with artists; members of the public, including a biennial director and a group of young artists; and biennials; some of whom will be heterosexual and some of whom will be bisexual. The keynote speech will be given by Prokofiev, who will collaborate with the artist Elena Nodova, and will be hosted at a location to be announced.The 2018 prize jury chairman, Kazuko", "The next Biennial should be in 2021; MOS Intramural Games in 2022; and MOS Interdisciplinary Games in 2020. There is currently a project for a new exhibition at the museum that is a continuation of the aesthetic of the museum’s collection.According to the Los Angeles Times, the 2020 edition of the exhibition is being organized as a “mythology” exhibition, which includes works by no fewer than forty artists. “The Museum of Contemporary Art is telling us that it is sending a new generation of artists to Los Angeles to create a new exhibition, a new format, a new experience, a new subject, a new work,” Arthur told the Los Angeles Times. “We’re going to make something that’s new and new to us.”\n\n\nThe Massachusetts Museum of Contemporary Art (MMA) is moving forward with a reopening date of February 21, 2020, following a massive $100 million expansion. The renovation is the result of a $150 million grant from the Draper Foundation, which is dedicated to supporting contemporary art and the arts in America, as well as a $10 million gift from the Koch brothers, who have donated $80 million to the institution since", "The next Biennial should be held in 2022.\n\n\nThe San Francisco Museum of Art (SFC) has named lawyer and artist Steven H. Michael as its new senior director and chief artistic director. Michael, who will assume his post in January 2020, is the author of a number of books, including  The Art of Illusion: An Introduction to the Art of Illusion (Eugene Spieler) and Truth or Damnation: A Modern History of Christ (Simon & Schuster, 2018), and is the recipient of the Edgar F. Kennedy Award for his work on art. He also has an endowed professorship at the University of California, Berkeley.During his tenure at the museum, Michael has organized numerous exhibitions, including “The New Black: American Art in the Age of Black Power” (2008); “The Omnipotent: The Conceptualization of the Divine in Art and Art History” (2009); and “Lunching With the Gods: Art and Religion in the Laundromats” (2015). He also contributed to the institution’s collection of Vincent van Gogh’s Sky Man, 1965, for the 2020 Sundance Film Festival.“Steven�", "The next Biennial should be in 2020. The Biennial is a platform for the exchange of contemporary art, and is organized around the theme “GODS AND GOODNESS’ . . . The theme is sacred, prophetic, and historical.” The 2020 edition, which will take place in Milan, will include work by forty-two artists and will run for twelve weeks. The exhibition will be hosted by the Museo Teatro Milano and the Rossini, which will stay open until September 29.The 2019 edition, which was curated by Angelino Pessoa, was organized in collaboration with the Museo di Carrera di Milano in Milan. The exhibition featured work by artists such as Eduardo Anisimov\u0097who created a series of interrelated sculptures that reflected the vicissitudes of human existence\u0097Naveen Sood, Manish Mukherjee, and Shirley Taggart\u0097as well as Hans von Strasse, Jasmine Tuttle, and Kate Tempest.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has announced that Ahmad Rashid has been named the next director of the institution. Rashid currently serves as the director", "The next Biennial should be held between March and November 2020. The upcoming Cleveland International, which was scheduled to run March 29 to March 31, 2020, has postponed the event. In a statement, the Biennial said: \"We are grateful to the Cleveland Museum of Art, the Akron Art Museum, the Cleveland Public Library, the Cleveland Public School, the Cleveland Public Library & Arts, the Cleveland Public Library, the Cleveland Public Library, the  Akron Art Museum, the Cleveland Public Library, the  Library of Congress, and the National Gallery of Art for their understanding and support in understanding the circumstances which led to the postponement of our 2019 event. We look forward to welcoming our new audience for the first time in 2020. We are also grateful to the many city, county, and state governments, including the Ohio Secretary of State, the Cleveland Board of Education and the Cleveland School Board, the Cleveland Public Library, and the Cleveland Public Library staff, for their dedication and dedication to the city of Cleveland’s theme this year.”\n\n\nThe National Galleries of Scotland have ordered the removal of an exhibition featuring the work of British contemporary artist Paul Gauguin, which was scheduled for the institution’s", "The next Biennial should be a celebration of the artists and thinkers who have shaped the exhibition and our times. We expect our next edition will embody the spirit of great international exhibitions, drawing together the world's most distinguished artists, curators, collectors, and institutions.\n\n\nThe ten-seat exhibition “The City,” which opened on September 2, 2019 and ran through the end of March, has announced that it will not move forward with the exhibition, which was committed to honoring the city of New York’s cultural and social contributions, and has offered a statement on its Facebook page. Titled “The City,” the exhibition was preceded by a series of five others, which were “The Garage,” “The Garage 2,” “The Garage 3,” and “The Garage 4.” In a statement published on the gallery’s website, the artist-run space said “The City’s’s’ evolutions and transformations have meant new opportunities for the artists who were chosen to represent us in 2019, but that these opportunities have also made their voices, and those of many others, more difficult.” The statement continues: “", "The next Biennial should be held in April 2021. In October 2019, the institution announced that it would postpone the event until December 2021. However, in a forum hosted by the Art Newspaper, Fernandes reiterated his belief that the 2020 edition would go ahead as planned. Speaking of the event he said: “I would like to express our appreciation to all our partners who have participated in the construction of the Biennale, and especially to the French government, the Basel-Munich Council, the Fondazione Prada, and our partners in Barcelona, and especially to the brilliant and passionate team of artists in Spain who have made this an exceptional exhibition year.”\n\n\nThe Royal Academy of Arts (RA) in London, which has been closed since March due to Covid-19, has commissioned artist Billie Blake to create an eponymous work for its new venue, the Institute of Contemporary Art (ICA), in Barking, London. Blake, who is also known for his sculpture, installation, and performance, Ragtime, is suing the city of London to secure the long-term future of this iconic structure.The news comes amid the ongoing publicity regarding the Covid-19 pandemic,", "The next Biennial should be held in 2020. The 2019 edition, which was staged at the Toronto Art Gallery, attracted 2,402 visitors. Following a complaint from the Canadian Alliance of Arts, the exhibition was moved to the National Arts Center in Ottawa. Two years later, a second exhibition, “The Art of Absurdity,” was staged at the Art Gallery of Ontario, which was then in the process of reopening following a $1.6-billion expansion.“We are delighted that the Biennial is reopening,” said Eva Krieg, director of the exhibition. “We are eager to share with our visitors and the wider world the splendour and beauty of the contemporary world. We hope that they will join us for our reopening exhibition.” The National Gallery of Canada also announced on Wednesday that it will introduce new exhibition programming with a focus on the contemporary arts. The new program will introduce biennial films and performances, which will be presented in partnership with non-profit organizations, and will focus on themes of science, technology, and technology innovation. It will also include tours of the National Gallery of Canada’s new home on Parliament Hill.The program will be inaugurated by a", "The next Biennial should be completed in March 2020, according to Lamber. * “The next fifteen years will be a journey of discovery, of experimentation, and of disappointment,” he said. “We will be able to say that this is the year that changed our lives.” He also said that the critical decision to leave the country was not made until after the event was already underway. Commenting on the decision to leave, Lamber said: “It has been an honor and an honour to share this stage with the artists that have shaped the history of the city of Birmingham and the state of Alabama.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Rachel Rubin as its next executive director. She will be responsible for policy and curating for the institution, which comprises several buildings in the city and its suburbs, as well as for the development of its programming, exhibitions, and public programs. Rubin comes to the MFA from the Danish nonprofit organization Kristelnadze Nationalgalerie, where she has served as chief curator since 2013. The institution has experienced a series of expansions, which have expanded the scope of its collection and contributed to the museum’", "The next Biennial should be held in 2020.\n\n\nThe British artist Vincent van Gogh, whose iconic images of landscapes and people fascinate audiences as well as historians and has inspired countless imitations, has died at age eighty-nine.Born in London in 1938, van Gogh discovered his taste for abstraction through his early painting and drawing. In the mid-’s ’50s, he shifted from painting to painting and drawing. His paintings portray landscapes and people by juxtaposing images and sounds; he often uses shadows and mirrors in his paintings, creating an impressionistic atmosphere.Van Gogh made his first work of abstraction, a landscape that has inspired numerous imitations in the decades since. However, unlike the best-known of these works, the Borghese Landscape,1951 (1967), van Gogh never painted the same landscape twice. Instead, in the early ’70s, he shifted from painting to drawing to create the earliest works in his series “Voices.” The storied series won three prizes in 1988, “Thesis on the Nature of Art” and “The Interpretation of the Life and Death of a Woman” (1989), and was included in the 2009 exhibition �", "The next Biennial should take place in Tokyo in 2022, at the same time as the Tokyo Olympics. The schedule has not yet been announced.\n\n\nThe Institute of Contemporary Arts (ICA) in Vienna has appointed the Swiss curator Wolfgang Vinograd, who curated the seventy-fifth edition of the International Museum Stuttgart (IMSS) in the city from 2011 to 2013, as its new director. Vinograd, who previously served as curator at the Museum der Moderne Berlin (MDB) in the capital of West Germany, will assume his post in January 2020. “We are delighted to welcome Andreas back to the ICA,” said ICA director Mona Hatoum. “In his new role, he will play a major role in helping to ensure that the ICA Vienna, which has been a core institution for the past sixty years, will remain at the heart of the city’s cultural life for many years to come.”Vinograd, who has helmed the ICA in Vienna since 2007, is currently the director of the Kunsthalle Basel and is slated to depart in January 2021. He is currently the author of Rendering the ICA: The Autobi", "The next Biennial should be held at the Museo de Arte Contemporáneo in Madrid in 2021.\n\n\nFilipinos working in the construction, food, and retail sectors in Manila have voted to boycott the 2019 edition of the prestigious Almaden Festival, which was canceled because of the coronavirus. According to the New York Times, activists are now demanding that the event be rescheduled.Organizers of the event, which is organized by a group called the Cadette de Artes Plásticas (CACP), say the decision to cancel the event was made on August 23, the same day that the coronavirus outbreak in Asia was announced. “The cancellation was made after the coronavirus outbreak was announced,” said Maderena Elena Vargas, an organizer with CACP and a member of the organization’s advisory board. “It was a decision made on the spot.”The dispute surrounds a piece of art that was included in the exhibition “The Apocalypse,\" which is part of the “Alice and Yamasaki Show” series, that was created by artist and artist-in-residence Tumbi Durante and her husband, Tonio Durante", "The next Biennial should be held in 2021 and will be hosted by the Museums Association. “This is a major milestone for us, as we have worked and experienced our way through the oldest permanent artworks in the world,” said Savita Asthana, director of the Museums Association. “The final design for the building of the exhibition will be inspired by the Eiffel Tower and will be inspired by the new city of Paris, with a modern and contemporary design.”\n\n\nThe British Museum in London has appointed Claire Barber as its new director and CEO. Barber comes to the institution from the Royal Academy of Arts (RA), where she has served as the director of exhibitions since 2015. During her tenure, she curated the first British Museum exhibition dedicated to the life and work of John Lennon and the second retrospective dedicated to the life and work of British painter George Muse, who lived and worked in the city of Bristol.“Claire is an extraordinary talent, with a clear and compelling vision for the future of the RA and we are delighted to welcome her to the institution,” said David Cameron, British prime minister and director of the British Museum. “Her background and experience will be crucial in delivering on the new", "The next Biennial should take place in New York in 2020. The exhibition will feature work by a selection of sixty artists, including Susan Sontag, Bernardo da Costa, and Dietmar Brzeski, and will run in conjunction with the 50th anniversary of the United States. The exhibition will also feature work by artists from the city and surrounding areas. The 2019 edition of the show was staged at the Museum of Modern Art in New York and featured work by forty-one artists. \n\n\nAn Egyptian court has sentenced four former members of the Muslim Brotherhood to thirty days in prison and one hundred lashes for offences that were traced to their involvement in the 2015 uprising against President Abdel Fattah El-Sisi, according to Egyptian news outlets. The verdicts, which were handed down in the eastern city of Minya on February 12, were hailed as a victory for the government, which had been attempting to place the Brotherhood under surveillance and clamp down on its activities since at least 2013.The defendants were initially charged with terrorism offenses and were scheduled to face a trial in Alexandria next month. In a ruling published on February 14, a judge in the southern province of Minya found them guilty of inciting terrorism and sentenced them to two years and three months", "The next Biennial should inaugurate with a presentation of “Traditions of the Night,” a selection of artworks by the Adnan Syeed Foundation. The event will be preceded by the exhibition “Abandon all hope, no matter how high,” and will run until March 20.The first exhibition will consist of three short films, “Imbu Makat,” “Muzzu Tijani,” and “Aura of Peace.” The second, “Sadiq Masood,” will be on view March 14–March 16.The third exhibition, titled “Modernism and the Modernist Imagination,” will be on view March 17–March 20.The fourth exhibition, titled “The Life and Death of the Soul” will be on view from March 20–March 21.The fifth exhibition, titled “The Art and the Body,” is set to open at the Biennial in June. The sixth exhibition, titled “Moholy-Nagy: Modernism and Scientific Exploration” will open at the Biennial in November. The seventh, titled “Freud, Cinema, and the Cinema”", "The next Biennial should be in December 2020. The exhibition will include works by seventy-five artists representing forty-six countries, and will consist of eight exhibitions of work. The festival’s executive director, Amada Cruz, said: “The next Biennial will bring together the most innovative and talented contemporary artists in the world, and strive to provide a platform for their work to be experienced by an international audience.”\n\n\nThe National Gallery in London has received a £2 million donation from the billionaire collectors Nari Ward and Beatrice Effenberg. The money will be used to restore the National Galleries Contemporary in London’s historic building, which was completed in 1952 and serves as the headquarters of the National Gallery. The institution, which recently celebrated its fiftieth anniversary, was plagued by financial problems in 2017 and 2017 was forced to close its doors for more than seven months.“The National Gallery, as an institution that celebrates and defends the history of our country, its arts, its people, its institutions, and its collections, has always been and remains a model of humility and generosity,” Marie Beard, the museum’s director, said. “We hope the gift will enable us to continue to", "The next Biennial should be held in 2020. The 2019 edition, which took place in the National Museum of Contemporary Art, was at the National Galleries of Scotland.\n\n\nOolite Arts, the New York–based nonprofit that aims to promote critical cultural exchange among the world’s leading art and artmaking regions, has announced its representation of the Korean artist Kang In-kyung in the upcoming exhibition “The Stories We Tell.” Kang, who is best known for his collages depicting personal and social histories, was selected as the first artist to be represented by the nonprofit, which was founded in 2006 by mutual friends Richard and Linda Kaczor. The first exhibition devoted to the artist’s work was staged by the K-Pop group Seo-kyung Games in Seoul in 2015. The K-Pop exhibition was followed by the first solo exhibitions of Kang’s work at the San Francisco Museum of Modern Art and at the National Museum of Fine Arts in London.Kang began producing his collages in 1987, with a group of friends. Some of his earliest works, which have been featured in exhibitions at the K-Prize, the K-Art Museum in Seoul, and the Folkestone Museum in Oxford", "The next Biennial should be held in 2023.\n\n\nThe Bessies, an art museum in New Jersey founded by Dorothea and Thomas Bessie in 1973, is facing a legal battle after a group of arts professionals who were invited to present works at the museum in 2012 withdrew their works from the upcoming exhibition. The museum has ordered the artists to return the works at a future fair, and the heirs of the clients have filed suit claiming the trustees breached their agreement when they failed to remit payments.In their lawsuit, the Bessies claim that the trustees are violating their agreement by refusing to honor payments owed to the estate of Jean-Michel Basquiat, who died in 1977, and that the museum’s failure to remit payments violates a provision in the agreement which states that “claims of a personal and indisputable character” may be asserted. The suit also claims that the trustees are breaching the agreement by refusing to return artworks that the Bessies donated to the museum in the last fifteen years.On March 6, the court in New Jersey dismissed all of the Bessie’s claims in a 5-4 decision. In a separate case, a jury in Connecticut awarded the Bessies", "The next Biennial should focus on “reconstitution as a mode of self-creation”\u0097as described by Anderson in “The Reconstitution of Life: Art in the Age of Empire.”In a society plagued by social division and political violence, cultural artifacts are central to healing divisions and promoting social cohesion. In 2015, the Museum of Modern Art in New York unveiled the work of Italian designer Beccaria Catellani. The next edition of the Biennial will take place in September and will be preceded by a special exhibition, “Art and Politics in the Age of the New Japanese Republic,” on October 19–October 21. It will also introduce new programming, including a symposium with a new title, “Awareness,” and will host a series of global talks.\n\n\nOn Saturday, the New York City Department of Cultural Affairs (DCLA) announced that it is taking the rare step of labeling certain works by visiting artists as “non-essential.” It also banned certain works by visiting artists from being displayed in public spaces and restricted the displays of works by visiting artists in some cases for a week or more.Curated by Domenick Costantini,", "The next Biennial should be in January 2020. The first phase of the project, “Phase One: Science,” is currently under way. The next phase, “Phase Two: Culture,” will be initiated in 2021. A new exhibition, “Real Life: Biennial” has been initiated. The next exhibition, “I: Contemporary Art: Modernism and Materiality” will be inaugurated in November 2021. A new collection of digital works will be presented on the theme “Digital Life:” in March 2022.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has unveiled its first-ever digital exhibition, “Digital Life: Contemporary Art,” which will offer an exhibition of works created today. The event will feature works by sixty artists, including Rachel Chiu, John Akomfrah, Peter Andre, and Adrian Piper, and will run from January 15 to February 16. The inaugural event, titled “The Future Is Digital,” will be free to the public and will feature works by artists such as Nadine Motta, Emily Hall, László Molnár, and Mark Rylance.The exhibition will", "The next Biennial should take place in 2020. \n\n\nThe CNA, the China National Art Museum (CNA), in Beijing, has unveiled its next exhibition centered on the Chinese artist Wang Yue, who pioneered work in Central and Western Asia and was one of the first artists to be taken seriously by Kunsthalle Basel-CNA. The exhibition “The Body of Art” will take up the themes of the twentieth century and the Cultural Revolution and will run until March 5.“Wang Yue’s work has been brought to life in a new and innovative way,” said Kunsthalle Basel-CNA curator Joachim Neugroschel. “Through a combination of new and traditional techniques, the artist creates a sculptural, fantastical, and mythologic world. Thats the power. He also combines a high degree of technical ability with a strong intuition to make an imaginative, experimental, and often surrealist performance.”Born in 1937 in Shenzhen, China, in a family of textile engineers, Wang Yue moved to Beijing in 1949 to study under the Chinese painter Gao Zhijie at the National Academy of Art, where he discovered the Chinese drawing-and-painting art.", "The next Biennial should be held at the Museum of Contemporary Art Sarajevo in July 2020, and the reopening of the Biennial will coincide with the International Biennial Biennial of Mexico City, which will take place in September 2020. Robbie de Roon, the architect and curator who curated the 2015 exhibition Biennial of Italy, added: “We have a responsibility to do more to support the arts and we are currently seeing a shift in focus at the museum towards more research-based exhibitions and projects. We are working hard to find ways to engage with our audiences in engaging ways, and I am excited by the possibility of creating a new platform to stimulate and educate our most vulnerable. . . . We will continue to build on the Biennial’s legacy by working with and for our audiences, and by supporting artists and their work. As a society, we are facing many challenges and moments, and we mustn’t forget to support the arts.”\n\n\nThe Art Newspaper recently ran a story about the upcoming reopening of the Mondrian-designed space at the Palazzo Nazionale di Battista, the famed Italian Art Museum in Venice, as part of a massive renovation project that will revamp the", "The next Biennial should focus on the collective memory of the women who were killed or maimed in the attack and provide a platform to discuss how to prevent future attacks. The conference’s design, which is inspired by the Taormina–Fatima painting, is inspired by the four women who drowned, and the exhibition should draw from the collective memory of the victims of the atrocious terrorist attacks in Paris on November 13, 2015.“The building was created by architects Raoul and Ido Mestelmans as an extension of their practice, and is located in a courtyard with a garden on the second floor,” said Ido Mestelmans. “The exhibition is an extension of this practice, and a response to the tragedy in Paris, and to the moral crisis of the world today.”The exhibition will be staged as part of the Biennial Foundation, an organization established by the Mennonite brothers in 2014 to support the victims of the attacks. Elie Wirth, the founder of the Mennonite brothers’ museums in Copenhagen and Geneva, used the Mennonite name in an attempt to raise funds for the victims of the terrorist attacks, but the initiative was not successful. “With many", "The next Biennial should be held at the Art Museum in Winnipeg in 2021.Museum director Maria Bettencourt-Niles has described the redesign of the Biennial as a collaboration between the city and art-world institutions. “The University of Manitoba’s new campus is a fantastic place to support the MNA’s international graduate students while also serving as a major work-study destination for Winnipeg’s arts community,” she said. “We are excited to see how the design and construction of the new museum will advance the museum’s relationship with our communities and the country.”\n\n\nTacita Dean, the director of the Heirloom Arts Gallery in Baltimore, was appointed as the new artistic director of the Archdiocese of Washington, DC, by Archbishop Charles W. Chaput of the Diocese of Washington, DC, on Sunday, March 25. Dean currently serves as the director of the Bridgman-Palmer Museum of Art in downtown Washington, DC, and as the director of the Brooklyn Museum. She succeeds Kelly Collins, who retired in February after a decade as archbishop.“I am tremendously honored to have been named the new archbishop of Washington, DC, and to", "The next Biennial should take place between the dates of July 20 and August 7, 2020. It will be hosted by the Vassar College Museum in Rome and will officially launch with a special performance by a selection of contemporary artists. The theme for this year’s edition will be “Avant-Garde in Early Modern Europe.”“This year’s Biennial will be a celebration of the power of art to shape and shape, in a time when art is at the forefront of our lives,” said Elena Zingaretti, president of the Milan-based foundation and an Italian professor at the University of Padova. “The show will feature some of the most important works of the last twenty-five years and will be dedicated to the art of the past.”\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles is planning to close its doors permanently to the public next month, in an effort to reduce the environmental impact of the megastructure’s construction. The museum’s former grounds have been transformed into a seventeen-acre garden, and the entrance to the museum has been relocated to a new entrance at the institution.The renovation, which began in 2011, involved", "The next Biennial should take place in 2022, when the exhibition will be relocated. The institution will also be reorganized and will once again host exhibitions, performances, and other events.Commenting on its future, Daniel Boecker, the director of the Biennial, said: “The new museum will not only be an important milestone in the museum’s history, but also a great opportunity for visitors to imagine and experience the museum in its original form in a new way. It will be an enormous challenge for the staff to change the institution into something that is new and wonderful, but also a challenge for the public to care for the institution in their homes. As always, we are grateful to the museum for bringing this exciting project to completion.”\n\n\nNew York’s Metropolitan Museum of Art (MoA), which has faced mounting pressure to make changes since it was founded by Jewish immigrants in 1854 to serve the Jewish community, has appointed Elizabeth Clarke as its next director. Clarke, a New York native who has helmed the museum since 2016, takes the helm from Kirsten K. Friedman, who has helmed the institution since 1999, and will begin in her new role on September 1.“Elizabeth’s extraordinary track", "The next Biennial should take place in the fall of 2020. The next event, which is being organized by the Institute of Contemporary Art, will be held at the Venice Biennale and will be supported by the Guggenheim Foundation. The Guggenheim will also stage a new exhibition, “Toccarlo: The Movie,” at the Museum di Stampa in Rome in December 2020. In addition, the Museum of Modern Art and the Museum of Modern Art New York are still working on a new book.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of two landmark works by Pablo Picasso. The works, which were donated by Humberto Leon and Michelangelo Antonioni, were discovered by LACMA staff members in the museum’s collection during a renovation project that was completed in 2017.The gift, which is valued at $1.6 million, was made by Leon and Antonioni. The pair paid an undisclosed sum for the works, which were acquired through a joint venture between Leon and a California collector. The purchase also includes a Picasso print and a lithograph that are currently on display in “Triumph of the Will,” a special", "The next Biennial should focus on 'The Power of Art: Art in the Age of Mechanical Reproduction, 1941–1944” (2019) and “Art and the Body in the Late Nineteenth Century” (2020). The festival will also feature the exhibition “Lemme Walk Over You” (2019); “Piero Manzoni: The Machine and the Body” (2019); and the biennial “The Electric Phone and the Body” (2019).\n\n\nThe Los Angeles County Museum of Art (LACMA) is working with the Los Angeles–based design firm SparrowSwan to create a new public art installation, “The Solar System,” that will be installed throughout the museum next year. The work will be inspired by the performances of works by the late artist John Cage and the late composer Robert Rauschenberg, who inspired Cage’s iconic “Space Station,” a four-dimensional sculpture that was created near LACMA in 2007. The installation will be composed of micro-machines that will float in a liquid nitrogen-like atmosphere created by the artist and will be suspended from a geodesic dome in the museum’s Pacific", "The next Biennial should be ready by mid-June. \n\n\nNew York–based artist, activist, and curator Léonide Gallé, whose practice spans abstraction, performance, art, and politics, has died at age eighty-eight at her home in Brooklyn.The artist was born in Paris in 1931 and emigrated to the United States as a teenager. Gallé studied at the Academy of Fine Arts, the University of Chicago, and the New School in New York, where she met her husband, the French avant-garde photographer Claude Monet. Together the couple created the first-ever abstract paintings, both 1940, titled Visible and Immediatus, for the exhibition “Monochromism” at the Museum of Modern Art in New York in 1948.  Gallé’s art has been exhibited at the Museum of Modern Art, the Museum of Modern Art Shanghai, the Palais de Tokyo, the Museum of Modern Art, the Museum du Cinéma in Paris, the Museum d’Art Contemporain de Lyon, the Museum d’Art Contemporain, the International Center for Contemporary Art, the Museum d’Art Contemporain de Lyon, and the Museum", "The next Biennial should be held in 2019. The institution said it is currently planning to stage the first edition in 2021.\n\n\nThe Tokyo Metropolitan Museum of Art (the Met), which has faced several delays and cancellations due to the pandemic, has released the list of thirty-six artists who will be featured in the upcoming exhibition “NIRIN,” which has been on view since March 15, and will open on October 28. Among the artists are Ai Weiwei (November 21), Annie Leibovitz (November 28), Ai Ra, Lin-Manuel Miranda (October 29), Kunihiko Nara (November 23), and Kazuko Takahashi (November 26).The exhibition, which will feature work by more than 400 artists, will be curated by Yukihiro Mori, director of the Met; Grigorijs Simþ, director of the Bodog Museum; and Toshio Kondo, director of the Japan Foundation.“In the midst of the current crisis, the Tokyo Metropolitan Museum of Art, the acclaimed museum, and the many fine arts institutions in Japan, has decided to cooperate in the promotion of the exhibition ‘NIRIN’ during the first half of 2020,” said Mori", "The next Biennial should focus on “gender and sexuality” in the context of the ’60s counterculture,” the institution said.It will also introduce new materials and a new series of exhibitions, “Imagery: The Life and Death of an Icon,” that will have the work of fifty artists in the exhibition. The first show, titled “Goddesses of Lumière,” opened at the Museum of Modern Art in 2007. The artwork was inspired by a letter from American anarchist Bertrand Russell, whom the Biennial will present the first time, in January 2021. The letter also features three works by James Turrell, a black artist whose practice blends semi-abstract vision and extreme personal expression, and of an ornate carved pendant containing the words “I’m Not a Human Being,” a reference to the work of the Soviet and Cuban dictators Fidel Castro and Josef Castro.\n\n\nThe Museum of Modern Art (MoMA), which announced last month that it will temporarily shutter its three-story, eight-frame, glass-enclosed glass-walled headquarters in downtown Manhattan in an attempt to be closer to its 600,000-square-foot", "The next Biennial should also include a moderated exhibition featuring show pieces by artists including Nari Ward, Gabi Rocha, and Mark G. Pfeifer. The 2020 edition will be curated by Susanne Vielmetter of MCA Gallery, which has locations in New York, London, and Berlin. In addition to the guidelines for exhibiting art, the exhibition is hosted on the Biennial’s website, as well as on Facebook, Instagram, and Twitter.Due to a lack of space, the Biennial will not be held this year, but its upcoming edition will have a different theme and be organized in a different way. The 2019 Biennial, titled “Art and the Future of Humanity” and organized by the Max Planck Institute for the History of Science and Graz University of Vienna, saw its first exhibition at the Bode Museum in Vienna. According to the Art Newspaper, the show will be “more virtual,” and will be curated by a group of artist-communities based in the Greater Brussels area.The inaugural exhibition was curated by an artist-group of the same name in collaboration with the city of Brussels, which is led by Kammena Bochere, the mayor", "The next Biennial should be scheduled for December 2020. The exhibition will feature work by ninety-four artists, representing twenty-six countries and forty-eight regions of the world. The theme, The Place of Beauty, will be: “When Beauty Becomes Us,” and will be organized as a series of collaborative exhibitions. Each exhibition will showcase an artist’s work within one of the themes presented within the Biennial. The 20th biennial will take place in May in the city of Milan. The 2019 biennial, which was held at the Museo d’Arte Moderno, in Florence, Italy, and featured work by ninety-three artists, was co-organized by the Museo d’Arte Moderno and the MAMCO, in cooperation with the cooperatives of the Cova d’Andalucia and Brindisi in the Italian province of Bergamo. La Noma, the Italian nonprofit organization, has announced that it will award $100,000 to fifty projects in twenty-three cities and three provinces in the country. The fifty projects will be selected by a jury comprised of artists and artists’ representatives from the region, and will be able to bid for", "The next Biennial should be held in 2021, with the work of the artists invited from twenty-five countries in the world. The biennial will be staged at the X-Prize, a cross-disciplinary competition organized by the X-Prize Foundation. The twenty-sixth iteration of the theme “Art and Society” will be held in 2022.The 2018 edition of Art Basel Hong Kong was held at the Pavilion of Art at the Hong Kong Art Museum (HOKM) from November 21 to December 19, and featured work by forty-three artists. Titled “Art’s First Man,” a work by Hong Kong artist Rinko Ando, the work of Togo artist Jørn Ratzes, and the work of artists from Azerbaijan, Belarus, Georgia, Moldova, and Russia were selected for exhibition at the X-Prize; the works’ selections were announced on the exhibition’s website last week. The Biennale Hong Kong is slated to run from February 7 to February 14, 2020.\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Rebecca Meade as its next chief executive officer. Meade will be responsible for leading the", "The next Biennial should be held at the Royal Academy of Arts, London, in December 2020.“The goal of the new biennial is to keep the exhibition dynamic while exploring how art and architecture – with their inherent patterns of movement and interaction – are an extension of the body,” said Teju Cole, artistic director of the Royal Academy. “The exhibition will focus on how art and architecture can be creative spaces for healing and reconnection.” The exhibition will also attempt to incorporate elements of contemporary culture in a way that will enable the Royal Academy to evoke the spirit of the town in which it operates, and which has the potential to re-connect with the contemporary Manchester cityscape.The exhibition is part of the Royal Academy’s year long celebration of the fifty-third anniversary. In celebration of the milestone, the Royal Academy received a total of $5.5 million from the Royal Shakespeare Company, the Royal Agricultural Society, and the British Museum in a special grant.\n\n\nThe Tate has released the list of seventy-nine artists and collectives whose works will be included in the first exhibition dedicated to Greek architecture, the 2016 exhibition “The Past and Future of the Garden.” The first edition of the exhibition, titled", "The next Biennial should be held in 2020, but the date has yet to be decided. \n\n\nSouth Africa’s art and culture minister, Pravin Gordhan, announced today that the National Gallery of Art in Pretoria will reopen to the public in the coming weeks, following a brief interruption due to the Covid-19 pandemic. The reopening of the institution, which dates back to the nineteenth century, will allow the country to re-establish a new schedule of programming.The institution, which had been closed since March 14 due to the Covid-19 pandemic, reported a boost in visitors from March 18 to March 22, including a twenty-five percent increase in the number of visitors from March 19 to March 21. The increase in visitors was driven by a demand for art and culture. The government hopes the exhibition calendar will be more flexible for visitors from a variety of countries, adjusting programming to reflect different needs and priorities.The National Gallery of Art is the last major South African institution to close permanently. After a brief period of operation in March, the institution reopened in late April, and continues to operate today. The institution recently unveiled a new fifty-three-thousand-piece exhibition, “Beyond Borders,”", "The next Biennial should take place in the spring of 2021. The show will be hosted by the newly appointed curator of the American Indian Kiki Smith, whose practice includes speaking both in-depth and in-person with indigenous people, and will focus on themes of history, culture, and identity. “The Creators Project is aligned with the mission of the Museum of American Art, and we believe that a new generation of artists is needed to address this pressing and intractable issue,” said Kathryn Siegert, chair of the board of trustees.Sharon R. Lewis Gallery, which is currently in negotiations to lease space in the former Stratford-on-Avon factory, said it will not move forward with plans to open a new space in the former textile and metalworks district, which has been described by the architects as a “truly remarkable site.” Previously, the gallery has been working to relocate to a building on the ground floor of a recently renovated office block, which is slated to open to the public in the fall of 2020. The museum confirmed that the new space will be located at 1002 Beacon Street. The building is slated to house the institution’s permanent collection, and will be surrounded by gardens and terr", "The next Biennial should be held at the Aichi Triennale in Japan in December 2021. The 2020 edition will take place at the Aichi Prefectural Museum of Art (AIM), the Tokyo Metropolitan Museum of Art, and the Museum of Modern Art in New York, with artist collaborations spanning art history, academia and the arts.“The Aichi Triennale commissioned Matsuoka-san, the designer of the Aichi Triennale, to design the pavilion for the Aichi Triennale 2020,” said Yoshiyuki Shimonji, director of the Aichi Triennale. The Aichi Triennale is planning to put out a new survey of contemporary art, the Aichi Triennale 2020, and design in 2020. The survey, titled The Future Is Now, will be on view in the Aichi Triennale 2020 from September 17 to September 21.\n\n\nThe Museum of Contemporary Art (MoCA) has named James Cuno as its new associate curator of contemporary art. Cuno succeeds Sally Kornbluth, who has helmed the museum for twenty-five years, and will begin in his new role in January 2021.", "The next Biennial should be held at least ten years after the aforementioned event, and will presumably focus on the exhibition of the work of the artist on exhibition, not the performance. The first edition will be held at the Centre Pompidou in Paris, and will run from March 17 to March 21. “The contemporary art biennial is like a multiverse,” said artist Bitou Monyuma, who is part of the transport team that has organized the exhibition. “The artist’s body is a living organism, and the work of art represents life itself.”The next iteration of the event, titled “Un two halves,” will be held at the Centre Pompidou in Paris from March 19 to March 21. An extended edition of the exhibition will be held at the Museum of Modern Art in New York from March 21 to March 24. The biennial’s previous iteration, “From the Light of the Sun,” was held at the Museum of Modern Art in New York from November 4 to November 6, 2013.\n\n\nThe National Gallery in London is planning to close its doors permanently in November 2021, following more than forty years as an institution. The decision to end the", "The next Biennial should be back in September, at which point a new exhibition will open. Last year, the Biennale experienced a surge of interest from institutions and local governments in the United Kingdom, and the notice of the opening of the biennial was actually moved to the month of March.The upcoming edition of the Biennale will premiere at a newly renovated Schloss Albigenschule in Munich, the city of which the museum is a part. The Schloss Albigenschule, which is managed by the Albigenschule für Germany (Albiengesellschaft) and was established in 1945, has been the home of the Albæsteische Kunstverein (Albæstkultiskautei) since 1995. The museum features a collection of more than 600 works, including works by the Alberto Burri, Alfredo Cattelan, and Léonides Dalí, and is considered one of the most important cultural destinations in Europe.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than 116 works from the Boston-based artist and philanthropist John Douglas. The museum has donated more", "The next Biennial should take place in 2021, at the Venetian, and will be hosted by the Centre d'études de culture et de l'histoire biennial (CAC) of the Catalan city of Toledo. The twenty-fifth edition, which will be held at the Museum of Modern Art in New York in 2022, will be curated by Dorota and will be led by Jessica Morgan. The twenty-seventh edition, which will be held at the Museo de Arte Contemporáneo in Madrid in 2021, will be led by Nelson Schaeffer.The latter two exhibitions, titled Dorota et al, and Selected Essays, were selected by a jury comprising artist, curator, writer, and curator María Berrada, art historian and curator Adriana Barroso, and literary scholar and poet María Berrada. The jury comprised artist Harun Maruf, curator Juan Mina, writer Rafałał Hurst, poet Jared Diamond, and literary scholar and collector Patricia Maritz. The first exhibition, entitled Mariam: From Art to Art, was organized and curated by María Berrada and was organized in partnership with the Catalan"]