["The next Biennial should be held in the spring of 2020 and it will invite more than 1,500 artists and scholars from thirty-five countries to Barcelona for a three-day series of presentations curated by João J. Pires, the director of the Instituto de Arte Contemporáneo de Barcelona (IAC), and will also include the first exhibitions of works by artists from underrecognized regions of Brazil. In addition to the biennial, the institution will re-launch the Barcelona Art Book, which has been on indefinite hiatus since March 2019.\n\n\nThe City of New York signed a ten-year lease for the historic site of the World Trade Center on September 11, 2021, with the preservationist group Friends of the Fallacy, who staged a protest at the site in April. The organization said it received the lease agreement, which covers the structure of the former site of the Twin Towers and the area surrounding them, from the developer of the controversial Trump International Hotel and Tower in downtown Manhattan, and that the lease allows the foundation to live and operate there as long as the developer remains solvent.The lease marks the fourth time the group has attempted to persuade the city to sell the site to the group. In February 2018,", "The next Biennial should be held in Tokyo in 2022 and the first in Ljubljana in 2025. The plan is to organize an exhibition that will run for twelve months, with the initial run taking place in October 2020.\n\n\nThe Centre Pompidou in Paris is preparing to welcome visitors back to the celebrated Louvre in 2021. Dubbed the Pompidou at the Louvre, the project will introduce a new platform for visitors to explore the collection’s holdings, curated by the renowned architect Jean-Michel Basquiat, and will establish new exhibition spaces for the artist’s works.The exhibition will also reintroduce the famous artefact from the Louvre, the sixty-sixth-century chapel of Saint-Cyrénéma, which was recently restored by the Bibliothèque Nationale in Paris. The chapel, which housed the remains of a Christian monastery, is currently undergoing an overhaul, and Basquiat’s intention is to create a new exhibition space dedicated to the chapel’s collection, which will be organized in a new building on the first floor of the Centre Pompidou.The renovation project, which aims to make the chapel of Saint-Cyrén", "The next Biennial should be held at the University Museum of Art and the Museum of Fine Arts in Milan in November 2021.The second, originally scheduled for February 2022, will now be staged at the National Museum of Art in Athens in November 2022. The museum will also hold a second edition of the biennial, the Future of Art, in March 2022. The program will include the exhibition of work by a selection of the artist’s children. The third and final edition, which was originally scheduled for March 2022 and was moved to February 2019, will be staged in September 2019. The exhibition will also be relocated, with the exception of the venue, from the capital to the islands of the North Sea. The exhibition will now be organized as a three-day event, with a fourth edition, to be held in October 2020, with the opening ceremony, on September 8, 2020. The final event will take place in October 2022. \n\n\nAustrian artist Klaus B. Hollein has been selected to represent Austria at the Fifty-Ninth Venice Biennale—the first artist to receive the honor for his or her “On the Roof of a Building,” in June 2019. Bischof Kunsthalle Vienna", "The next Biennial should be held in December 2020.  If the programme cannot be accelerated, it will be canceled. In a letter dated March 25, the museum’s artistic director, Christine Anagnos, said: “I understand the challenges of this period. However, I hope that the next Biennial will be one of the last in which we share with the public the feeling of pride and satisfaction for our artistic achievements.” The museum has also announced that it will not reopen for another two years. “The challenges we are currently facing require a strong sense of purpose and vision from the future of the museum, as well as the institution’s capacity to adapt to changing circumstances and to change the world in ways that are meaningful for the future of the museum and the city of Miami Beach,” said architect Alfredo Alves, president of the museum’s board of trustees.The second Biennial will be staged in 2021 and will draw from the same collection of art as the first, but will be organized in a different city, will be in a different geographic location, and will be launched online. The Biennial of Contemporary Art, curated by Richard Mayhew, will take place in the", "The next Biennial should be held in the autumn of 2021, the first in the spring of 2022, and will be held at a location to be determined. The twenty-third and twenty-fourth Biennials will be held at the German city of Dortmund, and the twenty-third and twenty-fourth will feature the work of Damien Chazelle and Christoph Waltz.Dortmund has appointed Marcia Breuer as its new city manager. She will take the helm from his predecessor, Ulla and Rainer Klausner, and will begin in her role in January 2022.“Our city is undergoing an extraordinary renaissance,” Breuer said in a statement. “I am really excited to be a part of it, and to continue to build on the city’s cultural heritage through programming that celebrates diversity and inclusion. I am also eager to collaborate with the city’s artists, architects, curators, developers, and residents to change the landscape of our city for the better.”Breuer was chosen from a shortlist of three artists who were nominated by city residents. She will be officially nominated for the post in January.\n\n\nThe National Gallery London (NGA) in London is seeking a new chief executive", "The next Biennial should be held in 2020, but the decision to postpone it is not without precedent. Nauschka, who was born in Berlin in 1938, said: “Semantic freedom, the right of the individual to express artistic ideas and be heard, was a cornerstone of the Biennale’s history. Now is the time to recommit to this legacy and to expand upon it.”The museum will stage the first exhibition dedicated to the artist’s work, “Nirvana” next spring, with an exhibition of artworks by twenty-four other artists in 2020. The biennial’s artist-in-residence program, curated by Martin Wechsler in collaboration with Simone de Salle in 2012, was the first exhibition organized by a woman in the history of the Biennale.\n\n\nThe author and curator of exhibitions such as “The City and the City’s Past: From Maria Antonioni to Mario Marti” (2017) and “Exhibitions of the American Subaltern: from the Women’s Movement to the New Left” (2009) and “Exhibitions in Focus: from", "The next Biennial should be held in 2022, and the first in 2020.For the first time, the Biennials have been invited to collaborate with the artists who staged the previous editions in the city of Paris. While the Paris Art Biennials are not going to participate in the upcoming edition, they wrote on Facebook that they are ready to collaborate. The festival will be hosted in the Grand Palais, the city’s cultural center, and the Parc de Triomphe in downtown Paris, and will take place in the spring of 2021.\n\n\nAs New York City heads into phase two of its reopening plan, Governor Andrew Cuomo announced on Tuesday that the state will likely reopen in approximately six weeks. While the exact date has yet to be set, Cuomo said that the reopening will not impact the city’s already-running reopening campaign, which will last through February and will feature newscasts, art installations, performances, concerts, and more.In a statement, Cuomo said: “As we head into phase two, New York City’s economy is growing, creating new opportunities for job creation and investment, and supporting the city’s vital arts and cultural institutions. So I am not worried", "The next Biennial should take place in 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that Anna-Sophie Tung will represent China at the upcoming edition of the Shanghai Design Biennial. Tung is the first Chinese artist to represent China at the exhibition, which will run from March 13 to March 16, 2020. The exhibition, titled “Art of the Future,” will focus on themes such as the future of the body, the environment, and the environment’s role in shaping art, and will be staged at the Huangpu Arts District, the Third Avenue Art District, and the Shanghai Museum of Art.The museum also unveiled a new mural by the artist Ma Yansong, titled “China’s Future,” which will hang in the museum’s entrance. “The painting depicts a future where Chinese artists are recognized internationally and where Chinese art is celebrated by a global community,” said MoMA director Marc Glimcher. Ma was chosen for the work based on his extensive experience as a curator and as a scholar of Chinese art.\n\n\nThe Los Angeles County Museum of Art (LACMA), which is struggling to rebuild its", "The next Biennial should have been held in May, but the organizers were forced to postpone it after the death of the artist, who was eighty-two years old.According to the artist’s daughter, Mandy, the postponement was made in order to “keep the project alive and to make it more accessible to the public.” This year’s exhibition, titled “The Naked Circle,” was to take place in the artist’s hometown of Miami Beach, Florida. The exhibition would have featured fifty photographs by the American ethnographer Stanley Carver, who lived and worked in Miami Beach, as well as two works by the artist’s son, Jack, the late head of the American ethnographic branch of the Society of American Archivists.The exhibition was to have featured photographs of thirty-five contemporary artists and their works as well as works by some of the artists’ most important collaborators. Included were Garry Winograd, William Eggleston, Carol Bell, Amis du Sautoy, Carolyn Kennedy, David Jacobson, Lillian Yeo, and Robert Irwin. The Los Angeles–born, New York–based artist Lukas Faurschou had been included in the", "The next Biennial should be held in 2021, and the timeline for the event should be pushed back further to 2024. The new exhibition should be called “The Future is Present: From the Artist’s Point of View” and should incorporate the work of over 150 artists and their families. The biennial will also be centered around themes of memory, the body, and the environment.“We have been working for a number of years now to create an exhibition that reflects the spirit and history of the gallery and the city of Milan, but one that is also relevant and relevant to the contemporary contemporary moment,” Milan-based curator Stefano Cattelan told the Art Newspaper. “In order to create this new exhibition, we are making a number of changes that are in line with the contemporary needs of the contemporary art world. We are rethinking the exhibition and the program, and we are inventing new experiences for our visitors.” The Milan-based nonprofit Milan Contemporary Art (MCA) has launched a new initiative that will allow artists and collectors from around the world to collaborate and exchange works. Called “The Future is Present,” the project will allow collectors the ability to present works in the future via a", "The next Biennial should take place in 2020.\n\n\nNearly six hundred artists and small-scale businesses are planning to boycott New York City over its treatment of Palestine refugees, now that the city’s Board of Education has approved a resolution declaring solidarity with the Boycott Divestment Sanctions (BDS) movement, which aims to discourage Jewish settlement in the occupied West Bank.Organizers of the May Day demonstrations, which are being held in more than seventy cities across the US, argued that the city’s Department of Cultural Affairs has failed to address the “degrading legacy of the state of Israel’s occupation of Palestine” and has instead been promoting 'anti-Israel, anti-Semitic, and anti-Semitic-inspired' initiatives. In a statement, the DCLA called the city’s move to pass the resolution “a serious blow to our shared values, a serious blow to the city’s mission to be a champion for diversity and inclusion.”The demonstration comes after New York Governor Andrew Cuomo signed a bill on May 1 that will remove over two hundred monuments commemorating colonialists and slavery-exponents. “We cannot, under any circumstances, honor and celebrate those who have engaged in", "The next Biennial should be held in 2020. The exhibition will be organized as follows: The Dantean Gallery, Washington, DC; William Morris Museum of Art, New York; City Museum of Art, New York; College Museum of Art, Ohio; Hannah M. Galloway Museum of Art, Cleveland; and Art Institute of Chicago. The festival will also involve a series of lectures, other programming and a short film. “Not only will the event help us to understand our place in the cosmos, the exhibition will draw attention to our own mortality and the existential predicament that is our place in the universe,” said Rachel Weisz, the program director. The 2019 festival also saw the return of Spacewave, an annual, art-based event that was held at the Museum of Modern Art in New York from January 15 to January 16. Weisz said the initiative was inspired by the B-52s in a film made by the late David Cronenberg and the theme of the 2019 event was “The End of Man. . . . The end of hierarchy and the destruction of culture.” In the film, Cronenberg plays a man whose life", "The next Biennial should take place in September 2020. The new exhibition will be titled “The Secular Vision: From Modernism to Witches” and will be held at the Museum of Fine Arts, Boston.\n\n\nThe National Museum of Fine Arts (MFA) in Washington, DC, is planning to delay the opening of the exhibition “Weird Al’s’s Big Night,” scheduled to open in March 2021, by one year. The show will be relocated to the National Gallery of Art, where it will resume in March 2022, and will feature an original selection of works by forty artists, including Elia Barozzi, Fredy Campbell, Isaac Chaudhari, Adeline Lutz, Tita Logan, and Tina Kay Hulbert.The announcement coincided with a move of the Whitney Museum of American Art—which recently closed its doors because of financial troubles—from its current location in the District to its new home in the nation’s capital. The move was made amid the ongoing debate over the role of museums in American society. A spokesperson for the National Gallery of Art said that the institution was “committed to working with our local community to find a way", "The next Biennial should be held in 2020. The festival has already received some support from Governor Jay Nixon, who has pledged $10 million for the project, and is collaborating with the US Department of Agriculture and the Rockefeller Brothers Fund in an effort to raise funds. In another statement, Governor Nixon said: “Today, in recognition of the great significance of this biennial to our nation, we are releasing $10 million to help make this event possible. This is a moment of historic significance for the state of New York, and I look forward to working with you and the Mayor and the state’s congressional delegation to produce an inspiring, immersive, and inclusive event for the entire city of New York.” The 2020 event, which is being organized by the New York City–based nonprofit, the New Museum, will be hosted by the El Museo del Barrio in West New York, and will also be held at the New Museum, which is in the process of relocating to a new location in Manhattan. The institution previously presented its inaugural exhibition, “Culture in Disguise: Contemporary Art from the World’s Largest City,” in March 2020, and the second edition", "The next Biennial should be held in November 2020. “The Biennial Revolution: Artists, Politics, and the Role of Media in the Twenty-first Century” will be hosted at the Anais Biennale for the Arts (ABTA) in Barcelona from September 25 to September 29. The twentieth edition of the event will take place in March 2021. “Avant-garde practice and auteurism are often a vehicle for political action,” said Nino Rochat, the president of the Anais Biennale, in a statement. “ABTA’s partnership with the Arts Club of Barcelona, in collaboration with the Catalan government, enables us to build a new platform for organizing and programming. We are convinced that this partnership will be of great benefit to the political and cultural sector in the South-East and for the greater Barcelona region.”Rochat added: “This will enable us to create a platform, a platform of artists, for dialogue and reflection, not just through exhibitions, but also through the production of artworks and performances.”\n\n\nThe Museum of Modern Art (MoMA) in New York has announced its plans to close its doors for a period of thirty", "The next Biennial should be a celebration of the tenacity and resilience of the Biennials, which began as a movement that sought to replace the traditional model of the arts through the cultivation of art and the creation of new works, and has since grown into a platform for activists, artists, journalists, and writers to share their work.”The 2017 event, “Welcome to the Biennials,” featured work by seventy-two artists and was organized by a team led by director and CEO Rineke Dijkstra. The lineup for the 2019 event includes work by forty-three artists.\n\n\nThe Whitney Museum of American Art in New York has commissioned artist Rémi de Sousa’s latest work, The Cacophony of Light, a series of pictures that begin with a band of young people in 1930s New Orleans and grow into a sprawling landscape of neon, neon lights, and neon signs, the largest work the artist has made to date.“Our major goal is to get the work to the public as soon as possible,” said museum director Gerry B. Davis in a statement. “The series ‘Light’s of a Nation’ will allow us to do that", "The next Biennial should take place in 2021. \n\n\nThe Albuquerque Museum of Art (AMANZ) has named Sara Erickson as the twenty-sixth director of its gallery. Erickson comes to the institution from the Metropolitan Museum of Art (MM), where she currently serves as the director of the Contemporary Arts Museum.“I’m incredibly excited to welcome her to AMANZ,” said Mark C. Minter, director of the Metropolitan Museum of Art. “She has a proven track record of transforming collections and moving art through innovative ways that will serve the AMANZ gallery and our community well for many years to come. Sara’s vision and commitment is unparalleled and we’re confident she will help AMANZ position itself well for the future.”Previously, Erickson worked at the Museum of Modern Art, where she helped turn the Met’s Metropolitan Museum of Art into the Museum of Contemporary Art, and ran the gallery with her daughter and her husband, Paul and John Minter. Under her guidance, AMANZ became a cultural and community hub for the Southwest region. \n\n\nPace Gallery in New York has announced that it has entered an agreement with the Maryland Department of Agriculture", "The next Biennial should be the last: it will take place in 2022.\n\nIngrid Knaver, who has served as deputy director of the Museum d’Arles since 2005, and whose curatorial practice encompasses exhibitions of work by over twenty artists, including Vincent van Gogh, Pierre-Auguste Renoir, and Edvard Munch, announced today that the 79th edition of the Art of the Party, which was held in the city of Arles, France, in March 2018, will be held in 2021.The fourteenth edition, which will take place in the capital of Arles, will be a showcase of work by artists from Azerbaijan, Kazakhstan, and Kyrgyzstan. The show will be organized as follows: “From the streets of Paris, where the brand new Art of the Party will open this fall in the city of Arles, come to the Art of the Party 2020, a curated collection of contemporary art from the lands of southern Europe, especially Poland and Lithuania. The program will be organized in a way that enables us to show the power of art and the influence of art in modern life.”Knaver and her team will create a new exhibition for the 2019 edition, entitled “", "The next Biennial should include programming that reflects the greater San Francisco Bay Area, including a music, art, and design exhibition that recalls the City Gallery of San Francisco, the Museum of Contemporary Art, San Francisco, and the Museum of Modern Art. The 2019 event will take place at the San Francisco Museum of Modern Art (SFMoMA), and the 2020 edition will be hosted by the California Institute of Technology (Caltech).\n\n\nThe San Francisco Museum of Art (SFMoMA) has announced that it is preparing to reopen to the public in December 2020 following a major $100 million expansion. The museum will begin by redesigning the grounds and by installing new galleries, classrooms, and other spaces that will offer more educational programming, including a new sculpture garden, a public plaza, and an outdoor plaza.According to the San Francisco Chronicle, the overhaul of the museum’s entrance and lobby will include the installation of seventy new works by forty-seven artists, including Richard Diebenkorn, Urs Fischer, Ed Moses, and Alex Katz, as well as the historic facade of the building, which is currently covered in ivy and moss. The renovation project will also involve the creation of two new underground galleries, one for art and the other for commercial", "The next Biennial should take place in June 2021, and the 2020 edition will be held in June 2022. The fifty-fifth and fiftieth editions will be held in May and November 2021 respectively. Nina Iarocci, director of the Museo de Arte Moderno in Milan and the Art Museum Sola in Venice, told the Art Newspaper that she had not yet decided on the design of the twenty-first edition. \n\n\nThe museum’s collection of over four thousand works by contemporary artists has been renamed in honor of the centenary of the Italian architect Giacomo Savar. The institution’s newly elected president, Gabriele Cirillo, announced the change in a statement on Tuesday, and said that the decision was made after consultations with members of the Savoy Art Museum’s board, including Leonardo; Piero Cattelan, the director of the Museo del Barrio and the Coppi Museum; and SebastiAnsolabe, the president of the Savoy.“This is a great day for Giacomo Savar, for Italy and the country, and for Italy’s art world,” said Cattelan. “Giacomo", "The next Biennial should take place in 2020, with the idea of the exhibition being to promote the three themes of the biennial: the growing influence of the artist-directed in the arts and the representation of African art in the arts. The event will have a five-year timeline, with the theme of 'The Solitary State: Art and the Void in Contemporary Life', curated by Geraldine Albright.\n\n\nThe Tate’s board of directors has appointed four new trustees, including two men and two women, but on Sunday only one woman, Anita Astor, was selected to serve on the board. Although Astor is a trustee of the Tate since 2013, she has been the chair of the board since 1990 and has served in that role since 2009.“Innovative thinking and innovation is the hallmark of the Tate, and we are pleased that Anita will continue to play an important role in galvanizing the public and driving the Tate’s creative agenda,” the museum said in a statement. The new members are Rebecca Allan, Bibi Arraf, Tom Bradley, Rosalind Russell-Young, and Mark Serwotka. Earlier this month, the board voted to approve the transfer of the", "The next Biennial should be launched in the summer of 2021 and should culminate with the artist receiving a lifetime achievement award. The first presentation of the Biennial will be held in the fall of 2021.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Catherine Murphy as its next director. Murphy arrives at the institution from the Metropolitan Museum of Art, where she has served as deputy director for the past two years. During her tenure at the Met, she has organized over eighty exhibitions, including “The Power of the L,” the show ‘The Questions of Life’ and ‘The Future of Art,” and “The Conversation With Betty Parsons,” all of which premiered at the gallery in April 2018.“A passionate educator, an enthusiastic curator, and a tireless advocate for artists, Catherine brings to the National Gallery of Art a wealth of experience that will help us shape and develop the museum’s collections and programs,” said director Christopher Trotman. “We are thrilled to welcome her to the gallery and to recognize her exemplary supporting role in bringing the National Gallery of Art to where it is today as a museum of contemporary art. Her leadership and curating skills will be instrumental", "The next Biennial should be organised as follows:\n\n* November 1st–November 4th, 2019 Themes: The Creative Life and Death of Pablo. The exhibition will be inaugurated by a presentation of an exhibition of works by the artist’s grandson, Pablo Picasso, and will consist of a separate collection than will be curated by the artist. The collection, which will be housed in a new exhibition space in the museum, will be inaugurated with a presentation of a new group of works by the artist’s grandson, Pablo Picasso, and will be organized in such a way that, for the first time, the collection will have a designated exhibition space within the museum. The artwork in question is Pablo Picasso: The Last Man.\n\n\nThe Charles and Lucille King Family Foundation in New York has awarded $3.5 million in grants to eighty-nine arts and cultural organizations in the city through its Endeavor to Arts programs, which are designed to support small, mid-size, and moderate-sized local arts that are at risk of being excluded from next year’s 2020 Grant Exhibition. The funds will help fund programs that provide direct support to artists and nonprofits in the city, such", "The next Biennial should focus on the intersections between art, politics, and the body, and should include an exploration of the role of the body in the social, cultural, and political life of modern, contemporary, and contemporary-art. The exhibition should also consider the relation between the body and art.”In a 2016 Artforum interview with Cynthia Keeler, the first woman to head the Biennial, she advocated that the show be divided into two—one for art and the other for the boundaries between art and politics. “Art and politics are already at the heart of the Biennial, and will remain so in the new exhibition,” she said. “Art is politics, and art is politics at the body politic level.” The 2018 Biennial, “The Politics of Paintings,” showcased work by seventy-two artists and featured work by twenty-four artists as well as pieces by thirty-two artists in all. The excavation of the body, especially its physical, mental, and spiritual states, is a theme in the exhibition.\n\n\nThe Kennedy Center in New York has appointed William A. Rubell as its inaugural director. Rubell will assume his post on September 1. Rubell comes to", "The next Biennial should begin in September, with a goal of raising $100,000.  The museum, which has been forced to postpone three other years, still hopes to secure $100,000 this year.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has announced that it will cease operations at the former Beaux-Arts building in Chinatown on August 31. Due to a power outage, the cultural district, which supports more than 1,500 arts and cultural organizations in Southern California, was forced to shut down in May, and the arts and culture sector has been a source of contention for many in the city.According to Artnet, the closure has caused a financial loss of $8.5 million for MoCA and has forced a restructuring of operations for the museum. The restructuring plan was made in order to make room for the rehabilitation of the Beaux-Arts building, which was completed in 1962 and serves as an arts and culture destination on Wilshire Boulevard. The museum hopes to reopen in November.The restructuring plan was made to reduce the museum’s exposure to the financial fallout of the Covid-19 crisis, which has forced it to move the 2020 edition of the California Art Museum (CAAM) from", "The next Biennial should be in 2021.\n\n\nThe Arts Council New Zealand (ACNZ) has announced that it is planning to open an eight-hundred and twenty-sixth iteration of the Auckland Biennial in 2021. It also plans to launch a new digital platform, the Auckland Book Festival, which will be hosted at Canterbury Arts Centre, in 2020.Blair Harpending, the director of the Auckland Art Gallery, said: “We are excited to launch the new platform and showcase the work of thousands of artists from New Zealand. We hope that the new platform will allow the community to connect with and experience the work of the best and most innovative artists from around the world.” The biennial will run from March 15 to March 20, 2021. “The new biennial will be a celebration of the avant-garde artists of New Zealand, whose work explores the boundaries between art and popular culture,” Harpending said. “In recognition of the importance of art to our cultural fabric, we will be creating a new $50,000 'Art Prize' each year, which will be awarded to an artist who demonstrates the highest level of excellence to our curators, our audience and the wider community", "The next Biennial should begin immediately and be open to the public. Its inaugural exhibition, “Jesus of Nazareth: Avant-Garde Painting in the Age of Jögen Phleger,” will showcase the work of thirty-four artists, including Margot and Wilhelm Reiter, Claudia Barshad, and Arne Barozzi. The exhibition will also feature a reconstruction of the museum’s former collection, an exhibition dedicated to the artist Galería Ortega, and a selection of works from the exhibition, “Galería Ortega: From One Life to Many Lives.”The Biennial will be held at the Museo de Arte Contemporáneo in Madrid. The twenty-fifth edition of the exhibition will be hosted by Sergio Arrupe y Cajal, the director of the Museo de Arte Contemporáneo, in Lisbon. The twenty-sixth edition of the exhibition will be held by Galería Ortega y Cajal in Madrid. The twenty-seventh edition of the exhibition will be held by Íñigo Roca Gallery in New York.\n\n\nThe Museum of Contemporary Art (MoCA) in Los", "The next Biennial should aim to introduce the public to the ancient city of Tanay, which was the center of the second century AD Muslim Emirate of Abu Dhabi; and to highlight the plight of the Rohingya, a Muslim-majority population in Myanmar, and its plight in Southeast Asia.\n\n\nThe Turner Prize has announced its nominees for the 2019 biennial. The twenty-five-person jury comprised of art historian David Taylor, curator Robin Buckland, and artist Eiko Oto, who were nominated for their exhibition “Living Stories: Stories of Illustration” at the site of Turner Contemporary, in London, was made up of Maggie DeSousa, art historian and curator of contemporary art; Zoya Iqbal; and Andy Tan, the director of the KPS Lavender Farm in West London. The award was first presented by KPS in 2020.“Living Stories: Stories of Illustration” (2019) involves artists performing live narrative artworks, as well as reconstructions of ancient African and Roman artworks in order to demonstrate the influence of the artist-in-exile on the development of the Painted World. The exhibition was curated by KPS curator Rebecca Lobo.The fifty-six-person jury was", "The next Biennial should be on the history of photography and photography in general, and on the exhibition of works by Harvey Davis, Philip Glass, and Jean-Michel Basquiat. “We are excited to present a selection of works by these and other world-class artists in the upcoming exhibition,” said Jenny Albrecht, artistic director of the exhibition. The artists represented in the exhibition were chosen from a group of artists who have presented work in the Biennial since 2001, and the artists are represented by the Biennial.\n\n\nThe United Kingdom is planning to cut more than two hundred arts and cultural jobs as part of a wider austerity drive that will push back against the country’s billionaire cultural sector donors and reduce funding to arts and cultural institutions by an average of $12 billion over the next two years. According to The Guardian, the arts are being considered as a prime example of how cultural institutions can be effectively attacked in order to curb the spread of cancer.According to the Times, some fifty arts professionals are urging the government to divert funds away from arts subsidies and toward arts education and training—a move that would likely increase the arts’ budget—and toward arts and cultural institutions. Twenty-four thousand people have", "The next Biennial should take place in 2020, although a date has yet to be announced.  The first iteration of the show was held in Helsinki from March 19 to March 23, 2020. The 2020 edition will be held at the National Museum of Women in Culture, Helsinki, from March 24 to March 28.  The biennial exhibition will feature the work of the likes of Johanna Kotkänen, Mika Linn, Tamara Lidén, Marika Malmi, Taggarta Sallu, Lille Nielsen, Antti Niemi, Lisa Salmela, and Laura Owens. For Marie Claire, the festival will focus on themes of feminism, disability, and gender, with a particular focus on the exhibition of live performance. The upcoming exhibition, which will be housed in Helsinki’s Musuema Museum, will present the work of Eeli Renée, Nina Rowland, and Jemima Newton.\n\n\nThe world’s leading arts and culture organization, the International Council of Museums (ICOM), has issued a statement regarding the September 11 terrorist attacks in London. The council’s director, Catherine Blundell, said that the events of", "The next Biennial should open in 2020, with a new project by the artist-run collective, the Ministry of Culture. For the past five years, she has published the artist-designed works of contemporary and industrial artists in a series of exhibitions drawn from a wide range of sources: works by Adrien Brody, Ermanno Parodi, Barry LeVa, and Heshko Ulrichson.\n\n\nAn artist-designed landscape in the French city of Lyon, designed by Polish architect Leonor Halberstadt, will soon be unveiled in the French capital. The 8,500-square-foot installation, which will sit in the city’s Place Vendôme, is part of a larger project by the artist to build a public space in the heart of the city. The work, titled Liebe and tombe, and is part of a series called La Vitra, which celebrates the work of art that has been created by women, including Nina Chanel, and was held in the city’s Place Vendôme for twenty-five years. The tribute to Halberstadt, who died in 2013, was made in honor of the city’s women, who comprise twenty-six percent", "The next Biennial should be held sometime between January and October 2020. For more information about the work of artists in the exhibition, visit the Artists’ Workshop website. \n\nThe Architectural Association (A.A.) has added three new members to its board of trustees: sculptor and designer Yinka Shonibare, whose elegant, detailed work is often characterized by its paradoxical and engaging blending of traditional and modern methods; Joan Brown, a pioneer of the American sculptural practice whose sculptural works are often linked to her own personal narrative; and David H. Koch, a billionaire oil magnate and the chairman and CEO of Koch Industries.In addition to having a direct line to Koch, the A.A. also has direct financial relationships with the oil and gas companies that are involved in the controversial Dakota Access pipeline, the Keystone XL, and the Dakota Access Pipeline, as well as major oil refiners. Since joining the A.A. can net you $100,000 in prizes, the association also receives funding from oil companies, foundations, and corporations. In the past, the $100,000 prizes have gone to artists such as Jean Antoine Groupe, Jean-Michel Basquiat, and Ed Moses.", "The next Biennial should be held in 2021, when the exhibition will be in its eighty-sixth year. “Art is not dead, but it is not what it was,” Art historian Winston Churchill declared. The 2018 edition of the Rome Biennale, staged by curator-supervisor Pierluigi Battista, was canceled due to the Covid-19 pandemic. While the exhibition was postponed, the museum mounted the first leg of its triennial “Art and Destruction” series, “Construction and Destruction” (2019), which explored the history of the twentieth-century’s largest work of art, the Chettri Atlas, a monumental twenty-four-foot-by-eight-foot underground structure constructed in the Tula Mountains of central Russia in the late 1960s. The exhibition was rescheduled for 2021 and reopening was slated for 2021.Battista’s art was chosen by an international jury comprising John Borthwick, director of the Centre Pompidou in Paris; Mirko Božíč, curator of the modern art museum in Brno; and Franck Riester, director of the Guggenheim Museum in New York. The", "The next Biennial should take place in a city on the Nile, Hurriya, in December 2021, with the help of the Egyptian Culture Ministry, the Museum of Islamic Art, and the National Museum of Egypt.\n\n\nNew York City’s Metropolitan Museum of Art (MoCA) has launched a new fundraising initiative in support of artistic and cultural workers who are struggling due to the coronavirus pandemic. The initiative, which allows Met museum patrons to bring $10 from their wallets to the museum in exchange for a virtual experience, will also give $5 to the designated charities of their choice.“We are thrilled that our patrons are able to make a meaningful financial donation to the Met,” said David A. Fahmy, chair of the board of trustees of the Metropolitan Museum of Art and the Metropolitan Museum of Art Mellon Trust. “This initiative will allow us to provide immediate relief to struggling artists and small arts institutions across the city, while we anticipate the impact of the coronavirus on our cultural and financial support of artists and the Met.”The organization has partnered with ArtistsUnited, an organization that helps support artists and small businesses in New York City, to create The Artist Foundation, a platform that gives the public a", "The next Biennial should take place in 2021.<|endoftext|>The United States and the European Union are agreeing to fully phase out fossil fuels by 2050 as part of the Paris Agreement, but that doesn't mean the fossil fuel industry is going quietly. Instead, it is ramping up lobbying efforts in Congress to keep the lights on.Since the year 2000, the fossil fuel industry and conservative lawmakers in the United States have been working together to pass more than two dozen pieces of legislation, including a massive $2 trillion stimulus package in 2009; landmark climate bills in the United States and Europe; and hundreds of bills that would allow for the expansion of fossil fuel production and infrastructure.Senator James Inhofe, chair of the US Senate Committee on Environment and Public Works, said: “We are actively trying to prevent the irreversible damage that climate change is doing to our climate system and we are actively trying to slow the catastrophic rise in carbon dioxide that is causing climate change. . . . The Paris Agreement is a serious step in that process.”Inhofe also noted that the Paris Agreement does not address the urgent crisis caused by climate change, and that the US has the fifth largest economy in the world but the seventh largest carbon footprint, behind China, India, and the European", "The next Biennial should be held in 2022, and its event will be the first of its kind in the UK. The exhibition, titled Ascension, will feature works by up-and-coming and established artists, including Tamara Abraham, Mona Hatoum, and Waseem Akram, as well as works by Lonnie Roon, Ryan Kilcreary, Carolyn Richer, and Diana Taurisi. The new exhibition will also feature a selection of works by contemporary artists that are currently understudied or selected for their first Biennial. The exhibition will be held in the Museum of Contemporary Art London from September 3 – September 8, 2022.The new event, titled The Renaissance Biennial, will be held at the Museums National Arts University (MoCA) in London from November 28 – December 1, 2022. The event will also be hosted at the Nationalgarten Museum Berlin from November 27 – November 29, 2022. The exhibition will be followed by the Baerischer Kunstverein Stuttgart from December 3 – December 6, 2022. The new format will introduce a new element of experimentation with time, an element of re-creation,", "The next Biennial should be held at the gallery later this year and will be one year to the date in 2021. The biennial will be staged in a combination of photography and sculpture, with the first exhibition being “The Biological Messengers: Mourning the Body and the Soul” in 2018, the second being “The Image of a Body: Avant-Garde and Human Reproduction” in 2017, and the third being “Avant-Garde: The Body and the Soul” in 2017. One hundred works will be selected by the artist-in-residence, Olivier de la Brioche, to represent the Biennial. The artist-in-residence will decide on the selections by December 7.The works in the exhibition will be inspired by themes such as mourning and remembrance, mourning and self-abnegation, and mourning and rebirth. This year’s Biennial will take place in the gallery’s new space at 1150 Benjamin Franklin Parkway, between West New York and Downtown Manhattan, from January 5 to January 9. The inaugural exhibition, “Django’s Body and the Pulps,” will be staged at the museum in January 2021.\n\n\nThe", "The next Biennial should be held in 2021. The institution will be inaugurated at a special exhibition of works by the artist in the spring of 2021, and will remain shuttered for a minimum of twelve months after the festival. The institution has been attempting to restructure its three hundred-year-old, state-of-the-art building, which was completed in 1962 but was not completed until the year 1965. The institution received $6.8 million from the Frieze Prize in 2017.  The art of the year will be presented by the artist Sara Cwynar. The artist will be asked to create a work for the occasion, which will mark the centenary of the 1916 outbreak of the first World War. The issue will be explored in more depth in biennial preview articles in this month's issue of Artforum. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it plans to loosen restrictions on the exhibition and performance of artworks in public spaces in an attempt to encourage more social distancing. The move follows a series of recommendations made by a task force appointed by Mayor Bill de Blasio to address the city’s epidemic of Covid-19-related", "The next Biennial should be held in 2020. Grantees include the following: Artists: Ruba Naidoo, Pia Carvalho, Colombian artist Luis Carlos Ortilão, Brazilian artist Salvador Dalí, Brazilian artist Luis A. Campos, Art and Justice: Analyses, Assessment and New Research by Adrian Almasi, 2017, Druid-Conference: Mili Natal, 2018, Mari Natal, 2018 and Mari Natal, 2018\n\nArtists: Ming Wang and Piao Qu, China and New York, New York, New York, New York, New York, New York, New York, New York, New York, 2019, Team Exhibition: Ming Wang and Piao Qu, China and New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, 2018,", "The next Biennial should be held in 2020. Commenting on the new initiative, the advocacy group said: “The future of art and culture is at stake. The last year has shown us that it is possible to rebuild the future, through experimentation and collaboration, and that we can create new social and economic opportunities. The next Bimbo is the time to take the next step.”\n\n\nThe Ellen DeGeneres Show, which has been canceled since March due to Covid-19, has announced that it will return to the Los Angeles area in April 2020. The announcement follows two months of speculation that the show would be canceled, a move criticized by many artistic figures including Gagosian director Jon S. Baron and the artists who won the 2017 Turner Prize.The program, which was commissioned by the artist, was slated to launch in April but was pushed back to May, when the United States is still reeling from the impact of the coronavirus. The show will also feature two new works by the artist in the spring, and will feature the artist’s first solo exhibition since 2017. The project was originally supposed to run from May 9 to May 13, but was pushed back to April 16, 2020, a decision made after the", "The next Biennial should examine the relationship between photography and art in order to gain a deeper understanding of the relationship between photography and art’s visual and auditory experiences. The next edition of the biennial will take place at the Museum of Modern Art, New York; the Architectural Institute of Chicago; and the Museum of Contemporary Art, Los Angeles. The exhibition will be inaugurated by a solo exhibition of works by the Swiss designer Marco Cammock, which will proceed through March 24. Art historian and curators have condemned the current exhibition, which is titled “Photography in Art,” in part because of the “brutal” manner in which the works in the exhibition are displayed: the designers have removed six works from the exhibition in order to promote images of nude women. They have also objected to a number of the museum’s selections, including paintings by the American Indian artist Bridget Riley (pictured), which was originally scheduled for the exhibition, “Photography in Native America,” and Pablo Picasso’s The Birth of Venus, which is on view until March 25.When asked about his condemnation of the exhibition, Cammock said: “I think that the exhibition is a", "The next Biennial should be held in 2021. Acknowledging the logistical challenges of moving events around the world, the museum is aiming to have the event on a permanent basis in the city in 2022. The status of the exhibit has also been discussed in the context of the ongoing protests in Hong Kong, which have been ongoing for two years. According to the New York Times, Hong Kong’s legislature recently adopted a resolution calling for Hong Kong’s government to hand over control of Hong Kong’s affairs to the mainland.\n\n\nThe Institute of Contemporary Arts (ICA) at the University of Pennsylvania has elected artist and researcher Isamu Noguchi’s successor as director. Noguchi, who comes to the institution from the Institute of Contemporary Art (ICA) in New York, has been in the position for just over a year and has overseen the organization of five exhibitions and the development of a new program.Following a tumultuous tenure at the ICA, where he was forced out of his position over his opposition to a proposal for a campus-wide memorial for fallen soldiers, Noguchi announced in March 2019 that he would resign in March 2020 to pursue new creative projects. His nomination was approved by the board of trustees on", "The next Biennial should be held in 2020. They also plan to create two more exhibitions dedicated to the African diaspora each year, and to train more local curators and fellows. \n\nThe Whitney Museum of American Art in New York has announced the ten artists who will appear in the inaugural programme of the Autobiennial. Called The House, The Place, and The Revolution, the biennial will provide a platform and a platform for the work of contemporary artists from the African diaspora. The show will result from a collaboration between the museum and the San Francisco–based nonprofit, the Greater Oakland Art Museum, which is co-sponsoring the exhibition. “We are incredibly excited to continue to work with the artists that have shaped our world and their work on their behalf,” said biennial curator Alexis Harris. “This is an opportunity to showcase their work to an audience that has yet to experience it.”The exhibition will be curated by artist-in-residence and Bay Area native Kader Attia, who has been a Curator at the Whitney for three years and currently serves as the curator of photography at the Richmond Art Museum. The biennial will run concurrently with the upcoming", "The next Biennial should be held in 2021. The deadline to apply for a slot is April 9. \n The California Museum of California (CalArts) is currently accepting nominations for its 2020 edition, which will take place at the Los Angeles County Museum of Art (LACMA) from February 22 to February 23. The biennial, titled Feminine (New World), and will include the first-person work of Canadian artist María Berrío. It will also be the first of its kind in the United States and will be curated by Los Angeles–based artist Lisa Lanington, and will receive $5 million from the CalArts’s National Endowment for the Arts. The biennial will be hosted by the Los Angeles County Museum of Art (LACMA). The institution will also be hosting a number of other events. The 2020 theme is Wonder, which is a blend of dance and science fiction. The 2020 biennial will take place in conjunction with the 50th anniversary of the formation of the Grammy Award—which was presented by the Grammy Museum and LACMA on April 4. The 2019 Whitney Biennial included works by the Whitney Museum of American Art artists such as", "The next Biennial should be held in 2022.\n\n\nThe five-day exhibition “Unseen: Art and Madness in the Digital Age” will return to the Museen d’Arles in Paris in December 2020. The show, which was inspired by a pilgrimage to the Louvre in 2015, will feature work by eighty artists from twenty-six countries and fifty-eight cities. The seventy-four-hour exhibition will also include a three-month residency program, a new book, and a “Special Exhibition.” The biennial’s inaugural edition in January 2021 will be staged at the Stedelijk Museum in Amsterdam, and the show will return to the city for a second edition at the Louvre in March 2021 (the opening of the exhibition will be June 8–June 10).“This exhibition marks the sixth edition in the history of the SPARKS collection in the city of für den Schädel. The collection will also be presented in the city of für den Schädel II in Berlin, in the city of Fürstenbrück in the Netherlands, in the town of Fürstenbach in Germany, and in the city of Fürstenburg in Germany. We are", "The next Biennial should take place in 2020. \n\n\nKristen Mead, the director of the Museum of Contemporary Art (MoCA), Los Angeles, has announced that she plans to resign in March 2020 to pursue new creative projects. In a letter to the public, she wrote: “I am honored to have served as director of the MoCA Museum of Contemporary Art for seven years and to have grown the museum’s collection to include some of the most important and exciting art of the last half century. But my own departure from the museum is not coming in the fall.”The biennial will feature work by twenty-six artists featured in its special retrospective, “The Awakening,” which will open on September 29. The museum will be closed until December 24. The twenty-second biennial, “Sydney at Noon,” will open in February 2021 and will run until February 26.“I regret to leave the Museum of Contemporary Art in Los Angeles,” Mead said. “With great affection,” she added. “As director, I have been guided and guided to new ideas, and the collections I have built over the past decade. I have had the opportunity to work with", "The next Biennial should be “Latinx,” which will be curated by Cynthia Olmedo, an American photographer based in Mexico City. During the 2017 edition of the exhibition, which was curated by Amy Horowitz, the Latino art community was represented by curators such as Gisèle Maier, Alianza Pilar, and Andrea Hernández. \n\n\nThe Museum of Contemporary Art (MoCA), New York, announced today that it has received a gift from philanthropist and former hedge-fund executive Tom Golisano and his wife, Angela. The giver, a bronze sculpture named after Golisano, was gifted to the institution by artist and philanthropist Nancy Steinhart. The sculpture was created as part of the exhibition “Tom Golisano: Once Upon a Time” (2016), and was created in memory of Golisano’s late brother, Tom Golisano III, and his late wife, Angela. “Once Upon a Time: Contemporary Art in a Time of Crisis” is currently on display in the museum’s permanent collection gallery. The sculpture is the work of artist and philanthropist Nancy Steinhart, who directed an exhibition in the museum", "The next Biennial should be held in 2021, the year of the twenty-sixth. The next edition will consist of three parts: An offer to open a museum of the contemporary art in the town of Biartiga, in the municipality of Maricá, which is located on the shore of Lake Tito; a selection of works by artists from the region; and a presentation of the national collection in collaboration with a collection of contemporary art from the city of Porto Alegre, which is located on the border of Brazil and Portugal. The project will also include the construction of a 150,000-square-foot exhibition dedicated to the work of the same name and the launch of the Biartiga Museum of Contemporary Art, which will be housed in a former textile factory in the city of Maricá. The work of the special exhibition of the Biartiga Museum will be presented by the artist Zoya de Araujo, who will serve as the special guest of the project. The museum will also host a selection of works by Gisèle Bénédi, Samba da Silva, and other notable Brazilians.Curator Sophia Bruguera, who has worked in the United States for", "The next Biennial should be held at a location that has a climate controlled by nature and is located in a prime location that is also used by nature. The theme should also reflect the cultural and urban experiences of the city in which it will be staged. In addition, the biennial should embody the life and times of a city in the form of a collection of art and should be a collaboration between art and architecture.”The pavilion will be inaugurated by an exhibition of paintings by the World War II–era artist Douglas Wheeler, now an exhibit curator at the Museum of Modern Art in New York, and will be attended by an audience of thirty-six people, including Bechold, whose work will be included in the biennial’s next edition, 〜Pink City: A Biennial of Art and Architecture in the Ghetto,” in 2022.\n\n\nThe Institute of Contemporary Arts (ICA) in New York has received a gift of more than five hundred rare works by the late Egyptian sculptor Sadek Haddal, who often used his own body to create works that address topics including concepts of beauty, desire, body, and death. The donation includes a bronze sculpture by the artist that was created in the early", "The next Biennial should be held in 2022, and the Metropolitan Museum of Art (the Museum) in New York—which is currently undergoing a $150 million renovation—will organize an exhibition there in 2022.The two institutions have been collaborating on exhibitions for years, with the Metropolitan Museum of Art presenting Deana Lawson’s “The Electric House: Robots, Agent Machines, and the Birth of Computer Graphics,” in 2007, and the Museum of Modern Art (MoMA) presenting “Millions of Plants” in 2009.\n\n\nThe Museum of Modern Art (MoMA) in New York is working toward completing its first major restoration project since it reopened in 2003, and is optimistic it will be completed by March 2020. The $125 million overhaul, which was ordered by the New York State Department of Cultural Affairs after the 2011 earthquake and tsunami, includes the construction of a new roof, interior, and exterior, the restoration of the building’s original wood paneling, and the restoration of the exterior landscape of the Museum.“We are preparing for a long and challenging season ahead as we re-open our new space at 5 East Forty-Seventh Street,” said David Kenny, the director of the Museum of Modern", "The next Biennial should take place at least once a year, and should take place in an environment that reflects the spirit of the city. The city has already released a series of environmental guidelines that address the sustainable use of its resources, and it has pledged to reduce or eliminate fossil fuel use in all of its activities by 2030. The art world is also preparing to launch a new initiative that will draw on the artistic and cultural heritage of the city of Oakland to develop new works for the biennial. “This is an opportunity to build on the success of the Biennial,” said Mural Arts Coordinator Diana Crockett. “We are creating a platform for a wide range of artists to engage with the Oakland community through a curated program that can include several hundred works in a single exhibition space.”\n\n\nThe City of Tokyo announced today that it is planning to open a new museum on the site of the former Nippon Budokan in the August 2020 issue of the Art Newspaper, with plans to open a branch in the capital city of Kobe next month. The announcement follows the start of an exhibition in the city in December 2020 as part of the newly revitalized Koto Museum of Art. The new institution will", "The next Biennial should be held later this year, and the last will be held in 2021.   The biennial will take place in the nearby town of Olkhon in the Russian Republic of Bashkina, and will include a keynote address by author and scholar N. Karelov; a review of a new book by Yevgeny Nikolsky, which will examine the legacy of the Soviet biennial; and a performance by the contemporary artist Ludmila Kudin.Since the 2011–12 season of the biennial, the institution has staged five editions, which have drawn a total of 551 entries. The first, held in January 2019, featured performances by Alia Aida, Nadezhda Gogia, Nadezhda Ivanova, Kazimir Kraytseva, and Viktor Luger. The second, held in March 2020, featured works by Okhala Anna Kuzma, Tomáš Niskuša, and Anna Maria Polley. In the third, held in February 2021, the biennial featured works by Dmitri Kuzma, Mara Cilento, Nina Kuzma", "The next Biennial should focus on the contemporary relevance of the work of the previous biennial, in 2022, and should include themes that integrate art history and contemporary world affairs. The program, titled “Art in the Age of Resistance,” will be inaugurated by an exhibition of the work of the first Biennial, “Pillars of the Universe,” curated by Mocha Umsdorf. The 2019 event will be held at the Barcelona Museum of Modern Art (BEM) and will feature the work of fourteen artists whose work was selected for inclusion in the exhibition for its “ability to question and re-create the imagery and content of contemporary life.”The exhibition, which was curated by the Barcelona-based artist María Berrada, will open at the BEM on October 3 and run through November 10. Its first section, “Light, Light, Light,” will feature the work of César Navarro, who will present an installation of his works in the museum’s Galleria de Arte Contemporáneo (CAFAM), which is being renovated by architect Santiago Calatayud, and will include the work of former central casting artist Rosario", "The next Biennial should be scheduled for the spring of 2021. “Our collective vision for the exhibition is to create a platform for an exhibition of work by a select group of contemporary artists,” said Maika. “In order to develop a new wave of works by artists that have not previously been exhibited, we will now exhibit works from the collection that have never been presented. We look forward to demonstrating our commitment to contemporary art through a diversity of artists, artists practices, and projects.”Galerie Mernignano, which comprises M.A.S.K., Meredith, Balazs, and Galerie Lelong, recently announced that it will collaborate again on a special exhibition devoted to Yinka Shonibare. The event will be held at the institution’s New York gallery in the spring of 2021. The show will focus on the American artist’s exploration of the relationship between nature and the environment and will take place in the courtyard of the building where the artist resides.The artist had previously staged this exhibition in Paris in 2016. Its 2018 biannual exhibition at the Palais de Tokyo in Paris featured work by Yinka Shonibare, Sculptor Timur Pfeifer,", "The next Biennial should take place in the spring of 2022. Will the museum’s new digs--which have been described as a “living museum”--provide a perfect platform for such a series?\n\n\nThe Story of Art in America has announced the opening of its new digital initiative, Artcorp, which will provide free online-only exhibitions and courses that will engage with recent scholarship, including the exhibition “Art and the Story of America,” which is scheduled to open in New York on October 29, and will feature five new exhibitions each month, beginning in February 2020. The program will be hosted by the New York–based publisher René Magritte, who will curate the first show, which will take place in Paris in April, and will launch in April 2021. The second show, which will be on view in New Delhi in March, will be preceded by an extended virtual tour of the exhibition space. In the third show, which will run in Los Angeles in May, the artist will illustrate the cultural and structural imperatives of the city in order to illustrate how the construction of public art can be a necessary and powerful tool in the fight against climate change. ", "The next Biennial should focus on the history of the exhibition space and its transformation into a new academic and cultural platform, and should strive to increase the intimacy and the diversity of the exhibition audience in order to further its mission of promoting the arts.  The exhibition “Mystery Show,” curated by Ruth Schweizer Kremer between 1931 and 1936, is still on view at the Museum of Modern Art in New York. Inaugurating the twenty-fifth Biennial is “The Body: The Art of Human Sacrifice” (2018), an exploration of the role of art in the history of the sacrifice of Christ. The exhibition will showcase twenty-six works by sixty-four artists, including Joan Miró, Domenico Cottolla, Renata Rossi, and Carla Roden, and will run for forty days.\n\n\nMuseum director Marc Glimcher has dismissed the rumors that the Museum Basel in Singapore would reopen as early as April or May. While he acknowledged that the recent string of setbacks has made the situation more challenging, Glimcher argued that the museum is on track to meet its April 2020 reopening goals. “We have committed to the fans, we have committed to the partners and we", "The next Biennial should be in December 2020. If all goes well, the self-described \"post-factual\" exhibition will feature \"radical new explorations of the concept of history and the future, the collection, and the museum. . . . We are excited to see how the new works will come to life.” The biennial’s inaugural exhibition, “Biennial of the Führer” (2019), opened on January 8 and ran through March 3. Since then, it has been staged in Berlin, Austria, and Vienna, and the fifth edition, “The Führer” (2016)—which was curated by Wolfgang Daniken—was also organized in Vienna.\n\n\nThe recent surge of Covid-19-related hospital admissions in the United States has spurred one of the country’s largest arts organizations to launch a new campaign to raise awareness and support for those recovering from the virus. Arts in the City, a new initiative launched by the New York–based nonprofit the New Balance, launched a campaign on Facebook on May 15, inviting people to share their stories of hospitalization and illness with one another. The eight-week campaign, titled “In Hospital", "The next Biennial should be held in 2020. \n\nThe Taiwan Art Museum (Taikan) has received a $1.5 million donation from Yumenashi and Tomoko Ushio, among others, in support of its 2019–20 yearlong exhibition “Love Yourself” at the museum. The donation was made in recognition of the institution’s commitment to the art of self-love. On the occasion of the museum’s centenary, the Ushio brothers announced a partnership with the German magazine Artforum that will focus on the art of beauty, the body, and how to live a healthy life. The two will collaborate once again on “Love Yourself” with an exhibition named after the theme, where the two artists will collaborate with the museum’s own artist-in-residence, APL-Cadbury, to present a selection of modern and contemporary works in order to raise funds for the exhibition.A selection of modern and contemporary works will be presented in the exhibition, which will run from October 26 to November 3, 2020. The exhibition will also include a virtual reality experience that will allow visitors to experience the works in the virtual space of the museum.", "The next Biennial should be held in the spring of 2021.\n\n\nThe new BIC Centre for Contemporary Art (BICC) in Beijing has appointed Alexandra Li as the new director. Li comes to the institution from the Beijing Municipal Bureau of Culture. She succeeds Jie Zhang, who was appointed as the new head of the Beijing Museum of Fine Arts (BMA), and will take up the post on August 1.Li has worked at the BMA for more than twenty years and has served as its director since 2015. She succeeds Liu Zhen, who led the museum from 2014 to 2015, and will work closely with Wang Jianwen, who will retire from the BMA after twenty-five years at the helm of the institution in December.“Originally from Shanghai, Li has recently been living and working in Beijing, and her passion for art and modernity is reflected in her first book, 'Between Two Worlds: Chinese Art and Modernism in the Eighties,” art historian and BMA curator Jia Pu and art historian Wenwu Jiang wrote in the May/June 2019 issue of Artforum.Li is currently a Ph.D. candidate in art history at the University of Pennsylvania in Philadelphia. She also works as a freelance curator and", "The next Biennial should be in 2021, and the first in 2022. The first edition, “Between the World and Me: Solo Performance” (2019–20), was curated by Petra Guggenheim and performed by two artists, Tatjana Välimä and Amiti de Salvo. Guggenheim said: “I am very excited about the prospect of these events in the United States, of celebrating the artists who continue to shape the field in our own image. With the new biennial, we have the opportunity to build on the themes of the past, to incorporate contemporary aspects of art and culture. The exhibition will be a best-of-class exhibition in the history of art that will engage with the histories and the theories of the first and second editions, and will give the visitors an opportunity to participate in a truly American experience.”\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has announced that it will begin welcoming visitors back to the museum on Wednesday, March 22, 2020. The institution has also announced that it will begin welcoming visitors through the end of the year, and that it will extend the opening on March 29, 2020.“SFMo", "The next Biennial should be held in 2021. “The biennial is about to enter an exciting new phase,” said Hetain Patel, director of the Convention Center. “The central question of the show is: What will be the next iteration of the Art in Motion?”Hannah A. Mumm, chair of Tate’s board of trustees, added: “We are thrilled to be working with the talented and caring team of curators, producers, and writers who have made this exhibition possible. It is a fantastic opportunity for the public to see what they have produced, and our artists to see what they have created. We are looking forward to the exhibition as we embark on our new year with great enthusiasm and optimism. We are also proud to be working with the new trustees for a long-standing patron of exhibition space, the National Galleries of Scotland.”\n\n\nNearly two hundred artists and cultural workers have endorsed a resolution calling for an international inquiry into racial and economic injustice in the United States. The document, which was adopted by the Group of Eight Artists (G8), an international collective of artists and musicians, was organized by an assembly convened by arts workers from twenty-six states and territories in", "The next Biennial should come up in 2022, but the date has yet to be decided.\n\n\nItaly’s Ministry of Culture is planning to demolish a six-thousand-year-old monument to the late dictator Benito Mussolini in Rome in an attempt to improve the city’s air quality. The controversial plan was made in an attempt to erase the presence of the dictator in the capital, which is currently undergoing a major expansion, and has been condemned by scientists.According to the Italian daily newspaper the Corriere della Sera, the Ministry of Environment and Forestry has allocated $16 million to remove thirteen pollution-damaged buildings—including the home of the Mestalla Museum of the Arts and the former home of the Italian People’s Union—from Rome’s Turin Valley in an attempt to decrease the city’s CO2 levels by 20 percent by 2025.The ministry hopes to remove the buildings by creating an area of land in the city of Turin where the air quality problems will be managed remotely. The site has been selected to be the capital’s new regional air quality lab, and will be managed by a private company, Etna, which will provide the buildings with emergency", "The next Biennial should be a celebration of the work of twenty-five artists, including the newly commissioned work of Dina Gass, which will open at the Scandinavian Council in Oslo in January 2020, and mark the fifteenth anniversary of the biennial. The exhibition will also present a new collection of works by artists who are based in the United States. The first show has been organized by the Biennial Foundation in cooperation with the Metropolitan Museum of Art, the Museum of Fine Arts, Boston; the Museum of Modern Art, New York; and the Museum of Modern Art, Boston.  The show will include twenty works by twenty-six artists, including artists who are currently represented by the Biennial Foundation, artists who are coming up for exhibition, and artists whose work is currently on view in the exhibition. The sixth and final show of the series will be held at the Museum of Modern Art, Boston, in July 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in New York announced today that it plans to begin welcoming visitors in April. The announcement coincides with the Museum of Modern Art’s annual Art of the Party, which celebrates the arts and culture of New York with a weekend of performances, screenings, screenings, and other", "The next Biennial should be held in 2022.\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles has received a gift of two works by the late sculptor Jeffrey Gibson. The works, both in their third-person eigth, were donated by his widow, the artist Nan Goldin, in memory of her husband, a MacArthur Fellow and a leading member of the experimental avant-garde.Goldin’s gift comes amid a wave of retirements and relocations of longstanding works, many of which are housed at the MFA, including Homage to the Blue (2017) by artist-activist Cécile B. Evans, the landmark 1966 installation The Hot Zone (2017), and “TNT” (2018), a symbolic tribute to the late sculptor’s late wife, the late architect Frank Gehry.Goldin said: “In the twenty-first century, it’s much easier to move a work than it is to notice a work. When our work is in a museum, it’s preoccupied with its collection, staff, and operations, and when the work is in a private collection, it’s in a community setting. And when", "The next Biennial should take place in 2022. In the meantime, the biennial will continue to be hosted by the National Gallery of Art in Washington, DC, and will be featured in a number of upcoming exhibition halls and concerts. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is working with a local arts organization, the nonprofit Arts for LA, to implement a $10 million fund for grassroots arts and cultural programs that will help alleviate overcrowding at the museum and bolster its public programming.The fund was established to help support the museum’s “Historical Arts and Cultural Experience,” an initiative that launched in 2017 to promote the arts in Southern California. In addition to working with Arts for LA, the institution has set up a special fund for artists whose work was included in the exhibition “The Long Walk,” which opened on October 28, 2019, and will continue to host the work until the end of the 2020 calendar year. “The museum is committed to supporting the museum’s historical arts and cultural programs in Southern California,” said museum director Michael Govan. “We are thrilled that Arts for LA will be able to use this funding to help our artists", "The next Biennial should take the form of an exhibition that explores the history and development of contemporary art. It should consist of a selection of work, with a particular emphasis on work by women artists, written by a single artist, or by a group of artists working collectively. “We are always skeptical about new initiatives that are conceived and implemented by individuals, but this one invites us to consider the possibility that the biennial could be two things: a new institution with a new mission and a new exhibition,” Jack and Shaun Meehan, founders of Biennale San Francisco, told the San Francisco Chronicle. The exhibition will also include the first solo shows of work by artists from the Red Sea region in the United Arab Emirates, the Blue Nile region in Nigeria, and the Horn of Africa, among other African countries. The exhibition will be curated by Domenico Cipolletta, director of the Museo d’Alto Cielo in Rome; Mauro Cipolletta, director of the Museo dell’s Villa Bellini in Rome; and Christopher Wool, assistant curator at the Museum of Modern Art, New York.\n\n\nThe Metropolitan Museum of Art in New York has named Rina", "The next Biennial should be held in the spring of 2021, by the end of the year.  As of this week, the International Society of Art Historians has issued a statement expressing its solidarity with the committee, which comprises American artist  John Akomfrah, the former director of the Metropolitan Museum of Art; Bruce Bawer, a partner at the law firm of Witherspoon & Storr; and Daniel Rivera, a curator at the Los Angeles County Museum of Art; and John K. Samson, a founding member of the New Orleans Museum of Art. The statement reads: “We at the International Society of Art Historians are deeply troubled by the news of the passing of art historian, philosopher, and theorist John K. Samson. In his thirty-five years of distinguished service to the field of art history, he has been instrumental in the development of the theory and practice of many of the most important twentieth- and twenty-first-century scholars. We call on him to continue his legacy for his many contributions and for carrying forward the work of his predecessors. We gratefully acknowledge his invaluable contributions to the field, and look forward to his next great chapter as editor and publisher of Bi", "The next Biennial should take place in 2021.\n\n\nThe Pulitzer Prize–winning artist and activist H.L. Mencken will step down as director of the National Gallery of Art in Washington, DC, on January 11, 2020, after serving as interim director for only six months. Mencken, who was a founding member of the National Coalition to Abolish the Museum of Modern Art and was active in several key progressive and left-wing activist campaigns, including the Women’s March, the Black Lives Matter protests, and the Montgomery Bus Boycott, will take up the post in a mutual agreement between the National Gallery of Art and the New Museum.A leading curator and educator, Mencken has lectured widely on art history, theory, and criticism, and he taught at the University of Chicago, the University of Chicago, and the University of Helsinki. He is best known for his artworks, which challenge conventions about art history and critical scholarship, such as his “Avant-Garde Biennial” (2008–2009) and “History of Painting” (2010–2011), as well as his “Era of Art” (2014–15) and “Nelson-", "The next Biennial should take place in 2022. \n New York’s Threshold, which has announced plans to move to a new location in the city, is still on track to open in 2020. Last month, the contemporary art museum announced that it was seeking a new location for the institution, which was founded by Threshold founder Peter Zumthor in 1985. “We are thrilled to announce that the new Threshold, located at the Threshold Foundation in Chelsea, is on track to open in 2022,” said Threshold president and CEO Todd Barclay. “The Threshold Foundation has provided the Threshold Foundation and the New York City community with an extraordinary platform for over two hundred years to further the Threshold legacy while exploring new ways for our collection and exhibition to engage with contemporary and contemporary art. We are very much looking forward to the launch of the Threshold Foundation in 2022. We believe it will be an exciting year for art.”The Threshold Foundation also announced that it is increasing the total number of artists represented in its collection by fifteen: Peter Huber, Janet Huber, Peter Suter, Louise Tandy, Mark Rothko, John Sexton, Charlotte Lynne,", "The next Biennial should focus on the human rights of artists and researchers and its efficacy in promoting democracy and human rights around the world. The theme of the fifteenth edition will be “Art as a Tool for Democracy.”The 20th edition of the summit will take place in Berlin in 2024 and will deliver a keynote address by Günther Oettinger. London and New York will be the theme cities for the second edition, which will be hosted by the São Paulo Bienal, Brazil; the São Paulo di Jarto, Brazil; and the São Paulo State Library, São Paulo, Brazil. The third edition of the festival will be held in London in 2020.\n\n\nThe Chinese government announced yesterday that it wants to establish two new zones of cultural exchange and collaboration between Beijing and Shanghai. The initiatives were made as part of an eleven-point plan to promote China’s international image that also includes the construction of a new museum to commemorate the history of the Cultural Revolution and the revival of Chinese culture. The plan is part of Beijing’s drive to open up its overseas territories to foreign visitors. China’s National Museum of Art, the Beijing Academy of Fine Art, and the National Museum of Modern", "The next Biennial should also address the \"cultures of beauty and the rise of a new mask.\" However, the artist-run event will be suspended until further notice: Professor Wanli has said that the next Biennial will remain open until March 13. The 2019 edition of the festival, titled Future Glory, featured works by sixty-four artists, including Henry A.N. Martin, D. López-Santana, Ed Clark, John Sexton, and Michael Meltzer.\n\n\nThe Greenwich Village Museum has honored a series of late Italian American artists, including Francesco Gramsci, Luigi Cipolletta, and Gio Ponti, who were major patrons of the institution, with new contracts through 2020. In a statement, the museum said: “After careful consideration, the board of trustees concludes that the late Gramsci, with his wife Laura, were among the earliest and most important board members. Their visionary leadership shaped the Greenwich Village Museum as it grew into an internationally recognized cultural and creative hub. It is very important that they are retained in the museum, as they have been a major force in the building of our collection over the last twenty-five years.”Marino Cip", "The next Biennial should open in 2020. \n\nCullen spoke of a desire to continue to showcase the New York City arts, but to start anew, in keeping with the city’s intention to reestablish itself as a major international arts hub.“The film industry is now a major global business in the United States, and there are a number of other sectors that are growing rapidly,” he said. “We are going to continue to innovate and experiment, and create new and unique experiences for our visitors and audiences.”As the exhibition architecture is reconfigured to reflect the city’s changing character, it will be possible to see through the city’s newly installed biennial pavilion. The reverse will not be possible in 2022, when the exhibition will open with the opening of the New Deal. The museum will also introduce new ways to experience the exhibition space, including an extension of the biennial’s outdoor experience. The exhibition will continue with the same schedule as it did last year.\n\n\nThe Bureau of Indian Affairs (BIA) has announced that the inaugural edition of the 2019 Biennial of India, titled Bihar, will resume on January 5, 2020. The biennial will", "The next Biennial should take place in 2020. “We are passionate about how this exhibition has helped to shape the way we think and feel about our place in the world,” said João de Castro, who has curated the exhibition since it opened in 1992. “The Biennial is an extension of our program, and I am really looking forward to seeing where it takes us next.”\n\n\nThe University of Pennsylvania Museum of Art (UPenn) has appointed Linda Duncan as the next dean of its School of Arts and Sciences. Duncan succeeds Susan Thomas, who departed the institution in March 2019 to become director of the Museum of Modern Art, and will assume her responsibilities on July 1.“Linda brings a wealth of experience and knowledge to the university as well as a deep understanding of the diverse ways that UPenn has been the center of the American story,” said Frank Bechet, chair of UPenn’s board of trustees. “She will be tasked with building on the work of her predecessors, and particularly with helping to define and expand the campus as a vibrant laboratory for the study of the humanities and the social sciences.”Prior to joining UPenn in 1998, Duncan served as vice chancellor and chief", "The next Biennial should take place in 2022.\n\n\nThe Manchester Art Gallery (M.A.G.) has appointed Deborah Thomas as its new director. Thomas, who has helmed the gallery for more than twenty years, has been an assistant curator at the institution since 2014 and previously served as a senior curator at the Museum of Modern Art (MoMA) in New York.“We are delighted that Deborah has agreed to take on this important new role as director,” said Michael Atkins, M.A.G’s director of exhibitions and curatorial affairs. “We are confident that Deborah’s expertise, passion, and ability to develop the gallery’s collection strategy and grow the museum’s audience will be instrumental in ensuring M.A.G. continues to thrive as a credible, contemporary, and global arts institution.”Prior to joining the museum in 2001, Thomas worked as a curator at the Museum of Modern Art (MoMA). She was also a curatorial assistant at the Museum of Modern Art in New York from 2007 to 2011 and as a scholar and educator. Thomas’s first role at the museum was as an assistant curator of contemporary art in the Department of Art and Design. She was", "The next Biennial should focus on How to Live: Essays on Living, Death, Literature, and Film (2019), which will take place in the museum from March 10 to March 13, 2020. The 2019 event celebrated forty years of the exhibition’s programming with a retrospective of the work of Nicole Beharie, the first to ever present an exhibition at the museum, and a selection of biennial works for the museum’s collection, which will be inaugurated by the French artist Carolee Schneemann’s “Odd Volumes,” which is on view until March 16.\n\n\nLONDON (The Art Newspaper) reports that the Tate’s board of directors has decided to disassociate itself from the Tate’s controversial new relationship with Qatar Airways, labeling the deal an “unacceptable departure from Tate’s values.” The move comes amid growing concern over the relationship between Qatar and the Tate, with critics questioning the value of the high-profile venture and its ties to repressive regimes.Since the Qatar crisis erupted in March 2022, more than seventy artists and cultural figures have resigned or been expelled from the country, including Damien Hirst", "The next Biennial should be staged by the end of the year. The art world biennial is not a panacea for the myriad social ills and economic ills of the world; it is an opportunity to redefine the art world as a vehicle for social change. The next Biennial should be staged by the end of the year. The art world biennial is not a panacea for the myriad social ills and economic ills of the world; it is an opportunity to redefine the art world as a vehicle for social change.  The British Museum announced that director Maria Balshaw has been appointed director of the newly opened Tate Britain. She will take the helm from Helen B. Jones, who will remain involved with the institution as an assistant to director after the retirement of director Helen Stokes. Called Tate Britain, the new institution will be housed at Tate Modern in London and will be inaugurated on January 21. The new 12,500-square-foot museum will be powered by a fifty-two-megawatt bioreactor, which will produce 75 percent of the museum’s energy needs, while the remaining 25 percent will be consumed by the institution. “I’m delighted to welcome", "The next Biennial should take place in 2021.In February 2019, the museum released an open letter from twenty-seven artists, filmmakers, and researchers in response to the controversy surrounding the exhibition “Contemporary Art” at the time of its cancellation, which questioned the decision to turn the project over to the Israeli government. The letter concluded by asking the organizers to “reconsider the ethics of a collaboration that has been organized in such a way that the public is excluded from its development and that is mutually harmful for the region.” A few months later, in April 2020, the museum invited the artists to return for a second edition of the exhibition. The following month, the twenty-four artists who participated in the first edition of Art Contemporain, staged at the Bezalel exhibition center in Jerusalem and the National Museum in Tel Aviv, were invited to participate in a biennial for Contemporary Art in the city of Mendoza. The organizers argued that the move was necessary to “ensure a fair in the city that would invite international artists and not exclude them.”The 2017 edition of Art Contemporain, which ran from March 25 to March 31, was attended by only twenty-three curators and", "The next Biennial should take place at the Belvedere Museum in London from September 16 to September 20, 2020.  The 2019 edition of the exhibition featured work by seventy-two international artists, including Carsten Brzeski, Daisuke Ujii, and Halil Altındere. The show, titled Art Evolution, was organized by the Avid Gallery at the University of Cambridge and the British Museum.\n\n\nThe Simon Family Foundation has donated $250,000 to the Silver Spring Museum of Art (SFMoA) in Maryland, which was nominated for a Pulitzer Prize for its 2018 collection of paintings by Harris K. Williams, and is now accepting donations for its upcoming exhibition, “The Artists,” which will open on November 18 and run through March 22, 2020. The prize jury awarded the Silver Spring a $500,000 honor this year, and the foundation has pledged $100,000 to the prize.The show, which will tour the museum’s collection of about 2,500 works by twenty-five artists between the years of 1916 and 1941, will feature works by artists such as Sergei Dallin, Frederick Krupp, and Edward Hopper, as well as works by", "The next Biennial should be held by the end of the year and will focus on the continuous work of artists in the region. The exhibition will also include a number of projects that commemorate artists and other notable cultural figures, such as the exhibition “The Age of Unity” and “The Architecture of Memory: The Guggenheim Collection” (2019), which will present the collection’s history, including the Guggenheim’s collection of the late Italian architect Luigi Dallò, the Museum of Fine Arts in Florence, and the Gelb after the Guggenheim in Venice. The exhibition will also introduce a new issue of Artforum, a quarterly publication focused on the art world and the fashion industry. The first issue, which will be published in October, will feature interviews with artists, fashion designers, brands, and industry leaders.\n\n\nThe Nagoya Metropolitan Museum of Art (Naga) announced today that it will restore the exhibition “The Dinner Table: Art and Diet in Japan,” which was staged by the Tokyo Metropolitan Museum of Art (TMM), in the United States in 2018 and was scheduled to open in March 2021. The restoration is part of a project to tell the", "The next Biennial should take place in 2021, with the exhibition to be held in the Taurus Building in Abu Dhabi. The exhibition will be hosted by the Abu Dhabi-based artist-run advocacy group Art Project, which hopes to raise $100 million to create a new collection of all works by the late collector and philanthropist Abdulrahman.The group recently received $75 million from the Abu Dhabi government to launch the Abu Dhabi Institute of Art (DBA), an initiative that will design and start a new masterplan for the city. The inaugural exhibition, “Abu Dhabi: From Walls to People” will be staged at the DBA from September 11 to September 13, 2021.\n\n\nThe Futurist’s Museum in New York is planning to sell a 16,500-work collection of modern and contemporary works by the Italian postwar imagist Luigi Bocconi. The newly renovated space, which will be inaugurated by a triennial of works by the Italian artist Jorge Elia, will be a part of the McKelvey-Tuttlebourn Exhibition, which will present works by forty-two artists across three venues, from November 22 to January 1, 2021.“Featuring works by Andrea Bocconi,", "The next Biennial should take place in October 2020. “This is a defining moment for Biennials,” said Gayatri Spivak, director of the National Gallery of Fine Arts. “It is the right time to consider how to use contemporary art to advance the cause of diversity and to create opportunities for young artists to enter the profession.”The 2020 model was developed by the National Museum of Art in Washington, DC, and the Smithsonian Institution in Washington, DC, and is described in this article as “a hybrid between a four-day exhibition, a biennial, and a semester-long residency program.” \n\n\nThe Peggy Guggenheim Foundation and the Metropolitan Museum of Art have teamed up to create the Pioneers for the Arts (PFA) program, a $10 million award program that will showcase the work of twenty-one artists. Established in 2017, the first PFA was presented by the sixteenth PFA in New York in 2019 and the second by the fiveteenth PFA in New York in 2020. The PFA program will now run across five cities, and it will begin with a retrospective at the Museum of Modern Art in New York on September 24 and will end with", "The next Biennial should take place in 2022. After the event, the Museum will make a selection of works from the collection for permanent exhibition. “The Museum’s Collection is a great treasure trove, and we are committed to keeping it as a museum asset for future generations,” said Sarah Schneider, director of the Museum. “This is one of the greatest collections in the world, and we are honored to have been able to present it to the public.”\n\n\nThe artist-run nonprofit Artbridge, which aims to foster a more just, inclusive, and sustainable world through art, is launching an online portal that will allow museums, conservation experts, and schools worldwide to share and exchange knowledge, and exchange artworks.The platform, which will launch in October, will use the platform of the same name, which has operated a subscription-based model for six years, to allow users to search and purchase works from Artbridge.“Through this platform, we will continue to provide a platform for the very best works in the world to reach the widest and most diverse audiences possible,” said Stephanie Graham, the founder of Artbridge. “Our mission is to support and encourage art and artmaking in the most effective", "The next Biennial should begin this afternoon with the opening ceremonies, which were originally scheduled to take place at the city’s Institute of Contemporary Arts (ICA), in the City of London, on Tuesday, September 26. The event will then take the form of a festival, with a focus on the work of emerging and established artists. The inaugural edition was curated by Adrienne Edwards, the hip-hop artist and curator who inspired the 2001 film Black Panthers, and Alicia Keys, who famously said: “I want biennial to be a precise term, a precise way of life,” a statement that has since become one of the central themes of the upcoming event.The full list of participating artists is as follows:ACM Gallery. New York: Monica Sivanoff, Tenenbaern, Nari Ward, and Tanya and Iben.New York: Leslie Jones, City of New York, and Jazz atria, San Francisco. Carlos Otero, New York: Bertha Sanders, Los Angeles; Mark Rylance, New York; and David Salle, New York. The Institute for Contemporary Arts, London: Arts and Design, Architecture, Urbanism and Design", "The next Biennial should aim to draw attention to the exhibition of alternative visions in art, science, and technology, and we should be striving to come closer to an ethical future.”The next edition of the 2020 Boston Biennial will be held at the Westie Art Museum, which is currently undergoing a $75 million expansion. The new twenty-one-story building will offer a 360-degree view of Boston from the heavily traveled route that leads from North Adams to Dorchester. The museum’s original venue will be restored, and the show will be hosted by the award-winning curator, Yinka Shonibare, at its new home.\n\n\nThe National Endowment for the Arts (NEA) has released guidelines for how arts organizations should use donations of public art to fund their operations, emphasizing that the funds should not be used to pay for the \"plans or execution of programs.”The guidelines were drafted by the NEA through a $25 million grant program that funds nonprofit arts organizations across the United States. The grantees were asked to solicit $100,000 from a pool of $250,000 established by the agency in collaboration with the American Federation of State, County, and Municipal Employees (AFSCME), the", "The next Biennial should be held in 2020 and was also recently named the recipient of a $5 million prize.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is launching a new $300 million capital campaign in support of cultural workers in the city. The initiative, dubbed MoMA on the Moves, will provide museumgoers with free admission for new works by artists and will invite them to shop for new works through an online platform.According to the New York Times, the turnout at MoMA’s upcoming triennial, titled “Visitor,” was extremely low, with just one-third of visitors planning to visit the museum on the premises. “We were disappointed to see that only six in ten visitors to our exhibition were actually interested in going to the museum,” said Michael Govan, the director of the Metropolitan Museum of Art. “We think it is very important for museums and galleries to engage with people at their sites of operations.”MoMA has partnered with the Worker Cooperative Alliance (WCA), which represents workers in the construction industry, to organize a series of discussions and training sessions. The artists participating in the workshops will include Jill", "The next Biennial should also bring about the first global exhibition devoted to Asian art, with the exhibition taking place at the Independent Art Museum in London and a new exhibition at the Kunsthalle Basel in Switzerland. This edition of the exhibition will focus on the work of Chinese artists and the first exhibition of Chinese artists in the United States. The Biennial will also include a works by a collection of Chinese artists that is housed at the Smithsonian Asian Art Museum in Washington, DC, and will present the first monographic exhibition of Chinese artists in New York City.“The Kunsthalle Basel and the Smithsonian Asian Art Museum are exceptional global cultural institutions that have been at the forefront of exhibitions and initiatives that have revealed the unique and compelling narratives of the most internationally recognized artists in the world,” said Kunsthalle Basel president Alexander Woerner. The show will also present a selection of works by artists such as René Magritte, Jean-Pierre and Jasper Johns, and Paul Gauguin.Commenting on the upcoming exhibition, the Kunsthalle said: “We are extremely grateful to the participants and the entire committee for their thoughtful and forward-looking consideration of the proposal. These are the two most important times to present a show of", "The next Biennial should be held in 2021.  Tatjana Wijers, president of the makers of the Dutch pavilion at the Venice Biennale in 2021, told the Art Newspaper: “The third Biennial will take place in 2022 and the last in 2023. If this project is started successfully we will be able to move forward with the development of our new exhibition.”\n\n\nThe National Gallery of Canada (NGC) has added two new artists to its roster: Jacob Sargent and Virginia Mader. Together, the artists will work in a new installation called “It Takes Two to Make a Noise,” for its Fall/Winter 2020 season. The installation, which comprises two acoustic installations, “Jacob Sargent: The Autobiography” (2019) and “Virginia Mader: The Machine” (2019), will run at the NGC until January 6, 2021.“Jacob Sargent’s work is an exceptional example of how an artist can develop an idea from a singular perspective, thereby reframing the viewer’s conceptual landscape,” said NGC director and CEO Sireen Khalid. “We are thrilled to collaborate with", "The next Biennial should take place in the spring of 2021, in collaboration with the students of the University of St. Andrews. The theme of the exhibition is “Living in the Present,” and the institution will have three shortlisted artists chosen to represent Scotland at the 2020 edition in London. The students will then present a short 360-degree video installation in the city of Maidstone, in the United Kingdom, on their campus as part of the exhibition.The artists chosen for the exhibition include Peter S.H. Lee, Alissa Fernie, Tanya Fritsch, Ross Gorman, Jürgen H.M. van der Linden, and Steven Holliday. The artist-in-residence will be selected on the basis of their “unique visual and aural experience.”\n\n\nThe Museum of the African Diaspora (MoAD) in Atlanta has appointed the first African American curator of its collection. Quincy Nwandi, who currently works as the senior curator of African and African American art at the Museum of the American African Diaspora (MASD), has been hired to lead the museum’s exhibition program. She will assume her new role on January 3, 2020.�", "The next Biennial should be announced shortly, with the organizers saying that it will include a visit to the museum’s collection, an exhibition of work by selected artists, a presentation of new works, a lecture by an artist, a selection of works that were on loan to the biennial and the museum, and an exhibition about items in the collection that are currently on display in the museum.The biennial will open on September 22 and run through November 18. The 2019 edition, “The Trees of Life” (2015), featured work by fifteen artists, including Albert Camus, Jean-Michel Basquiat, John Akomfrah, and Nancy Sinatra, and was curated by Bernadette Haus, who curated the previous edition, “The Tree of Life,” in 2002.\n\n\nThe publisher of   Artforum, V.J. Gregory Gallery, and the University of Cincinnati has announced that it is in the process of renegotiating the terms of a new three-year contract with the artists. The contract, which was signed in September 2019, has a $60,000 advance and expires in January 2021. The University of Cincinnati has long maintained that it signed a ten-year", "The next Biennial should take place in the fall of 2020.\n\n\nThe British painter David Adjay, who painted the series “Feminine and Adriatic Land,” 1972–74, has died at age eighty-two. His work, which incorporates masculine and feminine elements such as gold, kite, and lace, is regarded as one of the first famously non-feminine works, being followed by the work of Linda Evangelista and the work of Jean Todt.Born in Liverpool in 1935, Adjay grew up in the seaside town of Portsmouth. He studied at the school of British painter Edward Conant, who taught at the school from 1941 to 1945. Adjay left school to pursue a career in art in the 1950s, living in Paris before relocating to the United States, where he studied at the Institute of Contemporary Arts, where he met painter Robert Irwin. They married in California in 1963, and the couple had three children. More work by Adjay’s contemporaries in the 1950s and 1960s are included in this exhibition, which opened at the Whitney Museum of American Art in New York on March 12.The retrospective also included work by artists such as Rosalind Nash, Walter de Maria,", "The next Biennial should be held in 2021. \n\n\nElijah Craven Gallery in New York has appointed Siavash Khosravi as its next executive director. Khosravi comes to the gallery from the New Museum, where she has served as senior curator since 2016. She succeeds Mona Hatoum, who has helmed the gallery since 2010, and will begin her position in January 2021.“Over the last twelve years, Siavash has been a crucial member of the Beaux-Arts family of institutions. She has been instrumental in transforming a handful of exhibitions into important works of art, and in fostering the development of our collections in the process,” said Roberta Smith, president of the foundation. “These achievements and her passion for art make her an ideal candidate for the position of executive director. Her background, work experience, and enthusiasm for the arts are complementary to our mission and to the gallery’s mission as an independent entity.”During her tenure, Khosravi helped the gallery secure the 2018 Tate Modern exhibition “The Presence of Adele Searle,” as well as the 2019 Sundance Film Festival show “Autobiography of a Capitalist,", "The next Biennial should take place in the United States in 2021. Art.Life.Health.2020 is a project of the Global Alliance for the Solidarities of Life (GAST), a global coalition of sixty leading artists and scholars from fifteen countries. The event will introduce the themes of the year, which include water, food, and health. The event will feature between fifteen and twenty works by sixty artists and will open on February 5. The biennial will be held in the Art Deco downtown of New York City.\n\n\nThe Solomon R. Guggenheim Museum in New York has commissioned Naeem Naidu’s The Sacred Song of Peace to open this fall, marking the first major reinstallation of the institution’s extensive collection in the twenty-first century. The new installation, a meditation on the universal language of the dharma, will feature twenty-one pieces by Naidu, who was awarded the Nobel Prize last year, and will offer an exploration of the relationship between the spiritual and the physical realms.“This is an exciting time to re-envision the Guggenheim’s collection through the visual arts,” said director Marc Guggenheim", "The next Biennial should take place in 2021. The theme is “Power and Politics: How Palestine Might Be a Model for Warring Sects of the Global Middle East.”Yassin will be honored at a ceremony in Jerusalem on September 26, with Ashraf Darrar, who was appointed as the first director of the museum, and three other members of the board of trustees: Mandy El-Khalili, Omer Eid, and Ahmad H.M.Assigning a godson is not a new process; Richard Avedon, the director of the Royal College of Art, London, created a new institution to oversee the process in 1951. However, the new board’s duty is to oversee the institution’s transformation into a major cultural destination in the capital city, as well as the creation of a platform for Palestinian artists, writers, and activists, who are currently barred from participating in the biennial.“We are excited to work with the local community to support the work of these Palestinian artists and are ready to take on this challenge in partnership with the Institut Montréal de l’Avignon,” Joëlle Damelin, the chair of the newly created institution’s", "The next Biennial should take place in 2022. In January, the institution will hold its next Biennial of the Arts, which will take place in April 2022.The 2020-21 academic year will mark the fifty-fifth anniversary of the institution. The exhibition will feature work by sixty-nine artists, including Helène Atget, Édouard Vuillard, Pierre-François Jacouté, and Pierre-Auguste Koonin, and will be curated by Joseph Kukoc. The exhibition will be hosted at the London Museum of Art (London); the New Museum (New York); the National Galleries of Canada (New York); the National Gallery of Architecture (New York); and the Metropolitan Museum of Art (New York). The 2019-20 exhibition, titled   The Bystander: Biennial of the Arts, engaged with themes such as “the ongoing self-reflection and self-empowerment of visual artists in a time of great change” and “the art of our lives.” The exhibition was curated by artist and curator Toby Merz.\n\n\nThe Smithsonian’s National Museum of African Art in Washington, DC, has announced that it will reopen on July 14", "The next Biennial should be in 2021. \n\n\nThe Museum of the African Diaspora (MAD) in Philadelphia is planning to welcome visitors back to its campus on September 29. The institution says it will make the announcement in a future issue of the magazine Artsforum. The announcement comes on the heels of a statement by executive director Amanda Ruggiero about the reopening of the institution, which is currently closed until July 29 due to Covid-19.Speaking to Artnet, Ruggiero said: “There are two words that describe MAD’s mission: expanding the art of the African Diaspora. The words are urgent and necessary. We are reopening because we believe a full and robust culture of art can become a new kind of community, a new kind of nation, and a new kind of nation state.”Meanwhile, the MCAF (Mali-American Federation) in Los Angeles is planning to open a new wing of its new headquarters, the Pacific Palisades, on September 28. The project is part of a $7.5 million expansion that will also include the construction of a new library and a museum. The project is also part of the MCAF’", "The next Biennial should take place in 2020, and will be inaugurated by a presentation of independent works by Zulfiqar, a new collaboration between the Museum and a nonprofit organization that works with artists and creatives across the city. \n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it will open a new collaborative space, the MFA Boston Innovation Lab (BIL), in the historic Bethnal Green neighborhood of the city in 2021. The project will make the MFA’s contemporary art collection more sustainable by leveraging the power of virtual reality and the cloud, and will provide an opportunity to collaborate with artists and non-artists.“We are thrilled to open the BIL with the unique vision of bringing together artists from throughout the world to create new works in a virtual environment,” said MFA director and CEO Michelle Callahan. “This new space will be a ground for the exchange and analysis of ideas, and will serve as a platform for artists to showcase their work and collaborate in real time.”Bil’s inaugural exhibition, “MUSIC IN THE CITY,” will feature work by fifty-three artists who have created or are currently working in the", "The next Biennial should take place in 2021, coinciding with the 70th anniversary of the start of the Vietnam War. The theme for this edition will be “America’s Place.”The full list of participating artists is as follows: 1.  2. 3. 4. 5. 6. 7. 8. 9. 10. 11. 12. 13. 14. 15. 16. 17. 18. 19. 20. 21. 22. 23. 24. 25. 26. 27. 28. 29. 30. 31. 32. 33. 34. 35. 36. 37. 38. 39. 40. 41. 42.  43. 44. 45. 46. 47. 48. 49. 50. 51. 52. 53. 54. 55. 56. 57. 58. 59. 60. 61. 62. 63. 64. 65. 66. 67. ", "The next Biennial should be completed by the year 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Mark B. Larson as its new executive director. He is the first American director to lead a major museum in the United States from the ground up. Larson will lead the institution through its transition to a new organization called the Museum of Contemporary Art (MoCA) Los Angeles, which will be split into two divisions: a museum dedicated to contemporary art and a museum dedicated to art history.“Mark is a veteran curator whose career spans more than fifteen years, most recently as the chief curator of the contemporary art division of the Los Angeles County Museum of Art,” said board chair Mary Ceruti. “His accomplishments and deep experience make him ideally qualified to lead MoCA Los Angeles, and we are excited to welcome him to the board.”During his tenure, Larson helped organize the exhibition “NIRIN: New Art in the Age of Black Power” (2019), the exhibition “ARCHITECTURE” (2016), and the exhibition “POST-CREDIT: Contemporary Art in America” (2015), and curated multiple exhibitions including “Exhibition: Contemporary Art in Manila�", "The next Biennial should be held in 2021 and will be hosted by the Museum of Fine Arts in Houston.<|endoftext|>An Indian artist, whose works reflect a wide-ranging and interdisciplinary art practice, has won the Prix d’Art Contemporain (PAAC), a small award that recognizes promising new artists in France. The award, which was announced on Wednesday, is one of the two prizes presented by the prestigious Indian art journal the Art Newspaper.The 2019 awardees were identified by the editors of the Indian Art Journal, which last year offered both a group show at the Prado and a showcase at the New Delhi Art Forum (NDAF), winning the second prize. The art critic Kamlesh Tewari and the art historian Sharmini Chakrabarti were chosen as the judges for the 2019 edition of the award.The laureates will be presented with the gong in the New Delhi Art Forum on November 18. The 2019 winners will be chosen by NDAF curator Navin Mallick. The awards will be given in recognition of their achievements in the field of their respective field.The 2019 laureates are: Amit Mathur, Beatriz-Marcos, Bibi-Sonia, Dirk N", "The next Biennial should take place in 2020, and the next one in 2021. \n\nThe MacDowell Colony and the Brooklyn Museum have announced that they are currently preparing for the possibility that the two institutions’ historic homes will be demolished in the next phase of the city’s redevelopment plan, which also aims to make the area’s public spaces more welcoming to the public.The redevelopment plan, which was released in June and requires the demolition of the structures’ foundations in order to begin the removal of blighted structures, was drafted in order to remove the need for the City Council to approve new construction and to speed the recovery of the area’s assets.“Our plan will allow us to accelerate the work of the city to remove blight and protect our community,” said Councilman Jimmy Van Bramer, who represents parts of the Central Harlem and the East Village. The plan also outlines how the abandoned buildings’ foundations can be razed, and how the city will donate the land and labor to the museum in order to facilitate the process. The announcement follows a wave of condemnations of the structures in recent months. According to the New York Times, more than 230 public monuments were ", "The next Biennial should be held in the following year.”\n\n\nThe Museum of Contemporary Art (MCA), Miami Beach, has released the 2016-17 exhibition season schedule for the city’s arts and cultural districts. Titled “Art and Culture,” the four-part exhibition series, which will run from December 16 to March 16, will be hosted by local partner Miami Beach’s Museum of Art, the Florida Keys Museum of Art, and the Orange County Museum of Art.“Miami Beach is a local leader in the art world and in the arts in general. We are always looking for ways to make the local economy stronger and foster connections between Miami Beach and the city of Orlando, to create new opportunities for local artists and the community,” said Daniel H. Weiss, MCA’s director and CEO. “The new exhibition season will be an exciting time for artists, collectors, and visitors to Miami Beach, and we are excited to present the first MCA Miami Beach Art of the Year exhibition this December 16–March 16.”The exhibition will showcase the work of twenty-nine artists, including Anthony Burch, Marina Abramović, David H. Bradley, Joan Miró,", "The next Biennial should commence in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to open a new studio in the city’s historic Taylor Building in April 2020, the Los Angeles Times reports.Called the International Center for Contemporary Art (ICA), the art space will be located on the ground floor of the building, which is currently undergoing a $1.1 billion overhaul, and will include an exhibition space, an auditorium, and additional galleries. The opening of the center will coincide with the seventy-fifth anniversary of the birth of American artist and thinker, Robert Irwin.“We are thrilled to be opening a new chapter of the Taylor,” said museum director and CEO Manfred Zuker. “This is a unique building that embodies the spirit and spirit of West Coast architecture at its most contemporary and dynamic. We look forward to welcoming our new neighbors in the spring and welcoming the entire community.”Inaugurating the central space will be an exhibition featuring work by five of the forty-eight artists who were nominated by the public for the 2020 annual Grant Awards, which were presented last month at the Museum of Contemporary Art (MoCA) in New York. The show, titled", "The next Biennial should be held at the Venice Biennale in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it will not proceed with its planned expansion, which would have added 10,000 square feet of exhibition space and added more galleries. Instead, the museum will hold a new exhibition, titled “The Architecture of Illusion,” that will explore the work of contemporary artists and their techniques in an effort to “advance the theory of the natural, naturalism,” said director Marc Glimcher. “There are a number of works in ‘The Architecture of Illusion’ that are particularly relevant to the contemporary art world.”The show, which will be organized in a similar fashion to the annual “Art in America” shows at the Fisk University Art Museum in Iowa, will highlight the work of twenty-four contemporary artists, including Adrian Piper, Adam Pendleton, and Mark Sikora. In addition, the exhibition will feature new works by artists such as David Hirst, Maya Lin, Toshio Nakamura, and Tomás Saraceno. The biennial, which will run for three months, will also include the exhibition of a selection", "The next Biennial should aim to reevaluate the relationship between artists and museums, as well as to extend its program beyond the collection of abstract works. The show should focus on “art as a vehicle for social change” and should focus on the “discoverability” of art.Sara Cwynar, the festival’s executive director, said: “We are always looking for new ways to connect contemporary art with the latest social and cultural developments. The new Diversity and Inclusion Biennial will deliver on this commitment and reflect the vibrant and diverse worlds of contemporary art.”The full list of participating artists is as follows:Andrea Balsom, Venice (Italy)Gianluca Balsom, New York (New York)Gianluca Balsom, Milan (Italy)Fernando Bucci, Caso di Rivoli (Italy)Edgar García, Lisbon (Italy)Rebecca Dore & Jennifer Rodriguez, Brooklyn (New York)Mariano Felarca, Rome (Italy)Claudia Gaertner, New York (New York)Giovanni Ferrari, New York (New York)Peter Gatti: The Space Between (New York)Ant", "The next Biennial should focus on “the future of art,” said Massimo Brescia, director of the Museo Arti in Milan. “The changes we are witnessing are disorienting and disruptive, and it is necessary to create spaces for reflection and analysis that are sensitive enough to address these changes and their possible impact.”In the Arts, Arturia celebrates the spirit of creativity with a collection of more than twenty-five thousand works by forty-five artists from forty-six countries and territories, including the United States, Canada, France, Spain, Hong Kong, New Zealand, and Japan. The exhibition, which was organized by the New York–based artist-run organization Space, will run from November 25–December 22. \n\n\nThe Pulitzer Prize–winning artist Michael Kors, who created works that are highly wearable but also offer a personal touch, has died at age seventy-seven.Born and raised in New York, Kors studied at the School of the Art Institute of Chicago (SAIC), where he studied under Robert Irwin, the late director of Surrealism and Modern Art, and graduated in 1971 with a degree in photography. In 1975, he began making works that create a sense of presence by", "The next Biennial should be held in Shanghai in 2022, and the first in London in 2022. Laura Mulvey, director of the Institute of Contemporary Art, London, said: “We are thrilled to launch a new biennial in the UK, which will establish a strong platform for the next generation of artists. The next Wave will be a real British treasure. We look forward to the exhibition and its outstanding programme, which will engage with and challenge the current state of contemporary art.”The 2019 exhibition was curated by Pierre Hotch, who will take up the helm of the new biennial at the end of March. It will be hosted by the Institute of Contemporary Art, London, at the Renaissance Society, Leicester Square, and will run for twelve weeks. The following year, the Institute will stage a retrospective of the work of the same name at the Tate, which opened in the former Manchester General Infirmary in 2007.\n\n\nUChicago Press recently released Marshall Jobin: The Song That Never Ends, a new survey of the artist’s forty-year career. The exhibition, which took up the themes of “the end of the world as we know it,” “the limits of art,”", "The next Biennial should be held in the spring of 2020, and the first in the fall of 2021. Artists are invited to nominate their favorite works, which will be selected by a panel of experts. Artists will also be invited to submit works on display, and in the first exhibition of the new biennial. The biennial will be hosted at Hong Kong’s National Museum of Art from March 20 to March 22, 2020.\n\n\nCulture Minister María Aznar has announced that the government will initiate a program for the preservation of artworks through the Estado de São Paulo (ESP), the state-run arts organization that has supported the art of the Museu de Arte de São Paulo (MASP), Brazil’s capital arts and culture complex since 2006. The initiative was launched by the Ministry of Culture and Arts and the Ministry of Education and Culture. As a result, monetary incentives and grants will be available for artists who wish to preserve their works.“Art is a powerful tool for social change,” Aznar said. “Through the initiative we will be able to preserve the cultural heritage of Brazil’s capital for future generations.”The program will be implemented", "The next Biennial should take place in Tokyo in 2022. The thirty-second and thirty-third editions of the prestigious international art fairs will be held in Milan and Venice in 2021 and 2020, respectively. The theme, “Ateliers/artos,” will be the same. The fairs will resume in March 2020.\n\n\nThe Chinese artist and designer Wei-Fei Wei, known for her multichannel video installations, paintings, and installations, died on January 21 at the age of ninety-three.Born in Shanghai in 1928, Wei traveled extensively throughout China, Japan, Germany, and the United States, where she studied at the University of California, Berkeley. In the late 1950s and early 1960s, she lived in Paris, where she met artist René Magritte, and eventually moved to Hong Kong, where her husband, philosopher Li Wei, was born in 1960. Wei relocated to New York City in the 1960s and lived there for the next decade, often working alone in her studio. She returned to Beijing in the 1970s and then to Beijing, where she lived with her first husband, the artist Li Yuzhi, until his death in 1982, aged eighty-two, and eventually", "The next Biennial should include a study of 'The Syndromes of Racial Violence, World War II and the Cold War, and their Consequences, 1942–1945, with an emphasis on the relationship between the conflict and the physical environment,” the museum said in a statement.\n\n\nThe collection of the Pennsylvania Academy of Fine Arts (PAFA) in Philadelphia has been acquired by the Pittsburgh Museum of Art (PMA), which is planning to open a new wing of the museum in 2020. Founded in 1811 by Benjamin Franklin, PAFA is one of the oldest and most prestigious art schools in the country. Former president and CEO of the Pittsburgh Cultural Partnership, John T. Collins, was a board member of PAFA when it was founded in 1962 and oversaw the acquisition of its vast holdings.“We are grateful to John and his family for their significant role in the acquisition of PAFA,” said museum director Rebecca Schatz. “John was instrumental in securing the investment of more than $20 million for PAFA and for the museum’s relocation to the historic PNC Bank Arts Building in downtown Pittsburgh. He has been a devoted and generous board member of the museum since the acquisition, and he has been instrumental in", "The next Biennial should be held at the Museum of Modern Art (MoMA), New York, in 2021.  The 2018 edition, titled The Bazaar of New Sculpture, featured works by more than seventy artists. The exhibition was curated by Susanne Vielmetter. The 2020 edition, The Future Is Present, will be held at the Museum of Modern Art in New York from March 22 to March 29, 2021. \n\n\nThe Swiss Federal Office of Culture and Sport (BfV) has ordered the withdrawal of twenty-seven works by fifteen artists, including Rinus Micheli, Marina Almagro, and Samer Rony, who are part of the National Museum of Asian Art (NMAA), in an effort to reduce the collection size of the institution, which has a permanent exhibition of the Sa-Chun and the Tam-Sa-Wee paintings.The works, which were selected based on the Museum’s collection strategy and their availability, were:Avenir, 2012: A skateboarder forms a band of people to perform a performance in front of a replica of the Eiffel Tower in Paris. The skateboarder is followed by the people in a scene from the 1955 film", "The next Biennial should be held at the Metropolitan Pavilion in New York. The 2020 edition will be staged at the Metropolitan Museum of Art in New York, and the 2019 event will be held at the Met's new venue, the Roosevelt Island Armory, in Long Island City, New York. The 2019 exhibition was curated by the same group of curators who won the 2019 Art Basel Detroit. The 2020 exhibition will be organized by the same group who will be responsible for the reimagining of the exhibition. The new space will be housed in an old Metropolitan Museum building, and will be inaugurated by an exhibition of work by the same group that will present the first installation of performance art and performance-based projects in New York in 2020.The 2019 exhibition was curated by Alexander Shainman, who was tapped to lead the 2020 edition of the Biennial by Gilbert & George; the 2020 edition will be jointly curated by Mandy St. Pierre, the former head of the New York Philharmonic, and Jessica Morgan, the director of the five-acre Collective Arts Centre in Manhattan; and the 2019 exhibition was organized by the same group that has staged the Biennial since 2010. The 2019 exhibition was inspired by the 1997 movie The Room, starring", "The next Biennial should be held in 2021. “The future of Tate Modern and modern art is at stake,” said museum director Maria Balshaw. “I’m sure that Jo had every intention of providing an inspiring and moving platform for the work of his colleagues, and of how the future of modern art might look and feel. But Jo’s decision is not acceptable. He has behaved in a way that breaches our values as a company and as a city. I believe that he no longer has any business at Tate.”Balshaw added: “The museum is deeply concerned by this situation, and we are considering all options in consultation with our board of directors. At this time of greatest need, when the museum is in need of an internal review and a new director is being appointed, it is our priority to ensure the long-term health of Tate Modern.”In a letter to the board dated April 3, Tate’s board chair Ian Hunter said: “The board unanimously decides that Jo has breached Tate’s internal values by facilitating the transfer of funds from the sale of works by artists who are no longer with us and who have made significant contributions to Tate. Tate", "The next Biennial should take place in November 2021. The exhibition will be hosted by the National Museum of Singapore and will be organized in collaboration with the National Gallery Singapore. Pace Contemporary Art Singapore has announced that it will be hosting a new five-day event, “Aeon Besarāb,” in December. The biennial is curated by the National Gallery Singapore’s Ann Vickery and is organized under the theme “Aeon Manifestations.” The fair will also feature a discussion group, a photography fair, and a performance/art event. Other upcoming events include the opening of the exhibition “The Future Is Not Present,” which will be on display until November 29, and the exhibition “Life Lessons from Art” on November 30.The inaugural event will be held at the National Gallery Singapore in Singapore from March 24 to March 28. Artforum readers have also been enjoying some of the exhibitions and programming that are currently on display at the museum. To see all of the artists featured in the exhibition, click here.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MCA) has appointed John McAllister as its next director and CEO. He succeeds Ger", "The next Biennial should focus on “Günther Förgenthal” (1944–1975), a group of four artists, including Hildegarde Duane, with whom Förgenthal collaborated on the art exhibition “Der Guten Deutschland” (1946–1948). The exhibition was also curated by the German curator Hans-Ulrich Ulrich and highlighted the exhibitionist escapism of the early Frankfurt Art Museum (BAM). “I’m dreaming of the BAM Art Museum as a model for the world,” said Förgenthal. The biennial is also planning to stage a retrospective of the work of artist Eisuke Honda in Tokyo in 2020 and the first museum dedicated to the artist’s body of work in the city,  China in 2021. Commenting on the future of the Kunsthalle Basel, Förgenthal said: “At this point in time, we are incredibly pleased with the outcome. The new Miniaturfabrik Berlin, the reopening of the Subarctic Space, and the renewal of the German Bourse with new exhibitions and tours. We are also looking forward to further strengthening our partnership", "The next Biennial should be held at the end of September 2020. “The Tel Aviv Biennial has once again revealed its ambition to be a more dynamic and memorable event. Its 2018 edition included a significant rethinking of its architecture, taking place in a new building, while simultaneously reflecting the city’s history. In order to facilitate this new vision, we have implemented new and innovative approaches, including new exhibitions, new programming, a new exhibition program, and a new selection of works.” \n\n\nThe Italian government approved the construction of a statue of Generalissimo Benito Mussolini in the capital city of Milan, marking the official start of a new three-year period of commemorative sculpture commemorating the dictator. The statue was commissioned by Culture Minister Dario Franceschini and was built in his honor in the town of Campo della Scala. It is dedicated to the dictator and will sit in the city’s historic Piazza San Marco square for eighty years.After the government approved the monument in December 2019, the city council of Milan signed an agreement with the Fondazione Milano di Sarto to begin the construction of a new monument in his honor. The process, which was accelerated by the town council", "The next Biennial should focus on “the ethology of the American Southeast,” the artist stated. “The art that takes place there should be an extension of the American Southeast.”\n\n\nThe Museum of Contemporary Art (MoCA)—a global leader in the collection and presentation of contemporary art—is planning to remove more than two hundred works from its holdings in the wake of the Covid-19 pandemic. The move follows the announcement of the museum’s long-term vision for its collection, which calls for “creating new platforms for the museum to connect with and engage with audiences across the world.”According to the Art Newspaper, the museum’s management team made the announcement at an art fair in Los Angeles yesterday. The news was made in advance of the institution’s March 23 debut of a new installation, “Theater of Operations: The Gulf Wars 1991–2011,” at the Whitney Museum of American Art. The work, which examines the aftermath of the first Gulf War and the subsequent expansion of the conflict into Syria, was inspired by the current conflict in the country.Commenting on the decision, Roberta Smith, the director of MoCA’s Department of Cur", "The next Biennial should be in the spring of 2021.Dr. Helen Wilson, director of the Art Institute of Chicago, acknowledged the challenges of securing the funding necessary for a major new museum in Chicago. She said: “At a time when it is increasingly difficult for cities and states to absorb and reuse art, and when art institutions are facing unprecedented challenges from climate change, we’re all looking for new models of community engagement and public engagement. . . . We are ready to engage with questions and solutions that weren’t previously considered, or neglected, and to engage with the art world’s most pressing social issues.”\n\n\nThe University of Rochester has received a significant donation of $3 million from the Guggenheim Foundation, which was established by philanthropists Frank and Ira Guggenheim in honor of Norman Foster’s life and work. The gift includes $600,000 for the museum’s construction and $600,000 for the restoration of its performance areas, which will be located in the basement of the former Rochester Institute of Technology (RIT) campus.In recognition of Foster’s contributions to education and the arts, the foundation will distribute $400,000 in support of the museum", "The next Biennial should be organized in 2021 to mark the centenary of the death of the German mathematician Karl-Heinrich Neuer, an Italian architect best known for his rediscovery of the metamorphosis of clay into steel, and his own participation in its construction, the organizers said.The exhibition, entitled “The Structure of Nature,” will be accompanied by more than 250 works by contemporary artists, including Renate Delaquaggia (Rome), Marc Casgrain (New York), and Ola Büyükstra Büyükstra (Berlin), which will be presented in the exhibition “The Structure of Modern Life,” and “The Structure of Morality,” which will explore the interconnectedness of art and politics. The Biennial will also introduce a new digital platform and a new exhibition, “The Art of Marketing,” which will showcase the work of thirty-eight artists. The show will run from March 16 through May 26.\n\n\nThe 2018–19 academic year is now in the books. With a little more than four weeks to go, more than 193,000 students in the United Kingdom have completed their degrees, marking a significant milestone for the country.", "The next Biennial should be held in 2021.\n\n\nThe Pushkin Museum of Fine Arts in Russia has added five new works by prolific contemporary artists to its collection, bringing the total number of works in the institution to thirty-eight. Designated a major work of contemporary art in 2016, the new twenty-four-by-eight-inch map of Moscow City, Moscow: RUBYO (2017) is a six- by-eight-inch work that travels through a maze of public spaces and dystopic urban environments in an attempt to reconstruct a cityscape in the artist’s studio. In a review of the work in the February 2018 issue of Artforum, Artforum editor-in-chief Barney Frank wrote: “In this land where art is considered a vice, it is hard not to be moved. And so is the artwork. The pair are as different as the two worlds: one an urban landscape, the other a cityscape in a studio. . . . The fact that they are both Russian makes this, to me, a surreal discovery.”The works, which were selected by a jury comprising Marina Laudel (the director of the Centre Pompidou in Paris), Oleksandr Zvyagint", "The next Biennial should involve a combination of short, medium, and long-term projects that address specific social and environmental issues in the United States and around the world. The theme should be “The Participatory Role of Cultures in the Evolution of Capitalism.”The 2020 theme is based on the basis of the idea that “cultures are not separate entities, but are interrelated and interconnecting networks,” says Tanya and Steven Schoonmaker, whose conceptual art project, “The Creative Economy,” premiered at the Miami Art Museum in 2011. “The role of artists and art-historians is to be the catalysts for the theorizing of the future.”\n\n\nThe Museum of Contemporary Art (MoCA), the Museum of Modern Art (MoMA), the Whitney Museum of American Art, the Metropolitan Museum of Art, and the Frieze Sculpture Garden in Los Angeles are among the many institutions that have announced plans to shutter their doors for the summer. According to Artnet, the culture-based nonprofit organization that represents the artists and institutions that make up the Museum of Contemporary Art, the Museum of Modern Art (MoMA), the Whitney Museum of American Art (MoMA), and the Frie", "The next Biennial should be in 2020. “The future of the Biennial is at stake,” said Panayiotou. “We need to ensure the future of the exhibition and of the unique exhibition of the Exhibition. Our work is not finished, and we are ready to continue in the many ways in which it can be.”\n\n\nArt historian and curator Charles C. Hochberg, who is best known in the art world for his pioneering work documenting working class life in the United States and Europe, died last month. Born in Chicago in 1931, Hochberg studied the history of art at the University of California, Berkeley, and then at the University of California, Los Angeles, in the 1970s. His oeuvre includes Beauty and the Beast: The Modern Art of Caterina Bickel, 1969–1975, with Tracey John Harris; Taken: The Art of the Emergency Room, 2001–2011, with Mark Bradford; for which he photographed fifteen emergency rooms, plus a community center and an assisted living facility; for which he collaborated with sixteen artists; and for which he created a book, A History of American Art, 1957–2011.Hochberg is survived by his daughter", "The next Biennial should focus on the evolution of the web and how it may be harnessed for social good through the use of technology and social media; and should include a discussion of the pros and cons of various technology solutions and technologies being deployed, including augmented reality, virtual reality, robotics, synthetic biology, and sustainable medicine. The fifth and final biennial will focus on art and activism, with a special tribute to the Black Lives Matter movement. The first and second biennials have already been held, and the fifth and the seventh will be held in the fall. The 2019 edition will be held at the MCH Group’s space in the city of Oulu, Finland, and will feature work by eighty artists, including Alison-Deidre Watkins, Jennifer Stoll, and Nari Ward. The 2019 theme, “Through Glass, Rely + Glass,” will reflect the themes of the exhibition, “Art and the Future of Digitality.”“It is my vision to raise awareness of the Art of Our Time and to engage with the digital world and its possibilities,” said Ella Puente, Director of the MCH Group and cofounder of the Ethical Culture Foundation. �", "The next Biennial should now be in the works, with a new title and a new format. The 2019 edition will take place at the Soudal-Invalides Gallery in Geneva, and will be hosted by artist María Berrada.The biennial’s theme,  “Unleashed Waves,” will be taken from William Gibson’s “Neuromancer” and will be explored through the works of thirteen artists: José Luis Báez, Ettore Bugnini, Jean-Michel Basquiat, Godfrey Brackens, Patricia Clemens, Hélio Ponty, and María César García. The show is organized by the São Paulo–based company Biennale Consultação Brasileira (BCB), and will be presented by curator and director Ana Paula de Castro.“The themes for this year’s edition of the Biennial are pivotal in the current situation. They are: the cycle of history, of the body and of the self, the catastrophic climate emergency, the new biennial that is emerging, the new ways of being, the current situation of the world, the world as it is, and", "The next Biennial should take place in the Fondazione Bicocca in Sicily in 2020. \n The Museum of Modern Art (MoMA) in New York has appointed Margot Mochizuki as its next director. She succeeds Adam Gopnik, who departed the institution in January 2019 to become the next director of the National Museum of Women in the Arts, and will assume her responsibilities in November 2020.“I’m honored to have been selected as the next director of MoMA,” Mochizuki said. “I’m eager to continue and further the institution’s journey as a cultural destination for contemporary art, and to expand the influence of contemporary art on the cultural landscape.”Gopnik, who helmed the museum during his tenure from 2001 to 2007, will continue to serve as director of the museum as well as as an adjunct faculty member. He will also continue to teach at the institution. “I’m excited to welcome to the museum again the extraordinary collection of contemporary art that the museum has produced over the past fifty years,” Gopnik said. “The future of MoMA is bright. I’m proud to be", "The next Biennial should take place in the city in 2021. The twenty-sixth will take place in Hong Kong. Crossing the Atlantic: Art, Politics, and the Sinking of the Cargill, 1912–1914 by Mark Halperin and Richard Mayhew. Stopped in Hong Kong: A True Story, 2019. Angels and Demons: The Art of the Electronic Age, 2019. Born in New York City, Halperin was born in Hong Kong, the son of two American parents. After graduating from Columbia University, he moved to New York where he studied at the School of the Art Institute of Chicago, where his parents also taught photography at the Art Institute, which also housed the New York photography school. Halperin moved to Hong Kong in the late 1970s and became a self-taught artist, producing works such as his work for the Garden Museum of the Arts, which opened in 1988, before the Art Institute closed and became the Art in the City Museum of New York. His work has been collected by the National Museum of American Art in Washington DC, the Metropolitan Museum of Art, the Smithsonian American Art Museum, and other institutions around the country. In 2018", "The next Biennial should take place in 2021. \n\n\nTania Bruguera, who has led the Italian government in Rome for nearly two decades, has resigned from her post after she was accused of promoting and protecting a group of wealthy textile magnates accused of fraudulently increasing their profits through high-speed auction sales. The accusations were made against Piero Duomo, the chairman of the Italian arm of the luxury goods group Tag Heuer, and Carlo Cipolloni, the former director of the Beit Triennale. Both men were arrested in Milan early this week and were being held in custody.According to the Corriere della Sera, a daily Italian newspaper, which carried the interview, Bruguera, who was invited to take part in a special exhibition at the Italian pavilion at the 2020 Venice Biennale, passed a letter to the organizers of the prestigious arts and culture event, which included the allegations that the event would be used as a stepping stone for the Duomo-controlled Beit Triennale to organize an exhibition about the events surrounding the May 15, 2020 explosion, which killed eighteen people and injured around fifty others, at Rome’s Campidoglio Stadium.The art world was", "The next Biennial should unveil its first project in the art of art, “The Vogue Paradox,” which has been shelved since 2011 in favor of a reworking of the exhibition, “The Vogue Collection,” which was first staged at the Barbican in London in 1979. The show will return to Paris, and the Biennale des Arts et Lettres, France, in 2021. Laurent Brissot, director of the Biennale d’Arles, said: “We are thrilled to be moving to Paris and to commence construction of the Biennale d’Arles. The renovation of the Barbican and the new events center will make the Biennale a reality. The project is not only about the theme of the year: it is about the architecture of places. The future of the Barbican is also part of the project.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the relocation of cultural artifacts in an effort to stem the spread of Covid-19. Under the direction of chief curator Mark de Gennaro, the agency will soon commission artists and other cultural workers to create resources for local, state", "The next Biennial should be held in 2021 and will be staged at the Los Angeles County Museum of Art (LACMA), the Museum of Contemporary Art Los Angeles, and the Santa Monica Museum of Art.\n\n\nJoseph and Lois Green of the Green family in Costa Mesa, California, have been awarded a $1.5 million MacArthur Fellowships for their contributions to the arts. The pair will receive $750,000, and the $1.5 million in funding will be divided between the Library and Museum of Contemporary Art (LACMA), the California Academy of Art, and the Museum of Fine Arts (MFA).“The Green family has been instrumental in the arts of their home city since the early 1960s,” said Los Angeles County Supervisor Mark Ridley. “They are particularly passionate about their local community arts, and the MacArthur Fellowships reflect that. Their engagement in LACMA and MFA provides a great opportunity for the region’s cultural and community leaders to learn from their family and gain exposure to the many talented artists and curators who have made the Green family’s world in recent decades. I am grateful for the opportunity to work with this remarkable family.”The family’s first"]