["The next Biennial should take place in the city next year. “The future of the Biennial is very important for me and the whole City of London,” Walker said. “I’m incredibly pleased that we’re finally making real progress with the development of the Biennial, and excited to see where it takes us next.”While the project of revamping the city’s art and architecture is well underway, the work of converting the Royal Festival Hall into an arts complex is in its infancy, and the city’s new Art Gallery has yet to open.\n\n\nThe Solomon R. Guggenheim Foundation and the Museum of Modern Art (MoMA) in New York announced today that they plan to collaborate to create an enhanced version of its twenty-fifth-anniversary celebration in 2021. The partnership is a collaboration between the foundation and the Museum of Modern Art to present an enhanced version of the Guggenheim’s “Vision of the Future: The Guggenheim’s Explore Our World,” which was held in the museum last March.The partnership will involve a redesign of the museum’s existing campus and building in a former factory building on", "The next Biennial should take place in 2021. \n\n\nThe National Gallery of Art in Washington, DC, has received a $10 million donation from the Charles and Lucille King Family Foundation. The gift was made in recognition of the organization’s long-standing support of the arts and its charitable work in supporting artists and their causes. The King Family Foundation first pledged $5 million for a commissioning committee to create a new portrait by artist Frank Isola in 1973, and has since provided $10 million for commissioning and art restoration.The donation comes on the heels of a $10 million gift from the King Family Foundation to the National Museum of Women in the Arts in Washington, DC, in 2018.\n\n\nThe El Museo del Barrio in Tijuana, Mexico, has received a major gift of $10 million from the Spanish family of Gürtel-Elizondo. The donation includes the building of the Museo del Barrio, which will be located in a former gold-miner\u0097known for its vast gold-mining complex\u0097in a city near the Mexican state of Sinaloa.The renovation project will also include the creation of an exhibition space for the cultural sector, the construction of an amphithe", "The next Biennial should be held in 2020.\n\nThe Australian Council of Film, Television and the Visual Arts (ACFVTA) has appointed Kate Hoberman director of the newly formed Institute for Contemporary Art (ICA) at the University of Technology, Sydney.Hoberman will take up the post on September 25. “I was inspired by the expertise, dedication and vision of the current ICA team, and the collective vision of these artists and innovators,” Hoberman said in a statement. “I am thrilled to be a part of their extraordinary history and to continue to drive forward the ICA’s vision of a new kind of arts institution\u0097a space for contemporary art and for the creative life of Sydney.”The inaugural ICA centennial will feature “Hari Kunz,” Catherine O’Grady, and Thomas Owens’s “Southern Reach,” which will be staged at the Museum of Contemporary Art, Sydney; the Museum of Contemporary Art, Melbourne; and the National Gallery of Australia. The five-month program will also include a presentation of a new work by Benoîtta Bénétié, which will be displayed", "The next Biennial should be in March 2021. The biennial will be held at the Museum of Modern Art in New York. MFA New York will have more information about the upcoming event on its website. The exhibition will introduce more than forty new works by artists such as Frank Gehry, David H. Koch, Mark Rothko, Pierre Galiani, and Jean-Luc Godard. The museum will also stage the biennial’s first three-hour film, The Other Cinema, which will examine the influence of cinema on the art of the twentieth century, and will present a curated group show of works by artists such as Richard Anuszkiewicz, Jean-Michel Basquiat, and Joan Miró.A full list of participating artists is as follows:Merry James Oliphant (Germany)Merry James Oliphant (Germany)Merry James Oliphant (Germany)Merry James Oliphant (Germany) Merry James Oliphant (Germany)Merry James Oliphant (Germany)Merry James Oliphant (Germany)Merry James Oliphant (Germany)Merry James Oliphant (Germany)Merry James Oliphant (Germany)Merry James Ol", "The next Biennial should take place in 2021. Former director Matthias G. Mueller, who has worked at the museum for nearly twenty years, told Die Zeit that the institution is currently planning to cancel the exhibition and not re-open the biennial in the first place.Mueller added: “I think that the decision to not reopen is a mistake. I think that the exhibition was a success. I think that we are in the process of rebuilding our gallery. I think that we have the space to do that. And I think that we will be able to. We will just have to wait for the right moment.” The exhibition, which featured work by some eighty artists from twenty-six countries, was curated by Wolfgang Paalen, who is also the director of the Lisson Gallery in Berlin, and Kunstmuseum Stuttgart, Germany. The first exhibition in the series, “Autobiography” (“autobiography”), was staged at the Fondazione Vino Reale in Milan in 2006, and in 2011, the year of the exhibition, the artist-run space BAM Biennale staged an exhibition of his work. In the past, the artist has", "The next Biennial should be held at a location that possesses an authentic and significant collection of the artist’s works; should highlight the development of elements of the artist’s art. Should also include an exploration of the artist’s life and work. “Contemporary art is alive with life and energy,” said Allan Kaplan, director of the San Francisco Museum of Modern Art. “The works of artists such as Hozier, Toguo, and Vico are interwoven with those of painterly and sculptural forms in a way that is very difficult, even impossible, in their respective settings. The future of art is inextricably linked to our own lives. We must create a world that is not only rich and inclusive but also many-sided and multidimensional.”\n\n\nThe Catalan city of Pamplona has suspended a planned celebration of the anniversaries of its two great cities, Granada and Barcelona, in protest of the country’s conservative government’s threat to impose austerity measures on the region. Governor Ramón Berrada announced that the two cities would be closed until March 13, which is the deadline for municipalities to start imposing austerity measures under Spain", "The next Biennial should take place at the city’s Fluxus Museum in the city of Perugia. “The history of the exhibition is really important for us and we have been working with the Fluxus museum to create a new exhibition that is at the forefront of the museum’s collection, history, and analysis,” said Fabio Solmi, director of the Metropolitan Museum of Art. Remarking on the museum’s recent exhibition, “Prescription Addiction: The Gallery as a Problem,” which will run for six weeks, Solmi said that the exhibition “uses the exhibition as the moment of a new kind of art, art that challenges the limits of the gallery.”The forthcoming exhibition, which will be curated by João Pires, will highlight the work of João Eduardo Pérez, whose career spans from the 1970s to the present. Pérez, who has been the subject of numerous exhibitions at the Venice Biennale, is known for his critically acclaimed, often experimental, and often dissolves the storytelling in a physical sense. “The Tomorrow Museum’s exhibition ‘The Present,’ will reflect the", "The next Biennial should be held in 2022. In the meantime, the museum will continue its work to present an exhibition of the works of the greatest contemporary artists in the United States, as well as its ongoing work to present a collection of works by artists who are at the forefront of American art.”\n\n\nThe Metropolitan Museum of Art (MoMA) has received a donation of approximately $2.5 million from philanthropists Frank Gehry and Edsel Pereira. The foundation received the funds for the museum’s redesigned Grand Central Station, which is scheduled to open in 2022, and its new Punta de Light sculpture park in the Bronx.“The new Punta de Light sculptures are a step in the evolution of art in New York, and in the transformation of a space that has been a vibrant gathering place for artists and communities,” said David Samson, M.I.A., director. “We are thrilled to present these works, and to present the 2018 Louvre triennial, in collaboration with the artists, at an unprecedented location.”The donation also includes two new works by Andrea Bocelli, “Paparazzi,” which will be on view in the museum’", "The next Biennial should be held in 2020. \n\n\nGalleries and artists are now urging the European Union to do more to prevent the deportation of artworks, designed to celebrate the diversity of its communities, in a move that would disproportionately affect marginalized artists. The European Commission has until now only considered the permanent restitution of works in mass grave contexts. Now, according to the Art Newspaper, artworks in collections at the National Museum of Modern Art in Prague, the Museum of Contemporary Art in Vienna, and the Königstein Museum in Vienna, which houses the Austrian artist Carl Oestner’s monumental Betrayal of the Body, will be eligible for EU relief funds for immediate protection, which are set to begin rolling out across the 28-nation bloc’s member states in December.If the Commission does not act, the artworks will be returned to the countries where they were confiscated, and the artworks will be eligible for a two-year reparation period, during which time the artworks will be eligible for a 90-day period of restorative justice. The 76,000-piece body of Art and Architecture Ara Noguchi, a 1975 Rubex-designed house in the Hungarian village of Vyšť, was", "The next Biennial should be on the island of New Zealand, which will be hosted by the British Museum in London, in 2022. The shadier air travel links between the two cities have been made worse by Brexit, which sees the city move to the UK’s capital and is threatening to push through a hard Brexit.“The question is, will it be on our doorstep, in our city, or will it be on international television?” Hsu said. “The future of a cultural exchange partnership between Kunst and the UK is at stake. We must act now.”In response, the museum said: “We are deeply concerned by the Royal British Museum’s recent statement on the possible repatriation of artworks and objects. We understand that the Royal Academy of Arts and the National Galleries of Scotland are investigating this issue with the Museum, and we remain committed to working with the Royal Academy of Arts and the National Galleries of Scotland and the Scottish National Film Institute to further explore the best possible approach to dealing with objects in storage in order to ensure that items can be safely returned to Taiwan.”The museum has also been accused of asking the Kunst to open a new museum in Beijing, but the institution", "The next Biennial should collaborate with local, regional, and international artists to produce a work of contemporary art in the city of Chicago, and present exhibitions that reflect the unprecedented global reach of the City of Chicago, its organizations, and its artists. The next Biennial should begin in 2020. The next Biennial’s curators will be Chiara Bassi and Massimo Zingaretti, who will be based in Chicago; Juliette Zola, who will be based in Italy; and Lisa Woodward, who will be based in New York. “Homegrown: Art and the City of Chicago’s Struggle” will open at the Chicago Art Museum on Tuesday, September 8. The 2018 edition, titled “Homegrown: Art and the City of Chicago’s Struggle,” was organized by the Chicago-based, independent curator, author, and educator, Michael Mallin, and featured work by eighty-two artists, ranging in age from twenty-eight to seventy-six years old, to raise awareness of the challenges and opportunities faced by artists working in the cultural sector. The exhibition, which was hosted at the McNamara Art Museum, featured work by seventy-five artists, including Jorge Luis", "The next Biennial should have a legislative agenda that reflects the principles of transparency and accessibility; should address the conditions that underlie the economic and political crisis in Puerto Rico; and should be the first of its kind in the US.”\n\n\nFamous Artists and Activists and Institutions Citing Climate Change as a Factor in Their Exhibitions Sophia Bush Gallery, London: As climate change worsens, climate activists are organizing to pressure the British government to take urgent action. In a June 28 letter signed by more than eighty artists, art-lovers, and cultural workers, the group Artists for Climate Action (A4C) urged the government to issue an urgent statement affirming the urgent need for urgent cuts to carbon pollution.The letter reads: “We, the signatories of this statement, believe that the only appropriate and adequate response is to reduce emissions in all their forms, including carbon pollution, and to scale them back as far as possible. The only way to prevent the dangerous warming of the Earth and to meet its rising temperatures is to reduce the amount of carbon in the atmosphere. This can be done without adversely affecting the patterns of weather, plants and animals, or humans and other species. This is possible only", "The next Biennial should be held in 2021. “The reasons why people are moving to Europe are being looked at by German and international galleries,” said Joachim Haag, the chief of the state of North Rhine-Westphalia.  [Update: August 27, 10:00 AM] This article was updated on August 27 to include a statement from the Berlin Biennial.\n\n\nThe museum of the contemporary art in the Netherlands, which has been shuttered since March due to the coronavirus, has released the list of galleries participating in its 2019 edition, “Unseen: Postwar,” which will run from March 12 to March 16. The exhibition was co-organized by the Nederland Museum of Art (Nautijksmuseum) and the National Museum of Contemporary Art (Nominen). Among the galleries that will be represented at the exhibition are a number of recent works, including work by Dutch artist Elke Bode, who was included in the “Top of the Sea” exhibition in 2015, and work by artists such as Rineke Dijkstra, Yvonne Fong, and Martin Sejong. The retrospective will feature work by a selection of contemporary artists", "The next Biennial should feature a selection of works by contemporary artists whose multidisciplinary practice is grounded in a real-life experience. The themes of the exhibition may include history, culture, language, history, politics, and experiment with art. Guided by the biennial's director, Evaristo Zingaretti, the Biennial of the People will take place at Giardino Stampa, located in the heart of the city, between September 5 and September 8.“The project is part of an ongoing project to create new spaces for the exhibition of contemporary art in the city of Milan. The exhibition will be preceded by a series of presentations, led by a select group of contemporary artists, of works by the same artists without the exhibition. The series will be devoted to the work of women artists, artist-tourists, and the history of gender as well as the history of the gender dialogue,” said Milan–based artist Luca Carol, who is working on a piece for the show.João de Castro, who curated the inaugural exhibition in 2007 and is currently the founder of the London-based contemporary art firm MCA Contemporary, said: “I am delighted to announce that the biennial will return to Milan in 2020", "The next Biennial should take place in the United States, and the first in California. “The biennial will focus on how the museum and the public can make a real difference in the lives of marginalized communities,” said Elizabeth Bennett, cofounder and director of the biennial. “It will also include a reflection on the exhibition and how it can be a vehicle for the exchange of ideas and ideas on the exhibition can alter our community in many ways.”The theme for this year’s edition of “Talk about it: J. Paul Getty Ruins Our World” was drawn from a 2007 lecture given by the late British architect K.C. Johnson, Jr., who advocated for the demolition of the American flag and the reinstallation of a constitutional monarchy. Johnson’s talk was followed by the campaign to take down the British flag, which was spearheaded by groups such as the English Defense League, the National Union of Students’ Union, and Students’ Union UK, and led to hundreds taking down their flags and organizing protests. The campaign also led to the reinstallation of a controversial law that would have given the British government the power to remove a flag from a building in London, and led to a", "The next Biennial should take place in the spring of 2021, with the first exhibition being “The Way of Tongues: An Anthropological Approach to Synthesis.”The Biennial is long-term. The institution currently has a space on the ground floor of its new headquarters at 25 West Twenty-Second Street in Manhattan, which launched in February 2019. The new venue will host the inaugural exhibition, which will be curated by Sanjeev Gupta, director of the Brooklyn Museum, in March. The institution’s original location in the heart of Manhattan has been relocated and is currently being renovated. The new space will host an exhibition of paintings in May 2020. Gupta’s first show in the new space will be “The Art of Children,” which will explore the concept of childhood through a combination of photographs and videos. The exhibition will also take place in the basement of the museum, where it will be accessible by wheelchair-accessible visitors only.  The institution’s current exhibition space, which was designed by the London-based firm Blackch, opened in Croxteth-on-Hudson in 1988. Several years later, the museum acquired the land where the premises now stand, and the first", "The next Biennial should be held in the autumn of 2020. The Art, Safety, and Survival (SASS), which will be held at the Art Institute of Chicago, will be three years long and will be curated by Susanne Vaisman, Peter C. Malander, and Pierre-Étienne André.The 2019 prize—which honors work that addresses both contemporary art and philosophy—will be presented at a prize ceremony at the Art Institute of Chicago on August 23. The winner will be announced in November 2020.The 2019 prize jury—John Berridge, an artist; Craig Hudgins, a curator; and André LeRoy Hoffmann, an educator—said: “We are thrilled to announce that the 2019 prize jury has selected the winning work of the biennial, ‘Yours,” as the winner of the 2019 Prize, following an open call on May 23 and a grand opening ceremony at the Art Institute of Chicago on May 29. The work will be exhibited in the upcoming exhibition “Vision of a Life: Art and Philosophy” at the Art Institute of Chicago.The work is based on a concept explored in the essay “Islam, Philosophy, and the Body” by Georg Lukretius of the", "The next Biennial should be held at the São Paulo State University in September 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, California, has received a gift of more than 2,500 photographs by Pierre-Auguste Renoir, a famed French painter whose work is currently on display in the museum’s Renoir Place. Made of wood and canvas, the works were donated by an anonymous donor in the early 1990s and were discovered in the basement of the institution who recognized the value of the works in the collection.\n\n\nThe Shondaland Museum in Birmingham, United Kingdom, has appointed Laura Codrea as its new director. Codrea joins the institution from the Museums Association (MAS), where she became the first African to head the museum. She succeeds Jane Feltman, who has served in the role since 1993, and will take up the post on March 17.“Laura Codrea’s leadership at the Shondaland Museum is a reflection of her passion and commitment to our mission to make the Shondaland Museum a truly international destination, with an international team of curators and experts, through her vision and expertise,” said MAS director, Ann Taylor. “As", "The next Biennial should be hosted on the campus of the Jewish Museum in Jerusalem and will be held in 2019.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it expects to open in the summer of 2022. The institution, which is currently undergoing a $450 million expansion, is also working to ship more than one hundred works to the United States by the spring of 2020.The MCA is currently working to assemble a new collection, which will include works by artists such as Minimalism, Cézanne, and Vermeer. A new exhibition hall and a new venue for a special exhibition, “The Art of the Impossible,” will open in the spring of 2020. In addition, it is planning to open a new rural space in the city of Santa Monica and is preparing for the construction of an eight-thousand-square-foot, museum-quality building in the same town, in a former auto body shop.The revitalized museum, which has more than doubled its size since it opened in 1958, is currently constructing a new campus in an industrial neighborhood of Los Angeles, which will boast an artist-in-residence hall, a library, a conservation lab, a gallery, and two pav", "The next Biennial should conclude in the spring of 2020, as scheduled. The ten-year cycle will continue with a new exhibition every ten years until the end of the century.The biennial will organize a selection of works by artists from the full collection. The first exhibition will open in, and run through, the summer of 2020. The second will open in the fall of 2020.  The exhibition’s 2019 iteration featured work by ten artists whose work is currently on display in the Biennial\u0097Fatima Ismailow, Haus Sana, Alex Katz, Daniel Mendez, Michael Martinez, and Saara Konnabu. \n\n\nA group of artists, researchers, academics, and other arts professionals from the United Kingdom are petitioning the government to establish an independent, international center dedicated to the study of ancient Greek and Roman sculpture. The artists, who are calling for a museum dedicated to the art form, have written to London Mayor Sadiq Kahn, urging him to establish an organization devoted to the study of the art in the capital. The letter, dated April 30, reads: “We write to you in the hope that you will consider the significant contribution made by the City of London to the art of our times and", "The next Biennial should take place in January 2020 and will present a series of exhibitions that will include works by female artists and look at issues of gender and gender stereotypes. Sponsors of the biennial include the Art Foundation, the Berggruen Museum, the Fondazione Prada, the ABC Design Museum, the ABC Art Museum, the Berggruen Museum of Art, the Bodega di Beppo, the Bultringer Museum, the Birkenstock Museum, the Forum, the Galleria Nazionale d'Italia, the Galleria Nazionale d'Italia, and Los Angeles County Museum of Art.\n\n\nA group of artists, designers, and thinkers are urging the German government to establish a national memorial for the tens of thousands of people who died in the Holocaust. “Germany’s Federal Association of the Arts (BDA),” which represents seventy-one German states, announced on Tuesday that it supports a new memorial, which would recognize the “tragic legacy of the Holocaust,” but would not set a date for construction.The BDA’s president, Sabine Keiteler, said that the organization considered the question of a memorial to the �", "The next Biennial should take place in 2020. The event will include a selection of contemporary art from Africa, the Middle East, and South America. The exhibition will also include a conceptual dialogue between the artist and the artist’s colleagues. The show will be centered around a project by the artist and her colleagues, a sculpture by the artist, and a performance by the artist.“I wanted to bring art from Africa to the United States to engage with our collective lives and our history,” the artist wrote in a statement about the show. “I hope that this exhibition will inspire others to be inspired by the African spirit and our shared history.”The Biennial will be held at the Los Angeles County Museum of Art (LACMA). The institution had originally planned to hold the Biennial in October, but the exhibition was pushed back to March 2020 and the date to October 21 was eventually dropped. The show will also be moved to LAX, which will host the exhibition in March 2021.\n\n\nThe Museum of Fine Arts (MA) in Boston has awarded a $5 million contract to a Rhode Island–based artist, who is known for creating works that utilize social media to address social ills. Tanya de Sousa", "The next Biennial should be held in 2020.\n\n\nHannah Wilke, the chair of the Museum of Modern Art in New York, announced today that she plans to resign in March 2020 to focus on a new institution, the Brooklyn Museum, and its reopening in March 2021. The announcement follows the announcement that Wilke will step down from the board of trustees of the Museum of Modern Art, where she has served as chair since 1995, and will take place at the end of November.During her tenure, Wilke has organized more than sixty exhibitions, including “Ariel James-Cohen: A Life at the Museum” (2017), “The Best of Friends” (2017), “Jane and Jane and Jane’s Art” (2017), and “Black Women and the Modern Life” (2016). She also helped organize “Mumford and Sons” (2018), “The Gender Bender” (2019), and “The Female Body in Art” (2019) and curated exhibitions that included the show “Carol of Sharon,” “Suey Merritt: Drawing,” and “Girl and Girl, 1957” (2017).", "The next Biennial should focus on the history of the exhibition and its installation, which is an ideal time to re-imagine the exhibition and its installation as a collective project. “The new exhibition should be centered on the work of the selected artists, which should be reflected in the installation,” Miriam Balsom, director of the Biennial, told the Art Newspaper. Balsom said that the exhibition will take place in the same space that the original exhibition will be held. The move will allow the biennial to retain its original modernist design while simultaneously expanding the exhibition’s reach. �We are thrilled to have this opportunity to create a new exhibition at the Biennial for our twenty-seven artists,” said Van Hees.\n\n\nA panel of curators and historians has awarded the National Endowment for the Arts (NEA) $69 million, the largest grant given to the arts in its forty-year history, to assist with the final stages of the CREATE NYC art fair, which runs from March 16 to March 20.The grant comes amid a nationwide shortage of funds as the NEA struggles to maintain funding for its arts programming, which has been disrupted by Covid-19 and has", "The next Biennial should take place in 2022.\n\n\nThe Australian Council of the Arts (ACTA), the Australian Science Museum, and the Art Gallery of New South Wales (AGSCW) have announced that the next edition of the 13th Venice Biennale will take place at the city of Venice from March 25 to March 31, 2021. The exhibition will coincide with the Venice Architecture Biennale, which will be held in May 2022.The second edition of the Venice Architecture Biennale, titled “The Future of Architecture,” will be held at the Museum of Modern Art (MoMA) in New York from March 21 to March 25, 2021. The exhibition will reveal a virtual reality experience that will be inspired by the 1893 World Exhibition in Paris and will feature works by forty-seven artists.“The Venice Architecture Biennale’s virtual reality experience will bring together artists from twenty-six countries and twenty-one continents,” said Fabio Cicutto, director of the ACTA. “The series of VR experiences will be inspired by the essays of the Venice Architecture Biennale: ‘Making of Modern Life’ with David Romero and Federico Cattelan, ’What is Architecture", "The next Biennial should be on the history of women’s liberation in Iran. The exhibition will include interviews with leading figures of the feminist movement, including Cécile B. Agnes, Mira Haroon, Aisha Harris, and Shilpa Gupta; and a selection of works by women artists, including Tanya Bonakdar, Alexander Corrigan, Barbara Bach, and Mary Beard.“The biennial will also reflect the tremendous achievements of women artists in recent years,” said Basma Dinami, director of the museum. “We invite our audiences to experience the diversity of Iranian women artists through a unique set of works by these artists, and we hope that they will become inspired by the work of other female artists.”The exhibition, which is supported in part by the European Union, will take place in the museum’s newly expanded and expanded museum, which is currently being renovated by the Swiss architect Christian Henneberg and the French architect Bénédicte Savoy, and will be accompanied by a special exhibition, “Theater of Operations,” which will include an analysis of the Iranian revolution and the 1979 Islamic Revolution.\n\n\nThe Museum of Fine Arts (MFA)", "The next Biennial should take place in the summer of 2020, at an alternate date, as the festival is currently scheduled to run from May to September 2020. The new date will allow the biennial to focus on the biennial’s collection, logistics, and programming, and will also enable the exhibition of the first works by the collection as well as the first exhibition of works by the collection’s artists. The new festival will be hosted by the same venue as the biennial, and it will take place in the same hall.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that it has received a $50,000 grant from the National Lottery Heritage Fund in support of the development of its exhibition “The Lottery Years: Bringing England and the World Together” and its Sargent-Rudyard Show, the first of its kind, which will run in the capital of England from April to September 2020. The announcement marks the first time an international art institution has received a grant in support of its work.The show will depict the life and death of the British artist John Chamberlain, and will include works by seventy-nine artists, including David Hockney, Mark Rylance, Thomas Paul Klee", "The next Biennial should begin with a monograph, by Gerald Seib, entitled Revolution: Re-Examining the Gospels,” which will be published by the University of Chicago Press in the spring of 2020. In the meantime, the Biennial’s website has stayed up, and tours of the house have been offered in both English and Spanish. The inaugural event will take place at a location to be announced. “The new Biennial is an extension and continuation of the old, a glimpse into the future,” said Mary Boucher, the chair of the museum’s board of trustees. “The central idea of the show is that the imagination is the essence of art.”The theme of the show was 'Art in a Time of Crisis: An Evening with John Sperand, ” which was presented by Boucher last week at the close of the first edition of the biennial. The artist and filmmaker discussed his new film, The Amazing Spiderman, which he shot entirely in his apartment in Manhattan in the late spring of 2019 and premiered at the Museum of Modern Art this fall. Boucher told the Art Newspaper that he wanted to show the city", "The next Biennial should be held in the capital city of the Republic of Moldova. Hilary and I look forward to this year’s exhibition and to working with the artists whose work was featured in the first exhibition. As a global community, we are all at a turning point in our history. We must meet these challenges head on and reach out to our cities and villages to help them and our communities take forward these challenges in a meaningful and creative way.”\n\n\nThe Barbican Art Gallery in London has announced that it will reopen in the city on October 6. The institution, which has been run by the Barbican since 1997, is currently closed due to Covid-19, and is currently working on a new reopening plan. The museum will also introduce new public spaces, such as galleries, restaurants, and shops, to accommodate an additional 1.5 million visitors expected to visit the city during the exhibition’s run. The opening of the Barbican is part of a global campaign by galleries and museums to embrace Black Lives Matter by raising funds for Black Lives Matter.The campaign was launched after the British parliament adopted a sweeping anti-terror bill in June 2019, which also removes the threat of terrorism from the list of", "The next Biennial should focus on the life and work of artist Zora Neale (1903–1975) and will focus on Neale’s sculpture, which explores the concept of time and its relation to the world. An open-air exhibition will also be staged, with the exhibition opening on October 22. The 2018 edition of the Biennial, “The Life and Work of Zora Neale”, curated by Zora Neale, opened at the Museum of Modern Art, New York, on October 19. The exhibition, which also featured works by artists such as Amiri Baraka and Udo Kittel, was supported by a $50,000 grant from the Zora Neale Foundation. \n\n\nThe National Gay and Lesbian Taskforce (GGT) has released the results of its first year of operations in London. Its mission is to promote LGBT rights through workplace action and advocacy and to act as a resource for employers. According to a press release, the organization disbands when it “doesn’t demonstrate the capacity to change workplace environments in a meaningful way.”GGT was founded by two former campaigners, London Assembly Member Caroline Pidgeon-Goldsmith and London-based artist Charlotte Prodger", "The next Biennial should be held at the Metropolitan Museum of Art, New York. The next edition should be held at the Museum of Modern Art, New York; the Museum of Contemporary Art, Tokyo; and the Museum of Contemporary Art, New York (MCA). “The next iteration of the Biennial is an ambitious undertaking, yet with an immense amount of work ahead,” said Paul Mpagi Sepuya and Peter Mpagi Sepuya, the curators behind the 2020 iteration of the event. The next edition, which will take place at the MCA in September 2022, will feature new works from thirty-eight artists, and will be centered around the theme of “Emergence.” The 2019 edition, which was co-organized by David Scharf and Alessandra Solari, was also inspired by the work of Simone Leigh and David Adjay. It was hosted by the San Francisco Museum of Modern Art and the Los Angeles County Museum of Art. The 2019 edition, “The Designing Life” (1958), was presented by Nargis Sculpture Center and the San Francisco Museum of Art.\n\n\nThe Centre Pompidou in Paris has announced that the twenty-second", "The next Biennial should take place in 2021. Thanks to the work of our talented team, we hope to bring you a new exhibition, a new program, and a new collection of works that is inspired by a true visionary, with a vision to reshape the understanding of art and society. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it plans to raise $3.5 million for the museum in 2012. The funds will go toward the construction of the 110,000-square-foot Museum of Contemporary Art (MoCA) in the city, which was completed in 2002 and opened to the public in 2009. The museum was also the setting for the cult-classic 1987 film The Untitled Untitled Experiment, a film loosely based on John Cage’s poem The Untitled Strings of Deborah.Museum board president Michael Govan said that the funds will be used to help the institution’s expansion into a 300,000-square-foot building that will include a research library, an auditorium, and a café. Construction is scheduled to start in 2021 and will be completed by 2026.The announcement marks the museum’s first expansion in over thirty years. In 2004, the museum", "The next Biennial should be held in the spring of 2021.\n\nThe San Francisco Museum of Modern Art (SFMoMA) is planning to move its artwork from its current location in the Mission District to a new location in the city’s Financial District, which will also include a new museum complex and a new park. The news comes on the heels of a huge $1.4 billion renovation and expansion of the museum, which was completed in 2017 and aims to make it even more inviting and accessible for visitors.The building that houses the museum, which is currently home to works by contemporary and popular artists such as Eric Nylund, Peter Klee, Mark di Suvero, Peggy Siff, and Margaret Sull, will also undergo a $500 million expansion. The project is part of the city’s $1.2 trillion transportation plan, which aims to make San Francisco more accessible to car travel and lessen the city’s dependence on public transit. SFMoMA’s existing exhibition hall will be converted into a ground-floor retail complex, and the museum’s courtyard will be transformed into an artist’s studio. The renovation and expansion, which is also being funded by the city and the SFM", "The next Biennial should focus on the histories of the two countries through the lens of their films: the American exhibition, which will be dedicated to the work of Lincoln, will focus on the racial and cultural divide in the United States, while the Biennial for Spain will focus on the history of the region\u0097and its art. \n\n\nThe National Museum of Fine Arts (NMA) in Washington, DC, has appointed John Saunders as its next executive director. He succeeds Mark Donahoe, who departed the institution in December 2019 to become director of the Metropolitan Museum of Art, and will assume his responsibilities on March 8.“After a thorough search of the leadership team, we are confident that John will be an excellent fit for the NMA,” said NMA director Elizabeth Anne Haynes. “We look forward to working with him as we embark on a new artistic, educational, and curatorial focus.”Saunders comes to the NMA from the Metropolitan Museum of Art, where he has served as executive director since 2013. He was the first director to lead the museum since the institution’s founding in 1889. During his tenure, he oversaw the creation of its contemporary art program, oversaw the museum’s expansion", "The next Biennial should be held in the autumn of 2021, with a view to a September 2022 edition.\n\n\nThe B.I.G. Foundation announced today that it will receive $1 million from the sale of works by thirty-seven artists in the B.I.G. Arts and Culture Collection. The six works in the collection are a tribute to the late artist’s works, which were commissioned by the artist himself and were on display in the exhibition “The B.I.G. Foundation is Not a Museum.” Judith Fox, the founder of the foundation, said: “The B.I.G. Foundation is an independent organization based in Brooklyn, New York, and is funded by the artist’s estate. It is a tribute to the artist that he chose to dedicate his final decade of his life to preserving his legacy, and I’m delighted that the work is now in the hands of the B.I.G. Foundation.”The works, which are currently housed at the group’s headquarters in Philadelphia, were auctioned by the B.I.G. Foundation, which is run by the artists themselves, at an event at the B.I.G. headquarters", "The next Biennial should establish a strong and dedicated platform for the study and dissemination of the humanities at the university and should enhance the university’s international reputation and prepare for the biennial 2020. The institution will also aim to create a website and an app that will allow students to exchange their photos with a digital version of the photo exhibition.\n\n\nThe sculpture of a naked woman by Diego Rivera in the center of a courtyard at the Villa Borghese in São Paulo, Brazil, was installed by artist Dario de Castro, who passed away in the city of São Paulo, on August 4, 2018. The work, titled No More Crickets, which is based on the story of a young Chilean immigrant and his family, is part of the artist’s ongoing project to address the fate of Latin American women, including his wife, the artist-in-residence and collaborator João Varejão, and their three daughters.“To them I offer my deepest thanks for believing in me and honoring my artistic life so far, for being true to my convictions, for having courageously resisted all my obstacles and for remaining true to myself,” wrote Rivera in a statement. “I am forever grateful to all who has", "The next Biennial should begin early next week in order to allow the exhibition designers and artists the time and space to re-invent their concepts in the Biennial. The exhibition should debut as an installation in the biennial, as an enthusiastic opening party for the biennial should coincide with the opening of the exhibition.“We are delighted to collaborate with the relevant quarters, to collaborate with the artists and with the curators of the Biennial,” said Fernando de Meo. “The exhibition is one of the great achievements of the Biennial and we are eager to see what this year’s edition will bring.”The inaugural exhibition “Between the Sun and the Moon” will open on December 15 in the Biennial’s new exhibition space, the Bienal de A and culminate in an exhibition of eighty works by forty artists. The show will also include the first exhibition of work by Solveig Haus, a recent Costa Rican immigrant, and Miki Kelsey, a British-born, Miami-based artist whose practice spans sculpture, installation, performance, performance-making, photojournalism, documentary work, installation, photography, video, painting, sculpture, sculpture, and design.The fifth edition", "The next Biennial should be held in 2021. The 2019 event, titled “The Last Rites of the Body,” drew an audience of 1.5 million people. The 2019 event, titled “The Life and Death of the Soul,” drew an audience of 1.5 million people. The biennial was originally supposed to be held in the city of Puebla, in northern New Mexico, but was moved to Las Cruces, in the state of New Mexico, when the city of Puebla could not be rescheduled. The 2020 event will take place in Mexico City.\n\n\nThe Oxford Downtown Art Museum (OOTM) in Oxford, England, has announced that it will hold a new exhibition, “Away from the Watch,” in June. The exhibition, which will be curated by Nadja Rauh and will feature work by twenty-four artists, is part of the museum’s “post-post-modernism.”Rauh has previously curated “Action,” an exhibition of photographs by Albert H. Winograd, which opened at the museum in 2007, and “The Situationist Group,” a retrospective of paintings by Claude", "The next Biennial should coincide with the opening of the new Centre d’Art Contemporain (CAC) in Paris, which will host a new exhibition of works by a select group of contemporary artists in September. The first show, “The Collaborators,” will be curated by the artist Petra Hildenbrand, a curator at the Kunsthalle Basel in Switzerland; the second, “Modern Masters,” will be organized by Todd Haynes, an artist and curatorial director at the Museo Nacional de Arte Contemporáneo in Mexico City; and the third, “Perfection,” will be curated by artist Vesa Heger.\n\n\nThe Vienna-based nonprofit organization Artspace Vienna (VIA) has received a gift of eighty works of art from the collection of Catharina Pfeifer. The gifts are a compilation of works dating back to 1892, including works by artist Büchner Knebel, a Czech artist of the same name; three works by Mahler and the late architect Hans Frank; and several works by the late Soviet sculptor Andriy Behn and the museum’s collection of photographs.The organization also revealed", "The next Biennial should be held in 2022.\n\n\n\n\n\nJavier Barba, the secretary general of the International Confederation of Dance, Theater and Media (ICSTAM), has revealed that the institution will begin the process of removing all fifty-six of its members from its board of directors, which has been chaired by Antonio Quattrone, after the organization’s next board meeting on December 15. The newly appointed members—all current board members—are: Antonio Anselmo, Luis Alberto Brevetti, Juliana Cervetto, Ana-Maria Cuiò, and Nina Cuiò.“ICSTAM is very disappointed that after spending years and years developing the exhibition platform: the international dance, theater, and media space, DanceLondon, among the most widely watched events, the board of directors has decided to discontinue it,” said Javier Barba, president and CEO of the International Confederation of Dance, Theater, and Media (ICSTAM). “This decision is not only a disappointment for the artists who have supported the organization, but for the millions of people who have attended its events and watched its productions. It is also a serious setback for the", "The next Biennial should open in June 2020 and will be hosted by the city of Buffalo.\n\n\nThe Museum of Fine Arts (MFA) in Boston has welcomed Guggenheim Foundation curators David K. Ward and Julia L. Evans to its staff and board. In addition to their roles at the museum, the pair have served as fellows and mentors for the museum.“We are incredibly proud of their contributions to the MFA,” said board chairman and CEO Jeffrey Klein. “In the coming months, they will work closely with curator and director Daniel H. Weiss to cultivate a new generation of MFA artists, and we look forward to their contributions to MFA’s mission.”Ward and Evans will be featured in the museum’s May 20–May 22, 2020 edition, “Oddfellows,” which will feature work by twenty-one artists, and will collaborate with the museum on a series of installations in the museum’s largest building, the MFA’s Solomon R. Guggenheim in September 2020.\n\n\nThe CNEB Museum of Art in New York has appointed John Archibald as its next chairman. He succeeds David C. Haemings", "The next Biennial should begin as soon as possible, as the institution anticipates an extended closure. Ellen White, the curator and director of the Berkeley Art Museum, California, told the San Francisco Chronicle that the biennial’s opening would be postponed until the institution could re-open: “The full schedule is still being worked out. It’s still a work in progress. It’s still a full year away,” she said. The museum is currently closed to the public as it works to repair damage caused by a massive fires that broke out in the building, which is used as a headquarters for the California branch of the National Association of Arts, on January 4, 2022.The institution received a gift of a major work by artist Joan Miró from Los Angeles County in 1995. The gift included work titled I Do, and She Do, and the artist’s reply to the gift was included in the exhibition “My Work or Yours: Joan Miró’s Close Encounters,” which opened at the museum in 2015.  The work, a collage from a painting of a woman with a child, depicts the artist holding a child through the flames. Mir", "The next Biennial should be held on July 24–July 28, 2019.\n\n\n\n\n\n\nGeorge E. Talbot (1906–1968), a British poet, playwright, and playwright-director, was a prolific bisexual creator whose work explores gender, sexuality, and the variousnesses of life.Born in London in March 1906, Talbot received his undergraduate degree in 1920 from the University of Cambridge and later went on to study at the University of Sussex where he earned his master of fine arts degree in 1926. He went on to write plays, two novels, and more than thirty-one films, and his work is as widely regarded as that of Orwell or Cox or of Beatrix Jameson.Speaking at the London Book Fair in May 2019, Talbot said: “My modern conception of beauty is as a continuum which ranges from the most refined and refinedly attractive to the most disturbing and most disturbing. It is a beautiful truth, really, that every kind of beauty is, in some sense or other, a sickness. The sickness is the grosser the better, the sickness the more intense the pain, and the sick the more complex the life.” He continued: “Beauty is sometimes sin, sometimes beauty is virtue", "The next Biennial should be held in a decade. The international advisory board of the museum, comprising architects Peter Zumthor, Pradeep Shah, and Madan Mohanti, will host an open call for proposals in October 2020.\n\n\nA group of artists and collectives in the United States are suing the Trump administration to prevent the construction of a border wall along the U.S.-Mexico border. They claim that the wall will be in violation of the Artists’ and Collectives’ Civil Rights Act, which was passed in 1968 to prevent racial discrimination in federal contracts and prohibits the construction of work in violation of the First Amendment’s guarantee of freedom of speech.If the case is approved, the individuals will be awarded damages ranging from $12 million to $160 million and could also face fines. Federal judges in Los Angeles and San Francisco have already ruled in favor of the plaintiffs, which is why the lawsuit was filed on Tuesday in federal court in Riverside, California.“The case involves artists and collectives, many of whom came to the United States from Mexico in recent years, and their ability to enter the country and remain in the country,” attorney Jennifer Teets, who represents the plaintiffs, told Artnet. �", "The next Biennial should be uploaded by the end of November and will focus on “The Song of Life and Death.”\n\n\nThe Dancers were invited to stage a tribute to one of their many artists, former dancer and composer Nari Ward. Ward’s filmography includes Heroes, 2002, 2004, 2008, and 2012, for which she served as artistic director; Body of Evidence, 2015, for which she composed and sang the song; and, the 2000, for which she composed and performed a duet with Peter Gabriel. Ward has also written for the BBC, the New York Times, and the New Yorker, among other media outlets.“I’ve known Nari Ward since I was a teenager, and I’ve always admired her, admired her power as a dancer, her ability to express a queer perspective on the world, her feminist and queer sensibility,” Russell Tovey, the British director of the biennial and an alumnus, wrote in an email to the Dancers. “Her music is an absolute must-have for any biennial. It is one of the few pieces that has truly captured her spirit and I", "The next Biennial should be held in 2021. The exhibition would be the first by the city of Madrid since 2010. The theme would be “Culture and the City,” and the exhibition would be centered around the theme of the year: the city of Madrid.The Spanish city, which has made a strong push to grow its public art collection, has announced that it plans to spend around $11 million to create a new exhibition focused on culture in the city. The new biennial would be held in the city’s CASTA Design Museum and would be organized as a “house show,” according to the Art Newspaper. The new exhibition would be “a mix of architecture, design, history, theatre, and other forms of art.” The artists who will represent Spain at the upcoming exhibition include María Berrí, Hélio Rodríguez, Lisette Villaverde, Clara Rojas, and Ishizuka Nakamura. \n\nAdvertisement - Continue Reading Below\n\nThe Free Library of Philadelphia announced today that it plans to rehire Nancy Christiano, who served as the library’s artistic director during the 2007–2009 adolescent and", "The next Biennial should be held in 2020.Submitted by the Kansikanajima Archaeological Museum in Nagoya, Japan, and supported by the Association of Japanese Archaeological Research (AJR), ArtsJapan, and the Aichi Foundation for Contemporary Art (AFCCA), AKB48 was named the next recipient of the Heart of Tokyo Award. The honor is given annually to an organization’s proposal for a major exhibition. The application for this year’s iteration of the award, which was organized by the A.G.A.S. Foundation, was submitted by Shinichiro Fujii, the founder of M.E.N.E. (Mass Effect Enlarge Art Encounter), and Miho Yamada, a curator and art historian based in Tokyo. The theme of the 2020 award was “Anthropocene Politics,” and its exhibition will open in January 2021.\n\n\nAmerican painter Richard Anuszkiewicz has died at the age of eighty-three. According to the New York Times, the artist was found hanged in his apartment in New York City on May 7. He was a founding member of the New York–based collective the Alamo Arts and was one", "The next Biennial should form part of a larger, a decade-long celebration of East-West co-operation and cooperation between artists, historians, researchers, artists, academics, researchers, artists, researchers, artists, artists, artists, researchers, artists, historians, artists, historians, artists, researchers, artists, students, students, artists, scholars, artists, historians. “East-West cooperation is the foundation of modern art and the cultural heritage of East and West,” Emperor Akihito said at the ceremony, which was attended by hundreds of people. The memorial will be situated at the intersection of Tokaido Station and Akita Station in Tokyo, the city of the capital of Japan, and will take up the theme Isekai, or Shanghai, from the manga series 寒末川格正 (Forbidden to Blame) by Shuka Muneo. The inaugural exhibition, titled “Isekai - Seven Stories,” will offer visitors a glimpse into the creative process of the artists who participated in the exhibition, which honors their contributions to East-West relations. “We are looking forward to working with the artists who participated in this exhibition and to seeing the result", "The next Biennial should take place in 2019, and the 2019 edition will be staged at the Museum of Contemporary Art (MoCA), Los Angeles. The 2019 edition will also include a new exhibition of work by artists such as Andrew Hessel, Adrian Piper, and Robert Irwin.In an email sent to Penguin in December 2018, Kate Rinaldi, chair of the commissioning committee, wrote: “We know the upcoming edition at MoCA is a strong step forward in delivering on the promise of the Biennial, and we are confident that the new and updated exhibition will only further compliment the themes and the work of our 2015 exhibition.” The full list of participating artists is as follows:Artists who have represented the United States in the Venice Biennale since the exhibition began in 1981 are:Andrea CatellaArtistic Director, Rina CatellaBibi BajicBibi Bajic-NoorDeana/Shirley AlbaniCameron BrownArtistic Director, Rina CatellaBibi BajicBibi Bajic-NoorDesiree ChristinaeCatherine C. AndersonBibi Bajic/NoorDesiree ChristinaeBibi Bajic (", "The next Biennial should now be ready in the spring of 2021.<|endoftext|>On Monday, February 16, 2017, the New York City Department of Cultural Affairs (DCLA) announced that it has issued fines totaling $10,000 to twenty-five museums and has suspended the annual awards, which celebrate cultural heritage in the city, for a period of ninety days, for a total of twenty-five institutions.The City Council unanimously passed a bill in March that made it harder for cultural institutions to avoid paying taxes and gave New York state lawmakers the power to suspend or even revoke a budget by popular vote. The suspension of the arts awards is part of a statewide strategy that has been in place since Governor Andrew Cuomo took office in January 2019 to make the state more financially transparent. Under his leadership, the state has invested nearly $1 trillion into the economy, helped spur the expansion of the economy with $286 billion in tax credits, and cut taxes for the middle class and for businesses. “The State is currently committing to help small businesses and families through the reopening of the Federally Funded Community Reinvestment Banks (F.P.B.),” Cuomo said in a statement. “I am committed to ensuring that these critical tax credits are", "The next Biennial should be held in the summer of 2022. “The future of the exhibition is at stake,” said Michael Caulkins, Director of the University of Wuhan and a member of the project team. “The exhibition will serve as a powerful platform for the exhibition’s inaugural season, including a selection of works by emerging and established artists of the Philippines as well as a selection of works from the continental region.”The inaugural edition of the Biennial was held in September 2017. The biennial was organized as a collaboration between the Wuhan Museum of Art and the University of Wuhan. The exhibition was a collaboration between three Wuhan-based artists—Lina Erasmus, Anwar Omar, and Joseph Mateo—with the support of the Wuhan Museum of Art.\n\n\nA new public sculpture by Dutch artist Wim de Kooning, whose way-station-adjacent sculptures are often based around a single concept, has been toppled by a giant construction crane in Amsterdam. De Kooning’s new work, Prospect, was installed today (August 23) on the roof of the city’s Museum of Modern Art (MoMA) not long", "The next Biennial should be in 2021, according to the organizers. They are also working on developing a National Platform to Promote Indigenous Art and have presented several exhibitions, including a 30,000-work exhibition in Miami Beach in 2016. The program will launch with the release of the biennial’s first book, Indigenous Art: A National History, and will continue to be curated by artists.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has launched an initiative that will allow artists and cultural workers in the city more time to relocate to other states after the country enacted a sweeping budget emergency on March 23. The five-month extension, which also extended the deadline for city-backed layoffs and furloughed workers, has led to a temporary loss of revenue for the city’s cultural organizations and has forced several cuts in funding.The first phase of the program, which will focus on artists with children, will launch in the fall of 2020. Phase two will focus on the arts and culture of younger workers. Phase three will focus on the arts and culture of adults. Phase four will focus on the arts and culture of workers with disabilities. Phase five will focus on the arts and culture of workers in urban settings. The program", "The next Biennial should be held in 2020 and be organized as a biennial for all of mankind. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Felicia Cornejo as its new deputy director and chief curator. Cornejo comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as director of the “Cultural Center of Southern California,” which is housed in an expanded and expanded structure and includes a theater, a library, and a café.“I’m delighted to welcome Felicia to LACMA and to work with the team to develop a long-term strategy for the Cultural Center of Southern California,” said director Matthew Teitelbaum. “I’m looking forward to working with Felicia and seeing what we can accomplish as we continue to add exciting exhibitions and programming to the museum.”The institution recently completed a major renovation and expansion project that added new galleries, galleries, a theater, a restaurant, and the Los Angeles County Museum of Art (LACMA). A full list of the donors for the project can be found on the museum’s website. The renovation enabled MoCA to create", "The next Biennial should be held in March 2021.  NADA’s board chair, Christa McAuliffe, said that the next edition of the conference will include “more than 300 exhibits that feature work by artists and scholars from around the world.”\n\n\nThe Executive Office of Art and Design (EAD) in New York City has announced that it plans to spend $1.5 million to remove a fourteen-foot-tall bronze sculpture of a naked woman by sculptor Frank Gehry that has stood in the lobby of the Museum of Modern Art (MoMA) in New York City since 2009.The effigy was installed in February 2013 and was dedicated to the “Human Rights Campaign,” a nonprofit that advocates for human rights legislation that was started by artist Nari Ward in 2009. The group commissioned Gehry to create the work, titled “Human Rights,” in response to the 2009 NATO Summit in Warsaw.“The EAD is committed to supporting artists who have made important contributions to museums and to ensuring that museums serve as catalysts for social change. We will work with MoMA in partnership with the Museum’s board of trustees to ensure that this sculpture serves as an important reminder of the achievements", "The next Biennial should be completed by 2021. “The Biennial is not an event, but a process,” said Bjornal Bjerggaard, the chair of the Copenhagen Biennial and the curator of the Dusseldorf showpiece, “a flag with which to carry the rest of our lives.” After a five-year construction, the installation will open to the public at the United Kingdom’s Royal Festival Hall on March 5.The Biennial will consist of more than fifty archival materials, including sixty-five drawings and two paintings, and will be presented by artists from the Danish contemporary art scene. The first exhibition will focus on the Danish artist Lars-Erik Larsen, who was selected for his artwork “Amber Stream,” 1992–93. A selection of his work will later be presented at the Copenhagen Biennial.The second exhibition will be on the life and work of the revolutionary French painter Pierre-Auguste Renoir, who lived and worked in Paris from 1882 to 1889. The biennial will feature paintings by twenty-six artists from thirty-two countries. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed", "The next Biennial should be held at the Museum of the African Diaspora (MoAD) in Atlanta in 2021, and—more importantly—it should be a “plantation,” said Merritt Bensch, president of the museum. “The theme should be: ‘exchange, transformation, resistance, and resilience.” The 2020 edition, titled ‘Art of the Presence,’ will be held at the new David K. Guggenheim Museum in New York and will begin on March 28. The 2019 edition, titled “The Art of Silence,” will be held at the Whitney Museum of American Art in New York and will run until October 28.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has created two new positions within the curatorial team of the Contemporary Art Encyclopedia. Mary Suella Sikes and Jennifer Stone have now been promoted to full-time positions and will begin their new roles in October. The positions have been created through a two-year grant program, “The Bytes for the Future,” which was established by the David and Lucille Stiegler Foundation, the philanthropists who founded the foundation in 2007. “", "The next Biennial should take place in 2019. The biennial, which will be held in conjunction with the Venice Architecture Biennale, will be followed by a redesign that will include a new, contemporary building.\n\n\nThe Patagonia Foundation, the Patagonia Art Museum, and the Patagonia Foundation Art Museum are all teaming up to produce an exhibition of work by the late Italian painter and sculptor Paolo Vermeil\u0097a collaboration with the Patagonia Foundation in the Lusitania region of northern Chile\u0097in conjunction with the upcoming forty-fifth edition of the Bechdel Art and Architecture Biennial.The exhibition, titled “Vermeil/Marchesu: Art, Architecture, and the Unseen,” will feature four works by the artist and will be curated by Peregrine Dall'Orsay, the executive director of the Patagonia Foundation. The works will be unveiled on June 30 at the Patagonia Foundation in Basel and will be on display in the museum until October 31.The exhibition will include work by Vermeil’s contemporary collaborator, a.k.a. Joseph Lecocke, and will be held at the Patagon", "The next Biennial should take place in 2021. The biennial will be hosted at the Museo de Arte Contemporáneo, Madrid; Universitat de Granada; and the Santiago de los Andes. It will also appear in a digital edition of the exhibition. Branchi, an Italian curator who has worked in exhibitions, film, video, fine art, and the media, and Talmore, an American curator who has served in various capacities in the Italian arts, are the cofounders of BaselArt, which was established in Italy in 1968. The institution has previously staged the artworks of Alejandro Campanella, Gerhard Richter, Howard Ristow, and David Salle.\n\n\nThe New York–based nonprofit Artadia has received a gift of more than one hundred works by fifty artists who are currently incarcerated across the United States. The gift includes artworks by artists serving time for nonviolent crimes, including Felipe Alarcon, Sargent Armstrong, Aneel Ambani, and Gregory Chase, among others whose releases were delayed due to concerns regarding their safety.The organization also received a gift of twenty-one works by artists whose releases were finalized earlier this year. The works, which", "The next Biennial should be held in 2022. \nOver the last twenty years, the museum has staged more than three hundred exhibitions. It opened to the public in 2001 and has since added new exhibitions and public activities. The biennial will mark the twentieth anniversary of the museum, which is in the process of transforming its building, which is currently being renovated, into an artist residence.The redevelopment of the museum is part of a larger plan to improve the city’s heritage and will involve the addition of more than one thousand square feet of gallery space, the remodelling of the existing exhibition spaces and the creation of a new museum. The project is being spearheaded by architect Kiyoko Nara, who previously served as the founding director of the Tokyo Design Museum (UDIM) as well as as the director of the Yamanashi-monji Museum in Nagoya and the Yagokucho Museum of Contemporary Art. The reimagined building will also include an exhibition pavilion, a library, a bookstore and a shop, and the restoration of the surrounding public spaces.\n\n\nThe British Council has released the list of forty-four artists who are represented in the 2019 Guildhall Biennale, which will take place at the National Portrait", "The next Biennial should focus on enlarging the collection and the exhibition, which is currently housed in the museum’s Radcliffe Gallery, in London; developing a new exhibition program; and extending the life of the museum.\n\n\nThe New York–based artist L.A. Reid, the founder of the Los Angeles–based nonprofit the L.A. Center for the Arts (LACMA), has been nominated for a Pulitzer Prize for literature. The award, which was established in 2009 by the Pulitzer Center on Arts and the Pulitzer Board, was established to support the center’s work in advancing the organizing and dissemination of American literature.The Los Angeles Times reports that the nomination was made by a group of writers, including Jeffrey Gibson, Tarek Atoui, and Sarah Sze. The Los Angeles Daily News reports that the Pulitzer Council, which comprises fifty-three writers, selected the nominees for the award, which are chosen by a group of judges. “As a group, we had great admiration for the courage and tenacity of the nominees,” said Pulitzer Center director Michael W. J. Marangano. “Their stories and work demonstrate that LACMA is a fearless and creative voice in the art world.", "The next Biennial should be held at the Museu de Arte de Barcelona, the Universitat Politécnica in Barcelona, and the Barcelona Art Museum. The twenty-second, which will take place in the city of Araguz, will be the third in Spain. The thirteenth, which will mark the seventh anniversary of the establishment of the Catalan National Museum, will take place at the museum, the city of Barcelona, and the Botanical Garden in Barcelona. The exhibition will also feature artworks by the artists whose work is currently on display.\n\n\nThe Museum of Contemporary Art (MoCA), New York, is planning to begin inviting visitors back to the institution in 2021 following a $3 billion expansion, becoming the latest major US cultural institution to commit to the long-term care of its permanent collection. The institution first unveiled the plans in December 2019, and in April 2020, after months of negotiations between MoCA CEO John H. Katz and the board of trustees, the institution announced that it would begin allowing visitors back to the museum.“The next five years are critical to ensuring that MoCA’s collection and exhibitions will always be accessible and compelling to audiences in New York City,” Katz said in a statement.", "The next Biennial should take place in 2021 and will be the first in New York since the city’s 2011 Festival of Lights. The event will also mark the 150th anniversary of the Brooklyn Museum. The event will be hosted by the architect Jean-Michel Basquiat in conjunction with the Brooklyn Academy of Arts. SOUTHLAND Biennial\n\nUnity College, Manchester, England, and Southland Art Gallery, Los Angeles, announced today that they have been awarded a grant of $2.25 million in support of the construction and renovation of their new home in the former Southbank Building that will soon house the MFA Manchester and Southbank Art Gallery. The grant will be divided between the two institutions.The grantees are Arts Council England (ACE), which will provide the funds to build the new complex, and CAA, the Southbank Foundation, which will provide the expertise and strategic direction in designing and constructing the new museum. The building—which will be financed with funds from the Charles and Lucille King Trust—is being designed by Jody Rogac Architects and will be inaugurated by a public reception at the new space in the spring of 2020. The museum will boast a contemporary design and incorporate a", "The next Biennial should open in October 2019 and will take three weeks to produce two-hundred works. The program will be hosted at the Düsseldorf Academy of Arts, and will be curated by Hans-Peter Bech. The show will also include a performance by the German artist Wolfgang Üstek and a symposium with the artist Helmut Steiner.\n\n\nThe National Poetry Library in London has announced its representation of the work of Leon Black, a prolific American poet and explorer of American poetry and literature history, his own poetry, and the American poetic tradition. A scholar of American poetry and literature history, Black will argue that the history of poetry is a history of poetry. The exhibition will also introduce readers to the work of the late American poet Dan Barker and his family, and will mark the centenary of the institution’s founding.“For more than three decades, Leon Black has been a dedicated artist and scholar, championing the work of his own family and collecting seminal manuscripts as a way to expose the ephemeral nature of American poetry,” said curator Paul Mpagi Sepuya and director Christopher Le Brun. “The work of his own family is a source of inspiration, a way of", "The next Biennial should be staged in 2020 and will be organized by the Museum of Modern Art in New York. The programme will feature work by eighty-eight artists, and will cover such themes as materiality, philosophy, language, and the environment. The 2022 iteration of the event will mark the centenary of the birth of theoretical physicist Max Planck, and will be led by theoretical physicist Arne Glimcher. The exhibition will feature works by fifty-eight artists, and will run for twelve weeks.\n\n\nThe Royal Academy of Arts (RAF) in London has appointed Peter Faurschou as its next director. Faurschou, who most recently served as the director of the Center for European Art at the University of London, will assume his post in January 2021. He succeeds Michael Rowland, who led the academy for almost ten years, and will begin his new role on January 29, 2021. Faurschou joins the academy from the University of Warwick, where he has served as interim director since August 2019. He succeeds Richard Kits, who retired in February 2019 following a six-year tenure.“In his new role, Peter will play a pivotal role in shaping the future direction of the RA", "The next Biennial should take place at least ten years after the completion of the current exhibition, and will focus on the legacy of the artist in the form of a collection of his works. Curated by artist Marina Asamu, the exhibition will also include a discussion with the artist, as well as a selection of his drawings and paintings, and will aim to develop a new understanding of the artist’s legacy.“I was inspired by the work of São Paulo de Almeida, João Goulão, and the curator Yoko Noguchi, who are some of the most important figures in my career,” Young said in a statement. “The new exhibition will introduce a new and important point of view to this exhibition, by showing a collection of his paintings. This exhibition is not only about my work, but also about the way that art and design are made, about the way that artists work, and about the ways in which we design.”The biennial will be hosted by the Instituto de Arte Modernas (IAM), in partnership with the Biennales Contemporáneos (BCS), the Metropolitan Museum of Art, and the Museu de Arte de São", "The next Biennial should take place in 2022. \n\n\nA group of local residents in Rochdale, England, are demanding a full-scale investigation into the deaths of at least eighty people, many of them suspected to have died in industrial accidents, in an industrial accident which also occurred at the site of a factory, as reported by the Independent, and which was being constructed by the same company which built the site of the former Tate Modern.The residents, which were appointed by the Rochdale and West Norwood Area Council (WON) and include Vicky Waldman, a mother of eleven who suffered a cardiac arrest while having a sleepover at the home of her partner of fifteen years, and whose thirteen-year-old son died days later; Catherine Kathrada, a mother of six who was taken ill in her home when she was just sixteen; and Michael McMahon, a father of three who was visiting his wife and their two young sons in the local park on Sunday, May 24, 2017.All of the deaths occurred within a two-mile radius of the site of the accident, which occurred on May 4, 2017 and involved the same company, which was already responsible for the site-specific safeguards that were required", "The next Biennial should take place at the Museum of Contemporary Art Hamburg, which is currently on the construction stage. The theme of the exhibition will be “Amerika bis zur Art des Schädel,” the name of the first exhibition, which was organized in 1967. The exhibition was held at the Museum of Modern Art in New York from January 17 to January 24, 2008.\n\n\nThe Museum of Contemporary Art (MoCA), the New York institution that celebrates the artistic and intellectual legacy of the American avant-garde, is planning to shutter its fourteenth-floor space in the building where it has been located since 1986. The move will result in a $250 million reduction in revenue for the museum, which has long been an important cultural gathering place for New Yorkers.“We are very much looking forward to welcoming visitors to the new home,” said museum director Christopher Landgraf. “MoCA has been a thorn in the side of the arts and culture community as it moved toward becoming a major force in New York City, supporting artists and daring to play with the limits of the institution’s mission.”In a statement, the institution said: “The current exhibition, ‘Avant", "The next Biennial should take place in the spring of 2022.The next edition of the Metropolitan Museum of Art was officially canceled last year when the steampunk-themed exhibition was slated to open on September 8. Its next iteration would have been held in the fall of 2020. Since the championship is currently projected to cost $42 million, organizers are working with an auction house to raise the funds for the event. The Met, which is working with a consortium of institutions, is also planning to create a new space for the exhibition and a new studio for the exhibition, which is slated to run until January 21, 2021. The museum will hold an open house next week.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Stephanie Zahn as its next director and CEO. After a four-year tenure as interim leader, Zahn will assume her responsibilities on March 14. During her tenure, she has brought the museum’s total number of directors to twelve—from five before the pandemic began.“Stephanie Zahn is one of the most respected, trusted, and admired professionals in America, and we are excited to have her on our team,” said Helen E. Feinberg, president and CEO of", "The next Biennial should take place in May 2020. The 2020 edition, titled “Fallen Fruit,” will be hosted at the Museum of Contemporary Art Chicago in May. The 2019 edition, titled “Biennial: Death of a Dream,” was also set to open at the museum in May. The 2019 edition, titled “Theorem: Logic in Theory,” was one of four seminars organized by the artist during his years at the institution.The museum has yet to make a decision about whether the 2019 edition will be reopening next year, but it is preparing for a possible interruption by canceling the event. The Art Newspaper reports that the museum anticipates the loss of up to $8 million in revenue as a result of the postponement, which would be a major blow to the museum’s endowment.  \n\n\nThe exhibition “Hollywood Handbook”, a presentation of biographical sketches by the late screen actor and director Peter Sellars, has been withdrawn from its November 29 launch in Los Angeles. The show was scheduled to begin at the Los Angeles County Museum of Art (LACMA) in November and run through March.After a public outcry, the", "The next Biennial should open in the United States in 2020. The remaining ten years of the project’s three-year cycle will be devoted to the development of the series. The biennial will be held in the city where the artist-built works of his life are currently on view. The sculpture and installation will also be included in a major exhibition at the Museum of Modern Art in Philadelphia next month.\n\n\nThe Baltimore Museum of Art (BMA) has released the list of fifty artists who will participate in the first phase of the Baltimore Architecture Biennial, which will run from March 21 to March 23, 2020. The biennial is funded by a $2 million grant from the Maryland Foundation for the Arts (MFA) through an award that is available to artists who are living at least twenty-five years and have three thousand or more photographs in their collections. This phase, which has a budget of $250,000, will focus on the history of architecture from the artist’s point of view. The biennial will be held in the city’s Inner Harbor from March 21 to March 23, 2020.“I’ve been a biennial supporter since", "The next Biennial should be held at a venue that will provide a new and engaging setting for the exhibition, in addition to the exhibition, between October 20 and October 21, 2020. The exhibition will be open to the public once a week, and there will be no additional programming beyond the usual events.The theme for this year’s event will be “Ethics in Advertising,” a transition from transforming the way people think about advertising to how people interact with it. The biennial will focus on the role of media and the exhibition in a changing world. It will include new programs and a re-imagining of the exhibition, which will be a mix of historical and contemporary artworks, with works by artists from Bulgaria, France, Italy, Romania, Turkey, and the United States. The full list of participating artists is as follows:Anton Kern (Germany)\n\nKasper Aarhus (Norway)\n\nLionel Bochereau (France)\n\nKai Dezen (New Zealand)\n\nBudapest (Hungary)\n\nDaisuke Abe (Japan)\n\nDeborah Andrews (Australia)\n\nManfred Andre (Canada)\n\nMarianne Bich", "The next Biennial should take place in 2021, and the starting date has yet to be announced.\n\n\nThe Metropolitan Museum of Art (the museum) has appointed Steven M. Goldfarb as its next director. Goldfarb joins the museum from the New Museum, where he has served as interim director since September 2019. He is currently on sabbatical, and will assume his post in January 2021.“Steven’s appointment is a great honor and I’m excited about his future at the Met,” said director Christopher Campbell. “I’m grateful for his leadership and the museum’s extraordinary history, and I look forward to working with him.”Goldfarb, who was appointed to the position in March, became director of the museum in September 2019, after former director Timothy Rub is named interim director. During his tenure at the museum, Goldfarb oversaw a $50 million renovation and expansion project, as well as the reopening of its new wing of the museum in 2019. He also renewed the institution’s contract with the Detroit Institute of Arts (DIA), which runs the institution’s largest renovation project, the Art of the Party.“Steven’s stewards", "The next Biennial should be held in 2021, said Harald Szeemann, director of the Institute for Contemporary Art in Munich, and he added that the next one should focus on “mainstream artists from the 1970s and 1980s.” The conference has been under consideration for more than fifty years.\n\n\nThe museum is planning to make substantial repairs to its grounds, including the loss of more than 1,500 works by the artists whose works were exhibited at the museum in the 1970s and 1980s, and is considering removing several hundred works from its collection. In light of recent attacks on art, the institution announced on Wednesday that it will postpone the upcoming exhibition “Crossing the Atlantic: American Art and the Art of Resistance” and will invite the artists to the institution for a solo show in the fall.“The work of American artists is interwoven with the history of our country, their relationships with other nations and with the European Union,” said museum director Wolfgang Läther. “The work of artists across the world is a living and breathing part of America’s heritage. We have to try to create an exhibition that will reflect this.”The works that will be highlighted in the first", "The next Biennial should mark the centenary of the outbreak of World War I, with a programme that will examine and reconstruct the origins of the largest outbreak of the virus ever. “Imbeciles are always at work,” Alexander said. “They note, comment on, and reflect on how the world works. We’re not there yet, but we’re making real in the most direct and direct-to-nature way.”\n\n\nThe Italian architect and multidisciplinary artist Toccarlo Rondin has won the third edition of the Guggenheim’s “Rebekah toot up,” a series of artist-designed public artworks that are set to open in Brooklyn on October 25. The work, which was inspired by the Italian Italian designer Dolores Atassi, was created as part of the Guggenheim’s New Directions for Architecture, which was established in 1969.In the exhibition, which is titled “Rebekah toot up” and was curated by Michele Cerciello, Rondin, who is also known as Rebekah, will work with the artist to re-create the iconic Harlem-born designer", "The next Biennial should open in September 2020. The biennial will consist of three distinct themes: “Introduction, ‘Social Solidarity, and “Introduction/Exposition”. The theme of the fourth biennial will be “Creative Life of a Distinct World.”\n\n\nThe Museum of Modern Art (MoMA) in New York has hired Stefan Fatsis, who previously served as an assistant curator at the institution for more than five years, as its next chief curator and director. Fatsis will take the helm from Richard Armstrong, who retired in December 2018 after six years at the museum.Fatsis comes to MoMA from the Museum of Contemporary Art (MoCA) in Chicago, where he has served as director of exhibitions since 2018. During his tenure at the institution, he developed the museum’s new twelve-month Contemporary Contemporary Art of the Americas series, “The Centennial,” which runs through November; added more than 700 works by seventy-four artists and collectors; and organized the museum’s first-ever general assembly, “Unfinished Business” (2017), which drew more than 1,500 artists and collectors and focused on the exhibition of work by", "The next Biennial should aim to introduce major works from the collection, and drawn primarily from the US, and should begin as soon as possible. The museum is also planning to open a new six-thousand-square-foot, six-thousand-seat biennial dedicated to early modernist photographs in the fall of 2020, and is currently prototyping a new exper­iential art project for the museum.The institution, which is currently closed because of Covid-19, has faced numerous setbacks in its quest to recover its collection and re-create a replica of the museum, which will be housed in the former Astley-Perrotin Building, since 2018. The project is estimated to cost $100 million.\n\n\nNew York–based artist and activist Gloria Steinem, a fierce advocate for women’s rights who also championed environmental justice and championed art as a vehicle for social change, has died at age eighty-three. Steinem was born Gloria Ann Steinem in 1936 in New York City, where her father worked as a director of the Metropolitan Museum of Art and as a manager at the Bronx Museum of the Arts. She began her artmaking and activism years after she left the home she and her sister had been raised in to", "The next Biennial should be held in the spring of 2021.\n\n\nThe Metropolitan Museum of Art in New York has hired Rebecca Watson as its next curator of nineteenth-century American art. Watson comes to the institution from the Brooklyn-based nonprofit the New Museum, which she helmed from 2011 to 2016. She succeeds Nancy Koons, who departed the museum in May for a stint at the Bronx Museum of the Arts, and will begin her position in January 2022.“Following a successful career as a government and nonprofit arts and culture specialist, Rebecca is poised to further expand and strengthen our increasingly vibrant collection with new and exciting works,” said museum director Daniel H. Weiss. “It is a singular experience to work with such an extraordinary collection at a museum. We look forward to her leading such a remarkable collection into the future and to the Met’s next chapter.”Watson began her museum career in 1985 at the Bronx Museum of the Arts with Tad Cosgrove’s Randy Newman show, which explored the relationships between humans and nature through the work of fifty artists, including Jack Kirby, Ray Eames, Frank Gehry, and Robert Irwin. She has also worked at the Brooklyn Museum, the Museum of", "The next Biennial should take place in the spring of 2020, in recognition of the centenary of the outbreak of World War I. \n\nAccording to the Art Newspaper: \n\n\"The eminent jurist Hans B.A. Korsgaard, president of the Academy of Arts, has written to the City of Helsinki on behalf of the international curators who have requested that the import of works by the late artist Olof Palme in the exhibition “Helsinki at Latvija” be canceled. “I consider it a personal duty to urge you to act in a way that respects the rights of cultural personalities and for that reason am not willing to accept the decision of the late artist Olof Palme.”The letter is signed by Anders K. Kristiansson, Johanna Lakkari, and Hans and Mira Kristiansson, the owners of a photography gallery in New York; Arthur and Aline König, the owners of a publishing house in Denmark; and Sara C. Newman, the founder of the Museum of Contemporary Art in Philadelphia.Over the last decade, Palme, a German-born, Brooklyn-based artist known for her installations and sculptures", "The next Biennial should take place in 2021 and should be hosted at the Museum of Contemporary Art, Atlanta. \n\nThe British Museum in New York has announced that Hayley Cather, the first woman to serve as the chair of its board of trustees, will be the next chair of the organization. “At the conclusion of the 2015 season, Hayley Cather was named the Museum’s honorary chair,” director Kenneth Althaus stated in a statement. “Her ability to engage the widest range of perspectives and to imagine, experiment, and experiment with ways to make art not just accessible but transformational was a central tenet of the upcoming Museum’s 2015/16 campaign.” After a yearlong celebration, the museum opened ‎Levi’s Gallery on West Twenty-Third Street on January 6, 2016. “I’m eager to play my part in continuing Hayley’s legacy,” said Cather. “I’m committed to working with my fellow trustees and staff in an open and transparent way, and to finding ways to extend the impact and creativity of the Museum’", "The next Biennial should take place in Frankfurt in March 2022 and will host it on September 28th, 2022. In the meantime, the biennial will work with conceptual artists such as Yinka Shonibare, who visited the museum in March 2019, to explore the role of the body in the collection, and will present the first public exhibition of work by artists such as Richard Anuszkiewicz, Günther Fiedler, and Marcin Wojtas, as well as a series of experiential experiences that draw from the museum’s collection. The biennial will also contribute to the ongoing work of the institution to promote the body and its interrelationships through the exhibition of Yoshitomo Nara’s first solo exhibition there in March 2020. \n\n\nJulia Brewer, granddaughter of John and Wilfred Brewer, has won the $10,000 Lifetime Achievement Award for Beauty and Design. The star-studded, multi-ethnic ensemble, which was formed in 1967 by Brewer, his wife, and their three daughters, all of whom are artists in their own right, won the honor last month at the 2018 Cannes Film Festival. Named after the late American designer and producer", "The next Biennial should be in July 2020.\n\n\nThe Kurdish city of Kobani, which is currently struggling to contain the spread of the coronavirus, has deployed seven thousand Kurdish soldiers to the Iraqi city of Kirkuk to protect the region’s cultural sites and has deployed up to one hundred additional Kurdish militiamen to support the Kurdish Peshmerga forces, the United States’s largest armed force in northern Iraq, The Washington Post reports. Kirkuk, which has been under an ISIS siege for over a year, has deployed as many as 30,000 Peshmerga troops and cultural workers, including artists, to bolster its defenses in preparation for a long-term strategy of civil war.Despite the city’s best efforts to contain the virus, which is spread mainly from person to person and can cause respiratory illnesses, the number of people infected with the virus has more than quadrupled in the last four months. According to the New York Times, more than 59,000 people have been infected in the region—compared to around 3,000 cases nationwide during the height of the conflict in 2015—and fourteen states have reported cases. The coronavirus has also spread to Japan, Korea, Malaysia, Thailand, Pakistan, Afghanistan", "The next Biennial should be held in 2021. The physical museum will not be closed for another ten years, but will be temporarily closed in order to receive the necessary support for its renovation, which will start in 2021 and will be completed in 2024.The Biennial will now be organized into twelve iterations, with the first event, entitled “Kumalo,” taking place in 2019 and the thirty-eighth in 2020. The series will be organized around the themes of “Purity of Life” and “Art as a Tool for Healing,” as well as the biennial’s theme of “Danger and Energy.” The 2020 iteration will focus on the theme of the year, “The Year of the Dragon,” and will invite twenty-four artists to the city of Kumalo. Each year, an equal number of artists from Kumalo and Tokyo come to Kumalo for the first iteration of the exhibition. The artists, who will each receive one-hundred thousand yen ($100,000), will each be given the opportunity to stage a “double performance” in 2020. The second iteration of the exhibition will be held in 2022 and will include a selection of works by the artists", "The next Biennial should take place in September 2021, and the event will be hosted by the New York–based nonprofit the Museum of the African Diaspora. The exhibition will feature forty works by twenty artists, including Nadine Zadran, Nick Cave, Jose Carlos Campos, and Rineke Dijkstra, as well as literature and performance from thirty-eight countries and twenty-two cities. The inaugural exhibition will also feature documentary films, multi-channel video installations, sculptures, paintings, photographs, and sound works.\n\n\nThe Queens Museum in Long Island City, New York, has received a gift of two works by artist El-Khandoum. The institution, which was founded by the Sargent and George Simonson in 1932 and is still run by the Simonson family, made the announcement on Wednesday that the artist had donated them to the museum.The works, titled Trans-Dimensional Carnival and Invisible City, were made in the 1930s by the artist in protest of the Simonson-designed Atlantic Yards, which he used to build the city of Atlantic Station, the largest public art project in the United States. Subsequent to the Civil War, the site became a site of major public events and", "The next Biennial should take place in 2020, at an unspecified date in the city. \n\nMarlene Nevelson-Hopper, the director of the university’s Biennial of European Art, has been appointed the next director of the New York–based nonprofit Artadia. Nevelson-Hopper joins the institution from the University of Pennsylvania, where she has served as a professor of art history since 1998, and will assume her responsibilities in October. In her new role, Nevelson-Hopper will be responsible for developing long-term plans for the biennial, which will culminate in a public lecture series.“It’s an exciting time to join Artadia,” said Nevelson-Hopper, who has helmed the institution since 2008. “The upcoming exhibitions are sure to reflect the breadth of the exhibition program at the university, and the renowned breadth of the career of Michelangelo Antonioni. I’m excited to lead the dialogue between the museum and the university, and to play a central role in advancing the exhibition program.”The institution is currently negotiating a deal with the company that owns the rights to the works. After bidding farewell to the works in the 2019", "The next Biennial should focus on the history of urban design in Central African Republic through the work of the curators and artists in their own universe, rather than trying to emulate the designs and designs of the major historical masters. I strongly believe that the new initiative will become a real force for social change for the country, inasmuch as it will accept the full range of challenges posed by the current political, social, and economic situation.\n\n\nThe 2017 Venice Architecture Biennale, curated by Enrico Castaldi and featuring work by more than 300 artists from 39 countries, has announced that it has received the final installment of its $50,000 prize, which was established in 2014 by Venice’s mayor, Dario Franceschini, and collector Haim Steinbach. The exhibition, which will be held at the Venetian city hall from January 7 to January 9, 2020, was organized by the Italian outfit, Open Ended, in cooperation with the city of Venice, the Museum of Modern Art (MoMA), and the Fondazione Mondiale in Milan.The final selections, which were made in partnership with Diller Scofidio + Renfro and the architects who designed the exhibition’s venues, include ", "The next Biennial should be in 2019. I hope to return to Chicago in 2020 to further introduce the program to the city’s artists.”The full list of participants in the exhibition is as follows:Art and DesignCenter (ADCC)Aldrich Biennale (2019)Aldrich Biennale (2019)Anselm Bode Memorial Art Museum (2019)Art & DesignCenter (2018)Alfred Bode Museum (2018)Artica Gallery (2019)Art Alumni Foundation (2019)Art Museum (2018)Art & DesignCenter (2018)Art Deutsche Kunsthalle (2018)Artzeitung (2018)BAMCOFT (VIA)BAMCOFT (VIA)BAMCOFT ART FESTIVAL (2018)BAMCOFT BUILDING (2018)BAMCOFT CONCEPTual ASSISTANCE (2018)BAMCOFT CONCEPTual STUDIO (2018)BAMCOFT STUDIOS (2018)BAMCOFT/TRIM STUDIO (2018)BAMCOFT/TRIM STUDIOS (2018)BAMCOFT/TRIM STUDIOS (2018)BAMCOFT/", "The next Biennial should be held in the first quarter of 2020. The entry of the second quarter of 2020 into the series should coincide with the date of the 2019 Annual. The second Biennial will aim to “distribute the importance of contemporary art in the contemporary era to a more diverse and expanded audience.” The organizers cite the current global climate emergency and the current global politics as factors for considering the 2018–19 edition.The 2019–20 edition of the biennial, “from the Ausar to the Jeddah Biennials,” was curated by an entirely new group of curators and is currently being curated by a different group of curators. The twenty-third and twenty-fourth editions will open in December and February respectively.The Jeddah-based artist and theorist Fadi Salih has been selected to represent Saudi Arabia at the Tokyo Art Fair in April 2020. The Arabian artist and thinker will be presented with ten works by twenty-eight Saudi Arabian artists at an exhibition that will be held in the capital city from April 5 to April 7. Salih’s work will also be included in a catalog of works by the Saudi Arabian artists that will be added to the exhibition in 2021.", "The next Biennial should aim to introduce new and fresher works; establish new themes for the exhibition; and present a selection of new works. The museum will also be overhauled to reflect the current state of the art and to receive modern conveniences, including the aquarium, a sauna, and several recreation rooms. The new building will also boast more contemporary visual art. Inaugurating is the construction of the new Biennial Gallery, which will house the exhibition, between April and June 2021. The new entrance will be located in the building’s courtyard. Founded in 1953 by Hennu Hennessy and Ikke Hansen, who met in the US, the institution was named after the pair’s late mother. The artist-run biennial was introduced by the artist in 1974. Hennessy and Hansen named the project after a simple motto: “It’s not what you’re not, it’s what you’re doing.” The exhibition, which was curated by Hansen and Hennessy, is organized as follows:1. A Modern Life exhibition2. The Essential Berg: A Contemporary View of Berg’s Art3. Berg: His Own Art", "The next Biennial should be titled “Roots—” and will offer the third edition of the annual event, which was founded in 1992 by Graham Kent and Niccolo Zingaretti. The event will relocate to a new venue in downtown Los Angeles in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has reorganized its exhibitions to align with the Museum of Contemporary Art (MoCA) in New York. The museum will now present twenty exhibitions per year. The schedule is as follows:February 13–March 13, 2020: “The Art of Voice” (New York)March 16–March 18, 2020: “Word Bearers: Avant Gardes, Mies van der Rohe, and Evelyn and the Eternal City” (New York)March 20–March 22, 2020: “Ashes to Air: The Art of Free Fall” (New York)March 25–March 27, 2020: “Kathy Balzano: The Sender, the Changer, the Sender: From the Art of David Salle” (New York)March 29–March 31, 2020: “Ivan Albright: Trio/", "The next Biennial should be in September 2021. Follow the exhibition’s history on Instagram and Facebook. \n\nArtist-run spaces in Hong Kong have been targeted by a new law intended to protect independent artists from the mainland Chinese government. The bill, which was passed by China’s National People’s Congress in Beijing on Wednesday, establishes a minimum age of eighteen for working in public spaces and bans the detention or deportation of mainland Chinese artists.Called the Basic Law for the Protection of Cultural Institutions and Property in Public Spaces (Baili), the legislation stipulates that an individual can be imprisoned for two years and fined up to $180,000 for violating the new legislation. The maximum penalty for an official act is five years and two months in prison. Human rights groups fear that the current law, which was passed in an election held on October 6, and its penalties, as well as the crackdown on political dissent in recent months, have made the situation worse.“This legislation is a direct assault on the freedom of speech and press in Hong Kong,” said Charles Yu, Asia director at the Art Newspaper. “As artists and cultural workers, we are in a position to challenge and to change the", "The next Biennial should aim to address the complex political and economic issues of our times and should reflect the spirit of collaboration and partnership between the two countries. The project awarded $5.5 million to the Arts and Culture Ministry and $3.1 million to the National Museum of Fine Arts in Beijing. The project will be led by Hsu Hoi-Chung, deputy director of the National Museum of Fine Arts, and the artist and curator Yu Ying-hsing.The biennial will feature the final work by three of the country’s most celebrated contemporary artists, Ai Weiwei, Liu Xiaojie, and Yu Hao-Ping, with three other artists selected from each of the provinces of Beijing, Nanjing, and Nanfu, as well as a selection of non-Chinese artists who are featured in the biennial.“The Biennial 2020 is part of the Government’s ambitious plan to reorganize the country’s cultural scene in the next ten years,” Wang Jianfeng, director of the National Museum of Art, told the Art Newspaper. “This year’s edition tapped a unique and incredible collection of contemporary art to become one of the most important exhibitions of the", "The next Biennial should be held at the upcoming Art Basel Dubai. The 2020 edition will be held at the Dubai Art Museum. The first editions were held in 2019 and 2020. The 2019 edition, titled Art in the City, was held at the Art and Design District in Dubai, the Art and Design Museum in New York, the Art and Design Museum in Amsterdam, the Art Gallery in London, the Art Institute of Chicago, and the Art Museum in Lisbon. The 2020 edition, titled Future Life, will be held in the Tata Art and Design Campus in Mumbai.\n\n\nThe Metropolitan Museum of Art (MoMA) has acquired the Archives of the International Group, a collection of more than three hundred albums and films by artists and collectors that were previously held by the Metropolitan Museum of Art (MoMA) in New York, the Museum of Modern Art (MoMA), and the Whitney Museum of American Art in New York. In addition to the archives, the museum will be able to showcase the works in a new public art installation.The collection, which includes works by Klaus Euler, Bertrand Maudlt, Alejandro Campanella, and Michelangelo Antonioni, was digitized and organized by the Los Angeles", "The next Biennial should be held in April 2021, said the museum, which has struggled financially since it closed its Brooklyn outpost in December 2015. The venue, located at 542 West Twenty-Sixth Street, is currently closed due to Covid-19. Following an extensive renovation, the museum reopened in March, but its attendance dropped by forty per cent last month, when the second edition of the Biennial of Chinese Art, curated by Beijing-born artist Wang Chunzhong, opened in the city.The 45-year-old museum faced a similar fate a few years ago, when the third edition of the exhibition, curated by Shanghai-based artist Wang Yilun, was forced to move to China after the government banned major outdoor events in the country. It reopened in March, but the Beijing– and Shanghai-born artist, who was named the winner of the $10,000 Biennale Stedelijk Museum Prize in September, announced in July that the prize would instead go to Beijing-born, Hong Kong-based artist Cheng Yilu. “I am thinking of opening a new exhibition,” Wang told the Art Newspaper. “But there are many exhibitions in Hong Kong right now that are not related to art.", "The next Biennial should take place in the spring of 2021. If all goes according to plan, the show will return to its original location in the city of Zurich in the summer of 2022.\n\n\nThe City of New York, which plans to move forward with an expansion of Penn Station in the fall of 2021, has placed a hold on the multimillion-dollar renovation of the Station North, where the Metropolitan Museum of Art and the Museum of Modern Art will later this year. The move has been made in the interest of protecting the station and its historic building and has not been made in an attempt to hasten the station’s demolition.The decision has forced a rethink of the future of Penn Station, which was expanded by the $155 billion New York City Transit Authority (NYCTA) in the 1990s. The city hopes to construct a new station on the site, which is bounded by Columbus Circle, Tenth Street, and Grand Street, and will begin work in earnest in 2020.The station, which will be built on the former site of the World Trade Center, will be a hybrid of a passenger/station, housing two regional, contemporary art museums. The centerpiece of the complex will be a 1,200-seat theater, which will", "The next Biennial should take place in 2021. According to the New York Times, the 2021 event will be of the same theme as the 2015 show. The following year, the exhibition will be of the same theme. \n\nAfter a team of nearly seventy artists from sixty countries was awarded a major $5.7 million biennial grant from the Bill and Melinda Gates Foundation in support of its Bright Young Things project, the organization announced on Wednesday that the $500,000 grant would be commissioned in the autumn of 2021. The grant comes at a pivotal moment for the arts as the United States heads into a second election cycle following the loss of President Donald Trump in November. The presidential election was marked by a number of controversies, including Trump suggesting that the Gates Foundation create new opportunities for urban black artists and a report that found that the arts sector contributes $2.5 trillion in economic activity to the US economy. With this biennial, the gates foundation hopes to increase the visibility of the arts to help people of all backgrounds feel included and thrive in the arts. “This is a moment of great challenge and change for the arts, and we as a society are taking it in stride,”", "The next Biennial should include a lecture-long presentation of Allen’s work and the development of a custom-built experimental art museum in the city of Sarai, Japan; a New York retrospective of Allen’s work in 2018; and the artist’s solo exhibitions at the Guggenheim Museum in Rome and at the Wittenberg Museum of Art in Berlin. Allen’s work has been exhibited in numerous solo exhibitions at the Guggenheim Museum (2015), the Wittenberg Museum of Art (2016), the Museum Fischbach in Vienna (2018), and the Museum Stuttgart (2018).\n\n\nArtist, activist, and educator Mary Lo Pascual has died at age eighty-three at her home in Santa Monica, California. Her death was confirmed by her daughter, Audrina, on Tuesday, February 27.The Los Angeles native and former professor was a prolific writer, illustrating and penning for her husband, Henry, she edited the best-selling book Art in America (Tascual Books, 1987) and the feminist feminist manifesto The Sexual Revolution: Feminism and the White Man’s Body” (New Issues, 1993). It was at this time that", "The next Biennial should take place in March 2022, and the twenty-first in November 2022. The funds will also support the preparation of a presentation of the final design of the pavilion, and will also be used to develop the exhibition program, which will present the work in conjunction with the series of films and performances. The commissioning of the pavilion has been greatly supported by the Foundation for Contemporary Arts (FCA) in partnership with the MCA Foundation. The MCA Foundation is also a core sponsor of the biennial. The cost of the program is $1.25 million. The biennial is organized as follows: The Pavilion is a two-story, fifty-two-thousand-square-foot, Kohn Gallery-designed building designed by the French architect Léonie Baguette in 1959. The building, which is currently home to the MCA Foundation, was completed in 1994, and the MCA Foundation is a partner of the MCA Museum of Art in New York. The Pavilion will hold twenty-one artists, including Kazuko Takahashi, Suzette Kahn, and Paula Scher, whose works will be presented in the biennial’s “A Sense of Place,�", "The next Biennial should hopefully be closer to the date of the first, and that will be when all the major works of our lifetime are on view.”The event will feature work by more than twenty international artists, including Patricia Martin, John Akomfrah, David H. Derrida, Mira Dancy, Jean-Michel Basquiat, Felix Biesenbach, John Cage, H. G. Wells, George Herloni, Mary Cassatt, Cézanne, and Paul Gauguin. An online-only preview of the exhibition is currently on view at www.thebiennial.org.The show will also include a new artist-in-residence program, a public lecture series and a museum-wide conversation with artist-activists from the Biennial East. The event’s first artist-in-residence is Jocelyn Uport, a London–based sculptor and textile designer who has described her practice as “in between fantasy and reality.” The Biennial will also present an exhibition of work by artists such as David H. Gernsbacher, Paul Gauguin, and Thomas Edison.\n\n\nThe National Gallery of Canada has released new guidelines for how art", "The next Biennial should be held in late spring or early summer in 2021. The next edition of the Oakland Art Museum will be staged in August 2021. Previously, the museum has staged the inaugural exhibition “Art in Construction” in 2019 and the inaugural exhibition “Literature in Construction” in 2016.\n\n\nThe Solomon R. Guggenheim Museum (SGR) in New York has released the curatorial team’s recommendations for the twenty-fourth annual Whitney Biennial, “Between.” Launched by Art and the Body, a nonprofit institution of the artist-in-the-making Laura Mulvey, the biennial will focus on the role of artists in the construction of the body politic. The exhibition will explore art and body politics and will explore the notion of construction through four critical experiments: the museum’s collection of artist-built bodies; the exhibition “Laura Mulvey: Between Construction” (2019); and the inaugural exhibition “Between…” (2016).“While the practice of body art is often considered a prelude to the development of architecture, the ethnography of Body,” wrote Laura Mulvey, \"is a corrective to the", "The next Biennial should take place sometime in 2021. The exhibition will highlight the work of 40 artists from the fifty-six countries that make up the Autonomous Region of Zambia and will be organized in partnership with the Autonomous University of KwaZulu-Natal, Zulululand.\n\n\nThe Baltimore Museum of Art (BMA) announced today that Marie B. Spero, Helen Prescott, and Mary E. Nee have been named curators of the Spero/Prescott/Nee exhibition, which will be held at the museum until March 2021. The show will feature work by seventy-three artists, including Adam D. Johnson, William S. Burroughs, and Robert Morris, and will be curated by Matthew Mead.“The Spero-Prescott/Nee ‘Dreamer’ exhibition is a reflection of our shared history of dreamers, and our way of thinking about them, as well as an invitation to look closely at how these artists have been impacted by the ravages of time, and to think about their work in these terms,” said Matthew Mead, the director and chief curator of the BMA. The show will also introduce new themes, including the history", "The next Biennial should be held at the Palais des Nations in Paris in October 2020 and will be the first show in the new venue, which is being built by the French architect Yazdan Boudin, on March 26. The twenty-fifth Biennial will take place in May 2020 and is currently on hiatus because of the Covid-19 pandemic. \n\n\nArt historian Naima J. Keith, a professor of art history at the University of Washington in Seattle and the author of The Seascapes of Art: From Mouvement to Statehood (University of California Press, 2018), has been appointed the next president and CEO of the Museum of Modern Art (MoMA). Keith replaces Adrienne Edwards, who retired in May after twenty-five years at the museum. “Naima Keith is an extraordinary curator. She is a scholar and a scholar of art history and has enriched the museum’s collection with over three hundred works, including works by the future-exhibitions, ‘Projects,’ and ‘Roots,””“the very first exhibition dedicated to contemporary art in the United States,” said Daniel H. Weiss, chair of", "The next Biennial should take place at the Palazzo Reale in Venice in 2022. More news about the next iteration of the show will be announced soon.\n\n\nThe University of Southern California (USC) has received a gift of over twenty thousand photographs from the late American artist James A. Farquharson. The collection, which includes works dating back to the late 1960s, includes over three hundred portrait prints by Sam Peckinpah, David H. Koch, and Ellsworth Kelly, as well as dozens of photographs documenting the Cultural Revolution.“James A. Farquharson was a pioneer and a visionary curator whose visual artistry and scholarship was integrated with his commitment to preserving and presenting American art,” said Michael Abbott, chair of the USC Art Museum’s Department of Art. “His work will be especially important to the Museum of Modern Art and the Los Angeles County Museum of Art (LACMA) as they face the possibility that their collections will fall into disrepair and decay. We are grateful to the artist for inspiring us to continue working with his legacy.”During his lifetime Farquharson amassed more than one hundred works documenting the tumultuous history of American art. He was a founding member", "The next Biennial should not only address these questions and more; it will also be a time to reflect on the way that the World has come to terms with its past; and to re-create a future in which human flourishing can be sustained, exploited, and expanded.”The forty-sixth edition of the Venice Biennale will take place in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles and the California Institute of Technology (Caltech) in Pasadena have entered into an agreement that will allow the institution to open a new $1.2 billion, 360,000-square-foot home for the arts in the city’s downtown core next year. The Los Angeles Times reports that the building will be named the Meredith Center for Art and Technology (MCAAT), after the late billionaire philanthropist Meredith Loring.“The Meredith Center for Art and Technology will be a flagship institution for the Institute of Contemporary Art (Caltech) in Pasadena,” said director Rebecca Morgenstern. “The Meredith Art Institute will be central to the institution’s mission to foster and provide access to cutting-edge research and education in all the exciting areas of contemporary art and technology.”", "The next Biennial should be held in 2021 and will be presented by the Adjunct Gallery. “We can see the first floor of the building and are very excited to bring more people into the show,” said Denise Price, a curator at the Adjunct Gallery and chair of the organizing committee. \n\nThe Metropolitan Museum of Art (MoA) in New York has introduced a new digital experience designed to contextualize the art that it displays in its Mark Rothko building. Titled Trauma, the platform will feature interviews, videos, and other interactive works by the artists who were the subjects of the first edition of the Biennial, which ran from March 5 to March 6, 2020. The exhibition is a continuation of the artist’s ongoing work, titled “Beyond The Papyrus,” which he began in 2004 to address the legacy of his mentor Henri Matisse, and will debut an expanded version of the exhibition at the Metropolitan Museum on March 19.A selection of the works that will be displayed in the platform will be curated by Haim Steinberg and will be organized as a series of interlinked videos. Steinberg will create the videos for the platform through a collaboration between the art historian and the artist known", "The next Biennial should be held in the spring of 2021. \n\n\nThe Guggenheim Museum in New York has welcomed a new member to its board of trustees, the Canada-born artist, actress, and producer Amber Lyon. Lyon will serve as the museum’s first board president, assuming her appointment is approved by the board of trustees on Thursday, March 16. Previously, she has served as a curator at the Museum of Modern Art in New York and as a writer for the website The Kitchn. In her new role, she will oversee the development and execution of the Guggenheim’s programming, including exhibitions and performances.“Amber is a gifted and engaging leader who brings an extraordinary perspective as a curator and educator, which will be especially valuable for an institution not known for its exceptional leadership or scholarly achievement,” said Mark Beasley, the museum’s director and CEO. “Her extraordinary skills and enthusiasm for this great city and its culture will be particularly valuable to the Guggenheim as we embark on a new visionary chapter in our history as we re-enter a new century, one that is defined by the extraordinary work of our artists, whose exceptional bodies and worlds are positioned to", "The next Biennial should coincide with the opening of the museum’s new exhibition space, the Metropolitan Museum of Art, which will take up the spirit of the previous exhibition. “The Met is celebrating twenty-five years of serving the New York City community, and we’re excited to continue to engage the public and the community with our rich collection of contemporary art,” said museum director Daniel H. Weiss. The new exhibition space will be named the Museum of Arts’ New York City Theater, and will be inaugurated with a biennial of works by forty-six artists, curated by artists such as Lois Paley, Heather Remini, and Sean Monaghan. The museum will also present a series of exhibitions and performances that reimagine the lives of the artists who have shaped the city and region. A selection of works by Tanya Bonakdar, Lisa Becker, Sara Blandy, and Louis Bodenheimer will be presented in the museum’s new exhibition space, “Painting with Light: An Introduction to Tobis,” which will open March 27. The work of the six artists will be discussed in the exhibition’", "The next Biennial should be held in the third quarter of 2020. Gilligan’s commitment to the arts is second to none. She has given tens of thousands of artists, galleries, and collectors a platform through which to express their creative energies and to construct positive futures for their artworks. She is a champion of the arts and has been an advocate for them for more than sixty years. Biennials are an opportunity to reexamine and reinterpret masterpieces. Gilligan is a self-taught artist whose art has been shaped by her own experiences and her numerous contacts with scholars and scholars-to-be. She has demonstrated a remarkable ability to watch and listen and listen to others’ creative practices and to adapt her own to fit the requirements of the contemporary context.”The biennial will also be the first to take place at the Kendall Gallery in London since the Covid‑19 pandemic. The venue will host the first exhibition at the new Tate space, opening on September 11. The exhibition, “In Defense of Life: Art and Artifacts in the Cenotaph,” will highlight the work of thirty-six artists. The show will feature works by artists such as Alex Katz, Birgit", "The next Biennial should also take place in 2020. In a statement on the exhibition, the gallery said: “We are delighted to be able to resume the biennial in 2021 with a new exhibition of work by the avant-garde artists from around the world, which will celebrate the imagination and the creative process. . . . The biennial was a global success and now it will continue with a new exhibition of the avant-garde artists from the UK.”\n\n\nThe French publisher, actor, director, and producer Martin Scorsese’s new film The Wolf of Wall Street is expected to open in France on September 5, with the UK premiere date set for December 7. The film centers around a financial analyst who, in order to protect his career, begins a business deal with a powerful New York drug dealer who turns out to be involved in the largest money laundering and drug trafficking conspiracy in American history. The film is being described as a “false dawn.”The film has been compared to Quentin Tarantino’s Django Unchained, the 1989 screed about a black Southern plantation owner (played by Leonardo DiCaprio) who is framed for the murder of a white police officer (played", "The next Biennial should take place at a different location and be accompanied by a programme of exhibitions, performances, lectures, a lecture series, and a literary event. “The exhibition of the work of the artist will be a real event, a reflection of the international spirit of a contemporary society, and a new visual path inaugurated by the artist,” said Isamu Noguchi, artistic director of the Biennial.\n\n\nBooks will be moved to museums and scattered throughout the city, and the collections of various arts and cultural institutions will be organized in a way that preserves the continuity of the city’s cultural life. According to the Art Newspaper, the redevelopment plans of the historic downtown area include the demolition of the World War II–era Alabama Opera House, the Art Institute of Chicago, the Chicago Children’s Museum, the Chicago Community Theater, and the Chicago Art Institute.“The city of Chicago is committed to rebuilding public spaces as carefully as possible while retaining the essential elements of the city,” said Chicago Mayor Rahm Emanuel. “We will continue to invest in the city’s parks, our historic public spaces, and our city’s arts and cultural institutions, while working to keep the doors open", "The next Biennial should take place somewhere on the island of Santorini, the site of a UNESCO World Heritage Site, in March 2021; it will be hosted by the Venetian Embassy in London and the Venetian Council in Rome. The exhibition will feature seventy new works by seventy-five artists including a track from the Los Angeles Biennial, a play from the San Francisco Biennial, a video from the exhibition, and a conceptual installation from the Venice Triennale di Biennale.\n\n\nThe French Ministry of Culture has decided to break ground on a new public art project in the capital of the Seychelles, Réunion, in September 2020. The announcement was made at a press conference at the Ministry of Culture in Paris on Thursday, following a major event marking the opening of a new exhibition of work by the artist-turned-director Aurélie Fischer. The exhibition, titled Art and the Seychelles, will feature forty new works by thirty-three artists from twenty-six countries.Commenting on the upcoming event, Minister of Culture Franck Riester said: “The objective of Art and the Seychelles is to develop a new way of presenting the exhibitions in the", "The next Biennial should take place in January 2022 and will consist of twelve exhibitions, including the first of the new series, “The Guardian Life: Volume One” (2019), an exhibition dedicated to the life of Niccolo Machiavelli.The proposed new biennial will be based on the same principles as the current edition, but will focus on the works of artists and not historical figures. It will also be organized by the same creators who created the two previous editions, “The History of the Art Museums” and “The Art of Life.” The biennial will be led by René Magritte, who will serve as the curator of the first event, which will take up contemporary art and its relationship to earth and air.The latest iteration of the Biennial was staged in Paris in June 2019. The first show, “The Bodies of Art: A Historical Survey” (2019), was staged in Zurich in November 2010. The second, “The Biennial of Senses,” (2019) was held in the capital of the Swiss canton of Basel in March 2011.The new exhibition will be themed “Life, Perceptual Conscience,” and will take", "The next Biennial should take place in 2022, and a new edition of the event should be presented in 506 years from now. “Today we celebrate the biennial as an important milestone in our history, and we are very much looking forward to the next edition,” said Alexander. \n\n\nThe Institute for Contemporary Art (ICA) in New York has announced that it is expanding its programs in support of the ethical and social practices of contemporary art and new media. It also announced that its first project, the Museum of Modern Art’s “Artist’s Delight: Art in Touch,” will return to the Hudson Valley in 2022. ICA president Marc Glimcher said: “We are thrilled with the direction the museum is moving with this year’s inaugural edition, which we believe will enhance and amplify the work of the entire ICA roster. With a new artist’s delight project, we hope to provide a platform for artists and new mediums to engage with the ICA’s digital network in a way that is both inspiring and timely. We are also grateful to the ICA Board of Directors for its support and encouragement in bringing this project to fruition.”In addition to the", "The next Biennial should take place in the city in 2022. \n\n\nA group of artists and activists are attempting to hold the Museum of Modern Art in New York accountable for supporting the Black Lives Matter (BLM) movement by refusing to divest from the institution. Led by Gonzalo Locsin, the Museum of Modern Art (MoMA) Artists Guild, and the Artists’ Union, the Organization for Black Struggle (OBW), and the Advocacy Working Group, the boycott is aimed at pressuring the museum to divest from GEO Group—a US-based defense company accused of war profiteering and slave labor that was recently acquired by Boeing.According to the New York Times, GEO Group’s CEO, Robert Sack, gave $1.2 million to the museum in 2016. During that time, the company operated a GEO Group facility in the United Arab Emirates. The company’s shares have dropped more than 20 percent since the Abu Dhabi corporation announced plans to sell the company’s shares in April.WHY DOES THE MUSEUM OF MARTYR WANT TO BIPARTY?The Museum of Modern Art (MoMA) has repeatedly stated that it does not want to lose money by divesting", "The next Biennial should focus on the work of artists that are currently understudied in the United States and its correlation with issues of race and the biennial’s proposed changes. Cultural historian and curator Willem de Kooning, who curated the inaugural exhibition, also endorsed the program. “I do want to see a lot of energy and creativity going into exploring what happens when art and technology and technology’s impacts intersect,” he said. The next iteration of the biennial will be held in 2021. \n\n\nThe National Gallery of Art (NGA) in Washington, DC, has appointed Melissa Bernauer as its new deputy director for exhibitions. Bernauer comes to the institution from the Museum of Modern Art (MoMA) in New York, where she has served as deputy director since March of 2018. She succeeds Bradley Williams, who departed the NGA on October 31 to become the director of the Metropolitan Museum of Art, and will assume her responsibilities on November 24.“Bradley is popular among his colleagues and admirers, and has been an invaluable source of inspiration for John and I,” Bernauer said. “He has been as instrumental as ever in helping us realize", "The next Biennial should be held in Hamburg in February 2020. The exhibition “Will I Live?” will be on view in the exhibition “Life After Death?” until March 23, 2020. The exhibition will close in March 2022. >> Read the full press release from the Biennale of Australia\n\nThe Fine Art Museums of Manchester (FAI) announced today that it has received a $10.5 million donation from the British Museum in an exhibition of works by the artist Steve Olsberg. The donation was made by the Jakob Wiener Foundation and the Family Fund in New York, as well as three other foundations: the Jakob Wiener Foundation, the and the Families Fund. A fourth foundation, the Steve Olsberg Foundation, which famously gave scholarships to students of American painter Paul Gauguin, has since been deleted from its website.The donation will allow FAI to organize its first exhibition with the artist in the United States since 2005, titled “Steve Olsberg: Celebration ” (March 23–April 2, 2020), at the New Museum in New York. The show will be on view through April 21", "The next Biennial should be held in May 2022.”A few weeks later, the exhibition was moved to December 2019. In an attempt to keep the event on schedule, the Art Newspaper ran an online preview of the exhibition in February.\n\n\nThe Art Newspaper, the Paris-based art journal founded by the late French writer Amedeo Modigliani, will be moved to a new address in the city of Marseille. Its new home is located in a monumental renovation project at the Museo de Arte Contemporáneo (MAS), which was completed in 2016 and consists of a series of galleries, offices, and museums. The new, six-thousand-seat venue will be named after the late French author, and will be inaugurated by a retrospective of his art, “Les Deux Amis,” in May.The biennial, which is organized by the French Ministry of Culture, will take up themes of “humanism, juxtaposition, and invention,” and will focus on work by artists whose work was influenced by Modigliani’s. The exhibition will feature work by seventy-five artists. Curated by Alexandre Blagdon, a noted French painter and sculpt", "The next Biennial should present a selection of works by artists whose work has been included in the past editions of the Museum’s Art of the Gallery, including Elizabeth Cady Stanton, Thom Mayne, and Ed Moses, and should draw from the work of biennialists including James Michener and James Turrell. The 2020 iteration of the exhibition will also include works by artists who have staged solo exhibitions at the Museum in the past and will include a selection of works by the biennial’s alumni.The program will be curated by Adam Gopnik, who has worked with the Museum of Fine Arts, Houston (MFA), and the Modern Art Museum Dallas (MAM) and is the founder of the B-Side/B-Side Contemporary Art Gallery in Houston, and will run from March 18 to March 20. The twenty-first edition of the exhibition will take place at the Museum of Fine Arts, Houston.The 2019 exhibition, “Bob Thompson: The Game of Life” was curated by Mark B. Smith, the director of the Museum of Fine Arts, Houston; Peter Schäfer, the curator of the Contemporary Art Museum Dallas; and Philip Tanenhaus, the director of Arts+ Culture in New York. It", "The next Biennial should host a period on the history and politics of the bandage, and its artists. “The world we live in today is profoundly indebted to the bandage,” said Michel Huyghe, president of the Biennale de Lyon. The exhibition will also observe the work of the museum’s collection of cavelike artworks, which is housed in the Louvre and will be shown in the inaugural exhibition. The new entry will be inaugurated with a special exhibition of work by Fredrica Bruguera, a pioneer of modernism and a key member of the National Association for the Visual Arts, and will present works by a select group of artists in addition to the biennial, including Anton Kern, Willem de Kooning, and Barbara Byrd.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is reopening to the public in honor of the city’s St Kevin & Maureen Anderson, who passed away earlier this month at the age of eighty-eight. The institution has temporarily closed to the public for its annual St. Patrick’s Day Parade since May 30, and has yet to announce when it will return to normal activities.", "The next Biennial should take place in 2022.\n\n\nThe Smithsonian’s National Museum of African Art in Washington, DC, has received a gift of fifty-two works created by the late artist, scholar, and educator Ketilal Warhol.The donation includes works by Warhol and three more artists, Robert Irwin, George Rodger, and Alex Lyon.The museum has also announced that it bought twenty-six works, all works by the late icon, from the biennial’s 'Top Ten' list. The works, which comprise works on paper, are currently on display in the exhibition, “Warhol: The Icon,” which runs through November 21.The exhibition is being organized by the George W. Schaller Foundation and the Schaller Gallery in New York. Art historian and curator Lauren Panzo, who curated the exhibition, said that Warhol’s works lent themselves well to installation and installation-based approaches. “His paintings and sculptures, the films he made, and the television shows he created, were all so designed to be viewed and enjoyed as part of a larger world that was in motion,” said Panzo. “The collection also contains works that explore the", "The next Biennial should be in the winter of 2021–2022.   Pace’s previous development program, called for the staging of several exhibitions at once, so that a collective exhibition of new works, including the biennial’s inaugural edition “The Third World,” might open in the autumn of 2021. In response to the shifting goals, the artist-run venues have yet to comment on their plans, but the Portland Art Museum and the Seattle Art Museum declined to comment. \n\n\nThe Debenham Foundation in London and the Haus der Kunstverein are launching a new ten-year arts project on Thursday, March 26, 2021. The foundation will create a new $150,000 fund to support artists and small to mid-size arts organizations in the United Kingdom. Sponsored by the Liverpool Biennial, the “Art of Art” campaign will focus on issues such as funding, strategy, and distribution, with a view to encouraging more critical thinking and discussion about the arts in the country.The initiative comes amid rumors that the British government is preparing to leave the European Union. While the UK will remain part of the European Economic Area (EEA), it will be eligible to apply to", "The next Biennial should be held in 2020.  The museum has previously proposed a date of 2021 for its first exhibition, “Living on the Edge: ‘Visions of Tomorrow,” an exhibition that will examine the implications of art for our present and future, but has not yet given an opening date.\n\n\nThe Cyprus Museum of Art (DMA) has received a gift of twenty-seven works from the Republic of Estonia. The works, which were part of a collection that included pieces by German artist Wilhelm Varnholt and Ukrainian artist Dona Altakhanov, were donated by the governor of the regional capital of Eesti at a ceremony held on March 25. The governor is Ekaterina Dzhegal, who previously appointed Nino Kavala as the DMA’s director and chief curator. The museum received the works in the form of personal gifts, which were delivered by the mayor of the capital, Ashok Sarkis, the director of the Kiasma Aghion museum in Kiasma, and the former director of the Russian Institute of Modern Art, Artina Yemchuk.The first piece of the collection to be given to the museum was Prel", "The next Biennial should be held in the Spring of 2022. The first exhibition, “The Wrong Side of Truth,” will open on May 14 and run until September 22. The International Committee of Museums (ICOM), which represents some sixty international institutions, is currently trying to negotiate a new agreement with the state; the government has until now responded to the protests with a statement saying that it is committed to the “constructive work of the ICOM.”\n\n\nThe Vienna Art Museum (VAM) is planning to move two hundred works from its original location in the city of Vienna to the city of Bonn, Germany, in an attempt to reduce the institution’s travel footprint and preserve more of the collection’s historical archival material. The move is part of a €50 million ($56 million) plan to restructure the museum as part of a €110 million ($114 million) expansion project, Artnet reports. The change will also introduce new exhibitions and a special exhibition program that will focus on the collection’s monographic holdings.“The unification of the two institutions is a major step in our ambitious plans to make the collection internationally accessible and to create a strong bond between the institutions,�", "The next Biennial should take place in the Fall of 2018, and the exhibition should be presented by curator Umesh Chandra.  On its website, the festival lists disciplines such as architecture, art, photography, and sculpture as well as themes of history and mythology. \n\n\nThe Metropolitan Museum of Art (the Met) in New York has appointed its first director, Courtney Secord. In her new role, which has a three-year term, Secord will oversee the development and launch of the museum’s selection of contemporary art. Titled “Away from the Sea: The Art of Traveling Distance,” the exhibition will also encompass the museum’s collection of works by post-Impressionist artists such as Louise Bourgeois, Ingmar Polke, and Ermanno Garibaldi. Secord will take up the post on September 1.“While director, I’m excited to see how our artists and curators—and the entire Met team—use the new platform to present new work and to explore long-overdue reopening of the building,” Secord said in a statement. “Creating a permanent collection of works from artists’ works and buildings is an important and", "The next Biennial should be held in the autumn of 2020. \n\n\nThe Art Newspaper, the British newspaper known for its reviews of art and fashion, has revealed that the Art Newspaper will not be renewing its contract with Bottega Veneta, the Italian fashion label, after it relocated to an undisclosed location in London next month. The news comes on the heels of the news that the British Museum has cancelled its plans to invest in Bottega Veneta and will be replaced by a new corporation run by Peter Salovey, the chairman of the London-based PR firm WME.  “The news is concerning,” said Artnet editor in chief Michael Wines. “The previous five years have seen the introduction of new ideas, and new approaches, in the art world. As a result, we have been witnessing rapid and continuous changes at the brands, with new opportunities opening up. We are concerned that Bottega Veneta, in the midst of these, will be pushed to the limit by the unexpected.”The news follows a report in Artnews that said the British Museum is planning to move the Tate’s collection to a new location in London. The move follows an announcement that the Tate will move", "The next Biennial should focus on “Theoretical, Synthetic, and Virtual Worlds,” said Donatella Bocchieri, chair of the City Museum’s board of trustees. The institution will work with the artist to present a series of conceptual projects that address the themes of artificial intelligence, connectivity and consciousness. The work of the twelve subjects will be curated by Christopher Wool, director of the National Museum of Modern Art in London, and will be on display at the Museum of Modern Art (MoMA) through October.Boswell also organized the 2015 exhibition “Should we care,” which examined the relationship between AI and culture in the digital sphere. The Tate and the Royal Shakespeare Company, which is currently undergoing a restructuring, have announced plans to collaborate with the artist on an upcoming exhibition. Previously, Boswell worked closely with Smith and Carpenter, who jointly curated “The Existential Observer,” in 2002. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of artworks at City Hall during its grand reopening, which was originally scheduled for May 4. The guidelines were drafted by the city’s Cultural Affairs Commission and are intended to guide the", "The next Biennial should take place in 2021, and the eight-year run of the show should run between 2023 and 2028. \n\n\nThe Metropolitan Museum of Art in New York has appointed Mary Ellen Krantz as its next director. Krantz arrives at the institution from the Museum of Modern Art, where she has served as interim director since January 2019.“Mary Ellen Krantz is an experienced leader in the field of contemporary art and an outstanding organizer,” said director William C. Williams. “Her work has made her a favorite of our artists, and she has cultivated New York’s reputation as a hub for contemporary art. We are thrilled to welcome her to the Met, and to have her on staff to continue her vision of connecting the museum with the world.”Krantz comes to the museum from the Metropolitan Museum of Art, where she has served as artistic director since March 2019. Since the museum reorganized in April 2019, Krantz has worked to increase the museum’s exhibition space and attract more visitors, increase the museum’s audience count, and expand its student and faculty engagement. In October 2019, she announced that she would resign in April 2020 to pursue a new career", "The next Biennial should be held in 2022. In the meantime, the museum is planning to restore its original Tudor Gothic facade, which includes the building of a new, seven-story, glass-enclosed structure with a stone courtyard and garden.\n\n\nThe Haus der Kunst (HdK), Germany, is appealing to the public for support in the current global health crisis. According to the New York Times, the institution has received $157 million from the German government since it shuttered its five-story, sixty-four-thousand-square-foot building in 2016, but it still faces a shortfall of $100 million after it announced its plans to sell the building in July. The HdK’s management, comprising Hermann Hülsch, the former director of the Artsmuseum Düsseldorf, and Oskar Eustis, the director of the Künstlerhaus Bergenstatt, have raised funds for the building “from a collection of more than 800 objects that are widely recognized across the globe,” including a painting by Pierre-Auguste Renoir, a drawing by Pablo Picasso, a concert performance by Johann Sebastian Bach, and", "The next Biennial should be held in the year 2030.  The next edition of Artist Biennial will be held in the year 2032. The next Art Biennial will be held in the year 2032. The next Art Museum in the United States will be inaugurated in the year 2022. The next show in the Metropolitan Museum of Art will be held in the year 2028. The next edition of Art in the USA will be held in the year 2022. The next edition of Art in the UK will be held in the year 2050. The next edition of Art in the States will be held in the year 2021. The next show in the Whitney Museum of American Art in New York will be titled “The Blue Sea,” 2019. The next Art Basel show in Hong Kong will be titled “The Future Is Here,” 2020. There is also no set date for the 2020 edition of Art Dubai.  However, in a statement made on Wednesday, Art Basel said that all of its events would be postponed until the new year. The statement also said that the 2020 edition of Art Dubai would be “completed by the end of May and will"]