["The next Biennial should focus on the history of biotechnology and its emergence in the late nineteenth century; the themes of the exhibition should reflect the five major divisions of the biotechnology field—biotechnology, biochemistry, biophysics, and biotechnology—as well as the diverse discourses within the biotechnology field surrounding revolutionary developments in biotechnology and biochemistry that have been historically neglected. It should also follow a three-year cycle, beginning in the spring of 2022 and running through the autumn of 2022, to reflect the biotechnology and biochemistry history of the city of New York.\n\n\nSlate Arts + Spirit, a New York–based nonprofit that assists visual artists in New York, has received a $25,000 donation from Mark Zuckerberg. The anonymous benefactor gave the arts organization $10,000 to begin with, but donated another $25,000 to fund the next phase of its work, which focuses on how cultural institutions can create opportunities for artists to present their works. The organization is also now awaiting an additional $50,000 from Zuckerberg, who recently pledged $1 billion for arts and culture in his philanthropic initiative, Art + Impact. The organization’s board chair, Linda Rosenbaum, told the New York Times that", "The next Biennial should take place at the Institut Karlsruhe, in Altenburg, Germany, in April 2020. The 2019 edition was held at the Next Basin in St. Louis, and the first Biennial at the Museum of Modern Art in New York was staged at the Museum of Modern Art in 2021. \n\n\nThe Museum of Modern Art in New York has added two new artists to its roster: Georges Apostu and Elisea Anagnos. The museum will stage the first show dedicated to the artist’s work at the institution in 2020. The show will be in three dimensions, focusing on the work of the artist in a bookstore setting, and will take the form of a library, with the artist’s personal materials, including photographs and objects, on display.The institution has also announced that Elizabeth A. Mitchell will serve as the inaugural director of the Tate’s collection of modern art. Mitchell previously served as a director of the Royal Academy of Arts in London and has helmed the institution as it expanded to form a new wing, the Contemporary Arts, in the late 1970s. In addition to her curatorial role, she will oversee the collection of nearly one hundred works by the artist, including her first", "The next Biennial should focus on the life and work of Lourdes Martínez, and on the long-term future of Cuba’s art. The exhibition will be a joint project of the National Museum of Art and the Havana Museum of Art.The exhibition will be organized in the following ways:The exhibition will be hosted at the Museo de Arte Contemporáneo de Havana, which will be inaugurated by a retrospective of the artist’s work at the museum last month. The opening of the exhibition will coincide with the anniversary of Lourdes Martínez’s death and will be preceded by a special exhibition of work by artist Adrian Ghenie.\n\n\nThe Los Angeles County Museum of Art (LACMA) has become the latest contemporary art museum to remove three works from its collection in an attempt to address the growing anti-Semitism in the United States. The museum’s board of trustees voted unanimously in favor of removing three works from its holdings that were discussed as “anti-Semitic” and “potentially divisive in their exclusion of other works by LGBTQ artists, including work by black and Latino artists,” Artnet reports.“The board", "The next Biennial should be held in 2021.\n\n\nThe Netherlands’s cultural association for contemporary art, the Büropus, has named Peter Zijlstra as its next president. Zijlstra has served as the director of the Witwatersrand Museum in the city of Ghent since 2015. In his new role, he will oversee the institution’s seventy-three-year-old collection, which includes more than 4,500 objects from the artist’s studio. The institution, which has five locations in the Netherlands, plans to re-launch the museum in 2021. “Rendering of the Tenenbaums, a group exhibition of works from Peter Zijlstra’s studio, dating from 1901 to 1986,” the museum noted on its Facebook page. “Peter Zijlstra is one of the most important contemporary artists of the twentieth century. He remains a great ambassador for the Büropus.”The association also recently received a gift from former director Martine van der Harst, who became the new chair of the organization. She made the announcement of the appointment on Twitter, where she wrote: “I’ve been working for", "The next Biennial should take place in 2020, but the organizers’ decision to put off the event was made in order to allow the museum time to review the feasibility of the exhibition in a scientific manner. The museum will then decide whether to proceed with the show, which will be inaugurated by a presentation of work by the second-generation Icelandic artist Birgitta Jonsdottir.The organizers argue that the upcoming exhibition is “sufficiently urgent to warrant the immediate participation of the public in a show of works by contemporary artists in order to avoid the ‘danger of a repetition of the same exhibitions.’” They also cite the exhibition “Asperger Games”, a show of work by artist Harris Hurley that was staged at the San Diego Museum of Art in the same year as the exhibition, as an example of an “overwhelming majority” of works that are “marginalized and misrepresented” as belonging to a specific sub-category of culture.The panel will consist of B. A. Quayyum, president of the National Association of Art Museum Directors; David Ip, a curator and former chief curator at the San Francisco Museum of Modern Art; and Chanel Pou", "The next Biennial should be housed at Alter, a contemporary art institution in the capital city of the Netherlands, in 2020. The museum has received a $150,000 grant from the Dutch government to commission a new work for the exhibition. The foundation also announced that it would hand over the title of the exhibition, which will be jointly organized by the Museum and the Fonds d’Art et d’Prospect, to the artist of the exhibition. Its new partner is Juliette de Kooning, who will curate the event.\n\n\nGreenpoint, Brooklyn, has announced it will receive $2,000 from the estate of Vincent van Gogh, Frederic Kappe, and the Flemish artist Joachim Härtmann. The gift was made in recognition of their contributions to bringing modernism to the Netherlands. Van Gogh and Kappe organized a series of stunning sculptures that were shown in the landmark exhibition “The Shape of Things to Come” (1932–33) at the Museum of Modern Art in New York from October 28 to November 3. The show, which explored the relationship between art and landscape, was one of the first efforts for van Gogh to", "The next Biennial should take place in the spring of 2021. For a preview of what the 2020 edition might entail, click here.\n\n\nThe MFA Boston has announced that both of its upcoming editions, “A Game of Thrones and A Vision of Spring” (2019) and “The Evolution of Art in Italy” (2019), will present major new narratives. The 2019 edition, which will be staged in April, will feature the first presentation of the new MFA’s collection of Italian art, made entirely of Italian art, since the museum began hosting Italian cultural events in 1992. The show will also introduce a new section of the museum, “The Future Is Not What It Used To Be.” The show will feature more than 150 German paintings, sculptures, and works in the exhibition’s first year, which will also be marked by a seminar series, “Italian Art in the Twenty-First Century: From Warhol to Obama,” and a retrospective of the collection. The event will also focus on the history of the collection, its exhibitions, and the exhibition program. The 2018 edition of the show, titled “A Future to Exist,” was moved to the museum in March", "The next Biennial should be held in 2020. The announcement was made in a statement by the exhibition’s organizers, which stated that the new dates were “consistent with our long-standing vision for the show.” In accordance with the upcoming exhibition—which marks the 70th anniversary of the opening of the first Biennial in Ghent—the twenty-fifth edition of the show will now be held at the Museo de Arte Contemporáneo, Ghent, from March 29 to May 9, 2020. Selected by a jury of experts in the field, who are chaired by artist Arturo Martins and include artist Ai Weiwei, Alexandre Klimt, and Alexander-Hans-Ulrich von Städtel, the thirty-eighth Biennial will take place in the town of Biarsch, in the center of the Salzburg region, in July 2020. The exhibition will include the work of seventy-three artists. \n\n\nThe painting, sculpture, and installation world is hoping that the next iteration of the eighty-fifth International, which will take place at the Museum of Fine Arts in New York from September 5 to September 7, 2020, will continue to be", "The next Biennial should be held in 2020. \n\n\nVolta Almeida and Charles R. DeLuca are the first Mexican photographers to receive a Whitney Prize. The artists will receive the honor during a special exhibition at the Museum of Modern Art in New York on September 3. The biennial ceremony will also feature William Eggleston, Anna Atkins, and the late Lebanese director Nima Nabavi.“I’ve been a fan of their work for some time,” Norbert Wiener, the curator of the exhibition, told the Art Newspaper. “For our team, it’s an incredible honor to present this with the help of the talented team at the Whitney Museum of American Art. We’re hoping that this show, this exhibition, will inspire a new generation of photographers, and they can take that from us and use it in their projects.”After a nine-year fight, the award was awarded to Almeida and DeLuca in a historic ceremony in the Museum of Modern Art on September 4. The pair will be presented with the award at the Whitney Museum of American Art in New York on September 7.\n\n\nThe International Center for the Visual Arts (ICVA) in", "The next Biennial should be held at the artist’s home city of Sao Paulo in October 2020, and next year at the Museu de Arte de São Paulo (MASP) in São Paulo. The biennial will be organized by the Museu de Arte de São Paulo and the Presidential Council for Curatorial Arts in collaboration with the Museu de Tijuca (Museum of Contemporary Art São Paulo); the Museu de Arte de São Paulo; and the Museu de Arte de São Paulo. \n\n\nThe International Center for Photography (ICP) in New York announced today that it has received a gift of fifty-two photographs by the late American photographer Bruce Gendelman. The gift, which was made by his longtime friend and benefactor, David H. Koch. “Bruce Gendelman’s photography—and his generosity—was an abiding source of inspiration and inspiration for me and as I continued to take on photography, he became an essential member of our visual community,” Koch told the New York Times.Gendelman, who was born in North Adams, Massachusetts, in 1939, began taking pictures as a way to express his Welshness, a way that", "The next Biennial should take place in 2022.\n\n\nThe New York Academy of Art (NYCA) has appointed Dorothy A. Rosatti as its next executive director. She succeeds Liz Adam, who retired after thirteen years last month. Rosatti succeeds Elizabeth Anne Porter, who was hired as the institution’s director of contemporary art four years ago. Rosatti will assume her responsibilities in April.“Elizabeth Anne Porter was a stellar leader who made the NYC’s art community thrive,” said NYCCA president Daniel H. Weiss. “She was admired and respected by her colleagues and the board for her vision and commitment to supporting the artistic and cultural life of the city. We are excited to have her back as we continue to expand our program and provide an environment that is inclusive and invigorating to all. We are also proud to be able to introduce our small but growing collection of works by Ruth Contelli.” Rosatti joined the institution in 2008 as assistant curator of contemporary art. During her tenure, she oversaw a number of exhibitions, including “Diana Alavi: The Plastic City,” in 2009, and “The Dead Sea,” in 2011, and wrote for", "The next Biennial should be held in 2020, and the first in 2021. The exhibition will be curated by Guðjún Lúthvín, whose work is currently on display at the exhibition “Víðjóvar fjörðsn\" (2017–18), and will consist of one hundred works that deal with the Icelandic language, history, and traditions. The exhibition will be held in the city of Reykjavík and will run through March 26, 2020.\n\n\nThe Solomon R. Guggenheim Museum in New York has created two new roles for women in the institution\u0097art curator and associate curator. The new positions are part of a Guggenheim initiative to look more closely at the museum’s collection and its exhibitions and to improve the representation of women artists in the institution.“The Guggenheim has long recognized the power of women’s work in American art,” said Guggenheim director Philip Stern. “Women have always been integral to our collections and to our exhibitions. The museum is committed to continuing to support the work of women artists in our exhibitions, and to expanding their field of study and scholarship.”In addition to the", "The next Biennial should be scheduled for the year 2020\u0097and is currently on board the auction house. The auction house will have the opportunity to present this year’s exhibition in the rear-view mirror with the off-site exhibition during the São Paulo triennale.\n\n\nThe Los Angeles County Museum of Art (LACMA), the Mary Boone Center for Art at UCLA, and the Metropolitan Museum of Art\u0097which were forced to cancel two upcoming editions of the Gem here despite assurances from organizers that all would be fine\u0097were ordered to pay the heirs of a man who died in the United States before he died of a brain aneurysm in 1977, reports the Los Angeles Times.The high-tech heart of the city’s art museums, which were forced to shuttered due to the coronavirus, was identified by the Los Angeles County Coroner’s Office (LACMA) as the cause of the emergency. After a six-month investigation, the coroner’s office determined that the cause was “an acute and intractable metabolic disorder.”The investigation named two individuals as suspects: Carlos Gomez-Bonde, a.k.a. the 'Father of Chic", "The next Biennial should arrive in 2020. Ostenwalder’s role at the Museum was to encourage an active engagement with the collection and the collection’s history, which was to be integrated with the museum’s perspective. He was succeeded by US curator and art historian Roberta Smith.\n\n\nThe Chicago Architecture Center (CAC) has announced that it is launching a $50 million capital campaign to support the construction and renovation of a new exhibition space that will host the first exhibition of work by transgender artists in the United States since the pavilion was completed in 2015. The capital campaign is part of CAC’s ongoing implementation of new anti-discrimination and anti-harassment policies and the institution’s commitment to supporting a more diverse and inclusive audience.“We created the new exhibition space to emphasize the work of transgender artists, and to increase the visibility and diversity of the collection,” said center director Mary Anne Peacock. “We also tasked our talented staff with creating an exhibition that will promote the work of transgender artists, and that will achieve this through the use of a diverse range of materials, including works that were created by artists who are also transitioning.”Peacock noted", "The next Biennial should be held in 2020.  The festival, which is sponsored by the exhibition partner Artspace Japan, will also be moved to the Bijse Memorial Stadium in Bijse, which will host the 2020 edition from February 21 to February 23. The event will be hosted by Shinjuku city in Tokyo and will feature work by seventy-three artists, including Hidetatsu Yamamoto, Jochen bis Henot, Hidetatsu Yamamoto, Hidetatsu Yamamoto, Ippatsu Kanai, Aoki Koki, and Koki Akiyo. \n\nThe Museum of Modern Art (MoMA) in New York has appointed Zaneem Akram as its next executive director. She succeeds Ron Shelly, who stepped down from the helm of the institution on March 31, and will assume her responsibilities on May 13.“Zaneem’s experience, passion, and intelligence as a leader, as well as her work with MoMA to expand the museum’s collection and expand its experience, make her an ideal candidate for the role of executive director,” said director Daniel H. Weiss. “Her leadership and vision for MoMA have made her a model", "The next Biennial should be held in Berkeley, California, in the spring of 2021—the date of the 1968 and the 2019 editions—and could host up to thirty artists. Curated by Kate Fowle, a curator at the National Gallery of Art, the event will focus on the life and work of artist-in-residence Felicity Hammond and will draw from public collections including the Allen Reproduction, the Yale Collection, and the Tate. Hammond’s work can be found in the collections of the Museum of Fine Arts in Boston, the Metropolitan Museum of Art in New York, and the Solomon R. Guggenheim Museum. \n\n\nThe museum in Tokyo that has hosted the world’s largest retrospective of the artist-in-residence, Tadao Ando, said that it will open its new exhibition “Tadao Ando: Beyond the Modern World” next month. The exhibition, which will include work by eighty artists and new from the Tokyo Metropolitan Museum of Art, will run from March 17 to March 20, 2020. The inaugural event, which will be followed by a three-day celebration, took place at the Hiromi Museum in Kyoto in June of last year.", "The next Biennial should have been held in late May or early June. Instead, it was moved to August 21–August 28. This was a mistake. More than three hundred galleries were invited to participate and the theme was “Responsibility in Art.” The 2022 edition of the exhibition will be held at the National Gallery of Canada in Ottawa.\n\n\nThe US Fish and Wildlife Service has released new regulations for recreational use of the endangered Mexican gray wolf. Introduced into the country in 2006, the carnivorous marsupial is currently listed as a Threatened Species by the Endangered Species Preservation Commission (ESA) and the US Congress. Federally, the ESA states it is considering removing the wolf from the list of threatened species and requires that individuals not possess a wolf-human hybrid pet.However, a rule published by the Service on Tuesday outlines how individuals may keep wolves as pets. Individuals who own animals that have been bred or released into the country as part of a commercial enterprise must obtain a license from the USDA and provide evidence of the institution’s ownership of the animal. The owner must also submit proof of the institution’s compliance with federal regulations.Once the livestock industry is regulated, it could also mean a reduction in the need for", "The next Biennial should kick off at the Victoria and Albert Museum and will be held at a time and place of your choosing. The theme of the biennial will be 'The Arts and Their Health,” and the biennial will consist of 3·5 hours of art each day that will examine the arts in a holistic and interdisciplinary way. The exhibition “What Is Art?” will be curated by Michael Kors & Kiki Smith and will take up the theme of the biennial.Kirby Davis, President and CEO of the Smithsonian American Art Museum, said: “The importance of the arts to our society cannot be understated. We are forever indebted to our citizens for their insight and for their support during this difficult and challenging moment. We look forward to seeing you there.”\n\n\nThe Solomon R. Guggenheim Museum in New York has commissioned artist and activist Rosemarie A. Pape to create a new artistic expression of solidarity with Black Lives Matter, the Black Lives Matter Collective, and the Women’s March. The installation, titled The Strike Back, will feature seven striking Black Power artists’ union cards, which can be seen in", "The next Biennial should take place in 2023. \u0097Joël & Paul Gustave, the collective that represents Guyana’s Christian artists, has dropped Guyana from the 2020 edition. The biennial will now be held in 2028.“In a world where art and artmaking is no longer just another form of expression, but one that is perceived and practiced, there is a need to create new positive modes of artistic expression,” said Jean-François Prouvé, the collective’s artistic director. “Guyana’s artists have a unique way of looking at the world in which they live, and we see this as a great opportunity to develop new works and new exhibitions in support of their project.”\n\nThe New York City Department of Cultural Affairs (DCLA) is seeking a director for its arts and culture division. The announcement follows the departure of Carolyn Lean, who previously served as director of the Metropolitan Museum of Art, and her replacement by Sylvia Berman.“We’re hiring a visionary leader to deliver on the DCLA’s vision of transforming the Metropolitan Museum of Art into an artist-friendly city,” said commissioner Daniel Kre", "The next Biennial should be held in the United Kingdom in the summer of 2021. The next edition of the conference will take place in the spring of 2022.The 2020 edition of Artforum America was held at the American Museum of Natural History in New York from January 18 to January 20. Its opening reception featured work by Rebecca Black and Sarah Riff. A retrospective of the work of artist Peter Andre was also staged at the Museum of Modern Art in New York in the spring of 2019. The 2020 edition was organized as part of the current twelve-week Artforum Media Initiative, which aims to present projects, events, and exhibitions in the United States throughout the month of February.\n\n\nIn the days since a shooting at the Los Angeles County Museum of Art left six people dead and eleven injured on Wednesday, February 5, more than sixty artists and collectors have signed an open letter condemning what they see as a double standard for museums that receive federal funding and refuse to remove controversial works from display.The letter declares that the decision to place a controversial work on display is an offense against free speech and that the institution’s failure to act would constitute “an appalling display of disrespect for those whose lives and safety are at stake.”The artists are demanding", "The next Biennial should take place in 2020, and a new exhibition should be announced by the end of the decade. \n\n\nThe New York–based nonprofit the National Gallery of Art in Washington, DC, has appointed Carolyn Hsu as its next chief executive officer. Hsu will take the helm from Matthew Teitelbaum, who was promoted to head of the Metropolitan Museum of Art in New York in November, and will begin in her role in January 2021. “Carolyn is a brilliant leader, who has built a distinguished career in leading organizations and communities that have embraced and embraced the power of design,” said Museum and Library Services commissioner Daniel H. Weiss. “Her leadership team has built a strong foundation for the future of the National Museum of American Art, and I look forward to working with Carolyn to ensure that the museum is positioned to thrive in a changing world.”Hsu comes to the institution from the Los Angeles County Museum of Art (LACMA), where she has served as deputy director for the past two years. During her tenure, she has organized thirteen exhibitions, including “Open at Any Time,” (2018), “Making Place,” “Design and the", "The next Biennial should take place at the Palazzo delle Papesse in Venice in 2021. \n\n\nThe Advisory Council for the United Kingdom’s arts and cultural sector has released a new set of guidelines for the promotion of British culture in the twenty-first century. The document, titled “British Culture,” outlines seven priorities for culture in 2020 and examines how art, design, film, and music can be used to further the agenda of the UK’s national identity.“The UK has a unique and vitally important role to play in shaping the future of Europe and the world through our collective creativity,” said Daniel Poulter, chair of the Advisory Council. “We therefore set out to outline in detail how we will support the cultural life and economy of the UK and to suggest a way forward for the arts and culture sector while remaining true to our values and our history.”This year’s Biennial of Britain was held in May and featured works by artists such as Sarah Polley, Alison McGovern, Joana Pindell, the National Poetry Library group, and David Salle. The 2020 edition will take place at the Tate Britain in London.\n\n\nThe Art", "The next Biennial should be held at the Estádio Marlborough in the city of Bristol next month, and the exhibition will be located on the British Museum’s campus.The museum is currently working on a new project, “The Other Shore,” a massive multi-city tour through the city of Bristol and surrounding areas, and the exhibition will highlight the work of artists whose work engages with themes of the human condition, including climate change and the biennial’s theme “Humanity and the Environment.”\n\n\nJust days after a federal appeals court upheld a judge’s ruling that temporarily halted construction of the Dakota Access Pipeline—a $3.8 billion project that would have involved the construction of two crude oil refineries in North Dakota and the Missouri River—the Trump administration withdrew from the $3.8 billion project. The move has sparked confusion and anger in the Dakotas, where protests are ongoing over the decision to proceed with construction.Trump has previously cited the pipeline as a critical tool in helping to protect the environment. The president signed an executive order in January directing federal agencies to stop granting permits for construction of the pipeline and the court battle that followed was settled last month. However, the decision", "The next Biennial should be in 2020 and will take place at the former barracks in the summer of 2021. \n\n\nThe Metropolitan Museum of Art in New York has received a gift of seventy-three ancient Egyptian prints that were illegally acquired by the institution in 2017. The works, which date from the Third Intermediate Period (AD 6– AD 9), were stolen by an employee of the museum who visited the works on loan to the museum during a tour of its Egyptian wing.According to the New York Times, the museum received the works from a company called Antares Mors, a private venture that has operated in Egypt since the late 1980s. The company has been accused of illegally procuring prints by passing off legitimate dealers. The Egyptian government launched an investigation into the matter after the theft.The works, which were discovered in the wing of the museum in 2017 and were on loan to the museum for twenty-six months, were on display in an exhibition titled “Egypt: The Modern World,” which was organized by the Egyptian Islamic Society (SOR) and marked the first exhibition dedicated to the works since the collapse of the Islamist government in 2011.The Egyptian government had previously attempted to stifle the activities of SOR and other groups that have been", "The next Biennial should be held in 2021, but organisers are currently still evaluating the best date for the event and need your help in finding the ideal date. The budget for the event is approximately $100,000 and the biennial will take place in late summer/autumn, 2020.The deadline to apply is now, June 15. The deadline to submit artworks is June 13. The deadline to receive funds for the event is June 19.The deadline for potential biannual revenue sources is June 21.  The biennial will consist of a selection of work that has never been shown before in the United States. The selected works will be presented by an international team of curators and art historians in collaboration with select visitors to the Biennial. The biennial will inaugurate a new museum. The installation will include a running commentary by acclaimed curator and author Peter Cooksey on the exhibition.Artforum will provide daily updates and will present the article on the Biennial on our web site every Tuesday. Artforum contributor and art history expert Elizabeth Alexander, author of The Art of Obsession: Modern Art and the Convergence of Material and Sound (University of Chicago Press), will be hosted by Artforum editor-in-", "The next Biennial should be held in the autumn of 2021. The first edition, titled Art and Death, was staged by Minakata & Co. of Osaka, Japan, in 2019. The second Biennial, Art and Life, was staged by the Seiji Shimomura Group in Kyoto in 2019. The first, Anahata-Honma, was staged by the Hiromasa Mukai in Tokyo in 2019. The second Biennial, Narita, was staged by the Yamasaki Museum of Art and the Tokyo Metropolitan Museum of Photography in Japan in 2019. The third Biennial, Transformed into Life, will be staged by the Tate in London in 2020. The fourth Biennial, Art and Life After Death, will be hosted by the Museum of Modern Art in New York in 2020. The fifth Biennial, Live at the Museum of Modern Art, will be held at the Metropolitan Museum of Art in New York in 2021.The sixth and final Biennial, Life After Death, will be staged by the Museum of Modern Art in New York in 2021. The documentary documentary film, Roots of Life, is a reimagined history of Art and Artifacts", "The next Biennial should be a prime example of how the arts can play a vital role in the world's toughest challenges: the fight against climate change and climate justice, the resilience of our communities to the impacts of major disasters, and the diversity of artistic approaches and forms to the art of our time.”\n\n\nThe Metropolitan Museum of Art in New York has revealed that it plans to phase out its use of an oil lamp that was one of the catalyst for hundreds of thousands of people to protest the coronavirus pandemic in the United States in March. The museum said that it will replace the lamp with a new one that uses renewable energy sources, but won't say when that replacement will be ready.Instead of the oil lamp, which was one of the major catalysts for activists to demand that the museum divest from oil, the museum has replaced it with a new heat-reflecting sculpture by artist Peter Rudolph, titled Big Sur, that is scheduled to open in October 2021. The work, which was created in response to the coronavirus outbreak, will be installed in the museum’s Exo, the giant glass dome that houses the museum, and will be able to reflect up to twenty thousand sunlight rays from the sun.The work is", "The next Biennial should take place in the spring of 2021, as long as the venue remains open. The upcoming exhibition will be the third for the Center for Media Studies (CMS), which was founded by the University of Chicago in 1979 and rebranded by the University of California, Los Angeles (UCLA) in 2009.\n\n\nThe trustees of the Museum of Fine Arts (MA) in Boston have removed a controversial display from its exhibition “The Painted City,” a 2018 retrospective that featured paintings by leading contemporary artists of color, including Aho, Eisa Hartigan, and Nada Rivera, and have named Stephanie Conner-Snyder its new executive director. Conner-Snyder will be tasked with developing new programs and with spearheading the museum’s expansion into a new building that will include more contemporary artists and exhibitions.“We selected Stephanie because she brings to the table a wealth of experience and knowledge building for MA, which we believe provides the perfect complement to our traditional exhibition format,” said museum director George Allison. “I welcome her with open arms to the Museum and look forward to her leadership role in bringing the museum back to the forefront of contemporary art.”This year’s inaugural exhibition", "The next Biennial should take place in 2020, but the festival has yet to commit to holding any events or defending its future. \n\n\nThe Silver Lake Art Museum in Los Angeles has received a gift that will help it continue to thrive during the Covid-19 pandemic. The gift is a ten-foot, gold-plated, microfilm restoration and exhibition space that will allow the institution to showcase works by the legendary avant-garde American artist James A.I. Cook.“We are thrilled to receive this extraordinary gift,” said James A.I. Cook, the museum’s current director. “The Silver Lake Art Museum is a major cultural landmark in the heart of Los Angeles, and the first institution in the United States to exhibit his work as part of a series of exhibitions that took place in the city in the late 1960s and early 1970s. In addition to the work, the Silver Lake Art Museum will have a permanent collection of his drawings, paintings, collages, and prints.”The gift was given to the institution by Lloyd and Mary Ann Silver Lake. The couple, who reside in New York, were well known in the art world circles of Southern California, where they began their art", "The next Biennial should be in mid-June, the organizers have said.\n\n\nThe Venice Biennale has announced that it will postpone the second edition of the event, which was canceled due to the ongoing international coronavirus pandemic, until at least mid-March. The postponement was made in order to allow organizers to continue working with the funds raised by the first edition, which was held at the Louvre until March 21.The organizers said that the decision to postpone the event was made in order to “ensure the maximum possible scientific, artistic, and social impact.” The organizers cited the coronavirus as a reason for postponing the event, which they say has attracted many more visitors to Venice than originally anticipated. The organizers also reported that they expected the event to be canceled by March 15.“The organizers have taken the decision to cancel the second edition of the Biennale in March to be able to carry out their work with the funds they have raised,” said Luca Cipolletta, director of the Venice Biennale. “Their decision to postpone the event has nothing to do with the cost of the exhibition. The organizers are acting in the best interests of the public.”", "The next Biennial should be held in 2021. Esther Schipper, president of the Berlin Biennale, said: “We are thrilled to be opening up our new exhibition space, ‘Art Berlin, to the public, and to have the opportunity to present the newest works from around the world. Denmark and Germany have been our main partners in Berlin, and we are confident that the new exhibition will be an excellent starting point for the public to experience the extraordinary breadth and depth of contemporary art in the city.”\n\n\nThe Metropolitan Museum of Art in New York has appointed Kate Davidson as its next director. Davidson joins the museum from the Solomon R. Guggenheim Museum where she currently serves as director of collections and exhibitions. Previously, she was a senior curator at the Museum of Modern Art in New York and a curatorial assistant at the New Museum in New York.“Kate’s leadership at the Met has been transformative, and her new role promises to be transformative for our collection, our exhibitions, and our audience,” said director Christopher Bedford. “She is a true visionary who has dedicated her career to the exploration of how art can shape our world and have a transformative effect on how we live our lives", "The next Biennial should take place in 2020.\n\n\nAs the organizers of this year’s Venice Biennale in December 2019 announced that they were closing the event, a statement issued by the exhibition said that the decision had been made in the interest of the art world’s economic, social, cultural, and scientific development. “In order to strengthen the collection, to make the exhibition as flexible as possible, and to adapt to the changing needs of the art world, we announced in December 2019 that we would not be able to continue with the exhibition in 2021,” said Stefano Caterina, the artistic director of the festival, which was founded by Luigi Cipolletta, the founder of the Milanese designer company Istituto Cattolica.C Caterina told the Art Newspaper that the decision to close the festival was partly prompted by the recent coronavirus outbreak in China. While the virus is believed to cause around 170,000 deaths in China, the number of cases in Italy is believed to be much higher. The International Committee for the Preparation of Art for the Twenty-First Century (ICPC) in Milan has since called for the exhibition to return to the Venice Architecture Biennale.\n\n", "The next Biennial should have some serious programming, and I am looking forward to seeing how the Norwegian and Swedish curators will engage with the works from the catalogue in future exhibitions, as well as new performances and other works for the pavilion.”\n\n\nThe Carnegie Museum of Art in Pittsburgh has appointed Nicole Ebsen as its next director. At approximately seventy-two years of age, Ebsen comes to the institution from the Carnegie-Castello di Rivoli in Rome, Italy. She succeeds Caroline Baumann, who has served as the curatorial director for the past six years, and will begin her post on January 21, 2021.“Nicole Ebsen’s approach to curating the Carnegie Museum of Art reflects her passion and commitment to art, an approach that has been reflected in her curating at the Contemporary Art Museum St. Louis, where she founded the Modern and Contemporary Art Museum with her husband in 2000. Her work has been exhibited at the Venice Biennale in 2005; the New Art Museum, St. Louis; the Museum of Fine Arts in San Francisco; and the Museum of Contemporary Art, Cleveland.“Carnegie Museum of Art is one of the most important institutions in American art history,”", "The next Biennial should be held in 2020.\n\n\nThe artist-run collective the Stono Collective is challenging the British government to create a new body to oversee the conservation of British art and to establish a new legal framework for the curation of artworks. The group’s first project, a series of exhibitions at the Tate Modern in London, was staged outside of the UK. “The exhibition was a response to the crisis brought about by the nuclear bombing of Iraq in 1988,” said the collective’s cofounder, Tanya Bloch. “Art is as much a part of people’s lives as the weather and people’s relationships with their environments. It must also play a part in the policy-making of the state and, therefore, in the government’s response.”The exhibition, “British Art and the Environment,” premiered at the London Film Festival (LFF) in March and is currently on view in the exhibition’s permanent collection. The Stono Collective, which is affiliated with the collective name, Omerta Omerta (New Order), and is composed of three artists: Rebecca O’Neill, Sarah Loyer, and T", "The next Biennial should take place in the summer of 2021. The Biennial will include an exhibition of work by thirty-eight artists whose work will be presented by the major U.S. artists. The exhibition will also include public performances by the artists, which will be organized in partnership with selected museums. The event is organized by the Biennial Foundation in partnership with the Pittsburgh Art Museum and the Pittsburgh Cultural Center. This year’s event will be held at WPA’s new home on Broad and Broadway. The presale will run from April 5 to April 7. The event will be hosted by the Carnegie Museum of Art and the Museum of Fine Arts Pittsburgh. The quarterfinalist for the prize is Leila Weefur, whose work challenges the boundaries of the senses through a combination of performance, narrative, and installation. The jury for the award is Jocelyn Wiles, who will judge the finalists at a special exhibition at the museum next month.\n\n\nAn artist’s studio is a space where ideas and materials are processed and organized in order to create new works. Studio owners and activists are increasingly concerned that the government is turning a blind eye to the destruction of cultural", "The next Biennial should be announced in the second half of June.<|endoftext|>As the fall semester looms, the University of Minnesota (UMass) is preparing for a potential shutdown due to the coronavirus. According to the Minneapolis Star Tribune, the institution is temporarily halting all operations, including classes and events, as it attempts to contain the outbreak.Since the United States does not have a biennial until March 23, the university is preparing for an indefinite closure, with some students saying they are hoping to see the first day of classes reduced through mid-March. The university is also planning to move the campus in May, a move that has been opposed by arts professionals and local school districts. “The university is making every effort to mitigate the risk of a shutdown by having as few people as possible on campus during this time, but it is understanding that the safety and well-being of everyone on campus is a top priority,” said Janet Mitchell, chair of the board of trustees. “We have been in discussions with the university and are actively assessing the situation and will continue to work with our students, faculty, staff, and visitors through this difficult time.”\n\n\nThe Lebanese artist and activist Salah Egili has been imprisoned", "The next Biennial should be held in 2021. “The theme this year is ‘inclusive and collective. We wanted to invite a collective of artists from different parts of the world to create a new kind of exhibition. This is a moment of real change and we hope that it will reflect the spirit of the festival. We are looking forward to working with our artists from Asia to promote inclusive and collective practices.”\n\n\nFrench New York’s Damien Chazelle will be the first director of the Brooklyn-based institution that he hopes will be a hub for hetero and queer literary and cultural life. Chazelle recently created the New York–based center New People, which has been housed in a former juvenile detention facility near the Williams College campus since 2007. Initially envisioned as a space for the exchange of art, culture, and ideas among a broader cross-section of New York–based arts professionals, New People has expanded to include a residency program, an exhibition program, and a library.Chazelle first met Marc-Olivier Guéheniere, the new director and CEO of the Brooklyn arts space LOAD, in 2014. He invited Guéheniere to the establishment, which is currently home to", "The next Biennial should be held in 2020 and will be hosted at the Museum of Northern Art in London.\n\n\nThe Iowa Museum of Art (IMA) in Des Moines has received a gift of more than 3,500 photographs by the legendary photographer Richard Anuszkiewicz. The work, titled The Milkman and Co., is set in a series of photographs by the artist that have been previously unpublished. The thirty-two-by-eight-inch prints, which depict a milkman and his rider, a woman and her child, are the only photographs by Anuszkiewicz that have never been published.The work is currently on display in the IMA’s Richard Anuszkiewicz Collection. Since the institution opened in 1867, the works have been included in a number of exhibitions, including the seventy-third Biennial of Modern Art (2019), the annual exhibition of Richard Anuszkiewicz’s work in the IMA’s David H. Koch Gallery in New York City (2019), and the IMA’s Richard Anuszkiewicz Gallery in Chicago (2018). \n\n\nThe Dark Arts Foundation, a New York–based nonprofit, has appointed Katia Bottinelli as", "The next Biennial should be held in 2020 and will be supported by the Florentine Academy of Fine Arts (FAI) in Rome. The invitation comes a day after the Italian government announced that it would not suspend the grand prix, which was originally scheduled for March 31.A statement issued by the Ministry of Culture said that the decision to’thich didn’t affect the rest of the biennial was taken after a thorough analysis of the exhibition, which would have been a “great success” and “marked the start of a new chapter.” It added that the decision to postpone the event was made in order to ensure the artworks’ conservation, adding that a new exhibition for the exhibition will be staged in the coming months.The decision to hold off on the event has been criticised by some as politically motivated. Artforum has contacted the FAI to ask about the delay and will update this article when we hear back.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced that it has received a gift of twenty-nine works by twenty-three of the artists featured in its exhibition “Theater of Operations: The Gulf Wars 1991–2011” in January. The gift includes", "The next Biennial should take place in the spring of 2021, at a date yet to be decided. The year 2020 will mark the centenary of the founding of the University of Amsterdam, which is one of the oldest in the world and a major arts hub.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released the recommendations for the 2020 edition of the Metropolitan Museum of Art—the first iteration of the Met since it closed in the winter of 2019 to undergo a $125 million overhaul. The recommendations, which were drawn from the DCLA's Cultural Archaeology Working Group, were submitted by the DCLA Heritage Conservationist Working Group, and follow a ten-month public consultation with the public that concluded in March.“The Met is planning to open a new, modern, and contemporary art museum in the fall of 2020, and we are committed to working with you, the Met community, to determine the optimal timeline and location for the opening of the new Met,” said agency director Joseph Ciampino. Ciampino said the Met currently has $45 million to spend on the renovation, and is in the process of setting up a fund for future capital improvements to the institution.The commission", "The next Biennial should be held in the spring of 2021. The new Exhibition of Biennial Art will be organized in conjunction with the upcoming exhibition “Autobiennial: 2017.” The biennial will include twelve exhibitions, from January 29 to March 4, 2020. The exhibition will be hosted by the National Museum of Art in Washington, DC, and will run alongside the biennial’s fifty-fifth anniversary. The pavilion represents the full range of exhibitions and collections in FST’s holdings. The organization is now accepting contributions of artworks and other curiosities for the biennial, which will be curated by Kate Danze and will take up the theme “Autobiennial: 2017.” The event will be held at FST’s current home, the National Museum of Art, in Washington, DC; the university’s new campus in the city; and the artist’s studio in Brooklyn, New York. The biennial will also be overseen by Stefan Knausgaard, who has helmed FST since 2017, and will open with a retrospective of the artist’s work from the artist’s studio in the summer of 2021.\n\n", "The next Biennial should, therefore, be a celebration of the years that have passed since the events that have led to the 1985 declaration of the United States as a Nation of Biennials. Augusta and I are eager to work with our audiences to promote awareness of the important contributions made by young artists, and to encourage their involvement in the art world. The Biennial will remain a unique institution, hosting only the most important works by contemporary artists.\n\n\nThe Chengdu Museum of Fine Arts (CFA) in China has appointed Jia Li as its first senior curator of Chinese art. Li came to CFA from the Beijing Museum of Art (BMA) in the capital of China, where she has worked as a curator since 2012. During her tenure at the museum, she curated three exhibitions, “Aeon” (2018), “Timmer: The Art of a Day,” (2017), and “Looking China in the Eye,” (2016).Li will assume her new responsibilities in January 2020. CFA director Zhou Yilun said that Li will be tasked with developing the museum’s collection of Chinese art and culture in an effort to create “more convergent and interdependent China", "The next Biennial should take place at the São Paulo Bienal in November 2021. The third edition of the show, titled “The Decadent Legacy of ... André Breton,” will be presented in October 2022. De Agostini will serve as the artistic director of the Biennial. The museum is currently working on a new set of conditions and a new format for the exhibition, which will be a collaboration between the artists of Brazil and will include \"a series of interstitial videos, dialogues and other works\" that will be shown in a rotating format. The Biennial will also focus on re-creating the \"soul of the place\"—that is to say, the cultural and social experiences of the urban landscape. “We are thrilled that André will be returning to the new and temporary exhibition space and to the gallery in the new World Biennale,” said De Agostini. “The new exhibition will be a series of interstitial videos, dialogues and other works, created with André’s approval and in collaboration with his collaborators from the exhibition. The show will be truly a ‘Place of Life.’”\n\n\n\n\n\nToules de", "The next Biennial should be held in 2022, according to the Arts Ministry. The ministry also expects to introduce new types of platforms, including virtual and augmented reality experiences.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it has received a gift of more than two hundred works by the artist John Neuman, a founding member of the New American Mandate, and his vision to create a museum dedicated to his legacy. In gratitude, the museum will donate fifty works by the artist to the MFA.Among the works donated are the unfinished works “The Vagina Redefined” (1964), which was on display in “Future Shock” (1999), and “I’ve Seen It All,” a series of nude sculptures that were created in ’70–72.“We are truly honored to receive these works and their enduring significance to the MFA,” said museum director Matthew Teitelbaum. “John Neuman is a towering figure in the history of art and the history of art in America. The work of John Neuman is a beacon in the life of a city. His legacy lives on in the museum’s collection and inspires our visitors to think critically", "The next Biennial should take place in 2021.The forty-second edition of the biennial, held in London from March 17 to 17, 2021, was also held at the Metropolitan Pavilion, which is currently undergoing a major renovation, and will be staged at London’s St. Andrew’s Palace Gardens, the Tate Britain, and the National Portrait Gallery. The twenty-seventh edition of the biennial, which will be staged later this year, has yet to be announced.\n\n\nThe American MFA is planning to move its nine-year-old exhibition “American Art,” a collaboration between the museum and the San Francisco Museum of Modern Art (SFMoMA), from June to September, citing the need to “protect the museum’s work in the event of a pandemic.”The move marks a significant shift for American art and a departure from the current three-month cycle, which was established in 1952 by the National Gallery of Art (NGA) in Washington, DC, and the San Francisco Museum of Modern Art (SFMoMA) in the wake of the coronavirus pandemic. In keeping with the institution’s goals of creating new public experiences through art, the new", "The next Biennial should be held in 2020. \n\n\nThe Institute of Contemporary Art (ICA) in London announced today that it is working with the Institute of Contemporary Art (ICA) in New York on the redesign of the museum’s Art of the Party, a major revamp of the institution’s already-existing Center for Contemporary Art. The museum’s current director of contemporary art, Bill Rudin, who is retiring on August 31, told the Art Newspaper that the center will be redesigned as a “portal for the future.”Bart Jansen, the ICA’s director of contemporary art, said: “The Institute of Contemporary Art believes that the Centre for Contemporary Art is the ideal venue for a rethinking of the art of the party as well as a rethinking of modern art. We have long talked about how art should be celebrated, but we didn’t do that well enough. We wanted our Institutions to create a different future for art, and this is a very good starting point and a good way to begin.”The redesign, called the ICA/ICA-CENTRE, is part of the ICA’s strategy to shift its focus from art", "The next Biennial should focus on “Defenders of Science,” a new anthology of essays by scholars who will articulate how the scientific enterprise has historically been seen as a vindication of social progress and a vindication of the humanities.“The issue of the twofold nature of science and the humanities has been greatly underestimated in the current biennial,” Robert Irwin, a curator at the Foundation for Contemporary Art, told the Art Newspaper. “It is a phenomenal achievement. I have been impressed by the breadth and depth of the essays. I have to say I have never seen so many essays on the same subject matter in an exhibition.”The biennial will also highlight the history of European art through the lens of the Italian-born Italian artist Paolo Tosatti, whose work often fused scientific and social concerns. The exhibition will include two biennial-sized works, “The Institution and the Center of Science” (2013) and “Et al.,” a work that opened at the Venice Biennale in 2009 and is now on view at the Museum of Modern Art in New York (MoMA).\n\n\nThe São Paulo Biennial, which was scheduled to run from March 19 to March 21,", "The next Biennial should take place in 2020, and the first in 2021.\n\nThe National Museum of Scotland has announced that it plans to hold two more editions of its Biennial of Scottish Paintings in 2020 and 2021. The exhibition will be hosted by the Scottish National Gallery, which has been transformed into the Biennial of Scottish Art. The exhibition will include work by ten artists, including Gethin, Tinker, Morten Richter, and Robert Smith, and will run for twelve weeks.The exhibition’s theme “Making Place,” was inspired by an essay by the novelist T.S. Eliot, whose work explores the relationship between landscape and history. The exhibition will feature paintings by forty-four artists, including Tom Glover, Richard Attenborough, Robert Mapplethorpe, Robert Mangold, and David Threlfall.“Making Place is about the process of how art can serve as both a vehicle and a point of departure for the escaping and transposing of symbolic and mythological narratives,” said Elizabeth Ann Macgregor, director of the National Gallery. “The exhibition will reflect on the different ways paintings can be an extension or a point of departure for recall and reflection about place, and", "The next Biennial should be held sometime next month. \n\n\nAlberto Cecconi, a photographer based in Milan, has been named the winner of the twenty-fifth Leonardo da Vinci Biennial. In his first exhibition as the pavilion’s director, he took photographs at the Museum of Modern Art (MoMA), in New York, and at the Punta della Dogana, in Venice. The paintings, which were made between 1901 and 1984, were the inspiration for the architecture-inflected sculptures Burrage and Spalletti.“Alberto’s photographs depict modern architecture with a contemporary sensibility, showing the space of the contemporary artist in a way that is unimaginable,” Gillian B. Robinson, curator and director of the Punta della Dogana, told the Art Newspaper. “His photographs are vibrant, very expressive, and full of humour.”The Venice Architecture Biennial, which will kick off in September 2019, features new works by twenty-six artists, including Filippo Strada, Maurizio Cattelani, and Lino Jocconi, as well as works by previous winners, such as Robert Becker and Jannis Kounellis. The artist-", "The next Biennial should include a presentation of work by the newly appointed director of MOS and a selection of the MOS we were able to produce during the exhibition “2016.” The exhibition schedule is also being reconfigured to honor the museum’s centenary. Koenig has asked that the exhibition be moved to a different venue. In an email to the museum, he wrote: “This was an unprecedented and exceptionally ambitious year for the museum, and I am very proud of the work that was accomplished. I am confident that in the coming years this exhibition will remain at the center of the museum’s dialogue with the larger world and continue to engage and stimulate audiences.”\n\n\nThe Theatrical Production Group (TPG), a New York City organization that represents theatre artists, has announced that it is developing a new platform to connect audiences with new works by emerging and established artists. The platform will launch with the inaugural biennial “Love,” which will run from March 17–March 20, 2020 and will feature work by fifty-nine new artists.The inaugural biennial, which was curated by Kiki Smith, received a lukewarm reception at the Art Institute of Chicago (IIC). While", "The next Biennial should be held in 2021. \nAlberto Rojas, who has curated the inaugural iteration of the new series, said: “The importance of the medium of photography, and the intense interest and passion for it among artists, is appreciated and appreciated by the new Board of Directors. Homegrown talent, and the new opportunity for experimentation, are both of great interest to us.”Scott Scheele, who served as chair of the board from 1999 to 2004, added: “We are enormously proud of the work that the board has accomplished in the twenty-eight years since we opened our doors to the public. We are confident that the new Biennial will provide great opportunities for the future development of the Biennial series.” \n\n\nThe Dutch cultural landscape has been profoundly altered in the last few months by the sudden and unexpected death of director Jacob Rijke, who was a pioneering and dedicated curator who created a new field of visual art and design, landscape architecture, in his home country of the Netherlands.Rijke, who was sixty-two years old, suffered a serious head injury in a plane crash in Marrakech on December 24, 2017, but managed to recover and continue working after months in a medically", "The next Biennial should be staged in 2020, and in 2022. Originally scheduled for March 23–March 27, the 2019 event was moved to March 27–March 29, and the 2019 version of the event was shortened.  The 2019 edition, titled Bertrand Goldberg: The Artist in the Cage, exceeded all expectations and was considered a major success. The event, which was broadcast live on Canal des Nord, won the First Prize at the Venice Biennale in 2006 and was nominated for a Pulitzer in 2007. In 2009, Israel chaired the World Council of Architecture. The 2019 edition of Kunstmuseum Hamburg was also very well received by the city of Hamburg. The museum had hoped to mark the centenary of the birth of the Bavarian king by organizing a reenactment of the Battle of the Bulge, but that initiative was scrapped.The city of Frankfurt, which is hosting three major art exhibitions in the next two weeks, also announced that it is working on organizing events that would facilitate visitors to the city from six other countries, including France, Italy, and the United Kingdom; that is to say, the art of the city will not be exhibited. Instead, it will", "The next Biennial should be held in 2021. The exhibition will be staged in collaboration with the city of Barcelona, the Municipal Council, and the Institut national de la Ville de Barcelona (CAC). The theme of the exhibition will be “The Future of Art,” and the twelve participating artists will be announced in March of next year. Criteria for the exhibition include a visual art installation, a performance, a performance/film, a collection of works, a vision board, and a public space. The Barcelona Biennial will be hosted by the city of Barcelona, the Institut national de la Ville de Barcelona (INCA), and the Casa do Povo.“This is a very special year for Catalonia,” Alberto Catellani, director of the Center for Contemporary Art in Barcelona, told Artnet. The exhibition will be held at the Casa do Povo, a former convent near the village of San Juan de Puerto, in the municipality of Barcelona; on the outskirts of Barcelona; in the city of Seville; and in the city of Bilbao. The biennial is being organized by the city’s architectural and design studio, the architects Ribas and Castellani; the Democrat Institute", "The next Biennial should be held in the fall of 2020. The institution has been closed since November 18, 2017, for a renovation led by architect Christos Giannakopoulos. The renovation of the museum is estimated at a cost of $38 million. The 2016 edition of the exhibition was held in the museum in the northern city of Salon.\n\n\nThe Museum of Contemporary Art (MoCA) in New York is moving three thousand works of art from its holdings to its new headquarters in a deal valued at $6 billion, the New York Times reports. The move is part of MoCA’s plan to reorganize its holdings in order to diminish the museum’s financial impact as it restructures its collection strategy. The move also entails increasing the museum’s holdings in digital form.The institution previously moved 1,400 works from its holdings to its new facilities in the former Hudson Yards development in the late 1980s. In 2005, MoCA purchased seventy works by artists such as Robert Irwin, Dorothea Rockburne, and Claude Monet from the estate of the late publisher Joseph H. McBride. The move raised $3.4 million for the museum, which is currently undergoing a $2 billion renovation. \n\n\nThe", "The next Biennial should be held in the spring of 2021.\n\n\nThe German Federal Office for Culture and the Creative (BfV), Germany, has appointed Hannes Ulrich Grütz, a senior curator at the Kunsthalle Basel, as its new deputy director for research, innovation, and the arts. Grütz will be tasked with developing and implementing the agency’s strategic vision, as well as coordinating its research and the promotion of contemporary artistic practices.“The appointment of Hannes Ulrich Grütz as deputy director for research, innovation, and the arts has been made in order to secure his expertise and knowledge in contemporary art and its relation with Berlin and the city of Basel,” said Angela Grütz, director of the Künstlerhaus in Cologne. “His knowledge and experience will be especially helpful in supporting the Biennial, which will be on an unprecedented scale and will be organized as a new kind of kind of city.”Grütz previously served as deputy director of the Kunsthal Aarhus in Denmark and as the director of the Kunsthalle Basel in Denmark. He previously served as a curator at the Centre Pompidou in Paris, where he", "The next Biennial should be held in 2020.\n\n\nThe Philadelphia Museum of Art (PMA) is expanding its collections into a new collection of contemporary art by artists of African descent (AGs). The PMA’s African American Collection, comprised of thirty-four works by seventy-three artists, is now available online. The exhibition, “Alison A. Young: African Artists,” will open on January 29.“This is an exciting time for PMA to celebrate the contributions of African Americans to our community, particularly as they contribute both to our art and to our artmaking,” said director Christopher Bedford. “It is especially important for us as a museum to continue to present our artists’ work in the most inclusive and accessible way possible, to present them as often as possible, and to engage them in our community in both formal and informal settings.”The exhibition will feature artwork by forty-six artists of African descent, including Amadou Gbenga, Abigail Lewis, B.A.N. Dau, Cyriacus Büyürek, Darlene Clark, and Lala Y. Harris, among others from the African American Community, the Black African Art", "The next Biennial should be held in 2021, with the winner being chosen by an international jury made up of the curator, the artist, the curator’s association, and the award. \n\n\nThe Metropolitan Museum of Art has appointed Peter C. Camil as its next director. He will begin his new position in January 2020, and will lead the museum through its next major expansion, which is set to open in 2021, and the institution’s thirteenth edition, which is currently underway.“Peter embodies the core qualities of a leader: a determined commitment to exploring ideas and challenges in creative, collaborative and visionary ways, an ability to prioritize and a sense of humor that has made him a successful and resilient leader,” said museum director Christopher Wool, who added that his appointment was made possible through a career-long commitment to the museum’s arts and education programs. “Peter’s work in transforming the Met has been chronicled by a number of award-winning artists and scholars, including Alighiero Casals, Alighiero Cassini, and Paolo Baratta, and his visionary leadership has been recognized by the Venice Architecture Biennale in 2002 and the Museum Contemporary Art Paris in 2008", "The next Biennial should be held in 2020. The extraordinary array of exhibitions at the gallery is supported by the Künstler Kunstverein Münster, the Mutterhaus, the Potsdamer Straße, and the Staatliche Kunstverein Berlin. \n\n\nThe Getty Center in Los Angeles announced today that it is giving $1 billion to nationally acclaimed arts organizations in support of vital programming, including the Arts Capacity, a new initiative conceived by artist and philanthropist Rob Schenck, to enhance the Getty’s digital presence across the globe; The Art of Contracting, a new global initiative that will bring together the Getty’s curatorial staff, artists, and critics and will provide them with a platform to communicate with one another; and The Art of Possession, an organization dedicated to the study of the art of the imagination.In support of the Arts Capacity, the Getty will award $400 million; The Art of Contracting will support more than one hundred galleries, curators, and critics; and The Art of Possession will provide $100 million for grants for creative-industry and nonprofit organizations working in the arts. The Art of Possession will partner with", "The next Biennial should take place in the fall of 2022, and the first exhibition, titled “From the Path of the Black,” will open at Biennale Yokohama in November 2020.According to the newspaper, the new exhibition, which is expected to open in the spring of 2022, will draw almost three hundred artists from eighteen countries and will feature some thirty thousand works. The curators will be Guadalajara-based creatives, artists from the Middle East, South Asia, and Africa, and will be based in Mexico City.“The latter part of the exhibition should be a chance for people to see different parts of my work and feel inspired by it,” Rabiu said. “I hope it will become a symbol of hope for the artists who are struggling in Mexico.”\n\n\nThe Museum of Modern Art (MoMA) in New York is preparing to welcome visitors back to the institution in April 2020. The organizers have extended the opening by a month to coincide with the New York–based Art movement, which is currently underway in the United States. The April 15 reopening of the Alexander Graham Bell Pavilion, which houses the home’s collection of modern and contemporary art, is designed to", "The next Biennial should open with a public lecture, art project, or performance.”\n\n\nThe Pérez Art Museum in the Spanish capital of Madrid has welcomed its first visitor in more than three decades. The sixty-five-year-old collector and museum director, Jesús Luíza, was awarded the Presidential Prize for Architecture and Design at an awards ceremony held at the Pérez Art Museum earlier today. He was selected for his work The Garde de l'Art et l'Histoire (1890–1947) by the Pérez Art Museum’s board of directors.“The Pérez Art Museum holds a special place in the hearts of many, and in the minds of many, the Pérez Art Museum exemplifies the strong tradition of creativity in the Pérez Art Museum,” said Luíza. “In the artistic field of architecture, I have been a long-time supporter of the Pérez Art Museum. I was the chairman of the Pérez Design Museum from 1987 to 2010, and the Pérez Architecture Museum until 2013. I have chairs in the department of design at the Academy of Modern Art, the Institute of Modern Art, and the Institute", "The next Biennial should be called for ‎August 2021, and should be hosted at the Guggenheim. This will mark the centenary of the institution’s founding, and the twenty-fifth anniversary of the museum’s founding partner, the XXX International Film Festival in New York. \n\n\nHurricane Irma battered Florida on Saturday, September 3, as it continued to rip through the state. As of September 8, the state was still recovering from the damage wrought by the Category 5 storm. According to CNN, Florida is now projecting losses in excess of $125 billion. While the National Guard has mobilized to assist with the growing crisis, it is expected that the total damage will be much worse.“There are people losing their homes and businesses, and communities are being torn apart,” Governor Rick Scott said. “This is not a hurricane—this is a superstorm.”While the capacity of the National Guard to deal with the massive flooding and damage caused by a Category 5 storm is limited, it has been working in concert with local, state, and federal governments to deploy resources, train local law enforcement, and support critical infrastructure. According to CNN, Florida already has more than 1.2 million residents without power", "The next Biennial should be held in the spring of 2022.\n\n\nA group of artists that included Dorothea Rock, Peter Sellars, Alex Katz, and Klaus-Dieter Müller is suing the German government to secure the release of artworks that were part of a triennial exploring the role of technology in the future of art and design in Berlin. The exhibition “Questions for Tomorrow: Technology and Art” was organized by the German Federal Association of the Arts and launched in December 2016. The event featured work by 1,100 Berlin-based artists and designers in a show that was organized by the German Federal Office of Culture and Science (BfV) and opened without the participation of the government.The suit claims that the government failed to recognize the exhibition’s participation in the exhibition in a “deliberate and severe act.” The makers of the exhibition are asking for the exhibition to be returned to Berlin and its artworks to be released into the public domain. The suit claims that the custodians of the works are violating the artists’ contractual rights by forcing them to remain in Berlin to participate in the exhibition. It also claims that the curators are breaching their responsibilities as organizers of the exhibition by creating a", "The next Biennial should be held in the first quarter of 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has promoted Sara Zielinski to senior curator. She succeeds Hans Ulrike Moges, who had helmed the institution for more than twenty years, and will assume her responsibilities in January 2021. “Sara is an excellent curator whose work has made an important contribution to the development of MoCA’s curatorial practice, and to the shaping of the institution as one of the world’s leading cultural institutions,” said Mark Goffman, chair of MoCA’s board of trustees and the founder of the consulting firm Zielinskas Artworks. “She has demonstrated a deep commitment to the institution of her own volition, leveraging her own talents and expertise to advance the museum’s collection and exhibition program as well as to shape the museum’s collection and exhibition history. She has also been instrumental in the institution’s transformation into an international cultural and research center, which has served the diverse communities of Los Angeles and the greater San Fernando Valley well. Sara’s work has been featured in numerous exhibitions around the world and is widely recognized as having a significant and", "The next Biennial should be held in 2021 and will be hosted at the newly-renovated and expanded Biennial Centre in the city. The venue will be relocated to a new 5,800-square-foot space in the city’s Portrait Gallery, with the exhibition to open in the fall of 2022.“The new Biennial Centre is a significant step for the city,” said architect and city councilor Mike Gipe. “It will provide a new space for art and culture, and will be particularly resonant with the city’s art lovers. The new Centre will be a great home for exhibitions and projects that are committed to and create dialogue with the city’s artists and will provide an exciting new venue for the city’s artists to engage with the city.”\n\n\nScholar, curator, and educator Rina Banerjee has been selected as the winner of the 2019 Guggenheim Fellowships, which are funded by the Guggenheim Foundation and are given to individuals and organizations who have demonstrated a strong commitment to their research and teaching interests and who have demonstrated a commitment to using their scholarship to advance feminist, anti-racist, anti-imperial", "The next Biennial should be held at the Palazzo Grassi, a former Fascist factory in Venice, in March 2020, and will provide an opportunity to re-examine the history of art through a modern perspective.According to the Italian daily newspaper the Corriere della Sera, the organizers of the exhibition are planning to create a new institution within the City of Venice. The building where the exhibition will be held will be relocated and will be transformed into the venue for an exhibition of the artist’s work. Artnews reports that the new museum’s opening date will be March 21, 2020.The exhibition, titled “Art from Hell,” will focus on the creation and destruction of artworks through the use of artificial or toxic materials. The work of the exhibition will be curated by Andrea Lazzaro and will be presented by the artist. According to the Art Newspaper, Lazzaro has been working with the artist for several years and has created works that challenge the notion of the natural world and its unity with the physical world.“I sometimes ask myself what will be in store for the biennials,” Lazzaro said in a statement. “My answer is always the same", "The next Biennial should be announced in December 2020. Lilière will be the first to head the museum until the departure of its current director, Nathalie Bondil, who will take up the post in November 2021. “As a board member and as a curator, I am very much looking forward to working with the talented team, and to the new project that I am sure will develop in the coming years,” said Lilière. “I am fully aware that I am working a very difficult and risky work in relation with a museum that is currently undergoing a great transformation. I will do my utmost to achieve a positive outcome in the outcome, but the future is not yet certain.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Kelly Stuarts as its new deputy director and chief curator. Stuarts comes to the institution from the Museum of Contemporary Art (MoCA), where she has served as deputy director of exhibitions since 2016. In her new role, she will work with director Neal Benezra, who has helmed the museum since 1988, to create a strategy for the institution’s future as part of a plan approved by MoMA’s", "The next Biennial should host a collection of twenty-four works by women artists, including J. M. de Cinéma, L. A. Farina, Marie Kondo, and Tanya and Iver de Montfort. Next year, perhaps?’s edition will showcase the work of the Italian artist Laura Spero. The second event will take place in the city of Porto Alegre. The third may take place in the city of Lugano or the studio of Italian-American artist Gloria Romano.The fourth will take place in the city of San Juan, Puerto Rico. The fifth will be an exhibition of work by artists including Kathleen Cleaver, William Corwin, Cécile Blondel, Irena Cattelan, and Helen Cammock. The sixth will be a biennial of the body of French artist Lève-Anne Luthier, whose work was featured in the first edition of the Biennial du Triennale in Saint Petersburg in 2011.\n\n\nThe Institute of Contemporary Art (ICA) in Paris has appointed Sunil Gupta as its new president. Gupta will be succeeded by Monir Thapar, who has helmed the institution since 1990.", "The next Biennial should be in 2022.”\n\n\nThe International Council of Museums (ICOM) in London has taken the first steps in the process of relocating its headquarters from the city of Cambridge to the nearby area of Whitechapel, in honor of the centenary of the outbreak of the Covid-19 pandemic in the UK. The institution, which has been based in the city since 1983, was forced to move its primary exhibition space from the city to a nearby campus in 1984. Since then, ICOM has staged more than seventy-five exhibitions and has hosted more than 2,400 international artists, including Nari Ward, Derrida, Jack Whiteley, Robert Rauschenberg, and Bertrand Russell.In a letter sent to the Arts Council, ICOM’s board chair, Aamer Anwar Farooqi, said that the institution will move to Whitechapel “in recognition of its commitment to the city’s collection, collection management, and exhibition programmes, and in recognition of the impact that the move will have on the local and international arts community.” He also noted that the museum is developing new programming and that the institution is committed to working with local and international partners", "The next Biennial should take place in 2020—the year the museum’s renovation of the building, the museum’s former headquarters, and the museum’s new home will be completed.\n\n\nThe Gallery at Columbia University in New York, the world’s oldest museum dedicated to art, has received a gift of more than two hundred works by more than three hundred artists. The gift includes works by Edward Hopper, Pierre-Auguste Renoir, and Anne-Marie Sigismondi, as well as works by artists such as Marie Antoinette, Richard Diebenkorn, and Jean-Michel Basquiat.“The gift of this extraordinary collection is an extraordinary achievement for Columbia, which has been striving to achieve for more than thirty years,” said museum director John Bernard. “The biennial will provide a great platform for the work of distinguished artists, and will give the future generations of artists a rich and provocative exploration of the complex and ever-changing world of art.”The works in the collection were organized into five categories: Censorship’s, 9-11, Art that is Beautiful, Art that is Replicable, Art that is Replic", "The next Biennial should also include a discussion of the role of art in the lives and futures of African Americans.\n\n\nAlthough the French government is moving to slash the annual salary of the top two-dozen arts bureaucrats in the country, France’s Culture Ministry is expressing confidence in the ministry’s ability to insulate the arts from political interference. In an interview with the Art Newspaper, Michel Rocher, the minister of culture, said that the government will respond by “demanding that the highest levels of the ministry take care of the arts,” reports Le Matin de France.Roch also noted that the ministry is well equipped to ensure that the twenty-three-person list of the 2050 edition of the Venice Biennale, which was released on Tuesday, includes “real people” and that officials are fully aware that art and culture are important to France.The list of 2060 participants was pared down from the previous iterations of the event, which also excluded Lillehammer, Cannes, and Berlin. During the 2015 edition of the festival, the museum’s director, Karol Wojtyla, revealed that the institution is not planning to include the works of a few of the eighty-five artists", "The next Biennial should be held in the fall of 2022.  The full list of participating artists is as follows: Bianchi, Federico / Ed. N.B., Deana A. Acuña, Jr.,\n\nBocchino, Francesco / Ed. N.B., Osmar Barroso, Jr.,\n\nBosch, Giuseppe, Madeline Bickel, Florian Bouillon, Matthias Bickel,\n\nBickel, Øyvind von, Klaus Bischoff,\n\nBenedict Böble, Bernd Bödhardt, Andreas Böck,\n\nBöck, Ronald, Barrie, Ontario, Canada’s Andrea Boetti, Schubert, Pierre,\n\nBoden, Jan, König-Lichtenberg, Germany’s Eileen Crone, Melanie Daberg,\n\nDara Dalles, Griffin, Michael Dalles, Cindy Dalles, New York, NY, USA’s Kevin Doyle, Stephanie Doyle,\n\nDario Marchetti, Crist", "The next Biennial should take place at the Museum of Contemporary Art, Atlanta, in 2021. \n\nThe theme of the upcoming edition of the San Francisco Biennial is “We Are All in This Together.” The exhibition will focus on themes such as the existential threat posed by new technologies and the increasing dispossession of communities across the United States. The exhibition will also introduce new works by women artists, including a selection of works by Margot, Adeline, and Maria Laudel, and will feature a retrospective of the work of Maren M. Zebich and the exhibition will mark the first time the biennial will be organized as part of a third-party organization. The exhibit is part of a series that will also feature work by artists from the West Coast, including Barbara Walker, Alfred Stieglitz, and Annie Prouvost, and will include a new exhibition that will have three new works by the Hungarian artist Rudolph Esper.The 2019 edition of the biennial, “The Synthesizer,” which was organized by the Hauser & Wirth’s Oakland, California–based space Lulu, featured more than thirty works by twenty-six artists, including Lucie Barlow, Be", "The next Biennial should take place in September 2021. The exhibition will include a selection of work by contemporary and historic artists, as well as a new initiative by the South African artist and curator Lukman Tshabalala, titled “Gone.” The theme for the 2020 edition is “Life After Death.”\n\n\nThe Museum of Contemporary Art (MoCA) has appointed Alex Delvalle as its next executive director. He succeeds Dominic Bernal, who retired in March 2017 after eleven years in the role. Prior to joining MoCA in 2005 as director of the Toronto Art Gallery, the Miami-based artist-turned-collector was the founding director of the Brooklyn-based nonprofit the Gallery for Contemporary Art (BAC), which supported artists such as John Akomfrah, Paula Abdul, and the Black Madonna.“Alex’s vision and energy align perfectly with MoCA’s mission to present the most ambitious exhibition-driven exhibitions possible,” said Elizabeth Chiu, chair of MoCA’s board of trustees. “His proven ability to foster and develop relationships with the most talented in the field and his ability to translate his extensive experience and knowledge into meaningful and powerful experiences for", "The next Biennial should be held in the summer of 2022.\n\n\nThe Museum of Modern Art (MoMA) is signaling that it plans to move the show “Dirty Work: Art and the American Experience” from its campus in Manhattan to the city next door. The move has been in the works for weeks, and the news was made official on Monday, the same day the biennial’s opening party was supposed to take place.In a statement, MoMA cited the need to “re-create a more inclusive exhibition environment” as a contributing factor to the decision. “MoMA is collaborating with local, state, and federal government officials to create a more inclusive and accessible exhibition experience for our guests,” the statement reads.MoMA told the New York Times that the decision to move the exhibition was made on the recommendation of two community groups, which drafted the exhibition’s then-current state, which was presented by “Dirty Work: Art and the American Experience” artist Humberto Villar, and the artist and curator, Li-Chun Huang. Villar, who died in 2008, said: “When I presented the exhibition in 2015, I told the audience, �", "The next Biennial should take place in 2020, Art Basel Hong Kong said. The announcement follows the announcement of plans to open a new exhibition in the town of Soshuang, China, in 2020.\n\n\nThe museum in Abu Dhabi that is home to the British artist Vincent van Gogh has been taken over by a group of Dutch art collectors. Woor al-Qasimi, the founder and CEO of the Abu Dhabi-based firm Van Gogh Foundation, which has supported the seven-thousand-piece museum since it was founded in 2010, announced the acquisition of the van Gogh painting The Karst of Mynock, which is currently on display in a major retrospective at the Abu Dhabi Museum, in October.The acquisition was made through a public offering of the works that were part of a series that were part of a series that were part of a series exhibition that was organized by Van Gogh Foundation in 2022. The works were sold to the museum for $2.5 million in a deal that was finalized last month, the Art Newspaper reports.The exhibition, titled “The Karst of Mynock” (The Karst of Mynock), brought together the works by artists such as Johann Wolfgang Go", "The next Biennial should be held in December 2021 and will be hosted by the Palazzo San Marco in Venice.\n\n\nAs the capital of the Philippines, Manila has been mentioned numerous times in the works of Artforum, Artforum Philippines, Artforum Asia, Artforum in America, and many others. The city also makes an appearance in the work of artists like Don Quijote, Marcel Prouvé, Francis Pérez, and Manuel Guggenheim, among others. Sara Cwynar, the director of the Brooklyn Museum, has even made an appearance on the show. The museum is currently working to determine its future plans for the site, which is currently occupied by the Department of Cultural Affairs (DCLA), and is currently negotiating with the city of Manila to extend the exhibition’s run.  The Philippine artist and architect Andrés Manuel Pascual, who was a founding member of the contemporary wave of Filipino artists in the 1980s, died in Manila in 2004. Pascual’s influence on contemporary Filipino art is felt in the art world’s current state. Even today, many of those who knew him and knew him best, including Katia S", "The next Biennial should be held soon.\n\n\nThe Metropolitan Museum of Art in New York has issued an official apology for the \"insensitive\" display of a photograph by American photographer Jack McAllister, which features a naked, semi-nude, and mostly clothed teenager in a Parisian glass-enclosed studio, that was part of a series titled Artist’s Houses. The exhibition, which was at the Met from 1997 to 2009, featured works by thirty-seven artists. The artists who did not participate in the exhibition include Anna Atkins, Kate Millet, Miro Ato, Marc Jacobs, Laura Owens, Yvonne Rainer, and Yvonne Salomon.In a statement issued by the museum on Friday, the museum said that it was “working with our artists and their families to understand the implications of the work and have them consider the work in relation to their own practice and their own families.” The museum added that it will evaluate our policies and procedures to ensure that the ‘Theme of the Biennial’ is consistent with our values and with the participating artists’ practices.”The apology follows a statement by the Met by director Daniel H. Weiss on Monday, January 19, in", "The next Biennial should be called “EPLR: 20 Years of Art,” the official title of the new exhibition, which will take place at the Biennial Museum’s newly refurbished and expanded space. The institution will also unveil the renovation of the spaces of its two buildings, the Biennial Museum and the Museum of Contemporary Art, Paris. The building of the museum, which will house approximately 1,300 objects, began in 2016 and is scheduled to be completed by 2021.The venue, which has housed the exhibition site, the Exhibition Modern, for the last ten years, was also the site of a number of other shows, including “Gangnam Style” (2016), “Senga-wanki,” (2016), and “Sylvia Calderón” (2017), which was curated by Juan Valdés, the Director of the Institute of Fine Arts and Design, Madrid.\n\n\nThe Museum of British Art (MBA) in London announced today that it is launching a yearlong digital initiative designed to engage with audiences across the UK through exhibition-based projects and projects based on galleries and museums. The initiative, “Tuesdays with Sir David Walliam,”", "The next Biennial should be held in 2022. The exhibition will be dedicated to a work by Yecci Wang, who is known for her sculptures comprised of translucent polyester resin and acrylic plastic. The exhibition will feature work by twenty-four artists, including Carlos-Andrea Ribas, Delia Taj, Imogen Zuckerman, and Jim Jarmusch. The show will also be organized as a series of films that will be shown simultaneously.\n\n\nThe Baltimore Museum of Art (BMA) has announced that it is planning to create two new on-site locations for the museum, which has been closed since March 13 due to the Covid-19 pandemic. The new spaces will be built on the same site as the museum’s existing building, which opened to the public in 1976, and will bring together new exhibitions and educational programming. The new spaces will be named the Adam Clayton Powell Sculpture Garden and the Adam Clayton Powell Architecture Sculpture Garden, respectively, and will be inaugurated by “The Ancestors,” a new exhibition dedicated to the region’s earliest known sculptors, held in July.“Echoes of the Past: Art and the Fallibility of Memory,�", "The next Biennial should be held at the Institute of Contemporary Art (ICA) in Rome in 2021, the Art Newspaper reports.The Venice Architecture Biennale, curated by Gilles-Eric Süstek and curated by Klaus-Dieter Breitmans, will host the first edition of the exhibition next year, and the second in 2022.Since the UK and France are the major importer of Italian arts from Italy, the UK’s Florence Pavilion Program, which aims to support the production of art in Florence, has been negotiating with Italy’s Ministry of Culture to commission a new set of works by artists from the UK. However, since Italy’s ministry plans to open a new exhibition in Rome next year, the program is currently negotiating with the National Galleries of Art in London to commission a piece from the UK.Peinotti and Breitmans have defended the program, which they say supports British artists and places them in a relati-ous position to benefit from a reopening of the Italian economy. However, Matteo Brizzi, the Italian minister of culture, told the Art Newspaper that the government will not be able to reopen the economy unless all restrictions are lifted, and that the country will be able to produce", "The next Biennial should take place in the summer of 2021. The show will be hosted by Tania Bruguera, Naima J. Caro, and Lise Hoppe, and will be organized under the title Beyond the Blue, a long-term project conceived as a response to the crisis of the body. Among the works that will be on view are Chronos, a conceptual multi-media installation-cum-art-travelogue; Doppelkäse, a multi-channel installation with art, water, and light; Volta, a village in the jungles of the Vietnam, where a woman and her child were killed by an unknown assailant in November 2015; and Lucid Dreaming, a dream-world installation that depicts two deep-sea hydrothermal vents, one of them filled with molten lava, producing dense, translucent, and silvery clouds of glass, crystals, and crystals.In addition to the exhibition, the biennial will host a number of other programming, including an exhibition of work by Saara Saara’s The Submarine, curated by Saara Saara and Ayesha Nagan", "The next Biennial should focus on how the archive and the museum have positioned itself in relation to the city, further developing and celebrating the city’s rich history, and how this history can inform the future of the museum. The first show, “Starting from the Bottom,” will open in October 2020 and will be followed by “How MUSEums Differentiate,” which will open in November 2020; and the second show, “What Does a MUSE mean to Me?,” will open in June 2021.Among the projects currently underway are the reopening of the museum in the summer of 2019, the construction of a new exhibition space in the fall of 2020, and the launch of a series of educational and engagement projects in May 2021. A preview of the first show, titled “What Does a MUSE Mean to Me?,” will fly on the Museum of Modern Art in the summer of 2020.The project team also revealed that the museum will increase the number of exhibitions by twenty-six and double the number of exhibitions by fifty-four. The organization said: “To create a show that reflects the spirit of the city and the quality of its collections and exhibitions, the museum embarked upon a comprehensive", "The next Biennial should be called 'The Present: The Art of the Present.” The event, which was established in 1998, will include over twenty artists from forty countries and will be organized in collaboration with the Pennsylvania Academy of Fine Arts. The inaugural exhibition will be held at the Philadelphia Museum of Art (PMA), and the second at the Paley Art Museum, New York, in November 2020.The last exhibition was held at the Philadelphia Museum of Art in 2015. \n\n\nThe New York City Department of Cultural Affairs has opened a new digital platform that will allow the public to report violations of anti-discrimination and anti-harassment laws by cultural organizations, including the Metropolitan Museum of Art, the Museum of Modern Art, and the Bronx Museum of the Arts. The platform, called the Report a Violation, will give cultural organizations and individuals who believe they have been the victim of a discriminatory act or behavior a tool to report such incidents to the city.The platform was created with $25,000 from the $53 billion New York City budget to fight anti-gay discrimination fund the State Action Network. The fund, established in 2015, brought in $8.3 million from March 2019 to March 2021. The funds also fund programs that", "The next Biennial should take the form of a symposium, with a view to presenting the work of each of the key artists represented in the exhibition. The first show will be held at the Redfern Art Gallery in September 2020. The second at the Art Gallery of Ontario in February 2021. The third exhibition at the Art Gallery of Ontario will be the first in the United States.\n\n\nThe Metropolitan Museum of Art in New York is preparing to welcome visitors to the institution, which has been closed since April 27 due to the Covid-19 pandemic, back to the public eye on May 5. The announcement marks the first time in more than two years that the museum has officially acknowledged visitors returning to the institution. In the interim, the museum has been working to prepare for a possible reopening, which is expected to be sometime in late June or early July.The announcement comes on the heels of a series of events that have faced the Met in recent months, including the June 15 announcement that it would reopen in mid-June, the May 31 announcement that it would reopen as planned, and the May 23 announcement that the museum would hold a month-long celebration of its fiftieth anniversary.Speaking to the Art Newspaper, Met director Daniel H", "The next Biennial should take place in 2020. All of the participating artists have agreed to participate in the event, which will feature new works by thirty-one artists in the form of a contest. “The exhibition should create an opportunity for its participants to develop their own critical and visual skills for creating an exhibition of their own works,” the exhibition organizers said. The artists chosen for the award include Amy Zambator, Antony Garner, Adrienne Edwards, Alison Kilmer, Claire McInerney, Joanna Pascual, and Magnus Paxton.\n\n\nRijksmuseum Amsterdam (Rijksmuseum) has announced that it is planning to open a new research center dedicated to the work of the Dutch master Jan van Eyck, a major influence on modern art and the Dutch-American collaboration, with a donation from the Van Eyck Family Foundation. The institution previously opened a Van Eyck museum in Los Angeles in 2018. Jan Van Eyck donated more than 500 works and a collection of ephemeral artworks that includes paintings, drawings, collages, and photographs, including Tic Tac, 1931, a pair of striped cotton trousers from the United States; Coffee, 1962,", "The next Biennial should be held in the spring of 2022. The festival will be held at the historic Tudor Palace in London between April 24 and April 28. The theme will be “Museums and Contemporary Art” and the fifty-third edition will run from April 7 to April 10, 2022.\n\n\nThe National Museum of Scotland is seeking a director following the departure of director Mary Anne Tobey, who was appointed by the then Scottish first minister, Alex Salmond.The institution describes Tobey’s departure as “difficult and unexpected” and says it is “deeply concerned by her departure and by her departure in such a tumultuous and uncertain time.” According to The Scotsman, Tobey had been a strong supporter of the institution for more than thirty years. She was instrumental in securing the 2012 Rio+20 and 2015 editions of the National Museum of Scotland, with investments totaling more than $1 million, and was also the driving force behind the decision to award the international stage and five exhibition spaces to the United Kingdom’s National Poetry Festival.Her departure follows that of director Anneke Wills, who departed the National Museum of Scotland in March 2019 after twenty-five years at the helm", "The next Biennial should bring together artists from all over the world who are involved in practices that address the interconnectivity of life and the environment. The theme should reflect the interconnectivity of life and the environment as an interconnected world with a common history. It should also connect with a global movement to decentralize power and to promote greater ecological awareness.In an email sent to the institute on April 22, the group said: “We are excited about this opportunity to present our work at the Museum of Contemporary Art for the first time. The Biennial will provide an opportunity for us and our artists to explore new ideas and new materials in a collaborative way.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles will resume hosting Richard Linklater’s Oscar-winning documentary film Short Term 12 as part of its “Oscars for Africa” series next month, reports Artnet. The upcoming event will see Linklater, director Lonnie James, and the Los Angeles–based nonprofit cityLab, which was founded by the late filmmaker George Lucas in 2004, stage a series of performances, screenings, and performances highlighting the work of African American artists in America.The announcement follows a wave of boycotts and protests against institutions", "The next Biennial should focus on “the relationship between art and the practices of the social sciences, and in particular the sociology of art,” the museum argues. The exhibition’s first installment, “In Defense of Art,” will be on view in July.\n\n\nAccording to Artnet News, the UK’s National Galleries of Scotland announced on Monday that it plans to pull its work by artist Adair Turner—a black-box, squarish sculpture whose sculptural works comment on the relation between the self and the environment—from the campus of the University of Exeter, where it was on display. The institution, which has been under scrutiny for displaying Turner’s work in a climate-controlled vault since 2015, has since faced mounting pressure to remove the work from the campus or face legal action. The university said that it will “fully comply with the governing legislation” and “take all practicable steps, including consultation and approval, to ensure that the installation is accessible to the public and is fair game for educational purposes.” According to the Art Newspaper, the painting was removed from the Galleries of Scotland in January 2019 in an “unfortunate incident,�", "The next Biennial should take place in 2029 and will be hosted at the Museo de Arte Contemporáneo in Madrid. The event will take place at the same venue as the body of artist Juan Perón, whose work was one of the earliest and most widely exhibited. The biennial was established as a vehicle to promote Perón’s work and draw attention to the cultural legacy of women in Spain, in 1954.The first edition of the Exhibition was held in March 1954 at the Museo de Arte de Madrid and was presented by the cultural institution in collaboration with the National Museum of Women in the Arts (MAMAN) in Barcelona. A second edition of the exhibition was staged in October 1955 and covered the same period as the first edition. The final exhibition was staged at the Museo de Arte del Beija (MAMAN) in Madrid in November 1966. It is currently under construction.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York is planning to shutter its iconic American art museum in partnership with the US Department of Veterans Affairs (VA), effective June 5. The move will result in a twenty-four-hour period of exhibition and public programming that will run for twenty consecutive days, instead", "The next Biennial should be held at the Kunsthalle Basel in February 2020 and be inaugurated by the exhibition “The Spirit of Capitalism: Art and Practice in Contemporary Art” (2016–17). The thirty-fifth and final edition of the exhibition will be held in October 2020.\n\n\nThe Santa Monica Museum of Art in California, which recently marked its thirty-fifth anniversary, has named Matthew Mulligan as its next executive director. Mulligan will be responsible for the development of the institution’s collection and exhibitions program as well as overseeing the development of its digital and digital collaboration platform. “Mulligan’s leadership has been instrumental in the museum’s transformation from a collection-oriented, artist-led institution to one that is truly community-focused and centered,” said Craig Alberts, president of the museum. “A true visionary, Mulligan is committed to reimagining how we think about art, and how we learn about art, to reimagine the role of art in our lives and our communities.”Mulligan currently serves as the director of the New York–based nonprofit the Urban Institute, where he has worked since 2014. During his tenure, he has developed new initiatives", "The next Biennial should have more than 20,000 visitors. It is currently planning a special exhibition, \"Museum Workshop,” to open in the spring of 2021.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has introduced new digital programs that will allow visitors to experience the museum as a part of the new $5 billion renovation and expansion of the museum designed by Guggenheim architect Frank Gehry.Launched in collaboration with Smithsonian American Art and curated by curator Laura Mulvey, the first program, called The Met, will connect visitors with works by artists whose works are currently on display in the museum, including Kenneth Ellsworth Kelly, Robert Irwin, and Ed Moses. The second program, called The Tug of War, will highlight artists whose physical exhibitions are currently on display, including Beatrice Eli, Susan Oliver, and H. L. Menchaca. The third and fourth programs, The Show, and “The Art of Building,” respectively, will provide visitors with an overview of the history of contemporary art and will address themes including urban planning, social justice, and the power of the environment.The Metropolitan Museum of Art in New York has also introduced new retail", "The next Biennial should be held in May 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released the list of seventy-four artists who have participated in the upcoming edition of the Palme d'Or, which will take place at the Palazzo San Marco in Venice, Italy, from October 25 to November 1, 2020. The twenty-nine-year-old theme, “Plumber, Painter, Mechanic, Trimmer, Singer, and Composer” is inspired by the long-standing work of artist Paolo La Brea, whose lifelike, diffusely colored geometric sculptures embody a range of popular concepts, including the body, the gendered-oriented practices of painting, sculpture, and music, and the many-legged creations of Italian painter Ciro Cavalieri.The artist-led exhibition was curated by Francesca Vergara and Lisa Bonelli, who also served as cochairs of the Art Basel Miami Beach and Venice fairs in 2018. Its twenty-two-hour open-air event will feature work by seventy-six artists, including Anselm Kiefer, Antony Gormley, Ann-Marie Malm, and Anita Lovelace, among", "The next Biennial should be on October 29 and should be organized by the artist. The exhibition will be on view until April 21. C-Art will present two new exhibitions in June. “The art of gardening: from lily pads to pots,” is a new project that will take participants to the gardens of the artist’s hometown and will examine the history of the practice in the form of sowing ceremonies, planting plans, and recipes. It will also focus on the process of growing food and will be a collaborative project between C-Art and the artist. C-Art recently celebrated twenty-four years in New York.\n\n\nThe Museum of Fine Arts (MMFA) in Boston announced today that it has received a gift of more than six hundred works from the artist Annie Pape. The gift includes works by twenty-seven contemporary artists, including Joan Miró, Ron Gorchov, Daniel Kjos, and Laura Kennelly, as well as works by more than fifty international artists, including Basil Shiner, Frank Stella, and Pierre-Auguste Renoir. The works are part of the museum’s exhibition “The Embrace of Nature: Art and Change in the 1960s", "The next Biennial should start in September, as planned. The theme: “Reasons for Unity.” Activists and scholars have long argued about the nature of collective actions, but the museum has yet to address the question of why the body politic engages in collective action. In a 2019 exhibition titled “Why Organize?,” Biennial director María Berrada-Gutiérrez asked: “What is it that makes a community action meaningful? What is the purpose of the action? And how does it relate to the action that is currently taking place?”\n\n\nThe Institute of Contemporary Art (ICA) in San Francisco announced today that it has elected Jodi Throckmorton as its next executive director. Throckmorton comes to ICA from the San Francisco Museum of Modern Art (SFFMoMA), where she has served as a board member since 2015 and serves as the senior director of institutional engagement and external affairs.“Jodi’s appointment represents an exciting new era at ICA and the City, as we move to a new era as we embrace our future as an open and connected city,” said SFFMoMA director Laura Sabaté. “", "The next Biennial should be held sometime in 2020, and the 2020 edition will take place at the newly established Museum of Contemporary Art (MoCA), the former home of the Los Angeles County Museum of Art (LACMA). The new venue will be inaugurated by a twenty-five-minute performance by artists from the Hartford Museum of Art (HMA), the new home of the William Shakespeare Company and the Metropolitan Opera. The performance will be followed by a solo exhibition of work by the American painter William Efstathiou.Among the artists chosen for the exhibition are Mahalia Miro, Rachel Whiteread, Hal Foster, Marcia Hennebaker, Robert Irwin, James Konrath, and Ryan Lee. The biennial will launch with a retrospective of the work of Italian artist Anselm Kiefer and will later stage the exhibition “Endless Rectifications,” which will feature works by artists such as Bernini, Guarino, and Carriçolara.The pavilion will be inaugurated by a presentation of works by two-dimensional artists such as Tommaso Varetti and Tacita Dean. The exhibition will also feature works by artists such as Robert Irwin and Olga Inés. The", "The next Biennial should be held in 2022.\n\n\nThe Art Newspaper in Paris has released the list of seventy-six galleries in the city that will participate in the upcoming edition of the French pavilion. The seventy-six galleries participating in the event are A.I.R. Gallery, the A.M. Group, Galerie Leopoldo and Edouard Bouillon, Gallerist Group, Galerie Marnini, Galerie Léger, Galerie Léger-Sisseton, Galerie Maag, Galerie Maag-Henrietta, Galerie Palais de Tokyo, Galerie Maudit, Galerie Marnini, Galerie Maag-Henrietta-Henrietta, Galerie Paolo Mazara, Galerie Paolo Marchetti, Galerie Paolo Marchetti-Henrietta-Henrietta, Confession Gallery, Galerie Maag-Henrietta-Henrietta, Carré Dessalines, Galerie Paolo Mazara, Galerie Paolo Marchetti-Henrietta-Henrietta, Chertoff Gallery, Galerie Maag-Henrietta-Henrietta", "The next Biennial should be held at the Blue Mountains, in the heart of Wales. South Africa’s Southern Architecture Biennial, which was rescheduled for March 2019, was canceled. The 2020 event will be held at the Durban Arts Festival, which will be held from March 26–March 28. The 2019 edition was centered around the concept of a new kind of city, the Durban Architecture Biennial. “The Durban Architecture Biennial’s display was that of a new kind of city,” Bjorn Barlow, the director of the Blue Mountains Biennial, told the Art Newspaper. “It was the first time that we had organized a exhibition of architecture in South Africa. I’m sure that we will continue to show architecture in Durban, but we need to think not just about what we want to build, but how we can build it.” The 2019 exhibition “Unseen: Architecture in the Streets,” curated by Barry Katter, featured work by ninety architects from thirty-six countries. The 2020 event will be centered around a new kind of urban landscape.Its opening will coincide with the sixty-fifth edition of the Durban Art Summit, which", "The next Biennial should be on May 27, 2020. The exhibition will be curated by Yuki Kondo, the director of the Biennale of Sydney, and will take up subjects such as Dance, Art, Design, Entertainment, Technology, Fashion, and Technology, issues that have been addressed by both social and cultural movements throughout history. There will be a grand opening reception celebrating the opening of the exhibition on May 25, 2020. The project was funded by the Australian Council of the Arts, with help from Bill and Melinda Gates. The full list of participating artists is as follows:Andrea Cadieu (Italy)Tiffany Cohen (US)Angelica Dallazko (Italy)Nicoletta Dallazko (US)Benedict Dallazko (US)Sara Dallazko (US)Julia Dallazko (US)Laura Dallazko (US)Claudia Dallazko (US)Claudia Dallazko (US)Franz Dallazko (US)Sara Dallazko (US)Yuri Dallazko (US)Julie Wilson (US)Benedict Wilson (US)S", "The next Biennial should be held in the fall of 2022. The committee headed by Ramesh Swamy, president of the Indian Institute of Science, Lucknow, also recommended the development of an annual award of $10,000 to encourage the exhibition of contemporary art in India.Swamy also praised the newly appointed secretary of cultural affairs, Manoj Sinha, for his appointment. He said Sinha has a strong record of delivering grants to the arts and humanities and for working with curators to stimulate public awareness of the artworks and their importance to India’s cultural heritage.The panel also voted to establish a new Memorial Art Gallery in memory of the many artists who perished as a result of the riots in Mumbai. The museum will be run by the civic body Diwali, which will also host the 2019 edition of the Vikramaditya Art Festival. The museum will host the museum’s first exhibition of new works by artists such as Teju Cole, Nargis Caid, Kartikeya Chakraborty, and Imtiaz Ahmed in 2021.\n\n\nThe Mondrian Museum in Milan has received a gift of eighty-five works by Italian artist Mihai Ghebremeschi, whose legendary over", "The next Biennial should be held in the winter of 2020. The contest is supported by various sponsors including the Hirshhorn Museum and Sculpture Garden, the Museum of Fine Arts, Boston, the Berklee College of Music, the Boston Children’s Museum, the Center for Contemporary Art, the Cleveland Museum of Art, the Charles Eames Foundation, and the William Berman Foundation. The twenty-first edition of the art fair, which will be held in the city, the United States, from February 26 to February 28, will be hosted by the Museum of Fine Arts Boston. The event will also feature a number of curatorial projects, including a presentation of work by five artists, a survey of the changing art of the American Southwest, and a discussion of contemporary issues. \n\n\nThe Nine-Factor Model of Style: A Practical Guide to the Art of Making It, edited by Leo Bloom, Paula Cooper, Diane Coleman, and Jeffrey Rosenfeld, will be released by the Museum of Modern Art in New York on January 21. The book was written and illustrated by Bloom, who is best known for his work on the visual arts and is the creator of the term fourteen-factor style. The newly revised guide, which was", "The next Biennial should be staged in the spring of 2022. It will be attended by a select group of twenty-eight artists, including Amada Cruz, Marco Cervetto, Micaela Cervetto, César Cervado, Tingani Hanrahan, and Gema Staneko. A biennial of the same name was also proposed for the city, but the project was abandoned after the collapse of the initial legislative package for the biennial in 2018.\n\n\nThe Haus der Kunst (HDK), a German art incubator, in Altenburg, near Mainz, has received $88,000 from the German government to continue its mission of supporting artists and incubating new work in the country. According to the New York Times, the grant was an attempt by the government to promote cooperation between local municipalities and the German Federal Institute for the Arts (BfA) as part of its principles for sustainable development.“We are very pleased with the outcome, especially in light of the difficult and dangerous situation Germany is in,” said Max Hetzler, director of the HDK. The grant was made as part of the Germany-US Strategic Partnership for Innovation, ", "The next Biennial should be held in early 2020.”\n\n\nThe French government approved a $10 billion aid package for the Parisian Charlie Hebdo offices on Monday, December 17, for the first time in history. The legislation, which still needs to be enacted into law, will give $8 billion in aid to help France recover from the devastating terrorist attacks that took place last January, and will also allocate $2 billion for cultural institutions in the city, including the Louvre, the Centre Pompidou, and the Musée d’Art Moderne.Since the attack, France has made great strides in restoring public order and protecting the cultural heritage sites. On January 18, President Emmanuel Macron announced that the total investment would total $32 billion, a sum that included the restoration of the Louvre and the Centre Pompidou, and the construction of a new grand-dublin-style building for the Centre Pompidou. The next annual event, named after the French philosopher Georges-Auguste Renoir, will be held at the Arc de Triomphe in Paris on March 22, 2020.The legislation also aims to create incentives for French arts and cultural institutions to create jobs and boost the employment prospects of under-", "The next Biennial should launch in the spring of 2021. \n For the first time in its history, the Museum of Fine Arts (MFA) in Atlanta will award a total of $500,000 in Art Fund Grants. Inaugurating the biennial are two first-time grants totaling $200,000. The first, made in collaboration with the Atlanta Art Museum, is focused on urban program and the second is dedicated to the development of an online platform to support the art of the city.The grants were made in recognition of the work of the past and the building up of the museum's collection and are in support of programs and initiatives in support of the cultural and educational mission of the MFA’s collection, the Black Arts Museum, the Atlanta Contemporary, and the school of the Art Institute of Atlanta. “We appreciate the support of our valued partners, the Black Arts Museum, the Atlanta Contemporary, and the School of the Art, which have made the MFA’s collection vibrant and vibrant, and whose artists have given life to the museum,” said museum director Dr. Donna Harte. The biennial is being organized in partnership with four of the five founding partners of the MFA", "The next Biennial should be ready by September. Viewing Room: Click here for full-size images. Artists & Exhibitions: Following the “Second Asian Art Biennial” in 2003, Artsakhnayeva Art Gallery was awarded the prestigious 5th Biennial Award. Artists & Exhibitions: Chang Singhau Gallery “The Power of the Sun: Sun and Rain in Ancient China” (2017) Chinati Art Gallery, China \"The Power of the Sun: Sun and Rain in Ancient China” (2017) The Art Gallery at Yale University, New Haven, CT \"The Sculptors’ Work from the Collection of L.A. Larson\" (2017)  The Contemporary Art Museum Memphis, Tennessee A-Frame: A Constructivist Look at Modern Art at the Contemporary Art Museum, Louisville, Kentucky A-Frame: A Constructivist Look at Modern Art at the Contemporary Art Museum, Louisville, Kentucky The Artist’s Studio at the Smithsonian American Art Museum, Washington, DC American Arts Photographer, John H. Gibson: The Avant Garde in America (2017) Art", "The next Biennial should take place in 2020.\n\nThe exhibition “The Handmaid” will be staged at the Museum of Contemporary Art (MoCA) in New York from May 23 to May 25, 2020 and will run until October 27, 2020. The exhibition is dedicated to the concept of post-traumatic stress disorder (PTSD). Figure artist Monica Grisanti, whose work explores the body and the self, and anthropologist Laurie Anderson will lead the exhibition.The exhibition will also feature works by women artists, including Kiki Smith, Carol Stroud, and Maren Rose, and will feature more than 22,000 images and artifacts from the artist’s collection, which includes new works by the artist, pieces he has created in the past, and artworks from the artist’s previous travels to Iran and Morocco. The first Biennial was held in 1992 and the second in 2009.\n\n\nSylvia Bénétière and François-Xavier Hallegué, director and CEO of the Frankfurt-based gallery T.C. Gallerie, have announced that they are planning a new exhibition, “Ateliers d’Art Contemporain Després,” that will", "The next Biennial should take place in the city in 2021.  \n\n\nThe world renowned architect Anne Imhof, who was appointed to the role of director of the Neue Galerie in Berlin in 2011, has died at age eighty-eight. Born in Vienna in 1938, Imhof studied architecture at the Vienna University of Technology (VIT) in the early 1960s and later at the University of Tartu in Estonia, where she studied under the Växjö School of Design and the Katte Kunst in Berlin, and then at the University of Vienna, where she received her doctorate in 1971. Her work is now housed in the collections of the Martin Luther King, Jr. Museum, the Institute of Modern Art, and the Nationalgalerie, and she is a cofounder of the Berlin Studio Group. From the early 1960s until her death, Imhof was active in the German cultural scene. She was active in the Künstlerhaus, the Römerischer Kunstverein, and the Kunsthalle München, and was a member of the international art advisory board of the Künstlerhaus in Vienna and the Kunsthalle München in Munich. Imhof was", "The next Biennial should take place in 2020, and the first exhibition in 2021. The biennial will consist of twenty-nine exhibitions that will be organized as follows: Artforum 2017: Artforum’s City Viewing Rooms.2017: Artforum’s New York City Viewing Rooms, which will open in 2020. Artforum’s New York City Viewing Rooms will be followed by a new exhibition, “Artforum: New York City Viewing Rooms,” which will open in 2021. The first show of the new series will be “3:30/6:30.5,” which will feature work by twelve artists. Other shows scheduled for the biennial are “The Artists in My Life Group,” which will be staged in 2022, and “The Artists in My Life Collection,” which will open in 2023.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Laura Preble as its next executive director, effective immediately. Preble comes to the museum from the California Contemporary, where she has served as director of public and community engagement since 2015. She succeeds Susan Ehrlich, who retired in February 2019 after fifteen years", "The next Biennial should be held at the Institut de Stade Louis Bienpital, Paris, in 2022. \n\nThe Cairo Biennial, which was originally scheduled for June, has been postponed to September. The exhibition had been moved to September 20 to coincide with the Egyptian month of Ramada, and to September 25 to coincide with the end of the month of Nir.“The decision to postpone the exhibition was made jointly by the artistic director and the curators of the exhibition, Atef Atoui and Abdel-Malik Salah, and was taken in order to avoid any ambiguities and issues that could hinder the functioning of the exhibition,” said Artnet. The exhibition will now be released in October. Last year, when the exhibition Nir is scheduled to open, the Egyptian government declared a state of emergency as the country entered a new stage of its six-yearly Algeria-Turkey War of Independence , and the last week of August saw the first mass demonstrations against the government in more than two months. The protests have since spread to other cities across the country, and the death toll from the unrest in Egypt has climbed to at least 236.The exhibition was", "The next Biennial should be held in 2020.  The next will be held in 2022. The next will host a biennial exhibition in 2023. And so on. I think the point is that we can't simply simply simply simply simply simply simply simply simply simply simply simply We can't continue to live without each other. We can't live without our surroundings. We can't live without our thoughts. We can't live without our dreams. We can't live without our hopes, our dreams, our hopes, our hopes, our hopes, our hopes, our hopes, our hopes, our hopes, our hopes, our hopes, our hopes, our hopes, our hopes, our hopes, our hopes, our hopes, our hopes, our hopes, our hopes, our hopes, our hopes, our hopes, our dreams, our dreams, our dreams, our dreams, our dreams, our dreams, our dreams, our dreams, our dreams, our dreams, our dreams, our anxieties, our anxieties, our anxieties, our anxieties, our anxieties, our anx", "The next Biennial should be held in 2020.\n\n\nThe New York artist-run biennial Warm Up, which explores the relationship between pop and art through a series of performances, had its first show in New York City this week, and the opening was attended by an audience of more than 1,500 people. The exhibition, titled “Jupiter’s Child,” was curated by Brooklyn-based artist Lloyd Banks, whose practice spans painting, sculpture, performance, and installation, and consists of a series of photographs that portray a constellation of star-like images, including those of a child and an alien landscape.Warm Up will take the stage at Lincoln Center on November 8. In addition to the biennial, the interdisciplinary show will present a collaborative project with the Brooklyn-based artist-run space thee65, which will launch a scholarship program in the summer. The project, titled “The Other Side of the Wind,” will focus on the relationship between pop and interior design, and will showcase the work of seventy-three artists and will include an open call for proposals. The exhibition will also feature new works by artists such as Daniel Libeskind, Adam Dover, Martine Kober, Ermanno Dorian", "The next Biennial should be held in the spring of 2021, but the organizers have yet to decide whether the 2020 edition will take up the theme “the body’s relation to the body’s environment,” a concept that is central to their work and is inspired by the Body Art Show in New York. Matt Smith, a production manager and curator, said: “The state of contemporary art today is a profoundly challenging and expansive one, and the Biennial is crucial in providing a platform for experimentation and renewing our capacity to be innovative.”\n\n\nThe Italian government approved a bill on Monday that will allow the public to salvage and reuse organic materials produced by the country’s largest industrial plants, including the Turin-Alto Adige industrial complex, which employs some 1,400 people. The bill, which was passed by the Senate on Monday, and is expected to be approved by the Italian parliament and the Italian president, Dario Franceschini, in the coming days.The legislation, which will grant the public ten weeks to decide whether they wish to participate in the process of reclaiming industrial waste, was prompted by the coronavirus pandemic\u0097from which Italy has yet to recover\u0097and was", "The next Biennial should focus on how the art of life, which is more than merely a collection of policies and institutions, comes into being. It should be a platform for the opening of new and different perspectives on community and culture, and for the re-creations of the body and the spirit. The 11th edition of the festival should be hosted at Barcelona’s Rajadores de São Paulo, the capital of Brazil’s northeastern state of Pernambuco, in December.The art historian and thinker Sergio Cornejo has been selected to serve as the next director of the Museu de Arte de São Paulo, which has a permanent collection of around 3,000 works and has been under the direction of the same director since 1989. Øyvind Bechko, who has been working as a curator at the international museum since 2000, will be the next director of the Kunsthalle Bern. The latest version of the annual Festival of Brazilian Visual Arts, organized by the Federal Ministry of Culture, aims to advance art and culture in Brazil through exhibitions, concerts, screenings, lectures, and other programming. The fifteen artists whose works are included in the exhibition are: Ato Iglesias", "The next Biennial should take place in the spring of 2020. “The many elements of this programme were forged by the team in partnership with the artist-based nonprofit, the Saint Petersburg Biennial Association, in collaboration with the artist-led Art Foundation for Contemporary Art (AFICA);” the organizers said. “Together we are creating something new, something that will last for generations.”The official selection of the biennial will be announced on September 7 and will take place at the Saint Petersburg Metropolitan State Museum from September 13 to September 21.\n\n\nThe Getty Museum in Los Angeles is reopening this week following a $2 million expansion, and will welcome the public to the building in the new year. The project, which involved the installation of more than 1,300 works and was co-led by the Museum of Contemporary Art (LA) and the Los Angeles County Museum of Art (LACMA), included the installation of new galleries for the museum, the renovation of the existing galleries, and the acquisition of several works that were on display in its original location on La Brea Avenue from the 1970s to the 1980s.“La Caja Los Angeles: The Visual World” will be on view in January 2020, and", "The next Biennial should be staged in 2021.\n\n\nCultural historian and curator Lee Friedlander—who teaches at the University of Dover and the University of Kent—has been appointed to the Royal Academy of Arts as a curatorial mentor. Friedlander serves as an adjunct professor in the department of art history at the university. Alongside teaching, he curates exhibitions at the museum, which has a permanent collection of more than 7,000 works, and is a cofounder of the website Gallery Talk. Friedlander has also held curatorial roles at the Museum of Modern Art (MoMA), New York, and the Museum of Modern Art, London. He will be responsible for the development of the Royal Academy in London and will contribute to the museum’s exhibitions and research initiatives for the next two years. Friedlander’s first exhibition at the Royal Academy was “Sensate in a Digital Age” (2017–18), a public art project that explored the relationship between digital technologies and the intersections between art and technology. It also featured works by several artists that have yet to be exhibited. The exhibition was organized by curator Karen Bradley and will open at the museum on July 17.\n\n\nThe New School in New York", "The next Biennial should take place in 2022, and the entire contemporary art of the Americas should be exhibited in a four-year cycle. The event’s advisory board—which includes Jon S. Mullen, president of the University of Phoenix; Wayne Chun, director of the Studio Museum of Contemporary Art, Los Angeles; and artist Ronald D. Walker—has also opened an online petition in support of the proposals.\n\nArtists such as Mary Ellen Mark, Sean Johnson, and David Salle have called for a boycott of the 2020 Rio+20 international art fair, which will take place in February, in an attempt to pressure major art galleries to cancel their events. Among the artists who have signed the letter are Susanne Vierhout, Adam Pendleton, Kayode Skembal, and Jonathan Ng.Artforum spoke with several artists to get their perspectives on the letter and the boycott.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has suspended projects and events until March 28 due to concerns over the coronavirus, which has already claimed the lives of at least 19 people in the United States and has infected more than 5,300 people in China. In a statement, the institution described the outbreak as “dev", "The next Biennial should take place in 2021, with a design by the artist Terry Southern. “Theatre architecture is about to enter a golden age,” said L.A.-based designer Joseph Lubin. “The next ten years will be transformative for the field. I foresee a new level of creativity, a new level of intimacy, and a new level of engagement with the communities that surround it.” Baldwin and his collaborators are currently collaborating on a new high-tech installation where visitors will be transported to the show’s Los Angeles home, where the show will be staged in two companion pieces, one of which will show on November 21, the other on November 27. “This is the last major exhibition of the artist’s career, after twenty-six years,” said Ali Gharib, a fellow and professor at the University of California, Los Angeles, who curated the show in 2015. “I think it will be an enormous honor to bring the work of Bruce to Los Angeles, and to continue his legacy of bringing works into the city to the people through the magic of technology.”The first exhibition organized by the artist will be a new series of solo shows in", "The next Biennial should be held in 2022.<|endoftext|>An anti-racist demonstration in London on Saturday saw pro-democracy protesters participate in a show of force by police against a large crowd assembled by right-wing politicians on June 15. The incident, which was captured on video by a passing motorist, saw dozens of police officers deploy to disperse protesters, many of whom were chanting, \"This is our home. This is where we belong. This is what gives us our identity. This is what we want to survive.”Organizers cited safety concerns for protesters—many of whom were carrying signs that read, in large type, “No to Terror!”—and the fact that some demonstrators were covered their faces with masks. A day later, the Metropolitan Police issued a second set of safety guidelines, clarifying that protesters must not cover their faces and that police may use chemical irritants and other non-chemical means to disperse crowds. With the second set of safety guidelines in place, protesters were able to march on June 16 to the British Museum, where Prime Minister Boris Johnson announced that the government is reopening the country to allow the public to return to the museums for a major public engagement. Many have since accused the government of stalling on", "The next Biennial should be held in 2021. However, the museum is currently in the process of reconfiguring its current exhibition spaces in order to accommodate the needs, wishes, and needs of children living at home. The exhibition will be redesigned, and the Children’s Zone will be moved from the museum to a nearby public space, the Eastside, and will reopen in 2021. The new exhibition spaces will be located above the entrance to the building, which will be reconfigured to accommodate larger-scale exhibitions, and will be inaugurated with “Anthropocene: the future we want.” The redesign is part of a $5.3 billion overhaul of the Eastside, designed by the London-based firm Waltham Woodcock. The project, which was announced in November 2018 and is projected to be completed by 2020, includes the demolition of the existing Artspace, the renovation of the existing exhibition spaces, and the addition of more than sixty new spaces to the Eastside.“We are making an enormous investment in support of the Eastside’s future,” said James Crewe, managing director of Tate Britain. “This is the largest renovation project in its history, and we are confident that", "The next Biennial should be announced in early March. \n\n\nThe Institute of Contemporary Art (ICA) in London has appointed Laura Levey as its inaugural director. Levey joins the institution from the New Art Gallery in London, where she has served as deputy director for the past two years, and inherits a distinguished landscape and art-historical collection.“Laura is a talented and passionate curator with an amazing history at the ICA who has made an indelible mark on the ICA and on the art world in general,” said Mark Serota, director of the ICA and the ICA. “Her leadership qualities, talent, and passion will make her a strong and even more valuable partner in taking the ICA to new heights, and we look forward to her continued leadership of the ICA.”In her new role, Levey will work closely with the ICA’s executive board to shape the trajectory of the organization’s upcoming twenty-fifth edition, “Between the Sun and the Moon,” which will take place in late spring 2020 and will culminate with the debut of a new work by artist Kirskita and the reopening of the ICA’s new permanent collection", "The next Biennial should take place in the spring of 2021, in the city of Biennale. The city’s architects, Paolo Tosatti and Paolo Bickel, have already announced that they are planning to open a new exhibition space in the museum, which is located in an industrial area in central Florence, in the summer of 2021.The project is supported by the Florence Foundation, the CUNAD Foundation, and the European Commission.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is reopening to the public shortly after its temporary closure was lifted on March 22 due to the coronavirus pandemic. The museum will reopen in phases, beginning with a new exhibition titled “A New Beginning: Art and the Coronavirus,” which will explore how art and technology are interwoven to shape our collective futures. The show is scheduled to run from March 25 to March 28, 2020.“The future of art and technology is at the forefront of our minds and our hearts,” said MoCA director Marc-Olivier Glimcher. “We are launching to the public with the intention of reopening as quickly as possible. This will be the first", "The next Biennial should be three years from now. “This is a chance for us to re-imagine the future of the exhibition,” said Simon. “The exhibition is a vital resource for many young people and we are actively working to rebuild the exhibition’s relationship with our galleries.A full-time museum staff member working in the commercial sector works six days a week, seven days a week, and twelve days a week. This means that the artist’s time is of crucial importance to the running of the museum and we are striving to bring more of this to life for visitors.”Commenting on her team’s activities, director William R. Landon said: “We are thrilled to have Emma, Nargis, and Jack in our booth. They work with passion and energy to present artists’ ideas and design projects that transcend their personal visions. We are confident that their work will attract many young audiences to our galleries.”\n\n\nArt historian Milena Noriega, who cultivated a body of work that includes works on subjects as diverse as the Holocaust and Spanish colonialism, has died at age eighty-eight at her home in Buenos Aires. The author of more than three", "The next Biennial should take place in 2020, the organizers said.\n\n\nThe Somme and the Pétain-Pétain National Monument in France — which are currently under consideration for reassignment to the French Ministry of Culture—are now the subject of a fierce backlash from cultural activists across the globe. In the weeks since the monuments were declared illegal, dozens of French lawmakers penned an open letter condemning the decision. On Monday, a similar list of lawmakers signed an open letter acknowledging the monument’s historical significance, but arguing that its dismantling would amount to a “repatriation,” or erasure, of France’s image in the world. Since the move was made on October 14, French President Emmanuel Macron declared war on the illegal monuments, which were erected in the aftermath of World War I. He also ordered the dismantling of the entire building of the National Museum of the History of Modern Art (Monet), a UNESCO World Heritage site, in Paris, and the dismantling of the building of the Casa Comédie de l'Art et l'Histoire in Val-de-Marme, a UNESCO World Heritage site in the Marne, near Lyon.According to Le Monde, the dismantling of the", "The next Biennial should be held in the autumn of 2021. Its assessment will be based on a review of the theme “Awe-Inspiring Life:” and the exhibition’s artworks. The Biennial will then become a platform for the artists represented in the exhibition and will be hosted by the South Korea pavilion.\n\n\nThe British Museum, Britain’s oldest surviving cultural institution, has appointed Adam Elliott as its first director. Elliott comes to the institution from the Solomon R. Guggenheim Museum in New York, which he has led since March 2019. The institution, which recently celebrated its sixtieth anniversary, was founded in 1888 and is located in the former textile mill town of Folkestone. Known for its modern and contemporary art, the museum serves some 130,000 visitors each year.“Adam’s appointment gives us tremendous confidence, both on the grounds of the Guggenheim and the contemporary art movement, of his keen and long-standing commitment to supporting the Guggenheim and its exhibitions, his curating of the Biennial and the future of the museum,” said Guggenheim director Len Temkin. “As we look to the future, with great", "The next Biennial should be held in late April or early May. The 2020 platform will be the same as the 2017 event, which was held at the Museum of Contemporary Art Los Angeles. The biennial will also mark the fifty-fifth anniversary of the company, which was founded in 1988 by J. Paul Getty and his son Donald, with the Getty Museum as the founding partner. In a statement, the Getty said: “We are thrilled to be sharing a stage with the world’s most distinguished artists and artists’ families, especially among our own peers. We hope that this special partnership will inspire others to believe in the internationalism and creativity of the Getty and become an example for the world.”\n\n\nThe City of London (C.L.O.W.) has launched an initiative to help compensate cultural workers whose livelihoods are being disrupted by Superstorm Sandy. The funding will go toward organizing protests, advocating for changes at the local, state, and national level, and educating the public about the financial and logistical challenges they face.“This is a crisis that affects everyone—not just the most vulnerable and hardest hit, but everyone in every part of the United States,” C.L.O.", "The next Biennial should be held in 2021 and will be supported by an additional $3 million from the crowdfunding platform KickStarter. The presentation will be curated by Laura Mulvey, director of the Center for Art and Art History, the University of California, Los Angeles, and will include a number of works by the biennial’s curators, including Hauser & Wirth’s X-Ray Boiler Room and the exhibition’s inaugural exhibition “The Strange and the Ordinary,” which was organized alongside the tenth edition of the Kennedy Center for Performing Arts, which was held in March 2019. “It’s an exciting time to collaborate with other artists and institutions in Los Angeles and to be able to present work by the best in L.A.,” Mulvey told the Los Angeles Times. “I’m looking forward to working with the artists who will create new work for the biennial, which will return to the city in 2021. I also hope the invitation will draw some of the world’s most influential, innovative, and compelling artists to share an intimate visual-art experience in Southern California.”The Biennial will be staged in partnership with the California Academy", "The next Biennial should be announced shortly after.\n\nInaugurating the biennial are the fourteenth and fifteenth biennials in Bristol\u0097the inaugural in London, and the inaugural in New York\u0097each taking place from September 5 to September 13. The biennial will also feature an exhibition of new works by twenty-one artists in the city, as well as a special selection of works from the collection from the Hirshhorn Museum in Washington, DC.Sophomore biennial exhibition curator Anna Fobert, who has helmed the biennial since its inception, said: “We are thrilled to be launching the thirteenteenth at the Hirshhorn Museum and Museum of American Art in Washington, DC, with the full support of the Hirshhorn Museum’s board of trustees. We are also thrilled that our inaugural exhibition ‘Inaugurating the Imagination’ will now be presented alongside the work of the artists whose work we selected as the thirteenth.”The Hirshhorn’s director, Bernadette Ganz, added: “We’re thrilled to welcome the biennial to the Hirshhorn. This is a fascinating year for art, and we’", "The next Biennial should take place in the spring of 2021. The Art Newspaper reports that a statement issued by the institution on Monday reads: “The Biennial is a human body and cannot exist without the presence of the soul, nor can the Biennial be completed without the soul.”\n\n\nThe Metropolitan Museum of Art in New York has responded to the recent tragedy in Charlottesville, Virginia, by extending the opening of its exhibition “Beyond Blue: Art in the Age of Black Power” from March 21–March 22 to March 23–March 29, 2021. The event, which was organized by the nonprofit the Museum of African Art and the Museum of Modern Art, will now run until March 27, 2021, with a new title, “Beyond Blue: Art in the Age of Black Power II.”The announcement follows an outpouring of anger over the weekend, when a woman intentionally drove her vehicle into a crowd of counterprotesters, killing one person and injuring at least twenty-nine others. The attack took place on Saturday, when hundreds of people were protesting a white nationalist rally organized by the group Patriot Prayer. While the exact details of the circumstances surrounding the attack are still unclear, the authorities have yet to establish a motive.The", "The next Biennial should be announced soon.\n\n\nNew York’s Metropolitan Museum of Art has received a $35 million donation from the Marcus Garvey Foundation for the Arts. The gift is the largest gift made by the foundation since it was founded in 1984, and surpasses the $30 million donated by the Marcus family to the Metropolitan Museum of Art in 2017, a milestone given the museum’s proposed expansion, which would push the museum further into the future.“It is a tremendous honor to receive the Marcus Foundation for the Arts’ generous support,” said Roberta Smith, the foundation’s president and CEO. “This is the largest gift made by the Foundation to the Met since its inception, and it reflects the deep appreciation of the museum community for the work of the Marcus Garvey family. We are confident that this gift will help the museum continue to flourish as a major cultural destination in the heart of Harlem and across the world.”The foundation also announced today that it is giving $25 million to the Helsinki-based arts and culture organization TRADOC - the Helsinki Cultural Fund for Cultural Exchange,” as well as to the Helsinki Arts Council, which is organizing an exhibition of new"]