["The next Biennial should be announced next week and will be followed by the 2019 edition, which will take place at the Museo de Arte Contemporáneo, Madrid. The event will also be held on a smaller scale in the city of Salamanca, Spain.\n\n\nThe Museum of Modern Art (MoMA) in New York has settled a landmark lawsuit over the sale of works by conceptual artist Jacques-Louis Moinet. In a $1.8 million settlement, the institution and two of its affiliates—the Metropolitan Museum of Art and the Whitney Museum of American Art—will jointly pay $65 million to the plaintiffs who also assert that Marc Jacobs, the former head of LVMH, illegally withheld proceeds from the sale of their works.The suit—which was filed by the Californian plaintiffs—claims that the institution violated federal bankruptcy law by refusing to return their commissions. In a ruling published last week, Judge Robert Cardozo of the New York Supreme Court found that the museum failed to adequately address the claimants' claims and denied the defendants' request for class certification. He also found that the museum failed to rebut the artworks' claims for common law value, which the plaintiffs claim was limited to $100,000.The defendants", "The next Biennial should be held in 2020. The artist-led initiative was founded by Joji Nara and Hiei-go, a trio of young South Korean artists, in 2013 in response to the country’s rapid political and societal transformation. The Biennial was initially held in 2013, but was moved to 2020 in an attempt to avoid disrupting the current academic year.In a 2018 essay for Artforum, Nara and Hiei-go wrote that the decision to delay a major exhibition was made after they came up with the concept for the new festival. “When we were developing the concept for the upcoming biennial, we realized that the conference was not going to happen in the same year as the biennial, yet we have been preparing for the exhibition for almost a decade,” Hiei-go said. He added that the exhibition will take the form of a series of exhibitions, with the first exhibition being “Mirror Mirror,” which will open in 2021 and will run for twelve weeks.The first exhibition, which will be located in Hong Kong, will feature two new works by the group. Among the works scheduled for the exhibition are “Icarus Project” (2019), which was", "The next Biennial should be a celebration of our history and our collective creativity. In the meantime, we will continue to innovate, challenge, and delight our audiences and students, and continue to grow as a society and as a medium through which to share our richly imaginative works.\n\n\nThe Children’s Museum of Chicago has revealed that it is suspending its fall–spring 2019 exhibition season and will instead launch a new initiative focused on supporting local artists through spring 2020. “We are thrilled to launch the new initiative with the hope that it will be a source of inspiration for our artists and encourage their creativity,” said Jaye Rhee, chair of the Children’s Museum’s board of directors. “The initiative will give artists a platform to share their stories and work openly with the Children’s Museum for a new and exciting chapter of their lives.”The initiative will be led by curators Tanya and Tobe Knapp, who will create a series of immersive, site-specific works based on a theme park in Chicago’s Near West Side, and will be inspired by the theme park, Neighborland, where the Knapps first began working together. As the Knapps grew in influence", "The next Biennial should be held in 2021, but the organisers have since said that the date will be decided in consultation with the City of Bergen, which has a twenty-year lease of the site. \n\n\nThe National Gallery in London has named Nazar, a newly restored nineteenth-century Georgian building located on the north bank of the Thames, as the capital’s 2020 theme. The installation, set within the National Sculpture Park on the site of the former Royal Festival Hall, will include work by seventy-two artists from seventeen countries.“The National Sculpture Garden is a truly international museum, and we are delighted to continue to push the limits of what is possible with our new partnership with National Gallery London,” said Adrian Wootton, director of the National Sculpture Garden.Wootton added that the new partnership brings together four elements, including glamour, history, exhibition, and exhibition, and the National Sculpture Park, which has hosted twenty-two exhibitions since it opened in 2001. \n\n\nThe British architect Frank Gehry has been awarded the National Architecture Biennial (BA10) for his design for the Tate’s new £8 billion Tate Modern in London. Born in", "The next Biennial should be held in 2021, but the date has yet to be decided. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Stephanie Vassallo as its new executive director and chief curator. Vassallo will be responsible for overseeing the efforts of the museum’s staff to present a new work each year, as well as serving as a liaison for collectors, curators, and art-world professionals.“Stephanie Vassallo embodies a strong, optimistic, and welcoming spirit, both on the world stage and at MoCA,” said David Winton, chair of the board of trustees. “Her strong cultural and professional relationships, combined with her passion for art and her commitment to helping artists, make her a strong partner for MoCA. We look forward to working with her to advance the museum’s mission and grow our portfolio of works.”Vassallo joined the institution in July 2019 as associate curator of modern and contemporary art. Previously, she served as director of curatorial affairs at the Independent Museum of Art, Los Angeles (IMLA).“Stephanie Vassallo’s appointment is an enormous honor, as she has helped shape the Museum", "The next Biennial should begin with the design of the exhibition and its platform. It should include a live performance, photography, video, and installation. The theme must reflect the audience’s expectations of modern art. The biennial’s program should reflect the themes of the coming year. The theme should also inspire reflection and reflection on the themes of the preceding years. \n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Melissa Akin as its new associate curator of modern art. She will be responsible for organizing and shaping programming that will highlight the work of contemporary artists and will be responsible for training future curators.“Melissa’s experience, in both the visual arts and the biennial, will complement the expertise of our talented and dedicated curators, and will serve as a good starting point for future research and development at the museum,” said museum director and CEO Larry Fink. “I’m looking forward to seeing how she will bring the exhibition and program to life for the museum’s visitors.” Among the upcoming projects for the curatorship are “The Project,” featuring the work of the Vermont-based artist Jenny Holter, “The Cru", "The next Biennial should be held in 2020, with the first exhibition taking place in 2021.The event\u0097which was established in 2000 by Vijay Mallya and Workshop curator Omid Kordestani\u0097will be hosted by the Burmese Cultural Center in Bangkok and will run from March 18 to March 21. The opening ceremony will be held at 1 PM on March 22.The show will include the work of seventy artists and will be curated by artist Cengizadej, who will be collaborating with Delwin Sy Araw and Nina Vervoordt of the Buddhist Art Museum in Bangkok. The next edition of Biennial Bangkok will be held at the National Museum of Asian Art in Bangkok in April 2020. \n\n\nThe New York City Department of Cultural Affairs announced today that it will grant the New York–centered nonprofit arts incubator Dia Art Institute (DIA) a $50,000 grant in support of its expansion and modernization of its space in Midtown Manhattan. The announcement follows a $125,000 gift from the Dia Art Foundation, the Dia Art Fund, and the David Rockefeller Family Fund. The Dia", "The next Biennial should be held in 2021. Hopefully we will be able to continue the work we began in 2022 with a new exhibition and new project, with a new theme, and with a new format. For now, we are extremely grateful to the many artists and institutions who have participated in the Biennial.”The 2019 iteration of the event, titled “Art in Balance,” featured more than 1,500 works by more than 120 artists, including Alberto Barajas, Béla De Baro, Andrés Alarcon, Lázaro Cattelan, Isabel Oprín, László Poznanski, and Kiki Smith. “Since we announced the 2020 event, the numbers of artists who have participated have continued to increase, and the number of works that have been selected for the 2020 event has increased as well. So, we are very excited by the possibilities of an event devoted to art in balance\u0097and excited that this year’s event will be the last,” Nestor Rotimi said. The artist-in-residence program will continue to meld with contemporary art and contemporary life in New York City and will be modeled after the Brooklyn Museum’", "The next Biennial should take place in 2022, featuring works from the museum’s collection but not yet on view.\n\nThe Biennial of Modern Art (BMA) in New York has announced that it is in the process of revamping its upcoming exhibition “Legos: Futurism, Politics, and the Making of Modern Art” in an attempt to better reflect its contemporary cultural landscape.Launched in 1961 by Robert Frank, a self-taught artist who lived and worked in a commune in the Bronx, New York, the exhibition was originally conceived as a way for Frank to address the legacy of the Doll House. Curated by Loring Randolph-Sanders, a veteran curator and art historian, the exhibition was paired with the Dreyfuss/Schermerhorn retrospective, which focused on the development of twentieth-century art in the United States.In the 2014 exhibition “Fourteen Years of Moving Objects” (the same exhibition was staged in 1988), Paul Hoffman, the executive director of the Museum of Modern Art (MoMA), said that the redesigned exhibition will “explore the interconnections of materiality and form, the role of art in politics, and the role of art in our lives.", "The next Biennial should be held in 2020. On behalf of faculty and the school, I thank everyone involved for their cooperation and look forward to seeing you all in 2021. \n\n\n\n\n\nNatalie Johnson, Jamie Jackson, and Sadie Russell. Courtesy of the artists.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Natalie Johnson, Jamie Jackson, and Sadie Russell as the next directors of the museum. Johnson has served as interim director since June 2019, and Jackson has served as the interim director since June 2019, when she departed to pursue a career as an actress. Russell, who has served as a curator at the museum for fifteen years, has served as director since April 2019.“We are thrilled to welcome these four extraordinary women to our team,” said Museum Director Matthew Teitelbaum. “Their passion and talent for art and their ability to bring diverse audiences together are inspiring. They have the ability and ability to bring new perspectives to the institution and to shape its trajectory. Their diverse interests and backgrounds will be vitally important to our mission of presenting work from the artists whose voices resonate with our mission.”Johnson, a Chicago native, has helmed the museum for", "The next Biennial should take place in 2020. \n\n\nThe Cincinnati Art Museum (Cincinnati) is planning to open a new $30 million, 360-degree museum in the city of Cincinnati in 2021. The museum will be situated in the former factory buildings and will include spaces for exhibitions, educational programs, and research and are currently searching for a site for the institution.“The museum will stack the history of the Cincinnati area with its leading artists and the artists of the region,” said James Cuno, the museum’s executive director. “From the early 1960s to the present day, artists and craftsmen from the region have been and continue to be part of the museum’s collection and the city’s cultural ecosystem. We are excited that this piece of American history will finally be opening to the public and that it will be the first time that the entire museum will be open to the public.”Cincinnati’s Art Journal, a publication that addresses the history of art in the city, recently published an article about the upcoming museum dedicated to the work of Martin Luther King Jr. The article describes the upcoming museum as a “perfect fit for its location in the city’s historic district.", "The next Biennial should be held in 2020.\n\n\nThe Korean city of Gyeonggi Province, which was forced to close its museums in March due to the coronavirus, has received another gift: an 18,700-work collection of Korean folk art, called Sungjong: Korean Folk Art, from the Museum of Modern Art in Seoul. The move is a continuation of a program by the Japanese American Museum in Seoul, which received a retrospective of folk art from the Museo de Arte Contemporáneo in Madrid last year, and is the first time the collection will be presented in the country. The exhibition, titled Sungjong: Korean Folk Art, was organized in partnership with the Museum of Fine Arts in Seoul and the north Korea-based museum, which has about 2,500 works on display, and will run at least five more years. The artworks are from the Seongju-do region of southern Korea, which has been plagued by crippling poverty and unemployment since the pandemic began, and include works by the Andamanese ceramists Prabiraj and Uma Arora, the Southerners Kim Eun-kyung and Kim Kyung-kyung, and artists", "The next Biennial should be held in 2020. For a full list of proposed dates and more information, see the Artforum advertisement here. \n\nThe biennial will be held in the Central Park Conservancy’s (CPC) East River location, which is currently undergoing a $500 million expansion. The new location will be inaugurated with a presentation of the eleven works on display in the exhibition “Central Park: The Exhibition.” The exhibition will also feature new works by artists of color, including Adrienne Edwards, Chiharu Takemoto, and Patricia J. Martin. The second and third editions of the exhibition will be held at the Plaza de Artes Plásticas, in the city of Santa Fe, and will be followed by exhibitions of work by the following artists and their studios: ELLA BLONDE, PATSY ROGERS, ERIC KASICH, Yvonne Rosenblum, and ROBERT YEAST. The third edition will be held at Rockefeller Center and will be led by LAURA LOVERY.“The pieces in this exhibition represent the diverse histories and identities of New Yorkers, and it is my hope that this series becomes a catalyst for New Yorkers", "The next Biennial should take place in 2022, the Los Angeles Times reports. In the meantime, the UCCA museum has erected more than a dozen new works in the last twenty years. The following artists will be represented at the 2019 edition of Art Basel Hong Kong:  Alberto Barrios & Sergio De Jesus (1241)Artur Bache (1237)Vincent Bonfortele (1234)Karolina Gubel (1220)Luis Bueno (1218)Luis Álvarez Bocanegra (1210)Marco Bocanegra (1208)Luis Chini (1208)Riccardo Cipolletta (1203)Lorenzo Cipolletta (1290)Juan Carlos Izquierdo (1293)Bubba Kajb (1297)Olivier Narsu (1295)Tanja Narsu (1323)Arturo Pires (1217)Kasia Pires (1205)Sara Pires (1205)Ming Wong (1219)Kaira, Wangechi Khan (1208)Joel Spero (1356", "The next Biennial should take place in the summer of 2021. “The new paradigm of Art and Governance, the creation of a new kind of Art Center, is at the core of the new Art and Architecture Museum’s mission,” Werner Bächli, chair of the board of trustees of the institution, wrote in an open letter to the gallery. “It is the future we are creating. We are not creating the past. We are creating the future that other cultures have never created.”The institution will also be led by Christie’s director Kent Jones and his wife, Mary, who will share a chief curator’s role. The couple already helmed the new Walker Art Center in Minneapolis, where the upcoming exhibition “The Force and the Future: Science Fiction,” will take place in the fall. In March 2018, Kent Jones opened the museum in a former Soviet storage facility in the suburb of Saint Paul. The museum will be inaugurated by “Into the Night: Greco-Roman Art and the Dark Night,” a solo exhibition of work by three artists in the New Art exhibition in September.\n\n\nThe 2018 Whitney Biennial, “Beyond the Frame:", "The next Biennial should be in 2022.  Seoul Biennale will also host a new exhibition, Gathering and Performance, aimed at showcasing the work of South Korean artists in 2022, and The Global Contemporary Arts Summit will feature new works by fifty-one artists from twenty-one countries in 2019. Following the biennial, organizers will stage the Japanese pavilion at the seventy-fifth Venice Biennale in 2021 and the French pavilion at the forty-fifth Venice Biennale in 2018.\n\n\nThe National Museum of Fine Arts (MoFA) in Washington, DC, is planning to move its two remaining sets of acquisitions from the United States to China. The museum will open its new headquarters in the spring of 2021, but the building will not be completed for another six to eight months.The museum will remain closed until March 22, 2022, at the earliest, when it will unveil its first exhibition of work by American artist Fredy Simor, whose work was featured in previews of the new National Geographic’s Planet Earth II, which will encompass works from the museum’s collection. The announcement marks the first time the museum has announced an immediate plan to move its holdings abroad. MoFA", "The next Biennial should take place in 2019. The institution currently has a space for 125 participants, the largest number of visitors in the country.\n\n\nThe Visigothic Museum of the City of New York in Queens has been gifted the uncompromising gift of the body of Queen Elizabeth I at the historic site from the Italian Renaissance architect Zaltani. The three-thousand-year-old body, which is currently housed in the Museo das Beguides, a former Jesuit mission in the city, was transported to the island of Mallorca, where it will be displayed in the institution's permanent collection.The gift was made by architect Luigi Dall'Anto, who was commissioned to design a new museum for the Tudor palace of Jasmin in the city of Pozzuoli on the island of Mallorca, Italy. The project, which involved the removal of more than one hundred artifacts from the Tudor palace, was completed in 1991. \n\n\nThe California Council of Architecture (CCA) has released a list of fifteen designers who were shortlisted for the 2020 William Henry Fox Chairship by the American Institute of Architects (AIA) in the second round of the design contest. The", "The next Biennial should include a large-scale project by the online-only artist-run biennial, which was shut down in April after police used tear gas to disperse protesters in Charlottesville, Virginia. The organizers are working on a new platform that will present selected works by the artists on a platform that will offer them a weekly cash prize.The new platform is called the Biweekly Prize; it will award $30,000 to five artists for each week of the biennial\u0097including the spring, summer, and fall. The first biweekly prize winners will be announced in the spring.\n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) in Philadelphia has received a gift of two new works by German-born, Philadelphia-based artist Naima J. Keith. The museum has named Holly Kratz, the director and chief curator, as its next interim director and chief curator.Kratz joins PAFA from the Museum of Fine Arts, Boston, where she most recently served as senior curator of late American art, and is the founder of the eponymous studio. She currently serves as the director of curatorial affairs at the Tennessee Valley Authority (TVA), where she is responsible for identifying the work of emerging and established artists and bringing", "The next Biennial should continue to focus on the work of artists whose practices are intersectional and are reemerging in new contexts, and we will continue to push for new research models and for the development of the exhibition.”\n\n\nThe Doris Duke Art Museum in Durham, North Carolina, has released new guidelines for the display of works in its current exhibition, “Masters of Their Instruments: Art and the Art of Music” (When Masters of Their Instruments,” October 16–November 21, 2020), which focuses on Duke’s pioneering work in the field of music theory. Among the works on display are work by Phillip Schaffner, Ernst and Gerhard Richter, and Ed Moses. The guidelines, which are based on the museum’s own internal academic cataloguing, are meant to facilitate the exhibition’s “intimate exploration of how Duke’s design of the exhibition, articulated in a new way that engages with the institution’s original vision, has changed and is changing the museum.”In order to facilitate the exhibition’s exploration of how Duke’s design of the exhibition, articulated in a new way that engages with the institution’s original vision, has", "The next Biennial should take place in October 2020 and will present some of the earliest works by MFA artists in the United States. The exhibition will feature work by fifty-five artists selected for the 2020 Biennial. Titled The Century of Art, “The Modernist and the Contemporary” will feature work by forty-eight artists chosen for the 2019 Biennial in October 2020. The exhibition will rise to the occasion as artificial intelligence and artificial intelligence-enabled robotics advance rapidly. The show will feature the first public exhibition of MFA’s new curatorial program, called The Future of Art, in Los Angeles in September 2020.The 2020 edition of The Biennial will open at the Museum of Fine Arts, Miami Beach, on October 15. \n\n\nThe Pulitzer Prize–winning artist and activist Hoechst Charles was just awarded a $100,000 MacArthur \"Genius\" Grant. The $100,000 grant was established by the MacArthur Foundation in honor of Charles’s lifetime achievement award. Charles’s work, which includes his first solo exhibition, “The Life and Death of Living Pictures” (1965), at the Barbican Center in London, the 1964 Chicago Biennial, “Back", "The next Biennial should be held in 2020, but the design of the venue was changed due to financial reasons in 2017. The reopening of the exhibition in February of 2021 was postponed due to the Covid-19 pandemic.  The exhibition, which focuses on contemporary art, is housed in the Museum of Modern Art (MoMA), and is now held by the Visual Arts Foundation.\n\n\nArt in the City, a new initiative launched by the nonprofit art preservation organization the William Jewell Foundation, has donated $10 million to the Brooklyn Museum in exchange for two local sites in the city, one of which is within walking distance of the other. The organization hopes to increase the amount of work the museum does for the local community by tenfold.“The William Jewell Foundation is committed to supporting local, state, and federal efforts to create new opportunities for the arts and is pleased to donate $10 million of its own funds to the Brooklyn Museum to gain new insights into the local, state, and federal arts ecosystem,” said Mark Dimin, president of the William Jewell Foundation.The two sites, located on the same block of Seventh Avenue in the Bronx, will be named after William Jewell, who served as a board member", "The next Biennial should be held at least fifteen years after the modern and contemporary art biennial. In addition, the museum should carry out an exploration of the legacy of Ebo al-Qasimi, the Tunisian artist who studied under Flemish and Dutch masters and whose work was painted on canvas and stucco for a time in the 1960s. The new biennial will also include an exhibition of works by the Saada Group of artists, including Wangechi Mutu, Kiko Musashima, and Suleiman Abu Hamdan, and will be organized in conjunction with the twentieth Venice Biennale. The exhibition will also mark the museum’s first-ever presentation of Nabil Saad’s work in the United States. The artist and curator will present works at the San Francisco Museum of Modern Art (SFMoMA) in October 2020, and at the San Diego Museum of Art (SDM) in March 2021.\n\n\n\n\n\nAs the global health crisis worsens and the number of people infected continues to rise, the British Museum in London announced on Friday that it plans to close its doors for a period of twenty days to allow the virus to settle in the UK. According to The", "The next Biennial should take place in 2021.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) is planning to reduce the number of its exhibitions by as much as three hundred by the end of the year. The institution has already cut the number of its upcoming events by nearly twenty-five times over the last eighteen months.It announced that it was reducing the number of exhibitions by fifty-eight in a May 21 letter from director Marc Straus to people who will be affected by the change. According to the letter, the museum is evaluating the impact of the roster reduction on the main exhibition programs, and will determine the length of the program based on whether the museum is able to hold more exhibitions.In order to avoid overcrowding, SFMoMA will use the same exhibition halls as it has for a decade—although it will likely be reorganized into four new buildings that can hold more exhibitions. The museum will also introduce a new interactive program that will showcase works from the collection on a larger scale. In addition, it will likely expand its collection by fifteen hundred works, which is about ten percent more than it currently has.The museum’s current exhibition hall, which opened in 2007, will remain open through March 20, 2020. The", "The next Biennial should take place in 2022.\n\n\nThe Museum of Modern Art in New York has appointed Laura Owens as its next director. Owens was previously director of the MIDWESTA, the MIDWESTA Project and the MIDWESTA Bicentennial. She succeeds Dina D'Aleo, who was hired to lead the museum in August.“Laura has demonstrated an exceptional track record of developing and building an exhibition-based model for the museum,” said Museum Deputy Director Mary Anne Tobin. “Her work has been instrumental in shaping the museum’s portfolio of exhibitions from an international history museum to a modern art museum. Her leadership and vision for the museum have shaped the museum into becoming a national treasure in New York City.” Owens’s announcement comes a little more than a week after the institution revealed that it is expanding its collection by creating three new spaces for scholarship and public programming. The new spaces will be located in the museum’s former space of the Arts and Culture, and will open in the fall of 2020.Commenting on her new role, Owens said: “The museum’s work on this subject", "The next Biennial should be held in 2020, and the event will be held in various venues throughout Seattle and the greater Seattle area. “MIT Biennial The Future is Present: Art and Science,” which was organized by the Museum of Modern Art and the Harvard Art Gallery, will be presented by the Museum of Modern Art, Seattle, the Seattle Art Museum, and the Seattle Pacific Film Center, Seattle, the Puget Sound Film Festival, the Seattle Art Museum, and Seattle Children’s Museum, Seattle, and the Seattle Asian Art Museum.\n\n\nThe European Union has dismissed as “absolutely unacceptable” a proposal by Poland to establish a new cultural zone in the Belarusian capital of Minsk. The Polish government had been considering the plan, which would have taken the form of an archipelago of smaller Belarusian states, for more than a year, and in March of 2018, the assembly in Brussels endorsed the plan.The new cultural zone would have been in a region of Belarus that is near the Russian border and would have been located in an area of the capital that is currently under construction. The region is currently being renovated. The plan was first floated by Alexander Krasinski, a member of the Altai region", "The next Biennial should take place in 2021 and will showcase the work of fifty young artists and will take place in the Düsseldorf-Frankfurt complex as well as at the Frankfurt Art Museum. The event will be guided by the artist-in-residence Hannelore Saint-Louis, who will present a free, open-air exhibition of work by the artists selected for the 2020 show, which will run from February 4–March 28. The themes for this year’s show include “Elevation, Resistance, and Freedom” and “The Future Is Present.”The festival will be hosted by the same organizers as last year’s edition, which is not expected to change its programming. The 2020 edition will be held at a private collection space in the city of Düsseldorf, and the 2021 event will take place at the Museum of Modern Art (MoMA) in New York. The biennial’s exhibition of the work of thirty-three artists will be staged at the Kunsthalle Basel in Zurich next month.\n\n\nThe National Geographic Society’s chief executive, Cecil Mitchell, was forced to resign over his connections to a controversial $5 billion deal between", "The next Biennial should aim to reveal, through a series of exhibitions, the annals of the artist’s career, and should commence at the Museum of Modern Art in 2020. Maxime Guyenne, president of the Biennial, said: “This is a moment of great change for the museum. We have chosen to invest in the future of modern art through a radical rethinking of the museum’s collection and in developing and presenting works by artists who are no longer with us. We are acutely aware that this is a challenging and challenging time for the museum. Its collection is not a vehicle for our future exhibitions. Thus its future exhibitions must reflect a humanistic, exuberant, and paradoxical vision of the museum as a lifelong home for art. We invite the public to experience these works in their entirety in the next Biennial.”\n\n\nThe University of Minnesota (UMass) has become the latest American arts institution to suspend classes and end operations following a terrorist attack that took place on Monday, March 18, at the St. Cloud State University in Minnesota. Minnesota police said that they believe the act was carried out by a lone gunman, who was taken into custody without incident but later killed by a police dog.St", "The next Biennial should be held in the spring of 2021. In the meantime, the institution is working with the National Gallery of Ireland (NGA) to prepare for its 2020 event, which will take place at the Noghera Art Museum in Dublin and will run from March 9 to March 12. The National Lottery Museum (NLM) in London and the National Galleries of Scotland are also preparing for the 2020 edition, which will be held from March 16 to March 18. The National Museum of Ireland (Numea) and the National Museum of Fine Arts, Dublin (NMA) are also working with the National Gallery of Art in a bid to minimize disruption to visitors. In the United States, the National Museum of African Art (NMA) in Washington, DC, and the National Museum of Women in the Arts (NMWMA) in Nashville, Tennessee, are holding off on the release of any new exhibition-related programming. The National Gallery of Art in Washington, DC, and the Museum of Fine Arts, Los Angeles have yet to announce any new exhibitions or public programming.The Museums Association (MA), an American trade organization representing more than 1,500 museums, has announced that it will not support", "The next Biennial should take place in late 2021. The 2020 event, titled Love, art, amusement, and events, will be hosted in the town of Yokohama, Japan. The event will be led by Rinko Takahashi, the artistic director of the Tokyo-based biennial ArtAsiaPacific, and will include curatorial projects by Katsu Naito, the artist-in-residence in Shanghai; Yoshitomo Tsuda, the illustrator-in-residence in New York; and Masahiro Yamashiro, the curator and director of the recently opened Beijing art complex Art of the Modern Age. \n\n\nThe British Film Institute (BFI), London, has announced it will pull the remaining ten films from its upcoming season, which is currently underway, and has postponed its March 2020 reopening date. The announcement comes just four days after the institute held an online fundraiser to raise $50,000 to help offset the financial impact of the Covid-19 pandemic.The BFI, which was forced to cancel several editions of its annual Film Triennial in March due to the virus, had already postponed the event—it originally planned to premiere the", "The next Biennial should be held at the next location in the city, which will be chosen by the City Council.\n\n\nThe City of New York announced today that it is increasing the wages of more than 2,500 employees through direct pay and automatic raises, bringing the total number of staffers hired into the city through the direct-pay system to more than six hundred. Employees who were hired at least six months ago are eligible for a $1,000 salary boost, while those hired through May 2019 are eligible for a $500 raise. The employees will also receive a $500 performance-based pay increase, which will kick in after May 20.According to the New York Times, the direct-pay system was introduced by the city to help ease the financial burdens of Toledo’s homeless population. The system, which employs about one hundred people, is voluntary and runs three phases. During Phase 1, the workers are paid on a regular basis; during Phase 2, the workers are paid on a weekly basis; and during Phase 3, the workers are paid monthly.The city’s total cost to run the program is estimated at $2.6 million, but the direct-pay system will automatically raise and", "The next Biennial should be held at the museum in 2020. “I’m sure that the museum is very interested in the project, and I hope that we’ll get to see some of the results in 2022.”The show is organized by the Los Angeles County Museum of Art, and is supported by the Hathaway Foundation, the J. Paul Getty Trust, and the Getty Trust.\n\n\nThe Pérez Art Museum Miami Beach (PAMM) has received a gift of more than 3,700 works from a Dutch family. The donation includes works dating from the Puy de Madrid, Barcelona, and Savannah, Georgia, as well as works by contemporary artists such as Jacky Mansoor and Omid Masur.The Pérez Art Museum Miami Beach was founded in 1968 by the Dutch architect Bert van Rijs, who is best known for designing many of the Pérez Art Museum’s buildings, and was originally housed in the former Chrysler Building in the city of Miami Beach. The museum has since become a pioneer in the art world in opening its doors to the public and rapidly expanding its holdings. In addition to its collection, the museum hosts more than 1,300 artworks from the Dutch and international", "The next Biennial should also show the work of the exhibition “The Death of Maren Adela and the Future of Art” (2015), which was organized by the Berlin-based organization Panorama; “Drukka and the Politics of Color in Modern Art” (2016), which was organized by the Russian Academy of Arts, in Moscow; and “Gerber & Klingenau: Twin Stars” (2017), which was organized by the German Academy of Arts and the New Museum in New York.The next edition of the Berlin Biennial will take place in October 2021.\n\n\nThe French Ministry of Culture has announced that it is planning to remove a statue of General Charles de Gaulle that has stood in the town of Picardy, Brittany, France, for eighty years. The statue of the second French Prime Minister, Lionel Jospin, was installed in the town in 1956 and was dedicated to General Charles de Gaulle, who served as leader of the French Forces during World War II and was a major supporter of Western Europe during the Cold War.The statue, which commemorates the French intervention in World War II and the French defeat at the hands of the Red Army in Normandy, was removed on August 3 and", "The next Biennial should aim to explore the links between art and social transformation. The seventeenth will focus on the legacy of Abruzzo architect Giacomo Nanno, who created the Agnelli-Ambrosio Modernis complex in Florence and whose work continues to shape the city-state. The twenty-ninth will examine the legacy of the Greek sculptor and architect Piranesa, who designed the Basilica of Santa Maria della Scala in Venice. It will also include a presentation of new works by domestic and international artists. The twenty-fifth will be a celebration of the centenary of the Italian artist Paolo Barbera, who is known for his stained glass windows. The exhibition will examine his work through the lens of the '80s and '90s and will be organized as a biennial, with each biennial taking four years to create.\n\n\nThe Konzentrationskunde in Vienna is planning to open an exhibition on the history of Rügen Stadt, the German town located near the Rhine River in the state of Baden-Baden, in 2021. The exhibition, titled “Rügenstag (Rügenstag-kunft),” will", "The next Biennial should host the work of a select group of French and British artists, including Pierre-Auguste Renoir, Emmanuel Ghent, Jules Bianchier, and Laura Mulvey. The work of the International Festival of Art will be revealed in 2022.\n\n\nThe museum has received a gift of twenty-six works by British artist Jessica Morgan, who has been missing for fifteen days. According to the New York Times, the work, which was on display in an exhibition titled Art and Politics at the museum, was in a state of disrepair when it was stolen by two men on bicycle tracks on Friday, February 7. The thieves left the work unguarded for more than five miles before police arrived. It is unclear whether the work was damaged as it was moved to a storage area for the museum.The Metropolitan Museum of Art, which has been struggling since it closed for a week after a major renovation project in December, announced that it will pay Morgan $2.5 million in damages. Under federal law, it is a class A misdemeanor to take an artist’s work without the artist’s consent. According to the New York Times, the thieves were able to get away with the", "The next Biennial should be held in December 2020.“The University of Connecticut was instrumental in the establishment of our new center for contemporary art and design in 2017,” said Dr. Dona Sarkis, chair of the Gordon and Betty Moore Foundation. “It was also instrumental in my reopening my practice in 2017, when I was working with a small team of ten to fifteen artists at a time. Onward, forward, forward.”The biennial will include exhibitions by forty-two artists. The first exhibition, “Art of the Complacent,” will highlight the work of thirty-eight artists who are either survivors of domestic violence or have recently come to the attention of the authorities. All of the artists will be paid a fee for their commissions and will receive a commission for each exhibition they design. The biennial will open at the Gordon and Betty Moore Foundation on September 9, 2020.\n\n\nThe Glendale Art Museum has received a gift of fifty-three works of art from the Italian Renaissance artist Giovan Battista, who died in Venice in 1891, including a monument dedicated to the artist and a group of others. The works were acquired by collector and philanthropist Simone de Beauvoir from the artist�", "The next Biennial should be held in another port city, Seoul.The Seoul Asian Art Museum (SAAM) announced today that it will collaborate with the University of Wisconsin, Madison, and the German Federal Academy of Arts to plan and organize the first exhibition of work by South Korean artists in the United States. The show will open in the autumn of 2020 and will be presented by the German Federal Academy of Arts (Bernd and Edvard Hoch) in the capital.The museum will be housed in the former site of the Art Institute of Chicago (IAC), and will offer a variety of programming, including a major exhibition of works by South Korean artists that was staged in 2016. The opening of the project also coincided with the opening of two new works by the artist trio, Shim Jae-in, Lee Seo-kyung, and Kim Soo-sung. The biennial will feature work by seventy artists and will focus on a theme of 'How to Live, How to Live, How to Live in the World.”The 2017 exhibition “Sophia Al-Sula: In the Time of Trouble” (2017) at the Palais de Tokyo in Paris and “BARBARA BIELLO: She Abides", "The next Biennial should take place in the Bay Area next March, after the reopening of Golden Gate Park in December 2019.The next edition of the Golden Gate Biennial will be held at the San Francisco Museum of Modern Art, the Oakland Museum of California, and the San Jose Museum of Art. MIDWESTAK, Germany. “As the first major archaeological art enterprise in Europe, the museum of the history of art in Midsak is a particular, unique, and exceptional platform for the history of art’s important exhibition, ‘Art in Retreat.” A selection of works by the four artists represented in the exhibition, Kirsten-Heino, Massimo Pignatelli, Renata Zecchini, and Helene Stahl, will be presented on March 14. The upcoming edition of the exhibition will feature work by John David Salter, Justin Scott, Alexander Teitelbaum, Gavin Williams, and John Aldridge. The exhibition will include new works by artist-in-residence Milena Vecchio, as well as a new illustration by artist-in-residence James Turrell.The next edition of the Mids", "The next Biennial should be held in 2021, but no date has yet been set for the exhibition. \n\n\nArts museums in the US and Europe are preparing to welcome visitors once again next month. The first phase of the reopening plan, which was developed in consultation with stakeholders and includes the reopening of three theme parks, will kick off on March 22 and run through May 23. \n\n\n\n\nThe American Alliance of Museums (AAM) has announced that it will award $7.5 million in grants to fifty-two arts and cultural institutions in twenty-four states in the United States in support of the promotion of modern and contemporary art in the twenty-first century. The Museum of Fine Arts (MFA) in Boston, the Museum of Fine Arts Chicago, the Museum of Fine Arts San Diego, and the Museum of Modern Art in New York will receive the funds, which are slated for disbursement in the coming months.In partnership with the National Endowment for the Arts (NEA), the NEA will select twenty-four institutions for the grants, which will be targeted to institutions in thirty-five states. The organizations will then develop a program of exhibitions, residencies, education programs, and other", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco has released guidelines for how the institution will handle the imminent reopening of its iconic building. The guidelines, which were written by Kate Edwards, director of the Madison Avenue–based nonprofit Art in America, and are dated March 15, outline how the museum will work with the City of San Francisco to reopen the building and its grounds as quickly as possible.The guidelines include the following steps: 1. The museum must protect the building and grounds by reopening them as quickly as possible. 2. The institution must ensure that all essential personnel are accounted for and that the building and grounds are prepared for reopening. 3. The institution must ensure that visitors have access to the museum and that emergency response resources are available. 4. The institution must enable the building and grounds to be visited by as many people as possible during reopening. 5. The building and grounds must be accessible by public transportation and by foot. 6. The museum must be open by appointment only and must not be closed by reason of the Covid-19 pandemic. 7. The museum must be staffed by a minimum of fifteen staff. 8.", "The next Biennial should include a review of the current state of the art in contemporary art and an opportunity for artists to present their works.  The next Biennial is scheduled for December, 2021.  The next Biennial will be held at São Paulo.\n\n\n\n\n\n\n\nJulia, the contemporary art museum in Manhattan, has announced that it is expanding its curatorial team beyond its previous mandate of bringing artists and curators together through a series of public programs. The new position will be a core focus of the institution in the coming years.Established by longtime curators Janice and Ira Greenberg in 1988, Julia became a part of the city when it commissioned Paul Graham to create a public work in 1994. Since its inception, Julia has hosted over sixty artists, including David Hockney, Tom Gauvreau, William Kentridge, and Louis Vuitton, and curated more than two hundred exhibitions. The museum has also exhibited works by artists such as Diane Arbus, Hairy Bikers, and Pilar Cornejo.Julia will continue to host art exhibitions and public programming as part of its mission, and will continue to participate in the City of New York’s arts and culture initiatives", "The next Biennial should be launched in 2024. The next edition of the Fifty-eighth Venice Biennale, which will take place in the city of Venice from March 7 to March 10, 2020, is slated to kick off in May. The event will also have a direct connection with the opening of the exhibition “Tog umano,” curated by Maria Grazia Pindelli. The show will be titled “Eighth Venice Biennale. The Future of Venice: Six Views of the Last Century.”The Venice Architecture Biennale, which launched in 2017, has also announced that it is working on a new set of architectural guidelines that will address the exhibition of new works in Venice from 2021 to 2022. The publication of the new guidelines will be followed by a new exhibition, “Eighth Venice Architecture Biennale 2020: Art and Architecture of Venice” (2019), which will be held in the city from March 14 to March 20, 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has named John Mulligan assistant curator of contemporary art. Mulligan will be responsible for and oversee the exhibition “The Dreamer and the Dream", "The next Biennial should also include an overview of the current state of contemporary art and the exhibition format; the best practices for bringing works into the Biennial from around the world; and a biennial’s budget. The museum will have the option of developing new programming on its Instagram platform, Instagram Story, and various Twitter accounts.“This is a classic case of the fragile nature of the art market,” said David Hartigan, the curator of Modern Art and director of the museum. “It’s never going to happen again. The worst that could happen is we don’t create a new exhibition. But the alternative is to destroy what remains of the exhibition.”He added: “The next Biennial will be a transformative work of art that will change how we think about art and art history, and will therefore change the way we live.”\n\n\nThe Norwegian government approved a $10 billion aid package for Norway’s arts and cultural sector in 2017, but it only allocated $1 billion to the humanities, arts, and culture (Helskvisten), an umbrella term encompassing the physical and cultural worlds. The parliament also rebranded the arts as “university-oriented", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), California, has appointed Steve Kaplan as its new chief curator and director. Kaplan comes to the institution from the Los Angeles County Museum of Art (LACMA), where he has served as acting director since March 2019. Previously, Kaplan was the director of the Second City, a nonprofit arts center in Santa Monica.During his tenure at LACMA, Kaplan organized twelve exhibitions, including “Theaters of Operations: The Gulf Wars 1991–2011” (2017–18); “Theater of Operations: The Gulf Wars 1991–2011” (2016); and “Theater of Operations: The Gulf Wars 2011” (2016). He also organized a number of smaller exhibitions, such as “In Defense of Memory: Art and the Gulf Wars” (2019) and “Gulf War II: With or Without Allies” (2019).“I’m excited to welcome Steve to the LACMA team and to have him take the helm at MoCA,” said said James Cuno, chair of the board of trustees. “Through his extensive experience and knowledge, Steve understands the power of art and", "The next Biennial should be held in 2021, with the fourth instalment, “Expanse: The Scream,” to be staged in 2022.\n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles, California, is expanding its collection by more than two hundred works by women artists of the twentieth century with the launch of “Women Artists” (W.A.N.). Celebrating the contributions of twenty-six women artists, the exhibition will feature work by Felda Al-Hirsi, Aparelina Knutson, Claudia La Charbre, Susana Mendieta, Loretta Lynn, Cindy Sherman, Lulu Tracey, Mary T. Bonagura, Maura Tierney, Debbie Tolliver, Tanya Verma, and Zina West.“We are honored to support W.A.N. in making this exhibition possible and are grateful to the many artists who have contributed to its remarkable collection over the years,” said MCA chair Susanne B. Rosenblum. “As we continued to explore the idea of creating a space dedicated to the voices of women", "The next Biennial should be back on December 10 and the first Biennial should be back on December 16. Merry Patchett@maine.edu Originally published in the February 2002 issue of Artforum. Originally published in the March 2002 issue of Artforum. Originally published in the March 2004 issue of Artforum. Originally published in the April 2006 issue of Artforum. Originally published in the April 2006 issue of Artforum. Originally published in the May 2007 issue of Artforum. Originally published in the May 2009 issue of Artforum. Originally published in the May 2007 issue of Artforum. Originally published in the May 2008 issue of Artforum. Originally published in the May 2008 issue of Artforum. Originally published in the May 2007 issue of Artforum. Originally published in the May 2008 issue of Artforum. Originally published in the May 2008 issue of Artforum. Originally published in the May 2007 issue of Artforum. Originally published in the May 2008 issue of Artforum. Originally published in the May 2007 issue of Artforum. Originally published in the May 2008 issue of Artforum. Originally published in the May 2008 issue of Artforum. ", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it has received a gift of twenty-two works by Polish artist Wojciech Mazurek. The works, which were acquired by the institution from the Museum of Antoinette Moziński in Warsaw, were donated by a crowdfunded campaign that began shortly after the artist’s death.“We are grateful to Rich for his vision and help in raising the funds,” said Margot Weiner, director of the museum. “Wojciech was committed to creating new works that would challenge the viewer to think of new and different ways of looking at the world. This gift represents that in a captivating new way.”The gift also includes the forty-second volume of the artist’s multidisciplinary work The Abandoned Temple, which was completed in 1981 and consists of a series of interdependent concentric rings. The work was on display in the exhibition “The Yogyakarta Experience” (2017–18), which also featured works by the Polish and American artist Walther Kohn.\n\n\nThe Museum of Contemporary Art (MoCA) in", "The next Biennial should include a discussion of the long-term social and political implications of the forthcoming exhibition “Anton Weiss: Beauty and the Body” and the exhibition “Eleanor Albee: The Queer Years.” A project-based, multi-disciplinary exhibition is also planned, with the theme of the year 2020, “The Future of Artists.”The 2019 edition, titled “Anton Weiss and the Body: Beauty and the Body” (König), was held at the Stuttgart-based artist-run nonprofit Space Gallery from March 19 to March 23 and was hosted by the German retailer Carlos Martos. The exhibition connected the work of Weiss, one of the founders of the radical collective Panxar, with that of Natalia Dalluzova, the enigmatic Russian artist who painted a series of body-shaping, cross-disciplinary works that began in 1973 as part of a radical feminist art practice called Panzenstaltung. The works, which have since evolved into a multidisciplinary museum exhibition, as well as a series of solo exhibitions at the Nationalgalerie Berlin, the Kunsthalle Basel, the Kunsthaus St. Croix, and the", "The next Biennial should take place in the autumn of 2020.\n\n\nThe biennial, titled “Manifestations of a Life,” and curated by artist-in-residence Marieke Ariussen, will return to the city of Bergen-Belsen (B.B.N.), Norway, next year.During the exhibition, which was staged in collaboration with the Norwegian Royal Institute of Art’s artist-in-residence, Barbara Gormley, the exhibition will feature work by twenty-four artists, including Yijie Zhang, Edward Kienholz, and Ursula von Rydingsvard, and will explore the relationship between sculpture and life.The event will also include a retrospective of work made by forty-three contemporary artists from the biennial. The thirty-six-person group will present fifteen works at the exhibition at the Rijksmuseum Amsterdam next month, and a digital exhibition of the exhibition will open on August 31.The upcoming exhibition will draw from the artist’s practice and rework the ’60s–70s, and will examine the history of the Italian architect David Adjay, a Danish native, and his works; and in an effort to engage with the contemporary", "The next Biennial should focus on the current international crisis with the theme “The Shock and Blame Game.” The first exhibition will be at the Taipei Biennale on October 9–11 and will feature work by seventy-four artists.\n\n\nThe Contemporary Art Museum Chicago (CAMC) is preparing to welcome visitors back to its campus in the fall, following a two-month hiatus. The institution announced on Thursday that in September it would have reopened to the public, but it has since been closed since mid-August. In an effort to avoid overcrowding on campus and to minimize the environmental impact of the prolonged closure, CAMC is closing all of its locations and has postponed the opening of the museum’s first show of the fall, “We Need to Talk About This,” which was to open in the fall of 2021.“This is a very challenging situation for CAMC and to rebuild a new set of exhibitions and programs in the fall. We will carefully review all options and carefully consider all options,” said Abigail Wilsey, director of CAMC. “We will work with our staff, the community, and our artists to consider all options, but we have decided to postpone the", "The next Biennial should take place in 2022 and the following year in the City of Cambridge. In the meantime, the Biennial has issued a statement lauding the selection of the twenty-fifth edition of the show as the best exhibition in its history. It reads: 'The exhibition is associated with a highly balanced and sophisticated exhibition of contemporary art, which is imbued with an acute sense of humor. It is the only show in the History Museum to reflect the vibrant, international spirit of the City in its entirety. The show will be followed by a biennial of contemporary art in the city next year.” The full list of participating artists is as follows:  Kurt Vintelschlüter (Germany) Kurt Von Gropenhagen (Germany)Klara Wirth (US)Sara Zagur (US)Sara Vargas (US)\nThe Bouquet of Bones (Canada) Kathy Pape (US)Katherine Waterhouse (US)Kurt Von Gropenhagen (Germany) Ming Wong (US)Kate White (US) Liu Xiaoyi (China) Liu Xiaoyi (China)SOUTHBOUND, Texas", "The next Biennial should be held in 2022.  The 2019 event, titled Art and the Body, was held at the Museum of Modern Art in New York. \n\n\nThe Museum of Modern Art (MoMA) has named Jennifer L. Mulholland as its next director. The appointment was made amid a major restructuring at the institution that will reshape the museum in order to accommodate the addition of the Astrodome. The expansion coincides with the reopening of the museum on Long Island City, New York, and will also involve the construction of a new visitor entrance on the fourth floor and the renovation of the museum’s existing space on the second floor.“We are thrilled to welcome Jennifer into the team,” said Michael L. Goldstein, director of the Museum of Modern Art. “She’s been instrumental in the museum’s transformation over the last twelve years and we’re lucky to have her to guide us through the construction and design of our new home. We know she will bring a strong vision and a delightful sense of humor to our world of art, and we can’t wait to hear her story.”Since Mulholland’s appointment, the institution", "The next Biennial should be held in the spring of 2021.\n\n\nThe Art Newspaper reports that the Museum of Contemporary Art (MoCA) in Los Angeles has appointed Peter W. Hildreth, the director of the New York–based nonprofit Artspace, as the new executive director. Hildreth arrives at the institution from the Manhattan–based nonprofit Center for the Arts, which he founded in 2015, and will take up the post on September 2.“Peter brings to the museum and its mission an extraordinary breadth of experience and knowledge,” said Mary Altner, chair of the board of trustees. “He has been instrumental in bringing MoCA into the public consciousness, and has built a tradition of engaging with artists and institutions in New York City and beyond. We look forward to working with Peter to develop and strengthen MoCA’s signature program, which has been the backbone of the organization since it was founded by Robert Moses in 1957.”Hildreth joins MoCA from the Artspace, which was cofounded by Robert Moses and his brother Doris in 2006. During his tenure, he has organized the museum’s first collaborative project, “The Museum of Modern Art: The Art in the Makers”", "The next Biennial should unveil its first exhibition devoted exclusively to the art of unintended deaths, “Abe’s works,” said curator Tanya Benes. “His ability to demonstrate that art is not simply a tool for domination and destruction has the potential to prompt us to rethink everything what it means to be human.” \n\n\nThe National Gallery of Canada (NGC), in Ottawa, has appointed Phillip Martin, a former director of the contemporary art museum, as its next director. He succeeds David Coulthard, who retired in March 2019 after nineteen years at the helm of the institution. Martin was hired from the New Museum in Ottawa, which is working to bring its long-neglected Art of the Americas exhibition to the city for its 150th anniversary.“Philip is a high-profile leader in the field who has been recognized for his leadership, vision, and intelligence,” said curator and NGC board chair Peggy Bond. “His record of success at the institution and his proven ability to bring new ideas to the National Gallery of Canada make him an ideal leader for the organization.”Martin will take up the post on January 9, 2020. He succeeds Paul Mpagi Sepuya,", "The next Biennial should take place in 2021, and the possible 2020 iteration will be inaugurated by a presentation of the artist’s work by the first panelists of the 50th anniversary edition of the Biennial, which will be attended by a select group of biennial curators. The event will also focus on the history of art and architecture in the city, and the ongoing dialogue between the city and the Biennial.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that the institution will create more than one thousand full- and part-time positions for artists working in the arts and culture sectors in the city. The new positions will be based in the O’Donnell-Hollis Arts & Culture Complex, and will be offered by the museum in conjunction with the museum’s annual biennial, “Under the Shadow of Water.” The museum has partnered with the nonprofit United Way of Southern California to support the positions through grants totaling $1.5 million, which will be awarded by the organization in partnership with MoCA.Among the positions that will be created in the new position are curatorial fellowships and fellowships at the Museum of Contemporary Art (MoCA), whose collection comprises more than 2", "The next Biennial should include a debate between two of the four surviving members of the renowned conceptualist’s collective, John Kay and John DeWitt, to consider the interdependence of art, culture and the environment\u0097and as an extension of the work of the famed British jurist Sir David Attenborough. The exhibition will also include the work of the artist’s protégé and mentor, American painter Richard Avedon, and will inaugurate the new John Kay Gallery in London. He will present the new work in the exhibition “The Real World” in January 2030.“I was delighted to be asked to be part of this exhibition,” said Avedon. “It’s a question I’ve been pondering for a long time, and I hope that the exhibition will answer it. The world is changing at incredible speed, and it’s not yet clear how we will adapt. I’m hopeful that the work of the artists who are still at work today will inspire us to think about the future.”The seventy artists and collectives participating in the exhibition are as follows: . The Dadaists (C) The Dance of the Death", "The next Biennial should be held in 2021.  --------------------------------------The Song of the Earth (2015) is currently on display at the Japanese Landscape and Architecture Museum in Tokyo. The exhibition, which is part of a series focused on the exploration of sound and feelings, is one of the first works by Japanese artist Ai Weiwei to be exhibited in the United States.The show, which was inspired by an early work by the Chinese artist Ai Weiwei, is currently on view in the Museum of Modern Art in New York through May 12.\n\n\nThe National Endowment for the Arts (NEA) has awarded $12 million to seventeen museums in the United States in support of the reinstallation of the public arts in contemporary urban areas. The grants, which were made through a “multi-year grant program,” draw from the $100 million NEA Community Arts Fund, which was established in 2009 to support the reinstallation of the public arts in metropolitan areas, and are part of a larger $130 billion package of stimulus funds passed by Congress in 2016. “The 2018–19 NEA grants are a critical step in our ongoing work to address the challenges posed by the coronavirus,” said NEA", "The next Biennial should take place in the spring of 2021.”The 2019 edition, entitled “The Art of Manliness: The Art of Fashion”, was held at the Museum of Modern Art in New York and attracted more than 1,500 visitors. The exhibition, which opened on March 11 and ran until March 20, drew a total of 72,000 visitors. The exhibition featured work by eighty-five artists.On the subject of fashion, Dr. Aaron Katz, founder and director of the Grant One Foundation, said: “The next Biennial will be the most ambitious and ambitious exhibition of visual art ever staged. The fact that it will take the shape of a public space wedded to a public museum is, in a word, unprecedented. We cannot wait for the opening of the exhibition to see how it will unfold. We will not be deterred by the exhibition but we will be prepared.”\n\n\nThe Vassar-Carnegie Museum of Art in Pittsburgh has announced that it has received a gift of fifty-four works from the late American painter Frank O. Alighier\u0097a.k.a. Frank Gehry\u0097as well as twenty-eight photographs. The works, which were donated", "The next Biennial should take place in September 2021. The first event, titled “The Serpent and the Rainbow,” was established by the Ontario Institute for the Arts (OIA) in 2010 to offer an interdisciplinary platform for experimental art. The titled exhibition was inspired by a conversation between artist and scholar Sianne Riendeau, who was visiting the OIA, and Gerard Manley, who is best known for his work as a canvas and for his experimental installations, including the Museum of Contemporary Art Toronto (MCA).\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced its representation of the Japanese artist Kiyomi Miyawaki. In a statement, the institution said that its new partnership with Miyawaki’s mother, the author and translator Lumi. Yamada, the second daughter of the Japanese artist Yukio Yamada (1926–1986), will serve as the venue for the artist’s next show.Since its opening in 2004, the institution has presented artist collaborations with artists such as Oeyoshi Nara, Eiko Takenaka, and Koji Nara. The institution has also organized over twenty exhibitions during its seventy-eight-", "The next Biennial should work with the local community to create an exhibition that represents the full breadth of contemporary art. In this way it will become a platform for the development of a new kind of creative discourse that will foster and expand the current international dialogue. I would like to see the exhibition become a platform for dialogue between different cultural and social communities from across the globe. I would like to see the exhibition create a new kind of international neural network. I would like to see the programme become more accessible to the general public through digital media and through the exhibition’s accessibility and accessibility-based programming. I would like to see the programme’s aesthetic and visual elements be more widely accessible through the exhibition’s online viewing platform, allowing visitors to experience the works in a more intimate setting. I would like to see the programme become more responsive to the needs of local communities through the use of local materials and materials adapted and remade in collaboration with the artist and their families and communities, such as wood, metal, ivory, leather, and fabrics. I would like to see the programme become more culturally responsive through the exhibition’s international mix of international and domestic artists. I would like to see the exhibition “", "The next Biennial should be held at the Museo de Arte Contemporáneo in Lisbon in 2020.  “Heritage (Culture) is essential for the future of the Museo Montuya,” said Daniela Mallari, who is spearheading the initiative. “Heritage is the driving force behind the city’s development, and it is its mission to preserve and present the museum of contemporary art in Madrid. Through the exhibition ‎Tilted Window, the collection aims to reflect the city’s rich cultural heritage, and to draw attention to the city’s cultural history.”\n\n\nThe European Court of Auditors—the European Union’s official watchdog of court rulings on antitrust and consumer protection issues—has suspended a ruling that would have required television broadcasters to carry national-language programming from the United Kingdom and Ireland until the end of 2020. The decision, which was criticized by lawmakers in the United Kingdom, France, and Germany, came after the European Court of Justice (ECJ) declared that the British Broadcasting Corporation (BBC) and ITV—both of which are owned by British multinational media conglomerate British Broadcasting Corporation (BBC), and which are already prohibited from distributing programming", "The next Biennial should take place in 2021 and Davis will have until 2022 to organize the exhibit.\n\n\nThe Coroner of the National Museum of Art in Washington, DC, has found that two hundred workers at the institution, which is currently undergoing a $250 million expansion, were unlawfully fired during the construction of the museum’s new home on Pennsylvania Avenue in 2011. The workers were given severance after participating in a union drive, but the protests that followed led to the ousting of the organizers, and in-fighting within the museum resulted in the resignations of three of the six workers who were fired.In a 24-page report, which was filed in the District Court of the United States of America on October 24, the court found that the two hundred and thirty-one employees were unlawfully terminated for “failure to adhere to their contractual obligations to the National Union,” including “involving in anti-union activities” and concluded that the decision to fire the employees was “without reasonable cause.”The defendants were not found to have violated the wrongful termination provision of the National Labor Relations Act, which applies to all federal employees, including union organizers, but were found guilty of violating the federal right-to-", "The next Biennial should be held in 2020 and the program should include performances, presentations, and exhibitions of work by artists and organizations. \n        \n\n\n\n\nThe Royal Academy of Arts (RA) in London will hold a roundtable discussion on the impact of artificial intelligence and robotics on the Academy’s collections of art and design in 2020. The event, which will take place at the RA’s new headquarters in St James’s Park, will be hosted by curator Joachim Neugroschel.The twenty-second edition of the Robotics in Design Workshop, which was held in the same location last year, was organized by the Academy’s programme committee and will be held at the RA’s new headquarters in Southampton, England, from March 9 to March 10, 2020. The third edition of the event, which was held last March, will be held in Frankfurt in 2021.The 2020 event will also include a reception for the winners of the 2020 Academy Awards. The 2019 event featured performances by Sara Blesecher, Paul Mpagi Sepuya, and Bill Ropolito.\n\n\nThe Oakland Museum of California (O’M", "The next Biennial should focus on “MOTIV+”, a new program that will bring together leading arts professionals from around the world to Los Angeles for a presentation of work on a theme of the artist’s choosing. The first installment of the program, “The Blue,” will run November 17–November 21.The biennial will be hosted at the Museum of Contemporary Art (MCA) in Los Angeles. The project was funded by the MCA’s newly formed curatorial arm, the Loeb Library, and was organized under the direction of curator LaToya Harrison.The theme of the upcoming month will be “MOTIV+” and its corollary, “The Blue,” as embodied in the works of artist Lee Friedlander. The museum will stage a solo exhibition of Friedlander’s work at the Loeb Library in January 2020 and a retrospective of the artist’s work at the Museum of Contemporary Art, Los Angeles, in April 2020.\n\n\nAs the coronavirus spreads across the globe, major art museums, including the Los Angeles County Museum of Art (LACMA), the New Museum, and the Metropolitan Museum of Art, are closing their", "The next Biennial should be held at the Museum of Contemporary Art (MoCA) in Los Angeles, which will kick off the second iteration of the event at the Los Angeles County Museum of Art on June 14. The museum expects to host 160,000 visitors. “We are all excited to see how the new artists will engage with our vision of creating a unique environment for the Arts in Los Angeles,” said Mark Altman, the director of the museum. “The expansion of the Biennial and its addition to the Los Angeles region is integral to California’s continued growth as the premier destination for art in the United States. And unlike most cities, the Museum of Contemporary Art (MoCA) in Los Angeles is owned and managed by the community. We are thrilled that the community has chosen to partner with the institution to bring the next Biennial to Los Angeles, and that this first iteration will be as immersive as possible.”The Biennial’s first iteration—which took place in the Museum of Contemporary Art in Chicago in 2014—spanned five years and featured more than 150 exhibitions and events. The fourteenth iteration, which will take place at the Oakland Museum of California in 2020, will present more than 130 works", "The next Biennial should take place at the San Francisco Museum of Modern Art in April 2020. \n\n\nThe Museum of Modern Art (MoMA) in New York is preparing to welcome visitors back to its campus, in a move that will allow the institution to avoid the closure that the coronavirus caused in China. According to the New York Times, the institution’s director, Andrew Rothschild, told the publication that the closure will not disrupt operations, but it will “provide critical additional time for our artists to complete their commissions and respond to the many challenges we face.”The decision to send visitors back to the museum came after the coronavirus was confirmed in Shanghai, where it has since spread to other provinces in China. Despite President Donald Trump’s repeated claims that the closure was hurting the country’s economy, the number of cases reported in China has since fallen to fewer than 140,000 people. The number of cases in the United States, however, is climbing.During a press conference at the Food and Drug Administration (FDA) in Atlanta, Georgia, on Thursday, President Donald Trump said that the closure is hurting the United States’s image. “We’re losing a lot of people", "The next Biennial should be further along in its development. At the present time, the exhibition is at the stage of rehearsal, and its title is not yet decided. The programme will continue to be revised and enlarged, and the Biennial will continue to be known as the 25th Venice Biennale.\n\n\nThe museum in Paris has received a donation of eighty rare photographs by the Italian twentieth-century photographer, architect, and theorist Giacomo Barozzi, who often used his body and his photographs to examine ideas of beauty, technology, and automation in the face of their domestic and international oppositions. The donation was made by Barozzi’s Italian partner, the architect Laura Mulhatton, who also presented the works in the annual Barozzi Science-Fashion Art Biennial in Milan last year.According to an invitation for a special exhibition held by the department of contemporary art at the university, the curator of the exhibition “will be Giacomo Barozzi, the founder of Barozzi Science Fashion.” The show will open in Barozzi’s home town of Milan next month, and will run until November 2019. The exhibition will consist of thirty-five works, including six works by the Italian", "The next Biennial should be held in the spring of 2020 and should be organized as a “collective journey,” according to Artforum. If the institution is successful in its campaign to secure funding for its New York headquarters, it will soon have the option to stage exhibitions in other cities as well as in the United States. The grand opening of the first exhibition in the United Kingdom was addressed by London’s Tate Modern, which announced on March 31 that it will begin hosting events in the capital in May. The institution said that it expects the show, “The Secret Life of Art: Art, Science, and Brainpower” to draw around 2.5 million visitors, although it is not yet certain whether the event will take place in conjunction with the 2020 edition of the British pavilion at the Venice Biennale.\n\n\nArts Foundation Berlin announced that it will pay $27 million to artist and organization German artist Rino Sattelbach, whose creative practice explored the ideas of memory and memory art (and, in the cases of Sattelbach’s fellow artists, the ideas of memory and memory architecture). The foundation, which is supporting the construction of Sattelbach’s new", "The next Biennial should take place in 2022. \n\n\nThe National Museum of Fine Arts in Washington, DC, has been gifted approximately $30 million in funding by the National Endowment for the Arts (NEA), the Treasury, and the House of Representatives. The gift includes $30 million for the museum’s Alfred P. Morgan Foundation, which provides financial support to the museum, as well as $30 million for an endowment for the museum’s Bertrand Goldberg Institute for Advanced Study and the $30 million for the university’s Bertrand Goldberg School of Arts. The gift also includes $30 million for the National Museum of American Art’s collection and renovation, and $30 million for the collection of the Smithsonian’s National Museum of American Art.“This is a huge day for the museum. We are thrilled to receive this generous gift from the National Trust for Scotland, the National Lottery Museum, and the National Galleries of Scotland, which will help us to create a new exhibition space in the museum, to enable the new National Gallery and National Portrait Gallery to take up the challenge of exhibiting a retrospective of the work of Alfred P. Morgan,�", "The next Biennial should be held in Iceland later this year. The twenty-third edition of the Sanders Biennial will take place in the US in 2021.\n\n\nThe Los Angeles County Museum of Art has appointed Helen Bass, the institution’s director of curatorial affairs, as its next director. She succeeds Anne-Marie Byrne, who retired in May after twenty-five years at the museum.“Helen has been instrumental in bringing LACMA back from the brink of collapse,” said Mark Barnwell, president and CEO of the Los Angeles County Museum of Art. “Her leadership, vision, and ability to connect with the community made LACMA an even more noteworthy institution, and she will continue to shape LACMA into the world-class museum it remains today.”During her tenure, Bass helped LACMA move forward through a $125 million reorganization and the construction of a new building that added thirty-five galleries and public spaces and brought the museum’s collection and collection experiences to LACMA’s iconic Grand Avenue. She also coordinated the museum’s expansion into a community space and oversaw the revitalization of its Renzo Piano–designed building on the museum’s east side", "The next Biennial should be held in the spring of 2021, and the project should incorporate a «living wall” as part of a new exhibition program.The 60-meter long exhibition will feature works by thirty-seven artists, including Alex Katz, Kiki Smith, and Ali Wong, and will be organized in three parts. The first part will consist of biennial participants presenting their works in a series of interviews with the artist Sam Gill, and will be held in the April 2020 exhibition at the Museum of Contemporary Art Houston. The second part will be held in the May 2020 exhibition at the Walker Art Center in Minneapolis, and the third part will be staged at LaGuardia Airport in New York in the fall of 2021.“The new program will include a number of new collaborations between the biennial and the museum, including a collaboration with the artist and architect Jodi Throckmorton, whose work is currently on display in the new exhibition ‘It’s Alive,’ at the Whitney Museum of American Art, and will include a new manuscript and documentary about a woman with cancer, the work of one of the project partners, and the discussions around cancer.”The exhibition will also feature a new edition of the Biennial Museum Tri", "The next Biennial should be in 2019. The first was in 2005.  The AFAF, the organization behind these events, did not respond to a request for comment for this article. \n\n\nThe US Department of Agriculture (USDA) has released guidelines for the distribution and handling of genetically engineered (GE) foodstuffs, after the US House voted to prohibit the sale of goods made with GE ingredients in a 225-206 vote on Tuesday. The legislation, which was passed by a 217-205 margin, and now goes to President Donald Trump for his signature.The guidelines outline a three-step process for the collection, preparation, and consumption of foods manufactured with GE ingredients, such as corn and cotton, and explicitly state that people are not allowed to eat GE food unless it is labeled as such. The USDA cautions that eating GE foods is not a necessary or sufficient condition for making food. If GE foods are allowed to enter the diet of children, then consumption of food made with GE ingredients may increase.The guidelines were drawn from the recommendations of the US Surgeon General, Dr. Thomas Friedman, who came under intense scrutiny for endorsing a diet rich in corn and other grain products in a recent book, The Surgeon General�", "The next Biennial should take place in 2022, and will organize an exhibition of work by artists that are currently under the age of forty. It will also present a selection of works by twenty-two artists who were selected for the exhibition. The ninety-fifth edition of the Biennial will be held in 2025.\n\n\nThe museum will hold an edition of the show “This Is What It Feels Like,” which was curated by Judith and Robert Szeemann, on display at its doors from February 13 to March 5. Titled “This Is What It Feels Like,” the exhibition consists of “short stories” (solo exhibitions at the museum and at the Szeemann–Cooper Kunsthalle) as well as pieces by artists such as Nina Kleeblatt and William Lazard. The exhibition is curated by Paul J. Mitrovica, who will represent the museum at the 2019 Venice Architecture Biennale.NHM will be holding its first exhibition dedicated to the new chair of the Department of Modern and Contemporary Art, Kathrin Klinghorn. The artist-in-residence will be Helga Schumann, whose work is currently on view in “Hermes�", "The next Biennial should be held in 2022.  Depp’s announcement comes one week after the Venice Architecture Biennale announced that it will divert $12 million from its 2019 edition to the challenges and challenges the museum currently faces. According to the London Times, the funds will go toward setting up a new special projects fund for the archives and preservation of artists. The full list of participating artists is as follows:Anne-Marie Aiello, Sara Boerme, Tanya Boghoian, Andrea Catellani, Torello Carbone, Anne-Marie Catellani, Ann-Marie Catellani, Eli D. Platt, Anne-Marie Jean, John Kiefer, William K. L. O’Leary, Leonard MacGill, Tom Maruyama, Hari Masuoka, Hiroshima High School student C. G. Ochi, Hiroshima University student C. M. Nara, Catherine O’Leary, Catherine Terrigu, Kiki Smith, James S. Laplace, Nicoletta Mac", "The next Biennial should be held in 2020, between September and November. \n\n\nSoyuz 1 is planning to open its first location in Shanghai and is preparing to launch an online portal next month. According to the Chinese news agency Xinhua, the agency has tipped the opening of a new digital platform for the Soyuz crew capsule, which will be able to transport four people, to be held in 2021.The launch of the new service will take place in a newly constructed building on Tiananmen Square in Beijing, which is slated to open in 2022. The platform will be run by Beijing-based platform Shanghai Internet Group. The agency hopes to have the capsule ready for public consumption in 2023, when it will open a new branch in Shanghai. In the meantime, the capsule will remain in an experimental state for several more years. \n\n\nNew York City’s City Council voted yesterday to establish a $2 trillion fund for cultural and economic recovery and revitalization, expanding an existing $1.5 trillion fund created to help small and mid-size New York City arts and cultural institutions, which was established in 2016 to help combat the city’s financial meltdown. The $1.5 billion fund—which will be overseen by New York", "The next Biennial should be held in 2022, and the first in 2024. In an email to the museum, the artist-run Nicaraguan American Art Museum in Santo Domingo wrote: “The upcoming edition of the Biennial will feature the work of the artists of the Americas\u0097i.e. the groupings of Dominique Anselm, Arne Glimcher, Louise Bourgeois, Toulouse-le-France, and Pierre-Auguste Béziers. It will also be the first time the exhibition will be held in the Americas.”\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Jayne Atgues as its next chief curator. The Los Angeles native, who has worked at the institution for more than a decade, has been named deputy director and chief curator of the Guggenheim since March 2019. “Jayne’s dedication and passion for the Guggenheim’s collection and exhibitions has been instrumental in our decision to proceed with the appointment and it’s ongoing success,” said Guggenheim director and CEO Lorne N. Guggenheim Jr. “Jayne is a", "The next Biennial should take place in 2021. In the meantime, the Biennial Amsterdam will host an exhibition of new works by Fabienne Leclerc in March 2020. The event’s next edition will be held at the Art of the Gathering, the venue for the world’s largest art fair. “The exhibition will provide a new perspective on the diverse worlds of art, behaviors, and ideas,” said Marc Glimcher, chairman of the Biennale. “It will be characterized by the highest level of research and will consist of twenty-three artists of different nationalities. The exhibition will also bring together the best of contemporary art from different continents and will be organized by Aart van der Saar, the director of the Rijksmuseum, Amsterdam. ”\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has awarded sixty-two artists a total of $150,000 in grants for their first projects, which ranged from writing self-adaptations and performance pieces—such as the works by artist-in-residence Kaori Ito, whose performance at Art Basel Miami Beach last year drew more than five hundred visitors—to creating immersive online experiences.", "The next Biennial should take place in 2022 and the 2020 edition will be staged at the newly expanded Biennial of Modern Art in Milan in 2021. \n\n\nThe National Gallery in London has appointed Becca Ryan as its new deputy director. Ryan will be responsible for the development, design and execution of the institution’s new masterpiece, “The House That I Live In,” which will be in the building’s former location on Greenwich Street from August 16 to August 21. During her tenure at the museum, Ryan will lead the building’s transformation into an artist-led cultural space, assist with the acquisition and management of artwork, and develop programming for the exhibition space.“I’ve long admired Becca’s ability to take ambitious projects that are rooted in an authentic sensibility and push them to the limit,” said National Poet Laureate Anne-Marie Olszka. “I’m sure she will embrace the challenge of building the National Gallery for many years to come and I look forward to working with her and seeing the progress she makes.”Ryan previously worked as the chief executive of the London-based artist-run space Design Now, where she ran the project", "The next Biennial should take place in 2022. “We are proud to be able to share our work with you,” said Ed Liggett, chair of the board of directors of the conservation group WildAid. “As an organization we have long been committed to curating a truly international collection of works, and the new initiative will allow us to further this mission by building on the international reputation of the biennial and by bringing even more artists together.”The new initiative will include a series of online discussions on themes such as art and art history and will feature artist collaborations in a variety of media, including print, film, video, installation, performance, and photography. The inaugural exhibition will be a presentation of work by N/A and Nadezhda Tolokonnikova, Nadezhda Pappova, Nina Turner, Erin Corbett, and Alicja Stalder, among others.Other events that will be held will focus on the art of conservation, including an exhibition of work by Sara Cwynar and Natalie Näsänen, a presentation of work by Roald Näshuijsen, or 'The Wonder of Living,�", "The next Biennial should be staged in the spring of 2021. The institution has also developed a new platform, Biennial, which will allow families and individuals from different parts of the world to collaborate digitally. TELUS Architects has created a new digital platform for the exhibition “Places We Visit” that will be accessible online. The platform will be designed by artist Ron Gorchov, who has collaborated with the museum for more than twenty years, and will feature projects and performances by fifty-seven international artists, including John Akomfrah, Guy Galtier, and Yoko Ono, as well as three curated by the museum’s curator of modern art, Judith Richman. It will also feature new programming, including a presentation of work by two dozen artists.The exhibition, titled “Places We Visit,” is curated by senior curator of twentieth-century art Gerta Karlsson and will run for twenty days. The gallery is already working with artist Sean Kelly and the New Zealand artist Mavis Johns to create a new series of multimedia installations, called Multimedia Experiments, after a new ten-day section of the museum’s collection. The show will be presented by the Tycho Bra", "The next Biennial should be held in 2022 at the Württembergische Kunstverein Berlin, and will be organized in conjunction with the Bauhaus in the city of Dusseldorf.\n\n\nThe British artist Toby Jones, whose work examines the social and cultural impact of the Black Death, has died at age eighty-three at his home in London. His most recent work, 2016’s “Lord Seddon: The Black Death,” was exhibited at the London Biennial at the Royal Institute of British Architects in April.Jones’s work, which was inspired by a relationship with a family member, is concerned with the relationship between the Black Death and human populations in the particular locations where the novel coronavirus was first discovered—i.e., in the Black Death burials at the Cathedral of the Holy Sepulcher in London, the Black Death graves at St. Mary’s Church in Birmingham, and the Black Death graves at the Düsseldorf Cathedral. The exhibition opened at the London Biennial in October of 2016 and ran until March of 2017, with the opening of the exhibition in March 2019. Jones’s work has been exhibited at the Diller Scof", "The next Biennial should be held in 2020, the Art Newspaper reports.\n\n\nThe Whitney Museum of American Art in New York announced today that it is planning a major revamp of its campus, the centerpiece of which will be the creation of a new major-scale cultural center dedicated to working-class art. Dubbed the Whitney East, the new museum will include programming that draws from contemporary art, design, and performance and will host more than 1,500 works by artists of color, including the first-ever solo exhibitions of work by Black female artists, M.A. Wilber and M.I.A. White, at the museum.“The new Whitney East will present an interdisciplinary collection of art, inspired by and grounded in the experiences of artists of color, whose voices and histories are not usually heard,” said Jaye Robinson, cochair of MCA’s board of trustees. “In addition, the new Whitney East will be a research center for African American art, a museum dedicated to the art of storytelling, a museum dedicated to the art of self-embarrassment, a museum dedicated to the art of self-acceptance, and a museum devoted to the art of vulnerability.”\n\n\nThe", "The next Biennial should be announced as soon as possible. We will keep you updated with any further developments.\n\n\nSOCO Art Projects, the Michigan-based nonprofit that provides support for artists working in the creative arts and offers free or subsidized studio space in Dearborn, Ann Arbor, and surrounding areas, has replaced its director, Tanja Bond. In a statement, the organization said: “After a thorough search, we were able to find a suitable candidate who has the ability to bring an exciting and thought-provoking vision to the board. Tanja’s leadership and vision for our program has always been integral to the organization’s success. Her impact extends beyond the biennial, as she has helped shape the trajectory of our scholarship and has been instrumental in helping shape the programs for artists who are currently or have served as a catalyst for change.”Bond, who was responsible for running the organization from 2003 to 2018, was hired as the new director of the Greater Metro Detroit Art Museum in October 2018. Since the announcement, she has worked tirelessly to secure additional funding for the institution, establish partnerships with local, regional, and national artists, and secure additional national and state grant funding. In addition, she organized over a dozen", "The next Biennial should have a new exhibition concept and a new name. It should be more interactive, and will focus on the relationship between artists and the public. It should focus on whether this is the first time a Biennial has been staged in the city, and most importantly, it should showcase the work of thirty-five artists. It should be a celebration of the biennial’s 25th anniversary, and will be held at the David A. Dana Center.\n\n\nThe Hepworth Museum in Bemidji, Minnesota, has appointed Amanda Lissoni as its next executive director. Lissoni comes to the institution from the Northland Gallery in Minneapolis, which she has run since 2013. For her first full year as executive director, she worked with the Hepworth staff as they built their renovations, from the new exhibition space to the installation of the artist’s most recent work, “I, the River,” which opened on September 7. Lissoni’s curatorial projects for the Biennial include “The Greek, the Peruvian, and the Icelandic Worlds: The Odyssey in the Peru” (2018–19), “North American Indigenous Women: Their Story, Their Art, Their Love", "The next Biennial should only take place in 2020, but the theme could be anything from a one-time-only entry to a theme for every year of the 20th Century. The 2019 event was entitled “Away From the Mountains,” and it opened in Stockholm on September 3. The show, which was presented by Lars-Peter Bojesson, took place in a series of picturesque landscapes, each representing a different tradition and exploring the themes of isolation, ecology, and migration. The first exhibition, which was staged by the Danish curator Harald Sæmundsen, was curated by the Copenhagen-based artist Karin Norstedt, who traveled to Iceland to work with local artists, and featured works by the following artists: Perve Kjartansson, Hildegarde Vermeer, Fredrik Dahlström, Patrik Eriksson, and Per-Sobomuta Sato.The exhibition was organized by the Danish Academy of Art and was curated by the director of the museum Jørn Andersson. The next exhibition will take up the theme of the artist’s work. Juliana Mathe, director of the Museum of Modern Art in Oslo, said: “When I", "The next Biennial should be a celebration of the life and work of Ada Lovelace, the first female member of the Royal Society of Arts, in the United Kingdom. The theme will be “Human Rights” and will be the subject of an exhibition titled “Ada’s World.”Commenting on the formation of the Biennial, Peter Ott, director of the Royal Society of Arts, said that the new format will “provide a new platform for Ada’s work, which has long been out of reach of mainstream artistic practice.” He added: “We are delighted to see that so many people are excited about the possibilities of the new platform and look forward to sharing it with our guests.”\n\n\nThe Art Newspaper reports that the El Museo del Barrio, a popular arts and culture destination in the city of Barranquilla, Venezuela, has received a major gift of more than four hundred works by American artist Manuel Álvarez Barreto. The donation includes works on paper, drawings, photography, and installations as well as a video installation, and will be made in partnership with the Venezuelan government.The gift was made by artist and billionaire Antonio Pérez Ruiz", "The next Biennial should be held sometime in 2021. \n\nThe Hong Kong Art Museum (HKS) and the National Museum of Contemporary Art (Namco) in Shanghai announced on Tuesday that they are working together on a new retrospective of work by the late artist Gao Ming. The exhibition will explore the legacy of the late Chinese architect and theorist Liang Daqian (1904–1976). The years between his death and his exhibition at HKS in 1997 were a time when Li Ka-suan, the contemporary art historian who curated the exhibition, visited both museums.Li Ka-suan died in 2008 at the age of eighty-one. “Our theme is a new kind of space for our artists, a new kind of place for our audiences,” Li said in a statement. “Liang Daqian was a great teacher who taught us how to envision worlds and to respect the nature of space. His vision brought us into the life of a local artist, a local architect, and a local artist’s studio, and it made a real difference in the way I live my life.”Li is a curator and scholar whose work has been exhibited at the Hong Kong Biennial, the Beijing Art Summit", "The next Biennial should be held in 2020.The Arts Council released a statement on Monday, March 24, saying that the decision to postpone the conference was not related to the ongoing work of the UK’s National Organisations for Photography, Film and Video (Natures), which are currently on hiatus indefinitely, but was instead a result of the fact that the project on which the biennial was originally planned would not be completed by 2021.“The decision to delay the 2020 edition was not related to the work of Natures, but rather as a matter of timing,” the statement reads. “The event will now take place in 2021, with all of the same artistic vision and impact as ever.” The statement also says that the 2020 edition will be a “perfect culmination'” of the programme. The full list of participating artists is as follows:\n\nDate City, State, Province, Country Notes 1 July 2018: Brighton, UK, and London, UK, 2019. 2 April 2019: New York, NY, 2019. 3 March 2019: The Dallenberg Center in Cologne, Germany, 2019. 6 March 2019: Paris, France, 2019. 4 February 2019: Istanbul,", "The next Biennial should take place in 2022, and the first in 2021. This article is excerpted from the forthcoming book Designer and Architect: New Worlds, edited by Jane McManus. Also published by the Farrar, Straus and Giroux, and is available from the publisher's website, the publisher’s online bookstore, and the publisher’s retail partners.  Comments\n\nNew York’s Metropolitan Museum of Art has announced that it will reopen to the public on August 28, following a temporary closure due to Covid-19. The museum, which is currently closed due to the pandemic, expects to open to the public again around the second week of August.“With the exception of a few select dates, the Met has been closed since August 23, and has been serving visitors with a view into their homes only since August 26,” said museum director Daniel H. Weiss. “The Met’s exhibition program has been suspended for months, and as we await new procedures for the exhibition of the new work by artists, the museum will be open as usual, with no early opening or reopening restrictions. We expect that the Met�", "The next Biennial should be in the spring. The 2020 event, entitled Art and the Body, will host sixteen artists, including Graham Harman, David H. Doolittle, Milton Akte, and Jasper Johns. The 2020 edition will be held at the Smithsonian American Art Museum.The 2020 director and chief curator of the Art Gallery of Ontario,   Alfred Stieglitz, said: “The biennial is a great success story. It showcases the richness of contemporary art and it is a voice for Canada. I wish the years to 2020 to be a milestone for the biennial and for Canadian artists.”\n\n\nThe Museum of Contemporary Art (MoCA) in Chicago has announced that it will open its new building in the Windy City this fall on the site of the former Chicago Public Library. The landmark building, which will boast a new 6,000-square-foot exhibition space for the museum\u0097the first major renovation in more than three decades\u0097is being constructed by the Chicago-based architectural firm Gensler Architecture and is scheduled to open in 2021.“The redesigned building will showcase the museum’s tremendous collection, combine the museum’s current exhibition space with a new education center,", "The next Biennial should be held in the spring of 2021. The museum is currently renovating its building; the exact date is still being decided. “We are deeply grateful for the support of the Goethe-Institut and the community, which has made this momentous year truly remarkable,” said Bertrand Goldberg, chair of the museum’s board of directors.\n\n\nThe French Ministry of Culture and the Louvre have purchased twenty-four works by photographer Christiane Remarque for the museum’s collection, which was founded by the British artist and activist in 1988. The works, which include Remarque’s first series for the Louvre, “Bouquet des Beaux-Arts” (2001–2005), are part of a larger plan to increase the museum’s holdings of Remarque’s work by tenfold. The purchase was made by the Louvre and the Pérez Art Museum in Madrid, which will house the works on display in a future exhibition.The works were acquired through a deal between French billionaire Louis Vuitton and the artist. In 2012, Vuitton donated thirty-six works by the artist to the Louvre for its collection, which", "The next Biennial should take place in the city in 2020. \n\n\nThe Metropolitan Museum of Art (MoMA) in New York has named Natalie Stegason as its next director. She succeeds Cynthia Rosner, who retired in the summer of 2019 after eight years at the institution.“Natalie Stegason is an accomplished leader and an astute curator who has given groundbreaking exhibitions and created lasting works,” said museum director Daniel H. Weiss. “Her leadership, vision, and commitment to the Met were instrumental in the Museum’s move to a new home in 2015 and the museum’s continued success. We are grateful to her for her work and to her colleagues, who have contributed to our success and continued to shape our vision for the museum.”Previously, Stegason worked as a curator at the Museum of Modern Art, where she served as assistant curator of modern and contemporary art. She also held various curatorial roles in the museum. During her tenure, she curated the exhibition “Performances of Modern Art” (2019), “Mesopotamia: From the Affair of the Desert to the Paradise of the Deserts” (2017), “Laboratory/Theater", "The next Biennial should focus on addressing the legacy of the exhibition, and what can be done to ensure its future sustainability. Its next edition will be held at the same venue in 2021.\n\n\nThe Full Moon Foundation has announced that it has awarded $1 million to twenty-six artists in twenty-four cities across the United States. According to its website, the organization will conduct an open call for proposals on January 30 to help select the twenty finalists for the $50,000 Greater New York Award. The biennial will select twenty finalists from a pool of forty artists that includes Sam Giancana, Alex Katz, Amy Lawrence, Brooklyn Cowie, Maxime Mariner, Yolanda Martinez, Nestor Maran, and Domenick Navarro. The 2019 winner, Leporey Pascual, was also announced as the winner of the Greater New York Award. Pascual will receive an unrestricted $25,000 cash prize. Selected artists are Manolo Romero, Lorena Rojas, Cara Stevens, Susana Valadez, Michael Pironi, Maxime Rosales, Catherine Sanchez, Cher", "The next Biennial should be announced by the end of April, and the exhibition should be up in June.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is working in partnership with the artist-run nonprofit the Silent Project to organize an exhibition that will showcase the work of thirty-four contemporary artists. The exhibition, titled Biennial: Artists, 1965–1985, will kick off in May and will feature work by twenty-three artists, including Darius Albo, Barbara Brodsky, and Teresa Bonilla.The Biennial’s first showpiece, a thirty-one-foot-long sculpture by the Southern California-based artist Frank Gehry, will be presented by the nonprofit Ghostly Art in June. The show will be followed by a retrospective of the work of twenty-four contemporary artists by the Los Angeles–based artist-run nonprofit the Ben White Memorial Center for Artists in December.The Biennial: Artists, 1965–1985 is being organized by artist-run nonprofit the Silent Project. Its director, John McAllister, told the Los Angeles Times that the show’s construction is a “win-win” for both MoCA and the Silent Project. The initiative will allow the", "The next Biennial should begin with a visit to the exhibition space; create and coordinate a program of exhibitions, lectures, personas, performances, and performances, and organize a series of events, including a series of lectures and workshops, culminating in a biennial exhibition; and perhaps most importantly, develop a strong relationship with the community of artists who will be featured in the exhibition. The exhibition will launch in January 2021 and will run until December 2021. The central concept of the exhibition is that of a moving work, a series of interlinked activities that may be composed of individual works or collections. Titled Bicycle, the first exhibition will show the works of young and established artists, and the second will feature working groups, selected by curator Laura  and curator Hiroshi Nakamura, that have been working together on the exhibition.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has commissioned new works by twenty-three artists to its collection. The artists who were selected for the project are Adam Clayton, Nari Ward, Mary Ann Corrigan, Ralph Ellison, Sunil Gupta, Tarek Atoui, Alan Parsons, and Jensenroos.DCLA head Carolyn Miles told the Art Newspaper", "The next Biennial should be on the streets of Barcelona (2018). The museum has also announced that it will open a new location in the city of Cambrils, in the municipality of Almere, in the northern province of Almería, on September 6. The exhibition will also feature works by the Los Angeles–based artist John David, who shared his vision of a larger museum in the city. The inaugural show, titled “On the Island of the Gods,” will be held at the Museo de Arte Contemporáneo in Barcelona and will showcase the work of more than seventy artists. The exhibition will run until November 15. The Los Angeles County Museum of Art (LACMA) announced that it will open a new location in the city of Los Angeles in June. The institution will be located at 1200 West Twenty-Third Street, in the heart of Los Angeles, and will host forty-nine works by approximately fifty artists. “The kind of cultural exchange, in the form of a performance, a book, a performance, a film, a sculpture, and a performance, that LACMA will foster, is an ideal international platform for,” said LACMA director and CEO", "The next Biennial should be held in 2024, but the museum is currently evaluating the possibility of staging the exhibition in 2020. The institution plans to present the exhibition on the building’s reconstructed interior, which will host the exhibition as part of its 2020 Summer Olympics.The new venue will come with a new exhibition entitled “Architecture of Life.” The exhibition will be curated by architect and curator Mark Muro, who previously curated “Building & Architecture: From Neo-Plastic to Modernism” at the Museum of Modern Art in New York, and will showcase work by twenty-five international artists. The exhibition will also introduce a new level of programming that will be curated by curator and curator Leo Kuttner.“The theme of this year’s exhibition is Life & Lifeforms and how life and lifeforms function in relation to each other and the universe. We are excited for the art of reimagining the relationship between life and life forms to further our understanding of life and lifeforms.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that it has received a $1.2 million donation from the Rosenfeld Foundation. The gift was made in support of a donation made by the", "The next Biennial should focus on the period between 1910 and 1940, the period when the National Gallery of Art in Washington, DC, was founded. A new exhibit, “A Century of Exhibitionism,” will offer a glimpse into the exhibition-making process and will open in the fall of 2020.The two-part exhibition will take the form of a biennial, with two parts centered on the 2010s and 2020s, and will feature more than 150 works by seventy-three artists, including Mark di Suvero, Adriana Varejão, and A.J. Ayer. “The National Gallery of Art will explore how the exhibition of art has shaped, changed, and intertwined contemporary life through the critical and sometimes irreverential lens of its collections, exhibitions, and public programs,” said National Geographic director Mary Anne Carter. The biennial’s first retrospective, “Between the World and Me” (2019), opened in the museum’s former home in 1927. The biennial’s second, “Diana Alpert: The American Sculptor,” (2019), was held in the museum in 2016.\n\n\nThe Solomon R. Guggen", "The next Biennial should begin in January 2021 and will include a selection of works by artists and organisations that have not previously participated in the event. The first exhibition, 'Human Models of the World', will draw from the current exhibition for the third Biennial, “The Creative Life and Death of Art” (2019), featuring work by twenty-three artists. The Biennial will also be the largest event that the institution has staged since its relaunch, with a grand opening ceremony in May 2020 and a show in December 2021. \n\n\nNew York’s Museum of Modern Art (MoMA) is pulling five works by artist William S. Burroughs from its upcoming exhibition “The Elephant in the Room: Art and the African Diaspora” in protest of the museum’s association with the controversial Scottish artist. After the museum’s board voted to cancel the show, which was set to open on January 18, the Richard Gere Foundation for African Research (RGH) launched an appeal for funds to compensate the institution.“MoMA’s decision to reopen an exhibition that celebrates Burrough’s work is not only an affront to the artists whose work is being honored, but it is", "The next Biennial should be in 2022. The museum will reopen in 2021.\n\n\nThe European Court of Human Rights has upheld a ruling that found Hungary guilty of violating the country's human rights record by rounding up hundreds of migrants to deportation centers in Budapest on October 23, 2016. The landmark ruling, which had been hailed as a victory for activists campaigning for the European Union to take more aggressive action against Hungary, was overturned on appeal by the European Parliament on Thursday. The ruling, which upholds a three-month suspended sentence for Bulent Sesátari, the former director of the Directorate General of Labor in the Ministry of Employment, was issued after a two-week trial at the Strasbourg Court of Human Rights.Sesátari, who was sentenced to six months in prison after being convicted of falsifying labor and social security records in 2017, was facing up to four years when the court upheld the guilty verdict. The court found that the former director of the National Democratic Centre-Hungary (C-EMB) group, which was active in protesting the release of political prisoners, had defamed Hungarians by accusing them of working in a factory for a foreign company and that he had lied about his employment at the group. The group", "The next Biennial should be held in the fall. Timur M. Tezuka, director of the Taku Noguchi Museum in Seoul, said: “Considering the current situation in Afghanistan and the rapidly changing geopolitical landscape, I think this is the time to take a step back and reflect on the past. I am also convinced that the work of the biennial will breathe new life into the dormant history of World War II in the region.”\n\n\nThe National Art Museum (NAHM) in Washington, DC, has received a gift of thirty-six works by American artist Harry A. Woolf that were digitized and are now on display in its new exhibition “Woolf’s Afterword.”The work, which was digitized by the museum in conjunction with the institution’s reopening in March 2020, was donated by Dorothy G. Bennett. The gifted collector acquired the works from Harry A. Woolf’s estate in 2009 and found them in storage. “Harry A. Woolf is an American artist whose work is widely celebrated and admired,” Bennett said in a statement. “His paintings are among the most important of his century, and his drawings are among", "The next Biennial should include a selection of work by nomadic artists in the region such as Kader Attiyah, whose work is on display in the exhibition “Citizen Biennial.”According to the Art Newspaper, there are currently more than 1,500 entries in the upcoming exhibition, “Sharon M. Hamilton: A Biennial in Black and White” and Hamilton, who is best known for her photographs, has said that she wants the exhibition to “attempt to capture the spirit of the future with a minimalistic aesthetic.”The exhibition will also feature works by artists who are part of events such as the Detroit Art Fair and the Detroit Art + Design Show, as well as works by established and emerging artists, including Kate Donoghue, N.A. Shah, Meline Massey, and Qiu Zhijie, and will take place at the Detroit Institute of Art, which is currently undergoing a $1.5 billion expansion.Additionally, the museum will host a number of programming, including an exhibition of works by artists whose work is currently on display on the institution’s permanent collection. The first show, “The Problem of Intention” (2019), is a retrospective of work by", "The next Biennial should be held at a location that can support the project. This can include an existing museum, a new architect’s office, or a vacant lot. The next edition will feature two new works by the artist, “Symphony of the Sun and The Moon” (2019) and “The Night Sky,” (2019). “The future of art is here,” said Sohrab Mohebbi, chair of the exhibition’s curator. “We can’t wait for the future, we’re going to start now.”\n\n\nAs the state of New York City works to contain the coronavirus, which has spread to more than 180 countries, including the United States, and many regions of Asia and Europe, the Independent Art Museum (IAM) in New York has announced that it has received a donation of twenty-six works. The works, which are being curated by the artist-run organization St. Michael and the Archangel (SMART), were donated by the newly founded Philbrook Foundation, which is raising funds for the museum in partnership with the Whitney Museum of American Art and the Metropolitan Museum of Art.The funds will go toward", "The next Biennial should take up the theme “Langen des Affaires” (Life With Affection), which would have been dedicated to the gift of art. The exhibition would have featured a selection of works by artists such as Michelangelo, Merce Cunningham, and Edvard Munch, as well as works from the African American arts canon.The final panel of the exhibition would have been a “Wangechi Mutu” (Skin of a Man), a “witness account” of life and death in the African American spiritual traditions of the Black Lives Matter movement.The 2019 edition of the exhibition, titled “Langen des Affaires” (Life with Affection), was first presented at the Smithsonian’s Diller Scofidio + Renfro–designed building in 2013 and won the first edition of the Rosenman Prize in 2017. The 2010 and 2011 editions of the exhibition, titled “Painted Civilizations,” were staged at the inaugural Diller Scofidio + Renfro–designed museum in Harlem, respectively.\n\n\nBarnes & Noble has announced its partnership with the German art blogging site Heresiksforum, which has developed a long-", "The next Biennial should be held in 2020.\n\n\nThe Carnegie Museum of Art in Pittsburgh, which has been closed since December of 2016, has tapped Miriam and Imani Schipper as its new cochairs. A former dean and chair of the department of art history at Carnegie Mellon, Imani Schipper previously served as a curatorial assistant at the Museum of Modern Art in New York from 2013 to 2015 and as a curator at the Museum of Contemporary Art in Chicago (MCA) from 2016 to 2017.“We are thrilled that Miriam will be joining us at the Museum of Art and the Carnegie Museum of Art as we continue to expand our network of partners, develop new projects and build new conversations around important works,” said David Scharf, the museum’s director and CEO. “Miriam’s expertise and love of the arts will also complement the work of our talented curators and scholars as they continue to foster the conversation around identity through art.”Schipper, who joined the museum as its acting director of curatorial affairs in 2016, also serves as a professor at the University of California Berkeley’s School of the Art Institute of Chicago and is the author of the memoir The Entire", "The next Biennial should be held at the museum in December 2021.\n\n\nThe National Galleries of Scotland has unveiled its ambitious plans to open a new museum dedicated to the life and works of Sir David Attenborough, the iconic British television star whose iconic portraits have graced countless buildings across the globe and whose work has inspired countless imitations.The institution will boast of a 1,700-seat, sixty-two-foot-wide, glass-enclosed, terrace-like pavilion, a digital-museum-like experience, and will be located in the heart of Edinburgh, the National Museum of Scotland, and the National Museum of Scotland Southwest.The new museum will be built in partnership with the local authority, the Scottish National Gallery, and will inaugurate with a new exhibition, “David Attenborough: Life and Works” in November 2021. The show will be followed by “David Attenborough: The Life and Works of Sir David Attenborough” in December 2021 and “David Attenborough: The Art of Design” in June 2022. The program will culminate in a retrospective of the iconic television star as part of a global tour.The National Galleries of Scotland is also planning to", "The next Biennial should be held in 2022.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has appointed Ashley Ritchie as its new associate curator of African American art. Ritchie currently serves as an assistant curator of African American art at the museum. Previously, she was a curator at the museum and worked as an independent curator.“Ashley is one of the key figures in the ongoing evolution of the MFA’s mission to be a space for the study and appreciation of African art. Her extensive experience in the field and mastery of the MFA’s curatorial and institutional repertoire make her a strong choice for this role,” said museum director Alicia Garza. “The MFA’s exhibition program and history of exhibitions and the museum’s collection are exceptionally rich and well known throughout the country and beyond. She’ll generate new scholarly and popular attention to this important period in American art history, and continue to advance the museum’s mission to be a space for an open platform for scholarship and artistic experimentation.”Ritchie will assume her new responsibilities this fall. Prior to joining the institution, Ritchie was a curator at the Atlanta Museum of Art, where she worked from 2012 to", "The next Biennial should include more contemporary exhibitions that reflect the growing breadth and depth of the art world and its connection with the city and the people of Los Angeles. Two years from now, we will resume our mission to bring the art of the twenty-first century to life in the arts.”The 2020 edition of the Biennale will be held at the Los Angeles County Museum of Art (LACMA) from October 19 to October 22. The event’s inaugural iteration, “10 Years of 'Arts” (2011–2012), was held at the San Diego County Museum of Art in California and drew over three hundred thousand visitors. The 2019 edition of the event, “10 Years of Living Art” (2017–2018), drew some sixty thousand visitors.\n\n\nMorpho Art, the New York–based nonprofit that brings contemporary art to central New York, has appointed Scott Perry as its next executive director. Perry currently serves as the executive director of the public-private organization that operates the Mantua Museum of Art in New York City. He succeeds Domenic Cini, who retired in October after seventeen years at the helm of Morpho, and will assume his responsibilities on September 16.�", "The next Biennial should be held in the year 2021, and it will be hosted at the Ankara Art Museum, which is currently undergoing a renovation. The museum, which has a long-term plan for a new building that would also include a gallery and restaurant, has faced numerous setbacks in the construction of a new museum in recent years.\n\n\nThe French government approved a new law this week that will allow the restricted sale of a single head of Charles Martin, a 15th-century French Jesuit philosopher and theorist of the modern state. The controversial piece, entitled 'On Liberty', was included in a set of works that will be exhibited at the Museum National d'histoire du Paris in July.The controversial work, which was part of the collection of the late French philosopher Jean-Paul Sartre, was removed from display in February 2019 amid a dispute between the institution and the author of the work, Pierre-Auguste Sartre Jr., who was a close friend of Martin and a transatlantic partner in the Catholic University of Saint-Jean-Baptiste, in Saint-Nazaire.The Museum National de Paris had argued that the exhibition “crosses the limits of our view of the world” and would have been difficult to organize", "The next Biennial should take place in 2021, but the timeline for its return has yet to be established. \n\n\n\n\n\nChed Evans, the director of the New Arts Center (NAC), Durham, North Carolina, and the author of STARTING WORKS , Southwest, and NAC: Our City, Our Place, has been selected to be the next director of the Detroit Institute of Arts (DIA). Evans will assume his post next month. He succeeds Keith Akers, who in March 2019 announced that he was stepping down after eighteen years at the helm of the DIA and will assume a new role that will begin in January 2021.“Ched Evans’s experience and perspective will show the DIA and the world how a culturally and institutionally vibrant local arts community can thrive as a global city,” Akers said in a statement.“He will be integral in restoring Detroit’s arts and culture ecosystem to its former glory, helping to shape a city that is proud of its history and proud of its role as the home of the Detroit Institute of Arts (DIA), the state’s oldest independent arts organization.”Since 2004, Evans has directed the DIA, which", "The next Biennial should take place in 2021 and will be hosted at the Museo de Arte Contemporáneo in Madrid.Its next edition will include sixteen exhibitions organized by academics and artists, as well as an open call for artists to present works on the theme of the year. The theme for the 2021 edition will be “Arts and Design in the Thirty-second Year.” The 2019 edition featured work by seventy-five artists.\n\n\nThe fourth annual Art in America awards, presented by the Art Institute of Chicago, will offer financial awards of $25,000 and $50,000 to artists and organizations that demonstrate innovative, compelling, and original work in the exhibition. Each awardee will receive $1,000.The awards will be given to the seventy-five artists and organizations represented by the Art Institute of Chicago who have received an award in the last two years. The seventy-five finalists were selected by an independent jury\u0097the same jury that selected the final recipients of the previous awards, in 2012 and 2017. They were judged based on their exhibition excellence, artistic impact, artistic quality, and educational value. The jury selected the thirty finalists for this year’s awards, which are based on an award ceremony", "The next Biennial should be held in 2021.  We received a gift of twenty-four paintings from the artist in exchange for “inclusion of his work in the exhibition,” the exhibition’s organizers wrote in a statement. The Biennial will be staged at the Museo de Arte Contemporanea in Madrid and will offer a retrospective of the artist’s photographs in 2020. The work, titled The Art of Sculpture, was commissioned by the UCCA Foundation in collaboration with the institution of the same name in Lisbon. The show, which will be held in the building of the Museo de Arte Contemporanea, will aim to provide a platform for the artist’s works. “The Biennial’s series of exhibitions in various cities across the world’s major cities, as well as the exhibition of “The Struggle” in Tallinn in the year 2020, will aim to highlight the complexity and diversity of the artist’s work and to perform the work in all its diverse forms,” said Abigail de Castro, the founder of the UCCA Foundation. In a review", "The next Biennial should host a final exhibition of work on the island of Guam, which is currently under construction. The work, titled “The House of War,” will be on view in the exhibition “The Future of War,” in the fall of 2020. A project for the exhibition will be launched in 2021. According to the artist, the exhibition will address issues of history and the future of war through the medium of Japanese animation, in order to “open the eyes of the audience to a different world.”\n\n\nDemian Diné’s first solo exhibition at the Gallery of Modern Art (GMA) in New York, which will run from April 4 to April 6, is now closed. The show, titled “Brutus: From the Black to the White,” ran for thirty days and generated more than a dozen works, which were presented in a variety of media. The show’s master curator, Victoria Lee, said it was “difficult to know what the future holds for art,” and that the exhibition “was not meant to be an end,” but rather a “beginning.” Diné said: “", "The next Biennial should be held in 2020.\n\n\nArchitecture and Design Museum in New York, the Museum of Modern Art (MoMA), and the Metropolitan Museum of Art (MoMA) have announced that they will jointly launch a three-day event that will include over one hundred artist presentations and an exclusive exhibition of work by artists Jean-Michel Basquiat and Jean-Michel Le Bon.The event will take place at the Museum of Modern Art in 2021 and at the Metropolitan Museum of Art in 2022. The opening of the exhibition will be on October 29 and the closing of the museum will be on November 23. All three museums are participating in the Art of the Party. The twenty-third edition of the event will be held at the Museum of Modern Art in 2021, the Museum of Modern Art in 2022, and the Museum of Modern Art in 2025—the exhibition will be preceded by an opening ceremony on September 7.Sponsored by the artists, who are partners in the New York–based firm Bear & Brown, is an exhibition that will present work by the artists in a collaboration that will include a performance, three solo performances, and a survey. The center is releasing the exhibition as part of a series that", "The next Biennial should be held in 2021. That year, the museum will celebrate the centenary of the founding of the Philadelphia Museum of Art. Matthew Weiner will serve as the next director of the Philadelphia Museum of Art (PMA), and the institution will further expand the scope of its work with the acquisition of more works by the artists that are currently exhibited in the museum.  The announcement of the biennial was made on the occasion of the Expo America, which is taking place in the city’s historic Washington Street corridor. The exhibition will run from December 15 to December 20 and will be inaugurated by the individual work of Andrea Adams, a female contemporary of Adèle Exarchopoulos who was based in Paris during the seventeenth century.Inaugurating the exhibition will be the opening of a new partnership between the Pérez Artes, the Philadelphia Museum of Art, and the Philadelphia Orchestra. This partnership will allow the Pérez Artes to present the work of one of the most celebrated contemporary artists of our time, Andrea Adams. The partnership will also provide the Philadelphia Museum of Art with an innovative way to engage with the American culture through the Pérez Artes’ exhibition of the first work by Enric", "The next Biennial should arrive in the second half of the year, and will seek to create a new kind of public space that can be a refuge for the homeless and a platform for the exchange of ideas and experiences. The initiative will also draw upon the works of contemporary artists and will include a curated selection of the most important new exhibitions.”\n\n\nThe Academy of Fine Arts Boston (AFAB) announced today that Sara Cwynar, a prolific, award-winning artist whose work explores the ideas, methods, and aesthetic aspirations of artists of color, has been selected as the winner of the $100,000 Laura and John Albright Prize. The award is given annually to an artist who has made significant contributions to the arts and who has demonstrated a passion for art. The annual $50,000 Cooper-Hewitt Foundation gift was made in recognition of Cwynar’s work Suffragette, 2012, which was presented at the Greater Boston Art Festival in August.The artist was nominated for the prize for her work Lincoln, 2011, which explores Lincoln, the American South, and its relationship to racism. The work was selected by a jury comprising Anton Leeson, editor of Artforum", "The next Biennial should be held at the National Museum of Fine Arts, Boston, which was recently awarded a $60 million expansion and renovation, and will be held in the spring of 2021.“The National Museum of Fine Arts is a remarkable institution,” said David Pollack, president of the National Museum of Modern Art. “Its collection consists of more than one hundred thousand works by some thirty thousand artists, and is the largest exhibition-based museum in the United States. We are confident that the eighteen-and-under-senses will be entertained and inspired by the unique collection, the innovative and vital exhibitions, and the world-class collections on display.”The biennial will include works from forty-four galleries nominated by the National Foundation for Art and Arts (NFA), which is a division of the National Association of Art Dealers, and will inaugurate the entry-level biennial exhibition “The Future Is Present: Contemporary Art and the Future of Art.” The program will include an introduction by Hirshhorn Museum curator Marcia Angell and artists such as Diana Adams and David Ayer, among others.Commenting on the biennial, David F. Maxwell, NFA’s chair, said:", "The next Biennial should take place in 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has suspended the hiring of three employees, who were suspended for alleged behavior related to the recent wave of Covid-19 cases that swept through the city. The department’s director, Michael Dewhurst, announced the suspensions on Instagram, where he shared a statement regarding the announcement: “I’ve suspended three employees for alleged misconduct. It’s not uncommon for organizations to have multiple employees suspended for misconduct; in fact, it’s the norm. But this was an isolated incident.”The department previously suspended three workers for the same offense: an employee who allegedly stole a custom-built drum kit from the museum’s collection. The drum kit, which dates from the 1970s and is valued at $1 million, was part of the public exhibition “The Drum and the Museum” (2017), which showcased the work of fifty artists. The three individuals were also suspended for “disrupting functions,” a violation of the Occupational Safety and Health Act, but the department decided this was a case of “mischief,” not “criminal misconduct” and they", "The next Biennial should take place at the museum in 2020, but it is unknown when the first exhibition of the new work by artist Jeffrey Gibson will open. Commenting on his role, Gibson said, “I have spent the last two years traveling extensively, building up a strong exhibition program at the museum that will continue to present the work of the biennial through 2020. I’m eager to continue this work with the Museum’s new vision of the collection and to continue using the biennial to create opportunities for the British performance and design community to connect with the work of the biennial’s artists.”\n\n\nThe Pérez Art Museum in Mexico City has appointed its first female director, Latoya Barba. She will succeed Fabiana Freire, who will retire in March after nearly three decades at the helm of the institution. Barba will take up the post on August 29.“We are very pleased to welcome Latoya to the Pérez,” said Páez director Josefo de la Rosa. “Her deep experience and passion for the museum and for the collection, coupled with her commitment to supporting artists and the mission of the Pérez, makes her a wonderful", "The next Biennial should take place in 2021, with the exhibition featuring works by sixty artists, including Chris Levine, David Harvey, and Lisa Guggenheim, and will examine the effects of climate change on the planet and the future of art in a way that has never been done before. The 2020 edition, entitled Art and the Climate Crisis, was curated by Daniel H. Weiss, who is currently the inaugural director of the Stern Center for Climate Change Research in New York. The biennial is organized as a series of installations, works, lectures, and other public forums in order to draw attention to the climate crisis and the ways in which art can be a powerful tool for social change.“I’m delighted to be working with some of my most distinguished colleagues and colleagues to bring you this exciting exhibition,” Weiss said in a statement. “Art and the Climate Crisis will serve as a timely reminder that art can transform lives and change the world for the better. This exhibition will finally engage with the themes and the work of the Biennial to the fullest extent possible.”The exhibition will also introduce a new survey of Francis Pina with the opening of “Francis Pina: Bosch and the Art of", "The next Biennial should be the fourth edition of the event, which will take place at the museum in 2021. The first edition featured work by sixty artists, including Sabina Pindell, Fareeza Saeed, Ben Kuzma, and Nari Ward. The 2020 edition will mark the two-hundredth anniversary of the institution. “The next Biennial will be a major step for the museum, revealing the comprehensive and interdisciplinary history of our most celebrated artists, a history of which will inform our appreciation of the achievements of the past,” said Susan Abney, the museum’s director.\n\n\nThe Museum of Modern Art (MoMA) in New York has added six new works by artist Courtney Love to its collection, bringing the total number of works in its collection to nineteen. The works, which were commissioned by Love and include a landscape view of New York, were commissioned in 1976 and 1977, respectively. The works were on display in a retrospective of Love’s work, “From the Floor to the Sky: Engineers, Engineers,” which opened at the museum on September 11, 2017.The works, which were founded in the ’70s Hawaiian Islands, were exported to the", "The next Biennial should be organised as soon as possible to allow the art and design communities of San Francisco, New York, and New Jersey the opportunity to present their works in a timely manner. Joyce was appointed as the new director of the Biennial in November 2017 and has since organized a number of exhibitions, including the first seven-figure exhibition of work by artist María Berrío, the last exhibiting work by San Francisco’s own Zendo Foundation.In an interview with Artnet earlier this year, Joyce said that the new biennial will be “designed to be a laboratory for the future.” His team will work closely with the artist-run spaces in the city and will offer programming that is unique to each of these areas. The first phase of the exhibition will focus on installations created by the artist-run spaces and will run from March 15 to March 23. The second phase will include more general exhibitions, including a digital event, “Art in Ninety Days,” in September 2020. The third phase will focus on more research-focused programming and will be announced in September 2021. The fourth and final phase will be a “complete redesign of the city,” Joyce said, and will be inspired", "The next Biennial should not be held within seven years of the last one, but should be a collaborative project between Professors Kapp and Piquet, with the support of the city, the indigenous community, and the state.”The organizers’ decision has been met with confusion and anger from some local and international cultural figures, including the president of Argentina, Cristina Fernández de Kirchberg, who called it an “unacceptable” betrayal of his country’s traditions and the will of the Argentine people.\n\n\nA group of artists and activists in the Philippines are calling for the removal of a controversial $6 billion statue of the late dictator Ferdinand Marcos from a monument commemorating the late dictator’s mass killings and torturers in the country’s capital, the capital of the country’s southern Mindanao region.The “Era of Terror” monument commemorates the years of martial law under Ferdinand Marcos from 1946 to 1972, during which time thousands of people were killed in mass shootings and other anti-government crimes by security forces. The activists behind the campaign to see the statue taken down cite the country’s horrific rise in drug-related violence and its human rights abuses under", "The next Biennial should be held in 2020.\n\nThe Palestinian Institute of Arts (PIA) in Nablus, West Bank, has suspended its 2022 edition, originally scheduled to take place in February, citing the ongoing Israeli aggression against the Palestinian people. On Tuesday, PIA board president Walid Raad announced that the event will now be held in March. “We have decided to postpone our 2020 edition until March 20, 2022, and return the year to 2022,” Raad said.PIA is one of the few Arab arts organizations to cancel its events in the face of the Israeli offensive, which has been met with a massive international response from Arab and international arts organizations. The United Kingdom and France have denounced the Israeli offensive as “barbarbaric” and have called for an end to the violence. “The PIA team is deeply concerned by these events and deeply concerned that this year’s edition will not take place,” said PIA director Walid Raad. “We have made our position very clear to the Israeli government and the PIA team: we fully accept that we have a responsibility to participate in a peaceful resolution of this conflict, and we fully support continued Israeli operations", "The next Biennial should be held at the Sarajevo Art Museum in February 2021, and the exhibition should open to the public in March 2021. The museum has said that it plans to hold the inaugural exhibition at the gallery within the next two years.\n\n\nFollowing the deadly shooting at the Pulse Nightclub in Orlando, Florida, which took place on Sunday, June 12, 2016, on the resort island of Saint Mark’s, the City of Miami Beach announced that it will construct an eight-mile-long, 1,200-foot-diameter stadium for the football team, the Miami Dolphins, at its downtown location. The $100 million stadium will open in 2021 and will host more than 80,000 Dolphins fans a game, on average, as part of a new deal with the team.“This is a historic moment,” said Mayor Rick Kriseman. “Mayor Flacco’s vision to put an end to gun violence and build safer communities has never been more important than it is today. We’re creating a new chapter in the Miami Dolphins’ history, one that reflects the city’s identity and our city’s proud tradition of innovation and creativity.” The announcement", "The next Biennial should take place in the spring of 2021. “I want to thank all of you, especially the curators, for this year’s exhibition,” Şafin said. “It was a challenge to create a show for 2021 that is modern and contemporary and that drew from the themes of the past but also from the contemporary, and that is especially relevant now.”\n\n\nThe Noguchi Museum in New York has appointed Sara Casolari as its next executive director. She succeeds Lena Donohoe, who joined the institution in the summer of 2019 as director of design and innovation. Casolari joins Noguchi from the Metropolitan Museum of Art, where she has served as the curator of contemporary art since 2017, and comes to the museum from the Metropolitan Museum of Art, where she has served as chief curator since 2019.“The Noguchi Museum is thrilled to welcome Sara to the Noguchi board and staff,” said museum director and CEO Michael L. Noguchi. “Her extensive experience and leadership role in the museum make her a strong choice to shape the museum’s future direction and successful long-term strategy. She’s been instrumental in", "The next Biennial should start as soon as possible. The museum is currently negotiating a new contract that will include a new audience of twenty-two thousand people. The contract is expected to be completed in June. “While we are unable to speculate on the outcome of this negotiation, we know that the new contract will enable the museum to continue to present relevant and innovative exhibitions, to present new works, and to conduct important research projects,” said Jean-Philippe Leclerc, director of the Louvre. As part of the contract, the museum will move the works of forty-eight artists, including Ingvildur Andersson, Galerie Eva Presenhuber, Halil Altındere, and Louise Nevelson, and will organize a biennial of drawings and prints from the late nineteenth century to coincide with the opening of the museum’s new building.The show, titled “Parsimony,” will be held in the new museum, which opened in the city of Saint-Tropez in the French Alps in 2014, with a reach of 1,200, in April 2020. The museum will also be expanded with exhibition space for contemporary art and a lecture series. The renovation project will include the construction of", "The next Biennial should take place in early 2021, with the institution predicting that its new locations will be selected with a view to expanding the exhibition. The redesigned venue will accommodate sixty-three contemporary works by forty-nine artists, including Kim Seo-kyung, Kim Eun-sung, Kim Jae-kyung, Kim Soo-kyung, Kim Yoon-kyung, Kim Yoo-kyung, Kim Yoon-kyung, Kim Young-kyung, Kim Young-Eun, and Kim Yoon-Eun.\n\n\nThe Hong Kong–based, New York–based nonprofit art center Haus der Kunst (HdK) has received $35 million from the Rockefeller Brothers Fund in support of its expansion into Hong Kong. The $35 million gift, which also includes $20 million for a new governance structure for HdK, came from the philanthropists Warren and Arne Guggenheim in collaboration with private investors James Murdoch, Michael Nelson, and Alan de Selding of the Guggenheim family. The fund also provided $10 million for the expansion of its current workshop space in the building formerly occupied by the Rockefeller Brothers Fund, which is now being renovated by the Hong Kong Finance", "The next Biennial should be held in twenty-six months. “The council understood that this was a very challenging time, and that it would have been the first time the museum had ever been unable to pay all of its staff, and this was a very serious matter,” museum director Paul Mpagi Sepuya said. “We had been working with the staff to understand that this was a serious issue, and that we had to do all we could to try to overcome it. But we also knew that we were in the midst of a transition, and that this could change.”The Ateneo Art Museum is still waiting to hear back from the government on its request for a temporary closure of its three remaining locations, which are in the city of Takapattu in the central island of Kalimantan and the town of Nuku, in the southern province of Kalipety, until February 8. The museum has been closed since March 10 because of a coronavirus outbreak.On March 16, the Cabinet Office approved an emergency funding package of $6.5 billion for civic and state institutions. The bill also extends the expiration date of emergency aid by one month, extends the period during which people may not be"]