["The next Biennial should be staged at the newly renovated museum, in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Miami Beach has appointed Jennifer D. Fox, the former director of the Art Institute of Chicago, as its next general director. Fox has helmed the museum since 2016 and will assume her responsibilities on January 4, 2020. Fox will succeed Donna Ettig, who will continue to serve as general director through the end of the 2021–2022 fiscal year.“The museum and I am honored to be working with Donna and the outstanding team at MFA,” said Fox. “They have an amazing, inspiring collection of art and incredible collection of works in the museum, and I am excited to be a part of their future.”During her tenure, Fox helped shape the organization’s collection strategy and oversaw the institution’s expansion, which added more than three hundred galleries and opened more than two hundred new museums. During her tenure, she oversaw the opening of the new Greenpoint museum of Art in 2017 and oversaw the construction of the new museum in 2018. She also helped the museum realize its vision for the Greenpoint building, which also includes performances, a concert venue, an education center,", "The next Biennial should give a first survey of the works of the present generation and consider the question of the continuance of their work and of their relation to the future. The show should present a preliminary sketch of the theme. The Biennial will be a forum for reflection on the meaning and the art of the past and will examine the possibilities of the future. It should be a place of reflection and animation on the history of art and art history. The exhibition should be a reflection of the spirit of Biennials. It should reflect the challenge of the present moment and its possibilities. The exhibition should be a celebration of the spirit of the biennial and the biennial at large. The exhibition should unfold a narrative of the biennial and the history of the exhibition and of the exhibition in general. The programme of the Biennial should reflect the spirit of the exhibition and the artists in general. The exhibition should be a reflection of the spirit of the exhibition and the Biennial at large. The show should be a celebration of the spirit of the exhibition and the Biennial at large. The show should be a reflection of the spirit of the exhibition and the Biennial at large. The show should be a reflection of the", "The next Biennial should be held in 2022.\n\nThe Hawaii Museum of Art (HMA) cut its staff by fourteen percent last month and expects to reduce the force by twenty-seven percent. In a statement, director of programming and communications Mark Ellerbe said: “HMA has been a transformational platform for Hawaiian art and has been instrumental in driving the art of our collection forward. As we look to the future, we will continue to use all of our assets to advance the mission of Hawaii’s collection and to represent the diversity of artistic traditions that make Hawaiʙi special. We are excited about the future of the HMA, and we are even more excited that it is being brought together in Hawaiʙi.”Founded in 1841 by Robert Rauschenberg, the German-born American industrialist, the institution houses some forty million objects, including works by sixty-four artists, from the artist’s extensive body of work. The museum has seven exhibition spaces, which can accommodate up to thirty-six exhibitions per year. The new lease agreement between the museum and the city of Honolulu requires that the museum remain within the boundaries of the Pearl District, which includes the HMA, for", "The next Biennial should be held in 2021.\n\n\nThe Metropolitan Museum of Art in New York is launching a new four-year, $64 million initiative to increase the visibility of the work of women artists. Called the “Women in the Gallery” program, the initiative will focus on the work of fifteen artists, representing thirty-six countries, and will consist of three distinct phases, beginning in the fall of 2020 and running through February 2021.The artists selected for the 2020 iteration of the program are Alessandra Borghese (Austria), Orlova Bicchier (Hungary), Khristina Bichton (Cuba), Luzanna Guarani (Mexico), Marianne Piché (France), Charlotte Suss (Australia) and Leila Bishton (Australia). The artists who will return in 2021 are Katharina Csík, Anjuli Devi (India), Pilar Corrigan (Mexico), Christoph Collin-Kramm (Germany), Yinka Dansgaard (Denmark), Susan D'Amico (Italy), Peter Sacco (Italy), Ruth Dadds (Australia), ", "The next Biennial should have been organized in late April or early May, with the exception of the one-time events, such as the Biennial of European Art in Dusseldorf. The biennial of the Mexican artist Enrique Peña Nieto will be staged in late June.With the midterm elections on April 19 and the presidential elections on April 22, the political climate in Germany is already undergoing an adjustment. Chancellor Angela Merkel recently announced that the federal government will phase out coal-burning and shift to renewable energy, and the country is also actively developing a greenfield $7.2 billion mega-project, the Advanced Biogas Thermal Power Station (ABT), that will generate 30 percent of Germany's energy through renewable sources. Although Berlin is currently working on revamping its energy system, it is expected that the ABT, which is expected to be operational by 2021, will significantly reduce emissions.\n\n\nWhile the 2016 presidential election season was marked by a number of high-profile setbacks—including the revelation that Donald Trump was elected despite repeatedly denying he was capable of such atrocities, and that Hillary Clinton won the popular vote by nearly 2 to 1\u0097a result that many believed was rigged against Trump and in favor of Clinton\u0097the number of Americans", "The next Biennial should take place in 2020.\n\n\nThe Imperial Museum of Art, London, has introduced a new subscription service to help promote the work of emerging and established artists. The platform, called the Artist Box, will feature biennial artists as well as selected works by other artists and organizations.The platform will be hosted by the Lisson Gallery, where the works will be curated by visual artists such as Michael Wheeler, Abigail and Michael Thomas, and Eleanor Paine. The platform will be offered on the museum’s new digital platform called the Museums Network, which will be launched in the coming months.The new platform will allow visitors to browse the art of twenty artists in the museum for only £10 per year. It will also include a monthly curated showcase of work by the artists featured in the Artist Box. The event will feature works by thirty-four artists and will be hosted on March 14.\n\n\nThe inaugural biennial “Art in the Time of Trump” will return to New York City this fall with forty-four artists, including Ewa Josuttus, Byron Hall, Red Sun, and Red Hand. Subscribers will receive one-time only digital access to these artists for a period of ten weeks after", "The next Biennial should be held in 2019. The next edition will be held in 2020.\n\n\nThe Scorpion Art Museum in San Francisco is expecting a major expansion, featuring an additional 500,000 square feet of exhibition space, the museum’s first academic building, and a new research center. The $450 million expansion will also include the construction of a new 15,000-square-foot building, a new amphitheater, and a new residence hall.The additional space will allow the museum to host more exhibitions of contemporary art and to expand its collection by fifty percent. The museum will also receive an additional 800,000 pounds of ancient materials, making it the largest museum in North America to receive the new material. The new building will be designed by the firm Skidmore, Owings & Merrill, and will be inaugurated by a major presentation of works by the artist Chuck Close.“The new building is so much more than a museum,” said Jorge Avalos, chair of the board of trustees of the museum. “The new SculptureCenter will enable us to provide one of the most advanced education platforms in the country on the most important art of our time.”The project also involves the restoration of the original", "The next Biennial should take place in 2021.\n\n\nThe Poetry Alliance in Philadelphia has received a gift of more than five hundred photographs, prints, and sculptures that were donated by the artist and collector Richard Avedon. Through his generosity, Avedon waived the artist’s right to sue the city of Philadelphia for the purchase of his works, which were displayed in his first exhibition at the Philadelphia Museum of Art (PMA) in 1971.“I’ve been a Poetry Alliance supporter since the early 1970s, and have been working to secure their future with a donation of fifty works that are at least eighty years old,” said Avedon. “Avedon said that he’d be happy to provide additional funds for the PAMA exhibition if the city will waive his right to sue the city. He also said that he will give the organization his own images of the works’ facsimiles, to which he will make them available for the public to see for free.\n\n\nThe Rema Hort Mann Foundation in Los Angeles has received a gift of twenty-five works by the late California artist Rema Hort Mann, including a painting by her husband and collaborator, Robert Mann", "The next Biennial should be held at the Institute of Contemporary Art (ICA), Madrid, in January 2021, with the aim of creating a new platform for dialogue with local and international artists.\n\n\nThe Greater London Council (GLC), an independent body that represents more than 3,300 boroughs in England and Wales and employs around 2,500 people, announced on Monday that it is launching an ambitious new initiative that will give local authorities the power to set their own transport and energy policies.Under the plan, local authorities will be able to set energy and energy efficiency targets, which will then be reflected in local government budgets. A council-led campaign to promote green living through art and design will then be used to argue for additional funding for green infrastructure.“We are launching a new independent body to oversee the delivery of energy and energy efficiency,” said Madeleine Mullins, director of the GLC. “We will continue to work with our local authorities to reach the goals they set for themselves and to support their campaigns to cut emissions and keep the lights on and the air green. We will work with them to set targets that deliver good value for money and deliver the social good they say they are all about.”According to the London", "The next Biennial should be ready by the end of the year. The museum has already received $46 million from the American Federation of Arts, which is seeking $51 million for the third edition of the event, and expects to raise another $30 million for the event. The show will also include a discussion of the biennial and its legacy with art historian and curator Tia Ghossein; a description of the exhibition; a performance by the artist and musician Tilda Swinton at the exhibition; and a concert by composer Andrew Ridgeley, who died earlier this month. The Biennale of London is also seeking $50 million for the 2020 edition, which will be held at the Royal Festival Hall in London from December 5 to December 10. The 2019 edition covered the first half of the twentieth century and featured work by seventy artists, including Delaware Davis, Joachim D. Vogel, Anish Kapoor, and John Akomfrah.The artist-run festival has already faced major backlash from those who believe that its 2020 iteration will not include any art that is “relevant” to contemporary life. Switzerland’s Federal Association of Fine Art (BAF) said it “does not see any", "The next Biennial should take place in 2021. The next edition is being organized by the DePaul University Museum of Art in Chicago. The biennial will be one of only two worlds-wide, and will premiere at the Art Institute of Chicago.“The current exhibition is a reflection of the respective traditions of art and design and the present exhibition comprises both architecture and design elements that have never been assembled before,” said Buck. “The exhibition will engage with current and future trends and design in both a philosophical and an anthropological sense, and will be divided into multiple narratives that will unfold in different ways. It will explore the relationship between art and design and other forms of art and design, architecture and architecture, architecture and design, and architecture and architecture.”The exhibition’s first chapter, “Building Art and Design,” will feature images of works by artists such as Honoree Janet and John Havelock, Surrealism and Design, and William Kentridge and John Paulko, as well as historical examples such as the Impressionist Guggenheim, the modernist Kapp and Guggenheim, and the contemporary Stéphane Ghebaly’s \"The Silence Is for Real", "The next Biennial should be held in 2022. The reopening of the Academy Museum in London in 2021 was celebrated as a watershed event, and the exhibition “Made in Space” was awarded the Royal Institute of British Architects’ Literary Award. The 2018 edition of the Biennial, which focused on contemporary art, was held at Tate Britain, which is currently undergoing a £500 million expansion and renovation. The new location will be inaugurated by a biennial of work by the Czech artist Antonin Radin, who will stage an exhibition within the exhibition. The event will also feature a “70s retrospective of the Italian surrealist, Maurizio Cattelan. Cattelan’s work is currently on view through January 9.\n\n\nThe National Galleries of Scotland plans to close its doors indefinitely in April 2019 in protest of the government’s decision to leave the United Kingdom. The announcement follows a series of actions across the United Kingdom by artists, including Pankaj Mishra and Red Sun, whose works were featured in the 2018 exhibition “London: A Biennial of Art” at the National Gallery in London, which was canceled owing to the Brexit vote. The exhibition, titled", "The next Biennial should be held in 2021. The 2020 edition, entitled Starlight, was held in conjunction with the New York City Film Festival, which ran from April 16 to April 20. The 2021 edition will take place at the Center for Creations of Life, the private art museum in Brooklyn.“I am excited to work with the team at the Biennial to create a new series of exhibitions that will bring the rich art and design of the city and region to life across the region,” said Mayor Bill de Blasio. As part of the partnership, the city will provide the center with 1,500 square feet of gallery space, as well as a rooftop terrace in the Museum of Modern Art. The Biennial’s early 2019 edition, titled The Age of Databases, was also held on the rooftop of the Museum of Modern Art. The museum paid for the installation with a $200,000 grant in support of the city’s capital campaigns for arts and culture.\n\n\nThe Frick Collection, a contemporary art museum in New York City and the George Eastman Museum, in Los Angeles, are teaming up to create a new digital platform that will offer audiences a better way to see the", "The next Biennial should focus on the life and work of Salvador Dalí, “a highly influential artist whose work will be featured in the twenty-fifth edition.” The 2022 edition of the exhibition is currently underway.\n\n\nThe Metropolitan Museum of Art (the museum) in New York is launching a new initiative to encourage greater community engagement with art. Called “Art for the Met,” the program will partner with local community members to create a unique visual art experience for three of the museum’s locations—the Midtown Museum of Art, and the Museum of Modern Art. Launched by the professional organization Art and Culture, the program will host more than 150 artists and will include digital content, including a retrospective of artist Karl Lagerfeldt, a virtual concert series at the museum, and an online series.“With the launch of Art for the Met, we are creating a new platform for engaging with art and culture,” said Marc Glimcher, the museum’s director. “Alongside our dedicated curators and staff, we will continue to develop innovative, accessible, and thoughtful new exhibitions that draw from a wide range of styles in order to meet the needs of an ever-changing audience.", "The next Biennial should be held in the spring of 2021, with the exhibition marking the new indigenous art movement. “The Biennial is the greatest historical exhibition of our time,” said Khaled al-Asaad, the director of the National Museum of Islamic Art in Cairo and a former president of the Doha-based Association of Islamic Art. “Its exhibitionists, jurists, collectors, and visitors represent a multitude of cultures, traditions, languages, languages and languages,” he added.The National Geographic Society will take over management of the event, which will be held in the same location where the Smithsonian Institution’s twenty-second Biennial will be held. The new format will be similar to the first, with a limited number of galleries and locations from the same city, with a new venue and a new collection. The inaugural exhibition will also feature the work of twenty artists, including Hisham Abdurraqib, Shimon Benoit Habib, Mokhtar Jamil, and Hamza Ali, and will be on view through October 26. The new project, titled “The Last of Us,” will focus on the themes of ‘in the midst of chaos,’ ‘", "The next Biennial should be set in 2020 and will be staged in the city’s various historic districts, as well as in the surrounding area, between the Central Library and the Institute of Fine Arts and the Municipal Archive. The 2020 theme is “Thematic, Transformative and Empirical: Art and the Politics of Life” and will encompass a history of artworks comprising a timeline of their conceptualization, from the first exhibition in 1960 to the current exhibition.The biennial is being organized by the Institute of Modern Art in Paris and the Centre Georges Pompidou in Saint Petersburg, Russia, and will include five exhibitions: “The Decca Museum in the City of Light” (March 7–March 12), “The Tyrone DiMarco Collection” (March 13–March 15), “The Ermans, Kommunikation, Casimir Duk, and the Cube” (March 16–March 18), and “Massimo Huzzo” (March 19–March 21).  The full list of participating artists is as follows:Scott-Clark Johnson-BalanceSchooling until 1972, Continuing Art until 1974, The Rencontre Foundation, Lisbon, PortugalSince 1972", "The next Biennial should be held in 2021. \n\nThe twenty-second edition of the Venice Biennale, curated by Antony Hudspeth, was postponed due to the Covid-19 pandemic. It will now be held in 2022.The Venice Architecture Biennale, curated by Barbara Prodger, will now be held in 2021. The twenty-first edition will take place in 2021. \n\nOn July 11, the University of Oxford’s new head of architecture, Simon Hammond, announced that he plans to leave the institution in September and return to his home in London. For the past few months, Hammond has been leading the redesign and renovation of the school’s new home, which is currently being built in a former wine warehouse in the city, and has been credited with developing the school’s new campus. The school will be inaugurated in September.Hammond said: “We have been working towards a new and more inclusive architecture at Oxford for some years. We have made significant progress in the past four years, but we will not be able to complete the project until the UK has fully recovered from the impact of Covid-19. As a result, we are working with a team to", "The next Biennial should be announced soon.\n\n\nThe Museum of Modern Art (MoMA) has reiterated its commitment to artists who have won the Pulitzer Prize for their contributions to art in its last four years, announcing that it is extending the term of the award from four years to six years. The announcement follows the announcement of the awardees for the first time, the Los Angeles–based artist Cedric Lacey and the New York–based artist Szilvia Akunyili, who were selected for their works in February 2018.“We are thrilled to announce that the next Biennial will include artist awardees, which will start in 2022, and that Cedric Lacey and Szilvia Akunyili will be represented in the inaugural exhibition,” said Patricia Leahy, director and CEO of the Loews Center for the Arts and the Pulitzer Prizes. “Cedric is a fearless and engaging artist, whose work speaks to the power and beauty of creativity in all its various forms, and Szilvia shows us how to use the medium to push ourselves and into the unknown, to rethink our lives and the world around us.”Previously, the museum has been tackling the transition of its building into the former Bergen", "The next Biennial should take place in 2020, and there is still time to get your ticket and to take part in the next edition.”\n\n\nThe Berlin-based nonprofit NADA has released the list of 130 artists who will participate in its next edition, “Berlin: Preview 2019,” which will run from April 7 to April 10, 2020. The seventy-ninth edition of the Berlin Biennale, curated by a group consisting of NADA Berlin; NADA Artists and Triennials Berlin; and NADA Frieze Berlin, was set to open in March.As the organizers of the event, NADA Berlin, said: “We are thrilled to present the Berlin Art Biennale 2019. It represents the finest of the contemporary German visual arts and will provide an excellent platform to debate the future of art in the country.”NADA Berlin, which is currently undergoing a transformation, said: “Our museum is moving forward with a new exhibition format, a new exhibition program, a new collection, and an expanded program. While we have made a number of collaborations with local artists throughout the year, we are expanding our program to include new projects. We have a lot of work to do in the coming months", "The next Biennial should be held in 2021.\n\n\nThe Fine Art Museum of China (FAIC) has received a major gift from the Beijing-based foundation Shanghai Art Museum (SAM). Founded in 1931 by the Chinese billionaire Li Peng, the institution has transformed itself through the acquisition and renovation of nearly three thousand works over the past seventy years. Its current collection comprises more than fifty works by thirty-six artists whose work is considered essential reading today.The gift is two bronze sculptures by the late artist Huang Yilu, a member of the famous Eight-Tenth Group, which reshaped Chinese painting and sculpture in the 1950s, and a retrospective of the work of the late artist Li Xianqing, who experimented with light and photography in a manner that challenged the conventions of contemporary art.For the contemporary art museum, the gift represents an opportunity to further extend its collection by collecting work from artists whose practices continue to influence its work in the ways that define their respective eras. The exhibition “The Modernization of Chinese Painting” will open at the museum on September 25 and runs through March 28, 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has released the list of thirty-five artists who will participate", "The next Biennial should focus on “Theoretical Politics”—a term coined by Michel Foucault to describe a set of ideas that ultimately emerge out of the anthropological, not the theologically, historical-critical perspective. “Some have said that the question of the synthetic and the synthetic politics is a political question of politics as such,” the exhibition’s director, Jessica Lynne, told Artnet. “I say that it’s a question of politics as such.”The exhibition will include works by forty-six artists, including Jocelyn Delacroix, Benoïl Breton, Amie Abraham, Olu Olu, Alice A. Fisk, and Thomas Kienholz, as well as works by contemporary artists including Christo, Denis Menelick, and John McCaffrey. The ten-day event will also include a lecture tour of the exhibition, which is curated by Damien Hirst, and will be held at the Grand Canal in central London in 2021.\n\n\nThe Metropolitan Museum of Art in New York has appointed Amanda Alexander as its next director. Alexander comes to the Met from the Metropolitan Museum of Art in New York, where she has served", "The next Biennial should mark a moment of renewal and renewal in the lives of the artists whose work was featured in the first edition, as well as a reckoning with the legacy of the first exhibition. The first Biennial was organized by the Waksal Foundation, a New York–based nonprofit that offers support to artists whose work is currently under copyright, and was held at the Waksal Art Museum in Kassel from 1997 to 2003. The Waksal Biennial is being organized as part of a broader campaign to introduce more transparency and accessibility to the biennial’s legacy works, which many see as an attempt by the German government to avoid paying royalties to certain artists. Among the works that have been moved to the collection of the Ministry of Culture are Rügenpresse’s “Tacita Dean” (1962–1963), which has never been published, and “Ikon Polona” (1929), a painting from the proto-Dada movement. Both paintings were on display in the opening exhibition of the Waksal Biennial, “The Visitors,” which premiered at the Waksal in 2010, and will be included in the biennial�", "The next Biennial should be on April 29-May 29, 2020. The goal is to create a platform for artists to collaborate, to have a voice in shaping the future of the exhibition, and to be inspired by the work of a select few.\"Over the course of the next two years, the Biennial will present new works by celebrated international artists, such as David Adjay (December 12–December 19), José Paulo Classen (March 7–March 9, 2020), and Erina Fotopoulo (March 26–March 31, 2020).A full list of participating artists is below:Credit: Art ArchivesAvalon Architecture and DesignCairo Art Museum and Art Museum (CAFAM)Copenhagen Gallery for Contemporary ArtCopenhagen Contemporary Art Museum (CAFAM)Copenhagen Contemporary Art Museum (CAFAM) (C) Athens Art MuseumAvalon Contemporary Art Museum and Art Museum (CAFAM) (C) Benelux Contemporary Art MuseumSTART Contemporary Art Museum (CAFAM)Copenhagen Contemporary Art MuseumSTART CPHH Gallery (C)Copenhagen Contemporary Art MuseumSTART Contemporary Art MuseumSTART Contemporary Art MuseumSTART Contemporary Art MuseumST", "The next Biennial should take place at a location currently occupied by the University of California, Berkeley, in April 2020. The event will be hosted by a group of architects and will bring together curators from across the globe to develop new works on topics such as urbanism, the natural world, architecture, and information.A statement released by the festival said: “The future of our planet and our species hangs in the balance. The Biennial’s revitalized campus is dedicated to a future in which architects, policymakers, artists, and scientists collaborate and aim to shape the future. At a pivotal moment in the history of humanity’s evolution, it is up to architects and planners to shape this future.”\n\n\nThe Museum of Modern Art (MoMA), New York, announced today that it is launching a new initiative that will help artists struggling to make ends meet amid the coronavirus pandemic. Subsidized by the Peter and Minetta Nadler Foundation, the program will provide financial assistance to thousands of artists whose livelihoods are at risk as a result of Covid-19.“This is an emergency crisis, and as we face it, we can’t help but think about the thousands of artists and creat", "The next Biennial should focus on the history of contemporary Mexican art’s relationship with the United States. It should also consider the state of Mexican art right now and in the context of the current global crisis.”The theme of the 2020 edition is “Art and Citizenship.” The event will be inaugurated by a virtual exhibition on the history of the Mexican flag, which has been digitally remastered in accordance with the wishes of the artists who designed it. The exhibition will feature new works by forty-four artists and will run until August 21, 2020.\n\n\nArtist-run space TerraForm was awarded a $10,000 MacArthur Foundation grant last month as part of a major expansion of the nonprofit’s work in support of climate justice. The grant also supports innovative new ways to support artists working in the conservation and restoration of cultural heritage sites around the world.“TeraForm will be a transformative platform for artists working against the threats and injustices of climate change and in the fight against climate terrorism,” said Rosemarie Trockel, director of the MacArthur Foundation. “By connecting our networks of collaborators, we hope to provide artists the tools to amplify their voices and to take direct action to protect our communities.", "The next Biennial should be held in 2021, and last weekend the theme was “The Future Is Present.” The first version of the panel\u0097which was organized by James Murdoch\u0097was held in March 2019 and featured twelve artists: Erik De Castro, Rachel Harrison, Kate McLean, Malin Vossen, Nadine Donham, Catherine Jennot, Terry Southern, Hank Willis Rist, Tanya von Duurberg, and Mary Mattingly. The second biennial, “The Future Is Present: A Historical Biennial,” was held in March 2020 and featured fourteen artists: Akihiko Miyazawa, Alejandra Pape, Tanya von Duurberg, Matisse, Richard III, and Rene Magritte.The future biennial, which will be staged at the Guggenheim Museum and curated by Barbara Ferris, will feature new work by the artists selected for the 2020 biennial and their successors. The twenty-one-year-old curators hope to present a new “Selected Biennials 2020” in the fall of 2021.The 2020 biennial was curated by renowned South African artist and curator Janette Laverrière,", "The next Biennial should be held at the Tohoku Museum of Art, Tokyo, in 2020. The project was established to commemorate the 70th anniversary of the transfer of the Fuji-Nippon Television Broadcasting Corporation (NTV) to J.C. Staff Film Studio in 1987. The biennial will focus on the evolving concept of a documentary film. Its final instalment will be a retrospective of Hiromasa Yonezawa’s work Ainu Otoko (科林のオン) in 2021.\n\n\nThe Stedelijk Museum, the University of Amsterdam, and the Haus der Kunst, the London museum, are among the institutions that were charged with overseeing the dismantling of a large-scale works of art that were on display during the opening of a new exhibition of work by the Dutch avant-garde in Hamburg last month. Martin Schlechtriem, curator of the exhibition “Avant-Garde in the Age of Hitler” (2017–18), told the Art Newspaper that the dismantling process began on January 17, when the institution dismantled a fifty-year-old installation called SICAM. SICAM, a 1980 exhibition of Philip", "The next Biennial should begin as soon as possible. The dates for the exhibition are as follows:September 19, 201X National MuseumNovember 6, 201 GalleryNovember 14, 201 XNational GalleryJanuary 27, 201Museum of Contemporary Art, New YorkFebruary 29, 201Museum of Modern Art, New YorkMarch 6, 201Museum of Contemporary Art, New YorkMarch 7, 201Museum of Contemporary Art, New YorkMarch 10, 201Museum of Contemporary Art, New YorkMarch 13, 201Museum of Contemporary Art, New YorkMarch 14, 201Museum of Contemporary Art, New YorkMarch 15, 201Museum of Contemporary Art, New YorkMarch 16, 201Museum of Contemporary Art, New YorkMarch 16, 201Museum of Contemporary Art, New YorkMarch 18, 201Museum of Contemporary Art, New YorkMarch 16, 201Museum of Contemporary Art, New YorkMarch 16, 201Museum of Contemporary Art, New YorkMarch 16, 201Museum of Contemporary Art, New YorkMarch 19, 201Museum of Contemporary Art, New YorkMarch 20, 201Museum of Contemporary Art, New YorkMarch 22, 201Museum of Contemporary Art, New YorkApril 6, 201Museum of Contemporary Art, New", "The next Biennial should be held at the museum in 2021. \n\nImagination is the new reality in art: how the visual realm can have a transformative effect on our lives and on the world around us. The next edition of the Pacific Standard Time is devoted to the history of this technology: how it has changed our lives and our world, and how the art of breaking it and reassembling it can inspire us to imagine new worlds.In the 1970s, the Danish artist Gudbrand Stærkjær was inspired by the experimental works of Marcel Proust. Stærkjær conceived of the exhibition in a 1972 issue of Artforum for a photorealism of the artist’s photomontage paintings, which were made on a large scale in his studio, and decided that the project would be a true “imagination.” He created six works and arranged them in an “imagination matrix.” The exhibition opened at the Museum of Modern Art in New York in 1975 and features works by ninety artists. In addition to the works, the museum has hosted three other exhibitions dedicated to the artist: “Maira Zaatari: The Dreamer,” “L", "The next Biennial should take up the questions of how a paradise of art, design, and technology could become the new Belarus, and whether we need to rethink the future of our cities and professions.”The eleventh Biennial will explore the ways in which art and technology might interact in the twenty-first century. Its theme will be “Artificial Intelligence and the Future of Work.” The theme of the twenty-third Biennial will be “In Defense of Culture.” The theme of the twenty-fifth Biennial will be “Art and Technology Unmade.”The theme of the twenty-sixth Biennial will be “Art and the Future of Work.” The theme of the twenty-seventh Biennial will be “Artificial Intelligence and the Future of Work.” The theme of the twenty-eighth Biennial will be “Artificial Intelligence and the Future of Work.” The theme of the twenty-ninth Biennial will be “Artificial Intelligence and the Future of Work.” The theme of the twenty-ninth Biennial will be “Artificial Intelligence and the Future of Work.” The theme of the", "The next Biennial should be held on the theme 'Future Present: Art, Politics, and Society in the Age of Mechanical Reproduction.” The 2019 edition of the Biennial, titled “Mass Communication” will be held at the Museum of Modern Art in New York on May 25–26.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed John Michael Kober, a curator and art historian who has served as director of the Metropolitan Museum of Art in New York City since 2014, as its next head of the Metropolitan Museum of Art. Kober takes the helm from Peter von Ruiz, who has helmed the institution for twenty-five years, and will begin in his new position in January 2020.“John has been a powerful and indispensable member of the Met, leading us through a transformational decade as we launched our Digital Program and launched our new initiative, the Push, in 2021,” said General Manager Daniel H. Weiss. “We look forward to his leadership as we continue to advance the museum’s mission and to his continued innovative and talented work as a curator and educator.”Kober, who has curated several exhibitions, including “The Peril of Design:", "The next Biennial should take place in Helsinki, Finland, on February 21–March 13, 2020. The show will also feature work by artists from the Asia-Pacific region, including former winners of the prestigious Asia-Pacific Art Chase, including Parbac, Jin Si, Kiyomasa, and Tanya and Ryndlina Sklar. The 2020 exhibition will take place at the Helsinki Art Museum, and will be led by curator Hanka Hantaari. The show will also feature work by artists from Finland, Norway, Russia, and Portugal. The first phase of the exhibition will open on March 9 and run through March 10. The second phase will be on March 13–March 20. The third phase will take place in December 2020, and the fourth phase will be in December 2021. The twenty-third edition of the biennial will be held in December 2022. 'The question of this exhibition was not what will occur next, but what will not happen. We must remember that this is the year 2020 and that the next exhibition will be ‘The Future is Present.’” The exhibition’s curator, Hannu Nieminen, said: “", "The next Biennial should take place at the Institut d’Art Contemporain (Belgian Museum of Fine Arts, Brussels), which has launched an online viewing room in collaboration with the artist and is planning to host a special exhibition dedicated to the work of the biennial’s inaugural participants in March 2020.\n\n\nThe Korean artist Park Seo-kyung, whose saturated black-and-white paintings capture images of everything from urban life to the stars, has been selected as the winner of the second edition of the Baftang Biennial, presented by the Museum of Fine Arts, Seoul. Park will receive a prize of approximately $65,000. The prize is one of several awarded to Korean artists in the biennial, which will run from March 10 to March 13, 2020. Park, who is known for capturing images of the cities in his paintings, first won the prize for his paintings in 2006 and has since been nominated for the award. In 2008, he won the prestigious Roger Mitte Award, which honors the performance of a filmmaker in the film industry. In 2011, he was nominated for the Venice Film Festival. Park also won the Prix de l'Art et l'Orient, the Prix de l'", "The next Biennial should focus on programs developed to address the significant health threats that climate change poses to our ecosystem, with a particular focus on developing and implementing solutions that address the challenges of climate change in rural settings.  It should also examine the potential of the androgynaecological framework to address climate change and its impact on men, women, and indigenous peoples.”Despite the recognition of the risk posed by climate change, most countries are not taking any meaningful action to address the crisis. In an attempt to slow the global rise in temperatures, governments are preparing to slash the greenhouse gas emissions that cause global warming and are calling for international negotiations to be held in order to reach a global deal to limit global warming. However, because of the political instability in many countries, as many as seventy members of the Group of Seven (G7) industrialized nations have now withdrawn from the landmark climate accord. According to the Washington Post, the United States is planning to leave the deal and will likely follow suit. The G7 nations will meet in Warsaw in December and are expected to announce their intentions to leave the deal in March. The United Kingdom, Canada, France, Germany, Italy, and Japan will all likely remain in the agreement, although their", "The next Biennial should be held in 2021. The organizers have confirmed to the Art Newspaper that the 2019 event, entitled “Feelings on Motion,” comprised ∼15 minutes of the artist’s “cybernique”\u0097a term he coined in an interview with the magazine in 2017\u0097and will be held in the city of Lyon. The full list of participating artists is as follows: -Amandeep Mani (United States) -Arashio Otsuka (Japan) -Benedict Garten (United States) -Benedict Garten (Germany) -Benedict Garten (Germany) -Benedict Garten (Germany) -Benedict Garten (Germany) -Benedict Garten (Germany) -Benedict Garten (Germany) -Benedict Garten (Germany) -Benedict Garten (Germany) -Benedict Garten (Germany) -Benedict Garten (Germany) -Benedict Garten (Germany) -Benedict Garten (Germany) -Benedict Garten (Germany) -Benedict Garten (Germany) -Benedict Garten (Germany) -Bened", "The next Biennial should aim to: “encounter the internal contradictions of our society,” a spokesperson for the exhibition told the New York Times. “Reflecting on how art can be both a tool for the advancement of knowledge and a vehicle for liberation, we will create the exhibition ‘Between the Arts: Contemporary Art in the Age of Mass Surveillance.”The exhibition is currently on view at the Biennial, which is housed at the Museum of Modern Art, in New York.  Commenting on the future of the exhibition, Elyse and Auguste Couture said: “We are extremely proud and honored to be a part of the Biennial. The exhibition will continue to evolve in the years ahead with the exhibition ‘Beyond Surveillance: Surveillance and the Politics of Everyday Life” and the upcoming biennial “Frontal Cosmopolitan: Art and the Mass Spectacle” at the New Museum in New York. \n\n\nThe European Space Art Foundation (ESAF) has announced that it will launch a new prize for new and emerging work in the field of art and art history in September. The inaugural prize, which has been described as “transformative” by Artforum editor-", "The next Biennial should extend its programming to include a public symposium and exhibition, as well as a program for the public that will take place at the park, which is adjacent to the Museum of Fine Arts. The exhibition will also include a selection of works by female artists from the world of South Asian art. The twenty-ninth edition of the Boston Biennial, curated by Loring Randolph, will take place at the Boston Garden, which opened in 2017 and is currently undergoing a $114 million overhaul. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Evan Greeff as its next director and CEO. Greeff succeeds David H. Koch, who has led the museum since 2011, and will begin his tenure in January 2020. Prior to joining the MFA in 2018, Greeff served as the director of the Museum of Fine Arts (MFA) in New York, where he worked for three years under Koch’s tenure.“Evan is a visionary leader who has been instrumental in transforming the MFA in Boston over the past decade, creating new opportunities for the museum under his leadership, and laying the foundation for how we approach art and culture in the city,” said director Matthew Teitel", "The next Biennial should take place in the city, and on the anniversary of the fall of the Berlin Wall in 1989, the five artists who will represent the United States in the exhibition will be awarded $10,000 by the President. The other three featured in the exhibition are David Salle, Daniel Selinker, and Joshua Tenenbaum.\n\n\nThe Turkish artist, writer, and educator Zafer Cetin has been named the 2020 recipient of the prestigious Erasmus Prize, which honors individuals who have made outstanding contributions to their countries. The Erasmus Prize is one of the highest awards in Europe and has been given by the Erasmus Foundation to honor individuals in thirty-six countries since it was founded in 1986. Notable among his awardees are Anatole Shagal, Selin Güler, and Güneya Yilmaz. The paper was presented by the Erasmus Foundation at its annual awards ceremony in Amsterdam on January 22. \n\n\nThe Museum of Modern Art (MoMA) in New York has awarded its twenty-sixth annual grant of $2 million to the artist and activist Nima Agha, the founder of the Movement for Intifada (MUI), which seeks to create an", "The next Biennial should be held in 2021. The exhibition, titled Feminine’s Flight, will be hosted by Bjarnad Pedersen at the Australian National University in Canberra, which is about to host the Feminine’s Flight 2030, will be curated by Tanya and Sondre Hauptman in collaboration with Ming-chi Wu at the Kunsthalle Basel.The Exhibition of Women Artists will continue to be held in Shanghai through 2021.\n\n\nThe Yerba Buena Center for the Arts (YBCA) in San Francisco is suing labor-management giant United Parcel Service (UPS), which has been fighting to reduce the size of its California warehouse in an attempt to reduce the organization’s payroll, for more than $8 billion in lost revenue. The lawsuit, filed on Thursday in San Francisco Superior Court, alleges that the company withheld pay and other benefits for more than two hundred employees, who were laid off or furloughed in March, and accuses UPS of violating California’s Fair Labor Standards Act (FLSA) by failing to remit payments, making misleading statements about its impact on the employees’ wages, and failing to recognize the effects", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has been awarded a $10 million contract from the federal Department of Transportation (DOT) to rehabilitate the iconic Wilshire Boulevard building that houses the Los Angeles County Museum of Art (LACMA).The contract, awarded to the Los Angeles–based architectural firm Wright+Willis, was awarded to LACMA in response to a $6.5 million request from the city of Los Angeles for assistance in restoring   the Wilshire Boulevard building.“This is a monumental task that will require the restoration of the building’s original design and a reimagined Wilshire Boulevard,” said city councilman Mitch Englander, chair of the council’s public works committee. “We are grateful to Wright+Willis for carrying out this important project and its partnership with the city of Los Angeles, which will benefit the entire community.”Currently, the structure, which is undergoing a $2.6 billion overhaul, houses the museum’s collection of more than four hundred thousands artifacts; the art school of the same name; and the Los Angeles County Museum of Art (LACMA), which was founded", "The next Biennial should be held at least once every three years, but no longer than fifteen years. “Two Biennials are not sufficient,” said Paul Mpagi Sepuya, the president of the National Union of Journalists. The 2022 event will be the last, and will be relocated to the National Museum of Kenya. The institution has appointed Ella Thompson as its interim director. She will be responsible for overseeing the rest of the thirteen-year-old biennial. Artforum has reached out to James Hutton and will update this post with his comment.\n\n\nThe MFA Denver announced today that it has commissioned artist and educator Christopher Wool as the city’s next director of arts and culture. Wool will lead MFA Denver through its next iteration, “2040: The Year We Make Things,” which will take up a theme that has become apolitical following the coronavirus pandemic. “I’m excited to start a new chapter with MFA Denver,” Wool said. “I’m committed to doing all I can to make sure that the MFA Denver makes a difference in the lives and well-being of the people of Denver. I�", "The next Biennial should be held in 2020, and the first in 2021.\n\nThe Los Angeles–based nonprofit LA Biennial has announced that it is looking for a new president and CEO as executive director. The position is currently held by Jack St. Croix, who will step down following the 2020 season, and has been vacant since April. “LA Biennial is committed to working with the community in order to present a show of California’s rich and extraordinary landscapes, and is pleased to appoint Jack as its next president,” said LA Biennial in a statement. “Jack is a scholar, entrepreneur, and visionary—a man who understands that the art of the West remains at the core of the fabric of American life. He will play an integral role in expanding our vision of LA Biennial and the city’s artistic and cultural legacy.” Jack’s current role includes serving as the board president and CEO of Artadia Corporation, a Los Angeles–based nonprofit that provides financial and other support to artists. Through the organization, Jack has organized over $58 million for artists, including the work of Susanne Bienstock, Allen Ginsberg, and Michael Stipe, and has initiated more than", "The next Biennial should be in 2020. The biennial will consist of ten exhibitions of work by exceptional artists, an exhibition of works by a selected group of contemporary artists, and a performance.”The biennial will be hosted by the Seoul National Museum of Art, Cheonggyecheon, and the Gwangju National Museum of Art, and will be curated by Kim Seo-kyung, the director of the Art Museum Seoul. The exhibition schedule for the biennial will be announced at a later date.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning not to move forward with plans to open a new outpost in Japan, citing concerns over the pandemic. The institution announced on Thursday that it is postponing the opening of its new home in the downtown building, which is slated to open in 2021, and will instead focus on returning to the United States. Staff have been let go, but the museum plans on keeping a presence in the city.An exhibition of works by Yoshito Nogi, a legendary director responsible for the design of the Grand Canyon, is slated to open at the new space, called the Art Institute of Chicago, this fall. The announcement follows a wave of resignations across the cultural", "The next Biennial should be held in Berkeley in 2021. \n\n\nThe University of Oxford has appointed Adrian Wootton as its new principal. He succeeds Chris Pack for the position, who has since departed to become chairman of the University of Aberdeen, and will take up his new post on February 14.Wootton joins Oxford from the University of the Arts, where he has held the position of director of contemporary art since 2017. He is also the director of the rarified gardens at the university and the director of the London garden.Commenting on his new role, Wootton said: “I’m incredibly excited by the appointment to this role, which, in addition to offering new opportunities for visiting artists to engage with the university, will also support the development of the Centre for Contemporary Art in Oxford. I’m determined to use the unique skills and knowledge I have gained in the past to deliver a strong and inspiring new exhibition program and tour. The new role brings with it a new set of challenges and opportunities. I’m looking forward to working with all of you and to seeing you soon at the Centre for Contemporary Art in Oxford.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles plans", "The next Biennial should aim to obtain the consent of all the affected states and territories, and the United Kingdom, in order to proceed with the opening of its exhibition in the United States in 2021.\n\nThe exhibition, titled “State of Matter,” will showcase the work of more than seventy artists across twenty-four states, including California; Finland; Germany; and Japan. The biennial is being organized by the California-based nonprofit ARTPAC and will be held at the Los Angeles County Museum of Art (LACMA), the New Museum in New York, the Museum of Contemporary Art Los Angeles, the Museum of Contemporary Art San Diego, and the San Francisco Museum of Art. According to Artnet, the biennial will also feature a new selection of contemporary artworks by the Polish artist Witold Piotrovski.Additionally, the biennial will feature photography works by American artist Mark Di Stefano. It will also include a film by artist Lars Von Trier.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Paul Mpagi Sepuya and Yoko Taro as assistant curators for “State of Matter,” a new exhibition that will debut at the museum next month. The", "The next Biennial should be held in 2020, and the first in 2021. Renewed interest in the exhibition format has been fueled by the success of the museum’s second iteration in June 2019. The museum opened to the public in June of that year, and its first exhibition, “An Open Book,” was held in mid-July that same year.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has received a gift of more than three hundred artifacts from the University of Central Florida (UFO), for a collection that includes two hundred paintings, sculptures, prints, and drawings by Simone Leigh, Allen Ginsberg, Robert Mapplethorpe, and Mark Rylance. The donation includes works which were loaned to the museum by the artist after she committed suicide in 1987. The work was acquired by the institution through its twenty-third annual auction of works, held at the museum last August.“The board of trustees and I were thrilled when the artist’s widow, Beverly Leigh, and her daughter, Mandy, expressed their deep appreciation for the extraordinary gift of the work of Simone Leigh,” said board president James Cuno. The board and I were also thrilled to", "The next Biennial should be held sometime between June and September 2021. The future of the Biennial is currently in the hands of the City of Manchester. If the 2019 edition of the event is any indication, the answer is very much the same: the building of a new Biennial.\n\n\nThe Museum of Amsterdam (MAK) has appointed Marie Woon, who has helmed the museum for the past seventeen years, as its next executive director. Woon succeeds Johanna-Kristine Woerner who has helmed the museum since 2009 and will take up the post on June 3.“We are thrilled to welcome Marie to MAK,” said Markus Schäfer, director of the museum. “Her proven track record of success, which includes two consecutive years as winner of the Grand Prix de l'Amiti-Napoli and another as a runner-up for the European Grand Prix, makes her the ideal leader to ensure the museum’s future success. We could not be more pleased that she will succeed Anna-Marie and take the museum forward in a positive way.”Woon previously served as the chief of the museum’s European Community department and as the head of the European Regional Centre", "The next Biennial should consist of a selection of works selected from the collection. The exhibition will feature Joan Miró’s Apollo 13’s first exhibition since the pandemic began, “The Sinking of the Apollo 13.”The exhibition will also include selections from the collection that were previously on display in the museum’s exhibition “The Making of Modern Life” (2015) and “The Power of Paintings: The Art of Francis Pérez’s School.”The museum recently received a $50 million gift from the estate of the late immigrant founder of the late oil magnate Maurice Greenberg, the widow of the late American oil executive James D. Greenberg. The estate also established a new, independently organized museum dedicated to the artist.The museum has also announced that it is planning to open a new James Alan Fox Center for the Arts, which will house the exhibition “Family Feud: Family Movies” (2018), and that it is also restoring the artworks of the former site of the Houston Livestock Show, which was relocated to a new exhibition space in the city’s city limits. The center will feature some seventy works by twenty-six artists, including", "The next Biennial should be held in April 2021.  Since the museum has been closed since March 26 due to the Covid-19 virus, the exhibition has been moved to the Columbia Center for Art at Columbia University.\n\n\nThe Minneapolis Parks and Recreation Board voted to suspend the work of sculptor Charles Irwin until it determines whether the director of the Museum of Fine Arts (MFA) is a racist.Cecelina Maslansky, the MFA’s director and CEO, told the Minneapolis Star-Tribune that the board recognized Charles Aspinall as a scholar and artist who demonstrated a deep commitment to public safety. However, the board voted to suspend his work after it claimed the artist’s comments about the Black Lives Matter movement, recent police killings, and the Black Lives Matter movement in general caused the board to reconsider its decision to remove the work.“I want to emphasize that these statements were made on behalf of the MFA and not by Charles Aspinall,” board chair Linda Yandle told the paper. “We took his comments seriously and we considered them carefully. We are very much aware that there are elements in his work that are deeply offensive to many people. We said that", "The next Biennial should be held at the site of the former UCCO complex in the city of Belo Horizonte, the capital of the Brazilian states of Minas Gerais and Pernambuco. The project will include the installation of sci-fi artworks by the artists whose works are currently on display in the exhibition, including Alberto Campos, José Roca, and Ravi Rajan. The exhibition will also include the exhibition of works by contemporary Brazilian artists.The new biennial will be inspired by the historical works of José Pires, who lived from 1750s to 1775s. Pires’s Tableaux, Cioves, and Amigos (1750s–1775s) are important works and represent a huge departure from the more traditional form or the modernistic style of Mílio Pontes’s works. The upcoming edition will also bear his signature, “Una Bene” (1750), a monumental, eight-thousand-piece, stone-encrusted, ground-glass sculpture made in a single day in August. The new exhibition will begin on March 25 with “Una Bem,” a significant exhibition of", "The next Biennial should take place in 2022. The first, in 2019, was held in Bristol. \n\nThe Visual Arts Foundation (VAF) in New York has received a gift of seventy-four works by thirty-five artists, including Iris Allport, Madeleine and Robert Mapplethorpe, and David H. Koch, which were originally on display in its first-ever biennial. The donation was made in support of the organization’s “toward a new and more informed appreciation of the visual arts.”The exhibition, which was curated by Iván Rodriguez-Santiago, was organized as part of the foundation’s One Play Campaign, a series of exhibitions and talks that launched its first event in 2014. In 2015, the biennial, which focused on the importance and aesthetics of play, was nominated for a Pulitzer.In the 2017 exhibition “HELMUT GALLERY: AUSTERICA” (which was organized by the Museum of Modern Art in New York), the works were displayed in three different settings: in the exhibition’s exhibition hall, in a large-scale installation, and in a film-based performance. The day-long event, which featured", "The next Biennial should be held in 2020.  Larsen & Gielsens is planning to make the next biennial in June. The San Francisco Museum of Modern Art and the Whitney Museum of American Art are scheduled to launch their biennials in March or April.\n\n\nThe Museum of Contemporary Art (MoCA) has announced that it is working on a new partnership with the Estate of National Geographic’s chief executive officer, Craig Cronin. Cronin has donated $1.5 million to MoCA as part of the institution’s ongoing efforts to raise funds to improve its aging building, which is located at 730 S. Santa Fe Avenue in downtown Santa Fe, New Mexico. “Tucked away in downtown Santa Fe is a magnificent, sixty-four-thousand-square-foot former granite quarry that has served as the National Geographic headquarters for more than seventy years,” said David H. Petraeus, the museum’s director. “The team at MoCA has been working tirelessly to revitalize the quarry since we acquired it from National Geographic in 2017. We are thrilled to say that this partnership will result in significant new revenue for the museum and will help ensure", "The next Biennial should coincide with its twenty-fifth anniversary, which should take place in 2020. “The Biennial is an extraordinary structure, a masterpiece of modern art,” said Peter Kreuz, president of the Biennial group. “This year’s edition of the Museum Biennales in Turin, Rome, and the French city of Lyon, will be the last, and the last to include the work of the artist Palme d’Or nominee Michelangelo Antonioni. Today, in the year 2115, Michelangelo Antonioni is still the only living artist of the Frank Gehry–designed building. Yet, to date, the museum has not deliberately excluded the work of the artist’s descendants, for the reasons stated in the mission statement of the museum. The Biennial is a unique architectural work, a monumental contribution to the history of art in Italy and the European Union.”The Art in Italy 2020’s inaugural exhibition, “The Nude in the Picture,” will open on February 27. Presented by Art in Italy, The Nude, a special exhibition devoted to Tommaso Cattelan’s monumental bronze sculptures in", "The next Biennial should take place in the city in 2021. The next exhibition will be organized by the Berlin-based collective Ellenbogen Förder Kunstverein and will be held in the city’s Phänomenal Kreuz, located near the Brandenburg Gate. \n\n\nFrance and the United Kingdom will stage an exhibition in Paris this spring featuring artworks by sixty-four individuals, including Pedro Barbera, Martin Bové, Hélène Béchard, and Jacques Chirac. The show will be staged in conjunction with the Biennial d'Art Contemporain, which will run from March 13 to March 16 in 2020.It is currently unknown whether the exhibition will be robot or human-driven, with the robots in question being the Universal Machine and the Universal City, two platforms that will share the stage with the artist-built Biennial d'Art Contemporain. “The exhibition will be a first for France, and for the first time for the UK, where over the last twenty years no museum has staged an exhibition featuring a work by Pedro Barbera, Martin Bové, Hélène Béchard, or Jacques Chirac,�", "The next Biennial should be held in 2021-20 and will be organized in the city’s magnificent Gothic Revival Gothic Revival Gothic Revival Gothic Revival Gothic Revival Gothic Revival , where it will be hosted by the architect Carlie Kluge, the architect Iwan M. Jones, and the architect Jorrit Saro-Wiwa, with the support of Édouard Vuillard, the director of the Santiago Biennale in Chile.In a statement issued by the German Baader-Meinhof Museum, Germany’s cultural minister Heiko Maas, said: “The new exhibition will be a milestone in the evolution of the exhibition. The exhibition will not only present the newest work by a winner, but also the best work in its collection. We are going to use the platform of the exhibition to launch public and private conversations about design.”\n\n\nThe Royal Academy of Arts (RA) in London has appointed John Macgregor as its new director, effective immediately. He succeeds Sarah Hain, who was hired to lead the academy, and will assume his office in the coming weeks.Hain, who is currently cochair of RA’s environment and design committee, will assume her responsibilities at the academy on", "The next Biennial should focus on “postcolonialism and its intersections with present-day realities and present-day histories,” said Kate Fenner, the curator of the exhibition. “We are thrilled to see how and why the exhibition’s boundaries are constantly shifting.”\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that artists Shilpa Gupta and Nita Majumdar have become the first to inaugurate the institution’s new museum of modern art (MoMoMA). The museum, which is currently under construction, is slated to open in 2020 and is expected to be completed by 2021.Gupta, who grew up in India and moved to New York in the 1980s, and Majumdar, a Bangladeshi American artist, will inaugurate the museum in January 2021 and have it open by 2022.“The gift of Shilpa and Nita is a great honor and means a lot to the MoMA team and the community,” said MoMA director Matthew Teitelbaum. “The museum has long been a true home for the art of the West, and we are excited to see what will happen with the museum to become a beacon for artists", "The next Biennial should take place at the city of Tokyo in 2021, and the inaugural exhibition will run from March 18 to March 20, 2021. In the meantime, the institution has released three new works by artists whose work will be exhibited at the Tokyo Triennale in 2020: Akira Nakaya (December), Shunsuke Nakaya (January) and Yoshitomo Inami (March). The 2019 exhibition featured new works by artists such as Miyazaki Taka, Akihiko Nakayama, and Hoshine Takemoto, as well as works by well-known artists such as Tadao Ando, Hideo Tsuda, and Junya Ishigami.\n\n\nThe Metropolitan Museum of Art in New York has appointed Benjamin Graham as its next director. He succeeds Anne-Marie Aldridge, who departed the Met in February 2019 to become the opening and presenting director of the Los Angeles County Museum of Art (LACMA), and will assume his post in June.“I’m excited to join the Met at this unprecedented moment in its history,” said Graham. “While I’m acutely aware of the challenges and opportunities that lie ahead, I want to build upon", "The next Biennial should be held in 2020.  · Changes to the Festival are Widespread and Harmful to Artists.  This includes Closed Art, Art Museum, Art Museum, Art History, Art Photography, and Art Therapy. The Art Newspaper reports that the changes could result in a reduction in the number of galleries, a reduction in the number of artists participating in the festival, and a reduction in the amount of money awarded. The editorial board of the Art Newspaper wrote: In an age of collective, dispersed, and globalized art, Conscious that it is not enough to appreciate what is lost if a new and controversial festival is instituted. That is why we call for a new and different and more inclusive festival. We call for the objective but balanced exploration of art from an interdisciplinary perspective, in a spirit of inquiry and mutual appreciation. We call for a festival dedicated to the work of women and non-binary artists, a festival for artistic experimentation, a festival devoted to queer theory and art in general. We call for a festival dedicated to the visual arts, a festival dedicated to experimental photography, a festival dedicated to drawing, a festival dedicated to painting, a festival dedicated to sculpture, a festival dedicated", "The next Biennial should take place in 2020 and would also include a show by Belgian artist Piet Mondrian.  The twenty-third edition of the Milan Biennale will be held in 2021. \n\n\nThe Museum of Modern Art (MoMA) officials announced today that they will suspend fundraising efforts and reevaluate their exhibition schedule until the institution is fully restored to its prefectural health. “The board of trustees is working hard to make sure that MoMA’s restoration and redesign will enable us to present the best exhibition possible for our guests,” board chair Mary Ellen Klainberg said. “Our discussions with MoMA staff, architects, and leading experts are leading us to believe that the Museum will have a successful and robust 2018–19 season.”The board members are reluctant to estimate when the work to be restored will be completed, and will not be able to say when the museum will reopen to the public. According to the New York Times, the work will be completed sometime between May and August. “We have been working with MoMA for more than a year to develop a new and improved space for our more than three hundred exhibitions,” Klainberg said. “And I am personally", "The next Biennial should take place in the spring of 2021. Given the current climate and the fact that it is still months away before the plants are planted, the panelists concluded that a concrete showpiece—a live performance, perhaps with a conceptual agenda—would be the most appropriate way to conclude the exhibition.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has launched a $250,000 fund for artistic and cultural professionals to help artists and cultural workers struggling due to Covid-19. The fund is part of the city’s new strategy to confront the pandemic and is focused on those who have the most to lose—artists, performers, writers, administrators, and school teachers—and is open to visual and performing artists, artists and performers, educators, school administrators, and school teachers, and their families.“The fund is a new way for the city to support the economic, emotional, and physical needs of artists and creators in the critical months and years leading up to the pandemic,” said Deborah De Sousa, director of the city’s Cultural Affairs Department. “It is a way for artists and cultural workers to express their gratitude and our solidarity with artists and creators", "The next Biennial should take place in 2021, but the organizing committee has yet to specify a date. The 2021 exhibition will consist of works by ninety artists, including Minnelli and Miro, and is slated to run from January 4 to January 5.The opening of the exhibition was delayed due to Covid-19, which forced the cancellation of the 2019 edition of the Venice Biennale, which was held in March. This year’s event will be held from January 17 to January 21.  The list of participating artists is as follows:Armande Agüero, Rome, ItalyDara Arellano, Chiapas, MexicoAlessandro Baratta, Milan, ItalySara Bech and David Callahan, New York, NY, USADiane Capuani, Nara, ItalyNetta Comanecia, New York, NY, USACynthia Bond, New York, NY, USAJuan Carlos Reyes, Albuquerque, NM, USAWalter de Sousa & Ann-Marie Sorokin, New York, NY, USAEmmanuel Delano, Nara, MexicoDiana Florencio, Rome, ItalyMina & Cristina Enriquez, Nara, MexicoN", "The next Biennial should be held in 2021. Artist residencies will be available for the first time in 2021.\n\nA new group of artists has launched a new initiative called the New Orleans Artist Relief Fund (NOLPA). Established by artist Marc-Olivier Baume, NOLPA will send $50,000 to artists each year to help them through the ongoing crisis. “In the days and weeks immediately following the catastrophic earthquake, there were a number of important exhibitions, including ‘The Spoils of War: Baltimore,’ an exhibition organized with the assistance of the The Hague Biennial for Contemporary Art and the New Museum in New York, and ‘One Hundred Years of Painting” (1952), a retrospective organized and curated by the artist Oliver H.G. Browne, who was a mentor to the young Bernard Susser, who in turn inspired many of his contemporaries,” said Baume. NOLPA’s founding partners include Dan Pinchuk, Callum D. Sulkowicz, J. Russell George, and Robert Sigman.  The fund will distribute $50,000 in advance of the first exhibition in the program, which will be hosted at the New Orleans", "The next Biennial should include research that addresses the origins of art in the form of objects and how these objects are used and reworked in the contemporary world. The exhibition will also include a new program, called The Art of the Impossible, that will explore the possibility of “artists” becoming subjects of scientific experimentation.The 2019–20 season will mark the fifth and final instalment of the “Tucson Triennale,” which was launched in 2001 by Gustavo Dudamel and was nominated for the 2011 Pulitzer Prize. The show will return to Tucson in 2021.\n\n\nNew York’s Museum of Modern Art (MoMA) is planning to expand its footprint in China by building a new exhibition space in the city, and in the process, add more than 1,800 square feet of exhibition space to the museum’s 23,000-square-foot space in Chinatown. The announcement comes amid the ongoing protests over the closing of MoMA’s Chinatown exhibition and the reinstatement of death penalty in China, and comes at a time when the Chinese diaspora is rapidly growing in number and influence in the United States.According to Artnet, the new space will be dedicated to the museum’s", "The next Biennial should be held in 2022. The museum currently has plans to present the first exhibition of work by the celebrated French artist Angèle Brisson, whose work has recently been featured in a number of exhibitions. Brisson’s exhibition “Les Demoiselles dans la Suivière” (1907–1909) is one of the most celebrated shows of the twentieth century.\n\n\nThe Metropolitan Museum of Art (the museum) in New York announced today that it has received a gift of eighty works from the Met’s collection. The museum’s holdings include the works of forty-three artists in its collection. The works are currently on display in the museum’s ongoing exhibition “Beyond the Box: Art in the Age of AIDS.”The gift includes works by artists such as Chantal Akerman, Rachel Alkis, and Raimond M. Barnwell; the artist-in-residence from the 1970s, who created the Diaries series; and the artist-in-residence from the 1970s, who made the straightforward, minimalist, and abstract paintings that made up the Diaries series. The collection also includes works by ten contemporary artists whose works", "The next Biennial should take place in the spring of 2019.\n\n\nThe Kellogg Foundation for Contemporary Arts (KFA). In an open letter addressed to museum directors in January 2019, it said that it is working with the state of Iowa to determine the future of the Kellogg Building and the Kellogg Prairie on Main, which has been a part of the foundation’s history since 1954.“This year’s event is a celebration of the history of the Kellogg Building, and the work of the great artists and designers who have shaped it into an important center for cultural and educational exchange between the world and Iowa City,” reads the open letter, which is dated March 6 and addressed to Marianne Trotman, president and CEO of the foundation. “The museum will continue to flourish as a beacon for cultural and educational excellence in the Midwest, and will continue to attract and educate the world to this extraordinary place.”Art Gallery of Ontario (AGO). The thirty-nine-thousand-work New York–based organization, which is known for its ambitious exhibition programs and for allowing large-scale installations in its Toronto location, has announced that it is closing its museum at 272 Madison Avenue East. Curated", "The next Biennial should examine the legacy of the pioneering Russian avant-garde, perhaps linking the two-day event with the larger history of the exhibition. The event’s inaugural edition, “Ateliers Danschau: Mondial und Parten” (2015), presented work by thirty-three artists, including Aleksandr Andropov, Oleg Parashin, and A. I. Vladimir, all of whom were invited to participate in the exhibition for the first time. The exhibition’s second edition, “Ateliers d’Art et d’Journeys” (2016), was curated by Evgeny Morozov, and the third edition, “Ateliers d’Art et d’Journeys II: The Third Dimension” (2019), which was organized by Ivor Devaney, was presented by the same director.The festival will also include a new exhibition of work by the Russian avant-garde. The event’s inaugural exhibition, “Ateliers di Roma: МFeminine and Performing,” will be an open-air performance and exhibition, which will feature works by the likes", "The next Biennial should feature “Dirk Gently” (2019), a retrospective of the artist’s art. In the meantime, the museum has released several recreations of Gently’s works, some of which have appeared in exhibitions at the Museum of Modern Art, the Philadelphia Museum of Art, the Portland Art Museum, the Los Angeles County Museum of Art, and the San Francisco Museum of Modern Art.Gently, who died in 2011 at the age of eighty-nine, was born in New York in 1941. His father owned a construction company in Queens, New York; his mother was a housewife in Manhattan. Gently went on to study drawing at the School of the Art Institute of Chicago, but after a year, he left school to work in a paint shop. In the early 1950s, he relocated to Northern California, where he met his wife, Jeanne, and their two daughters, Louise and Alice. Since the ’50s, he had been working on a series of projects, such as Choosing the Right Music, which reimagined the art of music with a contemporary perspective, and the Conceptual Experience, which he described as “an attempt to do two things: to", "The next Biennial should be held in 2020. \n\n\nThe National Poetry Collection (NPFC) in Washington, DC, has launched a new platform, NPFC Reading Rooms, that aims to help readers develop their own reading lists and to build online communities. The platform, which launched in September 2018, features over one hundred free, paid, and paid-for reading lists. The first reading list, Howl, an online novel-writing platform founded by two New Yorkers in 2018, has since grown to include Mary Cassatt’s Petula Bruguera’s Italia and Philip Pullman’s The Railway of Life. The platform has also partnered with artists to create digital works for the platform—such as John Lithgow’s photographs for an exhibition at the museum last year, which were later shown in a book by artist J.M. Wirth. The project, which aims to create a platform for subversive, experimental writing, was inspired by the 60 Minutes report, which discovered that more than one hundred million Americans read at least one magazine a day, and the new armored-trains, ", "The next Biennial should be held in March 2021.\n\n\nSEAN MAYOR, Mayor of London, has announced that the capital will be reborn as the new home for the Museum of London Art. “The Museum of London reflects the diversity of London, giving visitors an exciting and engaging experience that provides a glimpse of the city and its extraordinary history,” said Jason McCartney, chair of the Museum of London Art. “This new museum will present the rich heritage of the city alongside a new and innovative vision for how people can be inspired and inspired again and again, by the art and architecture of London. I am delighted to work with the Museum of London Art to ensure the museum is the intellectual and cultural hub it needs to continue to draw visitors and build the collection of the city of London’s rich history.”The Museums & Galleries England (MGA), which oversees the UK’s museums, is planning to lay off around one hundred staff, and to lay off or reduce the hours of another forty-two positions as part of a plan to reduce the size of the museum. According to the Times, the cuts will be made across the board, with the lowest-paid staff the hardest hit.The", "The next Biennial should take place in 2021 at the Khotan Museum of Art in Beijing. The prize jury will select the finalists in a biennial exhibition that will feature works by fifty artists, including Gao Zhikui, Zhenya Ning, and Fao Zhijie, and will reveal the winners in 2020. The 2019 winner, Yaxu Wang, will receive a prize of $50,000. \n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has received a donation of more than seventy artworks by artists such as Pierre-Auguste Renoir, Isaac Bashevis Singer, Marilyn Minter, and David Adjay, as well as a gift of thirty-three paintings by American painter and theorist David Malick, as well as a selection of Malick’s works from the collection of the David Rockefeller Gallery in New York.The gift comes on the heels of the Hirshhorn’s announcement that it will soon welcome another hundred works by Uma Thurman, including her first solo exhibition in the United States since 2009. The artist will also have a solo exhibition at the Metropolitan Museum of Art in New York in 2021. The show will feature works by thirty-two artists,", "The next Biennial should consist of a special exhibition of work by a selected group of collectors in the first half of the twentieth century. The exhibition should take place in the museum’s main building, in the museum’s historic exhibition hall, and in a portion of the museum that is currently closed to the public.The biennial will be organized across three stages. The first stage will consist of a series of exhibitions that will present art from the last fifty years. The exhibitions will be arranged in a semi-structured format, with the first exhibition, “The Future Is Present,” opening on September 21. The second exhibition, “The Arts of the Present,” will open on September 22 and the third exhibition, “The Past Is Present,” will open on September 27.The full list of exhibitors is as follows:Art+Art: TheaterCenter for Emerging Art from the Middle EastArt GalleryMuseum, IstanbulArt Press, LondonArt Sale Gallery, LondonArt Museum, New YorkArt World, New YorkArt in the Studio, ViennaArt in the City, New YorkArtPlace, New YorkArtPlace, New YorkArtPlace, New YorkArtPlace, New YorkArtWith Science, New", "The next Biennial should be announced soon. \n\n\nThe Museum of Fine Arts (MFA) in Boston, Massachusetts, has received a gift of more than 1,500 works from the collection of two Boston-area families who were active in the art world until their deaths, in 1977 and 1978.The gift, which also includes works by artist-in-residence Laurence Brackens and artist-in-residence James Cuno, was made to the museum by Jean and Maximilian Brackens, who were active in the arts for more than three decades. The Brackens-Martin Museum of Art, which is located at 1200 East Main Street in West Roxbury, Mass., and is funded by a gift made by the Martin family, donated the works to the museum in 2013.“The Brackens-Martin Museum of Art is thrilled to receive this incredible gift from the Martin family,” said Jean Martin, director and CEO of the Brackens-Martin Museum of Art. “This gift will help us continue to present a wide variety of works by exceptional artists and will allow us to present these works in a new and engaging way.”The gift of these works comes at a time when the M", "The next Biennial should be held in 2022. Till then, the museum will continue to display artworks by both legendary artists and a select group of contemporary artists.\n\n\nThe W.K. Kellogg Foundation, the Kellogg-Briand Art Museum, and the Smithsonian’s National Museum of African Art in Washington, DC, have announced a $3.75 million gift to the arts as part of an agreement that will provide financial support to institutions that are working toward increasing their digital collections by 10 percent during the next five years.The five foundations are the David Rockefeller Foundation, the Henry Luce Foundation, the William and Mary Foundation, the John D. and Catherine T. MacArthur Foundation, and the Andrew W.K. Foundation for the Arts.The gift is the latest in a series between the foundations and arts organizations to advance the digital era. In 2016, they launched Artists on the Move, a new initiative that will produce future works by artists in the US. And last year, they gave $500,000 to four nonprofit organizations—the William and Mary Foundation, the Christopher Newport University Art Museum, the Brooklyn Museum, the New York Public Library, and the Smithsonian’s National Museum of African Art", "The next Biennial should be held at the Biennial-Alter, at Bowling Green, in Kentucky, in March 2022. The biennial will also feature a collection of works by artists and collectives from the A.I.R. Gallery in New York, the SculptureCenter in Chicago, and the Museum of Fine Arts, Boston.The first phase of the second annual Biennial will feature works by artists such as Don Suggs, Francis Sedgwick Davis, Tadao Ando, and Jack Hirschhorn. The third and final phase will be an exhibition of sixty works by artists, including William Kentridge, Ann McEnery, John Coltrane, Robert Mapplethorpe, and Robert Irwin. The exhibition will take place at the Biennial-Alter from March 18 to March 21.\n\n\nFrieze announced today that it has launched Autobiography, a new digital platform dedicated to the personal narratives of contemporary artists. Launched by the artists themselves, Autobiography allows users to upload a work, create a profile, and upload images and videos. In the first three months of the platform’s operation, the artists have shown more than twenty thousand works to the public in twenty countries, as", "The next Biennial should be held at the very least in the spring.”The biennial’s first president, Chantal Moneren, said: “The project we’ve been working on for years, to organize more than three hundred works in the coming years, to make the collection accessible, more collaborative, and open to all, is now at the apex. I’m proud of having contributed to this project, and to having helped bring it about. ‘Eradication,” a biennial that began in 2007 and has been staged in various locations, including the United States Embassy and the Palais de Tokyo, would not have been possible without the help of my colleagues at the National Museum of Fine Arts (MMFA), Paris, who were always ready with ideas and suggestions in advance, and who were motivated by a desire to more effectively promote contemporary art in the capital.”\n\n\nThe Van Gogh Museum in Amsterdam has received a gift of 56 paintings and prints by Michael van Gogh, a Dutch American artist who was born in New York City in 1941 and raised in Amsterdam. The works, which were acquired by the Van Gogh Museum in 1998, mark the first pieces of the series", "The next Biennial should focus on the lives and work of the thirty-two artists who have received the prize so far. This year’s awards will be announced in September.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it plans to cancel all future events and inaugurations with the Architecture of Modern Life series, a major retrospective of the work of the late French polymath Frédéric Bastiat, which was scheduled to run from March 14 to March 21. The exhibition will be relocated to the Museum of Contemporary Art, which has moved from its current home at 230 North Santa Fe Avenue and will be replaced by a new exhibition featuring works of contemporary art.“After careful consideration of the Art of the Present series, we believe it is best for MoCA to move forward with the program of the Arch of Modern Life,” said Museum chair Todd Campbell. “In celebration of its forty-fifth anniversary, we want to thank our new guests and our archival staff for their hard work and for their contributions to the series. The exhibition, for the first time, will be hosted in the new and expanded space of the Museum.”The event will be moved", "The next Biennial should be held at the Museum of Fine Arts in London, in January 2021. In a petition that was signed by more than 1,500 academics and art historians, the biennial’s organizers wrote: “The new exhibition ‘From the newly printed to the absent,’ 'Paintings from the World War II,” in conjunction with the exhibition ‘Art in the Age of Hitler,” will be a welcome change from the monotony of the exhibition, which consists of only 70 works, a selection of which are on display.The petition is not surprising since the event’s sponsor, the Royal Shakespeare Company, has long denied supporting the biennial. Since it shuttered in September 2019, the company’s London-based director, Guy Hamilton, has claimed that the decision was not related to the growing protest movement against the institution, and that the decision was only in the interests of conserving money.The news comes amid mounting pressure from artists and scholars to push back the closure of these exhibitions—a decision that has forced the RSC to relocate some of its programming. The letter signed by the petitioners reads: “In light of the RSC’s recent decision", "The next Biennial should begin in the fall, with a design by Sebastien Bahr, the founder of the company Léger Stélépéré. The exhibition will showcase work by twenty-four artists, including Adrienne Atget, Alessandro Avalocchi, José Arteaga, Nadine Evans, and Nancy Spero. The first exhibition, “With Love and Death,” will open in the spring of 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Colby Covington as its next executive director. Covington succeeds Matthew Teich, who retired after thirteen years in May 2019 after more than two decades in the role. A self-taught painter, Covington will assume her responsibilities on April 3.“Colby brings exceptional leadership and strategic vision to our board as she inherits an institution that has transformed in the last ten years as it has become a favorite destination for artists to see works from the first three generations of the Whitney’s collection,” said curator Matthew Teich. “With her background in design and a focus on diversity and inclusion, she is ideally qualified to embrace MoMA’s artistic mission to support and", "The next Biennial should be announced next October. \n\n\nThe National Gallery of Art in Washington, DC, is planning to close its doors for two weeks to allow the public to experience a new exhibition, “The Future Is Present,” in the gallery. For the first time in its seventy-five-year history, the institution will also hold a retrospective, “The Art of Being Present,” in the gallery. The exhibition, curated by Simon Fox and featuring work by sixty-four artists, will be on view until December 3.“The Future Is Present,” is part of a nationwide multiyear project to make the National Gallery of Art, its namesake institution, more accessible to the public. Beginning on January 20, 2020, the museum will begin a construction campaign that will last through March 2021, and will construct six new galleries and the National Gallery of Art’s current building on the grounds of the museum. The renovations will also include the redesign of the National Gallery of Art’s Visitor Experience, which will include an upgraded tour of the institution.According to the Washington Post, the National Gallery of Art is not alone in its quest to make the institution more accessible to the general public. Other large arts", "The next Biennial should take place in 2022.\n\n\nThe National Galleries of Scotland (NGM) has announced that it is reconfiguring its campus to house a new collection of around one thousand works by artists working during the height of the AIDS crisis. The new venue will be built in partnership with the artist-run charity Transformer, whose director, James Cropper, said: “We are delighted to be working with NGM to integrate this collection into our campus as part of a major redesign that will make the site more accessible and engaging for visitors. This will include the redesign of the exhibition galleries, the collection rooms, and the galleries, and will also include the redesign of the circulation track, the library, and the visitor experience.”Completed in partnership with the Arts Council, the project, called “Quarantine,” will stage fifty exhibitions of contemporary art each year, culminating in “The Art of Survival” in 2020. The institution will also open a new community space in the city, which will serve as an open area for the public, and will build new public artworks in a former elephant pen, which will be converted into a museum for the collection.“We are confident that this project will enable N", "The next Biennial should take place in 2022. \n\nThe Swiss Federation, which oversees the exhibition program, also announced that it plans to push back the opening date of the forthcoming biennial by a year. Titled Issue 24, the exhibition will instead focus on exploring themes of the show, which is curated by Dominique Baillie, and the future of the exhibition.The new date will coincide with the opening of the show Art in the Age of Mechanical Reproduction—a presentation of new works by around seventy artists and collectives in a bid to grapple with the role of machines in the production and consumption of art. Inaugurating the exhibition will be a survey of the history of instruments, a review of the new production techniques and technologies of the exhibition, and a special presentation of work from the forthcoming exhibition.“We could not have chosen an ideal time to bring our annual exhibition to Zurich,” said François Röthler, president of the Federation. “Although the exhibition will continue to be tailored to the needs of the museum, the programme will evolve into an In-Depth Art History.”The exhibition will also receive a boost with the launch of the Anselm Kiefer", "The next Biennial should be called “The Future of Life” (2016), which will focus on the concepts of life and life-giving, and “Art and Life,” which will be held in 2019. The event will be centered on the concept of the living body, with a special attention paid to the potential of materials.Meanwhile, other arts and cultural institutions are gearing up for a similar backlash against those who profit from the deaths of laboratory animals, and are preparing to engage in direct action.Activists and artists are preparing to stage protests at major art institutions across the United States on March 24. Among the institutions that have announced they will close indefinitely are the Los Angeles County Museum of Art, the Metropolitan Museum of Art, the Museum of Modern Art, and the Whitney Museum of American Art. Museum director Max Hollein told the Los Angeles Times that the institution will not be able to safely reopen without the immediate and extended closure of the city. “The museum is preparing for a shutdown with a combination of cultural and logistical disruptions, including the loss of the primary means of transportation for visitors, the inability to hold large-scale exhibitions, and the disruption of personnel,” Hollein said.The California Farm Bureau,", "The next Biennial should be in 2020. The plan, which was announced in March, calls for a seven-day-long event that will feature a combination of traditional and contemporary art, as well as a retrospective of work by sixty-nine artists selected by the public. “The new seventeen-day Biennial will be an extension of our commitment to present a diverse selection of contemporary art, and will focus on the development and exploration of different forms of art,” said Katja Triebel, director of the Biennial & Museum Berlin. The exhibition’s inaugural iteration, “Influence,” was held in early March at the Museum für Kunststassung am Mittelalter, Frankfurt; the Museum der Künste Berlin; and the Museum für Kunstkunst, Stuttgart. According to the New York Times, the new five-day-long event will begin on March 29, 2020 and conclude on May 10, 2020. The event will feature more than 120 artists representing seventy-eight countries, including artists from Peru, Armenia, Lebanon, Italy, Mexico, and the Philippines. Commenting on the new platform, George Lucas, chairman and chief", "The next Biennial should take place in 2021. This is our opportunity to put this exhibition on display in a more positive light. It is our duty to create a public dialogue on contemporary issues and to commemorate a significant accomplishment.”A selection of the works in the exhibition will be presented in the Biennial’s 125th edition, which will be held in the museum’s new building in the spring of 2021. The exhibition will also feature new works by emerging and established artists and will be organized on an annual basis.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for determining when a work qualifies as a “work of art” under the state’s new $15 minimum wage and minimum hours laws. According to the DCLA, a work must “show the ability to ‘transform the work into a mass, a collective, or a collective work.’” The guidelines state that a “single-driven movement,” such as a pen ache, “may be recognized as a ‘work of art’” but must “show that it ‘has a substantial and specific relationship with the work’s original intention.�", "The next Biennial should take place in the fall of 2020, so that artists and non-artists alike may finally see the full range of the museum’s exhibition-based programming. As part of the new agreement, the Fondazione Federazione BIONELLA will resume with a new selection of works, the first exhibition in the new format to take place since 2013.The previous edition, entitled “Wine and Grit,” was held in the summer of 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has promoted Kate Kelly to senior curator. Kelly, who has served as associate curator at the museum for the past two years, has been promoted from senior curator of contemporary art, where she is currently a founding curator, to curator of modern and contemporary art. She succeeds Mary Clare, who retired in February 2019 after seventeen years at the institution.“Kate’s curatorial work across contemporary and contemporary art has been transformative and groundbreaking, and we are deeply indebted to her for her contributions to MoCA and to the museum’s contemporary art program,” said museum director Anne-Marie Olsz, who serves on the board of trustees. “", "The next Biennial should take place in Copenhagen in 30 years. The curator is still undecided on whether to include the first season of the show on a smaller scale. The new ten-episode roster for the 2020 event is currently being assembled and will be unveiled later this year.The twenty-fifth edition of the Royal Academy of Arts, Art London, will take place in London in March 2021. All three of the United Kingdom’s major art institutions are currently closed as a result of the coronavirus, and the Royal Shakespeare Company (RSC) will not reopen until mid-September.British Prime Minister Boris Johnson declared the curation of the show “the most important of its kind.” The RSC will also stage a new special edition of The National Poetry Month at the end of September. Johnson also announced that all new grants of £5,000 will go to arts and culture. The money will be distributed by the Department for Culture, Media and Sport (DCC), which is part of the Department for International Development (DfID), within the £7 billion Brexit settlement. The move has been criticized by many, including the Institute of Directors, the Association of Directors of British Artists, and", "The next Biennial should be organized in 2020. During the first exhibition, Alberto Serpa and Gabriel Faus were invited to present an exhibition of works by Aristórea Pindell and Norman Bennington. The inaugural edition was held in the Museum of Fine Arts Herzog & de Meuron. \n\nThe Kunsthalle Basel has announced that it will no longer hold its next edition in late June. The change has been made in accordance with the organizers’ request to “get away from the Middle East and Asia.” In a statement, MCA Basel said: “We are grateful for all the support from the guests, exhibitors and the MCA. We hope this decision will solve the problems of the exhibition. We are working hard to prepare for our May, June and July editions and hope to implement a new strategy that will give us a better chance of delivering the best show possible.”The announcement follows German newspaper Frankfurter Allgemeine hera 1’s press release on May 8, which said that the fourth edition of the Kunsthalle Basel in June would not be rescheduled. The fair would have been staged in the German", "The next Biennial should take place in 2020. We are currently in discussions with the Jordanian Ministry of Culture and are awaiting their recommendation. \n“The Future of Cities” was unanimously chosen by the 2019 edition of Art Basel Hong Kong, which took place at the Hong Kong Fair and Spring, and will be presented as part of the 2018–19 season. The theme is “How do we live together?” The event will be hosted at the Jumeau Museum in Belgium from January 19 to January 22, 2020.The 2019 edition of Art Basel Hong Kong was held at the Waseda Prefectural Museum of Art in Japan and at the Tokyo Metropolitan Museum of Art, which is currently undergoing a renovation. The exhibition has also been staged at the Hong Kong Museum of Art and at the Museum of Modern Art (MoMA), which is currently undergoing a massive renovation. The 2020 edition of Art Basel Hong Kong is being organized by the same company that manages the fair, and will be hosted at Nara Art Museum Tokyo.\n\n\nFrieze announced today that it is working with Indonesia to create a new series of exhibitions, places of cultural exchange, and other partnerships focused on the visual arts and design. Titled �", "The next Biennial should be held at Moscow State University in December 2020, with the work of twenty-four artists from Russia, Belarus, Kazakhstan, and Uzbekistan. The exhibition will also include the first lessons from the “Art Foundation of the Russian Academy of Sciences” (RFU), and the first Masters “Advanced” courses from the university.\n\n\nThe Solomon R. Guggenheim Museum in New York has welcomed two new members to its staff, who have since been promoted to the rank of curator. Eleanore Daniel is now the new deputy director, and Tanya Brzez, who currently works in curating at the Museum of Modern Art in New York, has joined the museum as director of exhibitions. In a statement provided to the New York Times, Daniel said: “Eleanore and Tanya are foundational to our thinking about art and about the role of museums in the contemporary world. We’re thrilled to welcome them to the museum and to be working with them as we continue to advance our collection, our exhibitions, and our programs.”Daniel joined the Guggenheim as chief curator in 2007 and has since become the institution’s deputy director, which is responsible for both curating", "The next Biennial should take place outdoors in a location that is, as far as possible, accessible by bike, foot, or public transport. We believe that cycling is the most accessible form of transport around the world.” Joël and Bertrand Piccard, the founders of the Paris-based museum Légera, said that their first priority was to avoid demolishing the nearby nineteenth-century monument to the killing of Martin Luther King Jr. but that they now hope to have the twenty-second Biennial, for African art, completed by the year 2020.\n\n\nThe DiPasquale Foundation, Italy’s largest cultural organization dedicated to Italian visual art, has announced that it is planning to leave behind the building and begin the long-overdue restoration of its current holdings, which include works by the artist-activists Pia Camille and Mario Camil, who were both students at the Los Angeles County Museum of Art, and Gio Ponti, a skier and skier photographer who created works that often served as a platform for Camil and Ponti to bring together naked bodies in their studio.The foundation’s current home in the Tuscan town of Piazza di Pescara, near", "The next Biennial should be held in 2022. \n\n\nThe Metropolitan Museum of Art in New York has appointed Daniela Mendoza as its next director. Mendoza has served as the interim director of the museum since March 2019. The appointment was made after the museum completed a $5.3 billion renovation project, which added a new library, auditorium, and a theater, and spanned three continents. The museum also announced that it plans to move the exhibition and presentation of the works of the late Mexican designer Ildemar Abuela, whose influential studio was located in the former Warner-American Art Museum, now the Museum of Modern Art. After consulting with the museum’s board of trustees, director Christopher Mills, and a group of trustees who were appointed by the board, the museum voted unanimously to accept his resignation on March 23.During his tenure at the museum, Mendoza was instrumental in the acquisition of more than 1,000 works by Mexican-born, Los Angeles–based artists such as Ortega y Gasset, Frank Gehry, and Amara Biczel, among others. She also developed partnerships with artists such as Alejandro Campo, Sam Peck, and", "The next Biennial should include an exhibition of works by the Mies van der Rohe and Joan Miró Biennial teams. The third edition of the Biennial will take place in Berlin in 2022 and will include a selection of works by the French and Italian directors. The fourth Biennial will be held in the city of Salerno, Italian prefectural Piedmont, and will focus on \"Toward an Ethnographic View of the Modern World, a concept that has preoccupied scholars and critics since it was first proposed by the late Italian architect and philosopher Giacomo Eco in 1927. The fifth and last Biennial will be held in the city of Florence in 2019 and will focus on the work of the legendary Italian architect and theorist Cineda Bisanti.\n\n\nThe Venice Architecture Biennial (VAB) has announced that it is laying off 203 employees, including 185 part-time positions, and is preparing to reduce the number of visitors it brings to the site of the ancient Venetian city of Tepe. The cuts were made as the Venice city government attempts to reduce the COVID-19-induced shuttering of the city’s historic Venetian Town Hall. “The institution is", "The next Biennial should be one of the most exciting and ambitious projects that has ever been undertaken by the V&A. For me it is imperative that the exhibition does not stop with the installation of our latest exhibition; rather, it goes on to be a pivotal moment in the development of art and an example of how art can be broadly used to advance social progress. We must use the Biennial to re-construct the gallery and to re-create the institution.I am inspired by the Biennial’s continuous progress, its year-round exhibitions, its exhibitions of work in its early stages, and its artistic creations that are now on view in the museum. The Biennial’s exhibition “On the Meaning of Life” (2017) will be the first to open on its new site in 2021.\n\n\nThe museum’s collection of over 400 works of art, including works by artists such as Jean-Michel Basquiat, Philip Larkin, and Robert Irwin, and is currently undergoing a $250 million expansion. The $50 million renovation, which began in 2019 and is expected to be completed in the first quarter of 2020, includes the addition of additional galleries and spaces, as well as the permanent exhibition of the", "The next Biennial should be held in 2021, at which time the collection will have recovered from the pandemic.This article was originally published in the January 2018 issue of the International Journal of the History of Art.\n\n\nStéphane Bergeron, director of the Centre Pompidou in Paris, has announced that the Museum of Modern Art (MoMA) in New York will stage an exhibition of work by the artist Georges Apostel in the fall of 2021. The exhibition will be “Porphyria and the Black Madonna” and will be organized as part of a worldwide campaign to raise awareness of the work of the artist, who was born in Toulouse in 1958 and lives in Paris. Bergeron says that the exhibition will be a “very important moment for us.” The work, a retrospective titled “The Black Madonna,” will include works by collaborators such as Damien Hirst, Simon Dimin, and Julie Adam, and will open at the Museum of Modern Art in December.“I’m thrilled to be heading back to Paris,” said the artist, who has worked in the City of Light since 1996. “The very idea of a city in the center of a", "The next Biennial should be held within the next two years.  The museum has also been working on developing a new collection, which will be comprised of all works created by women in the last 15 years. The new work will be developed and curated by a select group of artists from the museum over a period of three years. The 2019 exhibition, “From the Same Girl to the Same Man,” will mark the first time the museum has showcased a work by a woman artist in the thirty-six years of its history. The museum will also present an exhibition dedicated to the life and work of the late independent filmmaker Mira Dancy. Commenting on the upcoming exhibition, Kohn said: “A lot of people are drawn to the museum’s collection because it is very modern and very contemporary. But it must also be the museum that is most accessible to people who wish to see it, with the greatest number of people being able to see it at once, the most extensive number of exhibitions available to people who want to see it, and people who are most likely to see it.”\n\n\nThe museum’s collection of more than 90,000 works by thirty-six artists will soon be", "The next Biennial should take place in late January 2020. The theme of the inaugural edition of the exhibition is “The Unseen” and its exhibition will be centered around the theme “The Unseen: Beauty and the Trap.”The 2019 edition of the exhibition featured work by twelve artists on the exhibition’s inaugural season, including the Works of Keats, Lessing, and Keats’s son, Peter; the inaugural exhibition “The Exorcism of Emily Hall,” an exhibition that traces the discursive history of American painting; and the exhibition “The Plenitude of Beauty,” a biennial that examines the relationship between form and content in art and design.\n\n\n\n\n\nJohn Sian, the American curator who curated the biennial “The Structure of Art” (Tavern Books, 2010), and its successor “The Structure of the Film,” has died at age seventy-nine.Born in New York in 1941, Sian moved to London when he was only fifteen years old and taught at the School of the Art Institute of Chicago from 1967 to 1971. He continued his education at the University of California, Los Angeles, and the University of Nevada, Las", "The next Biennial should be held in 2021. “The past few years have shown that the biennial is the optimal medium for the exhibition of new works by the best international galleries,” said Dora Vera, the general director of the UNESCO World Council of Art.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it will continue to host the retrospective of Polish artist Jozef Pilar, who died in 1953, despite a petition signed by more than 2,500 people. The institution previously released an open letter in 2016 urging the museum to continue with the event, which has been held every March since 1968.The open letter, which was addressed to MoMA director Marc Straus and signed by more than 1,000 people, stated that the museum has “done everything we can to prevent the exhibition of Pilar’s work,” and that the “show” “is almost certain to cause ‘irreparable damage’ to his legacy.” The letter also stated that the exhibition is “not in the best interest of the artist’s legacy and that the museum should be celebrating his life as a living artist.”The letter was signed by", "The next Biennial should aim to address the question of how and why the history of biennial events has such a complicated relationship with the artistic experiences and historical trajectories of contemporary artists.  The next iteration of the Biennial will focus on this question in the form of a discussion on 'The Continuum: Art and Continuity in Film, 2007–2012' with Susanne Vielmetter, a curator and curator of contemporary art from the Czech Republic.  The biennial theme in 2013 was “Feminine and the Image,” and the first Biennial was held in Prague in 1999. The new work is the first of three biennials. The first will be staged in the US in 2021.\n\n\nThe National Museum of Modern Art (MoMA) in New York and the Museum of Modern Art (MoMA) in Miami have restored the two-hundred-year-old and renovated John Moores’s home, which was featured in the 2008 film American Hustle and was a site of many confrontations between actor Will Ferrell and director David Fincher, the latter of whom repeatedly tried to kiss Moores’s wife, a New York Times article states.The restoration, which was", "The next Biennial should feature a selection of works by artists from across the world and cover the current biennial themes and the upcoming biennial materials, including the exhibition, “10/11: Collections and Presentations,” which is scheduled to open in September 2020. The exhibition will also feature works by Sawangandana, Tadao Ando, A.P. Kapoor, L.N. Aoki, Sandra Borthwick, and Juan Fernando Pascual, among others, in addition to biennial works by Lauren Donnelley, Diana Foa, Samantha Franklin, and Lulu Cattelan.Commenting on the upcoming biennial, director Marc Tavani said: “We are thrilled that the public and the new members of the institution are recognizing the visionary and important work of the previous ten years. The new exhibition will bring together the biennial’s collections together in a new way that will reflect the richness of our collections and the exceptional quality of the exhibition program.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that Annie Park, who served as the DCLA’s", "The next Biennial should be held at the Chicago Cultural Center in mid-April, in the spring of 2021. The museum is currently negotiating with the city of Chicago to hold the exhibition over three years.\n\n\nThe Bessies, the New York City-based nonprofit that supports indies and under-recognized artists, has appointed Linda Aschbacher as its next executive director. She succeeds Stacy L. Murphy, who has led the organization for several years and will begin in her new role on August 1.“After a distinguished career in the advertising and retail sectors, Linda had the opportunity to lead the Bessies in a new way, and achieve greater impact, during her tenure as executive director,” said Cindy Sherman, the organization’s board president. “Linda brings a wealth of knowledge and experience, having previously held senior positions at companies such as Polaroid and Adept and advancing to director of the New York Agency Agency in 2015, where she guided the agency through its transition to Adept. She will continue to be a strong advocate for artists and their work as we continue to expand our platform across the country.”The Bessies were founded in 1971 by Susan Jacobs, Cary Sherman, and", "The next Biennial should be held in the Spring of 2020, following the opening of the new exhibition “Boba Fett.” The biennial will focus on the biennial’s theme, “the future of art,” as well as the collection of the biennial, which is currently housed in the museum’s permanent collection. The 2019 biennial, “Fashion,” was also curated by Miranda August, and also featured artists such as Trisha Brown and Hamedine Kane. The biennial was inaugurated by the exhibition “The Diaries of Alia Kazim,” which aired on January 18, 2019.\n\n\nThe Oxford Art Museum (O’M) in England will soon house all the surviving works of the late Egyptian sculptor, theorist, and theorist Zinedine Wassily, the founder of the revolutionary Al-Andalusi School of Art, in a new exhibition titled “Between Egypt and Arabia: The Art of Animals,” which will run until March 3, 2020. The exhibition will feature the works of twenty-six artists, covering subjects such as “the relationship between Egypt and Arabia,” “Egypt and the Western World", "The next Biennial should focus on “the relationship between art and politics in contemporary life,” said Anne-Marie Olschbaur, chair of the committee of representation. “Michael Rosenfeld, the curator of contemporary art and the future of art, will be the perfect person to lead this project. He has been a great champion of the GDN and of the GDN’s history. He has a clear and passionate sense for the art that belongs to art and has the ability to make that art accessible for everyone, particularly to those most in need.”The Biennial will be held at the Museum of Arts and Design (MAD) in London from March 6–March 10, 2020. Entitled “The Future Is Art,” the exhibition will feature new works by ninety-nine artists, including Angel Gabor, Robert Irwin, Jean-Michel Basquiat, Pierre-Michel Leclerc, and Thomas Heatherton. It will also include biographical sketches and interviews with fifty-nine contemporary artists, including Piet Mondrian (France), Evelyn Mayhew (UK), and Frank O’Hara (US). The exhibition will feature new drawings by twenty-five of the artists featured in the", "The next Biennial should be held in 2020. In a statement, the city said: “The upcoming exhibition must address the current and future challenges posed by the exhibition and exhibition spaces, and must take into account the efforts and sacrifices of the staff, other visitors and the city in order to avoid making a false impression on the future of the exhibition.”The British Museum in London has also declared the future of its exhibition “Iconoclasm,” which deals specifically with the exhibition of extravagant works of art, “dead” and “no longer relevant.” The museum’s director, Maria Balshaw, told the Art Newspaper: “We can’t solve the future, but we can try to shape the past and encourage the future. We just have to be more conscious of what we do and think about the future.”\n\n\nThe Miami Dade College Museum of Art (MDCA) has been awarded a $10 million grant from the Miami-based PEN American Writers’ Association (PEN-A) to help make up for a shortfall in art funding stemming from the coronavirus. The grant, which was commissioned by the P", "The next Biennial should take place in Miami Beach in 2022. In the meantime, the city of Miami Beach is working with the university to develop a new master plan for the city. The works will be on view in the museum in March 2020. The museum is also preparing for a major renovation and expansion that will include the construction of new spaces for the collection and exhibition. “More than anything, we are excited to bring the museum back to life,” said museum director and CEO Klaus Biesenbach. “The research and presentation of these works is the foundation of what makes Biennial Miami Beach unique, and we are committed to supporting the museum in this way in order to make this occur.” In addition, the museum will host more than 1,500 exhibitions in collaboration with the university in 2020 and 2021, including a new exhibition titled “Collective Memory: The Art of Biennial Miami Beach” in March 2021.In addition to the works, the museum will also introduce a new area of its collection called the Biennial Reading Room, which will present a series of discussions with artists from the collection, as well as a new writing project dedicated to biennialism and an engaging online catalog. The work will be", "The next Biennial should, perhaps, be called “The Present.” It also needs to recognize the role of contemporary art in reimagining our own lives, and in rethinking the future as a way of life. The Future is Our Present is also a great need of our time, and of our freedom. The past is a reminder of our limitations, of the ways in which our ways of life are being changed by technology and climate change. We must take this in stride and remember that our actions have the power to alter the course of history, and that, as a society, we have a responsibility to alter our own ways of life for the better. The future of our planet and of the Earth more generally is at stake. We must take urgent action.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it has appointed Paul Mpagi Sepuya and Thomas Paine as the next directors of the institution. Both Mpagi and Paine hail from Kenya and have helmed MoCA through its tenure as a nonprofit institution since it opened in 2008. They will take up their new roles on January 18, 2020.“We are excited to welcome these two talented men and", "The next Biennial should be held in 2021. \n\nThe Buffalo Museum of Art (BMA), New York: Signed off in 2015, the museum had previously stated that it would retire the titled The Documentary, a special project of the BMA, in 2018. In March 2019, the museum reopened with a new collection of work by the artist and curator Bechida Olu Olu, who is known for her conceptual paintings and assemblages that address issues of memory, identity, and history. \n\nThe Library of Congress has announced that it plans to remove more than 1,500 works by John Cage, including The Uprising, The Sirens, and The Book of Life. The works, which have been on display in the exhibition “The Cage: Life and the Art of John Cage” since 2007, were added to the National Museum of Fine Arts (NMFA) in Washington, DC, in 2013 to coincide with the reopening of the museum. The works were removed in accordance with the terms of a long-term donation agreement between the museum and the artist and were given the opportunity to return to the museum for a retrospective in 2018.The agreement, which also stated that", "The next Biennial should be held at the Museum of Modern Art in New York City in 2021.\n\nThe Boston-based firm that organized the 2019 edition of the annual event, which was canceled a year earlier because of the Covid-19 pandemic—a media event at the Massachusetts Institute of Technology (MIT) was put on hiatus until mid-January—is seeking a new partner for the 2020 edition, which will focus on collections and exhibitions that are not currently rescheduled and that will take place in the United Kingdom, the United States, and other parts of Europe. “I am delighted to be working with the talented, dedicated team at the Henry Luce Foundation in New York City to bring the 2019 Boston Art Biennial to New York City and to continue to build on the foundation’s reputation for creating eclectically designed exhibitions that reflect the rich, artist-centered, and cultural diversity of Boston,” said David Wain, the director of the Henry Luce Foundation.For his part, Wain said: “Eden Levy has been a great collaborator since he first proposed the idea for a biennial at the Henry Luce Museum in 2012. He has been proactive in bringing current work to the biennial and", "The next Biennial should take place in 2021. A statement from the artist-run organization said that the exhibition will receive 1,000 visitors from 27 countries.\n\n\nThree New York City–based filmmakers, the New Yorkers “Thea Jaworski and Nicky Almon,” and Roger Ebert, have created a new platform for cultural preservation in the aftermath of Hurricane Sandy. The filmmakers, who were inspired by the work of the late American artist Frank Gehry, created the Grove Horizon for the Arts, a massive digital archive that will house the city’s cultural heritage, as well as archiving and mapping of every piece of art and artifact that entered the structure during its construction. The piece is currently being restored by the Museum of Modern Art and is slated to reopen in 2020.The institution is planning to put the entire collection online using the public’s data, which will be made available to researchers, museums, and the public via the Grove Horizon. The project is part of a larger strategy to make the city’s cultural heritage more accessible to the public through digital platforms and services. New Yorkers can now also upload their personal collections to the platform. The platform is currently in the planning", "The next Biennial should go ahead, but if there are any concerns the event may be postponed due to the Covid-19 pandemic, the show will still be held, as James Mitchell, director of the Smithsonian Design Museum, told the New York Times.The exhibition, titled “Modern Art and the Covid-19 Crisis,” will be on view in the Smithsonian’s new building, which is currently undergoing a $650 million expansion that will see the creation of more rooms for educational and research initiatives. The exhibition will also include photography works by Louis Kahn, Willem de Kooning, and Pierre-Auguste Renoir. The show will be on view until October 29.In a letter sent to the public by the Los Angeles–based design firm of Ernst & Young, the exhibition’s artists’ participation was closed indefinitely. “As the United States faces its first major outbreak of Covid-19, it is important to remember that the future of art, design, and the creative process is at risk,” the letter reads. “Artists make incredible contributions to the creative process, and Artforum is committed to supporting them. We are hopeful that with the exhibition ‘Modern Art and the", "The next Biennial should be held in 2020, and the first in 2021.  The project is also working with an international team of architects and designers, led by Koons, to create a new series of digital experiences to mark the centenary of the publication of the first issue of the magazine, titled Nation and Country. The exhibition will comprise five films from the series “China’s Documentary: From Scratch (1929–1933)” and “The Documentary, 1923–1938” and will run for one month and will be divided into days, weeks, months, and years. The first film is a compilation of interviews with artists such as George A. Lucas, Artyom N. Gogolev, and Lévy Gorvy’s George Glauber; the second is an exhibition of photographs from the series “The Expressionists.”The exhibition will also include a selection of rare works by the Italian architect Enrico Castellani, which will be on view in the exhibition “The Fifth Element” from the exhibition “World View,” curated by Archibald Merz.\n\n\nThe Museum of Contemporary Art (MoCA) in", "The next Biennial should be held in 2020, and then again in 2022. “The decision was made in collaboration with the partner institutions and the artists, who are currently participating in the Exhibition Biennale, and was not taken lightly,” said Denise Bozin, director of the museum. “We are privileged to have Stedelijk Museum on our side. It is a great honour and a great privilege to host Andreas and Sophie.”In addition to the Amsterdam Design Biennale—which, in addition to exhibiting work by forty-nine of the major international artists, will host a number of artists from the UK, Italy, Germany, and France—the museum also announced that it has expanded its relationship with the artist’s museum. The partnership, announced on January 15, 2019, includes the development of a new exhibition series, an exhibition at the museum that will be hosted by the museum and Runa, an online platform that will host the program.“This is an incredible partnership,” said Mark Ash, director of the museum. “We are now able to present Andreas’s work in a truly international context. I’m thrilled to be working with a museum that makes so much", "The next Biennial should be staged at the Museum of Contemporary Art Berlin in September 2019. \n\n\nCitizens United, the controversial Supreme Court decision that ushered in a new era of campaign finance reform, has forced twenty-six states and the District of Columbia to reveal their campaign finance data. The twenty-seven states that did not comply by February 25 must begin releasing their information by July 9, 2020—unless Congress acts to intervene.The deadline for filing returns was pushed back again to June 30, 2020, in an attempt to ensure that corporations and labor unions would still have time to defeat campaign-finance reforms in the 2020 elections. The delay is expected to cost the average American family $2,000 in 2018.5 states are still refusing to provide the data, and some are intentionally concealing their spending. One giant mismanaging corporation, the Aerospace Industries Association, spent $108 million this election cycle to defeat a series of measures that would have required more transparency around spending and fundraising by companies and labor unions. While the Aerospace Industries Group, the company that makes the popular Boeing airplanes, has said that it will comply with the new rules, the Aerospace Industries Association has warned that it will sue to block the new disclosure requirements, and some industries are already reacting", "The next Biennial should take place in 2020. In the meantime, the museum will continue to host cultural events and talks with the same integrity and enthusiasm as they have always done, under the guidance of the same artists and the same extraordinary curators.”\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has appointed John H. Shepard as its next president and CEO. Shepard, who has served as the Hirshhorn’s director of conservations and collections since 2014, will assume his post on January 6.“John’s tenacity, enthusiasm, and vision for the Hirshhorn have been exceptional, and he’s given us the opportunity to experience them as an extraordinary curators,” said Hirshhorn director Mary Anne Carter. “John’s tenacity, enthusiasm, and vision for the Hirshhorn have been exceptional, and he’s given us the opportunity to experience them as an extraordinary curators,” said Mary Anne Carter. “John’s tenacity, enthusiasm, and vision for the Hirshhorn have been exceptional, and he’s given us the opportunity to experience them as an extraordinary curators,” said Scott Horton", "The next Biennial should be held in the fall of 2020, but organizers are currently looking for a new site for the event, which will be held at the city’s Art Institute and will run from March 18 to March 22, 2021.\n\n\nFollowing a week of protests, boycotts, and strikes across the United States as galleries and museums across the country shuttered their doors and engaged in work stoppages, the Museum of Contemporary Art (MoCA) in Los Angeles announced on Thursday that it is continuing with its planned programming, which was held up due to a global health emergency brought on by Covid-19—it reopened in March but only after a costly and hastily arranged reopening of the Los Angeles County Museum of Art (LACMA)—which was slated to take place in the fall.On Monday, the institution announced that it is continuing with the eventually scheduled exhibition “The Ghost of Christmas Past,” but will suspend its other events and is postponing the launch of the museum’s fourth exhibition, “The Lost Art of Christmas.” In a statement, the museum said that the redesign of the museum—which was completed in 2018 and kicked off with the exhibition “The Ghost of Christmas Present�", "The next Biennial should be held in 2021 and will be co-chaired by artist and curator Ali Gharib. The exhibition will also present an edition of works by the Latvian artist Aivaras Karorian.\n\n\nThe Funkhaus in New York has received a gift of seventy-one works by twenty-two artists who were either founded or inspired by the late American artist Marilyn Monroe. The works were donated by the late Israeli-American artist Marvin Hier and his son, Yair, who runs a gallery in Brooklyn, New York, that specializes in modern and contemporary art. The gift also includes works by Vito Acconci, Kamel Moulay, and David Salle. Named after the late pop star, the museum also includes an exhibition of works by artists such as John McAllister, Haim Steinbach, and Julian Schnabel. Other works included in the exhibition are The Best I Ever Saw, 1967–1976, by Julian Schnabel, Woman in the Building, 1977, by Rineke Dijkstra, and Nude with a Cross, 1978, by Charles Schulz.The museum is currently working to restore the work of artist Keith Haring, who died in 1996, as", "The next Biennial should take place in December, the year of the tiger, and will feature a new selection of works by fifty-three artists. The event will be curated by Johannes Bergesen, a curator and curator of contemporary art at the museum.“I’m very excited to be working with the amazing Haider, and excited to bring you the first edition of the Biennial of Leopold and Wanda in December 2019,” said Bergesen. The artist duo is currently collaborating with artist Michael DeGiorgio on a new multimedia installation for the exhibition “Jiro Dreams of a Sculpture,” part of the show “Jiro Dreams of a Sculpture.”Both artists will be represented by LIDEN + HANSEN in New York, and the exhibition will be presented by the artist’s personal collection in collaboration with LINDSEY FOSTER, the German-born curator of contemporary art, in Frankfurt, Germany, and the artist’s Los Angeles studio.\n\n\nThe '60s-based New York–based nonprofit Museum of Modern Art (MoMA) is going to launch a new fund that will support cultural heritage conservation through the collection of historic", "The next Biennial should commence in the autumn of 2021. The theme of the twenty-third edition of the Ballet is “Theater of Excess” and should be selected from the catalogue of the biennial. The fifty-eighth edition of the Biennale will be held in the spring of 2022.The theme of the twenty-seventh edition of the Biennale was “Ostrich Dreams” and was chosen from a list of twenty-six items. The selection included works by three artists who were chosen by the jury as the most deserving of a full-length European Biennial: Rachmaninoff, Amitis Abrahms, and Catherine Miro. The jury also selected three shortlisted artists for their first international performances: Cameron Rowland, David Salle, and Gina Turner.\n\n\nThe Jewish Museum in London is planning to increase the size of its current exhibition space by twenty-five feet. The announcement follows a yearlong campaign to raise $2 million for the museum, which has been spearheaded by its London branch, the National Gallery of Art, and the Metropolitan Museum of Art. The campaign has thus far succeeded in raising $1.75 million", "The next Biennial should be held in March 2021. The museum will be the venue for the first exhibition dedicated to São Paulo, titled São Paulo II: The History of an Experiment, and will host the second exhibition in the series, entitled São Paulo III: The Art of Constructivism, in September 2022. \n\n\nOn Sunday, October 31, the Los Angeles County Museum of Art (LACMA) will host its first retrospective examining the work of American painter and sculptor Frank Gehry. Named After Gehry, the exhibition will be free to the public and will feature contributions by twenty artists. The fourteenth edition of the Contemporary Art Museum Los Angeles (CAMLA) will take place at the museum on December 8–10, 2021.“The future of architecture and design is through architecture and design,” said LACMA director Julie Trech. “I am excited to collaboratively present the work of Frank Gehry, to present his contributions to architecture and design, and to celebrate his legacy.” Gehry, who passed away on December 9, was a leading proponent of the fabrication, installation, and design (I/D) medium, and a leading proponent of the Futurist aesthetic.", "The next Biennial should be in December 2021, with the exhibition marking the centenary of the year when the work was first published. The 2020 biennial will be held at the Paris Center for Contemporary Art (CCA) and will be curated by Simon Mitzevich. The biennial was co-organized by CCA and the Université de l'Huge de Paris. The tour of the venue will also include a presentation of a selection of works by the artist Nadezhda G. Hochreiter (1905–1986) and a presentation of work by the artist Dora Bara (1903–1985). The exhibition will be on view until the end of February.\n\n\nJorge Lorenzo’s rarified Earth: Architecture of Life and Death, 2019, has been selected as the 2019 Turner Prize. The prize was created by Anne-Marie Turner, the former president of the Royal Institute of British Architects, in recognition of her visionary and pioneering work in the field of architecture. The exhibition will open at the Turner Contemporary Art and is curated by John Turner.The artist and architect won the award for his earthworks, which were assembled in the United Kingdom in the late 1990s, in recognition of his", "The next Biennial should focus on ways in which the museum can further expand its digital platform for academic exchange. It should also consider the potential to develop new collections and exhibitions that engage with and reconsider the museum’s collection with the group of European Semiotics’s founding members, the Dutch and French—the UMEA group. And it should consider the importance of engaging with local communities, including in urban settings, in order to better reflect the diversity of Istanbul’s society.“The appointment of Alireza Aslan as the next director of the Biennial Istanbul marks a moment of great challenge for us, as we gaze ahead towards the 2020 edition,” said Alireza Aslan. “Our vision is to showcase the works of the most important contemporary artists in the world, and to build on the breadth and depth of the Istanbul Art Museum. This is the mission that was established by Beyoglu Buzayev, the founder of the UMEA group, and I, as a curator. The museum is in the process of developing a new program of exhibitions, operas, and performances that will also be able to engage with the existing cultural structure, as we strive to create a new, contemporary platform for international", "The next Biennial should take place in the company of a collection traditionally housed in the Museo de Artes [in Madrid], which is currently being renovated and will reopen in the first half of 2020. The museum will also present a new exhibition of works by Japanese artist Ima-moe.\n\n\nThe University of the Arts London (UCL) is facing a major legal battle after it announced it would no longer be able to pay workers at its Tate Modern exhibition space as part of a four-year strike scheduled to kick off on April 5. UCL’s union representing museum workers has accused the UCL of exploiting the uncertainty surrounding the reinstatement of the contract, which is scheduled to run from March 2019 to February 2020, to push through a pay increase that will see museum workers on average see an extra £300 a year in salary.UCL’s director Maria Balshaw said: “This is an unprecedented situation, and we are all working hard to understand how we can live within our means and keep Tate Modern open. We have already made the decision that, in future years, we will not be using the scrapping of the two-year contract as a way of increasing staff numbers, but rather as a way", "The next Biennial should focus on local, regional, and international art and culture and be organized as an extension of the annual Festival. It should also utilize the current exhibition format in order to better engage the local and international art and culture community.” \n\n\nThe Toronto Art Gallery has received a $300,000 donation from the Royal Canadian Legion. In recognition of its contribution to the institution, the museum is giving the members of the oldest and most prestigious service the opportunity to receive a plaque in the museum’s interiors. The organization is also giving the Legion a $200,000 gift for its upcoming biennial, “The Way of the Warrior,” which will be held at the gallery in 2021. The donation is part of a $1.5-billion strategic partnership between the Canada Legion and the federal government. Through the partnership, the Canada Legion is committed to creating new opportunities for the public to connect with and experience Canadian culture through exhibitions, public programming, and the collection of works.The Royal Canadian Legion curators have collaborated with the museum for more than forty years to push forward a variety of themes and designs through the painting and sculpture of works from across the centuries—for example, themes of revolution and transformation in the exhibition", "The next Biennial should take place in the near future. \n\n\nThe National Gallery in London was forced to make a serious safety change after a young woman was severely injured when one of the institution’s carriages was tipped over by a group of up to twenty tourists. The incident occurred on Monday, March 13, at the end of a five-day retrospective of the twentieth century centering around the work of Henri Cartier-Bresson.According to the Art Newspaper, the twenty-three-year-old victim was knocked unconscious by one of the visitors, who were all from the same small European country, Belgium. The woman sustained a fractured skull and is currently recovering at a London hospital. The men involved in the incident are all charged with one count of assault and one count of criminal damage.The incident occurred as the institution was preparing to reopen to the public following a major facelift and make the biennial’s history-making reopening ceremony in September. The cornerstone, which was installed in 1897, was moved to a new site in Regent’s Park. The redesign, which involved the addition of more than twenty new galleries, modernized spaces, galleries, a museum, and a café, has already led to", "The next Biennial should kick off in September 2021. \n\n\nThe Pérez Art Museum in Mexico City is planning to build an exhibition space that will showcase the works of more than three hundred artists from across the country, including a group show by Rubén Vivar, El Mierda, and a solo exhibition by the Mexican artist Claudia Olmedo. The exhibition is to be titled “Next Generation: Art and Politics in the Age of Donald Trump.” The show is being organized by Pérez Art Museum and the Pérez Art Foundation and is being curated by Pilar Soltero, the Pérez Art Museum’s director of curatorial affairs. Soltero told the Art Newspaper that the museum will play an important role in the protest movement as the museum prepares to reopen to the public in March.Soltero said: “We are concerned about the exhibition ‘Next Generation: Art and Politics in the Age of Donald Trump.’ We want the festival to be a platform for creating dialogue between artists and the political system. We are not going to participate in this exhibition if it is organized or hosted by a government that oppresses artists.”\n\n\nArtist and activist Linda Sánchez", "The next Biennial should focus on the history of the exhibition, as well as how it has been affected by the coronavirus epidemic. “It is such an incredible opportunity to collaborate with artists from all over the world in creating works that address issues that touch on important topics,” said Nakoula. “We are all very excited to see what this year’s biennial will bring.”\n\n\nIn a move that will guarantee that London’s Tate Modern will remain open on September 9 despite the Covid-19 lockdown, the Tate has announced that it is reopening on September 11. The announcement follows a series of actions and demonstrations, including a march and rally outside the museum on Wednesday, September 5, that attracted an estimated one hundred thousand people; a show of works by the Tunisian artist Saad Ben Salah, who was killed by police in the line of duty in the UK on Monday, September 4; and the exhibition “Theater of Operations: The Gulf Wars 1991–2011”, a three-hour presentation that premiered at the Barbican Centre in London on Wednesday.Tate director Maria Balshaw said: “Tate is reopening in a moment of great uncertainty for", "The next Biennial should be held in 2022. \n\n\nIn the first major move by the City of New Westminster, the city council has voted to scrap the National Bank Art Museum’s plan to tear down its former location on Royal Street and build a large new exhibition space in its place. The council voted 7–0 on Thursday to move the museum’s collection and research operations to the newly renovated building, which is slated to open in the spring of 2023.The decision means that the pieces in the museum’s collection will reside in the new building for the next fifty years. It also means that when the institution reopens in 2021, there will be two museums, one each in London and Vancouver, with the same permanent collection. The museum’s collection will be relocated to a temporary exhibition space at the new Royal Canadian Legion Hall, which is being constructed on the south side of the museum.According to the city, the new building will be capable of holding up to eight thousand artworks and will be designed in such a way that it will not only accommodate the museum’s collection and research activities, but also provide space for the public to visit the museum, including by appointment. The new building will also feature new", "The next Biennial should be held in the summer of 2020. \n\nThe Shanghai Athenaeum, Shanghai’s largest arts institution, has appointed Peter Ding as its next director. After serving as the director of the Düsseldorf-Stuttgart Biennial from March 2019 to March 2020, Ding previously served as assistant curator of modern art at the Museum Freiburg in Germany, director of the Kunsthalle Basel from March 2013 to March 2014, and as director of the Kunsthalle Frankfurt from March 2017 to March 2018.“Peter is a seasoned curator with over twenty years of experience in the field,” said Zhirong Li, chair of the board of trustees of the Athenaeum. “This is a big opportunity for the museum to re-engage with and take a closer look at the contemporary art scene in China through a museum-like environment. His expertise and leadership qualities will be particularly applicable to our programs in Beijing, Shanghai, and Shanghai’s other cities.”Ding’s new role will begin in February 2020 and will involve liaising with the board of directors and the permanent staff of the Athenaeum, which comprises forty-nine contemporary art museums in China", "The next Biennial should be held in 2020.\n\n\nMicrosoft has released the first officially licensed works of the contemporary artist Kevin Beasley, a.k.a. Queer, an artist who blends media and performance to create a hybrid of surrealism and performance art. The artist was born in New York in 1962 and moved to the Bay Area in the late 1980s.Originally a painter in his early work, Beasley began using computers and video games to create works that blend the art of cinema, sculpture, and performance in ways that are often surreal, experimental, and conceptual. He has since shifted to creating more abstract artworks, often using materials he finds in his personal collection, and has been exhibited at numerous biennials, including the Venice Biennale (2010), the Houston International Film Festival (2013), and the San Francisco Museum of Art (2015).The Museum of Contemporary Art (MoCA), New York: The artist was awarded a Lifetime Achievement Award by the American Film Institute this week. In recognition of his achievements, the institute will offer $10,000 in prizes. \n\n\nThe National Geographic Society plans to spend $1.2 billion to improve its public image and its reputation with the American people, in the wake of a"]