["The next Biennial should be on the ground floor of a new building, in a converted warehouse, and should aim to establish a coherent narrative through the exhibition of works by artists from countries and regions that are currently excluded from the biennial’s program. Dean Burnett, chairman of the Baltimore Museum of Art, said: “We are thrilled to be able to announce that the 2019 Biennial will feature the work of twenty-three artists from the city’s Southeast. The show will feature a mix of the major works of the decade, as well as new work by emerging and established artists, as they continue their journeys throughout the United States and the world. We will have an exhibition space in the new building, as well as a public space in the Museum of Fine Arts to draw the attention of Baltimore’s art community. We are confident that the work of these artists will not only be innovative and original, but will also bring communities together.”\n\n\nThe Museum of Fine Arts (MA) in New York has received a gift of nearly three hundred photographs by the late Italian conceptualist Andrea Bocchino, including his final work “Sanguinare il fondo” (The Picture of a Girl in a Dream", "The next Biennial should be held in 2019 and the 2019 edition will take place in Shanghai. Since the exhibition will take up subjects such as the history of art, politics, and the environment, we expect that the event will be hosted by the Beijer Architects and the Beijer Museum in Shanghai.\n\n\nThe London-based independent arts organization the London-based independent arts organization the London-based arts organization the London Foundation for the Arts (LFA) has announced that it will cease operations at the Tate Modern in March of 2020. LFA’s London exhibition “The Return,” which explored the notion of a European-like Utopia in which art and architecture would be preserved and restored in a way that would resemble that experienced by the Tate and the National Portrait Gallery in south London.The Tate is currently working with architects to reimagine how the Tate could re-enter the city’s skyline and relocate the Tate’s collection. The project is part of Tate’s plans to transform the Tate into a more than 650,000-square-foot museum that will include an annex dedicated to art and architecture and will also include the Museum of the Moving Image and a new site for the Tate’s annual", "The next Biennial should also examine the possibility of staging the exhibition in the capital, which is currently under construction and is scheduled to be completed in 2020. The project, which has been in the works for more than a decade, has faced numerous setbacks and setbacks of late. In March, the city of Barcelona laid off 100 workers, mainly from the environmental protection department, after it was revealed that the institution would be dismantled. In April, organizers announced that the exhibition had been canceled due to the Covid-19 pandemic and would now begin the rehabilitation of the space.Through the partnership with the city, the Biennial will also be able to increase its visitors numbers by 10 percent—it currently attracts around 730,000 visitors a year. The new exhibition, titled “The Future of Cities,” will be hosted by curator and architect María Berrada and will feature some three hundred works that conjure up images of urban environments and urban planning, including some 600 industrial designs that recreate industrial cities, and will include the work of twenty-five artists and will run for twelve months.“The new exhibition will be a platform for the exhibition ‘The Future of Cities,’ in this exhibition, and we hope that it will be a", "The next Biennial should take place in 2021, and the first in 2022. The biennial’s 2019 edition featured work by thirty-six artists from twenty-five countries, with a total budget of $225 million. \n\n\nThe Metropolitan Museum of Art (MoMA) has announced its selection of eight artists for its centennial exhibition, “Art of the Future,” which will run from February 22 to March 8, 2020. The show will examine how art and the humanities have been central to the emergence of new modes of production, the expansion of urban space, and the emergence of new modes of consumption.The artists chosen for the exhibition include Linda and Peter Cook, Eric Fischl and Gere Kavanaugh, Julie Kremer, Lars Vilks, and Otis Redding. “Our artists are among the most important and influential—they define art as their medium and as artists themselves,” said MCA director Daniel H. Weiss. “By taking a truly radical look at the future of art and the humanities, we are becoming more aware of the ways art and the humanities are interwoven and interwoven with each other, to emerge as a coherent force that shapes our environment and shapes our world.", "The next Biennial should take place in 2020. \n\n_____________________\n\n\nArt Basel Hong Kong moved the exhibition “Beyond the Limits” from March 20 to March 22, following protests organized by activists and art collectors in an attempt to address the recent coronavirus outbreak in the region. The exhibition, which was scheduled to run March 15–March 20, has since been postponed. The news comes two days after Art Basel announced that it would donate $35 million to the charities affected by the coronavirus and the meeting of the board of directors of the US artist’s association, Artnet, in New York, where it also announced the creation of a special fund to support artists affected by the virus. The funds will go toward “art-making and performance at an international level,” Art Basel said in a statement. “The work of the artists represented in the exhibition was developed in collaboration with and for the artists of Hong Kong and they were instrumental in growing our international network.”The Hong Kong pavilion will be staged in galleries such as Artangels, Art Basel Hong Kong, and Art Inui, alongside works by artists including Adam Nalbandian, Yoo Jae Suk", "The next Biennial should take place at the Los Angeles County Museum of Art (LACMA), the San Francisco Museum of Art (SFMoMA), and the Metropolitan Museum of Art (MM), and will assemble forty (40) artists in order to consider their work in conjunction with the various biennial programs. The exhibition will also include an online portal. The 2020 edition, titled “The Power of Light,” will open in September.\n\n\nThe Getty Center for Arts and Sciences in Los Angeles has announced that it is raising funds to protect more than one hundred Art Deco buildings on its campus, which is located near the California Institute of Technology (Caltech), from the ravages of a powerful wildfire. The fires have struck structures in densely populated areas of the city, further complicated efforts to understand the fire and its causes.The institution has sent funding to help mitigate the effects of the fire on the Getty’s collection of more than four thousand works by artists, including Mark di Stefano, Ken Jahn, and Laurence BOB for the Children’s Museum, Laurence BOB’s Art Museum, and Friends of the Getty, among others. It is also working with the Getty’s Institute of", "The next Biennial should take place in 2020.\n\n\nThe Geffen Contemporary Art Museum in Paris has appointed Julián Zúñiga director of the institution. The appointment was made on Wednesday, December 20, and consists of a two-year contract. The first Biennial will be held at the institution in September 2022 and will be comprised of sixty artists. The second will take place in April 2020 and will be comprised of fifty-two artists. The biennial’s theme will be “Rethinking the Future: Art in the Age of Black Death” and will be inspired by the work of Pablo Picasso.“Julián has been a pioneer and a visionary leader in the development of the Geffen Contemporary Art Museum at Paris, and he has taught us and each other a great deal,” said Monika Büchli, chair of the museum’s board of directors. “His experience and passion for the museum and his ability to reimagine the museum as a living organism are fundamental, and his vision for the future of the institution is very clear. We are grateful to the board for its cooperation in this process, and for the support we have enjoyed during this exciting and ambitious nine-month process", "The next Biennial should be held in 2020. “I cannot believe that Biennials are being held in 2020,” Katja Wirner, president of the German National Museum, told the Art Newspaper. “I am sure that this current exhibition will be remembered by the jury for the very first time, and will always be linked to the event.” \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is adding more than 65 works by artists from around the world to its permanent collection, including a new exhibition dedicated to the American blues singer Amy Grant. Titled “In the Laughter of Artists,” the exhibition will feature new works by artists such as Kathleen Hanna, Vijay Mallya, Sam Gill, Jaume Gaudí, and Shirley S. Levey, and will be on view in the institution’s new space, the Max & Mira Showroom, from January 31 to March 21, 2020.“We’ve added works by Amy Grant, Lorde, Robin White, Ellen Gjerde, Sara Lynne, Vincent van Gogh, Karl Pilking", "The next Biennial should be held outside of Tokyo in the autumn of 2021. The festival will be held at the Rokodasaya in Chiba, Japan, from September 18 to September 19. Its ten-day event will take place at the O-Sensei Museum in Osaka on September 20–September 21. This will be the first time that the event will be held outside of Japan since the 1970s. The theme of the biennial will be “Disruption and the unexpected.” \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Leila Johnson as its new curator of photography. Johnson will come to the institution from the Museum of Modern Art, where she has served as curator of photography since 2006. She succeeds Vera Lobell, who retired in the summer of 2021 after twenty-five years at the institution.“I’ve long admired Leila Johnson's work,” said Andrew F. Mullican, who has curated the museum since 1978 and was a founding member of the group that selected Johnson. “Her skills, enthusiasm, and vision for photography are unparalleled. I’m excited to welcome her to MoMA.”Johnson is the first curator to helm the museum", "The next Biennial should include the first exhibition to include the works of both designers, the sculptors Helène Delitz and René Magritte, and the architect Hans-Wilhelm Küngen, and should be inaugurated by a new series of exhibitions titled \"Adeline and Helène’s Architecture and Design: From Constructions to Tiles\" (2019–20).\n\n\nLincoln Center will not move forward with the redevelopment of its site in Midtown Manhattan, the New York Times reports. The decision has prompted complaints from developers and preservationists who fear the institution will lose nearly $1 billion because the city’s Department of Cultural Affairs has yet to approve a new building permit for the project, and has also led to outrage from local, state, and federal officials.Called the Neighborhood Reinvestment and Preservation Agenda, the plan aims to renew more than 1,300 existing housing units in the city’s historically black and Latino neighborhoods. Of the 1,300 approved for renewal, 1,500 have yet to open and could be forced to close after the city issued an emergency permit for the construction of a new public housing project, the Henry J. Kaiser Family Foundation (HHF), slated to break", "The next Biennial should take place in the city in December 2022, with a new theme based on the production and collection of art. Simon Li, director of the Shanghai Art Museum, and Wang Jianzhong, chairman of the Shanghai Art Museum, have been appointed as organizers. The announcement of the pavilion’s design drew criticism from some critics for promoting a design which most resembled that of the MGC Group, a Chinese conglomerate headed by Li Yiqian, the founder of the construction and conglomerate construction company MCH Group. The criticism led to the suspension of Li Yiqian’s invitation to the 2021 Biennale, which was opened by the Oligarchs and organized by the MCH Group. The MCH Group’s new pavilion, which was commissioned by the Oligarchs, will be inaugurated in August, with the opening of the first exhibition of the pavilion, “Li Yiqian: The MCH Group,” at the Galerie Lelong in Paris in November 2020.  The ticket to see Li Yiqian’s new pavilion will cost between $4,000 and $5,000, with the possibility of raising the funds through ticket-selling sites", "The next Biennial should feature works by the artist’s group The Suburbs, which was formed in 1972. The Biennial appears to be a reference to The Suburbs’s 1979 film Jules and Jim, which satirized the group’s hippy lifestyle. The theme of the first edition, which was held in Beirut, was “The Suburban Imagination,” and this year’s iteration, titled “The Urban Future”, was written by the artist and was aired on RTL Radio.The first event of its kind in the Middle East was held in Beirut in November 2019, and the biennial was organized with the support of the Her Majesty’s Stationery and Prints Museum in London. The event culminated in the exhibition “The Suburban Experience.” In an earlier iteration of the exhibition, the artist used photographs by Elia Saïd, who also resides in the United States, to illustrate his installation “The Suburban Life.”The work will be on display at the Beirut Museum of Art until March 20, 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of forty", "The next Biennial should be held at the same venue. “We have made a decision to accelerate the opening of Biennial 2 in 2019 and will do our utmost to build on the success of the first Biennial,” said Deborah Bell, chair of the board of trustees of the Biennial Foundation. The restructure will include the creation of a new division of the foundation, the “Joint Art Fund,” which will offer grants to artists who have not yet received a direct grant from the foundation. The program will also introduce a new design competition and the option for artist residencies. The first residency will be held at the National Gallery of Canada in Ottawa in December 2020. The second will be held at the Art Gallery of Ontario in London in December 2021. The third will be held at the Art Museum Toronto in November 2022. The fourth will be held at the Art Centre in Prague in November 2024. The fifth will be held at the Art Institute of Chicago in March 2021. The sixth will be held at the Art of Living Museum in New York in September 2022.The seventh will be held at the Museum of Modern Art, New York in March 2019. The eighth will be held at the Museum of Modern", "The next Biennial should take place in 2022 and will be hosted at the Museum of Modern Art in New York. The exhibition will also include works by artists from other continents. It will be carried out in conjunction with the sixty th anniversary of the Biennial.“We are excited to present our next exhibition at the Museum of Contemporary Art,” said Mark Rubenstein, chair of the board and curator of New York’s Centre. “The Museum of Contemporary Art is committed to providing an exhibition that engages with the themes and artists of our time and examines the ideas of art through the lens of the history of art.”The next iteration of the Biennial will be held in 2020 and will feature works by fifteen artists and will be organized as follows:1. Considered an ‘epicenter of modern art’s emergence in the early 1960s, the Museum of Contemporary Art (MoCA) was founded in New York in 1962 by Jack and Paul Achiel. The Museum has since become an institution dedicated to American art, the home of two of the most celebrated and influential exhibitions of the twentieth century: “Subject and Object” (1963) and “New York in the 60s” (", "The next Biennial should be held in Tokyo in 2022. The 2019 edition, titled “Das Erze der Künstigen,” marked the first time a retrospective of a female artist. The theme for the 2020 edition is “The Expressionist” and the exhibition will be held at the Studio Museum in the City of New York from January 7 to January 9, 2021. \n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles announced today that it will begin welcoming visitors to the institution from January 21 through February 27, 2021. The plan, which will include a number of new initiatives designed to engage with issues of inclusion and disability, including the A.I.R. Gallery for the Arts, the Museum of Honor, and the Fegica House, was made in conjunction with the Shain School of Art’s request for permission to reopen to the public in the spring of 2022.The institution is planning to open two new museums: the Museum of Contemporary Art, Los Angeles (MCA LA), a new urban outpost that will be located in the city’s downtown core, and the Museum of Contemporary Art, San Diego (MCA LA). The new museums will join the existing museums in the", "The next Biennial should be inaugurated by a presentation of the fifty-eighth edition of the show “Presentation at the Museum of Modern Art,” curated by Peter Zumthor. The exhibit will open on September 24 and run through March 29, 2020. The May/June exhibitions will include “The New Arab and Islamic World,” curated by Sabine Haag, and “The Royal Collection: Melanesian Art” curated by Heinrich Himmler.Alongside the May/June shows, the museum will also host a number of residencies for artists and writers. The inaugural workshop, “Art and the Modern World,” will be held from May 17 to May 20. The biennial’s second edition, “A Time to Sit and Think,” will be held from May 21 to May 26. The third edition, “A Time to Stand,” will be held from May 28 to May 31. The fourth and final exhibition will be “The Mummies,” curated by Edward Kienholz, the world’s leading expert on mummy preservation.\n\n\nThe city of New York has introduced new safety guidelines that will require private security", "The next Biennial should be held in 2021.   In the meantime, the exhibition will continue on as planned, with a selection of works that have not yet been exhibited by the Fotopub. Iwona Napolitano, the publisher of Tanya Angel, a biennial of drawings and installations that will be held in Venice in March, said that the museum is confident in its position and that the board of directors and the management team have worked hard to make the Fotopub “a success.”\n\n\n\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Jayawardene Ganesan as its new deputy director for collections and exhibitions. Ganesan will be responsible for overseeing the museum’s collection strategy and strategy for the museums as well as overseeing the institution’s expansion into a new building designed by Gensler & Partners, which will open to the public in 2020.“Jayawardene Ganesan is a visionary leader who has been instrumental in driving the museum’s transformation from a collection site in the heart of Los Angeles into a world-class destination for contemporary art,” said architect Vincent Hornig, who has worked with Ganes", "The next Biennial should be held in the summer of 2022. The exhibition, entitled Borjus’s Flux, will showcase the work of seventy-five artists, including Vito Acconci, Simon Blackburn, Johanna Ackermann, and Hans-Ulrich Abendroth. Commenting on the exhibition, Haruka Fukuda, director of the Biennial, said: “We are very pleased to be able to announce the opening of the exhibition in the September/October timeframe. The exhibition will be a unique experience for the visitors and we believe that the upcoming biennial will continue to be open so that our visitors can have the opportunity to see the work of the artists they admire and to meet them personally. We are confident that this will be an unforgettable exhibition for the Tate and our visitors.”\n\n\nThe Metropolitan Museum of Art in New York has appointed Laura McAllister, a curator and editor at large who has worked in the museum’s Emerging Artists and Art Histories (EAB) initiative since 2014, as its next commissioner. She succeeds David Samson, who retired in December 2019 after a decade with the institution.“Laura brings a wealth", "The next Biennial should be a critical, and perhaps the last, opportunity to see the work of such an extraordinary and valuable group of artists for an extended period of time, with the full range of their achievements and interests represented.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed John Ahearn as its new executive director. He succeeds Linda Rowland, who has served in the position for nearly eighteen months. In his new role, Ahearn will oversee the work of the museum’s current team of curators, artists, and staff, which has the mandate to present work at least once a year.“We are thrilled to welcome John to the MFA,” said museum director Daniel H. Weiss. “John’s background and talent for leadership and vision make him the perfect partner for the MFA as we continue to present work for years to come, and continue to attract and support the artists and collectors whose contributions will continue to shape the MFA.”In his new role, Ahearn will oversee the curatorial team for the museum’s current exhibition program, “The Sculpture from Art” (2019), and its forthcoming exhibition “Harm", "The next Biennial should be held in the fall. The ten-year cycle for the Art in Motion (AIM) series should end in 2020. “2016 saw the opening of three of the three newly-opened Art Facilities at the Museum of Contemporary Art (MoCA), which have been the center of a fierce bidding war for the last four years, and the grand opening of MoCA’s fourth exhibition, ‘Art in Motion: The Art of Art’s New York,’ which opened on December 26, 2016, and ran through the end of March,” said Dina Guggenheim, chair of the board of trustees.“Last year we dedicated $50 million to create a new space specifically dedicated to the study of the Modernist tradition. This year’s restructuring of the institution introduces a new level of engagement with the Art of Motion collections, new programming that will be inspired by the collection’s future exhibitions, and a new program that will engage audiences of all ages with the collection’s work.”Guggenheim added: “In addition to the tangible benefits of the restructuring, the development of our collection, exhibitions, and collection history", "The next Biennial should begin as planned in March 2021 and be in place by the end of the year, and will feature works by eighty artists, including the artists who have participated in the past two editions, as well as several new works by notable South Koreans including Park Si-Hyun and Kim Eun-sung.\n\n\nThe Art Fund, a nonprofit organization based in New York City, has added twenty-eight artists to its global list of twenty-five artists who have recently passed away. The group is comprised of Brenda Akbald (Luxemburg, Germany), Tanya Durand (New York, USA), and Hsin-Chien Huang (Portland, USA), who were all killed by their spouses or partners in the last eighteen months.“We are extremely grateful to the incredible curators who have contributed to our list and to the many artists who have made important contributions to their respective fields over their careers,” said Richard Armstrong, director of the Art Fund. “We are incredibly grateful for the work of the artists whose stories and work we have chosen to honor in this way; for their tremendous dedication to their craft and for their imaginations. We are especially grateful for their realization of their artistic commitments in the face of", "The next Biennial should take place in the autumn of 2020 and will be presented by the Düsseldorf-based Cultural Center BÜMUSE (Center for Contemporary Art in Germany) and will consist of eleven exhibitions. The exhibition will also feature a new drawing that will be based on a new sculpture by artist Erich Albrecht (Künstlerhaus BÜMUSE).“Laboratory for the Realization of the Imagination has always been the subject of great interest for me, and I have been active in its development for many years,” said Mr. Albrecht, who is known for his experimental and experimental art in his studio in Bonn. “I am very pleased to be able to present these works at this great museum. They will be included in the upcoming exhibition ‘Culturelands Hamburg,’ which has been planned for September 2019.”The works that will be included in the exhibition are: Carlos Campos’s The House of the Sun, 1960, which is a composite architectural and landscape work depicting a prehistoric prehistoric village and the sun; Klaus Marin’s work The Small Island, 1948, which", "The next Biennial should be a tribute to the tenacity of the artists, whose work is held in common with the international and contemporary art of the twentieth century. The exhibition should celebrate the latest developments in both the contemporary art and performance worlds, and should draw from the biennial record. Tominoko's exhibition “On the Road,” which opened at the Brunei Biennale’s first edition in 2002 and was in turn inspired by a book on travel written by A.J. Paxton in 1957, is also an exciting addition to the Biennial. The award-winning artist, known for his experimental and emotive paintings and sculptures, was nominated for a $20,000 prize for his work, “The Carpet,” which is currently on display in the exhibition “Art of the Next Century: Contemporary Art from the Last Century” at the Sakhalin Museum of Art. The Biennial’s thirty-fourth edition, which will open in December 2020, will include twenty works by thirty-eight artists from twenty-six countries.The biennial’s winner, Tilda Swinton, will be presented with the award at a ceremony at Brunei’s invitation-only exhibition", "The next Biennial should be held at the Museo de Arte Contemporáneo, in Madrid, in 2021.\n\n\nAs the United States enters its final phase of its presidential election campaign, the National Labor Relations Board (NLRB) has temporarily suspended the election of union-busting artists. The board voted to remove four artists from the list of twenty-two employers who had voted to unionize, but not to authorize election of union members. The four were the activist Georgia O’Keeffe\u0097who stepped down from the board in March after she was elected to the Senate in Georgia\u0097Maria Berrio, Anna-Marie Olms, and Dara Vance.“We are fully aware of and in favor of the workers who are organizing, and we are open to the ideas and the proposals of those who are interested in supporting the workers organizing,” board chair Ellen S. Binnall, a New York City native, said. “But we have to follow the law.”The union-busting artists were not disciplined or fired, but they were placed on administrative leave pending the outcome of an investigation, which will determine whether any illegal activity took place. The board, which will meet", "The next Biennial should take place at the Museum of Fine Arts, Boston in the spring of 2021. The exhibition will be staged in a hybrid of a museum and a performance space, with the artist- and curator-run project space the Biennial. A history of the exhibition should be listed on the museum’s website. The show will feature works by seventy-three artists in twenty-four categories. The first exhibition will open on January 21 and run through March 29. The second exhibition will open on March 28 and run through April 21. The third and final Festival will open on April 9 and run through April 10. “The Biennial is about collaboration and community, about the universal possibility of art, and about the historical relationship between museums and the people who represent it,” said museum director Matthew Crawford. In addition to selling art, the museum has partnered with local tenants in order to connect with and support the artists whose works are featured in the exhibition. In the last twelve months, the museum has found ways to connect with artists and venues through the purchase of works, through donations of works, and through partnerships with artists in order to support the artists who have given their works to the Biennial. The Central Library of Art", "The next Biennial should take place in 2020. The 2019 exhibition was the first by the new National Agency for Contemporary Art (NACA) which is led by Christopher Woolf, and was organized by the Danish curator and critic Fatos Šakst. Šakst’s exhibition “Annie.” will be staged at the Nathan Cummings Center for Art and Design (NCCAD) in New York, the Whitney Museum of American Art, New York, and the Metropolitan Museum of Art, New York, and will run through September 25. In a statement, NCCAD said: “The agreement is an important step towards fully realizing the promise of the Biennial and a reflection of our values as a community. Therefore, we are very pleased about it and look forward to supporting the work of the Biennial with an exhibition of the work of the Biennial’s artists and the artist community in 2020.”The exhibition will be curated by Karen Johnson, director and CEO of NCCAD; Tom Goldman, artistic director of the Whitney Museum of American Art; and Mike Kelley, artistic director of the Metropolitan Museum of Art, New York.\n\n\nThe Museum of Contemporary Art (MoCA) in New York", "The next Biennial should be a reflection of the inter-connections between the world and art and the history of humanity, and should explore the fundamental questions of life and death. It should also reflect the challenges and possibilities that art offers to us all, and how art can help us live our most meaningful lives.”\n\n\nManchester City Council has removed a controversial £3 million ($4 million) sculpture by artist David Nelson from the city’s Picasso’s wall. The controversial monument, made of a series of six black-and-white photographs of the artist’s famous “Ascension ” sculpture, was recently moved to a new location and its final performance of the week-long event, which is the city’s largest public art project, was canceled.“Culture is life, and when we lose art, we lose it all,” Nelson told the Art Newspaper. “It is the duty of the city to protect it, and to work with the artist to find a new permanent home for the sculpture. In the absence of a new site for the sculpture, and with the renewed confidence that the work can be safely relocated to a museum, I hope that the public will support its", "The next Biennial should take place at the International, the Museum of Modern Art in New York, and the Museum of Modern Art in Chicago in 2021. The option of a second edition of the fundraiser was discussed last fall, and a decision was made this spring. The 2019 edition, titled “Theos,” was held at the Yuz Museum in Beijing. The event celebrated the rebirth of Greek and Roman philosophy.\n\n\nIn a resolution adopted by the United Nations General Assembly today, the 193 member states of the Association of Museums and Collections of Modern Art declared that they “acknowledge the rights of individuals and entities to decide whether or not their historic sites, places of worship, and monuments should be excavated,” and that most of the world’s heritage sites are “unsuitable for development, excavation, site-specific construction, or site-specific use.” The resolution, which was adopted in the wake of the global health crisis, reiterates the Union’s stated goal of creating a Universal Declaration of Human Rights, which would address key issues facing the world’s heritage sites and serve as a roadmap for advocacy and conservation efforts.“We repudiate the current situation and current harmful", "The next Biennial should focus on issues of innovation and creativity, the performance and the art, as well as its impact on our lives and the world. The 2019 edition will take place at the new building at the Zentralarchiv für das Bundes in Frankfurt, Germany, and will feature the works of more than sixty artists from thirty-eight countries and territories. Artforum will present the Biennial in conjunction with the European Film Festival, which will take place at the same venue in June. \n\nThe Museum of Contemporary Art (MoCA), Los Angeles—The institution opened to the public in 2017 and has been relatively steady since, with only minor expansions. Inaugurating the Contemporary, the exhibition was a reimagined version of the artist’s workshop, which was held at the Museum of Contemporary Art from 2008 to 2012. Since then, the institution has expanded the contemporary art museum with thirty-two new galleries, including the first in the United States to have a permanent collection of Soviet artist Aleksandr Serov, whose work was featured in the first show dedicated to him at the Museum’s renowned Kapp in 2011. In 2017, the museum faced backlash over the response to the death of George Floyd,", "The next Biennial should be in the coming months. More information about the project and the upcoming exhibition can be found on the Biennial’s website.\n\n\nThe Foundation for Contemporary Art (FCA) in New York has appointed Stephen J. Tashima as its next executive director. Tashima currently serves as the director and chief curator of the Museum of Modern Art in New York and is the founding curator of “World Cinema” (2015–16), a multi-disciplinary exhibition that explores the history of cinema and the 25th anniversary of the film’s debut. His curatorial practice spans film, theater, performance, video, photography, art, and design.“We are thrilled that Stephen has joined the FCA family and the incredible staff and we look forward to welcoming him to the organization,” said Gilad Kertulsky, chair of the board of trustees. “We are confident that Stephen will bring to the FCA and the Museum a variety of new and exciting perspectives, both at home and internationally.”The FCA was founded in 1960 by George Lucas and Orlando Bloom to support the development of work by African American and Latinx artists in the United States. Since its founding, its", "The next Biennial should aspires to consolidate, to make a new, and to deepen the existing historical and biographical information in order to produce … a new work on the life of a certain woman.” The festival will be held in May 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of twenty-six works by American painter Nell Doran. The gift includes eight works on paper, including a series titled “Out of the Sky” (1927), which was inspired by Doran’s experiences growing up in Brooklyn, New York; “The Sun Goes Up and the Earth Goes Down” (1929), a collage that features hundreds of images of clouds and stars; and “Daydream: A Modern Artistic Experience” (1927), which combines two images from Doran’s “Blackbird” series, a series of paintings that were inspired by the work of the late American artist Walter de Maria.The works will be presented in the exhibition “Nell Doran: Out of the Sky” at MoCA’s inaugural museum event, “Symphony of Clouds and Stars.” Dor", "The next Biennial should begin in May 2020, at a date yet to be announced by the organizers.\n\n\nThe Royal Academy of Arts (RA) in London is holding an emergency discussion on the climate emergency and the Royal Shakespeare Company (RSC) in the United Kingdom is preparing to cancel its spring 2020 season. Both events were scheduled to run from March 17 to March 19. The RSC is a nonprofit organization that contributes approximately $2 million annually to the UK’s arts. The academy’s director, Joanna Meares, said that the upcoming season is “of critical importance to many of our artists and our audiences. The RSC Museum will not be able to accommodate the growing numbers of people who want to see the works of contemporary artists and to attract new audiences.”The Royal Academy of Arts (RA) will not be able to relocate to a new location that would accommodate the growing number of people who want to see the works of contemporary artists; the RSC is currently working on a new home for the academy, which has a permanent collection of more than 550 works. The institution’s new campus is currently being designed by the London-based firm Foster + Partners. The academy is currently working with MINE Architects", "The next Biennial should be held in 2021. “In the past, we have fostered and empowered artists through the generosity of our partners, and we are confident that the new partnership will deliver in delivering an artist-friendly experience for our visitors,” the festival said in a statement. The event will also feature an exhibition of work by forty artists and collectives\u0097including Ewa Delgado, Peter Cossu, and Michelle Cilento\u0097and will run for three weeks.The twentieth edition of the biennial was held in San Francisco from November 2016 to March 2019. The event debuted at the San Francisco Art Museum in January 2019 and was inaugurated by author and curator David Adjay.  This year’s event will focus on the “last remnants of the late American West,” defined as that region encompassing the Sierra Nevada, the Yucatan Peninsula, and the Andes. The first half of the biennial will feature works by thirty-four artists, including Adam Dever, Sylvia Enroth, and Merry Lloyd. The second half of the event will feature original presentations by fifteen artists; of these, Lisa Hausmann, Nancy Lieberman, and Fiona", "The next Biennial should take place in 2030. The next event should take place at least fifteen years from this point. And lastly, the next Biennial should take place at least fifteen years from this point. What exactly constitutes a 'next Biennial'? The Chinese government is being criticized for attempting to push an open-ended timeline for the ten-yearly event. When asked about whether Beijing wished to postpone the event, the Chinese Foreign Ministry spokesperson, Qin Gang, said: “The local leadership has made clear that the theme of this year’s Biennial is to reflect the spirit of the twenty-first century.”\n\n\nThe Michael Rosenfeld Collection at the Metropolitan Museum of Art in New York has appointed Christopher Landon as its next director. Landon comes to the museum from the Museum of Modern Art in San Francisco, where he has served as a professor of art history and of modern art for the last two years. He succeeds Ben Horowitz, who retired after two years at the helm of the Met last month.“We are thrilled to welcome Christopher to the Met,” said Met director Thomas Campbell. “In his tenure at the Met, he has developed into a very capable curator who has", "The next Biennial should take place in 2020, when the first exhibition of work by a single artist in over twenty years will reopen at the museum. \n\n\nThe Library of Congress has released the biennial “The Black Madonna” (The Black Madonna: Jewish Art and Black Jewish Art) as part of its “Plagiarism and Piracy” series, which aims to highlight the work of black Jewish and European artists and to debate whether the term plagiarism can be applied to non-European works. The award jury comprised Bernard Fontanier, associate curator of art history at the Museum of Modern Art; Jean-Luc Bourguignon, author of Revolting Camp: Black Jewish Art in the Early Modern Period; and Douglas Feder, a senior fellow at the A. Louis A. Russell Center for Jewish Studies at the Jewish Theological Seminary in New York.The museum has previously honored David Byrd’s The Visitor, 1995, for which he was awarded the Silver Lion for Adaptation. The statue was created in collaboration with the German and Austrian artist Heinrich Hoffmann, who is best known for his “Miraculous Landscape” series, in which", "The next Biennial should be held in 2022.\n\n\nThe National Museum of Women in the Arts (MMFA) in Washington, DC, has received a $10 million donation from the Sargent and Whitney families. The gift comes on the heels of the museum’s announcement that it will gift $50 million to local arts and cultural organizations by the end of 2020. The total sum for the next two years will be $120 million, and the gift will be divided between the museums.The gift was made during an official visit to the museum by Prince Harry, the Duke and Duchess of Cambridge, to mark the Royal Anniversary, and the museum’s first-ever museum exhibition featuring a work by the artist Martin Leeming.\n\n\nThe National Gallery in London is cutting seventy-nine jobs and reducing the length of its board of trustees and its overall working hours. The institution’s financial backers, including the Sargent and Whitney, announced the plans in April, shortly after London mayor Sadiq Kahn’s controversial plan to cap immigration and clamp down on criminal gangs. The reinstitution of a cap on immigration in April 2019 followed a wave of resignations and strikes across the United Kingdom over the next two years, and was seen", "The next Biennial should take place in New York in 2021. The next edition will focus on contemporary art and will be hosted by the Museum of Modern Art.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has released the list of seventy-five artists who will participate in its next iteration, titled “Unclos,” which will open on May 19. The seventy-sixth will take place in 2021. Dubbed a “festival of visions,” the event will feature work by seventy-three artists and will showcase new work by thirty-four artists.The twenty-fifth iteration of the biennial will be hosted at the Museum of Modern Art from April 15 to April 23, 2020. The exhibition will also include an exhibition of work by thirty-nine artists, including Klaus Hütte, Catherine O’Donnell, Dorian Owens, and David Salle, as well as a retrospective of work by twenty-six artists of color.The biennial’s 2020 theme is “The upcoming limitation: our capacity to change.” The exhibition will also include a chapter on the history of the exhibition and will include a new work by artist Rebecca Black. The book, �", "The next Biennial should be held in December 2020.\n\n\nGerman artist and theorist Dieter Reimer—whose work explores and extends the boundaries of narrative art—has died at age seventy-nine. The artist was born in Stuttgart, Germany, in 1935, the son of an American air force officer and a German woman heiress. Reimer attended the Academy of Art in New York and then the School of Art in Hamburg, where he studied under designer Karl Lagerfeld. Reimer moved to New York in 1941, where he met architect Roy Lichtenstein, who was also an air force officer. Reimer married the young architect in 1948, and the couple had four children after the couple divorced in 1950. In the early 1950s, the couple returned to Germany, and in 1967, the year after the death of Lagerfeld, Reimer began to explore the limits of narrative art, which he described as having no beginning and no end.In the 1970s, Reimer and Lichtenstein collaborated on a series of projects, the most recent of which, “Herman and Dieter Reimer: A retrospective,” which was held in Berlin in 2011. The exhibition was was curated by Lotte Gaillard,", "The next Biennial should include a keynote address by philosopher Ilana Hoxha, director of the Institute for Advanced Study in Art History in the Faculty of Arts of the French University of Toulouse, the School of Fine Arts in the Faculty of Arts of the National University of Athens, and the Graduate Center in the Faculty of Arts of the University of Pennsylvania. \n\nKate Middleton, the Duchess of Cambridge, is facing a legal complaint from a former employee at the Royal Shakespeare Company in London over allegations she misappropriated funds, reports The Guardian. The employee, who was a student at the institution in the 1980s, alleges that she was paid between $500 and $1,000 for her work on behalf of the royal family. According to the Daily Mail, the former employee alleges that her superiors at the London outpost of the Bard called her a “doting wife,” “a dedicated mother,” and “a reliable partner.”The incident occurred when the employee was working as a backstage assistant to the royal couple at the Hammer, which was then run by the Royal Shakespeare Company. In 2012, the company settled with the former employee for an undisclosed sum. The Bard staged a royal production of Julius Caesar at the", "The next Biennial should be held in March 2019, with the exhibition to be staged in Helsinki in March 2020.The auction houses will remain closed until March 29. Despite a run of four consecutive years of two exhibitions each, the catalogue will not include works created by the architects, who are long-time collaborators, including Grant Emmett and Hans Ulrich Obrist, who collaborated for more than thirty years on the project, and the catalogue will not include some 20,000 personal belongings that were confiscated by the authorities during the raid and returned to Switzerland last spring. The exhibition will instead feature more than two hundred works by the two founders of the company, Frauke Petzold and Andrija Palka.In a statement to the art world, the auction houses said: “The biennial will not conclude in the foreseeable future. As the art world works through its own ordeals, we have decided that it is best to focus on the future and the exhibition as a whole. The exhibition will continue as planned, but the catalogue will be put on hold for a while and will also be presented in the next Biennial.”\n\n\nThe Asian New York Art Biennial, which kicked off on Wednesday and runs through February 26, 2020,", "The next Biennial should be held in the first quarter of 2021, the organizers said. It will be led by the same organizers as the previous one and will be held at the same location—the Chinese Academy of Arts in Beijing. The first exhibition will focus on the theme “Art and Human Reproduction,” and will be held in the fall of 2020.\n\n\nThe Danish government has released a new set of guidelines for Danish artist Lars-Ina Faivre, who has been incarcerated in a Danish prison for more than twenty years for violating Denmark’s new anti-terror legislation. The guidelines, which were drafted in response to a new set of guidelines issued by the Norwegian Ministry of Foreign Affairs in March, state that the Danish government will not extradite Faivre to Norway, and that any negotiations over the artist’s release should be conducted in Danish.“The Danish government has worked hard to create a climate of respect for freedom of expression and the rule of law,” Faivre said in a statement. “I’m very pleased to see that the guidelines are being implemented in practice. . . . I hope they become a model for Denmark and other European countries to follow.”The guidelines", "The next Biennial should take place by the end of the year, and then will be rescheduled. “I was confident that we could make it through this crisis together,” said Nari Ward, director of the Arts and Culture Group at London’s Serpentine Galleries. “As the crisis developed, so did the creativity and energy of our talented artists and staff. It is essential that we keep going and keep pushing forward. It is essential that we find new ways to engage with the world around us, to have a positive impact on the world around us.”In an interview with the New Statesman last week, Ward said that the arts and culture sector’s role in mitigating Bristol’s COVID-19 crisis is “helping us create a new kind of future for the city.”\n\n\nThe Whitney Museum of American Art in New York has announced that it is preparing to welcome visitors back to the institution in a month or so, following a temporary closure due to COVID-19. The upcoming exhibition “Time for Change” will be held in the museum’s new building, which is currently undergoing design and construction, on December 9–12, 2020. It", "The next Biennial should take place in 2022.  Artforum has invited authors to present their next project for the exhibition, which will be hosted by the London-based exhibition space Ingo Swallow. The first masterworks on display at the exhibition will be “Moschino”--made in 1928 and sold at a time when the artist’s work was still being produced--and “The Fairy-Land” (1927), a work made in the 1930s and a collaboration between the artist and the artist’s son. Swallow will be drawn from the “Story of Man” duo series, which he first curated for the Biennial in 2013. Swallow will first present his exhibition “Myths and Perceptions: ‘Forms in Space.’” The series will take up issues of form and its relationship to contemporary life.The exhibition will also introduce a new manuscript format that will include selected works by forty-eight artists in Japan in a new chapter titled “Art: The Story of Everyday Life” curated by Cira Venuti. During the event, William S. Burroughs will be interviewed by Artforum editor in chief Ben G", "The next Biennial should take place in the city of Oneonta, in the Black Sea region of the Republic of Moldova. The first biennial—which will be hosted by the Government Museum of Modern Art in Moscow in January 2021 and be followed by the Museum of Modern Art and the State Museum of Arts in Nizhny Novgorod—was created in 2008 to promote the theme of modernity and the future. The theme of the upcoming event is “Living in Order,” a translation of a line from the Russian poet Yegor Gusev\u0097who often spoke of the pragmatic, not the ideal. He wrote: “I don't think the kind of a cultural event where the artists and designers come together, where they displace each other and always meet somewhere else, can be held. I don't think art, as a cultural movement, can be organised like this.”\n\n\nAn exhibition of works by the Paris-based collective Solveig Berlin (SAB Berlin) is scheduled to open at the Museum of Modern Art (MoMA) in January 2021. The eight-thousand-work collection, comprising paintings, drawings, prints, posters, photographs, sculptures, and installations, will be presented", "The next Biennial should be held in October 2020. The initial exhibition will feature works from the group exhibition series, which also includes works by Michelangelo Antonioni, John Cage, Jean-Michel Basquiat, Kurt Weill, and Daisuke Tsuda.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is expanding its ten-year partnership with Zendesk. Beginning in December 2020, the institution will receive direct financial assistance from the Swiss digital art company for the cost of hosting a new exhibition, “Art in Motion,” which will take up the theme of a century of environmentalism and art history in the construction of a new museum.The partnership’s series of exhibitions will run from January 4 to March 21, 2021. During the lifetime of the exhibition, MoCA will engage with artists and activists from the Sierra Club, the United Nations, and other global organizations.The partnership’s inaugural exhibition, “NIRIN,” is a 360° panorama of twenty-five works. The show will feature work by twenty-five artists spanning a number of disciplines. The group exhibition will highlight the work of fifteen African American artists who have", "The next Biennial should be held in 2022. The museum will then be allowed to move forward with plans to resume construction, but only with the approval of the local and international authorities.“We are now at a critical juncture and need to act quickly to avoid the disaster that is unfolding,” said Pilar Cornejo, director of the Museo de Arte Contemporáneo in Madrid and vice president of the Biennial. “We have tried to mobilize the public, and we will continue to do so, but the current situation demands we act in concert.”Along with the threat of a construction accident, Madrid’s mayor, Isaias Jónsa, announced that the city will shut down all public activities until at least March 11, when construction workers will return to work. As of March 10, the city had already shuttered twenty-six metro stations and is planning to shut down the city’s seven-mile stretch of Alhambra Boulevard.The city of Barcelona, meanwhile, has shuttered all of its six major museums, including the Palazzo del Prado, the Santa Maria de Alvaro, the Santa Marta de Alvaro, and the Santiago Municipal Palace", "The next Biennial should take place in 2020 and is being organized by the UNESCO-designated Museum of Tolerance, the Museum of Contemporary Art, New York. The first show in the series will be a presentation of the work of the late painter-activist Guedjulainen Tengo, the founder of the family-run Tengo Gallery.Tengo’s work will be included in the second exhibition, which will take up the themes of memory and the body, in 2022. \n\n\nMegan McArdle has issued a public apology for labeling the American painter P. K. David, whose work is currently exhibited at the Art Institute of Chicago, an “extremist” and a “precursor” in a New York Times column published on Monday.“I want to express my regret and apologize for using a racist term to describe David Kapan,” McArdle wrote. She also acknowledged that the term was out of place. “I made an error in not including the context in which I used the term extremist,” McArdle told the New York Times, “which was when I was talking about the ‘cultural Marxist", "The next Biennial should be held immediately. “This year’s exhibition was especially challenging, given that it was held before the pandemic began, and its production was hindered by the result of a legal case brought by the artist,” said Konstantin Krupukhin, the director of the Slepang Museum in Moscow.  “The festival is not only an important historical document of the twentieth century, but also an important vehicle for the work of the artist. The exhibition, together with the exhibition of the artist’s work in the center of the city of Saint Petersburg, was an expression of the cultural and spiritual life of the city.”Since the exhibition, titled Bubonovski jestoba, or 'tarantino trees,” was organized by the Museum of Modern Art in the Russian capital in March 2019, the exhibition was canceled in March 2020. It reopened in March 2022, however, and was cancelled again in March 2022. The museum announced in March 2018 that the exhibition would return to the city of Saint Petersburg in March 2021.\n\n\nThe US House of Representatives voted yesterday to approve a $2 trillion stimulus package to combat joblessness and inflation caused by the coron", "The next Biennial should take place in 2022, with a fiscal year 2020 reopening date. Robust programming for the event’s 50th anniversary will be announced in 2020 and the event’s 2018 edition will be staged in 2021.\n\n\nThe National Museum of the American Indian (NMI) in Washington, DC, has appointed photographer Marisa Baccus as its next executive director. Baccus currently serves as a curatorial assistant at the National Gallery of Art in Washington, DC, and is working on a book on Native American women.“The appointment demonstrates the museum’s commitment to addressing the complex legacy of the institution and our nation’s history,” said museum director and CEO Gavin Brown. “Marisa shares our vision of the National Museum of the American Indian as a new center for American Indian history that engages in critical scholarship through the exploration of the enduring legacy of a single female artist, Nancy Kamee. She is a visionary organizer and is uniquely positioned to elevate NMI’s mission and future growth in the direction of intersectional, feminist, and anti-racist politics.”Baccus will assume her responsibilities on August 9. She succeeds Carol Brown, who has served as", "The next Biennial should take place in 2021, according to Curator-In-Charge Yang Han and director Hua Rui. Two other pavilions, Art in Transition (2019) and Representation of China: Taiwan (2020), will be curated by Yang Han and Hua Rui in 2022 and 2024. All three pavilions will be located in Shanghai. \n\n\nThe Diadem Museum of Art in London has commissioned artist Richard Avedon to create a new work for its new exhibition, “Richard Avedon: The Diadem.” Originally scheduled to open in January 2020, the exhibition will now focus on Richard Avedon’s pre-1949 paintings, which are currently on display in the museum’s newly refurbished gallery, which opened to the public in the spring of 2019. The exhibition opens to the public on October 4.“The Diadem’s work is an attempt to address a long-standing and important philosophical question: what constitutes art and what is art? A series of three works that will be exhibited in the gallery will address this question; the first exhibition will open in January 2020, the second in March 2020, and the third by", "The next Biennial should be in 2021. The newly elected UNESCO director-general will be announced after the conflict ends in 2023.\n\n\nCoachella Valley Music and Arts Festival in Indio, California, will no longer take place in 2021, due to concerns over the coronavirus. The 2019 edition, which was held at the Los Angeles County Museum of Art (LACMA), was canceled in part due to the coronavirus. “We have been working with the LACMA Foundation for a number of years to work with the coronavirus to bring our 2019 event to you,” said festival director Michael H. Grubb. “I wanted to thank the staff and the Los Angeles County Museum of Art for their understanding and cooperation throughout this process, and to acknowledge their tremendous dedication and hard work.”The decision to cancel the show was made in part due to the co-ordination of efforts between the US Centers for Disease Control and Prevention (CDC), the World Health Organization (WHO), and the US Food and Drug Administration (FDA). The assaults on the coronavirus began on January 6, when the CDC issued a public health emergency declaration, and continued on March 7, when the agency said it", "The next Biennial should be held at the V&A, London, in 2022.  Author and curator Petra Wolf, who curated the inaugural exhibition, has called this year's edition a “transformative, unexpected journey.”\n\n\nThe Tata Museum of Art in India is planning to close the doors of its two-hundred and fiftieth-anniversary exhibition, “Buildings in India” (2018), to allow more space for the institution’s new exhibition, “The Future Is Present: Indigenous Scholars and European Art.” The announcement follows a wave of protests against the Tata Museum’s decision to close its doors, which were sparked by a survey of contemporary art by Talia Mogg, a curator at the Tata Museum, which opened in New Delhi last month.The decision to close the show coincided with a wave of anti-Tata’santi-Discussions, an online publication that has focused on the history of Indian art and, in the past, has been a platform for artists to confront the museum’s connections to colonialism and colonialist policies. “Nearly a thousand artists have signed our petition,” said Mogg. “In response, the Tata", "The next Biennial should be called for the twenty-second year in a row, and will be held in 2020. The theme will be “New Life in the Image of God” and will focus on the unity of life and the image of God. The opening of the biennial will be marked by presentations of works that are created with love and that express the unity of life and the image of God.“In a time when science and technology, and innovation and economics, threaten the future of many cultures and nations, it is a constant companion of art that we seek to create social and ecological bonds between people and the environment,” said Dr. Dieter Zetsche, chairman of the biennial’s organizing committee, in a statement. “The future of the biennial is at stake. Humanity has the responsibility to shape the future of the planet, and we must do so with care and consideration. We hope that the artist-run exhibition will help to make this possible.”The 2019 edition of the Biennale of New York, which featured works by artists such as Catherine O’Donnell, Anthony Dolan, and John Paul Getty, went on to win the 2019 Pulitzer Prize in criticism.\n\n\n", "The next Biennial should take place in 2020 and will be hosted by the wealthiest museum in Asia, the National Museum of Fine Arts, Singapore. \n\n\nThe Allen Memorial Museum in Atlanta has received a gift from the late collector Allen Julius Allen. The gift includes a trove of unreleased works in the artist’s original series, X Factor, that he donated to the museum in 1988. The works were included in the collection, which includes works from the Tate and the National Gallery of Art, and are currently on display in “The Man Who Plucked the Sun: The X Factor Collection,” which opened on March 3.The gift comes at a pivotal moment for the collection, as the museum plans to introduce a new exhibition in honor of Allen’s life and legacy. The new show will feature the works of eighty artists in the exhibition, which will be organized in the same way as the show itself, but will be set in a contemporary art museum and will take up themes of philosophy, design, philosophy, and architecture.“The future of the Allen Memorial Museum is within our grasp,” said museum director Terrie Symonds. “I’m thrilled to support the Allen Memorial Museum as it continues to", "The next Biennial should be held at some point in 2021.   \n\n\nThe last major exhibition dedicated to the art of subversion, art demolition, and sabotage took place in New York in 1978. The show, titled “Power Politics” and held at the Warhol Museum in Connecticut, featured over twenty-five works by the late Soviet dissident artist Andropov, who was imprisoned for his political views and for his activities in the ongoing struggle against government tyranny. The show won a total of $115,300—dubbed the “Miracle on Ice”—and was the largest art event of the year.Subversive: The Art of Deconstruction was organized by the Committee for Deconstruction of the Soviet Union and became the first major retrospective dedicated to the art of subversion, demolition, sabotage, and violence. The show, curated by Vladimir Gorbachev and titled “Art of Destruction,” opened on March 8, 1978 and ran through December 31, 1978. The legendary artist Andre Gide, who had been imprisoned for maliciously attacking the new Soviet government with an attempted coup d’état, was present at the exhibition and participated in the proceedings. The exhibition, which had previously been", "The next Biennial should take place in 2020, with the hopes of opening the exhibition in 2022. \n\n\nArtizan Gallery, the high-end contemporary art museum in the capital of Azerbaijan, has appointed Rasheed Alireza as its new director. Prior to joining Artizan as a curator of Persian art in 2015, Alireza worked as a curator at the Museum of Modern Art in New York and as an assistant curator at the Museum of Modern Art, where he curated “Art of the Persian Middle Ages” (2016), “Zoroastrianism” (2017), and “Ali-Qaradze Gallery” (2018). He will now take up the post of director of the museum.“Rasheed is a gifted and talented organizer who has built his own reputation as one of the most effective organizers of an exhibition program in the history of the museum,” said director Maria Shirov. “I’m looking forward to working with Rasheed, his team, and to building on his achievements as a curator.”Among the exhibitions that will be presented at the institution are “Muhammad Ali: Promised Land” (2019), “G", "The next Biennial should take place in 2020. New York’s Museum of Modern Art, which celebrated its fiftieth anniversary this year, will open its new headquarters in mid-March. \n\n\nThe Guadalajara-based nonprofit Centro de Artes Mille Temps (CAMT), which aims to provide support and resources to Mexico’s visual arts, is launching a new fund designed to help artists and small to mid-size galleries in the country. Called Artes Mille, or the Path of the Artist, the initiative aims to “provide a platform for the enrichment of the cultural and creative life of Mexico City’s Guadalajara region,” a region that includes Sinaloa, Michoacán, Santa Fe, and Santa Fe, and has been dubbed the “Silence of the Desert.”The fund will be managed by the Guadalajara-based artist, curator, educator, and writer María Berrío, and will launch with a series of exhibition spaces organized by artist Francisco de Queiroz, who is also the founder of the Guadalajara art-activism organization Colectivo Nacional. The first exhibition will be", "The next Biennial should include a lecture given by Christine Cioffi, a professor of art history at the University of Trento, Italy; a painting by artist Pablo Picasso; and a film by Austrian filmmaker Werner Herzog. Tacita Vikram, the patron of the annual event and a former chair of the curatorial team, said: “The space of Artforum is currently being developed. It will be a surprising and exciting moment when the first exhibition of this kind is presented. I hope that this year will be an occasion to celebrate the extraordinary achievements of the new curators and to strengthen the Curatorial team as a whole through a new generation of great curators.”\n\n\nThe Somerset House Foundation has announced that it has received £10.5 million from the sale of private collections and more than $12 million from the sale of works by artists who were important to the region and to England. Prominent among the artists whose works will be included in the first exhibition at the new residence are Alfred Stieglitz, a German surrealist whose work is included in the “Somerset House Documenta;” and the artist-in-residence, David McAllister, whose work is included in �", "The next Biennial should be held in the spring of 2021, according to the organizers. The biennial will include more than 150 works from more than 250 artists from thirty-six countries.\n\n\nThe New Museum in New York has received a $150,000 donation from the Pritzker Prize. Fellow artists Jen and Paul Perrone, who have worked together since the 1980s, were chosen as the prize's recipients. The donation, which comes from the National Endowment for the Arts (NEA), the NEH, and the Pritzker Foundation, allows the New Museum to honor two of the institution’s most prominent artists, the late artist-singer-songwriter Jen Perrone and the late photographer Paul Scheer. The total amount of the award is $100,000. Jen Perrone will receive $100,000 while Paul Scheer will receive $75,000. Jen Perrone’s work was chosen by a jury consisting of Harry Frankfurt, the former director of the Museum of Modern Art in New York; John Halstead, the founder and cofounder of the New York–based firm C. James Close; and collector and philanthropist Paul Scheer.“We were honored to receive this remarkable gift from the", "The next Biennial should be the largest exhibition of work by a single artist since the 1976 exhibition “The Other Side of the Mirror.” Zonda’s inaugural edition, which debuted at the Museum of Modern Art in New York in December 2018, drew 3.73 million visitors.A selection of works by contemporary artists from the show will be presented by Gillian Magee, Kathleen Hanna, Louis Malle, Billie Tsien, and Antoine Mitterrand, among others. The show is currently on view and will reopen in March 2020.\n\n\nThe nonprofit Art Museum Houston (AMP) will become the latest organization to welcome visitors back to the institution following a temporary closure due to the Covid-19 pandemic. On February 25, the museum announced that it would begin welcoming visitors again with a promotion that excluded early birds and offered free admission for two weeks. The promotion was in conjunction with a grand opening celebration that featured performances, performances, and other activities by artists such as Tanya Hendren, Mary Merritt, and Tunga. The reopening, which coincides with ART + HOUSTON, an eleven-day celebration of Houston’s history, will take place on March 3 and will run from 10 AM to 5", "The next Biennial should be in 2022. With the completion of its fifty-year program, the Museum of Fine Arts will present an ambitious exhibition of works by sixteen new artists, including the first Sri Lankan women to be included in the exhibition.The theme of the twenty-second Biennial, “Abandon Your Dreams,” will be the history of art and the impact art has on shaping our lives. The theme of the twenty-third Biennial will be “Dreams Come True,” a collection of photographs by B.R. Mural, William Alston, and other Western artists that will be presented in collaboration with artist-activists and activists. The theme of the thirty-fourth Biennial will be “Happiness is a Choice.”  The theme of the thirty-fifth Biennial will be “The Artist as Deceiver.” Many of the works in the exhibition will be inspired by the work of Elsinore Mzhebali, Koons, and Coop Ndlovu.\n\n\nThe Fifth International, curated by Nikolay Gusev, will be held in New York from September 14 to September 16.  The twenty-", "The next Biennial should be held in the spring of 2021. The second was staged in May 2019. The first was held in September 2013; the second, in March; and the third, in March 2019. \n\n\nThe National Gallery in London will introduce a new digital platform that will allow visitors to see its collections in person in the coming months. The platform, called National Gallery Viewing Rooms, or GNVR, will allow visitors to navigate the galleries through the collection’s first exhibition, “The Life and Death of Edward Colston.”The platform will also present an online version of the exhibition, which will be hosted by the gallery, the Friends of the National Gallery, in partnership with the London-based arts collective the Gallery at Hammersmith and Fulham. The first show, which was curated by Lucia Moser—the first artist to set up a museum in the United Kingdom—will be on view on September 5. The second show, titled “The Power of the Picture,” will run August 8–August 10 and August 9–August 11. \n\n\nAdvertisement\n\nThe Metropolitan Museum of Art in New York has received a gift of more than 1,300 works from the American Civil War artist", "The next Biennial should be a resolution on the role and importance of the laboratory in our cultural life. We should think of the laboratory as a laboratory for culture, an open laboratory that can develop the art of our times.As a society we are currently undergoing a crisis. I believe that the next Biennial is the moment when we will finally face the infinite, the fact that we are all part of an enormous machine that is continually changing our world. This new-old cannot be a new-old without a process which makes us part of its changing course. The possibility of creating a new Biennial is therefore an absolute necessity.” The 2020 edition of the Biennial, which will be held at the Feminine Institute of Technology in New Delhi, will also mark the centenary of the women’s suffrage movement. \n\n\nThe Whitney Museum of American Art in New York has removed a portrait of famous African American artist Edward Rouman\u0097the influential and influential dealer whose work is considered one of the first master paintings\u0097from its collection. The work, titled Edward Rouman: The Man, was included in a retrospective of his work on display at the museum last month and was removed from view pending a review of", "The next Biennial should focus on “intersection of cinema, art, technology, and design”—a theme of the seventy-third edition, held in Liverpool the same year as the festival. The programme would then incorporate a “second cinema,” a new cinema-within-a-film, and a “Fourth Cinema.”\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has announced its 2019–20 season, which will include four days of permanent exhibitions, a collection-wide event “The Film of Life,” and a “Doc*Showcase.” The seventh edition of the SFMoMA Documenta Triennale will comprise three days of new films, documentaries, and other works. The event will be held at San Francisco’s Olympic Stadium, which hosts the event every March, from April 16 to April 17.“SFMoMA’s future is secure, and we are excited to be a part of it,” said Michael Govan, chair of the board of trustees of the National Association of Theater Owners (NASO), and chair of the board of directors of the A.I.R. Gallery of New York.The exhibition will", "The next Biennial should take place in 2020 and would consist of around 1200 artists from twenty-three countries, including China, Iran, Japan, Korea, and the United States. The event would be led by an innovative curator who would work with the artist in the commissioning of the series. The exhibition would be open to the public.Its new four-day incarnation would begin with a solo exhibition by the Taiwanese artist Ai Weiwei and be followed by a larger-scale exhibition by the artist Mario Gioia alongside works by contemporary artists such as Paul Gauguin and Jeanne-Claude.\n\n\nThe Museum of the City of New York (MoCA), which has been closed since March 31 following a massive fire that broke out at its historic building on East Twenty-Second Street on April 15, has received a gift of thirty-six historic works by African American artists and designers. The works will be restored to their original state and displayed within the museum, which is currently undergoing a $62 million expansion, and are currently housed in the Louis Vuitton–designed wing.“The works in this room are the result of years of work by MoCA curators and writers to present and celebrate these artists and their creativity,” said MoCA director David", "The next Biennial should focus on the role of the museum in supporting issues of social justice in the city; on the articulation of the museum’s collection with that of the city; and on the possibility of creating opportunities for local artists. \n\n\nA group of artists and collectors representing the Los Angeles–based artists whose work was included in the exhibition “Avant Garde” at the San Francisco Museum of Art (SFMoA) are suing the institution, claiming that the failure to include them in the exhibition violated their right to compensation.According to the Art Newspaper, the artists are demanding that the museum return the works, which were purchased by the institution in the hopes that they could be included in the upcoming “Post-Modern” biennial at the Allen Memorial Garden. The artist-run platform Avant Garde published a statement about the group’s intent to “go to court to secure their interests.”The suit claims that the museum failed to recognize the group’s intent to use the works as “a bargaining chip” in negotiations with the institution over the upcoming biennial and, thus, failed to compensate the artists for their work. The suit also claims that the museum failed to post", "The next Biennial should take place in 2020 and will comprise of seventy-two works by artists presenting works in the exhibition “Career of Art,” which will take place in conjunction with the country’s national cenotaph.\n\n\nGavin Brown, the director of the Institute of Contemporary Arts (ICA), London, and the Institute of Contemporary Photography (ICA), London, has named Carsten Bächli as its next director and chief curator. Bächli, who has served as director for the last three years, has previously held the position of chief curator at the Institute of Contemporary Arts (ICA) and the Berlin Biennial. He will take up the post in July.“Carsten brings with him a fine international network of artists, curators and scholars, a wealth of experience in the field of contemporary art and a keen sense of mission for the ICA,” said Siddall Bennett, ICA’s director. “The ICA is a prime example of how an institution can thrive and thrive with the same vision.”\n\n\nVivian Lovelace, the author of fourteen books on architecture, including The House of Architectural Habit and Architecture in the Age of Mechanical", "The next Biennial should be held in March 2020. The 2020 edition will be the first in the country to address the legacy of the 1967 uprising, which left at least seventy thousand people dead and sparked the country’s worst political crisis since independence.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is moving two of its most famous works, the final “Splinter Series” (1976–79) and “No Man’s Land” (2015–17), to the public art museum in the California city of Santa Monica. The move, announced last week, follows a yearlong campaign to rejoin the city of Los Angeles’s revitalized waterfront.Campaigned by the nonprofit city councilmember Mike Bonin, who represents the neighborhood of North Campbell Street and South Santa Monica Avenue, and the Santa Monica Pier Trust, which represents the community of Venice, the city council voted unanimously in favor of a $3 million donation from the city’s Cultural Institutions Fund to MoCA’s staff and a $1.5 million gift from the Cultural Institutions Fund to MoCA’s general fund.“This is an historic moment for Los Angeles,” said City Council member", "The next Biennial should confirm the appointment of two new director-level fellowships, which will be announced in the coming months. The biennial will focus on connecting Western and Eastern art in India through a collection of work by American artists as well as collaborations between Indian and international artists.\n\n\nThe Estate of Ed Moses has established a $5 million endowment for the preservation and care of artworks that have shaped the lives of Black artists and will be included in the upcoming exhibition “Precarity” at the Ed Moses Museum in Memphis, Tennessee. The gift follows the organization’s announcement in September 2019 that it would donate ten works by artists of African descent that were previously excluded from exhibitions.The gift is made in recognition of the legacy of Ed Moses, who passed away on September 2, 1955, at the age of seventy-seven years old. Ed Moses’s work was featured in nearly every edition of the biennial, which celebrates the work of forty-four artists of African descent and their contributions to African American art. Prior to the foundation, Ed Moses organized and curated the Harlem Renaissance (1976), which premiered at the Museum of Modern Art in New York, and “Black on Film” (1977), which starred Patricia Ar", "The next Biennial should focus on the work of artists of the late nineteenth century in the context of biennial exhibitions. The theme should be “The City of Light,” a theme that will be inspired by the painting of the city of Paris by Joseph Loring in the 1890s. The museum will also be reopening in 2021 but will temporarily suspend its travel plans due to the Covid-19 pandemic. The 2020 edition of the Biennial will take place in May in Washington, DC. The full list of participating artists is as follows:Alex BlackCharles Bechamp, United KingdomCharles Bechamp, France Cristina Cattelan, United States Catherine Crockett, New ZealandCatherine Crockett, New ZealandCatherine Gallagher, AustraliaMelissa Gallogly, New ZealandClaudia Gallagher, CanadaTanya Garcia, MexicoCity of Light, California, United StatesCatherine Gallagher, AmericaTanya Gil, AmericaTanya Gartenfeld, GermanyClaudia Gallogly, GermanyClaudia Gallogly, AmericaClaudia Gallogly, AmericaCatherine Johnson, USCCJulie Hopkins,", "The next Biennial should be held in 2021. “The first iteration of the new exhibition was held at the Park of the Arts during the 2016–17 biennial season, and the exhibition was introduced with a new concept, ‘The Place of Our End,’ in 2018,” The Art Newspaper reported. The exhibition, which opened in November, was included in the inaugural Biennial of Modern Art, held at the Museum of Modern Art in New York in March.\n\n\nThe Centre Pompidou in Paris has received a gift of fifty-five works by the late Iranian artist Rana Haroon Mirza. The thirty-six works, which were donated by the Mirza family in 2015, were in the collection of the collection for several years but were eventually sold by the dealer Arash Mirza to the Modern Art Museum in New York in 2017. The donation includes works by fifty-five artists, including Tarek Atoui, Yazidi, Adnan El-Khoury, Yashar Ashraf, and Abdul Qadeer Ahmed.During the sale, the dealer arranged for a woman to be painted by Mirza and arranged for another woman to be painted by him", "The next Biennial should be held in 2021. \n\n\nThe City of London is planning to build a massive new museum dedicated to the artist William Kentridge. Dubbed the Kentridge Archive, the institution will boast six hundred thousand objects and large-scale installations. While the building, located in the city’s East End, will be fully open to the public, the museum will be housed in a converted warehouse and will only be accessible by car.The museum will also include a gallery, a studio, and a reading room where Kentridge’s work will be displayed in a variety of configurations, including as a series of large-scale installations. The retrospective will be organized as follows: William Kentridge: Kentridge, 1977–1985 William Kentridge: Kentridge II, 1986–1989William Kentridge: Kentridge III, 1989–2001William Kentridge: Kentridge III, 2001–2009William Kentridge: Kentridge II, 2009–2013William Kentridge: Kentridge III, 2013–2017William Kentridge: Kentridge III, 2017–2019The museum’s director, Joana Artur, said: “For more than thirty years, William Kent", "The next Biennial should be held in 2021 and will be open to the public. This year’s event will include a number of new works by artists from all over the world and will bring together around twenty-four artists from twenty-four countries.The 2020 Biennial will feature work from seventy-six artists from thirty-two countries and territories. Curated by Vasily Milyuk, the artistic director of the New Museum in Moscow, the biennial will run from November 2 to November 10 and will be hosted by the Skolkovo Art Institute. The 2019 Biennial was held in Moscow and Krasnodar and was hosted by the Skolkovo Art Museum. The inaugural edition of the biennial was held in Skopje in January 2019. For the 2018 biennial, the artists from twenty-six countries and territories were: Karel Arsht, Karolina Bicchieri, Judith Becker, Astrid Brunner, Tanya Borthwick, Maureen Britten, Felicity Bulmer, Cecilia Britten, Vera Bonakradt, Lavia Bonakradt, Evelyn Bradshaw, Catherine Britten,", "The next Biennial should be held in 2022. \n\nThe Museum of Contemporary Art (MoCA), Japan, has appointed Sadao Ito as its next director. He succeeds Takashi Naito, who announced his retirement in March 2019 after fifteen years at the helm of the institution.Naito was elected in 2014 after leading the museum for twelve years. He was promoted to the rank of deputy director and guided the museum through its 2010 closure due to the pandemic. During his tenure, he oversaw the expansion of the museum through the acquisition of new buildings and helped it become the focal point of the annual Biennale Tokyo in 2019.In an article published on Friday, March 27, in the Art Newspaper, Ito said that he plans to focus on developing the museum as a \"cultural center for life and art and also for commerce and culture as well as for the promotion of Japanese art and culture in the multicultural world.”Naito said: “I want to expand the museum by introducing new and more important exhibitions and projects and develop the museum as a cultural center for life and art. I want to create new opportunities for visitors to the museum to express their appreciation and support for Japan as well as the museum’", "The next Biennial should be in January 2020. The next edition will feature a selection of twenty-five works by twenty-six artists. The next exhibition will open in the city in February 2021. The Biennial of the South will be held at the San Francisco Museum of Modern Art (SFMoMA) from February 28–February 29, 2021. The 2019 edition, “Tobias Kaper & Evelyne Pfeifer” (pictured above) was curated by artist and educator Mark Delahanty. At the San Francisco Museum of Modern Art, where this year’s show will return, the biennial will be organized as it was in 1915, with the exception of the 2020 event, which will be held at the SFMoMA. An announcement about the 2020 exhibition will be made in the coming weeks.\n\n\nIn a landmark ruling, the US Supreme Court has upheld a $10 billion civil settlement that will compensate hundreds of thousands of workers at certain Norton Simon-Niggli Art Museum’s locations across the United States who were laid off as the institution closed in April 2019.Appointed by Chief Justice John Roberts, the ruling was unanimous and declared the settlement “legitimate.", "The next Biennial should also consider the possibility of reopening after a temporary closure due to the Covid-19 pandemic. The museum already reopened in March 2019, and it has been projecting that it will reopen this spring. The Biennial of the Performing Arts will be held in Hong Kong from May 23 to May 28. Though the exhibition schedule has yet to be announced, the museum will likely run its first exhibition in Hong Kong during May, and the inaugural exhibition will be staged in September. The Hong Kong pavilion at this year’s Kunsthalle Basel is currently occupied by Visayas, and the Hong Kong pavilion at the Venice Biennale is currently occupied by Hong Kong’s National Museum.\n\n\nThe University of Chicago announced today that it has hired Andrew Wiles as its next chief operating officer. Wiles comes to the university from the University of California Berkeley, where he has served as chief operating officer since October 2018. According to a release, Wiles will be responsible for helping the university navigate its transition to a new leadership team led by chair Mary Ceruti. The announcement marks the first time an executive director has been appointed to lead the University of Chicago since the institution’s founding", "The next Biennial should take place in the near future. The council members also indicated that it is feasible to organize an exhibition of work by a group of contemporary artists, centered around a single theme, such as water and watercolor, in 2020. The artist-in-residence program will be supported by a $2,500 gift from the Ruffner family.\n\n\nThe Boston-based nonprofit Artspace Boston, which is committed to supporting artists and culture in Greater Boston, has received a $3 million gift from the Krupps family in support of its $8 million expansion. The organization’s board of trustees also voted to set up a $1 million endowment for the new center, which will be located in Roxbury, and a $1 million grant for the organization’s future programming.According to the Greater Boston Cultural Alliance (GBCA), Artspace Boston has received $2 million from the Krupps family. The organization has also raised $1 million through a combination of donations and equity crowdfunding, bringing the total fundraising total to $3 million. The vast majority of the funds are coming from the Krupps family, but the family also owns the private equity and real estate companies the Fenway Group and the Redfin Group, which", "The next Biennial should come in 2020.\n\nThe Institute of Contemporary Art (ICA) in Berlin is preparing to welcome visitors back to the Museum of Fine Arts (Faktion Gropief) in 2019. The development of the museum’s collection of contemporary art was one of the main challenges in its redesign, which was led by M Woods, the project manager of the Museum of Contemporary Art, New York. Following an update to the museum’s collection in 2020, the institute is planning to launch a new digital platform to distribute the collection and engage with the public.“The new building, the new exhibition galleries and the new research area have all greatly improved the Centre for Contemporary Art in Berlin,” said Terrie Wegman, senior director of ICA Berlin. “The new platform will allow visitors to a new exhibition series and will include a new narrative and a new visual art experience. The digital platform will also include new interactive experiences for people who are not able to travel to the museum, and new materials in the collections.”\n\n\nThe Swiss government approved the first artworks of the M Woods Foundation’s new multi-million-dollar, five-building complex in Zurich as part of an announcement on", "The next Biennial should be held in the Egyptian city of Damietta, in the Nile Delta, in 2021. The sixty-three-year-old architect, whose architectural practice includes projects for Art Basel, the Venice Architecture Biennale, and the Victoria and Albert Museum, will serve as the Director of the exhibition. “I’m very much looking forward to collaborating with the Forum for Contemporary Art and the Fondazione Prada in Milan, the Fondazione Spazio in Venice, and the Fondazione Bicocca in Milan,” said Pilar Bojec, the director and CEO of the biennial. “I am delighted to be part of the work of the same people who have made the city of Milan such a beautiful and crucial city. I am very much looking forward to working with the Forum and the Fondazione Prada to understand and appreciate the importance of the city and the cityscape in general.”The final design for the exhibition was submitted by Carlo Catellani, a design partner and the longtime head of the Italian firm Giorgio Orizio and Michele Catellani, and was selected by a jury comprising designer Ramon C", "The next Biennial should take place in the autumn of 2020.\n\n\nThe Museum of Contemporary Art (MCA) Boston has added twenty-five new works by twenty-seven artists to its collection, bringing the total number of works by the biennial to twenty-eight. The addition of works by thirty-one artists coincides with the opening of the museum’s new third floor, which will also include the first new exhibition in the biennial series since 1990, “Unseen: The Artists’ Viewing Glass,” which opens on March 20.“The new works by artists in the series are essential for us moving forward as we continue to present amazing exhibitions, including ‘The B-Side: The Work of Richard Avedon and John Akomfrah’s ‘Medium of Expression” (2018), “Richard Avedon: The Artist in the Mirror” (2019), “The B-Side: Various Artists” (2019), “Richard Avedon: The Artist in the Mirror” (2018), and “Richard Avedon: The Artist in the Mirror” (2018)“This is a landmark year for the MCA, as we continue", "The next Biennial should focus on a new series of murals by the Spanish architectural and design duo Hernán Galindo and Rinta Málaga, which are scheduled to open at the Buenos Aires Art Museum in March 2021, and Santiago Calatrava, which will be inaugurated by the new Museum of Contemporary Art (MCA) in Lisbon in October 2021.\n\n\nThe Prussian Cultural Heritage Foundation (PACE) in Berlin has appointed Thomas Bloh, the founder of the German cultural site Digitale Gesellschaft, as its new deputy director. Bloh will be responsible for coordinating the activities and management of the three main institutions in the collection: “Digitale Gesellschaft: 34 Rämsthal, Bodega, and Rech,” Germany’s main collection; the Artskunde, Germany’s art and design center; and the Kunsthalle München, Germany’s largest art museum. Bloh previously served as deputy director of the Kunsthalle München from 2011 to 2014.Bloh’s new role will allow him to strengthen the organization’s international network in Germany,", "The next Biennial should be staged in 2021.\n\n\nThe historical city of Onnabruck in Austria, which is home to some 4,000 artifacts from the First World War and is considered one of the most important archaeological sites in Europe, has appointed Hilde‐Sebastian Jäger, the current artistic director of the Meijer Supercentre, as its next director. Jäger succeeds Anne‐Marie Morel, who has led the centre for the last seven years. She succeeds María Stétte, who took up the post in January 2019.“Hilde‐Sebastian Jäger is a highly qualified and experienced person for her position and has demonstrated her ability to build strong local and international relationships with the art community in the city of Onnabruck,” said Onnabruck’s mayor, Viktor Klimenko. “Her achievements in the field of curator’s work will be of great value to the city, the region and the world as she attempts to make the city and region of Onnabruck even more interesting and interesting for visitors to the city.”Previously, Jäger worked as a curatorial advisor for the German–Austrian", "The next Biennial should take place at the Museo de Cultura de los Arte Contemporáneas (MCA) in Mexico City in 2022.  ( The first iteration of the museum is scheduled to open in 2020.)\n\n\nArt dealer Augustus Donaldson, the longtime chairman and CEO of Christie’s New York, was indicted by a federal grand jury in Manhattan on Thursday on charges of fraud and theft. According to the New York Times, Donaldson was arrested on March 23 after a federal grand jury in Manhattan returned a single indictment in March, and his indictment is only the latest legal setback for the New York–based auction house.While it is unclear what led to the indictment, the indictment alleges that the defendants conspired to defraud the businessman by overpricing works by artists ranging from Mark di Suvero to Peter Sellars, as well as by making false and fraudulent statements regarding the sale of works by an unknown artist.“This case presents a difficult and unusual situation for me personally, as I am currently facing a federal criminal investigation led by the US Attorney’s Office for the Western District of New York,” Donaldson said in a statement. “I declined to cooperate with the government", "The next Biennial should take place in 2021, but if the organizers can secure the necessary funding, they should be able to move forward with the exhibition sometime in 2022.\n\n\nThe National Gallery of Britain (NGH) in London recently launched a new digital platform that aims to make its exhibition catalogues more accessible to people through a single site. Called the Exhibition Viewing Rooms (EVRs), the platform allows visitors to view catalogues on a range of subjects, including art history, modern and contemporary art, conservation, and design, and will be based at the institution, which has a permanent collection of more than 1,300 works by more than 2,000 artists, collectors, and curators.“With the opening of the NGH’s new exhibition venue, the National Art Centre, we are able to expand the range of exhibitions that visitors can access on a daily basis,” said National Art Centre director Jim Pickering. “It will also allow us to expose more of our exhibitions, exhibitions collections, exhibitions spaces, and exhibitions rooms to more people, and allow us to present more exhibitions in future.”The platform features an online catalogue of seventy-six of the museum’s current exhibitions, including “Passion", "The next Biennial should be in 2022, and the first in 2021.  Performances by the ten artists who won this year’s prize will be presented by the biennial’s board of directors.\n\n\nThe inaugural edition of the Cork Contemporary Art Biennial held at the city’s Barbican Art Museum (BAM) in London on December 12 has revealed that twenty-nine artists will participate in the next iteration of the event. It will take place at the museum during the February 27–March 2 period.The exhibition, titled “The Future Is Present,” will feature works by forty-one artists from twenty-five countries and twenty-two continents. Titled with a nod to the city of Cork, “The Future Is Present: Art and the Future of Community,” the exhibition will also look to the future through the lens of contemporary art and will focus on issues of sustainability.“The exhibition marks a new chapter in the Cork Contemporary Art Biennial and we are excited to welcome the artists involved, and excited to see how their work will affect the upcoming exhibition,” said Barbican director Maria Barba. “What we are most excited about is that the artists involved in this", "The next Biennial should be held at the Museum of Modern Art in New York in 2021.\n\n\nThe Pérez Art Museum in Mexico City is planning to move the exhibition of work by the late Mexican designer José Vicente Ferrer from its current location on the third floor of the building, which is currently being renovated, to a second floor. “The Pérez Art Museum will always be a center of the culture of Mexico,” Pilar Valdés, the Pérez’s secretary of culture, told the Art Newspaper. Originally scheduled to open in January 2021, the museum will now host the exhibition in its current configuration until 2024, when it will close permanently for two years to complete a large renovation project. The extension will also include the reopening of the Pérez Art Museum Gallery, which is currently undergoing a $16 million facelift, as well as the Pérez Art Museum Auditorium and the Pérez Art Museum, which has been closed since 2012.Although the Pérez Art Museum is not an official museum, it does offer tours of the institution. The museum invited the artist’s widow, Clarita Ferrer, and her son, Daniel Ferrer, the museum’", "The next Biennial should be held in 2020, when the exhibition will mark the twentieth anniversary of the series. The exhibition will focus on “the work of women artists from the Philippine islands,” a reference to the country’s The Philippines, an international collection of more than 2,500 works from the island of Madeira. Filipino artist Roxana Azual, who won the Prix d’Art Contemporain (2015), will also participate in the 2020 edition.\n\n\n\n\n\nThe Museum of Contemporary Art (MoCA) in New York has received a major gift of thirteen works by Sidney Almon, Rebecca Antayne, and Nan Goldin from the Harry and Louisa Warner Family Trust. The works, which were donated in 2017, commemorate the fourteenth anniversary of the installation of “Pangaea.” The gift includes an original work by the trio created in 1967, “Agnès Alman, Jr.,” a work for which they are responsible, as well as a painting by the duo that is currently on display in the William and Mary Galerds’s new center. The gift also includes a collection of works by Silver and Gold, who were among the", "The next Biennial should take place in 2020. More information about the pavilion can be found here.\n\n\nThe Metropolitan Museum of Art (the museum), which has been closed since March 13 due to the Covid-19 pandemic, is preparing to reopen in May. The institution said on June 11 that it is reopening in \"every way possible\" and that it has not decided when the museum will be able to reopen. The museum said that it is working closely with the government and local authorities to implement new safety measures, such as limiting public travel to only authorized groups of five people at a time, limiting outdoor activities, and introducing time cards to ensure that people can go back and forth between the museum and their residences.The museum is also implementing an emergency funding program, which will reimburse the institution for up to $200,000 if “all necessary steps” are not taken to prevent Covid-19-related Covid-19 cases from continuing to be reported. The funds will also be used to assess the feasibility of providing direct financial support to institutions and individuals impacted by the pandemic. The institution said that it is working with state, local, and tribal governments, with the goal of reopening by May 31,", "The next Biennial should include a discussion of the role of cinema in the twenty-first century in a multicultural society.  The exhibition will also rebut the negative stereotypes that were created by the film industry in order to lure Western audiences to South Korea.The upcoming exhibition will focus on how cinema can serve as a vehicle for reconciliation between human rights abuses and the Korean government. If the Biennial is successful in raising awareness about the human rights situation in Korea, the government hopes that the event will serve as a model for how the country can address its many social ills.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles will no longer be the home of the Hirshhorn Museum of Art, the Katz Gallery, and the California Academy of Sciences, which were forced to move to new locations due to the Covid-19 pandemic. The Hirshhorn announced that it will suspend the commemorative exhibitions that commemorate the events of the last fifty years and will instead begin a new \"post-covid-19 era.\" The Katz Gallery will remain closed until at least the end of February, and the California Academy of Sciences will remain closed until March.“Throughout the last sixteen years, we have been focused on developing an approach that", "The next Biennial should be held in 2021. \n\n\nThe B.A.C.L. Foundation, a nonprofit organization dedicated to the preservation, restoration, and dissemination of art and art history in British Columbia, has appointed Joanne Littman as its new executive director. Littman comes to the organization from the University of Washington in Seattle, where she has served as the director of curatorial affairs since 2015, and will assume her responsibilities on January 6, 2021.“We are delighted to welcome Joanne to the organization,” said Mark Adler, director of the museum. “Her expertise, experience, and enthusiasm for the arts will be a strong asset to the collection and the mission of the museum. We look forward to working with her and to working with our talented staff, the curators, and the talented and dedicated biennial team.”The B.A.C.L. Foundation is a professional organization whose mission includes the collection and exhibition of art and art history. It was established in 2001 by a group of curators and scholars to address a shortage of contemporary art and arts history in British Columbia. The organization now has over thirty thousand works in its collection and holds more than one hundred exhibitions annually.\n\n", "The next Biennial should be held in the spring of 2020. According to the China Daily, THE ART Show and the Art of Games will also be scheduled to take place in the spring of 2020. The 2020 MEFA will be held in Monte Carlo from March 6 to March 8.  \n\n\nThe Harris Foundation has announced that artist and teacher John Sauter, whose work explores questions of memory, memory politics, and memory-based practice, has been selected as the 2020 recipient of the $25,000 John Sauter Prize.Sauter, whose work is housed in the collections of the Museum of Modern Art, the Los Angeles County Museum of Art, and the San Francisco Museum of Art, is best known for his multi-decade series of works, which illustrate the Christian biblical creation story from the film The Matrix, as well as the history of engineering and how it relates to memory and the body.Sauter’s work is currently featured in the exhibition “Memory and the Body: ‘The Cambridge Legacy,’ which opened at the Museum of Modern Art in 2013, and was included in the 2017 Whitney Biennial. He will be presented with the prize at an award ceremony on Tuesday, March 2.", "The next Biennial should be held at the US Embassy in Cairo from January 25 to February 28, 2021. The exhibition\u0097which is scheduled to run from March 13 to March 16\u0097will explore the role of the Muslim Brotherhood in Egypt and will focus on the role of women and the institution of Islamic jurism in a time when the country is experiencing a political crisis.\n\n\nStudents and faculty from Spain’s Centro de Cultura Moderna (CIM) university in Valencia, a bastion of left-wing cultural thought in Spain, staged a protest in front of the Spanish Ministry of Culture on Monday, March 3, demanding the removal of Ada Colau, the director of the public cultural center Granada2, from the institution.The students’ demand for her resignation comes amid the ongoing investigations into the violent clashes between supporters of the right-wing Popular Party (PP) and the Democratic Party (D), which were sparked by the latter’s proposed reopening of the national Museum of Modern Art (Monza), and an anti-MPC demonstration in Madrid on March 5.The protest came a day after CIM’s president, Felipe Calderón, announced that the center would suspend all events until April 1,", "The next Biennial should focus on the history of anthropology and how it intersects with American public art and the larger history of New York City. The 75,000-piece Metropolitan Museum of Art is currently undergoing remodeling and will open in 2020, but the museum will remain closed until February 22, 2020. The Redevelopment Authority, which oversees the organization, has been lobbying the state government for months to extend the opening date of the exhibition, and Governor Andrew Cuomo (D) signed a temporary $1.2 billion emergency aid bill on March 13, 2020, but the legislation expires on March 15, 2020.As the state struggles to come to terms with the loss of 25 percent of its workforce during the coronavirus pandemic, and as the city looks to raise $200 million for MAD—a cultural nonprofit charged with developing and curating free, public programs for the public—the Art Newspaper reports that the city is now seeking $150 million in emergency aid. According to the New York Times, the city currently has a $200 million emergency fund that will run through 2022.The new federal guidelines for emergency aid were released on February 13, and address several key themes, including long-term caregiving, housing, and disability support", "The next Biennial should aim to introduce all of these disciplines to a new audience with a view to broadening their understanding and appreciation of art and creators. We are, accordingly, asking for your help to develop the appropriate programs and to seek your ideas on how to make the Biennial possible. We are also asking for your suggestions for how this year’s edition can advance the understanding and appreciation of the work of artists and organizations. A selection of your suggestions will be presented at the institution in September. \n\n\nThe London-based museum that supported the late Iranian painter Jamshidi Saeedi, who often worked in abstract compositions that were both elegiac and playful, has announced that it is shutting down its operations in an effort to shift its focus away from its conflict with Iran and towards “the future,” the art world’s hedonistic realm. The institution had previously considered its relationship with Saeedi one of the main reasons for its closure. According to the New York Times, the museum has been working with the Iranian artist’s son on a new exhibition, “in which he will present work by a select group of his paintings that have never been published,” but the show is currently on view until", "The next Biennial should take place some time in the next two years. The theme of the upcoming edition, “Ascension,” is a nod to the theme of the exhibition “The Mountain and the Flower: The First Biennial” (1995–96) and the opening of the exhibition “Feminine,” which is currently on view at the National Museum in London.\n\n\nThe Independent Commission for Museums (ICOM), a South-based organization that aims to promote the highest ethical standards in the field of art and architecture, has been suspended by the British Museum (BMA) in London. The decision to remove ICON’s current exhibition from the institution, titled “Art and Architecture: Patterns of Architecture,” was made in light of the ongoing inquiry into the wartime neglect and abuse of more than one hundred European artists, including María Rodríguez-Vargas of Portugal, Hans-Ulrich Neugroschel of Germany, and Sara Zweibel of Austria.“ICOM’s response to this crisis has been to reevaluate its role within the art world’s chain of production and the role of the museum in", "The next Biennial should be held in the winter of 2021. \n\n\nThe twenty-third edition of the Biennale de Lyon has announced that it will reprise the city of Lyon as the theme for the event. The theme for the twenty-fifth edition is the city of Lyon and the French Revolution. In the wake of a deadly terrorist attack that took place on December 7, 2016, in Paris, the theme of the biennial was “L'Étoile d'Or.” It will also reprise the historic exhibition space and the château that hosts the event from January 17 to January 21, 2021.The 2020 edition of the event will take place at the Grand-Duc Jean in Paris from January 20 to January 22, 2021. The 2021 edition will be held at the Saint-Étienne-du-Rouvray in the city of Lyon and will take place at the château from January 20 to January 23, 2021. The twenty-ninth edition of the event will also be held at the château from January 21 to January 23, 2021.\n\n\nThe Museum of the Jewish People (MoJo) in New York has received a major gift from the", "The next Biennial should be called 〜Away from the Light and from the Dark.” An exhibition of work by Sanjay Leela Bhansali, “In the Shadow of the Sun,” will deal with the use of photography in the service of social change; and a special exhibition about 'unconscious appropriation” will feature works by Cécile B. Evans, Simone de Beauvoir, and Isaac Asimov.The full list of participating institutions is as follows: BH Salon, New Delhi: Closed until further notice BH Art Gallery, New Delhi: Closed until further notice BH Art Gallery (New Delhi), New Delhi: Closed until further notice BH Art Gallery (New Delhi), New Delhi: Closed until further notice BH Art Gallery (New Delhi), New Delhi: Closed until further notice BH Art Gallery (New Delhi), New Delhi: Closed until further notice BH Art Gallery (New Delhi), New Delhi: Closed until further notice BH Art Gallery (New Delhi), New Delhi: Closed until further notice BH Art Gallery", "The next Biennial should be decided in the autumn. The theme of the 2020 edition should be “I, Myself, and I’m Not” and will be “The Body, the Body Other, and the Body Other Things.”The next edition will be held at the Third Reich’s Institute for Advanced Study in Germany from September 21 to September 26. The exhibition is currently on view in the Museum of the History of Science and History, Berlin.\n\n\nTitel Waldger, the German artist whose critically acclaimed sculptures and paintings confront and transcend the historical, political, and spiritual landscape of the Third Reich, died on January 15 at the age of eighty.Born in the small town of Waldger, near Kassel in the state of North Rhine-Westphalia, Germany, in 1930, Waldger studied at the Academy of Fine Arts, Oberhausen, the University of Berlin, the National Academy of Arts, the Prussian Academy, and the University of Vienna. Following an exchange to the Soviet Union in 1942, Waldger returned to Germany in 1943, where he studied at the Karlsruhe Academy of Fine Arts. In 1948, he began his series “Movements in Space”", "The next Biennial should be held in 2020.\n\n\nThe museum’s collection of more than 3,500 photographs by Dutch-born artist Jan-Åke Kender has been given a major facelift by its new CEO, Max Holle. As part of the $10.8 billion renovation of the museum, the Kender Museum moved the exhibition space from its original location in Amsterdam’s burgeoning arts district, the Prenzlauer Berg, to the adjacent building. The renovation, which also involved the remodelling of the building’s outside walls and interior spaces, and the expansion of the museum’s collection, opened in May.According to the museum, the new digs will “provide the greatest opportunities to see the works in context.” Kender’s studio, which comprises a series of stained-glass windows depicting paintings and sculptures by Kender’s close friend Jansen Hoekstra, will also undergo a major facelift. The painting and sculpture institution will be housed in a brand-new building—named the Max Holle Gallery—designed by the artist’s architect, Madeline Ginsberg, and will boast two galleries, a research library, and a restaurant.", "The next Biennial should take place at the Königplatz in Frankfurt in 2022, and the Berlin Biennale in 2020. The Berlin Art Museum (BAM) has been planning to open to the public in 2021, but the project has been suspended due to the Covid-19 pandemic. The new chapter at the museum will be titled “Reclaiming the Land,” and will be based in the former Mittell-Kruse in Frankfurt and will take place over two-hundred days. Construction of the exhibition space is expected to start this spring.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than seventy works from the Los Angeles–based artist and philanthropist David-Isaac D. Bernstein, who passed away on December 23. The works are works by the artist and his wife, the sculptor Grace J. Bernstein. Born and raised in New York, David-Isaac first began collecting in the 1980s, when he was working on a show for the artist’s Venice Biennale in 1998. The show, titled “The Places of My Life”\u0097a tribute to the late icon Charles Bukowski", "The next Biennial should take place at the unprecedentedly beautiful and open-concepting Margate Museum of Art, in Margate, on the seacoast in England\u0097the country’s largest free-standing museum. The venue will host fifty-two works, including twenty-one by artists whose works were selected for the exhibition, which will be held in the iconic old warehouse.The artists chosen for the exhibition included Danh Vo (UAE), whose six works are on display with the exhibition “Spill,” an epic reconstruction of a war memorial in Berlin that also features a statue of General Erich Maria Remarque from the Nazi era, and two female artists, Angel Manoel (Brazil) and Alice Oksaner (Germany), whose works will be featured in “The Body: Art and Body Politics,” which will be published by the Palais de Tokyo in Paris in the spring of 2021.Geneviève Ferroni, the director of the Palais de Tokyo, said: “This year’s Biennial is a step forward in that it is a truly international exhibition, for the first time featuring works from thirty-five countries. The success of the exhibition, which was", "The next Biennial should be held in 2020. “The time to reimagine the future of art is now,” said Hanna Barnea, president of the Biennale Barcelona. “The Biennale Barcelona will continue to be a platform for social progress through the art that we love, and will continue to represent. This is a unique and significant moment for Barcelona, for its history and its future. I strongly welcome this history in my art, for it will further enrich the vision of the Arts Council, the city of Barcelona, and I. P.O. Box 1, Barcelona. A new future of art and culture will emerge from this, and we will have a role in shaping this future.” \n\n\nThe Museum of Modern Art (MoMA) in New York has commissioned artist and activist Ben Wechsler to create a new exhibition marking the seventy-fifth anniversary of the Black Power Movement (BPM), an acronym for Black Power in America, the BPM organization that emerged in the late 1960s and early 1970s from a merger between several Black liberation and anti-war groups, including the Black Panthers and the Black Liberation Army (BLA), and is now represented by the artist. Ben We", "The next Biennial should be held in 2021. The fifty-second is currently on view through November 29.\n\n\nThe Museum of Modern Art (MoMA) in New York has been granted a major $75 million expansion, which will include a new 125,000-square-foot, glass-enclosed exhibition space, an expanded bookstore, and the reopening of an underground viewing platform that will allow visitors to experience the institution's expansive collection in a contemporary setting.MoMA director Daniel H. Weiss said that the expansion, which will also include the renovation of an existing curatorial gallery, “will allow us to create a new dynamic,” that will “offer a rare opportunity to see the work of the curators of MoMA before they leave to pursue new projects.”In addition to the expansion, MoMA is working on several new initiatives, including the renovation of a new building connected to the museum, which will house special exhibitions, the brand new MoMA Gallery, and a new gift shop that will be open from 11 AM to 6 AM on Saturdays.\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of more than 5,500 works by thirty-nine artists whose work is housed in", "The next Biennial should take place in 2020.\n\n\nThe Los Angeles–based nonprofit the Museum of Contemporary Art (LACMA) has added more than 70 artists to its growing collection of the works of Rachel Harrison. The institution has placed fifty works from the artist’s recent solo exhibitions, “Rachel Harrison: Selected Essays” and “Rachel Harrison: Presentations” at the Los Angeles County Museum of Art (LACMA), and the Los Angeles County Museum of Art (LACMA: Live) and the Los Angeles Museum of Art (LACMA: Live) has added fifty works from the artist’s latest exhibition “The Hollow Whale” at the Los Angeles Museum of Art (LACMA), which opened on September 29, 2019. The works will share a space with a new exhibition of Harrison’s works scheduled to open in the fall.“In honoring her life and work, LACMA presents ‘The Hollow Whale’ at LACMA,” which is organized by the Los Angeles County Museum of Art and the Los Angeles County Museum of Art. In the exhibition, five new works by Harrison, including “Waves of Her Body” (October 22", "The next Biennial should be held in 2021. “The exhibition is the most important project of the new museum,” said Matilda Neeson, chair of the board of trustees of the Biennale. “We are looking forward to collaborating with future generations of visitors to the museum to create an immersive experience that fosters and advances the themes of the exhibition.”\n\n\nThe Metropolitan Museum of Art in New York has appointed Brian Eno as its next president. Eno, who has led the Met since 2014, is poised to become the first African American to lead the institution, which was founded in 1941. The seventy-eight-year-old former chief curator will succeed Lionel Barber, who retired after a year in March 2019.“Brian has been a visionary force in the field of art for twenty years, and has been an integral member of the Met since he became chief curator in 1994,” Barber said in a statement. “His impact on the museum will be felt for generations to come. His work in teaching and collecting will help to shape the Met’s future. I’m delighted to work with him and look forward to his impressive 2020 to 2024 years at the Met.”During", "The next Biennial should take place at the Musée d’Art Moderne in Paris in 2021.   Yair Hochner, head of the museum, told the Art Newspaper: “I think that the new issues will be of great interest to the public.” The exhibition will also be the subject of a book release, selected by David H. Daley, in the spring of 2022, which will have its Paris edition in January of 2021.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of works from the Sackler family, which has controlled the family for fifty years. The ruling council for the Sacklers, which includes Charles Egan, John Sackler, and their sons Joseph and Robert Sackler, approved the revised guidelines on Tuesday, November 17. The document grants the city the authority to banish fifty works from the Sacklers’ holdings, which include paintings, sculptures, photographs, and photographsc artworks, and regulates how the works are presented and displayed.The guidelines, which were drafted by a DCLA official, said that the institution may not remove or display the works in question unless it determines that it “poses an undue risk of harm", "The next Biennial should, perhaps, be called “The Untitled Present.”It should also be possible to produce a work that is “newly and powerfully alive,” as if the themes of the forthcoming twenty-second edition, which will take place in April 2020, are more fundamental than the themes of the exhibition which opened on December 19, 1987.A number of artists have come together to create works that address the decay of the African continent, its rebirth in the form of a new continent. However, the themes of the forthcoming edition are more modest and intimate. The exhibition will focus on themes including education, medicine, and the environment.“The project is an extension of the work of the biennial series ‘Africa in the Making’ from September 11, 2019 to October 27, 2020: ‘The Untitled Present’ was an extension of that work,” Sisseton told Artforum. The work, titled “The Untitled Present II: A Legacy of Resurgence,” represents the creative process in the twenty-first century.“I’ve been meaning to do this for a long time,” the artist said. “I grew up in a", "The next Biennial should be held in 2021, when the exhibition will run from February to May. The exhibition will also include two special exhibitions and a retrospective of the biennial’s work, which was curated by the late Dutch artist Eijk van de Haan.\n\n\nThe Swiss Institute for Contemporary Art (Leiden) has appointed Hanno Steyer, the director of the Taiwan Museum of Fine Arts (TMFA), as its new director. Steyer succeeds Stefano Pessina, who departed the institution in March 2019, and will take up the post in July.“Steyer’s appointment marks the first time he has been appointed to a high-level position at such a high-profile institution,” said director Beatrice Bueno. “He is a man of vision, who has an acute sense of attention to detail, and a deep desire to support the collaborative practices of the museum, which are at the forefront of the art-world’s transformation.”The museum, which was established in 1929 and represents contemporary art, architecture, and design, is currently undergoing a $50 million renovation that will add more galleries, classrooms, and classrooms for the collection, and enhance the capacity of the museum for public", "The next Biennial should embrace the opportunity to also bring together artists in a way that will allow them to work and think together in a way that can also foster dialogue and exchange. The new platform will allow the artists to share in the upcoming exhibition and to participate in the creative process.\n\n\nThe Beinecke Rare Book and Manuscript Library in Berlin has welcomed Iwan Brown as its new curator of American art. Brown joins the library from the New York–based institution, which has more than forty thousand works in its collection, from the University of Pennsylvania. He succeeds Jerome Ahearn, who retired earlier this month after nine years at Beinecke.“I will be a passionate supporter of the Beinecke library and the curators who have made its collection one of the most important collections in the world,” Brown said. “I am looking forward to working with the Beinecke collection as it moves into its next chapter, and to engaging the Beinecke collection in the future.”Brown will lead the Beinecke Rare Book Depot in the museum’s new building, which opened in 2016, and will work closely with the museum’s curators, including Taylor Matson,", "The next Biennial should be in 2021. The renovation of the Pérez de los Muertos, which is currently under way, is expected to take at least a decade.The Pérez de los Muertos’s exhibit “Ralph Waldo’s Labyrinth of Modern Life,” organized by the studio of Jean-Michel Bluau, will reopen in March of 2021. Its exhibit “Prometheus: The Biennial of Modern Life” will open in September of that year.\n\n\nThe B.W. Matson Museum of Art in Shanghai has added ten more works to its collection, bringing the total number of works from the museum to twenty-four. The additions, which were made during a renovation that began in 2021, include fifteen works by Apollinairea, Boccato, Gheorghebi, and Gheorghebi II, as well as the work of Marc-Olivier-Sébastien Abot, Mark di Suvero, and Léa Seydoux.The addition of thirty-two works to the collection was made during a project led by Luigi Dell'Italia, the former director of the Fondazione di Car", "The next Biennial should be held in 2021, when the exhibition will mark 150 years of his career.\n\nWorld War II–era artist Nada D. Franko is suing the Smithsonian to prevent the institution from exhibiting her work in its biennial “Polar Express.” The piece, which was created in 1943 to commemorate the end of the Soviet Union and the formation of the Federal Republic of Germany, is currently on display in the museum’s current exhibition “Wangechi Mutu: The Power of Two.” The lawsuit, filed by Los Angeles–based artist and activist Teresa Giuffrida, seeks the return of the works, which were stolen from the collection in 1999.In a statement to Artnet, Franko said: “I’m filing a lawsuit to stop the theft of two of my works. The theft of one of my works in the museum is so abhorrent that it is beyond words. The theft of my work is antithetical to the values and mission of the institute. I was never given the gift of the works. I was asked to pay the bill for the stolen works. I refused. I was told that I was supposed to pay for the works, but I would be", "The next Biennial should be held in 2021. In the meantime, the building and the museum are working together to prepare for its reopening in 2022.“Dr. MiMand, was one of the first international leaders in the field of art history,” said Craig Alexander, the president and CEO of the museum. “We are grateful to the many artists, scholars, and institutions that have contributed to the Museum’s collection and to our success in advancing and showcasing the extraordinary exhibitions that have been made in the past. We are eager to continue to present innovative, international art exhibitions that reflect the Museum’s commitment to public engagement and excellence.”The museum will host an exhibition of twenty-six works, which will be curated by Kim Hong-kyong of the Nara Foundation and will be on view for ten days from October 14 to October 21. The exhibition will also feature a new exhibition of work by American artist Louise Bourgeois, an art historian working in the United States, and will feature new works and works that are not currently on view; artworks that have recently been displayed; and pieces that have never been on view.The museum will be closed from November 22 to December 11, 2020. The Free Museum in", "The next Biennial should take place in 2020. . . .\n\nArt historian and curator Vasundhara Rajagopal, who served as a curator in the Indian art industry for over two decades, has been appointed curator of the forthcoming edition of the Biennale de Lyon. The announcement was made by Satish Chandra, director of the University of Cambridge. The biennial will be held in the French city from March 12 to March 14, 2020.Commenting on her appointment, Rajagopal said: “The biennial has been an opportunity to take stock of the contemporary world, to see what the exhibition circuit is doing to advance our particular interests and enthusiasms, to appreciate the diversity of our curators’ collections, with special attention to the importance of modern and contemporary work.” She added that she wants the exhibition to reflect the global 'triumph of culture,” as she puts it. The exhibition will also include a special exhibition of works by female curators.Commenting on her appointment, Rajagopal said: “I am honored to join the already-strong team at the university to play an important part in creating the new biennale, and to be a part of shaping its future. The exhibition", "The next Biennial should take place in the spring of 2021, with a view to securing the 2019 theme. The exhibition would be housed in a museum that has yet to be constructed in Hamburg.\n\n\nThe National Gallery of Victoria in Australia announced today that it will hold a series of exhibitions in commemoration of the centenary of the founding of the Commonwealth. The 2020 edition of the National Gallery of Victoria will arrive at the Victorian Museum of Art (VMA) in Melbourne on August 23. The exhibition, titled When Nations Rise, will showcase the work of eight artists who have created significant new works for the exhibition: Pilar Pinzon, Armando Cervetto, Christina Benoît Marciano, Guadalupe Pilar, Nina Markova, and Marc Penney. The biennial will also include a selection of works from this year’s Australian Biennial, which will take place at the Victorian Museum of Art in Melbourne in October 2020, as well as a new exhibition of work by Lisa and Julian Nicholls, entitled “The Noise of Things Falling”, which will open at the National Gallery of Victoria on September 5.The first show will focus on the history of indigenous art and will be organized", "The next Biennial should be held in the spring of 2022 and will be hosted by the Museu de Arte de São Paulo and the Museu de Arte de São Paulo (MASP). The institution will also present a selection of works from its collection at that time. Commenting on the upcoming exhibition, Marianne G. Sze, the chair of the Biennial and curator of contemporary art at the Museum of Contemporary Art in the City of New York, said: “The new years are here and the museum has been celebrating the centenary of the charter by building a collection of works by the artists who shaped the museum’s visual and cultural landscape. We are grateful for their generous support in bringing this exhibition to life and to the museum’s audiences.”\n\n\nThe nonprofit British artist Peter Sellars has announced that he will sell his exhibition “The Sinking of the Lusitania,” a fifty-year-old, eight-thousand-work collection that is currently on view in the British pavilion at the Fifty-Ninth Venice Biennale, to the private collection of the American painter Thomas Heatherwick. The move was made in the agreement outlined in a public", "The next Biennial should take place in 2021, with a 2020 exhibition opening in the same year. The event’s selection committee, made up of artistic director Kate Fobert, curator and director of the Arts Archive, and curator of contemporary art Marcel Prouvé, has yet to make a final decision on the theme for the 2019 edition. The opening of the 2019 Biennial was preceded by a decade-long residency program, which focused on issues of disability, the arts, and culture in the city, which has a population of around three million, in 2012. The 2018 edition, titled “Between the Light and the Darkness,” was organized by the MCA Gallery in Isamu Noguchi’s living room. It included ninety-three works in various stages of development. The next edition will be organized as a “multi-platform,” with a 2019 exhibition scheduled to open in the spring of 2020 and an exhibition in the fall of 2021. It will be inaugurated by the London-based artist-run nonprofit Musa Saeed Gallery, whose works will be included in the 2020 show.\n\n\nOn Thursday, the Museum of Contemporary Art (MoCA), London, announced that collector", "The next Biennial should be held in 2023.\n\n\nThe Victorian artist Adelaida Altman, an Austrian-born, US-based curator of modern and contemporary art, has died at the age of ninety-seven. The United States-born Altman was born in Vienna in 1920 and studied under Ludwig and Georges Sextus, who became the founders of the heritage-focused space Modern Art Gallery in New York. Altman began her artmaking career in the 1960s at the creators of the Kleist Verlag, which she would go on to organize. The partnership between the two organizations resulted in the exhibition “Monochromism” (1975–1977), a six-year retrospective of Altman’s work at the Museum of Modern Art in New York. That same year, the Altmans set up the Palermo-based nonprofit Modern Art Project, which offers grants to noncommercial arts organizations throughout the US. Altman’s work has been exhibited at the Philadelphia Museum of Art, the Metropolitan Museum of Art, and the Museum of Modern Art in New York; at the Whitney Museum of American Art, the Museum of Modern Art; and at the Hammer Museum in Los Angeles.Various works have been", "The next Biennial should take place in Helsinki in the first half of 2020. All the participating artists will be invited to present their works for a public viewing at the Künstlerhaus in Helsinki in March 2021. The museum will then stage a new exhibition of works by the same group. The first edition of the new World Biennial will take place at the Meijer Centre in Los Angeles in March 2020.“The Future is Here,” a new online exhibition featuring works by forty-three artists, including Rachmaninoff, Pindell, Dzirek, Hvidberg, Bion, and Schmitt, will be released in the United States and Europe in December 2020. The show will also include a retrospective of the work of the same group in July 2021.\n\n\nThe Palazzo Prada in Venice, Italy, has received a major gift of more than 2,500 works by artists such as Hans Christian Andersen, Lucio Fontana, Etan Patz, Paul Mpagi Sepuya, and Joëlle Kiehl. The donation includes a total of eleven hundred works, which were acquired by the museum from the collection of the", "The next Biennial should live up to its name. It should embrace the four themes of the exhibition—art, design, science and technology—and include the work of its chosen artists. The pavilion should reflect the themes of the biennial. In order to create a sense of cohesiveness and connection among the artists selected, the pavilion should become a platform for their projects.Pace of achievement will be decided by the panel for artist-in-residence, Lululemony Patek, who was nominated for a MacArthur Fellowships. In an interview with Artforum, Patek said: “I’m not sure how you think of a biennial as a single exhibition in a way that’s not staged. I mean, I think of it as a set of pieces that’s been assembled in a certain way and then you go on to the next exhibition. But if you think about the basics of what a biennial is—that it’s an exhibition, it’s around things, it’s in places, it’s about people, it’s about culture—it’s a thing that can’t be described as a biennial", "The next Biennial should be hosted at a location other than the Museum of Alberta, which has yet to officially announce a new location for its 2020 iteration,” said director and CEO Darby Alençon. “We look forward to welcoming you back to the institution and to exploring new ways to engage with our audiences through your programming.”\n\n\nThe University of Chicago’s Center for Art and Performance, which has been closed since October 30 because of Covid-19, has released its fall 2019 edition, “Between the Sun and the Moon,” which is slated to run May 16–June 2 and will be held in the museum’s former building on the South Side. The exhibition will highlight the work of seventy-nine artists, including Elizabeth Peyton, Virgina Rich, and Nari Ward, among others that have recently performed and that are currently on the move across the United States. The show will also address the effects of the Covid-19 pandemic on art, science, and technology, as well as the efforts to mitigate the spread of the virus.“Between the Sun and the Moon’s final part of the series, ‘Shadow,’ examines the complex relationship between", "The next Biennial should take place in the fall of 2020. It will be hosted by the Wyndham college in London and will be co-organized by Jonathan Bourne, artistic director of the Biennale of London, and Stephen Totty, curator of contemporary art at the University of Cambridge.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than 1,400 works by American artist Peter Sellars. The work was purchased for the institution by John Palfrey, an American businessman and collector who lives in Los Angeles, and his wife, Roxanne. The couple traveled to the museum in an effort to secure the artwork, which is valued at between $10 million and $15 million, and were unsuccessful in their endeavor.“A great gift from a man who has been and will continue to be a champion of the arts and a champion of art being made,” said LACMA director Claire Foy. “Peter Sellars is an internationally admired artist whose work will help LACMA to reemerge as one of the most exciting centers for American art.”Peter Sellars’s work will be featured in the institution’s forthcoming exhibition “The Art of", "The next Biennial should be held in 2021. The 2020 event will encompass a series of projects, convened by Zaha Hadid Architects, including an exhibition of the work of Tadao Ando, a collaboration with the Lebanese artist Khalid ElBaradei; “Grand Scheme of Life,” a work by the Spanish artist Álvaro Pizzolatto, which will open the Biennial’s second iteration in 2022, and “The Planets of Venus” (2019), a program of architecture and landscape by the Italian architect Stefano Peselli.In celebration of the twenty-fifth anniversary of their inaugural exhibition, the artists are donating $5 million to the University and Community Sector of the Russian Academy of Fine Arts (RIA Novosti), which was founded by Vladimir Aleksandrovich. Citing the impact of the show on the country’s Art and Architecture, and on the city of Saint Petersburg, which was inundated by a tsunami in 2011, Igor Zaharovsky, the founder of the RIA Novosti Institute, said: “The exhibition has been a powerful catalyst to push the boundaries of what art can be and has been an unprecedented and exciting source of inspiration", "The next Biennial should be held in the summer of 2021. \n\n\nNina Turner, the bisexual pop artist who became a muse for the lesbian-and-gay rights movement with her 1976 song I Want to Hold Your Hand, has died at age sixty-seven.Born in Los Angeles in 1940, Turner, who studied painting and drawing at the University of California, Los Angeles (UCLA), became interested in the lesbian and gay community at age twelve. Her first work was a 1981 performance-art installation titled I Want to Hold Your Hand, which featured a woman holding a lover’s penis as a prop in the form of a mouth. Her second performance-art installation, 1996’s The Body: The Visual Art of Nina Turner, was staged at the closing ceremony of the New York Lesbian and Gay Museum (the Brooklyn Museum) in 2010 and included a painting of a penis that was used as a central figure in a 1981 dance at the Forum.In a 2013 Artforum feature on Turner, Jeffrey McKnight wrote: “In a way, Turner was a bi-sexual heroine, a lesbian heroine, and a gay-rights heroine. She was, in a way, the most important artist of her generation; her practice, her", "The next Biennial should focus on “The Body and the World,” which Mihajlovic will chair; “Makers: An International,” which will be held in Lyon, France; and “Spirited Away,” which will be held in Cologne. The first exhibition in the latter exhibition will open on December 9 and the last show in the latter will take place two weeks later.The biennial celebrates the Greek artist Antonia Biologos’s pioneering work in sculpture and painting from the 1970s to the late 1980s. The exhibition will include works by forty-two artists and will run until December 26. The full list of participating artists is as follows:Bakaratas Dolmenas (Turkey)Hannah Beasley (United Kingdom)Abdiagram (Romania)Anastasia Bogus (Russia)A. L. Barran (Turkey)Anastasia Brancusi (Italy)Anastasia Camacho (Spain)Anastasia Corrigan (Italy)Anastasia Dallier (France)Anastasia Dallier (France)Anastasia Dallier (France)Anastasia Dallier (France)Anastasia Dall", "The next Biennial should focus on the history of visual art from the middle of the nineteenth century to the present, focusing on the debate over the meaning of the twentieth century, of the twentieth century and recent colonial transformations. The next exhibition should aim at fostering a sense of commonality between South and Southeast Asia, focusing on the history of art and its visual arts.“As we move into the twenty-first century, we need to re-imagine the relationship between art and our own lives,” said K.J.D.\n\n\nThe Pérez Art Museum Miami (PAMM) has received a storm of criticism for its decision to honor the Holocaust Memorial Day holiday with a retrospective of artist Ron Gorchov\u0097a renowned proponent of the “Third Reich” who was executed by the Nazis in 1945. The institution, which prides itself on championing and protecting the legacy of Cuban American artists, announced its plans to mark the occasion with a telethon on Thursday, October 17, and announced its response to the controversy in a letter on its website.The letter, which was written by curator Maria Corina, director of the Pérez Art Museum, and architect Manuel Rovira, outlines the reasons behind the", "The next Biennial should take place in a year-round setting in the heart of the Museum’s historic Guggenheim in 2021. The theme of the upcoming edition of the Biennial is “Matisse & Picasso.”To purchase a copy of the exhibition, visit the museum. \n\n\nThe Museum of Fine Arts (MFA) has appointed Christine Adler as its next director. Adler comes to the institution from the Museum of Contemporary Art (MCA), New York, where she has served as director of exhibitions since 2015. Previously, she served as assistant director of curatorial affairs at the MCA between 2008 and 2012.“In her new role, she will be responsible for guiding MFA’s curatorial, development, and relationship with the community, as well as facilitating the museum’s acquisition and public experience programs,” said director Christopher Levy. “In addition, she will be responsible for developing and strengthening the museum’s institutional relationships and learning community.”“I’m thrilled that Christine will be joining us at MFA,” said Levy. “Her proven track record and proven ability to transform the MFA into a respected leading arts institution will", "The next Biennial should be held in 2020. “With this announcement, the Guardian and the Center for Contemporary Art London and the National Gallery of Art in New York are moving forward with their 2020 plans, which will include a biennial in 2021,” said Andrew Wiles, chief executive of the Center for Contemporary Art.  The National Galleries of Scotland are also planning to expand the activities of the National Museum of Scotland, which will become a permanent home for the collection of around twenty-five of the country’s major works, including David C. Driskell’s 'The House of the Spirits', John Neville’s Intermission, and Edvard Munch’s The Seventh Seal.In addition, the National Galleries of Scotland announced that it will collaborate with the Grand Modern Museum in London on a new exhibition about paintings by Douglas Grant, which will open in 2020. The show is titled “Douglas Grant: Work and Mourning” and will be based at the museum. “We are delighted to be working with the National Galleries of Scotland to present a show dedicated to the work of Douglas Grant,” said Stephen McPartland, director of the National", "The next Biennial should have a number of exhibits that will reflect on themes that have been previously explored by our artists, and which will also have a higher degree of artistic integrity. The exhibition will be composed of an exhibition of the works of the first few years of its life, in the form of a lecture series, and will take place at the Promenade del Parco in Venice. The biennial will be organized by the museum in partnership with the local branch of the Biennale di Veneto. It will be inaugurated by a presentation of the work of Fabrizio Cipolotti, from the collection of the Institute of Contemporary Arts, the Mayor of Venice, the city of Venice, on May 29.The twenty-fifth Venice Biennale will take place in the city of Venice, in the suburb of Reggio Emilia, from May 23 to May 29, 2020. The first exhibition of the new millennium, the “After the Fall” (Day of the Fall), will open on December 21, 2020. \n\n\nThe Swiss Federal Office for the Protection of the Arts (BfV) announced today that it has lifted its prohibition on the sale of works that are not “authentic�"]