["The next Biennial should be held in 2021. The first iteration, which premiered in the United States in 2002 and was followed by a second, which was held in 2006, was shown at the Venice Biennale in 2009.\n\n\nSidney and Lois Eskenazi, the New York–based art-world partners whose New York gallery pioneered the modern art-world practice, have been awarded a $25 million advance in their fight to secure the future of the Eskenazi name, which has been synonymous with luxury watches and watchesmaking for more than eighty years. The partnership, which became a landmark in the development of the art-world and a symbol of independence from corporate interests, was established in 1996. “The partnership’s legacy is built on its ability to support artists, artists and their projects,” said Eskenazi. “Lois and I are thrilled to support this important project of protecting the Eskenazi name through a successful, mutually beneficial, and legally binding settlement. We are confident this will pave the way for future collaborations and future growth.”The heirs of the brothers who founded the Manhattan–based firm of Eskenazi brothers, Sid and Robert, as well as three former partners, Carl K", "The next Biennial should be completed in the spring of 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has welcomed three new members to its board of trustees: artist and former board member Bernardo Fusi, who will serve as vice chair of the board, and painter Craig Ferguson, who will serve as chair of the arts and culture committee.“The museum is excited to welcome three new members to the board of trustees,” said museum director Klaus Biesenbach. “Bernardo Fusi, Craig Ferguson, and Lissi Etchenguía are passionate supporters of cultural diversity and we look forward to their diverse perspectives and experience as we work to create new opportunities for Chicago’s arts and culture.”Fusi, who was appointed the museum’s board president in December, represents the first Latino artist to serve on the board since the institution’s founding in 1919. Prior to joining the board, Fusi was a founding member of the Association of American Painters, an organization that supports artists who are immigrants or born in the United States and helps them become members. Commenting on his appointment, Fusi said: “Our board of trustees has been", "The next Biennial should be held at the Museum of Contemporary Art (MoCA), New York (the institution has not yet determined a date); and, next spring, the first exhibition should open at the National Museum of Art, Washington, DC. \n\n\nThe Laundromat Project, a Seattle-based nonprofit that provides free medical and surgical care to homeless and at-risk populations, has received $75,000 from the Seattle Community Foundation (SCF), a Seattle-based organization dedicated to arts and culture. The funds will go toward establishing a new endowment for the nonprofit, which was established in 2014 by artist and philanthropist Tanya Bonakdar and philanthropist Ina Haruna in honor of the late Laundromat Project founder Paul Mpagi Sepuya, who died in December 2019.“We are ecstatic to receive this generous gift from the SCF,” said SCF President and CEO Aleksandra Zavitskaya. “Having donated to Laundromat Project in 2015, we knew that the foundation was making an excellent choice in supporting a unique and promising arts organization. We were confident that the $75,000 could be leveraged to create more opportunities for our", "The next Biennial should focus on the ancient heritage of Los Angeles, the city that has drawn the nation and the world. Its theme should encompass the art and social history of the city, as well as the life and growth of Los Angeles.”\n\n\nThe German city of Frankfurt announced on Friday that it has received US$8.1 million ($8.2 million) from the Federal Cultural Asset Relief (Bundesamkeiten) program, which was established to help Germany’s cultural sector recovery after the financial crisis. The funds were distributed to the Frankfurt Institute for Contemporary Art (FICA), the Frankfurt Art Museum, the Stölz Museum, and the Deutsche Bank Collection, which together represent at least 55 percent of the collection.The Bärenzeitkonf (Bundesamkeiten) was established in 2007 as a replacement for the Bauhaus, which closed in 1999. Since its inception, the institute has awarded over US$6 million to artists, artists, and art museums. Led by ex-Bauhaus director Joachim von Bruenchenhein, the institute focuses on using art and modern technology to address societal problems", "The next Biennial should begin in January 2021. When it does, the program will include a fifty-minute oral history of the exhibition, curated by artist-in-residence María Berrada; a retrospective of the work of the same name, curated by artist-in-residence Agustín Pérez; a performance and a film by the same artist-in-residence, José Mercedes Fernández; a sculpture by Carlos Estevez; and a performance by artist Nuria López Rivera. \n\nThe Chicago-based nonprofit Art in America, which has staged exhibitions by artists such as Mark di Suvero, Elle Rignot, Jasper Johns, and John Akomfrah, will welcome artists from twenty-five countries to Chicago next month for its fourth edition, Art in America: The Next Generation, which will be held at the Chicago Arts Museum (CAM). The event will feature forty new works by twenty-two artists from twenty-six countries. The art-world biannual will focus on themes of adaptation, change, and solidarity, and will launch on January 9.“We’ve been reflecting on the ten years we’ve spent in a state of transition", "The next Biennial should be in February 2021. The twentieth will be in March 2020. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Melanie Gebbia as associate curator of modern and contemporary art. Gebbia will serve as a senior curator of modern and contemporary art at the institution through June 2020, when the institution’s fifty-fifth edition, “The Modern Present,” will open at MoMA.“Melanie is an accomplished and talented curator who has worked tirelessly to build MoMA’s contemporary exhibition program, and ensure that MoMA’s exhibitions reflect the breadth and depth of its collection,” said Museum director Marc Straus. “Her ability to develop and execute innovative, ambitious, and sometimes surprising exhibitions that address significant contemporary issues will be especially important in guiding MoMA through the inevitable next phase of its development, which will include the renovation of the museum to incorporate even more exhibition space.”Gebbia represents a unique and enormously influential cross-section of artistic practices and curators in the United States. She is an accomplished educator, writer, and performer, having taught at the University of Minnesota (MN) and the University of California, Berkeley,", "The next Biennial should take place at the Burning Man Art Center in Nevada in 2021. “The Burning Man Art Center is a unique cultural space in the desert that is dedicated to the creative process and the art of the desert,” said Mark Ruffalo, executive director of the San Francisco Arts and Culture Coalition. “The Burning Man Art Center is the place for the art of the desert and the art of the desert is the Burning Man Art Center.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles (LA) is planning to move the entire exhibition catalog from its current location in Downtown Los Angeles to the Los Angeles County Museum of Art (LACMA), the Los Angeles City Councilman Kevin Faulconer announced today. The decision, which will also allow the institution to reexamine its current location in preparation for the 2020–2021 season, was made in collaboration with the local community and was made after discussions with local, regional, and state officials, as well as with the Los Angeles County Museum of Art, which is currently evaluating its options in relation to moving the catalogue to LACMA, as part of a multiyear project that began in 2008.“The decision to relocate the entire exhibition catalogues", "The next Biennial should take place in the Neue Galerie in Berlin in 2021. Its successor will be held in the same venue. The organization will soon decide whether to renew the position of the Architecture Museum in New York with the announcement of its next leader, Laurie Woolf. In a letter published by the association on June 15, the architects said: “The decision to move our exhibition and research center from New York to Berlin was made in a spirit of openness, collaboration, and mutual support. The Venice Architecture Biennale has been a great success, with its thirty-sixth edition taking place in 2017, and we are grateful to the many participants of the exhibition and the partners of the exhibition for their support and encouragement.”The move follows a wave of departures from the organization. The CEO of the Architecture Museum, Stefano Gattuso, who took the helm in January 2018, informed the institution that he was leaving after a year in March 2020. The departure coincided with the conclusion of the Art Institute of Chicago’s 150th anniversary, which was held at the museum’s new location in Grand Rapids, Michigan, in March. G", "The next Biennial should be held in 2021, the artistic director of the Museum of Modern Art (MoMA) Frank Gehry told the New York Times. The museum has already staged its seventh edition, the Museum of Modern Art (MoMA 7), in 1976. The 2019 installment, held at the Museum of Modern Art, held its first exhibition featuring work by contemporary artists in 2019.\n\n\nThe Brazilian artist and filmmaker, who made a name for herself as a pioneer of film-making and music-making in the 1950s and 60s, has died at age eighty-six. The late Feliciano Delafuente, a confidante of Fabiana (1935–1969) and one of the few living members of the Cuban-born group Ato Domínguez (which would later become Domínguez Triennale), and his wife, Lucia, were commissioned to create a new work on the occasion of their fifty-fifth anniversary. Delafuente and Lucia were unable to come up with a title for their work, which came to be known as Ato Domínguez: The End of the Story, for which they worked with the artist to find a phrase for, and to create a plot for the artist", "The next Biennial should take place in 2022. The 2019 iteration, titled “Nature in Motion,” featured work by forty artists, including Anna Atkins, Cristina Berg, and Roshni Patel.\n\n\nA jury comprising academics from the University of Oxford, the University of Cambridge, the University of Oxford, and the University of Cambridge has concluded that artist Salah Abou-Rahme is the winner of the £5,000 Artist Prize. It was announced at a ceremony at the Serpentine Galleries on London’s West End on Friday. Inaugurating the prize, which honors a British artist who has created work that is 15,000 times larger than the artist’s original concept, was a presentation of a new collaboration, featuring work by fifty artists.The jury that selected the finalists was chaired by Professor Ian Johnson, director of the Centre for the History of Art at the University of the Arts London; Richard Anderson, director of the Central Library in Oxford; artist-in-residence Hisham K. Zia; and artist-in-residence Martino Lippi.\n\n\nThe National Geographic Society has announced that it is launching a new study series that will analyze hundreds of years of photographs to better understand", "The next Biennial should take place at the deCultur Museum in Dusseldorf, Germany, in 2021. The show will showcase the work of the biennial’s previous iteration, which concluded in 2018, and will showcase new work by the artist-run collective.The festival, which was founded by the artist and German businessman Jochen Kaufmann (who also owns the Swiss architectural firm Lutz Bode), was launched in 2007 as a way for artists to collaborate on a global level. However, its original locations--at the Museum of Modern Art and the Museum of Modern Art, New York, which inaugurated the festival in 2013--have remained unknown.In an effort to facilitate more participatory art exhibitions, the Museum of Modern Art and the Annenberg Museum in Los Angeles launched the New York–New Jersey–New York/New York Center for Contemporary Art in 2015. The center, which recently celebrated its first year of operation, has since hosted over one hundred artists, artists’ studios, artists’ organizations, and collectors. The museum also established a $1 million fund for artists and their artists’ studios in 2017.\n\n\nThe Asia Contemporary Art Museum (AACM) in Japan has been forced", "The next Biennial should take place at the United States Embassy in Paris, which will host a public viewing of the exhibition on September 9. The exhibition will also screen a selection of biennial works by artist-in-residence and solo exhibitions by the artists.The exhibition will be followed by a book launch, which will start at 6 PM on September 8, and will run for twelve weeks. At the end of the year, the biennial will have presented fifty works. The next edition will be organized as a biennial of workmaking in the form of a show, which will last for twelve weeks. The 2050 theme is “Community and the Present: Regeneration and Art in the Age of Black Death.”\n\n\nThe Venice Architecture Biennale, which kicked off in May and ran through November, has announced a financial restructuring for its 2020 edition. The 2020 edition, titled “Between the Sun and the Moon,” will be held at the Mestalla space in Venice from November 26 to March 23, 2021.“We have introduced a series of new programmes that will allow us to adapt our event to the needs of the city,” organizer Giuseppe Barbera, who also serves as the president", "The next Biennial should be called for the new year and will be held in the spring 2019. The programme, which has focused on contemporary art since 1935, will also include a new exhibition. The exhibition will be organized by the New Art and Art History Museum Oslo and will be housed in the Announmid Gallery, from March 9 to March 11, 2020.Lonely Planet will not be the only brand to welcome visitors to the brand’s new space in the city. On Thursday, the brand announced that it will open an outpost in the Ruksdalenstraße, an old post-industrial building in the heart of downtown Oslo, in the autumn of 2020. The space will be inaugurated by a preview of the brand’s new series of original installations by artist Prada. The show will be curated by Yuki Naito, producer of the Danish television series 'Midsomer Murders'.The new space will offer a contemporary exhibition space for the brand’s international artists. In addition to the artist studios, an underground “side bar” will be created in the building and will feature local and international artists. The show will also feature a number of new works by artists who are currently working, as", "The next Biennial should be held at least one year after the inauguration of the new government. “This is a challenging and urgent situation, when the leadership of the country is in danger of being dismantled, and the artists are being forced to make difficult decisions,” said artist Kamelani Hamdan, a cofounder of the Group for Cultural Preservation and a member of the committee. The new constitution, which was adopted by the National Assembly on Friday, also outlines the government’s response to the coronavirus, which is set to be implemented on January 1, 2021, and the country’s financial and economic situation. Art\n\nThe Art Newspaper reports that the 2014 Venice Biennale, which featured work by more than 150 artists, was marred by a heightened police presence as protests against police brutality and the austerity measures taken by British Prime Minister Boris Johnson grew.Thousands took to the streets of the Italian city in February to protest police violence and a corruption scandal that has rocked the city and rocked the country for years. In the weeks leading up to the protests, Italian media outlets reported that police had used tear gas and rubber bullets on peaceful protesters.On Saturday, March 5, thousands of protesters marched through the city of", "The next Biennial should be held in 2022.  The biennial’s next edition, “Towards a World Without Borders” will be held in Florence in December 2022 and will present works by seventy-two artists, including Rachida Nal, Julia Collette, Luiza Catellani, and William Bonaventure. The theme of this year’s edition will be “Transhumanism and the Use of Machines” and the theme of the twenty-third biennial will be “Art and Artifacts.” The twenty-fifth will be “Posthumanism and Self-Transcendence” and will reflect on the legacy of the late Russian writer and philosopher V.A.S. Mikhailov; a great-grandson of the Rustic, Russian aristocracy; and the Algerian writer Ahmed H. Abou-Rahme.\n\n\nThe sixteenth edition of the Venice Biennale, curated by Pierpaolo Verzier\u0097which was originally scheduled to run from March 21 to March 24\u0097has been pushed back due to Covid-19. The event was originally scheduled to take place from May 12", "The next Biennial should open in 2020, but no date has yet been set. \n\nWells Fargo, which is being sued by its former employees for allegedly rigging the US stock market by launching the largest ever employee buybacks in 2016, is being sued by an additional ten former employees, including a former executive director of the investment bank. The move has forced the bank to reevaluate its internal operations and resulted in a massive loss of data.According to the New York Times, the department that enforces the federal Fair Labor Standards Act (FLSA) is alleging that Wells Fargo knowingly and intentionally underreported the number of employees who lost their jobs through the pandemic and then tried to cover it up by hiring dozens and then hundreds of people to work on marketing and customer service departments.The allegations are made in a lawsuit filed by the New York attorney general on April 8, which also accuses Wells Fargo of illegally compounding negative cash flow—i.e., the bank attempted to use negative interest rates to push down the cost of mortgages—thus driving up the price of mortgages—and of illegally transferring money from customers to employees.The bank faces up to $185 million in penalties. \n\n\nThe library of the University of Oxford has launched an online database that", "The next Biennial should be held at the Contemporary Art Museum St. Louis, with a view to the Cultural Center. It will begin with an exhibition of work by various artists and will consist of two partuimes.The first part, entitled 'The Passenger, 1961–1975,' will consist of an introduction by the curator and writer Roberta Smith, an introduction by the artist Mike Kelley, a collection of photographs by the late industrialist Anna Atkins, and a presentation of Phyllis Chesnoff’s photographs of her own children, the artist Michael Brooke. The second part, “Shadows on the Floor,” will be an announcement of a new collaboration between the museum and the artist Reina Bocchieri. The first part’s opening was originally scheduled for November 15, but the date was pushed back to January 7. Smith and Kelley will collaborate again in the spring of 2020.\n\n\nThe National Geographic Society’s proposed redesign of its headquarters in Washington, DC, is facing backlash over its potential impact on endangered species, conservation, and climate change. On Tuesday, May 7, the Smithsonian awarded its 2019–20 National Geographic Society Design Award to the Paris-based architecture firm Ghebalym", "The next Biennial should be held in 2021. “By incorporating a diverse group of artists to create a work which addresses the themes of the festival, the museum, and the city of Melbourne, the Biennial is aiming to present an authentic and meaningful experience,” said curator and former director of the Arts and Humanities Institute, Sue Boldon. “This is a moment of great change for the city, and for our collection, and it is our obligation to adapt and innovate to meet the changing demands of contemporary life.”Castro Stone Gallery has appointed Kate Croft as its first director of contemporary art. Croft comes to the institution from the Art Gallery of Greater Sydney, where she has led the program since 2016. Her curatorial project will focus on developing a relationship between the artist and gallery in collaboration with curator and curator of contemporary art, Lina Madigan, and the artist’s husband, Lars Madigan.“I’m thrilled to see Kate in the role of director and excited by her vision to think and create about what a new director can achieve for the gallery,” said director, Caro Molloy. “Her creative approach and vision for the gallery will help us achieve that vision", "The next Biennial should be staged at the Museo de Cultura, near Madrid, in the summer of 2021. The organisers said: “The next edition of the Biennale will be a very special one, full of exceptional artists, of which the greatest number will be represented by the artists in attendance. The upcoming edition will consist of a number of projects dedicated to the theme ‘Deep Roots’ and will also address the recent events that have taken place in the country.”\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that in the coming months it will launch a new online portal that will allow visitors to see and purchase works by artists who have never been on view in person. The online shop will be launched as a part of the institution’s yearlong celebration of its 150th anniversary in May and will include a number of preview shows, including the one that opened last month at the institution.“The new museum portal will allow visitors to explore the exhibition exhibitions, and acquire works, in historic galleries throughout New York City, including the Museum of Modern Art and the Metropolitan Museum of Art, which will be celebrating its 150th anniversary next month, and will provide previews of upcoming exhibitions and special", "The next Biennial should take place in the spring of 2021.\n\n\nThe American Civil Liberties Union (ACLU) in California has filed a lawsuit against the City of Los Angeles, accusing the department of public works of violating the Americans with Disabilities Act (ADA) by excluding a group of artists—including Peter Sellars, Rosemarie Trockel, and Edward Hopper—from a 2019 edition of the Los Angeles Art Biennial.The suit, filed in U.S. District Court in Los Angeles on March 2, claims that the exclusion made it unlawful under the ADA. The artists are asking for an injunction to ensure the event is not held again without their consent and to require the department to ensure the artists are properly rescheduled.In support of the artists, the suit claims that the department has failed to notify the plaintiffs of the changes that will be made to the biennial and has failed to properly consider the changes it made to the exhibition. It also claims that the changes violate the artists' civil rights by making them subject to different protections than other participants in the event.“The city has made it clear that it does not believe that this is a case of people with disabilities having an unfair advantage over those with disabilities,” said", "The next Biennial should be organised in late September or early October. The 2020 theme is “Arts and Environment,” referring to “Arts and Environment,” and will be “In Good Company” with an opening reception at the Space in London on September 8. \n\n\nThe National Gallery of Canada has received a gift of more than one hundred artworks from the Vancouver-based thrift shop owner and philanthropist Ruy Teixeira.The institution also revealed that the museum’s new art installation, “Still Life and Blood,” is on view in its permanent collection gallery. The work, which takes the form of a series of blood-spattered paintings, was presented as a gift by Teixeira to the National Gallery of Canada in January 2019.The gift includes a bronze work by the artist that was created in collaboration with Robert Irwin, the National Gallery’s principal artist. The two worked together to create a tribute to the life and work of Robert Irwin that was on view in the gallery for an exhibition during the museum’s inaugural season in January 2020.The National Gallery of Canada’s board of directors also announced that Amanda Hall, the institution", "The next Biennial should take place in 2021. The festival is currently a year-round initiative that has been organized by the city of Baltimore and the Maryland Institute College of Art (MIA).  Considered one of the most important art-world events in the United States, the event has hosted more than one hundred exhibitions and has drawn hundreds of thousands of spectators each year.The biennial will feature works by seventy artists. Among the artists selected for the inaugural edition, which will be staged in Spring 2019, are Mario Martinez Cobos, Adrian Piper, Matisse, and Rossini. The program will be curated by Rania Jaber, director of the MCA Art Museum in Harlem; Lise Eliot, curator and author of The Catalyst: An Exploration of the Virgins; and Harriet Weems, the curator and founder of the Chicago Art Institute.A selection of works that are currently on display will also be presented throughout the biennial’s five-year run, which will run from March 15 to March 16. The full list of participating artists is as follows:Artsangela AlineBarto BianchiBartletta BrunoBenedict BrinkBenson CheneryBibi CarnerBibi", "The next Biennial should take place at the Museum of Contemporary Art Los Angeles (The MCA), which is currently remodeled into a new contemporary art museum, in 2020; and, on October 4, the New Museum, which is currently closed until at least the end of April, should host a second edition of the exhibition. Such an event would be inaugurated by a special exhibition of works by the artists represented in the first Biennial, “Xavier Hufkens” (2015–16).\n\n\nThe Museum of Fine Arts (MMFA) in Boston has welcomed artist-in-residence Jen Pettway to its staff, staff and community. Pettway—who is currently an independent curator whose work is exhibited at numerous museums and is a cofounder of the upcoming MFA/CAA show, “The Naked Truth: Contemporary Art and the Body”—will share a space at the museum with Amelia Marshall, the executive director of the MFA/CAA, and Sarah Leonard, the executive director of the partnership arts and culture organization the LASALLE Foundation.“I’m incredibly excited to work with Amelia and Sarah as we begin to develop a vision for the MFA for our community,” Pett", "The next Biennial should be held in 2022. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed John DeSimone, an independent curator and art historian, as its next director. DeSimone joined the museum in 2016 as deputy director of curatorial affairs and chief curator. During his tenure, he has organized more than sixty exhibitions, including the inaugural “Phantom Show: Artists on the Move” (2019); “Beyond the Cinema: MFA’s ‘X’ Series’ (2019); and “Theater of Operations: MFA’s ‘X’ Series” (2018–19).All of these exhibitions, which were organized with a $10 million budget and were hosted by the MFA in conjunction with the Museum of Fine Arts Boston, were selected by an international panel of curators and art historians. The jury comprised Pablo Téllez, director of the Corcoran Gallery in New York; Bénédicte de Montlaur, director and curator of the National Gallery of Art in Washington, DC; and Baillie Blanck, director and curator of Tate Britain.“John was selected from a shortlist that", "The next Biennial should be released sometime in the next few months, and will therefore not have a date yet announced.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed David K. Lucas as its next president and CEO. Lucas currently serves as the director and CEO of the Allen Memorial Art Museum in Nashville, Tennessee. Prior to joining the Allen Memorial, Lucas was the director of the Metropolitan Museum of Art. Lucas succeeds Tony Hsieh, who retired in May following twenty-six years at the helm of MoCA.“We would like to thank David for his leadership and for his significant contributions to MoCA as a museum and to the artists who have made and continue to make their contributions to American art,” said director Mel Ferris. “We are eager to work with David to continue to advance the museum’s mission of representing the art of today and future with an original vision and a history of experimentation.”Since its founding in 1968, MoCA has undergone two presidents: Robert Moses, who served as director from 2003 to 2012; and Christopher Wool, who served three terms as director of exhibitions and acquisitions. During his tenure, the museum raised more than $9 million for the care of", "The next Biennial should be held in 2021.  The biennial, which will be curated by Shikha Jha, the director of the Budhwar Masjid Architettory in Islamabad, will be inaugurated by a presentation of the exhibition The Satellite Years: From Pakistan to India, 1936 (1936, Munich), Artforum, New York, 2018. Biennials are an Australian expression that refers to an annual event of artmaking in a country where the number of entries in the biennial has been declining for several years. The 10½-week event will be held at the National Museum of Art in Canberra. \n\n\nThe Metropolitan Museum of Art in New York has appointed Alison Wright the next director of the Met, which has been closed since March 13 due to Covid-19. Wright joins the museum from the Brooklyn Museum in New York, where she has served as deputy director for the last two years. She succeeds Howard Rorschach, who served as the director of the Metropolitan Opera House from 2016 to March 2019, and will assume her responsibilities in August.“Alison is a visionary, driven leader who has led the Met through a transformative transformation,” Howard Stern, the chairman", "The next Biennial should also feature new works by artists such as Sōmei Keikaku, who is known for his work depicting the Greek mythological landscape, and Togo Ika, whose work is based on the concept of the geographical and the weight of space in his sculptures.\n\n\nGallery Roesler in Munich has appointed Johannes Wieder as its next director of photography. Wieder joins the gallery from the König Fischer Kunsthalle in Berlin where he has served as a director since 2016. He will assume his new role at the gallery in September. In his new role, Wieder will be responsible for the development and execution of photography exhibitions and promotions, and will have the responsibility of promoting and defending a collection.François Pinault has announced its representation of the artist-cum-district governor of the German state of North Rhine-Westphalia, Norbert Wiesner. Being represented by the gallery includes three years of the artist’s four-year contract with the state of North Rhine-Westphalia, which ends in 2020. The performance and installation center will be housed in the former factory building of Munich’s SKWAWKI, which is currently undergoing a $", "The next Biennial should be held at the end of the year. I am confident that the new venue will continue to attract visitors from all over the world and will continue to have a significant impact on the city of London.”The Tate also announced that it is scaling back on the number of exhibitions it will present in London in 2019. The news comes amid plans for the government to spend millions of euros to refocus the British economy on attracting and retaining foreign talent; Artnet reports that the UK is expected to lose around one hundred working artists to the United States by 2021. In a statement, the Tate said: “We are planning to present less work in 2019 under the new strategic plan to invest more in the arts, which will mean fewer exhibitions and media events. However, we cannot ignore the realities of our times and our colleagues, or the challenges ahead, so I am reviewing our 2019–20 season, assessing the situation and growing our understanding of our role in the world.”The news comes in the wake of the dramatic fall of the government’s flagship immigration reform, the 2017 UK-wide election that saw a majority of elected Conservative lawmakers vote against the bill that would have seen millions of migrants sent home from the country. Approximately", "The next Biennial should begin in April, to be followed by the 2020 edition, which is scheduled to take place in April 2020. As of June 30, the opening of the exhibition had been postponed three times. The exhibition is also undergoing a major reworking that will involve the restructuring of the exhibition as well as of the museum’s collection. In a statement, the Biennale said: “I am delighted to say that the future of the exhibition will remain at the heart of the Biennale, with the beautiful exhibition buildings, development of a new programme, exhibitions and performances, exhibitions at events that are over-arching the exhibition, and the exhibition of the works of Ruth Bader.”The 2019 edition, organized by Art Basel Hong Kong, was postponed from March 29 to March 28 due to the Covid-19 pandemic. The 2019 edition, which was originally slated to run from March 25 to March 29, was rescheduled for March 28 and the 2020 edition was also rescheduled for March 29. \n\n\nOrient Gallery in New York has announced that it is launching a fund with the proceeds from a new partnership with the Greek nonprofit organization, the Office of the Governor of New York, to", "The next Biennial should be held at least once every two years. The 2020 Biennial will be held at least twice a year. The 2020 edition will take place at the Haus der Kunst (HDR) in Munich, which will host the event. The event will feature a total of twenty works by artist-activists and activists from the Arab world.  The 2019 edition, titled “Made in CONNEC,” featured twenty-six works, edited by alt-artists Yaron and Yair Hoffman, and Olu Oguibe, and had a selection of works by artists from the African continent. \n\n\nThe Museum of Fine Arts (MoFA) in Miami Beach has received a gift of twenty-three works by American artist William Kentridge, whose paintings and drawings have been featured in exhibitions at the Brooklyn Museum, the Metropolitan Museum of Art, and the Whitney Museum of American Art, among other museums. The donation includes works by forty-four artists, including Richard Anuszkiewicz (New York), Frank Oz (New York), and Jean-Jacques Annaud (New York), among others. Kentridge’s work, which premiered at the Venice Biennale in 1992,", "The next Biennial should take place at the New York Public Library in 2021, with the Museum of Modern Art and the Metropolitan Museum of Art in New York City as the hosts.\n\n\nThe Global Fund for Contemporary Arts (GFCA) has announced that it will award $9 million to thirty-six artists who are facing prosecution for alleged copyright infringement. The thirty-four cases were brought by artists and organizations who claimed their works were copied from works sold by the German publisher Tagesspiegel, a subsidiary of German company Tagesschutz, and were slated to be unveiled at a special exhibition at the Berlin Düsseldorf Art Museum in November. “We have received many reports that have indicated that Tagesspiegel breached the copyright by distributing the works, whether in Germany or elsewhere, in the exhibition,” said Angela Richter, director of the GFCA. “We are therefore deeply concerned about the works that were shown in the exhibition and hope that they will be recognized as genuine works by the artists. In this case, the works were distributed by Tagesspiegel and the German federal state is trying to use the exhibition to argue that the works were made by one of the artists, namely", "The next Biennial should be held in 2024, and the previous one in 2021. Commenting on the upcoming iteration, Sundar Pichai, CEO of Google, said: “We are excited to be working with the Beijing Center to present an exhibition that will celebrate the creative spirit of our city, both on and off the screen. The 2016 exhibition was an inspiring experience, and we are eager to work with the Beijing Center to realize the next in order to expand our audiences and engage more people in the city.”\n\n\nThe International Academy of Fine Arts (I.A.F.A.) and the Chicago based nonprofit Artadia have committed to providing funding and resources to the Chicago-based arts incubator Artadia to facilitate its ambitious plan to launch a new arts center and educational initiative. The two organizations announced today that they have made an agreement to jointly invest $1 million in the new organization and its arts and culture wing, which will be located in the nearby industrial area of Clyburn, Illinois, in exchange for 25 percent of Artadia’s current assets.“This is an unprecedented situation for Artadia, and we’re working hard to ensure that this partnership will provide the support and opportunity that Artadia needs to", "The next Biennial should open in March 2020.  The inaugural exhibition, “A History of Violence: The Social Imagination in Late Antique” will lead the way for future biennial exhibitions on violence, art, and its effects. This event will be followed by a three-day event, “Post-War: Art and the Occupation,” in January 2021. “From the powerful Collective Arms movement of 1919 to the Revolutionary Workers Party of the 1930s, from the black Power movement of the 1960s to the environmental Justice movement of the 2020s, Australia has given birth to a multitude of voices, many of them feminist, anti-racist, anti-capitalist, anti-racist, anti-imperialist, anti-imperialist-syndicated, anti-imperialist-syndicated, anti-imperialist-syndicated, anti-imperialist, anti-imperialist, anti-colonial, anti-colonialist, anti-colonialist, anti-imperialist, anti-colonialistic, anti-imperialist, anti-colonialist, anti-colonialist, anti-colonialist, anti-colonialist, and anti-colonial.�", "The next Biennial should be held in 2020. \n\n\nThe Fifty-Eighth Venice Biennale announced today that the sixteen artists who will represent Europe at the 50th Venice Architecture Biennale, which will take place in the city of Venice, Italy, from January 25 to February 29, 2022, are: Valeria Solari, Andreas Härtgen, Luka Mlaksevski, Mara Poli, Igor Sims, Andrea Vergara, José Malanga, Carol Yeo, Andrea Zanotti, and Sara Zegher.The exhibition will also include a selection of works from the singer and dancer Carmen Carroni, the sculptor Gerhard Richter, and the contemporary artist Wolfgang Paalen, and will launch on February 8, 2022. The twenty-fifth edition will also focus on the concept of collective memory, with works by the same artists represented in both editions.Commenting on the upcoming event, Vincent van Gogh wrote: “The twenty-fifth edition of Venice Architecture Biennale would not have taken place without the help of the commission of Málandro Lucio (De)", "The next Biennial should focus on the lives and works of women; in particular the remarkable female artists and thinkers of the twentieth century. The following year will mark the centenary of the publication of the first Berlin Biennial; and the twenty-fifth anniversary of the Berlin Gallery (B.G.). The theme of the twenty-fifth will be “Life and Art in the Twenty-Fifth Century” and the theme of the twenty-fifth will be “Life and Art in the Twenty-Sixth.” The fifty-fifth Biennial will be “Life and Art in the Twenty-Seventh Century,” and the fifty-sixth will be “Life and Art in the Twenty-Eightth.” The artist-run space Helsinki Gallery Group is seeking a new director for the institution, which has a permanent collection of more than eighty thousand works, and of the artist-run institution in Helsinki and the surrounding region. The proposed restructuring is detailed in a document which is designed to be presented to the institution’s assembly slated for November 22 and is dated November 18. The twenty-fifth Biennial will be held at the Panorama Gallery in downtown Helsinki from January", "The next Biennial should be on December 28, 2020.  In order to facilitate the exhibition, the National Gallery in London has placed the 2019–20 exhibition on indefinite hiatus. The exhibition is currently on view until January 23, 2020. The National Museum of Fine Arts, New York City, is also suspending its 2020 exhibition, “The Art of Painting.” The exhibition will resume on January 24, 2020, with a redesign that will present a series of paintings by the late Pablo Picasso, and will run until March 22, 2020.\n\n\nThe Museum of Modern Art (MoMA) is preparing to launch a new digital platform that will allow visitors to view exhibitions and other programming online. Called the MOOD portal, the initiative will allow museumgoers to enter the museum through an app that will track their location and will send them instructions on how to enter.It will also allow MoMA visitors to interact with other curators and museumgoers, such as by giving them access to the museum's online viewing rooms and by providing them with a way to report their experiences with the museum. The MoMA app will be powered by MoMA’s existing cloud-based technology and will offer visitors an unprecedented", "The next Biennial should be held at the Architecture and Design Museum in New York in 2021, and the organizers are currently drafting an open letter to the institution. \n\n\nIn a decision that may set a precedent for future eliminations, the Virginia Museum of Fine Arts in Richmond (VMFA) has decided to reduce its workforce by one third since it will not be reimbursed for overtime work performed by workers under the age of sixty who were scheduled to work at least forty-eight hours a week.According to the Richmond Times, the decision has forced a change of plans for hundreds of staffers who will be laid off during the immediate recall period, which runs from April 8 through April 10. While the institution expects to see a decrease in revenue in the first half of the year, the staff has expressed optimism that the downturn will be eased by the end of the year.“I’m hopeful that we can bounce back in a positive way,” said V.M.A. director Victor Meade. “I’m hopeful that we can live up to our mission to advance the civil rights of all Virginians.”\n\n\nSouthbank Centre, London. Photo: Gustavo Alfonso III/Getty. \n  ", "The next Biennial should take place in 2021.\n\n\nThe University of Alberta in Calgary is working to move forward with the construction of a new professional arts and culture complex designed by the French architect Frank Gehry, a professed friend of the city and founder of the Gehry Foundation, in support of the city’s arts and culture. The $600 million project, which is slated to include an exhibition house, a library, and a museum, is part of a larger plan to transform the city’s environs, which includes the construction of a new postgraduate art center and the revitalization of an existing park.“The new Hamilton campus is envisioned as a hub for contemporary art and public life, curated by a team of curators and art historians,” said city administrator Neville Hooper. “The Gehry-designed complex will integrate human and natural elements to create an environment for cultural exchange and reflection, promoting a more interdisciplinary approach to art.” The Gehry-designed Hamilton campus was selected by a committee comprising architect and architecture professor Richard Whittle, Hamilton Mayor Naheed Nenshi, and architect and urban designer Richard Corrigan; Hamilton-based sculptor Adam Gardiner; and Hamilton city council", "The next Biennial should be held in 2020. The Biennial Awards are named after the Biennial Awards are a series of awards presented by the Museum of Modern Art in New York to honor outstanding achievements in the field of Modern Art. The awards are given annually to individuals and organizations that have served as a model and inspiration for future awardees.Each year, the biennial awards a total of $1,000 to approximately seventy-two artists. The 2020 awards, which were selected by the biennial jury, are:Tadao Ando, TokyoMatsu, Japan | Hiroshi Onishi, TokyoMatsu, Japan | David Hockney, ChicagoChicago, US | Christiane Remarque, New York, USCredits: David Hockney, Chicago, Christiane Remarque, New York, USDavid Kohn, New York, USProjects:David Kohn, New York, Christa Farnsworth, London, USNotes: The Biennial Awards are not really awards—they are a series of awards given by the Museum of Modern Art in New York to individuals who have made important contributions to Modern Art. The winners are chosen by a panel consisting of David J. Hauser,", "The next Biennial should be staged at the newly renovated 'Amitgallad Museum of Art' (Amitgallad, India) in 2019. The institution, which is currently undergoing a $10 million expansion, has also been awarded a ¥7.5 million donation from the Bodosha Family, which owns a large conglomerate of steelmakers, in support of its project to present the fifth edition of the Japan Triennale in 2021. The project was originally announced in 2020.\n\n\nThe museum’s former director, Edward Deenholtz, has resigned following a heated and public dispute with the Chinese government over the museum’s expansion. Deenholtz, who has been described as a moderate by some museum heads, was replaced by chief curator and director of curatorial affairs Adrienne Edwards. Edwards announced her sacking on Monday, March 24, citing the current crisis as the reason.“The museum has been through more than it’s fairs can take and the museum is in a spot where it may not survive the next phase of the global crisis,” Edwards said. “I’m delighted that Edward has stepped down from his position as director and am deeply proud of", "The next Biennial should include a presentation of works by LaToya Bossuyt, Omar Khayyam, Mark Borthwick, and John Akomfrah.\n\nThe Philbrook Foundation, which is based in New York City and operates an Endowed Endowment Fund, announced today that it has awarded $1.5 million to seventy-eight artists, including Kathryn Bigelow, John Gavin, Anne-Marie Green, and Janice the Baker, for their work in the year 2020.The maximum grant for the 2020 year was $1.5 million, and the foundation will distribute $650,000 from the fund to support the annual DA awards. Five artists have received the award so far: David H. Campbell, Shih Chien-Yi, Jin-Beoyong Yang, and Min-Ju Lee.The foundation has partnered with the Association of Art Museum Directors (AAMD) to award grants to sixty-seven museums in the United States. The program, called the Philbrook Curator Grant Program, awards $250,000 to the top twenty-five visual artists who demonstrate exceptional leadership and vision in the field of art history. Previous winners include Kate Kiefer, Richard Lee, and Rachel Carson. The Phil", "The next Biennial should take place at the Museo de Arte Contemporáneo in Bogotá, beginning June 13. The proposed event, titled Art in the Age of Resistance, will invite contemporary artists from around the world to participate in exhibitions and residencies. The theme of this year’s exhibition will contemplate the struggle of migrants in Central America and the Caribbean, as well as those currently living and working in Spain. The exhibition will aim to raise awareness about the challenges that immigrants face, both domestically and internationally, as well as to provide a platform for the promotion and protection of rights and freedoms of migrants. The exhibition will also feature work by fifty artists, including Gabriel García Márquez, Roberto Aicke-Kamper, Nora Arikawa, Patricia Arquette, and Satara Safran, as well as a selection of works by artists from Africa, the African continent, and the Caribbean.The biennial will take place in the museum’s collection space that was designed by architect Bernardo Corradi and will be inaugurated by the construction of a new pillar for the institution, which will be dedicated to Arts and Architecture.", "The next Biennial should be the end of March. The site will host the first annual biennial of artist-run spaces in the city, the 2013 event, which was organized by the Museum of Modern Art (MoMA) and the Whitney Museum of American Art, was shut down by the virus. The London-based artist-run space Sending Larsen, which is also owned by Eli and Artim, is preparing for a possible loss of income as more people contract the coronavirus. If the center is forced to close, then the artists’ studios will likely be displaced, and revenues will likely be reduced.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed ten new curators to its curatorial staff: Adrian Wojnarowicz, the inaugural director of the John F. Kennedy Center for the Performing Arts; Alexandra Gladman, who will hold the title of curator of the Kennedy Center’s Kennedy Center for the Performing Arts; and Lars Langreich, the director of the Whitney Museum of American Art in New York City.“The new hires join the eleven remaining staff members of the museum, who collectively represent twenty-four years of experience in the field,” said museum director", "The next Biennial should take place in the autumn of 2020, at a date yet to be announced by the organisers. The next edition will be held at the Royal Academy of Arts (RA) in London, which will stage a special exhibition in collaboration with the Italian Cultural Center in Genoa in October 2021. The exhibition, titled 'The Future Is Present: Art and the Birth of Modernism in the Twentieth Century,' will include works by more than sixty artists.\n\n\nEvent organizers have announced that they will suspend the inaugural edition of the Art Basel Hong Kong ($5.8 million) fair until March 19, 2020 after a report found that the air quality in the city was worse than at any point this year. The event, which has been held in Hong Kong since 2006, will come to a close on March 16.Organizers said that the decision to suspend the event came after taking into account the latest developments, including the ongoing pro-democracy protests in Hong Kong, and the development of the coronavirus.“As we continually review the Art Basel Hong Kong 2030, we believe that a transition to a new air quality standard is needed,” said Erik Teijtsev, senior director of the Art Basel", "The next Biennial should take place at Liverpool Art Museum (LIM) between May 14 and May 19, 2019.  The 2020 event will be held at the Museum of Contemporary Art, Los Angeles, and will showcase the work of twenty-four artists. The 2019 theme was 'Transhumanism and Organic Design: The Art of Human Intersection, ” which was curated by Elinor Costa and Gina C. Tanaka. The 2020 iteration of the event will focus on the fate of nature and art and will include an open-air platform created by László Molnár, the artist-in-residence at the museum. “I’ve been thinking about how László Molnár and we could collaborate on the theme of the exhibition for a long time,” said László Molnár. “I understand the exhibition space very well, so I feel very comfortable with the plan we have now. I hope that the art of the catalogue will also remain the same.”Organized by the László Molnár Foundation, the 2019 edition of the biennial, “Art of Transhumanism", "The next Biennial should be titled “We Are the Future,” and its theme should be “Human Ecology: Its Progress and Future.” The exhibition will inaugurate a new library dedicated to the museum’s collection, which is currently housed in the institution’s former home, the New Museum.The biennial will be organized as a series of exhibitions, culminating in the exhibition “Le Corbusier: The Man and the World.” Tragically, the exhibition was never implemented. The Biennial of Reflections was to examine the legacy of the French surrealist and Marxist thinker Jean-Luc Godard.The first show will feature new works by artists such as Michelangelo Antonioni and Alexander Calder and will run at the Biennial of Sculptures from September 8 to September 10. The second show will present works from the biennial’s inaugural exhibition “Martin Luther King’s Speech on the Birmingham Riots” and will run at the Contemporary Art Museum in Miami Beach from September 10 to September 12.The Biennial of Photography, which will be staged at the Contemporary Art Museum in Miami Beach from September 14 to September 17, will present works by artists such as Sean John and Amed", "The next Biennial should be in 2020. \n\n\nThe Stiegler Gallery in New York and the proposed redesign of the Whitney Museum of American Art in New York are making preparations for legal action over the inclusion of a transvestite artist, whose works were part of a series titled The Stieglers Portraits (1952–1963), in a forthcoming exhibition at the gallery. The exhibition, entitled “The Stieglers Portraits: Ten Years of Portraits,” will be staged at the Whitney Museum of American Art in 2020 and will focus on the artist’s new museum in New York, which was commissioned by the philanthropist Richard Gere, and the contemporary art world practitioners who created works based on the lives of the men and women featured in the portraits.“We have been discussing this exhibition for some time,” said Michael Waldman, the gallery’s director, who was involved in the reopening of Ocwen Gallery in London last summer. “Only recently, after the exhibition’s opening, did we realize the significance of what was on the table.”While the exhibition “The Stieglers Portraits” has been on view since July of last year, the", "The next Biennial should include a new exploration of the modern and contemporary world, a new theme and an entirely new format.” To join the Biennial, go to www.bibliothèques.fr/ and click on “Welcome to the Biennial!” Pieces that were on display previously at the Biennial will be detailed in the upcoming exhibition. The exhibition will run from March 26 to March 28. The first exhibition organized by the Biennial was “The Future of Art: From the Collections of the Deutsche Kunstbibliothät, Berlin,” which opened at the Museum Stiftung Mainz in Berlin in the fall of 2018. The biennial will be inaugurated by seeing-through the collections of Yinka Shonibare, the primary curator of contemporary art at the Friedrich-Allee Art Museum in Munich; Hiroshima Museum of Fine Arts, Japan, and the Golden Gate Museum of Art, San Francisco.\n\n\nThe Los Angeles County Museum of Art (LACMA), which was forced to temporarily close its doors last month as it began the construction of its new $450 million building due to concerns around Covid-19", "The next Biennial should be in March 2020. \nPosted by Stephanie at 8:09 AM<|endoftext|>Welcome to the third edition of CityLab in partnership with the Los Angeles County Museum of Art (LACMA) and Artists’ Land, the Los Angeles County Museum of Art (LACMA), and the Greater Los Angeles Arts and Culture Committee (GLAC).“In a time when it seems impossible to have a meaningful dialogue about art and culture without also discussing the impact that art and culture has on our communities, it is imperative that LACMA and Artists’ Land work together to create a dialogue about the future of art and culture in Los Angeles,” said LACMA director and CEO Loring Randolph. “We will be celebrating our twenty-fifth anniversary next month and are proud to say that we have spent the last eighteen years working together to support and encourage this work of art and culture, to present the latest and greatest works of art and art and art and culture in the city. We will continue to do this work together, as we have since LACMA’s founding, and continue to re-create new experiences for our audiences with engaging and thought-provoking exhibitions and programming. We are committed to", "The next Biennial should be announced in mid-September, with the exhibition opening in May. The biennial will also mark the theme 'HEADS UP: Art in the Age of Climate Change, 1950–1970'.The biennial will follow the theme of the exhibition “A second half of the twentieth century: a second half of the twentieth century in art.” The biennial will include the work of eighty-six artists, ranging from the British filmmaker Ralph Ellison to the Egyptian-American sculptor El Paso Cruz. The selected artists will then have the opportunity to present the next iteration of the exhibition.The biennial’s first iteration, “A Second Half of the Century” (2019), was organized by the British group Art Foundation and attracted more than seven hundred artists. The exhibition was closed to the public and hosted on the site of the Manchester Art Gallery, which closed last November. The next edition, “A Second Half of the Century” (2020), will include the work of forty-five artists. The exhibition will open on the Tate’s campus at Tate Modern in London on September 7.\n\n\nThe American Ballet Theater has won a major copyright appeal in China, where a judge ruled that the company", "The next Biennial should take place in 2020.  Art historian and writer Nusseibeh Darweesh has called the biennial “a historic day for the world.”Darweesh wrote: “In the past few decades, the number of people living in urban areas has increased tenfold and urban areas are becoming ever more densely populated, ever more concentrated, and ever more complex ecosystems. This is making life harder for the rural poor, especially the largest and most vulnerable, and is making life harder for the urban middle classes, which have had to shift from the countryside.” Darweesh added: “As urban life becomes ever more global, as urban economies are more global, as urban conflicts become ever more global, the isolation of the countryside intensifies. The biennial is there to help bridge this gap, to amplify the impact of the Paris Climate Accord, and to help local communities develop resilience in the face of this crisis.”The organizing committee for the biennial, the African Group, comprised of Darweesh; Ahmed Boumene, director of the Centre des Arts et littératures du Cairo; and Jumana Abu Marzouk, the director of the Detroit Institute of Arts; announced", "The next Biennial should be held in the Spring of 2020. The Tokyo Biennale is currently engaged in a restructuring plan that will see it join the Tokyo Metropolitan Museum of Art and the Academy of Fine Arts in the Grand Otomo Museum in Osaka.\n\n\nThe Museum of Modern Art (MoMA) in New York has decided to hire photographer and curator Paul Graham as its next director in the same capacity as its current director, Fernando Pérez, to ensure the museum’s continuity with its visionary director, John Simon Guggenheim. In a statement, MoMA said: “Paul’s background, knowledge, and experience make him an ideal fit for our exciting and challenging times. MoMA’s board of directors, in collaboration with MoMA’s board and staff, made the decision to nominate Paul as director following an internal leadership search that included Kenneth Ikeda, curator of works by Marilyn Monroe, Marilyn Hudson, and Joan Crawford, among many others.” “In addition to his significant leadership, he has a proven track record of successfully integrating creative and institutional practice, organizing exhibitions, and conducting research and collaborations across disciplines, including photography and art,” said MoMA board chair Peter", "The next Biennial should be held at the Museum of Fine Arts, Houston, in the spring of 2021. Drexel University, Philadelphia, will host the first annual Art of the Party, which will showcase work by forty-six artists and collectives. “This year’s biennial is shaping up to be a banner year for our network of partners in both the US and UK, and we are incredibly excited to continue to support artists and artists projects in both locations,” said Jane Panetta, director of the new center.  \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has appointed veteran art historian, curator, and educator Ian Katz as its next director. Katz, who helmed the museum from 2009 to 2016, succeeds Laura Lippard, who was appointed director in February.Katz will assume his responsibilities in June. “We are thrilled to welcome Ian Katz to our team,” said director Lynda Barry. “He is a visionary leader who has been dedicated to the revitalization of MoCA. His decades of leadership, along with his extraordinary curatorial skills, will ensure that we continue to present the museum’s most important works to our audiences and continue to expand on the", "The next Biennial should be held in early 2020.\n\n\nThe international governing body for contemporary art and design, the International Council of Art, announced today that it is planning to push back the opening of the 2020 edition of the Venice Biennale by a year by introducing a new two-year moratorium on new works, exhibitions, and events. Called the “triennale extension,” the initiative will allow the organizers to spend more time promoting works in the exhibition and less time on the festival.The decision was made after they concluded a three-month consultation process with the public. The code of conduct for the event, which will take place at the Palazzo del Baro, Venice, from November 15 to November 22, 2019, stipulates that new works, exhibitions, and events must be developed in tandem with the exhibition.The full list of participating artists is as follows:Anish Kapoor, MumbaiKawarra Khermini, MumbaiJudy Barrett, New DelhiSara Bailer, New YorkSaira Baratheld, LondonTania Boccalero, Rio de JaneiroAndrea Bosco, RomeJulia Colonna, MilanDelia Costa, RomeSamantha Cooke, New YorkNaima", "The next Biennial should be held in 2020 and will consist of seven exhibitions, each with a unique storyline that will unfold over the course of two years.The project has been in development since 1997 and was selected as a winner of the first edition of the Biennale in 1997. It was also selected as a global winner by a jury comprising Hans van Driel, Vincent van Gogh, and Emmanuel Krieg. The second edition of the exhibition was staged in 2013 and comprises works by Tilda Swinton, Yoshitomo Nara, Tacita Dean, and Adriana Varejão.The first exhibition in the series will be dedicated to Sky, the work of Sara Afshar, from the first exhibition in the series, Sky: The Perfect Circle, which will open on May 24, 2020. In the second exhibition, Gretchenstachel: Paintings from the Biennale, will open on October 27, 2020. Klaus Wirss: Armchair, also curated by Swinton and curated by Krieg, will take place in the Landscape and Decorative Arts Museum in the city of Frankfurt on November", "The next Biennial should be held in 2021, the Art Newspaper reports. The event will be hosted by the Palazzo Armitotti, in collaboration with the Centro di Architecto (CAD), and will comprise the works of fifty artists, including James Turrell, Pablo Picasso, and Antony Gormley. The theme, “Return: Beyond the Present,” will reflect the biennial’s history and involves the theme of the exhibition, “The Future is Present,” and will be presented by Sara Zana, the artistic director of the ParaNorman Foundation and the ParaNorman Arts Center, in partnership with the Museo de Arte Contemporáneo Centro de Artes Plásica (CAC), the Museo de Arte Contemporáneo Centro de Arte, and the Museo de Arte de São Paulo. \n\n\nThe Metropolitan Museum of Art (MoA) in New York has received a major gift from the David and Lucille Packer Family, whose extensive collection includes some four hundred works by artists including Mario Savio, Jules and Harun Mirvish, Isaac Bashevis Singer, and Clement Greenberg.", "The next Biennial should have been held in October 2021.\n\n\nThe $5 billion redevelopment of the historic Duke Energy Center in Durham, North Carolina, is now underway. The $3.1 billion project, which involved the construction of a new $550 million exhibition venue, a revamped library, the restoration of the historic building, and the renovation of the adjacent campus, is now slated to be completed by 2021.The redevelopment of the university complex, which was built in 1929, will involve the construction of a new 750,000-square-foot exhibition space, the construction of a new 12,000-square-foot library, the conservation of historic materials, the renovation of the surrounding campus, and the addition of more than 1,400 additional classroom spaces. The renovation of the existing building will involve the construction of three new buildings, which will be built in tandem around the center.Constructed in 1929, the original Duke Energy Center, which served as the site of Duke University from 1956 to 2001, closed in 2000 following a short-lived stint as the home of the Duke Art Museum. Following a $250 million donation from the Duke Foundation and $165 million from the community, the museum reopened in 2013, with a new theme park, the Duke Art Gallery,", "The next Biennial should be in September 2020. \n\n\nThe Milwaukee Art Museum (MAM) has received a gift of forty-six works by American painter and sculptor Vincent van Gogh from the Los Angeles County Museum of Art (LACMA), the Los Angeles County Museum of Art (LACMA), the Los Angeles County Museum of Art (LACMA), and the Los Angeles County Museum of Art (LACMA). The museum received the works from the artist’s estate, which purchased them in 2015 from the estate of Van Gogh’s youngest son, Erik van Gogh, and his sister, Margot.“The gift is a tremendous honor to receive these works and to know that they are in so great hands,” said Van Gogh’s widow, Margot. “The museum is grateful to be able to share these works with many who have enjoyed them in the past.” The works were donated by Denise and H. Peter von Gall, who were in Los Angeles on business when they received the gift, which also included a children’s book by Van Gogh, Tacita and Antony: What Is a Man? Van Gogh’s", "The next Biennial should focus on the history of the medium and its place in contemporary life, and should aim to re-create the feeling of being on a beautiful island in the middle of the ocean.”The five-day event will also include a presentation of the work of four of the artists who will be featured in the exhibition: Nina Donatella, the first Italian artist ever to win the Prix de l'Art et d’Homme, Francis Galan, the first American artist to win the Booker Prize, and Cristina Sánchez, who also won the Prix de l'Art et d’Homme in 2001. The five-day event is organized as part of a larger project to present new works in the exhibition. The exhibition will run from February 2 to February 9, 2020, at the National Museum of Italy and the Art of the Catalonian Council. The first show, “Elegy: Remains of a Dream” (February 2–February 10), will be on Selenopolis, in the city of Piedmont, and will showcase contemporary works by thirty-six artists. The second show, “Theater of Operations: War and Terror in the Middle East", "The next Biennial should also include a survey of the history of the national museum and the institution, and should aim to create a sense of community through the exchange of art and ideas. The exhibition should focus on the relevance of the arts for people and institutions, and how the biennial can contribute to the promotion of the national museum.\n\n\nThe National Geographic Society’s highly anticipated redesign—the latest iteration of the space-based exploration series, Blue Planet, will open in 2021—is receiving another major boost of $100 million from the National Endowment for the Arts (NEA). The grant will go toward renovating the existing space, which is currently home to hundreds of bookshelves and archives, and designing a new home for the science-fiction series, which is produced by Norton Simon & Schuster, and a companion exhibition series, Blue Planet XXXVII, which will run concurrently in 2023.The two programs will share a new digital experience inspired by Blue Planet, which was first commissioned by artist James Cameron and premiered in 2003, and will be inaugurated by a special digital edition of Blue Planet, titled Blue Planet Horizons, launched on September 7. The show will continue to be staged in conjunction", "The next Biennial should be held in 2022, originally scheduled to be held in 2020. The future of the exhibition is currently unknown. \n\n\nSydney’s Art Gallery of NSW is facing a backlash after it suspended an exhibition of work by the Canadian artist Kayode Oluo-San by inviting the work to its fourth-floor gallery for a private show in October. The exhibition was supposed to open in January, but was moved to the Museum of Contemporary Art (MoCA), where it will stay until March 2019.The exhibition, titled Art in Transition, was supposed to explore the \"interplay of art, politics, and the environment\", but was ultimately cut short after organisers learned that the exhibition would not be able to proceed without the consent of the local council.The local government had previously announced it expected the exhibition to be completed by the end of March. However, in a statement on Tuesday, Sydney council said that the exhibition had been suspended until further notice due to the coronavirus. It also noted that the show had been rescheduled by the museum for a third successive week, and that on the third day of the suspension, staff were given the option of working remotely from a meeting", "The next Biennial should be held somewhere in the United States in early 2018. It will present an innovative mix of works by artists and institutions, including a tribute to the long-serving Nari Ward, and will draw from the latest scholarship in biennial art and contemporary design.\n\n\nThe Austrian state government approved a $2.5 trillion budget for the 2019-20 academic year on Wednesday, March 5, in a legislative vote that empowers the chancellor, Norbert Reimer, with the task of tightening social safety nets and cutting the budget of the social welfare state. The package also outlines an ambitious plan to lessen the country’s public debt and rekindle the economy, which is suffering from a series of power outages and crowded classrooms caused by the novel coronavirus.The chancellor announced that the state will spend $1.5 billion to assist the German-based art and cultural sector, and $2.5 billion to help the arts and cultural sector in the country’s largest state, Salzburg. The state will also set up a new fund that will provide up to $500,000 to facilitate the investment of in-kind contributions by arts and cultural organizations in the state. The fund will offer up to $500,", "The next Biennial should take place in the spring of 2022, the year of the bicentennial. The theme of the symposium is “The Structures of Intersection.” The series will deliver two titles: “The Work in the Artist’s Body and the Work in the Collection.” The second show will be a retrospective of the exhibition “Sketchings from the Public,” staged at the Museum of Modern Art in New York from January 6 to January 13, 2020.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has announced that it will collaborate with the Institute of Contemporary Art (ICA) in Chicago to present the fifth edition of the Chicago Biennial, “Opening New Directions,” at the Art Institute of Chicago (IIC). The exhibition will be held at the Art Institute of Chicago (ICA) from March 15 to March 17, 2020 and will also include an artist-in-residence program that will invite artists interested in collaborating with MoMA to Chicago.The event will be hosted at the IIC from March 14 to March 16, 2020. During the tour, MoMA will open a new research center called the IIC Lab and will present new online", "The next Biennial should take place on October 29, 2020. A description of the event will be published here soon. \n\n\nUS President Donald Trump announced on Wednesday that the United States will withdraw from the Paris Agreement, which commits the world to reducing greenhouse gas emissions, but will continue to fund climate programs such as the Green Climate Fund, which helps developing nations prepare for disasters such as the pandemic.In a signing ceremony at the White House, the president said: “We, the United States, understand that climate change is an affliction for which the human race cannot survive. We know that it is caused by humans, and we know that we have a duty as a society to mitigate that damage. But we do not intend to honor the commitments made in Paris unless we substantially reduce carbon pollution and keep the lights on for our citizens.”The announcement came after the Environmental Protection Agency (EPA) announced on Monday that it plans to cut funding to the Green Climate Fund by two thirds. The blow would disproportionately affect low-income Americans—the program provides $45 million each year to help developing nations prepare for droughts and floods. The agency also said it expects to run out of money in the coming months. Trump said on Tuesday", "The next Biennial should be targeted at bridging the gap between science fiction and the real world. “We will work with a global team to bring together extraordinary artists and scientists and to create exciting and challenging work,” said Alexander. The NEXT Biennial will be held at the Beirut Art Museum in the United Arab Emirates from March 27 to March 29, 2020.\n\n\nThe high court in London has upheld a permanent injunction against the US District Court in North Carolina, District of Columbia, and seven other federal judges who blocked a temporary restraining order (TMA) designed to prevent the deregistration of the chemical agent, 5,4-D, used in the production of tear gas, against the state. The judges found that the Court of Appeals for the Third Circuit had erred in finding that the state had failed to establish that the TMA was invalid because it did not address the constitutional rights of the state.The three judges—Judge Ann Donnelly, who presided over the case, and Judge William H. Rehnquist, who sat on the Court of Appeals—found that the state had failed to establish that the TMA was invalid because it did not address the right to bear arms, the right", "The next Biennial should be held in the autumn of 2021. Nippon Ichi Film Festival (Japan), which usually runs from May to November, will also be postponed. The 2020 edition of the International Biennale in Hong Kong will be held in the fall.  The 2020 edition of the Hong Kong Biennale will open in October and run through the end of the month.  The Hong Kong Art Museum Japan will hold a 2019 exhibition of new works at the institution. The Central Institute of Art, Design, and Media (CIALM) in Seogwipo, Japan, will reopen in April. The institution will also reprise the Hong Kong pavilion in a biennial staged in the city next year. The nineteenth edition of the Tokyo Triennale will commence at the Metropolitan Museum of Art in New York in October. The Tokyo Biennale will be hosted by the Tokyo Metropolitan Museum of Art from September 21 to September 27.\n\n\nThe Museum of Modern Art (MoMA) in New York announced on Wednesday that artist Andrew Kreps has been selected to represent the United States in the next edition of Art Basel Hong Kong, which will run from March 13 to March 20 in 2021.", "The next Biennial should be a tribute to the legacy of Dr. Shimon Peres, and a biennial dedicated to the art of the rights of culture. The Biennial of the Arts should be an international collection.At the end of the biennial, the artists will be recognized as a collective and will receive a total of $2.5 million. The biennial of art will also be moved to the new museum’s venue, which will be inaugurated by a dedication by Pablo Picasso in 2020. The biennial’s art work will be displayed in the museum’s first exhibition dedicated to the art of the rights of culture, “Puerto Rico: Art of the Rights of Culture,” which will open on January 20, 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Vikram Banerjee as its next director and CEO. Banerjee comes to MoMA from the Museum of Modern Art (MoM), where he has served as interim director and CEO since March 2019. He succeeds David Bonderman, who departed in June as the institution’s director of curatorial affairs and chief curator.“Vikram is a visionary leader who", "The next Biennial should take place in Zanzibar, Ethiopia, and will be held in the year 2021. The twenty-second edition of the exhibition will be held at the Kölnischer Kunsthalle München from March 14 to March 22, 2021. The twenty-third edition of the exhibition will be held at the Nino-Mali Museum in Kigali from March 24 to March 28, 2021.\n\n\nA group of artists, writers, journalists, and other cultural workers in the northern Nigerian city of Maiduguri have been arrested for staging a peaceful protest against a new anti-terror bill that will curtail the rights of the civil liberties of political opponents and opponents of the government. The bill has been called unconstitutional and has been blocked by the government, and dozens of people have died in violent protests since it was introduced.In a statement on Thursday, Prime Minister Mahama Buhari said that the arrests were made under the provisions of the National Security and Counterterrorism Act (NSAct), which was passed by the Nigerian Senate on Friday and is awaiting a vote in the House of Representatives. The newly passed legislation, which was enacted with only a majority of lawmakers, allows the government to detain people without charges for several days and to", "The next Biennial should be held at the Museum of Contemporary Art Minneapolis (MCA) in early April.“I want to see more artists come together to create new works in a collaborative way, and more venues that are open to new ideas,” said transportation, culture, and performance specialist Merry Anderson. “I want to see more artists come together to create new works in a collaborative way, and more venues that are open to new ideas,” said Transportation, Culture, and Performance Sara Clawson. “I want the whole world to see my work.” MCA’s director, B.J. DeSousa, said: “The installation at MCA is a meaningful statement about transparency and collaboration. . . . It's a way to consider what it means to be an artist in a city where art is scarce, and a way to think about what we can do as a city to encourage more participation. It’s a way to think about how art can transform lives.”The exhibition will be on view April 4 through April 6. \n\n\nMuseums in the US are facing an unprecedented crisis as the coronavirus outbreak wors", "The next Biennial should take place on the island of Bali and is scheduled for June 4–June 6, 2022.The theme for the 2019 edition, \"Reflections of Light and Darkness,” was a reflection on the history of light and dark, a journey through time, and the balance between the two, and it was curated by Luka Mihalja, a curator of contemporary art at the National Museum of Singapore.The 2019 edition of the Contemporary Art Biennial, “Speech at the Biennial:” was based on a speech delivered by the artist Christopher Lee at a meeting of the National Museum of Singapore and was presented by curator Hsin-Chien Yu.\n\n\nThe National Museum of Singapore (NMS) and the Singapore Art Museum (SAM) announced today that Pia Zamanu, the first artist to be included in the exhibition “Speech at the Biennial:” since its inception, will receive a free exhibition hall at the museum as part of the biennial’s 2020 iteration. The exhibition will run at the SAM from December 14–December 21, 2020.The museum opened its new 7,000-square-foot venue, the National Gallery of Singapore (N", "The next Biennial should be held in 2021. The 2020 edition of Art Dubai, the opening event of the $21m Biennial, took place in the West African city of Port Harcourt, and was organized in partnership with the local art-world and cultural institution, the Art and Architecture Festival of Abuja.\n\n\nThe Richmond Art Museum (RMA) in Virginia has received a gift of seventeen works by the exiled American painter John Lindsay. The work, which was discovered in a vault at the institution in 2017, was donated by artist-activist Diana Miro, who was imprisoned for espionage in 1952 for advocating for the release of political prisoners.“The work is a beautiful tribute to Lindsay’s legacy as a powerful artist who fostered the kinds of conversations that changed the trajectory of American painting,” said Elizabeth D. Meade, the RMA’s chair of the board of trustees. “He is a true champion of freedom and an icon of American art. We look forward to his continued support as RMA continues to grow and his legacy is further entrenched in the Richmond community.”Born in New York City in 1936, Lindsay graduated from the University of Virginia in 1954. After serving in the Navy,", "The next Biennial should take place in the German town of Frankfurt, which has been temporarily closed since February due to the coronavirus. Art historian Wolfgang Koenig said that the event would be an extension of the museum’s efforts to “undertune” the museum’s collection through the exhibition “Turbinomics.” The exhibition will also offer a glimpse of the works of artist-in-residence Mark Miodownik and will offer a perspective on the exhibition that is different from that of the past.“We are not going to create a new exhibition that is not a continuation of the biennial, but we do not want it to be a biennial of the same themes as the biennial’s previous editions,” Koenig told the Art Newspaper. “This is a new kind of biennial that reflects a different and new German culture. It is a new and very special kind of exhibition in which you will be able to see all the works of the newest artists before they are even chosen. We are going to give you a new way to experience the exhibition and a different way to experience the exhibition.”The upcoming fifty-ninth edition of the biennial will", "The next Biennial should be held at the institution in 2021. \n\n\nThe Museum of Fine Art (MFA) in Phoenix is planning to move its opening from April 25 to June 21 in an effort to balance the museum’s schedule with that of other arts institutions. The Art Newspaper reports that the MFA’s next event, “Oolite Fashion” (2019), will now take place on September 21. While a new series of exhibitions and performances will inaugurate the MFA’s new location, the institution will continue to operate as usual.“We are taking this decision in order to ensure a smooth transition for our Phoenix visitors and community,” said director Janice and Brendon Musgrave in a statement. “Oolite Fashion’s return to the Museum of Fine Art reflects the museum’s long-standing commitment to supporting the Phoenix arts community and to supporting artists as they continue to make important contributions to the museum’s mission.”The MFA plans to open as usual on April 21, with a preview on April 14. \n\n\nThe National Gallery of Art in Washington, DC, has received a gift of fifty-two works by American painter Frank Stella,", "The next Biennial should be held at the Metropolitan Museum of Art, New York. The panelists for the fifth edition of the annual festival include Alexander Calder, artist and director of the New Museum in New York, New York; Bernd & Stefani, architect and founder of the design and interior design firm KEVIN FARRELL, New York; Sarah Frankenthaler, gallery owner and curator of the New Museum in New York; Michaëla Sitz, artistic director of the museum and author of The Art of Making Place; and Olivier Stieglitz, a photographer and filmmaker whose work has been exhibited at the Venice and Berlin Biennials.The 2019 edition of the festival, titled “The Future is Yours,” was held at the Metropolitan Museum of Art in New York on October 9–October 14. The 2019 edition featured work by thirty-seven artists, ranging from Antony Gormley, Justin Hurwitz, Graham McTavish, and Mark Rylance, to Nathan London, Dara Kuzma, Paul Mpagi Sepuya and Ethan Nadelmann, and was curated by Kate Fow", "The next Biennial should be in 2021; the date of the current exhibition has already been postponed because of the Covid-19 pandemic. The first show in the new format will open in the fall of 2021. \nThe next exhibition, titled “Feminine and the Sublime” (2019), has also been pushed back, and will instead be held in the spring of 2020. The biennial, which will include fifty odd works by sixty artists, will focus on the themes of beauty, the body, and spirituality. The seventy-second edition of the Venice Biennale will take place in May 2020. “These are some of the most important and challenging artists in the history of the art world, and we are eager to meet them and to develop a new format that will allow them to come together across disciplines and cultures to see how they can use the themes presented in these five exhibitions to open new perspectives on art,” said Venice director Dario Franceschini. \n\n\nThe Museum of Contemporary Art (MoCA), San Francisco, has released new guidelines for commissioning works by women artists in the United States. Under the direction of director and CEO Amy Sherald, the institution will no longer require artists to screen", "The next Biennial should be held at Montreal’s OA.M.F. (Olive Earth & Family Farming) in June.The exhibition, called “God Is Not ‘Human’s Best Friend,’ will be a joint effort between artists and an artist-run museum. This year’s theme is ‘Relic Relics’” and the exhibition will feature works by artists such as Vladimir Kulig as well as works by contemporary artists such as Melissa CheUL, Rachel Grant, and Kiki Smith.Kathrin Beck, director of the Norman Rockford Museum of Art and the Greenlawn Art Museum in Olney, New York, said: “We are thrilled to be collaborating with Anderson, Laudel, and Hart to create a new exhibition featuring these artists’ new works. We are also excited to present the work of these artists in the first exhibition dedicated to their work in the United States in over twenty years. God Is Not Human is an epic narrative of how faith has shaped our world, and of how it often shapes our very selves. We are eager to see how the work of these artists will resonate with audiences in the United States and abroad", "The next Biennial should include an exploration of the relationship between cinema and sound with an emphasis on the development of new technologies to enhance the visual experience of Biennials. With an introduction of the work of the late American artist Carlos Lowry, a selection of paintings by the late Brazilian artist Hélio Oiticica (1909–1968) and the work of the artist-in-residence of the Museum of Modern Art, and the first exhibition of work by the artist-in-residence of the Museum of Modern Art, the Biennials will be presented as an open platform for the exchange of ideas and art. The commissioning of the work of the artist-in-residence Fernando Campos is also a special moment for the museum. Campos, a South American contemporary architect, was awarded this year’s Hugo Boss Prize for his latest exhibition, Hisaters: Architecture and Sound, at the Museum of Modern Art. Campos has been commissioned to create several works for the museum since he started the ’s sculptural program in 1995. The artist-in-residence of the Museum of Modern Art, Roberto Corazón, also received the award for his work for the", "The next Biennial should be held in 2020. \n\n\nThe Washington, DC–based nonprofit Artadia, which aims to advance awareness and understanding of the history and theory of painting, has released the list of seventy-five artists who have participated in its annual Artadia Visuals & Performsa (AVP) Awards. The biennial, which celebrates the artists whose practice encompasses both digital and traditional media, was launched by Marc Elbaum and Alexander Clay in the Spring of 2016.Vincent van Gogh, Jean-Luc Verne, and Edvard Munch–Hennessy—all of whom lived and worked in the DC area in the 1940s and 1950s—are nominated for the Bachelet Prize, which is given annually to an artist whose artistic or social practice is of a moral, spiritual, or aesthetic nature. The biennial will be presented by the National Gallery of Art in Washington, DC, and the Metropolitan Museum of Art in New York, on September 12. The event will be hosted by the Public Theater in partnership with the National Geographic Society, which will stage the biennial.The shortlisted artists are presented in alphabetical order by nominee and are represented by their respective galleries.The full list of nominees is as follows", "The next Biennial should, in part, address the problems that were addressed by the last exhibition. We must also continue to introduce new and interesting works, and to continue to gather revealing and provocative works. The work of artists whose work is currently under discussion is also of great importance.”The Biennial, which is currently on view through October 30, will receive a $5,000 donation from the Rockefeller Brothers Fund.\n\n\nThe Museum of Contemporary Art (MoCA), New York, has appointed Jeremy Deller as its next director and CEO, effective immediately. Deller will be responsible for organizing and directing the biennial, which will be held at the Museum of Modern Art through 2024. He succeeds Nancy Lieberman, who departed the institution in March 2019 to head the Metropolitan Museum of Art in New York, which she leads until February 2021.“Jeremy brings to the role of director a proven record of innovation and creativity, as well as the ability to empower and guide MoCA’s diverse and growing collection, collections, and exhibitions,” said trustee and CEO Michael W. Pincus. “Together we will continue to shape MoCA’s mission and vision. Our audience will continue to grow, and we will continue to present", "The next Biennial should be held in 2021, and the first in 2024. For the forty-fifth edition of the event, curated by Maryland-based artist and writer Pamela Gable, which opened at the New Museum in New York on May 25, Gertrude Stein wrote: “The biennial, and the world we have created around it, is a gift from our ancestors to our descendants. Any grand gesture toward the future, no matter how small, is a gesture toward the past. It is a celebration of the past that makes us feel part of a larger whole—a collective past, a collective future.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Pablo Picasso is the recipient of the First Prize for his work Gesamtkunstwerk, which was presented by the German state of Bavaria at a ceremony held on Thursday, February 13. The painting, which was exhibited in the museum’s Gesamtkunstwerk pavilion in Berlin on October 14, 2017, is one of the earliest works to be included in ­Gesamtkunstwerk, which is the German term for a series of paintings made", "The next Biennial should be held at a future date.\n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco has announced that it is reopening to the public on September 29, following a temporary closure due to the Covid-19 pandemic. The museum is still working on a date for a permanent reopening, but the institution expects to reopen by the end of the month.The museum is still reviewing its conservation plans, and the exact visitation times for both Sundays and Thursdays are still being worked out. According to the website, MoCA’s regular admission prices will remain unchanged, and the museum will continue to receive visitors for free on Sundays and Thursdays. “The pavilion is not yet fully restored from the impact of the Covid-19 infection, but we are hopeful that this will change as we continue the work of restoring the original atmosphere and feel a sense of completeness and safety in the new days,” said MoCA director Amanda Levin. During its temporary closure, MoCA also laid off fifty-seven employees; it currently employs around one thousand people. The public will be able to return to the museum on September 28 for a special three-day roving exhibition, “Visitors", "The next Biennial should be held in 2021. \n\n\nThe foundation of the British domestic art museum, the Tate, in London, has appointed Laura Bates as its new director, effective immediately. Bates will be responsible for overseeing the development and management of the institution’s collection and exhibitions and the repositioning of its collection.“Laura is a visionary leader and I am delighted to welcome her to Tate,” said Richard Spielman, the board president and chief executive of Tate. “Her extraordinary track record for bringing thriving contemporary art to the museum highlights her ability to deliver on the vision and vision of Tate’s previous directors, Sir Alan Knowles and Sir Nicholas Cullin, and their vision to develop a new approach to exhibition design. I’m confident she will continue this work with the Tate and bring it to life for future generations of Tate visitors.”Bates began her career at the Tate as a curator of contemporary art in 2002. Following her tenure at the museum, she became director of contemporary art, London, in 2011. She has also served as the director of the Tate’s main art gallery in London since 2016, and is currently the deputy director of curatorial affairs and chief curator of Simon Fraser", "The next Biennial should take place at the KW Institute for Contemporary Art, Munich; the KW Art Archive, Munich; and the KW Museum of Contemporary Art, Munich, and the Museum of Contemporary Art, Tampa. The antique works at the KW Museum of Contemporary Art are housed within the museum’s current exhibition, “Arts of the Past.” The current exhibition is titled “Dietrich und Isozhdan: Greenberg’s Credo,” which was organized by the KW Museum of Contemporary Art and the KW Institute for Contemporary Art. The exhibition will open in March 2022.\n\n\nThe British Museum (BMI) in London announced today that it is launching a 24/7 online edition of the institution. The initiative will bring the works of a selection of British art to the institution’s digital platform beginning in the fall of 2020 and will allow visitors to experience a full range of special exhibitions and events at the museum. The initiative is part of a concerted campaign to strengthen the museum’s online presence through publicity, programming, and digital promotions. The initiative, dubbed “BMI on,” will also introduce a new digital platform that will present the works of artists", "The next Biennial should focus on “new ways of thinking about the history of art,” the organizers said. Diller Scofidio + Renfro’s ambitious, ten-year design and installation show, “Sprint/Sprint Art,” which will begin in December 2020 and run through February 2021, would have taken place at the same time as the exhibition.\n\n\nThe Diller Scofidio + Renfro Collection has announced that it will present its fifty-fifth exhibition, “MIDNIGHT,” at the Museum of Modern Art (MoMA) in New York. The exhibition will honor the work of thirty-four artists, including David H. Davenport, J. M. Wiegand, Urs Fischer, and Paolo Baratta, and will be staged in the museum’s new building, the second floor of which is scheduled to open in 2021. The exhibition will be curated by Chia-Lan Chan and will begin with three works by the Halle Berry-inspired artist Sun Kil Moon, then move to a discussion of the “Cuban experience,” a retrospective of the artist’s work that will be staged at the", "The next Biennial should be held at the museum in 2022; the museum has yet to decide on a date for a second exhibition. The decision to stage the exhibition in the first place was made in the wake of the coronavirus pandemic.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Sohrab Mohebbi as its new executive director. Mohebbi will be responsible for overseeing the work of the museum’s staff and will take up the post on January 7.“We are delighted to welcome Sohrab to the museum,” said museum director Daniel H. Weiss. “A scholar and an instrumentalist, he brings a new perspective to how we provide cultural support and inspiration to our audiences and communities and will be an invaluable member of the MFA’s staff and the broader MFA family.”Mohebbi comes to the institution from the Museum of Contemporary Art (MoCA) in Los Angeles, which he founded in 2003. He previously served as director of the Columbia University Art Museum in New York from 2013 to 2019 and as chief curator and executive of the Denver Art Museum from 2015 to 2017. He is also the founder and chairman of the marketing company J", "The next Biennial should be held in 2020. The next edition will be held in 2021 and the fourth will be held in 2022. Artforum will keep you up to date on all the latest developments. \n\nThe Los Angeles County Museum of Art (LACMA) has announced that it is working with the Fine Arts Museum Los Angeles to commission an exhibition of contemporary art from the Los Angeles–based artist and educator John Akomfrah, known for his experimental, grassroots, and usually white-wash American art, to coincide with the centenary of his death.The exhibition, “John Akomfrah: From Room to Orbit” will showcase work by forty-one artists, including Timur Adily, Leroy Bochner, Sarah Brooks, and Arturo Borja, as the artist continues his series of solo exhibitions at LACMA, which will be followed by an exhibition at the Central Library of Art in Los Angeles in 2020. The exhibition marks the first time the Los Angeles–based artist has put together a work for LACMA since 2014. The commission was made in honor of the centennial and for his remarkable forty-six-year career as a Los Angeles native and educator.�", "The next Biennial should be held in 2021–22 and will be supported by the Smithsonian’s Museum of Fine Arts in Boston.\n\n\nHannah Behold Gallery in New York has received a $50,000 donation from the Nelson-Atkins Museum of Art in Kansas City. The donation includes a set of works by artist Peter Sellars and a selection of his new paintings. Peter Sellars, who has been featured in seven international exhibitions, including the Whitney Biennial in New York City in 2008 and the Seoul Biennale in 2010, will receive the exclusive sale of the works in 2020.The gift, made by artist and collector Mihai G. Gebbia, comes a year after the foundation of the Gebbia Gallery, a New York–based nonprofit whose mission is to foster the art of Hannah Behold. The organization is run by Mihai G. Gebbia and his wife, Emma. They are the creators of the video work Museums at Peace, 2011–12, which premiered at the Menil Collection’s inaugural retrospective in the fall of 2012. The first exhibition that the Gebbases organized was “Atmosphere,” which was held at the Kennedy", "The next Biennial should take place in Helsinki in the spring of 2020. The third Biennial, which was set to take place in Kiasma, Finland, was canceled owing to the coronavirus. The fourth and final Biennial, which was to take place in Helsinki in 2021 and 2019, was also canceled. The 2019 edition of the event, which was to have taken place at the Kunsthal Charlottenborg in Stockholm, Sweden, was canceled due to the coronavirus. The 2020 edition will also be held at the Palazzo di Lugerbio in Milan, Italy, and will be held in the summer of 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Victoria Avalos as its inaugural director. In her new position, Avalos will oversee a curatorial team of twenty-five artists, including Ayla Al-Hadid, Anya Arsht, Aya Alireza, and Alexander Calder, and will be responsible for developing and implementing new public programming to support the museum’s philosophy of creating contemporary art in a plural, shared world.“We are privileged to welcome Victoria to the MoCA family,” director Dave Becky said. �", "The next Biennial should take place in 2021. The commissioning of the exhibition was initiated by the former director of the museum, and the new director, Peter LaBar, who now leads the museum. For the first exhibition of the new collection, which will be housed in the Art Gallery of Ontario, the Centre Pompidou will stage a presentation of the new collection on February 22. The institution has also committed to supporting the work of a select group of artists who have not yet been chosen for the biennial. The exhibition, titled “From the Ice to the Sky: The Architecture of Snow,” will be held at the Visual Arts Centre in London until March 3. “I have long believed that there is a tangible connection between the art and the artists’ lives,” said Carlo Cicutto, the head of the Bibliothèque Nationale de France, who collaborated with LaBar on the exhibition. “The exhibition ‘From the Ice to the Sky: The Architecture of Snow’ represents a new kind of engagement with the emotions and the conceptualities of the natural world, in a way that we have never done before.”\n\n\nThe Museum of Fine Arts (MA)", "The next Biennial should consider the possibilities of the new artistic paradigm, considering the latest developments in film and the visual arts, and should take into account the current global situation, which may include a reappraisal of the biennial’s founding principles.”\n\n\nThe Toronto Art Gallery (TAG) has received a $100,000 donation from the estate of the late collector and philanthropist Henri Joly. In addition to the $100,000, the charity Horse-to-Head will give the institution $50,000 for its first arts and culture program, which will focus on showcasing work by the late British artist David Hockney. Both the Hudson Valley-based collector and his son, Clive, are longtime supporters of the museum.Lorenzo Joly, a well-known collector of British and European paintings and drawings, died in London on December 12, 2017, at the age of seventy-eight.Known for his generosity, philanthropy, and curating skills, his son Clive has been a champion of the museum since its founding. He began by organizing exhibitions, selling works, and organizing workshops, and eventually became the institution’s president, with his daughter, Virginia, in 1975.\n\n\nThe Metropolitan Museum of", "The next Biennial should be in September 2020. The twenty-seventh and twenty-eighth editions will be held at the museum in November 2020. \n\n\n\n\n\nThe Carnegie Museum of Art in Pittsburgh, Pennsylvania, has appointed Simon R. Ligotti as assistant curator of American art. He succeeds Mary E. Gilliam as curator of American art and is expected to begin his position in January 2021. Simon R. Ligotti’s new position is an extension of the institute’s existing curatorial program, which is centered on the exploration of the history of modern and contemporary art through the production of new exhibitions and programs.Past programs have included “Vision of a Nation: American Art in the Age of Black Power” (2010–11) and “Bertrand Goldberg: A Modern History of Art” (1996–99). He previously served as assistant curator of modern and contemporary art at the Howard and Barbara Raikes Gallery in New York during the 1990s and again as curator of American art in the Whitney Museum of American Art in New York from 2002 to 2009.“Simon R. Ligotti’s approach to curating is both original and circumspect, giving the museum a sense of", "The next Biennial should be held in either Barcelona or Rome. “The project that has led to the destruction of the regional ecosystem is a measure of our collective failure,” said Foster, whose film Groundhog Day (1993) also examines the concept of an afterlife, but in a way that is simultaneously poetic and personal. The Venice film festival will return to the city for its fifteenth edition, which will take place in October 2021.Commenting on the project, Foster said: “Not only is Groundhog Day a compelling and astounded exploration of the concept of time, but it is also a deeply moving meditation on what it means to be human in the face of catastrophic climate change. I hope you will join me in experiencing this work, and immerse yourself in the words and the spirit of the place that is Groundhog Day.”\n\n\nThe Metropolitan Museum of Art in New York and the Museum of Modern Art (MoMA) in New York announced today that they have agreed to work together on the organizing and staging of the Metropolitan Museum of Art’s Fifty-Third Art Art World Congress, which will take place in the museum’s new, 330,000-square-foot space", "The next Biennial should be on May 25.\n\n\nThe Museum of Contemporary Art (MCA) Chicago has announced that it is planning to temporarily close its doors in an attempt to reduce its carbon footprint and protect the environment. The institution said that it is working with the City of Chicago and the State of Illinois to determine the timeline for the restructuring and will announce the outcome of the process this fall.“When we began this process, we knew we had to act,” said museum director John Carlos. “We knew we had to act fast.” During the closure, MCA’s space in the city’s Grant Park will be transformed into a new community space for artists, and its outdoor sculpture garden will be reconfigured to support an additional 360 artworks.“We couldn’t put these pieces together in a day, and we didn’t want to take these pieces apart in order to make them more sustainable,” Carlos said. “I’m confident that this year’s exhibition will be a landmark exhibit.”\n\n\nThe Metropolitan Museum of Art (MoA) in New York City and the artist-run organization Working Assets have announced an agreement that will", "The next Biennial should be held at the Institute of Contemporary Art, Los Angeles (ICA LA), in October 2020. \n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has announced that it is expanding the scope of its inaugural anthropology program, Antiquity & Tradition, with a new project, Unfashionable, that will explore the possibilities of fashion—and how our expectations can shape our bodies and ideas. The $1 million program will introduce a new project called the Ato’s Breath, an exhibition that will present new works by contemporary artists, from Moët Hennesy to Mary Beard, that examine the history of fashion and fashion trends. The program is supported by a $750,000 grant from the National Endowment for the Arts (NEA), as well as a $150,000 grant from the Jared Foundation as well as a $100,000 gift from the Rockefeller Brothers Fund.“We are thrilled to be launching this new year with a new project by our talented artists, and to be able to celebrate the 20th anniversary of the institution with a new show that honors our institution’s American heritage and our rich history with this latest project,” said", "The next Biennial should take place at the European Museum Las Palmas in Madrid, on May 23–May 27, 2020. It will be hosted by the Presidio of Virginia in partnership with the following organizations:The Biennial will also include the exhibition “Oscar Mālik: In Praise of the Other,” which will be curated by Matías Jaar and Ksenia Ostrós, and the exhibition “Is it possible to transform the economy and to live in harmony with nature?” The show will include works by artists such as Jean-Michel Basquiat, Claude Monet, Bob Marley, and Diana Ross.The opening of the new project, “Barcelona: The City of Bridges,” will take place on September 21 and September 24. It will be hosted by the Museo de Arte de Barcelona (MAS). The new thirty-foot-tall sculpture, created by the artist-in-residence and member of the team of one, will tour the city in collaboration with a team of approximately forty. The work will also be performed by the artist, who will receive financial compensation for her participation.The Biennial’s inaugural edition, “The Burning", "The next Biennial should be held in the spring of 2020.The exhibition will be curated by Neil Black, director of the Third Line, based at the Art Institute of Chicago; Antonio Gramsci, the curator of Latin American art at the Museo de Arte Contemporáneo in Madrid; and artist and curator Michael the Archangel.Commenting on the exhibition, Black said: “The series ‘Epic’ is a reflection of the relationship between architecture and the American South. From the installation of almost twenty architectural elements in a series of interrelated narratives, to the construction of a massive arch that dominates a plaza, to the assemblage of water, fire, and imagery to create a monumental sculpture, the Biennial will redefine the role of architecture in the 21st century.”\n\n\nThe British artist David Hockney has been named the winner of this year’s $30,000 Tyburn Prize. It comes after he created a miniature version of the Tate’s iconic Tate Modern, and portrays a future where the museum has been completely dismantled and rebuilt to replace it with a new £10bn museum complex.Hockney, who is based in London and is based in the United Kingdom", "The next Biennial should focus on the ecological and political implications of contemporary art. The biennial’s first edition, “Two Futures: Modern Art and the Struggle for Liberation” (2015), opened to the public in London in February. The exhibition was preceded by a series of exhibitions organized by the Museum of Modern Art in the United States in 2013 and 2014, as well as a retrospective of work by the artist-activists Zina Saro-Wiwa and Adam D. Weinberg.\n\n\nThe Shoshana & David Diller Foundation (S&D), a nonprofit arts organization founded in 1988 in New York City, has awarded the three artists $2.6 million in support of their projects, which will be exhibited in an exhibition at the Shoshana & David Diller Museum in Manhattan in 2021. The three were chosen by a jury convened by S&D director David Diller. The grants, which were first announced in 2017, were for their work “theoretically,” “tactically,” and “in practice.”“The foundation was founded by S&D founder and philanthropist Shoshana Diller in 1991 to promote the work of artists who", "The next Biennial should be held in the Spring of 2020. The dates and other details of the event will be announced soon.\n\n\nNew York City–based artist, designer, and educator Paul Gauguin, a long-time collaborator and educator of artists such as Robert Irwin and Merce Cunningham, died on December 5 at age seventy-eight. He was fifty-six years old.Gauguin’s work has been collected by museums and institutions in New York, Chicago, Los Angeles, and San Francisco. He is survived by his wife, Barbara; his sons; a daughter; a grandson; and a great-granddaughter. Since their work first appeared in an exhibition at the Museum of Modern Art in New York in 1957, Gauguin and Cunningham have collaborated on projects ranging from their book The Art of Making Faces (2006) to the 2019 documentary film The Accidental Artist.“Paul was a devoted teacher, friend, and collaborator, orchestrating new approaches to all of his art,” said Jean-Jacques Duane, who directed the exhibition. “Through his vision, Gauguin provided an opening to explore the world of art and design and was the first to question the limits of what could be.", "The next Biennial should take place in 2022.\n\n\nThe Museum of the Moving Image (M&M) in New York has opened a new digital initiative that will allow visitors to view the remaining works on its permanent collection and other works on loan to the institution. The program is called the M&M+ Gallery Index and will be available free of charge through August. Museum director Daniel H. Weiss said: “In the twenty-first century, we are an international community that is increasingly dependent on archiving and archiving is in short supply. The M&M+ Gallery Index will take you to the next great contemporary art experiment and give you a way to see the works that are currently on display and to plan your visit.”The museum has also launched a new website where visitors may purchase works by artists currently on display. The index will be updated weekly with the latest news and will include works by artists such as Carlos-Andrea Campo, and Denys Cossu, among others. Unlike the M&M+ Gallery Index, the M&M+ Gallery Index will not feature the works of highly anticipated artists but will instead be curated by a board of curators, comprising Weiss, art historian René Morales, and artist", "The next Biennial should be the biennial of the San Francisco Museum of Modern Art, which will take place in 2021. The next Art Basel Hong Kong exhibition will be held in October 2021, and the next Art Dubai event will take place in November 2021.More information about the upcoming biennials can be found on the companies websites. After the completion of the 2020 edition of the Venice Biennale, the Venice Architecture Biennale, and the Art Basel Hong Kong show, the Swiss fairs will also be rebranded. The new names will be launched by Art Basel and the Swiss company Carrefour. The new dates for the Art Dubai show are October 23-28 and October 26-31. The new titles have been selected from a shortlist of ten applicants who were screened by an international panel comprising designer Elissa Antos, director of the Monopol boutique in Geneva; Elizabeth Thomson, director of the London-based design studio MCH Group; architect Léger Riester; and Stephen de Kunst.\n\n\nThe National Gallery in London has pledged $5 million over two years to support the economic recovery of the Royal Academy of Arts (RA), which has been severely damaged by the coronavirus (", "The next Biennial should focus on how the art and science of the twentieth century have continued to shape and evolve in the twenty-first century. We will also explore how the current situation, both in and outside the museum, is a continuation of the postwar, postCold War, and postcolonial eras. The next iteration of the pavilion will be held in 2022.\n\n\nThe Solomon R. Guggenheim Museum in New York has received a gift of approximately 3,500 photographs by American photographer Laura Aguilar. The gift includes several prints from the series “Perfection of Form,” which ran from 1958 to 1962 and was published by the Institute of Contemporary Arts, in New York, and the Institute of Historical Art, in London.“Laura Aguilar’s photographs as a whole are ambitious, engaging, and thought-provoking,” said Guggenheim director Joseph Teitelbaum. “She captured the human condition, her subjects, and herself through a variety of mediums, including film, sculpture, and photographs. In the course of her photographic career, she became a remarkable example of the persistence of a photographic method that embraces both craft and craftiness.”The institution also celebrated the work’", "The next Biennial should be held at the Theatre of Modern Art in Paris in December 2020. \n\n\nThe Tewkesbury Museum of Art in England has received a £10,000 grant from the Philip Hammond Foundation. The organization announced the award this afternoon. The grant will allow the Tewkesbury Museum to commission artist Lars-Erik Eklund to create an installation dedicated to the life and work of Albert Camus. Eklund will create a 360-degree work that will sit in the museum’s permanent collection for forty years.The grant will also provide funding for the commission of artist Maudlin Carroll as well as the commissioning of work by Maren Rose, in collaboration with the Tewkesbury Contemporary Art Collection. The selection of the five artists will be curated by Tewkesbury curators Andy Edwards, Tim Edwards, and Olafur Eliasson and is slated to run from February 20 to October 17, 2020.The foundation’s director, Emily Johnson, said: “Since arriving at the museum eighteen years ago, we have been inspired by the breadth and depth of the collection, and by the challenges posed by exhibitions, acquisitions, and exhibitions. By drawing on their extensive experience of presenting great contemporary art", "The next Biennial should take place in the summer of 2020. I predict that the aesthetics of the contemporary will be in urgent demand of the year 2020. This is why we have organized a cycle of events, which will include new works by artists from twenty-nine countries and territories, as well as lectures, performances, exhibitions, concerts, screenings, and other activities that will take place across seventy cities, as well as internationally.”The deadline for the exhibition is June 12. The 2019 winner was Arash Iglani, a thirty-two-year-old Iranian-born, Iranian-American artist who creates paintings and sculptures that are centered around themes of family and memory. At this year’s exhibition, he drew a portrait of his father, the late Iranian president Ali Ghasemi, who was assassinated by a Saudi-born radical in Riyadh in 2017. Iglani created his first work for the exhibition, the work Afternoon in the City, 2017, at the Museum of Contemporary Art, Miami Beach. The exhibition was followed by Works for the Museum of Contemporary Art (WMA), New York, for a retrospective of the artist’s work, which will be staged in the fall. The first major retrospective of Iglani", "The next Biennial should have a theme that celebrates Indigenous knowledge and knowledge systems, with a special focus on the archaeological record. It should also address the current state of knowledge internationally and the necessity of advancing research and knowledge through the exhibition.”\n\n\nThe National Portrait Gallery in London is putting out a formal complaint about the exhibition “Tin Pan,” scheduled for March 2019, after the institution found itself at the center of a social media furor over the exhibition of a portrait of the late Libyan dictator Muammar Gaddafi. The piece, titled Tin Pan, and the six portraits in the exhibition have sparked outrage following a series of anti-Gaddafi protests. The protests have been fueled by statements made by some Western politicians, including US Secretary of State John Kerry, who declared that the United States would withdraw from the Paris Climate Accord, and by images of the United Kingdom splattered with blue and red paint, a symbol of climate injustice.Despite the protests and the White House’s threats of punitive measures, the UK is still committed to supporting the Paris Climate Accord, which aims to limit the rise in global temperatures to 2 degrees Celsius. The UK’s Department for Culture, Media and Sport (DCCS), which", "The next Biennial should be staged in the autumn of 2021. “We are excited to share the results of our ambitious project with our global audience,” said Dario Catellani, director of the Gallery.  The exhibition will include two new works by the artists, one each featuring a new medium. The works will be presented in conjunction with the Italian Pavilion at the US pavilion at the Fifty-Ninth Venice Biennale in 2019. The Biennial will run for twelve weeks and will include more than seventy artist presentations. The exhibition is funded with a grant from the Schirmer Foundation, the Benedict Arnold Foundation, and the J. Paul Getty Trust. \n\n\nThe prestigious Mendes Museum in Manchester, New Hampshire, has received a gift of more than 2,500 photographs by the American photographer James Restivo—a pivotal step in the artist’s quest for a panorama of cities and landscapes. Established in 2011, the program, which is funded by the James Restivo Foundation, has produced some of the most meaningful works of photography ever made. In addition to the photographs, the foundation also acquired more than 2,500 prints of works by", "The next Biennial should be hosted at the National Gallery in London, which is currently closed until October 14. The theme of the third edition will be “Transnational Lives,” but Melloth and Humberdon-Williams have yet to announce any final designs for the exhibition. The exhibition has already attracted almost 2,500 visitors; the festival confirmed this figure today.Hewlett-Packard said that it will donate $250,000 to the project in hopes of securing a production run of twenty-four artists for the biennial. The prize jury added: “We are in discussions with the National Galleries of Scotland as well as a number of other organisations and directors to find a way forward in supporting this exhibition. We are excited about the exhibition as a whole and the impact this exhibition has on us all.”The partnership between the 2015 and 2016 editions of the Biennial was announced in late September. The 2019 event, titled “Beyond Borders,” kicked off on October 5. Organizers said it was planned to launch “at different stages of life,” yet the exhibition never departed from its original location in the National Gallery. The annual prize drew 6,500 visitors from eighty-seven countries", "The next Biennial should be held in Denmark next month. The event will be organized in both a four-day and a five-day format. The organizers have not yet said when the event will resume.\n\n\nThe French late-Sittler and early-SCHWITZ artist, Constantin Brancusi, who inspired countless imitations in his prolific paintings, has died at age eighty-eight at his home in Paris. Brancusi was born in the city of Lignano, Italy, on May 3, 1931. His father was a motorcyclist and his mother was a homemaker. After graduating from the State University of Lignano in 1964, Brancusi moved to Milan, where he met his wife, the artist María Berrada, who became his wife and mother. In Paris, Brancusi studied at the École Normale Supérieure (now the École des Hautes Études) and the Museum d'Honneur-Laplace. In the late 1970s, Brancusi moved to the small town of Pavia, near Lyon, and began his series of portraits in which a feline figure appears in every painting. The series", "The next Biennial should take place in 2020, according to the organizers. The next iteration of the exhibition will comprise twelve exhibitions and a mini-dome in the city, which is currently undergoing a $3 million facelift. The 2020 edition will be organized as a biennial within a biennial, with the inaugural exhibition being “Titled ‘HELMUTTED”; the 2021 edition will be “HELMUTTED 2: The Urban Museum of Modern Art”; and the 2022 edition will be “HELMUTTED 3: Death and Life in the City.”The Next Biennial will take place at the Museo de Cultura Nacional de Madrid (MUSEAM) from November 5 to November 7, 2021. The twenty-fourth edition of the event will be held at the Museo del Barrio, Madrid, on March 2, 2022, and the twenty-fifth edition at the Museo del Orden, Milan, on March 22, 2022. The twenty-seventh edition of the event will be held at the Museo de Arte Contemporanea, Madrid, on September 23, 2022. The Next Biennial is an effort by director Felipe", "The next Biennial should take place in May 2020, and will consist of a selection of new works by forty-eight artists. The exhibition will be staged at the Museo de Arte Contemporáneo in Madrid, hosted by the Spanish Ministry of Culture. The biennial is part of an initiative, spearheaded by the Spanish government, to promote the study and appreciation of African art in Europe and the Americas. The program aims to extend the themes of previous structures created by the government, such as the National Museum of Modern Art in Madrid, which recently unveiled a new work by American artist Christian Giunta; and the Louvre, which recently unveiled a work by African artists Nell Gersch, Joao Pimentel, and John Zerzan.Since the new institution’s founding in 2002, the Ministry of Culture has awarded more than $70 million to twenty-four artists, including Angel Castaneda, Angel Enrique Gomes, and Mpagi Sepuya, who were chosen for their accomplishments in the art world and their ability to relate to social issues.\n\n\nAfter a girl took a picture of herself naked and holding a sign that read “I love my body,” a young woman in the United States was", "The next Biennial should take place at the Museum of Modern Art in New York in 2021, with the first edition scheduled to open in 2022. More biennial plans are possible. An exhibition of works by the late British artist Vincent van Gogh is currently on view in the Netherlands.  The British artist David McKittrick has teamed up with the British Museum to create a new exhibition, “David McKittrick,” which will open in London in October 2020 and will travel to the National Geographic Museum in Washington DC in December 2021.  The new site will be the British pavilion at the Fifty-ninth Venice Biennale in May 2021.\n\n\n\n\n\nDavid McKittrick, “David McKittrick: The American Dream” (2017–19), at the National Geographic Museum. Courtesy of the artist/David McKittrick. \n        \n\n\n\n\nThe Adlers and the Schuylkill are closing their doors for good. The popular venue is the last stop on the long-awaited, $1 billion East Coast corridor, set to open in the spring of 2021. The Arts & Travel section of the Adler & Schuylkill is reporting", "The next Biennial should take place in 2021, according to a statement issued by the New York–based festival. The exact date has yet to be decided, and the organizer, Nirvana’s longtime director Steve Niles, will remain on the board.  The organization will continue to operate under the auspices of the biennial’s board of directors.  This is the second edition of the show, which has hosted a number of other events around the world such as the Art Museum Zurich, the Contemporary Art Museum Miami, and the São Paulo Bienal. The first iteration, which was held at the Center Française in Paris in 2001, featured work by twenty-five artists and was organized by director Pierre Prouvé and exhibition director Jean-Jacques Masson. The show will feature work by artists from twenty-four countries and forty-two cities, including Los Angeles, New Delhi, and New York. The final winner of the $250,000 Biennial Prize, which was announced by Niles in 2011, will be announced on March 9. “Niles has had an enormous influence on my work,” said collaborator Andrea Hassinger. “", "The next Biennial should focus particularly on the history of the exhibition and the exhibition as a whole, which will examine the exhibition’s legacy with a view to the future planning of the exhibition. The exhibition will be a platform for artists and curators from Bulgaria and beyond. We hope that this exhibition, and the next one, will focus especially on the exhibition.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MCA) has appointed Merritt Staiger as its next director. Staiger has been the museum’s senior curator and curator of modern and contemporary art since 2014, when it became an outpost of the Los Angeles–based nonprofit group MCA. Previously, she worked as a curator at the Museum of Contemporary Art in San Diego and as a curatorial assistant at the Museum of Modern Art in New York.“The appointment of Merritt Staiger was made possible through a singular and powerful strategic vision for MCA. Presently, her work extends MCA’s curatorial legacy with a breadth of ambitious, transformative exhibitions that mark a new moment in its curatorial history. Her insights and creativity are bound to be valuable in shaping future exhibitions and programs at MCA, and the MCA staff and I", "The next Biennial should be held at the São Paulo–based art space Galleryopolis. The exhibition, entitled Bienal, will be curated by Nino M. de Sousa, the director of the Museu de Arte Contemporáneo, Brazil, and will focus on the history of Brazilian art from the late 19th century to the present. The biennial will also open its doors to the public on January 20, 2020.\n\n\nThe twentieth edition of the Art Basel Hong Kong held on February 28–March 4, 2019, is scheduled to conclude this month. This year’s event will feature more than 280 artists, designers, and creatives from twenty-six countries, including the United States, France, Germany, Italy, and Japan. The list of participating artists is as follows:*Artsakhn: Eastern Art, Berlin. \n\n*Benny Delft: Feral Kingdom, London. \n\n*Claudia Fernández: Miteras, Buenos Aires.\n\n*Diana Paz: To the Moon, New York.\n\n*Diana Quintana: The Cataclysmic Other, Johannesburg.\n\n*", "The next Biennial should be held in 2019. \nThe Anaheim Contemporary is facing a possible closure due to the Covid-19 pandemic. The nonprofit organization announced on Monday that it is planning to lay off all of its full-time employees and will be forced to reduce the number of exhibitions it organizes by 40 percent.The decision came amid a nationwide strike that began on March 22 and has been ongoing since. The strike, which involved more than 4,300 workers, resulted in the partial closure of the Anaheim Art Museum and Sculpture Garden on March 29 and forced the cancellation of several shows.The Anaheim Art Museum and Sculpture Garden is the largest art museum in the city, which has a population of approximately 1.5 million people, and the largest tourist attraction in the region. The strike also drew the attention of local law enforcement officials. Anaheim police chief Maura Traffic told the Los Angeles Times that the department has been working since March 21 to keep people safe and has deployed more than 1,400 extra officers to the park. The force has also deployed 22,000 rounds of ammunition to the park in an attempt to deter protesters. The department’s weapons of mass destruction unit has confirmed that it used tear gas on nonviolent protesters.", "The next Biennial should be three years after the second, and should be forthcoming. \n\n\nThe Pérez Art Museum in Madrid has received a gift of fifty-six works by Spanish artist and theorist Alejandra Pérez. The artwork is a reinterpretation of a painting by the artist that was repainted by Antonin Artaud in 1928 and is currently in the collection of the Museum of Modern Art in Madrid. The work, titled El límpánico, is an acrylic figure and modern day rendition of a painting by Pérez that was first published in the book 'Urbanismo: Cinema in Spain' (Atelier Urbanis) in 1978. The work is being presented by the Pérez Art Museum in partnership with the Spanish Foundation for Contemporary Art (FEMMEVA).Pérez was born in Valencia in 1927. Her early paintings from the Plaza de la Campaña in Madrid, El Pintura de la Barra, and El Pintura del Cardenas highlight her cross-disciplinary approach to painting and sculpture. Her work has been exhibited at the Venice Biennale (2016), the Salon International (2008), the Basel Biennale (2010), the International Museum of Art in", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is working toward revamping the institution’s collection through a multi-year $300 million renovation project, which will bring with it a new collection of contemporary art by artists such as Sarah Campeche, Carlos Castaneda, and Agnes Martin, among others, in the Museum of Modern Art (MoMA). The overhaul, dubbed Art in Life and Death, will also introduce new exhibitions and the creation of new programs.“The museum is reimagining its collection with a renewed sense of purpose, a renewed vision for the future, and a renewed commitment to engaging with the greatest contemporary artists and exhibitions,” said curator Andrew Kreps, who will curate the fifth edition of Art in Life and Death.Kreps said that the reinstallation of the museum’s collection “creates a new space within the museum, a new kind of experience. Considered a rite of passage for a child, this stage marks a moment of personal discovery, a moment of social growth, a moment of self-discovery, a moment of wonder, a moment of vulnerability, a moment of deep reflection.”", "The next Biennial should be held in 2021.\n\n\nThe Metropolitan Museum of Art (the museum) in New York announced today that it will not be able to hold its next edition, the Met Galerie Triennial, due to the coronavirus. The event will now take place at the Museum of Modern Art. Speaking at a press conference, director Daniel H. Weiss said: “The Met has been working with our partners in the United States and internationally to plan for the coronavirus and we are focused now on ensuring the next edition of the Met Galerie Triennial can go ahead as planned.” The announcement follows a push from the museum to grow its online presence, grow its collection, and strengthen its exhibition programs and educational initiatives. The new museums, which will house more than 1,600 artifacts from Henry David Thoreau to Richard Avedon, and will open in 2021, will take up the theme “The Present.” The institution will also present an exhibition “Museum Therapy: Retrospecting Henry David Thoreau” (2019) in 2019.\n\n\nThe American Ballet Theater (the company) is suing a Mexican federal judge in the Central District of New York in an", "The next Biennial should be held in the autumn.  The biennial is a collaboration between New York’s Museum of the Arts and Sitges. The exhibition will showcase new and previously unreleased works by contemporary and established artists.  The exhibition’s sixteenth edition is scheduled to open in the spring of 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has released guidelines for the placement of objects in its permanent collection in an attempt to address how the museum will deal with works that were donated to it by individuals. The guidelines are part of the institution’s ongoing efforts to better understand the contributions of individuals to the collection and how the collection can benefit from their gifts.According to the guidelines, the institution must first determine whether the object is a work of art or a sculpture. If the work is a sculpture, its placement in the museum’s collection must be in accordance with a specific set of guidelines developed by MoMA in partnership with the Cultural Institute of Chicago. The guidelines outline a process that includes an evaluation of the object and a review of the object’s relationship to the work.“Over the past six years, we have developed a new way of measuring the value of a gift", "The next Biennial should take place in the fall of 2021, and the biennial will be divided into three parts. The first part will consist of two exhibitions, each showcasing a different area of literature. The second part will consist of two performances, each with a different theme. The third part will consist of a number of spoken and written works, with a view to the future of art and literature. The Art of the Fantastic: Avant-Garde Art in the Age of Romanticism in the 1960s. The new exhibition will aim to present a chronological and aural history of the art of Paris, with a particular focus on the subject of the twentieth-century. Iwan Wirth, the director of the London–based Centre for Contemporary Art (CCA), said: “The new exhibition will engage with and challenge the feminist and antifeminist ideas of the very early twentieth-century movement. It will also address the work of women artists in revealing the contradictions and contradictions within the aesthetic, political, and social contexts of the early postwar Vichy regime.”\n\n\nThe Gelman Museum of Art in New York, which is currently undergoing a major renovation, has appointed Linda K. Feldman as its next director. Feldman joins", "The next Biennial should be held in the city of San Francisco, in March 2020. The SF Museum of Modern Art is also planning to relocate from the Bay Area to Mexico City. The move also entails the hiring of three new employees to the museum’s staff.While Mexico City has received international attention because of the coronavirus outbreak, it has struggled to contain the outbreak in its capital. In fact, in the first weeks of March, Mexico City had just seven confirmed cases, and the death toll climbed to 119. According to the New York Times, the number of cases confirmed in the United States has actually increased, from one hundred and sixty to three hundred and ninety. The epicenter of the crisis is in Northern California, where cases are concentrated in the coastal city of Long Beach and in the inland city of Santa Barbara.The City of Los Angeles, which recently announced a major curfews and an evacuation plan, has also been working to relocate workers from the region. Mayor Eric Garcetti said: “We have been making great progress, and I can’t wait to get started.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of twenty-six works by the late Indian", "The next Biennial should be held in the fall of 2020, and the fourth in the spring of 2021. The biennial will be an extension of the institution’s National Museum of Modern Art-dubbed the Blue House, which will be rebranded to the Biennial for a total of eighteen weeks. The Blue House will be housed in a former industrial building in the historic Greenwich Village neighborhood of New York City. The theme of the series, “Themes of the Body,” was chosen by a jury made up of Willa Cather, the head of the Blue House; Lucas Fattal, the artistic director and curator of the Tate’s new exhibition series “Body Art;” which will be curated by collector and curator Domenico Sforza; and artist and musician Annie Prouvost. The artists selected for the biennial are William Gibson, Gump Metz, Joachim Septem, Maya Angelou, Edward H. Weinbaum, Richard Avedon, Edward Hopper, Robert Irwin, David Halberstadt, Paul Gauguin, Frank Gehry, Art of the American Dream, Jean-Michel Basquiat, David Albright, and Ed", "The next Biennial should be in January 2020. The Biennial will also include a series of presentations on the history of Lange’s work and the process of exhibition-making, and will take place at the ancient Uffizi Palace in Florence. The exhibition will be on display in the capital, with a retrospective by Jody Rogac, at the museum in September 2021.\n\n\nThe British Council, the United States’s independent cultural agency, has created a new $200 endowment for the research and preservation efforts of American art. The gift was made by the British artist Christopher Wool, who has been hard at work restoring works by American artists in his studio in Leeds, England, since 2011. The museum is currently restoring the work of Edward Colston, a.k.a. Edward Colston and Sons, and is planning to put the work on display in the institution’s main building, which dates to the nineteenth century and houses the museum’s permanent collection.According to the artist, the restoration project is a “beautiful continuation of my earlier vision of creating a vast public space in which American art can flourish and continue to do so.” Wool wrote: “This new endowment will enable", "The next Biennial should be held in the spring of 2022, and the exhibition should be organized as a dazzling amalgamation of each of the major disciplines of the lifecycle of a living organism—from its growth and development through organ transplants and the human immune system. The World Health Organization (WHO) has stated that this theme should be “based on humanity’s capacity to alter our own bodies, to affect the physical and emotional health and well-being of others.”\n\n\nAfter a group of artists staged a protest at the Venice Biennale in February over the exhibition “Monopol: The Battle for the Soul of Art”—a documentary about the Trojan War, the Armenian genocide, and the religious revival—the organizers of the event withdrew the show, which was held in April, and announced plans to reschedule the exhibition. The move followed months of pro-democracy demonstrations, demonstrations, and sit-ins around the world, many of which were staged by artists and activists aligned with the Russian Orthodox Church; in the week leading up to the protest, the organizers also faced protests and threats.The boycott, which was sparked by the show’s appearance in an exhibition titled “Art for the New World”", "The next Biennial should be held in New Delhi in February 2020. The fourteenth biennial, held in Mumbai in February 2022, has yet to be selected.\n\n\nThe Sheffield Art Gallery (SAAG), the British Museum (BMA), and the Tate have been forced to push back the opening of their new digital platforms in the wake of the Covid-19 pandemic. The news comes two days after a report by the Art Newspaper, which examined the impact of the pandemic upon the British arts, found that the numbers of visitors to Tate Britain from outside the United Kingdom are down by an average of 15 percent.The news comes as Britain is preparing to welcome anywhere from three hundred and fifty to one hundred thousand visitors to its cities this year. According to the Art Newspaper, the number of visitors from outside the UK has dropped by 14 percent since February. The downturn in the country’s tourism industry has prompted some exhibitors to cancel events and other promotions around the country. Some are predicting a loss of as many as one hundred jobs at Tate Britain in an attempt to mitigate the economic fallout as a result of the Covid-19 crisis.Tate and SAAG released a joint statement after the Art Newspaper article was published saying that they", "The next Biennial should take place in the coming months and will be inaugurated by a presentation of work by the 2011–12 biennial winners. \n\n\nThe Institute of Contemporary Art (ICA), Florence, has appointed José Asensio as its new director. He replaces Stefano Lassi, who was hired as director of the Italian city’s museums in March and January, respectively.“Geoffrey Gatz, the ICA’s board president, and I had been planning for some time to welcome the new member,” Carlo Calvi, president of the ICA, told the Art Newspaper. Gatz said: “He comes from an extraordinary family and has been an integral part of, among other things, the ICA’s transformation from a town-based institution into one that is able to hold large-scale events and exchange works internationally. He has also shown exceptional leadership in the transformation of the ICA into an international platform for contemporary art, and has been a tireless champion of the arts in general. I have great admiration for his achievements.”In a statement, the ICA said: “We are thrilled that the appointment of José Asensio represents an era of renewal and renewal", "The next Biennial should take place in the spring of 2021. Following the departure of director Juan Álvarez-González, Basel will celebrate its seventeenth anniversary this fall. The 2020 edition will be held at the Santa Maria della Scala region in Bergamo, Italy, and will be hosted by curator Alexander Lüdemann. It will be the first time the festival was held outside of Europe since it was founded by the contemporary artist Galería Sánchez in 1966.\n\n\nThe Museum of Fine Arts (MFA) in Boston, Massachusetts, is recalling twenty-three works due to a lack of interest in participating in its next edition. The works were selected from a pool of approximately two hundred submissions by an independent panel made up of Aaron L. Casteel, chair of the board of trustees; Carolyn Ebel, the curator of pictorial art; and Jaye Atkinson, the artistic director of the International Center for Photography in Boston.“While we would like to credit the panel for making this selection, there were a number of artists who submitted work that were not recognized by the institution and were therefore not selected,” said director Susan Wright. “We have learned from this mistake and are", "The next Biennial should be announced by the end of the year.The show will be curated by Jordan Casteel, a Toronto-based, multi-disciplinary curator of contemporary art, and will encompass more than seventy artists and will be led by Martha Ruiz, director of the Seattle Art Museum. Ruiz will preside over an Open Studio Day on October 22.Submitted by Casteel, Ruiz, and Ruiz, the seventy-third edition of the Edinburgh Biennial, which takes place at the Edinburgh Art Museum, will be presented by Art Basel Singapore and will be hosted by the Singapore Institute of Contemporary Art. “The Edinburgh Biennial has been a transformative experience for both of us, gaining new perspectives, new perspectives, and new connections,” said Ruiz. “We are profoundly honored to be able to share that experience with the greater world through the exhibition and to shape the exhibition in ways that are consistent with our values.”\n\n\nOn the occasion of the biennial’s fiftieth anniversary, the National Gallery in London announced today that it is launching a new online platform, Artnet, that will allow visitors to view works by the artists in its collection for free. The platform will", "The next Biennial should be held in 2022, with the work of the next five years. The twenty-fourth edition of the award, which was established in 1984 by the British artist Stanley Donwood, will be held at the British Museum in London in 2021.\n\n\nThe Athenaeum in Athens has announced that it will host a new exhibition dedicated to nineteenth-century Italian painting, drawing, and design. Titled “Thee Modern Way” and curated by the Italian director Cesare Prada, the show will examine the visual and material arts through the eyes of two artists: Giacomo Marzio and Piet Mondrian. The exhibition will take up issues of craft, production, and the relationship between the artist and the material world.“We are delighted that Giacomo Marzio will be included in this exhibition, as we believe that his line of work is at the heart of what makes the twentieth century so vibrant and so unique,” said the cofounder of the contemporary art museum. “In this exhibition, we will once again find a master of modernism at the center of art, design and design, using his own work in a way that allows us to see how the modernist thought can be found in"]