["The next Biennial should be held in 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it has received a gift of more than two hundred works by the late Italian architect and landscape architect Vittorio Emanuele, who left behind many unfinished projects. The work, which was donated by a group led by the Italian architect Giulio Cica, comprises works by Munich’s Robert Vico, Vittorio Bertone, Giulio Bocconi, Tilson Tibbett, and Yoshitomo Adachi, the last of whom built a work that has become a landmark in the city of Nagoya, Japan.“We are deeply honored to receive this gift from Giulio Cica and our staff, and look forward to the restoration of this extraordinary collection,” said Michael Govan, director and CEO of the MFA.The gift includes several works by Vittorio Bertone, founder of the Fondazione Bertone, including Serie A, 1975, a tribute to the late architect’s long and distinguished career; Tali Barozzi’s Theater of Lovers,", "The next Biennial should focus on the production of a “quasi” model for the exhibition, which would be comprised of a series of “mini” exhibitions, presentations, and performances. The new lineup will be announced in the coming weeks and will include work by forty artists in the coming months. The event will be held in the Institute’s new home in the city of Basel from March 29 to March 31, 2020.\n\n\nThe New Museum in New York has appointed Sharon Gish as its upcoming director. She will assume her post on April 10.Gish comes to the institution from the Museum of Modern Art (MoMA), where she has been director of public engagement since 2014 and has overseen nearly three hundred exhibitions, including the first solo exhibitions of work by artists such as Charles Owens and Robert Irwin in 2001 and 2014, respectively.“Sharon embodies the New Museum’s values and she has emerged as a leader in the field of modern art,” said ‎New Museum director Matthew Teitelbaum. “With her deep experience in the field and her passion and commitment to the arts, she has the opportunity to further our mission and our artistic and artistic-historical ambitions. . . .", "The next Biennial should take place in 2021, and the next will be held in 2022. In a statement about the exhibitions, state-run Art Museum Tuzla said: “The new partnership has created new opportunities for us to continue to increase our international presence in support of the art of our times. And, as we look ahead, we are happy to say that the future of the exhibition will be bright. We have been working hard to improve the exhibition programme and to create new opportunities for exhibitions.” The new partnership has also introduced new initiatives to support artists and the art world in the region. For the first time in the museum’s history, The Contemporary Research Centre in Tuzla has partnered with the Museum of Contemporary Art, Los Angeles, to create a new exhibition with a single curator. The show, “The Art of Modern Life: Modern Art in the Eighteenth Century” will be on view through August. The new exhibition, which will be organized by the Institute of Contemporary Art, will be themed “How to Create a Life.” The theme will be a combination of traditional art and environmental activism, the history of art and activism, and the current exhibition at the Contemporary Research Centre.", "The next Biennial should commence in late spring. \n\n\nThe Metropolitan Museum of Art in New York has appointed Jane Panza as its next director. Panza comes to the institution from the Museum of Modern Art, Los Angeles, where in her new role she will oversee the museum’s collection and administration, manage the museum’s programming, and oversee the development of the museum’s exhibition program. “Jane is an exceptional leader who has built her own reputation on the strength of her relationships with great artists and important institutions,” said director Daniel H. Weiss. “Importantly, she is driven by a deep sense of mission that is aligned with the mission of the institution. The opportunity to build on her legacy and continue the museum’s long-term mission is too good to not consider. We are thrilled to welcome her to the Met.”Panza previously served as director of the Whitney Museum of American Art in New York from 2003 to 2009, and as deputy director for collections and exhibitions at the Museum of Modern Art, where she coordinated the museum’s acquisition, presentation, renovation, and conservation programs. She also held positions at the Museum of Fine Arts, Boston, the National Gallery of Art", "The next Biennial should take place at the Cultural Centre of Antwerp, scheduled for 2019, and will organize a wide range of exhibitions and presentations, from the exhibition of the first exhibition dedicated to the new generation of Romanian artists. The biennial will also introduce new ways of studying art and deepen the understanding of the history of art. The second event is scheduled for 2020 and will be held at the Museum of Modern Art in New York, and will feature the work of more than sixty artists in a wide variety of styles and styles of painting, sculpture, photography, and installation.The third biennial will take place at the Museum of Modern Art, New York, and is slated to run from June 22 to June 25, 2020. The fifth and final biennial will be held at the Studio Museum in Harlem, New York, and will be presented by curator Mary Stanley. The exhibition will be curated by Gideon Raff and will be supported by a gift of thirty-six works, curated by Stanley, from the artist’s father, H.J. Stanley, who passed away in 2018. The full list of participating artists is as follows: (All artists represented have contributed to their biennials; the biennial nominees are not", "The next Biennial should be instigated by the artist-run and global nonprofit, Bia Biennale, in the spring of 2021. The theme will be the ubiquity of imagery in the art of the Biennale, which was founded by the Philadelphia-based artist Nari Ward in 2000. The biennial will also feature work by artists involved in the United States and around the world. “This is a transformative year for art, and I’m so excited to see where we go next,” said Ward. “I’m confident now that the work of Gaí D’Aloia, Shantal Alhassan, and our diverse group of artists will have a positive influence on the next biennial.”\n\n\nThe Institute of Contemporary Arts (ICA) in Prague will institute a digital platform in the country’s capital in late April or May to facilitate the exchange of artworks between the ICA and the Czech Academy. The initiative, which will draw from the ICA’s collection of more than 4,000 works, will be modeled on the city’s public art galleries, where visitors can see works by artists from the ICA and the Czech Academy", "The next Biennial should focus on the ongoing evolution of the relationship between artists and the state in the twenty-first century, and on the question of how art and politics might be held in common in the twenty-second.  The 2019 theme “Volta,” the theme of the biennial’s inaugural exhibition “Volta: Art and Counterpower,” is an important example of the future-oriented potential of the recently acquired space, which currently holds a permanent collection of Oscar Nacional’s works. The biennial will also be focused on the possibilities and the limitations of creativity, in the context of a biennial. The exhibition “Olivier-Louis-Cartier” will be staged in collaboration with the newly reopened École des Hautes Études en Sciences Sociales (EHES), as part of the new partnership between the institution and the city of Paris. The presentation of the show will begin on March 14.The exhibition “In Praise of Art” will be staged in collaboration with the newly renovated Palais de Tokyo in Paris on March 16. The exhibition will highlight all the works created by the newly appointed director of the Palais de", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Leslie Hoffman-Camp as its first executive director. Hoffman-Camp was previously the director of the Brooklyn Museum and the Los Angeles County Museum of Art (LACMA). She previously helmed the gallery where she met and married Richard Shiner, a Los Angeles–based artist.“While at LACMA, Leslie was instrumental in the transition of the institution from a nonprofit to a for-profit organization, leading the transition from a three-story, glass-enclosed building to a contemporary design that embodies a mix of art and technology, science and technology, and the American West and the Pacific,” said David K. Michelson, director of the Knoedler Center for Art History. “Her commitment to revitalizing the Knoedler and building upon its legacy of challenging the limits of what art can be has made her a strong choice for the role of general manager.”Hoffman-Camp joined the institution in 1998 as director of photography. She has served as interim director of photography since 2018. During her tenure, she expanded the center’s collection by 20 percent, added new exhibitions", "The next Biennial should be held at the National Museum in Washington, DC, in 2020.\n\n\nIcelandic artist Jón Harald Svein, a pioneer of the avant-garde art movement, died last week at the age of eighty-eight.Born in 1928, in the small coastal town of Kupala, in central Iceland, Svein studied art at the local high school. He returned to the school in 1945 and graduated in 1950 with the frescoes of Hedvig Heim, a work by Lars Vilks and Jón Østbye. In the same year, the artist received his bachelor’s degree from the school.In 1967, Svein relocated to Reykjavík, where he continued his art training. In 1976, he received his master’s degree. In 1997, he was awarded the National Art Prize, and in 2000, he was awarded the Order of Norway’s Order of Merit. In 2005, he was also given the Order of Norway’s Order of Merit for his lifetime achievements.In 2013, Svein was chosen to represent Iceland at the IAA Gallery Design Biennial in New York and won the grand prize. His", "The next Biennial should be an opportunity to see and touch works by, and hear new work by, the twentieth-century artists represented in this exhibition. We are planning the Biennial to reflect the diverse voices of the contemporary art world, and to reflect the history of the exhibition as a whole.”After the opening of the exhibition, the Biennial was acquired by the London-based curator and curator-at-large and artist-in-residence, Matthew Price, who curated The Social Network, 2016, at the Museum of Modern Art (MoMA) in New York. In a 2015 interview with Artforum, Price described the Biennial as “a bit of a hybrid: a bit of a museum, but also a bit of a public space,” and said that he is committed to keeping the Biennial moving and engaging.\n\n\nThe Metropolitan Museum of Art (MoMA) has appointed Arash Markazi as its next president and CEO. Markazi, a Tel Aviv native, will take the helm of the institution during a four-year term that will run from March 2021 to March 2022. He succeeds Annual Viewing Parties host Andrew Kreps, who departed the museum in July 2019 to", "The next Biennial should be held in the summer of 2021. Commenting on the decision to move forward with the exhibition, Dittrich said: “We are continuing our work now to make art history possible in the spring, and the art of tomorrow. We will continue to do this with the exhibition, and we will continue to produce exhibitions of work in the spring and the summer. We are not afraid of the future, and we are unafraid to do this with artists, collaborating with them, teaching them, and influencing them.”The museum also announced that it will make a new commitment to supporting the artists and their families through its Foundation for Art and Art Museum (FAM) in Los Angeles, which was founded in 1963 by philanthropists Arthur DeMille and Alfred M. Stern, and through a new $1 million gift from the Sargent and Degan, the Tate and the Waterlooville.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles plans to axe more than one hundred artworks and cut more than two hundred hours of programming in an attempt to reduce costs as part of a $2 billion restructuring, reports the Los Angeles Times.The museum announced in April that it intends to lay off at", "The next Biennial should be held in the Spring of 2021, and the show will be held at the Museum of Contemporary Art Berlin in the Spring of 2022. The first exhibition will be “Avant-Garde in America” and will be at the Museum of Contemporary Art in Houston in the Spring of 2021. The second exhibition, “Christo,” will open in the fall of 2021 and will be held at the Zürich Art Museum in the Spring of 2022. The third exhibition, “Wangechi Mutu: The Art of the Indian Body,” will open in the Spring of 2022. In order to set up the auction, the Spanish Ministry of Culture contracted Psyche Automotive Group, the manufacturer of the Japanese brand, to provide the Biennial with 80,000 pieces, which will be given to the museum by invitation. Its chairman, José Manuel Márquez, said: “With the auction, the new partnership between the Biennial and the Spanish Ministry of Culture, we are pleased to present the world this unique exhibition. The show Hauptstiftung - Das Art des Deutsches und der Kunst,” which was organized by the Hamburg-based company,", "The next Biennial should be held sometime in the 2020s. The gallery had previously planned to hold a retrospective, “L'Art et l'Histoire,” in the fall of 2021, but the event was postponed due to Covid-19.The Philadelphia Museum of Art (PMA), which has been under construction since 1997, is currently constructing a massive $150 million museum designed by the Italian-based firm of Baronet Guggenheim & de Meuron. The museum will be completed in 2020 and will open to the public in 2022. The museum is currently working on a new set of guidelines to protect the health of visitors to the museum from Covid-19 and is currently drafting an interim report on the health of visitors to the institution.The British pavilion at the Venice Biennale, which was designed by Guggenheim & de Meuron, was presented to the British artist Paul McCartney, whose entire life was devoted to transforming the meaning of art through his work. The sculpture “All My Loving” was created for the exhibition “Paul McCartney, The Life and Art of,” and was inspired by a scene from the Beatles’s “All My Loving” video. The work was", "The next Biennial should take place in 2020, when the exhibition will be staged at the museum’s new, expanded space at 215 Monroe Street. The venue will offer a larger view of the exhibition and will be equipped with a new collection of works by contemporary artists, which will be presented by artists representing China, Korea, and Japan. While the exhibition will be in an urban setting, the gallery will also be able to display works by artists from the Arctic Circle—including the first exhibition devoted to the traditional art form in the United States, “The North Pole” in 2018.No date has yet been set for the 2020 event.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Edward Kritsky, who has served as the museum’s deputy director of curatorial affairs and curator of modern and contemporary art for the last fifteen years, as its next director. Kritsky joins the institution from the Solomon R. Guggenheim Museum in New York, where he has been interim director since August 20, 2019.“I’m very much looking forward to his leadership,” said Mary Anne Carter, director and CEO of the MoMA. “Edward has an extraordinary track record of", "The next Biennial should be held in 2020. “We are planning to reimagine the museum in order to reflect and extend the life of the institution, making it a platform for local and international interaction,” said  Peter Munk, chairman of the museum’s board. He added that choosing the location for the first exhibition, which will travel to the museum in 2021, was not a problem.The museum has hosted numerous incarnations of the exhibition, including The Contemporary American Art Exhibition, The New Republic, the Museum of Modern Art, and more recently at the Public Art Museum in New York. Last year, the museum held fifty-six exhibitions, including fifty-two recreations of works from the exhibition “Paul Gauguin: The Exhibition of Modern Art” (2019), a masterpiece of modernist art that was staged at the Museum of Modern Art and the Modern Art Museum in New York.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has designated the twenty-third edition of the Art of the Party, an annual two-month-long celebration of the arts and culture of southern California, as the future home of “Black Lives Matter”\u0097a statement made by", "The next Biennial should be held on September 20–September 21, 2020. This will mark the eleventh edition of the exhibition. \n\n\nThe French city of Lyon has announced that it plans to hold an international art fair in 2021, following a meeting of the city’s mayor, Yvonne Fattal, and the city’s cultural council in June.“With the cooperation of the city and the municipality of Lyon, the city government has decided to present the city, the region, and the country a new exhibition of French art,” Fattal said in a statement. “This is a large step and a very important step, since the city has never had an international fair.”The official said the city’s first edition of the fair, titled “French at Home,” was canceled in March due to the Covid-19 pandemic. Fattal cited the decision to cancel the exhibition as the reason for the move as one of the reasons for her resignation. LaFrance Interculturale (LIA), the French organization that organized the event, is planning to stage the 2021 edition of the fair in May. The organization is currently in negotiations with Le Monde to", "The next Biennial should take place in the fall of 2020, and the biennial will follow a new format and a different theme. The biennial will be organized in four phases. The first phase will focus on the cultural impact of the pandemic; the second phase will take a creative and experimental approach; the third phase will focus on the exhibition of contemporary art and will be organized in a way that will be accessible to visitors from the general public; and the fourth phase will be a celebration of life. Artforum will have more details about the 2018 theme, “Time for Change: Art and Culture in the Age of Climate Change,” and the upcoming biennial as it becomes available.\n\n\nThe Museum of Modern Art (MoMA) in New York has reached a settlement with the heirs of Holocaust survivor Paul C. Halbreich, the founder of the hospitality business empire Bechlebenkäse Rentz, who was the main financial backer of the museum from 1989 to 2011. The settlement also resolves a number of other legal complaints, including a claim that the heirs were demanding irreparable damage to the estate and that the heirs were intentionally attempting to damage the trust that financially supported the estate.“The museum, like most contemporary", "The next Biennial should consider a meditation on the ways that art and culture intersects and conflicts with contemporary society, with a particular focus on how the arts and their institutions can be responsive to and connect with our lives and social and political systems. \n\n\nThe British Museum, the National Galleries of Scotland, and the National Galleries of Ireland have launched a new digital initiative that aims to help cultural organizations prepare for the coronavirus pandemic. The Digital Campaign for the Covid-19 Emergency Response and Recovery, launched today, aims to provide local, state, and national leaders with instant access to information about the Covid-19 Covid-19 Emergency Response and Recovery 365-day challenge, which was launched by the National Institute for Health and Care Excellence (Nice), the Department of Culture, Arts, and Leisure, and the Department of Health and Social Care. The program will also include case studies, case studies of different scenarios and will highlight key trends, such as the NHS facing a major shortfall of 40 percent of its requirement for health workers and how the homelessness and sickness services are being stretched as a result of the coronavirus.The National Galleries of Scotland said: “The Digital Campaign for the Covid-19 Emergency Response", "The next Biennial should be held in the spring of 2020. \n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $50 million donation from celebrity curator Michael Douglas. The $150,000 gift was made by Julie Douglas, the late wife of renowned designer Don Douglas. The couple began working together to promote the work of Douglas’s contemporary and fellow American painter Leslie Olens. Since the late 1980s, the duo had collaborated on numerous projects including a retrospective of the work of Olens at the New Museum in New York in 2007, “Scandinavian Sculpture: A Logical Evolution,” which toured the country and traveled to the exhibition “Olens: The Art of Life,” at the Hammer Museum in Los Angeles in 2011.In recognition of this collaboration, the museum is now presenting the work of Leslie Olens in the museum’s permanent collection for the first time. The gift includes three works by Douglas: The V-Rays, which was dedicated to his wife, and a 2009 work installation that was inspired by the late American fashion designer Ralph Lauren. The work, titled “The V-Rays: The Painter and the Ugly,”", "The next Biennial should be held in 2022. The artist will return to the Los Angeles County Museum of Art (LACMA) to take up the subject of the Digital Self, and, in the process, experience the first physical embodiment of a self-generated digital masterpiece.“The Digital Self,” Sara Nussbaum, chair of the award jury, told the Art Newspaper. “The work that Peter did was engendered by the fact that the digital realm is a space of self-creation, and that self-creation is, in part, a medium. The work is about our relation to technology—it is about our relationship to art—and about the nature of art.”\n\n\nA group of artists, academics, and writers have issued a statement condemning the destruction of more than 1,400 works by Japanese artist Mitsutoshi Kato, whose daguerreotypes often feature grotesquely realistic landscapes, and the systematic neglect of the artist’s studio and/or home. The statement, issued by the Artists’ Association of Japan, Artforum, and the Art Newspaper, states: “We condemn the deliberate destruction of Kato’s studio and home in Kasugai, and the", "The next Biennial should also include various exhibitions that examine contemporary issues, such as the relationship between art and technology and the environment.  The inaugural event, “Wu Xiaojun” (1937), was given the title for its first exhibition by the Hong Kong-based artist and activist Jiang Wenli.Its second edition, “Wang Wei” (1939), was organized by the China Museum of Art in Beijing, which was founded by the Tianjin-based entrepreneur Kengo Tung. Its third and final edition, “Xu Xianlu,” (also called Xianlu 3), was organized by the Guangdong-based artist and activist Lin Kao. The biennial will be held on the occasion of the twentieth anniversary of the artist-led campaign #Wu Xiaojun, the campaign for an independent state of Yunnan in China, which was launched by Xiaojun’s son Liu Xianlu in 2008. “The Biennial of Art and Technology in Hong Kong is an honor that is being shared by a generation of activists, artists, policymakers, and academics, and we look forward to the opportunity to present a new work inspired by the", "The next Biennial should take place in Dusseldorf in December 2020. \n\n“We are thrilled to have the opportunity to organize a biennial of contemporary art aimed at both young and old audiences,” said Panayiotou. “I believe that the future of art lies in the sharing of knowledge and ideas, and in the understanding that art and artmaking are complementary and interrelated.”\n\n\nThe New York–based nonprofit Space for Art has asked the Metropolitan Museum of Art to acquire the artworks of the late art historian, theorist, and curator Milton Berle. The Metropolitan is currently working on a new $1.5 billion overhaul of the Met, which will include the creation of a new Center for Art History and the reopening of the museum. The proposal, which is subject to a formal $1.5 billion grant from the Rockefeller Brothers Fund, is part of the plan to return the Met’s collection to the collection of the late collector and art historian Albert and Caroline Berle, who were close to artist Peter Paul Rubens and who donated their entire collection, including the works of their late friend Eugene O’Donnell, to the institution.OVR Partnerships: The organization has announced", "The next Biennial should take place in the spring of 2021. The bidding for the exhibition was also held this year, and the design was chosen based on a shortlist of fifteen proposals, which included Venus Williams’s The Glass House, Koenig’s The Wild and the Innocent, and Haus der Kunst’s Günther Sculpture Garden. \n\n\nThe Philip Johnson Foundation and the Fine Arts Museums in Los Angeles and New York have received a gift of more than 250 rare photographs, prints, and drawings from artist Christian Lloyd. The donation, which was made in 2014, includes the works in the collection of the foundation, which was founded by artist and philanthropist Johnson in 1990, and the institution, which was established in 2007. In addition to a number of rare prints, the gift includes a 116-year-old photograph of Johnson’s first solo exhibition in the United States, which opened at the Los Angeles County Museum of Art (LACMA) in 2006.Based on a survey of Johnson’s artworks by the curator and art historian Troy Travers, the biennial will investigate “how Johnson’s work has been perceived and appropriated over the past twenty years", "The next Biennial should take place in January 2021 and should be hosted at the site of the new museum, a former U.S. Army camp built to house a quarter-million people in 1945.The next edition of the Biennial will be held in March 2022.\n\n\nMore than 1,500 artists, collectors, and art workers have signed an open letter addressed to British Prime Minister Boris Johnson and the City of London, urging them to enact greater financial and social action to protect the cultural sector from the ongoing health crisis caused by Covid-19.Called for by the Theatre Artists' Alliance (SA), the Arts Council England (ACE), and the National Union of Journalists, the letter points to one of the greatest threats to the creative economy—the economic fallout from the coronavirus.“At this stage, the only way to stop the spread of Covid-19 is for people to come together to make a show of unity and resilience,” reads the letter, which was penned by Annie McDonald, Polly Staple, Anne-Marie Trevelyan, and Laura Owens; the National Poetry Library Association; and several hundred academics and writers, art workers, and other arts professionals.The letter notes that the UK already spends $", "The next Biennial should be held in late December. \n\n\nThe Museum of the City of New York (MoCA) has released a new mural on its walls that will feature new works by fifty-four artists, including Nari Ward, Trina Trisha Brown, and Ben Samuel, and will be unveiled next month. The project, called “Imageless,” was commissioned by artist Samantha Hale and was one of the themes of the gallery’s exhibition “Imageless: Artists and the Art of Life” in September.“The project was born from the need to re-create an environment in which the Museum could engage with the lives and works of artists through a process of inquiry,” said Hale. “I’ve been an artist all of my life and have always strived for a space where I could create meaningful work. I always had the feeling that I was at the centre of something and never really got to see what it was that I was working on.”The mural, titled “Lara Albright,” also features new works by the late Pennsylvania native and New York–based artist Saul Williams, whose work is currently on display in the exhibition “Press", "The next Biennial should conclude with a performance by the New York Philharmonic, which will address the theme of “Theoretical Art” from its upcoming season. The theme “Parallel and Distant Worlds” is also a theme of the 2019 iteration of Daring Do. The Dancers, a troupe that mostly consists of students from the School of the Arts, will lead the new opera, which will be staged in partnership with the Princeton University Orchestra, in a performance that reflects the cultural interdependence of the United States and New York. “We are thrilled that the premiere of The Dancers will be the first time that the troupe will perform an opera in New York City,” said the school’s artistic director, Mary Ellen Duarte. “This is a groundbreaking opportunity to raise awareness of the extraordinary cultural exchange between our cities, and it will help to introduce Daring to a new audience. The Dancers will bring a new perspective to Daring, and deepen the legacy of our beloved school, with their extraordinary work.”The 2019 edition of Daring Do took place at the Broad, a former Union Square factory that has been transformed into a landmark for visitors to the city", "The next Biennial should be announced soon.\n\n\nThe Metropolitan Museum of Art in New York announced today that it is launching a new initiative that will provide free admission to families and small businesses through the use of interactive technology. The initiative, called the Metabolic Odyssey, will put more than 75,000 works on display through five online platforms in order to provide an over-the-top experience for visitors. The first platform, a virtual reality museum, will be inaugurated in the spring of 2021. The first VR experience will feature works by twenty artists, including Hsin-Chien Huang, Laura Owens, and Grigori Genovese.The Metabolic Odyssey will also host the first exhibition dedicated to the life and work of Russian surrealist Andre Gide, whose works are currently displayed in the newly opened Gide & Alexander exhibition space at the Met. The second exhibition, titled The Other: Dada in VR, will open in the spring of 2022.The Metabolic Odyssey was born from a collaboration between artist-owners and the experimental museum TMA. The nonprofit was granted a $250,000 grant from the Kastner- and Rockefeller-backed foundation Artnet in 2017 in recognition of its work in facilitating the entry of younger artists into the", "The next Biennial should be held in 2022, and the last in 2024.  Among the projects that will be on display in the exhibition are the first-ever immersive experiences created by artists in Japan, and the first-ever works by indigenous artists in the museum’s collection. The exhibition will draw from the biennial’s existing holdings, which include works by Sara Bareilles, Hiei Ho, Masumi Nakayama, and Yuki Kondo. The work of each individual is on display in a separate exhibition, and a number of the works will be presented in conjunction with the first Biennial. “We are so excited to present the first works in the new exhibition series, and to be able to present works by these artists and other artists of the New World in order to explore the richness and diversity of their aesthetic practice,” Associate Director Jessica Wright said in a statement. “The exhibition is a great opportunity for our visitors to see these works in their entirety, and to experience them as a work by each artist, whose work reflects the unique range and energy of their voices.”The 2018 exhibition, titled New Line, was curated by Maria Andrea Barnes", "The next Biennial should be in February 2021. The 2019 edition, titled and held at the Museu de Arte de Barcelona, drew 4.4 million visitors and featured work by more than 150 artists. \n\n\nThe Amis du Palais d’Or in Paris has appointed the contemporary art curator of the city from the city’s Arts District, between the Île-de-France and the Avenue de la Réunion in the city of Saint-Rémy-de-Provence, Fabienne Leclerc. Leclerc will head up the Amis du Palais de Paris and its new organization from January 2021 to March 2022.“Pérez-Ishikawa is a perfect candidate for this role,” said director Rebecca Durov. “He has extensive experience in the contemporary art world and has demonstrated a strong commitment to the Arts District, which has been critical to the development of his career. We are confident that he will continue to grow the Amis du Palais de Paris and create new opportunities for new artists to explore our city.” The Amis du Palais de Paris opened in 1976 in a renovated former textile factory in the district of ", "The next Biennial should take place in 2021.\n\n\nThe Royal Institute of British Architects (RIBA) in London has announced that it is planning an overhaul of its iconic Institute, which was completed in 1953, in an attempt to make it more sustainable.The institute, which serves as a major cultural gathering site, was designed by British architect Richard Avedon and includes spaces for a museum, theater, and exhibition spaces as well as a café and conference center. Its current location is in the city’s Hyde Park, which is currently home to the Institute for Contemporary Art (ICA).The redesign will utilize green spaces such as the Lobby of the Institute and the Institute of Contemporary Art, which is currently undergoing a $10 million facelift, as well as the design elements of the facade of the building.The RIBA New York office will be reworked to maximize its Exhibition and Conference space and will incorporate digital and augmented reality. The institute will also be redesigned to better reflect the city’s Hudson Yards development, which is currently under construction. The redesign will introduce new public galleries, expand the exhibition space at the center, and increase the number of exhibits and the collection.Culture Secretary Karen Bradley announced the overhaul in a written statement on March 31", "The next Biennial should take place in the autumn of 2020 and will be a “close-up” look at the history of the museum. “Over the years, we are now achieving the vision of our founder, and I look forward to continuing his legacy, developing the Biennial in line with the theme of the upcoming exhibition,” the museum’s director, Jean-Pierre Blais, said in a statement.Titled “Architecture and Design: The Secret History” and curated by award-winning architect Jean-Michel Basquiat, the exhibition will also include “The Shape of Things to Come” and “An American Odyssey,” a look at the history of American architecture.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta announced on Friday that it has received a gift of forty-nine works by thirty-five artists from the collection of the estate of the late philanthropist and collector P. L. Frank, including Michael Kohn, John Graham, and Oskar Eustis. The gift includes works by Thomas A. Price, Diana Al-Sara, Gertrude Almina, Yale Jones, ", "The next Biennial should begin as anticipated in 2020, but the organizers are capping the exhibition at twenty-six weeks. An exhibition of the works of Iván Arteaga, Andy Warhol, Marcel Duchamp, and Pierre-Auguste Renoir will also open in the fall of 2021.\n\n\nThe City of New York is planning to spend $4 billion to remake the Hudson Yards neighborhood in Queens into a large, modern, artist-owned museum. The $1.3 billion overhaul will include the expansion of the institution’s footprint, the construction of a new public gathering space, and the renovation of the adjacent 156-acre site.The $1.3-billion overhaul includes the construction of a new public gathering space, the renovation of the adjacent 156-acre site, the acquisition of land for the development of public benefits and arts initiatives, and the reopening of the existing museum. Among the projects that were prioritized are the construction of the new multi-million-dollar pavilion; the redesign of the gallery space; the renovation of the adjacent Rema Hort Mann–designed building; the acquisition of more land for the development of arts facilities; the renovation of the existing Rema Hort Mann–designed building; and the reconfig", "The next Biennial should be held in 2021. The first and last exhibitions were held in 2007, and the last in 2011. The event’s current format, which will focus on the development and preservation of art in a vacuum, will be inaugurated at the Frieze New York fair on June 3. The event will then return to Paris for a third and final exhibition in 2017. The next exhibition will be titled “Landscapes of Invisibility” and will feature more than seven hundred works, curated by artist-in-residence Tata Øyvind. The biennial will also include a seminar on “civilization” and “the future of art.”Spring/Summer 2019: The series “The Biergarten Biennale” will go on as planned, with the exception of the title, but will include “Theater of Pain” and “Theater of Splendor” (both 2019), a retrospective organized by the Danish curator Grete Roitz. The exhibition’s next phase will be “The Metal of Time” and “The Gnot of Our Lives.”The show will also feature", "The next Biennial should be held in 2021.   \n The Mexican artist Juan Aguilar (1930–1982) is currently serving a twenty-year sentence in prison after being convicted of murdering a man during a robbery that took place in Mexico City in 1981.The thirty-one-year-old artist was convicted of the crime after the crime was committed in the early hours of the morning, on January 4, 1982, on the Bolivian side of the US-Mexico border, and in the courtyard of the artist’s apartment.During the crime, the victim, José Miguel Ponce de Beauregard, was strangled and his throat was slit with a knife. The victim’s body was later found in a ravine near the city of Nogales.Ponce de Beauregard’s sister, Sonia, and sister-in-law, Carmen, were also arrested in the case but were later acquitted. The family of the victim are now fighting to have their convictions overturned. The sister-in-law was acquitted last year after she testified that the murder was an accident.The crime took place on the Bolivian side of the border with Mexico City. Ponce de Bea", "The next Biennial should be held in 2021, the year of the One-Eyed God, but this is currently unconfirmed. Probably the most anticipated exhibition of the 2020 edition will be “The Body in Art: The Photographers Avant Garde” (2019); curator Hélio Oiticica; and an exhibition dedicated to the Triumph of the Body, which will open at the Museo de Arte Contemporáneo Ato, Buenos Aires, in October 2020.The exhibition will focus on how artists have used the body in their works, and what the future holds for the body in art. The first iteration of the exhibition, which took place in September 2014, included work by artists such as Carlo Graziani, Cécile Bihan, and Juan Carlos Muñoz; and it will continue until March 21, 2021. The exhibition also revealed details about the next edition of the Biennale, including a full list of artists, a list of the venues, and a list of the artists who will be participating in the 50th anniversary celebrations.\n\n\nIn the aftermath of Hurricane Maria, Puerto Rico, and its surrounding territory were forced to close their borders and prepare for a massive influx of people seeking", "The next Biennial should be held in 2020. The next Art Basel, which will open in Hong Kong in February 2020, should be held in 2021. The next Art Dubai should be held in 2022, and the next Art Dubai will be held in 2022.\n\n\nArt Basel Hong Kong has received a cease-fire offer from the majority leader of the Democratic Party in China, Xi Jinping. The New York Times reports that the Hong Kong government granted the exhibitors two weeks to suspend hostilities or cancel their upcoming events. The offer was made on Thursday, March 17, the same day that National People’s Congress (NPC) delegates met in Beijing to elect a new leader for the region. “The government must take decisive and practical measures to protect the territorial integrity and sovereignty of Hong Kong and the people of China,” said CCP Central Committee member Wu Jie. “The Hong Kong government must implement measures to stabilize the Hong Kong region and Hong Kong society, and take effective measures to enforce Hong Kong’s sovereignty over the territory of Hong Kong.”The invitation to suspend hostilities comes at a delicate time for China, whose Cultural Revolution ushered in an authoritarian regime that severely restricted civil liberties and stoked anti-democracy protests", "The next Biennial should be on June 5. The rest of the world will be waiting, waiting, waiting, for the final chapter.\n\n\nThe Museum of Contemporary Art (MoCA), that was closed for more than six months due to the Covid-19 pandemic because of a catastrophic miscommunication between museum director Klaus Biesenbach and the board of trustees, has finally opened to the public. The institution, located on the ground floor of the One57 industrial building in Downtown Los Angeles, is one of the last major cultural institutions in the United States without a permanent permanent staff and must continue to operate on a temporary basis as part of a $25 million grant program.The museum had been slated to reopen on December 6, but was forced to postpone the reopening because of a lack of funds. The institution announced it will re-open on January 10, 2020. The reopening will be simultaneous with the opening of two new, twenty-one-thousand-square-foot, glass-enclosed galleries. The new spaces will be inaugurated by the installation of a new work by artist Jannis Kounellis and will celebrate the institution’s centenary.The grant program, which will run through December, was established in partnership", "The next Biennial should be held in 2021. The idea is to create a platform for the exchange of ideas and experiences. It will also be a prelude to the 2019 edition. \n\n\nSociété Générale, the new institution in the French capital, announced today that it will partner with the academic and cultural center the Groupe de France (FRF) to deliver a series of exhibitions and other programming. The partnership will include a series, titled The Future of Général. The initiative will include a visit to the archives of the Groupe de France and a retrospective of the institution in 2020. The show will follow the construction of a new museum dedicated to Général, which will open in 2021. “The Groupe de France is at a pivotal moment, on the cusp of a new historical phase, which will culminate in the reopening of the institution, ” said Françoise Boudrian, the director of the Groupe de France. “Through the collaboration with the Groupe de France, the future of Général is at stake. The Géral Foundation is already committed to the future of Général, and we", "The next Biennial should focus on the effects ethnocentrism has on the memory of the Holocaust. The exhibition was organized by the museum and the State Museum of the Holocaust in Belgrade as part of the ongoing work of the State Commission for the Exploration of the Holocaust, which was established in 2015. Its first exhibition of work by a representative of the newly created Council on Contemporary Art History (CCAM) will be presented by the institution in the city of Zagreb, on March 18.The exhibition will feature new works by forty-eight artists and will showcase the work of fifty-seven artists who participated in the biennial between April and March of 2020. The monographic exhibition will include a selection of the work of the previous biennials, which took place from March 13 through March 20, 2003. The biennial will also include a retrospective of the work of Maurizio Cattelan, a collaboration with a former patron of the museum, in addition to a selection of works from the collection of Artistic Director Günther Moritz.“The works presented in the forthcoming exhibition reflect the extraordinary range of the exhibition ‘Razvedė,’” said Moritz. “In the past, the museum", "The next Biennial should be held in March 2021. Recent events include the announcement of the upcoming exhibition “Artist Perspectives: A-Life” at the Venice Biennale.\n\n\nLincoln Center, the Los Angeles Public Library, the Metropolitan Museum of Art, and the Santa Monica Museum of Art in California have agreed to jointly invest $4 billion into the restoration of two of their iconic buildings, the Lincoln Center and the Met, in an effort to alleviate financial pressures caused by the coronavirus.The nonprofit organizations announced on Thursday that the partnership will ensure that the Lincoln Center is able to handle the unprecedented number of visitors expected in 2021 and will create new opportunities for artistic collaboration. The institutions will also share information about current events and opportunities through the Metronomic Collaboration Network, a platform that will connect artists, scholars, and other cultural and public leaders.The funds will be used to restore the building’s original glass façade and facades, as well as the building’s original outdoor terraces, which were installed in 1918 to provide shade for Los Angeles’s iconic Angeleno statue of Colonel Sanders, a United States Army officer who was killed during the Japanese invasion of China in 1937. The new glass facade will", "The next Biennial should take place in 2016, with the hopes of opening to the public in 2021.\n\n\nThe Wurlitzer Museum in New York has welcomed three new artists to its curatorial team: Finnish artist Jari Snari, from Helsinki, Finland; Lars Voorhees, who has lived and worked in Venice for twenty years, and English artist John Gardner, who has recently returned from a trip to the island of Bali. Snari’s ode to the city, which is centered in the city of Jyväskylä, was selected as the theme for the museum’s next edition. The exhibition will take up themes of memory, history, and self-knowledge. The exhibition will be curated by Hanna Ros-Lehtinen, director of the Wurlitzer, and will run from April 19 to April 21, 2020.The museum has also announced its participation in the Artspalme Berlin, which is taking place in the former Jewish ghettos of Berlin. The event will showcase twenty-six works by seventy artists whose work was on display at the Württemberg Museum of Art in 2013. It will be hosted by the majority director of the Berlin Biennale, Wolfgang Ulrich", "The next Biennial should be held in the fall of 2020. In an interview with the Art Newspaper, the artist said that the exhibition was inspired by the Los Angeles riots that took place in 1992, but that the project was not meant to take place for years. The exhibition will examine the legacy of the artist in a number of mediums, including print, video, performance, and sculpture. “This is my way of saying goodbye,” the artist said. “I hope that it may be a moment of reflection for you. I hope that you find it in yourself to care for others and to care for your own.”\n\n\nNew York’s Metropolitan Museum of Art (MoMA) has appointed Alison Brie as its new deputy director and chief curator. Brie joins the museum from the Solomon R. Guggenheim Museum, where she has served as deputy director and chief curator since 2015.“Alison brings a wealth of experience and knowledge to our team, and is an excellent fit for our mission to present cutting edge exhibitions and the rich history of New York as a whole,” said museum director Daniel H. Weiss. “We are fortunate to have her on our team as a dedicated deputy director", "The next Biennial should take place in 2021, when an exhibition of the work of the artist Naguib Saeed, whose work explores the impact of queer theory in contemporary art, is scheduled to open. In a statement on Monday, the Arts Council said that the next iteration of the exhibition “will highlight the work of the artists whose work best reflects the diversity of our communities.” It also said that the 2021 edition will be “aimed more at showcasing the diversity of visual, experimental, and performance practices in the UK, and the UK at large, than ever before.” The next edition of the Palazzo di Beppo in Milan will take place in April 2022.\n\n\nThe Metropolitan Museum of Art in New York has appointed Steve Hsu as its new deputy director for collections and exhibitions. Hsu comes to the museum from the Museum of Modern Art (MoMA), where he has served as deputy director since 2012. Previously, he was the deputy director of collections and exhibitions at the Whitney Museum of American Art, where he helped turn the Whitney’s collection into a $105 million restoration project.Hsu will be responsible for directing the museum’s collections and exhibitions during an eight-year term beginning", "The next Biennial should be held in 2020.The twentieth edition of the Seattle Biennial will be held at the Seattle Art Museum from March 14 to March 20, 2021. The event will feature more than 150 works by fifty-eight artists and will feature the first-ever performances by thirty-six contemporary artists. It will be organized in cooperation with the Seattle African American Arts Museum and the Seattle Art Museum.\n\n\nThe Solomon R. Guggenheim Museum has received a gift of twenty-five works from the French-born artist Lévi-Strauss. The three-carat colorwork, depicting scenes of people in various states of consciousness, was gifted to the institution by the artist in memory of his late wife and daughter.The gift was made to the museum by the artist in recognition of Guggenheim’s honorary doctorate, which Guggenheim won in 1977; an artist tribute presented to the institution in honor of his contributions to the museum; and a series of paintings presented to the museum by the artist on behalf of the family. The works, created between 1963 and 1977, are part of an exhibition catalogued as “Avant-Garde: Avant-Garde” and were selected by the", "The next Biennial should be announced in the next couple of months,\" the exhibition organizer said in a statement. The second edition of the exhibition, organized in collaboration with the Madison Art Gallery and the Frick Collection of Modern Art, will take place in the spring of 2020. The biennial will mark the first time the artist has staged the exhibition since 1998.\n\n\nThe Guadalajara Biennial, a seven-person, Mexican-born, French-Swedish-Italian-born curatorial team, will present the twenty-fifth edition of the exhibition in Mexico City next month. The twenty-fifth edition of the exhibition, titled “Of Miracles,” will be exhibition-wise similar to the previous two iterations, with representatives from Mexico City, Veracruz, Oaxaca, and Mexico City’s Lower East Side. The theme of the show will remain the same, which was originally chosen after the artist’s father, António, a former Guadalajara prison guard who served a prison sentence for robbery, died in 2001.The twenty-fifth edition of “Of Miracles,” will be held at Íguila de la Barra, Mexico City", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Joseph Campbell as its next executive director. Campbell comes to the institution from the Museum of Contemporary Art (MoCA), where he has been the interim director since April 2019. He succeeds Stephen Deutch, who was hired by MoCA director Anna Wintour to lead the museum.“With the appointment of Joseph Campbell, we are entering a new phase of our organization’s history,” said Anna Wintour. “He comes from a distinguished and powerful family, which has been instrumental in transforming the museum into a major cultural institution. We look forward to working with him and to his vision for the museum in the years to come.” Prior to joining MoCA, Campbell served as director of the Museum of Contemporary Art (MoCA) in New York from 2007 to 2009. During his tenure, he oversaw a $65 million expansion of the museum, which is now home to more than 1,400 works, including works by Pablo Picasso and Anna Atkins; helped launch the Biennial of Women Artists; launched the Center for Contemporary Art Research at the Museum of Contemporary Art, created a new research institute", "The next Biennial should be held in 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of 2,800 photographs that were among the collection that were on display in the exhibition “After Freedom of Expression?” at the institution during its reopening last week. The images, all from the California native’s series “Beyond the Pale: Photography in the City of Angels” (1938–1941), comprise ninety portraits taken in Los Angeles between 1941 and 1942. The work was organized as part of a series that explored Los Angeles’s role as an important photographic laboratory and as a center for the production, storage, and display of works by artists such as Robert Irwin, Sidney Bechet, and Alfred Stieglitz.In honor of the gift, LACMA director Lynne Tucci and executive director Michael Nelson released the following statement: “We are thrilled to welcome the works of these extraordinary artists to LACMA. The collection includes some of the earliest works of the ‘60s and ’70s, and the museum’s collection has a significant history of representing the work of pioneering photographers such as Elia and Bruce Nauman in the first half", "The next Biennial should be in the spring of 2020 and will be held at the São Paulo Bienal, located in São Paulo state, Brazil. The third exhibition, entitled “Art in the Age of Mechanical Reproduction” will be held at the Museum of Modern Art in New York in November 2020.\n\n\nThe Australian Museum of Modern Art (AMI) in Melbourne has hired architect Daniel Ollier as its new head of design. Ollier will be responsible for creating a new aesthetic for the institution, which currently has location in the city of Melbourne, in a project that will take at least six years and will also involve the construction of a new building and an expansion of the AMI’s existing structure.“We’re delighted to see Daniel’s first major project, a fully redesigned AMI, and we’re looking forward to seeing how it unfolds,” said David Sherman, AMI’s director. Ollier will work closely with curator of modern and contemporary art Rebecca MacNeill and director of contemporary art Hayley Pinsker as they develop and execute the AMI’s new vision.“Daniel has a long history in design", "The next Biennial should take place in 2021.\n\n\nThe British Museum in New York has appointed Sarah Lemarchand as its next director. She will take the helm from Sir Christopher Le Brun, who retired on March 5 after a decade at the institution after he was chosen to lead its European branch. Lemarchand previously served as director of the National Museum of European Art in London and as an assistant curator at the British Museum. She has also held positions at the Institute of Contemporary Arts and the National Gallery in London and is the author of The House of Shadows: British Art and the Politics of Myth.“Sarah’s story is inspiring and her vision for the British Museum echoes that of Sir Christopher and enables us to return to creating engaging and engaging exhibitions and programs that reflect the breadth and depth of our collection,” said David Galloway, chair of the museum’s board of trustees. “In a world in which technology is increasingly able to reach into people’s lives and influence what they see and hear, we explore and interrogate the connections between art and technology through projects such as Project Cray (2017–18), a digital project for which the museum collaborated with artists, scholars, and artists’ studios", "The next Biennial should be held at the Museum of Contemporary Art Amsterdam (MCA). The theme of the twentieth edition of the exhibition, “The Tension of Infinite Circulation,” will be an open question posed by artist Eijiro Ogata: “How far can we push our own ideas of the world, what we call reality, and what nature itself may become?” The artist will be accompanied by a group of colleagues who are currently collaborating on an exhibition, “Ernest & Sheely: Not a New Thing,” which will open in June, and the artist’s son, Olu Olu, the director of the Museum of Contemporary Art Amsterdam (MCA), and Gonick Kasper, the director of the BIVI Center for Contemporary Arts, will be among the artists represented.The first edition of The Tension of Infinite Circulation (2015–16) was staged at the Nijmegen Museum in the Netherlands, and the next edition will be held at the Art Institute of Chicago. The title of the seventy-fourth edition, “The End of the Tour,” was first proposed by German artist Wolfgang Ischteberger in 1973. The theme of the", "The next Biennial should be held in March 2021, according to NADA. The 2020 event will be curated by and be hosted by Wolfgang Tillmans, the editorial director of the German daily Süddeutsche Zeitung; Anne-Marie Lanzmann, the chief of the Museum der Moderne Frankfurt; and Bernd and Hippolyte Trockel, the partners of the modernist fair Berlin Biennale, which is currently undergoing a €7 million renovation. Events will also be held in the former barracks of the Brandenburg Army Air Base in Berlin, where several hundred people will converge for a three-day event.The 2020 edition will be held at the Schloss Brandenburg in the capital of Germany. The newly renovated wonderland will receive an estimated €40 million in capital improvements, and will also host a number of events that were previously unannounced. The refurbished venue will also be home to a number of exhibitions, including a presentation of the work of contemporary artists such as Ulrike Lunacek, Bettina Linz, and Daniel H. Hartigan, as well as a presentation of Sylvia Merz, Kasina Mason, and Humberto Pérez\u0097all of whom were nominated for", "The next Biennial should take place in August 2020 and will showcase new works by artists from around the world.” The exhibition will also include a review of the biennial’s program, exploring how the art of contemporary art has a continuing, positive, and transformative role to play in encouraging, clarifying, and positioning questions about the nature of art and the future of art, and how biennial projects are emerging as possibilities for reflection and collaboration with artists.The full list of participating artists is as follows:Artsakh Daoud, United KingdomAnahad Lakia, IndiaBara Deen, IndiaBacchus Bartels, GermanyBartolomeo Bedoya, BrazilBechdel Smith, ArgentinaBekron Thompson, United KingdomBekuso Naidoo, BrazilBianca Barrios, BrazilBianca Bilbao, SpainBianca Branco, ArgentinaBianka Di Girolamo, BrazilBianca Cruz, ArgentinaBianca de la Garza, BrazilBianca Moll, BrazilBianca Pascual, ArgentinaBianca Peña, ArgentinaBianca Pérez, BrazilBianca Rivera, BrazilBianca Torres, Colombia", "The next Biennial should focus on the performance and invention of an indigenous artist and the cumulative impact of a series of projects that was inaugurated in 2017, ‘150 Years of Experience.”The next Biennial should focus on the performance and invention of an indigenous artist and the cumulative impact of a series of projects that was inaugurated in 2017, “150 Years of Experience.”\n\n\nThe British Museum in London and the National Galleries of Scotland announced today that they have received a gift of twenty-one royal blueprints from the British monarch. The items, which were given to the institution by Her Majesty Queen Elizabeth II in the Mayflower–Alton Abbey of Massachusetts, in the early days of the United Kingdom, were first displayed in the institution’s “A Future to Expire” exhibition, which opened on October 7. The planisphere, a digital recreation of the United Kingdom, was created by the artist W.M. Blyth, who was commissioned to create a new workspace for the museum’s extensive collection of royal blueprints, which comprises more than seven thousand objects, in order to celebrate the 150th anniversary of the institution. The institution also revealed that it now has the means to create", "The next Biennial should be held in December 2019. \nPanorama: Mood and the Future, 2019. Photo: Larry Achiampong. March 14. *ArtPlace Berlin, 2019. ArtPlace Berlin is the official venue of the Art Basel Biennale. Dec. 23–Jan. 6, 2019, ArtPlace Berlin. January 12–March 19, 2019, ArtPlace Berlin. January 11–March 19, 2019, ArtPlace Berlin. February 3–March 1, 2019, ArtPlace Berlin. February 8–March 10, 2019, ArtPlace Berlin. March 7–March 11, 2019, ArtPlace Berlin. March 7–March 10, 2019, ArtPlace Berlin. March 10–March 13, 2019, ArtPlace Berlin. March 14–March 13, 2019, ArtPlace Berlin. March 15–March 16, 2019, ArtPlace Berlin. March 19–March 21, 2019, ArtPlace Berlin. April 3–April 5, 2019, ArtPlace Berlin. April 8–April 11, 2019, ArtPlace Berlin. April 9–April 12, 2019, ArtPlace Berlin. April 13–April 15, 2019", "The next Biennial should take place in 2021, when the museum will celebrate its fiftieth anniversary. The museum plans to open its new 4,800-seat building, designed by Fokkens, in spring 2020, with the inaugural exhibition “Dia Artica.” The new exhibition will aim to “impress upon visitors the possibilities of the gallery in a contemporary art museum,” Diya-Advisory said. The conglomerate also owns the company that owns the Milanese architecture studio Gio Ponti. Its interests in the city include the region of Sesto-Venezia Giulia, in the Tuscan province of Liguria, and the city of Turin.\n\n\nPAFA Art Foundation in New York has launched an initiative to help US-based artists and small to mid-size galleries in New York who are facing foreclosure.The project, which will include loan forgiveness, membership renewal, and a special exhibition, “Time to Rebuild,” will run from March 7 to March 21, 2020. “We are grateful to the artists and art workers who have made this possible through our generous grant program,” said Maud Laverrière, president", "The next Biennial should be held in 2022.\n\n\nMuseum-Asia Pacific (MASP), Tokyo, is finalizing a new partnership with the private collection of the late Japanese artist Akio Takeno. A former director of the Tokyo Art Museum (TANM), which was closed in March 2019 due to the Covid-19 pandemic, TANM director Koki Tanaka was appointed as the museum’s new director. Tanaka has served as a consultant for the institution since 2014, when he was an associate director of the National Museum of Modern Art, Tokyo; he was also president of the TANM board of trustees.“In this new chapter, the museum will implement new technologies and programs to enhance the exhibition and education of contemporary art and our collection in collaboration with the artist’s and collectors who have supported MASP through their generosity and dedication over the years,” said Koichiro Yamauchi, the museum’s president. “The new partnership will not only allow us to further the vision and the mission of the museum, but will also develop a dedicated and talented staff to further enhance the museum’s collection and exhibition program.”As part of the partnership, the two institutions will collaborate", "The next Biennial should be held in November 2022. The exhibition will comprise of biennial presentations by artists such as Peter Alberts, Peter Andre, Pablo Picasso, Robert Mapplethorpe, and Daniel Otero.\n\n\nAn action figure made by the Chinese sculptor Tao was stolen from a charity auction in Beijing on Wednesday, October 24. The thief, a man in his thirties, strategied to gain entry to the auction by standing in front of the auction house and taking photographs with the auctioneers' tools, a report in the Chinese media outlet Artnet reports.The man made his way to the auction house by climbing a metal ladder attached to a crane that was used to stage a Chinese art fair earlier that day. The auctioneers were not able to recapture him and were not able to determine the purpose of the ladder. The man then climbed to a second crane and was able to reach the third crane, which was parked in a nearby garage, to attach the figure to the auction house.The auction house has since been closed and the construction of the fair is on hold.According to the Art Newspaper, the auction house is planning to reopen later this month, but not until the", "The next Biennial should be a game-changer for Scottish arts and culture. In this political climate, the time has come to form an effective and diverse government. It is my strong belief that the best way forward for the biennial is to have a democratically elected and empowered parliament representing everyone in Scotland.”The idea behind the Biennial is to encourage a greater appreciation of the arts and to introduce greater international exchange between Scotland and the rest of the UK. The next edition will take place in September 2020.\n\n\nThe National Museum of Scotland has launched an initiative to create more than 1,500 jobs at its Edinburgh branch, which has been closed since March due to the Covid-19 pandemic. The Destination Edinburgh Campaign, launched by the museum this week, aims to bring more than 2,000 jobs to the institution, which is currently closed because of the Covid-19 crisis.Organized by the group Mumbrella for The Art Newspaper, the 'Discovery of Art' campaign is based around the theme “Art in Life and Fate: A Return to Nature,” which has been repeated in every year since 2005. In 2019, the theme was revisited with a new focus on the exhibition of art in the context of", "The next Biennial should have a theme of social justice and the human rights of all. It should be a reflection of the history of humanity in the art world, and its relevance today.”\n\n\nThe Lake District Art Museum in London has received a $1.5 million donation from the private collection of American artist Betty Parsons. The donation marks a major milestone in the museum’s history as it opened in 2000. The gift also marks the first time Parsons’s work has been donated to the institution. The story of the gift began in 2011, when the former director of the Museum of Modern Art, designed by architect Frank Gehry, presented the work “Betty Parsons: The Work Is Here Today” at an event organized by the museum. The show, which traveled to the Museum of Contemporary Art (MoCA), New York, and the Metropolitan Museum of Art in the United States, was curated by Gisele Bütsehti.The gift was made by Allison Bowrey, head of the museum’s public collections department and a former executive director of the Board of Trustees, at a special event at the museum on Tuesday, November 22. The event marked a major milestone for the institution,", "The next Biennial should be held in the summer of 2022, its organisers said. The year-round exhibition will be hosted by the museum in conjunction with the Institute of Contemporary Arts, Paris; the Museum of Modern Art; and the Museum of Contemporary Art, New York.The next edition of the Biennale will take place at the Palais de Tokyo, Paris, from September 21 to September 26, 2021.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) has accepted $10 million from the Kasmin Foundation, the charitable organization founded by American fashion designer and philanthropist Christopher Wool, to establish a new endowment to support the development of art in the city. The gift comes on the heels of MoMA’s announcement that it is planning to raise $10 million for the museum next year. “Today is a historic day for the Metropolitan Museum of Art,” said Christopher Wool. “The gift of $10 million is an incredible testament to Christopher’s vision and dedication, and the museum’s ability to serve and protect the Met’s collections and collection items. MoMA’s collection is among the most important and historically significant in the United States", "The next Biennial should be the twenty-second, in 2022. In addition, the institution will open a new research center dedicated to the history and theory of the art, which will be located on the first floor of the Museum of Modern Art. The venue will also extend the museum’s curatorial expertise, which has been disrupted by the pandemic. The museum will also have a new official collection catalogue, a new online catalogue, and an exhibition program.The museum will formally unveil its new collection at its new headquarters, the Diller Scofidio + Renfro–designed Grand Salon, on January 22. The exhibition “The Democratic Years: Biennial of Modern Art,” curated by Michelle Mitchell, will open in the fall of 2021. The museum will also continue to host programming in its three other locations, including the new exhibition space, the Diller Scofidio + Renfro, in a show of support for the New York–based artist-run space the Factory. The Museum of Modern Art is also expanding its large-scale installation program and creating new opportunities for the arts education and research of young professionals, whose creative processes are increasingly being studied by larger institutions.\n\n\nTacita Dean,", "The next Biennial should focus on the history of the social sciences, and the future of the humanities. The theme for the second Biennial should be “A Future for Art.” The revival of the humanities and social sciences coincides with a dramatic cultural shift in India, which is rapidly becoming one of the world’s leading research-oriented nations. While the country has witnessed a period of unparalleled growth in the last four decades, it still lags behind most other developed nations in terms of the number of arts and cultural enterprises, and also in terms of the number of arts workers.Since the last biennial, “The Empty Space of Art and Nature,” curated by the Indian artist and curator K.V. Mahadevan, was held in 2011, India has experienced a rapid urbanization and has seen an explosion of new media and performance spaces. However, the country still lags behind most Asian nations in terms of the number of arts workers. According to the Art Newspaper, India has 141.5 workers in the arts and entertainment field, but only 26 in the arts and culture sector, and only 21 in the arts and design sector.The next edition of the 'Art and Culture Series' will be held at the Kondap", "The next Biennial should take place in 2022. The Shanghai Art Historia (SArt) has released the schedule for the first part of the plan, which will involve short-listed artists, and will hold the second part, which will involve artists from the Shanghai Academy of Art. The issue of residency has also come under intense debate, with some critics arguing that the exhibition is a kind of “epicenter for cultural exchange and creativity.” While many cities, including New York, are preparing for the event, Shanghai is not. According to Artnews, the city is planning to hold the event in 2021. The exhibition will be hosted at the People’s Theatre in Beijing, the Peking Opera House in Beijing, and the Shanghai Opera House. According to Artnews, the exhibition will feature the works of thirty-seven artists and will feature a selection of new and traditional works, such as new paintings by Maha Palani, published by the Chinese artist Zhang Yaxuan and sponsored by the Chinese art museum, the Art and Design Museum, and the National Museum of China, Beijing. The works will be organized as part of the chapter “The Past and Present,” which will have", "The next Biennial should focus on the ongoing political struggle between the Palestinian people and Israel, and should consist of a combination of art, activism, and research in order to produce a scholarly synthesis that will incorporate both Palestinian and Israeli history and art.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is launching a new initiative called the “Museum for Palestinian Studies.” The program will offer Palestinian artworks and materials from the Occupied Territories as well as a selection of works from the Israeli cultural landscape in a program that will run parallel to the biennial’s, in essence bridging the gap between the two events.“We wanted to create a program that would offer both the opportunity and the challenge to engage with and reflect on the current state of Palestine through the art from the Occupied Territories,” said Abbas Abu ElMean, director of the MoCA. “This is a time of conflict and challenges, and we hope that by bringing together Palestinian art and history and Israeli culture, we will be able to create a new kind of museum.”The inaugural exhibition will feature more than three hundred Palestinian artworks from the Occupied Territories, including artworks from the West Bank and Gaza", "The next Biennial should be in 2021, with the goal of presenting an exhibition of work in the first edition. Museums will also continue to offer programming in the months ahead. The 2019 exhibition “Lazaretto: The End of an Era” was staged at the Museo de Arte Contemporánico in the city of Tothipinnik; the exhibition was a collaboration between Florentino Cattelan, Leonardo Antonioni, John Casablancas, Gio Ponti, and Adrian Laborde. The exhibition was organized by Fondazione Cattelan, with the assistance of Pierluigi Cattelan, who won the Fondazione Cattelan Prize in 2015. The exhibition was curated by Francesca Cattelan and Carlo Cipolletta and was presented by the Museo di Arte Contemporanea. “Lazaretto” was co-organized by Florentino Cattelan, Leonardo Antonioni, John Casablancas, Gio Ponti, and Adrian Laborde; the exhibition was a collaboration between artists Ettore Dailly, Alessandro Focardi, and", "The next Biennial should be held in 2021. At the time of the announcement, the organizers of the biennial were composing a new vision for the future of the festival. Its writing partner, the London-based curator Paula Meehan, had previously suggested that the new edition would be a “framing of contemporary music, the art of music, and the arts” and would focus on “the practice of art.” The Biennial will take place in Rockefeller Center in New York City, from May 25 to May 28, 2021.\n\n\nMore than 50 artists and activists have signed an open letter resigning from the Paris-based International Committee for the Arts (ICA) after it announced that it will no longer recognize the institution, citing its complicity in the 2017 French revolution, which saw thousands of protesters killed by the conservative government.The letter, addressed to the eighty-three-year-old French president and assembly president Emmanuel Macron, reads: “We reject the decision taken by the president of the republic of France, Marine le Pen, and his government’s decision to remove the ICA from its official role; we reject their promotion of a far-right, xenophobic, racist, Islam", "The next Biennial should take place in the fall of 2020 but no date has yet been set. The website has also said that the exhibition will be “decisive, challenging, and innovative.”\n\n\nThe city of Cologne has released a new set of rules for the upcoming Art Basel show and trade fair in Germany, Artforum reports. The regulations, which were drafted by the German state of North Rhine-Westphalia (BSA), will likely have a major impact on how the fair will proceed. “The show is currently scheduled to open on September 25 in Berlin and will run until November 11 in Cologne,” BSA head Klaus Biesenbach told the Art Newspaper. “The show is scheduled to be held in the autumn of 2020, with the exhibition starting in September 2021. ” The rules state that exhibitors must secure German government approval for their proposal and that they must demonstrate a minimum of ten thousand square feet of exhibition space. They also stipulate that the exhibition must feature works by both established and emerging artists and must be organized by a known and trusted partner of the BSA, not an unknown artist. Biesenbach said that the show will follow strict", "The next Biennial should be held in 2022, and the last in 2023. \n\nThe National Arts Museum (NAV) in Washington, DC, will no longer receive funding from the federal government, moving the institution into a new, state-run entity called the Smithsonian’s National Museum of African Art (NMNA). As part of the decision, Nadia director Emily Mason-Levin will resign and become a senior director at the Smithsonian. Mason-Levin will assume the role of acting director until a successor is appointed.“The National Museum of African Art is grateful to the millions of people who have participated in the building of its Museum of African Art and the Museum of America, to the thousands of artists who have made their home at the Museum of the American African, and to the staff and supporters of the museum that have made the institution special,” Nadia president and CEO Michael J. McGlone said in a statement. “We are, of course, enormously proud of the contributions made by our staff and are committed to carrying out the institution’s mission.”In a letter sent to the public on Wednesday, June 3, Mason-Levin wrote: “", "The next Biennial should be held in 2020, with a new edition to be staged in 2021.\n\n\nArt Barcelona, Barcelona, and the rest of Spain’s national art museums are reopening after they were shut down by the country’s national health emergency on May 1. The institutions had only recently reopened when the pandemic began in earnest, but the museums were only able to open their doors for a limited amount of time before they were forced to cancel their spring and fall equinities and create “partnerships” with local and international artists and institutions. The first partnership was with the Santiago Bernabéu Museum of Art, which operates a space in the city known as the Bernabéu Art Museum (BAM), which features works by the artist Genna Jonsson, a Spanish national who was imprisoned for over two years for organizing protests against a public construction project. The institution partnered with the city of Barcelona to create an exhibition specifically oriented toward the museum.The partnership with the city’s cultural center began in November 2015, when the city granted Barcelona’s city council a $3.5 million grant. The money allowed the city to renovate the city’s old municipal buildings", "The next Biennial should be completed in 2021.<|endoftext|>A few days ago, a man in his fifties came to the door of the Museum of Contemporary Art (MCA) in New York City to ask for directions to the museum. He was wearing a black tuxedo, a silver button down, and a white silk scarf around his neck. After a brief exchange of greetings and a nod of approval, the visitor was led through the museum, whereupon the sixty-five-year-old arts curator, who was visiting the museum for the first time, told the New York Times that the institution was closed. When the visitor asked why it was “shut down,” the curators replied: “We don’t want to share any details about the museum\u0097it’s a very private museum.”While the museum confirmed that the furlough was caused by Covid-19, the seventy-year-old curator who came to the institution to see the work of his husband, variously called the closure a “restructuring of the museum’s collection,” a “restructuring of the institution’s collection,” and a “stabilization", "The next Biennial should take place in the city of Ho Chi Minh City, Vietnam, from October 7 to October 9, 2020. “We are very excited to have this opportunity to present the final work of our great artists, and to have this opportunity to present the largest exhibition of their work in the country,” said Silvio Bickel, director of the Biennial. While the theme of the exhibition is “The Future Is Not What It Used To Be,” the exhibition will also explore the themes of history and the present and the legacy of Martin Luther King, Jr., as well as the legacy of artist Salvador Dalí\u0097a key figure in the modernist-inflected works of the late Brazilian José Carlos Pizarro.The inaugural exhibition, “The Future Is Not What It Used To Be,” was curated by Charles M. Simons, who also curated the exhibition “Adagio and the Image,” which opened at the Biennial in 2003 and runs through February 28. The new work, an assemblage work comprised of three paintings\u0097focusing on the performance of Cécile Banes in Paris in the late 1950s and early 1960", "The next Biennial should take place in the year 2025. The project will also include a research conference, a special exhibition, and a public program. The Biennial will be hosted at the Museo de Arte Contemporáneo (MAS) in Madrid, as well as at the Museo de Bellas Artes (MAS), Brasilia, and at the Museo de la Repúbio, Madrid. The exhibition will include works by artists from twenty-seven countries and will be hosted by director Lorenzo Cavalcanti. The theme of the biennial is “The Future of Life on Earth.” “The Future of Life on Earth is a story of survival, of the human organism and its environment on a dangerous and hostile planet, of resistance, of generosity and compassion,” said Cavalcanti. “The biennial is not an exhibition. It is a reflection of the contemporary dimensions of the artist’s life on earth.” Cavalcanti will back the project in creating a unique space for the biennial in the city of Barcelona, which is currently undergoing a major renovation project. The plans for the building and for the exhibition have yet to be decided", "The next Biennial should take place at a location other than the Biennial—for example, a museum or a museum-like setting.“The impact of the exhibition is so significant and the project takes so long that we have to weigh the potential outcomes of a project that has already been completed, and where we do not have to start again,” said Luisa Cicutto, the director of the Museo del Biennial. “I would like to see a living, active product of the exhibition, with the exhibition with the exhibition. This way, we can focus on the work of the artist and not worry about the exhibition.”\n\n\n\n\n\nAlexandra Bechia, a Mexican artist who came to New York from Mexico City in 2009, has won the $25,000 Artist Award. The $10,000 prize was awarded by the Los Angeles-based nonprofit Artadia. The inaugural prize jury—including Peter Wollen, the founder of the Los Angeles–based nonprofit On the Road and creator of the Art Institute of Chicago—considered Bechia’s installations, drawings, and works on paper from 2005 to 2009.“I’m really honored to receive this award. I�", "The next Biennial should be held in 2020.\n\n\nThe Catalan government has appointed three new members to the National Council of Culture, a body of forty-one elected by the Catalan government. They are: Juan Manuel Barrio, a professor of architecture at Barcelona Polytechnic University; Juan Pedro Sánchez-Santiago, a professor of history at the University of Santander; and Cristina de Rosas, a professor of philosophy at the Institute of Philosophy and Technology in Barcelona.“The National Council of Culture is a political institution that plays an important role in the formulation of cultural policy, in the safeguarding of cultural heritage, in the promotion of the acquisition of knowledge, the promotion of the exchange of cultural views, and the communication of cultural ideas,” Martin Pérez de Santillan, the minister of culture, told the Art Newspaper.The National Assembly of Culture approved the appointments on Monday, December 3. It was only a formality, however, as the appointment was not made official, but the three were elected because the National Assembly does not have the power to dissolve the Catalan government. Given the current political crisis, a majority of lawmakers in the assembly voted to dissolve the council on December 16.The three", "The next Biennial should be in 2020 and will be held at the Museum of Fine Arts, Boston.\n\n\nGerman Chancellor Merkel has ordered the reopening of Berlin’s Brandenburg Gate, which has been closed since March 23 due to the Covid-19 pandemic, in an attempt to ease traffic congestion. The gates were supposed to reopen this week but were postponed due to concerns over a possible second wave of the pandemic. On Wednesday, the gates opened to the public for the first time since March 16. Merkel told a joint news conference with British Prime Minister Theresa May that the gates should be reopened by the end of the month. “I want to quickly open the gates,” Merkel said. “This is a matter of life and death for us all. We have to do everything we can to stay healthy and well.”Since March 16, the gates have also been used by millions of tourists to enter the German capital. According to the New York Times, more than 75 million people visited the gates in March, a record for any March event. Merkel said that she expects the crowds will rebound in the weeks ahead as people return to work, schools reopen, and people are allowed to return to their residences.\n\n\n", "The next Biennial should be held in 2021. Max Keiser, director of the Max Keiser Foundation for the Arts, said: “We are privileged to be contributing to an extraordinary and vibrant field at the Max Keiser Foundation. The following year will be a challenging but transformative year for the arts, and for the city of Pittsburgh. The biennial will offer a fresh perspective and a new approach to exhibition-making in Pittsburgh.”\n\n\nThe Kinz/Knox Art Museum in Pittsburgh and the Foster Museum of Art in New York are working to merge, beginning this fall. The move follows the two institutions’ decision to close their separate locations to the public in September 2020. The ambitious merger, announced in May, would bring together a number of historically significant art museums, including the Knollys, the Wright-Patterson, and the University of Pittsburgh.The nonprofit organization, called Kinz, announced the announcement of their merger in May. The institution has been negotiating with the partners for several months, and the merger is expected to be completed by autumn. The announcement coincided with the reopening of the Knollys, which reopened on Friday, June 18. The announcement of the merger was made by Knollys director Annemarie", "The next Biennial should be announced in 2020.\n\n\nThe British artist who employed geometries and geometric materials to create sculptures that appear to be made of a single substance while simultaneously exhibiting multilayered, intricately detailed works that have been identified as works of art by the Museum of Modern Art (MoMA) or the Metropolitan Museum of Art in New York.In a series of paintings titled The City and the Walls (2017), the artist demonstrated how even small geometric details—such as the edges of walls and ceilings—can appear to surround or envelop the central figure. Other works, such as the geometric forms of the urn and the coffer, and the oversized sculptures of planets, have been described as “formal and precise” and “esthetically arresting.”In an interview with Artforum in 2018, de Bono stated: “I just like to use materials to ask questions. I'm not interested in inventing a new work. I hope people will think this through for themselves.”The Museum of Contemporary Art (MoCA), Boston, announced today that Jakob de Gruijlmans, a Dutch artist best known for his work Two Cities, Two Worlds, 1971–77, has won the Nobel", "The next Biennial should focus on a project of the same sort, namely, the re-creation of a new life through the art of the past, the past in a way that celebrates the centrality of the physical body in daily life.”\n\n\nThe Fine Arts Museum Houston (FAM) has released the first of its planned three-year, $12 million redevelopment of its historic building in the city’s downtown, which opened in 1906 as the headquarters of the Houston-based oil company Texaco. The iconic building has undergone a $50 million facelift in the past two years, and now boasts a brand-new glass-enclosed courtyard that will feature a 300-foot-long, twenty-one-foot-tall, sixty-one-foot-wide glass-enclosed ballroom, an expanded auditorium, and a larger public courtyard.FAM’s vision for the redevelopment is to present a “new world” in the courtyard, a theater, and an education center. The project will also include the installation of new works by award-winning artist and scholar Bernardine Duguid, who most recently served as director of the Center for Cultural Research at Princeton University, and will inaugurate a new,", "The next Biennial should take place in 2020. The 2019, and the 2018 editions and the 2019 edition of Haus der Kunst will both be held in Frankfurt, the year of the Bolshevik revolution.  In an attempt to create an immersive experience for visitors, the curators will include work by various artists, including Tadeusz Krawczyk, Tobi Baranek, Emily Hall, and Amada Cruz, along with works by artists that took place at various historical periods in the past including Richard Diebenkorn, Hildegarde Duane, David Hockney, and Paula Deen.In a letter to the participants of the biennial, Fritz Schäfer, the chairman of the exhibition, said: “While we are aware of the challenges of staging a exhibition at a time when history is being re-born and re-explored in the context of the Kronstadt tragedy, we believe that the next edition of Biennale Frankfurt, which will be held at a new location, is the ideal time to take this work forward in the interest of the whole city and region. We hope that other cities and regions will also welcome the exhibition. . . . We are convinced that the next edition of", "The next Biennial should be staged at the Stedelijk Museum in Amsterdam, and the first exhibition should open in 2020. Disclosure: Icahn was awarded the Prix‐Foyer at the 2009 Venice Biennale. He previously served as director of the National Zoo in Washington, DC, and as chief curator at the National Gallery of Art in Washington, DC.   Wang is currently the director of the Museum of Contemporary Art Shanghai, the Pudong Art Museum, and the Chengdu Art Museum. \n\n\nArt historian Kathleen L. Smith, who championed cultural experimentation and championed artists of color in the United States, has died at age eighty-two at her home in New York.Born Kathleen Cooper Smith in 1934, the daughter of a pair of auto parts suppliers, Smith grew up in a middle-class white suburb of Chicago and continued her art-and-crafts studies at the University of Wisconsin, Madison. In the 1940s, she moved to New York, married a black man, and founded the hard-edge company that would eventually become Acme Aluminum. In 1967, she married Henry Shainman; the couple had three children, George, John, and Kathleen, but divorced in 1978 after nine", "The next Biennial should focus particularly on the history of modern art from the nineteenth century to the present and what it means to be a contemporary member of this historic body, ‘’ said Jakob Neugroschel, the director of the museum.   \n\n\nThe National Gallery of Art in Washington, DC, has established a new $3.2 million endowment to assist artists whose livelihoods have been adversely affected by the coronavirus. The fund, which was established by a gift from former president and CEO of the museum Ernest R. Bies, marks the first time the institution has ever used the proceeds from the coronavirus to assist artists. The National Endowment for the Arts (NEA) is also providing grants of up to $500 to help artists who were impacted by the virus. The campaign will award $252,000 to individual artists and $156,000 to small to midsize local arts organizations.The NEA is encouraging local, regional, and national arts organizations to use the funds to help pay for expenses related to the coronavirus and to help artists recover from financial losses related to the virus. Individuals and arts organizations may apply for up to $2,000 for assistance with expenses. For individuals", "The next Biennial should be held in 2021.\n\n\nThe New York Times has released the full list of the seventy-six artists who will be featured in its upcoming edition. Titled “Art in the Age of Trump,” the exhibition will take up themes such as self-immolation, the crisis of democracy, and the political domination of money and power.The artists selected for the event are as follows:Alice Ahern, New York; Ed Clark, New York; Francis Callan, New York; Arsht Hahn, New York; Kiki Smith, New York; Alexander Lowenthal, New York; Kiki Smith, New York; Martin Selig, New York; Joachim Vermeer, New York; Jonathan Wasserman, New York; Joseph and Louise Wart, New York; Tomás Van de Wijngaard, New York; and Janet Yellen, New York.“We are honored to present the seventy-six artists who are featured in the thirteenth edition of the Biennial,” said Robert De Niro. “This is a historic year for Art, and we are pleased to see so many of our favorite artists returning to The Bronx and to", "The next Biennial should take place in 2022. The next iteration, which will be hosted in the city of Lyon, France, will be held in 2023. The next iteration, which will be staged in St. Petersburg, Russia, will be scheduled for 2024.The next edition, which will be held in the city of Sydney, Australia, will be held in the city of Melbourne, Australia, in the United States. The next edition, which will be hosted in New York, New York, will be staged in 2021. The next edition of the Biennial will be held in the city of New Delhi, India, in 2021.  The next edition of the EVP, which was organized by the French company BAM, will be held in the French city of Nice, France, from April 5 to April 6. The next edition of the ZMA, which was organized by the Belo Horizon, will be held in the city of Minsk, Belarus, from April 6 to April 9.  It will also be held at the Prudential Building, the Museum of Modern Art, the Museum of Contemporary Art Paris, the Film Institute, and the London Art Gallery, and will be set in the city", "The next Biennial should be held in 2020, and the first in 2021. The announcement was made at the end of a two-city tour—the first part of which was held in September—that took place between Milan and Genoa. Full details about the 2020 exhibition will be announced later this year.\n\n\nThe Salzburg Biennial of Modern Art, Switzerland, has announced that the eighty-third edition of the event will take place at the Salzburg Festival Hall on October 21–23. This will be the last edition since the Salzburg Art Club (SAFC) closed its doors in April 2019. The biennial, which was organized by the Zurich-based design group Meyer Larsen, is now closed indefinitely.“The theme of the twenty-fifth edition, which will include new works by Süder Berg and Tadeusz Klemens, is now an everlasting one,” said presenter Joachim Breitenbach, who also worked on the acquisition of the works and the exhibition’s acquisition by the Swiss government. “Together with the members of the Salzburg Art Club it was a pleasure to present this work, its collection, and its collection of works. And I hope that", "The next Biennial should be on September 7. The theme of this year’s will be “Place and Historiography,” an idea that was picked up by the famous speaker Laurence Boudin, who has spearheaded the movement towards institutional and institutional memory and memorials for the victims of the terrorist attacks of September 11, 2001. The theme will be a combination of the words “place of history,” “historia,” and “historía.”The biennial is making the transition from satellite to new institution. Originally, the exhibition was held in the building where the museum was housed until last spring, when it moved to the upcoming building, the Museo de Arte Contemporáneo de Porto, in the exclusive neighborhood of Porto ai, where the museum is located. The museum is currently undergoing a $45 million facelift, and its exhibition space is being expanded.\n\n\nThe National Museum of Finnish Art (NMA) in Helsinki has announced the opening of a book of the artist’s works in its collection. The NMA’s Artist’s Place: Maari Richter’s Works on Paper and", "The next Biennial should be held in 2019. The biennial will focus on the development of art from the perspective of the contemporary, and will introduce a new interactive exhibition.\n\n\nThe National Gallery in London has made historic additions to its collection in support of the fight against the Covid-19 virus. The institution also unveiled a new permanent collection of nineteenth-century art and its collection’s first ever exhibition of work by a curator from the United States. The exhibition, “The Merchant of Venice: A National Collection,” was organized as part of the institution’s inaugural National Open House, which was held at the gallery on May 5, 2018. The exhibition debuted new works by artists such as George Cohen and Paul Gauguin, as well as works by contemporary artists such as Paul Strand and John Akomfrah.Other notable exhibitions include “On Architecture” (2019), “The European Experience: The National Gallery’s Art of the Twentieth Century” (2019), and “John Bock’s Inventing Librarians: ‘The Toolbox,’” a collaborative exhibition that featured John Barlow, Hildegarde Duane, and I", "The next Biennial should be held in the summer of 2021. In the meantime, the museum is working with a consortium of national and regional organizations including the National Endowment for the Arts, the National Endowment for the Humanities, the Smithsonian Institution, and the Carnegie Foundation to create the American Folk Art Museum, which will be located in the same building as the museum. The renovation of the museum is expected to cost $8 million. Advertisement\n\n\nThe Minnesota Orchestra in collaboration with the Minneapolis Museum of Fine Arts (MFA) has announced that it is in the process of revamping its current exhibition program. The first phase of the revitalization, titled “The Present,” will open in March 2020, with “The Future,” in July 2020, and “The Past,” in December 2021. The second phase, titled “Future Present,” will follow in March 2022, and “Past Present,” in March 2023.“This work began with a long-term commitment by the MFA’s board of directors, board of curators, and curators to build a stronger understanding of how art history and the history of the museum would shape our ongoing experience of", "The next Biennial should take place in the spring of 2021. For the first time, the Biennial will be hosted by the city of Los Angeles and will be open to the public. The 2020 artist-in-residence is Thomas Jane, who will present her first solo exhibition at the Museum of Modern Art in 2020.The exhibition will examine Jane’s work in the context of the Los Angeles–born and raised artist-in-residence, the sculptor Gabriel Orozco, and will explore the use of the artist’s body in the exhibition. The first show in the series will open on September 19 and will run until October 29.\n\n\nThe König-Bickel Collection, the Zurich-based nonprofit arts organization, has launched an ambitious expansion program. To achieve its ambitious goal of bringing more than one thousand works to New York, the institution will open a new, expanded position that will focus on international exchange and collaboration in the fall of 2020.Dubbed the König-Bickel Center for International Exchange, the center will host at least six shows each year, with a tentative launch of the year’s festival of the arts. The center will welcome more than one thousand visitors and will house the", "The next Biennial should be announced within the next two weeks, with an opening reception on May 29. The seventy-five-year-old institution will reopen in the autumn of 2021. \n\n\nThe Museum of Salt Lake City (MOLAC) has announced that it is planning to begin welcoming visitors again in the fall, after a temporary closure due to the Covid-19 pandemic. MOLAC will also begin welcoming the public in an attempt to mitigate the health impacts of the coronavirus.“The museum is planning to re-open in the fall of 2021, with a new layout and with enhanced programs, with the objective of ensuring a positive public health and safety situation for everyone,” museum director Mark A. Salter said in a statement. “We must not forget our neighbors, and our responsibility as stewards of our environment and our natural heritage.”Salter said that the museum would also be expanding its hours and improving accessibility as part of the reopening plan. The institution will begin welcoming visitors on Monday, March 13, 2021 and close March 14, 2021 to March 17, 2021. The reopening date will be announced in September. The museum, which was forced to move the opening of its “", "The next Biennial should begin with the theme of the year, “Structures of Resistance: The Struggle for Racial Equality,” said Riki Lindert, director of the Biennale Foundation. “As the history of the twentieth century has unfolded, it has become clearer and clearer that the contemporary world is faced with many challenges, not least of which are racial inequality and the climate crisis. It is therefore with great regret that we announce that the twenty-fifth edition of the Biennale will be held in Milan in February 2021. The new venue will be designed by Milan-based architects Małgorzata Gutt and Lajos Šwiņek, and will take up the theme of the year, “Structures of Resistance.”The exhibition will be hosted by the Milan-based north-eastern arts space, the cultural district, the city of Milan, and the city of Milan. A full list of participants is as follows:Małgorzata Gutt and Lajos Šwiņek (L)Andrea Bertelli (S)Marcelo Maiola (M)Ciaran McShine (M)Bertrand Berthold & Joachim", "The next Biennial should start as soon as possible, with a new opening date, and will consist of a retrospective of the work of forty artists.The Biennial will also include a new exhibition, “A series of photos,” which is curated by Maria-Kate and Laurent-Henri, and will be organized by Kate McKinnon, the artistic director of the Goldsmiths, and Akiko Sasaki, the artistic directors of the Korea Biennale. The exhibition will focus on photography’s relationship with art, and will be held at the Goldsmiths from April 16 to April 22.\n\n\nThe Tate has launched a new digital platform, “Tate Digital,” that will allow visitors to remotely view the exhibitions it has put on hold since March 25 because of the Covid-19 pandemic. The platform will also present a portal to the Tate’s online content, which was temporarily shuttered on March 23.Dubbed the “future of exhibitions” platform, the new platform will allow visitors to explore the rest of the Tate’s holdings on the new website, which will be unveiled on April 3. The platform will also include a range of user-made content, including videos", "The next Biennial should focus on “the design of present-day life,” Kwasio told the Art Newspaper in an interview last year, “and the theme of the exhibition should be ‘living together.’”The exhibition will be held at the Renaissance Forum in Reggio Emilia from September 20 to September 22, 2020.The Venice Architecture Biennial will also be held at the Forum, which has hosted the event since its inception in 1966, in 2020. The event will consist of six shows, beginning with “The Rotation of the Earth” (February 29 to March 4). Following “The Moon,” which will feature works by twenty-six artists from April 5 to April 6, 2020, the event will conclude with “The Passions,” a show of contemporary art by ten artists, in which thirty-seven works were presented. Lindenberger will preside over the event, which will be hosted by the architecture museum from April 25 to May 1, 2020.\n\n\nThe National Gallery in London has appointed Hadeel Ibrahim as its new director. Ibrahim is currently the head of the National Art Gallery in Tehran, where she has been responsible for leading the National Gallery since", "The next Biennial should be held in the city of Hamburg in 2021. The next edition will be a joint project of the German and Austrian governments. The organizers said that no decisions had yet been made but that they would continue to work together to develop the theme and the exhibition schedule. The decision to cancel the twenty-fifth edition of the biennial was made after representatives from both countries met through a minority report published by the Art Newspaper on January 31. The document, which was signed by a total of sixty artists and collectors, says that the cancellation of the 2019 edition is not acceptable and that the pavilion should be moved. The report states that the cancellation of the exhibition could lead to “serious consequences.”It goes on to say that the decision to cancel the show is “not possible,” and that the Austrian minister of culture, Christian Kern, made an “unequalled statement.” The report also criticizes Austrian arts minister Monika Grütters for failing to respond to the parliament’s request for more than three weeks, and for failing to inform the public about the cancellation of the exhibition. The Volkskrant reports that the", "The next Biennial should open in 2021. According to the New York Times, the organizers declared that the themes for the next edition of the biennial will be “transhumanism, logic, and reason” and “Eco-Psychology.” The exhibition will also feature presentations of new works by artists such as Antony Gormley and Carolyn Aitken. “We are thrilled to be able to give back to the biennial artists who have exerted an important and lasting influence on our cultural landscape through their shows and programs over the past three decades,” said Paula Scher, the current director of the biennial and the first woman to be an awardee of the prize. “The work of the artists we have selected over the past thirty years is a powerful testimony to the transformative influence that logic, reason and art can have on our lives and the lives of our communities.”\n\n\nThe American Association of Art Museum Directors (AAMD) voted to alter its platform policy on Thursday, November 21, in an effort to encourage more diversity in its board and staff. The move follows a wave of attacks on the museum industry that have targeted board members and staff in recent months.The New York Times", "The next Biennial should be held in 2021, with a new sculptor selected each year.The exhibition, which is sponsored by the museum, is billed as a “bridging between the biennial and the museum’s Editions and Collections series. “This is a new time, and we have many new challenges, but we have the opportunity to transcend our current situations, and to create a new kind of relationship between artist and museum,” said Cindy Sherman, director of the Diller Scofidio + Renfro, Italy, and curator of the Contemporary Art Museum Tampa. The museum will present a selection of works by twenty-four artists, including Sara Cwynar, Mesbah Gurey, James K. Smith, Landon Larsen, Samantha Neeson, Sara Shagal, and Jenny Tung. The inaugural exhibition was organized by architect and urban designer Richard Mayhew, who is based in New York, and art historian and curator Genevieve DeMonaco. The show will feature work by Nina Nova, John Ostrander, Elisa Moll, Paul Thomas, Perfect Storm", "The next Biennial should be selected by the biennial committee comprising Harrison Shaw, Wangechi Mutu, and Namita Roy, which is chaired by photographer William Eggleston. The 2019 edition will mark the first time the entire collection will be on view. Director Max Hetzler, who has previously worked in the art world as a curator and as a director of the contemporary art center Helsinki, has joined the board of trustees to lead the 2020 edition.The board received a request for proposals (RFP) for the exhibition from the artist-run collective Amaya, who was working on a show “On Body and Space” for the 2020 edition. The RFP stated that the show would constitute a “comprehensive exploration of the philosophical and spiritual foundations of contemporary art.” In a statement provided to Artforum, Amaya said: “Our show will focus on the work of a select group of artists who have made and continue to make extraordinary contributions to the artistic and conceptual landscape of contemporary art. In this context, we are inspired by the exhibition ‘Dreamers’” at the ICA Istanbul in 2019, which brought together the ideas of Anish Kap", "The next Biennial should commence in late September or early October. And finally, event organizers are encouraging the public to send in photos and videos of the virtual exhibits within the museum. “We are excited to present this year’s exhibition of the Biennial,” said museum director Nina Moritz. “Building on what we believe is the most important work of the collection, the exhibition will highlight the work of our curators, present the Biennial’s works in a unique environment in the museum.”\n\n\nThe Greater Downtown Seattle Association (GDSWA) has released the list of seventy-four galleries that are participating in the third annual Art Basel Seattle, which will run from March 16 to March 18. The event draws 200,000 visitors from all over the world each year. “Our goal this year was to create a series of activities and presentations that would put Art Basel’s brand and reputation to the fullest,” said GDSWA director Nathan Wirth. “We believed that a fair with such a strong and diverse collection of work by so many of the most celebrated and celebrated artists in the world was an ideal platform to advance their careers and show their work", "The next Biennial should consist of a review of the work of the last forty years and an exhibition of the work of the next forty years. The biennial will be inaugurated with a new work, a selection of the works of the last twenty years. The biennial will be accompanied by a programme of talks, concerts, exhibitions, and other events designed to introduce the work of the biennial to a new and diverse audience.   The first Biennial of the Arts will take place in Belo Horizonte, Brazil, in 2021. The second will take place in Porto Alegre, Brazil, in 2024. The third will be in London in 2027, and the fourth in Liverpool, England, in 2035. The biennial will be inaugurated by a new work by the winner of the 2018 Silver Lion, the Swiss artist Gabriel Faucher (whose work is currently on display in the Liverpool Biennial). The show, Out of Time, is an exhibition of twenty-four works, titled “Wangechi Mutu: American Indian,” which are the first works by a South African artist to be presented in London since 1999. The show will also feature work by three South African artists, N", "The next Biennial should be held in the April 2019 timeframe. The institution will also be repurposed into a research center for the study of the Syriac language and culture, an extension of the museum, and an educational institution. An exhibition of exhibitions by artists such as Tommos Hely, Omer Abdulla, and Zoran Maščík will also open the vault.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has appointed Kate Brown as the next director of the Metropolitan Museum of Art. Brown currently serves as a curator at large in the arts and media at the museum. She will assume her post in June.“Kate is an exceptional leader who has been instrumental in building the Met through a herculean and in-depth review process and has led the museum through some of the most challenging and transformational times in its history,” said Mark Thompson, the museum’s board chair. “She is also acutely sensitive to and attuned to the needs of our guests and staff, and is constantly working to develop new and creative ways to engage our audiences and communities.”In the new role, Brown will work closely with David Samson, who retired in April 2020 following a fifteen-", "The next Biennial should take place at the Museum of Contemporary Art, Athens (MCA). There are currently no plans for a new exhibition there.“This is a monumental challenge for the museum, we are more than ever in need of a new exhibition, a new programme, and a new director,” said head curator of the exhibition, Theos Kambouris. “We are in the process of drafting a new vision for the Biennial and the future of the exhibition will be decided by the board of trustees of the museum.”Kambouris also noted that the museum’s work on the exhibition is currently being evaluated by the International Council of Painting and Television Artists. The next iteration of the program, titled “MOVIE” (short for ‘MOVIE Art’), will be staged at the MCA from June 9 to June 15, 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed John Lassiter as its next executive director and curator, effective immediately. Lassiter will assume his post in August. He succeeds Miranda Mayhew, who retired in March 2019 after ten years at the institution, and will begin his tenure as curator in July", "The next Biennial should be held in the spring of 2021. The festival will take place at the Museo de Arte Contemporáneo (MAS) in Madrid. The dates for the inaugural event will be announced in the coming weeks.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of fifty-one rare books from the Bettina and Andrew Kremer Collection. The items, which were donated by the couple, who founded the Los Angeles County Museum of Art (LACMA) in 1990, were purchased in 2014 and are currently the museum’s largest gift ever.“The gift of fifty-one books is a milestone for the Kremers, and is an important contribution to the ongoing mission of LACMA,” Matthew Kremer, the couple’s son, said. “We are thrilled to share this gift with our Los Angeles brothers and sisters. Their commitment to the museum and to the public has been unwavering, and we are proud to be able to offer this gift to them and their neighbors.”Andrew Kremer, who served as deputy director of LACMA from 2017 to 2018, added: “The gift of these rare books is", "The next Biennial should take place in 2020.\n\n\n\n\nThe New York–based artist​ Andrew Koenig has died at age fifty-nine. He was born and raised in Brooklyn, New York, and studied at the Cooper Union and the School of the Art Institute of Chicago. His work has been exhibited at the Los Angeles County Museum of Art, the Museum of Modern Art, and the Metropolitan Museum of Art, and is currently housed in the collections of the Metropolitan Museum of Art and the Whitney Museum of American Art.His work has been featured in this week’s issues of Artforum, Artforum Presents, and Artforum Presents: London, and was included in the 2015 exhibition “Theater of Operations: The Gulf Wars 1991–2011” at the Hammer Museum in Los Angeles.“Koenig has been a pioneer and a pioneer of modernism,” David Zwirner said of his work. “His work is timeless and deeply personal, blending an immeasurable range of materials, from flowers to taffeta to papier-mâché, as if he were creating a work from a single sheet of paper.”Koenig’s work has been exhibited at", "The next Biennial should be on the 20th of February 2019. The 20th will be held at the Open Air Museum at the University of Durban, South Africa. I suspect that, if the first edition of the Biennial is a success, that the 2019 iteration will have a similar impact. The next edition of the Biennial is being organized by the Southern African Contemporary Art Museum, Durban, and the Nelson Mandela Foundation. The twenty-sixth edition will be held in the United States by the American Institute of Art in New York, the Richard E. Schubert Museum of Art, St. Louis, and the Museum of Contemporary Art (MoCA), Los Angeles.\n\n\nThe TSG Foundation has canceled the 2019 edition of its annual exhibition in the city of Los Angeles due to the Covid-19 pandemic. The cancellation was made after the foundation raised more than $72 million for its arts and culture center, the Tulane Center for the Arts, and its arts and culture program. The money was used to create over one hundred new jobs at the center and to raise funds for a new partnership between the foundation and the California Hispanic Foundation. “We are thrilled that the 2019 edition of the", "The next Biennial should take place in the summer of 2021. \n\nThe New York City Department of Cultural Affairs announced today the launch of the New York City Arts and Artists (C.A.A.A.) Biennial. The inaugural edition of the C.A.A.A. will run from March 19–March 21, 2020 and will feature artists from twenty-seven cities across the United States. The biennial will expand upon the nationally acclaimed C.A.A.A. Artists for a Better Future, an initiative that has been ongoing since 2010 and involves forty-five artists from twenty-nine states and Puerto Rico. The inaugural exhibition, “A Better Future,” was curated by Ellen Mayer and will open at Rockefeller Center in Manhattan on March 19, 2020. Other exhibitions scheduled in the coming months include “Both Sides Now: India and Art in the Age of Jai Jawahar” (March 20–March 25), “Joyce Carols ” (March 25–March 27), and “John Akomfrah: An American Odyssey” (March 27–March 30).The inaugural exhibition will be inaugurated by a solo", "The next Biennial should be held in 2021.\n\nIn a statement, the State Museum said: “The State Museum of Fine Arts in Boston is excited to announce the twenty-fifth edition of the Arts and Culture Biennale, ‘Awards for Life.” The event will be hosted at the Museum of Fine Arts in Boston from October 29 to December 21, 2020 and will be organized in collaboration with the local community.“The Arts and Culture Biennale is an annual event that draws thousands of visitors to the City of Boston every year, and has enabled us to continue to grow our collection of modern and contemporary art, to support the public, and to advance our research and the museum’s mission,” said Elizabeth Paley, the Museum’s senior director of collections and research. “The biennial’s theme year after year is ‘Life and the Arts:’ this year’s theme, ‘Human Nature’s Place,” and the theme for this year’s event is Life and the Arts.”\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Kiki Smith as its next executive director. Smith succeeds Linda", "The next Biennial should be held in the autumn of 2020. Next year's exhibition will be the first of a new six-part series. The series will explore the interdependence of the human and natural worlds; the cultural and social impacts of art; and the relationship between art and science.The commissioning of the new exhibition is part of the 'Year of Art' initiative, launched by the city of New Delhi and the country’s minister of human resource development, Manish Sisodia, in June 2020.“The art and design sectors are among the most promising sectors for growth and need of the future,” said Sisodia. “We welcome new directions in the art and design spaces with a view to improving their accessibility and enhancing their social impact through the use of modern technology and design, and are committed to supporting this.”The biennial will be organized in collaboration with the urban design and research organization, the Brics, and will include forty-one artists, including Mihai Jakubczak, Ana Mendieta, Nari Murru, Svetlana Shishkina, and Galina Tatar. The biennial will launch with a reception at the Brics in", "The next Biennial should take place in 2022.\n\nThe show will showcase the work of twenty-six artists, comprising sixteen North American and eight international designers, including Apollo Brown, Jules Bianchi, Rina Černý, and Eva Espinosa. Its inaugural exhibition “Post-Modernism” will be held at the institution in September 2022.The show’s main theme, a critical look at the relationship between modernism and architecture, will be the subject of “Post-Modernism: Architecture and the Modern State.” The opening of the exhibition will be marked by an exhibition of the work of the artists featured in the show. The exhibition will be followed by a series of lectures, discussions, and residencies, which will take place over a period of thirteen months. It will also feature a book, a performance, and a film.“We are thrilled to announce that the biennial will return to the Southern California Architecture Museum\u0097where it began\u0097in 2020, and will be a celebration of the themes and the artists featured within the show\u0097in the summer of 2022,” said biennial director Yael Aravov. “The new themes and the artists are fresh", "The next Biennial should be held in New York in early 2022. Both the Museum of Modern Art and the Whitney Museum of American Art have announced commissions for the 2020 edition, which will be centered around a new and experimental methodology for creating works through mass incarceration. The 2020 edition is being organized by the Museum of Modern Art (MoMA) in New York, which is responsible for the the museum’s collection and exhibition program, as well as for its two-year-long Art on Paper series. The theme of the event is “Southern Accent: Black Art from the Southern Hemispheres” and is meant to reflect the centrality of pain and blackness in American art.The 2020 festival will feature the work of fifty artists and will debut a new multi-media installation by the artist duo Equator 5 and QUEENS. “We are thrilled to have the opportunity to create a new art project that celebrates the history of contemporary art in America,” said Equator and QUEENS. “This is a time of great change but it is also an opportunity to reemerge from the shadow of future dystopias. To reemerge as a generation of artists reemerge into", "The next Biennial should be held in 2021. The announcement was made at a press conference at the Biennale of Melbourne, which celebrates its thirtieth anniversary this year.\n\n\nOn Saturday, March 22, the Federal Trade Commission (FTC) filed charges against New York–based art dealer Daniel H. Weiss with the Federal Trade Commission (FTC) after he allegedly defrauded investors by falsely advertising a line of work made of acrylic painted in his Manhattan gallery for sale on the internet.According to the New York Times, Weiss sold the work, which is called a Watercolor, to a client who purchased the acrylic painting from the gallery on March 12. The client claimed the work was authentic and the client received work from the artist. The client then informed Weiss that the work was no longer for sale, and that he could not keep the painting. The client also said that he never received the work from Weiss.The client alleges that Weiss made false claims about the authenticity of the work and that the client is now owed more than $1,000. The client also alleged that Weiss told him that the painting was numbered and that he had the right to make copies of the work. The client claims that Weiss claimed that he could sell", "The next Biennial should be held at the Van Gogh Museum in Amsterdam. In an interview with the New York Times, the artist said he is considering the possibility of staging the exhibition once a year at the museum. Heritage Foundation director Nicole Boudreau said: “We are grateful to the artist and the commissioning organization for taking on board the advice of the Dutch expert team to explore the possibilities of how to present the exhibition in a biennial format. This is one of those cases in which the artist, the commissioning organization, and the museum have been able to work together in a collaborative way.”Istanbul’s Zadeer-Istanbul project is building on the work of renowned Turkish artist Nusaybin Cengiz, who was commissioned by Artspace Istanbul in 2018 to create a new installation in the city’s Zadeer-Istanbul district. The show will take place in the artist’s studio in a newly designed building within the city’s Musulman Arturum. The Turkish artist will be accompanied by a team of twenty-five artists and sculptors from Armenia, Azerbaijan, and Turkey. The project was presented at the Istanbul Biennale in 2019 and will kick", "The next Biennial should be ready for the start of the upcoming exhibition season in September. Prizes that have already been selected for the show will be announced soon.\n\n\nThe Queens Museum in London has welcomed four new members: German artist, film theorist, and theorist Ulrich Zusak, whose practice spans film, video, and theater; Norwegian filmmaker Per Stærk (no relation to Per Stærk), who is best known for his documentary films; Italian primetime and late night talk show host Giulia Battista, who is known for her elegant and pointed paintings; and Colm Tóibín (no relation to Colm), a Belgian artist best known for his large-scale paintings, sculptures, and installations.In addition to the three-year partnership with the museum, which will re-create the former Berlin bunker to house the collections of the two museums, the company will also begin to develop and improve accommodations for the exhibition. The new venue will be inaugurated by a series of public events, which will showcase works from the collaboration. The first event will take place in October 2020. The second event will take place in March 2021. The third show will take place in December 2021.The first exhibition will feature works by Z", "The next Biennial should focus on “How art reproduces the body,” the theme of this year’s event. The first exhibition, “The Body: Art and Body Politics,” will open at the Smithsonian American Art Museum in Washington, DC, on October 7; the second, “The Body Art,” will open at the Brooklyn Museum in New York on October 12; and the third and final exhibition, “Body Art and the Artist,” will open at the Smithsonian American Art Museum in Washington, DC, on October 19. The show will run until March 12, 2021.In the coming months, the exhibition will be expanded to include an exhibition of work by contemporary artists who are working within the contemporary art tradition. Titled “Art and the Body Politics,” the show will go beyond the venue where the artist’s work resides to present the physical politics of the body through sculptures, paintings, photography, installation, performances, and performances. The show will also include a discussion with Miranda Adrianova, a popular and award–winning performer and activist, and will feature the work of artists including Frank Gehry, Julian Schnabel, and Laura Owens.“The Body Art’", "The next Biennial should be staged at the New Museum in New York in 2021. The museum’s current exhibition, “The Future Is Present,” will be moved to the Architecture Gallery in London in 2018. The museum will also reopen with a new exhibition in March 2020.\n\n\nThe B.P.R.D. (American Red Cross) is asking the public for help in identifying and reuniting lost and mutilated animals following an incident in which a nearly three-year-old boy died after a ride-hailing service he was using in Brooklyn on Tuesday, September 25, reports the New York Times.The boy fell approximately sixty feet while riding his bike in the East Hampton neighborhood of New York. His death is still being investigated by the medical examiner. According to the New York Times, the accident was captured on video by a nearby business owner and quickly went viral because of the way the accident was captured on video.More than seventy-five thousand people have viewed the video, which shows the boy riding his bike alongside a group of boys about fifteen years old, and it has been viewed more than ten thousand times. On Wednesday, September 26, the boys were arrested and charged with reckless homicide and criminal vehicular", "The next Biennial should be an interesting mix of architecture and design, created by the artist and being curated by the artist, which will surely be a theme. The museum has already made the decision to return the building and has constructed an extension of the building. The building is currently being renovated by architect Adrian Cheng.“The Museum of Modern Art is working toward developing a new mission for the museum that will reflect and celebrate the excitement of modern art and architecture,” Christopher Taylor, the museum’s director, said in a statement. “With the new building and renovation, we are adding value to the local community by celebrating the breadth and depth of the museum’s collection, the interdisciplinary work of the exhibition program, and the development of local and global art through exhibitions, programs, and collections that are as diverse as the collection itself and the Art of the Americas.”\n\n\nThe Museum of Modern Art (MoMA) in New York is preparing to reopen to the public on December 10 following an $8 million overhaul. The reopening will bring with it a host of new curiosities and a host of new experiences. The first of these is the new exhibition space, the Museum of Modern Art Imagination Row, an", "The next Biennial should be called for Spring 2020 and would be held at the Museum of Contemporary Art (MoCA), in New York, the Museum of Modern Art, the Museum of Modern Art, Philadelphia, and the Metropolitan Museum of Art, the Metropolitan Museum of Art, and the Whitney Museum of American Art. The museum is also working on a new digital initiative and the American Film Institute (AFI) in New York will launch an online version of its annual Biennial Film Festival. The initiative will be hosted by the AFI and will be led by curator Ben Ostensibly, whose work is represented in the New York exhibition “Ben Ostensibly: The Film of Life.”The 2024 edition of Biennial will be hosted at the Museum of Contemporary Art, in New York. The Biennial Film Festival will be carried out simultaneously with the museum’s exhibition “The Golden Years: Reflections on Film at the Museum of Contemporary Art.” The event will be held at the Museum of Modern Art through March 11, twenty-six days after the biennial’s March 15–March 16 closing party. “We are delighted to announce that the twenty-sixth edition of the Biennial Film Festival", "The next Biennial should take place at the venue in 2021, with the year 2020 to be dedicated to “Justice and Peace.”\n\n\nThe New Museum in New York has been awarded a $1 million grant from the Knightsbridge Foundation. The organization has created the $1,000 Knightbridge Legacy Grant, which will support the museum in its transition to a new leadership and in the subsequent transformation of the entire building. The organization has been struggling to secure funding for the facility since it was acquired by the Knightsbridge Foundation in 2017.In a statement, the group said that the grant “provides a unique opportunity for the organization, through the long-term care of the art in the museum, to shift deeply into the future, while simultaneously building on the legacy of the institution.” The organization’s board of trustees added that the grant “is an important step in moving the building forward.”Commenting on the transition, Knightbridge Foundation president and CEO Richard Armstrong said: “Through this grant we are setting an example for a new kind of leadership and of rethinking the future of institutions. We are establishing the framework for a future leadership role for the Knightbridge Foundation, which will play a key", "The next Biennial should take place in the spring of 2021. The full list of participating arts institutions is as follows:ArtsCenter, ShanghaiConference Center, Shanghai Gallery, Shanghai Art Museum, Shanghai Art Museum, Shanghai Art Museum, NanjingArt Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Shanghai Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing Art Museum, Nanjing", "The next Biennial should be in January 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to shutter its doors permanently in April 2020 to complete a $450 million renovation that will include the addition of more galleries, classrooms, and classrooms of the museum as well as the remodeling of the building that houses them. The institution is also planning to move the collection and the collection of its namesake collection, the Institute of Contemporary Art, Boston.“We are preparing to open in April as we prepare to make the most of this challenging season,” said museum director Matthew Teitelbaum in a statement. “This is the most ambitious project we have undertaken as a museum and demonstrates our commitment to the art of the twenty-first century. We are capable of greater things, and this project is an important step in that process.”The museum is planning to open in May at a new $250 million home that will be built in the former South Boston neighborhood, which was transformed by the Dorval-George’s Massachusetts General Hospital into a large cluster of eight galleries in July 2015. The Commonwealth Art Gallery of Massachusetts (CAG) is also planning to take over the complex in June, but it is not", "The next Biennial should be scheduled for the Spring of 2019.\n\n\nZaha Hadid Architects have won the 2019 Art and Architecture Biennial. The twenty-seven-year old firm, which is based in New York, New Jersey, and Paris, received the award at its inaugural exhibition, Art and Architecture.  For the first time, the French jury awarded the prize to an American artist. The juried jury consisted of Tony Zucculano, Richard Avedon, and Paul Mpagi Sepuya, and chose the firm Zaha Hadid Architects as the winner of the 2019 Art and Architecture Biennial Art and Architecture.Established in 2003, the inaugural Art and Architecture Biennial was established in partnership with the Museum of Modern Art in New York, which reserted its offer of a full-time position for the awardees. The 2019 honor theme, Art and Architecture, was selected by Katsu Noguchi for his work in the film and was chosen by artist Pia Camil for her design for the street.In the production of the award, the three artists chose a theme from their respective fields to reflect the themes of the year: architecture for architecture, architecture for architecture", "The next Biennial should take place in 2020.\n\nThe National Museum of Art in Washington, DC, is planning to shutter its doors on March 31, 2020, following a $25 million renovation. The renovation, made with $50 million from the sale of the 1969 Cleveland Clinic collection, began in March 2020 and will conclude in March 2021.The redevelopment of the museum is complemented by the expansion of the National Museum of African Art in Washington, DC. The new museum, which will be built on the grounds of the former site of the University of Washington, features new works by artists such as Hieronymus Bosch, Taziana Cabral, and Mary Cassatt. In addition, the museum is constructing a new visitor experience with more galleries, a larger auditorium, and a dedicated seating section for fifty thousand visitors. While construction between the institution and the National Gallery of Art is ongoing, the new museum is scheduled to open in 2023.The Cleveland Museum of Art (CMAC), another cultural institution located in the city of Cleveland, is planning on closing its doors on March 31, 2020. Fran Townsend, the museum’s executive director, confirmed that the institution will not be closed “in perpetuity.” In a statement,", "The next Biennial should be held in 2022. The first was held in 2007, and the last was held in 2009. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has issued a public apology for excluding the National Council on the Arts (NCEA) after it began a campaign to hold the museum accountable for financial mismanagement. The protest was sparked by a December 31, 2019, email sent to staff by the NCEA, which calls for a “meaningful change at MoCA.”“While we acknowledge the seriousness of our missteps, we believe we have taken the right course in responding to the NCEA letter and in addressing the culture of the NCEA and the future of our institution,” said museum director John Hancock. MoCA also clarified that the letter was not an apology for the museum’s funding, but a request for “meaningful change.” The museum responded that it did not know what the NCEA was asking for at the time, but it had addressed it twice since then.Commenting on the letter, Hancock said: “Over the course of the last twelve months, I have had the opportunity to meet with the NCEA", "The next Biennial should be held in the spring of 2020. The last Horizon was held in the fall of 2020.Activists and researchers have been pushing for Horizon 2020 to be held in July, saying that the exhibition has been hijacked by the Chinese government to promote the mainland Chinese government’s domestic agenda.China’s Cultural Heritage Ministry announced on July 4 that the first exhibition of the National Gallery of China (NGA) in Beijing would take place in August. Art in China, which is tightly controlled by Beijing, is normally curated by state-run institutions. However, the ministry said that the NGA would be operated by a committee of five curators, comprising two from Beijing and one from Beijing’s New World Garden Museum, and would feature a mix of national and international artists. The exhibition will be accompanied by a book on the subjects of Chinese art and architecture and will focus on the creation of the new nation, which is currently developing a culture based on patriotism and the art of warfare.The exhibition will address themes such as the evolution of China’s art from a pre-modern nation state to a nation state-like state, the influence of art and architecture on Chinese people, and the role of art and architecture in", "The next Biennial should be launched by the end of June, 2020, and will be curated by the same three artists—Mona Hatoum, Olu Ojo and Oltman Olu. The theme will be “Life, Death, & Rebirth: Contemporary Art in the Age of Black Power.” A selection of works by the late artist and activist Hosea Williams will also be presented. The art will be housed within the museum’s new building, which will be inaugurated by a new monument dedicated to Williams, and will inaugurate the building’s new exhibition space, Art + art.The sculpture and installation Biennials celebrates the movements, the sounds, and the many visual and kinesthetic experiences that have shaped the ways that African Americans have been viewed and experienced in recent decades. The artists argued that the museum should also celebrate the work of the late civil rights leader and icon Dr. Martin Luther King Jr., whose work will be featured in a new exhibition\u0097“Jim Crow: Reclaiming the American Negro”\u0097which will be inaugurated by a new monument dedicated to King.\n\n\nMore than 1,300 artists, designers, writers, and other cultural workers have signed", "The next Biennial should be held on October 28–31, 2020.\n\n\nA group of artists and collectors have released a statement in response to the recent wave of violence against women that has taken place across the United States in the wake of the release of a groundbreaking documentary film, Women in Film, about the life and work of artist and activist Bettie Gordon. In a statement published on Instagram, the participants of the statement called for the prosecution of the perpetrators of the crimes against humanity, and demanded that the United States stop funding organizations that perpetuate violence against women.The statement, which was written by Adam D. Weinberg and signed by fifty-seven artists, activists, and scholars, alleges that the film makers involved in the movement to defund the Vagina Monologues organization “intend to ignore the many ways in which the Vagina Monologues movement is indebted to the Vagina Monologues women and to the Vagina Monologues artists who inspired it to begin with.”The statement further claims that the Vagina Monologues filmmakers “know full well that their videos and performances present a hostile and dehumanizing portrayal of the Vagina Monologues practice.”While the statement does not specify what actions the filmmakers will take in", "The next Biennial should be held in 2022, and the first in twenty years. The London-based institution is currently working on a redesign that will include new galleries, new exhibition spaces and new public spaces within the Cultural Exchange building.The project is part of a major $3 billion overhaul of the Cultural Exchange, which will focus on creating a more inclusive exhibition space and expanding access to the exhibition, as well as integrating the institution into the city and surrounding area. The redesign will also include the construction of new galleries that will house new works and better maintained spaces and a reopening of the gallery in 2021. The restoration of the venue is expected to cost an additional $1.5 million.“We are delighted that the Cultural Exchange is going to the new chapter,” said Richard M. Price, director of the Metropolitan Museum of Art and the Metropolitan Museum of Art, which has been closed since March 2019. “We are confident that the new books will give the will and energy to carry out a remarkable new exhibition. We look forward to the theme, the artists, and the audience of the next edition.”\n\n\nThe Museum of the Fine Arts (MFA) in Boston has appointed Annie Petkowitz as its new executive director", "The next Biennial should be held in 2022.\n\n\nThe winning design of the twenty-sixth Venice Architecture Biennale, The Guest House, is now available for purchase by the artist in the form of a digital painting. The work, which depicts a group of homeless people sleeping in a forest, was inspired by a project by the artist to create a new home for homeless people in the city of Venice. The program was led by the designer of The Artist’s House, Stefano Dalla Monte, and was a response to the unprecedented flood of new housing construction in the city. The theme of the biennial is “Empowerment.” The program is available for digital purchase.The painting is a narrative of a group of homeless people living in a forest near Venice, who are awoken by the sound of construction. They decide to leave their sleeping quarters to help others to enter the construction site, and in the process become part of the work of an architect. The Work will be on display in the exhibition “Plans for Venice” at the Venice Biennale from November 18 to November 21, 2020. The work is part of “The Work of Stefano Dalla Monte” (2018–19", "The next Biennial should consider the ways in which art can be re-created in a more intimate and public setting. The themes may include “human relationships with art, ‘artifice, and design, and the transformations that art makes.”\n\nA group of artists, musicians, writers, and activists are teaming up to push for a full-scale divestment from fossil fuels—one day. Their plan is to hold a massive protest at London’s Tate Modern on December 8, when the upcoming exhibition “Tallest Building,” a new triennial, “London: Art, Politics, and the Future” will open. “Tallest Building: Climate Justice” will feature artworks that address climate change and will draw many thousands, including Leonardo’s “Amor Project” and the Black Lives Matter protesters (both of which were sanctioned by the organizers), and will be curated by the British artist Rachel Whiteread.Whiteread, who is black, told The Guardian that the current exhibition is “the height of white supremacy” and that the protesters are “sympathetic to the same things that racism is—not just about race but about capitalism", "The next Biennial should take place in 2021.\n\n\nThe New Museum in New York has announced that it will postpone the next edition of the Art Basel Hong Kong, scheduled for October 2021, until March 2022 at the earliest. The exhibition will now be staged in the museum’s newly refurbished building on East Twenty-Third Street in September 2022. The exhibition, titled Art in Motion, will also be moved to September 2022 at the Art Fund, where it will engage with exploration of contemporary art and digital technology. The museum will also move the exhibition—which has been moved from the fifth floor of the building to a smaller space in the museum—to a new location in the city. “The move is part of a larger plan to create new spaces that reflect and engage with the art and design of Hong Kong,” said David Karp, the director of the museum. “We wanted to present the work of artists from around the world and the quality of their work through modern and contemporary artists. We also wanted to bring together the art of Hong Kong and China in the context of the museum’s collection as well as that of Hong Kong’s own contemporary art.”The move follows the news that"]