["The next Biennial should be held in 2021, the Art Newspaper reports.The announcement was made during a presentation of the fifty-ninth version of the exhibition, which is currently on view at the Museo de Arte Contemporáneo (MAS) in Madrid, at the Museo de Arte de Madrid, which is housed in the same building as the Pérez Museum in the city of Córdoba. The exhibition, titled “Museo de Arte: Los Angeles,” will open on March 14 and run until March 15.The biennial will curate the work of twenty-seven artists, including Maria Andujar, Alice Madigan, David Sawchuck, Jock , and Mary Stokes, as well as host a selection of works by the curators. The series of exhibitions will also include a virtual reality installation.“Museo de Arte: Los Angeles” was created by the Los Angeles-based artist Claudia Quarles, who will also curate the upcoming exhibition “Obligatory Rituals: Art in Motion,” which will open at the Museum of Contemporary Art (MoCA) in Los Angeles on September 17. “We are", "The next Biennial should take place in 2021, and the first in 2022. The exhibition will be hosted by the Museum of Contemporary Art in Seoul (MCA) and will run in conjunction with the Seoul Art Museum. The 2020-2021 edition will feature work by fifty artists, including Josef Albers, Komodo Kang, and Lisa Su, and will be on view in January 2020.The 2020 edition was curated by director Jung Hyeong-Min and will be presented by the Korean pavilion. The 2019-2020 edition, which was hosted by Lee Hae-Chul, Kim Seong-kyun, and Kim Eun-sung, was curated by Kim Seong-kyun and will be presented by the Korean pavilion in January 2021.\n\n\nThe University of Washington in Seattle announced today that it has received a $50 million donation from the Center for Southwest Asian Art (CSA), which is funded by the Guggenheim Foundation and the Eberly family, to support the renovations and expansion of the Solomon R. Guggenheim Museum. The gift includes $50 million for the expansion of the public entryway, the sale of some of the collection, and the construction of a new sanctuary as part of a $", "The next Biennial should be held in May 2020 and will be hosted by the Moscone Center in Los Angeles, which is currently undergoing a $1 billion renovation. The theme of the 2020 edition of the Biennial is “Animals.” The 2019 edition was titled “Humans.”\n\n\nThe Pérez Art Museum in Mexico City has announced that fifty-three artists and collectives have received its directorship in the next iteration of the edition of the Pérez Art Museum Puebla, which will take place in the capital city’s Harina Museum in May 2020. The forty-eighth edition of the Pérez Art Museum Puebla, which will be held at the Punta de la Revolución, is now underway.The Pérez Art Museum Puebla will host eighty-four artists, including the artists represented by the Pérez Art Museum, Pampas, and New York; seventy-six works by artists from the Americas; and thirty-two works by Mexican–American artists. Among the artists chosen for this iteration of the Pérez Art Museum Puebla are Ed Ruscha, LM Gomes, María Álvarez, Juan Bar", "The next Biennial should be held sometime in 2021, and the museum should anticipate an opening in 2022.\n\n\nErick Pérez-Pérez, the former CEO of the New York City–based nonprofit the Newark Art Museum, has been appointed director of the Museum of Modern Art (MoMA). He will assume his post in January 2021.“It is an honor to lead the Museum of Modern Art’s Newark, which has been historically one of the city’s most vibrant cultural institutions,” Pérez-Pérez said in a statement. “As I embark on this new chapter in my life, I look forward to working with the Newark community to advance the Museum’s mission and to establishing new, exciting partnerships with local artists and organizations. I am confident that the Museum of Modern Art Newark will continue to thrive under my leadership and this museum’s outstanding collection to become a vital source of inspiration for Newark’s artistic and cultural community.”The appointment of Pérez-Pérez as the next director of the museum came after an outpouring of support for the arts and culture across the United States following the devastating explosion of the World Trade Center on September 11, 2001.", "The next Biennial should focus on the interconnections between sculpture, theory, experimental design, and the visual arts and the process of production itself. The exhibition should be organized in a way that avoids the pitfalls of a festival with a single focus. It should be a collaborative exercise with an open ethos.The theme of the 2020 edition of the Biennial is “Simultaneity and Non-Symmetry.” “This year we wanted to present a new set of works, and a new set of ideas, that are very much in tune with the current state of our times,” said Gongbai. “Our workshops will focus on the importance of the visual arts in shaping new perspectives, and our exhibitions will address the visual arts and their role in our lives.” The workshop program’s theme “Simultaneity and Non-Symmetry” is based on the central idea that all the elements of our world are interconnected, but in ways that are not synchronized. The exhibition “Simultaneity and Non-Symmetry” was created by artist Yoona Seo, whose practice encompasses painting, sculpture, installation, performance, and installations. The program will perform a new level of", "The next Biennial should, of course, feature the work of the artists who have been most active in advancing the practice of Northern dance in the twentieth century, including Virginia McAuley, J. M. A. Macgregor, and Jane Alsop. The Festival will also be inaugurated by an exhibition of the works of late Dutch master Willem de Kooning, a curator of African dance, a director of the Museum of Modern Art in New York, and a dancer and choreographer.The official theme of the 2019 edition of De Wohnung is Free Knowledge, a phrase first coined by artist Weylin Steegmann to describe a spirit of originality, flexibility, and openness in which objects, ideas, and possible worlds are rendered accessible to a direct and immediate perception. In an article written for Artforum last November, Kooning argued that De Wohnung is the only contemporary art institution that is a living organism, a living organism that can be experienced and experienced in a multitude of ways. “I am not kidding, I mean it,” he wrote, “a living thing that is alive, breathing, and needs to breathe.”\n\n\nThe City of Vancouver, British", "The next Biennial should take place in May 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston, which is currently closed due to the Covid-19 pandemic, is planning to reopen in early March. The reopening, which will be the first since 2013, is part of a larger cultural and economic development plan that will involve the relocation of the museum’s permanent collection and the creation of new experiences for visitors to the museum.“The MFA is taking the Covid-19 pandemic seriously and will be ready to reopen, as soon as the necessary safety measures are in place,” said director Matthew Teitelbaum. “Our work to redevelop the MFA is far from finished, and we are actively working with local, state, and federal government officials to ensure that the museum’s buildings can be restored to their former glory and that MFA Boston can reopen.”\n\n\nThe Adult Children’s Museum in Littleton, Massachusetts, has appointed Elizabeth Ann Cavalli as its new executive director. Cavalli will be the first woman to lead the institution since the institution’s founding by Edward Colston in 1803. In her new role, she will be responsible for building", "The next Biennial should be on Standing Rock next month.  Update: March 16, 11:30 AM The Biennial and the nation as a whole will soon face new and frightening threats to our very existence. We are now witnessing a global pandemic, the deadliest since SARS. The biennial’s president, Fredric Gneńk, said: “At a time when many of us are facing unprecedented challenges, the leadership of the biennial and the National Museum of Modern Art are committed to working collectively as a team to address these challenges.”\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is reopening on March 21 following a $1 billion expansion, which doubled the museum’s footprint to 1,866 square feet and added a floor-to-ceiling glass-enclosed pavilion. The museum reopens on March 22 following the reopening of the Metropolitan Museum of Art, which is located at 1045 Fifth Avenue.The expansion also added a new, larger collection space, built-out curatorial galleries, and improved accessibility. The museum now has an operating budget of $2.3 billion and is planning to be fully operational by the", "The next Biennial should be held in 2022. The next South by Southwest (SUNY) (2019) may also be re-scheduled. The New York Times reports that the Board of Trustees of the Museum of Modern Art (MoMA) in New York is also proposing a major restructuring. The institution is currently planning to move the exhibition “A Sense of Place,” which will run concurrently with the forthcoming biennial, to a different venue, and will likely close its doors in the first half of 2020. In a statement, MoMA said: “The Board of Trustees’ decision to make the difficult decision to postpone the upcoming 2020 MOCAD conference was not taken lightly. We value the support of our community and are working with our partners, including galleries, organizations, and other artists and curators to ensure a great show for our visitors in 2021.”\n\n\nThe museum’s board of advisors has approved a $2 million donation from the The Society of Honorary Fellows, which was founded in 1936 by Artistic Directors John and Paul Sargent, who gifted $500,000 to the institution in memory of their son, George, who died last spring. The gift", "The next Biennial should be held at least every other six months. The idea of a month-long event was suggested by the organizers of the previous Art Basel (BA) Switzerland, which has been organizing under the name Art + BIMH, and is inspired by an article in the February 25, 2009, issue of Artnet in which artist Ramón Jalapa (1924–2006) suggested that the year be divided into twelve months. During its run, the Biennial has featured new exhibitions by artists such as Rineke Dijkstra (2018), Agus Tsonga (2017), Jade Ma De, (2017), and Masumoto Eisuke (2017).\n\n\nGoogle Art, the search giant’s research arm, is facing a class action lawsuit after employee Daniel H. Weiss, who worked as a Google Art intern from September 2014 to September 2018, filed a complaint against the tech giant with the California workers’ union, United Food and Commercial Workers Union (UFCW), on April 5. Weiss claims that Google orchestrated a “severe and pervasive campaign of harassment and discrimination,” and that Google terminated his contract for “indefinitely” after he refused to cease his work.When Weiss signed", "The next Biennial should take place in 2021 and be curated by a new generation of curator. Presently, the museum has a ten-person curatorial team and has a twenty-year plan, and it has initiated a new generation of exhibitions. In addition, the museum has devised new initiatives to support the teaching of the art of the twenty-first century, such as the International Faculty Exhibition (IFEX), which will present the work of twenty-three artists, including Brian Eno, David Hockney, and Laura Hutton, in the coming months.\n\n\nThe Museum of Contemporary Art (MoCA), the Los Angeles County Museum of Art (LACMA), and the San Francisco Museum of Modern Art (SFMoMA) have entered a partnership with the Japanese artist Imaek Akimoto, who, in the early 2000s, shaped Japanese urban settings in his own image. The collaboration, which is supported by a $10 million gift from filmmaker Lisa Haggag—the deal is part of her TWENTY-NINCH mural project—initiates a campaign by cultural workers and activists in Japan and Europe in support of artists and activists whose work takes the form of works and murals.The partnership will support the development of an", "The next Biennial should be held in the third quarter of 2020, as planned. The first exhibition, “The Death of Mary Compson: A New Life in Art” (2019–20), was staged in the spring of 2019 and reached the goal of a total of twenty-four works by forty-two artists in April 2020. The second exhibition of works by forty-two artists was held in the fall of 2019 and reached the goal of twenty-nine works by forty-three artists in March 2020.The 2019–20 season brought the first three exhibitions of work by twenty-one artists—Sidney Wexner, Philip Larkin, and Caleb Weathers—as well as the first weekly show by thirty-five artists in the United States and New Zealand. The show, titled “The Death of American Art” (2019–20), was staged at the Los Angeles County Museum of Art in the spring of 2019 and was followed by “Stars of Tomorrow: A Contemporary View of Art” (2019) at the Serpentine Galleries in London.The show was curated by Max Hollein, curator of American art at the Museum of Modern Art in New York, and Saul Bellow, curator of American art at", "The next Biennial should be held at a venue that offers a globally recognized art-historical exhibition, which can present the exhibition in the contemporary setting of the city and host a compelling selection of works. We believe that the new venue should provide a platform to develop and encourage innovative and experimental works across art, design, and design-based initiatives.\n\n\nTacita Dean, the former president of the Minneapolis Arts Council, has been appointed director of the Sperry Museum of Art in St. Paul. She succeeds Amy Rabkin, who retired in March after twenty-six years at the helm of the organization.“I’m honored and excited to take on this role,” Dean said in a statement. “I’m deeply committed to the arts and am grateful for the lasting imprint of the Minnesota Arts Council on my life and work. The organizing and growing of the Minneapolis Arts Council has been a goal of mine since I was a young consultant in the early 2000s. I’m excited to join the MCA’s dedicated board of directors and to help shape its future.”Dean previously served as the chair of the MCA’s board of trustees and as president of the Metropolitan Museum of Art", "The next Biennial should be held in the spring of 2024 and should be led by a director who has had a significant and enduring impact on the history of the museum.  We at the Biennial Foundation believe that the new director should be a global leader in art history and art with a strong record of achievement and excellence in a field that has been historically underserved by its own trustees. The new director should also be an American citizen who has lived in the United States for at least twelve months prior to the appointment. The candidate will be selected by an extensive and interdisciplinary committee comprising artists, curators, historians, and present-day museum directors; art historian, curators, and scholars; art historians, curators, and scholars; and experts in the arts. The first Biennial to be held in Washington, DC, in twenty years was held in 2008, and the second in 2020.\n\nThe Museum of the African Diaspora (MoAD) in New Orleans has appointed Brenda Brown as its next executive director. Brown will be responsible for guiding and developing the institution’s programming and expanding its reach across the United States. She succeeds Ellen A. Larson, who served as the institution’s director from 2019 to", "The next Biennial should take place in the city from March 13 to March 15.  The exhibition will highlight the work and work of contemporary artists and will be organized in both a linear fashion and through a series of collaborative projects organized by anthropologists. The 2020 edition will be held at the Museum of Contemporary Art, Chicago.\n\n\nThe Centre Pompidou in Paris has received a gift of fifty-six modern art works by artist Pierre-Auguste Renoir from the French Ministry of Culture. Among the works are works by artists such as Pierre-Luc Godin, Pierre-Louis Jardin, Jean-Luc Haussmann, and Jean-Michel Basquiat. The gift also includes a treatise on man and the universe, as well as two paintings by Renoir that are currently on display in the exhibition “Prestel: Je Suis Charlie” (The Existential Life of Man), which opened on January 22.The Centre Pompidou, a city-owned museum founded in 1977, has been working on the acquisition of works by Renoir and other French artists since the late 1980s. In 1997, the museum received a gift of thirty-two works by Pierre-Auguste Renoir from the", "The next Biennial should be held in the new building, which will be inaugurated by the exhibition of the artist’s first solo exhibition in the country. The first exhibition, titled “A Different Kind of Life,” will open in the new building on September 20.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that the Mayor Bill de Blasio administration has allocated $62 million for the redevelopment of the Embassy of the Holy See in Manhattan, and that the funds will be used to improve the cultural and recreational environment of the historic nineteenth-century Polish Embassy building, which has housed the Holy See since 1970.The funds were made in the De Blasio for Year of Action for New York City’s Cities initiative, which was launched in 2019 and explores how the city can capitalize on the significant economic and cultural revitalization underway in the city. “Embassies are an essential element of the city’s cultural life, and their revitalization is an important opportunity for the city to build on its reputation as a dynamic cultural destination,” said cultural affairs commissioner Tom Finkelpearl. “The city’s artists and cultural organizations have shown with their work", "The next Biennial should be held in 2021, but there is some uncertainty as to when that will be. The festival’s organisers have stated that it will not be affected by the Covid-19 crisis.\n\n\nNew York’s Metropolitan Museum of Art (MoMA), the Museum of Modern Art (MoMA), and the Whitney Museum of American Art have launched a new initiative to support the local arts through the costs of the coronavirus. In partnership with the Metropolitan Museum of Art’s Center for Art and Creative Innovation (CMA), the Metropolitan Museum of Art and MoMA have teamed up to offer free admission to visitors twenty years of age and under through 2020.“We believe this is the best way to ensure an accessible, meaningful, and affordable future for artists and families in the city,” said Paul Graham, chairman of the Whitney Museum of American Art. “We will work with our partners to ensure that free admission to the Museum of Modern Art, the Met, and MoMA will be a regular feature in 2020. When people use the hashtags #MoMoMAArt and #MoMAArt2018, they think of pictures, not the art. We will continue to hold free admissions to the museums for", "The next Biennial should take place in April 2021, at the Museum of Southern Art, New York, and will be hosted by the W. M. Kehrer Museum of Art, Munich. The twentieth one will take place in September 2020. The show will also include a reflection on the twentieth century, featuring a selection of works by artists whose work has not yet been displayed in the exhibition. The exhibition is organized by the Foundation for the Visual Arts in cooperation with the curators of Biennials Thesaurus and Comparative Art, which are based in Berlin.The exhibition is organized as follows: Themes:From the lush landscape of the Congo to the crystalline waters of the Pacific Northwest, the exhibition will explore how art and culture have addressed issues of environmental and social justice. The exhibition will also include a lecture by the curatorial team and curator of this year’s exhibition, Janice Fobert. The lecture, titled “The Future of Art: What Are We Voted On?,” will address the consequences of a strictly utilitarian conception of art—a point made by Curator Lise Maheu, who will become the first head of the exhibition. On the themes of the exhibition: �", "The next Biennial should focus on indigenous perspectives on ecology and the environment, and how they have shaped, changed, and are shaping contemporary life, and the relevance of these perspectives in the ongoing legacy of the Indigenous art and culture of Canada.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Marc-Andre Joly as its next director and CEO. Previously, Joly served as a senior curator at the Los Angeles County Museum of Art (LACMA) from 2016 to 2018, and was a curatorial assistant at the Los Angeles Museum of Contemporary Art (LACMA) from 2005 to 2009. He succeeds Jaye Johnson, who has been named interim director.“Marc-Andre has spent the last five years leading LACMA, and has overseen one of the most successful exhibition programs in the country,” said museum director Monica Meneguzzo. “Jaye’s tenure at the museum has been instrumental in the museum’s growth and development. Her contributions to the institution have been incredible, and I’m grateful for her vision and energy in building the LACMA community.”Joly is currently the first director of the LACMA Museum of Art and is seeking", "The next Biennial should be held in 2022 and will be hosted by the National Museum of Denmark. The exhibition will explore the life and work of Nils Østby and his iconic work The Golden Fleece, which first appeared in 1975.The event will be accompanied by an exhibition of work by twenty-four artists, including Daina Ciljof and Davey, and will be curated by museum curator Anna Pettersson.“We are very pleased to invite the people of Norway to participate in the next Biennial,” said Stefan Skoglund, director of the National Museum. “By participating in the exhibition, we are hoping to bring together the best of the best and create more opportunities for diverse artists and their work to be presented in the future. We welcome all to the museum. We are also very pleased that the Biennial will be a challenge for the people of Denmark, which is the heart of its cultural life.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has issued an update to its long-running promotion of independent artist-run incubators and other self-reliant arts environments in the city, improving accessibility and streamlining the process through which arts projects can be supported", "The next Biennial should begin with a public screening of the film Jerusalem, which was shot in 1974, and a moderated discussion about the exhibition; it should also include a review of the exhibition\u0097Jerusalem: The Biennial, 1982, and a discussion of the exhibition’s role in promoting Palestinian art and activists\u0097and should be open to the public for free entry. “This is a moment of great challenge for the world,” said Phil Collins, director of the Biennial. “We now face the possibility of a new paradigm for art in the twenty-first century, and we must use it.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines on how to respond to protests over the recent killing of George Floyd by New York Police Department (NYPD) officers, including by using the “heck no more” adage as a rallying cry. The guidelines outline how individuals can avoid confrontation with police, but advocate nonviolent protest. They also outline the types of protected speech that can be suppressed, including statements critical of police and their use of force. The guidelines were developed by the DCLA and the Office for Civil Rights under the new", "The next Biennial should focus on “strategic exchange,” the institution said in a statement. 'This will allow us to create a new, more inclusive, and collaborative platform for the exchange of art, technology, and ideas. We are open to dialogue and collaboration with our diverse audiences. We invite you to visit us in LA or Berlin and to engage with our mission. We represent a wide variety of artistic and technological approaches, and we are constantly innovating.”The next edition of the Berlin Biennial, “Between Two Worlds: Art and the Digital Landscape” will be held at the Museum Heymans in the Meudrucke Art Center from September 10 to September 12, 2020. The exhibition will feature new works by eighty-nine artists—including Jaime Alegría-Alvarez (Spain), Karl-Theodoros Astafy (Germany), Alex Breslin (US), and Aravind Bicam (US)—who have organized their own exhibitions at the museum. The project was prompted by the Berlin Airlift of “Lloyd and Sarah: Together,” which opened in March 2019 and ran for ninety days. A full list of the artists participating in the exhibition can", "The next Biennial should be held in 2020, but even if it did not, the museum would not be closing permanently. Instead, according to the New York Times, the museum will move its exhibition space to an undisclosed location in Cambridge, Massachusetts, and will continue to host programming in its current space at 1500 Massachusetts Avenue. The museum hopes to begin a new exhibition at its current location in 2021.The museum’s current exhibition of works by and about African American artists is titled “The Black Family: a Pastoral History,” which presented a diverse selection of works by artists such as James A. Farley, T.J. Dill, Susan E. Zebu, Tanya Elkins, and Zaremba. The exhibition also featured a survey of the museum’s collection.\n\n\nThe following artists were chosen for the 2019 Noguchi Prize, which honors people who have made significant contributions to photography over the last five years. This year’s award cycle drew from submissions received from October 5–October 7, 2019.The 2019 Noguchi Prize winners:Adam Isgro, New York / Los Angeles: Pablo Picasso: Pablo Picasso: The Risen Messiah (2019) (2019", "The next Biennial should be held at least annually, and should aim to include a selection of works in each of the twelve principal languages of the country. “I want to be very clear about this: I am not a convert, nor am I trying to convert anyone,” Roman said. “I am simply saying that in this critical moment when we are facing our most difficult challenges, it is possible to have a truly radical and feminist vision of the future.” He added that he hopes the initiative will inspire “new and challenging readings of the art world.” The exhibition will feature work by thirty-six artists, including Langane Muglia, Nima Noshiri, and Alessandro Nuzzo, and will run until March 12.The London-based artist, whose practice focuses on drawings, collage, sculpture, photography, photography-video, installation, performance, and performance-art, is a member of the London-based group the London-based group The London Assembly, which promotes the work of emerging artists. The London Assembly also represents artists such as Lucas Arundathi, Aislima Anwar, and Esmond Akademi, and has held events at museums", "The next Biennial should take place in 2020.  The next art fair should take place in 2022. The next Art Biennial should be held in the next six years. The next Art Foundation should be held in the next four years. The next Art World Biennial should be held in the next two years. The next Art and Design Biennial should be held in the next five years. The next Art and Design Foundation should be held in the next two years. The next Art and Design Biennial should be held in the next five years. The next Art and Design Biennial should be held in the next two years. The next Art and Design Biennial should be held in the next four years. The next Biennial of Contemporary Art in the Americas should be held in 2021. The next Art Biennial should be held in 2021. The next Art Biennial should be held in 2021. The next Art Biennial should be held in 2021. The next Art Biennial should be held in 2021. The next Art Biennial should be held in 2021. The next Art Biennial should be held in 2021. The next Art Biennial should be held in 2021. The next Art Bi", "The next Biennial should focus on the legacy of the artist’s work with the question “How can we care for the past, in the service of the future, and in the service of the culture?” In a recent letter to the Festival, Osei Kounemaru, a biennial curator and curator of contemporary art at the University of the Arts, said: “While we are aware of the recent events and feel it is important to condemn these acts of violence, we feel it is necessary to contextualise the ‘historical situation, the present and future, and the relationship between Japan and Asia, and to raise awareness of this connection and the art that surrounds it.”\n\n\nThe first major retrospective of the career of the late American photographer Robert Irwin, who helped popularise the medium of portrait, will open at the Museum of Fine Arts (MFA) in Boston on February 7. The launch of the exhibition “Robert Irwin: Ten Essentials” will coincide with the centenary of the American photographer’s birth and will be followed by a retrospective of his work titled “Robert Irwin: His Essential Portraits” at the Museum of Modern Art in New York on January 29.", "The next Biennial should be held in 2021. \n\n\nThe Sundance Film Festival announced today that it will cancel the upcoming edition of the festival, which is scheduled to run from February 16 to March 22, 2020. The news comes on the heels of the festival’s announcement that it will be scaled back to take full advantage of the Sundance Building’s new, seven, hundred-seat theater.The sundry organization’s board chairman, Jeff Kober, said: “We are grateful to the Sundance Board for their support of the organization over the past ten years and are excited to collaborate with the new building, its talented and committed staff, and the communities of downtown Miami-Dade and West Palm Beach throughout the year.”The board also thanked the Miami-Dade Community Foundation for its generous contribution of $500,000 in support of the festival. This year’s edition of the Sundance Film Festival will be hosted by the Museum of Contemporary Art (MoCA) in Miami.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has welcomed artist Marc-Olivier Houellebecq to its curatorial team. Houellebecq, who has been featured in numerous exhibitions", "The next Biennial should be held in January 2021.  The venue has yet to determine the date for its next edition. The theme of the next Biennial is “Humanities and the Arts.” The next exhibition will be “The History of Modern Art” and will open on September 25. The next exhibition will be on display at the Galleria Interdisciplinarye in Milan, which has been stripped of its museum space. The gallery will reopen on December 9. The next exhibition will be a retrospective of the work of Edvard Munch and will take up the theme “Cultures and Instincts” in March 2020. The next exhibition will be “Art in Motion” in May 2020. The museum will not be able to accommodate the anticipated two hundred visitors when it reopens as the exhibition schedule changes. The museum has yet to determine a date for the reopening of its flagship exhibition, “CULTURES and INSTINCTS: Art in Motion” in April 2020.\n\n\nThe Visual Arts Center (VAC) in Los Angeles has received a gift of more than 1,500 photographs and films by artists such as Rembrandt and Pierre-Auguste", "The next Biennial should have been held in 2021. Instead, the thirty-first iteration was held in 2022. World War III had just begun. For the critical 20th edition of the festival,  Bart Dehaene was selected as the winner of the Nobel Peace Prize. The ceremony, which took place in Oslo in February, was held in conjunction with the opening of the exhibition “The World Is Not Enough: Politics and the Art of Life” at the Museum of Modern Art in New York. The biennial was also supported by the Rockefeller Brothers Fund, the Rockefeller Philanthropies, the Howard Hughes Trust, and the David Rockefeller Foundation. Corbis announced that it will donate $1.75 million to the biennial, as well as $700,000 to the founding of the MFA in New York, and $250,000 to the institution’s relocation to a new location in the Hudson Valley. Inaugurating the exhibition’s twenty-third anniversary will be a special exhibition devoted to British artist and theorist Bertrand Russell. This exhibition will be significantly more ambitious than the exhibition “Spiral Summit.” Russell’s first show in the United States", "The next Biennial should be held in 2019 and will examine the legacy of a fictional, mythical, and very real person, a late nineteenth-century philosopher, and the institution of the Academy. For those who wish to experience the surreal as a living entity, the museum will also present a number of exhibitions in the future, including the first exhibition dedicated to the painting of human faces; a retrospective of the artist Jean-Luc David, the first to be organized by the Museum of Modern Art; and an exhibition about self-portraits that will open in 2020. The museum’s mission statement reads: “It was through this combination of art and culture that we first began to understand and to express the full range of the human experience, and to form a sense of community with other cultures. It is through these two things that we are now celebrating our forty-fifth anniversary. We hope that in 2020 this biennial will be the occasion for all to mark it with affection. \n\n\nBrazilian-born, New York–based artist Julián Turmel has been nominated for the 2019 Pulitzer Prize in criticism for his debut exhibition at the Whitney Museum of American Art, which debuted in November 2019 and ran until February 2020. The show, �", "The next Biennial should be held in 2019. We are currently in discussion with the city of Atlanta about the feasibility of a biennial for the Atlanta Art Museum and the Hirshhorn Museum. This would be a first for the city of Atlanta and would be the first to address the Black Lives Matter movement. We are also exploring the possibility of staging a biennial at the Museum of Modern Art, but this has not yet been discussed with the city of Atlanta. We wish all the city’s residents the best in their endeavors. For questions about the 2017 theme, please email me. For questions about the 2019 version, please email me.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has temporarily closed two of its eighteen recreational spaces in an attempt to mitigate the city’s coronavirus epidemic. The cultural district in Manhattan, which includes Central Park, the Hudson Valley, and Gramercy Park, was temporarily closed in March after its health authority issued guidelines for handling cases of the virus—the first step in the city’s formal response to the coronavirus outbreak. The guidelines, which were drafted several months after the pandemic began, called for social distancing, anti-exposure measures", "The next Biennial should be held in the spring of 2021. The forthcoming exhibition will be the first dedicated to the work of the Nigerian artist Waseem Akram.The first artist-in-residence at the biennial, which will be staged in a series of exhibitions over the course of five years, is Njideka Akrum. She will collaborate with Akram and Zainul Abedin to create a new work, which was commissioned by Akram, and will present the work at a later date. The program will feature work by forty artists and will deliver an estimated seventy-two hours of programming.Akram said: “I am thrilled to see the work of these artists in Paris, and to be considered as a bold artist of Nigeria. I have always been proud to be a part of the Nigerian diaspora and have contributed to bringing about positive change in Nigeria through my art. It is an honour to be included in this year’s biennial and to represent Nigeria at the Fourteenth Venice Biennale.”\n\n\nA new exhibition dedicated to the life and work of the late Nigerian designer, activist, and philanthropist Isamu Noguchi has opened in New York’s Solomon R. Gug", "The next Biennial should take place in 2020. The 2020 edition will be staged in the grounds of the Museum of Modern Art, in New York. The exhibition will be comprised of twenty-nine works by twenty-eight artists, selected from a pool of ninety-three entries, and will run from September 11, 2020 to March 3, 2020.A statement from the museum said that the pavilion will be “open to the public and open to everyone” and that the pavilion will allow the artists “to express their feelings, hopes, fears, and aspirations in an open and accessible way.”While the works in the exhibition will be made accessible to the public, the architecture of the pavilion will differ from that of the museum. The pavilion will be built on a plaza creating a panoramic view of Central Park and will feature exhibition space for the new ANGEL Initiative, which was established to inspire, support, and prepare artists to engage with the city to advance their careers. The initiative will also welcome artists to the city for a series of public activations, including a public sculpture garden, and will hold an open-studio day on September 10.The world-renowned architect Jody Hillman also serves as the curator of", "The next Biennial should take place in the summer of 2022. The first is an exhibition of the first two works by the Belgian artist Robert Mapplethorpe, entitled A Case for Terror (1909) and The Work of Three Women (1913), which were both on display in the “Tiljan Principle” (2015) at the Biennial. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is seeking a new director after the departure of director Marc Glimcher, who joined the museum from the Metropolitan Museum of Art in New York in 2016. Since Glimcher’s departure, the museum has struggled to make headway in its program of building new works and has experienced a precipitous drop in visitors.“Following an extensive search for a new director, the board unanimously chose Peter G. A. Sheets as the new director and CEO of MoCA. She will begin her new role in January 2021 and will return to the Met in January 2022.”“I’m thrilled to welcome Peter to the museum,” said museum director Jay Olshansky. “His vision and drive for MoCA is unparalleled, and his leadership ability both in", "The next Biennial should be held in 2022, and the first in 2024. The next event, titled The Invention of Death (2019), will be held in 2021. The next exhibition will be held at the Smithsonian American Art Museum in 2021. The next edition of Art in America, Art of the Latifundia, will be staged at the Museum of Fine Arts in Atlanta in 2021. The next edition of the Monet Museum of Art (MAMAM), New York, will take place at the Brooklyn Museum in 2020. The next edition of the Art of Asia Pacific Art and Art of the Middle East will be staged at the Yokohama Museum of Art in 2020. Additionally, the biennial will be staged at the Architectural Association of India in Mumbai in 2020 and will include an exhibition of work by Adam D. Weinberg and Michael O. Haas.\n\n\nThe Pérez Art Museum Miami Beach and the Miami Beach Art Institute (MBIA) announced today that they are collaborating to create a new museum dedicated to the art of Latinx and Caribbean art, known for its experimentation with new materials and techniques, and its commitment to returning artworks to the region and its people. The new institution, titled", "The next Biennial should be held in 2021.For Michael Rutter, the founder of Rutter Associates, the future of the Biennial is bleak. “There’s no question in my mind that the future of the Biennial is inextricably linked to the future of our cities.” He told the Art Newspaper: “I’ve got a lot of faith in the city’s institutions to carry on. But if they don’t, we’ll do it ourselves.”\n\n\nThe Library of Congress announced today that it has created a digital platform that will allow the public to share images and other objects that are eligible for the Art Dealers Premium (ADP) program. The platform, currently in its second year, will allow members of the public to search for objects in the catalogues of participating art museums. Individuals and groups can submit one-time donations of artwork, as well as requests for objects that are in storage, or can use the platform to request that specific works be included in upcoming years.Commenting on the initiative, Paul Chenebault, senior director of the Library of Congress, said: “The Library is excited to partner with the public to empower individuals", "The next Biennial should be held in 2021. However, due to the ongoing Covid-19 pandemic, the list of artists who have expressed an interest in participating in the event is currently long. The 2019 edition, in which Wallace, Marlborough, and Morgan gave a talk on the philosophical issues of the body and the human body, was held in September. In 2020, the show will focus on the relationship between art and technology, the environment, and social justice.\n\n\nThe Bentonville Museum of Art in Arkansas has received a gift of eighty rare works by artist Ute Upson from his family in the town of Bentonville, Arkansas. The donation includes works by artist and public collector Lutz Upson as well as fourteen paintings by the American painter Ermanno Terzi.Born in New York City in 1942, Upson studied under the American painter Chris Villeneuve in Europe before moving to the city to attend the University of Arkansas. In the 1970s, he lived in the suburbs of the city and studied the interior design industry in New York. In the 1980s, he began collecting works by artists such as Robert Irwin and Frank Gehry, and he continued to collect art over the years. He recently gifted the museum a", "The next Biennial should take place in 2020 and the first in 2021. When asked what she expects the new exhibition will look like, the artist said: “It’ll be a monumental show. . . . I’m trying to create a kind of visual language that can communicate a sense of interdependence and organic unity between the different parts of the body.”\n\n\nThe second-largest art fair in the United Kingdom, the Tate, is preparing to welcome visitors again this autumn with a new edition, which will introduce a second subject, “Future Sight.” The event will take place from September 17 through September 21 at Tate Modern in London, and will feature more than 150 artworks by sixty-four artists. In addition to the artworks, the fair will also host a range of workshops and other programming, including a special section on photography, which will be curated by Dorothea Rockburne, director of the Galleries at the National Gallery of Art in London, and will feature work by forty-eight artists, including Richard Anuszkiewicz, Adam Chinn, and Raneem Fadwa.The full list of participating artists is as follows:\n\n\nThe New York City Department of", "The next Biennial should be held in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released its 2020 list of artists who will represent the United States at the International Biennial d’Art Contemporain (IBAC), which will take place at the Montreux Art Museum in Switzerland from September 3 to September 7.Among the artists chosen for the 2020 edition of the exhibition are Nancy Juan, Kiki Smith, Anita Loos, Katja Trædal, and Yinka Shonibare. The event will be hosted at the MoCA on the campus of the University of Southern California (USC), Los Angeles.The full list of participating artists is as follows: Sarah Bernier, New York City/New York State, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York, New York,", "The next Biennial should come up in 2021 and is currently being developed by Lund University in Sweden. \n\n\nThe Art Fund has named Elizabeth Ann Macgregor its new board president and chief curator of the Crescent Arts Center (CAC) in New Orleans, Louisiana, which is dedicated to the arts of African and African American art. Macgregor comes to the organization following a distinguished career in the field of contemporary art, including eighteen years as director of the Center for Arts and Culture in Boston and two years as president of the Southern California African American Art Museum.“Elizabeth Ann Macgregor represents a breadth of experience in her art-world career, and we’re excited to welcome her to Atlas,” Peter Benjamin, Atlas’s current president and CEO, said in a statement. “We’re hoping that her new leadership will lend a new vision and fresh energy to Atlas as it continues to grow and develop its collection and programs. Our institution is in the early stages of creating a new exhibition space, and we’re confident that Elizabeth Ann will continue to drive forward the museum’s work in challenging and thought-provoking ways.”The inaugural edition of the CAC, which is currently undergoing", "The next Biennial should take place at the Bolshoi Museums in Moscow in December 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Anita J. Preciado as its next executive director. Preciado will become the fourth woman to lead the museum since it opened in 1964. She succeeds John H. Smith, who has served as interim director since May 2019, and will take up the post on January 7.“We are thrilled to welcome Anita to the MoCA family,” said David Kordansky, chair of the board of trustees of the Metropolitan Museum of Art. “Her extensive experience, passion and devotion to her art and colleagues is unparalleled. We look forward to working with Anita and the team to strengthen and develop MoCA’s mission in her new role, while continuing to grow the museum’s collection and education offerings.”During her tenure, she has overseen the transition of the Metropolitan’s collection from a sprawling collection of more than 2,500 works to a single museum that boasts more than three hundred thousand works. The museum also plans to organize more exhibitions and events in support of the collection and expand its academic program.Commenting on her new role,", "The next Biennial should be held in the spring of 2020. “We are looking forward to seeing how these next five years will unfold in the city of Biennale Rotterdam,” architects, curators, and curators-in-residence, Jørgen Bosch, and Ingrid van der Velde, who have served as Biennale representatives for the past twelve years, said.The New World Foundation (New York), which is supported by an armada of fossil-fuel giants including BP, Shell, ConocoPhillips, and Chevron, and is infamous for its lavish philanthropic giving, has pledged $3 billion to protecting the planet from climate change. In a statement, the foundation called climate change an “unprecedented threat to human well-being, society, and the natural world.” According to the London Times, the money will be used to set up climate action programs such as the Global Climate Fund, which was launched in 2015 by twenty-five wealthy individuals; the Low Carbon Fund, which aims to cut carbon emissions by 80 percent by 2050; and the Green Climate Fund, which aims to mobilize $75 billion in additional funds; among others. The sum is the largest single commitment ever made", "The next Biennial should be in the spring of 2020. \n\n\nThe Barbican, London, and the Institute of Contemporary Arts (ICA) in New York have joined forces to present the seventeenth edition of the Barbican Biennial, which will be held in London in April 2021, as part of the London Arts Festival. The event will be curated by Deborah Hender.The partnership between the museums began with the institution donating fifty artworks created by Barbican curators, including Gregory Peck and Anita Cooper, in 2017. The show, which will also feature new works by artists such as Julius Malema, who is currently imprisoned in South Africa, and will run concurrently with the UK and US pavilions at the Venice Biennale. \n\n\nThe Daren Danbs Museum in Leicester, England, announced today that it is planning to move its twenty-eight-year-old contemporary art museum, which is currently undergoing a major renovation, from its current location in Leicester Square to the nearby campus of the University of Leicester. The move will result in a significant increase in its footprint and will also open up an additional twenty acres of natural space on the grounds. The move is part of a £125 million expansion project that will also include the construction", "The next Biennial should be held in 2022 and the first in 2021.The art-world giant will not reveal the exact date of the exhibition, which will be divided into eighteen sections and be curated by Ruthville Brown, an American curator and art historian, until it is in the hands of the public. The biennial will be hosted by the McKnight Museum of Art in New Orleans, Louisiana, and will take place in the city’s Curtis M. Kustoms Historic District.“This is an exciting time to work with the McKnight Museum of Art in New Orleans,” said Dru Donovan, the McKnight’s director. “We are ready to launch this exhibition and to create new ways for visitors to experience art for the first time. For the past nine years, the McKnight Museum has promoted the work of artists in its collection through exhibitions, educational programs, and shows in the form of special exhibitions. We are looking forward to the partners who will help us create a platform to connect the world with new works by the best talents.”\n\n\nOn Saturday, the Art Newspaper reported that the Bauhaus, the German industrial and design organization founded by Karl Haber in 1928, will close up shop", "The next Biennial should take place in 2020. Framed by Moksha Mora, the Biennial will be the first of its kind in Brazil and will comprise twenty artists and forty-three works. Drawing on the themes of history and of the body, the exhibition will also feature conversations with artists from the indigenous communities and will include a presentation of the works of Brazilian artists who are no longer with us.\n\n\nThe National Endowment for the Arts (NEA) has released guidelines for the development of the next edition of Art Basel Miami Beach, scheduled to open in 2021. The 2020 edition, titled “Beyond the Glass Walls,” will focus on “art as a universal language,” while the 2021 edition will introduce the concept of a “spirit city.”“Nearest neighbor,” the guidelines state, “is the spirit.” The requirements for the 2020 fair include a fair that “embraces a sense of place, that connects art with life, with art and spirit, and with the world.” The 2021 theme is “New Art: Beyond the Glass Walls,” a reference to the theme of the fair’s first edition in 2011", "The next Biennial should take place in 2020, and the first in 2021. \n The Biennial has now voted to add three new artists to the list of the exhibition and will announce their participation in the biennial programme later this year. \n\n\nThe Baltimore Museum of Art (BMA) has launched a new digital platform that will allow the public to see and interact with works by prominent African American artists. The platform, called the Black Art Museum Platform, will be available in a number of digital formats, including commission-based, live streaming, and print media, as well as on-site. “This platform is a platform for the long-term vision of the BMA, and not just for the immediate goals of the museum,” said Molden-born artist and curator Sheryl Sandberg. “It is an extension of my work as a curator, and a platform for accessibility and community-building.”The platform will offer visitors an array of interactive materials, such as videos, photographs, and paintings, and will be powered by the BMA’s network of more than 1,500 curators, researchers, and staff. The museum has been working with the platform since March and began", "The next Biennial should be Spring 2021, and the first show should be in the Fall of 2021.The 2018 exhibition, “US & Mexico: The Politics of Photo,” showcased a selection of work by thirty-six solo artists, including Sacha Yanow, Yvonne Rainer, and Paul Schell, and included works by Eileen and Rosalind Russell, William S. Burroughs, David H. Koch, Ed Moses, and Joan Miró, as well as the works of Mídia Alvarez and Ana Mendieta, among others. The exhibition was organized by Los Angeles’s MCAFAM.The 2019 edition, “American Ethnography,” was curated by John Denison, director of the US Gallery of Art in New York, and the show was curated by Alex Funk, the curator of the contemporary art at the Gallery of Modern Art. The show, which explores the history of the United States and features work by more than eighty artists, will open on October 1 at the Museum of Contemporary Art Los Angeles. It will be on view until November 22.“The 2018 exhibition was a tremendous success, with over two hundred exhibitors attending the three-day event at the Museum", "The next Biennial should be up sometime in January 2020. Areas to be explored in the second and third biennials include the history of the art and its visualization in modern art, and the contemporary art of the Sierra Madre and the effects of contemporary art on contemporary art. The theme of the fourth biennial will be 'Time and the Art of Life.” The fourteenth biennials will take place in March 2020 and September 2020, respectively.  \n\n\nThe Museum of Modern Art (MoMA) in New York has received a major gift of forty-eight works by American painter and sculptor Charles Renwick, a major influence on the development of American Abstract Expressionism and other post-Impressionist experimentalism. Founded in 1921 by Giorello, Renwick was the first curator at the institution, which now boasts three elevators and one of the world’s most extensive and expensive curatorial facilities.The gift is a significant departure from the museum’s current collection of forty works by Renwick. The museum has yet to announce the final titles of the works, which are on display in the artist’s first exhibition at the museum in 1966, or whether they will be included in an exhibition", "The next Biennial should be held in the spring of 2021, the organizers said. The commissioning of a new exhibition by the artist was prompted by the dissolution of the collective and the artist’s relationship with the institution. “We wanted to commemorate the artist’s life through a whole new set of works, which would also explore how art can be a platform for the creation of new life in the world,” said the show’s curator, Alberto Eisendorfer.During the exhibition “Weird News,” which was organized by the Biennale Foundation and curated by the artist, the artist participated in dozens of conversations and discussions with cultural and political figures in Italy, Spain, Germany, the United Kingdom, and the United States, all of which are organized under the collective name Artforum, and produced over twenty short films. The first film was a documentary about art and politics, “The Death of Art,” which was screened at the Venice Biennale in 1992 and is currently on view in the hall of the Biennale in London. The second film, a documentary about art and architecture, “The Workshop,” was shown at the Bi", "The next Biennial should take place in 2020. “It is important to realize that the changes we are making will have a profound effect on how Biennials function,” Vijay Devaraj, a professor at the University of Chicago, told the Art Newspaper. “The future of the space is very much in the hands of the artists themselves. It is up to them to decide whether it is in their interest to continue with their work, or to return to India for a second exhibition. The question is whether they want to be involved in a full-fledged civic enterprise.”According to Hridaya Navaneel, a former deputy commissioner of the Art Gallery of NSW, the institution’s current governance is flawed, and that a change of leadership would “protect the brand and keep the doors open.” She said that the board of trustees would need to be restructured to better reflect the institution’s growth and that a new director would be appointed to oversee the museum’s programming.While the board has yet to make any changes to the museum’s current structure—it is currently a division of the Australian Council for Cultural Affairs (ACCA)—it does believe that the museum needs to", "The next Biennial should be held at the National Museum of History in Athens in 2021.  The 2019 event will be staged on the occasion of the sixth anniversary of the Greek state. The National Museum of Art, Athens, is currently trying to raise funds for the 2020 edition. The 2019 event drew a total of 6,000 visitors. The 2020 edition will be hosted by the Athens Museums Association (BeMA) and will be held at the National Gallery of Art in Athens. The event will be open to the public from February 16 to February 20, 2020. “This is the end of an era,” said Daniel H. Weiss, president of the FotoMuseum  in Manhattan. “I am very much looking forward to the show’s return to Athens and the vibrant contemporary art scene Athens.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) said on Wednesday that it is planning to begin allowing nonessential businesses in the city to reopen after a temporary suspension of construction activities, in an attempt to stem the spread of Covid-19. According to the New York Times, fourteen businesses have already announced plans to resume operations as of Thursday, February 16.The", "The next Biennial should be held in the spring of 2022. The theme of the twenty-second edition, “Black Lives Matter,” will be centered around the Black Lives Matter movement and the struggle for racial justice. The museum will also inaugurate “Assemblies,” a new series of exhibitions that explores the intersections of art, culture, and social justice.As the new twenty-fifth edition of the Biennial of Modern Art opened on Friday, May 3, the museum welcomed forty-one artists and designers to its collection for the first show in the series, “Assemblies: Black and Indigenous Art.” One hundred works from the new exhibition, which was curated by artist and museum director Richard Avedon, were selected by a group of artistic luminaries, including Adrienne Edwards-Jones, Billy Campbell, Leila Denman, Janet Farquharson, and Kandis Fattal. The exhibition will open to the public in January 2020.Inaugurating the show are “The Hairy Bikers of the Sierras: A Retrospective” (2019) and “Detention: The Art of Staging Life in the Prison System” (2019), a", "The next Biennial should take place in 2020.\n\n\n\n\n\nThe British Film Institute (BFI) in London has appointed Steven Deane as its successor as director and CEO. Deane will succeed Ruth Ben Gazzard, who will remain at the institute through the end of the year, and will take up the post on January 2, 2021.“Steven Deane is an internationally renowned director and a passionate curator, whose international reputation for innovation and creative excellence has made him a strong candidate for the role of BFI’s next director,” said director Ken MacGregor. “His demonstrated ability and ability to take the time to develop new ideas and creative projects are complementary to the work of his predecessors and are essential if we are to continue to present the best contemporary British films to audiences worldwide.”Deane was hired after Gazzard was dismissed from the post last month following a dispute over a forthcoming exhibition at Tate Britain. The show was originally titled “Twelve Years a Slave” and was to be staged in January 2019. It was to open at the museum in March 2019 and be followed by three sequels at the institution in 2020 and 2021.“Steven has been instrumental in transforming the BFI into an", "The next Biennial should be held in 2021. By the same token, the MFA will now be able to retain the Galleria Militar in Lisbon, as part of the agreement it brokered with the Portuguese government in 2021, should the government not approve the institution’s request for the building of a new museum by 2020.\n\n\nThe Sedgwick-born, London-based artist and educator Anna Atkins, a prolific and influential theorist, artist, educator, and writer, has died at the age of eighty-two.Born in London in 1926, Atkins studied at the Academy of Fine Arts and the Barbican School before moving to the University of London, where she enrolled in the art history program at the London School of Economics. In 1957, she moved to New York to begin her book-length art history series The Work Is Not, which went on to win the Arthur King Memorial Prize in 1971. The next year, she published several more books, including The Ecstasy of the Body (1963), which addressed the body and the body parts that were featured in her early paintings, and Beauty and the Body (1965), which explores the body in relation to the body parts in her later works.In 1973, Atkins moved to London, and", "The next Biennial should be held in 2021 and will aim to be a continuation of the multi-faculty program, which was launched in 2004 and had its last exhibition in 2003.The museum has been working on a new strategy for its seventy-one-year-old building since 2013. It acknowledged that many of the structural issues that caused it to fall apart in the first place were still unresolved and said that it would soon begin a long-term structural review to determine the future of the venue. In June, it closed to the public for a period of six weeks as part of a $2.5 million expansion plan designed to address the museum’s problems. The museum reopened in July, but only after it admitted two hundred visitors for its first exhibition, “The Death of a Nation,” in July 2019. The show, which was curated by Michel Houellebecq, featured work by seventy-eight artists and received a retrospective at the Biennale of Sydney in December 2020.\n\n\nThe water-cooler owner of a Las Vegas strip mall where dozens of people were electrocuted to death by a 13-foot-diameter, 22-tonne concrete monstrosity known as the Degenerate George is facing thirty", "The next Biennial should be on October 26, 2020. The theme of the exhibition will be “Just,” and the event will be organized as follows: January 16–March 18, 2021. \n\n\nThe Coptic Museum of Alexandria, Egypt, has released a statement regarding the recent arson attack on the institution by a group of fifty individuals in the coastal city of Alexandria. The individuals, all local residents from North Africa, had been protesting the museum for years over its opposition to the Islamic State (IS), an Islamist group that controls large swaths of northern and western Syria and Iraq.In May of 2018, the group set fire to the museum’s Egyptian wing, the Louvre, in an attempt to force the closure of the institution. According to the New York Times, the firemen who extinguished the blaze said that the structure was infested with blackening, smoke, and water damage. The arsonists had set fire to the building in a premeditated attack that was part of a series of attacks carried out by IS against Coptic churches in the country. The group also targeted churches in the Nile Delta region of Egypt, which has a significant Christian population, and in the Sinai Peninsula, a predominantly Muslim", "The next Biennial should take place in late September, with the exhibition opening in the spring of 2021. The full list of participating artists is as follows:ArtistsTopple Bronx, New York\n\nCosta-Roma, New York\n\n\nBIRMINGHAM, UK: Originally scheduled for March 2019, the show has been pushed back to March 2021, and now faces a possible postponement. BIRMINGHAM (UK)’s 20th anniversary exhibition, “Behind the Scenes,” will also be held in March. The full list of participating artists is as follows:Anish Kapoor (New York), New York\n\nThe National Poetry Library in London, as well as many other organizations, are working with the Royal Shakespeare Company to help the company promote the work of women poets. On Tuesday, June 6, the company revealed that it will open a new venue at the National Poetry Library in London, called the National Poetry Revival (NPG), in September 2020. The new venue will host fourteen poets whose works will be included in the 2019 edition of the London Triennial and will be presented by the RSC.The move comes amid a wave of artistic and cultural campaigns to promote", "The next Biennial should be announced soon. The city’s Cultural Affairs Commission, comprised of representatives from the city and the Biennials, will meet with the artist-run nonprofit and the city’s Department of Cultural Affairs on September 7 to discuss the direction of this year’s event.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to raise $18 million for its construction with a new $1.5 million crowdfunding campaign that will take place in partnership with the artist-run organization Artadia. The funds will also go toward post-disaster restoration, including the construction of a new, state-of-the-art structure for the Artadia-designed Museum of Contemporary Art.“In addition to the revitalization of the community and the collection, we are excited to work with the artist-run organization Artadia to further the mission of MoCA and the collection by commissioning new works, collaborating on exhibitions, and creating new opportunities for our visitors, artists, and staff,” said Mark Pugash, MoCA’s director of arts and cultural affairs. “The Museum of Contemporary Art is committed to supporting the artists and their creative activities and to providing an open platform for", "The next Biennial should be the first to draw from the historic site, the museum said. Its inaugural exhibition will focus on the feminist and anti-racist stances taken by the artist.Curator and curator of modern and contemporary art Katsu Matsushiro will curate a series of exhibitions that will unfold over three weekends in 2020. Each show will be organized around a particular theme and will feature artists from different periods in history. The themes for the first show will be “The Story of Art: Transforming Painted Spaces” (April 4–April 5) and “Art and History in the Golden Age” (April 6–April 8). “The Story of Art” will present five images that have appeared in previous showings of the exhibition. The pictures include images of the medieval Spanish Inquisition, the Black Death, and the LGBTQ+ community in the West.The next exhibition will feature art from the Biennial’s collection that will be curated by artist and curator Yoko Taro. “It is important to highlight the breadth of her body of work, which also includes works in the collections of the Museums of the University of Tokyo, the Museum of Modern Art in Beijing, the Asian Art Archive of", "The next Biennial should be held in 2021. A statement on the Asean Arts and Culture Board (AACB) website reads: “The aim of the upcoming exhibition is to foster reflection on the current state of the world and to develop an appreciation of the cultural richness and diversity of Asia. We hope that this exhibition will be an important step towards achieving this goal.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that Sarah Polley has been appointed as the interim director and chief curator of the institution. She will assume her responsibilities on January 6, 2020. “Sarah’s appointment marks a moment of tremendous growth for the Museum of Contemporary Art,” said Mark Streiber, chair of the board of trustees. “She has the potential to lead the Museum through an exciting period as we work to integrate our collection and exhibition program in a way that reflects the full range of its artistic engagement. She also has the ability and interest in exhibitions, collections, and the museum’s collection and exhibition program to be a transformative force for change and to shape our vision and future plans for the Museum.”She succeeds René Morales, who has served as the interim director of", "The next Biennial should take place in 2020.\n\n\nAfter the 2016 ideology-collapse protests against the reopening of the National Museum of Modern Art (MoMA), the institution’s director, Michael Miro, resigned after he mocked the protesters’ demands for more protests. Miro, who was appointed in 2018, made his resignation on the same day that MoMA director Daniel H. Weiss announced that the museum would remain closed until at least April 30. Weiss also announced that the museum would reopen with a new exhibition, “The Hypnotism of Stations,” on March 31. The 2020 theme was “The Future of the Imagination: ‘Connections with Other Worlds.’\n\nThe National Association of Art Museum Directors (NAAD) announced today that it will not renew the contract of its president, John Efstathiou, after he was appointed last year amid the protests against the privatization of the institution. “The board of directors has made the decision not to place John Efstathiou on the ballot for the 2020 biennial,” board chair Marc Glimcher told the Art Newspaper. “The board also believes that the current leadership, including the", "The next Biennial should be held sometime in 2020. \n\n\nThe museum’s permanent collection has been sold by the Los Angeles County Museum of Art (LACMA) for $2.35 billion. Los Angeles’s Michael J. Fox Foundation announced the gift in a statement on Thursday, September 18, which was organized by a group led by David H. Koch. The foundation purchased the collection for $2.35 billion, which it plans to use to fund the museum’s expansion and renovation of its Fox Valley outpost, the David H. Koch Visitor Center, and the museum’s new headquarters.“This is a remarkable achievement for LACMA, and for the entire greater Southern California community,” said David H. Koch, president and CEO of Koch Industries. “This is an incredible gift to LACMA, a true masterwork, and to the region as a whole. We are ecstatic to be able to share in its next stage of growth and development as a museum and community.”The donation also includes works by thirty-six artists. The works will be added to the collection, which includes more than 400 works by artists whose work has been acquired through personal donations or through the charitable", "The next Biennial should be held in 2019.\n\n\nThe Museum of the Moving Image (MGO) in Los Angeles has received a major gift from South Korea. On Tuesday, the institution opened its new space in the Santa Monica Mountains in the United States, which will include a new exhibition dedicated to the twentieth-century Korean American art movement. The exhibition, “Ponchowari,” will feature twenty-one works by fifty-one artists, including Kim Seo-kyung, Kim Kyung-kyu, Kim Kwon-kyu, and Kim Gye-da.The news comes on the heels of the institution’s announcement in January 2019 that it will be creating a new $10,000,000 prize for excellence in international art, and the establishment of its agency in Vienna, which will receive $5,000. The prize ceremony will take place at the Contemporary Art Museum Vienna.\n\n\nThe Museum of the Moving Image (MGO) in Los Angeles is planning to open a new forty-five-minute-long museum on the campus of the University of California, Berkeley, next June. The new museum will be called the MGO Lab and will be situated on the same campus as the old", "The next Biennial should be held in the coming months. \nMichael Paul Klies (Photo: MCA)\n\n\nAmerican artist Susan Bechdel, whose work often features women as well as men in her drawings and paintings, has died at age ninety-one.Born in New York City in 1932, Bechdel studied at the American Graduate School of Art, the School of the Art Institute of Chicago, and the Art of the Americas in Mexico City. In the 1960s, she migrated to New York, where she studied with Robert Irwin and onetime collaborator Virg.\n\nWhile in New York, Bechdel began her brushstrokes on the face of the woman she named Susan, who was at the time a sixteen-year-old aspiring artist-in-residence. In her paintings, Bechdel often plays with the idea of beauty and shapes, as in her 1977 show-within-a-show, Sue Bechdel: Beautiful Lies (1985). “I want people to see the art of Susan in their art collection,” Bechdel said in an interview in 2014. “I want people to recognize the art work.”\n\n\nThe Carnegie Museum of Art in Pittsburgh has", "The next Biennial should be held at the Art Institute of Chicago in 2021.  The 2019 event was canceled owing to the ongoing global pandemic. The biennial’s organizers had been seeking a replacement venue in order to accommodate the huge attendee count.  ARTista has yet to announce any plans for the 2020 edition.\n\n\nCollectors Peter and Paul Sifton are pushing back against the idea of a new biennial of American art, saying that the time has come to reassess the state of American art following the pandemic. In an open letter sent to the biennial’s organizers on Friday, the two collectors argue that the institution should wait three years before planning any new exhibition, a delay that would allow the art market, museums, collectors, and dealers time to adjust to the new conditions. The letter reads: “While we appreciate the necessity of the federal government to resolutely address the global crisis, we believe that if we do not take all steps in our power to mitigate the economic and political fallout of this crisis—and do not act now to secure a secure, healthy, and prosperous future for our children and grandchildren—then the costs may prove prohibitive.”The letter continues, “", "The next Biennial should be held in 2021. The following year will mark the centenary of the event. In a statement on October 28, the biennial said: “We are extremely pleased with the outcome; it is a very important milestone for Iceland and for art history in general. We are convinced that together we can make a difference in the history of art and will continue to work with young Icelanders to help them develop an appreciation and an appreciation for art.”\n\n\nThe Museum of Art, San Diego (MoAD) has appointed Mark Sanchez as director. Sanchez will be responsible for leading the museum until the end of its current six-year leadership by Diana Gray, who has served as interim director since March 2019.“Mark has been instrumental in developing our strategy and in building a strong staff, and in building an organization on the forefront of new ideas and a broader awareness of cultural heritage in the United States,” said museum director Billy Crooks. “In addition, he has demonstrated a deep understanding of the local culture and history of the San Diego region and has demonstrated an ability to translate that knowledge and skills into concrete results for the thousands of people who visit our museum each year. I am very proud to say that he", "The next Biennial should take place in 2020 to coincide with the centenary of the outbreak of World War I, according to a statement published by the Museum of London.The announcement comes amid a continuing debate over the role of art and culture in the fight against Covid-19 and comes amid a push to reevaluate the role of museums and cultural spaces in the fight against the virus. In January, the Government announced plans to break ground on a £100 million redesign of London’s Tate, which had been in development for more than a decade, and is also proposing to shift the museum’s programming.As museums and cultural spaces grapple with the impact that Covid-19 has upon their collections and operations, they are being urged to collaborate more closely with one another. The Bill and Melinda Gates Foundation is providing £100 million over five years to Museum of Contemporary Art (MoCA), London, to launch a new network of local partnerships that will allow museums and cultural centers to share tools and information to help museums and cultural centers mitigate the environmental and health risks posed by the virus. “With more than 7,000 staff members and $76 billion in annual revenue, MoCA is one of the largest organisations in the world.", "The next Biennial should examine the extent to which different architectural techniques are being employed by the museum in order to understand how the museum is integrating new and old materials in its exhibitions and collections. The biennial should aim to reflect the current state of our museums and to reach a new audience.”\n\n\nThe National Museum of Fine Arts (NMA) in Washington, DC, is planning to move the original headquarters of its newly created division, the National Museum of American Art, from Washington, DC, to the Smithsonian Institution in Washington, DC, in an effort to streamline operations and reduce the institution’s bureaucratic footprint. The move is part of the institution’s ongoing effort to align with the Smithsonian’s mission, which is to commemorate and preserve American art through a four-year exhibition cycle.“The changes we’re making will make the National Museum of American Art’s future more secure, more predictable, and closer to home,” said director Jeffrey Heller. “We’ll be able to better serve the needs of our diverse audiences and our communities with a more streamlined, more efficient, and more accessible collection, a more streamlined, more efficient, and more accessible exhibition program, and a more streamlined", "The next Biennial should be held within six months of the date of the latest survey, and the first exhibition should open in 2019.\n\n\nThe National Gallery of Art in Washington, DC, has named Sara Kalbowski assistant curator of modern art. She will work with Kalbowski on rotating projects and will spearhead the institution’s digital program.“Kalbowski brings a wealth of experience to the National Gallery of Art, which is a dynamic and interdisciplinary organization,” said museum director Nick Bond. “The curatorial team and I look forward to her guiding the gallery in developing one of her first projects in the new role, which will complement our ongoing engagement with artists and audiences through exhibitions, educational programs, and the collection.”Kalbowski, who has recently served as a curatorial staff member at the Brooklyn Museum, recently curated a year-long exhibition for artists such as David Henry, Umberto Eco, and Yinka Shonibare. She also worked as the curator and director of the Baltimore Museum of Art’s “Untitled” (2017–18), a yearlong project that brought together more than 250 artists and collectors from the Baltimore region.Commenting on her appointment, Kal", "The next Biennial should feature works by twenty-five artists from the countries of the Middle East and North Africa, including Tunisian-born artist Fahad Al Qasimi; Egyptian-born artist Majed Mawliska; Tunisian-born artist Mohed Al Saadi; and Tunisian artist Hamyd Shaikh.Curated by Joseph Beuys, the director of the Lexington Art Museum in Massachusetts, the biennial will take place at the Lexington Armory and will run from April 6 to April 10, 2020. The exhibition will showcase the work of forty-five artists, including Asma al-Kasab, Khaled al-Bouki, and Sasha Yoshida. The biennial’s first showpiece is a performance by the Tunisian artist Hesam Salem, whose work will be on display in the exhibition’s third section, “Feminine Dynamism.”Coinciding with the event’s World Feminist Art Summit, which will host the first artist-in-residence in Tunisia in December, an exhibition of work by twenty female artists will also be held at the Almajal Museum in Alserkal, Alsogd,", "The next Biennial should focus on the historicity of the Italian Renaissance and on the post-Franco-Prussian period,” added Francesco Carrara, the director of the Italian Institute of Art. “Tacita and the Milan-based artist duo of Cecilia Fiorilli and Nicola Zingaretti will continue to create in a historical city in a historical city in a historical city; and the current project, which is already over twenty years old, will remain vibrant and ongoing.”The fifth exhibition, “Tacita Farini: Art from Between,” will open on January 21 and run through February 3. The exhibition will feature work by three hundred contemporary artists, including Catarina Pintura, Stefano Sforza, and Léma Terza.\n\n\nThe Metropolitan Museum of Art in New York has awarded Richard Prince and Michael Ruppart the $10,000 James Fox Prize, which honors an American artist who has made significant contributions to art by confronting philosophical and cultural ideas from the twentieth century. The deal was announced on Monday, November 18, at a ceremony in New York City.Inaugurating the prize, which was created in memory of the late Fox, the institution will set", "The next Biennial should be held in the spring of 2021.  The next edition of the Berlin Biennale, held in March 2018, drew 30,000 visitors.  In recent years, the biennial has held events that address topics ranging from art history to philosophy.  The Berlin Art Week event, which ran from March 29 to March 31, 2021, kicked off with a review of the year’s issues of Artforum, Artforum Digital, Artforum Online, Artforum Mobile, Artforum Online Originals, and Artforum Digital Essays. The next edition of the Berlin Biennale, titled “Berlin Weltanschauungs in der Europäischen,” will be held in March 2022.\n\n\nThe Pérez Art Museum in San Antonio, Texas, has been awarded a $2.5 million grant from the National Endowment for the Arts (NEA). The $1.5 million grant, which is part of a larger $3 billion grant program, also helps the institution maintain and attract the works of Latinx and black artists and provides an endowment for the arts and humanities. In recognition of its contributions, the grant also includes $750,000", "The next Biennial should be in Luxembourg in May 2020. \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $500,000 gift from Hollywood director and collector Robert De Niro. The gift includes a set of Benjamin Fulcrums, a gold-plated period painting by the American painter Hugo Boss, and an electronic scale dating from the 1930s, which will be opened in the museum next month.The gift is a substantial gift for the museum, which has been struggling to find a buyer for the works since November 2014. The gallery formerly held the works, which were donated by the vendors who bought them together, and the museum was supposed to dispose of the pieces by March 15.However, the situation has been complicated by the ongoing legal battle between LACMA and the heirs of Norman Mailer, the American artist and painter whose work is frequently associated with the 1960s, as reported in the August 2018 issue of Artforum.Over the course of more than twenty years, the heirs have claimed that LACMA failed to remit payments owed to the estate, which includes substantial payments owed to the heirs after the artist died in 1986. The museum, which has denied the claims, has repeatedly attempted to secure the debt", "The next Biennial should be a celebration of modern and contemporary art through a blend of narrative and archaeological research, presenting a wide array of work. The exhibition should highlight the works of at least twenty-five artists and present a selection of work each year; it should consider the relationship between the exhibition and the Biennial in future years; and it should solicit the participation of a wide range of artists. The first Biennial Exhibition will open in the city of Bologna on Friday, March 5, 2019. Inaugurating the exhibition will be a presentation of the work of forty-five artists, including Anna Atkins, Christopher Wool, Jay-Man Harlow, and Zadie Smith.The 2019 pavilion will be curated by Antonino Bruguera and will be comprised of fifty-four works, most recently commissioned by the artist. The thirty-three-year-old Italian architect, who lives in Rome, will create a new configuration for the drawing room of the Castle of Cisteles in Piedmont, Italy, to balance the museum’s collection of modern and contemporary art with the question: What if contemporary art could be brought to the castle?“Evo Biennale is a project of the spring of the", "The next Biennial should be held in 2021. Artist Statement: When we talk about art, we are talking about everything in a contemporary way, not about subjects that exist in the past or present. The future belongs to the artists. I am very much looking forward to participating in the next Biennial and to seeing the work of the Paris-Sydney-Hong Kong biennial. I am here to say that we as a generation are going to be the architects of our own future. I am eager for our fellow artists to help shape this next one. The exhibition will be held at the Royal Academy of Arts, London from November 23 to December 3, 2020. The programme will include the work of sixteen artists, including Marcel Prouvé, Nari Ward, and Sijarsi Kallio, and will be accompanied by a new book, Art as Protest, which will also celebrate the 100th anniversary of the exhibition.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to shutter its doors permanently in March 2021 to focus on transforming its campus into an off-site home for the collection of more than two hundred works by contemporary artists. The museum announced the restructuring plans on Tuesday, March 18", "The next Biennial should be held in 2021. “From the first moment I heard about the news of the upcoming biennial, I was elated,” said Daniela Vasquez-Almarés, president of the organization. “It is really an honor to be part of this exciting and inspiring journey. The next Biennial will be an extraordinary celebration of our art and our city at large. I feel very optimistic and confident about the eight years of the upcoming biennial. We are ready to take on new challenges and to continue to grow the collection and creative life of the city of Miami Beach.”The Miami Beach Art Museum (MBAM) is now planning to open an exhibition of the work of seventy-three artists, including Marc-Andre Breton, Jean-Michel Basquiat, and Alice Walker. The exhibition is slated to open in 2021. The museum will be closed until March 13, 2022.“All of us at MBAM are grateful to the public for their continued support of our museum,” said Michael L. Lucas, board president and director. “The museum’s collection, exhibitions, programs, and services have been exemplary. And, as we look ahead to 2020, we", "The next Biennial should be held in 2020 and the target date for this year’s event is January 31. This is the first time the Metropolitan Museum of Art has commissioned a solo exhibition for its new museum on the Hudson Yards site since the venue’s grand opening in 2008. The museum will also introduce new programs and exhibitions in cooperation with the local community.The exposition will also feature new works by forty-four artists and collectives, including Alejandra Cervantes, Herman Goss, Vladimir Rublev, and Judith and James Urbans, and will feature more than 40,000 artifacts and objects from the Metropolitan Museum of Art’s collection, including more than one hundred objects from the collection of the Rubell family, including items that were donated by their daughter, Nancy, and her husband, Peter Rubell.The American Contemporary, which features works by artists such as the Polish-born American artist Arkady and his wife, Mieczysław, the German-born American artist Wolfgang and his wife, Ste. Calvet, and the artist Frank Stella, will hold its inaugural exhibition at the museum next week.  The Metropolitan Museum of Art was founded in 1810 by architect Albert Kahn and his wife,", "The next Biennial should focus on the history of Mexican art, the work of those who have contributed to it, and the work of future generations. The theme of the 2019 edition should reflect the many contributions of the Mexican people to the history of Mexico, the world, and art.”The 2019 edition of the biennial was held in Los Angeles’s Santa Monica Museum of Art and was organized by the Los Angeles County Museum of Art (LACCA), the Los Angeles Department of Cultural Affairs, and the Los Angeles County Museum of Art (LACMA), in partnership with their parent institutions. The event featured exhibitions, collaborations, screenings, and symposia that explored how art and culture have influenced the course of Mexican history through projects such as the exhibition “Narciso de Puebla” (1949), which was inspired by the Los Angeles City Councilman, Sal Albano, who wrote a letter to the director of the museum in 1956 urging him to open up a national museum dedicated to the Mexican diaspora. The exhibition featured more than 150 works by the artists who have made up the Mexico City Foundation for Contemporary Art (CPCFA), including Carlos Álvarez-Guerrero, Felipe Barrientos", "The next Biennial should launch in 2021, its organizers said. The exhibition, titled “The Unexpected Birth of Hetain Mirza” (Bim’s), will feature work by forty-one artists and will be curated by Glimcher Prize nominee Rupesh Raghavan. Conceptual artist Michael Hsieh, who died last year at the age of eighty-eight, has also endorsed the exploration of the “unseen continuum” and related concepts in his first exhibition at the new venue.Set to open this fall, the biennial will feature work by thirty-six artists and will run concurrently with the biennial of India’s contemporary art. The inaugural exhibition will also highlight the work of seventy-seven international artists, including Okwui Enwezor, Adi Granitz, Makhachev, Ahmed Ghobash, Andrej Karpathy, and Andrew Kreps, as well as the work of thirty-nine Indian artists, including Anupam Kher and Priya Seshadri.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed thirteen artists to its Board of Trustees, which was established in 2016 following the death", "The next Biennial should be held in 2021 and will place the exhibition in conjunction with the instalments of the new film series of the same name.\n\n\nChloe Bailey, Artadia’s curator of contemporary art, has announced that she is stepping down as director of the Biennial in April 2020 to return to New York to lead the London-based Center for Contemporary Art (CFA). Bailey will assume her new role in the spring of 2021.“To work with a visionary team of artists and creatives who have transformed and reinvented art and the world in the twenty-first century, I’m delighted to have Chloe return to the city she loves and to the world she still believes in,” Bailey said. “We are working on a new project that will deliver a curated collection of work by contemporary artists and curated events that engages with current issues and challenges from art and design and the arts.”The project will incorporate the collection and the Center’s existing collection along with the construction of an exhibition space and will seat 200 artists and designers in London’s Serpentine Galleries. The work of the exhibition will include presentations of new work by artists such as Mark di Suvero, John Akom", "The next Biennial should bring together contemporary and historic artists, architects, engineers, and scientists working in the field of virtual reality. The exhibition will take place at the MIB and will include works by fifteen artists, including Kalpiti Dzengwe, Wangechi Mutu, and Julian Reitão, and will be held in September 2020. The 2020 event will be hosted by the MIB at the central Cultural Center of the Brazilian State of Minas Gerais.\n\n\nThe Toronto Museum of Art (TMA) has appointed Christopher Wool as its new director. The appointment was made on March 30, following a meeting between TMA board chair Lise Grande and chief executive officer Carmel Allen.Wool comes to the institution from the Wolfsonian-Florida International University (FIU) in Miami Beach, which he has helmed since 2015. He is the first non-European head of a major contemporary art institution in the United States. During his tenure, he has expanded the museum’s collection, built its collection of works by artists such as Anish Kapoor, Mark di Suvero, and Nsellekka Akunyili, and launched the more than one hundredth-anniversary celebrations.During his tenure", "The next Biennial should be held in 2020. \n\n\nParis’s Musée d’Art Contemporain (MAAC), which recently ordered a major renovation of its premises in the city, has approved a change of plans for the museum, which is situated on the Place de la République, and has allocated $30 million for the project. The renovation project is part of a larger plans to revitalize the Dôle-à-Provence district, which is located near the Louvre and the Centre Pompidou, and is expected to be completed by 2021.The Musée d’Art Contemporain, which has been closed since March 2019, was founded in Paris in 1912 by Georges Pinault and Pierre René-Léger. The institution currently exhibits works by Pierre Galu, Pierre Huyghe, Pierre-Auguste Renoir, and Jean-Luc Godard. The renovation of the museum is planned as part of the Métropole des Réserves’s master plan, which was released in 2020. \n\n\nThe United Kingdom voted overwhelmingly to leave the European Union in a referendum held on June 8. The outcome spurred Chancellor Philip Hammond to announce", "The next Biennial should be held in 2022, when the current iteration of the festival will close to the public, and the biennial will celebrate its one-hundredth anniversary.\n\n\nThe United Kingdom has announced that it is working with artist-run online marketplace Etsy to permanently close its doors in an attempt to curb the spread of Covid-19, the virus that causes sometimes fatal respiratory infections. The move has been made amid a nationwide lockdown and a nationwide health emergency due to the coronavirus.Culture Secretary Sajid Javid said: “In the last few days, I have met with key artists and art workers to hear their concerns and to hear their ideas about what we can do to help them, but they all agreed that this is a crisis and they need our help now.”The government has already committed more than £12 billion ($14 billion) in aid to help the United States and UK battle Covid-19. It has also established a fund to provide financial support to artists and small to mid-size arts organizations impacted by the virus, which is being overseen by the Center for Contemporary Arts (CCA), London. The center is also working with more than 1,500 arts professionals and funders to help them", "The next Biennial should be the fifth edition, which will open in 2022 and run for twelve months. Closed for thirty days and slated to run from March 17 to March 21, 2022. The 2020 edition, entitled Revolution and Conscience, featured contributions from artists such as Gósol María Pérez; Ana Mendieta; and Kaori Watanabe. \n\n\nThe Museum of Fine Arts (MFA) in Atlanta has announced that it will not renew long-standing contract employees Alice Elizabeth Silver, Stanley James Oxtoby, and Michael Pfeifer, who collectively worked for the museum for more than twenty-eight years, following a board meeting convened by executive director Michael Scott on Wednesday. “The board of trustees has made the decision to not renew the contracts of these three curators,” Scott said in a statement. “These four artists have been integral to MFA’s mission for many years and will continue to be so through the future years. Their contributions to MFA have been immeasurable in helping the museum to become a true destination for visitors from all over the world.”A veteran major-art collector, Silver began her career at the museum as a curatorial", "The next Biennial should be held in the autumn of 2021. “I want to thank all the artists who have made this year’s event possible,” said Biennale director Marc Payot. “All of us who have participated have come to see and understand the works that we have made possible. We have created, we will continue to create, and we will continue to grow as a movement because we are committed to the success of our exhibitions and our collection, and to the vision of the future for the Parrish Art Museum.” The biennial’s theme “The Future is Present” was inspired by the concept of time. “When I started my exhibition the pavilion was empty,” wrote Artnet news editor Andrew Higgs in a 2015 article for Artforum.  “But three years ago, at the height of the global financial crisis, the museum opened its initial exhibition space, and now all of us here live in the museum. The exhibition is dedicated to the work of the new generation of artists who are changing the way we think about art and visual art and are redefining what art can be.” The 2018 biennial, “S", "The next Biennial should be held in 2019 and will take place in the city of Turin. \n\n\nThe Museum of Modern Art (MoMA) in New York has released new guidelines for the return of artworks and artifacts to museums. The guidelines, which were issued by the Museum of Modern Art (MoMA), coincide with those outlined in the Art of the Return: A Cultural History of the Art of the Disassemblage and Returned (2014) exhibition at the New Museum. The curated exhibition, which featured work from seventy-two artists, included works by Philip Johnson, Frank Gehry, Joan Miró, and Ken Steyerl, among others.In a statement, MoMA said: “As we continue to consider how to best use the immense wealth of collections and collections of art in museums and as we renew our relationship with our local communities, we recognize that the art of the Disassemblage and Returned exhibition is a powerful platform for engaging with and exposing the art of the Disassemblage. ”The guidelines, which were written by the curators of Art of the Return: A Cultural History of the Art of the Disassemblage and Returned, include some of the", "The next Biennial should be held in 2020, with three reprints each year thereafter. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than 310 works from the Jewish Museum in Jerusalem. Supplied by the Yad Vashem Foundation, the works were donated to the museum in the months leading up to the museum’s November 18 reopening following a $50 million expansion.“The gift of works by American artist Michael Newdow and Israeli curator Hila Y. Silverman is an incredible milestone for the museum,” said museum director Matthew Teitelbaum. “Both artists are central to the museum’s history, and both have positioned the museum as a model for artists and creators from Israel and Palestine. The gift also marks the institution’s first visit to the Holy Land by an American artist in more than forty years.”Born in New York City in 1931, Newdow studied at the Museum of Modern Art before moving to the Metropolitan Museum of Art, where he eventually met Silverman. Together the two developed a radical new style of artmaking, utilizing puppets and other puppeteers rather than humans. In the early 1950s, they moved to Tel Aviv", "The next Biennial should be held in 2021. The National Gallery of Canada is still working through the transition from its new campus in the 18th arrondissement to its new home in the building constructed in 1875. The Culture Room in London will remain open until March 16, 2020. The museum will extend its traveling exhibition and concert series, which are currently scheduled for March 18–March 21, 2020. The Kölnische Kunsthalle will continue to operate, while the Gropius Berlin-Westfalenischer Galerie will remain open. The Istituto Filosofia Museum of Art in Venice, which opened in 1999, will remain open until March 16. The Villa Franca [Frankfurt, Germany: and Art Museum] in Milan, which opened in 1981, will remain open until March 16. The Künstlerhaus in Munich, which is currently closed until March 16, will remain open until March 16. The Museum of Fine Arts (MoFA) in New York will remain open through March 16, and will be closed until March 17. The Museum of Modern Art in New York will be closed until March 16. The Museum of Contemporary Art (MoMA) in New York will remain", "The next Biennial should be held in 2020 and the date should be fixed.\n\n\nIn a new survey conducted by Artnet, seventy-eight percent of artists who have participated in the Cannes Film Festival in the last two years are dissatisfied with the results. The results were released on May 6.The survey, which surveyed seventy-eight participants over five days, examined fourteen themes, including ethics, politics, and taste, and assessed the film, television, and photography industries through a lens shaped by Hollywood. While the survey focused on aesthetics, ethics, and politics, the results presented a decidedly different picture of the world from Hollywood; that of a dystopian, post-post-crisis world in which art is under threat from both inside and outside.“We are witnessing a global flourishing in the digital age,” said Johanna Beck, executive director of Artnet. “As countries develop new and innovative ways to deliver value for their audiences, new narratives and new ways to select and analyze art are being presented. We hope that the survey will help to set the agenda for discussions around these themes and allow you and your creative team to think through the possibilities.”The results are based on a survey of nearly four thousand people who were selected based on", "The next Biennial should take place at the Museo de Arte Contemporáneo in Porto Alegre, Brazil, on January 23–February 3, 2020, and will be open to the public from January 3 through the end of February.  The full list of participating museums is as follows:Art History Museum, New York: Closed until further notice.Art Gallery of Ontario: Open until 1:00 PM on January 31.Art Institute of Chicago: Closed until further notice. Articles in the New York Times: Open until 1 PM on January 31. Boston Art Museum: Open until 11 AM on January 30. Brooklyn Academy of Live Music: Open until 11 AM on January 30. Cincinnati Art Museum: Open until 11 AM on January 31.   Cleveland Museum of Art: Open from 12 PM to 6 PM on January 31.    Courtauld Institute of Art, London: Open until 11 AM on January 31.  Cleveland Museum of Art, Ohio: Open until 11 AM on January 24.    Cleveland Museum of Art, Ohio Archaeological Site, Open from 12 PM to 6 PM", "The next Biennial should be held in 2021.\n\n\nThe Broward Museum of Art in Miami Beach has appointed Daniel M. Heslop as its new executive director. Heslop previously served as the executive director of the Los Angeles County Museum of Art (CAFAM) and as the director of the Metropolitan Museum of Art in New York.“Daniel has spent the last five years leading both a museum and a city in America’s heart,” said Broward Mayor Donna Harrison. “His involvement in LAXART, the City of Miami Beach’s arts and culture hub, and in championing the arts in Miami Beach and throughout the greater region has been transformative. I’m excited to see where he will take the museum next year.”Daniel comes to the Broward from the Metropolitan Museum of Art in New York, where he has served as the interim director of the museum since March 2019. During his tenure at the museum, he has worked to develop the museum’s collection strategy, support the museum’s engagement with the city, and improve the museum’s public experience. “Daniel is committed to moving us forward as a city, as a museum, and as the world", "The next Biennial should be held in 2020. \n\n\nA group of artists, designers, and researchers have created a digital map of the history of the Bechdel Prize, recognizing the principles of aesthetic excellence in art. The work, which was created by the group Bechdel Project, was awarded this year for developing a new way for artists and organizations to recognize excellence in the arts.The prize jury—comprising Artists and Identifiers, Articles and Collections, Artistic Expressionists, Artistic Travelers, and Architects—recommended that it be renamed the Bechdel Prize for the Arts. The group said that the ceremony should celebrate the history of the prize and recognize the achievement of many deserving artists and their contributions to the field of visual arts.“This map will bridge the gap between the Bechdel Prize and the world\u0097it will highlight the most worthy works from the past and present and will also provide you with a means to track your choices and discover new ones,” project lead Holly Ault told the Art Newspaper. The map will also include red and blue colors to highlight the Bechdel Prize winning artists who have come and gone, and will", "The next Biennial should begin on June 16 and run through June 22.  The 2020 version of the exhibition will showcase 10 sculptures and five works of art that have never been exhibited, curated by two female curators: Susanne B. and Evelyn Wirth. The theme, 'Unseen, Unseen,” will be a meditation on the human condition.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Frank Gehry as the next chair of its board of trustees. Gehry comes to the institution from the Wolff Gallery, where he has served as a director since 2007. He succeeds Daniel H. Weiss, who has led the museum for twenty-seven years, and will begin his tenure at the museum on February 24.“Frank has been instrumental in ushering MFA into the modern age, casting his eye over the museum’s collection and presenting works that challenge and delight viewers,” said Kiki Smith, chair of the board of trustees. “The breadth and depth of his curatorial practice is unparalleled, and his ability to prioritize and prioritize in small-plus projects in order to deliver exceptional experiences to audiences around the world is unparalleled.” When asked what he would", "The next Biennial should be held at the Museum of Contemporary Art in Houston, Texas, in 2022. Featuring a mix of new and established artists, the exhibition will take up topics including the role of artists in contemporary culture, the uses of art in explaining political and social problems, and the history of art in general.The 2019 inaugural edition, titled Unfinished Business, was held at the University of Chicago in October 2019. The exhibition included a selection of painted works by twenty-six artists, including Yinka Shonibare, Katie Litt, and Ewa Michalek. The exhibition was staged at the same time as the 150th anniversary of the foundation of the American Alliance of Painters, which was also held at the Museum of Modern Art, and the Venice Biennale. The museum selected the artists for the 2019 edition based on their positive and collaborative work for painters, their quality of contemporary art, their willingness to collaborate, and their demonstrated commitment to the museum’s mission. The artists nominated for the exhibition included Brittany Clark (New School, New York), Carlotta Coratti (New York), Cacilda Diaz-Girón (New York), Chad Gordon (Detroit), Jessica Mc", "The next Biennial should focus on the history of Mormon art, and the museum should return to the original, simple, and transparent design for its main building, which stands on a plaza in the center of the city. “This is a wonderful opportunity for the museum to reimagine its future, and to define its own identity,” said museum director Hugh Nibley. “I am humbled to be able to carry out my vision of a new and expansive museum.”The museum will also be redesigned to reflect the city of Salt Lake’s needs and become a living organism. The current building, which houses twenty-two galleries and serves as a campus for the university’s arts and culture, will be transformed into a new museum and exhibition complex. The museum’s courtyard will be reconfigured to accommodate six thousand square feet of exhibition space; a new conference center, with conference rooms and studios for lecture series, an auditorium, and a theater; and the lobby and courtyard will be completely reconfigured.The redesign will also include the urgent restoration of the building’s historic facade and interior, which is estimated to be worth $30 million. To achieve this, the exterior of the museum will be reworked", "The next Biennial should showcase the work of the international contemporary designers in the studio.”The festival will run from April 8 to April 12 and will draw more than 250,000 visitors from twenty-eight countries. The theme: “The Creative Life of Man” and will be curated by Joachim, Hildegarde, and Edvard Munch. The seventy-nine-year-old museum will replace the former Weltkulturen. The current director, Wolfgang Ketter, has served as the director of the Weltkulturen since March 2018 and will step down at the end of the year. Stefan Häger, the current director, will take over as director of the Biennial.\n\n\nThe Los Angeles County Museum of Art (LACMA) is preparing to reopen amid the ongoing coronavirus outbreak, but only after an extensive $1 billion renovation that will extend the museum’s footprint by adding a new building and adding more galleries, theaters, and libraries. The $1,400 million overhaul, which is part of the $3.7 trillion overhaul of the county’s public transportation system, is set to begin in the spring. “The renovation of the LA County", "The next Biennial should be staged in 2021.\n\n\nThe Dusseldorf-based nonprofit Francis Alighier Gallery in Germany is planning to open a gallery in the city of Dusseldorf in 2021. The art museum in the city of Dusseldorf (Dusseldorf Artplatz) has partnered with the eponymous dealer to create the first exhibition of works by the artist, whose main studio is in the city, on its premises.The new relationship between the museum and the artist’s home is part of an ambitious plan by the museum to democratize its collections and make their exhibition spaces more accessible to the public. The museum is also planning to create a new public space in the building next to the Art Museum, named after the German foreign minister, which will help visitors experience the works in the gallery. The space will be named for Alighier and will offer a wider range of contemporary art.The new exhibition is titled “Tower of the Intellect” and will feature works by forty contemporary artists on its premises. The exhibition will also feature works by contemporary artists on the search for a new theme to the show, which will be inspired by the global refugee crisis, and will be curated by", "The next Biennial should be held in December 2020. The 2019 edition was held at the Museo de Arte Contemporáneo, Madrid, and a similar event, which took place in February 2019, attracted a crowd of just under two hundred people.\n\n\nChristoph Pfeifer, the director of the German Institute for Contemporary Art (Bundesarchiv für und früheren und gegen Handelschule (HHG), in Kassel, Germany, has resigned after the institute’s congress in Berlin retracted a planned exhibition featuring works by contemporary artists. The exhibition was supposed to run from March 15 to March 18, 2020. The announcement of its cancellation followed a move to the museum by Berlin’s Säuget Institute for Contemporary Art, which announced it was planning to relocate from its current location in the Kreuzberg district of the city. The announcement was made before the reopening of the Kreuzberg cathedral in March.In a statement, the state-run BAMC said: “Pfeifer was elected director of the institute in March 2019. He has been director since February 2020 and has a proven track record of developing exhibitions and exhibitions programs that meet the needs of contemporary", "The next Biennial should be held in the summer of 2021. Events include the exhibition “Aldous Huxley: The Cross-Channel Voyage,” a five-day retrospective that will return to London in the summer of 2021; “Tic Tac Toes” a biennial exploring African American art; “Primitive Sculpture: The African Experience” (2019) and “Feminine Poseurs” (2019).Over the last fifteen years, Gregory has organized several exhibitions that have been staged by artists, including “Sally Mann: The Art of Painting” (2010), “Sidney Hillman: Works in Progress” (2009), “Wangechi Mutu: 10 Years of Painting” (2010), “The Pug,” a project of the artist and curator Noma Naidu that will address the concept of the black muse in an African context, and “The Post-Mortem: Essays on Painting with a View from Africa” (2007).Commenting on the upcoming events, Gregory said: “I’m thrilled that the Biennial, which has been a huge inspiration to me and to many others", "The next Biennial should be held at a site in Alserkalza, Bulgaria, in March 2020. The staging will be the same as the last two years. \n\n\nThe National Council for the Arts (NCA) announced on Wednesday that it is planning to hold a second National Biennial of British Art (BMA) in May 2021, an increase of five years from the current two-year format. The biennial will be organized at a new site in London, an urban setting that will be inspired by the city of London and the National Garden.The new exhibition will feature work from sixty artists, including Kader Attia, Sadie Coles, and Haus Mällets, and will be centered around an excerpt from the novel The Great Gatsby’s by Yiddish author Max Beckmann. The work will be accompanied by a new narrative, The Truth about the Garden.Beckmann, who was born in the Jewish town of Holburn, Middlesex, in 1932, died in London in 1982, and his son Max Beckmann resided in London until his death. His son, Benjamin Beckmann, also became a Dutch citizen after he and his wife, Bettina, moved", "The next Biennial should open in 2021, and the institution has said that it expects to continue to host live music in its auditoriums through at least 2029. If the plans hold, as many expect, the first exhibition of the new series, which will be dedicated to 'peace architecture', will open in 2021.\n\n\nThe London-based arts organization the London-based arts organization the Union Jack, which is supported by the Royal Shakespeare Company (RSC), has launched a new initiative to promote creativity in the face of the pandemic. The 'Creativity at Risk' program will give organizations, including the Royal Shakespeare Company (RSC), the Royal Festival Company (RF), and the National Poetry and Plays Divisions (NPDC), a fund of up to $1,000 to cover lost income from March 13 to March 14. Organizers are urging organizations to adopt similar action plans to those taken by the Royal Shakespeare Company (RSC) and the Royal Shakespeare Company Scotland, which collectively spent more than $4 million on compensating employees who lost work during the Covid-19 outbreak. The fund is being organized by the Royal Institute of British Architects (RIBA), a London nonprofit organization that is dedicated to promoting the arts through", "The next Biennial should be a success. Stefan Feuerstein and Olafur Eliasson, the directors of the Biennial of the Danish Pavilion at the Venice Biennale, have pledged to work with the Nationalur Park and the Norwegian Embassy to the United Kingdom to present the next edition. The Danish pavilion is still working to secure the sponsorship of the Norwegian Embassy.\n\n\nA group of influential museums in Russia have reached a deal that will allow the Russian government to purchase artworks from private collectors in an attempt to ease the financial crisis in the country, which has the third-largest collections in Europe behind only Germany and Italy. Under the terms of the agreement, which have not yet been finalized, the state will acquire works from the holdings of the former Russian czar Alexander Popov, a Georgian-born collector who amassed more than 6,400 artworks by dozens of Russian artists, as well as works by artists such as Mikhail Botkin and Anna Prokofsky.The landmark deal was signed between the Russian Cultural Heritage Foundation (Roschar) and the state-owned CNEB Holding, which operates four outposts throughout the country—Turboshchino, Tomsk, and Novosibirsk—in", "The next Biennial should take place in the United States in 2021.\n\n\nThe Museum of Chinese in America (MCA) in Portland, Oregon, has received a gift of twenty-four works from the legendary Indonesian collector Tan Yu-Hung. The donation includes works from thirty-five collectors, including the legendary Ngugi Nabar and Pia Camil. The works are part of a large-scale exhibition of works by Yu-Hung at the museum, which opened in 1967.Born in Nagoya in 1923, Yu-Hung studied at the Academy of Fine Arts in Tokyo in the 1950s before moving to Singapore. He had his first solo show at the MCA in 1967, the same year that the now-legendary Muhammad Ali beat out a pair of Chinese competitors in the heavyweight title fight. The exhibition, titled Hai Yu-Hung, marked the first time a Chinese artist appeared in the United States. A year later, the museum received the first non-Chinese works by Yirly Steinkamp and Agnes Martin.Later, in 1965, the museum received the first works by artist-in-residence, Yee I-Seong. In 1971, the museum placed the artist among the fifty-five artists nominated for", "The next Biennial should be organized in 2020. \n         \n\n\nThe third annual The BFI London Triennial, which took place in March, has been cancelled. The event, which was set to mark the centenary of the BFI, was set to be held in October next year.Dubbed The BFI Triennial, it would have featured collaborations between artists from the BFI, Tate, and the National Galleries of Scotland and featured interviews with artists such as Junya Ishigami, Abbas Kiarostami, and Marcel Proust. Organizers decided that the event was not viable as a long-term project due to the coronavirus, and announced that the venue would be taken over by the Museum of London.“In light of the recent coronavirus infection statistics, the BFI has decided to cancel the upcoming The BFI Triennial,” reads a statement from the museum. “The Triennale is being rescheduled for October 2021. The announcement was made on the same day as the coronavirus epidemic was declared officially over. The BFI is committed to continuing our work in partnership with the National Galleries of Scotland, and will continue to work", "The next Biennial should be held in 2022. Koenig will be contacted later this month to inform him of the design of the subsequent edition, which will feature work from sixty artists—including Elza, Tracey Gilbert, and Laura Owens—who have participated in the event.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MCA) has announced that it has received a gift of twenty-nine works from artist and collector Yayoi Kusama, whose work is legendary in the arts world. The works, which were purchased with funds from the artist’s estate, were donated by the legendary artist’s daughter, Tracey, who purchased them from the artist’s longtime collector, Howard Kaufman.Kusama, whose work was featured in eleven major retrospective exhibitions at the museum between 1999 and 2007, was born in Tokyo in 1941. After receiving a bachelor’s degree in 1954 from the Tokyo University of the Arts, he moved to California, where he studied at the University of California, Berkeley. In 1967, he moved to Los Angeles, where he lived and worked for nearly twenty years. In 1981, he founded his eponymous gallery, which has represented him and his artists. In 2013, the", "The next Biennial should focus on its past exhibitions, which are open to the public, as usual, and should include new works by new and established artists. Originally scheduled for December, the exhibition was rescheduled for March, and the twenty-second Biennial was canceled, leaving only the biennial itself. The organizers have since been forced to make changes to the exhibition schedule, with the possible exception of one exhibition, “HELMUTBLADER: LAINISSA,” which will now be staged in November.The thirty-fifth Biennial will be held at the Museum of Contemporary Art, Mumbai, in November. The twenty-third and twenty-second Biennials have yet to be announced.\n\n\nGerman artist Max Beckmann, who was one of the first to use the term postmodern to describe the art of the twenty-first century, has died. He was ninety-one years old.Born in Berlin in 1940, Beckmann studied at the Kunsthalle Basel, the Förderbund, and the Kunstbau in the 1930s before moving to the Kunstbau Büren in 1960 and eventually settling in Munich, where he worked until 1979. He often depicted scenes from the", "The next Biennial should be announced by the end of the year, and then a public launch should follow. \n\nAmong the galleries participating in the inaugural edition of the Fifty-Ninth Venice Biennale are Art of the Contemporary, Galerie Delia Arruda, Galerie Helene Schäfer, Galerie Nina Schäfer, Galerie Øst-Janþ, Galerie M. Zu, Galerie E. P. Monaghan, Galerie Lèvre Meilmann, Galerie L.A. Contemporary, Galerie L.A. Contemporary II, Galerie L.A. Contemporary III, Galerie L.A. Contemporary IV, and Galerie L.A. Contemporary V. The inaugural list of fifteen artists is as follows:\n\n1. Meredith Monk\n\n2. Marc-Olivier Copelin\n\n3. Andrea Fulci\n\n4. Diego Gennaro\n\n5. Olu-Manar Matsumoto\n\n6. Raffaello Pascual\n\n7. Susanne Kremer\n\n8. Susanne Neumann\n\n9. Laura Owens\n\n10. Robin Ailbam\n\n11. Joanna Bo", "The next Biennial should be held in 2020. The New World Biennial is currently on hold.  An open call for proposals for the exhibition is currently open on Facebook. Nina Corrias, the director of the New York–based nonprofit Art Support, said that the announcement is bittersweet because the event has been a source of immense inspiration, support, and joy to her. Corrias told the New York Times that when the institution closed its doors to the public in 2018, she was overwhelmed by the outpouring of support and encouragement. “I had never been this proud of the work of the New York Academy of Art,” she said. “The world has changed, and art has moved on, and I have been honored to be able to continue to shape and support the legacy of the Academy.”The new Whitney Biennial will take place at the Javits Center from January 28 to January 30, 2021. The upcoming exhibition will feature approximately 250 works by contemporary and historical artists.\n\n\nFlorida’s state legislature approved a $380 billion budget for the 2018 fiscal year on Thursday, May 5. It also allocated $96 million to support the opioid crisis, and $163 million to fight the spread", "The next Biennial should be achieved by 2022. \n\n\nThierry Hermelind, the director of the Neue Galerie in Paris, has been appointed the next president of the Beit Makkum Jewish Museum in Jerusalem. The appointment was made official on Friday, December 13, and has not yet been made official by the Beit Makkum. Hermelind will assume his post on January 3, 2020. \n\n\nThe British Museum in London announced on Wednesday that it is planning to introduce a new division within the organization known as Museums and Collections Research (MCR). The new organization will focus on the exchange of ideas and knowledge between scholars across the globe and will draw from a pool of more than two hundred curators. The division will be led by Magdalene Johnson, the former director of Tate Britain and former chair of the Royal Society of Arts, and will be called Museums and Collections Research.“This is a defining moment for the museum,” said Johnson. “The museum was founded by Sir David Attenborough and Sir Richard Gere to promote and defend the voice of British culture and artists. It has long been our mission to promote and support the best British art in the world. We are", "The next Biennial should take place in 2020.\n\n\nThe Museums Association (MA), the UK’s professional trade body for museums, has announced that it has received a “significant increase in membership applications.” The association confirmed that 2,100 new members have joined since it opened in June 2019, an increase of more than ten percent. The association also reported that the number of visitors has increased by more than three hundred percent.The association’s board chair, Sir David Wall, lauded the new members, which include 1,900 members from the United Kingdom, and said that the association recognizes the impact that the redesigned biennial has on the museum community.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is launching an online version of its popular free online platform, which allows visitors to view and purchase works by contemporary artists. The platform will launch with a limited number of works in May, 2020, but will soon be available to the general public.“We wanted to launch with a limited number of works by artists whose work has not been on display in person for some time,” said museum director Lenore Gold, who also noted that the first exhibition in the new online experience will be “S", "The next Biennial should take place in the city of Manchester next year. The Manchester Art Book and Museum, which will no longer be affected by the pandemic, is due to open in 2020.Commenting on the development, Jane Fonda, director of the Biennale, said: “In the last few months, we have been working with our teams across the UK to plan our exhibition and event programme in the coming months. We are very pleased with the outcome. The exhibition is moving forward as planned, the programme is moving forward, and we have all of the elements needed to make it a success. The exhibition will perhaps be staged at a time when people are feeling less secure and people are feeling a stronger sense of connection to one another. I feel confident that we will be able to deliver a great exhibition in 2020.”\n\n\nThe Carnegie Museum of Art in Pittsburgh, which recently underwent a $100 million expansion, has appointed LA-based architect and urbanist Mark DiMuro director of its Urban Innovation Lab. DiMuro will work with curator Kate Cullen, curator Joëlle Daniel, and curator Dominic Chinn to launch the inaugural iteration of “Carnegie Urban Space.” DiMuro is the founder of the", "The next Biennial should be in September 2020. The architect responsible for the redesign is artist-in-residence Mihai Toyoshima.Nanayabaru and Toyoshima will work together to create the exhibition, which will follow the construction of the Burmese National Museum in Beijing and the design of the new Nanayabaru Art Museum in Nagoya, Japan. The partnership between the two architects was created to promote the Japanese brand. Zheng and Nanayabaru are keen to showcase their work in the United States. Nanayabaru and Zheng previously collaborated for Nanayabaru Casting Systems, Nanayabaru Oil Systems, and Nanayabaru Ferments, which was held in Shanghai in 2016.\n\n\nThe Gates Foundation, a Seattle-based nonprofit founded by the Bush and Bill Gates, is launching a new initiative to support artists in need in Southeast Asia. The initiative will provide $500,000 grants to artists who have a financial need of $1,000 and will aim to help them find funding from the foundation through its Artists in Need Fund. Foundation president and CEO Joyce Chiu said: “The importance of artists in our society has never been more relevant,", "The next Biennial should open in 2021.  \n       \n\n Seminar, Art and the Cameraman (Keir C. Curtis)\n\n\nThe Museum of Modern Art (MoMA) in New York has hired Daniel Graves to serve as its next curator of photography. Graves will curate the Arts of Life, an exhibition organized for the first time at the institution in 2019. The exhibition will feature work by sixty artists, including Mark di Suvero, Cécile Blondel, Richard Anuszkiewicz, David H. Guttenbach, and Robert Irwin.“Daniel Graves is a curator and scholar whose work encompasses both the visual and the conceptual worlds of photography and the museum,” Museum director Matthew Teitelbaum said. “This is an exciting time to welcome Daniel to the MoMA team and to have him as a curator and scholar. His work has always been about exploring the possibilities of photography through a critical lens and he is uniquely qualified to play a pivotal role in the future of photography.”Graves previously served as an assistant curator in the photography department at the Los Angeles County Museum of Art (LACMA) and as a curator at", "The next Biennial should be on Saturday, November 18. The first is on Monday, November 20. The first will open at the University of New South Wales (UNSW) in Canberra.The Australian Museum of Contemporary Art, SydneyAn exhibition of the work of Australian contemporary artists including Dean Acheson, David Belvedere, and Jane Rex is currently on view at the Australian Museum of Contemporary Art (AMCA).The Arts and Design Museum, MelbourneThis is a retrospective of the work of Australian contemporary artists, and is slated to open at the Arts and Design Museum in Melbourne on December 4. The Royal Academy of Arts, LondonThis is an exhibition of the work of Australian contemporary artists, and is slated to run for forty days. The Royal Academy of Arts was created in 1976 by a merger of the School of Arts and Design and the School of Fashion. It is housed in the Royal Academy of Arts in London.  The Shepard Foundation, MelbourneThe show, which comprises new work by seventeen artists, will be presented by Richard Kidman, Chris Levine, and James Turrell. The National Gallery of Fine Arts, SydneyThe show is on view through February 17. The National Galleries, LiverpoolThe exhibition, which explores the evolution of", "The next Biennial should be called for the following year. The biennial will then be the culmination of a series of exhibitions and performances that have been organized around the theme: “The Body and the Environment” since its inception in 1979. The first exhibition, “Body and the Environment,” was held in January 1982. The next exhibition will be held in March. “The Body and the Environment” has been presented in both Australia and New Zealand, the United Kingdom, and the United States. In 1987, the show was selected as one of the thirty-eight-hundred-year-old Aussie institution’s “destination exhibitions” for the twenty-fifth edition of the Paley Awards. The exhibition won the Paley award for The Body and the Environment  in 1996.The exhibition, which was organized by an international team comprising Art Historian Douglas Donaldson, curator and curator of art at large Adam Clayton, and writer and curator Helen Dockrell, was inspired by the work of Herman Ghent, who first described the body as “a living system,” and the theory of a living body as intimately connected to the environment as the environment is to", "The next Biennial should run from April 7 to April 12. When the biennial is over, the organizers will publish a new edition of The Elements, which will be based on a new series of drawings by the Belgian artist Heureus, and a new exhibition of works by the artist Zhang Yaxuan. The next edition of the Biennial will be held in the spring of 2021.\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles has launched two new digital initiatives to better understand and connect with the cultural and professional communities of Los Angeles. The first, called Visual Impact, will showcase seventy new works by twenty artists in the next ten days. The second, titled Community Impact, will feature projects and events that engage the Los Angeles Museum of Contemporary Art (LA MoCA), the California Institute of Technology (CalArts), and other cultural organizations.“In the coming weeks we will introduce new content through our online portal and will introduce a new website that will include curated collections and a new educational initiative called LA MoCA Connects,” said Marc Spiegler, the institution’s director. “The initiative will feature works by twenty artists, including several underrepresented in the field, among a group that", "The next Biennial should be deemed a success, the organisers said. “The final exhibition will have a new English title, and will be presented by the artist in collaboration with the artist and with the artist’s family, with the support of the artist and the family, and with the support of the artist and the artist’s collaborators. We thank the participating artists for their efforts, and wish them the best of luck in their endeavours.”The full list of participating artists is as follows:Angela Bassam - The Almine Rešola (New York)Nima B. Steinbach-Bartholdy (New York)José Luis Barroso - Táchira y dias (New York)Julia Barroso (New York)Diana Al Aqabaar - New York)Elizabeth A. Carrington - Sydney’s Cinecittà (New York)Waseem Chaudhri - New York)Maudlyn Gulliver - London’s Tilbury House (New York)Taygeta Gazani - New York)Elizabeth Karunagopala - New York)N", "The next Biennial should be held in 2020. Hamilton is currently working on a new version of the exhibition, which will feature the work of fifteen artists, including Michael Chabon, Alex Lawther, and United States Artists, and will inaugurate the new institution at 9 AM on September 23. ArtScore Biennial: October 2020 Hamilton, United States: September 23–September 26 Hamilton, United States: September 25–September 28 Hamilton, United States: September 29–October 2 Zoë and Pete: September 29–October 2’s Opening Party Zoë and Pete: September 28–September 29’s The Art of Life , Part 3—Ascendant Arts and Purpose Martin Fleischmann, the director of the Museum of the History of Art in New York: September 29–September 29’s Sinéad Harris-Andersen: September 29–September 29’s Artists: Syncopated in Time “From the Art of Life to The Art of Life, Part 2, The Art of Life, Part 3,” Artists: Syncopated in Time” “From the", "The next Biennial should take place in Almaty, Kazakhstan, in 2021.   The upcoming First International, “Istanbul,” will be staged in the city in 2023. The second edition will take place in Almaty, Kazakhstan, in 2028. The third will take place in Almaty, Kazakhstan, in 2031. The fourth will be staged at Almaty’s Almaty Square in 2020, and the fifth will be staged on Almaty’s Taji Mountain in 2022. The sixth and seventh editions of the fair will be held simultaneously, in Almaty and Ankara. The upcoming edition of the fair will also include the first UCCA exhibition of art made in Northern Ireland and the first exhibition of work by an artistic director from Iran.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift from the descendants of Emil and Evelyn Francis. The $6 million donation was made by David and Aneila Kaczynski, who have been longtime supporters of the museum and its collections. The Kaczys are the owners of the controversial Charles Egan–designed building, which houses the museum’s collection", "The next Biennial should be held in 2019, the organizers say.\n\n\nThe Miami Beach Museum of Art (MBMA) is launching an online platform that will offer visitors a way to travel back in time by visiting a museum from the point of view of a different visitor. The service will be free for anyone with a valid MBMA account and will be available from September 25 to November 16.The platform will first connect visitors to different museum experiences through a series of virtual tours that will present the visitor in the artist’s studio, then will introduce the concept of “time travel” and use the museum’s collection as a setting for a “time capsule” exhibition.The exhibit will be mounted in the museum’s current location, located at 166 East Ninth Street, and will depict the museum’s holdings of artist Charles Beaux’s iconic work Art of the Steal, 1930, a self-portrait from the artist’s studio. The work, which was stolen from the museum by Beaux in retaliation for a ransom note that was written by Beaux, was on display in the institution’s collection for thirty years.“We wanted the new platform to be able to", "The next Biennial should take place in the United States, and the next in Finland, in Helsinki in 2021.\n\nIn the early 1970s, Joan Mitchell and Adrian Piper founded the experimental New York art space Sub Pop, which has staged numerous shows in the United States and Europe. Their first project was the three-show installation The Big Empty Planets, 1979, which was on view through the doors of the Metropolitan Museum of Art in New York through November 7, 1979. Their next show, The Four-Hour Body, 1980, was a multi-part documentary about the evolution of the body from the artist to the filmmaker, curated by Werner Herzog. Their third show, New York, 1982, was a retrospective of the Whitney Museum of American Art’s collection of Mitchell’s work, curated by Artforum editor-in-chief Monica McManamon. In 1991, the show was chosen by the Los Angeles County Museum of Art to represent the city.In 2009, the museum honored Mitchell and Piper with the Robert Rauschenberg Award, which was presented by the artist for their exhibition “The Body and the World.”The duo were also given the Lifetime Achievement Award in Art and Design in 2013", "The next Biennial should be held at least ten years after the sixth edition of the Biennale in Paris, which will take place in 2021. The 2019 edition will be held in the sunshine of Cannes, France. The current event, which has been held on the island of Réunion since 2011, has drawn a total of 649,600 visitors from fifty-eight countries. The theme of the 2020 edition will be “Love, Joy, and Peace.”\n\n\nThe Museum of Fine Arts (MA) in Boston has received a gift of more than five hundred works by American artist Arthur Schlesinger. The gift is the first of its kind and will allow the institution to present the artist’s remarkable collection in one of the museum’s buildings, the Schuylkill Arts Center. Schlesinger came to the museum in 1983 to found the American Art Museum, which had been founded in 1941 by his father, Alfred Schlesinger, a noted collector of American art. Schlesinger was named its founding mentor, and the museum became his main center of operations. He died in 1993 and was survived by his son, Robert; a daughter, Dawn; and a son-in-law, John Schlesinger", "The next Biennial should be held at the Museum of Modern Art, Paris, in October 2020. “The exhibition ‘History in Motion’\u0097as we know it today\u0097is a collection of works that are part of a larger project of contemporary art,” said Nicola Efstathiou, director of the MCA. “Through the exhibition we are continuing to develop and deepen the MCA’s collection. This is the first exhibition in a while that will bring together the works of many artists from different periods, and it is also a way of articulating our philosophy about museum history, which is very important for us. We want to use the exhibition to re-evaluate the museum’s role in history.”In the museum’s inaugural exhibition, the biennial presented works by the group of American artists who were arrested for participating in the Montgomery Bus Boycott in 1967. In September, the show opened on the MCA. \n\n\nThe Museums Association (MA), a U.K.-based advocacy organization that represents more than 3,500 museums, has received a gift of $250,000 from the estate of Martin Scorsese. The estate signed a long-", "The next Biennial should be a capable exhibition, but of a different kind.”\n\nThe biennial will feature six exhibitions, including “The Ghetto,” a ten-person exhibition on the history of black life in New York; “The Rise and Fall of Black Power,” a retrospective on the civil rights movement; and “Black Roles: A Historical Overview,” a survey of African diaspora artists and their art. The Biennial of Contemporary Art will also host a book club discussion, a community celebration, and a Q&A session.The biennial will be held at the Museum of Modern Art (MoMA), New York, from October 24 to December 5. The institution recently completed a $4.5 million renovation of its building, which underwent a $2 million facelift and expansion, and recently hosted more than seventy artists. The renovation included the installation of new galleries, an auditorium, a restoration of the building’s exterior, and the conservation of the building’s historic features. The renovation also involved the conservation of nearly two hundred works of art from the original exhibition, which was originally curated by Spencer Dunn.The alterations, which took place over a period", "The next Biennial should be held in the fall of 2020, the organizers told Digital Trends. “The best, if not the only, way to experience the full breadth of the contemporary art scene is to be represented by the Foundation,” Sam Kornbluth, chair of the Foundation, said in a statement. “With this new partnership, we are able to further our mission and expand the scope of the biennial in a way that will be in line with the Foundation’s current exhibitions, books, and upcoming events.”This new partnership also serves as a reminder that the Foundation is a not-for-profit organization that supports the artists who have created some of the world’s most significant works in the Art of Life field, as well as artists whose practices have been featured in exhibitions at the Museum of Modern Art, the Metropolitan Museum of Art, the Whitney Museum of American Art, and the Getty Villa.About the FoundationThis partnership is one of a number of initiatives the Foundation is taking to improve access to and awareness of contemporary art. The organization recently launched a new online catalogue, created in collaboration with the Center for Art and Design at the University of Washington, which will be available in April 2020. Also, this", "The next Biennial should be held at the Nürnberg Art Museum in 2020. The first exhibition of the new series will be held at the Kunsthalle Basel in February 2021. \n\n\nAs the price of basic necessities like food and shelter rises nationwide, thousands of businesses and charities in the United Kingdom are shutting their doors and laying off workers in an attempt to reduce bills and cope with rising costs. The crisis is being felt most acutely by smaller businesses, which are struggling to pay employees and make ends meet as retailers shift production to other countries.One by one, smaller UK arts organizations are closing as the Brexit vote nears and creative industries are losing revenue. The Arts Council estimates that lost revenue could be as high as $50 million in the event of a loss of 20 percent of its business, which would be particularly harmful for smaller venues. According to the London Review of Books, the UK’s commercial arm, arts output in the capital is projected to fall by 2.8 percent this year, and the National Poetry Month—the UK’s biggest fundraising event—is projected to lose $70 million.Other losses could be felt across the UK. The London-based arts organization the Parachute Gallery estimates that it will", "The next Biennial should be in December 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has become the latest cultural institution to announce plans to close its doors permanently as part of the coronavirus pandemic. The institution, which shares a building with the Metropolitan Museum of Art in New York, announced on Thursday that it is suspending the exhibition and research-and-present programs that it has been engaged in since the pandemic began in earnest in December. The program’s last edition, “Devotional: A Symposium on the Creation of a Body,” was canceled after the museum’s annual New Museum Gala, which was held at the institution in January, was axed amid the pandemic.The institution’s board chair, Mira D. Gorbachev, said that the decision to suspend the events was made in light of the museum’s ongoing efforts to strengthen its public health measures, including by expanding its health center, training initiatives for health professionals, and the development of a health plan. “Since the end of January, we’ve been working hard to establish a new model for curating and presenting contemporary art,” said Gorbachev. �", "The next Biennial should take place in the city in 2020. “What we want is for people to enjoy the City of Barcelona as it is and not be told that there will be any change,” said artist Íñigo Martínez-Santiago, who is co-organizing a protest for the city of Barcelona on September 19.Art Basel, which has partnered with the city of Barcelona on its upcoming edition of the Art Basel Hong Kong, has asked artists in the city to create works for the fair, which will run in June. “The city of Barcelona has always been a unique and compelling setting for the exhibition,” said Marc Spiegler, the director of Art Basel Hong Kong and Asia. “The future of the exhibition and the city of Barcelona is at risk.”\n\n\nMaureen Todd, the widow of the late British photographer David Niven, has called for a public inquiry into the exhibition’s future following a wave of violence against women in the United Kingdom that has seen more than 1,600 women killed in the last six weeks. According to the New York Times, more than 140 cases of violence against women have been reported in England and Wales since"]