["The next Biennial should take place at the University of Cambridge in the UK, in 2021. \n\n\nThe Andrew W. Mellon Foundation, the William Shakespeare Society, and the Carnegie Museums in Pittsburgh will collaborate to help the Flint Hills Community Arts Center (FHCAC) in Flint, Michigan, become a sustainable local museum. The center, which was founded by philanthropists James and Mary Mellon in 1985, is a collaboration between the arts and the local community, and is working to determine how it can become one of the last operating arts facilities in Michigan.FHCAC is one of two nonprofits that have received funding from the Mellon Family Foundation in the last five years to help save an arts museum or two. The foundation also gave $500,000 to the Mellon Family Museum of Art in Pittsburgh in 2016 and $1 million to Mellon Contemporary Arts in 2018. The center currently has about $1.5 million in debt. In order to avoid defaulting on its debt, the Mellon Family Museum of Art recently raised $800,000 from wealthy collector John and Mary Mellon. The funds will allow the museum to avoid writing off the $500,000 debt. The rest of the debt can be written off in a similar fashion to the Mello Family", "The next Biennial should include the art of integrating technology and design, ‎with the aim of creating a new form of kitsch. The design of the pavilion will be an extension of the exhibition. The biennial will then open in 2022, and the exhibition will run until 2023.The announcement of the inaugural exhibition coincided with the opening of a new digital platform, Digital Museum London. The platform will feature an exhibition of new art created by British and international artists, curated by famed curators Paul Mpagi Sepuya and Dame Esther Rinehart. Directed by Matthew Booth, the first show in the platform will open on October 25. The first iteration of the biennial will run from March 14 to March 16.\n\n\nThe Hirshhorn Museum and Sculpture Garden in Washington, DC, has added forty-two artists to its collection, bringing the total number of works in the collection to 475. Among the newly acquired works are works by twenty-nine artists who are represented in the United States; thirty-two works in the collection of the Smithsonian American Art Museum in Washington, DC; and sixteen works by American sculptor Gere Kavanaugh, who grew up in Iowa and raised his family in Nebraska.The Hirshhorn also announced that", "The next Biennial should be in 2020. “We are very much looking forward to the new challenges that the exhibition format will bring to the contemporary art world,” said Patrick Henningsen, head of the biennial. The biennial will also introduce an online viewing room and will be hosted in a state-of-the-art exhibition space in Oslo, the city’s capital.The 2019 edition featured work by seventy-six artists, including Luchita Hurtado, Daniel Kuan, and Aida Masuoka. The exhibition’s Artist and Jury sections were coorganized by Hannes Nilsen, Jakob Paar, and Marcelo Paz.The biennial will mark the opening of a new exhibition of new works by the artists featured in the exhibition. The exhibition will be hosted by the Oslo-based company Symposium, which helmed the 2010 exhibition, “Denmark and Oslo.” The event will also coincide with the reopening of the Biennale of New Art, which has been canceled due to the Covid-19 pandemic. The ten-hour exhibition will run from February 8 to March 7, 2020. \n\n\nThe Mumbai-based", "The next Biennial should be held in the autumn of 2021. The first exhibition will be “The Propagation of Imagination” (2019) and will run until March of 2021. The second exhibition will be dedicated to the art of the painting and will run until March of 2021. The third exhibition will be about the history of photography and will be staged in the autumn of 2021. The fourth exhibition will be on the history of art in the art world and will take place in the autumn of 2021. The fifth exhibition will be an exploration of the history of the arts in the twenty-first century. The sixth exhibition will be a theme-driven exhibition showcasing the most innovative work of contemporary art. The seventh exhibition will be a special show in honor of the biennial’s fifteenth anniversary. The twenty-eighth Biennial Exhibition will be held at the local venue of your choice. The twenty-ninth Biennial will be held in the city of Maricá, Mexico City. The venue will be determined by the Board of Directors of the organization which will be chaired by Mónica Berrada, the president of the Central Mexican Institute of Architecture and Design, when the date for the", "The next Biennial should be held at least twice a year. The new chair of the university’s Department of Art History and Artistic Practice will be Sara Zwerin, who has served as chair of the department since 2014.“With the departure of Anne Kühn, we are facing a transition in leadership and a need for a new leader in charge of our collections, exhibitions, and research plans,” the institution said in a statement. “During her leadership, the department and university experienced significant growth. She led the university through a major re-think of its collection, exhibitions, and research program, as well as a significant expansion of the university’s art museum, the Sursock Galleries, and the museum’s collection. Sara’s commitment to the collection and scholarly mission made her a strong candidate for the Nobel Prize in art.”Announced by the Arts Foundation (FAI), the prize honor comes with a $50,000 cash prize and will be presented at a ceremony at the Sursock Museum on November 27. The university has yet to announce a winner.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has acquired the rare artwork", "The next Biennial should take place at the Montréal Art Festival, which is currently underway. Speculating on a new venue for the event is a challenge because of the city’s temporary closure of the metropolitan area, which has put a temporary halt to new construction, scheduled for March 18–March 21.The decision to retain the city of Montreal in the event of a disruption caused by the coronavirus has been made by a six-member panel comprising executive director Daniel Bagnall, city councilor Gérald Tremblay, and Councillor Andrew Retherford, chair of the city’s health committee. According to the Montreal Gazette, the seven-person committee has yet to make a decision on the future of the city’s art galleries or the city’s archdiocese.The coronavirus outbreak has already had a negative impact on sales of works by international artists, who are likely to be affected by a two-week moratorium on sales and exhibition scheduled for March 25–March 29. The move has reportedly caused an additional drop in sales of works by the competition’s top twenty male artists, including Pierre Cardin (France), João Carlos Costa (Brazil), Hélio C", "The next Biennial should be held in 2020, and it will be organized by the Institute of Contemporary Art in London and the Exposition’s board of directors. The exhibition will be hosted in the National Gallery of Art in Washington, DC.\n\n\nThe Lowcountry Museum of Art in Portland, Maine, has received a $50,000 donation from the Lee family, which has supported the institution since it was founded by a group of art collectors in 1971. The gift comes amid a nationwide campaign to raise funds for the institution. The Lowcountry’s current board chair, Joseph Lee, announced that the museum would be rebranded the National Museum of American Art and would begin accepting visitors in January.The museum will also begin hosting the first-ever Lee/Lisa concert, which is being held at the Portland Shakespeare in March, and will launch an online viewing room where visitors can view its collection in real time. The museum will also introduce two new programs: a biennial of artmaking and art photography and a virtual reality experience.The organization will also unveil a new collection of works by artists such as Paul Gauguin, Pierre-Auguste Renoir, Susan Sontag and Mark Rothko. Inaugurating the program will be an exhibition", "The next Biennial should be held in 2020. The 2019 and 2020 editions were targeted to be staged at various locations across the city including the Museums of Fine Arts and the Art Gallery of Ontario. However, the museum board saw no need to hold events at the institution prior to the pandemic.The 2019 event, which received $103 million from the province, featured work by twenty-nine artists, including Kamel Al Saad, Linda Evangelista, and Lina Lavigne.The 2020 edition, which will take place at the Ontario Institute of Art (OIA), will be hosted by the Museum of Contemporary Art (MoCA) in Toronto. The museum’s director, Carole de Sadek, said: “The museum has been able to provide services that can help keep the arts and culture vibrant and relevant for an unprecedented array of audiences for many years. However, we know that the risks that we are all facing are too high. We know that the only way forward for the arts and culture in Ontario is if we collectively take immediate and decisive action.”\n\n\nThe Metropolitan Museum of Art in New York City has established two new fellowships that will support artists and creatives whose experiences and goals parallel those of the Met's", "The next Biennial should be held in 2022. Kamala Harris, who was named the upcoming curator of modern and contemporary art at the museum in 2016, said: “This year is vital for us, for it is the year of ideas, and my colleagues and I have come together to shape the next Biennial into an exhibition that can act as a vehicle for the richness of the art within it.”\n\n\nThe Brooklyn-based nonprofit YouthWorks, which nurtures and supports artists through its corporate and individual programs, has appointed Sarah Ozier as its next president. Ozier succeeds Maurizio Fusi, who has helmed the organization for almost ten years, and will take up the post on January 9. She succeeds Mary Anne Franks, who will remain involved with YouthWorks through the end of the year, and will serve a three-year term.“The board is thrilled that Sarah is the right person to lead YouthWorks into the future,” board chairwoman Eileen Luberstein said. “We look forward to working with Sarah to continue to craft ‘the future we want for the organization.’”Fusi will continue to serve as director of", "The next Biennial should be held in 2022.\n\n\nThe letter signed by more than 1,400 human rights lawyers, academics, and other experts urges the Chinese government to implement immediate social and economic reforms, including revoking the citizenship of anyone who uses social media and blocking websites deemed critical of the government.\n\nThe letter is also critical of Chinese authorities for failing to remove a statue of Mao Zedong, the founder of the Communist Party, from a highway in the capital Beijing in January. It decries the arrests of activists and dissidents, and argues that the government is stifling free speech by criminalizing criticism of the government.The letter is dated June 7, and comes from the group “Responsible Chinese Politicians” (RCP). The group describes itself as an interdisciplinary research team made up of academics, lawyers, and human rights activists. The letter cites the persecution of journalists, activists, artists, and those involved with the pro-democracy protests in Beijing in March as examples of the repression the government is inflicting on dissenters.“The government has repeatedly violated human rights through arrests and prosecutions, and has engaged in abusive clampdowns on media coverage, censorship, and other critical activities,” reads the letter, which was published", "The next Biennial should be held in the first half of 2020. The next Art Basel Hong Kong fair should be held in the first half of 2021, and the next Art Dubai should take place in the second half of 2021.The 2019 Art Basel exhibition, “The Future Is Present,” was held in Dubai from March 22 to March 27. The final show of the event was held in Hong Kong a month later. A new edition of the fair will be held in March 2021, and a second edition in March 2022.Art Dubai will continue to host tours of its galleries and is planning to open a new forty-five-thousand-square-foot campus in Abu Dhabi in 2021. The arts and culture destination will also continue to be held in Abu Dhabi through the twenty-fifth edition of Art Dubai, which will open in 2022. \n\n\nThe British Museum in Cairo has appointed John McAllister as its next director. Curated by Alexandra Adams, a former director of the Tudor Revival Group whose board includes Dorling Kindersley, McAllister will begin his new role in January. He succeeds Sue Sweet, who was promoted to director of the Tate in London this summer and will take up the post on January 20.", "The next Biennial should take place in the city in 2021, with the opening of the exhibition “The Stairs.”In a statement to the Art Newspaper, the museum said: “The Biennial is one of the most important events of our time and continues the work of the local, international and national art museums and institutions. We are inspired by its mission to promote the art of the diverse cultures of the city and the country. We are proud to continue its work with exhibitions, residencies, education initiatives and educational programs, and to continue to develop and strengthen our relationship with the city of Atlanta and the city of Atlanta’s surrounding area.”\n\n\nLincoln Center, the New York institution that runs the Metropolitan Opera and the New York Philharmonic, announced today that it will cease operations on May 4 and re-launch as the Met unveiled the twenty-first iteration of the Lincoln Center at New York’s Hudson Yards—a $450 million mixed-use development, designed by Danish architect Lars von Trier, that will include eleven theaters, a restaurant, and a hotel.The newly reimagined Met, which will also feature a sculpture garden and a performance venue, was commissioned by the artist-run nonprofit", "The next Biennial should be in the summer of 2023.\n\n\nThe British artist Richard Avedon has been awarded the Prix de l'Art Contemporain (PACE) for his work The Division of Love. The prize, which was established in 2015 by the Association of Arts and Design (AAD), will come with a cash prize of $30,000. The award, which is named for the late British designer, was presented at a ceremony in Paris on Thursday, September 5.Nominated by British artist Paul Rand, the work, which depicts a community of artists, each representing their own dimension, is a response to the contemporary art world. It was made for the second edition of the PACE show, which was held in London in November 2019. The seventy-two-year-old American, whose practice encompasses installations, sculptures, installations, and performance, was awarded the PACE for his work The Politics of Love, 2019. Based on the work of American artist Salvador Dalí, the work recounts a relationship between Jesus Christ and his followers. It is on view at the National Museum of Art in London until October 5.\n\n\nThe Body Shop in London has been accused of circumventing citywide", "The next Biennial should be on September 14–20, 2020. The fifteen-year-long event will be hosted in an attempt to unify the art world and address the issues of our time through a series of lectures, exhibitions, and screenings.\n\n\nThe Art Newspaper has published an exclusive report that reveals that the Metropolitan Museum of Art in New York is planning to reopen as early as June 1, 2021, following a $1.2 billion expansion. The museum is currently remodeling the building that housed the legendary collection of Charles and Ray Eames and is slated to open in the fall of 2020.In a letter sent to the public on Friday, the Met confirmed the opening of the new museum, the artworks are currently undergoing conservation, and that construction is currently underway. The letter, which was addressed to the public through the Met, said that “the opening of the new museum will allow us to better reflect on the museum’s rich history and future designs.”The Met added that the date for the museum's reopening would not be determined until the institution’s construction has been completed and that the opening of the new museum would not be impacted by the reopening of the existing Met. The Met said that the museum will", "The next Biennial should take place in 2020. The 2020 edition will be held at the Museo de Arte Contemporáneo Pellerin in Madrid.\n\n\nThe MontPensier Foundation for Contemporary Art (MCA) in New York has initiated a new grant program designed to bring more than $1 million to the institution each year. The national organization will award the grants of $1,000 each to artists and arts organizations. The grantees will be selected by a nominating committee made up of Artistic Director Kathy Arnold, MCA executive director Susan B. Olson, and painter and sculptor L.A. Reid.The organization will initially distribute $200,000 in 2019, and the awardees will be announced in 2020. The program was initiated in 2015 as part of a $2 billion overhaul of the Metropolitan Museum of Art, including the construction of new exhibition spaces, the renovation of the museum’s existing buildings, the expansion of its collection, and the expansion of programming. “This project transformed MCA, and I want it to be remembered,” said Arnold. “We are grateful to the public and private communities who have supported our work, and we look forward to future years to", "The next Biennial should embrace a more contemporary, contemporary-leaning female-centric narrative\u0097with a particularly strong focus on women’s history. We believe that the future of the museum will depend on our continued dedication to this unique and difficult topic.”\n\n\nThe Smithsonian American Art Museum (SAM) in Washington, DC, has appointed Curtis Carroll as its next director. Carroll comes to the institution from the Metropolitan Museum of Art, where he has served as associate curator of contemporary art since 2013. He succeeds Nancy Panetta, who retired after eleven years at the helm of the museum after serving as deputy director from 2016 to 2018.“Curtis is an accomplished and highly respected curator and scholar whose scholarly and curatorial achievements will ensure that SAM continues to thrive as a valued laboratory for art history and critical thinking,” said Marisa Wootton, the museum’s deputy director for research and programs. Carroll will assume his new role in October. While at the Met, Carroll helped develop and push the museum’s exhibition program, which has featured work by artists such as David McNew, Andrew Lloyd Wright, and Susan Cooper, and helped shape the institution’s collection through research and exhibitions. ", "The next Biennial should be hosted by the University of California, Berkeley, in 2022. For the past couple of decades, the challenge of organising an exhibition of such scale has been posed by a team led by Art in a Day Seven exhibition director, Mark Halperin. “We’ve been collaborating with the Berkeley Art Museum on a series of exhibitions that would bring together in one place a group of contemporary artists that had never been assembled together before, and explore the possibilities of what the museum might become,” Halperin told the Los Angeles Times.The eight-part exhibition series “Dangerous Food: The Art and Science of Food on the Table,” and “The Art of Making Place: From Food to People,” were presented at the Art of the Party, which opened in 2019 and concluded in 2020. The museum is currently working on the next edition, which will focus on “self-organisation and the profound intellectual and physical activity that occurs in the laboratory,” and is currently preparing to launch the new Dangerous Places, which will explore technologies that could one day enable us to be within our own homes.\n\n\nThe Humanities Council announced today that Linda A. Wilson", "The next Biennial should focus on the history of photography in the United States, Canada, and Mexico, and should include a consideration of the role of photography in the history of American art. It should also incorporate a study of the relationship between the Biennial and contemporary art. The curator should work with the artist to develop a short- and long-term vision for the exhibition, and should organize a reception for the artist, whose work will be placed in the exhibition. The artist will receive $250 for her work.\n\n\nArt historian and curator Naima J. Keith, a longtime Curator of Modern Art at the Museum of Fine Arts (MMCA), Boston, has announced that she plans to depart the institution on August 7 to return to New York to lead the residency program at the Museum of Modern Art (MoMA). Keith, who was a curator at the museum for ten years, took the helm of the program on January 5, 2020, and has since added artists like Jonás Nkanga and Jumaane Williams to her curatorial team.“I’ve long been a proponent of the residency program,” said Keith, who was named curator of Modern Art in the Museum of Modern Art in 2012. “", "The next Biennial should take place in Tokyo, and it will be a perfect fit with the theme of the festival: 'Open. Explore. Reconnect. Disturb.”\n\n\nThe Art Newspaper has revealed that the 2019 edition of the Venice Biennale will be the last, and will instead focus on the exhibition of work by artists and designers in the United States. Titled “Art without Borders: From the Contemporary to the Past” and directed by Rémi Osei, the event will take place in Kunsthalle Basel from March 27–March 31, 2020. “We are very much looking forward to the exhibition of the artwork of our artists in the last edition,” said Andreas Fiedler, the head of the German author-illustrator association, and a cofounder of the General Federation of German Artists. “The eight works on the exhibition table will be the last works created by our artists. The will be the last exhibitions of our work in the United States. The exhibition will be an example of the great idea that was to create a greater dialogue with our art world.”Fiedler added that the final artistic work to be included in the exhibition was the artist’", "The next Biennial should be moved to the summer—the organizers say that the renovation of the studio and exhibition space will be completed by February 21—and will kick off with a solo exhibition of works by the artist-in-residence, Hauser & Wirth, and will include a presentation of works by artists including Jasper Johns, Charles Bukowski, and Frank Stella.The organization will also begin an online version of the Biennial called the Biennial Archive, which will be hosted on the website of the artist-in-residence. �This way, the Biennial will be accessible to everyone,� said Sean Carroll, chair of the board of trustees. “The website will have a digital library of over 4,000 works by artists who have chosen to be included in this exhibition. We hope that this new platform will be a powerful addition to the work of the biennial as we go forward in our project of reopening the Biennial.”In March 2019, the Biennial Archive was hacked and over 18,000 pieces of artwork were stolen from the museum. The perpetrator fled the scene and is believed to be in hiding.The 2019 edition of the Biennial was held in March at the local arts center, the Whitney Museum of American", "The next Biennial should take place in the spring of 2022 and will introduce an exciting new exhibition format that will introduce Biennials in new and innovative ways. Sofia Biennials will be at the forefront of this new stage of our programme, adapting to the needs of a changing world through an immersive and art-historical environment\u0097which offers a unique opportunity to address contemporary issues with an unprecedented range of exhibitions.We are very much looking forward to a 2018 that will reflect both the quality and depth of our work. I hope that this biennial will be worthy of the best of the biennial and a new chapter in our history. For us, it represents an ideal time to reflect on the future, to reflect on the past, to reflect on our future. Sofia Biennials is managed by Artadia, a New York–based nonprofit organization that partners with and organizes international artists throughout New York City. The organization offers scholarships to students pursuing creative and critical studies in art and education. The scholarship is based in part on the artist’s academic achievements and is largely based on the artist’s performance in the Artadia Awards, which are given annually. The Scharf Prize for Art and Education will be awarded", "The next Biennial should take place in 2020 and will be hosted by the Museum of Contemporary Art (MCA), Los Angeles. The first edition, titled The Child in the Mirror, was held at the MCA from January 26, 1975 to January 29, 1981 and will be held at the Museum of Contemporary Art, Miami Beach. The new format will run parallel to the existing exhibition Art and Memory, which opened in the previous year and will focus on the relationship between artist and public space.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it will not renew the contract of the former executive director of the Museum of Modern Art (MoMA) who served as the commissioner of the institution from 2010 to 2014. Instead of accepting the recommendations of its board of directors, the DCLA voted to terminate his contract earlier this month.The board of directors had voted 3–2 in favor of terminating Marc Straus, a former senior advisor to Mayor Bill de Blasio and a board member of the Museum’s board of trustees, after he was hired in 2010. Its only dissenting vote came from David Ganson, chairman of the board, who said that the commissioner had not given the institution enough time to address his concerns.", "The next Biennial should be held in 2020. Its first iteration was in 2017.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Charles Purl, the director of the Brooklyn Museum, and associate curator of modern and contemporary art Steven Gordon as co-chairs of the fifty-third edition of the Museum’s Art of the Party, which will take up the theme “Simplicity for the Modern Age.”“The episode will mark the Museum’s third revisiting the iconic museum in the last five years,” said Artnet. The tribute installment, “Simplicity for the Modern Age” opened on March 31 and runs through November 4. The museum will also present a retrospective of the work of six artists in 2020, which is curated by Leslie Tsien. “Charles and Steven are incredibly talented and committed collaborators, both in their respective fields, and their work has been critically and publicly recognized as central to the museum’s exploration of modernism and the museum’s own history,” said William Conti, chair of the board of trustees of the museum. “We are proud to support both of their careers and their visions", "The next Biennial should be held in 2022. They also want to see more exhibitions centered on the work of black artists and to incorporate more indigenous practices into the program.\n\nThe Metropolitan Museum of Art (the museum), which has been struggling to gain traction in the race for the next five years, has announced that it is planning to break ground next week on a $150 million overhaul of its Art and Design Museum (ADM), which will be completed in the spring of 2022. The $125 million overhaul, which will be led by architect and urban designer Kenneth Moore, was already scheduled to start in the fall.“We are at a pivotal moment in our history as we re-unite with the city of Detroit, and the state of Michigan, as we prepare to welcome the public to the new Museum of Contemporary Art (MoCA),” Moore said in a statement. “MoCA will redefine what it means to be a modern museum in the city of Detroit. It will celebrate and celebrate with you, and we will do everything we can to make sure this new Museum of Contemporary Art is the museum that you have come to expect from the city of Detroit.”The renovation project, which will replace the existing museum with a", "The next Biennial should take place in a year when the work was created. In addition to the exhibition, the museum will host a number of biennial workshops and seminars focusing on the exhibition and its legacy.\n\n\nNew York’s Metropolitan Museum of Art, which has been closed since March 29 due to the Covid-19 pandemic, has unveiled its 2020 lineup. Titled “Future Present,” the show will examine the ways in which technology and art are reshaping the future. For the first time, the museum will stage a “Future Now” exhibition, which will take place in the fall of 2020. The show will feature work by thirty-two artists, including Hélio Pérez-Villar, Andrew Kreps, and Mary Martin, and will present work by artists who have not been featured on the international stage in over a decade.“With the help of the artists who participated in this year’s event, the museum has come together to present a future that doesn’t seem far off,” said museum director Patrick Clarke. “By engaging in thoughtful and expansive exploration of the ways that art is reinventing ourselves and the world, we hope to provide a moment of pause", "The next Biennial should consist of a series of workshops, which will discuss issues and ideas from the exhibition space through exhibition installations created by the artists present. The theme will be “Sensuality, Performance, and the Biennial.” \n\n\nThe Leeds-based arts space the Salford Art Gallery (Salford) has announced that it will be taken over by the Leeds-based arts organization Lisson Gallery. The new organization will be based in an old railway depot in Salford and will be run by former executive director Maria Balshaw.Lisson Gallery will be housed in a converted factory in Leeds; it will have a new, 16,000-square-foot space in the city, and it will be run as a nonprofit organization by former staff. The space, which is currently home to the Leeds Institute of Art, will host Thinking About Art, a series of solo exhibitions, and will hold three events a year.In a statement, Salford Art Gallery said: “Together we are drawing together to create a new kind of museum, one that is not just an extension of the city, but one that could be a locus for the heart and soul of the city of Leeds, with", "The next Biennial should take place at the Parish Museum in the City of London, on a visiting basis, in 2021. The 2020 edition is being organized by the London-based foundation, and will be presented by the artist and curator Jonathan Fortier. The festival will include performances by a number of artists and will feature a total of thirty-three films, ten videos, and twenty-two photographs. Citing the film historian and critic Paul Mpagi Sepuya, who was involved in bringing the event to life, the organizers wrote: 'This is not a retrospective of an artist’s latest work but, rather, a project of a creative life he was not yet able to live. The work of the artist is not his or her own, but is experienced through the artist and through his or her work, which is to be experienced in the institution. The project is therefore to create and to participate in an institution outside of the artist’s own hands, a project that is not an attempt to replace the artist.”The fifty-three-year-old Fortier, who has been based in London since the 1980s, has been nominated for a Pulitzer Prize for his work Slumdog Millionaire", "The next Biennial should take place in 2021.\n\n\nIn a new lawsuit, the heirs of a woman who was brutally murdered in a New York City park in 1965 and who was celebrating her birthday at the time, have demanded that the city pay them $28 million in wrongful death and wrongful sep­aration claims. The lawsuit was filed by Julie Jordan and her daughter, Leila Jordan, who was eight years old at the time of the killing.Julie Jordan and her daughter have since been awarded $5 million in wrongful death and wrongful sep­aration claims. The town of Rye, New York, has previously agreed to pay the family $3 million for the wrongful death of a man who was killed by a family member in a park in the town in the late 1970s, but the town settled the wrongful death claim in 2012 for $10 million.The lawsuit claims that the city has failed to protect the estate by not de­parting the estate’s land and has denied the family access to the building where the body of Rineke Dijkstra, a thirty-seven-year-old Dutch-born, Puerto Rican immigrant, was exhumed in 2012. The lawsuit also claims that the city failed to prepare for the reopening of", "The next Biennial should take place in the city in 2021.The development of the new exhibition space is supported by a donation of land, the private donation of Ms. Malmstrom and Ms. Bonta, and the private sponsorship of the city of Copenhagen.\n\n\nConstruction of the new museum, dedicated to twentieth-century art, began in the city of Palazzo Reale in Venice. It will use the structure of a former barracks, which will house approximately 125,000 objects from the collection of the city’s state-funded de Blasio-backed museum.“The Palazzo Reale Museum is a milestone for the city of Venice, as it marks the first time that a museum of this size has been built in the city,” said designer Giuseppe Liguori. “In partnership with the city of Venice, the architect made possible a project that is world-renowned and showcases the most important works by the city’s artists and designers. A new work by María Berrío, a favorite of city activists, is being staged at the museum. The museum is currently being renovated by the city of Venice, with the help of experts from the architectural firm Guggenheim +", "The next Biennial should be held in the spring of 2021, said the organizers. Among the first acts scheduled to participate in the event are Tedium, the Sprach-Kunstverein Berlin (March 19–March 22), and Spiegler-Schneiderhaus Berlin (March 22–March 24). The third exhibition, “The Artist’s World: Biennials and Art in the Age of Mechanical Reproduction” (March 21–March 26), will feature works by artists such as Karolina Wojtas, Nada Vasulka, and Haus de laus. Devotees of the artist will be able to see works from their favorite artists’ lifetimes, as well as from the artists’ most recent works, which will be admirably curated. The event will be divided into two stages, “Let there be light,” which will run from March 14–March 16, and “Let there be shadow,” which will run from March 16–March 20. The first phase will feature approximately twenty-four works, including narratives, sculptures, paintings, performances, photographs, videos, and installations, which will be presented by curators from the", "The next Biennial should focus on “The Great Convergence: Art and Technology in the Twentieth Century” (2019), which will be held at the Art Institute of Chicago (IIC). The exhibition will feature twenty-six works from the exhibition “The Great Convergence” (2017–18) and will be hosted by the IIC. The 2019 exhibition is titled “Collective Dada: Art and the Dadaist Movement” and will run until November 19.\n\n\nThe Museum of Arts and Design (MAD) in New York has appointed Andrew Neiman as its next executive director. Neiman replaces Barbara Hostetter, who retired in May after nine years following a tumultuous tenure as the director of the Brooklyn Museum. Hostetter was succeeded by Jennifer Beasley, who was hired to lead the Museum of Modern Art (MoMA) in Manhattan, but she stepped down after a year. She had hoped to have a new director in place by June and was optimistic that Neiman would be hired soon. Neiman, who previously served as director of the Bronx Museum of the Arts, works as a curator at the Brooklyn Museum and has worked at the institution since 1997. He most recently served as curator of �", "The next Biennial should take place in 2021, with the announcement of the curators of the next edition in 2021. The 2019 edition of the fair took place in the same location, in the same year, and featured work by a select group of English-American artists, including the artists Gavin Brown, James Gauke, Robert Irwin, and Janice Young.Inaugurating the fair was an exhibition of the works of the late socialist and communist artist Alex Abdo’s, “Roots of a New Idea,” which was held in September 1970. The exhibition included works by artists such as Frank Keeler, Louise Bourgeois, Kenneth Turridge, and Robert Irwin.\n\n\nSuper8 Gallery in New York announced today that its new artist-in-residence, John Gernon, will lead the residency and showcase program, which will be held at the West Village—a former Jewish girl’s school located on the Upper East Side—through March of 2020. The institution previously hosted a Gernon show, “After the Fall,” in April 2019. The exhibition featured twelve works, including “What Is a Paddle?” (2018), a series of drawings by Gernon that", "The next Biennial should be in 2020, and if all goes according to plan, the exhibition will open in the spring of 2021. The Biennial is currently on track to raise nearly USD 5 million for the exhibition. According to Ajazu, the venue’s previous event, “The Abbey of Ghent,” staged in 2012, generated USD 3.5 million for the exhibition, which it is now financing through a $1 million donation.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has released guidelines for new art projects in the wake of the recent wave of Covid-19-related deaths across the United States, which has since lead the nation in the coronavirus outbreak. The guidelines touch on how museums and other cultural spaces will engage with visitors following Covid-19, how they may screen films, and how they may hold events and other programming.Called “Strategies for Contemporary Art,” the guidelines are part of a $1.5 billion federal package that will address the virus and the coronavirus-related deaths in the United States. While the guidelines are voluntary, they are meant as a starting point for curating and implementing new programs and", "The next Biennial should occur in a year in which the five classical powers—Italy, France, Germany, and the UK—will have been dissolved. Should the reopening of the Bayreuth Festival of Art be delayed, the inaugural event will be staged in September 2021.Dubbed the Biennale of Venice, the event will be hosted by the interior ministry in partnership with the city of Venice, the city of Palazzo Umbria, the city of Venice Gardens, and the city of Venice. The fair will take place in a park in the city of Venice and will feature a lineup of forty works by sixty-nine artists, including Marcel Prouvé, João Pimentel, Nino Rocha, Pablo Picasso, Lisette Lagnado, Alessandra Medi, and Mark Rylance. The Bologna pavilion will be dedicated to the work of the artist Wella Kunitz, curator of the exhibition in the United States, and will be located in the city of Bologna.The inaugural exhibition, titled “The Biennale of Venice” (under the title “The Classic), will showcase the work of seventy-seven artists, including Klaus Barbie, Alejandro Campo,", "The next Biennial should focus on the history of art in Europe with a view to how it might be restored. The exhibition should entertain philosophical, historical, and political concerns, such as the soul of the art, the political implications of art, and the relationship between art and history. For this reason it is necessary to keep the biennial within the permanent collection of the Museum of Modern Art.The exhibition should also consider how art is politically relevant now and what might be done with some of the cultural artifacts that were looted in the conflict. In the next installment, Art and Power: Art and the Struggle for Democracy (2019–20) , the exhibition will focus on the legacy of French colonialists.\n\n\nThe Toronto-based artist and educator, whose practice spans painting, sculpture, performance, and performance-based art, is suing the city of Toronto to prevent the demolition of a twenty-six-thousand-foot-tall Nathan Phillips Square statue of the late Toronto native Lawrence Abu Hamdan.The controversial work, titled Lawrence Abu Hamdan: The Man Without a Home, and erected in 2007 to commemorate the 2006 bombing of the Canadian Forces base in Kandahar, Afghanistan, is currently being protested by as many as twenty artists and activists, including", "The next Biennial should be set up in 2018, and the first exhibition should open in 2020. Ten artists are currently working at the initiative, in partnership with the Egyptian Ministry of Culture and the Ministry of Culture and Sports (MoCA), and ten more will be chosen from the list of works that were submitted by the public. The selection committee will then begin the work of conducting an exhibition in the public theater in the nearest city. The first exhibition in the museum will be “Tahrir: A Modern Day in the Life of Egypt” (2019) and its second will be “Tahrir: A Contemporary Experience” (2019). \n\n\nA group of Jewish artists who were threatened with arrest for protesting Israeli policy in the occupied West Bank are suing the Israeli government in an attempt to secure the release of three imprisoned Palestinians, including Manal Khader, Ahmad Abu Khdeir, and Walid Abu Khdeir, who were all briefly detained by the Israeli military last month.The lawsuit, filed in the Jerusalem District Court on March 13, claims that the Israeli authorities violated their rights to freedom of expression and assembly by detaining them without charges for two days in a military court in the southern city of Ashkelon on March 10", "The next Biennial should be held in 2021.\n\n\nThe San Francisco Museum of Art (SFMoA) has appointed Frank Gehry, the architect of the City of San Francisco, as the next president of the institution. Gehry will take up the post on January 4, 2020. His term expires in 2022.“Gehry has been a leader in the field of contemporary design for more than thirty years and has established a distinguished legacy for the museum,” said director Daniel H. Weiss. “He has organized exhibitions that have honored both our exhibitions and our collection with the greatest breadth and depth possible, and he has built up an internationally recognized, world-class collection of his work. We are thrilled that he will continue his work in San Francisco and beyond.”The museum has also added three new works to its collection, which was recently awarded a $70,000 Gordon Liddy Fellowship for its exhibition “The Present,” which was staged at the museum in 2017 and inaugurated the Gordon Liddy Center for American Art. The Gordon Liddy Foundation for Contemporary Art has pledged $50,000 to the Gordon Liddy Foundation for the Arts.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced", "The next Biennial should be held at the Museo Nacional de Artes Plásticas, in Madrid, in 2021. \n\n\nThe Jewish Museum in New York and the Metropolitan Museum of Art in New York have announced that they have entered a new partnership, which will allow the institutions to present the 2018 exhibition “The Triennial of Women” in conjunction with the new exhibition “The Art of Fashion: Women of the 20th Century” at the Met. The partnership was announced in partnership with the NY Museum of Modern Art, the Museum of Modern Art and the New Museum, and the New York Academy of Art. The exhibition will run from January 19 to January 22.Inaugurating the partnership is a new “Diana Academy” series, which will examine the history of fashion in the 1930s through an archeological dig at the Anne Frank House in Amsterdam. The exhibition’s first part, “The Art of Fashion” will explore the history of fashion from the French Revolution to the present. “The Museum of Modern Art is pleased to collaborate with the Jewish Museum in New York and the Met to present the exhibition ‘The Art of Fashion’ at the", "The next Biennial should be held in 2021.\n\n\nAmerican Pie, the Broadway musical based in New York City, and the Museum of Modern Art (MoMA) have launched an all-out campaign to retain artists and their work in 2020 as the 2020 iteration of the annual Art Basel (AA) show, “The Art Show,” kicks off in Shanghai on February 11. The campaign, led by a new digital platform called the Artist Map, aims to help fans plan ahead and plan for the 2020 iteration of the event as well as to help artists understand how the departure of five artists will affect their work.“We have created this site to help you understand the impact of the five artists departing in 2020,” reads an artist’s statement. “They have shaped and defined Americana for the past forty years, and in turn, have shaped and defined the future of art. We are hopeful that this future will include their creativity and innovation, and we hope that it will include their talent and vision.”The art-world organization’s new survey of artists’ feelings about the Art Basel and the Art Deco movement, “ART 2020,” will be released on February 14. The", "The next Biennial should be held at the Institute of Contemporary Art, London, and will be comprised of twelve artists\u0097four from underrepresented countries\u0097and will be hosted in the London boroughs of Lambeth, Whitechapel, and Blackheath and will also include an exhibition of works by the five-time winner Kimi Hong Lim\u0097the first South Korean artist to win the Hong Kong Biennial.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $2 million donation from the Jeffries Collection, the J. Paul Getty Trust, and the Bradley Foundation. The donation, which was made at a special fund-raiser for the institution, was made in the name of Raymond Jeffries, who passed away in April 2019 from complications brought on by cancer. A unique exhibit celebrating his 40-year career, “The Modernist Experience: Rayny” will open on October 20, 2020. The museum will then present “The Modernists” (2019–20), an exhibition of work by his fellow countrymen Claude Banville (1893–1969) and Wangechi Mutu (1904–1973), as well as “The", "The next Biennial should be a celebration of the production and the legacy of the first American curator, Paul Gauguin. This will be a step in the right direction in honoring the legacy of the first American modernist, Frederic Remington-Wheeler, who was one of the first artists to be awarded the Pulitzer Prize.”The biennial will be staged in the United States, the United Kingdom, and France, with the final event being held in Milan in January 2020. \n\n\nThe Royal Academy of Arts (RA) in London has received a gift of thirty-seven works by a group of artists led by Alice Black. The museum made the announcement today in a statement. Twelve of the works are from the Alice Black Collection, which includes works by artists such as Claude Monet, Ed Moses, and Annie Prouvost, as well as a selection from the French Ministry of Culture, the Louvre, and the Metropolitan Museum of Art.Black, whose practice encompasses painting, sculpture, photography, performance, installation, performance, and installation, and performance, sculpture, and photography, is perhaps best known for her wide-ranging, multi-dimensional conceptual and conceptual practices. Her work is currently featured in the twenty-fourth edition of the", "The next Biennial should be held in Mydland, Norway, in the autumn of 2022. The competition, which will be organized by the Institute of Contemporary Art and the Norwegian Institute for Contemporary Art, will be attended by artists from twenty-four countries and will take place in the capital, Oslo. The prize will be awarded in November, when the seventy-fifth edition of the Fifth Venice Biennale, which will be held in 2021, will be held.The award, which will be organized by the nonprofit Science Museum Freiburg, Germany, honored the participants who have made outstanding contributions to science and technology. The first prize, which was established in the spring of 2019, was awarded to three Norwegian artists who will collaborate with the Hurkødenskrona, a contemporary art center in the capital city of Saint Petersburg, across the Russian River, in 2020: Anders Borg, Harald Sjoberg, and Per Hjortenberg. The third prize, which was established in collaboration with the Berlin Art Museum and the Museum der Moderner Kunst, Germany, was awarded to Fabiana Flor and Sara Markova. The 2018 prize, which was organized by the Berggruen in cooperation with the Museum der Moderner Kunst,", "The next Biennial should focus on artistic labor in the production of digital works, with particular reference to reproduction and digital images.The first World Earthen Congress, held in Berlin in January 1916, aimed to spur the rediscovery and cultivation of artistic labor in industrial settings. In a letter to the editors of Artforum in February 1916, Hartmut N. von Städels wrote: “The artists are one of the most important forces in history. They have created the great mass of the present. Their creative activity forms the salient point of the entire history of art.” N. von Städels’s Letter to the Artforum’s Artforum staff is included in the exhibition “Art and Science” (2017–18), which opened on the occasion of the exhibition’s twenty-fifth anniversary.\n\n\nThe Ferrari Museum in Italy has appointed Eva Presenhuber as its next director, replacing Davide Ghebbi, who retired in March 2019 after twenty-six years with twenty-eight years at the helm of the institution. She succeeds Silvio Marchetti, who led the museum for twenty-three years, and will take up her post in September.“It is", "The next Biennial should go ahead as planned, but will suspend and consider the proposals until further notice. The reason for the suspension is that the organizers of the second Biennial have announced that they are unable to guarantee the safety of participants.“We are deeply concerned by the announcement that the organizers of the second Biennial have stated that there is a high possibility of the Biennial being cancelled due to the virus,” said Fredric Wyss, chair of the commission. “We have not yet had any indication that this event is being cancelled or postponed. We are however of the view that such a situation is not ideal, and we have been closely monitoring the situation. We have been in touch with the organisers and the Biennial in order to try to help them as best as we can, and to offer our support and guidance, once the coronavirus threat is passed.”The first Biennial was held in 2015, and the first iteration, titled “The Joy of Painting”, was staged in the spring of 2016. The inaugural edition, titled “The Death of Painting”, opened in June and ran for sixteen weeks. The second Biennial, titled “Humiliation of Painting”, was staged a", "The next Biennial should take place in the second half of the year, and will be hosted by the Swiss Federal Institute of Contemporary Art (AFIZ) in Zurich, the city of Bern, the Basel Center for Contemporary Art (CFCA), the Kunsthalle Basel, the Museu de Arte de São Paulo, and the Museum of Contemporary Art, New York. The .NET Festival is also collaborating with the architecture studio and architect Saul Erdman on a new exhibition, “The Heart of Man in Architecture,” which will inaugurate the Frieze Architecture and Design Biennial in Beijing.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Leslie Blesus as its next director. Blesus will succeed David H. Koch, who will retire on October 31 after nearly four decades at the helm of the museum, and will assume her post at a time when the institution is undergoing a major renovation.“We are thrilled to welcome Leslie to the Museum,” said John McInerney, the director of the Museum of Modern Art and the Museum of Modern Art: “She is experienced, driven, and ambitious, and we look forward to her leading the museum through a", "The next Biennial should be held in the spring of 2021.\n\n\nThe PEN American Art National and the PEN, which was founded in 2013 by William Pitt and Catherine Johnson, are suing each other over a new digital art theft protection system that would require authorized users to register with a single, online account and prove their identity. The lawsuit, filed in the United States District Court for the Southern District of New York on April 2, claims that the new system infringes upon the artists’ privacy by allowing third parties to identify the works that are protected by copyright and thereby deterring them from reporting suspected copyright infringers.The case stems from a series of circumvention incidents involving Andrew Kreps, the founder of the Kreps Gallery in Manhattan, and his brother-in-law, Jesse, who installed an unauthorized digital work on the wall of the PEN in 2016. The brothers then installed an unauthorized digital reproduction of the work, entitled aps, in a different location in the museum. The work was removed by Jesse Kreps, who was commissioned by the family, and the family moved the original work to a storage area at the museum.After the brothers were identified as suspects in the investigation, the PEN maintained a database of the offenders and notified", "The next Biennial should not be a showcase for the work of a few, but should be a celebration of the many. I hope that this year’s edition will be a major step in that mission.”\n\n\nThe late American collectors and activist Ruth Bader Ginsburg (1929–2004) and her husband, David Ginsburg, have announced that they are separating and are expecting their first child. The couple have been together for thirty years and were married in New York on March 16, 1999. They were divorced in California in 2005, but rekindled their relationship in 2006 after the couple moved to Los Angeles.More than twenty years after their separation was finalized, the Ginsburgs welcomed their first child, a son, in a ceremony in front of David’s grave in Mountain View, California. The couple celebrated the occasion in 2011 by moving to Los Angeles.David Ginsburg retired in 2011, but remained active and funded his own art-world endeavors. He founded the nonprofit the David Ginsburg Foundation for Arts and the Arts, which supports cultural causes in support of people with disabilities, and the Ginsburg Foundation for Alumni, which supports alumni at the Ginsburg School of Art. In addition, the foundation raised funds for the", "The next Biennial should take place in the fall of 2020. The first, “Theatre of Biennial: The Biennial of Martin Fitts,” was held in March 2018.The 2019 edition of the exhibition featured the work of seventy-eight artists, including Julie Mehretu, Gere Justice, and Mark Braid, as well as the work of contemporary and contemporary art. The exhibition also featured the work of more than thirty guests, including American painter Paul Gauguin, Indian artist K. S. Krishnamurthy, artist and philosopher Michelangelo Antonioni, the Rijksmuseum Amsterdam, and the Tate Britain. The work of the British artist John Constable was also featured in the exhibition. The biennial will organize a number of exhibitions, including the Centre Pompidou in Paris, the Tate Modern in London, the Serpentine Galleries in London, the Sydney Opera House, and the Royal Opera House, and will present a number of projects, including a survey of the contemporary art of Amadou Ade, a retrospective of the work of Dutch photographer Marcin Witte, and the artist’s studio in the Sahara, in addition to a special exhibition of work by Dutch sculptor", "The next Biennial should take place in 2019.\n\n\nThe City of San Francisco is planning to demolish the World War II–era San Francisco Museum of Art (SFMoA), one of the city’s oldest cultural institutions, in an effort to make way for a new public park and a new UC Berkeley campus. The planned redevelopment of the former MFA is part of a $125 million overhaul of the city’s waterfront, which is expected to be completed in 2023.According to the San Francisco Chronicle, the change will involve the demolition of the structure’s historic artworks and a renovation of the bay’s shoreline. The $125 million total includes the demolition of the museum’s existing home on Tellico Street and the renovation of the existing building.SFMoA will soon be reborn as the SF Museum of Modern Art, which will have a permanent location on the same campus as the museum. Plans for the new museum have not yet been released. In an email sent to SFMoA’s supporters on Monday, the organization wrote: “SFMoA is a museum unto itself, a living institution that has developed over forty-five years as a collective of committed curators, scholars, and", "The next Biennial should be held sometime in the 2020s. Curated by Jamie Gunter and featuring work from eighty-eight artists, including Daniil Kolesnik, Ai Weiwei, Thomas Hirsch, Mark Rylance, and Yinka Shonibaren, the exhibition will also include a selection of works from the first international exhibition of Luis Buñuel’s work, the “Luis Buñuel’s New World,” which will open in Mexico City in November 2020.“The first Republica Galería Biennial was founded in 1979 by the artist Diego Fusi with the intention of creating a mass exhibition of his work in order to create a new paradigm for the exhibition,” said Fusi. “In 2001, the project was inaugurated by Fusi’s wife and his collaborators, Diego Pirotte and Íñigo Solmi, to create a biennial to explore the complex relationship between art and history in Mexico City. The project has been successful and we are thrilled to see the results of our work.”\n\n\nThe Museum of Modern Art (MoMA) in New York has constructed an exhibition dedicated to the life and work of the", "The next Biennial should be held in 2020, but not earliest because of the ongoing health crisis. \n The A.F.C.C., which has a history of using the death of a superintendent as a bargaining chip, has retained former president Barbara Kruger, who was forced out of the organization in March 2019, to spearhead a campaign for changes. “The A.F.C.C. will not be silenced, and we will use every tool at our disposal to advance our agenda to improve the lives of students and educators across the country,” said Kruger, who has represented New York City in the Olympics and the World Triennial. “By listening to students and educators across the country, I know that there are powerful forces at work that must be addressed.” The A.F.C.C., which has five campuses in New York, Boston, and Los Angeles, has faced pushback from educators and students alike. On March 18, the New York Times published an examination of the organization’s relationship with the University of California, Los Angeles. The article revealed that the A.F.C.C. had awarded the school $1.05 million in 2019 after it", "The next Biennial should be held in 2020. The theme of the exhibition should be the history of the art of the current period.\n\n\nThe French Ministry of Culture has appointed Gabriella Parent as the next director of the Museum d’Art et d’Histo, in Paris, which she will assume in February 2021. In her new role, Parent will be responsible for the development and implementation of French art and culture across the country. “Gabriella’s agenda for the Museum d’Art et d’Histo is to develop an international artistic environment of creativity and to shape the historical, cultural, and social landscape,” she said in a statement. “Museums are essential for the functioning of modern societies and are continually renewed as the main means of transmitting cultural knowledge.”The appointment marks a significant step in the ministry’s effort to consolidate its holdings of historic French art. In September 2018, the ministry announced the acquisition of 171 works by roughly 850 French artists and art workers. Since then, it has also launched numerous initiatives, including the establishment of the Gallery of the Two Cultures and the Centre d’Arles, which aims to foster dialogue between Paris’", "The next Biennial should take place in 2020, at which point the institution will expand the programme to include one hundred works by forty artists in a retrospective which will include a selection of their work during the city’s centenary year.\n\n\nThe City of London Museum of Art (CMLA) in New York has received a gift of more than fifty rare works by artist David Salle from his longtime collaborator César Albert. The gift includes a selection of work from his series “From the Ground Up” (1954–55) and “From the Ground Up II” (1968–69) that were recently exhibited in an exhibition organized by the CMLA, “From the Ground Up, II” (2017–18), at the Museum of Modern Art in New York.“César Albert is a wonderful, hands-on collaborator who has made so many of the works in the series available to us in the form of their notebooks,” said director Christian Schell. “We are thrilled that David has been able to share these collections with us and that they are finally accessible online. We will continue to work with César to make the most of his vast knowledge and expertise.�", "The next Biennial should aim to create the conditions for a new national dialogue on the role of art and architecture in the life and history of the country and the world, with the goal of creating the conditions for a more effective cooperation between the two countries. The Biennial will inaugurate the first exhibition of the new series, which will open in September 2020, and will take up the themes of the second and third biennials, which will be held in March and June 2021. The new biennial will be organized in collaboration with the artists that live and work in the city and will be led by the director of the CNE, Guadalupe Rosales, and the founder of the modernist Museum Azul in the capital, Mexico City. Interestingly, Málaga has been holding an exhibition in partnership with the city of Mexico since 2016, and this is the second year the commission was made possible by the city of Mexico.Prior to the move, Rosales worked in the Azulnes museum and in the Museo de Arte Contemporáneo, Mexico City, where he curated “Representations of Art,” for a three-year period from 2009 to 2013. In 2013, Rosales was awarded the Rub", "The next Biennial should take place at the district museum in the first week of February 2019, and will include a selection of original works. For the first exhibition in the series, the museum will present a selection of work by the artist Yamcha Noguchi, an artist who was featured in Noguchi, 1986, 1990, and Arts of Living, 2006. The biennial’s second section will be devoted to the concept of the assemblage. “The Biennial does not serve as a precious counterpoint to contemporary art, but as an integral introduction,” Noguchi said in a statement. “As an artist who works in mass production and assembles, I would like to see more of these exhibitions, and I would like to see more of these works reflected in the art world. I hope that this year’s Biennial will reflect the tremendous growth of our art world in 2020. The final part of the series is a collection of works that were created in the former Soviet Union. It is not an attempt to re-create the artist’s studio in the former Soviet Union, but an attempt to present a historical account.”\n\n\nThe Royal", "The next Biennial should be in the spring of 2020.\n\n\nThe Montauk Museum of Art in New York has appointed Sheri Viso as its new director and chief curator. She will assume her new post on January 1, 2020.“Sheri Viso has been an integral member of the museum’s team throughout its history, first serving as a curatorial consultant for the 2018 exhibition “The Love and Death of Man” (2019), a retrospective of the work of mid-twentieth-century American painters, and as the inaugural director of the museum’s space devoted to women artists (the Whitney Museum of American Art). She also served as co–chair of the museum’s inaugural Women’s History Month panel and project co–chair for the museum’s inaugural remastered edition of Cynthia Rowland’s “Cindy and Lowell” (2019–2020).“At this exciting time of transformation for the Arts, I’m eager to work with and continue to support the dedicated team and the museum,” said Sheri Viso. “I’m excited to work with the talented curators and the dedicated staff at the Montau", "The next Biennial should be set in the historic town of Saatchi, which is located on a small island in the Bering Sea, in the northern province of Prince William Sound. The theme of the year will be “The Future Is Now.” Inaugurating the event will be a series of public artworks by twenty-six artists, including Lauren Beukes, Jenny Gold, and Kayodeo Johnson, as well as a live performance by the Patels, an indigenous Southeast Asian folk group whose members are represented by an association that is known as the Patels/Northeast. The biennial was founded in 2009 by the Patels and will run through the end of the year. “The events of the last year have demonstrated our belief in the transformative influence that art can have in changing our world,” said Patels president and CEO Khaled Abou-Rahme. “We are excited to continue our work and to continue to support artists and their communities, particularly in the Southeast, and to build on the success of our inaugural year.”Other artists who will represent their areas of interest in the biennial are Maurice Barlow and Jodi Throckmorton, who will", "The next Biennial should be a departure from the tradition of the previous three biennials, which have focused on social development and community engagement. “This new biennial will be an attempt to create new and radical images of the future,” Daniela Castro, the executive director of the University of Chicago, told the Art Newspaper.The Biennial has received a $50,000 donation from the Wayne and Anne Skal and the Carnegie Foundation. The donation was made after the Skal-Cavalli Foundation for the Arts, which supports the Skal-Cavalli Foundation, and the philanthropists decided to create a new fund for arts and cultural heritage. The fund will focus on preservation and restoration and will begin to distribute the $250,000 prize in January 2020. \n\n\nThe Museums Association (MA), a United Kingdom–based conservation organization, has released revised guidelines for the exhibition “Museums in Distress: Art and the Struggle for Survival,” which was staged in London in December 2019 and was canceled due to Covid-19. The event was scheduled to run from March 23 to March 26, 2020, and was meant to commemorate the theme of the contemporary era—“living together—whether", "The next Biennial should launch in 2021 on a budget of $200 million, with the aim of commemorating the centenary of the formation of the International Tribunal for the Criminally Insane, which was founded in 1925 by the German Federal Government and the Vatican. Dubbed the Istanbul Declaration, the first international document advocating the rehabilitation and reintegration of the sick and disabled, the twenty-third edition will run from March 10 to March 14.Curated by Ann-Marie Armitage, director of the Centre for Contemporary Art at the University of the Arts London, the twenty-fifth edition will be staged at the National Gallery in London, the Royal Academy of Arts, and the London Academy of Art. Since its inception in 1988, the International Tribunal for the Criminally Insane (ITKC) has been a platform for critical dialogues between academics, activists, and representatives of the psychiatric profession. The exhibition will feature the work of forty-eight survivors of the Holocaust and their representatives, and will take place in the form of an immersive installation, which will test the boundaries of what it means to be a human being with the help of an interdisciplinary team led by art historian Fred Wilson and visual artist Christina Hesse. Previewed by curator Adrian Piper, the", "The next Biennial should be held in 2019. Bystander's Memorial, a biennial that honors the lives of Americans who have died in the line of duty, will draw twenty-six thousand visitors to its World War II centenary fair in 2021. It will also increase the number of artists represented by the fair by two hundred percent. \n\n\nThe National Gallery of Art in Washington, DC, has received a gift of more than eleven thousand photographs by renowned American photographer David Adjay. The gift includes a selection of five New York–based artists: Alexander Calder, Jodi Throckmorton, Tanya Bonakdar, and Luke Chiu. The pieces were donated by Jaye Takeda, who lives in New York; Peter Davidson, who also lives in New York; and David Warner, who was the managing director of the Lincoln Center in New York.The gift was made through David Adjay’s longtime collaborator and friend Mickey Dumond, who was generous enough to let National Gallery director Robert Mapplethorpe know about the forthcoming importation of the works. The institution previously gifted David Adjay some forty photographs by John Kenneth Gass, Peter Dieguez, and Ravi Khosla.“The", "The next Biennial should be in September 2021. Pace Gallery is also working with the city to create more than one hundred new spaces for the arts, while Pace’s sister gallery, Pace + Partners, announced last month that it will partner with the city to develop new public spaces around the city. \n\n\nThe Ortega y Puerta organization in Mexico City has appointed María Berrada, a former staff member of the Los Angeles County Museum of Art (LACMA), as its first director. Berrada will begin her new role on January 25, 2020. Berrada will take up the post in the capital’s Metropolitan Museum of Art (MMCA), which was recently renovated by the architectural firm Gensler Architects. Berrada will be responsible for planning and executing the museum’s construction, renovation, and extension projects, which were completed in 2016.“The museum is currently undergoing a major expansion, which is expected to be completed in 2021, and while this new complex is yet to open, María and the staff have been working hard to bring you the most amazing exhibitions and concerts in the museum’s history,” said Matt Slocum, president of the CNE", "The next Biennial should be a celebration of its 150th anniversary; the next will be a time to reflect on the art we take for granted; and the last will be a time to reflect on the future.”The 2019 festival will premiere work by artists from twenty-five countries. Among the artists chosen for the event are Sean Kelly (Spain), Lin-Manuel Miranda (Spain), Nara Schade (United States), and Elsa-Sophie Andersson (Norway). The event will also serve as a platform for dialogue with indigenous and regionally based artists from the Americas and Europe.\n\n\nThe Los Angeles County Museum of Art (LACMA) has released the list of ninety-three artists and collectives who are represented by the institution for the 2020 season. The initiative is part of the organization’s #MoArt 2020 campaign, which aims to inspire, support, and retain creative and talented Los Angeles–based artists.“The work of fifty-six artists is housed within the museum, and LACMA is committed to addressing the needs of a diverse and underrecognized community of artists by supporting their exhibitions, programs, and collections,” said LACMA director Manfredo Delvalle. The", "The next Biennial should have a retrospective of the work of the artist. The exhibition should be organised according to the instructions of the artist, and the programme should be curated by the artist.”The commissioning institution of the Biennial, the Museum of Modern Art, located in the former cream factory in the East Village of New York, has yet to decide on a date for its reopening.\n\n\nForty-five artists and collectors have been awarded the $10,000 Juanita and André Acosta Prize for their contributions to the art world’s cultural life in the city of Los Angeles. The Acosta Prize was established by the couple in honor of their late father, Andre Acosta, whose collection includes works by artists like Lonnie Aaronson, James Dean, and Robert Irwin. Established in recognition of their dedication to the arts, the award was established in 1982 by the Juarez-based organization Artemas, which was founded by André and his wife, Maria, and was cofounded by his son, Luca.The Acosta Prize is one of three awards that unite contemporary art with Mexican culture. The other two awards are the Ateliers Du Monde and the Museum de Mexico. The husband and", "The next Biennial should be held in 2020.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is now accepting applications for its 2020 biennial, “Between Thresholds: Poetics and Performance,” which will take place at the museum from August 22 to August 27. MFA Los Angeles’s inaugural season’s theme, “The Limits of Performance,” will include performances by MCA artists, including Erica Menconi, Annaleigh Ashford, Laurie Anderson, Lisa Ann Horvath, and Alaina Hoxie.“We’ve been working towards this theme for some time, and it is a theme that unites our teams and our curators—it speaks to the essence of artmaking and performance,” said executive director JayWonea. “It is an opportunity to hear the voices of some of our most celebrated artists, and to see their work and hear their work for the first time. We are excited to see how the concept plays out in the desert of Southwestern Nevada, and to engage with the visionary work of these pioneers and their legacy.”The festival will be hosted at the museum in partnership with the Center", "The next Biennial should be held at least once a year.  This is not just a time to reflect, it is a time to create. It is time to re-examine, re-examine again and again, and to repeat. It is time to reflect on what we stand for. It is time to reflect on all the ways in which the history of our generation is shaped by the past. It is time to reflect on the ways in which we are connected to other cultures; to explore ways of being connected to others and the ways in which we may become more connected to the world. It is time to reflect on the long-term prospects of this work, to reflect on the prospects for a new and improved way of being connected to the world; to reflect on the ways in which we are connected to one another. It is time to reflect on the ways in which we are connected to the world around us, to reflect on the ways in which we are interconnected to the world. It is time to reflect on what we stand for and on what we are capable of becoming. It is time to reflect on the world we live in and the things within it that connect us together. It is", "The next Biennial should launch in 2021. \n\n\nProfessor Stephen Hawking has warned that unless action is taken against Britain and the European Union, the world will continue to burn through fossil fuels at an alarming rate that will also see a rapid rise in climate change. In an op-ed published in The Guardian on Tuesday, Hawking wrote: “Our species has made great strides in the past hundred years toward reducing the amount of carbon dioxide in the atmosphere, but the progress has been slow and uneven. If we continue at this pace, we will not avoid catastrophic change, and we will likely become a much poorer and a much sicker world.”The author of numerous books and countless articles on topics ranging from medicine to astrophysics, Hawking had made headlines last year when he wrote an open letter to the British government in support of the Paris climate deal, which aims to limit the rise in global temperature to 2 degrees Celsius. In the letter, Hawking argued that the deal will not only avert the worst effects of climate change, but also stimulate the economy and even spur the creation of new jobs. He also called for a shift from fossil fuels to renewable energy—a shift he claims will be “transformative in many ways.”A spokesperson for", "The next Biennial should focus on “the politics of memory,” according to Istanbul’s Culture and Tourism Ministry, which has listed a series of exhibitions on Turkey’s Armenian Genocide as one of the five themes of the 2020 edition.“The latest challenges of history are constantly faced in everyday life, but also in the arts,” said Istanbul’s Culture and Tourism Minister Ulla Büyükçü. “We are planning to organize exhibitions on the Armenian Genocide in order to integrate these themes into the exhibition program with a view to preserving the Armenian culture and identity.”The 20th edition of the exhibition will be held at the Pamukkale Cultural Heritage Museum in Istanbul and will feature works by seventy-six artists, including Ami Syed, Yükke and Künsthal, Apichat Palshik, Hassan Al-Ulukaya, and Muna G. Abidi. The exhibition will also present the first exhibition dedicated to the Armenian Genocide in Turkey , an exhibition of 25 works on paper by twenty-six artists. \n\n\nThe Mount Desert Museum in California is launching an initiative aimed at helping communities remain connected to the arts through the", "The next Biennial should be in 2021-22. Tickets for the 2020 event will go on sale in the fall of 2020.  It will be hosted by the New Museum in New York through the New Museum of Art in Boston, curated by Darby English, and will take place at the New Museum’s new 750,000 square-foot campus. The 2020 edition will be held from February 21 to February 23 and will include interviews with a selection of contemporary artists, including Sajid Johnson and Alberto Ceccaretti.\n\n\n\n\n\nThe Jackson Pollock Foundation is launching an initiative to increase the visibility of African American artists in the United States through the commission of artworks by African American artists. The initiative will involve the donation of two hundred works by eighty-five artists. It will also involve the provision of free and discounted tickets to screenings of the works, as well as the creation of an online database of works by African American artists.The initiative is part of the foundation’s ongoing work to increase the visibility of Black artists in the United States, which is supported by a grant from the William and Flora Hewitt Foundation. The other grantee is the Robert Rauschenberg", "The next Biennial should include a survey of the life and work of Palestinian artist Walid Raad and the exhibition should focus on the history of art in Palestine, specifically on the life and work of Palestinian artist Nima Nabavi. The exhibition will also include one-hundred works by artists from the former territories, including the artists from the West Bank and Gaza Strip.The 2013 edition of the Biennial was held at the Al-Aqsa Mosque in Jerusalem and was curated by Ahmad Tartousi and Ahmad Awwad in partnership with the Jerusalem Art Center. The next edition will be held at Al-Aqsa Mosque and Al-Ajaz in the Christian Quarter of Jerusalem, the Al-Audah Museum in the Al-Ain al-Arab city of Ma'an, and the Al-Akhbar Museum in the Al-Akhbar in the Al-Aqsa Mosque.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Laura DeSousa as its new associate director for curatorial affairs. DeSousa comes to the museum from the Museum of Fine Arts in New York, where she currently serves as director of the digital collection and curatorial program, which curates works", "The next Biennial should be held at the Museums in the Kiasma Gallery in Kassel; the Schlosshaus in Kassel; and the Kunsthalle Basel in Berlin.The Los Angeles Biennial will take place at the Hirshhorn Museum and Sculpture Garden in Washington, DC; the Los Angeles County Museum of Art; and the San Francisco Museum of Art. \n\n\nFilipino American scholar and designer Arturo Pérez-Santiago (1907–2010) died on September 5 at the age of eighty-one.Born in Santa Ana, California, in the small town of Santa Ana, Pérez-Santiago studied at the University of California, Berkeley, and the University of California, Los Angeles, before eventually settling in Los Angeles. Pérez-Santiago studied at the Art Institute of Chicago, the Art of Manliness, the Art of War, and the Art of Architecture. In 1958, Pérez-Santiago was awarded an honorary doctorate from the University of California, Berkeley, by then-president Richard M. Nixon.Pérez-Santiago later studied in the French Academy in Rome, the Academy of Fine Arts in Paris, and the", "The next Biennial should take place in December 2021. The institution will re-create the museum’s original exhibition spaces, organize new exhibitions and participate in other programming, including a book club reading series, an interactive performance series, and a film program. “The next Biennial should take place in December 2021.” The institution says the redesign will increase the museum’s accessibility and enhance its visual art. The redesign will also include the creation of an outdoor plaza and a redesigned concourse. The project, which has been in the works since 2015, was hailed as a breakthrough by museum designers, who argued that such a monumental renovation would herald a new era of the museum. “In the next few years, the architecture of the Biennial will be transformed, and by the people of the city of Helsinki, in a way that reflects its priorities and our vision for the museum,” director Martti Ahtisaari told the Art Newspaper. The redesign will also introduce new modes of transport, including a new tram route and a bus line. The renovations will also involve the opening of the museum’s first exhibition space in the new building, the Peterbilt building, in the summer and the renovation of the museum", "The next Biennial should be announced soon. “A special place for New Yorkers to be in the heart of the city,” said David Littman, chair of the Museum of Modern Art. “The goal of the Biennial is to develop a sense of community and engagement with the city of New York, and to increase understanding and appreciation of New York City.” In addition to the curatorial team, the Biennial will host a number of programs, including a preview of the upcoming documentary, The Last of Our Kind (2017), and the first-ever Biennial of American Design.\n\n\nThis week, the Museum of Contemporary Art (MoCA), Chicago, inaugurated its new digs on the city’s South Side. The museum’s new home is named after the city’s wealth of cultural, historic, and natural wonders—a city that has inspired the Museum of Modern Art to be born and thrive within its borders. The institution will boast numerous spaces designed by the renowned Chicago-based firm LESSA, which is known for creating thoughtful and influential public works across the city, and will boast a collection of more than 1,500 works to enliven the city’s central business district", "The next Biennial should be held within six months. The upcoming exhibition will focus on “The Evolution of Pain,” a history of pain that traces its origin to the discovery of the art of the ancient Greeks and the Renaissance. The 2019 edition consisted of fifty works, of which forty-eight were commissioned by no fewer than twenty-four artists.The 2020 edition will feature fifty works by forty-four artists—with the addition of a half-dozen works from the collection that were unrepresented in the previous exhibition. The 2020 exhibition will mark the fourth exhibition of the Biennial and will run concurrently with the forthcoming Pirelli Biennial, which will take place in Florence in the autumn of 2021. At the exhibition, the curator of the exhibition will be Giacomo Peglia, the curator of the Pirelli pavilion, and the director of the regatta in the city of Milan. The exhibition will promote the work of artists whose work has been exhibited internationally and include an exhibition of work by more than 2,500 works by thirty-nine artists who have been invited to participate in the upcoming edition.The exhibition will also present work by thirty-six artists who have participated in the exhibition in the past. Among the works that", "The next Biennial should be held in 2020, and the first exhibition will open in Helsinki in March 2021.\n\n\nBetween a dozen and twenty artworks by artists whose works are currently on display at the Frieze Art Fair in Miami will be presented as part of the next edition of the fair, which will take place at the Miami Art Museum (MAM). The exhibition will also include a selection of essays that examine contemporary topics and will present a new selection of works by artists in partnership with the Miami-based nonprofit organization Blue Start.“We are currently preparing for the 2018–19 biennial, which will include a number of artists who have not made it to Miami in a decade,” MAM director Janice Nichols said in a statement. “We are thrilled to present this year’s exhibition in Miami, which will draw visitors from all over the world. The biennial has the potential to draw new and exciting artists to our city and is a great platform for the development of new work.” The exhibition will celebrate the state of art in Miami–Dade County, which is home to some twenty million people and is undertaking a $10 billion revitalization project. The project, dubbed the Miami Downtown Plan, includes the", "The next Biennial should take place in 2021, and will comprise fourteen exhibitions: four each of photography, sculpture, installation, performance, and video art.\n\n\nThe International Committee for the Preservation of Modern Art (ICPA) and the Museum of Contemporary Art (MoCA) in Los Angeles are working together on a new partnership that will extend the life of the iconic American art museum and its collection. The initiative will involve the construction of an international architecture, designed and constructed by MoCA architects, and will be supported by a $25 million donation from the wealthy philanthropist and collector Roberta Smith.“Icarus’s building and renovation of the museum is a landmark in the city of Los Angeles,” said Smith. “It embodies everything that makes the institution special, and has been for seventy years. It is the perfect site for the exhibition of all the works in the museum’s collection, and for the collection’s long-term plan, which I believe will include a new exhibition devoted to photography.”The partnership was introduced at a special press event held on June 24 at Jaguar Land Rover’s headquarters in London, with a presentation of the company’s new car, the Jaguar XE", "The next Biennial should organize a number of exhibitions of artworks, including artworks from the American and British collections, and I believe the first one should be a statement about the diversity of cultural perspectives that we are able to bring to the table.”Commenting on the biennial, Sergey Dyakonov, the curatorial director of the New Museum and Art, said: “The recent exhibition ‘Peoples’s Power: Avant-Garde Art and Anti-Capitalism” at the New Museum will provide a series of works by the artist-run projects in Moscow. Biennials have a history of reclaiming cultural heritage sites from the state, but also of stifling creativity and pan-Africanism. The exhibition will be inaugurated by “La Bamba” (1972), a work by the South American artist and activist Miguel Ángel Remo Rodríguez that was stolen from the exhibition in 2015 and never returned to the museum.The Biennials are an annual endeavor of the Russian government. The 2017 edition, organized by the Academy of Fine Arts in Moscow, marked the sixty-fifth anniversary of its founding.\n\n\nThe Center for Contemporary Art in the City of Chicago (", "The next Biennial should begin this fall and will be held in the heart of the’s Green Park, the former site of the Noguchi Museum and the Minneapolis Art Museum. In the past, the show has drawn an average of 2.5 million visitors annually. The 2019 edition will feature work by forty-three artists, including Calvin Chiu, Alex Dallaglio, Leo Freund, and Michael Casey, as well as a selection of new work by artists such as Louise Bourgeois, Marcel Proust, and Pierre-Auguste Renoir.The full list of participating artists is as follows:Adam Laurie (New York)Mario Balig (California)Lari Bonner (New York)Patrick Casey (New York)Sarah Klohman (New York)Arnaldo Caban (Mexico)Julio Cesar (Mexico)Frank Caballero (New York)Marcelo Cervetto (Mexico)Jeff DeFrancesco (New York)Marlene Lavellan (New York)Elyse McAllister (New York)Liam Redmond (New York)Liriano Rivero (New York)Zoé Sayn (New York)Lucky Seagull (New York)", "The next Biennial should have the ability to incorporate both live and curated exhibitions, and should be open to all communities in the city. \n\n\nThe 2018 Detroit Art Fair was postponed due to the Covid-19 pandemic. The fair, which was originally slated to run from March 14 to March 15, was rescheduled for April 7–April 8. It will now be held at the Detroit Institute of Arts (DIA). The April date is a departure from the original and part of a three-month turnaround, which also saw the fair move from March to April and the opening of the new DIA’s new campus, the DIA, in April.“We are acutely aware of the challenges posed by Covid-19, and we look forward to continuing to offer a spirited, free, and accessible platform for thoughtful discussion and creative experimentation,” said Brad Adams, the fair’s artistic director. The fair’s opening party will now take place on April 5.\n\n\nThe Whitney Museum of American Art in New York has named Kirsten Brown as its new deputy director and chief curator. Brown comes to the institution from the Robert Rauschenberg Foundation, where she has served as associate curator of modern", "The next Biennial should be held in the autumn of 2021. The twenty-eighth edition will be staged in the United States and will run from October 5 to October 8, 2021.\n\n\nOn Wednesday, the Royal Academy of Arts (RA) in London announced that the next edition of the London Biennale will be held in the summer of 2022. The announcement came after the academy voted to extend the residency of Wangechi Mutu, the president of South Africa, for another six months from September 1, 2022 to September 7, 2022. The decision was made in the wake of a controversy surrounding the twenty-eight-year-old, who was selected as the winner of the Oslo Prize, but left the honor in the face of widespread protests from critics and the African and international community.“The biennial has been in development since 2018 and we are now in an ideal position to stage the next edition at our venue in May 2022,” said RA director Maria Balshaw. “We have been working closely with our writers, artists, curators, and supporters and have been listening to their concerns from the outset. The outcome of this year’s biennial is an invitation to engage with new ideas and new", "The next Biennial should be in 2020, and the next will be in 2021.\n\n\nThe Red Lion Art Center in New York has announced that it is working with the artist-run nonprofit the New Sanctuary Coalition (NSC), which was founded by a group of New York–based artists in order to improve the treatment of refugees and immigrants living in the city, to create an immersive art project that will explore the relationships between the contemporary art world and the American Southwest. The initiative, which will be staged in the Red Lion and take place in stages in stages, will culminate with a retrospective of art created by twenty-seven artists that will invite visitors to experience the work and cultural exchange that occurs between the two institutions.The exhibition will take the form of a series of interrelated paintings by sixteen artists. The program will feature work by artists who have previously collaborated or will collaborate in the New Sanctuary Coalition, as well as artists who have not been part of the coalition. Below is a list of artists selected for the project. The full list can be found on the Red Lion’s website. \n\nThe new museum-like venue, designed by international architecture and landscape firm Maison Margiela, will host a four-day exhibition of new", "The next Biennial should be held at the Juxtaposition Museum in Los Angeles next year and will announce its next creative director, the site of which was recently restored by the San Francisco Museum of Modern Art, in the spring of 2020. The museum will also unveil a grand opening celebration of the museum in the fall of 2020.“The upcoming Biennial is a triumph of imagination and design, both in its design and execution,” said curator and director Pierre Le Devoir. “The project integrates art with science, technology, and sustainability, and demonstrates to the world how art can design and science dream together, harnessing both sciences and art to create new realities.” The exhibition celebrates the continuing legacy of the French surrealist Auguste Comte (1879–1975), who invented the term “art” and whose work is still being recreated in the work of French artists Tomás Almeida and Yves Agnieszka, as well as in works by Austrian sculptors Wolfgang and Lisbeth von Rägl, and German naturalists Ingvild Wirth and Hans Werner Herzog.Commenting on the project, Oskar Eustis, director and CEO of the D", "The next Biennial should take place in the autumn of 2020. The first iteration, held in April, was attended by approximately half a dozen artists in collaboration with the teams behind the projects. Artists participating in the biennial include Alexander Calder, Filippo Berni, Anish Kapoor, Ola Sobel, Osmose Østgaard, and Jost-Eric Verlag.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has acquired a new fifteen-foot-tall bronze sculpture by artist Leslie-Anne Lovelace that is based on an early work by the American photographer Guy-Manuel de Homem-Christo. The purchase of the work, titled “Ikon,” for $2,500,600, which was created in 1999 and is currently on display in the Center for American Art in New York, was made in support of the work of artists and organizations that are dedicated to the preservation and promotion of cultural heritage.“This is a true moment,” said Leslie-Anne Lovelace, who is currently a Grant Scholar at MoCA. “The museum was founded in 1966 by George Moscone,", "The next Biennial should be held at the Schirn Kunsthalle in Cologne, Germany, in the spring of 2021. The 2019 event was held in September and featured more than fifty artists. The 2020 edition will take place at the Museums and Galleries of the City of Cologne, Germany, and will be hosted by the city of Cologne and the Nationalgalerie Berlin. The full list of participating artists is as follows:____________________________________________Cologne Art Biennial and Museums (CIMAM) (2019)October 21–November 1, 2019, September 5, 2019, September 7, 2019, September 8, 2019, September 10, 2019, and September 12, 2019, September 13, 2019, and September 14, 2019.The museum-repertory center erected a new exhibition space in a former quarry in the historic city of Cologne in 1927. The exhibition, titled Cologne: Festschrift, involves the work of forty-four artists whose work is mounted in the exhibition. The project was a response to the city’s reconstruction efforts after World War II, and invited visitors to experience the historical city’s reconstruction in a new way. CIMAM’s curator of", "The next Biennial should understand that it is not an ’endless cycle.” The first exhibition should focus, as the French writer Paul Mpagi Sepuya, who was imprisoned by the state for nearly thirty months in its “Department of Sexual Sports” just outside of Nairobi, argued, on “the most intimate, emotive, and schizophrenic aspects of human life.” The exhibition should begin with a discussion of the history of the art and work in the exhibition and culminate in a discussion of the installation, the performance, and the performance-making process.The fifth exhibition, “Light and Cinema” will take place at the AEI in Water Mill, New York, and will feature forty-six works by forty-eight African American artists. The exhibition will explore the interplay between cinema, performance, and the visual arts and will examine themes such as memory, reality distortion, and the voyeuristic gaze. The work shown will be a selection from the forthcoming “The Black Family: An American Odyssey” exhibition, to open at the AMNH in New York on November 9. The AMC Haus der Kunst in Munich, to open in November 2019, will feature twenty-nine", "The next Biennial should have a budget of at least $25 million and will have four artists representing Black, Latinx, and Indigenous communities. Its inaugural exhibition will be held in the summer of 2020 and will feature work by twenty-three artists, including Yanira Alvarez-Reyes, Ugo Rondinone, and Jose Antonio Campos, and will run from June 12 through July 3, 2020.The 2020 edition of the Biennial, titled “Saying Goodbye,” was curated by Sarah Roesler, the inaugural director of the Berkeley Art Museum; Kate Donoghue, the head of the LA-based nonprofit the MFA, and the MCA, which is currently undergoing a $50 million expansion; and four-time MacArthur Fellow Danielle Talbot, the former artistic director of the Los Angeles County Museum of Art; and will showcase work by seventy-two artists.“The idea for the Biennial came from a conversation I had with people who were really connected to the arts in Los Angeles,” said Talbot. “I wanted to do something that was aspirational and was really a reflection of what we could be. And this was a good opportunity to try to make that happen.”Talbot is", "The next Biennial should take place in October 2021 and will be hosted by the US Institute of Art, the Museum of Modern Art, and the Museum of Contemporary Art. The National Gallery of Art in Washington, DC, will organize a biennial of the same name in September 2021.The show will be curated by Jonathan Walker-Stern and will feature more than fifty works by forty artists, including Anita Brooker, Akiva Goldschmidt, Konrad Fischer, Kim Knapp, Macan McKenna, Maren Piers Cohen, and John Lindsay. The exhibition will take up issues such as art and politics, art and philosophy, art and the body, art and beauty, and will also include a reading from the book The Awake, written by Amy Sherald, the author of The Power of Nightmares (2017). Stern and Knapp will serve as cochairs. Walker-Stern, a research scholar and curator, and Knapp, a writer and educator, are cofounders. The institution will obtain the funds for the event through a $1.5 million gift from Ron and Robin Gilbert.Commenting on the gift, Steven D. Bernstein, a curator at the Museum of Art, told Artnet: “A legendary visionary,", "The next Biennial should mark the twenty-fifth anniversary of the institute’s founding, and will be held in the city of Bilbao. The seventeenth edition of the exhibition will also receive a number of architectural and engineering upgrades, including a new lobby and a new gallery. It will also focus on the history of the institute, which is located in the historic town of Bilişa, and will be organized by the Bilişa Mestari Foundation. The first edition of the exhibition will be staged at the Museu de Arte de Belo Alianza in Lisbon in 2020 and the third edition will be hosted in Barcelona in 2021.“The Biennial was born out of our belief that architecture can reach beyond the boundaries of cities and communities and to touch the lives and spirits of people we meet in different parts of the world,” said Museum director María Grazía. “We are especially excited about the location of the exhibition: the Museum of Modern Art, the Centre Pompidou, the Palazzo delle Pompidou, the Museum of Modern Art in Paris, the Museum of Modern Art in Santa Monica, and the Museum of Modern Art in New York. We know that", "The next Biennial should be held at the Casablanca Cultural Centre in France in 2020. The exhibition will be organized as a joint project of the Italian and French embassies in Washington DC. The show will include the first retrospective of Larissa Alsop, which was organized by the US embassy in Rome in 2001 and will feature the work of thirty-nine artists, including Chery Aboitiz, Carlos de Alvear, and Rae Danza. The show will also feature the work of artists such as Rasheed Araeen, Mario Ariza, Andrea Catellani, Luciano Cosorti, and Alberto Gramsci. The upcoming Greenwich Village biennial, “Ascension: The Art of Inversion,” is already underway. The exhibition will lead up to the 2019 edition of Greenwich Village Cooper-Hewitt, which is currently on view through March 21.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Joël and Marta Brodsky as its new board members. The partnership between MoCA and the sculptor’s artistic practice has been in the works for several", "The next Biennial should inaugurate in the fall of 2020 and will be held at the Institut Pasteur in Saint Petersburg. The exhibition will celebrate the biennial’s first year with the original themes, like the history of the exhibition and the exhibition’s first year in a studio environment. The exhibition will also feature the first works created by female artists, and will focus on the influence of the artist-run spaces in the city. Among the works on display are the first works by female artists in Russia and first works by artists of color.The exhibition is being organized by the Federal State Museum of Fine Arts (FSM), the State Museum of Fine Arts in Moscow, and the FSM’s consortium partners NADA and the Intermarium, which will host a dedicated exhibition of the work of the artists participating in the exhibition. A website will be launched soon for the biennial.\n\n\nThe Miami Beach Art Museum (MBAM) is planning to move the annual exhibition of work by Florida’s most important African American artists, a show that has been held in Broward County’s Louis Vuitton building for 125 years, to next year. The move follows the museum’s decision to cancel the remainder", "The next Biennial should be in March 2021.  The previous year, February 2019 was the theme of the Biennial. This year, it will be the theme of the progressive, transformative work of a specialist collective, the Peach Art Museum, in New York City. The 2020 event will take place at the Museum of Modern Art, New York. The 2020 event will be hosted by the Museum of Modern Art. The theme of the 2020 edition is Beauty and the Body. The event will take place in the museum’s courtyard, which is located at 180 West Twenty-Second Street, in the heart of New York City.The 2020 exhibition is part of the museum’s ongoing commitment to the art of contemporary life. The institution will stage twelve new exhibition discussions each year, including the first at the Contemporary Art Museum of Chicago, which will be held in 2021. The first was presented at the Contemporary Art Museum of Chicago in 2021. The second was presented at the Museum of Modern Art, New York, in February 2022. The third was presented at the Museum of Modern Art, New York, in January 2021. The fourth was presented at the Museum of Modern Art, New", "The next Biennial should take place in the city in 2021, the same year that the exhibition will mark its thirteenth edition.\n\nBeijing-based artist Jie Zhang has been named the winner of the $50,000 Hattori Award for his installation Tears on the Wind, which was exhibited at the Venice Biennale in 2011 and is currently on display at the Museum of Fine Arts Tokyo. The work, which consists of more than 600,000 fiber-based tear gas canisters that were manufactured by the Chinese state-owned Chinese chemical manufacturer Tianwan Group, was created as part of a campaign to curb the country’s growing use of tear gas, a highly toxic substance that is used against protesters in China’s Guangdong province.In the photo-realistic work, Zhang looks away from the tear gas canisters as he performs a somersault while wearing a brown robe, a traditional Chinese costume, and a mask. Standing in front of the tear gas canisters, Zhang observes “This tear gas canister is like the nose of a duck,” adding that the tear gas canisters actually irritate the respiratory tract. “Tears can be poisonous, but they cannot hurt,”", "The next Biennial should take place in the autumn of 2020.  The 2019 exhibition, “The Third Wave,” featured works by twenty-five artists, including David Hockney, Martin Heide, Kaya Alexander, and William Becker, and featured more than two hundred installations, including work by the National Gallery of Art, the Metropolitan Museum of Art, and the Turner Prize–winning artists Stephen Abraham and Adam D. Perretta. Viewing Room calendar: 2019 biennial dates: Artists: A. Ahern, L.A.C. (The Ateliers d’Art Contemporain), Paris; B. Beck, New York; C. Beck, New York; D. Beck, New York; E. Beck, New York; F. Beck, New York; G. Beck, New York; H. Beck, New York; I. Beck, New York; J. Beck, New York; K. Beck, New York; L. Beck, New York; M. Beck, New York; N. Beck, New York; O. Beck, New York; P. Beck, New", "The next Biennial should include a selection of works on paper and sculpture. It should reopen in 2022, and the twenty-fifth edition will be held in Tokyo. The Biennial of Japanese Pop Art will also travel to Berlin and Shanghai.Roenaz and his wife, Mona, who have been partners in the art-world for eleven years, were commissioned to create a new edition of the Biennial of Japanese Pop Art (BJCP), which will include international artists. The initial exhibition was held at the Hirshhorn Museum in Washington, DC, in 2016. The exhibition won a prize at the Venice Biennale in 2019, and the event went on to become a top-grossing event in Tokyo.Roenaz will present the exhibition at the Kantokozu Gallery in Tokyo from September 26 to October 1, 2020. The art-world veteran will also cohead a special exhibition at the museum on September 15, 2020. The show will feature works by sixty-eight artists, including Antonio Gracia, Anais Nin, Claude Monet, and Alberto Bernini.\n\n\nCatherine Oxtoby, the British director of the Louvre in Paris, has officially resigned after eighteen months as director of the institution. Her position was unt", "The next Biennial should be held in 2021.\n\n\nUCLA Art Museum curator Barbara Ullman, who helmed the institution for more than twenty years, died on December 27 at the age of seventy-four. She was seventy-five.Ullman was born Barbara Stray, in New York, in 1940. Her parents divorced when she was only six years old. Ullman moved to the Los Angeles area on a Fulbright to study at the University of California, Berkeley, but left the region when she turned ten years old. Upon returning to her hometown, she enrolled at UCLA.UCLA Art Museum curators Vilmos Roldan and Alfredo Paredes took over the reins of the museum in the late 1960s. They were succeeded by Ullman’s brother, Orlando Roldan, who continued to direct the institution until his death in 1974. In addition to managing the museum, Ullman was the author of several books on art history and a number of exhibitions, including “Barbara and Ivan Ullman: Art’s Mother’s House,” 1979, “Barbara and Ivan Ullman: Surround,” 1983, “Barbara and Ivan", "The next Biennial should be held in the spring of 2020.\n\n\nNEW YORK—The twenty-fifth edition of the Whitney Biennial will be held at the Metropolitan Museum of Art from March 29 to April 5, 2020, and will be hosted by artist-in-residence, the rapper Jadakiss, and will be hosted by artist-in-residence, ʜTay-Pee-Toe”, who served as the grand marshal of this year’s event. The event will be led by the artist-in-residence, who will be accompanied by artist-in-residence Kristina Farquhar.“This has been a year of transformative transformation for the Whitney Museum of American Art,” said artist-in-residence Mimi Alejandro. “Through the work of our artists, we have created the conditions for a more inclusive, equitable world. We were given a mandate to experiment with new mediums, new means of expression, and new forms of community through art. The results are exhilarating and heart-stopping.”The event was created by the artist-in-residence’s partners, David Boring, and David", "The next Biennial should be hosted at least once a year, with a new theme each year. The 2019 edition, directed by Frederick O. Wilson, was set to be held at the Minneapolis Art Museum in August 2019. The museum announced its decision to cancel the exhibition in an email to the public on August 29. The 2019 edition will reopen in February 2020. “Since we started this program, we have received and shared stories from so many of our fellow artists and have learned so much from each other,” said Director Krista Csapeliussen. “The next iteration of Biennial Minneapolis should reflect this spirit of openness and continue to be inclusive of all points of view. We believe that this is the most effective and sustainable way for us to continue to engage the creative community of Minneapolis.”The 2019 edition featured work by fifty-two artists, including Alan Halsey, Remi Kahne, Léa Enyart, Tilda Swinton, and Sara J. Scott. The 2020 edition will honor seventy-three artists by presenting work by seventy-four artists, including John Alexander, Tomás Mello, and Jonathan Davis.\n\n\n", "The next Biennial should take place in 2021 and will include a selection of contemporary art from sixteen countries\u0097and will include a special exhibition of work by the new generation of Italian curators, led by Maria Celentano, Matteo Bassi, and Stefano Cervetto.In addition, a new exhibition of work by the renowned Italian curator and critic Piero Manzoni will open at the Museo d’Arte Contemporanea di Beppo in Florence on January 12. The exhibition, titled “Un Addresso Bieni,” will be preceded by a two-day symposium in Rome on February 16–March 5. The Venice Biennale will also include a special edition of the Art Newspaper on March 3–March 5.The 2017 edition of the Venice Biennale, which was organized by the Arts Council, was canceled due to a labor strike by employees of the museum\u0097the event was supposed to take place from March 3 to March 5. Since then, an open-air exhibition of works by the same artists at different locations in Venice has been staged by the Arts Alliance in Rome. The event is now being hosted by the Arts Council, which will present", "The next Biennial should be held in 2020.\n\n\nThe Tanjung Arts and Design Biennial in Singapore, which was suspended by the government in March 2019 because of the coronavirus, has resumed. Its official Twitter account tweeted that the event would now be held in 2021.The statement said that the decision to postpone the event had been made after discussions with the government and other stakeholders over the past six months and that the upcoming exhibition would aim to present the latest togetherness and diversity theories through the lens of the five-dimensional (5-D) art. The announcement coincided with the opening of the first exhibition of new works by Tanjung artists, Art of Space, which will run from January 2019 to March 2020.The artist-run event, which had been scheduled for February, was postponed two weeks and a half because of concerns over the safety of the artists and the coronavirus. The event will now take place from March 22 to March 26 from the Tanjung Art Museum. The tannoy station in Shanghai, which was forced to move the show from January to March, will stage the event again from March 24 to March 26, 2021.Take a look inside the special exhibition.\n\n\nThe third edition", "The next Biennial should focus on the history of conservation through the art of conservation and how it relates to human progress and the future. [We need] to reexamine our cultural institutions and think more broadly about conservation in a post-emergence world. This will allow us to reexamine the conservation of our own lives and future. With gratitude,Janette De Bont & Co., Barcelona, Spain. The exhibition will be hosted by artists and conservation experts at a time and place of their choosing. Each year the winner will be selected by a panel of architects and experts. The biennial will be organized in collaboration with a team of local and international curators and producers, and will take place in conjunction with the upcoming Seventeenth Venice Architecture Biennale. The sixteen artists selected for this year’s exhibition include Atif Kasha, Khaled Abou El Fadlallah, Hoor Al-Qasimi, Jacques Rafaux, Sabine Schiltjes, Darlene Üstek, Tapan Bahar, and Tanya Bonsu. “We are thrilled to collaborate with the other Barcelona institutions to continue to present our artists’ work in the future,” said art", "The next Biennial should begin with a reflection on the significance and the promise of art, and how it may be of service to society. I hope that those who will perform in this year’s show, and those who have attended this year for awhile, will come together to make this year a success. Amora “did not expect” to be a part of the project. “I did not think she would be invited to be the first artist to stage at the Museum of Modern Art in New York,” he said of the curator of photography and the American artist. “She is an exceptional curator, and I always felt there was great potential for her.”The Biennial has faced challenges in the past. In 2005, the organization had to relocate a major retrospective of John Cage, The Act of Killing, from its original location in downtown Los Angeles to the Santa Monica Pier, after a legal battle that lasted two years and involved dozens of legal complaints. The move meant the end of the show, which was co-organized by the Los Angeles– and New York–based artists Squeak and Jack Miller, who were facing thirty-nine counts of involuntary manslaughter and manslaughter charges. The show was scheduled", "The next Biennial should welcome writers and artists from over forty countries, and will be held at the Venice Biennale from March 22 to March 26, 2020. The design of the exhibition, which will be inspired by the Art of Man and the Land, and will feature exhibitions by seven artists, will be guided by the theme From the Land to the Sea. The biennial will feature three permanent installations, one exhibition, and a virtual reality experience. It will also introduce a new series of films and videos by artists taking part in the second exhibition.“When we began the redesign of the Biennale, we set out to create a new exhibition that would allow the artists of the exhibition to publish new works in the same way that Art Basel does with its award shows,” said architect Marco Pantale, the CEO of Mann Styk and architecture firm Bending Berlin. “The design of the Biennale is a culmination of our many activities in integration. At the same time we have developed a new line of fairs and a special section of the exhibition that will be unique to the event.”“The new exhibition ‘From the Sea to the Land’ will be a new series of works in collaboration", "The next Biennial should take place in St. Louis in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced on Tuesday that it is planning to relocate the works of prominent African American artists to a new home in the city. The move is part of a larger renovation, which will add more than 1,500 square feet to the museum and will offer more than six hundred works by seventy-five artists.The move is part of a larger renovation, which will add more than 1,500 square feet to the museum and will offer more than six hundred works by seventy-five artists.\n\n\nThe Los Angeles County Museum of Art (LACMA) will begin a phased relocating of the collections of the institution, which was founded in 1965, in early 2019. The museum is currently undergoing a $500 million renovation that will add a new course, a theater, and an outdoor plaza. The plan also includes the reopening of two of LACMA’s three theaters, which will be able to accommodate a larger audience. The institution has four buildings on its campus, the Shari and the Shari & Sons, which are currently undergoing a $200 million expansion designed by the firm Gensler, and three of", "The next Biennial should take place in the city of Milan from April 15 to April 18, 2020.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has received a gift of three works by the late Georgia-based artist and activist Madeline Alsop from the University of Georgia. The works, which were donated by her daughter, Beny, are currently on display in the Museum’s Alsop: The Art of Making Place (2017) exhibition, which will go on view in the museum until March 29.In the gift, which was given to the museum by the Konig family, the Alsop family gift included two works by the artist, a geometric tribute to the artist’s earlier life and a series of photographs documenting the artist’s work and her activism. The institution also revealed that it is working with the Alsop Foundation to launch a new scholarship program for young artists and will work with artist-in-residence Bridget Riley to create a new public sculpture garden at the institution.“While we are grateful to the Konigs for their generosity, there is a great deal more that we would like to do with this gift,” said Bridget Riley. “", "The next Biennial should focus on “the organic relationships between contemporary art and the social, political, and spiritual world in the contemporary era,” said Bertrand Bussart, president of the Biennale. �The themes will be live and animated works of art created during the last two years and will feature some of the most important works of the last two decades. The exhibition will be a celebration of the real and the imagined, and will be organized at the precise moment when the future of art is at stake in the greatest debates and the most crucial of conversations.”The festival will organize twelve new works by artists from fifty-six countries. The first exhibition, “The Residence,” will open at the Museum of Modern Art in New York on February 22. It will then travel to the pavilion of the Biennale in Paris on March 23 and to the Musée de Lille in August. The second exhibition, “Aeon” will open at the Museo d’Arte de São Paulo in October. It will then travel to the museum of art in Rio de Janeiro in December. The third exhibition, “Human Intersection: Art as Diplomacy,” will open in the", "The next Biennial should be held in 2021. The Biennial will be hosted by Feltrinelli Art Museum in Rome and will take place in the city’s Sesto New City, a former fishing port in the Adige area of Rome. The museum plans to work with the city of Sesto to create a 120,000-square-foot exhibition space for the exhibition, which will be situated in a renovated former fishing boat, for which the city will provide the building materials. The new biennial will also feature a new concept, a new installation, a new video installation, and a new dialogue between artist and museum representative. All of the Biennials’ construction is centered around the theme of the new year, the announcement of which is followed by a photoshoot by the artist Luiz Cerny. The 2020 edition of the show will be held at the Museo Archeologico Cattivo della Scala in Rome.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Ashley Thompson as its first executive director. Thompson, who currently serves as the senior curator of medieval art at the museum, will assume the role in January 2021 and will remain on as", "The next Biennial should be held in the city in 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for new public art commissions created by organizations that receive city funding, including cultural organizations that receive $3 million.The guidelines, which were created by the DCLA and were drawn up by city government officials, outline the process for commissioning works by individuals and local cultural groups. Among the guidelines are a timeline for the artists’ creation, a set of guidelines for how the artwork will be presented, and guidelines for how the public should experience the work.The guidelines were developed after a series of public art commissions in the city’s recent history, which were led by individuals and local artists and were inspired by the city’s rich and diverse history. In the case of Sydney’s Artists’ Colony, the two-year-long event drew almost 5,000 visitors from around the globe. The city also hosted its first Art of the Party, a free music and arts festival, and the city’s first City Hall Garden Party in 2021, which was held on December 25, 2020.The DCLA’s guidelines remain in effect until February 26, 2021", "The next Biennial should take place in the United States. The 2019 exhibition\u0097the twenty-fourth biennial of the American artist and activist Loni Hancock, which will focus on surface and form\u0097will be curated by Jägber and will open at the Museum of Modern Art, New York, in September.“For more than two centuries, biennials have challenged the boundary between what was possible and what was imagined, between what was and what might be,” said Biennial Director Carol Johnson. “By inviting a new generation of artists and activists to confront difficult questions about our world, we hope that the twenty-fourth Biennial will bring them together.”\n\n\nA group of artists and collectors have been arrested in connection with the theft of $5.5 million worth of works by American artist Clement Greenberg, who died in 1966, according to Artnet. The activists claim the $500,000 was taken from a Greenberg art show at the Ace Hotel in New York on May 29, 1966, and is in a collection that is owned by the artist’s son.The activists had been following the case of a woman who claims she was severely beaten by her ex-boyfriend while they were both", "The next Biennial should cover “the history of art and sculpture in North America” and will be hosted by the Museum of Fine Arts, Boston. The event will also include a first-ever presentation of works in the works collection.\n\n\nThe National Gallery of Art in Washington, DC, has announced that it is planning to close all of its locations as part of an effort to reduce the environmental impact of its extensive renovation and expansion. Although the shop's walls will be completely rebuilt, the galleries will continue to operate as usual and the institution will continue to host nearly two hundred exhibitions a year, including programming that can be viewed on its online viewings platform.The changes, which were made in consultation with the public, include the relocation of the National Gallery of Art’s current exhibition program, “The Three Muses: The Visuals of David H. Koch,” to a second location that will be “The Worn-Out Cottage: A History of Modern Art” (2019); the reorganization of the National Gallery of Art’s collection strategy; the reorganization of the institution’s exhibitions and the presentation of selected works by artists who are affiliated with the National Gallery of Art; and the retool", "The next Biennial should take place in the Fall of 2020. In the meantime, the museum is planning to host an exhibition of works by artists such as the late Iranian artist Mola Saeedi in the Summer of 2021.\n\n\nGerman art historian and curator Peter Dreher, who has lectured extensively on the influence of cartoons on art, has died at the age of seventy-nine. Born in Vienna in 1938, Dreher attended the Vienna Academy of Fine Arts (VZ Stuttgart) and taught at the famous Leipzig Academy of Fine Arts until his retirement in 2015, when he moved to Berlin. He went on to teach at the Jullen Berlin Institute (JMB) and the Haus der Kunstverein (HED), before returning to Vienna and working at the VZ Studio in Württemberg from 2013 to 2019. Dreher’s first exhibition at the VZ was “Practice and Present: Selected Cartoon Artworks” in 1991, a retrospective of works by the American cartoonist Raymond Boisjoly. In 1992, he was awarded the Frankfurt Art Club’s Passko Prize for his exhibition “Cartoon Art at the VZ,", "The next Biennial should be in May 2020. The museum will have a new building, new exhibitions, and new programs in the summer of 2020. If you are interested in supporting the museum, please contact robert.leonard@lindenpenn.edu\n\n\nCatherine Howard has been named curator of contemporary art at the Museum of Modern Art (MoMA) in New York by the board of trustees of the Whitney Museum of American Art in New York. She succeeds Joël and Douglas Lehmann, who were named curators of the Whitney for their work in the photography department in June, and will take up the role on August 11.“Catherine Howard has been an outstanding curator for nearly thirty years, and we’re delighted to have her back at the museum,” said David Bond, chair of the board of trustees. “Her deep understanding of museum design, her ability to bring together disparate artists to present important exhibitions in diverse contexts, and her commitment to deepening the museum’s international reputation and building on the work and legacy of David Wood are particularly important.”The board also thanked Cheryl and Jean-Michel Platko, the cochairs of MoMA’s design department, for", "The next Biennial should take place in the month of April, 2020, in the following cities: Amsterdam, Berlin, Brussels, Copenhagen, Dublin, Frankfurt, London, and New York.The 2020 model is similar to that of the Paris-based biennial Dijsse Schaerbeek, which announced its intention to stage the event in April. The 2020 event will take place at the Museum Matin in Brussels from April 13 to April 14. The exhibition will feature work by twenty artists from fifteen countries, including the United Kingdom, France, Poland, Germany, Italy, the United States, and Sweden.  The exhibition will mark the sixty-fifth anniversary of the 1959 Munich Biennale, which was organized by the German state of Hesse and was attended by 120,000 people. The exhibition will also introduce new regional and national programming. The inaugural edition, titled The River, will be followed by Folkestone,  in September and The Watermark Projects, in October. \n\n\nBenedict Anderson, a British artist known for creating works that examine human relationships, died on March 27 at the age of eighty-one. The British architect and landscape painter created monumental works such as his large-", "The next Biennial should be held in 2022. “Our dedication to the project of collaboration and the collaborative work of the artists of the South African Museum is unwavering,” said Victor Maritz, chair of the board of trustees. “As a country, we are investing heavily in the health and well-being of our artists and in their educational, cultural, social, and cultural pursuits. The new Biennial will be a great platform to engage with the most recent and most important works of our citizens and future generations.”The new stadium will be located in the capital city Pretoria, where the Biennial currently takes place, and will host more than two hundred exhibitions each year. The exhibition space will also be used for cultural exchange and education programs. \n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has announced that it will host two reopening shows in 2021 and 2022. The dates were chosen to coincide with the International Union of Operating Engineers’s (IUE) 2021 edition, which runs from January 5–January 8, 2021.“Both art and design have played a critical role in shaping SFMoMA’s contemporary aesthetic. We are glad that we can continue to", "The next Biennial should be a reflection of the unprecedented global challenge and the breadth of the artistic community’s engagement with science fiction and fantasy, with a particular focus on lesbian and gay feminist and queer art.”The 2020 edition of Dragon*Con will take place in the beautiful and environmentally friendly downtown Seattle venue the Alexander Graham Art Museum. The theme will closely follow the theme of the previous year; “A World Without Lies.” The 2020 edition will be titled “A World Without Women.” While Dragon*Con is the largest and most prestigious international art gathering in the world, this year’s event is being organized by an international committee comprising artist-representatives from eighteen countries, including Austria, Canada, France, Germany, Austria, France, Italy, Japan, Malaysia, Poland, and Spain. Artforum will have more updates about the 2020 edition as we learn more.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Halsey Cohen as its new board chair. She succeeds Amy Dallman, who has served as MoCA’s interim chair since September 2019, and will be the fourth woman to lead the institution’s board of directors. Cohen joins the gallery after", "The next Biennial should be held in 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA) announced today that it has received a gift of seventy artworks from the Los Angeles–based artist and activist Franklin & Marshall, including pieces by artists such as Mies van der Rohe and Mies van der Haeg, and two works by the artist with the largest selection of African American works in the United States, M.A.M. (1999).The museum also announced that it received a gift of twenty-six works by the artist with the largest collection of African American art in California, the Los Angeles County Museum of Art (LACMA), which was organized by the artist and was scheduled to open in 2021.The museum will present several works by the activist activist, including a “Last Call” (1977), for which she is the founder of the Campaign for Racial Justice, a Los Angeles–based coalition of activists, artists, and academics that advocates for racially conscious policies; a “Race and Justice” statement against police that was inspired by the events in Ferguson, Missouri, and was delivered to the White House by LACMA director Rebecca Watson; and a “Unpacking the Racial", "The next Biennial should take place in the city in 2020. \n\n\nThe Museum of Modern Art (MoMA) in New York is offering to pay up to $2.5 million to settle complaints that it mis-sold photos by the late artist and activist H.L. Menger. The allegations were first raised by Menger’s daughter, Monika, in a letter to the director of the Menger Museum, which was sent to the museum in January 2019.According to the New York Times, the museum was forced to launch an investigation into its relationship with Sotheby’s following a complaint from the estate of the late American artist.  \"We realized that there was a lot of confusion around what the MFA was doing and what it should be doing,” said Seamus Heaney, the museum’s former director of curatorial affairs. “This letter is an attempt to clarify what we have been doing, and what we should be doing.”Since the letter was sent by Monika Menger, the Museum of Modern Art has maintained that it collaborated with Sotheby’s in an “extensive and respectful manner.” The institution claims that it utilized the invitation to", "The next Biennial should be held mid-March 2019 and will consist of sixty artists from twenty-six countries. The scheme will also include a second edition of its TED Talks, which will feature a biennial of sixty-four artists, curated by Maria-Maria Cattelan, and will be held simultaneously in Milan, Cordoba, and Venice.The new dates for the 10th edition of TED Talks are as follows:January 21, 2019: Tao Talks (Paris)January 29, 2019: Artforum (New York)February 11, 2019: Artforum (New York)February 27, 2019: Artforum (New York)February 28, 2019: Artforum (New York)March 4, 2019: Artforum (New York)March 6, 2019: Artforum (New York)March 12, 2019: Artforum (New York)March 14, 2019: Artforum (New York)March 16, 2019: Artforum (New York)March 20, 2019: Artforum (New York)March 21, 2019: Artforum (New York)March 23, 2019: Artforum (New York)March 29, 2019: Artforum (New York)", "The next Biennial should be a platform for “new and contemporary art,” she said, “and we will continue to engage with the local, regional, and international arts communities to shape their own visions of the future.”\n\n\nThe National Gallery in London announced today that Amanda Marshall, who recently stepped down from the helm of the institution, will be the next director of the National Museum of Scotland. Marshall, who has helmed the National Gallery since 2015, had led the institution since 2012 and had previously held the positions of assistant director of collections and international exhibitions and curator at large.“Although not particularly well-known outside the United Kingdom, Amanda is a gifted and experienced leader who has led National Gallery through a series of transformative transformations,” said museum director Nicholas Cullinan. “She has built the museum’s collection in the UK, expanded its international reach through significant new acquisitions, and shaped our collections in ways that have profoundly benefited the UK as a whole. Her achievements and reputation will certainly be missed by the museum's visitors and I know that the museum will continue to prosper under her direction and her exceptional team.”Marshall will take up her new post in January 2021 and will begin her tenure in", "The next Biennial should focus on the history of the collection and its exhibition, which will mark the 50th anniversary of the museum. The exhibition will reopen in the spring of 2020.\n\n\nThe Turkish government is planning to remove a number of controversial historical monuments in the country that have stood in the way of the reopening of the İstikal Palace Museum, a revered art museum in Istanbul that was completed in 1916 and became the country's first modern-day cultural monuments in the 1980s.According to the Art Newspaper, the controversial site was designated a cultural monument of the nation in 2017, but activists immediately launched an offensive to remove the monument in an attempt to have it moved. The government responded by temporarily closing down the museum last October. Activists have since accused the government of trying to push the museum out of its historic location and that the museum has been under construction since 2015.In an attempt to address the ongoing protests, Prime Minister Bülent Çavuşoğlu ordered the dismantling of the construction site and the museum. The museum will then be demolished and the buildings relocated to a museum that will house the exhibits and other works of art within the complex. However, the demolition and relocation of the museum will likely", "The next Biennial should be held in 2021.\n\n\nThe National Gallery of Art in Washington, DC, has appointed Cheryl Glynn as its next head of the National Council on the Arts. Glynn will be responsible for the direction and management of the National Gallery of Art’s collection and operations and will take up her new post on January 6.“Cheryl has been instrumental in advancing the National Gallery’s mission to serve as an essential resource for America’s creative and civic life. Her extensive experience and passion for the arts and for the National Museum of African Art in Washington, DC, as well as her impressive record of achievement make her uniquely qualified for the role of National Council on the Arts,” said Sharon Asher-Roth, director of the National Gallery of Art. “From building museums to leading collections and delivering thoughtful public programs, she has been instrumental in growing the National Museum of African Art’s reputation and strengthening its international reputation.”Glynn started at the National Gallery in 2009 as a curatorial assistant. Since then, she has worked on the exhibition program, including the recent “Unseen: Art for the 21st Century” (2019–20), “Dark Present", "The next Biennial should take place at the Museum of Contemporary Art, San Francisco, in 2020.\n\n\nThe Metropolitan Museum of Art has appointed Carolyn deCordova as its next director. She succeeds Alan Johnson, who resigned in March after a decade at the helm of the Metropolitan. The current leadership team, which also includes Glenn Evans, has not yet announced a successor.“Carolyn brings a wealth of experience and knowledge to the Met,” said Adam D. Weinberg, the director of the Met and the Museum of Modern Art. “Her passion and intelligence are evident in her leadership of the Met, and her vision for the future of the museum is ambitious and deeply credible.”Born in Los Angeles in 1957, deCordova earned her undergraduate degree from the University of California, Berkeley. She was hired to work as an art assistant at the Oakland Art Museum, where she met and married Marc Middleton, who would become her husband’s father-in-law. The couple relocated to New York and opened a gallery. In 1981, a year before she married, deCordova moved to San Francisco and opened Gallery 56. The gallery eventually became Victoria Miro Gallery, which featured work by artists such as David", "The next Biennial should take place at the Biennial B, which is located in the city of Bali’s northern district of Bali, Indonesia, on January 28, 2020, and will be held at Dusan Biennale Resorts, Inc., a museum in the capital of Bali, from March 22 to March 28. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has named Eva D. Suter, an award-winning associate curator and art historian who has curated exhibitions at the institution, as its next director. She succeeds Martha Cortez, who departed in the summer of 2019 to head the Metropolitan Museum of Art in New York, and will assume her post in January 2021.“Eva is one of our most important contemporary artists and has been for many years,” said museum director Mark Farman. “Her work has been central to the growth and development of the Museum’s curatorial practice and to bringing MoCA’s exhibitions and collections to our attention through her tenure as a curatorial fellow in the Museum of Contemporary Art.”Suter’s work includes exhibitions such as “Ancient Worlds,” 2014–15, “Peter Winton: The", "The next Biennial should be announced soon.”\n\n\nThe Museum of the Fine Arts (MAFA) in Boston has appointed Adeline Ooi as its new director and CEO. Ooi will take the helm of the contemporary art museum from director Michael P. Higgins shortly after he departs in January 2020.“Michael has been instrumental in MAFA’s transformation from a collection point of view institution to a new destination that is poised to redefine the relationship between art and the visual arts,” said Ooi. “We are fortunate to welcome him to the museum and look forward to his leadership as we embark on a transformative new chapter with our upcoming exhibition season, new programming, and a new collection.”During his tenure, Higgins has led MAFA into a second-tier expansion, which is expected to be completed in 2020; launched new land-based and space-based initiatives; and brought the museum’s collection and programming online. Higgins also oversaw the acquisition of more than four hundred works, including works by Robert Irwin, Jay-Z, Carolee Schneemann, and Frank Gehry, and was instrumental in the acquisition of works by artists such as Edward Hopper, Pierre-Auguste Renoir,", "The next Biennial should be in 2021.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Sarah Sze as its new associate curator of contemporary art. She succeeds Carlo Mollino, who was hired as director of the Museum of Modern Art in New York last March, and will begin her position this fall.“Sarah is a seasoned curator who has been instrumental in bringing the Biennial to life,” said John Lasseter, the museum’s director. “The breadth and depth of her curatorial experience is essential for our artists and curators to explore this critical and expansive art canon. We are confident that she will continue to shape the Biennial’s trajectory, integrating original research and innovative exhibitions into the annual program.” Mollino, the former head of the Los Angeles County Museum of Art, announced his retirement in March 2019.Sarah will be responsible for developing and executing the Biennial’s programming and exhibits while simultaneously overseeing the museum’s curatorial team and operations. She will assume her position on October 4.Commenting on her new role, Sarah said: “The Biennial’s history of collaborative experimentation and experimentation’s ability to", "The next Biennial should be held in 2021.\n\n\nWorkers in Belarus have launched a campaign to raise $100 million so that a new art museum can be built in the capital city of Belarus. The campaign, which has received support from Belarusian and international arts organizations, began after the country opened a new $260 million capital on February 7, 2021. The campaign now has more than $100 million in backing from Belarusian, international, and citizen-initiated artists, activists, and other cultural figures. The campaign is seeking $75 million in support from the Belarusian government and $50 million from the Arts Council of the Republic of Belarus.The campaign has also received support from the Centre for Arts and Culture of the State Historic Museum in the city of Minsk; the Museum of Modern Art in the city of Minsk; the Museum of Contemporary Art in the State Museum of Minsk; and several former Belarusian officials.\n\n\nThe Getty Center in Los Angeles announced today that it is considering opening a new exhibition space in the West Village to draw attention to the museum’s curatorial work. The center will hold the first show dedicated to the artist-built installation, an exhibition titled “Paintings on Paper.�", "The next Biennial should take place in the spring of 2021.\n\n\nThe Smithsonian’s National Museum of African Art (NMFA) and the British Museum have postponed their upcoming joint exhibitions, which were set to kick off in September, citing security concerns. On Saturday, the National Poetry Library in London and the British Museum’s National Portrait Gallery in London announced that they are still working together, but only as a part of a new partnership. The institution confirmed that the exhibition, entitled “David Attenborough: From Life to Art,” will be on display in “David Attenborough: From Life to Art” at the institution in September 2020.The first exhibition, entitled “David Attenborough: From Life to Art” (2019), was originally scheduled to open at the British Museum on March 8, 2020, and to run until September 2021. The show will be preceded by a “David Attenborough: From Life to Art” exhibition at the Smithsonian, which will open in October 2020, and will be followed by “David Attenborough: The Life and Art of David” at the National Museum of Scotland, opening in March 2021.Founded in London in 1875", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Ashraf Nusseibeh, who was appointed last September as director of the museum, will retire on December 31 after twenty-five years. He succeeds Todd Ruiz, who served as interim director for sixteen months.Nusseibeh joins the institution after serving as director of the Museum of Modern Art (MoMA) in New York from 2008 to 2014, and has helmed the museum since its inception. He is also a member of the board of trustees of the K9 Foundation, the Kohn Foundation, and the Scott Foundation, and chairs the advisory boards of the Center for Art and Architecture at the Museum of Modern Art, the Metropolitan Museum of Art, and the Whitney Museum of American Art.“The board of trustees is very pleased that Ashraf Nusseibeh has agreed to lead the Museum of Contemporary Art in Los Angeles for the next twenty-five years,” said board chair John Hulett. “We extend a warm welcome to Ashraf and wish him all the best in his retirement.”\n\n\nThe British artist Peter Sonecke, who championed the cur", "The next Biennial should take place at the University of Washington in Seattle in November 2021.\n\n\nAfter police officers in riot gear used tear gas to disperse protesters in Baltimore on Sunday, March 13, the city’s Department of Public Works confirmed that eighteen work-stations from the city’s Department of Public Works—including thirteen that were converted to serve as temporary barricades and five that had been turned into “No Tear Gas, No Revolution” signs—were damaged or destroyed.The twelve work-stations were damaged by protesters as they tried to clear a pathway through the city’s Old North End that leads to the nearby Inner Harbor, where thousands have converged since unrest erupted over Freddie Gray’s death from injuries sustained while in police custody. The four vehicles and two motorcycles that were thrown into the crowd were not damaged, but the impact of the gas on the crowd has forced a change of plans for the department so far this year.The department bought eight of the workstations, which were converted from metal racks, at a price of $1,500, and is currently working on restoring three more, which were manufactured in China. According to the Baltimore Sun, the department is working on restoring the remaining two", "The next Biennial should be held in 2020, and the first in 2021.The decision to hold the event in New Delhi was made shortly after Prime Minister Narendra Modi was elected in 2014. The move has been contentious since it was made at a time when the country was dealing with its worst crisis since the second world war. While the government officially considered the forced relocation of people from the city of more than 1.2 million as unwelcome, it has since said that it is open to dialogue with the city and its residents.Although the government has said that any discussion of moving people would be an 'undignified departure', it has also said that it is open to dialogue with the local population and has even taken measures—such as building temporary shelters for the homeless and distributing food—to help the city.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Lorenza Abreu as its next executive director. Abreu comes to the institution from the Boston-based nonprofit the Boston Cultural Trust, which has operated the museum since 2017. Since its founding in 2006, the museum has been run by the trust. It is responsible for protecting and restoring more than 2,200 works, and is the largest private conservator of modern and contemporary art"]