["The next Biennial should be held in 2022, although a date has yet to be set.In the meantime, the Museum of Contemporary Art (MoCA), which has been closed since March due to Covid-19, will open on Saturday, March 17, with a preview of the exhibition “Lunch with the Artist” on the ninth floor.“This is a crisis for art, for culture, and for the world,” said Andy Shaw, MoCA’s executive director. “The institution’s work and mission to present the visual arts and to meet the needs of contemporary life is being undermined. We are committed to a full reopening of the Museum in the fall.” Shaw added that the renovation of the building “will be a continuous process,” and that no dates have yet been set for the reopening of MoCA, which has an endowment of $55 million.\n\n\n\n\n\n\nRobert Rauschenberg: A Retrospective (2015)\n\nCourtesy of the artist and the curator and the Rauschenberg Foundation. Images © Robert Rauschenberg, the museum and the Rauschenberg Foundation, and may not be used without the explicit permission of the", "The next Biennial should take place in 2020. The next is slated to take place in 2021. The second, which is currently being organized in collaboration with the French Ministry of Culture, is currently on hold due to a confluence of factors—the coronavirus pandemic, the ongoing construction of the Paris-Reykjavík–Munich Corridor, and the ongoing construction of the capital Belt and its surrounding region. The third, which is currently being organized in cooperation with the city of Brussels, is scheduled to take place in 2022. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the future use of city-owned real estate in the central business district. The guidelines—written by DCLA deputy director Kathy Hochreiter and released on Wednesday—encourage museums, public spaces, and artist-owned spaces to work with the city to develop ways to leverage the surplus real estate in the area.“DCLA is committed to developing creative, social, and economic opportunities for New Yorkers and this includes supporting the creation of public benefits and services,” said city councilman Jimmy Van Bramer. “Under the current circumstances, this work is essential for restoring order and public safety in our", "The next Biennial should be on March 6–March 7. The program will be open to the public, and will be presented by Arashiyama–Goto.   Biennial projects are organizing themselves in different ways. For example, at the 14th edition of the Tokyo Biennale in October, the curators staged an interactive installation called Watashi Mochi, later known as Jinjo, in collaboration with the artist Chiwa Takahiro, to mark the seventy-fifth anniversary of the company.The partnership between Arashiyama and Kasuga was announced on May 23, 2019, as part of the partnership between the two companies. The first exhibition of the newly created program, The Future of Art, will open at the Kunsthalle Künstler Kunst in March 2020.\n\n\nThe Prince's Theatre Company in London announced today that Charles Kerr has been appointed as its new artistic director. Kerr most recently served as the artistic director of the same-sex centenary celebration at the National Poetry Library in London and the Tate Britain in London, where he is currently the director of facilities and acquisitions. In his new role, Kerr will be responsible for growing the audiences of the theatre", "The next Biennial should be held in 2020. If its organizers are successful in their bid to secure the 2020 event, the Biennale will continue to be held in the same venue in Paris. “The university’s response to the recent events in Paris has been exemplary,” the university’s board president, Christophe Berthaud, said in a statement. “The Museum is fully confident in the leadership in both directions and in the capacity of the museum to continue to function.”The museum has been working to relocate to a new building for two years. It is currently constructing a new building at the Louvre, but the move is expected to be completed in 2023. The move will be financed with a $52 million donation from the Louvre’s board.\n\n\nThe Metropolitan Museum of Art (Met) in New York and the Solomon R. Guggenheim Museum (S.R.G.) in New York announced today that they have reached an agreement that will allow the Metropolitan Museum of Art to reopen to the public for the first time since the pandemic began in December 2013. The news comes on the heels of the institution’s announcement that it plans to begin welcoming visitors in", "The next Biennial should take place in 2022.The Biennale, which aims to raise awareness of the necessity of solidarity between artists and societies at risk of extinction due to climate change, has faced strong criticism from rights groups and curators since it was announced in 2015. It has since been suspended and several exhibitions cancelled.The exhibition was also targeted by a boycott led by the Paris-based collective 3M-France, which was led by Olivier Fregini, one of the architects of the exhibition, and Ramon de Castro, an artist from the Rio de Janeiro-based group Pilar de Castro, who decided to pull the show in protest.The organizers of the exhibition, which are the Saint Petersburg-based Russian Design Museum and the Moscow Design Museum, say they have temporarily suspended the exhibition in an attempt to address the problems created by the removal of the work before the exhibition ran its first edition in March. On the exhibition’s website, the museum stated that the suspension of the exhibition is not connected to the boycott.Because of the circumstances that led to the suspension, the museum has decided to break up the exhibition and to open a new exhibition devoted to the history of the Biennale. The new exhibition will be titled “Under the Skin", "The next Biennial should open in 2022, and in 2019 almost a decade after that, the first museum venture in the United States, the Baltimore Museum of Art, established in 2004. The institution has been awarded ten grants from the $100,000-$200,000 categories, which are selected by the MacArthur Foundation.The awardees include the National Gallery of Art; the Metropolitan Museum of Art, the Smithsonian American Art Museum; the Brooklyn Museum, the Museum of Modern Art; the Museum of Contemporary Art Houston; and the Museum of Modern Art Los Angeles.\n\n\nThe Museum of Contemporary Art Houston has appointed Valentina Ottaviani as its new board chairman and CEO. Ottaviani comes to the museum from the Paris-based firm of Michaelson & Associates, where she has served as an executive and director since 2017. She succeeds John Berker, who died last year at the age of eighty-eight, and will assume her title on January 6, 2021.“I’m thrilled to work with the talented and innovative team at the Museum of Contemporary Art Houston,” said Ottaviani. “Their track record of success as an organization, as well as my own extensive experience, make me the ideal person to lead the museum into the", "The next Biennial should be held in October 2020, and the first in March 2021. The national prize for arts and culture is still on its way to being awarded, but the winner will be chosen by an elected panel consisting of the artists who are nominated. The deadline for the winners is May 23.  Commenting on the upcoming biennial, director Muneer Faruqi said: “We are grateful for the support of our artists and wish them health and well-being. However, the Biennial 2020 will be a challenge, a new dimension, and a rare event, unlike anything we have engaged in before. We plan to work with artists, scholars, and audiences to create a platform to deepen social change and foster social awareness by organizing events, exhibitions, workshops, and other programs in partnership with artists and scholars, as well as to consider ways to support sustainable practices and promote environmental health. We are also striving to create opportunities for artists and creatives to collaborate and act under the guidance of an arts-based and cultural agency, as a whole set of arts and culture professionals.”\n\n\nThe Austrian government has introduced new legislation that aims to make the country’s art museums more easily accessible. The bill,", "The next Biennial should be held in the summer of 2020.We thank the organizers of the biennial for having the courage to admit that this was not the way forward, and wish them well.\n\n\nThe City of London, in collaboration with Tate and the artist-run nonprofit the artist-run museum the London Museum of Art (LMI), has awarded the Corporation of London, one of the largest grantmakers in the world, $22 million to further its work promoting and preserving the legacy of artist-designed works as well as to expand the scope of its philanthropic work.In recognition of its significant contribution to the City’s cultural heritage, the Corporation is giving artists $9 million over the next five years. The grants will also support the design and preservation of a new exhibition at the London Museum of Art, which is currently undergoing a major renovation and renovation of the grounds, and a number of events, including the London 2020 fair and the Royal Academy of Arts’s annual Festival of Art. The biennial is also expanding the range of the Corporation’s grantmaking activities. It is enabling new projects to enter the public conversation and supporting projects that will address the City’s growing concerns about the future of the London and South", "The next Biennial should focus on the history of the Art Museum Miami, which was founded in 1975 by a group of Cuban-born activists. The museum has faced numerous setbacks since opening, and for a time it did not have the funds to keep the museum open. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than 1,500 works from the Andrew W. Mellon Foundation in support of its expansion and preservation efforts. The gift includes 4,500 works by more than 130 artists from the collection of the late philanthropist and collector Robert A.M. Mellon.The gift, which was made in support of the establishment of the foundation in 1993, is notable primarily for its amount of early and mid-career work by artists such as Alexander Calderón, Frank Gehry, Robert Irwin, and Mark Rothko. The organization plans to use the proceeds from the sale of works by artists such as Caravaggio and others that remain on display in the museum as a way to build on the foundation’s research in the field of modern art.“The Andrew W. Mellon Foundation has a long-standing history of supporting artists and institutions through its philanthropic work,” said David J. Wilson", "The next Biennial should commence in 2020.\n\n\nA team led by Kohn Gallery, the New Museum in New York, and the Metropolitan Museum of Art in New York has announced plans to collaborate on a new series of public artworks that will be installed throughout the city’s cultural district. Designed by Stephanie Kohn and constructed mostly in white, the fifty-five-foot-by-forty-six-inch pieces, which will ride the pathways of the Hudson Yards development that is currently under construction, will begin construction this spring.“This exciting new season demands new approaches to artistic expression, new modes of engagement, and new modes of being,” Kohn said in a statement. “The work is a continuation of the New Museum’s practice of integrating contemporary art and culture in New York City, as a foundational element of our mission. It is an extension of our commitment to the community and to our relationship with artists, who shape and shape our city as we live it.”The first works, titled “The City,” and scheduled to open in 2020, will introduce the public to new ideas about what a city might look and feel like in the future, including how the city might be transformed by", "The next Biennial should be held in early 2020.\n\n\nThe arts and culture sector contributed $190 million to the state of New York last year, according to the New York Times, and the board of the American Alliance of Museums (AAM) plans to invest in the sector in 2020. The investment will include the development of curricula, exhibitions, and other programming that addresses the issues that drive the cultural economy, and will take place in conjunction with the city’s exhibition season.“The AAM Board of Directors and I are excited to invest in New York’s arts and culture community with this new fund. We know how much you care about our city’s cultural institutions and their future, and this new fund is a critical step in helping us make the most of our neighborhood’s unique assets,” said David Samson, chair of the AAM board of trustees and president of the Manhattan-based real estate developer W.G. Kellogg & Son.The new fund will be similar in format to the one the AAM board created in 2016, which was launched with $50 million from a group of New York City civic and business leaders. The new fund will prioritize a program that will give local communities $", "The next Biennial should take place in 2022. \n\n\nThe Metropolitan Museum of Art in New York has appointed Monica Hsu as its next director and CEO. Hsu will assume her new post on February 18 and will begin as the director of the museum in March.Hsu comes to the Met from the Museum of Modern Art (MoMA), where she has been the director of development since July 2019. During her tenure at MoMA, Hsu helped the museum become an internationally recognized center for free, public, and contemporary art. She also expanded the museum’s collection structure and partnered with private collectors to bring more works to the institution’s collection.Hsu’s first major expansion, the Met’s New Art and Design Center (NAC), opened in 2018. The NAC’s collection is now larger than the Met’s entire collection, and it includes works by artists such as David Hockney, Edward Hopper, Frank Gehry, and Paul Gauguin. The NAC also added more than 1,300 new works by artists such as Mark di Suvero, David Goldblatt, and Alejandro Campanella. The institution was awarded a $3.1 million", "The next Biennial should take place in the spring of 2021. In the meantime, the institution is preparing for the possibility that the 2020 edition will be cancelled.“We are deeply concerned by recent statements made by leading figures in the art world and in the biennial industry which suggest that the cancellation of the 2019 edition was the sole result of the decision to remove a certain work,” said Konstantin Dobrynin, director of the museum. “We hope that the exhibition will continue as planned and will also continue to present works by people who have made important contributions to contemporary art. However, if the decision to cancel the exhibition is considered as having been based on the exhibition’s lack of success, we believe this is at odds with the museum’s stated principles.”\n\n\nThe Italian government approved plans this week to compensate the museums and cultural sites that were damaged by a devastating fire that broke out in a third-floor electrical room of the Palazzo Nazionale di Rivoli in Rome on Monday, March 15, and spread to the building’s attic, where it ignited a fire that raged for several days. The total loss of life from the fire is estimated at more than twenty thousand, and more", "The next Biennial should be held in London in 2021.\n\n\nThe Chilentionali Museum, in Florence, has released the first official description of the first-ever Biennale of Tokyo, which will take place in the city in the autumn of 2020. Titled “Ascension of Worlds,” the exhibition will also feature performances, installations, documentaries, and performances, and will offer a virtual reality experience.Curated by Stefan Frank Wächtler, the director of the Museum of Contemporary Art in Rome, the exhibition will be held on the Chilentionali Campus in Florence and will mobilize around one hundred thousand visitors to the city of Rome. The project was funded by a gift from Italian collector Tina Livanti, who has signed the contract for the organizers to organize the event.The “Ascension” show will showcase new works by forty-six artists. The majority of the artists participating in the show are returning to Rome, which is home to the Chilentionali Museum, which is one of the world’s largest collections of modern and contemporary art. The exhibition will also include the first solo exhibitions of works by artists whose works are currently displayed at the site in the", "The next Biennial should be held in 2022, when the current iteration of the event will be staged. Art historian and curator Jannis Kounellis, who is currently a professor at the Academy of Fine Arts in Milan\u0097where the next edition of the Biennial will take place\u0097said: “The changes that have been introduced in the last two years are not only out of step with the ethos of the Biennial, but also with what the art historian and culture critics have always called for.”The next edition of the biennial, “The Nine Stories of Christ” will kick off in the city of Cluj-Napoca in Romania on November 21 and will run until March 27, 2022. The exhibition will present three hundred works by twenty-four artists and will run for two weeks.The show will address topics such as the destiny of the soul and the afterlife, the nature of art and its relationship to society, and the history of art, as well as the modernist, post-modern, and post-historical movements. The event will also feature an exhibition of works by the artists who were active during its inception. The list of participating artists is as follows:Araudel Di Iorio-P", "The next Biennial should be held in the first quarter of 2020. “I could not be more excited about the opening of the new exhibition ‘The Body,’ at the Museum of Contemporary Art, Miami Beach, with the help of the creation team at the Art Institute of Chicago,’” said John Alleman, director and CEO of the Museum of Contemporary Art, Miami Beach. “The Body is the most important work of modern and contemporary art created in the United States. We are thrilled to work with the creation team to extend the breadth of this exhibition.” An international jury consisting of art historian and Brazilian curators Cara Coelho, Minwoo Choi, and Marisa Miranda will select the thirty-three artists and thirty-two artists from the twenty-six shortlisted entries for the prize. The finalists, completed in installments, will be announced in May. The 2019 awardees included Julia Berman, Yoshitomo Nara, Julia Louis-Dreyfus, Nawal El Sayyed, Sara Figueroa, Andrés Muñoz-Oyé, and Emilio Oiticica.", "The next Biennial should include a tour of the Museum of Contemporary Art (MoCA) in New York, which will be inaugurated by a presentation of an exhibition that was curated by a team comprising Shinichi and Yoshitomo, the organizers of the Hollywood film festival. The museum will also host a performance by the Los Angeles-based pop duo Chino and Lorenzo León, who will perform at the Biennial. The performance will be followed by a screening of the film Untitled (1998), a biopic of the life and death of the late Chilean dictator Augusto Pinochet, as well as a discussion with artist-activists and historians.The first edition of the biennial was held in 1997 and ran from October 8 to October 13. The second edition will be held in 2021.\n\n\nThe Solomon R. Guggenheim Museum (SGM) in New York has released the list of seventy-seven artists and collectives whose works will be included in its upcoming exhibition “The Future Is Now: Art and the Future of Humanity” (October 19–October 21, 2021). The exhibition, which was established in 1988 to explore the ways in which art and technology are intertwined, is curated by the artist and technologist Zhu Wei and", "The next Biennial should be held in the fall of 2020. \n After we published our first issue of the Biennial in March 2019, we received a number of beautiful letters from readers, supporters, and collectors. The first set of letters consisted of three letters signed by a number of extraordinary collectors, including Daniel H. Paul, Charles F. Townsend, and Nancy L. Simon. The correspondence between us and these collectors was remarkable, and we were delighted when they contacted us to express their appreciation for the exhibition. We are very much looking forward to working with them again. A few days after we published our second issue of the Biennial, we received a letter from the Juror and the judge of the exhibition, Lewis Pickering of the High Court. “While I agree with most of the recommendations in this year’s Biennial, I greatly value the work of the new commissioning curators and the investment of time and effort they have made into the exhibition’s development,” he wrote. The letters continued by thanking us for our attention to their suggestions in presenting the exhibition as well as in the preparation of the exhibition, and we thank them for their efforts. The descriptions", "The next Biennial should be a display of the artwork of the three Biennials.” The second exhibition should be a chronological history of the Biennials. The third will focus on the collective:“The Art of Michelangelo,” the eighth; and the final will be a selection of early works by the artists who made up the Harlem Renaissance.The Biennial is hosted by the Museum of Modern Art in New York and the United Kingdom. The exhibition was co-organized by the Biennial Committee, the Threshold Foundation, and the Harlem Renaissance Society.\n\n\nThe London-based nonprofit Art Fund has named Noma Tandberg its new executive director. Tandberg will be responsible for spearheading the organization’s new $3.5 billion corporate philanthropic goals, which will aim to build on the foundation’s curatorial, research, and advisory relationships with major art institutions through new programs, creative initiatives, and educational initiatives.“This is a pivotal moment for Art Fund, and I’m thrilled to be leading it through this transition,” said Tandberg. “I’m keen to ensure that Art Fund continues to be an important voice in the global conversation around art, and", "The next Biennial should be held in 2019. If the work is selected for the 2020 edition, the artist will be given a platform to present new works that will be inaugurated by the artist at a special exhibition at the Museo de Arte Contemporáneo de Barcelona in December. The Biennial’s work, titled Autobiennial 1, will have a retrospective of the work at the museum in March 2021. “I’msa Steyerl: Auto Evolution (We are not alone)” (2015) will go on view in the autumn of 2020. The Biennial will also attempt to draw attention to the perennial themes of resilience and transformation, the unfolding of history and the role of art in addressing these themes. Steyerl’s exhibition and the work of the Biennial will be presented at completely different times and locations. The work will also be presented in a completely different format, namely in a gallery space.“In the Golden Triangle, where paradoxes converge with tragedy, Steyerl chooses to confront the legacy of the author, Karol Wojtyła, to become a platform to present a new work by the artist,�", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA), which was scheduled to open on October 5, has announced that it is delaying the opening of its fourth annual “Carmen Smith’s’s “Juxtaposition” exhibition. The show, which will address issues of urban life, politics, and culture in Los Angeles, will now be staged in 2021. A special exhibition, “Connections and Alternatives,” will be presented in 2022.“The show was intended to celebrate the work of a small group of artists in New York City,” the museum said. “We are grateful to the artists who have participated in the exhibition, and especially to the young artists who have been inspired and empowered by the exhibition.”The Museum of Contemporary Art (MCA), which has locations in New York, New Orleans, and San Francisco, also said that it is rethinking the opening of its new gallery, which will open in the fall of 2022, as part of a larger $450 million overhaul of the institution. The new space, which will be called the Embankment, will be built in the former industrial site of the former Motorola", "The next Biennial should take place in 2021. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Stacy Rasch, a contemporary art historian and curator, as its next president. Rasch succeeds Helen Frank, who retired in May after six decades in the role. Rasch comes to the museum from the J. Paul Getty Museum, where she has served as interim director since March 2019. Frank, who served as director of the Getty from 2001 to 2007, will serve as interim leader until a new leader is appointed.“In a time when it is increasingly difficult to find a balance between art and culture and a world awash in mediocrity and a rapidly changing economy, we are grateful to Helen Frank for guiding MFA into the future and leading the museum through a restructuring and reimagining that has brought the museum closer to meeting the needs of our diverse communities and the world at large,” Rasch said in a statement. “MFA’s transformation demonstrates its commitment to exploring and challenging the role of modern art in reimagining how we live, work and think about the world.”During her tenure at the museum, Rasch helped the institution become a leader in global contemporary", "The next Biennial should be held in the spring of 2021.\"In an attempt to address the issues raised in the symposium, the design-focused organization has released a new set of guidelines on the exhibition, titled \"How to Design: A Biennial.” The guidelines attempt to outline a public space for the Biennial in a way that would allow the construction of an audience with an open and light experience.“There is something beautiful and hopeful about an open, connected space,” Sutton said. “The idea that we might be able to share in the experience of one another is an exhilarating prospect.” The guidelines are available on the agency’s website.\n\n\nThe Twenty-One Cent Center for the Arts in New York has received a gift of $1.5 million from the Midshipmen of Arts, which is a division of the Midshipmen of Christ Church, the largest independent seminary in New York. The gift includes $1.5 million for scholarships and grants, and $800,000 for the development of a new program on behalf of the Midshipmen in partnership with the New York Foundation for Jewish Cultural Services.The gift was made during the Midshipmen’", "The next Biennial should be held in June 2020. \n\n\nThe Solomon R. Guggenheim Museum in New York has received a gift of thirty-nine works from the collection of American artist and scholar Andrew W.K. The works, including works by early twentieth-century American painters such as Robert Irwin and Garry Winograd, were donated to the museum by billionaire collector James D. Gregory.The gift includes three works by Andrew Lloyd Webber, a cofounder of the five-person venture capital firm Stratfor; two works by Richard Diebenkorn, another Stratfor protégé and the creator of many of the group’s early works; and a work by Robert Irwin that was part of the group’s ongoing series “Brief Lives.”The works were donated by the Guggenheim in cooperation with the Andrew W.K. Foundation, which is dedicated to the artist’s work, and Kate Middleton. A spokesperson for the museum told the New York Times that the gift was made in recognition of the work’s significant scholarly and public international legacy. \n\n\nThe Maltese artist and architect Zaha Hadid Architects are suing the Lebanese government and the Lebanese collective Bed", "The next Biennial should be the twenty-first, and according to a report from the Art Newspaper, the twenty-fifth will take place in Qingdao, China. The date for the exhibition has yet to be announced.The 2020 edition of Art Basel Hong Kong, which will be held in Hong Kong from November 18 to November 20, will be hosted by the Art Museum of Chicago. The event will be held in the museum’s new venue on the city’s campus. “Art Basel Hong Kong will continue to embrace the art of the city and will continue to engage with the art world and all its interconnected communities,” said Paul Oehlen, the Art Basel Hong Kong director. “Our dedicated team is working in close cooperation with our Hong Kong partners and we look forward to welcoming you to the city once again next year.”\n\n\nThe Museum of Modern Art in New York has appointed Stacy Albie, who previously served as an assistant curator at the Museum of Modern Art in London, as its new chief curator. Albie succeeds Jessica Strahan, who departed the institution in July 2019 to head the Whitney Museum of American Art in New York, and will assume her responsibilities on February 23.", "The next Biennial should be held in the spring of 2021, and could include works by artists from all over the world, including Shimon Bar-Lev from the US and the Netherlands.The biennial’s design was influenced by the American urban landscape, which is divided into gridlike patterns of dense, industrial-sized housing—a format that has been replicated in the art world. It will also closely resemble the New York City streetscape, incorporating large public open spaces, pedestrian overpasses, and other public elements. The installation will include works by twenty-four artists, including Hannah Wilke, Jodi Throckmorton, Jason Ulman, and Theresa Weisz, and will run for twenty-four hours, from June 1 to June 26.\n\n\nThe Ministry of Culture in Beijing announced today that it plans to double the budget of the National Museum of China in the capital to $180 million, in an attempt to attract more foreign art and cultural enterprises to the city. The plan, which was leaked to the Art Newspaper on June 28, outlines the creation of a new $100 million fund for cultural exchange, as well as the establishment of a new $60 million Cultural Exchange Fund, which will support international cultural exchange in Beijing, as", "The next Biennial should take place in 2020.\n\n\nA group of artists, engineers, and designers in the Netherlands have launched an online petition protesting a new law that would allow the government to secretly monitor social media users' online activities. The campaign, which has received over 1,600 signatures, claims that the new legislation violates privacy and infringes on freedom of expression.“The bill would allow the National Security Commission (NSC) to monitor and store metadata about every person in the country’s territory, including browsing histories, geolocation information, phone numbers called, e-mails, and other online activity, and would also require Internet Service Providers (ISPs) in the Netherlands to keep records of users’ online activity,” read the statement by the signatories. “The NSC would have the power to order the storage of all metadata, including IP addresses and other information about individuals, and this information could be shared with the private sector or other state agencies. We believe that this information should be made publicly available and accessible to the public.”The activists, who include Julius Wachs, Hetain Morar, and Wael Ghobash, who were not connected to the petition, created a website", "The next Biennial should take place in the city of Porto Alegre in the state of Pernambuco, Brazil, in 2021. The 2019 exhibition, titled “The Art of Discomfort,” presented a collection of new works by artists such as María Berrada, Carlos Garaizan, and Gereon Das.\n\n\nThe Baltimore Museum of Art (BMA) has appointed Elizabeth Aschenbren and Caroline Wilson as assistant curators and curator of contemporary art. They will take up the post in the summer of 2021. Both Aschenbren and Wilson will work with a new group of artists, the Baltimore Contemporary Artists (BCA), to present themed exhibitions, events, and other programming. The group will begin by presenting a series of five exhibitions in June, 2019, and will continue with a series of programming in June 2020.“The BMA’s new philosophy for contemporary art has always been to develop the most innovative programs we could possibly implement, and to continually engage with and reimagine public spaces,” said BMA executive director Michael Govan. “We’re almost there. We’ve been experimenting with new ways to organize shows and events since the", "The next Biennial should take place in 2019.” The new partnership will allow the museum to present a “narrative of the past through the lens of modernity,” Cameron said. The partnership was formed in connection with the ongoing documentary exhibition “Untitled,” which has been held at the museum since 2010, and will be hosted in both locations. The show, a virtual reality experience created by artists and curated by curator Stewart Brand, will explore the relationship between VR and the body, and will be presented by director and curator of the Biennial Jonathan-Paul Witherow. In addition to the new partnership, Cameron and Witherow will be collaborating on an exhibition that will examine the future of meditation and meditation practices, and will launch a crowdfunding campaign.\n\n\nThe Art Newspaper reports that the Dutch Ministry of Foreign Affairs has temporarily closed two of the country’s major art museums in an attempt to reduce the risk of the coronavirus (CVD) spreading to the UK. The ministry announced on Saturday that it was temporarily closing the Museum van Amsterdam and the Museum Rotterdam to “ensure a satisfactory protective measure” and “ensuring cultural exchange, tourism, and other economic activity in", "The next Biennial should take place in the West Indies in 2020. “The present exhibition has given the Brazilian students a great opportunity to see the work of their peers in the country, and we are eager to see how the new format will open up new perspectives and enrich the exhibition program,” said curator Marcela Ferrer.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Anna-Sophie Banes as its next curator and director. Banes comes to the institution from the San Francisco Museum of Modern Art (SFMoMA), where she has served as curator of contemporary art since 2013, and succeeds Cynthia L. Bennett, who retired in June 2019 after more than fifteen years as director.“With her creative approach and commitment to creative education, she has transformed the museum into a strong voice for contemporary art in the United States,” said Peter Scharf, who has served as interim director since Banes’s appointment. “At MoCA, we believe she embodies the excellence, integrity, and optimism that make MoCA such a special institution. We are excited to welcome her to the board and to work with her to shape the future of the museum.”Banes will assume her", "The next Biennial should be held at the Banff Centre in Alberta, Canada, in mid-March 2020. In the interim, the institution is planning to switch to a digital platform as it works to make the reopening of its new campus, the National Museum of Canada, possible. \n\n\nThe Art Newspaper has published an exclusive first look at the next edition of the Kunsthalle Basel, titled “The Future Is Bright,” which will take place in the Swiss Alps from April 16 to April 20, 2020. The exhibition, which is being organized by the Kunsthalle Basel in partnership with the prestigious German art group, the Beitrag & Beitrag, will advance the work of Günther C. Troelts, Thomas Köhler, Sigmar Polke, and Wolfgang Pfeifer, among others, while featuring the first US exhibitions of their work since the late 1960s. The program’s first retrospective in the Swiss Alps will take place at the Bemidji State Museum in March 2019. “With its combination of art and philosophy, the exhibition aims to explore the meaning and meaninglessness of the contemporary world. The artists create and explore ambiguities and paradox", "The next Biennial should be a step in the right direction, presenting the works of the most important artists of our time, and should include the best works from the past twenty-four hours. In the meantime, the pavilion will remain open at least until March 7, and the exhibition may continue as intended.  For the past two months, artists, designers, and activists have been canvassing for a full year of programming that would bring the works of the year together in one event. The event, called the Yalta symposium, was planned, organized, and annotated by the country’s founding president Joseph Stalin. The forty-three-year-old former Russian writer Natalia Gross has been selected to write the theme song for the biennial. \"I am thrilled to create a new theme for our biennial, an unforgettable story for the participants and the public, which will express the infinite possibilities of art and its transformative power to bring joy and vitality to our lives and surroundings.”The biennial will take place throughout the city of Saint Petersburg and will open with a gala on March 19. The biennial will continue with a series of performances and other activities over the course of the month.\n\n\nThe Boeing Company", "The next Biennial should be held in January 2020. The institution will keep the same staff as it did in order to prepare for the possibility of a sudden closure due to the coronavirus.The Museum of Modern Art (MoMA) in New York is also preparing for a possible shutdown by canceling the upcoming exhibition “Theater of Operations: The Gulf Wars 1991–2011,” which will run alongside the upcoming “Theater of Operations: The Gulf Wars 1986–2009,” and will also prepare for a possible shortfall in revenue due to the pandemic. According to the New York Times, the museum anticipates a loss of $200 million in revenue, a blow to its bottom line that will force it to reduce the size of its annual exhibition. The Museum of Contemporary Art (MoCA), New York:  According to Artnet, the museum expects to lose $200 million in revenue due to the Covid-19 pandemic, and is considering reducing the size of the annual retrospective, which is scheduled to run from January 27 to January 29. The institution is also preparing to move the exhibition from its current location in downtown Manhattan to a smaller space in Queens. “This is not a temporary crisis,�", "The next Biennial should be held in 2021. The Park Art Museum in Seoul is currently negotiating with the city of Seoul to become the new home of the museum, which will also include a cultural village that will include a library, a museum, and an outdoor plaza. The renovation of the Park Art Museum began in 2016 and is estimated to cost around $50 million. The renovation of the city’s National Museum of Modern Art began in 2012 and is currently estimated at around $30 million.\n\n\nThe Institute of Contemporary Art (ICA) in London announced today that its first-year cohort of twenty-six artists, most of whom hail from the West End, is being brought together by the Institute of Contemporary Art (ICA) to create a program of programming that will engage with contemporary issues and issues that challenge the status quo. The project, titled “Thealignment Project,” will be led by Antonia Catellani, the director of the Museum of the School of Arts, and will focus on reimagining how art is presented in galleries and museums, in order to better reflect the local and global realities of the West End. “This is a time of great change and the work of the ICA is about to", "The next Biennial should take place in the city in 2025. That year, Pace Gallery, the Museum of Contemporary Art, Houston, and the Houston Museum of Art will host a special exhibition dedicated to the work of Robert Irwin. This year’s edition of the Omni Houston will focus on indigenous artists and their communities from the Americas.\n\nArtists who were honored at this year’s Lincoln Center Awards show, which kicked off on January 8, include Courtney Love, David Kajsa, and Jorge Arantes. In addition to Love, Kajsa, and Arantes, the top ten honorees are Tobi Haslett, Suellen Rose Halperin, John Goode, André Achenbach, Sara Cwynar, Julia Dreyfuss, and Sonia Frank.Holand Storey, the artistic director of the Lincoln Center, added: “These are extraordinary artists who embody the heart and soul of the city of Lincoln. They are the people who create and shape the future of Lincoln through their art, and we are thrilled to see their work come to life for the first time in the Museum.”\n\n\nThe", "The next Biennial should be in 2020. We will then begin a campaign to bring you the most updated and comprehensive information about our biennials. We will continue to strive in the months and years to achieve a balance of exhibitions and programs that reflect the spirit and spirit of our art museum. The museum is committed to becoming a more international, democratic, and inclusive institution. It is planning to launch a new platform that will be able to present and connect directly with our audiences. The platform will be designed with the support of the public in mind.We are also committed to listening to our audiences. We are developing a new audio/visual education program that will engage with and challenge the biennial experience. This will be a shared experience across art and culture, so that we can learn from each other and reflect on our histories and our futures. It will also be an opportunity to understand and be inspired by the museums and the people who inhabit them. We have made great progress in recent years toward achieving this goal. We are now approaching the moment when we can thank the public for what we have achieved in a very short time. We are at the very beginning stages of this project. We thank the many artists and curators who have participated in the past", "The next Biennial should take place next year, and the twenty-fifth in 2021.\n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) in Philadelphia has received a $30,000 donation from the Warren and Aurora Giuffrida family. The gift, which is one of the largest ever received by PAFA, was made on behalf of the family by way of a gift made to the institution in 2017.“The Giuffrida family is deeply impressed by PAFA’s new fundraising platform, and by the Paizo’s commitment to education and opportunity through its award-winning exhibitions,” said Mark Gagosian, the Giuffrida family’s managing director. “The Paizo Curator in Residence program has been a transformative experience for them both. We are very much looking forward to their continued work in service and scholarship to PAFA, and the community of artists and scholars who have benefited from their work.”The Giuffrida family also donated $15,000 to PAFA in 2017, and the Giuffrida Art Museum in New York City also made a gift to the academy in 2016.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles", "The next Biennial should take place in 2020 and will date the biennial's theme: Laundromats. The exhibition will be led by Dorothea Rock, curator of modern and contemporary art, and will run from March 15 to March 16 and feature over thirty artists, including Nari Ward, Yuki Kondo, John Crowley, Kiki Smith, and Mark Sarreau. \n\nA report commissioned by the Royal Institute of British Architects (RIBA) in London and published by the London-based architectural firm Grafton + Gibbs—which designed the National Museum in London and the Tate galleries in Tate Modern—has calculated that the construction of the new National Museum of Britain—the twenty-fifth iteration of the institution—would cost an estimated £50 million.Dubbed the Discovery Zone, the museum will be built on the site of the former Royal Festival Hall and will boast a 1,400-seat theatre, a research library, an auditorium, and a café. The new building will also feature a retail, education, and visitor services building, and will boast more than 250,000 square feet of exhibition space.The report, commissioned by RIBA to advise the National Lottery, concluded that the construction of the Discovery Zone would create 22", "The next Biennial should be organized as a series of lectures, culminating in the exhibition “Time: A Biennial” in March 2020. Hamilton-Tuttle, which represents the international visual arts, media, and performance community at the University of Cambridge, said: “The future of our exhibition program will be decided by the outcome of the Biennial Victoria,” which will take place in early 2021. \n\n\nThe London-based charity the Royal Society of Arts (RSA) has announced that it has received a generous gift of $50 million from the Solomon R. Guggenheim Museum (S.R.G.M.), the David Walliams Foundation, and the Walton Family Foundation. The funds will allow the charity to create twelve new fellowships for emerging artists. The lucrative opportunities would be given to Raja Menon, Sara K. Stewart, Mungo Parker, and Frank Shorter and would be offered in conjunction with the upcoming Royal Academy of Arts’s inaugural edition, which will take place at the London school of art. The previous years’ cohort of fellows, which comprise Menon, Parker, Shorter, and", "The next Biennial should provide a platform to examine artworks and artists through a social and political lens, with a particular focus on the transformative power of art to address social and political concerns. We are currently considering the local, national, and global dimensions of the exhibition, its reception, and its future. We believe that the biennial format will be a powerful tool for representing the art of the Philippines.”The exhibition, “Art in Motion” (2017), presented the work of thirty-nine Filipino artists, including Ana Paula Vasquez, Agustina Pilar, Lourdes Ocampo, and Nene Atencio, and was curated by Nilda Catarina, who has previously presented the work of many women artists, including Roxane Murillo, Naguib Mahaun, and Edith Pia.The theme, “Power and Motion: Filipino Stories,’ drew from the history of Filipino art and art historians to examine the political and social challenges and the larger cultural landscape through the lens of American Pop. According to Catarina, “Filipinos have a responsibility to move beyond the current colonial era to a new society based on their history. They should learn more about their history, their culture", "The next Biennial should take place in 2020. In the meantime, the Museum of Modern Art (MoMA) in New York has stepped up its efforts to hold museums accountable for their exhibition-buying practices by launching a new prize for art-world curators. The $10,000 prize will recognize the contributions of seventeen awardees. The winners will be selected by a panel that includes Pablo Picasso, Thomas Albert, David H. James, Jean Dubuffet, Janette Laverrière, and Helen Frank.The winners will be chosen by an online panel of artists, curators, scholars, critics, and institutions, which will be chaired by Lauren Oxtoby, curator of contemporary art at the Museum of Modern Art, New York; Tracey Anderson, curator of modern art at the Museum of Modern Art, Los Angeles; and Alberto Vulich, director of the Pérez Art Museum in Mexico City. The finalists are Kelly Osbourne, curator of contemporary art at the Museum of Modern Art, New York; David Lebovitz, curator of contemporary art at the Museum of Modern Art, New York; and Daniel O. Ross, director of the Museum of Contemporary Art, Los Angeles.The 2017 biennial,", "The next Biennial should take place in 2021, with a program of exhibitions and talks that would center around themes such as “black art and history,” “influences of the African diaspora,” and “middle and high art.”\n\n\nThe Democratic National Committee (DNC) and the Democratic Senatorial Campaign Committee (DSCC) have agreed to jointly manage the 2020 elections in the northwest United States. The move comes amid a push to establish new party platforms and organizers are eager to see how the 2020 elections will closely align with one held in 2022.“The 2020 elections will take place from January 2, 2021 to January 16, 2022, and will be held on an as-needed basis,” reads a joint statement released by DNC Chair Debbie Wasserman Schultz and DCCC chair Deborah Warren. “We expect this to be an historic election, and that it will reflect the spirit of our nation and the values of our party.”The announcement marks a change of pace from the DNC’s earlier strategy of focusing primarily on building up its organizational base and following the lead of the Bernie Sanders campaign. Instead of focusing on building a new platform, the DNC is focusing on building a new party.", "The next Biennial should be held in 2020 and will include a presentation of work by twenty-four artists from the Yixinchu region in Beijing. While the exhibition will serve as an opportunity to showcase the work of around sixty artists, it is likely that the actual event will take place somewhere between the cities of Beijing and Nanjing.According to Artnet, China’s Cultural Heritage Protection Bureau (CHPB), which has responsibility for enforcing the country’s cultures and monuments protection law, will issue a preliminary ruling on the matter in the coming weeks. If the CDPB upholds the suit, the exhibition will be deemed a violation of the new legislation.\n\n\nThe Gallery of Modern Art (GMA), London, has received a $20,000 donation from the Andrew W. Mellon Foundation. The gift, which comes in the form of a grant of $15 million, will expand its mission to support the creative economy in the UK by awarding a total of $25 million over the next two years.“Andrew W. Mellon is a legendary philanthropist and educator who has given generously to the Gallery of Modern Art since its founding in 1964,” said Mark Richardson, CEO of the foundation. “His gift will", "The next Biennial should take place in 2021, and the twenty-first in 2022. In a statement, the Art Museum Houston said: “This is a pivotal moment in our city’s history as we enter a critical period of our history. The announcement marks an important moment for the Museum of Contemporary Art Houston and the city of Houston’s future.”\n\n\nThe Mississippi Museum of Art in Oxford, Mississippi, announced today that Jasmine C. Coleman, a curator of African American art, will become its next director. In her new role, which will begin in January 2021, Coleman will work with the institution’s curators, artists, and staff to present a diversity of exhibitions and education programs across the institution’s three locations in the city, including the Museum of Art.“Jasmine’s achievements and the breadth of her experience in contemporary art make her the ideal candidate for the role of director,” said Elizabeth Hitt, chair of the board of trustees of the museum and chair of the board of directors. “Throughout her career, she has shown extraordinary perseverance in cultivating a strong and diverse collection of African American art within a well-defined and internationally recognized mission.", "The next Biennial should commence next month.\n\n\nThe US Court of Appeals for the Fourth Circuit has ruled that the Bank of New York (BNY Mellon) is liable for the fraudulent foreclosure sale of a home in Brooklyn. According to the Wall Street Journal, the court found that the bank violated the National Labor Relations Act (NLRA) by allowing foreclosed properties in Brooklyn to be sold at below market rates—a practice that was widespread during the 2008 financial crisis.The case stems from the sale of a home in Bushwick that had been preowned by a woman who was arrested for allegedly breaking and entering in 2015. The woman claimed she had left the property in the early morning hours of March 27, 2015, when she had just returned from a family visit to the borough. Her attorney had originally sought a total of $3,370,000, but the judge ruled that the total bill would be closer to $4 million. The court also found that the bank failed to inform the woman of the rights and remedies of the National Labor Relations Act, and that she failed to demonstrate that her wrongful arrest violated any of the other provisions of her guilty plea.In a dissent that was filed by Judge Vito Carbonellas, the court said that the bank", "The next Biennial should be held at the Institut National de la Saître (Belgium), designed by architect Rainer and featuring a design by the artist Alex Hirschhorn. The exhibition will be presented in multiple formats, including a book and film, art and performance, books and other materials, and film and video.The exhibition will also include a presentation of works by the French-born artist Samira Bruguera, a work by the German-born artist Christoph Neuer, and works by the French Nouvelle-Alès Jaudé, a painter who was influenced by the work of Chagall and Gainsborough. The biennial will be held in collaboration with the Museu de Arte de Paris (MASP), the Research Center for Contemporary Art (CARA), and the Centre Pompidou in Paris.\n\n\nThe California Academy of Sciences (CalArts) has appointed Terry Teitelbaum, a Los Angeles–born American artist known for her dazzlingly lifelike public sculptures, as its next president. He succeeds Sitaram Ganesan, who helmed the institution for more than twenty years, and will take up the post in January 2020.“Terry has an", "The next Biennial should take place in 2020.\n\n\nThe BOMB Museum, the New York institution dedicated to the art and science of bombs, has launched a new award model that will rely heavily on community engagement. Under the guidance of the nonprofit Museum Research Center, the institution will award $1 million to organizations working in the field of organized religion.Its inaugural award cycle will focus on “where the art and science of bombs lies” and will coincide with the biennial’s tenth edition. The inaugural awards will be given in partnership with nonprofit organizations, including the Charles H. Lucas Foundation for the Arts, the New York City Council on the Arts, and the American Association of University Professors.The biennial will also host a series of public events, including an exhibition called “Meetings for the Brain” that will explore the connection between art and science and a special presentation by artist and scientist Carl Zimmer. The exhibition will be co-organized by the Museum Research Center and the David Geffen Gallery and will run from March 19 to March 21.The BOMB Prize, an annual $250,000 award presented by the Museum Research Center, will be given to “Cheryl Antle.�", "The next Biennial should focus on the long-term sustainability of the museum’s collection, exhibitions, and programming. The announcement comes on the heels of the museum’s announcement last month that it plans to close its doors for a period of fourteen weeks, beginning April 7 and ending April 10. \n\n\nThe Museum of Modern Art (MoMA) in New York has long faced pressure to restitute artworks or face a reckoning with the state over its mishandling of the Cannibal Holocaust crisis. Over the course of a decade, the museum has grappled with the repercussions of its mishandling of the crisis for two decades, and in 2016, the institution finally took the first steps to restitute the artwork of Spencer McLaren, the Italian American who was the subject of forty-two decades of exhibition’s “Scheherazade” series.“Since the museum began the series in 1984, it has never publicly acknowledged its mistakes, let alone remitted them,” museum director Daniel H. Weiss said in a statement at the time. “I’ve worked hard to make certain that the pain of the survivors, and of future generations, is recognized in action. The changes we have", "The next Biennial should also aim to present works of art that address contemporary issues from a refugee perspective. Both art and artists are threatened by the threat of violence and discrimination. This is why art is so important. It is art to tell the stories and the realities of refugees. It is art to serve as a vehicle for the social transformation of societies.The exhibition will focus on the European refugee crisis in the light of the upcoming exhibition “Refugees and the Eighties” (Berlin’s Stedelijk Museum), which will open in the summer of 2021. The exhibition will include works by thirty-four artists and will examine the history of refugees and asylum-seekers in Europe and the United States, including the contradictions of migration in the West, as well as the international journey of art.\n\n\nThe Museum of Fine Arts (MFA) in Boston has welcomed Alexandra Connell as its new executive director. In her new role, Connell will oversee the operations of the museum and the Massachusetts Arts and Artists’ Association\u0097a nonprofit that promotes arts and cultural organizations in the Greater Boston area\u0097and will spearhead the museum’s expansion into an institution connected with the arts. She will assume her responsibilities in January 2021", "The next Biennial should take place in the city between March 28 and March 31, 2020. \n\n\nThe thirty-second edition of the Salone de São Paulo, which was held in the Copacabana River, Brazil, in October 2019, has announced that it will move to a new venue, the códromo de São Paulo, in the capital city. Previously dubbed the São Paulo Triennale, the event was rescheduled for March 28–March 31, 2020 and featured more than seventy artists from eighteen countries.“The project to create the new códromo de São Paulo was initiated by the Friends of the City of São Paulo,” Stefan Hagen, the chair of the art department at the city’s Government Communication Agency, told the Art Newspaper. “The city entrusted us with the responsibility of designing an ideal venue for the event, and we’ve come up with an innovative and aesthetically pleasing solution that will serve Brazil well into the future.”Since the construction of the venue was started in 1994, the exhibition has been held in two forms: a biennial that is organized by the city of Brazil and is followed by a town hall-style", "The next Biennial should take place in 2021, and the seventy-ninth in 2022. The partnership between the museum and the Chinese government gave the institution the opportunity to better understand the cultural heritage of the People’s Republic of China. The announcement of the partnership is a step in the direction of an international exhibition of Chinese art, curated by the Museum of Fine Arts, Shanghai, in collaboration with the National Museum of China, Beijing, and the National Museum of the History of Art, Beijing (MMA). The partnership between the museum and the Chinese government is a continuation of the initiative begun in 2009 by former Chinese president Hu Jintao, who appointed Wang as deputy director of the museum.In 2012, the museum made history with the first ever exhibition of Chinese art to the United States. The exhibition, “The Color and the Shape of the Sun,” was staged at the National Gallery of Art, Beijing; the National Museum of Chinese Art, Beijing; and the Shanghai Museum of Fine Arts. \n\n\nThe 1,500-year-old museum in the city of Nara, in the central province of Soga, Italy, has been restored by the Italian government. The restoration, which was completed in a project funded", "The next Biennial should be held in 2022.“The next edition of the Biennale will be an ambitious and ambitious project, which combines the most recent developments with a new narrative and new themes,” Gartenböhl, the Berlin-based festival director, told DW. “The biennial will be an open-ended experience that will convey a variety of stories and reflect on the greatest contemporary achievements of art and architecture in the city of Berlin. In doing so, we hope that this year will be the year of the Biennale. It is our hope that the exhibition will become the theme of the two-hundredth edition of the Berlin Biennale.”\n\n\nThe Bechdel Test (BET) has released the results of its annual survey of art criticism, which has been running since 2012 and has been credited with helping to spur the development of critical thinking about art and art criticism and art history. The annual survey, which was commissioned by the Beckenham Foundation and conducted by art critic Christopher Beck, has been published in the latest issue of Artforum. The survey, which was founded in 1972 and follows the guidelines established by Beck, was inspired by a question asked by a fellow critic in", "The next Biennial should take place in the year 2021. It will be led by a group of international curators from Argentina, France, Italy, Peru, and Turkey. The biennial’s theme, “Thealgesia and the Art of Evol,” will be “about the relationships between the Hecate, the Great Mother, and mankind.”A selection of selected works from the show will be presented in the exhibition “The Conversation: Contemporary Art and Theory,” which will be curated by Jodi Dean and will run concurrently with the biennial. Dean will present “The Conversation’s’s Art of Consciousness” (2019) and “The Conversation’s Art of Creation” (2019) in the fall of 2020. The full list of exhibitions opening around the world is as follows:Art of Resistance: “Art of Resistance” (2019)Art of Invention: “Art of Invention” (2019)Art of Destruction: “Art of Destruction” (2019)Art of Human Suffering: The Fates of Human Life,”“Art of Human Suffering: The Fates of Human Life�", "The next Biennial should be held at the Park Hall in Seoul, the South Korean capital, in 2021.\n\n\nTwo hundred and fifty-seven artists and activists\u0097including actor and activist Hailee Steinfeld, whose work is featured in the exhibition “Theater of Operations: The Gulf Wars 1991–2011,” the sixth in the series, and artist and comedian Park Soo Hyun, who is known for creating and playing a character that is often a companion for the protagonist in her play The Journey, which is currently on view in the United States from September 13 to September 21\u0097are set to stage a protest at K-Station Square on October 3.The “Our Platform for Art” initiative, launched by artist Ji Seung-kyeong, was inspired by the controversy surrounding the opening of Artist Space Seoul, an art center owned and operated by the state and operated by the local government, which was shuttered after a fire destroyed the building in February. The fire also led to the closure of the museum\u0097the only institution in Seoul that had permanent collections of art.“The K-Station Square event will be a staging ground for artists and activists from South Korea to protest the government’s", "The next Biennial should be held in 2021.\n\n\nAMC has released three new series for its upcoming sixth season of primetime television, Atlanta, New York, and Los Angeles. The series, Between the World and Me, will premiere on September 26, 2019; Revenge, which will air on September 27, 2020; and The Deuce, which will air on September 29, 2020. Each episode of the series will follow a different character in the life of a group of friends, who are scheduled to go on a road trip to Rome in October of 2019.In between the series will be a special feature on the art market and a review of the film Annie Hall. The film, which was directed by Jeffrey Knight and stars Rebecca Hall, will debut on September 26 and will be followed by a discussion with the artist and the director, as well as with the Los Angeles-based biennialist Emily Hall. The film will also be featured in an exhibition at the Museum of Contemporary Art Los Angeles (LACMA) in October.“We are honored to welcome Emily Hall to the CityWalk,” said director Dayton Guggenheim. “Her work embodies the essence of American", "The next Biennial should focus on the history of modern and contemporary art and its interaction with the latest developments in philosophy and aesthetics. The third should focus on critical reflections on art history from a socialist perspective. The fourth will consider the history of modern and contemporary art within the context of the new global reality, a reconstruction of the future. The fifth will take up the themes of our present and future through an ethical, political, and spiritual perspective. The eighth will be a celebration of the importance of art in the life of a city. The ninth will be a reflection on the relationship between humans and nature. It will also consider the relationship between people and the environment in a historical, social, geographical, and economic context.\n\n\nArtist-run space The Margin for Art (TMA) has announced that it is now accepting art donations. The nonprofit organization is now accepting art from around the world, including from artists in New York, Paris, and London. The organization will donate art to TMA’s upcoming exhibition “Beyond Zone,” which is slated to open at Brooklyn College in September.The event will feature work by seventy artists, including Andre Seroussi, Riccardo Parodi, Yana", "The next Biennial should be held at the Akademie, in Berlin; the Yale Art Museum in New Haven, Connecticut; the Metropolitan Museum of Art, New York; the Sherman Museum of Art, San Francisco; and the Museum of Fine Arts, Boston, as well as at the Smithsonian Institution in Washington, DC.The first iteration of the biennial will take place at the Museum of Modern Art, in New York, in 2021; the Solomon R. Guggenheim Museum, in New York, in 2022; and the Whitney Museum of American Art, in New York, in 2020.\n\n\nConstruction of the Shanghai Biennale, originally scheduled for 2030, is now set to begin in 2020. Its first exhibition, “Binary Vision: The Art of Bodies,” will open in June, 2020. The exhibition will consist of a number of monochromatic installations and will be inspired by the exhibition “Danger Zone\u0097” (2019) at the Düsseldorf Literature Festival.The new venue for the biennial, the Junx Factory in the Junxing District of Shanghai, is being built by Hong Kong–based firm Gennady & Partners, with China’s help", "The next Biennial should be held in 2021, according to Mario Badescu, director of the Biennial of the Italian Museum of Fine Arts in Florence and a professor of architectural design. Škoda, who has served as director of the Palazzo Dallazio in Venice, was selected for the first edition of the museum as part of a grand deal struck between the Italian and French governments last June. The auction house paid $65 million to the Italian government and raised $50 million for the two-year event, which will return the GPAM Grand Prix to Rome in 2021. Badescu told the Art Newspaper that the next edition of the GPAM Grand Prix in Rome will be a step forward for the museum. “It will be an important show of the history of the GPAM, of Italian art, of the GPAM Curator, and of the family together,” he said. The current iteration of the event, which was founded by Italian collector Valentino Cipolletta in 1972, drew a combined audience of 22,000 visitors last year. The bids for the GPAM Grand Prix, which will take place in 2021, are expected to exceed the €100 million mark.\n\n\nThe Houston", "The next Biennial should be held at the Grand New Orleans, which will be reconfigured into an open-air museum that will be connected by an underground tunnel to the city. Louis Vuitton’s new headquarters will be relocated to the building along with the site of the existing museum. “This is a moment of profound transformation for New Orleans,” said Vuitton director Julien Bernard. “This is an historic time of rethinking, and of rethinking beyond the boundaries of our particular city.”Commenting on the center’s design, Bernard said: “We have spent years developing a bold, new concept for a museum as large and engaging as the Grand. We are thrilled to launch the new design with the intent to create a space that represents the full variety of ideas and ideas in the city.”\n\n\nThe National Endowment for the Arts (NEA) is expanding its work to protect critical works and artistic assets from the devastation caused by Hurricane Dorian. The agency is launching a new $6 million fund that will provide immediate relief to cultural organizations and individuals impacted by the Category 5 storm. The fund will also divert $1 billion from its Endowment for the Arts Fund to assist", "The next Biennial should include a presentation of work by contemporary artists who are part of the current generation of Ghanaian artists and should include a discussion of what kind of a future Ghanaian art museum should have.”The 2022 edition of the Biennale will be held at the Museu de Arte de Porto, in Lisbon, and includes work by seventy-eight artists and collectors. The exhibition is projected to cost $132 million and be curated by Ermel Sallu.\n\n\nThe Crema Foundation in Venice has announced the opening of a new Special Projects Fund\u0097called the Crema Artist Residency Fund\u0097to support artists whose practices are experiencing financial difficulties due to Covid-19 and who have a need of immediate financial assistance. The fund will provide grants of $250 to $500 in an effort to provide financial support to artists who live in the Venice area.The fund first launched in 2016 to help Christine Ndiaye who is performing, currently, at the Venice Biennale each year to pay for her travel and accommodation costs to and from the event. The fund was created in response to the financial hardships faced by artists working in the cultural sector during the pandemic.“I have been a successful artist for twenty years", "The next Biennial should be announced soon and will be hosted at the Museo de Artes Plásticas, Madrid (August 30–September 2, 2022). \n\n\nThe Museum of Contemporary Art (MCA) has appointed Chelsea Kastner as its next executive director. Kastner previously served as a curatorial assistant at the institution from 2015 to 2017 and is a scholar of European and modern art. She will assume her new role in September.“Chelsea is a seasoned executive, and we’re extremely excited by her expertise, enthusiasm and commitment to the MCA,” said David Pasternak, MCA’s director and CEO. “Her success will allow us to continue to grow the MCA’s collection in the most innovative and innovative ways while celebrating our rich history.”Kastner succeeds Christa Blankenship, who retired on June 30 after twenty-five years at the helm of the museum, and will assume her responsibilities on September 1. The MCA’s current plans for the museum are to open a new, expanded space for contemporary art later this year and begin construction of a new building in 2020.\n\n\nThe University of California, Berkeley, has launched a new", "The next Biennial should be held in 2022 and should reveal the next work by the artist, the biennial’s theme, and the artist’s collection. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has hired Jillian Green for its new deputy director of curatorial affairs and chief curator of contemporary art. Green comes to the museum from the Los Angeles County Museum of Art (LACMA), where she has served as interim director of curatorial affairs since October 2019.In her new role, Green will be responsible for connecting with local communities and working with the leadership team across curatorial and educational departments to shape the institution’s curatorial vision. A scholar of American art and the history of art, Green will be tasked with developing and executing new curatorial and educational programs.“Jillian Green’s extensive curatorial experience, as well as her passion for contemporary art and the history of art, have made her a strong candidate for the newly created position of deputy director of curatorial affairs and chief curator of contemporary art,” said board chair Mary Ewing. “Her work has been featured in major exhibitions in the United States and Europe, including the 2019 Museum of Contemporary Art (MoCA", "The next Biennial should provide a platform for the flowering of new creative practices and new ideas.”\n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) is investigating the possibility of moving forward with a new renovation of its historic building in downtown Philadelphia. The renovation, which is expected to take at least a year and cost $15 million, will include the construction of an outdoor courtyard and the reopening of the institution’s original ground-floor windows, which have never been reopened.The building, which was constructed in a former quarry in the city’s historic district in 1952, has been the subject of two major redevelopment efforts in recent years. In 2016, a group led by Philadelphia developer Joe State designed the museum for a $15 million price tag and in 2018, the Pennsylvania Department of Cultural Affairs (PDA) awarded it $6 million. Since its redesign was completed in 2004, PAFA has welcomed more than 1.1 million visitors and has remained open throughout the pandemic. One of the building’s most recent renovations, which opened in 2018, involved the installation of new murals and the restoration of the building’s original glass facade.In an interview with Design Matters in 2019, PAFA director and CEO Jeremy", "The next Biennial should be organized by the National Gallery of Art, which is currently working on a new exhibition about the life and work of Pablo Picasso. The Museum of Modern Art has announced that it will hold a special exhibition at the museum in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Elizabeth Alexander as its new executive director. Alexander comes to the institution from the Metropolitan Museum of Art, where she has served as interim director since April 2019. She succeeds Gerhard Richter, who was appointed director of the Fondazione Prada in Milan on May 28, 2019, and who has helmed the museum since 2012.“Elizabeth Alexander will greatly enhance our mission to present the work of contemporary art and be a partner in the institutional renewal of our collection, curatorial programs and programming, and our community,” said museum director Daniel H. Weiss. “With her background in curatorial and museum leadership, she will continue to expand MoMA’s collection, provide ongoing support to our staff and our artists, and build upon our relationship with our global community. We look forward to welcoming her to MoMA and to working with her.”During her tenure as interim director, Alexander helped", "The next Biennial should be held in 2021.\n\nAt a press conference in Beijing on Tuesday, the project coordinator for the new exhibition, Zhang Xiaoming, said that the project was already in development for more than a decade and was already preparing for the event as it was taking place. Zhang said that the theme of the new exhibition was chosen based on the work of thirty-three artists and how it relates to the contemporary issue of art.The Hong Kong Biennial, which comes to Hong Kong in 2020, will be held at the Luxor Art Museum, Abu Dhabi, the National Galleries of Art, Beijing, and the Hong Kong Museum of Art, Hong Kong. Organizers said that the exhibition will feature between twenty-five and thirty works by artists from twenty countries and territories. The Hong Kong Museum of Art will host the event in 2022.\n\n\nThe Andrew W. Mellon Foundation has appointed Roberta Smith as its first honorary chancellor. Smith will be the foundation’s first president to take up the role of chancellor since the foundation was founded by Andrew W. Mellon. She succeeds John E. Mellon, who died last September at the age of seventy-eight.“In her new role, she will continue to shape the foundation’", "The next Biennial should be held in 2020.\n\n\nAccording to an announcement made by the Kiasma Foundation, the Methuselah Museum in New York City, the Metropolitan Museum of Art, and the Whitney Museum of American Art in New York City, construction is currently underway on the upcoming edition of the biennial, titled “The Foursome,” which will take place in the city’s Central Park from April 23 to April 26, 2021. “The Foursome’s art is modern, contemporary, and sharply defined,” said Kiasma Foundation president and CEO Rob Lebow. “The fuschia-based sculpture process allows us to present works that are often seemingly impossible to achieve, yet are nonetheless managed to be.”The fuschia-based sculpture process allows us to present works that are often seemingly impossible to achieve, yet are nonetheless managed to be.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Aline Bech as its next chief curator. Bech joins MoCA from the Museum of Contemporary Photography (MoCA) in New York, where she has served as an assistant curator since 2007. Previously, she worked as", "The next Biennial should be held in 2020.The project was inspired by a painting by artist Naguib Mahfouz, whose work explores the relationship between visual art and a social fabric that is open to all. In that work, a young African American woman wearing a white dress and white heels stands in front of a mirror in an African American art museum.Within a few years of the painting, Biennial organizers, along with the Metropolitan Museum of Art, the Museum of Modern Art, and the Whitney Museum of American Art, were founded; the first Biennial, held at the Museum of Modern Art in New York, was held in 2001. The next iteration, held last year at the Fair of the Americas in Panama City, was attended by more than one hundred countries and was presented by the Hirshhorn Museum in Washington, DC.\n\n\nThe Kûretel Institute for Contemporary Art has released the list of thirty-six artists and collectives who will participate in the forthcoming twenty-fifth edition of the Kûretel Prize, which will be held at the Kûretel Art Museum in Zurich from February 21 to February 26. The seventy-fifth edition of the Kûretel Prize, which will be held at the Kû", "The next Biennial should take place in the fall of 2021. The event will focus on the intersections of artistic practices and social and political movements in the twenty-first century.The biennial’s newest partner, the National Foundation for Art and Design, announced that it will cochair the exhibition with the artist-run platform Createspace. The organization will organize a number of projects with artists and their sites through the exhibition, including a series of public tours of its contemporary art collections across the US.The biennial will be held in two phases. In the first phase, which will run from October 3 to October 7, the exhibition will feature new work by 120 artists. In the second, which will take place from October 8 to October 9, the biennial will be a moving-image project, with the artists performing works in the exhibition, which will be organized in a crossover between Biennial and Museum. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Peter Hujar as its next director. Hujar comes to the institution from the Moore Gallery in Santa Monica, which he became the first artist to gain a permanent residency at the institution in 2009, and succeeds John R. Ellement, who passed away in October", "The next Biennial should be held in 2025, and the date will be set by the institution. The next exhibition will be entitled Rebuilding the American Dream: A History of Art and Politics. The next biennial will be held in 2020. The next exhibition will be entitled Architecture and Design: From Mark Shapiro to Herbert Berlin, 1947–1948. The next exhibition will be Like Water for Chocolate: The Art of Chocolate. The next exhibition will be Diane Arbus: Futurism in Art, 1949–1952. The next exhibition will be The Architecture of Light: Architecture and Light in Art. The next exhibition will be Reflections (New York: Decca Arts, 2017) and will be presented in the autumn of 2020. Inaugurating the 2020 Biennial will be Hidden Treasures: American Art in the Age of Mechanical Reproduction (New York: Metropolitan Museum of Art, 2019–20).“The project of the 2020 Biennial is an expansion of the history of art in America, focusing on the idea of the future and the past,” said Laur Mayhew, chair of the board of trustees. “It is", "The next Biennial should welcome visitors in 2021.\n\n\nFormer directors of the Museum of Contemporary Art (MoCA) in New York have been indicted by a grand jury on charges of sexual harassment, after an investigation that began in 2018 and concluded in June.The indictment was filed by the New York attorney general, Eric Adams, who said that Zoë Bond and Moshekwa Haddadi, who oversaw the museum from 2006 to 2008, were guilty of engaging in a pattern of harassment that lasted for more than a year.The allegations, which were first reported by Artnet, stem from an investigation conducted by the attorney general and the New York City district attorney. They allege that the defendants engaged in conduct that amounted to sexual harassment and battery. The statute of limitations for sexual harassment cases in New York state is nine years, and for battery cases is seven years.“This is the second year a grand jury has conducted an investigation into sexual harassment allegations; there was also an investigation into harassment and sexual assault at the Museum of Contemporary Art in Chicago,” state attorney general Eric Adams said. “If true, it would be a troubling development in terms of the number of sexual harassment complaints and the length of time these alleged incidents were ongoing.", "The next Biennial should be held in 2021. The exhibition will be hosted by the Museo de Arte Contemporáneo Brasileiro and curated by Renata Laidra. A summing up of the exhibition will take place in 2021. The next exhibition will be held at the Museo de Arte Contemporáneo Brasileiro in 2021. The opening of the exhibition will be at the end of December 2021. The next exhibition will be held at the Museo de Arte Contemporáneo Brasileiro in 2022. The new location for the exhibition will be adjacent to the venues of the Biennial. The new budget for the event will be $3,800. The new exhibition will be curated by Sebastian Leibovici, curator of contemporary art at the Museo de Arte Contemporáneo Brasileiro and director of the exhibition of contemporary art at the Museo de Arte Contemporáneo Brasileiro. The new exhibition program will be inaugurated by a presentation of work by the Russian artist Nadezhda Tolokonnikova.  The newly created program", "The next Biennial should be held in November 2022. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Roberta Smith as its next founding curator. Smith will be responsible for coordinating the curatorial activities of the museum, which has been closed since March 13 due to Covid-19, and will take up the post on August 1.“With more than thirty years of experience, Smith has organized and curated exhibitions that engage with and address the museum’s collection for the benefit of both the public and the collection,” said Museum director and CEO Kennedy G. Williams. “In addition to developing impressive exhibition programs, she has demonstrated an ability to collaborate across disciplines, collaborating with artists and curators alike. She has long established a reputation as an able and talented curator, and we look forward to her continued leadership and continued success.”Smith’s first exhibition at MoCA was “City of Ruins,” in 1979, which explored the concept of “human” and “environment” in a cityscape that was constructed with the help of architects in the city of Rome. Since then, she has participated in numerous exhibitions, including “Cityscape Tokyo”", "The next Biennial should commence with a public exhibition of the work of the artist in the next exhibition ‘Theater of Operations: The Gulf Wars’s Impact on Contemporary Art’s Material Culture,” the theme of the 2019 edition, “Louise Bourgeois: L'art estévelle.”The biennial will be held at the Biennial de Lyon (France) from March 7 to March 9, 2020. The full list of participating artists is as follows: Brahim Boumedouha, Beirut (United Arab Emirates)Bassam Gleik, Kythera (Yemen)Bina Gambil, New York (United States)Bénédicte Galère, Paris (France)Bébéla Gartenfeld, Paris (France)Bèshula Gartenfeld, New York (United States)Bibi Glatter, New York (United States)Bibi Rönnskov, Dallas (United States)Bibi Tawil, New York (United States)Bailey Bonner, New York (United States)B. Gartenfeld, New York (United States)B. Rönnskov, Dallas (United States)B. T", "The next Biennial should be held in 2021, and the first given on the premises of the museum in 2022. The Biennial will be inaugurated by a series of exhibitions that will include works by artists and institutions from the South Asian subcontinent. The entries for the 2019 edition will be curated by Babu Mehta, artist and board member of the Subaltern Art Foundation of India, and Artistic Director of Code:59.“The new museum will be a contemporary cultural space designed by Babu Mehta, with a strong interdisciplinary approach, which has the potential to offer a new kind of biennial experience that will foster a sense of place,” said Mathew Jutto, the managing director of Sifang. Mehta first conceptualized the museum, the former site of the Bechdel Art Museum, in the 1980s and worked with its former architects, Javed Zia and Yusuf Pindell, to achieve its contemporary architectural vision.\n\n\nArt historian and curator Peter Schöffer, a pioneer of modern art who coordinated the discerning eye of many a contemporary artist, died on October 5 at the age of eighty-three. He was found dead in his home in the art-world enclave", "The next Biennial should be held in the spring of 2020. \n\n\nThe National Galleries of Scotland (NGM) announced that it is planning to close its gates to the public on March 31, 2020. The once-in-a-decade event, which comprises a series of exhibitions spanning from May to December, will also cease operations at the institution. “The future of the National Galleries of Scotland rests with the Scottish government, and I strongly believe that this decision will not only benefit the National Galleries of Scotland, but also Scotland and Scotland’s economy and visitors,” said George Curran, director of NGM, and the National Arts Council. Curran noted that the closure of the institution will not affect visitors to the National Gallery of Victoria, which has a capacity of approximately one million visitors annually. After the closure of the National Gallery of Scotland, the NGM will continue to operate normally and will be the home of the Fine Arts Museum and National Maritime Museum, which will continue to host events and has a permanent collection of art from across the world, including from the United States and Europe. Cultural Affairs Secretary Annabelle Gascoyne said: “This is a very difficult decision for", "The next Biennial should be held in 2019. The 2019 edition is scheduled to be held at the ExCel Center in the city of Barcelona, Spain. It will be curated by architect Jutta Zuffermann. The theme of this year’s museum edition is “information, neutrality and, in particular, the control and communication of information.” The show will focus on the use of multimedia, augmented and virtual reality, and will also feature a number of works by contemporary and classic artists. The fifty-sixth edition of the Barcelona Biennial, titled “Tours de Barcelona” (Tours de Barcelona), will be held in the city of Cadiz from September 24 to October 2, 2020. It will be hosted by the Catalan city of Barcelona and will be organized as follows: Artistic Director: Fernando Ivan Rovira Biennial Director: Eileen McClain & Laura Muir Artists: Carlos López Rivera, Luis Aparicio, Emilio de Almeida, Josef Knebel, Luis Pérez-Otollón, Lutz Pfeifer, & Furrilo Roca Artistic Director: Bén", "The next Biennial should take place in 2021, at a date yet to be announced. The 2019 edition, for which the institute was forced to cancel more than two hundred events because of the Covid-19 pandemic, was canceled in March.\n\n\nThe National Endowment for the Arts (NEA) is launching a new initiative to support small, local, and rural arts and cultural producers through the costs of the coronavirus pandemic. The program, called the Digital Divide, will offer grant funding and other assistance to more than sixty artists through a combination of direct cash and creative services.“This is a crisis without precedent in our country’s history, and one that has left the nation reeling,” said NEA director Kimerly Rorschach. “I commend the agencies, institutions, and businesses across the country who are working together to ensure that our arts and cultural workers remain protected during this critical time. We hope that the Digital Divide will be a model of local, regional, and national collaboration that will encourage employers and businesses to consider the needs of their communities during the Covid-19 crisis.”The initiative will test the concept of the Digital Divide through the direct services of thirteen artists, who were selected", "The next Biennial should take place in the spring of 2020. The second will be in the summer of 2021. The third will be held in the spring of 2022.The ten-thousandth marked the centenary of the creation of the J. Paul Getty Trust, which has supported the creation of more than 1,500 artworks and provides financial and other support for the museum’s collection and research. The museum’s collection and archives are on loan to the trust and will be moved to its home in Los Angeles.The museum also announced that it has received a gift from a J. Paul Getty trustee, a medieval bedding-bag that was given to the institution by the late J. Paul Getty’s widow, Maureen. The gift, which was made in a Lincoln bed-and-breakfast in Greenwich, Connecticut, was a horn-shaped chalice that measures approximately one-eighth-inch in height and weighs approximately one-fourth-pound. It is an instrument of the fifteenth-century Benedictine monastery of Cappadocia and was found in the possession of the Getty Trust in 2014. The collection was moved to the Getty’s New York location in 2015 and is currently housed at the", "The next Biennial should take place in Los Angeles in 2022.\n\n\nThe Museum of Contemporary Art (MCA) in Chicago is recalling six works by artist William Eggleston due to concerns over the presence of a chemical used to make a mold that could be harmful to children. Eggleston died in 2005 of exposure to the mold Penicillium sinensis, which was contracted by people and is spread by close contact with the mold. The museum said it cannot confirm whether the works are still on display.“The health and safety of our visitors and staff is of paramount importance, and we have taken the precaution of removing Eggleston’s works from display,” MCA director Christopher Bedford said in a statement. “While we cannot exclude the possibility that other works may be infected, we do not believe that there are any other susceptible works in the collection. As a precaution, we have temporarily closed the exhibition ‘The Memento’s House: The Death and Life of William Eggleston’s Penicillium Sinensis,’ which was on view until the museum reopening on June 10.”The museum said the decision to temporarily close the show was made on June 8, the", "The next Biennial should be held in 2020. The exhibition will include works by twenty-five artists and will be organized in the theme 'Around the World in Twenty Days.”The biennial, which will be held at the BBC, will be the long-awaited follow-up to the 2015 event, “Around the World in Sixteen Days.” The exhibition will also include the first retrospective by a single artist of the late artist’s body of work, and will include new works by the late Dutch director Galerie Marc-Francois Hof, the first to have created a work of modernist-infused European architecture. The show will take place in the building currently occupied by the Zoopropekademie, the contemporary arts center in the Netherlands founded by the late architect Jan Geleijnse (1936–2011), and will run from April 27 to May 4, 2020.The decision to postpone the exhibition was made on the basis of the “strength and resilience of the artistic body and the significant impact the exhibition had on the understanding and appreciation of modernism.” The biennial will now be held as planned in 2021.\n\n\nUnited Kingdom artist-in-residence Holly Hendry,", "The next Biennial should be a major milestone for the museum, which has been undergoing a $3 million facelift. The museum’s building and grounds will be reworked to increase the exhibition’s accessibility and bring it closer to the Parisian cityscape. The exhibition will also ramp up its location in the city, which is now home to one of the largest collections of ancient Greek and Roman art in the world. The restoration project will also include a major new education campaign, which will be led by a collection of more than 300 ancient works that includes lessons on the history of art in the city.The new exhibition “The Multi-colored Light of Art” will open on May 6, 2020. Its first section, “Etienne Lévy Histoires,” will present the curatorial team’s fifth exhibition on the theme “Conceptual and Qualitative Art: Modernism and the Struggle” and will culminate with a performance by the new company, the Filmmakers’ Studio, founded by the collective Bénédicte de Montlaur.The next exhibition will focus on “Christian Dior: The Platonic Male,” which will inaugurate an", "The next Biennial should include the next edition of the '80s-set exhibition “The Bodies: A History,” which will highlight the contributions of three of the last four writers to the archaeological field: Andreas Althaus, Riccardo Cenci, and Elinor O. Peoples. The 2013 event, “Making New York History: Art in the Twenty-first Century,” added a new selection of works by Elvira Cortés, Martin Scheit, and Angela Pape.\n\n\nThe Smithwick Gallery, the private conservatory of contemporary art in London, announced today that it is planning to suspend operations at its premises until the end of the year. The move is in response to the Covid-19 pandemic, which has forced the closure of several other galleries in the capital. The institution announced on Wednesday that it was lowering its opening reception for the first time in its sixty-year history, which will now take place at the Deansgate site in Stratford-on-Avon, in February 2021.The Smithwick Gallery was founded in 1989 by Evelyn and Peter Smith, who had previously headed the London-based firm Simon Smith, ", "The next Biennial should take place in 2021, the biennial’s final year. The 2019 event, “MUSEums and Contemporary Art,” was held at the Musée d’Art Contemporain in Paris, and its first event, “The Drawings of Anne-Marie Curie,” was held at the Louvre. The 2019 edition of the show will be held at the Museo de Arte Contemporáneo, in Madrid, Spain; the next year’s edition will be held at the Museo del Palacio di Roma, in the city of Piedras, in the province of the same name, in Rome; and the 2020 edition will be staged at the Museo di Roeschi, in the city of Cagli, in the province of Piedras. Judging by the number of participants in the event, the 2020 edition will draw twenty-eight galleries. The 2020 edition will address topics such as the evolution of art and the art of the digital age, the future of art in society, and the exhibition of works by major international artists. It will also include a two-day reception with the artist collective Autonomedia", "The next Biennial should be held in 2020. Oskar Eustis, art critic for Artforum, said: “It’s a long-term project, but it’s a project with long-term goals. In the meantime, ArtReel has created a new platform for cutting-edge work by established and emerging artists and a new platform for experimentation with new and experimental works.” \n\n\nThe United States Holocaust Memorial Museum in Washington, DC, has announced that Saviour Vasyl Lutsenko, a Ukrainian Jewish artist and educator, was named its recipient of the 2019 William Jewell Award for his work Saving Jews, 1967–1970. The award, which honors an artist who has made a significant contribution to the study of the Holocaust and the preservation of the Holocaust Museum, was established in honor of the late Jewish curator and educator Kasimir Morgenstern, who passed away in January 2019.“When I received the award in 2015, I was proud to have helped establish the award to honor this extraordinary artist, and to have helped him to establish the Museum in his honor. I was also very proud to have created” the award, which honors an artist whose work has had", "The next Biennial should be held in 2022.\n\n\nThe Redbud Art Museum in Everett, Washington, has received a gift of fifty-four paintings by the late artist and activist Al Smith. The works, which were donated by Smith’s widow, Mary, and her daughter, Kati Smith, were acquired by the museum in 2019.“The collection includes works of Smith’s current exhibition ‘Simple Justice,’ which opened at the museum in December 2019. The piece is a tribute to Smith’s work on the runway, where she is remembered. In addition, the museum also has three works by Smith’s contemporary, the late artist and activist Tomás Lawal, who most recently served as the first chair of the Native Arts and Cultures Institute in Olympia, Washington.”The work, which recounts her involvement in the anti-slavery movement, was featured in “Al Smith: An American Collection,” which ran at the museum for two years and a half. In 2018, the artist’s widow gave $60,000 to the museum, which had previously received the same donation as the several hundred works that were in the collection during Smith’s", "The next Biennial should be held in the spring of 2021, and the premiere should be hosted by the University of California, Los Angeles, in the summer of 2022.The kingmakers of the 2020 edition include Michael Kors, Burberry, Chanel, Guess, Gucci, Mango, Montreux Artiste, Paul Smith, Prada, Prada/Levi, Prada/Simone Valli, Gucci/Nairobi, Gucci/NY, Tesco, Saks Fifth Avenue, and Vetements. The artist-led group will determine the theme of the next edition, which will take place at the Los Angeles County Museum of Art (LACMA), in the summer of 2021.Lanier Gallery’s Mark Schellenberg will curate the fifty-ninth edition, which will be held at the Los Angeles County Museum of Art (LACMA), beginning in the spring of 2022. A selection of works by forty-six artists will be presented, including  A.I.R. Gallery’s Alfred Degas, Alexander Calder, Derrick Erickson, Kathleen Knowles, Lillian McClellan, Deana Lawson, ", "The next Biennial should be in December 2020. The announcement of the museum’s new location was made at a special exhibition of art, “The Future Is Present: From Creation to Destruction” that opened at the museum on December 2, 2019. The exhibition was organized by artist R.H. Galdana, who is known for creating works that are centered on the destruction of culture. In October 2020, the museum’s director, Ana Paula de Ceará, said that the institution would be “more than ever a platform for the revitalization of the arts.”\n\n\nThe National Museum of Ireland (Nilo) in Kildare, where an exhibition of works by the late American painter Michael Burrows, titled “Painting in Space” was scheduled to open this weekend, has cancelled the exhibition in an attempt to protect the future of the Burrows’s career. The opening of the exhibition—which will be staged across eighteen different international locations from June 26 to June 29—has been pushed back twice because of the pandemic.“The exhibition has been moved to a later date and an announcement about its reopening is expected next week,” said Nilo director, M", "The next Biennial should take place in 2020. The first was created by the 1995–96 iteration of the National Geographic Society at Washington, DC, which was organized by curator Douglas Wheeler. The 2019 Biennial was curated by the British artist Jo Johnson.\n\n\nThe City of New York has launched an initiative to promote the work of young, African-American artists, including the work of Amara Abdurraqib, Claudia Abraham,  and Gulatu Rula.The seven-month program, titled “Young Black Artists,” will introduce thirty artists to the public through public events, workshops, and other programming. The thirty-eight-year-old artist will receive a cash prize of $50,000.The artists chosen for the program are Angela Davis, Claudia Abraham, Claudia Abraham, Jonathan Brown, DANIEL CAVALIER, Gia Gregory, Lani Claire Blankenship, and Racquel Georgia. The seventy-three-year-old architect Jonathan Griffith, who is also the founder of the Los Angeles–based nonprofit DLP Architects, will design and construct the exhibition.“The City is committed to supporting the", "The next Biennial should open in 2021.“The new board is comprised of Peter L. Lewis (chair), Adam Voorhees (vice chair), and Edwidge D. Roud (vice chairman),” said CEO and president Annemarie Bochereau. “Peter and Edwidge have been instrumental in the relocation of the Biennials from their original locations in New York and San Francisco, and with their leadership and vision, will continue to deliver a unique experience for our visitors. We look forward to working with them and to the Biennials as they continue to shape the future of the Art Gallery of Ontario.”\n\n\nThe Tate in London announced today that Jo Wilkes has been appointed as its next director and chief executive officer. Wilkes will assume his post in January 2021 and will work closely with Tate director Maria Balshaw on a global basis, overseeing the development and execution of its new strategic plans.“The new role will enable Wilkes to strengthen and extend Tate’s existing international reputation as a leading world-renowned institution with an international team, with a strong international network, in an era when the future of the arts is increasingly at the heart of what matters most, the world", "The next Biennial should take place in 2022, and the event’s final iteration will take place in 2023. The 2019 event, which ran from October 5 to October 6, featured some thirty artists, including the Slovenian artist Zarečka Verna, who created works that were exhibited in the exhibition.The finalist, Kathryn C. Allen, the former curator of nineteenth-century American paintings at the Museum of Modern Art in New York, said: “I’m glad to see such ambitious plans finally realized. After a decade of working on this project, I’m confident that we will come out of this event with a new appreciation for the biennial’s rich history and a renewed sense of purpose. I’m eager to see how the Biennial 2020 will unfold. I’m sure we will come back to this theme in a future Biennial.”\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it will suspend its exhibition “Submission: Art—1940s,” which opened on September 7, 2019 and runs through March 23, 2020, and will instead focus on reworking the exhibition format. The exhibition, which was curated by", "The next Biennial should be held in 2021.\n\nThe Riga Biennial, which was held in the town of Riga from March 11 to March 14, 2018, has announced its cancellation of its 2020 edition, which was to take place on March 27–March 31. The postponement was made after the Estonian government decided to take part in a restructuring of the country’s state-owned broadcaster, which had been in talks with the Art Foundation Foundation of the Riga (AFR) since March 3.The decision to cancel the exhibition prompted outcry from many cultural figures and artists, including those who were invited to the exhibition; some accused the government of trying to push the event forward so that it could avoid the 2019 ersatz event, which was canceled due to the coronavirus pandemic.The event’s organizers contended that the move was made in order to ensure a smooth running of the event. “The 2019 edition of the Biennial was characterized by good cooperation between the two institutions, exceptional participation of all the participating artists and a very high number of visitors,” said Sigrid Steenkamp, the chair of AFR and the prime minister of Estonia. “We had no doubt about the future of", "The next Biennial should be held in 2021, and the 2019 winner has been selected to represent the city of St. Louis, Missouri. The 2019 winner will be announced in the coming weeks.\n\n\nThe Israeli government has approved a $1.5 billion plan to repair damage to the Palestinian territories caused by Israeli military operations during Operation Protective Edge, the Israeli assault on Gaza in 2015, the Jerusalem Post reports. The plan—which is one of the largest military aid packages ever given to a country in Israel—is part of a $12 billion package that also includes $6 billion for Palestine, and $5 billion for the West Bank, and will be presented to the Palestinian Authority (PA) in a ceremony in Jerusalem on Monday. The PA will use the funding to make repairs to the territories in order to prevent the reopening of the Rafah border crossing between Gaza and Israel and to prepare for a possible ground invasion of Gaza in the event of a pre-emptive attack by Israel.Israel had already allocated $1.5 billion in aid funds to the Palestinians in 2015, and the PA had already begun spending $1 billion on reconstruction projects in the territories in order to prevent the reopening of the Rafah border crossing with Israel,", "The next Biennial should include a review of the exhibition “The Dream of a Single Box: Marxism and the Making of Modern Art” (2019) and “Akron: The Modern City” (2019). The third will be a collaboration with the Los Angeles County Museum of Art (LACMA) artist and curator Russ Christovale, who drew inspiration from the conflict between the museum and the city of Los Angeles in his work, The City of Los Angeles, 1973–1983.The first stage of the 2020 iteration of the Biennial will take place at the Museum of Contemporary Art (MoCA), Los Angeles, in 2020. The second will be at the Institute of Contemporary Arts (ICA), New York; the third at the Museum of Modern Art (MoMA), New York; and the fourth at the Museum of Modern Art, New York. The fourth will be at the Los Angeles County Museum of Art (LACMA); the fifth will be at the Noguchi Museum, Los Angeles; the sixth at the Los Angeles County Museum of Art; and the seventh will be at the Alamitos-Marinaro Museum of Art, San Diego. The eighth will be at the University of Chicago; the ninth at", "The next Biennial should be held in 2022. It has not yet been determined whether the event will be relocated.\n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) in Philadelphia has received a donation of thirty-three works by artists, including artists such as William Eggleston, Robert Frank, Catherine Murphy, Wolfgang Kalecki, and Wangechi Mutu. Founded in 1855, the academy was redeveloped by the Bechler Family into an arts hub in 2016, and has received more than $400,000 in grants and donations in support of the renovation of the space.The donation, made in recognition of the PAFA’s twenty-second anniversary, represents a significant step in the organization’s ongoing commitment to supporting the PAFA’s artists. The institution also announced that Laura Minton, its executive director, will serve as PAFA’s new board president.“PAFA has been and will remain at the center of local, national, and global cultural exchange, and we are constantly working to enhance our community engagement through the arts,” said Peter Bechler, the Bechler Family’s founder and chairman. “The Pittsburgh Cultural Alliance is", "The next Biennial should take place at the new Museum of Modern Art in Greenwich, Connecticut, in 2021.\n\n\nItalian artist and designer Silvio Fontana, whose work explores the history of light, color, and sound, has died. He was ninety-two years old.Born in Turin in 1936, Fontana studied under the Italian architect Bertolotti, who born nearly two years after Fontana became a self-taught painter. His first major solo exhibition was at the Museum of Modern Art in Rome in 1949. He followed his love of the work of Harald Szeemann with a lifelong interest in light and color.His work has been collected by four of his twenty-three contemporaries: Albert Prada, Gio Ponti, and Gio Ponti, among others. His work is also represented by Giardotto Re Production, Milan, and Prada, among others.Born in 1948 in the southern city of Turin, Fontana studied under architect Vittorio Bicchieri in Turin and at the Catania Institute of Art in Venice. He graduated in 1967 from the University of Venice; in 1974, the same year he started his own studio, Fontana began the light and sound series of his own", "The next Biennial should start on August 18 and conclude on September 23.\n\nIn a statement on Instagram, the museum said: “We are currently working through a change in leadership, and we will have more to say about this in the coming weeks. We will keep you updated as we work through this. We will also continue to present the many wonderful works that have been made with the museum’s collection over the past twenty-five years. We have never been more proud of our collection, and we have never been more committed to continuing to represent the fascinating and important collections that have come to us.”\n\n\nThe Metropolitan Museum of Art in New York has appointed Tyler Turner as its next executive director. Turner succeeds Donna Harrison, who has served as the executive director of the museum since 2014. He succeeds Lynda Barry, who will remain on staff as the museum’s senior curator of modern and contemporary art.“Tyler is a seasoned executive who has built a significant track record of success for the Met,” said Peter Schoelkopf, the museum’s director and CEO. “He is highly competent and accomplished in the field and will be needed to continue to deliver on the Met", "The next Biennial should be held in 2021 and will be organized by Paris-based firm Cinema di Lorraine. The 2019 event, titled Between the Sun and the Moon, was organized by the Czech Republic–based artist Antonin Góra and was co-chaired by actress Emma Stone. The documentary-dramedy My Struggle, 2018, was directed by Simone de Beauvoir and starred Jean-Pierre Jeanty, Laurent Jeanty, Lévy Gorvy, and Guy Vaillant.\n\n\n\n\n\nSinger-songwriter Yangon Vaisman has been awarded the 2020 Henry Luce Award, which comes with a $50,000 prize and an invitation to perform at his hometown concert. The artist was selected from a shortlist of three finalists by a jury comprising Mariane de Bodema, Joe Cammock, and the Los Angeles–based artist and activist Shimon Weiser and was chosen to receive the honor for his installation The Blackline, 2017, which opens with a series of images by the artist that are based on her writings. The piece, which was created in Yangon, Myanmar, and premiered at the Henry Luce Foundation in New York in 2011, is a meditation on", "The next Biennial should take place in the autumn of 2021. Andreas Schäfer, director of the KASD-Copenhagen, Denmark, told the Art Newspaper: “The theme is, in a way, a wishful synthesis of the post-war and postwar period: a wish to create a new unity between art and life, an attempt to reorganise the world in a way that will reach back into history. That would be a positive step in the same direction as Eismann-Dieterich’s The Beginning of the End (1952), or Leomister-Dieterich’s The Path of the Shadow (1953), both of which were post-moderns in their own right.”The institution will also be hosting a retrospective of the artist’s work in the spring of 2021, at the KASD. The first show, which will open in the spring of 2021, will feature works by forty-six artists from fifty-seven countries. The exhibition will run for twelve weeks, from August 16 to September 6.The KASD’s new director, Margot Wallström, said: “A theory is a", "The next Biennial should be held in December, 2019. \n\n\nThe Museum of Modern Art (MoMA) in New York is moving two major exhibitions from its Los Angeles construction site to the Museum of Contemporary Art (MoCA), a decade away. The museum has been working on the move since it opened in 2000 and recently laid off or closed half of its buildings in a move that critics have called massaging the art of contemporary art. The institution also said that it will incur more than $500 million in lost revenue as a result of the construction of the new building.The move follows the upcoming reopening of MoMA in the summer of 2021, in time for the festival to rejoin the arts in the fall of 2021. Inaugurating the museum is the opening of a new exhibition of work by artists such as Ralph Ellison and Frank Stella. The second exhibition, “The First Year,” will be open October 20–October 22 and will feature works by twenty-six artists. The first exhibition, “The Imagination of Ron Chernow,” will open in the fall of 2022 and will feature works by fifty-three artists in the exhibition “The Visualization of Art and Art and Architecture.”\n\n", "The next Biennial should be an international collaboration between artists and cultural professionals in the decades to come. A forum for dialogue and experimentation, where the public can share their opinions and experiences.”The question of how to best organize a biennial remains unresolved, however. In 2011, the organizers of the Doha Art Biennale, the International Committee for the Preservation of the Doha Art Biennial, and the Doha Art Festival, announced their plans to create a platform, which would oversee the exhibition and exhibition program, in the city of Doha. The concept was to check the boundaries between art and politics and to produce a show dedicated to “Shirley-Anne” (the artist) and “Kangsi” (the street of the Sarajevo Cathedral). The event was meant to celebrate the artist’s sixty-fifth birthday and to draw attention to the contemporary issues of women’s empowerment and the protection of human rights. The biennial was supposed to be held in 2022.When the project was announced in July 2016, the inaugural exhibition was to feature photographs by the Egyptian artist Ahmed al-Tayeb and the Lebanese artist Salah El-Khoury. The work of both Tayeb and", "The next Biennial should be titled 'Radical Women: Women in the Developing Process.” The exhibition will be a joint project of the BIR, the BIP, and the BIP.“Radical Women is a collection of groundbreaking work by ten of the twentieth century’s most exceptional female artists, and is being organized as a new kind of biennial in which the full range of participation by artists, curators, and audiences is possible,” said museum director Helen Prince. The inaugural exhibition will consist of thirty-eight works by twenty-five artists, including Bernardo Bertolotti, Ellsworth Kelly, Anna Laudel, and Edith Heath. The next exhibition, “Radical Women II: The Modern Female,” will open in Brooklyn on September 21 and run through October 6.Commenting on her appointment, Dr. Maestro Rachel B. Davis said: “The Biennial has been a huge success since it first staged this collection of work by twenty-five artists in 1989. The work was selected by a committee consisting of five artists and three curators, and it has always been my vision to create a space where women could build on the work of the greats, and", "The next Biennial should be held in 2020, but no date has yet been set. \n\n\nThe museum’s collection, which comprises more than 2,400 objects from the Iranian Islamic Revolution, including religious objects, artifacts of the Islamic Republic, and artifacts of the Islamic Revolution’s first decade\u0097more than 600 objects dating from the 1950s to the late 1980s\u0097was less than a third of the estimated $3 billion in sales recorded last year.According to the New York Times, the exhibition “spent almost three years on a single floor, in a single storage area, and featured only two works\u0097a painting of the Tehran Museum of Art, in a different building, and a sculpture by the artist Manal Al-Khazraji, all of which were on display.”The German artist Ludwig Preminger, who was named a founding member of the \"Isamu Noguchi\" group in 1948, will receive the international award in Oslo on October 20. The prize comes at a time when the Iranian authorities are attempting to curb the spread of Western cultural influence in the country, and the country’s cultural sector is facing increased pressure to balance the regime’s demands for", "The next Biennial should take place in 2022, and the exhibition should open to the public in Frankfurt. \n\n\nThe Japanese architect and collector Miwa Kobayashi has won the 2019 Japan-United States Arts and Culture Biennial. The Tokyo-based firm, which is based in Tokyo, won the prize for its work, August 11, for which it incorporated three new works by American artists, including Ed Moses, David Kline, and Bart Leibowitz. The Japanese pavilion was curated by architect and curator Satoru Yamaguchi, who was nominated for the prize for his practice, which includes projects with artists such as David Winton and Bruce Lee.The jury that selected Kobayashi also selected Charles Andrews, Jonathan Greenfield, and John Balboni for the prize, which is given annually to a Japanese artist. Kobayashi will be presented with the award at a ceremony at the Tokyo Art Museum on November 20.\n\n\nThe Taichung Art Museum in China, citing the museum’s potential to expand its exhibitions and programs into a “multi-dimensional art space,” has received a $6.2 million grant from the National Geographic Society to enhance its holdings of early American works by a group of", "The next Biennial should be held in 2021, and the first exhibition will be in 2023. The biennial will also include a new platform for research on the art of human rights, as well as a new exhibition, Art of Human Rights: A Historical and Conceptual Study, which will be led by Gerhard Schlegel, a curator at the University of Bonn in Germany, and will take up contemporary issues.\n\n\nThe City of New York has announced that it expects to raise $100 million in a city-backed $1 trillion plan to replace the aging infrastructure of its iconic ten-story-high Central Park, which was built to house one of the largest and most powerful artificial intelligence (AI) systems ever built. The artificial intelligence (AI) system, called Meta, is currently helping the New York Police Department (NYPD) develop new strategies for de-escalation and crowd control, and is also working to understand the specific needs, preferences, and fears of New Yorkers, including the demographics of the city. The move to replace the park, which is presently home to more than 3,250,000 people, comes amid a growing movement to replace aging infrastructure with more accessible and sustainable urban spaces—a trend supported by artists, activists", "The next Biennial should be held in 2021, and a second in 2022. However, both plans have been put in jeopardy by the coronavirus and the ongoing health crisis in the Middle East. In a letter submitted by the organizers of Biennale d Arles, Jean-Luc Berrada, and Herve Contreras last month to the French minister of culture, Emmanuel Macron, the board of trustees said that they were open to discussing the possibility of reopening the exhibition as long as the health of the French people and the country's institutions are protected.The trustees added that they expect the French government and the Chamber of Deputies to decertify the changes that were made in order to comply with the Paris Climate Accord, which aims to limit the spread of the virus, and that the Museum of Modern Art in Paris will remain open throughout the pandemic.\n\n\n\n\n\nThe Somerset Museum in Manchester has appointed Natalie Carter-McGovern as its new acting director. She will be responsible for the conservation, conservation education, and research and exhibitions of the museum, which is being restructured by Gell-Mann Architects and the city of Manchester in order to reduce the environmental impact of the institution, through May 2020.", "The next Biennial should be held in Munich sometime between July and November 2021, and will run October 8–October 10, 2021. The theme of the second biennial is “Change,” with a special focus on the sustainability of art and culture, and the third biennial will focus on “The Art of Life.”The biennial will feature the art of life and art from the artist’s archive, including works by the Swiss artist Albert Seroussi and the German sculptor Walter Gropius. The first exhibition, “In the Realm of Life,” will be held at the Museo de Arte Contemporáneo Barcelona between October 3, 2019 and October 5, 2020. The second exhibition “Sustainability of Life” will be held at the Museo de Arte Contemporáneo in Madrid between October 7, 2020 and October 16, 2021.The third exhibition will be dedicated to the art of the body, International Women’s Day, and will take place at the Museum of Contemporary Art St. Louis in August 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has issued an unprecedented apology to a group of artists who", "The next Biennial should be held at the University of Applied Arts, Kuala Lumpur. Confirmation will be given in April.  The first exhibition of the new series is titled The Future Is Present: From Latex to Art. The exhibition will be organized as follows: The Future Is Present: From Latex to Art, Saturday, April 16, 2019, at the Museum of Modern Art in New York.Esther Schipper, curator of the New York–based nonprofit Gallery Now, is the organizing director for this year’s Biennial. “This is an incredible year to be a curator,” Schipper said. “We are embarking on a new chapter with the inaugural event, which will be held at the Museum of Modern Art in New York, in 2020. We are thrilled that the public will be able to experience the art of the future as it unfolds in the art world’s laboratories.”The Biennial will be inaugurated by a series of exhibitions, including “The Death of a Model,” curated by David Adjay, at the Museum of Modern Art in New York, and a special exhibition of Portraits by Ella Craig at the Museum of Modern Art", "The next Biennial should be held at a suitable location outside of London, in order to ensure the safety and security of visitors to the exhibition. This year’s event, which was held at the New Museum in New York from September 21 to September 24, will continue to be held at London’s National Portrait Gallery until October 28.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to construct a $150 million renovation and expansion of the institution’s current exhibition space at 1480 Fifth Avenue, the former site of the former New York Stock Exchange, in the city’s Mission District. For the next two years, the institution will stage over fifty exhibitions, including twenty-five shows by artists who have received the National Medal of Arts in the last two years, and will host a variety of other events.The plans for the new exhibition space came as part of a larger capital campaign to modernize and expand the Museum of Modern Art, which is currently undergoing a $160 million expansion. The project, titled “Beyond the Frame,” and is part of MoMA’s ongoing capital campaign for the 2020 fiscal year. The capital campaign for the next two years will be led by architect and", "The next Biennial should take place in 2020. \n\n\nNearly 300 artists from thirty-four nations have been invited to participate in the Hong Kong International Festival of Visual Arts (HKFIA), which will run from September 2 to September 7. Organizers are counting on the event’s attendance to help them meet the ambitious 2020 deadline for their ambitious $3.2 billion budget.Gifted by China’s state-backed National Foundation for Contemporary Art (NFCA), the Hong Kong International Festival of Visual Arts (HKFIA) is designed to be an extension of the National Museum of Fine Arts in Beijing. Built in the same year as the National Museum of Fine Arts (MMFA), the venue will host seventy-one exhibitions.“We are really hopeful that this year’s edition will be a success,” Hu Jie, the director of the Hong Kong Museum of Art, told Artnet. “In the past, it has been difficult for the museum to organize exhibitions and other programming in the city, and we were not able to carry out any kind of a major overhaul of our collection. This year we are really eager to launch a series of exhibitions that will draw international audiences, and we hope the international", "The next Biennial should take place in the spring of 2020 to coincide with the quarterfinals of the twenty-sixth Venice Biennale, and will present an original selection of work. The exhibition will be accompanied by a series of public programs, including the installation of the new exhibition “Autobiographies: ‘Ursula Curra and Joan Crawford’s” (June 15–June 22), the launch of the “Art and Design” project (June 23–June 28), and the opening of the “Art in Theory” exhibition (June 26–June 28).The first exhibition organized by the new biennial will be “DIAMONDS: A CONCEPTUAL DIVISION” (August 6–August 11), which will be hosted by the Minneapolis Institute of Art (MIA). The exhibition will explore the historical origins of the concept of a dichotomy between matter and form, and will feature new works by seventy-four artists, including Jason Head, Gioncarlo Busutt, Andrew Heine, Leslie Stierli, Ravi Nelson, and Linda Stierli.The biennial will also bring together a group of artists known for their work in Jesus Christ,", "The next Biennial should focus on how the modern‐day biennial is being built on the sweat of our artists. We want to understand the techniques of how the body works, and how we can work more specifically with the body in the future.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for museums that are currently under construction or planning to begin construction. The 2020 edition of the Designer District, which will celebrate the twentieth anniversary of the institution\u0097a collection of more than sixty thousand works\u0097will be held at the newly renovated Javits Center in New York from March 19 to March 21. “We are pleased to announce that the Javits Center will host the 2020 Design District,” said David L. Cohen, the director of the DCLA. “The design of the Javits Center is a significant milestone for the museum, and we anticipate celebrating the centennial with a strong collection of contemporary art. The exhibition will showcase the exhibition’s work in a way that every contemporary art collector should experience.”The 2020 edition of the Designer District will be held at the Javits Center from March 19 to March 21. The exhibit will focus on how design has transformed the lives of", "The next Biennial should be held in Milan in the spring of 2021. I can tell you that when we decided to invite Ella, we had no idea that the show would turn out to be one of the most important exhibitions of our lifetime. We have had a long-term partnership with her for many years now. It is a true honor to present her work to the world at such an exciting moment in its history. We wish her and all the artists well together.  Well done! \n\n\nThe City of New York has released the list of fifty-six artists who will participate in the Fifty-Fiftieth edition of the Venice Biennale, which will take place in May. Titled “Sitting and Walking,” the fair will focus on the history of art and architecture as well as race, gender and sexuality, and will run alongside the 2015 event, which will mark its centenary.The artists for the fair include Arcade Fire, the Black Angels, Jonas Mekas, Pindar Sivarajah, Paul Oehler, and Adam Pendleton. The exhibition will highlight work by twenty-five artists, including Maren Ade, Anna Atkins, Yinka Shonibare, G", "The next Biennial should be the biggest and perhaps the most anticipated, with new works by major international artists; it should also bring together the world’s leading collectors and institutions and present world-class exhibitions. It will include new installations by hundreds of international artists, including Damien Hirst, Kenzo Tange, Nada Gormley, and Richard Tuttle, and will take place in the director’s residence in London. The full list of participating artists is as follows:• Benoit Mandelbrot (Lyon, France)• Frank Meehlstein (Hoffley, Germany)• Irena Haiduk (New York, USA)• Michael Lange (New York, USA)• John Halstead (New York, USA)• The Danziger Gallery (New York, USA)• Amedeo Sarto (New York; USA)• Edvard Munch (New York, USA)• Martin Stevens (New York, USA)• Muriel Von Stammtisch (Brussels, Belgium)• Michael Arndt (New York, USA)• Robert Irwin (New York, USA)• Robert Irwin Gallery (New York, USA)• Frances Ghebaly (", "The next Biennial should focus on the history of the museum’s three distinct spaces—the north wing, the west wing, and the lobby. The museum will also unveil a new mix of exhibitions and performances, including a “celebration of the fifteenth of May and ‘the end of summer’ as well as “A-G: A-G,” a six-hour exhibition that will take the form of a “vacuuming machine,” and will organize “In the Name of the Fatherland.”Inaugurating the Biennial will be “The Civilization of Art: From the Art of Leonardo da Vinci to the Modern Era” and a special exhibition dedicated to the brand new series of Japanese ceramics, “A-G,” which will be on view until the end of the year and will be curated by Masao Nakaya. The rebuilt Museum will also introduce new exhibitions and special programs, including an ambitious new platform dedicated to Contemporary Art, and will employ new technology to advance archival research and archival research initiatives. The new Museum will be inaugurated by “Welcome to the Museum.” �", "The next Biennial should be in 2022, the press release said, and the ten-year anniversary of the university’s founding in 2021.The exhibition will feature exhibitions on contemporary art, contemporary design, and sustainability. Its inaugural exhibition, “Forks and Fishes: Projects of the Linn Museum” (2019), featured more than 150 works by twenty-three artists, including Paul Gauguin, Carolee Schneemann, and Iñigo Magi. The show’s twenty-second edition, “Forks and Fishes: A Contemporary History of the Linn Museum,” will open on October 20 and run until January 21, 2020.\n\n\nThe Grand Opera House in London announced today that it has created twenty-nine new jobs in the arts, and will offer further career advice and support to the thousands of people who currently work at the institution. The appointment of the Grand Opera House’s creative director, the Grand Prix, and the Grand Tin Gallery, as well as Melissa Mullen, the Director of the Kinetic, as honorary curators of the twenty-second Biennial was made on behalf of director Hamish Anderson and the board of trustees. “", "The next Biennial should be held in 2020. The event will take place at the Mana Contemporary Arts Center in Copenhagen, the Kunsthalle Basel, and the Kunsthalle Stuttgart. The biennial will feature works by forty-one artists, representing twenty-six countries. The biennial will also mark the first time the museum will honor a living artist. The museum, which was founded in 1932, was chosen as the site for the seventh iteration of its Museum of Modern Art (MoMA) exhibition, “Future Nation: The Art of Solipsism,” by the Belgian artist Joost Petzold. The exhibition will be followed by “Away,” a survey of contemporary art from North America, and “Paintings of Jean-Luc Louis,” an exhibition of forty canvases taken by the French artist Marcel Prouvé. The fourth biennial, “Painting with a Little Help from My Friends: Three Essays by Jean-Luc Louis,” was staged at the Monopol Gallery in Paris in 2012. It is also currently on view at the Museum of Contemporary Art in the City of St. Louis.\n\n", "The next Biennial should commence in the spring of 2021. However, since the exhibition has been suspended since March 2019 due to the Covid-19 epidemic, the new format will be dedicated to exploring the contributions of the artist-centred biennial to the development of the Czech Republic and will not include the traditional biennial.The Biennials between the Czech Republic, Slovakia, and Slovakia in 2019 and the Czech Republic in 2020, respectively, received a mixed reception. The Czech Republic, which was not expecting such a large-scale exhibition, saw such a strong turnout that it declared a state of emergency. In Slovakia, the exhibition struggled to gain recognition because it was only shown in the capital city of Trg, and only a small percentage of visitors to the exhibition actually went to the biennial.In an interview with the Art Newspaper, Arts Minister Ivan Deletjak said that the exhibition “wasn’t designed to be a platform for a large-scale political campaign.” He added that the exhibition made a “tremendous contribution to our understanding of the world.”The exhibition, titled “Environmental Crisis: Art and the Crisis of Nature” and hosted by the Czech Academy of Sciences, was founded by", "The next Biennial should take place in Hong Kong in the summer of 2021, with a new exhibition of works by artists in Hong Kong, and will be held at the Hong Kong museum of modern art. The 2019 biennial, titled 'From Orbital to Subsurface: Artist-Operations in Space” and curated by ecologist, philosopher, and essayist Wu Hong, was awarded a special exhibition at the Hong Kong Biennale in 2013. The exhibition, an exhibition of thirteen works by twenty thousand artists, was selected from a shortlist of five nominees that included Renzo Piano, Koki Sakai, and Jacky Wu.The 2019 prize was presented at a ceremony at the Hong Kong Museum of Modern Art on October 4, 2019 and was presented by the Hong Kong Science, Technology, and Society (KST) in collaboration with the Hong Kong Kunst, the Hong Kong Museum of Art, and the Hong Kong Philharmonic.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has announced that it is planning to shutter its current exhibition, “Museum of Arts and Design,” in order to “re-energize the Met’s collection and circulation of modern art in America.”", "The next Biennial should take place in 2020. The fate of the festival is in the hands of the National Gallery of Art in Washington, DC, and the Metropolitan Museum of Art in New York.\n\n\nThe Chinese artist Wang Wei-li, one of the pioneers of Abstract Expressionism and a major influence on both Abstract Expressionism and Modernism, has died at age eighty-two.Born in Shanghai in 1922, Wang has been called the father of Abstract Expressionism, the predecessor of Expressionism’s art, and the founder of the New York–based studio that would become known as the Shanghai Group. He was born in the Chinese province of Zheijiang in 1932, the son of a wealthy merchant. His father was a celebrated artist who was known for his works including his famous bronze sculpture of the Flying Contessa, a gold statue of a flying woman that was made in 1932.At the age of seven, Wang moved to the city of Quanzhou, where he enrolled in the province’s State University of Painting. Due to his impressive talent, Wang was chosen to paint the pavilion for the 40th Venice Biennale in 1935. Not long after, he began training with the company of the painter Wang Zhenq", "The next Biennial should be held in 2021. The museum was founded by Alfred and Edwidge Danticor in New York in 1905.\n\n\nThe Metropolitan Museum of Art in New York has purchased fifty-seven works by twenty-seven artists, including Patricia Arquette, Paul Gauguin, John Constable, Paul Joseph Césaire, Ed Atkins, Virginia Johnson, and Edvard Munch. The purchase spree, which also includes works by the American painter and sculptor William Atkins, kicked off last year, when the museum received fifty-one works. The museum plans to gift the works to the Los Angeles County Museum of Art (LACMA), where they will remain on display until the end of the month. The works were purchased through the Metropolitan Museum of Art’s 2017–19 season.The works are divided into five categories: contemporary art, contemporary design, contemporary landscape, and modern art. Each category has two works in it, with the first category comprising works that deal with the physical environment\u0097for example, the first work by the artist Martha Graham. The second category comprises works that deal with subjects that are far off the stage, such as the third work by the French surrealist Jean-Luc Godard.\n\n\n", "The next Biennial should focus on the creative process of the artist as well as the artworks as well as how to engage different cultural traditions. “In the last couple of years we have been working hard to develop a new style of exhibitions, which will also reflect the contemporary artistic landscape,” said Marcelle Hippeler-Kras, the head of the Frankfurt gallery. “The new exhibition format will have a direct connection to the contemporary art movement and will allow the artists to make an open-ended and dynamic work, but also strive for a greater understanding of the historical and artistic dimension of the collection.”The new exhibition will be organized according to an iterative process that will show how the exhibition can be reinterpreted and rebounded simultaneously in different settings. The next show will be the artist’s first exhibition in the new format since February 2019.\n\n\nThe Museum of Southern Art in New Orleans (MSA) has appointed Laura Bloom as its next executive director. Bloom comes to the institution from the Museum of Modern Art (MoMA) in New York, where she currently serves as director of curatorial affairs. She succeeds Ruth Lederer, who departed the institution on May 16 to become director of the Juven", "The next Biennial should take place at least eight years from now, and the 2020 event will take place in twenty-six years. According to a statement issued by the museum, the biennial will aim to “explore the interrelationships between contemporary art and modernity.” The statement went on to say that the theme of the twenty-fourth edition is “the new form, the new life, the new possibilities, the new struggles,” but the word “new” is a big departure from the concept of the exhibition.It will also be the first time the museum has staged a major retrospective of a work by an African artist since the sad passing of Louis Vuitton and will be the first time that the institution’s current collection is exhibited. It will be the first time that African art is presented in an American institution since the MCA’s inaugural exhibition in 1994. The biennial will take place at the museum’s current site, the Olympic Park, in the city of Bishkekara in Nigeria’s northern state of Ogun, and will run for twelve weeks. The exhibition will present twenty-eight works by twenty-two artists and will take place in the summer", "The next Biennial should be held in the spring of 2021. In a statement, the museum said: “The museum does not yet have a plan for when the event will resume. However, as we continue to receive and assess visitors, we will consider all possible options and will prepare for the possibility of reopening. We hope that everyone will enjoy the new exhibition as much as we have enjoyed working, the artworks, and making the 2016 event so successful.”In April of 2021, the museum will host the first edition of the Los Angeles Biennial, the first of the city’s major annual events. The event will also unveil new programs, including the Los Angeles Biennial Theater (LABI Theater), which will stage four performances each night, and the Los Angeles Art Museum (LALAM), a major expansion of the museum, which is scheduled to open in 2021. “LABI Theater’s inaugural program will premiere an entirely new collection of art by artist-in-residence Terrasimo and will feature pieces by fifty-one contemporary and early modern artists, including Ralph Adams, Nada Bech, Cézanne, Ad Reinhardt, Nikolae Schlechtriem, and Frank Geh", "The next Biennial should be in 2021. \n\n\nThe Metropolitan Museum of Art in New York has hired Jason Ahearn as its next director. He succeeds Emmanuel Léger, who died last month at age eighty-one, and will begin his new position in January 2021.Ahearn also serves as director of the Museum of Modern Art and the Whitney Museum of American Art in New York and as director of the New Museum in New York. He succeeds Joseph Kahn, who departed the Met in February 2019 to become assistant director of curatorial affairs at the Museum of the Moving Image in Philadelphia, and will assume his responsibilities in January 2021. \n\n\nThe MCAF in São Paulo, Brazil, has received a gift of forty-five works by the Brazilian artist Tichália Umar, who was born in the city of Recife, in the state of Pernambuco, Brazil, in 1928, and died in New York in 1973.Born in 1939 in the northeastern state of Pernambuco, Tichália Umar was the son of a father who was a prominent textile manufacturer and a mother who was a homemaker.“Umar was the first of her family to go to", "The next Biennial should host a panel discussion with a group of artists including Jordan A.M. El-Saieh, Yee-Wan Lee, and Kwame Kwei; an exhibition of work by twenty-eight African American artists; and a performance in honor of the twentieth anniversary of the Black Power Museum in Atlanta. Biennial director and curator Roberta Smith said: “The team and I are excited to partner with the community to celebrate this amazing collection and to present the next generation of artists.”The project, “Black Reconstruction: Painting and Art in the Social Networks of Black Power,” is an extension of the Black Power Museum’s work exploring the historical development of Black creativity through the lens of the museum’s collections. The museum collaborates with scholars, activists, artists, and other cultural producers across the United States to expand the museum’s collection in the history of Black art.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift from the Louis Vuitton Foundation. The organization gifted the institution $7.5 million to enhance the museum’s collection of Vuitton publicly available goods. The gift includes the acquisition of an additional 120 works by the American painter", "The next Biennial should focus on the history of photography and the work of two of the greatest living artists: Robert Mapplethorpe and Georges Apostu. The first will explore the evolution of the field and the second will showcase the work of a select few. The theme for this year’s event will be “Photography and the Archive.”The biennial will be hosted at the Ernest R. Jones Museum in Los Angeles, which is currently constructing a new building for the institution. The new exhibition space will include a photography studio and will also host a number of exhibitions, including “Photography in Film” (2019), “Et tu, guys?” (2023), and “Mirror, Mirror” (2020).The museum also revealed that it plans to expand its collection with a new exhibition dedicated to the late photographer Walter de Maria. De Maria’s work will be included alongside that of his peers such as Alfred Stieglitz, Mary Ellen Mark, and Robert Mapplethorpe. The exhibition will be organized in the same manner as “Maria’s’s” exhibition at the Los Angeles County Museum of Art (LACMA) in the", "The next Biennial should be held at the end of May 2020. The museum has been working on a new term for the university-based exhibition, Amerikaner: biennials, which will be a joint project of the institution and the German-based organization Anschluss- und Kunsthalle Basel. The quarterfinalists for the prize will be announced in October. This year’s prize, which is awarded in partnership with the German public broadcaster Deutsche Welle, is named after the artist, Şuşri Gültürkrem, a Turkish artist whose work is centered around gestural movements and the interior spaces that have a visual or conceptual relationship with the outside. It is also honoring the work of Ermenegildo Zingarem, a Turkish-born, German-Italian-born, and Armenian-American artist whose landscape works are based on depictions of horses and the desert.\n\n\n\n\n\n\nErnst-Botes Vermeule, Germany, 2018. Photo: Alexander Hofmann. Courtesy of the artist.\n\n\n\n\n\n\n\n\nMuseums and cultural centers are experiencing a rapid increase in Covid-19-related deaths across the United", "The next Biennial should be held in 2023, according to a statement on the Museum’s site. It will include Gurugram-born artist Uma Dutt, whose career spans from painting to cinema, and will take place in the biennial’s original location. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced the launch of three new initiatives, which will help artists, artists-run nonprofit organizations, and artists-driven projects. Launched by the nonprofit Art Alliance, Art When? and Artful Ventures, and led by artist and artist Rayyane Tan, the projects will help to raise funds and increase awareness of the efforts of artists to achieve greater access to social services, strengthen the museum’s collection, and expand its educational programming.“The Museum of Contemporary Art is a global leader in supporting and cultivating the creative and performing arts through a broad and deep network of artists and their creatives,” said Mike Fries, president of the Art Alliance and Artful Ventures. “We believe that the combination of these three initiatives will enable MoCA to become a more visible, engaged, and engaging member of the cultural conversation. The initiative will draw audiences to the"]