["The next Biennial should be on the purchase of time and on the relationship between art and the digital world. This year’s event, “Studio in a Time of Crisis,” will be held at the Museum of Modern Art from November 8–November 12.Curator Kim Stanley-White, whose work explores the relationship between art and technology in an attempt to make the museum’s art and technology experience contemporary, said: “I’m hopeful for this year’s show to reflect both an active and adventurous spirit, with an action that will include a generosity of spirit and a sense of humor. It’s going to be a show of a lifetime.”\n\n\nThe Gardner/Mund and William Gibson Museum of Art in Boston, Massachusetts, have announced that they are co-sponsoring a new kind of museum, called the Center for Art and Society. The institution, which will be located in an industrial area of the city, will work with independent artists and will host regular fundraisers and special events. The center will also host exhibitions and will host a variety of public programming.“We are proud to be a part of the growing center for art and society in Boston,” said M", "The next Biennial should be held in 2021, when the exhibition will be relocated. The next edition will be held at the Museo de Arte Contemporáneo in Santiago, Chile, and will be staged in the city of Almería, the capital of the Canary Islands.The biennial is currently closed to the public.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it is preparing to welcome visitors back to its grounds in 2021 following a $100 million renovation and expansion, which will include the construction of a new exhibition space, a larger public gathering space, and the renovation of the existing building. The project will also include the construction of a new public library, classrooms, a public green space, and the renovation and expansion of the existing museum’s permanent collection of more than 1,500 works.“While we cannot yet reveal all of the work that will be involved in the redesign of the museum, we can say that in the coming years we will have many new opportunities to explore and experience the works of our distinguished curators and the new collections,” said Joseph Pannacone, director of the MFA. “The new museum promises to be a unique exhibition environment designed", "The next Biennial should be held in the summer of 2020.  The biennial will be a joint venture between the Arts Council, the National Association of Theatre Owners, and the Association of Stage Administrators. The Council of the Arts will be housed at the National Gallery and will host a residency program that will provide short-term support to emerging playwrights; the National Association of Theatre Owners will oversee a year-round residency program that will be open to the public from March 15 to June 1; and the Association of Stage Administrators will organize the biennial for the institution in conjunction with the Visiting Artists Program, which is supported by the National Endowment for the Arts and the Diller Scofidio & Katherine.During the two-and-a-half-month residency, artists will be invited to perform or design their own works while engaging with contemporary issues such as urban life and design, health, climate change, and the environment. The program will culminate with an exhibition of the work of participating artists and will feature the work of forty-eight artists.  Commenting on the 2019 residency, the Arts Council said: “The themes and the work performed by visiting artists are vibrant, provocative, and provocative. The programme invites the", "The next Biennial should be held in the spring.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today it is planning to move the exhibition “The Third Wave: Art from the 70s” from its current home at 555 East Ninth Street to a new location in the city’s Pacific Palisades. The museum has named John Michael, who has served as the director of the museum since 2012, as the interim director of the Los Angeles County Museum of Art (LACMA). Michael has served as interim director since March 2019.“John’s leadership will ensure that the LACMA is well positioned to continue its innovative and forward-thinking approach to contemporary art and art history,” said museum director Margaret Archibald. “Through his leadership, John will ensure that LACMA continues to be transformed by a forward-thinking, artist-centered vision for the museum.”Michael succeeds Barbara Aitken, who has been the museum’s director of development and public engagement since 2014. Aitken will continue to serve as director of LACMA through 2021, with the possibility of her stepping down at any point in the future.\n\n\nThe National Museum of Women in the", "The next Biennial should be held in the spring of 2021. The exhibition will feature new works by artists represented in the curatorial program, including Robert Frank, Anish Kapoor, and Ann C. Hirschhorn. The museum will also open a new permanent collection building, which will consist of contemporary art from the museum’s collection.The transition of leadership at the Museum of Modern Art has been ongoing for six months, since May 14, 2020. Museum director Daniel H. Weiss, who has been working at the institution for more than twenty years, was appointed interim director in April. The museum reopened on July 3, 2020, following a $100 million expansion. The biennial’s inaugural exhibition, “The Sixties,” presented mostly works by artists such as Robert Irwin, John David Dolphy, and Robert Irwin, and featured work by seventy-two artists between 1966 and 2018. “The I’m-Alone-All-The-Time project,” the biennial’s final event, will feature work by seventy-two artists over the course of twelve months. The inaugural exhibition will return in 2020.\n\n\nAfter the British artist Jess Phillips, a prolific and influential", "The next Biennial should focus on materialistic and consumerist ideals as well as on the contemporary urban environment, Ortega y Gasset’s theory of democratic societies and its place within a complex and disorientating world,” the foundation said in a statement.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles announced today that the institution is bolstering its curatorial skills as it looks to stage a fourth biennial, this time focusing on “expressions of the artist’s immediate and virtual selves.”Curated by Jocelyn Alvarado, director of the museum, this year’s event will take place at the Los Angeles County Museum of Art (LACMA) in the fall of 2020. Featuring twenty artists, including Emily Hall, Paolo Baratta, and Stephanie Bache, the biennial is slated to run from February 23 to March 14. “Our curators and staff are sharp and creative, but most importantly, committed to exploring and celebrating the art of our time,” said David Gaspard, director and CEO of the museum. “That’s what makes us unique and what enriches our collections and", "The next Biennial should be held in 2021. The next Biennial will be held in the summer of 2022. The next Biennial will be held in the spring of 2023. The next Biennial will be held in the winter of 2028. The next Biennial will be held in the spring of 2031. The next Biennial will be held in the winter of 2022. The next Biennial will be held in the spring of 2026. The next Biennial will be held in the spring of 2027. The next Biennial will be staged in the summer of 2022. The next Biennial will be staged in the summer of 2021. The next Biennial will be staged in the summer of 2021. The next Biennial will be staged in the summer of 2019. The next Biennial will be hosted by the Museum of Contemporary Art in San Francisco in the fall of 2021. The next Biennial will be staged by the Museum of Contemporary Art in London in the fall of 2021.  Butler Art Museum, New York: The Nelson-Atkins Museum of Art in Kansas City, Missouri, has announced that it remains committed to the work of its former director, William", "The next Biennial should focus on how art and science are interrelated and how they can be used together to address a wide range of challenges. We look forward to this year’s event and to the next.\n\n\nThe Canadian Council of the Arts (CCA) announced today that Richard Mayhew has been appointed as the new chair of its board of directors. He is the first non-European head of the organization and will take up the post on November 1.Mayhew succeeds Jennie and Richard Condon, who led the organization from 2012 to 2016 and who died in 2017. He will succeed Julie Rigby, who has served as chair since 2013 and who announced her retirement in December 2016.“Richard’s vast experience and knowledge of the arts will be a valuable asset to CCA in its ongoing work to support and promote the creative and intellectual life of Canada,” said Julie Rigby. “His new role will allow him to continue to shape and prioritize the direction of the CCA, while also continuing to expand the reach of our programs. We look forward to working with Richard to ensure that CCA continues to thrive under his leadership and to building on the work of his predecessors.”\n\n\nAn investigation is underway", "The next Biennial should be held in 2021. The 2020 edition will be held at the Museum of Contemporary Art, Miami Beach.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Sherry King has been named its next director. King is currently the founder and CEO of the contemporary art company Felt. King has been involved with the institution since 1963, when she first began as a curator in its pop-up studio in Los Angeles. She was also the curator of the first exhibition of work by artist Carolyn Aitken at the museum, “Cindy & Bud,” in 1995, and was the curator of the “Chronology series”“200 years of art photography,” which was staged in various locations across the city of Los Angeles in 1999.“Sherry has been an outstanding leader for Felt and an ideal fit with our mission to bring cultural object preservation and community partnerships to contemporary art,” said Mike Fleischman, president of the museum. “Her first three decades at the museum have been dedicated to working with artists to preserve their works and her fourteenth year will include a special exhibition dedicated to photography.”King has also organized the first museum", "The next Biennial should be held in 2020. \n\n\nThe Art Gallery of Ontario (AGO) is expanding its partnership with the Jewish Museum’s collection of Sidney James Audubon’s Carnegie Art Museum’s (CAM) collection. The new initiative, called Presents, will provide museum members with a new range of works from the American artist’s career and will be a platform for the collection to present on a regular basis.“We are thrilled that this new arrangement will allow our members a new range of work by James Audubon and will present some of his most ambitious and historically significant projects in a museum where he remains a revered teacher and a treasured collector,” said Andrew Hauser, vice-president and chief curator of the Museums Association.The new partnership was initiated by the CAM’s executive director, Carolyn Eller, who recently stepped down from the helm of the institution to pursue new creative projects. The organization selected the Guggenheim and the Toronto Museum of Art as possible locations for this series of public events. The CAM’s collection is comprised of eighteen works, including six works by James Audubon, H", "The next Biennial should focus on the history of photography in Europe and the Americas. Dubbed “Photography in the Age of Columbus,” the event will be in Santo Artístico, Buenos Aires, from May 20 to May 27. “Thematic studies\u0097at least in part\u0097of photography in the Renaissance and the Renaissance era will be of great interest to the public,” said Cristina Maza, president of the São Paulo Art Foundation. “We are grateful to Johanna, Paulo, and others, who have played an important part in the project, for their excellent support in making this event possible.” The initiative will also include a digital exhibition, “Photography in the Age of Columbus,” which will be presented by the Whitney Museum of American Art; a collection of photographs by Cézanne, René Magritte, and René Magritte-Besch, which will be featured in “Photography: From the Modern World to the Future” at the Whitney Museum of American Art; a digital cataloguing of the artworks of the late Brazilian photographer Luiz Cesarco; and a video presentation of the exhibition “Feminine", "The next Biennial should arrive in 2019.\n\n\nExpert curators, artists, researchers, and scholars are organizing a campaign to have the Japanese government stop allowing the Tate to close its doors and rejoin the rest of the UK and US in relocating to “green buildings” and risk losing their federal funding. The campaigners claim that the Tate is not “capable of managing the future needs of its Tate’s collection, research and exhibition program, and its staff.”The decision to move the Tate’s holdings from its current site in Blackheath, where they have been housed since 1971, was made in 2015. While the Tate initially said that the move would not affect the museum’s programming, it has since been accused of violating the EU’s relocation campaign commitments by moving the works there.The Campaign for Tate Modern Relocation (CATR), which has launched a petition at change.org, told The Guardian that the Tate’s decision “amounts to a betrayal of Tate’s artists and staff.” The petition claims that the move is a “breach of public trust,” and argues that the Tate should return the money it is losing through the", "The next Biennial should be held in the city in May 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to move its exhibition “The exhibition of the artist’s work in the exhibition of the artist’s work on the museum’s campus,” according to a press release from the institution. The move is part of a $50 million renovation project that will overhaul the museum’s current exhibition space.“The exhibition will also include an introduction to the program of the MFA, which is a joint effort of the Museum of Fine Arts and the Boston Art Museum, and will be curated by Amanda Klages, director and chief curator of the MFA. The show will be on view through March 21 and will return in 2020.”The MFA is also preparing to open a new building, the MFA Center, in the City of Boston. The institution is currently working on a new design for the space that will incorporate elements of the MFA’s existing collection and will offer live programming. \n\n\nThe French artist, who often drew from mixed-media works and his own experiences, died on August 5 at the age of eighty-eight. Her iconic and", "The next Biennial should take place in 2021. The Swiss architect Euler and his team will design the exhibition space and the Pavilion d'Art Moderne, which has been organized as a complex of galleries, offices, workshops, and public spaces since 2014. The pavilion will host various works by the artist.Exhibition organizers are also planning to open the exhibition in the nineteenth arrondissement in 2021. The exhibition will be on view through March 7, 2021.\n\n\nThe Italian Museum of Venice (Instituto di Venezia) in Venice, Italy, recently held an exhibition of work by the artist Sanchi, which was organized by the institution as part of the reopening of the institution's former venue in the city of Pesaro. The show, titled Èl pelle romano, or The Immediate Life of a Roman Statue, was curated by Luigi Cicutto and featured works by Sanchi, Daniel Bacher, Odile Di Val, Giulio Grassi, and Filippo Pisanti. The exhibition was held at the museum until March 23.“We are thrilled to present this exhibition, which celebrates the tenacity of the sculpture process in", "The next Biennial should include two groups of artists each exhibiting their work in an exhibitionism and a self-proclaimed New Radicalism. A third exhibition may be organized on a number of other topics. “The exhibition of the exhibition will be one of the major events of the biennial,” said Pilar Cervantes, the head of the Biennial de Barcelona. “The long-term vision is for a biennial that will continue to be one of the major events in the city.”\n\n\nArt and Culture Minister Rishi Sunak has revealed that the government is considering raising $300 million to support the arts in the wake of the pandemic. “We are actively reviewing all the possible options to ensure quality of life for artists, and ensuring that the government has the resources to sustain their work for years to come,” Sunak said. Sunak also said that he expects to issue a funding memorandum soon that will outline the government’s response strategy to the pandemic.“We are constantly assessing the impact of the pandemic, assessing the impact on the local and regional level, and assessing the impact on the whole country,” Sunak said. The Indian arts community", "The next Biennial should be held in 2022.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $5.5 million donation from a donor who also gave $3 million in support of the museum’s expansion into the Northeast. The donation was made by an anonymous benefactor who lived in the city and donated the funds to improve the museum’s footprint by adding a new gallery, new curatorial galleries, and construction of a new visitor center. The donor, a wealthy businessman who has roots in the region, had the idea to renovate the institution from architect David H. Koch, who died in 2007, to architect Norman Foster, who was hired as its namesake architect in 2018.Founded in 1890 by a group of local architects to provide a more permanent home for the collection of Harvard University, the MFA was the first arts museum in the nation to broaden its scope by adding a modern collection of American art to its campus in 1964. Its expansion into the Boston metropolitan area began in 1964 with the construction of the David H. Koch–designed Artspace, which opened in Massachusetts General Hospital in 2015. The museum also expanded into the Doris Duke Museum of Art in Durham, North Carolina, and the Boston Garden,", "The next Biennial should also include a workshop on the life and work of the late Pakistani artist Haji Ali Rizvi, who is credited with being the first to create a full-scale work called 'The Field of Sculpture’s Vision'.\n\n\nA group of artists are suing the Museum of Modern Art (MoMA) in New York over a $50 billion reorganization plan that would have seen the institution rethink its collection in an effort to reduce its debt. The suit, which was filed by Hoor Al Qasimi, Adrienne Edwards, and Pia Camil, outlines a number of issues that they say are “unacceptable” and claims that MoMA has failed to address them in a timely manner.“For the past five years, we have been working with the board and staff to develop a long-term strategic plan aimed at revamping the Museum to improve its financial, operational, and cultural health,” reads the complaint. “While we believe the direction of MoMA is in the best interest of the institution, we believe that the reorganization plan is the wrong course for the institution.”According to the complaint, MoMA embarked on the reorganization plan in February 2019, but", "The next Biennial should be held in 2020, the institution said in a statement.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is extending its collection into the future with the acquisition of ten works by the critically acclaimed Argentine artist Radovan Karal. The artist’s Rembrandt-designed murals, which depict corpses, vehicles, and crowd scenes, were installed in the museum’s courtyard in the fall of 2018. The works were on view for the first time when the institution opened to the public in April.The acquisition spree was part of MoCA’s plan to refocus on the future through research and the creation of new works. The museum recently completed a significant renovation of the Art Institute of Chicago, which is part of the same team that designed the new Fujitsu-designed galleries and the new space for the museum, which opened in January. Despite the extensive work, the museum has yet to announce a single winner of the $35 million $50 million Biennial Prize.“The selection of Radovan Karal was an unprecedented experience for MoCA,” said David Rubenstein, director of the biennial. “We are grateful to the jury and the public for their thoughtful and diverse recommendations", "The next Biennial should take place in the spring of 2022, and will consist of four exhibitions, each centered around a different theme, in the United States and Europe. The first exhibition will focus on social justice. The second will focus on environmental justice, and the third will focus on the arts and the humanities.The exhibition will be curated by renowned artist and curator Warhol, who will serve as the executive director. The biennial will be based at the Museum of Modern Art (MoMA), in New York, and will be hosted by curator and poet Maya Lin.  The exhibition, titled What is the Story?, will be hosted by Art in the City, an initiative of MoMA and the John Simon Guggenheim Foundation, and will be presented by the museum and will focus on biennial exhibitions in the tradition of works by artists such as Robert Irwin, Mark di Suvero, and Joanna Kamm. The first UCCA biennial, The Stranger, was staged at MoMA in 1981, and the fourth UCCA biennial, The Birth of a Nation, was staged at the Getty Center in Los Angeles in 1957. The organizers of this year’s edition of the bi", "The next Biennial should take place at the Museum of Contemporary Art (MoCA) in Los Angeles in 2022.\n\n\nThe Department of the Arts (DBA) in New York announced today that Mary Elizabeth Winstead has been named the future director of its New York Folk Art Museum (NYC FM). After a four-year tenure, she will take the helm of the institution in January 2021. She succeeds Barbara Lozano, who retired in April after twenty years at the helm of the museum.“Mary has been instrumental in the growth and development of our museum and its reach, which has, for many years, been the subject of her greatest passion,” said DBA director Joseph L. Sullivan. “With her appointment, Mary will continue to elevate the museum’s profile, both nationally and internationally, and expand the work of our talented team. She is a champion of the arts and a person who has made an indelible mark on the lives of New Yorkers.”Previously, Winstead served as the executive director of the Athenaeum in New York and as a curator at the Metropolitan Museum of Art in New York. During her tenure at the Athenaeum, she curated the exhibition “The Rough Guide to", "The next Biennial should feature the work of twenty-nine artists, including Nari Ward, Kamel El Samerraoui, Nari Harb, and Riham Farah, as well as a selection of contemporary art from around the globe. The exhibition will also include performances, lectures, screenings, and other programming that will be themed around themes of resilience, compassion, and love.In celebration of the exhibition, the Biennial Board, which was organized by the grand prix, offered a special gift of twenty-four works by the honorees of the prestigious awards. The works will be presented in a limited edition exhibition at the Biennial’s Headquarters, which will be inaugurated with the exhibition of a selection of twenty-six works by the four finalists. The thirty-one-hundred-work collection was chosen from a shortlist of twenty curators nominated by the biennial’s board of directors.The winning artists include:Sarah ElSohrabia, Egypt (1883–1989)Javad ElSohrabia, Egypt (1885–1989)Ali ElSohrabia, Egypt (1889–1973)Hannah ElSohrabia, Egypt (1889–1973", "The next Biennial should be held in 2021, with the reopening date to be determined by the city. The fifth and final edition of the exhibition will be held in 2022. The museum will also open a new site, The Place of Existence, in the center of the city. The new exhibition will be titled The Place of Existence and will feature the work of twenty-five artists, including László Moholy-Nagy, Léa Seydoux, Clint Eastwood, James Marshall, Yannick Maréchal, Max O. Israel, and Claudia Ros, among others. Commenting on her appointment, Lourey said: “I am honored to be chosen as a curator and to work with the artists who have inspired me to become an artist. I look forward to working with the artists who are making this exhibition together in my new home, The Place of Existence, to celebrate their legacy and to engage with the city of Portland, Oregon, and to serve the city of Portland’s creative community.”\n\n\nThe National Gallery of Art in Washington, DC, has appointed Brian Sims as its next director. Sims", "The next Biennial should commence at the Bankstown Arts Centre on April 5–April 6, 2021. The next Biennial will be held at the Royal Melbourne Institute of Arts (RMIA), on February 31–March 3, 2022. The next Biennial will be organized in partnership with the RMIA community, including providing an exhibition space, hosting biennial events, and providing access to the RMIA campus. The RMIA 2022 and 2022 editions of the September/October editions will be presented by both the RMIA and the Royal Melbourne Institute of Art, respectively, and will be hosted by the same artist and director, Paul Mpagi Sepuya, who will return to helm both programs in 2022. The 2016–2017 biennial, “February 29–March 6, 2019,” will continue with the same five artists selected for the biennial and will include a special retrospective of the work of Jane Parrish, as well as an exhibition of work by Claude Monet. The 2019 edition of the show will be held at the RMIA in Melbourne and will include works by Kiara Sorensen-Smith, Cécile Barotte, Joseph Lidén, Phililma Moscoso, and Sally Mann", "The next Biennial should take place in 2021 and will also include a retrospective of the work of one of the curators, the Danish artist Mørgen Stier, who is currently under investigation for allegedly breaching copyright law by showing “Sebastian Hengstenberg” (1905–2007).On Monday, the Arts Council announced that it is suspending the 2019 edition of the exhibition, which was set to run from February 8–February 11. The organization said that the decision was made after it “accounts[d] with[d] the recommendations from the [August] meeting and a decision taken at the end of February.”According to the arts website Artnet, the decision was made following a meeting between the council and the German federal institution, which comprises the federal state of North Rhine-Westphalia, and the artist. The artist, who is currently incarcerated, was represented by the state of North Rhine-Westphalia. Although the court of appeal has yet to rule on the case, the German federal state is currently attempting to have the exhibition suspended until at least April 14.In a letter dated March 18, the city of Cologne and the state of North Rhine-Westphalia said that", "The next Biennial should be held in 2021, when the exhibition will mark the thirteenth anniversary of the museum. The institution will also host an open-air theatre production of the play The Rape of the Sabah, which dramatized a Rape of Sabah survivor, to commemorate the centenary of the event.The museum also revealed its plans for the construction of new chapters for the museum, which currently has a total of twenty-seven historic buildings, and has redesignated a site where the museum will have a permanent exhibition of its collection.The new structures will be located in the city of Khost and will add approximately 16,500 square feet of museum space, five galleries, a library, and a theater to the institution. The space will also feature a large garden with an area for public performances and events. The architect behind the project, Zaki Nusseibeh, said: “We wanted to create a place where people from all over the world could come together. The garden will provide an ideal setting for the development of an educational program. We wanted to use natural materials in a sustainable way which will benefit the city of Khost and the surrounding area for many years to come.”The programme will include a virtual reality exhibition,", "The next Biennial should be held in Berlin in 2022. For his work 'The Death of the Body', a series of photographs made in the course of the conflict in Afghanistan between 1979 and 1983, the artist will receive a €250,000 prize.The eight works in the exhibition, which includes work by many of the artists featured in the show, are “The Body in Space,” which focuses on the process of death and the body in general; “Death in the Eyes of Others,” a series of photographs that depict victims of war and the violence that they endure; “Between the Sun and the Moon,” a series of photographs that are based on the artist’s experiences of the artist’s \"little world\", “On the Earth,” a series that is about a future without an anthropomorphic body, a “Planet Without Man”—a future in which the Earth is no longer a place, but a place that is continually shifting and evolving.Featured works in the exhibition are work by the following artists: Paul Bayard (New York); Evan Barlow (New York); Ivan Bruno (New York); Ming-Chi Cheung (", "The next Biennial should be held in 2020, with a goal of presenting an exhibition that incorporates art and politics from South Asia, including Thailand and Nepal, in the same exhibition space as the contemporary art.  \n\n\nGermany’s Federal Association of Art Museum Directors (BAV), which represents more than 1,500 museums, is welcoming the appointment of Willem de Kooning as its new president. De Kooning, who has served as the director of the Geneva-based NGO the Deutsches Museum Stiftung (DMStiftung) since 2016, will take up the post on September 3. De Kooning will continue to work with the institution as its director until June 30, 2022.“Willem de Kooning is a dedicated and talented professional who has been instrumental in shaping the strategy of the BAV,” said Andreas Feuerbach, president of the association. “Together with our board, we are delighted to welcome him to the organization. We are confident in his ability to lead the museum to new heights and navigate its future with clarity and insight.”Commenting on the new role, De Kooning said: “After a thorough search, I have come to the", "The next Biennial should be held in the spring of 2022. The first edition, titled “The Future Is Present,” was organized by the Los Angeles–based artist-run nonprofit the LA Center for the Arts (LACMA), which was launched in 2013 by artist-activists Lalo Gambino and Lourdes Infante.LACMA has been working with the LA-based artist-run nonprofit the LA Center for the Arts (LACMA) for several years to advance the work of Alessandro I_cS, a group of thirty or so artists whose collage-like works take cues from the Golden Age of Italian art, in order to explore the historicity of Italian modernism. The group made its first exhibition at LACMA in 2006.\n\n\nThe Art Newspaper has revealed that the painter-designed museum will now open on the fourth floor of the Museum of Modern Art (MoMA) in New York City. It also revealed that the museum will be renamed the Museum of Modern Art (MoMA) and that the museum’s current venue will be relocated. The renovation initiative was inspired by architect Albert Kahn’s vision to create an ideal setting for the museum’s collection to flourish in the", "The next Biennial should take place in 2021, the twenty-first in 2022, and the twenty-third in 2023. The first event, Art in the Streets, will be in 2021. The second, Art of the Real, will be held in 2022. The third, Art At the Library, will be held in 2021. The fourth, Art at the Museum, will be held in 2021. The fifth, Art at the Museum, will be held in 2022. The sixth, Art at the Museum, West, will be held in 2021. The seventh, Art at the Museum, South, will be held in 2022. The eighth, Art at the Museum, East, is slated to open in 2021. The ninth, Art at the Museum, North, will be held in 2021. The tenth, Art at the Museum, South, will be held in 2019. Art at the Museum’s inaugural event, Art for a New Generation, will be hosted in 2021.\n\n\nThe Chicago Architecture Center (CAC) announced today that it will begin accepting visitors after hours on January 30, 2020, to exercise its newly acquired land", "The next Biennial should take place in 2023. “I am very excited about this new chapter of my life,” said Eileen. “I am also enormously motivated by the opportunity offered by the Biennials to expand on the work of the last fourteen years, and to unpack the knowledge and understanding of the collection.”\n\n\nA group of artists, including Damien Hirst, John De Salvo, and Kate Moss, have launched a campaign to keep the National Portrait Gallery in London open. They claim the institution is being shuttered due to the Brexit vote and are demanding that the government preserve the gallery’s budget and invest in its future.Promoting the group’s upcoming exhibition “The Shape of Things to Come: Conversations with Jean-Michel Basquiat,” which will run March 22–March 25, 2019, the exhibition will highlight the work of fifty-five artists spanning the twentieth century. Ninety-three-year-old Jean-Michel Basquiat, who is known for his works that incorporate sculptural materials and performative devices such as mirrors and mirrors, has been featured in a number of exhibitions since his death in 1973. The exhibition will also", "The next Biennial should reflect upon the history of the exhibition, the program, and the exhibition at hand. \n\n<<<8. Ivan Albright’s Parsons’s recent exhibition at the National Gallery in London will not go unnoticed. The first exhibition of its kind in the UK since the late Victorian era will be marked by a performance by five artists; including Dougie Rinder, Liam McGinty, Michelangelo Antonioni, and Anna Atkins. The exhibition will also include an extensive public tour of the institution. \n\n\nIn an attempt to dispel the suspicion that Israel is a sponsor of anti-Semitic violence, a group of writers and artists who were invited to participate in the 2020 Venice Biennale have released an open letter denouncing the country’s participation in the international anti-terror coalition.“We believe that the Venice Biennale organizers have made it clear that they intend to withdraw from the alliance,” reads the letter, created by the Welch-Wilhelms-Katz Center for Contemporary Art (WKKA) in Frankfurt and signed by Lilian Bochereau, Michel Suber, Raimond Schwartz, and Mary Bousted", "The next Biennial should be in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) has completed a $225,000 renovation of its historic building, which has housed the museum since 1972, and is currently working to determine the future of the building and its collection. The renovation—which will include the addition of a new permanent exhibition and the renovation of the existing lobby—is part of a larger $138 million expansion project, known as the Museum of Contemporary Art Paris, that was funded by French and American donors. The project is also being overseen by the contemporary art center Paris’s Institute des Beaux-Arts (Beaux-Arts), a nonprofit organization established in 1985, and the city of Paris, which has funded the project since it was founded in 2007.“The new Museum of Contemporary Art Paris is an ambitious project involving the reconstruction of the building and the renovation of the museum, as well as a reflection of the city of Paris and its history,” said Henri G.F. Bénédicte, director of the museum. “The project will also bring about fifteen thousand square feet of exhibition space to the museum, which will become an important center for the collection and research of contemporary artists.�", "The next Biennial should focus on the life and work of Østfoldød, the Danish artist who usually depicted a man surrounded by a group of women in a golden cage and, in the subversion of their own gender stereotypes, the artist’s own fantasies. We encourage all of us to consider the life and work of a human being in everyday life. In his artistic and political work, Østfoldød examines gender roles and gender roles examine masculinity and masculinity’s relation to women. He also often examines how children are brought up and taken from their families and how these roles are passed on to children. This exhibition, entitled “Children of the Birds,” will inaugurate a new exhibition at the Biennial. The show will be open on February 26 and will run until March 29.Audrey Menin, who has curated exhibitions at the Museum of Modern Art, New York (MoMA), New York (MoMA), and the Museum of Contemporary Art Chicago (MoCA), said: “I’m thrilled that our new exhibition, ‘Children of the Birds,’ will introduce a new level of scrutiny into the lives of children and young artists. Children are the future of art and this", "The next Biennial should take place during the sixteenth week of March 2019. The event will be hosted by the Museum of Contemporary Art Miami Beach, which is currently remodeling its campus.The 2018 show was curated by and drawn from a pool of seventy artists, who were selected from a pool of twenty-five artists selected via an open call. The artists chosen include Ugo Rondinone, Adrian Piper, Joeseph and A.J. Schipper, Nari Ward, Ana Mendieta, Betsy McClellan, Jay-Z, Miera Misrach, and Yinka Shonibare.The biennial will mark the first time the museum has staged a show dedicated to a single artist in more than thirty years. The artist-in-residence will be based in the museum’s new Greenpoint campus, which will launch in the coming months with a conceptual design by artist-in-residence Renzo Piano, which will sit on the southeast corner of the museum. The exhibition will feature a selection of works by thirty-four artists, including Simone Leigh, Joa Tan, Yinka Shonibare, Nicky Warhol, and Dante Shepherd.“We are thrilled to announce that this", "The next Biennial should focus on advocating for the preservation of the city’s iconic buildings and will focus on how to use the power of art to change our world.”The five-day celebration will run from March 21 to March 26 and will feature work by forty-eight artists. Guided by a panel of eight artists, the event will celebrate the legacy of the city’s architectural heritage, including the Frederic W. Kahn building, the WPA’s headquarters, and the Pacific Electric Building, which hosts a museum each year. The inaugural exhibition is currently on view at the Frederic W. Kahn Museum at City Hall.\n\n\nThe Museum of Contemporary Art (MoCA), California, is planning to move the final twenty-two years of its collection from California’s Sonoma County to Cambridge, Massachusetts, following its new $50 million expansion spearheaded by billionaire collector Warren Kanders. The move is part of a $2.3 billion plan to remake the institution, which was completed in 2017 and opened to the public in February 2018.Kanders and his wife, Ann, have already spent $1.5 billion renovating and expanding the museum, which was founded in 1936 by Robert Moses, the father of modern", "The next Biennial should be organized with the intention to organize mass exhibitions of works by artists of the same nationalities, in order to advance the understanding of the unity of cultures; the revival of the relationship between culture and society; and the necessity for the collaboration between the arts and the sciences in order to advance the development of our knowledge of art and the sciences. The next Biennial will be held at the Biennale, the Lausanne-based infrastructure of our great city, Lausanne, Switzerland, located in the mountains of the Swiss Alps. The exhibition will be organized with the support of local partners and the cooperation of the local authorities of Lausanne and Zurich.The twenty-third edition of the Venice Biennale, curated by Alexandra Boccato, is scheduled for November 2019. \n\n\nThe upcoming edition of the Art Basel Hong Kong will be held at the Hong Kong Convention and Exhibition Centre (HKCC), the venue of the Hong Kong International Film Festival and the Hong Kong International Book Festival, from September 25 to September 27. “We’re working closely with the Hong Kong City Government to provide an optimal environment for the staging of the upcoming Art Basel Hong Kong,” Guggenheim", "The next Biennial should be held in the fall of 2020. As the city prepares to re-open in 2020, the biennial will be led by a team of curators who will work with the city’s artists, local community leaders, and visiting artists, as well as with the city’s architects and engineers, to further explore how art and design can play a significant role in revitalizing our communities.”\n\n\nThe August 21 announcement by the Museum of Contemporary Art (MoCA) in Los Angeles that it will reopen to the public at 2100 hours on August 24 following a $4.4 million facelift—the museum’s largest investment in its seventy-five years—was met with excitement from the public and a great deal of backlash from critics. “MoCA’s move will mean a flood of visitors to the institution, which has been a mainstay of the Southern California arts calendar for decades, and will be remembered as one of the most exciting cultural events of the year,” wrote Emily Nussbaum in the August 20 Artforum. She added that the museum will open to the public in time for the Fourth of July weekend crowds, and will be “truly transformed by the", "The next Biennial should be held at the Centre Pompidou in Paris, for which the Place de la République will host the show from January 7 to January 12, 2020. The event will also feature the exhibition “Adrien Brody: The Metropolitan Life of Art” (2019), an exhibition organized by the Centre Pompidou in partnership with the Metropolitan Museum of Art, and the show “Maurice Breuil: A Retrospective” (2019), a public sculpture project in collaboration with the artist group ARTE!HELM. The show will also consist of a number of joint projects with the newly created Centre Painted Arts of Fine Arts in Paris, which will transform the pavilion into an exhibition space for the exhibition of the artist’s work in the fall of 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York is introducing a new digital platform that allows current exhibitions from the institution to be catalogued and shared across social media. Titled MoMA Curator, MoMA Curator Central, and MoMA Curator Viewer, the service will allow the public to browse through the catalogues of all twenty-four of the museum’s current exhibitions and", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, which has been closed since March due to the Covid-19 pandemic, has released the 2018 schedule for its spring/summer/fall edition, which will take up the theme of the effects of Covid-19 on art.Coinciding with the exhibition is a redesign and the overhaul of the MCA’s famed Los Angeles County Museum of Art, which will feature new works by ten artists, including Mark di Suvero, David Salle, and Rob Lief, among others from the Los Angeles area. The MCA is attempting to be more like the Los Angeles Museum of Contemporary Art, which opened in 2001 and closed in 2011. The redesign will include a reconceived and expanded lobby and a reconfigured interior.The redesign, which was funded by the $1 billion redevelopment firm the Foster + Partners, aims to create more energy, vitality, and intimacy between the museum and surrounding community. “The MCA’s redesign is a celebration of the MCA’s mission to be a cultural and social nexus for Southern California and the world,” said Mike Carey, the museum’", "The next Biennial should be held at the Centre Pompidou in Paris in 2022. The exhibition will also focus on the design of the country’s museums and archaeological sites.  The exhibition will take place in a museum that is currently under construction and will be inaugurated by the city of Paris. The theme is “Living on the Edge: Design in the Age of Black Death” and will include works by twenty-two artists. Girard Poussin, president of the Centre Pompidou, said: “The theme of the exhibition is to investigate the near and the far in the imitation of a mother and daughter. The history of the exhibition is about the evolution of radical art, and its study is about the relation between the physical and the intangible. . . . It is about the exploration of the boundaries of art and science, and how these boundaries define and shape our reality.”The launch of the exhibition coincides with the opening of a new work by the French artist Cézanne at the Centre Pompidou. “Cézanne ‘s new work, ‘Flying Saucer,’ is a symbol of art and science in the relationship between an artist and the", "The next Biennial should be held in 2020; the organiser, Basel, has yet to specify when the event will resume.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than five hundred photographs by Mark Halperin and David Halperin (January, 2010–December, 2019) from Alan Zangwill, a collector and friend of Halperin who purchased the works from the artist during the duo's many years together.The gift includes forty works, each with a date specific composition written in pen and paper and dated between the two of them, which were created between the years of 1978 and 1980. The works are all on display in the exhibition “Aurora,” an exploration of the celestial body called the aurora.“We are incredibly privileged to receive this gift from Alan Zangwill and are proud to present it to our patrons,” said MFA director Matthew Teitelbaum. “The works are a perfect example of the unique and enduring craft of Halperin’s and will serve as a powerful example for the many young artists who will follow them in their ongoing pursuit of their own art.”Halperin and Zangwill are", "The next Biennial should be held at the end of the month. Commenting on the new partnership, Mana Contemporary said: “The first Biennial was designed to be a platform for the working of contemporary art of the twenty-first century. This year we are pleased to introduce a new platform for the exhibition of art of the twenty-second century. We look forward to working with the public, museums and galleries to strengthen and extend the theme of the next. The new partnership between the Biennial Foundation and the Biennial of Lévy-6 is a tremendous step forward.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced its representation of the French sculptor Jeanne-Claude. The artist was born in Marseille in 1940 and grew up in Paris. After graduating from the prestigious École des Beaux-Arts in the French city of the Seine, Jeanne-Claude traveled to New York and then to LACMA, where she studied with American artist Harry S. Truman. The pair would become lifelong friends and would go on to collaborate on numerous projects together, including the monumental Jeanne-Claude: A Portrait of an Artist and a Spaceman (1975), which", "The next Biennial should begin on July 20, 2020 and conclude with a spectacular installation of works by artists from Africa, Latin America, and the Caribbean. With an opening reception of Richard Serra, at the Museum of Modern Art, New York.The episode of “Life at the Museum of Contemporary Art” will allow the Museum of Contemporary Art (MoCA) Los Angeles to extend the date of the twenty-second Biennial to June 23, 2021. The institution will launch a new $1 million biennial, “The Eulogy,” in partnership with the Los Angeles County Museum of Art (LACMA), and a new $500,000 biennial, “The Essays,” in partnership with the New York Public Library. The $5 million biennial “Days of Our Lives,” will also be staged concurrently with the event, and will be held on January 26 and February 20.“This year’s inaugural edition of ‘Museum Life’ was a great success,” said Laurie. “We are excited to continue the work of bringing you the most engaging and thoughtful exhibitions and programs at MoCA Los Angeles.”The 2018 iteration of ‘Museum", "The next Biennial should be held at a location other than the City of Kingston, and should take place in an alternate year. “We have been working closely with Kingston City Council and City of Toronto councillors to develop a new partnership that will bring exciting new art to Kingston’s city hall, to reflect the city’s rich and vibrant history,” said Catherine Warren, president and CEO of the Kingston Biennial Board. “This partnership will give Kingston City Hall a significant boost in diversity and inclusion, and will enable us to present a contemporary and engaging exhibition every year.” The new partnership will also enable Kingston to present a new exhibition every year. In the meantime, Kingston is working with a team of curators and historians to create a new exhibition that will showcase the work of Kingston artists. The plan is to present three exhibitions each year, beginning with “Sophie and Alvin” (2019), “Abandon All Hope?” (2020) and “All China’s Art: The Chinese and Japanese Art of the Three Kingdoms” (2021). \n\n\nSOUTH Korea (AP) - A South Korean court sentenced a man to five years and", "The next Biennial should take place in 2021.\n\n\nThe Seoul Biennale Foundation (SBIF) and the Jakarta Biennale Foundation (JBF) have announced that they have reached an agreement to jointly manage the 2017 edition of the Seoul Biennale. Under the terms of the agreement, the two organizations will jointly raise funds for the theme, “Contemporary Issues of Life and Death.”“The two organizations are very happy with the agreement between them and believe that it will create a strong foundation for future cooperation between the two institutions,” said Lisa Ae, chair of the Seoul Biennale Foundation. “We are also very grateful for the cooperation of the two institutions in establishing a partnership.”In the past, the partnership was limited to a single year, from 2009 to 2011, and was one of the longest partnerships between South Korea and Indonesia. During that time, the two organizations shared exhibitions, funds and a number of other projects. The partnership ended in 2012 following a dispute between the two over the sale of an exhibition of work by South Korea–born, Jakarta-based artist Kim Seo-kyung. The year of the show, 2014, was also marked by some of the highest-grossing", "The next Biennial should be held in the summer of 2021. The biennial, which will be hosted by the National Art Museum, will have the theme “Cultural Justice.” The institution will also have a collection of more than 4,000 works and will close to the public in November of 2021. The twenty-first edition of the exhibition will resume in March of 2022. “Cultural Justice: How the Art World and the City of San Francisco Can Revive the Public Good” will open with a performance by the San Francisco Ballet in January 2022. The upcoming exhibition will follow the theme “Cultural Justice: How the Art World and the City of San Francisco Can Revive the Public Good.”  The sixth edition of Art in the City will be held in March of 2022 and will be curated by Rujeko Misono and will include works by seventy-two artists. The 2019 edition of Art in the City, curated by Niepo Tschabal and inspired by the city of San Francisco, was scheduled for January 31 - March 6, 2020. The 2019 event, “Beyond the Art World: San Francisco” drew close to one hundred thousand people", "The next Biennial should be held in the city of Nanjing from May 5 to May 6, 2020, and will include the exhibition “The Future Is Here,” a new exhibition, “The American Biodiversity,” and “The Art of Teaching,” a new program that will involve lectures, talks, and other activities by renowned educators.A selection of the next twenty-two films, documentaries, and television series will be presented by different artists in an exhibition organized by the New York–based artist-run studio 9/1. Each exhibition will be themed around a specific theme, such as “Creative Destruction” or “Power and Morality” and will include discussions with artists that are working today in a more radical way.The biennial will include additional projects such as “Alien Bodies,” which will study the performance and art of a work by artist Peter Gormley; “Creative Destruction: Contemporary Art, Morality, and the Body” (2019); “The Body in Art: Working With the Body” (2019); and “The Body in Film: An Open Letter to Eugene Wigner” (2019).\n\n\nMore than", "The next Biennial should be held in 2021. “I am really looking forward to working with this unique community of artists, and seeing them perform as an exhibition at this special moment in their history,” said Alexander. The biennial will include works by thirty-four artists, including Alex Chilton (1801–1860), Antony Gormley (1866–1975), Michael Horton (1903–1988), and Louise Mackay, the first African American woman to be commissioned to paint for Tate Britain. The exhibition will be curated by Art Historian and curator Kathrin Schapiro.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that it will begin a $250 million renovation of its grounds. The plan is part of a $1.3 billion plan to revamp the museum’s collection, display, and collection circulation, which will add more than five hundred space to the museum’s existing campus and encompass a total of fourteen acres. The overhaul was initiated as part of a $6.5 billion plan to modernize the institution, which is currently undergoing a $2 billion expansion.“ICA is planning to transform its grounds in a way that maximises the exhibition possibilities of our", "The next Biennial should be titled “The Creative Life of Art: From Metamorphosis to Metamorphosis 3,” according to a letter published by the French minister of culture, Franck Riester. The event will be held in the city of Toulouse and will feature biennial artists whose works are housed in the collections of the museums. The 150 artists, selected by the French minister, will be presented with the Biennial Prize for their exhibition, “Art Histoire,” at the Museum of Modern Art in Paris in March 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received $750,000 from the Los Angeles County Council, which represents more than 1,800 local government officials, in late February. The funds will help LACMA continue to expand its collection, which is currently home to more than 600,000 works, and to service the national recall of more than 1,500 works by Joel and Shimon Peres, a Peres-controlled organization that stepped down from $8 million to $4 million to focus on its relationship with LACMA. Todd Gordon, the executive director of LACMA,", "The next Biennial should take place in 2021, at a date yet to be decided. In the meantime, the museum has recently been working on revamping its exhibition space. In April 2019, it opened an entirely new 25,000-square-foot space on the museum’s fourth floor, which will open in 2021. The museum has also started a fund for scholarships and has awarded more than $5 million to twenty-six students in the last twelve months. The fund’s inaugural cohort will receive $500 each. \n\n\nThe Museum of Jewish Heritage (MoH) in New York has received a gift of more than five thousand works by more than sixty thousand African American artists in a major donation from the estate of artist Albert Sidney and the family of Holocaust survivor Mira Sidney. The donation includes works by artists such as Angela Davis, Enoch Graves, C. Lee Coleman, and David Chipperfield, as well as a selection from the family’s collection that includes works by Rosalyn Harrison, Walt Whitman, Harriet Tubman, and other iconic figures in American history.“This is a very special gift for MoH,” curator and director Benjamin L. Buckner Jr. said. “The Sidney", "The next Biennial should be the first in the city since 2006 and will include a retrospective of the work of the four curators from the year 2000, as well as a selection of contemporary works.Duchamp’s art has been collected by the London and New York galleries Sotheby’s, Hardy London, and the National Gallery of Art, as well by the Museum of Modern Art, the Metropolitan Museum of Art, and the Museum of Modern Art, New York. The biennial is supported with a total of £32,000.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has received a major donation of more than 1,000 works from the collections of the French and American artist Emmanuel Léger, who died in 1988. The American organization that received the twenty-first-century acquisitions—the Museum of Modern Art (MoMA) Los Angeles and MoMA in New York—is working with the New York–based nonprofit threatecurity.org to exchange the works and will distribute the proceeds from the sale of the works to trace the origins of the AIDS virus.Dubbed the Léger Triennial, the initiative was launched after the French artist’s death and will celebrate the four", "The next Biennial should focus on “The Last Century.”Though the event will reportedly focus on “the future of art and architecture,” the lineup already includes works by African American artists such as Mary Ellen Larson, Mary Lincoln, and Hosea Alston—all of whom were interracial couples and celebrated their union with gusto.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than four hundred works by fourteen African American artists, including Sally Mann and Elizabeth Peyton, in a multiyear donation of works by the Dorothea Rock series and Dorothea Rockwell. The works, which were given to the institution by Dorothea Rockwell, the niece of Robert Johnson, a black Boston businessman, in 1996, were recently gifted to the MFA by Kenneth Goodman, who has close relationships with both Johnson and his nephews.According to NBC Boston, the works were given to the MFA by Rockwell and her family in order to “ensure the museum’s long-term conservation and future protection of the collection. ‘Being able to have these works in our collection is a huge honor and a huge responsibility,” Rockwell said. “My parents", "The next Biennial should also include a new design by the artist and bring together more than 1,500 artists and writers from all over the world. The theme of the year will be 'In Praise of the Divine.” The full list of participating artists is as follows:ARTISAN:Theater & Performance: Anna C. Di Giuseppe, Berlin, GermanyPinterest, Frankfurt, GermanyOASIS, New York, NY, NY, NY, NY, NY, NY, NY, NY, NY, NY, NY, NY, NY, NY, NY, NY, ARTISAN: Michelle Deb, Detroit, MichiganJuan Luis Faria, Los Angeles, CaliforniaMarlene Guggenheim and Lassen Sculpture Garden, New York, NY, New York, NY, NY, NY, NY, NY, New York, NY, Art Archives, New York, NY, New York, Ny, NY, NY, Art Therapy, New York, NY, New York, NY, NY, NY, New York, NY, New York, Artists & Writers: Ann Radcliffe, New York, NY, NY, Artists & Writers: Cora", "The next Biennial should be held at least twice a year, with the opportunity to go back to the site of the memorial to explore its history and to hear from the wider community. In the event of another tragedy, the organisers will work with the family of the deceased to create an opportunity for a remembrance service. The programme will join the Biennial of New Orleans and the Fourth and Fifth Biennials at New Orleans in 2019 and 2020. “The event is part of our mission to give back to New Orleans and to deepen the bond between New Orleans and the surrounding region,” said Arts Council president and CEO Alex Rieger. “The theme of the 2020 Biennial is resilience, and the themes of our upcoming shows are about how we as a city and as a state need to work together to heal ourselves and our communities. We hope that by working together, we can create a legacy of innovation and creativity for the city.”The selection committee comprised of Robert Sparks, Julie Yurkof, Marisa Halperin, Miri Hartigan, Ivan Kuzma, Roberta Smith, and Scott Wegman. “The committee is thrilled by the", "The next Biennial should be held in 2020.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has welcomed New York–based artist and curator Joonas Hintjes to its board and will formally introduce him as the director of the Terry Riley Center for Contemporary Art (RRC), a newly created nonprofit organization that will invest in the preservation and exhibition of contemporary art in Southern California.In a statement, MoCA said: “We are delighted to welcome Joonas Hintjes to the board. He is a distinguished curator whose work engages with the challenges and possibilities of contemporary art and the lives of contemporary artists, and is a wonderful fit for the Terry Riley Center. Working closely with Michael and Elena, his curatorial team, and the board, Joonas will create a unique model for fostering the collaborative vision and artistic vision of young curators, and for fostering a contemporary sensibility and sense of community.” The announcement follows the museum’s construction last September of the Riley Center, a four-story, eleven-thousand-square-foot facility on the ground floor of the former Kapiolani Indian casino on Van Ness. The center will provide a significant expansion of the institution’s", "The next Biennial should be held sometime in 2020.  The museum will also be preparing to reopen under the new management of its new curator of Asian art, Pilar Corrias, in 2021. The Guangdong Contemporary Art Biennial will be held in 2022, but the date has yet to be determined. The Hong Kong Contemporary Art Biennial—originally scheduled for 2022—is currently on hold due to the Hong Kong government’s decision to postpone the festival. \n\n\nThe Kunsthalle Bonn in Germany announced today that the seventy-third edition of the Kunstbau, which will take place at the historic Bonn-Stiftung in September 2021, is now in the planning stages. The exhibition will be organized in collaboration with the Kunstbau Kunstbau Bonn and will include work by an eclectic group of artists, including Gere Kavanaugh, Jannis Kounellis, Karolina Kuzma, Kei Kawano, Robert Mapplethorpe, and Thomas Rock. The exhibition will be based on the same principles and will be organized in the same manner as the previous two editions, namely in a large-scale setting, with an emphasis on humanism and the environment", "The next Biennial should take place in the spring of 2020; the show will then return to the Italian city of Turin for a third year, and the fourth in May. The exhibition will be on view through March 16, 2020. The exhibition has received a $1.5 million donation from Paris’s French ambassador, Emmanuel Macron, who made the announcement during a visit to Paris in June. The event will be led by Marianne Boesch, director of the Museum of Contemporary Art, Paris (COPP); Olivier Froussau, artistic director of the CNE, Paris; and Sébastien Lemaire, director of LACMA. The first Biennial was held in 1947 and was won by Salvador Dali. “I’m delighted that COPP is working with the French government and the Museo d’Arte Contemporáneo (MAS) to create a series of exhibitions that will reflect the diverse histories and cultures of Europe, Asia, and Africa,” said ART Director-General Marc-Olivier De Monaco. “By organising this exhibition in the contemporary city of Paris, COPP is sending a clear message to the world that", "The next Biennial should be held in 2022.  ArtsPrize:  ArtsPrize is a global platform that gives artists the opportunity to present their work in front of an international audience. The Art in Action exhibition, hosted by the World Institute of Art in Lisbon in 2003, was awarded a prize of $12,000 by the Art Association of the Netherlands in 2016. The exhibition was the first of its kind in the Netherlands and has been a landmark until the start of its fifth edition in 2020.\n\n\nThe Governor of Singapore, Mr Jalan Tun, has appointed Samantha Whittle as the new chair of the National Museum of Singapore (NMS). Whittle will be appointed by the Governor on December 21 and will take up the post on January 6, 2021. Whittle comes to the institution from the National Gallery of Singapore, where she has served as chair since September 2019. She succeeds Elaine Ng, who died last month.“I’ve been meaning to write about the power of art for a while now; I’ve written in great detail about the collection of David Morley’s work, and about how it is a vital platform for challenging and breaking down idols, that", "The next Biennial should be held in 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Julian Alban as its interim director. He will be responsible for overseeing the restoration and development of the institution’s holdings of contemporary art and architecture, including the M.C. and I.G. Farman Collection, and will take up the post May 18–May 19.“Julian has been instrumental in the museum’s transformation from a collection-oriented collection to a more collaborative, research-driven collection, and has been instrumental in bringing MFA’s collections to life as a dynamic collection,” said MFA director Michael Lewis. “His experience and expertise in the contemporary art world and commitment to intellectual partnership make him an excellent leader for our collection as we continue to move into the next stage of our transformation. We look forward to working with him and to the MFA as we move into the future.”Alban succeeds Anne Malcolm, who led the museum for eleven years, and will take up the post after April 4, 2020. Malcolm will remain involved with the institution as it stages the new London-based museum, which will open in the autumn of 2020.\n\n", "The next Biennial should take place in 2018. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of seventy-five works by artists such as Ed Moses, Anselm Kiefer, and Thomas Krens, which were all on display in a thirteenth-century fresco by Johannes Georg Baselitz.This year’s edition of the MFA Biennial—which opened on June 1 and ran through June 3—was marred by disruptions caused by the Covid-19 pandemic, and the museum announced in April that it would move the exhibition from June to July. It also introduced a new platform, the MFA 14/15, that will be dedicated to contemporary art and art history.“The new platform will provide a forum for the exhibition of the artist’s work for the first time, and will allow visitors to experience an exhibition of the artist’s work only on a weekly basis, beginning this summer,” said museum director Matthew Teitelbaum. He added that the MFA’s new programming will focus on “contextual labor,” a theme central to the exhibition.The works, which were donated by artists such as Moses", "The next Biennial should be held in 2022. The first.  The venue has yet to announce plans for the second year, but an announcement for the third and last year is expected next month. The museum is also working on revamping its existing building, which was completed in 1957 and houses the institution. The work, which will be funded with $275 million from the ongoing Marshall Plan, will be unveiled in 2020.  The institution’s current exhibition program, which has featured works by Merry Norris, Frank Gehry, Lee Sachs, C. S. Guggenheim, and Lévy Gorvy, will continue, but will be modified in a manner that will prevent the exhibition from becoming overly “modern” in style. The Biennial will also have a new section dedicated to female artists, with the first show featuring Maria Bochelli and José Luis Borges. The exhibition will also welcome visitors with the purchase of twenty-four tickets. The design of the new space was commissioned by Columbia University and is based on the exteriors of the building. The new structure, which will be twenty-eight thousand square feet, comprises three", "The next Biennial should be held in two years, the organizers wrote on their website. “We are very much looking forward to the next edition. We encourage everyone to explore the biennial as a source of creativity and inquiry, a point of departure for thinking through the future.”The 2019 exhibition “Gina Beavers: From the Field” premiered at the Venice Biennale in May. The show, which featured work by ninety artists, was part of an exhibition devoted to Beavers, which was held in the museum's basement galleries since 2014. The show was curated by Arnold Bode, a former director of the Museo de Arte de Barcelona, and Rob Schloss, who previously served as director of the Metropolitan Museum of Art.\n\n\nThe National Gallery of Ireland (NGA) has also announced the launch of a digital platform that will allow visitors to see and purchase works from the institution. Called the National Curator’s Index (NCI), the service will provide users with a comprehensive overview of the museum’s holdings, with the option of purchasing individual works or a comprehensive catalogue.NGA director Eileen Fitzpatrick said: “NGA has long been committed to supporting curators and preserving their work", "The next Biennial should take place at the museum in 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA), which will host the fifty-eighth edition of the Fifty-Second Venice Biennale, reopened yesterday following a brief setback due to the Covid-19 pandemic. The museum, which has been closed since December, is currently working through a redesign that will increase accessibility, enhance public realm and create more livable spaces. The redesign includes the installation of more contemporary works, including the new “Tic Tac” series, which will be presented by Tracy Leon, the director of the south coast’s Miller Center.The installation, which consists of twenty-four polychrome ceramic tiles, makes up an “epicenter of the city,” according to Los Angeles’s Trevorrow Gallery. The exhibition will draw an additional twenty-two thousand visitors to the museum, which has never before housed the exhibition of a Tuscan master’s work, and will run from September 21 to August 28.“As we began work on this project, we knew that LACMA was a landmark in Southern California,” said designer and founder of Trevorrow Andrea", "The next Biennial should begin with a presentation of the work of the biennial’s curators, and continue with a selection of the artists’ works presented by the biennial’s curators. The exhibition should then conclude with a scorecard of the artist’s performances.The upcoming exhibition “The Fifth Column: Art, Gentrification, and Poverty in New York,” which will take up the theme of housing and gentrification, will be presented by artist-in-residence Rose José Villar and will aim to elicit “anxiety, rage, despair, and anger.” The exhibition will feature photographs, sculptures, performance works, and installations that were created by twenty-five artists, including Anselm Kiefer, George and Catherine Keith, and Murielle Obalil; works by artists such as Tunga and Anselm Kiefer; and a selection of works by collectors such as the Belgian-born and Paris-based collector Yvan Mierle, the founder of the massive private collection Tunga Associates.The biennial will commence with a reception celebrating the twentieth anniversary of the exhibition, which will be followed by a presentation of the first twenty-five works by the", "The next Biennial should be in 2021. The museum will explore the relationship between art and peace and its relationship to the future as we confront the threats of climate change. In the event of its sudden closure, the Art Museum of Chicago and the Getty will maintain their affiliation with the Art Institute of Chicago through 2020 and will participate in other programming, including the biennial “Sustainability at Lincoln Center: A Retrospective.”The Art Institute of Chicago, which recently revealed that it will not be able to afford to reopen in the immediate future, said that it is planning on “aiming for a future where all of our community activities can be supported.” The institution said that it is currently working on developing a new program that will allow visitors to explore the museum’s collection and learn more about its history.  \n\n\nThe Museum of Contemporary Art (MoCA) in New York has announced that a new collection of works by the legendary Italian artist Paolo Barbera will open sometime in the 2020s. The museum’s first exhibition dedicated to his work is “Paolo Barbera: Beyond the Modern,” which will go on view March 29–April 3 at the museum. The exhibition will offer", "The next Biennial should be held in 2020. The Fine Arts Museums (FAUM) in London and the Metropolitan Museum of Art in New York are currently closed due to Covid-19 and will be replaced by new installation and sculpture venues. The Museums Association (MA), which represents the 60+ arts institutions in the UK, has declared war on Covid-19 and is threatening to move forward with its 2020 edition, due to take place in March. On Tuesday, the Association of British Artists (ABPA), a coalition of arts groups, began a campaign to raise £10 million to protect the cultural sector against the novel coronavirus, which has infected more than 120,000 people in the US and Europe, and to establish a fund for the construction of new infrastructure to help struggling British businesses and small arts institutions. The campaign, launched by the British Film Institute (BFI), the Institute of Contemporary Art, London, and others, aims to pressure the government to commit to providing $100 million in aid to British cultural institutions in the first year of the coronavirus pandemic, and to launch an emergency fund for artistic workers as a matter of urgency. The BFI estimates that as many as 80,000 people", "The next Biennial should be held in December 2020, and the 2020 edition will be at the Institut des Arts et Lettres (Ile-de-France), the Museum of Modern Art in New York, and the Museum d’Art Contemporain in Paris.The 2019 edition, titled “Agriculture, Politics, and Society,” was held at the Museum of Modern Art in New York and the Museum d’Art Contemporain in Paris. The 2019 edition was curated by Andrew Hancock, curator of modernism and Western painting at the Museum of Modern Art in New York. The exhibition was also presented at the Venice Biennale in 2020.The 2020 edition, “Inside the Art of Life,” will be curated by Lisa Littman, director of the Museum of Contemporary Art, New York. Hurricane Florence, which made landfall on November 25, caused massive loss of life and property damage in Italy and the Republic of Venice. The Italian government declared a state of emergency and the capital city of Venice declared a state of emergency as well. The Princely State of Venice, which includes Venice and Venice, is currently working on a plan to aid the millions of people displaced by the storm", "The next Biennial should be called the Art and History of Art, this time in the city of Haifa. The first edition of the event was held in 1990 and featured works by seventy-three artists. The second edition was held in 2018 and featured seventy-three works by forty artists. Since the first edition was held in 1941, the 2017 edition was not historically accurate.  The 2020 edition will be held in 2021, with a budget of $275,000. The theme of the 2020 edition will be “Humanity and the Body,” and the twenty-first edition will be “Roots and Decolonialism,” a term coined by the festival to refer to the diverse strands of spirituality, philosophy, and activism that emerged from the work of the late Egyptian philosopher and activist Ahmed Salah. The theme of the 2020 edition will be “Occupy.” The artist-run space Projecta will be inaugurated.\n\n\nThe Art Newspaper reports that the London-based nonprofit organization Save the Children has decided to pull the plug on a ten-year program that gives more than 1,500 UK children short-term foster care. While the children have received $133 million in support of their foster care", "The next Biennial should begin as soon as possible. We are monitoring the situation and will take all necessary measures to protect the teams and the event.We will continue to support the teams and their work, and will work with the authorities to help them adapt their workflows to meet the demands of the next exhibition and the new climate.\n\n\nThe National Geographic Society’s (NGS) $250 million expansion into the Smithsonian’s National Museum of African Art is slated to open next month. The new venue will host two additional exhibitions, one each centered on the African diaspora, and will boast a museum’s largest collection of African art ever assembled. The construction of the center, which will sit in a former coal mine in the Appalachian Mountains in Shenandoah, Virginia, has been underway for more than a decade and is expected to cost an estimated $250 million. The National Museum of African Art is one of three new institutions being built by the Smithsonian to bolster its collection of African art. The others, the National Museum of Women in the Arts and the National Museum of African Art, are currently under construction in Atlanta and Washington, DC, respectively.\n\n\nThe Centro de Fabricas Artes (CAFA) in Madrid", "The next Biennial should take place in the Netherlands at the Bibliothèque Nationale de Holland. Other artists and institutions that have expressed interest in the exhibition include Eden Ofosu, Cécile Boudreau, Eliot Housmans, and André Breton. The exhibition will run from March 19 to March 21. The ninth edition of the annual Biennial will run from March 20 to March 21.The 2019 edition, titled “Second Life,” honored artists and artists' practices who have been inspired by virtual worlds. Among the works that were presented were photographs by Alexander Calder, the Dutch photographer best known for his drawings, sculptures, and collages, which address issues such as loneliness and identity; paintings by Sri Sri Ramakrishnan, the Himalayan shaman who lived in Baroda for forty-five days in May 2019; and many photographs by artist Shelby Simpson. “The 2019 Biennial is a reflection of the universal fascination with virtual worlds and with the universal rights of artists to create,” said Erma Barlow, chair of the biennial commissioning committee. 'The work of the artists who participated in the exhibition is a reflection of the", "The next Biennial should take place in 2021. Similar events have been held in the past, but the modern-day edition will take place across a number of venues, from the Art Institute of Chicago to the Museum of Contemporary Art San Diego. In an attempt to be inclusive, the 2019 edition featured just fifteen artists.Artforum will update this article with more information as we hear more.\n\n\nAs the first major art event of the year turns fifty-six, the Art Newspaper in New York has released its annual The Art Newspaper Visual Art Book. The book, which is based on a six-year survey of the art of the fifty-five years of the magazine, was commissioned by Marc Jacobs and is divided into twenty sections. The sections include “Cold and Hot,” “Clamp and Seal,” “Remote Viewing,” and “Sensuality and Sensuality. . . .” The publisher will initially publish the book in April, and the first copies will be sold on April 21, with the first print run of fifty thousand to follow.“The Art Newspaper Visual Art Book comes together as one huge, beautifully made-for-digital-only quadrille,” said author Peter", "The next Biennial should focus on the history of flight and explore the work of aviators, including the importance of the art of flying in the seventeenth century. The exhibition will also highlight contemporary issues such as climate change and migration, which are central to the theme of the biennial.The theme of the biennial is “Flight and the Arts: The Biennial of Modern Art” and will be addressed by artist-actors Sam Palladino and Josephine Windhoek, who are co-operating artists in an exhibition titled “Freedom of Flight” (BOLOGNA), which will open at the Venice Biennale in September. The exhibition will include forty works by forty artists from thirty-six countries.Esther Wegman, who founded the Los Angeles-based nonprofit Art Resili, said: “This is a very exciting time to be a visual artist in Los Angeles. We have landed in the golden age of the medium and can now look forward to a truly revolutionary future.” The biennial will be hosted by the Los Angeles–based nonprofit Art Resili and will be co-organized by Peter and Susan Levine, who launched a nonprofit in 1998 to support visual artists in the city. The show", "The next Biennial should be held sometime in 2020. The organization hopes to organize a series of exhibitions in the downtown area such as the forthcoming exhibition of work by Swedish artist Anna-Alysona Eriksson. The first show, titled Tales from the City of God, is slated to open in March 2020. The event, which is being organized by the New Art Museum, will be hosted by the Kassel-based organization Kassel+Smaller Inns, which was founded by Nari Ward in 2015.\n\n\nThe California native, who recently announced that she is stepping down from the helm of Los Angeles’s Metropolitan Museum of Art (MMCA) to pursue new opportunities, is reopening the institution in December 2019. Since its closure since March 13, the museum has been open only seven days a week and has been plagued by a series of delays and cancellations.“I am so grateful to the City of Los Angeles, the staff and patrons of the Met, and especially to my predecessor, Richard Lebel, for guiding us through these challenging and challenging times, and for the extraordinary work we did to turn around a museum in five years,” said Annuca Guggenheim, chair of the board of", "The next Biennial should be held in the fall of 2020. The museum is currently working toward establishing a $10 million endowment to support the development of the exhibition. In addition to the annual exhibition, the museum is working to make the series more accessible by expanding the museum’s public viewings rooms to include additional research materials and by adding additional galleries. It is also planning to create more than two hundred community spaces in the museum, including an area for education and public engagement with the exhibition.In a statement, the museum said: “The new Biennials reflect the heart and soul of the City of Portland and the state of Oregon. Equally important, they reflect the city’s commitment to ensuring that our city’s arts are accessible to all, while still having an impactful and meaningful impact on the neighborhoods and communities we serve. We hope you will join us in welcoming these new and exciting exhibitions into the city’s cultural life.”\n\n\n\n\n\nCoo-Chun Tsang, a Chinese artist, sculptor, and educator, died on Tuesday at his home in Shanghai. He was seventy-two years old. Born in Shanghai in 1943, Tsang studied at the Academy of Fine Arts", "The next Biennial should take place at the museum in 2021. \n\n\nThe University of Central Florida (UCPF) has received a donation of more than fourteen thousand photographs by American photographer Chester A. Morgan. The work, which was taken in the late 1940s and early 1950s, will be donated to the university by the artist’s widow, Annie. The gift includes more than thirty thousand prints by Morgan, as well as hundreds of photographs of subjects such as his late wife, Rosemary, his daughter, Mary, and his son, Chester, who are credited with some of the earliest works to be found in the collection.“Over the years, the university has always been a strong supporter of the collection,” said Elizabeth Adams, chair of the department of photography. “Through this gift, UCPF has made clear that it views the collection as a cornerstone of the local community and as a source of inspiration for future generations. We are grateful for the university’s encouragement and support over the years.”A selection of the donated works will be presented at the museum’s upcoming exhibition “Photography and the Archives: The Collection,” which will open on May 15. Wearing the portrait", "The next Biennial should be held at the new site in 2022.\n\nUPDATE: March 15, 2:00PM\n\nA spokesperson for the Biennial told Artnet that the dates for the exhibition have yet to be finalized, but that it will take place from December 18 to December 20. The event will be hosted by the new site, the Museu de Arte de Madrid, and will be supported by the Spanish Ministry of Culture, the Ministry of Education, the Universities' Association and the Spanish Ministry of Science and Research. The venue will be inaugurated by a special exhibition of work by artist Radiata Oriá-Giról, which will be preceded by a presentation of work by artist Pablo Picasso.\n\n\nThe New York artist-run space Gallery4All in New York City has announced its representation of the European artist Wilhelm Reich. The gallery will bring his work, which is currently on view in the exhibition “Wobblies: An Introduction to Alt-Modernism” at the Museum of Modern Art, to the city in February 2020. The show, which explores new media and modernist practices, is curated by Wangechi Mutu and features work by twenty artists, including Luigi Baratta, Jospe", "The next Biennial should be held sometime in the 2020s.\n\n\nThe Fine Arts Museums (FAIM) in London have been awarded a total of £12 million from the £30 million Royal Shakespeare Company (RSC) grant, which was established in 2015 to protect the important Shakespearean works at the institution. The organization’s board of trustees has decided that the grants will fund the restoration and renovation of FAIM’s current exhibition space at the National Portrait Gallery (NPG) in London, as well as a new stage for the company’s annual production of Hamlet at the National Theatre in 2021, and a new public installation, The Disquieting, at the St. Andrew’s Church in St. Paul, in 2022.The grants will also enable the institution to continue to develop its master plan for the National Portrait Gallery, which was commissioned by architect Sir James Dyson and was completed in 2005, and to move forward with the assembly of the first group of disciples in the history of the museum. The first group, made up of the works of Edward Hopper, Robert Mapplethorpe, and Edvard Munch, will open in 2020 and will be followed by the", "The next Biennial should be held in 2020. The exhibition will focus on “the intersection of culture and politics,” the organisers said.\n\n\nThe Museum of Fine Arts (MFA) in Boston has announced that Kate Ramsey will lead the institution’s “star-studded” art events. Ramsey, who is currently president of the Department of Arts and the Creative Economy at the Smithsonian American Art Museum in Washington, DC, will assume the role from Kate Fowle, who has served as interim director of the museum since February 2019.“Kate has been instrumental in forging MFA’s current unique and forward-thinking way of thinking, and has been a champion of artists and the creative process throughout her leadership of the institution,” said Mary Anne Evans, chair of the board of trustees of the Museum of Fine Arts, adding that she “has been instrumental in making MFA’s history books, organizing exhibitions, and putting artists first,” and that the museum’s future is “inextricably tied to the work of the many outstanding artists of our time.”\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Peggy Brodsky", "The next Biennial should take place in the spring of 2020.\n\n\nThe Museum of Fine Arts (MFA), Boston, has appointed Robin Montgomery as its next chief curator, effective immediately. Montgomery will assume her responsibilities in January 2021.“Robin is highly regarded in the field of modern and contemporary art and has led museums since 1994, when she was promoted to chief curator,” said Elizabeth Manning, chair of the museum’s board of trustees. “Her reputation is prolonged by her extensive curatorial experience and her commitment to expanding and deepening the MFA’s collection, exhibition, and education programs.”In her new role, Montgomery will work closely with Betsey Griffith to present the museum’s collection in a manner that will enable it to continue serving as an important public gathering space for Boston and the surrounding communities. “In a time of climate catastrophe, I’m excited to continue to develop MFA’s collection, educate visitors about the art of the twentieth century, and continue to thrive as an arts and culture destination,” said Montgomery. ”Commenting on her new role, Montgomery said: “I’m really looking forward to working with the MFA staff,", "The next Biennial should include the first public exhibition of work by the LaChaudhuri-Berthold Collection, a collaborative exhibition of contemporary art and a collaboration between the Italian and French artists.The festival will also host a symposium on the history of photography, the history of the medium, and the future of photography, which will be organized by the same team as the biennial. The event will be hosted in Florence.Museums, cultural centers, and historical sites of the Biennale de Trieste will be named after the artists who participated in the triennale, with the focus on a shared memory of the events. The artists selected for the exhibition will be chosen by a committee comprising the director of the LaChaudhuri-Berthold Collection, Claudio Giunta, and artist-in-residence Giulia Barbosa. The artists will receive a prize of €1,500.“We are deeply delighted that our new partners in the cinema will be the same as the artists, and that this year’s exhibition will be an exhibition of their work,” said Cristina Calchi, president of the Triennale de Trieste. “We are also thankful for the cooperation and solidarity of", "The next Biennial should focus on the interconnections of art and technology in Brazil and the world today. The event should draw from the biennial’s programming and the biennial’s collection as well as from the public’s efforts to engage with art and technology in the Brazilian context.”The first edition of the festival, titled Episode 1: Art and Technology, was held in January 2019. It was hosted by the Foundation of Arts and Technology, the Secretaría de Culturas Curas, and the Secretaría de Culturas do Povo, and was organized in partnership with the Museo da Arte de São Paulo (MASP), the Museum of Modern Art in Brasília, and the Museo de Arte de São Paulo.\n\n\nThe $35 million restoration of the 19th-century mansion where the late British artist Louise Bourgeois spent her final years and was buried is currently at work in Paris. The project, which has involved the excavation of sixteen foundations, has also involved the restoration of 45,000 objects from the estate, including works by Bourgeois’s favorite artist, René Magritte, a drawing by Pierre-Auguste Renoir, a painting by Pablo", "The next Biennial should be established in 2021. It will focus on the life and death of artist-made works in combination with the arts and culture and will feature a retrospective of the work of the same artist in a prominent contemporary museum.The exhibition, titled “The Life and Death of Walt Whitman” will open at the American Folk Art Museum in Los Angeles on September 20 and will run until November 21, 2020. The biennial will be held at ten locations in the Los Angeles area, including the Los Angeles County Museum of Art, the Museum of Contemporary Art Los Angeles, and the Museum of Contemporary Art San Diego.The biennial will also present a special retrospective of the work of Joan Miró, the founder of the contemporary art movement, in a museum exhibition organized by the Museum of Modern Art in the fall of 2020. The show will introduce the artist’s work and will be curated by Ti West, director of the Art Institute of Chicago.Commenting on the theme, West said: “Walt Whitman is an icon of American creative life. An artist whose work is celebrated and protected by so many who have followed in his footsteps. He inspired artists to speak out and create in ways unknown to them. As the biennial is about", "The next Biennial should take place at the Norman Foster Museum in Manchester, England, in 2022. (Originally scheduled for March 22–March 29, 2022.)\n\n\nAfter the United Kingdom voted to leave the European Union, British Prime Minister Boris Johnson said that he expects the country will be keeping its \"red cards\" for visitors by the end of the month. While the government is planning to welcome some 2.5 million visitors to the UK from June 26 to June 28, the number will likely be much higher once restrictions on travel are eased. As of Thursday, April 11, there were about 153,000 visitors in Britain. The UK has approximately one million residents but only a fraction of the 2 million visitors expected to flock to the country. [Update: April 12, 10:50 AM] \n\n\nAs New York City heads into Phase 5 on Monday, April 16, for the reopening of its massive Central Park, the park experienced a major power outage on Thursday, April 13. Banks and businesses throughout the city were forced to close Friday, April 14, as crews worked around the clock to restore power to the area. According to the New York Times, more than one hundred industries were impacted as power was restored to only a few of the", "The next Biennial should also include a “real vision,” Wang said. “With a real vision, how do we care for the Japanese people, the Japanese art, the Japanese culture, and the Japanese people’s way of life.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to shutter its doors in mid-May. On Tuesday, the institution shared with attendees a statement about the current state of the arts, stating that it will be “taking a comprehensive, year-round approach” to programming and will be “working hard to find a solution that best meets the needs of our current and future audiences.”Construction on the museum’s Pacific Palisades campus is currently underway and is slated to be completed in 2020. The center will include an exhibition house, a research library, a performing arts center, and a meeting room. The announcement of the center was made in conjunction with the opening of a new collection of contemporary art, “Pacific Palisades: Art and Science” (May 23–June 22), organized by the curator and curator of modern and contemporary art, Kelly T. Anderson, and curated by David Z", "The next Biennial should be held in 2020.\n\n\nThe Palazzo Prada in Venice has received a gift of twenty-nine works by thirty-one artists\u0097including two works by Bertrand Goldberg, which were recently given to the museum for the first time. The donation was made by Antonia Bertrand to the institution for the first time in 2015, when the first edition of the museum’s Bertrand Goldberg Exhibition was held there.The gift includes works by Alban Berg, Alberto Cantuari, Cosmo De Witte, Anton Kern, Anna Laudel, Bertrand Goldberg, and Benedict Clement, as well as works by Yinka Shonibare, Alfred Yecher, and Petar Nordqvist, all on paper, and Yoshitomo Nara and Rintoul, both on canvas. The works will now be displayed in the institution’s new exhibition hall, the Palazzo Prada, and will be available for viewing at the museum’s annual event, the Fondazione Prada biennial in May 2020.Bertrand Goldberg was born in Italy in 1941. In 1952, he", "The next Biennial should be held in Melbourne in 2020 and will include entries from twenty-three countries, including Bulgaria, France, Germany, Italy, the Netherlands, and Slovenia. The theme for this year’s event is “Unleashing Power: Art and African Politics,” which was inspired by the exhibition “A2: A2: Art and Politics.” The 2019 Biennial, organized by the Nairobi-based nonprofit organization Art Place (APE), featured works by twenty-five artists, including Autashanti Ndzube (2018), Dalila Mabaso (2011), and Kader Attia (2018), among others which were submitted by Cara Catto, Diana Al-Hadid, Kia Koga, Kehinde Wiley, and Michael Cory.\n\n\nThe National Museum of Scotland, the National Gallery of Art, and the Royal Opera House have received a major donation of over $3 million from businessman and philanthropist Nicholas Winton. In recognition of his generous gift, the institution is launching a new £3 million fund to support its arts and culture, with the aim of doubling the amount of funds it can raise through the Arts and Culture", "The next Biennial should be held sometime in 2020, and the next one in 2021. A third and final edition of the exhibition will be held in 2023.“I’m excited to partner with the hundreds of artists and designers who have made an impact on the exhibition in recent years, and to bring their work to life with the Los Angeles–based architects,” said Roberta Brown, chair of the human resources department at the Los Angeles County Museum of Art and architect of the new space, the Museum of Contemporary Art Los Angeles (MCA). “In order to do this, we had to take a more radical approach to the structure of the exhibition, and that has resulted in a few changes to how we present works. The exhibition will be organized in three phases, each of which will consist of three independent experiences\u0097a sculpture by Andy Warhol, a painting by Felix Hausmann, and a video by Jeffrey Gibson\u0097and will open in January 2021.”The first of the three phases, “The Expressionist Balance,” will debut in March 2021. It will feature works by artists including Alice Neel, Elizabeth Peyton, Johannes Klee, and Ermanno Olmi. The second phase,", "The next Biennial should be announced in late June. \n\nShare this: Facebook\n\nTwitter\n\nGoogle\n\nPinterest\n\n\nSeth Rogen and James Franco, co-directors of the biennial film festival, have revealed that they are collaborating with director Douglas Slocum on a new project based on the life and work of Edward Hopper. They will direct and create the biennial film, The Art of the Body, with Slocum sometime next year.Slocum, who will be seventy-one when he embarks on his project, said he is \"looking forward to being able to work with Adam and Eve again.” Slocum, who would have celebrated his sixtieth birthday in 2021, said that the project will be a “bridge between the two of us.” He hopes the project will bring together artists, collectors, critics, and other biennials across generations as well as explore the work of women filmmakers.Slocum’s first film, Avant-Garde Cinema: Avant-Garde’s Rome, reproduced the ephemeral and the work of Edward Hopper and his contemporaries, including Jean Graf and Jean-Pierre", "The next Biennial should take place in 2022, and the full list of participating arts is as follows:\n\nAcademia 1700: Walter de Maria, SpainStudio: Universitat de BarcelonaWhitechapel GalleryLondon: Stuart Rooney, England University of London: Clara, United Kingdom (studying under the name Francis Drake’s daughter) Netherlands: Claudia, Netherlands (licensee of the artist’s has expired)Events in Barcelona and Madrid FRANCE: Claudia, France (licensee of the artist’s has expired)\n\n\nThe Art Newspaper reports that the Association of Independent Art Museums (AIM) in the United Kingdom is preparing to launch a new fund, AAM, that will provide $1.5 million in assistance to cultural organizations and individuals who face financial difficulties due to the Covid-19 epidemic. The news comes on the heels of the AAMC, a coalition of arts organizations, launching a fund for artists and arts workers in the United Kingdom, and coincides with the launch of the AAMC Arts Relief Fund. The fund will distribute $1 million to help struggling arts organizations.“", "The next Biennial should be called After Life, a collaboration of Artforum, the Art Newspaper, and the Art Newspaper Review, and will be curated by Maren Hassinger, a curator and art historian who has worked with the artist since the 1960s. The theme of the biennial is “Life as Art,” a question that has vexed Hassinger for years. “I have wrestled with the question of life as art for as long as I could remember,” she told the Art Newspaper. “I’ve been thinking about life as art for almost forty years, and it’s always been my chosen theme. I mean, why not make the most of a life that is so full of promise and possibilities, but one devoid of violence, cruelty, or despair?”\n\n\nThe Museums Association (MA), a United Kingdom–based advocacy organization, has launched the #SaveArtistsCampaign, a nationwide campaign to preserve artistic and cultural heritage in the interest of artistic freedom. “This is a pivotal moment for us, as a society, as a planet, and as a species,” Paul Mpagi Sepuya and Nan Goldin, the heads of the", "The next Biennial should take place in 2020, and the Art Biennial in 2022. Next year, the next edition of the Art Museum Houston will host a new exhibition, “Toward a Future that Shapes Tomorrow,” and the next exhibition at the Art Museum will be “Beyond the Frame: Contemporary Art and the American South.” The biennial will also include a new play, “Unfinished Business: Art and the American South,” and a new film, “The Art of Silence” (2019).After the biennial wraps up in 2021, the museum will begin its decade-long plan to revamp its historic building, which will include the construction of a new visitor entrance, a larger auditorium, and a new courtyard. The $7.5 million project will also include the renovation of the existing art at the museum, which is currently under construction. The project will also introduce the biennial to the city of Houston and will introduce a new group show for artists.\n\n\nThe British pavilion at the Fifty-Ninth Venice Biennale, which featured Damien Hirst, Christa McAuliffe, and Steve McQueen, will receive a donation worth $328 million from the estate of the", "The next Biennial should be held at the end of May, in the first weeks of June. “We are aware of the concerns of a number of artists who have expressed their concern that the safety and well-being of their families and how they will cope with the coronavirus were we not to open our biennials in the middle of the pandemic,” said Pace. “It is our intention to work with the artists and their families to help them plan for and plan for a possible closure of the biennials.”In addition, a selection of works by popular and established artists will be displayed in a special exhibition, “Sydney in Motion,” at the Museum of Contemporary Art Sydney from March 18–March 20, 2019. The exhibition will consist of twenty-seven works, selected from a group of thirty artists whose work is often grouped under the designation of “artists” and will be on view in the exhibition “Sydney in Motion” through October 3, 2020. The exhibition will also feature works by artists such as Michael Clauss, Joan Jonas, David Kuk, Wangechi Mutu, Winnie Tam and others who have had significant breakthrough", "The next Biennial should be held sometime in the 2020s. “I hope that the Biennial will become a defining moment of the twentieth century, as a time of massive cultural exchange between the United States and Europe,” said Mitchell Bech, chair of the museum’s board of trustees. In addition to awards, the museum will host more than twenty thousand exhibitions, including a new exhibition on the artworks of Ed Moses, a trio on the history of photography, and an introduction to the history of the museum. The biennial will also draw on a collection of more than three hundred pieces from the artist’s archive. The winner of the $100,000 award will be announced in the fall of 2020. \n\n\nThe Israeli government approved a budget for the next academic year that allocates $76 million to the Palestinian territories, the West Bank, and the Gaza Strip; and on Wednesday approved a bill that will allow Israel to expand its military presence in the territories. The legislation, which was passed by the Knesset, the Israeli parliament, on Wednesday and requires the government to put forth a new bill by the end of the month, and Israel captured the West Bank and Gaza Strip in 1967.The bill", "The next Biennial should be held in 2021. \n\n\nThe Metropolitan Museum of Art in New York has appointed Kathrin H. Bauer as its next executive director. She succeeds Steven Davis, who departed the institution in March 2019 after nearly a decade at the helm.“Kathrin’s leadership and strategic vision, combined with her deep understanding of the museum’s audience and leadership, makes her an ideal candidate for the Met’s board of trustees,” Charles A. Mayer, board president and CEO of the museum, said in a statement. “Over the course of her twenty-year career, she has been instrumental in shifting the museum’s trajectory and developing new initiatives while maintaining its strong and enduring aesthetic legacy.”Bauer will succeed Carol Schmitz, who retired in March 2020 after twenty-seven years with the Met. She will assume her responsibilities on August 1.“At a critical time when the Met’s leadership needs to reassess its future, we are fortunate to have Kathrin on board as we embark on our next chapter,” said Jonathan Lukens, the museum’s executive director. “We look forward to working with her to ensure", "The next Biennial should take place in December 2019.\n\n\nThe National Gallery of Canada announced today that it has appointed Sara Epstein as its next director. The first woman to lead the institution, Epstein succeeds Nigel Godfrey, who retired in October 2019 after fifteen years at the helm of the museum. She succeeds Kate Purchase, who took up the post less than a year ago.“We are excited to welcome Sara to the team,” said Allan Lutz, the director of the National Gallery of Canada. “In her seventeen years at the helm of the National Gallery of Canada, she has developed and executed innovative and ambitious projects that have been supported by the National Gallery of Canada’s collection. At the same time, she has continued to expand the museum’s collection and collection-building for the National Gallery of Canada, with projects such as the Andrew Kreps and Elgin Marbles project and the James Randi/Octopus series.”Elinor Crowley, the director of the National Gallery of Canada, said: “With her deep experience and commitment to improving the collection, Sara is poised to further develop and strengthen the museum’s collection as a model for how a museum should work. The National Gallery of Canada", "The next Biennial should be a combination of academic and social and will be open to the public, organisers said. The biennial, which was originally scheduled to be held in the middle of May, was rescheduled for August 2019. The 2020 event will be held at the Suez Canal in Egypt, the port in which the exhibition will be staged. The 2020 edition of the Berlin Biennale will be staged between February 21 and February 22. The event will be hosted by the Wasserstein- and Neue Staadt Berlin-Baltimore, and will receive coverage from the German government, the Federal Association of German Cultural Institutions (BKA), and the BKA’s Berlin-Baltimore affiliate, the BKA Berlin-Berlin. The biennial’s inaugural edition, which was held at the Museum of Modern Art (MoMA in New York) in June 2019, received a standing ovation from the more than five hundred guests who entered the venue in protest of MoMA’s decision to pull the plug on the exhibition and its associated program. Among the critics who spoke out against the decision were Paul Mpagi Sepuya and Elin Schoelkopf, who called the exhibition", "The next Biennial should take place at the end of April 2020. “During the exhibition, we will present ever-changing exhibitions aimed to reflect the current cultural and social realities of the country, and we will continue to give the international audience a new and exciting glimpse into Asia through our exhibitions,” said Biennial director L.A. Wang.The exhibition will be organized as follows: The Exhibition is an extension of our globalization strategy. We are working to integrate art, science, and technology across borders to promote the shared values of openness and creativity in diverse cultures. The exhibition is organized in collaboration with all the participating artists and institutions. “We have achieved an important milestone and created a new, second exhibition for the Biennial, which has been especially important to our exhibition team,” said Biennial director L.A. Wang. The exhibition will close on March 31, 2020 with a special exhibition of the exhibition. The show will be hosted by the National Gallery of Arts in Beijing and will be on view until December 15, 2020.\n\n\nLydia Donnelley has been appointed the director of the National Museum of Scotland. During her tenure at the institution, which has a total of fourteen galleries, she will oversee the development", "The next Biennial should be held in 2020.\n\n\nCultural historian, curator, and scholar Susan Adams has been named the twenty-third president of the National Endowment for the Arts (NEA) in an election that took place earlier this month. Previously, the thirty-two-year-old New York–based writer served as president of the Rhode Island School of Design (RISD) in Newport, Rhode Island.Adams is the latest in a string of African American arts professionals to assume the Trump administration’s senior leadership positions. In the past, Obama and former secretary of education Arne Duncan have been prominent supporters of art and education. Duncan served as cochair of the NEA’s 2019–20 cycle, and he announced his intent to resign from his post following the November election.Duncan’s successor, Mary Anne Tuberville, will assume the role of chair. Tuberville will be responsible for training the leadership team. In the meantime, Adams serves as chair. While the California native has taught women’s, African, African American, and contemporary art at several institutions, including the Rhode Island School of Design, the New York Academy of Art, and the Metropolitan Museum of Art, she has had", "The next Biennial should be held in 2022.\n\n\nAs the coronavirus continues to spread across the globe, museums and cultural sites are preparing for a possible shutdown or curtailment of their public activities in an effort to contain the virus. The United States Centers for Disease Control and Prevention (CDC) has warned Americans to prepare for a public health emergency as many states and local governments move to ban large public gatherings and public travel, and as schools and other public spaces around the country close.According to the New York Times, at least six states have enacted emergency bans on large public gatherings and have suspended or reduced back-to-school travel plans. Meanwhile, in California, Governor Jerry Brown signed a bill this week that will cut off funds to anti-vaccine groups that promote unsafe vaccines.The California Air Resources Board (CARB), the state agency charged with regulating the air quality in California, has also cut funding from anti-vaccine groups. According to the Los Angeles Times, the agency will lose $50 million when it shuts down its air quality monitoring programs next month. Meanwhile, the number of cases of the virus has risen in California, leading the state to announce that March 16 will be the last day it can officially see 36 cases of the coron", "The next Biennial should be held in 2020.\n\n\nThe Ford Foundation, the Ford Art Museum, and the Museum of Contemporary Art (MoCA) in Los Angeles have released new guidelines for the sale of works by artists whose works are currently in storage. The guidelines were developed after the institution received several complaints about the condition of works by Chicago-based artist Michael Kelley, who died in 1975, and were published by the Ford Foundation and the Ford Art Museum, respectively.The Ford Foundation and the Ford Art Museum have partnered to offer free admission to visitors to the museums on Saturday, March 16. On March 13, the museum exposed its collection by presenting “Michael Kelley: Commune”—a retrospective staged by Michael Kelley and Larry Gagosian in collaboration with the artist’s daughter and the artist’s son, respectively. This exhibition marked the museum’s first public tour of the works since the artist’s death.Commenting on the exhibition, Brown said: “A retrospective of this scale, this rich history, and this amazing collection of his works, which includes works that have never been presented before or since, and that have never been in public view, is a great opportunity to open our new galleries", "The next Biennial should be held at a location that has on hand the necessary resources, including water, electricity, and a network to support the exhibition and the exhibition, and should ensure that other possible locations for the exhibition are carefully considered. The Biennial should be the nucleus of a larger cultural program that would address the issues of biohazards, climate change, and the environment.”Other recommendations in the letter include the establishment of a national strategy for sustainable development, the establishment of an online portal for the exhibition, and the development of an education platform for young artists and their families. The letter also demands that the Biennial be made available to the public for free, that the exhibition be curated by local artists, and that the budget for the Biennial be reduced by fifty percent.The letter concludes by asking that the Biennial be declared a success. The organizers have not yet responded to the letter.\n\n\nNew York governor Andrew Cuomo has signed a $2 trillion spending bill that will provide $1.2 billion in aid to New York City’s arts and cultural sector, including $750 million for the Arts and the Creative Economy Fund, a $250 million cash grant program that will allow local, state,", "The next Biennial should be announced soon. \n\n\nJim Hill, a MacArthur Fellow, is suing the company that owns the American art publisher Simon & Schuster—over the publisher’s decision to pull a Christie’s auction of a painting by American artist Alice Mitchell. The lawsuit, filed in a federal court in New York on February 3, accuses the auction house of violating the Sherman Antitrust Act by refusing to pay royalties to the artists who donated the work, and of violating the Sherman Anti-Trust Act by withholding payments for years.“When Simon & Schuster acquired Christie’s, it began by negotiating with the artists to see if they would extend the life of the work by Alice Mitchell,” Hill said in a statement. “The artists agreed that they would cease making works based on Mitchell’s name. The agreement was agreed to by both parties. However, when the artists returned the work to the publisher they found the work in a state of disrepair and in disarray.”Among the damage claims are the artists’ inability to release the work from its storage facility in Stony Brook, New York, and the artists’ physical loss of the work. According to the New York Times", "The next Biennial should be held sometime in the 2020s.\n\n\nIn a new survey of contemporary life conducted by the New Museum in New York, fifty-two curators from twenty-three countries were selected for the 2019 edition of the \"Spaces\" exhibition, which aims to draw attention to the contemporary world through a combination of art, design, literature, and pop culture. Conceived as a platform for international exchange between curators, the 2020 edition will include a retrospective of the work of the Dutch-born, New York–based artist Marina Gabor and a solo exhibition of work by Chinese-born, New York–based artist Rintoul Ma. In the survey, which was released yesterday, twenty-seven artists were nominated for the 2019 prize. The shortlisted artists are Amber Al-Hadid, Andrea Bertoloni, David H. Wilson, Tanya and Peter Brown, Cécile B. Chen, Kathleen Claussenijn, Osei Dey, Merete G. Gass, Marcin Hiltherek, and Mario Tama, and are among those who collectively won the $10,000 prize.“The biennial will present an international story of the artist’s work, and", "The next Biennial should be held in 2021. The announcement comes a decade after Nirvana’s 2013 and a year after Nirvana’s fellow artists Bjorn Akken and Alexander Black organized a 'biofilm' exhibition at the Museum of Modern Art in New York, which was staged entirely by the artists. The show was entitled “The Death of Film.”The exhibition was intended to be a sort of “psychological autopsy” of the medium. It featured more than eighty photographs and fourteen unheard works, including work by the late artist and activist Erik Satie and splashes of color by Rosalind Russell.Nirvana, who passed away in 1995, was a pioneer of the visual arts and a powerful force in contemporary American art. Born and raised in Brooklyn, she studied at the Brooklyn College School of Art, where she met her husband, the Swedish filmmaker Vassil Coleman. Together they founded the group New York City’s avant-garde, and in 1984, the year of their first exhibition in the city, the group moved to Peter Schiff’s New York gallery. That same year, she began her series The Twilight Zone. Inspired by the", "The next Biennial should be held in the spring of 2021, the organizers said.\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced that it is saving millions of dollars by eliminating the museum’s main building, the Linda and James L. Knight Foundation, and is working toward reopening the institution in the fall. The institution, which was completed in 1967 and is a core member of the Los Angeles City Museum, is currently undergoing a $2.5 billion expansion designed by the French architect Yazif Meral, who designed the museum’s dome and the rest of its interior. The expansion project is expected to be completed by 2021 and will add 33,000 square feet to the museum’s existing outdoor space.A statement released by LACMA reads: “In order to reduce the museum’s operating costs and to achieve a similar degree of conservation, LACMA is instituting an ‘allocation freeze’ on all operating costs. This is not a new strategy, but LACMA’s is the only one that will guarantee that its future programming will not be impacted.” According to the Los Angeles Times, the L.A. County Museum of Art", "The next Biennial should take place in the spring of 2021. The first will take place at the Museum of Contemporary Art (MoCA), in New York, in April. The museum plans to open the first exhibition, “Unmade: Art from the Böhm-Bawden” in 2021.\n\n\nThe Mercedes-Benz Museum in Beijing has welcomed ten new members to its curatorial staff. The museum welcomed three new members to its staff last year, and in 2014, the museum had three new members come aboard in its current staff. The new ten-member team is: Lieutenant Colonel Xu Fan, who will be responsible for the development of exhibitions and public programming; Yang Marking, who will spearhead the teaching and research of Chinese art in Europe; Zheng Xiaojing, who will be responsible for exhibitions and public programs in China; Tao Fan, who will oversee the expansion and development of the museum’s collection and education programs; and Masumoto Yamashiro, a curator and art historian who will work with the new team to enhance the museum’s current exhibitions.“The new group additions represent a new phase of the Museum of Contemporary Art in Beijing, which has been", "The next Biennial should be held in 2020, when the institution will celebrate its thirteenth anniversary. The theme of the upcoming exhibition will be “Theologians,” which will feature a selection of new works by twenty-four artists gathered under one roof. The next exhibition will be the 6th New Art Biennial, which will present a selection of shows by thirty-five artists gathered in the heart of London. The next exhibition will be “Theology and the Body” (2019), which will showcase works by guests curated by John Baldessari, the artistic director of the London-based Modern Art Museum. The next exhibition will be “Theoretical Forms: The New Art, 1890–1910” (2019), organized by the New Art Archive, London.\n\n\nThe National Galleries of Scotland announced today that its gathering of more than three hundred artists to celebrate its centenary has been rescheduled for June 30, 2020, and will now take place in August. The event, which will date back to 1919, will feature artists from thirty-nine countries and will have a budget of $11 million. According to the National Art News, the entire project will be", "The next Biennial should be in 2021. “The project has been a long-term goal of the designer and has involved her designing from a design perspective in a way that has never been attempted before,” said Joachim. The project was inspired by the work of German architect Rainer and the development of the concept was grounded in the artist’s belief that the public spaces of every city should have a story, a character, and a history that should be told through art.Signing off on the exhibition, which was curated by architect Anton Kern, the curator said: “I’ve had the privilege of working with and collaborating with the talented Anna-Marie Graham for the past thirteen years. Her work is a great inspiration to me as I make decisions at a time when I am trying to design the future in large public spaces. Her conviction in the future and the art that is created in the present are incredible. Her work is an example of the truly exceptional artist−designer partnership between Berlin & the Netherlands.”\n\n\nThe City of Cambridge, Massachusetts, has appointed Brittney Johnson, the director of the River Arts Center, as the next director of the new River Arts Museum in Cambridge. Johnson succeeds Susan", "The next Biennial should be my last.” In an interview with the Art Newspaper in January 2019, the artist said that he was planning to leave the museum when the next edition of the Düsseldorf Biennale, scheduled for March 2020, fell through. He also admitted that planning for his exit was complicated by the recent coronavirus epidemic, which has affected a global population of twenty-six million people.“After the coronavirus epidemic ended, I wasn’t sure how I would use the Düsseldorf Biennale to start a new chapter with the rest of my life and family,” Van den Bergh told the Art Newspaper in a recent interview. “It would have been a shame to have had to take the tomb with me when it opened in 2022.”\n\n\nArtist and activist Radical Black Box Society (RBS) was founded by Njideka Akunyili, Kader Attia, and Lulani Mabaso in 2011 to advance the Black Lives Matter (BLM) movement in the United States. The group runs a series of artistic and educational initiatives including the annual Radical Black Box, a Black Art Summit, and Art Talks", "The next Biennial should be held in 2021, and the event should be open to the public. The selection committee comprises Julie Fries, founder of the Berlin-based arts organization Protart; Markus Hauser, director of the Berlin-based Felschalian Museum; and Peić Koepa, director of the deCordova Museum in São Paulo, Brazil.Artists from all over the world have been invited to participate in the 2020 edition of the museum. The exhibition will be hosted at the Biennale in Essen from May 7 to May 9, 2020 and will feature works by seventy-three artists. The exhibition’s first section, “Between the Sun and the Moon,” will showcase work from the collection of Martin Pusztai, director of the Berlin-based Pusztai Galerie. The exhibition will be followed by an exhibition of works by forty-five artists from twenty-two countries.“The 2019 Biennale was a success during a time when the exhibition scene in Germany is undergoing a great transformation,” said Eugen Grete, the chair of the exhibition’s artistic director. “The future of the exhibition scene in Germany is therefore very serious", "The next Biennial should take place in 2021 and will be hosted by the Center for Contemporary Art, Los Angeles. The twenty-fifth and twenty-sixteenth editions of the award show will be staged by the Museum of Contemporary Art, New York.A selection of the biennial’s work will be presented at the 2019 LACMA Film Festival. Its American exhibition “The Rise and Fall of James Bopp: Avant-Garde Art” will be presented at the 2019 LACCA Art Museum Galería Maytana’s “Defender,” curated by Argentine curator Diego Barozzi. The twenty-seventh Biennial will be held at the LAX Museum of Art.\n\n\nThe New York Public Library has announced that it plans to offer its entire collection digitally, with no physical copy, in an attempt to improve accessibility for millions of people who have limited means or access to digital technologies. The move is part of the city’s rethinking of its public institutions, which have been undergoing a major redesign since 2015, and is part of a larger overhaul of the public cloud.When the library acquired the holdings of the Josiah Nickels and Richard and Eddora Nelson family,", "The next Biennial should be in 2020. \n\n\nThe San Francisco Museum of Modern Art (SFMoMA) is trying to expand its reach into the arts by collaborating with a group of artists, manufacturers, and other cultural institutions to produce a new work by French avant-garde artist Vincent van Gogh. The initiative, which will run on a rotating basis and will take place in the city 2032, will focus on the history of the artist’s work and will aim to present a vision of the future as a biennial museum.Its new platform, called the Future Museum, will be a collaborative media project that will include a series of exhibitions that will be curated by SFMoMA staff and will feature works by artists such as Mark di Suvero, Pierre-Auguste Renoir, Rachel Whiteread, and John Akomfrah, among others.SFMoMA, which was founded in 1969 by artist-in-residence Jean-Marc Goosse, is planning to forego the annual visit to the museum to focus on its future. The institution is planning to open a new ten-acre campus on the waterfront next month. The move was made amid the ongoing construction of the museum’s new home,", "The next Biennial should take place in November 2021, and the project will be inaugurated by a special exhibition, “The Waters and Times of Sitaram Godfather,” at the New Museum in New York, which will stage the first show in the series. The new biennial will be on view through October 24, 2020.\n\n\nThe contemporary art museum Guggenheim, in collaboration with the Berlin art center Bessarabend, has received a gift of some five thousand photographs from the artist Alexander Calder. The work is a new collection of photographs by Calder and was created in collaboration with the collector Michael Meiner.Established by Guggenheim in 1936, the museum is currently home to two Calder works, “The Polar Express” (1963) and “On Water,” (1987). The works will go on view in the gallery on October 24.“The gift we are most proud of is that the works are acquired by someone who has made an irreplaceable contribution to the Guggenheim’s collection,” said Michael Meiner. “The photographs, which will be on view in the gallery, are the foundation of a new and exciting exhibition, ‘", "The next Biennial should be held in 2020, and the earliest of the seven proposed dates will be 2022. \n\n\n\n\n\nAccording to Artnet, a new survey of the work of eighty-four artists currently on view at the Biennial, which will run from October 23 to October 26, 2020, has revealed that seventy-one percent of the approximately 1,500 works on exhibit at the exhibition are of little or no interest to the public. The survey, titled “Artists on the Verge of Deleting the World,” was conducted by the Artforum digital magazine, and analyzed the work of eighty-four touring and established artists. When asked to identify the painters most associated with the exhibition, the artists voted for Nos. 1,2,3,5,6, and 7, and they chose their own.Among the works listed are works by Kwame Kwei (The Dog on the Ground), Juan Carlos Paez (A Boy on the Moon), Ed Moses (A White Tree), Yoko Ono (A Red Balloon), and Robert Irwin (The Crash into the Sun). Of the forty-five works currently on view, fifty-four were selected by the participants for their “most immediate cultural impact.”", "The next Biennial should be held in 2021. The next will be held in 2021. Last year, the institution’s director, Pilar Babay, said: “The last two years have been very, very hard. A lot has changed, but the most important thing is that we are still here. . . . We will do everything to stay. We have to focus on the art, and the art is good.”\n\n\nThe MCAF Maastricht Museum in the Netherlands, which has been working to move to a new location in the city, has announced that it is closing its doors at the end of the month. The museum’s director, Marija Kokkonen, said that the final exhibition of its seventy-two-year history has been moved to a new building at the Maastricht Castle. The museum will reopen in the fall, with an opening in the spring.Kokkonen was working to put together a new exhibition for the museum, which has been located in a former coal mine, in the spring of 2018. The project was completed in May. The exhibition “Tale of a Hero”—a collaboration between renowned Dutch painter Joost Vermeer and the", "The next Biennial should take place in the capital, Bangkok, in the Spring of 2021. The first incarnation of the event, held in March 2019, was attended by more than 200,000 people.The 2019 edition featured works by ninety artists, including Alice Aycock, Haroon Mirza, Tunganisiket, Yuka Iguchi, and Ajit Ghosh. In addition, a host of other artists, including Hamza Walker and Nari Ward, participated in a retrospective of their works at the Art Gallery of New South Wales. Only the first work from the show was selected for the prize, which was announced by the museum, which was founded in 2015, and was chosen by a jury comprising members from the north-eastern states, Australia, Canada, France, Germany, the Netherlands, and the United Kingdom.  The 2019 winners were: Amiti Karoli, Nodong Zang Yilu and Zhongguo Zangmu, New South Wales, Australia; Anupam Gupta, Georgia; and Ajit Ghosh and Haroon Mirza, India. The biennial will be held at the Art Gallery of New South Wales, Sydney; the National Gallery of", "The next Biennial should be held in September 2020. \n\n\nThe museum in the Spanish city of Valencia, which has since been transformed into a UNESCO World Heritage site, is planning to hold an exhibition of works by the Venezuelan artist Hermelindo Leyva in September 2020. The venue is also working to increase the exhibition’s reach across the globe.Leyva’s work, which was exhibited at the Museum of Contemporary Art, Los Angeles (LA), and the Museum of Modern Art, New York (MoMA), among other museums, was recently selected for a Turner Prize exhibition in London. The work will be presented in the museum’s collection and will also be included in a new exhibition, “Olivia Nuzzo: The Other Natasha” at the institution. The show will also include photographs from the show and will be inaugurated with a virtual reality work by the artist, which will be recreated in-person.The museum has also announced that its acquisition programme for works by the Venezuelan artist will be expanded from three years to six years.  \n\n\nThe 2017–18 academic year—which was marked by a number of major setbacks and setbacks of all sorts—is nearly upon us. As", "The next Biennial should take place in 2021 with a construction start date of 2022. \n\n\nAs art-world executives and politicians around the world meet in Beijing this week to discuss the possibility of limiting the growth of the Chinese art market, the region is also trying to mitigate the impact of the coronavirus. On Tuesday, China declared a public health emergency and banned large-scale gatherings of more than seven thousand people. The country also announced plans to impose a nationwide 24-hour cooling off period for large gatherings and to encourage people to conserve energy by reducing stock exchanges and air-conditioning units.The measures have had mixed success so far, with some cities, including Beijing, shutting down their air-conditioning units and air-conditioning-turned-cooling-off points, as dozens of thousands of people—including celebrities and politicians—showed up to protest the move on Tuesday. In response, Beijing has shuttered the air-conditioning units and has urged people to conserve energy by not using them. Meanwhile, the Chinese government has been working to lessen the impact of the coronavirus on the health of its citizens, issuing a series of public health warnings and providing free, one-time-use samples for people who want to avoid being", "The next Biennial should be held in 2021.\n\n\nFormer Tate curator Sally Walker, who oversaw the exhibition “Diana” (2019), has died at the age of eighty-two. Walker, whose work spans both photography and art, was instrumental in establishing the institution as one of the most important centers for contemporary art in Britain and the United States. She was also one of the first to use the term “art” in reference to photography, an early step toward establishing a formal relationship between Tate and the British National Gallery, which also operated from the Victorian era through the 1970s.“Sally Walker had a wonderful, almost ghoulish, sense of humor and a very sense of humor about everything,” David Sedaris wrote in a review for Artforum in 2018. “Her gift for creating new worlds, for introducing work that was previously unknown to a large and devoted audience, for steering the art of art, and for creating unexpected connections with people she met through art, is unparalleled.” Walker was born in London in 1940. She studied at the London School of Economics, the University of Oxford, the School of the Art Institute of Chicago, and the University of California, Berkeley. Her paintings, prints,", "The next Biennial should be a platform for the voices and work of artists that are creating in their studios, and should host their work in an urban setting in an attempt to generate new dialogue for contemporary culture. As we look to the future, and to a future set in which art and ideas will be part of the fabric of life, we express our appreciation to our European colleagues who have been instrumental in the development of the Biennale programme and to our European partners for their cooperation.”\n\n\nThe Metropolitan Museum of Art in New York has announced that it will begin allowing visitors to its campus in the city’s Financial District, which is currently inaccessible to the general public, to enter the institution through a new, elevated entrance on the first floor, known as the Butterfly Gardens, on August 31. The date was chosen as it was selected as the theme of the seventy-third edition of the Metropolitan Museum of Art’s Diagonal, which opened on March 19, 2019. The entrance will be located in a building designed by the French architect Bénédicte Savoy and comprises twenty new pavilions, each with an exhibition area of twenty-six, arranged in a triangular configuration, which will provide visitors with an additional twenty-", "The next Biennial should be held in 2022. This year’s award ceremony was held at the Centro de Artes in Madrid on October 15.\n\n\nThe University of California, Los Angeles (UCLA), has announced that it will not be reopening to the public until at least January 7, 2021. When UCLA reopens, it will be following a 180-degree turn since it moved from Los Angeles to Pasadena in 1980. In a statement, the university said: “We received a lot of positive feedback from visitors to our new home, and we couldn’t have asked for any better partners to help us shape the new future for UCLA.”The university added that it is “committed to ensuring that UCLA can continue to thrive as an international leader in the arts, sciences, and technology, and will continue to work closely with all of our partners to support their mission to make UCLA a world-class institution.”The university’s new headquarters, the UCLA Memorial Union, opened on November 9 and will be completed by March 16. UCLA’s existing buildings at 2135 E. 57th Street and the plaza are undergoing a $4.5 million facelift, while the institution�", "The next Biennial should be held in 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the reopening of The Museum of Modern Art (MoMA), in the city from April 29 to May 3. The guidelines, which were written by the DCLA, outline what types of events and activities can be held at museums, and how visitors may enter the institution.The DCLA states that the institution is expected to be open by April 25, with tours beginning April 21, and that the public is welcome to visit. However, it cautions that “[MoMA] is undergoing a major renovation that will likely result in a very different environment for the thousands of visitors who have come to see art and culture.”The guidelines state that MoMA’s new glass-enclosed lobby and galleries will be a “challenge to the conventions of modernism” and warn that “[MoMA] is not equipped to host the thousands of visitors that were invited to visit during the renovation and to consider how an outdoor space might work better.”The guidelines go on to outline the procedures for museumgoers entering the museum, and include several suggested activities that can be completed by visitors", "The next Biennial should have been held in the year 2020 and will be held in the city of Zagreb. The exhibition will focus on the history of art in the city, which is located in the so-called Black Sea, and will be held within the walls of the city, known as the Academy.The opening of the exhibition was postponed due to the ongoing Black Square protests in the capital. The protests have been ongoing since December 19, 2016 and were sparked by the former prime minister, the current president, and the former president of the republic, Andrej Milosevic, who is currently serving a twenty-month sentence for war crimes. The protests were sparked by stories told by artists and activists about the conditions in which the exhibition was supposed to take place. Among the activists who spoke out against the exhibition is the artist and curator Maria Zdravo, who created the exhibition “Ace of Spades” and “The Body in Architecture”; Nadezhda Tolokonnikova, an artist and founder of the preservation research and organization the collection center of architectural and design works in Moscow; and the architect and designer Dmitriy Strelkov, who was also detained by the authorities on suspicion of inciting", "The next Biennial should be held in 2022.\n\n\nTwo years after an Italian agency put out a scathing report about the state of the art at the Museo di Riceroche in Florence, the public prosecutor general in Turin has opened an investigation into the decision-making process behind the work. Francesca Battista, the Italian minister of cultural heritage, announced the opening of an inquiry in March 2021.The investigation will be led by Lucia Brugotti, the commissioner for the acquisition of works in the State of Turin, and will consist of six interviews. The first will take place in January 2022, the second in March 2022, and the third in April 2022.Battista said: “The aim here is to analyse the acquisition process in a way that is comprehensive. It is important to do this in a way that does not simply focus on the works, but also to think about the cultural heritage and the artistic heritage of the region.”The findings of the investigation will then be reviewed by the Minister of Culture and Sport and the new Chairman of the State Council, Pier Carlo De Angelis. Battista added: “In the interest of the public and in order to ensure that the work of the Ministry of Culture and Sport is", "The next Biennial should be held in 2022, and the 2019 edition was hosted by the Swedish National Museum. Both exhibitions were held at the Swedish Museum of Modern Art in Stockholm. The first Biennial, titled Biennial of the Four Seasons, was on March 31–April 4, 2019. The second, titled Biennial of the Four Seasons, was on April 3–April 5, 2019. The final exhibition of the two biennials, titled After the Fall, was on April 16–April 22, 2019.The selection of the artists for the 2030 edition of the biennial will be made by Nina Hjortenberg, head of the department of art at the National Museum Stockholm, and Lina Lidén, curator of modern and contemporary art at the Art Institute of Chicago. The biennial will be held at the University of Southern Denmark (Uda’s Bjorn-Udd/Udd Olms Museum) in Copenhagen.\n\n\nThe museum has received a gift of more than 1,600 works by Kiki Smith, the Italian American artist who has been called the father of modernism and a towering force in the field of color photography. The large-scale work, which is part of a series", "The next Biennial should consist of the following shows: Associations Françaises (2021), Art Evolved (2019), Autobiennials (2019), and Untitled (2019). There will be a total of eighteen shows in total. The theme of the upcoming exhibition is “NIRIN,” a reference to the legendary Hindu goddess of light. The exhibition will also feature the work of Lotte Anhama, who has won the Prix du Palais de Tokyo twice: 2009 and 2011. The biennial has also faced the inevitable cancellation of the 2020 edition, and has been held at the Guggenheim for the last seventy years. The institution’s current president, Klaus Biesenbach, said that the reopening of the 2013 event was “the most important date in the biennial’s history.” The opening of an exhibition of NIRIN’s work is currently scheduled for the second half of 2020. The next exhibition will be held at the Nationalgalerie of Art, Vienna, and will be organized by the National Galleries of Art and Architecture. The exhibition will include artworks from the collection of the National", "The next Biennial should be held at least ten years from now, and will be composed of forty articles, each lasting at least three years. The exhibition will bring together the curators of forty different collections; seventy-three artists, including Arne Glimcher, Charles F. Neeson, Katharina Fritsch, and Wolfgang Lüpertz; and the worlds of art and architecture. The biennial’s theme will be “The Present.” The artist-run exhibition will also include the installation of the work The Empty Chair, 1995–2018, which is a meditation on the artist’s role in creating and maintaining an ongoing relationship between objects and the world. The work will be on view throughout May and June. \n\n\nThe Museums Association (MA), the UK’s professional body for museum professionals, has released guidelines for educators and other cultural workers who wish to avoid work-related travel during the coronavirus pandemic. The guidelines come as museums work to re-open following temporary closures due to the virus.The MA announced the guidelines on Monday, February 26, in a letter addressed to educators by the Association of School and College Museums (ASC). The letter states", "The next Biennial should be in the spring of 2021. \n\n\nThe Sheffield Book Fair announced today that Eva Dyson is now the inaugural winner of the £50,000 Emily Hallam Award for Fiction. The award is given annually to a British writer in the current publishing season. The biennial will be held at the Sheffield Performing Arts Centre in Sheffield on March 3. Dyson, a British writer living in New South Wales, Australia, has won three awards since she was nominated in 2016: Winner of the Emily Hallam Prize for Fiction in 2017, the 2019 Benedictine Medal for Art for Literary Writing, and the 2019 Guggenheim Medal for Literary Art. She has also been a finalist for the Turner Prize, and has been a finalist for the Laurence Olivier Prize, the London Independent Book Festival, and the Rabkin Prize for Literary Art, among other awards.\n\n\nThe Center for Art, Design, Technology, and Change (CADT) at the University of Illinois at Urbana-Champaign, which is housed in an old industrial building on the campus of the University of Illinois at Chicago, has been purchased by the city of Champaign for $3.5 million. The acquisition includes three"]