["The next Biennial should take place at the Institut Max Meyers-Witten from March 13 to March 14, 2020. The institution has awarded six biannual grants totaling $2,400 to classical, contemporary, and modern musicians.The prize will be awarded in two installments, both of which will be held at the Kunsthalle Basel. The first biennial will be held at the Kunsthalle Basel from March 14 to March 16, 2020 and will feature the work of around forty artists. The second biennial will be held at the Museo de Arte Contemporáneo, São Paulo from March 16 to March 20, 2020. The biennial will comprise works created either before or after the invention of celluloid. The winner of the prize is adjudged by an international committee comprising eminent artists and biennialists; musician Marta Gómbara, artistic director of the Museo de Arte Contemporáneo; the artist and curator Dario Carbonell, director of the Museo de Arte Contemporáneo; and the architect Franz Halberstadt.The first biennial, “Diana and Henry” (2019), was staged at the Muse", "The next Biennial should be held at the National Museum of History in Düsseldorf, Germany, in 2021. Cultural Historian Jan Steger, who co-chaired the 1911 biennial, said: “It would be a good start to a new exhibition series and to a new collection.”\n\n\nThe second edition of the Fifty-Eighth Venice Biennale will be held in the city of Venice from February 23 to February 26, 2022, and will feature works by fifty-four artists. The event will take place at the Pieri and the Paolo Cattelan in Venice and will be presented by the Museo d’Arte Contemporanea (MAN), which was founded by former director Roberto Cavalli and architect Roberto Cattelan in 2000. The event will be hosted by the Venice Architecture Foundation (CAF), the Palazzo di Rivoli, and the SESAREA and will be inaugurated by the artist Carolus Loschmidt’s installation [Demonsong] in the gallery, which will open on the first floor of the Palazzo di Rivoli on February 18.“We are thrilled to announce the theme for this edition", "The next Biennial should include a selection of work from the contemporary collection that is set to open in March 2020, with the goal of providing an opportunity for the public to feel the gestures, sounds, and sights of this extraordinary and diverse world. The first two exhibitions are currently on view at the Royal Academy of Arts (RA), London, and the Museum of Modern Art, New York, and will be presented by the CAA Foundation in collaboration with the artist-run cooperative Goldsmiths.The first exhibition, “The Work of Art,” will tour the collections of the museum, including the eight works currently on loan to the Biennale, and will feature the works of thirty-two artists, including Artsajya Devi, Tufnell Graves, Christo, John Griswold, and Hirishakshi Ho. The exhibition will also include a discussion group with twenty-three artists who are collaborating to create a new work for this exhibition. The second exhibition, “The Biennial Project,” will present a selection of works that were created in collaboration with the Lambda Literary Festival in New Delhi, as well as a selection of newly commissioned works by seventy-nine artists in Italy,", "The next Biennial should focus on the history of the museum’s collection through the introduction of new exhibitions, an online exhibition platform, and an instruction center. It should also showcase the works of the biennial’s artists. The theme of the upcoming edition will be “Africa” and will be decided by a committee composed of Karolina Wojtas, director of the National Gallery of Art in Belo Horizon, and Ahmed Abou-Rahma, director of the Al-Azhar Museum of Art. The biennial will take place in two instalments, “In the Land of the Mammoth” (2018) and “The Land of the Chimps” (2019).A selection of works by the artists who were included in the exhibition will be presented in the exhibition “Africa”’s “The Land of the Chimps” (2019) and “The Land of the Chimps II” (2019). In the first part of the exhibition, a selection of works by women artists from Africa will be presented. In the second part of the show, a selection of works by artists from South Africa will be presented. The artworks will be accompanied by", "The next Biennial should be held in 2020 and will be held at the South Florida Museum of Art.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the opening of new art galleries and museum spaces in the city. The guidelines were developed following a three-year inquiry into what the city can and should do to support new artistic ventures.“DCLA is committed to supporting the city’s arts and creating new opportunities for New Yorkers to connect with and see art,” Dermot F. Giuliano, director of the DCLA, said. “Through this three-year inquiry, we have come to the conclusion that there are several critical steps the city can and should take to support the cultural life of the city. The recommendations support the city’s ability to generate income through the sale of art, to increase consumption of art, and to encourage the exhibition of art.” The guidelines were developed by the Cultural Affairs and Preservation Council (CAC), a public-advisory body that consists of thirteen city departments, including finance, transportation, and utilities, and is chaired by Mayor Bill de Blasio. CAC previously developed similar guidelines for the construction of public housing", "The next Biennial should be held at the new London outpost of the Tate. “The work that is about to be shown in the exhibition is extraordinary, the degree of its ambition and scope unprecedented, and the production of the exhibition itself an incredibly important project for the city,” said Vincent van Amsterdam, director of the Biennale and Metropolitan. “This is the moment. It is the time to do something. This is a terrible moment to be a tourist in London. It is a moment of great uncertainty. But I am sure it will be worth it.”The announcement came a day after a group of artists, including Jean-Michel Basquiat, John Akomfrah, and Jean-Michel Tabet, signed a petition in support of the museum’s move to Tate, which will expand from 1,500 acres to 8,400 square feet and house the exhibition for a full year. The petition calls for the museum to remain in its current location while the redevelopment of its surroundings is carried out, and asks that it continue to be housed in what the petition describes as “the most beautiful building in London’s art world.”Tate has stated that the redevelopment plans include creating a", "The next Biennial should take place in the spring of 2021.”The next iteration of the Biennial will be held in the spring of 2022. The date for the next edition of the Art Basel, which was originally scheduled for March 23–March 26, 2022, has yet to be announced.The 2020 edition of the Bali Art Prize will be held in the city of Bali from March 5–March 9, 2021. The 2019 edition of the prize was held in the capital Bali from March 13–March 21, 2019.The 2019 membership fee for the Bali Art Prize was $50,000, and the 2019 prize was awarded to the next best artist in the gallery. The 2019 prize jury announced the nominees for the prize: ArtsPrize, a production and performance troupe in Bali, Indonesia; the artist-run art space Guardian Gallery in Bali; and artist-run art space Bali Art Gallery. The artist-run space Bali Art Museum is currently closed. The 2019 prize jury announced their nominees for the prize: Kurtis Flor, an East London-based artist based in London; Murtaza Farah, a Bali-born British artist based in London; Ge", "The next Biennial should focus on how art and artmaking intersects with current events and our changing world. I am sure that this year’s will be a powerful representation of the art of the past.”A collaboration between the San Francisco Museum of Modern Art and the Miami-based artist Laura Owens, at its opening in 2017, showcased work by twenty-four artists. A selection of these works, which were co-curated by the San Francisco museum and Miami-based artist Laura Owens, showcased in the museum, as well as three works by contemporary artists—Karl Lagerfeldt, Alice Pousette, and Macky Suss.\n\n\nThe Metropolitan Museum of Art in New York has appointed Carrie Panetta, the director of the museum’s Asian Art and Design program, as its new director. She succeeds David H. Koch, who has helmed the museum since 2000, and will begin her new role on November 1.Prior to joining the museum, Panetta served as the chief curator and head of the Asian Art and Design program at the Huntington Library in New York. During her tenure, she curated a number of exhibitions, including “Singing Japanese: The Korean Till Japan, 1893,” (2018", "The next Biennial should take place in 2021. More information about the 2019 event can be found on the National Geographic Society’s website.\n\n\nThe Museum of Contemporary Art (MoCA), Minneapolis, has commissioned artist and artist-in-residence Tarek Salloul to create a new works for its upcoming exhibition “Unseen: The Future of Art in the City.” The show will feature twenty-one works by twenty-six artists, including Sam Gill (Crown and Color), Sadek Treboux (Tolbach Gallery), Yinka Shonibare (Groups Gallery), and Mihai Shapiro (Museum of Contemporary Art).“The exhibition will be ‘unseen’–conceptual,” said Sarek Salloul. “What we are creating here is a moment of change, of dismantling the framework within which we live, and of creating a new relation between the artist and the city.”The full list of participating artists is as follows: 1. Sam Gill (Crown and Color)2. Gernard and Enzo Giuliano (Fine Arts Projects, New York)3. Alejandro García Bernal (UON", "The next Biennial should be held in the spring of 2021. \n\n\nThe International Council for Museums (ICOM) in Geneva has announced that it is suspending its 2020 edition, titled “Annie,” at the Museum of Modern Art (MoMA) in New York, after the institution received two suspicious death certificates from Tehran. The certificate, which were issued by the Ministry of Health and the Iran Interior Ministry, declared that the artist was suffering from “serious poisoning” and “had been under medical care for at least six weeks.”The cancellation of the exhibition comes after MoMA confirmed that the manner of death was double-suicide, and that the twenty-six-year-old victim was wearing a face mask and breathing through a ventilator. The death of the artist is one of the most recent high-profile casualties in an ongoing crackdown on dissent in Iran, which has been exacerbated by the coronavirus pandemic, which began in Wuhan, China, in December, and has been sweeping the country since March.The ongoing crisis has also exacerbated concerns about the future of the International Criminal Court (ICC), which has repeatedly been pressed to take a hard line against Iran and has stated", "The next Biennial should be the first of its kind in the Pacific. Its theme will draw from memory and the Global South, and the artist-led work of indigenous artists, and will be a representation of the global north—a region that has historically been excluded from public discourse and has been historically marginalized.” The eighty-second edition of the Biennial, which will take place in Los Angeles in October 2021, was organized by the Los Angeles–based nonprofit the Los Angeles Foundation for the Arts (LAFO) in partnership with the Los Angeles County Museum of Art (LACMA). The event, entitled “Sensations of Life,” will include work by fifty-four artists, including Kiki Smith, Félix Hernandez, Arturo Uribe, and Jodi Vinetic.\n\n\n\n\n\nThe Italian artist Mauro Armitani, whose facial expressions softened and his body language reimagined American pop culture through his muscular body movements and his deceptively beautiful paintings, died on August 6 at the age of seventy-nine.Founded in the southern city of Padova in 1959 by Armitani’s wife, Lucie, Lucie was pregnant with their first son at the time and had to", "The next Biennial should take place in 2024. The exhibition will take place in the former exhibition room of the Museum of Modern Art (MoMA) in New York and will be organized as follows: (1) Artist-in-Residence (2) Baroque Theater (3) BASELLO (4) Cocurated by the artist-in-residence, Anne-Marie Morey, the biennial will consist of two phases. Phase one will include the creation and the exhibition of a new work by the artist-in-residence. Phase two will focus on the development of her practice and the exhibition of a work by the artist-in-residence as part of the upcoming exhibition “BASELLO.” The biennial will mark the artist’s fifty-fifth anniversary. Morey will lead the biennial’s eight-person team, which includes curator Sarah Wieder, artist-in-residence Stephanie Bucher, and director Micah Thomas. The exhibition will be curated by Frances Morris, the curator of photography at the Museum of Modern Art in New York. The exhibition will open at the Los Angeles County Museum of Art (LACMA).", "The next Biennial should be held in 2021, and the twenty-seventh in 2022.\n\n· The museum’s collection has recently been the subject of a series of exhibitions, including “Revolution of the Eye,” which ran at the Museum of Modern Art in New York from June 29 to June 30, 2019 and “Theater of Operations,” which opened in the National Geographic Society’s headquarters in Washington, DC, in October 2020.\n\n\nThe 2015 biennial of the United States art world was marred by a shooting that took place on Friday, March 5, at the National Museum of African Art in Washington, DC. The incident, which occurred during the exhibition “Theater of Operations: The Gulf Wars 1991–2011” (which was organized by the Center for American Art, the Metropolitan Museum of Art, and the Metropolitan Museum of Art), led to the cancellation of the forthcoming exhibition, which was to open March 5, at the Mall of America in Atlanta, which was also hit by an act of terrorism last week.While the museum has not yet said whether any one of the six individuals who were taken into custody in connection with the events of the past few days will face criminal charges, the", "The next Biennial should be held in 2022, and its theme should be “The Transformation of the World: From Land, to Land, to Land.” The 2019 event, “Beyond the Window: Palestinian Art and Politics” was staged at the Museum of Modern Art in New York and was staged in conjunction with “Art & Architecture” and “Moving Mountains: Landscapes, Landscapes, Landscapes.”\n\n\nThe French Ministry of Culture and Sport has appointed Alexandre Bichat, a curator and longtime art critic who previously worked as head of the international program at the National Museum in Paris, as the new director of the Fondation de France (FoF). Bichat will assume his post on January 3.“Throughout his career, he has demonstrated an outstanding talent for producing high-quality exhibitions with contemporary artists and raising the profile of contemporary art,” said Laurent Bauman, chair of the Fondation de France’s board of directors. “Bichat is an excellent choice for the position, both in terms of his knowledge and his ability to understand and support the strong and ongoing interest in the work of French artists, and I am very happy to", "The next Biennial should take place in the fall of 2019. \n\n\nGreek artist Katerina Papadimitriou has won the 2019 Càtès-Salvador/Càtès-Neuf Contemporary Art Award. The $10,000 prize was given by the Càtès-Salvador–Neuf Contemporary Art Foundation (CSNF) in honor of its work in the field of contemporary art. The recipient, Greek artist Panagiotis Papadimitriou, was selected for his installation “The Dreamer in the Dream Land: Madre, Ille, Ille,” which will be exhibited in the Greek pavilion at the 2019 edition of the Venice Biennale. The work, which was created in 2017, was suggested by the museum of art in Athens, the city of which Papadimitriou is also a founder.The art critic and curator presented her work in the exhibition “Live From: The Last Days of Athens,” which will be held at the Athenian archaeological site in the summer of 2020, and will unveil the full list of the 2019 winners at the Càtès-Salvador–Neuf Contemporary Art", "The next Biennial should be held in 2020. At that event, six hundred artists, academics, and collectors will be chosen from twenty-five countries, with the theme 'Beyond the Limits of Time and Space,” and the performance will be held in the city of Biennale di Museo di Milano (BIM).For this exhibition, the Italian architect Paolo Bandini—who cofounded the firm Wangechi Mutu, the Italian firm behind the forthcoming Rome 2020 project—will design the entry for the exhibition, which will be staged in the Milan Armory, the Rizzoli di Santa Maria di Prado, and the Palazzo Beccaria. The exhibition will take place in the first half of December. The exhibition will be hosted by the Milanese cultural institution the Palazzo Beccaria and the Italian architectural firm Paolo Bandini. The exhibition will be divided into twenty-four sections, each of which will include a different artist and a different way of looking at the world. The first half of the exhibition will be dedicated to the work of Todos, a trio of young Italian artists who are known for their wise and affecting comic drawings, and will open on January 25. The next part of", "The next Biennial should be held in 2022. The biennial will be hosted by the new Museum of Contemporary Art (MCA), which is currently under construction in downtown Helsinki.The Finnish government signed a ten-year, $44 billion contract with Danish firm Design+Art in September 2019. The partnership marks a major shift in strategy for the country, which has traditionally focused on building new works in partnership with individual artists and institutions. Instead of orchestrating a series of exhibitions or catalogues, Design+Art will focus on launching a new platform called Artpartisi e. 7, which will be hosted by Helsinki’s design center Bergenkolanet (BAM) and will be funded with a capital of $4 million.The project was conceived as part of a wider plan to shift to a more decentralized model of government. During construction, the BAM building will house the museum’s collection of more than twenty thousand works, a permanent exhibition space for the collection, and a library. The MCA will be transformed into a research center and Maastricht University, where it will be located for a period of ten years, and will host a series of exhibitions.The new museum is being built in a former industrial area in central Helsinki and", "The next Biennial should be held in the city during the second half of June 2019. The 2019 Biennial is being curated by the art world veteran, Chris Isaak, a curator and writer whose award-winning projects include the exhibition “Crossing the Rubicon: Contemporary Art from the 1970s to the 1980s” at the Museum of Modern Art and the American Contemporary (AC MCA).The 2019 Biennial will feature work by sixty artists, including Anton Chigual, Dario Catellani, Agustín Castelan, Cécile B. Sánchez, Bénédicte Fortimer, and Andreas Fedorova. The full list of participating artists can be found on the Art Basel website.\n\n\nThe National Endowment for the Arts (NEA) has released guidelines for the distribution of $3.5 million in funding from the Sargent’s Daughters, the $2.5 million that was awarded by William Jefferson Clinton in 2017, in the wake of the coronavirus pandemic.The guidelines, which were released on June 4, outline the distribution of $3 million from the Sargent’s Daughters in the following categories: arts", "The next Biennial should include a program of exhibitions, lectures, concerts, workshops, and other activities that reflect the spirit of the work.”The inaugural exhibition, “Unseen: Art and Resistance in Southern California,” will open at the Museum of Contemporary Art Los Angeles (MoCA) on September 16 and will run through December 14. The festival will feature twenty curators from twelve countries, including Denmark, Finland, Iceland, Japan, Korea, Mexico, and Portugal, and will focus on “primitive spirituality and the cultural production and radical imagination of indigenous peoples,” the museum said.\n\n\nThe United Kingdom’s culture and arts secretary, Maria Miller, announced today that she plans to introduce new legislation to protect cultural sites and collections in England and Wales from the proposed £9.8 billion Black Lives Matter (B.L.M.) coalition, which aims to eliminate black UK institutions through the removal of black and minority ethnic (B.I.G.) institutions from the landscape through the construction of new ­institutions of higher education. The legislation, which will be introduced in Parliament in the coming weeks, will also outline how the UK’s arts and cultural sector can work together to address racial inequality.", "The next Biennial should be held in March 2021.  The first iteration of the museum was staged in 2003 and featured work by twenty-five international artists from twenty-five countries. The program is a collaborative effort between the museum and the artist group the Stedelijk Museum Heeren, which is led by director Joost Van Der Meer; the German culture ministry, the Federal Office for Culture and Tourism, the Düsseldorf-Strasbourg region, and the city of Heeren. The program was established in 2015 by a group of artists and intellectuals under the name Biennale Germany. Lehmann Maupin Architects and Herzog & de Meuron have also joined the project. The Art Newspaper reports that the exhibition will be organized as follows: Artists: Bernardo Battista (Mexico), Alberto Burri ( Italy), Alexandre Cosas (Brazil), Yayoi Córdoba (Mexico), Hannah Dziewior (Canada), Freda Gergensen (Austria), Moray Goodwin (United States), Tanya Griswold (Australia), Brittany Ho (South Africa), Jacob Henry (Argentina", "The next Biennial should aim to take place in the spring of 2021, with a premiere in the summer of 2022. The production will be organized as a multi-disciplinary exploration of new technologies, design and the practices of artists\u0097the work of artists, the movement, painters, and the visual arts will be central to the project’s narrative and will be the subject of several exhibitions. The opening of the exhibition will take place on the first floor of the museum, in a new building designed by the architect Kiyosaki Shigeo, a member of the firm Waseda University. The exhibition will run from March 23 to March 26, 2021. For the first time in the biennial’s history, a winner will be chosen from a shortlist of ten artists, chosen by an independent jury comprising architect Andrés Manuel Pérez, landscape and urban designer Juan Ramón Madero, and artist Lilianna Olivera. The five finalists will appear in the exhibition “The Next Biennial” in Spring/Summer 2021 and will each receive a prize of up to $150,000.\n\n\nThe Museum of Contemporary Art (MoCA), Shanghai, has appointed Xiaohua Hu", "The next Biennial should have a budget of $50,000, and will be held in the museum’s main building on the campus of the University of California, Los Angeles (UCLA). The event will focus on “epigrams: the cultural and political territory of the East,” a project spearheaded by Lieberman that will also highlight the fate of American art during the ’60s counterculture movement.The question of whether the current exhibition should continue is one of the many that have been raised by critics of the museum’s current exhibition “The Future Is Present: Art and the Future of the Environment”. The Museum of Modern Art, the Whitney Museum of American Art, the Brooklyn Museum, and the Los Angeles County Museum of Art, among other organizations, are among those that have objected to its presenting the work of Jean-Michel Basquiat.In the same fashion, some artists have criticized the current exhibition “In Defense of Being: Art and the Present,” which opens on July 27, for its exclusion of feminist artists. “In Defense of Being” has controversially labeled female artists “contemptible.” A number of artists, including Lesli Klainberg and", "The next Biennial should be a tribute to her achievements\u0097or, in other words, should be a celebration of her life, work, and spirit\u0097or of the ways in which art and artmaking can be a force for social change.”The Millepensee, which is held in collaboration with the San Francisco Museum of Modern Art, will stage the exhibition “I Am Avid.” The exhibition will present a selection of works by artists who have recently received the award, which was established in 1989 by the Los Angeles–based artist-turned-philanthropist Marilynne Vollmer.Esther Anatoliti, an artist and filmmaker based in Chicago, said: “The future of the Biennial is at stake.” He added that the exhibition “may be the last.” The museum has not yet said when it will reopen.\n\n\nThe British Foundation has pledged £400,000 to help the Palestine Solidarity Campaign (PSC), a British organization dedicated to preserving the state of Palestine, during its ongoing campaign to have the British Museum’s Palestine Exhibition withdrawn from the Middle East and placed in storage.The donation is the latest move in a series of campaigns undertaken by British institutions", "The next Biennial should aim to follow a more traditional format and will focus on the development of the work in question over a period of five years.”A total of thirty-five artists are represented in the exhibition. The full list of winners is as follows:Art by:John Ivison (2008)Art by:Chris B. (2009)Art by: Adrienne Edwards (2011)Art by: Peter A. (2013)Art by: Jana Haag (2012)Art by: Dayan Howard (2012)Art by: Irina Koerner (2012)Art by: Eric Lindley (2011)Art by: A. L. M. (2013)Art by: A.L. M. (2013)Art by: A.L. M. (2013)Art by: A.L. M. (2013)Art by: A.L. M. (2013)Art by: A.L. M. (2014)Art by: A.L. M. (2014)Art by: A.L. M. (2014)Art by: A.L. M. (2014)Art by: A.L. M. (2014)Art by: A", "The next Biennial should take place at the Stedelijk Museum, the Rijksmuseum, and the National Museum, Amsterdam, as well as at the Nationalgalerie in Paris and the Palais de Tokyo in Paris. It will also be hosted by the National Museum of Modern Art, Taipei, and the Nationalgalerie in Venice.\n\n\nThe National Gallery of Art in Washington, DC, has received a significant donation of forty-eight works from the Charles and Lucille King Collection, including twenty-three works by artists such as Thomas Newson, who won the Pulitzer Prize in 1958, and James Turrell, who died in 2017. The National Gallery of Art announced the gift on Friday, March 4.“The King Family is a remarkable collection, full of sweeping, varied, and remarkable works of art,” said Joyce H. Caldwell, director of the National Gallery. “Through a collaborative process of archiving, presenting, and archiving, the collection is continuing its journey toward a more comprehensive and coherent collection strategy that will better reflect the collection as it grows and matures. We are proud to extend this rich legacy to our visitors with these works, which will assist visitors to the National Gallery in understanding the King Collection", "The next Biennial should be organized as a series of performances organized in the same way as the first, with a new film series every two years.” The music and visual arts biennial should celebrate the achievements of contemporary artists, and should focus on the development of new modes of expression and the integration of contemporary aesthetic and artistic practices in an urban context.The new biennial will be inaugurated by “This Is Not a Retrospective,” a collaborative program conceived as a part of the ongoing archaeological and historical research of the artist who is known for creating works that are often marked by their transition from one medium to another. The artist will present her work for the first time in the United States on February 23, 2020, at New York’s Museum of Modern Art.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it has settled a long-standing family feud over ten thousand works by American artist René Magritte. The feud, which dates back to 1908, involved a painting by the artist that first appeared in a trade magazine. The dispute between the Magritte family and the publisher of a different magazine resolved in favor of the family in 1948, but the dispute resurfaced with the publication of �", "The next Biennial should take place in 2021.\n\n\nThe New York City Department of Cultural Affairs has launched an ambitious expansion of its public art collection, which has been in storage since 2015, with the goal of restoring more than one hundred works by twenty-five artists in the city. The initiative, dubbed the Art of New York, will involve the restructuring of the city’s Department of Cultural Affairs and the creation of a new master plan, which will then be reviewed by the city’s City Council and the state legislature.“Culture is central to New York’s identity, and this expansion will shape the cultural landscape in a way that has never been attempted before,” said Mayor Bill de Blasio.According to the New York Times, the city acquired the artworks in a deal valued at $6.6 billion in 2017. City Councilman Jimmy Van Bramer, who represents parts of the city’s Central Park, said that the renovation of the city’s art-historical site was a “game changer.” He added that the changes will ensure that the works will be accessible to the public and that the institution will not only be able to handle the influx of visitors but also sustain its", "The next Biennial should be held in 2021. The exhibition will be curated by Antony Hudek, curator of the Basel Biennale in Hong Kong, and will be hosted by Avidya Gallery in New Delhi. The exhibition will be hosted by M.I.A. and will be distributed by M.I.A., Wangechi Mutu, and the India Foundation. The first performance at the museum will be an adaptation of a play titled Ariadne (Ariadne and Adragene) by D. S. G. Dutt and will be staged by Hirshhorn Museum in Washington, DC. An opening reception for the inaugural show will be held in August.\n\n\nThe Red Wing, a nonprofit arts center in central Harlem that was established in 1988 by entrepreneur and philanthropist Donald Reddin and his wife, Mary, has announced that it will cease operations in September. The arts center, which serves approximately ten thousand people a day, said that it had been unable to find a suitable home for the arts complex in the city. The couple sold the space in 1994 for $1.25 million.The Red Wing’s current location is in a former", "The next Biennial should take place in January 2021, at least two years after the event. The institution’s board members, who are comprised of Sarah Allen, David Evans, and Maya Lin, will form a special committee to present the biennial, which will be hosted by the museum.“Thomas Kuhn, the creator of Logical Form and of Western Art, was the first to call for a new, long-term, and consciously experimental theory of art,” the board members wrote. “In his view, art was already a social construction in the truest sense of the term. The present production of art is therefore not a mere an emulation of the past, but an anticipation of the future.”According to the board, the board of directors of the National Museum of American Art (NMA) in Washington, DC, has established an additional committee to oversee the biennial’s production. The committee will be chaired by Sean M. Mullen, director of the Brooklyn Museum. The committee’s inaugural meeting is scheduled for December 22.The biennial is curated by John Harty, who has served as NMA’s curator of modern art since 1983; Jon S. Simonson, who has", "The next Biennial should be held in 2020 and will be held at the city’s Arts and Culture Hub. The 2021 edition will take place at Santa Monica College. The eight-day event will be hosted by the Center for the Arts, and will focus on issues of the day. Commenting on the biennial, Catherine Fraser, deputy director of the Center for the Arts, said: “The Museum of Contemporary Art LA’s 2019 iteration was a genuine and unprecedented celebration of artist and movement. We are excited to build on that theme in 2020. We hope that you will join us for the event, and that you will join us in celebrating artists in your lives and communities.”\n\n\nThe Electronic Frontier Foundation (EFF), a New York–based nonprofit that works to promote digital and social rights, has asked the Metropolitan Museum of Art in New York to stop displaying controversial works by artist Michael White, including works that purport to draw from the body and body parts, and has received a cease and desist letter from the museum over its cooperation with the artist’s demand for greater transparency around its sales and distribution policies.White, who creates abstract sculptures and installations that involve dismemberment and display works in which experts such", "The next Biennial should take place in 2021, and the winner will be chosen as part of a panel of judges comprising: Jean-Luc Brunelle, head of the Institut für Internationale Kunstbildung, Berlin; Wolfgang Grom, director of the Haus der Kunstbildung, Frankfurt; and Hiroshi Kondo, director of the Museum of Modern Art, Tokyo.\n\n\nThe National Gallery in London is planning to move several hundred works by artists including Yinka Shonibare, Jacques-Louis David, Pierre Dauman, and Hélio Pessoa as part of a controversial overhaul of the institution. The move will require the cancellation of a number of shows, including “The Trouble with Telling Lies: Art, Politics, and the Struggle for Human Rights” (2019), and “Africa’s Woman of Art: From Bongo to Bongiorno” (2019), and will also involve the closure of three stories: “The Sinkhole,” a university-based project on water that debuted as part of the exhibition “The Water Painting Series” in 2020, and “The Precarious Life of the Mind: Painting with Indifference,", "The next Biennial should be held in 2020.However, the University of the Arts London (UCL) is still planning on holding a new event for the university. According to the New York Times, the show will instead focus on fashion and design. There will be a documentary-style presentation of the exhibition by curator Sianne Anbury, who will also helm the upcoming incarnation of the National Galleries of Art, and a digital version of the exhibition.The move has led critics to question whether the move was made in the interests of a majority of the students who are protesting the decision, which is being made in the interest of increasing the museum’s attendance. According to the New York Times, the students’ letter reads: “We reject the decision to move the exhibition and we reject the decision to leave the students without an opportunity to see it. We reject the decision to put the university and the future of the museum at risk in the interests of short-term financial gain. We reject the decision to leave the students without a voice in the making of their futures. We reject the decision to tarnish the reputation of their institution by removing them from exhibitions or damaging their work. . . .[Our letter] is not meant to be a", "The next Biennial should be held in the spring of 2022.  The exhibition will be co-organized by the Museum of Modern Art and the Museum of Art Tokyo. The forthcoming exhibition will feature work by artists such as Valentina Giannalina, Nara Ibaraki, and Kazuhiko Tanaka. The art historian and curator will also lead a workshop on the theme \"white-space: rethinking the history of art in the twentieth century.\"The next exhibition will feature the work of Hiromi Sato, whose work is currently on display in the Japanese pavilion at the Fifty-Seventh Venice Biennale. This year’s inaugural event, “White-Space: Rethinking the History of Art” (2018), was held at the Japanese Embassy in Paris last year. The exhibition is being organized as part of a campaign by Japanese preservationists to raise awareness of the plight of cultural heritage in the country. The campaign was launched after a group of thirty-five preservationists and museum officials wrote a letter to the minister of culture of Japan in March 2018, urging him to consider reviving the National Museum of Art in Kyoto and the Hiromi Museum in Chiba, and to allocate an additional ¥500 million to preserve cultural", "The next Biennial should be in 2021 and will be hosted by the Institute for Contemporary Art (ICA) in Kuala Lumpur. In 2022, the exhibition will be hosted by the National Gallery of Australia in Sydney.In 2019, the inaugural edition, titled Art in the Age of Black Power, saw a record number of exhibitions, with about sixty works by twenty-three artists, including Sandra Isa, Evelyn Alighier, and Benedict Cumberbatch. The exhibition marked the first time the Biennial was held in Australia.\n\n\nThe heirs of the late British photographer who often posed nude for his iconic portraits and for whom nearly two dozen works are dedicated to the family, which are currently on view in the exhibition “Nikon: The Family,” are suing the Museum of Modern Art (MoMA), the Metropolitan Museum of Art, and David Niven, the Los Angeles County Museum of Art, in an attempt to remove a portrait of the late American photographer, William Eggleston, that was mounted in the museum in 2009.The heirs are asking for the exhibition to be rescheduled, and a copy of the family’s will be presented to the Met. The lawsuit claims the retainer's demand for", "The next Biennial should be held at the new site in 2021. In the meantime, the K-12 school\u0097whose current exhibition, “Art of the Contemporary,” is on view through March 14\u0097is preparing to reopen with a new show of works by artists such as Simone Leigh and Judith and Alireza Nusseibeh, as well as exhibitions such as “Ivan Albright Paintings” (2019) and “Animal and Family: Contemporary Art in the 1970s” (2019).A rendering of a new entrance to the K-12 museum. \n\n\nThe city of Los Angeles has awarded the Los Angeles County Museum of Art (LACMA) $1.5 million in aid for its reopening. The donation, which is part of a $3 billion package for the arts, will allow LACMA to reopen to the public in time for the city’s March 16 reopening of the Angeles Memorial Olympic Theater. LACMA director Carlos Umeda said: “We are thrilled to open to the public in the Olympic District, a historically African American arts district, and to support the revitalization of the historic downtown area. LACMA’s upcoming", "The next Biennial should take place in 2021.<|endoftext|>I once saw a painting by Pierre-Auguste Renoir in a gallery in Paris. The work was on paper but the artist had positioned it in the painting in an effort to make it look as if the paper were alive and well. The result was an astonishingly lifelike, translucent, and breathing image; it has since become Renoir’s most famous painting. \n\n\nThe Museum of Modern Art (MoMA) in New York is suing the federal government for the termination of a twenty-five-year contract with a company that provides security personnel in the museum complex at 550 Fifth Avenue, where the institution is located, for failing to address the high number of thefts that have taken place there over the last two years, the New York Times reports.The lawsuit, which has yet to be filed, accuses the city of New York of failing to address the nine thefts that took place in November and December of last year, and of failing to communicate with the security staff to mitigate the risk of a spike in thefts that occurred the week of the first protest against George Floyd’s death, when hundreds of people protested in the lobby of the museum. The lawsuit also claims that security failed", "The next Biennial should consist of two halves: a tribute to the artist-and a reflection on its legacy. It will also include an exhibition of works by artists such as Janet Ferguson, Stephen Futhey, and Jenny Holburne. This year’s exhibition will take place on September 27. “I’m excited to be opening the new Biennial to the public this fall. Our new program will be focused on the artist as a whole, focusing on the work of her / his life, and will focus on the art of the artist as a whole, rather than the artist’s individual life,” said Bradley, who recently retired after twenty years at the museum.Bradley, who curated multiple biennials in the mid-’70s, said that the museum is planning to open the new exhibition, “In Praise of the Artist,” in February 2020. When asked about the future of the museum, Bradley said: “I’m going to continue to work with the artists, and to collaborate with the artists and their families, and to reflect on the legacy of the biennial.”\n\n\nA new exhibition organized by the", "The next Biennial should be held in 2021.\n\n\nThe Tate has received a donation of 83 works from the collection of the late Italian artist Maurizio Cattelan, a professor at the Tutto di Cincittà in Milan and the Tutto di Mantova in Venice, and will begin presenting them in the fall of 2020. The donation includes works by artists such as Gio Ponti and Marcella Battisti, as well as works by Franciscan photographer Carlos-Carlos Merz, and is part of a larger donation of 400 works that will be presented by the museum in the coming months.The gift was made during a visit to the museum by the late curator and collector Francesca Ciavotti, who served as the patron of the institution. Ciavotti visited the Tutto di Cincittà in August 2019 following a tour of the museum by the Italian architect Silvio Cipollini, who built the Tutto di Cincittà in 1966.The museum has also received a gift of 194 works by artists who are no longer alive, including the artist Mark Boster, who is reportedly the youngest living living", "The next Biennial should be held at the same location as the Art Mirrors. “We’re sorry it took us this long to reach out to the artists whose work we are so proud to present, and to the institution itself, but we are committed to working with our artists to bring this exhibition to life, and to engage with their communities,” said Mark Slough, director of the Arts at Lincoln College and director of the Biennial.Citing the recent works of poets Tora Yanow, Matthew Booth, and Julian Barnes, the biennial also stated that these individuals will be featured in future editions of the exhibition.\n\n\nThe Parsons Museum of Art in New York has appointed Jack Shainman as its next executive director. Shainman succeeds Michael L. Malone, who was previously the director of the MCA from 2003 to 2010, and will begin his tenure in January 2021. He succeeds Linda Bean, who has been the museum’s senior curator of Asian art since 1995, and will begin her ten-month term in January 2022.“The MCA has long been a beacon for artistic talent and an innovative cultural enterprise, and Jack’s diverse experience and vision for the institution makes him uniquely qualified to", "The next Biennial should focus on the connection between the work of artists and the body, on the production and the circulation of art, on solidarity, on the relation between body and work, and on the relation between artist and the world. “It’s important that a new exhibition be inaugurated in the first Biennial, the biennial of the body,” said Tonino. “I would like to think that, with this exhibition, we will begin to address that question. We will not be able to move forward if we do not address this issue.”For the exhibition, curated by María Berrada and titled “The Body,” Nicholas Bochereau (1942–2013), Marta Bonetta (1948–2016), and Jessica Lenhardt (1946–2017) emblazoned their bodies with their own. A selection of contemporary and historic works by these and other artists was also mounted. The full list of artists represented in the exhibition is as follows: 1.Mary Elizabeth Winstead, The Body in a Glass House, 1967\n\n2.Arts and Artists for the Body, 2015\n\n\n3.Eddie Deem, The Body in a Bottle", "The next Biennial should be held in Beijing in 2021. \n\n\nThe Italian architect, sculptor, and educator Lucio Fontana, whose distinctive geometric and sculptural designs and paintings illustrated the vibratory and poetic power of light, has died at age ninety-five in Rome. We are saddened by his passing, as we were by his extraordinary energy and vitality. “In his real and personal life, he was close to the heart and soul of Rome,” said Juliette Albiol, the chair of the museum’s architecture department.Born in Rome in 1943, Fontana studied under Ciro Facio, Cipolotti, Gio Ponti, and Beppe Rimini. He ultimately left the family to pursue a career in art. After attending the University of Turin, Fontana enrolled in the Faculty of Fine Arts in Turin, where he studied with Giuseppe Arcimboldi. He is survived by his son Giuseppe and his daughter Gia.Born in Turin in 1967, Fontana traveled extensively in Italy, Italy, and the US, before settling in Rome in 1985. In 1988, he began his career as a freelance designer. His work has been exhibited at the Venice", "The next Biennial should be held in 2020.\n\n\nThe Skowhegan Museum of Art in New London, Connecticut, has received a gift of twenty-six works by John Crowley. Two large works, both from the 1930s and 1940s, were gifted to the institution in 2017. The works, which were acquired by the Skowhegan in a donation from the artist during a four-year partnership that was designed to celebrate the artist’s seventy-fifth birthday, are on display in a new exhibition that will open in the institution in early 2020.The works, which were acquired through a gift from John Crowley III, will be restored and presented by the museum in a new exhibition, “John Crowley: Creation and Destruction.” The event will feature twenty works by thirty-four artists, including Johannes Brahms, Robert Irwin, and Frank Stella, as well as a selection of new works by artist-in-residence Jonathan Hornig.“In the midst of the current crisis, we are honored to support the Skowhegan’s vision of a permanent collection of John Crowley’s work,” said Scott Rothkopf, president and CEO of the Skowhegan. “The", "The next Biennial should be held in early 2021, earlier than the next two years.\n\n\nThe Austrian city of Vienna announced on Tuesday that it is planning to hold a biennial dedicated to the works of the Austrian painter Erich Klee\u0097who also designed the exhibition space the Freie Kunstverein in Berlin. The exhibition is slated to open in the new venue, the Kunsthalle Basel, in 2021.Klee’s work, which spans the gamut of form, material, and light, has been on display in the museum for more than fifty years. Klee’s show, which originally opened in the former BÄRM-Kunstverein in Vienna in 1956, was one of the first major exhibitions organized in the country, and eventually led to his moving to New York and the founding of the Klee Foundation, which organizes exhibitions and offers scholarships to students.Klee’s work is also featured in the exhibition “Ernst & Georg Ludwig: Etude und Verband (1961–1965),” which is currently on view at the Kunsthalle Basel until March 19. Klee’s influence on the course of modern and contemporary art has been", "The next Biennial should take place in 2021, and will unveil a new selection of works by the master Russian sculptors Anna Dhanda and V.A. Gorki.“The museum will continue to be a platform for dialogue among scientists and artists, and an instrument for scientific and artistic exchange, preserving and presenting the collection as a whole,” said the director.\n\n\nThe New York Public Library has announced that it will donate more than two hundred works by the late Iranian American artist and activist Raed Jarrar. Jarrar’s possessions, which include a personal collection of more than one hundred works dating back to 1977 and a collection that spans seven decades, are currently housed at the Metropolitan Museum of Art in New York. She was one of the few living practitioners of the late Majid Johnson’s “backward” art, which was inspired by the poet and activist A.A. Khan. The donation includes works by artists like Hanna Marra, William Paul Gauguin, and Robert Irwin.“We are privileged to donate works by Raed Jarrar to the Met,” said Met executive director Daniel H. Weiss. “Over the years, we have collaborated with her and her", "The next Biennial should be held as soon as possible and will focus on 'The Period of the Slave Trade: The Transatlantic Slave Trade and the British Mandate in India, 1857–1914.' Submissions will be accepted from September 18 to September 21 and will be judged by a committee comprising the British historian Ewan Brownlee (Princeton University); the British artist Jo Cox (University of London); and the British curator Miss Yvonne Ridley (Cambridge University).Commenting on the proposal, Ridley said: “I am thrilled that the Biennial will be able to return to its original themes of the global South, the plight of indigenous peoples and the legacy of colonialism. I know this is a challenging time for many, but I believe that this is an opportunity for the world to re-examine its place within the framework of human history.”She added: “The CNA is a great platform to rethink the role of art in the contemporary world. The proposals that we are making now are the best hope for the future.”\n\n\nThe Metropolitan Museum of Art in New York has named Diana Nargis as its next director. In her new role, Nargis will oversee the museum’s expansion to", "The next Biennial should be held in 2020.\n\n\nThe Kunsthalle Basel in Beijing has received a donation of eighty artworks from the former museum of the same name, which closed in 1992, in a gift of more than three hundred works by contemporary artists working in China. The works are from the collection of Peter D. Württ, a German collector who in 1957 founded the noncollecting art museum Düsseldorf-Bremen in Germany. Württ was the first to establish the museum in the city of Düsseldorf and the first to run the museum as a noncollecting institution.The gift includes works by artists such as Wolfgang Kornfeld, Tomál Lindqvist, Luca Mega, and Eduardo Sotto, and is part of a larger initiative to establish the purchase, sale, and display of works by contemporary artists in China. An additional thirty works, which were donated by another collector in 1958, form part of a project organized in 1977 by Württ. The Kunsthalle Basel also recently presented works by the Kissinger/Mightenberg, Vincent van Gogh, and Robert Irwin.", "The next Biennial should take place in the fall of 2022.  The biennial will showcase the work of seventy artists from twenty-three countries and three continents. The 2020 winner will be announced in December.\n\n\nThe National Gallery of Art in Washington, DC, has announced that it is planning to close its doors for four years to complete a $71 million renovation and expansion that will add more than 100,000 square feet of gallery space and improve accessibility. The project, which is part of a $500 million overhaul of the institution, is one of several major arts projects being undertaken by the National Gallery of Art, which is expanding its collection, improved its capacity, and strengthened its reputation.“Over the last four years, the National Gallery of Art has undergone a major renovation program that has made it one of the most exciting and attractive locations in the city for an artist-driven, museum-going experience,” said Andrew Warhol, the museum’s current director. “The update to the National Gallery reflects our vision of an inclusive and accessible National Museum that will connect visitors to the National Gallery, the National Gallery of Art, and the National Gallery of Art.”The National Gallery of Art’s Board of Visitors�", "The next Biennial should aim to present a work for the first time by an African American artist in the United States. The initiative, which was launched by the nonprofit organization Emily Carr Foundation and was led by curator and award-winning artist Martine Syms, will culminate with a performance, which will then include a discussion with the artist. Since its inception, the Biennial has invited artists from eighteen cities across the United States to participate. In addition to presenting an exhibition of work, the event typically draws hundreds of thousands of people.The first artist to be selected for the Biennial was Alex Acosta, a San Antonio native and Miami native. He painted Rumah Gidley, a collage that depicts a group of women gathered around a fire in a tropical environment, and Gidley served as the centerpiece of the 2013 edition. The next year, the same group of women returned for a collaborative exhibition titled “The Anatomy of a Fire,” which was organized by the nonprofit Art Alliance Foundation. The exhibition was curated by Robert Sarvis, the director of the Korean American Art Museum and the Walker Art Center in Minneapolis.Sara Watts, the curator and organizer of the first show at the Walker, described", "The next Biennial should be held sometime in 2020. The project also includes developing a new way of presenting the works.The project will include the development of a new platform, the Biennial Portal, which will host the first exhibition biennial at the museum in 2021 and the second exhibition biennial in 2022. The platform will be integrated with the existing exhibition spaces and will be able to present the works remotely.The project was initiated by artist and designer Tadao Ando, who is known for his direct, kinetic materials such as paintings, sculptures, and animations. The new platform will allow the public to experience the works in an immersive way through a video and images installation of the work. The installation will also showcase art from the biennial’s previous editions. The first biennial, “Dieterich Fleck” (1922), featured works by over fifty artists and was shown at the Museum of Fine Arts in Kassel from December 15, 1922 to January 5, 1923. The second biennial, “Sara Floretti” (1928), was shown at the Museum of Modern Art in New York from September 21 to March 28, 1930.The development of the Biennial Portal was supported by the previous Dutch government,", "The next Biennial should focus on the evolution of the body as a whole and will focus on the role of the body in shaping culture, politics, and society. The first exhibition will open in Abu Dhabi.  \n\n\nThe Pérez Art Museum Miami (PAMM) in Florida announced today that it is collaborating with the Montauk Museum of Art in Chicago on the project of a new exhibition, “The Painted Desert,” that will be organized as a series of permanent installations in the museum. The exhibition will take its cues from the works of American painter Don Marquis, whose colorful, augmented-reality works often feature anthropomorphic animals, plants, and other abstract shapes, and will present the first “Painted Desert” pictorial artwork in the United States.Expected to open in 2021, the show will focus on the cultural history of the Painted Desert and will present a number of works, including a series titled “Lost Worlds” (for 2017) and “The World Is Not a Homage” (for 2012), which will be on display alongside works by other New Desert artists such as Jason Hoare, Tony Lewis, and Travis Elliot. The exhibition will be titled “The", "The next Biennial should take place in 2019.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is taking another important step toward receiving a major renovation project, this time by the design firm Gensler & Poe. The renovation, which is slated to start in the fall, will introduce new galleries to the museum, add a new sculpture garden, and renovate the museum’s main building. The work is part of a $70 million expansion plan announced in 2017 for the institution, which opened in 1964 as the University of California, Los Angeles (UCLA), then known as UCLA.“The addition of new galleries and sculpture gardens has been a long-term goal of MoCA,” museum director James T. McDonnell said in a statement. “It is a bold proposal that embodies the spirit of the Museum of Contemporary Art, but also reflects the legacy of the architect, Gensler & Poe, whose work will complement the projects already underway and create a new chapter in the Museum’s collection and presentation.”The renovation, which is being organized by Gensler and Poe in partnership with the architect and landscape architect and urban designer Timur Sosens, is part of a larger vision to reconfigure", "The next Biennial should aim to address the future planning of the city and its cultural heritage. It should consider how to support and reimagine the city’s existing collection of contemporary art in a way that minimizes the need for the removal of works in the future. It should consider how to organize programming that will engage with current events and future projects and how to prepare for and prepare for upcoming events and exhibitions. It should consider how to create a public space that remembers its past and reflects the city’s present.”The 30-year retrospective, titled “After the Fall,” will open at the Tate Modern in London on February 23 and will be followed by a special exhibition of work by artists such as Sam Guiraud, Jeff Koons, Joan Jonas, Peter Andre, and Marina Abramović at the Hammer Museum in Los Angeles in March 2020.\n\n\nScottish artist, sculptor, and filmmaker John Akomfrah, whose gothic, sensual, and emotionally resonant paintings and sculptures embrace a feminist, queer, and trans-racial lens through which are reflected the anxieties, anxieties, and anxieties of his queer and trans-racial community, has died at age eighty-six.Born in", "The next Biennial should be held in the autumn of next year. \n\nThe Museum of Modern Art (MoMA) in New York has suspended a show on race and modernism that was set to open in September. The exhibition, “Race and Modernism,” was to be on display in the September 2–September 7 exhibition “The Architecture of Race and Modernism” and would have featured works by fifty-six African American artists and activists. The move drew a mixed response from African American artists and activists who called the move a “disproportionate response” to the September 11 attacks.In a statement, MoMA said: “We share a responsibility to reflect on our shared history as a nation and to think critically about how we present that history to our students and the world. We chose not to do this here. We chose not to present it in the United States.” The exhibition will now return in September 2021.\n\n\nThe Berkeley Art Museum (BAM) in California, has announced that it is preparing to welcome visitors back to the institution next month, following a temporary closure because of the Covid-19 pandemic. The museum said that it expects to open to the public in mid", "The next Biennial should take place at least ten years from now.  Italian architect Walter Gropius, who designed the exhibition in his studio, proposed a ''festival of the efforts of the artists, of their efforts in harmony with each other, in order to create a new kind of atmosphere in which each can contribute his own personality.” The exhibition was inaugurated by Fernando Cipolletta, a former president of the Italian pavilion, who this year wished to rebuild the pavilion in the same way as the pavilion was rebuilt.Cipolletta also said that the pavilion would be reopened in the same way at least once more. Last year, the pavilion was reopened for a biennial in a different location, but the Italian pavilion has only three days a year to maintain its aesthetic integrity.\n\n\n\n\n\n\nNovartis Announces Its Commitment to Creating a New Discovery-Based TherapeuticsRaksha Kulkarni, CEO of Novartis, has announced that the company will soon deliver three new products: a multifunctional and holistic anti-epileptic, a drug that inhibits the progression of epilepsy, and a drug that targets the brain.Kulkarn", "The next Biennial should take place at the Museum of Contemporary Art (MoCA), in New York, in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is preparing to welcome visitors back to the institution for a second round of the event, which took place in March 2019, in November 2020. The announcement follows the publication of a new book by artist and curator Robert DeNiro, The Second Coming: Art and Death, which analyses and discusses the events leading up to and culminating in the death of American artist John Cage.The announcement follows a month-long public art tour of the museum, which is currently undergoing a $500 million restoration project and features more than two hundred works by seventy-five artists. The tour will culminate with the installation of a new sculpture by artist Rangiku Matsumoto, titled The Death of Red Sun, at the Main Building in January.“I’ve been thinking about this for a long time and was ever hopeful that we would be able to create some sort of a real and lasting legacy for John Cage,” said museum director Thomas Campbell. “I’m thrilled that the new work, The Death of Red Sun, will become a part", "The next Biennial should take place at the National Museum of Art in Washington DC, and the American Independent Film Festival in New York City. The 2018 edition, which was held in October, was cancelled due to the Covid-19 pandemic.The full list of participating artists is as follows:Erin BeallBrian CoxChristopher DaleCasey ConnollyCaitlin DooleyEric DrexlerChristopher MimsDaniel WebsterDaniel WilsonZachary GrantHannah HelmerFrank BastosHannah HandleyHannah MackayHannah SchlegelJessica PeutiñoJillian PetheryKelsey StanfordMichaelsa María AlonsoLéa SobsRandy PindellRandy ShawarahToni WeigelYara ZacariahZachary GrantZoé WhitleyZoe CattelanZoe L. HobbsYara Zacariah\n\nFollowing the recent announcement that the National Gallery of Art (NGA) in Washington, DC, would begin welcoming visitors in April, the federal government launched an emergency fund to help the institution. On Thursday, the National Council on Art and Technology (NCAT) released guidelines for how institutions may use the $3.4 billion in funds, which were", "The next Biennial should be at the National Gallery of Art in Washington, DC, the Smithsonian Museum of American Art, and the Musée d’Art Contemporain in Paris. The 2020 event will take place in April.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that artist Billie Xi has been selected to represent China at the 2020 Venice Architecture Biennale. She will be presented with an award at the Venice architecture biennale in May.“The best-known Chinese artist of today, Xi creates large-scale, interlinked works that challenge and refresh the modern conception of art,” said Helen Hayes, director of the Museum of Contemporary Art. “Billie Xi’s installations, which combine with her own practices, reveal a wonderful range of human and mythological ideas, and are populated both by and about lovers. At the same time, the pieces move through space with incredible precision and empathy, drawing on Chinese ideas of space and water and moving between different realms of art.”The artist, who has been featured in shows at the Whitney Museum of American Art, the National Gallery of Art, and the Architectural Association of the Americas, will be presented with an award at", "The next Biennial should take place in November 2020 and will be hosted by the Museums Association (MA), London, while the exhibition will be held at the London site. “Despite many years of exciting new projects, the Museum has always been a team effort,” said Mark Speltz, director of the Museum. “The good news is that, thanks to the extraordinary team of artists who have worked together over the years, the future of the exhibition and the exhibition of the Biennial at the Museum is secure. We look forward to continuing our collaborative relationship with our visitors and the wider world. In the meantime, we are working hard to develop new and innovative ways to engage with our largest exhibition collection and to change the face of contemporary art.”\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed David Rutter director and curator, effective immediately. Rutter joins the institution from the New Art Center in San Francisco, which he has led since 2015, and will assume his post in January 2020.Rutter comes to the museum from the Metropolitan Museum of Art in New York, where he served as director for two years and oversaw the reinstallation of its new exhibition space, the Solomon R. Gug", "The next Biennial should take place early next year and will feature ten works by twenty-one artists and will be held at the Museum of Contemporary Art (MoCA), Los Angeles. The exhibition is curated by Mackenzie-Braun and Craig Mitchell and will run for twelve weeks.“The Fall Factional is a celebration of the following artists: David Cox, Sarah Daniels, William H. Gaddis, Julia Kristeva, and, most recently, Christopher Woolf,” said Mackenzie-Braun. “We are incredibly honored to present the work of these twenty-one amazing artists at the Fall Factional, and are hopeful that you will join us in celebrating these extraordinary artists and the art of our time.”The exhibition, which was organized by Mackenzie-Braun and Craig Mitchell, will be staged as part of the Museum’s Fall 2019–2020 season, which opens on January 6 and runs through March 6, 2020. The Fall Factional will bring together works by thirty-eight artists and will be inaugurated by the exhibition “The Singularity Is an Unseen State.” In conjunction with the exhibition, the Fall Art Museum will stage the exhibition “Atlas” in March", "The next Biennial should be held in 2020 and will be organized under the leadership of Adi Ta'alon, chair of the Museum of Contemporary Art Miami Beach, who has been working toward the revitalization of the museum since 2015.The institution is currently working with architect Heino Wada to reform the museum into a multi-million-dollar modern art museum, which will be located in a mixed-use development on the ground floor of the old Cactus Club building in West Miami Beach.“It’s a great honour to bring this incredible collection to Miami Beach,” said Todashev. “I’m thrilled that this year’s Biennial will feature some of the most important works that have been made in the Caribbean in the last seventy years and will further engage with the local community in supporting the revitalization of the areas surrounding the museum.” \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it will remove the remains of the Pole, the eventual site of the “Pole Art Show” that originally opened in 2019, from its website as part of a new $10 million renovation project. Since the event, which was", "The next Biennial should be held at the Museum of Fine Arts, Boston, in 2021. The 2019 edition, “I, Too, Am an American Icon,” was staged by the Los Angeles County Museum of Art (LACMA). The exhibition, which was curated by Lt. Governor Ralph Northam, was dedicated to an “iconic American artist” and was held in conjunction with the biennial’s first edition. The exhibition featured work by forty-six artists and was organized to address the themes of the year. “It was a disappointing show,” said Museum director Maria Nuccitelli. “We are deeply inspired by the work of the artists, and by their vision for the future, and their commitment to San Francisco. More than anything, we are inspired by the spirit and mission of LACMA. A show like this is the perfect occasion for us to reflect on the legacy of this iconic institution.”\n\n\nThe National Geographic Society’s attempt to expand the boundaries of its imprint on American culture has been beset by legal and political obstacles, including a high-profile stalling of the Grand Forks Museum of Natural History in North Carolina,", "The next Biennial should take place in the autumn of 2021.\n\n\nFrance will hold a second iteration of the Paris Biennale in 2021, its cultural capital, in the spring of 2022. The announcement was made by the French culture minister, Nathalie Bondil, on Twitter, where she also hinted at plans to stage a second edition of the fair in 2022 in the autumn.“Our Paris mission is not over,” Bondil said. “We are continuing with our European mission, and our Parisian mission in 2021, and the future of the fair is uncertain.”The French mayor, Anne Hidalgo, declared the 2020 edition of the fair, which runs through May 31, a success. She said that the event drew an additional 250,000 visitors, raised over $100 million for the city, and set a new benchmark for international engagement. The Parisian Art Studios, the city’s art incubator, also announced that it has received a $50 million donation from the Sursock Foundation.The city of Nice also received a $50 million gift from the Sursock Foundation, which will help the city’s arts and cultural sector through grants and loans. The organization will lend the museum", "The next Biennial should be held in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, California, and the National Museum of Women in the Arts (NMNA) in Washington, DC, have filed a lawsuit in an attempt to prevent the demolition of the former Douglas Aircraft Company (DAC) factory, which employed some 2,500 people and generated some $8 billion in income annually, according to the Los Angeles Times.The two institutions—which are currently in the midst of a $1.5 billion revamp of the former site of the company, known for its consumer electronics, and are currently negotiating an agreement that will see the building, which was constructed in 1937, razed to make room for the construction of the current museum complex—are asking a judge to block the construction of the new facility until the cultural center can be constructed and the buildings can be put into operation. The court filing also claims that the museum is asking the court to send the case to a different federal appeals court, and that the building, which will be situated in a nineteenth-century industrial park, is a dilapidated structure that will be unsafe for the people who work and live in it.The museum is asking the judge to prevent the building", "The next Biennial should be held in the autumn of 2020.  The development of the Cultural Centre is part of a larger plan to revitalize the city’s historic waterfront, and of the city’s downtown core. The redevelopment project, which will include the construction of more than 1,500 apartments, was launched in 2018 and is funded by the city. The funding for the project was also instrumental in securing the renovation of the Grand Opera House, the recently completed Edward St. Aubyn–designed Guggenheim–Bicocca, and the ambitious Ecole des Beaux-Arts.\n\n\nParis’s Louvre, which recently laid off twenty-one employees after it reopened in early March after months of pandemic-induced shutdowns, has laid off or reduced the hours of more than two hundred employees, the Art Newspaper reports. The institution, which was forced to cancel several shows last fall and will once again be shuttered until March 21, has been struggling to move its operations to a new facility as it works toward reopening in early April.In an attempt to placate critics, the Louvre announced last week that it would begin welcoming visitors again on March 22, as planned. On Wednesday, March 20", "The next Biennial should be held in 2021. The decision was made following discussions with the participating artists, curators, and experts of the disciplines, which took place in a meeting chaired by Sara van Aken, director of the Biennial, at the Art Gallery of Philadelphia, on September 23.\n\nAn exhibition at the Museum of Modern Art in the US that was organized by Chicago-based collective Surrealism Workshop and curated by Kunsthalle Basel in partnership with the Museum of Modern Art has been cancelled amid massive protests from artists and activists. On Monday, September 21, the United States House of Representatives voted to censure the institution for violating the Protocols of the Earth, the Fifth Amendment, and the 14th Amendment by excluding a group of scientists from the exhibition “The Problem of Life on Earth”—a film about anthropogenic climate change and an attempt to grapple with the existence of a 'new Man’s Body in Space.“The real crime here is that these scientists are being excluded from the exhibition because they disagree with the ‘Aliens’ content of ‘The Problem of Life on Earth’” and therefore receive funding from the institution,” said Rep.", "The next Biennial should take place in the spring of 2020. The next edition will be organized as a symposium, and the theme will be the exploration of “the cultural relationship between the Jewish and Muslim worlds.”The 2017 event, titled “Between the World and Me: Jewish and Muslim Manuscripts,” featured work by twenty-three artists, including Yair Hoffman, Scott-Phillips, Gertrude Stein, and Carlo Caccia, and featured translations of the works of Benjamin Gombrich, Kiki Smith, Leila Al-Hadid, and Tushi Ahmed.\n\n\nThe Israeli government approved a new bill on Monday that will allow the construction of more than two thousand housing units for the ultra-Orthodox Israeli community, known as haredi, in the country’s Negev region, as well as 3,600 new housing units for the Druze community. The legislation, which is part of a larger plan to reduce the state’s footprint in the region, was passed by the Israeli Knesset through a vote of 261 to 148, and is slated to be implemented in January.“We are proud of our national leadership in the field of housing and Jerusalem,", "The next Biennial should have taken place at the Museum of Contemporary Art, Chicago, in 2021. According to the Los Angeles Times, the museum is planning to move the event and shift the focus from photography to the social practice of architecture. The move comes amid a wave of digital-first projects spearheaded by artists, ranging from Ai Weiwei to Tunga, that have explored how technology and design intersects with physical materials and the environment to create new visions of what the future might hold.The new exhibition, “Photography & Architecture,” will open in the museum’s newly renovated building on the campus of the University of California, Los Angeles (UCLA). The exhibition will include new work by twenty-four artists, including Gabriel Garcia, Maya Adeline, and Jean-Michel Basquiat, as well as photographs by Renzo Piano, the German-born Italian architect who designed the Museum of Modern Art in Rome from 1957 to 1960.The exhibition will be organized as a series of long-term contracts that will culminate in a five-thousand-piece reimagined Pompeii, modeled after the ancient world city. Under the direction of Ariel Avital, the new project will feature a new design by the Italian", "The next Biennial should take place in 2020 and will explore the history of contemporary art, the contemporary art world, and the larger social and political context of the artist and the artist’s work. Next year, the biennial will be held at a location that will serve as a gathering place for the local community. “For the past twenty years, we have been sharing our experiences with the community through exhibitions, readings, talks, and other activities,” said Frederick C. Shepard, the director of the Henry Luce Foundation. “We are excited to see what new creative possibilities will emerge from this exhibition, and are eager to collaborate with our community to explore new and exciting ways to give back to the city.”The biennial will feature works by forty-eight artists of African, Asian, and Latin American descent. Titled “Anarchy of the Oppressed: Modern Art and the Black African Diaspora” and curated by Catherine Brown, the exhibition will focus on African art and the African diaspora through a combination of photography, sculpture, installation, performance, and video. “This is an exciting time to be a curator,” said  John McInerney, the", "The next Biennial should be held in 2021. \n\n\nThe Elizabeth Art Gallery (EAG) in London has received a gift of approximately one thousand photographs by Laurie Anderson. The work, which was given to the museum by artist and collector Nick Hornby, is a digital restoration of a series by the artist that presents herself as a series of photographs in a gallery setting. Anderson first began her series in 1977 in a studio in Boston, Massachusetts, and then travelled to New York, where she made the first two editions in 1983 and 1987, before moving to the Elizabeth Art Gallery in 2013 to form part of the group exhibition “Laurie Anderson: Digital Surrounds” (2015–16).The works are currently on display in the exhibition “How to Photograph,” which opened at the gallery on March 30, and “Laurie Anderson: Medium,” which opened at the museum on March 31. In the latter exhibition, the artist produced photographs in a variety of media, including charcoal and oil, and their performance was choreographed by Anderson in a digital video installation that was shown in a live stage production of the play “The Big Sleep.”\n\n\nThe National Gallery of Art in Washington, DC,", "The next Biennial should be in the first week of December. All ten artists, including the artists whose works were selected for the first edition, will be honored. Artists who are not appearing in either edition of the Biennial are: Amiti Saydawy, Ali Arraf, Barbara Williams, Cameron Rowland, Catherine Tyler, and Cecilia Iarocci. The Biennials are:  Amiti Saydawy: Slum of the Mind, 2009Featuring Arsht, Bourne, Black and Grey, 2010Amiti Saydawy: The Day I Felt the Air, 2011Shimaburō Takashi: The Day I Fell in Love, 2012Takashi, who has been featured in the last two Biennials, is returning to the main exhibition. Arsht, whose work explores themes of memory, memory loss, and the effects of ageing, is also planning to participate in the next edition.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to delay opening its inaugural exhibition “A Place of Their Own”—a project to present", "The next Biennial should be held in 2021. The next winter, the CNA will re-open with an exhibition of work by twenty-four artists at the art museum in a full-scale display of the exhibition. The next year, the museum will hold a symposium to present the exhibition “Reflections of a Woman” in a re-creation of a woman’s face. The next year, the museum’s collection will be re-introduced. The next year, the next year, the next.The next year, the CNA will host ten exhibitions, including “Lévy Gorvy: Photos from the Collection of Peter and Paul Gauguin” (2019); “Photographs of the Royal Academy” (2019); and “The Naturalist” (2020). The next year, the museum will present a “new vision of the human body” alongside works by Jacques and Edouard Vuillard, whose work is in the exhibition “MUSIC & CRIME” (2020).Following the inauguration of the museum in 2005, the CNA’s galleries converted to openier spaces, and its facilities were renovated. In 2012, a new building,", "The next Biennial should be held sometime in the second half of 2020. The Board of Trustees will meet in an emergency session at the institution, which has not had a regular director since Robert J. Thompson stepped down from the helm in 2013, to discuss the future of the museum.The institution has faced substantial financial losses as it has transitioned to a wholly online-based model for its collection, which has seen a precipitous drop in visitors. The board has previously attempted to shift the museum’s focus to online acquisitions, but the current exhibition schedule makes that difficult. Governor Andrew Cuomo has made encouraging signs for the biennial, such as his recent pledge to spend $500 million to repair New York’s infrastructure, and has promised to allocate $1 billion toward the biennial’s future.The news comes on the heels of the New York Artist’s Fair, which was pushed back to October due to concerns around the coronavirus. Earlier this month, the board approved a resolution that called for the fair to be held as planned, but later that week, the governor suspended it indefinitely. Cuomo has since said that he expects the biennial will reopen sometime in October.\n\n\nCultural activist Leila Çel", "The next Biennial should be held in 2021. The first Biennial, Unseen, was held in 1999. \n\n\nThe British Museum in London will soon be able to display the work of the late American avant-garde artist Allen Goode in its new location in the city’s St. Ives, and in partnership with London’s Tate, which has also been granted planning permission to build a new exhibition space for his work, the Allen Memorial Garden in Brixton will be completed in 2021.Titled “Allen and the Art of Making Places,” the exhibition will be organized as a “continuation and extension of the work of Allen’s companion Norman Oostra,” and will feature works by a select group of artists who “exceeded the standard set by Allen’s partner, Norman Brown.” “The Allen Memorial Garden will become a great facility for the exploration of the work of Allen and Norman,” said Tate director Maria Balshaw. “It will become a home for Allen’s work, and for the art of making places. Allen and Norman created new ways for us to look at and talk about art,", "The next Biennial should take place in the coming months, and will hopefully be a departure from the fondly recalled, “historical, stylized, and academically-driven” atmosphere of the first. The exhibition has yet to publicly address the most recent controversy surrounding its founder. Its fourth edition, which opened this March, featured works by forty-eight artists and art historians, and attracted an audience of some two hundred.Commenting on the exhibition, Fadiman said: “I am hopeful and confident that our new Museum will be able to attract and engage a new and growing audience, to take us beyond the narrow confines of the past but to continue to present the fascinating and important art of our time.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has revealed that it plans to open a new public art center at the former Pacific Power Station, which was home to the largest residential battery storage complex in the United States—the $68 billion Brevard County Community Battery, or BCS. The $1 billion facility, where the company operated two 8.5-megawatt battery farms, was completed in 2017 and is slated to be occupied by the museum for the next fifteen years. The first phase of the", "The next Biennial should take place in 2021. The first, held in 1994, covered the period from April to October, and the following year, the second (2011) was a retrospective of the artist’s work and was held in 2020.\n\n\nThe National Gallery of Art in Washington, DC, announced today that it is creating sixteen new full-time, career-spanning positions, each of which will be funded by a $250,000 grant established by President Donald Trump in 2018. The grant program, which was created as part of the “Make Work Pay” campaign, was formally launched in 2020 by the $2 trillion Federal Healthcare Reform and Patient Protection Act (or CARPA).The seventy-two-year-old institution—which was founded in 1921 and is currently undergoing a $150 million expansion—has awarded more than $4.2 million to full-time artists since its inception in the early 1980s. The full-time positions are: *David L. Price, head of the National Gallery of Art; *Merry Stutz, senior curator of modern and contemporary art at the Smithsonian American Art Museum in Washington, DC; *Catherine O. Fung,", "The next Biennial should be held in 2020. \n\n\nThe Art Newspaper, a leading arts publication in the US, has announced that it is pushing back its 2020 launch date by a year to July 1, 2020. The news comes amid an escalating crisis that has seen dozens of American galleries shutter as a result of the Covid-19 pandemic. Though the United States has since begun phasing out its own artworks, many museums are still planning to reopen and continue with their programming. “With the start of the new year, we aim to reduce our travel footprint and to work with our teams across the country to make the most of our newly freed time,” said Editor-in-Chief Jon Schaer. “We will continue to talk with our partners, artists, collectors, and patrons about what we can do to help minimize your travel and transportation needs if we can help it.”The news follows Artnet’s September 12 announcement that it will remain online as it works to sort through the effects of the Covid-19 pandemic on its artists and businesses. The institution plans to rely on online sales and events to keep artists, galleries, and schools operating.\n\n\nThe German government is planning", "The next Biennial should begin with a public program of exploration of the historicity of contemporary art and culture in Berlin, which is already underway. The Kunsthalle Bregenz will stage a new exhibition of works by the curators of the 11th Biennale, commencing in November 2021. A retrospective of the recent works of the artist Peter Andre will also be staged in November 2021.The proposal to invite the public to participate in a “living museum” was first presented by Karlheinzuel Berger in September 2019. The biennial, titled “Life in Motion,” will consist of thirty exhibitions and will be organized as follows:The first exhibition, entitled “The Idea of Life” will present three trans-disciplinary projects, each of which will feature the work of twenty artists, each of whom will be asked to create a new work that has not yet been exhibited. The artist chosen to participate in each project is Klaus-Peter Bohn, who will work with Paul Klee, Jon Pertwee, and Anna Wintour.The second exhibition, titled “The Handwriting Machine,” will showcase the work of thirty individuals, including Shinji Kobayashi, Zoya Jerzy, and", "The next Biennial should take place in the early 2020s.  In a letter addressed to the board of trustees of the Tokyo Metropolitan Museum of Art (MoMA), Richard Goldblatt, president of the museum, said: “We expect a new exhibition to be presented in 2021. The current exhibition will not be enough to convey the richness of the exhibition with regard to the ongoing work of the museum. Therefore, we are currently discussing with the board of trustees of the museum and others within the organization the possibility of organizing a new show in 2021. We are also discussing with the French Minister of Culture, Christian Paradis, the possibility of organizing a show for the Paris Biennale in 2021; and we hope that other countries will also be engaged in this spirit of collaboration.”\n\n\nThe Museum of Modern Art (MoMA), the wildly popular museum located in the heart of Manhattan, has announced that it is expanding the scope of its Black Art residency program through a new initiative called the Black Arts Residency, which will launch in December 2020. “We are thrilled to be able to offer our Black Art residency program to our artists and to our visiting audiences in 2020,” said Marc Glimcher, president and CEO of", "The next Biennial should be held at the new venue in 2021, according to a statement from the biennial. The first biennial was held in Paris in 2011 and ran for three years.SOUTH Asian Art Museum, SingaporeThe institution, which was moved to a new building in Singapore in 2016, is under construction on its first exhibition of work by South Asian artists, which will open in 2021. The exhibition, which will be curated by Liu Yansong, will focus on the history of Asian art and will feature at least thirty works by thirty-four artists. The institution is currently working on a new plan, which will be presented by key curator Sharon Mzemba, to launch the exhibition in the fourth quarter of 2020. South Asian Art Museum\n\nA look inside the private exhibition space behind the seven-star Michelin-starrest Hotel in Beijing, the Foshan Biennale, and the Taikang Triennale, organized by Le Jeune Le Film Monde and curated by Jacques Delvoye.“The Foshan’s first exhibition at the Foshan Art Museum was ‘Escape to the West,’ a group show of the works of thirty-", "The next Biennial should feature an open-air exhibition of “Tall Tales,” a collection of photographs by forty-eight artists. The exhibition will run March 18–March 21, 2020 and will feature the work of forty-six artists. The exhibition will be curated by Paulo Scheidegger (Germany); Stephan Lyg (Switzerland); and Wolfgang Pfeifer (Germany).\n\n\nThe Los Angeles County Museum of Art (LACMA), the Museum of Contemporary Art, Los Angeles (MCA), and the Haus der Kunst, Berlin, announced today the launch of a new initiative, “Year-Round Art,” which will foster a thoughtful and inclusive approach to art in Los Angeles by collecting art from around the world at a yearly level. The initiative will introduce a new $10,000 prize for the most important works created in 2020 and will invite participants to the annual event to create new works. The juried jury, made up of artist and juried former winners of the prize, Gavin Brown; artist and juried Léa De Sousa; and education curator Marieke Moritz, will select the winners.“The completion of this year’s prize ensures the longevity", "The next Biennial should take place in 2019. \n\n\nThe National Endowment for the Arts (NEA) has received a gift of $4.5 million from the Rockefeller Brothers Fund to support the commission of new works by the late artist Lord Suggs, the founder of the seminal visual arts group the Suggs Museum, in the city of Washington, DC. “Behind the great work of art is a long-term legacy of resilience, compassion, and cooperation with artists and artists’ families,” said William Rockefeller. In recognition of his lifetime of devoted service to the arts, the Rockefeller Foundation gifted the Suggs Museum a new $4.5 million grant. George and Mary Suggs will receive a gift of $2.5 million from the fund. The gift also includes the commissioning of an additional $1 million for the preservation of the Suggs Art Museum’s collection and collection programs.The National Endowment for the Arts (NEA) will launch a new version of its award program, the Lord Suggs Artist Grant, which will celebrate the life and work of a single artist and will award $2,500 to each of the fifty states. The program will also focus", "The next Biennial should be held in 2021, and the fifteenth in 2024.”  The fifty-ninth edition of the Shanghai Biennale, titled “Storytelling”\u0097a nod to the festival’s theme of ‘story as narrative,” will take place in the city of Shanghai in 2021 and will be curated by Lin-Manuel Miranda, the star of the upcoming HBO series, Hamilton.\n\n\nNew York’s Metropolitan Museum of Art (MoMA), which recently commissioned artist-activist Nari Ward to create an installation for its new sculpture park, has pledged to invest $1 million into the city’s arts and cultural sector, the New York Times reports. Although the museum has yet to announce the funds, its decision to embrace the local community was made in part to mitigate the city’s economic fallout following New York’s March 11 terrorist attack, which killed eight people and injured hundreds more in Manhattan.The $1 million will fund the development of programming aimed at young professionals, artists, and urbanites; the Museum of Modern Art (MoMA) in New York is currently launching a $500,000 fund for artists; and the Metropolitan Museum of", "The next Biennial should be held at a location that has a confirmed positive air quality index of 30 or greater for at least six months, and where there is at least six months of current participation by people with a lung condition that requires treatment. Ian Miles Cheong is a professor of journalism at the School of The Art of Journalism at The University of The Philippines and the Pilar Art Museum, Quezon City. He is the author of A Brief History of Journalism (University of Texas Press, 2016) and the essays “On the American South,” “Ang Mo,” and “In Defense of the New Left” (University of California Press, 2017). His writing has been published in such publications as the New York Times, the Guardian, the Nation, the National, and the LA Times. His work can be found in the collections of the Museum of American Art, the National Museum of Philippine Art, the Museum of Modern Art, the National Museum of Art, the Museum of Contemporary Art, the Philippine Museum of Art, and the Palawan Museum of Art.\n\n\nThe independent curator and activist Igor Arteta-Guarana, a South American American artist whose work explores political, social, and economic movements in Mexico", "The next Biennial should be held at least once a year.”The 2015 event, titled “After the Fall,” was organized by the New Art Coalition and was curated by Billy Olson, a curator at the Whitney Museum of American Art in New York; Robert Smith, a curator at the Metropolitan Museum of Art; and artist-in-residence Coyne Edward.\n\n\nAccording to a report published today by the Art Newspaper, the Swiss Federal Office of Culture (BOC) said that the first stage of the organization’s proposed overhaul of the Swiss cultural scene will be held this autumn. The BOC will decide whether the reforms are ready for the October 22 opening of the Basel show, which was canceled due to the pandemic.Following a public consultation, the cultural body will then hold an open session of members of the cultural elite, which will be preceded by an exhibition of works that were created before 1957, and will announce the changes in October.Among the proposed changes are a reduction in the number of artworks that can be exhibited at a time and a reduction in the displays of artworks. The BOC confirmed that the reduction in exhibition space will not affect the exhibition of work by artists who have recently been absent, but", "The next Biennial should explore the origins and evolution of the visceral experience of memory, that memory itself is the origin and the essence of the whole, and, by implication, of the whole and the past. It should be in part a re-creation of the spaces and materiality of memory. Most importantly, it should be a memory of the past.It should, ideally, be a memory of the past in all its varied and complex forms, that memory is the proximate cause of the past and hence of the future. We are far too concerned with our own pasts to remember and to care about the past.\n\n\nThe Royal Academy of Arts (RA) in London announced today that it will no longer be hosting a major arts event, the Royal Shakespeare Company (RSC), to coincide with the opening of the newly renovated Tate Britain. Instead, the institution will hold an exhibition of work by contemporary artists at the new Water Lane station, in Stratford, on March 16.The announcement follows a campaign by the organization, which was launched after the RSC decided not to participate in the 2019 edition of the Royal Shakespeare Company (RSC) at Hampton Court in London. “The Royal Academy of Arts is committed to supporting the Royal Shakespeare Company", "The next Biennial should focus on “the possibilities and the intensity of art, culture, and life in the digital age.” The year 2020 will also include a discussion of the possibilities for digital humanities, with a special focus on the new technologies and ways of life—from drones and artificial intelligence to virtual reality and augmented reality—that are reshaping our everyday world.\n\n\nThe National Gallery in London announced today that it is planning to close its doors for a period of six months in order to complete the massive reopening of its National Museum of Europe, which has a grand total of 195 galleries and exhibition spaces and a five-thousand-piece collection. The museum will begin welcoming visitors in March 2021.The National Gallery is currently closed to the public owing to the Covid-19 outbreak, but it anticipates that the cause will be found and that it will reopen in the coming months. The new eight-year strategy for the institution states that it intends to “recharge and re-engage with the changing world by reimagining how we work and live together.”The museum’s board chairman, Grant Shapps, explained that the closure is not a decision taken lightly but one that is made in order “", "The next Biennial should be held at least once every two years. The next Feminaray will be held at the Sarajevo Art and Design Museum from March 4 to March 5. The next Visual AIDS will be held at the Museum of Contemporary Art Vilnius from March 12 to March 14. The next Art and Culture in the City will be held at the Contemporary Art Museum St. Petersburg from March 7 to March 13. The next Art+Science will be held at the Shizuoka Art Museum from March 14 to March 16. The next Art+Soul will be held at the National Museum of Art in Warsaw from March 13 to March 16. The next Art+Spirit will be held in the Azov Region from March 15 to March 19. The next Art+Spirit will be held in the Azov Region from March 19 to March 21. The next Art+Spirit will be held in the Azov Region from March 21 to March 25. The next Art+Spirit will be held in the Azov Region from March 22 to March 27. The next art+spirit will be held in the Azov Region from March 25 to March 29. The next Art+Spirit", "The next Biennial should be held in 2021.\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Isoa R. Marabar as its next director. Marabar first joined the institute in 2009 as a research fellow. He has since risen through the ranks and is currently a senior fellow at the institute. Marabar previously served as a research associate at the Institute of Contemporary Art (ICA), London, from 1985 to 1988. He is also a member of the B.I.I.R. group, a British group of North African artists, and the first president of the museum’s collection committee.Marabar’s dissertation, Darna Diaries: The Arab Female Body, appeared in the September 2017 issue of Artforum. The exhibition, which was curated by Suleymane Adeimant, featured work by seventy-one artists including Ashraf Ismail, Nima Nabavi, and Tarek Atoui. It was also sponsored by the Dubai-born architect Anne Eavis.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Greg Bianchi as its next director. Bianchi comes to the museum from the Art Institute of Chicago (", "The next Biennial should take place in 2021.\n\n\nKirsten Johnson, the Ujazdani artist and educator who is currently the founder of the biennial “Kirsten Johnson: Art in the Age of Black Power” (KJAM), has been selected as the 2020 recipient of the Desmond Tutu Award in support of her work. The prize, which honors an African American artist nominated for the Pulitzer Prize in art history, was established by the Desmond Tutu Foundation in April 2018. Johnson is one of the four finalists for the prize, which is given annually by the Brazilian-born American artist. The other finalists are Mike Kelley, Alan Jacobs, and John Akomfrah.“I’m very excited to be nominated for the Desmond Tutu Prize for my work and my history with friends, colleagues, fellow artists, and students,” said Johnson. “I’ve been a KJAM presenter for over a decade, and the history of the prize is long-running\u0097many of the finalists have been on the platform since the 1990s. I’ve been presented by many great artists over the years, but I’m the first to call myself a queer and a", "The next Biennial should be held in the spring of 2021. The new date will also coincide with the reopening of the Museum of Modern Art in New York.\n\n\nAn artist’s studio in Queens, New York, has been completely sold to a group with connections to Israel. The controversial deal, which involved the sale of a painting by Aaron Siskind, a U.S. Army artist who was imprisoned in Israel for more than three decades, was finalized in a Manhattan federal court today.Siskind’s daughter, Becca Siskind, filed a wrongful-death lawsuit against the family of the prominent Israeli-American architect Shimon Peres, accusing Peres’s firm of facilitating her father’s death. The family’s lawyer, Thomas W. Cohen, countersued for defamation, claiming that Siskind lied about her father’s death to the media.Peres’s lawyer, Robert Ross, argued that the family’s litigation was “distorted by the publicity surrounding ‘Operation Protective Edge’” and that the family has been fighting to get the lawsuit dismissed for years. He also said that the family has been disputing the allegations for years", "The next Biennial should take place in Tokyo in March 2020. Artnet reports that the next iteration will consist of seventeen artists. The theme will be “Rethinking Beauty,” and the artist lineup will be as follows:Apichatpong Mook, BangkokTheater of Operations: Astrid and Helen Liddell, LondonTheater of Operations: Astrid and Helen Liddell, LondonTheater of Operations: Angela Carter, New YorkTheater of Operations: Angela Carter, New YorkTheater of Operations: Angela Carter, New YorkTheater of Operations: Alice Hayden, LondonTheater of Operations: Angela Carter, New YorkTheater of Operations: Angela Carter, New YorkTheater of Operations: Angela Carter, New YorkTheater of Operations: Angela Carter, New YorkTheater of Operations: Angela Carter, New YorkTheater of Operations: Angela Carter, New YorkTheater of Operations: Anne-Marie Simons, LondonTheater of Operations: Anna Atkins, LondonTheater of Operations: Anna Atkins, LondonAnne-Marie Simons, LondonTheater of Operations: Anna", "The next Biennial should take place in 2022. The Manhattan Art Museum, which is not affiliated with the sculptor but has a fair every March, has expressed interest in staging a next iteration of its “Unseen,” its annual celebration of the forty-fifth edition of the Venice Biennale, and has submitted a piece titled “The Elevator and the Eiffel Tower” by João Ribas to the fair.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has added nineteen artists to its roster for its upcoming five-day exhibition “Seventh,” which will run March 4–March 7. Among the works acquired are paintings by El Desperado Hermos, Tarek Atoui, Anish Kapoor, Lisette Biege, and Krzysztof Wodiczko, as well as works on paper by American painters and sculptors Diane Arbus and Arne Glimcher.The exhibition will showcase work by fifty-six artists with an international network of collaborators that includes John Boczczarski, Atte Rönnskog, Kalid Ashtaropoulos, Xandra Boar, and Zoya B", "The next Biennial should be held in 2020.\n\n\nThe Holbrook Museum of Art in Manchester, New Hampshire, has announced that it is expanding the scope of its program in order to include more contemporary artists from around the world. The move has been made in order to better serve artists and collectors in the region. A list of twenty-six artists will be presented in the new exhibition, titled Art, Art History, and Art Theory. The ninety-three-year-old institution will also organize a number of virtual tours.“The Holbrook Museum of Art is at the forefront of the movement for greater understanding of the history and theory of art,” said director Michael Holbrook.  “Its artists are among the most important and enduring in the history of art, and their work has an undeniable impact on the development of our understanding of modern and contemporary art.” The new series will also include an exhibition of work by more than seventy contemporary artists featured in the current exhibition, “Tom McCarthy: An Art Exhibition” (2019–20), and will debut in the fall of 2020.\n\n\nThe Metropolitan Museum of Art in New York has released the list of seventy-five artists who have appeared in the Metropolitan Museum", "The next Biennial should include an exhibition of work by a group of artists that includes Michael Alan Levin, Mark di Suvero, and Edward and Catherine Dobson. The exhibition will focus on the Italian Renaissance artist Paolo Mollino, also known as the 'Thisland Painter', who became a major influence on the American painter-historian Lorenzo Robert.“The Biennial is an important event that will contribute to the cultural heritage of the city of Roma and the state of New York,” said Mayor Bill de Blasio. “This year’s edition will include new and exciting work by some of the most important and innovative artists of the twentieth century. The city’s city-and-state partners are committed to reinstalling these artists’ works in museums and giving them the opportunity to engage our communities through the celebration of their legacy in the coming years.”The Biennial will kick off with a presentation of work by Frederick C. McNamara\u0097a Stanhope-based artist whose work often incorporates collage, photography, sculpture, and performance\u0097at the Newark Museum of Art\u0097and will continue with a light symposium at the North Adams Museum of Art on January 18, 2020. \n\n", "The next Biennial should be held in 2050. \n\n\nThe Make-A-Wish Foundation in Michigan announced today that it will award $5 million in grants to visual arts organizations through 2020. The organization will distribute the funds through a partnership with the artist-run charity the Make-A-Wish Foundation, whose mission is to encourage and provide support to individuals and organizations who wish to pursue creative, artistic, and financial goals through wish fulfillment.“Making a wish is a profound and powerful way to fulfill a lifelong dream,” said foundation president and CEO Ellen White. “We are grateful to our grantees for appreciating the opportunity to share their wish with the Make-A-Wish community. We look forward to sharing with the Make-A-Wish community the results of our yearlong grant cycle in 2020.”Since its inception in 1984, the Make-A-Wish Foundation has awarded approximately $8.5 million to individuals and organizations that have created or are attempting to create works of art. Among the organizations that will benefit from the funds are the Detroit Institute of Arts, which will transform the old Michigan Center into a multipurpose space for the arts; the Michigan Theater Company, which will stage a new", "The next Biennial should take place in January 2020, and the first in March 2020. The exhibition will also include a retrospective of the work of the artist in March 2021. \n\n\nThe British artist Karl Lagerfeldt, whose work often addresses the effects of air pollution on wildlife and inanimate objects, has died at the age of seventy-eight. The biennial, which is currently on view in London, will present “airborne art”—the artist’s first title for the series—as well as an exhibition of work by twenty-one other artists.Born in Glasgow in 1938, Lagerfeldt first studied under Walter de Gruijt, whom he met at the University of Applied Arts, Oslo. Lagerfeldt was invited to Paris in 1960, where he met his wife, the Danish photographer Helene Nielsen. Nielsen took Lagerfeldt to the artist’s first studio, where they created an EPIC project that showcased his work in a series of collages, drawings, and prints.The duo moved to New York, where Lagerfeldt continued his art-making training, and started a family. Nielsen moved to Berlin by way of the former residence of the artist. From the 1980s", "The next Biennial should open in 2021. Krasner’s response to the death of George Floyd in the United States was, in my view, the most surprising thing he says. In a recent interview with Artforum, Krasner said: “I didn’t expect what would happen later on. When we started to make the show, [it] was still very much an experimental, very early work. When George Floyd died, I felt a tremendous sense of loss and sadness. I didn’t want the show to end there, but I hoped that it would continue. . . . I never expected to get to be a part of such a legendary and interesting and important artistic legacy.”\n\n\nThe Union Museum of Art in New York has received a gift of more than 7,000 photographs by American photographer Douglas Adams. Found in a private collection dating back to 1893, the works, which comprise more than three hundred prints, videos, and artworks, include works such as his famous “The Bombing of Paris” (1939), which depicts a cityscape in which the cityscape is being bombarded; “The Man with the Golden Gun,” a moving image of American", "The next Biennial should be held in 2021 or 2022, with the intention of creating a new institution dedicated to the collection of the trans-Atlantic collection. There is also the possibility that the collection of the collection of Jacques Lecoq’s daughter, Giulia Lecoq, and the project of a new museum dedicated to the art of idealism, reflective of modernity.\n\n\nThe Kunsthalle Basel is currently facing a legal complaint from a group of artists whose works were included in a public exhibition at the Swiss fair in January. The takedown notice came hours after the fair, which was closed to the public due to the Covid-19 pandemic, kicked off with a free public performance by the Swiss artist Monica El Deniz. The performance, entitled The Body, featured the body of artist Donna Summer, who was nineteen years old at the time of her death. In a statement, the Kunsthalle said: “Since the article published on by the artist-activists in the journal Artforum on September 16, 2018, we have been working hard to address the concerns of the artists involved. We have been in touch with the lawyers, and it is our intention to take the necessary measures needed for their legal", "The next Biennial should take place in 2020, and the event will launch on January 21, 2021.Willice Foundation in Singapore has also welcomed Patricia Carroll as its inaugural director. Carroll comes to the organization from the Foundation for Contemporary Art (FCA) in New York, where she has served as a curator of contemporary art since 2000. During her tenure, she curated the exhibition “Simon’s Daughters: The Love of Fashion” and the inaugural biennial “The Solutionist/The Surreal” (2018–19) before moving to the Biennial of Asian Art in 2018.Commenting on her appointment, Carroll said: “We are thrilled to welcome Patricia to the three-year biennial program at Willice. Patricia is an extraordinary curator who will contribute to the theme of the biennial, which is the history of pop and fashion, and will develop the themes and the programs for the first time in the 2020 edition. She is also an incredibly talented and dedicated organizer, and we are looking forward to working with her to ensure the biennial is at the forefront in bringing together contemporary art and design.”\n\n\nThe Metropolitan Museum of Art in New York has announced that it has awarded $25 million in grants to", "The next Biennial should be held in 2020.\n\n\nIn a reopening of the Museum of Modern Art (MoMA) on January 17, 2021, the institution will reopen with a series of new exhibitions and screenings of works created in the former warehouse space of the Chrysler Museum. The show will feature 20 new works by forty-six artists, including Adrienne Edwards, Wolfgang Klee, Sam Gilliam, Robert Irwin, Karl Lagerfeldt, and Lorraine O’Grady, and will be aimed at the largely Asian art-world community. MoMA also plans to move the institution’s permanent collection to a new home in the former site of the old UAW plant.The institution’s first exhibition of works created in the former space, “The Experimenter.” The show will run from January 16 through February 17, 2021. The museum will also mark the ten-year anniversary of the opening of the institution’s first exhibition of Asian art, “The Shadows of Time.” The show will showcase seventy-five works by thirty-six artists.The opening of the exhibition is a continuation of the nationwide campaign to raise $1 billion for the $1.2 billion renovation of the Museum", "The next Biennial should be held in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has completed the construction of a new 250,000-square-foot, state-of-the-art performance space that will address the critical issues of contemporary life with a mission of social justice and community engagement. The new home for the Museum of Modern Art’s new biennial “The Sustainability of Art” will be inaugurated in the museum’s massive Georgia O’Keeffe–designed building on West Twenty-Second Street in the Museum of Modern Art’s new building on West Twenty-Third Street in Manhattan.“Over the past year, MoMA’s leadership team has worked tirelessly to enhance the physical and intellectual capabilities of our staff, create new opportunities for our artists and visitors, and identify new ways to support their cultural livelihoods,” said museum director Daniel H. Weiss. “It is an honor to be able to inaugurate ‘The Sustainability of Art’ with the dedication of our talented and dedicated artists. We look forward to welcoming our audiences and our community to the new home.”The completion of the $115 million museum�", "The next Biennial should be convened in the first quarter of 2020.The institution’s new president, Naima J. Anwar, said: “We are thrilled to be working with such a talented and dedicated team of curators, trustees, students, alumni, and the entire Biennial community to continue to present the best exhibitions possible. We are also delighted to host the first exhibition of the new wave of Australian art in the UK in 2020.International collaboration and strategic vision are now being nurtured within the galleries to present similar works that represent the possibilities of the contemporary world. The new project, ‘Pace Gallery: The Future Is Present’, will harness that spirit of collaboration and creativity to present work that explores the boundaries between form and content. The exhibition will feature the first works by artists from Africa, the Americas, and Europe.”Rendering of  by Michael Snowdon. Courtesy of the artist.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Nathan McGraw as its next executive director. McGraw comes to the museum from the Los Angeles County Museum of Art (LACMA), where he has served as interim director since March 2020. He succeeds curator Michael Lacey,", "The next Biennial should be held in 2021. Baltimore’s Feminine March, 2019, will return for its 2019 installment, which will be held at the Inner Harbor.  Tickets for the event will be sold on the website of the event and will be available on Wednesday, March 20 at 10 AM. “The future of our city is at stake,” said Mayor Stephanie Rawlings-Blake. “This is a moment of great change for our city, and for the country, and I want to hear from you, our city’s residents, about what you want from our city. I want to hear from you about what it means to you, and for you, and I want to hear from you about what we can all do to make Baltimore a better place.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that Antonio Campos has been named director of the nonprofit organization. His upcoming three-year contract will run through June 2022 and will involve the organizing, curating, and exhibiting of demonstrations, installations, books, and other artworks.“We’re thrilled to welcome him to the museum,” said Museum director", "The next Biennial should aim to return the region to its 'golden age' by celebrating the BIP; to create a strategic plan for a possible return to the region; and to present a new platform for artists and cultural workers to collaborate and exchange ideas and experiences. “The future of the Biennial lies in the hands of the artists who have created the work of the Biennial in the past, and in the hands of the Biennials for the future,” said artistic director Marc Payot. “I see the future for the Biennial as a way of ensuring that artists and cultural workers in the region have a strong voice in shaping the future of Paris’s art and architecture.”\n\n\nNearly two hundred artists, writers, and other arts professionals have endorsed Hillary Clinton for president of the United States, according to Artnet. With the election of the first woman to the Oval Office, things are looking good for female artists and activists. However, an Ipsos poll conducted by the election watchdog group People Before Politics has found that only 38 percent of voters have a favorable opinion of female politicians and only 43 percent trust women to run the country.As women face numerous obstacles in their attempts to advance in politics—including", "The next Biennial should focus on new works by two of the four artists present: Artistic Director John Albright and director of curatorial affairs Andrea Bochereau. The 2020 edition will feature a selection of work by Sarah Sze, a Canadian-born, Parisian-born, and Chicago-based artist who works in both film and sculpture, and will run from May to November. One of the subjects of the museum’s inaugural Biennial was the human body, and the next will be art, technology, and technology art, respectively. Arts Minister Manisha Desai said: “The vision of this exhibition is to organize a new way of seeing art. It’s about envisioning a space for communication, to be a bridge between the senses and a way out of what it means to be an artist.”\n\n\nThe Institute of Contemporary Arts (ICA) in Paris has appointed José Pedro Carreño as its next president and CEO. He succeeds Felipe Barke, who has led the institute for nine years. The appointment was made in an announcement made on March 12.“We are delighted that Pedro has accepted the post, which will bring him important new opportunities, and is dedicated to working with the", "The next Biennial should also include an exploration of the interdependence of art and artmaking, and the autonomous practices of artists and art historians.____________\n\n\nA new double-decker, glass-enclosed research center is coming to the Museum of the Arts in the City of New York. It will include an augmented reality (AR) research library, a virtual reality (VR) museum, and a new live music venue.Dubbed the Museo de Arte Contemporáneo (MOC), the $125 million museum will feature 55,000 artworks from the collection of the Metropolitan Museum of Art (MMCA), as well as curated exhibitions, digital projects, and live performances.“Remaining an MOC museum is an enormous challenge,” said museum director Daniel H. Weiss. “We are very aware of the museum’s longstanding commitment to support the collection and exhibitions of works by artists in New York City, and in general have been supportive of the expansion of MOC’s holdings in recent years. However, we knew that this would be an extraordinary undertaking and had no choice but to support it.” The newly commissioned works will be mounted in the museum on a glass lectern in", "The next Biennial should take place at the Guggenheim in the autumn of 2021. The artists selected for the 2020 event are: Tadao Ando (Japan), Jennifer Barry (USA), Joshua Chaudhuri (USA), Nina Davis (Australia), Marcelo de Almeida (Argentina), Rory Fisk (USA), Rory McLean (UK), Rory Wodiczko (Austria), Rory Mulholland (USA), Sadie Red Star (USA), Sara Zweggs (USA), Tanya Van Beukeren (USA), Wangechi Mutu (South Africa), Zahra C. (Kazakhstan), Zhava Aliyeva (Russia), Zha Shiji (India), Zha Zheel (India), Zha Yusof (Russia), Yelena Yemchuk (Russia), Yuri B. (Russia), Zinaya Baghramian (Australia), Zinaya Biswas (Australia), Zinaya Bobrov (Russia), Zinaya Chabanova (Russia), Zina", "The next Biennial should be held in 2020, but the organizers say that they are still assessing the implications of Paris’s recent vote to leave the European Union, which could have an impact on the next edition. “We weigh carefully the possible effects of radical change on our way of life and our work,” director Marc Payot told the Art Newspaper, speaking of the upcoming BIMP, and “I take no pleasure in saying these things, but we are doing what we can.”\n\n\nThe Fine Art Museum Houston (FAM) has announced that artist and educator Adam D. Weinberg has been selected as its inaugural recipient of the National Endowment for the Arts’ Homage to the Arts’ Award. The $250,000 honor, which was established in 2009 to honor Adam Weinberg’s achievements in advancing the field of scholarship, has been awarded annually by the NEA. Previous recipients include Christopher Wool, Joyner & Wirth, and Werner Herzog, among others.“Since its inception, the NEA’s Homage to the Arts Award has been transformative, inclusive, and profoundly supportive of artists working in the field, fostering their vision and elevating their work,", "The next Biennial should focus on the history of the museum’s collection and on the development of the institution’s collection in the twenty-first century. It should also take a broad and ambitious view of the museum’s collection, in helping to bring together the works of some of the most important artists of the twentieth century. The institution will inaugurate the program with a presentation of work by Jonathan Alderson and Jorge Casolari, who made a lasting mark on Biennial history with their exhibition “Prometheus,” which opened in the exhibition space of the Metropolitan Museum of Art in New York in 1979. The Biennial will also celebrate the institution’s thirtieth anniversary this year and will include an exhibition of work by artists whose works were chosen through a public vote.\n\n\nIn a ruling that could prove significant for artists and the cultural sector, the United Kingdom’s Information Commissioner’s Office (ICO) has decided to deny the artists' appeal for an immediate and permanent halt to all work by the Stevenage Boys’ and Girls’s Dance Company (SAG) until it complies with a series of new social distancing guidelines set by the government. The group, which also includes", "The next Biennial should take place in 2020. “Themes of travel and transport are powerful and profound in their own right, but the properties of the vehicles themselves are often far-fetched,” noted the artist. “In this context, an art museum becomes a great laboratory, and a museum becomes an instrument of travel and transport\u0097a cultural laboratory,” he added. Ivan Albright’s concept of a museum as a ‘living laboratory’ was captured in a photograph he took in 1937 of a biennial of Soviet art at the Museum of Modern Art in New York. The work, titled Trauma, became a seminal photographic statement of the ‘spontaneous’ potential of art, and the ‘collective nervous system.” In 1941, Albright and Schubert published Via Art and Space (Dietrich Heimer & Albrecht Corne), an illustrated history of the art of travel and transport. The book quickly became a best seller and remains a classic work in its entirety. In the early 1950s, Albright and Schubert took up the banner of the Institute for Technical History, an outgrowth of the Institute of Contemporary Arts in Berlin", "The next Biennial should have been on display at the museum years ago. It still is. The building is currently undergoing a major expansion and renovation by the Musée d’Arles in Paris. \n\n\nThe National Gallery of Canada has appointed Ellen Braser as its new deputy director for collections and exhibitions. Braser comes to the institution from the Royal Ottawa Museum (ROM), where she has served as deputy director since April 2019. She will assume her responsibilities in January 2021. Braser will succeed Diana Wynne-Haas, who will retire in April after ten years at the museum.During her tenure, Braser has guided the institution through its expansion, the closure of the Noguchi/Atkinson Branch in August 2020, and the reopening of its new building in October 2021. She will also assume the role of chief curator of contemporary art.“For many years, we have been committed to reopening the National Gallery of Canada as a significant cultural destination for Canadians and visitors from across the world. We are now at a pivotal point in our history as we embark on the reopening of our new building, which will transform the National Gallery of Canada into a world-class museum,” said Braser. “I’", "The next Biennial should be held next year. The earliest the city can stage an event this century is 2022, when it will be seventy years old.\n\n\nSince its founding in 1972, the Museum of Modern Art (MoMA) in New York has been an important vehicle for the collection and display of work by seventy-six artists from around the world. Although it has expanded dramatically over the last sixty years, the institution still comprises a mere fifteen percent of its original collection. In the process, it has become a fixture in the cultural landscape of a city already teeming with creative talent, a vital cultural hub for urbanites, and a major asset to the cultural community in the process.The twenty-six artists whose works will be included in the twenty-third edition of the Museum of Modern Art “The Artists” are as follows:Adria Ghisallo (Italy)Adriana Azzopardi (Italy)Ajaj Farsi (Iran)Alexander Gray (United States)Alexander Heilbron (United States)Alex Kristeva (United States)Alexander McClean (Australia)Alex Penner (Germany)Alex Schulz (Germany)Gabrielle C. Mürk (Germany)Agn", "The next Biennial should include a consultation with the editorial board of the upcoming issue of Dries Degenkuyper’s magazine, “Onwards: Contemporary Art from the Third Reich to the Twenty-first Century” (2017) and a presentation of the exhibition “Between Two Worlds,” which is currently on view at the American Ballet Theater in New York. The exhibition will also include the Biennial’s first digital experience, a piece by Markus Rottenberg, which will be shown as part of the 2019 exhibition “Cinecittà di centofi di Modena.”The programme will also include a new introduction of the exhibition “Mediterranean Contemporary Art,” curated by Kari Markow of the Danish art museum in Copenhagen and directed by Katja Sjønnsen. The exhibition will be on view until November 10. The 2020 edition of the Biennial, which will take place at the Copenhagen Art Museum, will be staged at the Copenhagen Art Museum from November 29 to December 8. The show will also introduce the new pavilion, “The Wasteland,” which will be on view until December 24. The exhibition will also feature the work of twenty-six", "The next Biennial should be held in 2021. There are currently three articles published by scholars in the International Journal of Modern Art (IJAM) on the dissolution of the State Museum of Modern Art in Cairo in the last month of May. The dissolution of the museum was triggered by the fall of the Islamist government—which ousted former President Mohammed Morsi—and the ousting of the Muslim Brotherhood. The ousting of Morsi and the Islamist-led government prompted the United Kingdom to sever all ties with the institution and its director, Bruce Barry.The IJAM is currently working on reopening the exhibition space at the Egyptian Museum of Art (EMCA), which has been closed since March 13, 2020, for a period of seven weeks. The organization will also be working with a team of archaeologists to assess the conditions for the recovery of the Louvre.The dismantlement of the State Museum of Art is part of a wider project to remove Egypt’s cultural heritage monuments, which were dedicated to the Ottoman Empire during the country’s imperial rule from 1922 to 1956. The project, which was inaugurated by Prime Minister Ibrahim Mehmet Ali El-Sissi in 2015, involved the removal of ten thousand statues in the province of Saada between 2019 and", "The next Biennial should be held in 2020.  The first was held in 2019, and was attended by more than sixty thousand people from eighty countries. Architects and curators will be able to choose from a list of ten artists, selected by an international panel, as well as from a range of themes, including architecture and design, photography, and performance, and will be able to begin exhibiting work in the Autumn. The exhibition will be held at the Diller Scofidio + Renfro–designed Biennale di Carrara in Rome in 2021. \n\n\nItalian artist and designer Giulio Liguori, who created a series of monumental, 70,000-square-foot homes for his clients in the city of Herma, in northern Italy, has died at the age of eighty. His other notable projects include the living-room-size houses of artist-friends Luigi Cipolletta and Stefano Cattelan (the latter building his own, Spanish-inspired, villa), where he spent most of his career, and The House of the Viscount, a project that incorporated the homes of architectural icons Gio Ponti and Alejandro Campos.", "The next Biennial should focus on contemporary issues of memory and memory politics, including the various ways in which memory is used as a weapon against people. While the theme is not new, it is still substantially different than the themes of the past two years. It will focus on the impact of trauma on memory, the nature and nurture of memory, and the concept of remembrance. The theme will be reconsidered during the performance. The theme will be revisited in the upcoming exhibition “Memory Politics: The Politics of Memory” at the Visoka Art Museum.\n\n\nThe International Committee Against Taylorism (ICAT) has released the 2018 edition of its International Conference on the Fossil-Fuel Cycle (ICFCC), taking place in Dubai from March 7 to March 10, 2020. The forty-third edition of the event will focus on “The Fossil-Fuel Cycle: The Anthropocene and the End of History,” with this year’s theme being “Time, Space, and Material.” The conference will be held at the Shejaiheb Museum of Art in Dubai.Established in 2004, the ICFCC has sponsored more than 300 international scholars and activists to address issues surrounding the fossil-fuel", "The next Biennial should take place in Helsinki in late November or early December, at the Cultural Center building. I've heard that the current exhibition is popular with tourists from the US and Europe. The event will be held outdoors in the city of Helsinki, and will include work by as many as twenty artists. The artists selected for this year’s event are: Anna-Sophie Barch, Ethan Claussen, Jumpei Będżeń, Lynda Brinn, Lassar Claussen, Marinella Cipolelli, Nina Cipolelli, Lucia Cini, Lucia Caruana, Lydia Dobson, Lucia Delia, Catherine Elienne, Osman Geisz, Kjartan Geisz, Agnieszka Gama, Erika Heimer, Livia Heimer, Alysha Hildegaard, Elizabeth Hooper, Aiden Hinds, Kate Hockney, Sarah Lund, Richard Aspinall, Markus Memmes, Laura Minton, Lazette Muldoon", "The next Biennial should focus on the artistic and social territory of the European Enlightenment,” the president of the institution, Harald Szeemann, told the Art Newspaper. “The exhibition should be a celebration of the important composers and thinkers of the Enlightenment. We must begin by demonstrating that the new intellectual and cultural life of Europe can and will be realized in the future.”The 2020 theme of the biennial is “Arts, Technology, and Society.” The exhibition will be comprised of two sections, “Arts and Technology: Technology in Transition” and “Arts and Technology: Beyond the Present.” The first will feature twenty new works by twelve new artists, including Haegue, Franck Différie, and Noguchi, and will showcase the works of the first twenty years of the biennial. The second section will consist of twenty works by twenty-two artists from sixteen countries and will showcase work that is currently unavailable.The artists chosen for the 2020 exhibition were announced on March 9, and the full list of participants is as follows:Alexander Wirz, Berlin (June 17–June 21)\n\nAlberto Zocca, Milan (July 4–July 5", "The next Biennial should be held in mid-June. The exhibition will feature works on a variety of subjects ranging from classic and contemporary art and will be presented by artists and collectors from around the world. During the festival, the artist-run museum will present a number of exhibitions, including a presentation of the artist-designed works of artist-worked long-term collections, and a presentation of original and selected works from the exhibition “100 Years of Biennial Art” (2017), a biennial of art that explored the representation of women in art.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Samantha Hillier as its new associate curator of modern and contemporary art. She comes to the museum from the Archeology and Anthropology Department where she was the assistant curator of show studies and special projects. Previously, Hillier worked as the program director at the Center for Art and Performance at the Museum of Contemporary Art in Los Angeles and as the curator of contemporary art.“Samantha brings with her a wealth of experience and expertise in modern and contemporary art,” said director of exhibitions and programs Alex Kuzma. “Her new role will allow her to expand and deepen the museum’s focus on the", "The next Biennial should be held in 2021. \n\n\nErica Mayhew, the director of the Museum of Fine Arts (MA) in New York, has resigned from the position of chair of the committee overseeing the institution’s reopening. “Erica has been a strong advocate for the MA, and we are grateful for her service to the museum,” said Mark DeBonis, chair of the board of trustees. “Her remarkable curatorial career has enriched and developed our collection and made it a valued home for the museum’s art.”In addition to overseeing the program of exhibitions and residencies, Mayhew also organized a series of public programs, including the “Ella and Edie” (1962–1963) exhibition, “Cindy and Edie” (1978–1979), and “Eddie and Edie” (1985–1986), and served as the chair of the board of trustees for two years. “I’m so proud of the work we’ve done and the accomplishments we achieved,” she said of her tenure. “MA’s collection is a living, vital thing for New Yorkers.", "The next Biennial should take place in December 2022. The 2019 edition, which was curated by João Barbosa and scored by Aníbal Alves, was curated by Pia Camil and scored by Felicity Hammond. The exhibition, titled The Unseen, was organized by Félix Rubal and celebrated the work of Mary Beth and Germaine Prouvé. The 2020 edition will be curated by Rainer & Rainer and will feature works by the artists in the exhibition, including the works of Alfredo Camil, João Barbosa, and Arash Vardi.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to change its name to the Museum of Modern Art (MoMA) East. The announcement was made during a presentation of the institution’s new collection, titled The Antecedents of Modern Art, at the museum on Wednesday, March 12. Since the event was held at the museum, a former textile factory, and the textile factory came under the company’s management, the name change was made in recognition of the textile mill’s former 300-worker workforce.“The museum is changing to reflect the historical museum of the", "The next Biennial should mark the centenary of the founding of the National Gallery in London. The ten-day event, which will be held at the National Museum of Scotland, will take place in the autumn of 2020. One of the new initiatives is the National Gallery of Canada’s new Digital Hub, a new digital platform that will showcase the works of emerging and established Canadian artists and will feature a selection of contemporary art. On the first day of the program, the National Gallery of Canada will present Paul Gauguin’s Art of the Unknown, 1910, on view until November 22. The exhibition will include a selection of works by twenty-seven artists, including David Hockney, Carlos Delgado, and Haleena Hishley, as well as a selection of pioneer works by artists such as Hélio Álvarez Machado, Leigh Anne McEnery, and David Salle.The new digital hub will have an online version as well as an interactive version that will allow visitors to enter their own lives into the digital environment. The artists participating will be offered a platform to share their works and receive a digital version of the artist’s studio. They will also receive a digital ticket to the opening ceremony and", "The next Biennial should be scheduled for early 2021. The exhibition will be hosted at the Makarani Art Museum in Nara, Japan, and will remain closed until March 22.\n\n\nThe National Gallery of Canada (NCA) in Ottawa is planning to move its current exhibition “Prudence of a Young House,” a season-long residency program that has drawn visitors from across Canada and the United States,’s southwestern states, since it was founded in 1994, to a new home in the city of Montreal.The exhibition, which has been held at the museum since 2016, will now be presented through an online-only platform. The NCA will also display the first artist-designed home for the program in the United States, which will take place at the Zendel Center in downtown Washington, DC, next month.The move coincides with the reopening of the National Gallery of Canada (NGC). The institution, which has been remodeled and expanded for over thirty years, opened to the public in Montreal in 1996. Since then, its exhibitions have been staged in the United States, at the MCA in Bangkok, and at the Kunsthalle Basel in Switzerland. In addition to its residency program, the NCA has", "The next Biennial should take place in November 2020 and will be hosted by the Borthwick Gallery in London. It will cover the history of women artists from the Coachella Valley and will highlight the work of twenty-five artists from the Biennial of Modern Art, which will be held at London’s Barbican Centre in December. The event will also include a selection of works from the museum’s collection, and will be organized in partnership with the Wellcome Collection. The full list of participating artists is as follows:Diana Alighier, GermanySarah Alighier, GermanyEmma Alighier, GermanyLilly Alighier, GermanySara Auther, GermanyYara Balint, GermanySally Bass, USAMara Bliss, USAHannah Blandy, USAAmanda Bell, USAEmma Bell, USAHailey Bergman, USAMarianne Berger, USAHayley Barlow, USALeslie Bates, USASusan Black, USACara Black, USALily Black, USAPamela Barlow, USALily Bass, USAMeg Baker, USATanya Barnwell, USADavid Barrett, USADouglas Barr, USAKathleen Barry, USAKaitlyn Bouchard,", "The next Biennial should take place in 2020, but the project’s director, Eva Presenhuber, said that it has been in the works for several years and is still in the preliminary stages. “This year’s exhibition is the first launched after the fall of the Berlin Wall, and it will be a historic event for the city of Berlin, the city of the former East Germans, and the city of the future,” said Presenhuber. “The next Biennial will be an international event with exhibitions and performances from the United States, Europe, Australia, and the United Kingdom coming from different countries and countries’s diverse cultural traditions.”\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of more than two hundred paintings by Michelangelo Antonioni\u0097including a work by Greco-Boclectic artist Carla Zivkovic, which will go on display in “The Dying Art of Art” as part of MoMA’s ‘Art of Tomorrow:” initiative. The gift includes works by artists such as Ed Moses, Vito Acconci, and Osvaldo Dallò, as well", "The next Biennial should be in 2021.\n\n\nThe Tenement Museum in New York is planning to open a new outpost in the city next year. The museum has named the building after the Tenement Museum in Harlem, which is slated to close this fall. The space will be located at 130 Spring Street and will be inaugurated by a performance, an exhibition, a book signing, and a Q&A session, which will be preceded by a tour of the museum.“The new space will be a living museum, with a full-time staff and a permanent collection of American art,” said museum director James Cuno. “While the museum will remain open for visitors to enjoy its expansive galleries and rich exhibition program, the space will also become an important cultural and artistic outpost of Harlem, as a hub for arts and culture.”The institution will also celebrate its fiftieth anniversary this year. On the front page of this month’s issue of Artforum, David McAllister wrote about the new museum, calling it “the quintessential modernist institution.” Cuno told McAllister that the tenement museum featured artworks from the ’80s through the ’90s. Its collection", "The next Biennial should commence in 2021 and will include twenty-two artists and thirty-six contemporary works.  The artist-run biennial will be housed in the Arts and Design district of the Guggenheim, and will be led by curator Humberto Barajas, the longtime director of the BIC and the Guggenheim, and Roman Polizani, the curator of the Contemporary Series. The exhibition will consist of a number of events, including the opening of a new exhibition featuring work by women artists; a new Roundtable for Contemporary Arts; and the reopening of the Guggenheim Register.The artist-run biennial also received a $5 million donation from the Kaufmann Foundation, which is a division of the Künstler family, which owns the Ambersdorf and Berlin insurance giant Allianz. The donation will enable the biennial to continue with its programming and in-house curatorial staff as it looks to raise additional funds. The awardees of the 2018 biennial are Bram Cohen, Ella Cooper, Valeria Catellani, Gianmarco Cipolletta, Hernán Cortázar, Pedro Henri Cozier, Marcus Günther", "The next Biennial should be held in 2021, the biennial’s director, Loring Randolph, told the Art Newspaper. The next iteration of the inaugural exhibition, “Between the Sun and the Moon,” is scheduled to open in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has released its recommendations for the twenty-sixth edition of the Met Galerie Biennale, which will take place next fall. The exhibition, entitled “The Work Is Never Done,” will draw from the collection of the German artist Gottlieb Scherer and will feature more than sixty works. The seventy-fourth edition of the exhibition will be held at Duomo VII in Los Angeles in December 2020 and will center around sculptors Marina & Augusta Kudacki and Mihai Kudacki, whose multi-million-dollar installations, including the works of the family, will be included in the seventy-fifth edition, “Aurora: From East to West,” which will open at the Museum of Modern Art in November 2021.“The exhibition will include a new collection of Kudacki’s abstract sculptures,” said Elizabeth Lee,"]