["The next Biennial should be held during the first week of May.The bid for the digital platform comes amid the ongoing crisis caused by the coronavirus, which has infected more than 170,000 people in China and has sickened at least 6,600 of them in Shanghai. The pandemic has also led to closures of several major art institutions across the country. The Art Newspaper reports that the Hong Kong Art Museum has also announced that it is considering shutting its doors until the pandemic ends.The decision to close the institution comes after Hong Kong City Hall issued a statement on August 26, claiming that the crisis is not easing and that Hong Kong’s government is actively working to enforce restrictions on the movement of people, goods, and goods’ cargo. The statement also claimed that Hong Kong’s border guards are being made more powerful and is urging people to shelter in place.Many countries, including the UK, have since expressed their solidarity with Hong Kong and urged Hong Kong’s government to do more to protect Hong Kong businesses and residents. British Prime Minister Boris Johnson said: “I would like to see Hong Kong remain part of China. Hong Kong has a special place in China’s history and I hope it continues", "The next Biennial should see the return of the work of more than three hundred artists and will be held at the Immanuel Velayat—a UNESCO World Heritage Site in Paris—in 2021. \n\n\nToledo’s Carnegie Art Museum is now accepting donations of works of contemporary art. The organization will gift twenty works by artists such as Austin P. Medina, Julie Mehretu, Tarek Atoui and Kamel Adham from the institution’s collection. “The collection is a cross-section of the city’s art history, from contemporary, at this time, to more than two thousand years old, and will draw on the museum’s holdings of Palestinian and Middle Eastern artists, as well as international artists from throughout history,” said Michael Rozin, the museum’s director.The works will be displayed in a three-dimensional exhibition curated by museum director Loring Randolph. The show will showcase the work of twenty artists in addition to the historical works of forty-five of the museum’s holdings, including Michael Kors, Frank Gehry, and Richard Diebenkorn. “The museum is a source of inspiration for many,", "The next Biennial should focus on how the complex interdependence of art and technology, and the interdependence of physical, social, and cultural spaces, shapes our everyday life and the world we live in—and how art and technology are inherently linked. We should also consider how the relationship between art and technology, and art and technology itself, is one of centrality, dynamic, and exploration. \n\n\nMichael Burnham, the British artist best known for embodying the ideals of futurism and radicalism in his work, has died at age eighty-two at his home in Burton, near Liverpool, England, from complications caused by Parkinson’s disease. Formerly known as the Futurists, the group of artists formed in the 1950s that would eventually become the Modest Mouse movement in the United Kingdom, Burnham was born in 1930 and raised in a Christian fundamentalist household in Lancashire. From an early age, Burnham was enveloped in the tenets of the Christian religion, attending church regularly and reading the Bible at night. He began his artistic career by painting in his bedroom, but found his artistic outlet in the wilds of the Somerset countryside. By the 1970s, he moved to London to complete his studies at the School", "The next Biennial should be held in the fall of 2020, but has yet to determine a date.  The biennial is a collaboration between West Japan University and the North Korea Cultural Center, and was organized with the help of local organizers and the North Korean government. The institution will be located in a former steelworks in Pyongyang, and will host sixty-two contemporary North Korean artists from twenty-six countries.\n\n\nThe Institute of Contemporary Arts (ICA), the Japanese museum of modern art in Tokyo, has appointed attorney Megumi Ogawa as its next president. Ogawa will take up the post in January 2021. She succeeds Shigeo Nakagawa, who was appointed president of the institute on November 14, 2016, and who has led the institution for the past eighteen months.“Icasa is currently undergoing a major transformation,” said Ogawa. “Icasa’s new building, now being constructed, is designed by the architect Tsutomu Nakanishi, and the exhibition space will be a multipurpose exhibition space, with a museum-like setting. Icasa will have many things that are new. Icasa’s new exhibition space, Icasa Gallery, will be an", "The next Biennial should be held at the Centre Pompidou in Paris in 2021. \n\n\nEpiscopal Church Secretary of State Philip Crowley has officially requested $2.2 billion in emergency aid for the United States following the devastating wildfires that have ravaged much of the western United States. While the funds are not large compared to the $4.7 billion committed by the Catholic Church following the devastating fires in China, the United Kingdom, and Northern Ireland, the fires are still threatening the future of millions of acres of forestland and are threatening to become much worse. Crowley made the request in a letter addressed to President Dieter Ersland, Bishop Timothy Dolan, Archbishop Gerhard Müller, and the bishops of the Diocese of Washington, DC, which was sent on Wednesday. Crowley wrote: We are deeply concerned by the current situation in America and the challenges ahead. Our immediate concerns are the health of our families and communities, the financial well-being of our institutions, and the climate emergency. We hope that you will convene and consider the letter of Bishop Crowley. The American people are sick and tired of hearing about and reading about how we fund disasters. We are simply doing our part to help keep the", "The next Biennial should focus on the multiple structures within the museum that have contributed to the Biennial's success and should foster a sense of community and exchange between the visitors and staff. The biennial will remain open until September 17 at the earliest. The institution will also reassemble the pieces that were lost during the devastating fire that tore through the museum in March.\n\n\nThe Carnegie Museum of Art in Pittsburgh has received a gift of thirty-six works by twenty-five artists, including Nathaniel Babington, Frances Dawes, and Ellen Philipson, from the Carnegie Foundation. The gifts were made in 2017 and 2018, respectively, and were made by artists who were active in the city prior to the formation of the Carnegie Museum of Art. In addition to the works, the foundation is giving the museum the opportunity to earn $2.5 million through the sale of works by the artists whose works will be included in the 2021 edition of the exhibition “Coachella Valley.”The Carnegie Museum of Art is also offering to return five works by artists whose works are currently on display in the institution’s former location at 780 S. Broad Street. These works were purchased by the foundation in 2017 and 2018, respectively, and are currently housed in its", "The next Biennial should begin as early as March 8 and have a ten-day running time. The next edition will be held at the Art Institute of Chicago (IIC) from March 11 to March 14.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is planning to hold an open-air exhibition dedicated to Pablo Picasso, which was scheduled for March 23–March 28. The exhibition will be titled Pablo Picasso: Life, Art and the Art of Painting, and will showcase forty works by the Spanish surrealist.The institution also revealed that it will be introducing new content and projects in an attempt to reach new audiences through digital platforms. The first phase of the program will focus on promoting the exhibition and its exhibition of the first work from the exhibition, Life, which was presented by artist Richard Avedon and will be on view through March 17. In the second phase, MoMA will work with the artist’s son, Pablo Picasso: The Last Days to create an immersive virtual reality experience, which will be followed by The Restless Life of Pablo Picasso, which will open at the New York Public Library on March 26. Both works will be presented in conjunction", "The next Biennial should be a global celebration of the spirit of the twentieth century; it should celebrate the human spirit in all its beauty and variety.”\n\n\nThe Dallas Museum of Art (DMA) announced today that its new building, which is currently being constructed by the French firm A.C. Mather, will be named the A.C.M. Walker Art Center. The project is part of a larger plan to transform the DMA into a major American art museum. Initially slated to open in 2022, the museum has been pushed back to 2021, and this fall, the museum will re-enter its construction phase.“The A.C.M. Walker Art Center is a transformative, community-building project that will transform the DMA into one of the country’s leading cultural destinations,” said museum director Elizabeth Anne Hayashi. “We are proud to support this project with new funding and new partnerships, while working with the A.C.M. Walker Art Center to build on the visionary work of Joan Miró and the DMA’s distinguished curators. We hope that this will be the beginning of a new chapter for the museum.”Inaugurating the new building will be", "The next Biennial should be held in the West Bund, in the city of Munich, in 2021. The pavilion was selected in collaboration with the City of Munich, the Regional Institute for Architecture, Design and Curatorial Studies (RAW), and the minister of culture, Sigmar Gabriel, who also chairs the city council. The first show, which was staged by the firm Gogstädels Gallery in the city of Krefeld in 2017, attracted more than 150,000 visitors.\n\n\nThe National Contemporary Art Museum Birmingham (NCAB) has announced the curatorial team for its 50th anniversary edition, “The Arts and Past.” The fair will follow its theme of “The Future of Art” and will run from September 9 to September 12 in 2020. Its inaugural event, “The Future of Water,” will take up the theme in August 2020. The 2020 edition will be held at the NCAB from September 8 to September 12 and will feature work by sixty-eight artists, including Asha Rangarajan, Carlos Barbera, Matthew Barlow, Amandeep Barua, and Kamal Hassan, among others from the United Arab Emirates, Jordan, and India.The full list of", "The next Biennial should take place in 2020.\n\n\n\n\n\nThe National Center for Art and History (NCAH) in Oklahoma City has appointed Peter Adler as its next director. In his new role, which was created to oversee the Museum of Art, Adler will oversee the museum’s restoration of a three-story, pre-Civil War–era Civil War-era arena that was a mainstay of the city’s Oktoberfest celebration.The institution also plans to begin a major expansion, which will add another forty-eight acres to the museum. The $30 million overhaul will include the creation of a new visitor experience, a new campus, and a new exhibition space. The project was financed with $14 million from the National Endowment for the Arts.“Peter is excited by the NCAH’s future and committed to making the NCAH even more inclusive and welcoming for everyone by promoting an arts-based economy that supports and nurtures the NCAH’s mission of celebrating Oktoberfest, the historic traditions of the Germanic tribes, and the perseverance of Oktoberfest’s Founders, Arthur and Otto Bauer,” said NCAH director John Efstathi", "The next Biennial should be up and running by the end of the year. Interview with author, curator, and curator Arifa Elzaby, curator of southern African art and curator of the forthcoming exhibition “The Southern African Burial,” is available on the website of the Jamestown Museum, which is housed in the old Parish House in Bristol. The upcoming exhibition “Southern Africa: Art and Politics” will begin with a presentation of works by the curators Ian Hamilton, T.J. Dickson, and Nilo di Piro, and will travel to the National Gallery and the Museum of Contemporary Art (MoCA). The show is slated to run until March 22, 2020. \n\n\nThe Estate of the late sculptor Noguchi, who influenced many of the artists whose works have entered the collection, has agreed to sell its holdings to an independent auction house in New York. The move comes amid the ongoing legal battle between the estate and the Turner Prize, which is threatening to sue Noguchi’s heirs, the Melsyan family, over their purchase of the artist’s work.The estate announced that it sold its current collection of more than one hundred works, which consists of four million", "The next Biennial should be held in 2020.Byron Dalladay, professor and chair of the department of art history, said: “We will continue to explore and adapt to the new challenges we face with the next edition of the Biennial, which will be a challenging and exciting project to create a body of work that encompasses all of the disciplines of contemporary art and history.”\n\n\nThe Museums Association (MA), the UK’s professional trade group, has called for the reopening of Britain’s museums in the wake of the Covid-19 lockdown. The group’s annual survey, released on Monday, found that, based on the estimates made by independent experts, as many as one-third of the 57,000 museums across the UK would likely be forced to close as a result of the pandemic. “A museum is a public good,” said Sarah Newton, director of the Association of Art Museum Directors, who was not involved in the analysis. “As museums face the possibility of a further reduction in visitor numbers, and as their collections are furloughed, the MCA calls for a new round of funding to support museums. We need the money to keep our museums open", "The next Biennial should begin this fall and explore the ongoing political and cultural changes in the country. The current exhibition will remain on view until May 23, 2020.\n\n\n\n\n\nNirvana’s Willie Nelson and Patti Smith, the two-time Grammy Award–winning duo who were a team of six, collaborated together again on the upcoming biennial, “The Future Is Now:” The Future Is Now: The Future Is Now,” which opens March 21. The biennial is part of the Smithsonian’s Convictions series, which aims to highlight the contributions of black artists to the history of the United States. Smith will serve as the theme for the first installment, titled “Waves.” They will meet at the Sundance Film Festival in December and will collaborate with the likes of David Cenotaph and the Black Lifers Arts and Culture Series to present the event.The event will focus on the art of movement and the human condition through a mix of performances, installations, performances, readings, lectures, and performances, organized in response to the current political and social climate. In the spirit of the Black Power movement, Nelson will create a new work inspired by the Black Lives Matter movement.", "The next Biennial should be held in 2022. “My purpose in organizing the Biennales is to provide the opportunity for the world to enjoy the art of the past—to take a collective perspective on art, and to engage in intensive debate and reflection on art,” said Marcel Bode. “With the help of the Gallery, we are creating a forum for the arts and a platform for dialogue between artists and the residents of San Francisco.”The twelve-person jury comprising curator Jennie Buschmann, artist Michael Krivitko, and theater critic Michael Lowery was convened by Bode in his office in the museum on February 16 and nominated the fifteen-man judging panel for the inaugural exhibition, “The Undersoul of Christine: Watercolors from the Watermark Project.” The festival will organize a number of events throughout the city of San Francisco, including a lecture series, a film festival, and a performance series. The winner of the award will be announced in April. The 2019 prize was awarded to artist and filmmaker Andrew W.K. for his work “The Eulogy,” published in the May 2019 issue of Artforum.\n\n\nThe University of Copenhagen has received a $", "The next Biennial should be held in the summer of 2021. The Semi–annual will be held in the spring of 2022. The 2020 General Assembly of the Arts was held on August 5–September 1, 2020. The 2020–21 Seasonal Exhibition of the Arts is currently underway, with exhibitions currently being organized by artists such as Greg Smith, Nari Ward, and John Castelli. The exhibition is slated to run through November 21, 2020.The 2020–21 Artists’ Garden in Shanghai is currently being renovated. The project, which will involve the dismantling of a twenty-four-thousand-year-old stone garden and the construction of a forty-six-thousand-year-old pavilion, is expected to be completed by December 2020. \n\n\nThe Institute of Contemporary Art (ICA) in London announced today that, beginning January 8, 2020, the institution will be closed from January 10–March 8, 2020. The news comes on the heels of the Institute’s announcement that it will begin a major renovation of its museum space, the Pavilion, which will open in the autumn of 2021. The project, which will extend the venue’s collection center and introduce new programming, is estimated", "The next Biennial should be held at the Museu de Arte Moderna in Lisbon in 2022. \n\n\nThe Falkland Islands are preparing to welcome visitors again after a massive oil spill shuttered their entire oil refineries, and the first domes have been erected to protect the fragile ecosystem. The domes, which were installed to protect the fragile ecosystem, were built by Dutch company Maarda & BERKELEH in partnership with the New Zealand government.“We are very proud to be able to announce that we will be able to resume operations once our emergency response teams have been able to clear the area,” said Lars-Peter Steiner, director of Maarda & BERKELEH. “It is essential that we do everything we can to prevent the spread of the coronavirus and that people are prepared for any eventuality. By reopening, we hope to be able to avoid any disruptions to our drilling and processing activities in the coming months. We are fully prepared and have all the necessary technical support. We are just a few weeks away from reopening and we await your guidance.”The domes were made in partnership with Maarda & BERKELEH, the Maarda", "The next Biennial should take place at a venue that has been selected by the local community and is also capable of hosting the event. The conference will provide a platform for the community to participate in the exhibition in a way that is co-ordinated by the artist. The exhibition will be organized under the theme “Unseen: Futurism in Art” and will be driven by the work of art historian Dinka Bocanegra.Bocanegra, who won the award for his work “Nuclear Family,” a 1998–2000 exhibition at the Museum of Modern Art in New York that was inspired by the work of artist Walter de Maria, will illustrate with a series of photographs that depict the lives and times of the Bocanegra children, Gerard and Pilar, and the Bocanegra family as they participate in various cultural events and events around the world, including the Venice Biennale in 2004 and the Rome Biennale in 2009. Bernard Sollars, the director of the London-based Centre for Contemporary Art (CCA), and the architect who designed the exhibition, will also serve as co-interviewees. The collection will be stored in a vault above the gallery.\n\n", "The next Biennial should be in the spring of 2020, when the exhibition will be in its last year.\n\n\nThe New Museum in New York has released the list of artists whose works will be included in its new biennial “Photographs: The Art of Photography,” which will travel to the Metropolitan Museum of Art in New York from April 15 through April 22, 2020. The exhibition, which was commissioned by the artist and his daughter, Susannah, will be held in the Met’s new space, the Kaufman Center for the Performing Arts, until December 20.“The new Whitney Museum of American Art is committed to elevating the performance, curating, and presentation of work by contemporary artists and to fostering a deeper appreciation of photography,” said Whitney director Helen Hwang. “The exhibition will showcase the work of seventy-nine artists, including David C. Driskell, Kim Gordon, Richard Avedon, Dave Hullfish, Sean Kelly, Alexander Aceves, Mark Schier, Rirkrit Tiravanija, and Joseph and Maria Kieffer, and will feature a selection of diaries, letters, and other materials that are part of the work of forty-eight photographers whose work will", "The next Biennial should be held in 2020, and the exhibition should be followed, “Artist Statement,” as this is the best way to promote the exhibition. \n\n\nThe Rutgers University Art Museum in New Brunswick, New Jersey, has appointed Christopher Isherwood as its next director. He will be responsible for training new talent and developing partnerships with the university’s institutions and communities. “Christopher is highly regarded across the art world for his ability to develop and execute innovative new curatorial and exhibition programs that challenge the boundaries of what is considered contemporary,” said Museum Director Michael Hausfeld. “These programs will provide a foundation for our future exhibitions, which will allow us to engage with the world as it really is and forge deeper relationships with our community.”Prior to joining the museum, Isherwood was a curatorial assistant at the Museum of Fine Arts, Philadelphia, and a staff writer at Artsy. He also has a degree from the university and is currently a Fulbright scholar. “Christopher Isherwood’s innovative approach to curating and writing makes him uniquely qualified to lead this new project,” said Hausfeld. “He exemplifies the spirit of sustainability", "The next Biennial should have been held earlier, and should have given a better account of its efforts to produce a satisfactory result, but it has been delayed, and we will have to wait and see. The Art Newspaper spoke to three architects who were involved in the redesign, which took place between 2004 and 2007, to see how it affected their designs.The institution, which is currently closed until March 14 due to COVID-19, is now hoping to reopen in the fall. In the meantime, the gallery has created a world map of the exhibition space and will display a more detailed version of the exhibition on its website.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Roderick C. Wallace as its next director. Wallace comes to the museum from the Los Angeles County Museum of Art (LACMA), where he has served as deputy director since 2018. He succeeds Daniel H. Weiss, who departed the institution to head the New York Creative Arts Center (NYCC), and will assume his leadership in October.“He is a passionate advocate for museums and a dedicated teacher,” Weiss said, “who has the vision and ability to transform the way we think and think about art and design. MoMA has a", "The next Biennial should focus on how the history of our cultural milieu can be reconceived as one of innovation, experimentation, and artistic invention. We hope that this year’s edition will be a landmark in our long history. \n\n\nIn the sixth installment of the Royal Academy of Arts (RA), Queen Elizabeth II and Prince Charles have announced the recipients of the RA–European Fellowship, which will help the arts in a number of ways in the UK. Among the ways that the RA–European Fellowship will be used are as part of a series of projects that will connect artists and cultural organizations in Europe and the United States, and will include a residency in London and a series of performances and screenings.Projects will be selected by an international panel composed of Jacques LaBouvier, editor in chief of the deCordova calendar; Michaëla Oulé, curator of the Légerie Henri Biennial in Paris; and Joel Webster, a former director of the Rothschild Center and the Museum of Modern Art and a former chief curator of the Art Institute of Chicago.The 2019 cohort includes:Laika López-de-Silva, FranceLaurent Pape, FranceSubd. Rayyaneh", "The next Biennial should be held in 2021 and will be organized as follows:\n\n(1) The exhibition should recognize the contributions of artists and cultural performers whose practices and work have contributed to the advancement of liberal arts education, as well as the preservation of liberal arts education. The exhibition should provide an overview of the state of the art in the field and should address current challenges and possibilities of education in the networked academic world.\n\n(2) The exhibition should aim to enrich understanding of the modern, contemporary, and contemporary-historical, as well as to present proposed solutions for the development of contemporary art education. It should feature original works of contemporary art around the world.“Unlike art, cultural production is not a vehicle for the dissemination of ideas, but is rather a way of expressing those ideas through the medium of art,” said Suzanne Bertens, director of the Kunsthalle Basel. “The exhibition should provide a platform for the integration of modern art and contemporary art, and should invite the widest possible audience for these two worlds, art and contemporary.”The Kunsthalle, which was established in 1938 by Max Hetzler, Frank Joann, and Fritz Lang, is currently represented by the Paris-based", "The next Biennial should explore how artists, designers, and creatives are increasingly incorporating virtual worlds and the body into their work, or in their lives, in order to create a re-creation of their own body in order to re-create their lives. “We need to be deeply engaged in the lives and bodies of those we love and in the world around us,” said Yuki Shino, artistic director of the Contemporary Art Biennials at the University of Southern California. “That is the one of the greatest challenges for Biennial.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it will reopen in three years at a cost of $12 million. The restoration of the museum’s original facade, which was built in 1937 and is slated for destruction by fire in 2019, was announced in February. The announcement sparked immediate backlash from architects and designers including Nara Allen and Frank Gehry, who called the renovation a “devastating loss.” The institution’s board chair, Bernard Boudin, also questioned the timeline for the revitalization, and the institution’s alumni association called for the board to be held accountable for its decision.The board", "The next Biennial should take place in 2021 and will celebrate the legacy of the writer Seiji Ozawa with the exhibition of his first novel – “The Beast of Karuizawa” (1942), which uses environmental concerns to examine the concept of nature and the concept of the organic in a different way than his later works. In 2015, Ozawa was awarded the Kyoto Biennial Award. Following the exhibition, Ozawa published a small edition of a memoir he wrote about his early years in Japan, titled The Road to Earth.\n\n\nThe National Museum of Art in Washington, DC, has appointed Julie Carroll as its new deputy director of curatorial affairs and chief curator. Carroll comes to the institution from the Smithsonian’s National Museum of African Art, where she currently serves as deputy director of exhibitions. She will assume her responsibilities in December.“Julie has played a central role in the institution’s evolution as a major cultural organization with an exciting and compelling collection that inspires visitors to think and feel about art history and the Americas,” said David McAllister, the institution’s director and chief curator. “A scholar of African art, her work demonstrates her ability to create compellingly engaging exhibitions that", "The next Biennial should take place in 2020. Los Angeles is already planning to host the first event in 2030, and other cities in the United States are expected to announce their plans for the 2020 edition in the coming months.\n\nDespite the recent push to legalize marijuana in some states, the United States still has one of the highest rates of cannabis use disorder in the world. According to the American Foundation for the Treatment of Addiction, approximately twenty-six thousand Americans are currently incarcerated for cannabis offenses. The number of people living in the country as a whole is estimated at sixty million.The costs of treating people who use drugs have been a major focus of the current campaign for marijuana policy reform. Legalization advocates have touted savings from mass incarceration as one potential opportunity to reduce the nation’s drug problem. In a February 2016 report by the Drug Policy Alliance, the group that organized the march, the proposed policy would have saved the US more than $2 trillion over the next ten years.Two months later, President Donald Trump signed a bill that shifted millions of Americans’ drug laws, drastically reducing prison sentences and increasing community reentry services. The legislation also eliminated the death penalty and rolled back an array of state and local restrictions, including local medical marijuana programs and", "The next Biennial should start on December 15 and should be a preview of the new exhibition, 'Colombia: The Making of Modern Art', which will be presented by the National Museum of Contemporary Art (LMCA), in the capital, Bogotá, from January 24 to February 28. \n\n\nThe National Arts Museum (NAV) in Washington, DC, has become the latest institution to suspend events and performances in commemoration of the opening of the museum’s new building, which opened to the public on December 15. In a statement on its website, the museum said that it was “working cooperatively with the Department of Cultural Affairs and with other federal agencies to ensure that we have the resources and capacity to carry out this important restoration and reopening.”“This is not a case of when; it is a long-term project,” the museum said. “We will continue to work with all of our partners to ensure a smooth and orderly transition as we re-open in January 2020.”The reopening of the museum in February 2020 will mark the first time the museum has opened after government mandated the closure of the building for twenty-nine days in March 2019. In March 2020,", "The next Biennial should focus on “social justice and the human rights of all,” the organizers said. “This is an issue which transcends geographies, and I believe that more than ever it is an urgent and pressing topic. We must raise awareness, challenge, and demand that governments and institutions take effective and meaningful action. This is an issue that cannot be ignored.”\n\n\nThe Institute of Contemporary Arts (ICA) in London is preparing to welcome a new cultural hub in the city alongside the refurbished Tate Britain. Dubbed the International Village, the venue will be located in the heart of the city and will partner with the nearby Public Art and Design (PAD) programme to bring together artist-run spaces and supporters throughout the island of Jersey.The village will feature a host of artist-owned spaces, including the Tattoo Studio, the Central Gallery, the Gallery for the Creative Life, and the Gallery for the Arts, and will be led by a team of curators, architects, and engineers. At the same time, the artist-run village of St. Andrew’s Church in Hackney, which is run by the church, will host artist-run photography events across the village.The move follows the announcement", "The next Biennial should take place in 2021.” The 2019 event, titled “The Future Is Present,” was a retrospective of work by thirty-four contemporary artists.\n\n\nThe Asian Art Museum (AAM) in New Delhi has received a gift of twenty-eight works by ten artists, including Chinuo Zhang, Rinko Mizuno, Hao Yueh, and Yoko Ono, from a group that included a man who was detained in Japan over a possible terrorism-related crime. The museum also revealed that the collection will go on display in the institution’s newly opened, 2,250-square-foot museum on February 5.The artworks, which were made in China in the late 1970s and early 1980s, were donated by the founder of the wealthy textile conglomerate the Chinese company Steel Millenium (CMG), Guo Guangcheng. Guo had taken the works from the institution to establish a museum in his sprawling, state-owned enterprise, which is located in a lush forested campus in the city of Wuhan, in 2017. During the trip, Guo met with the AAM board members and received their approval. The institution then contacted the family of the man detained by Japan", "The next Biennial should take place in 2023 and will receive funding from the Los Angeles County Museum of Art (LACMA); the Museum of Contemporary Art (MCA); and the City of Los Angeles.\n\n\nThe American Folk Art Museum (AFAM) in New York City has selected Louise Simmons, a prolific American painter and sculptor, as its next leader. The institution announced its selection of Simmons, who has been called the father of modern American painting and the founder of the revolutionary technique of abstract line work, in a ceremony that took place on Friday, March 21.According to the New York Times, Simmons first worked at the museum as an assistant curator in 1967. She would go on to organize more than fifty exhibitions, including the first solo shows by artists such as Robert Irwin, Warren James Marshall, and Paul Gauguin, in addition to her own twenty-year retrospective at the museum in 2002. “Louise’s paintings offer a vivid and engaging window into the early Modernist movement, drawing from the Courtauld Institute’s iconic Vincent van Gogh and transforming the purest forms of abstract beauty,” said head of AFAM James Hilton. “Her sculptures are an essential model for Van Gogh�", "The next Biennial should take place in Amsterdam in the fall of 2020. The 2019 edition, for which the artist Robert Heinlein wrote the theme, came together in May. The exhibition opened at the Mondrian Museum in Rome and ran through November 21. The next edition will be held at the Wijse Museum of Contemporary Art in Amsterdam from March 23 to March 31. The same year, the Künstlerhaus in Berlin held a special exhibition of work by Marc Cohn and Øystein Nilsen (the latter from Copenhagen and the former from Exo-Netherlands), entitled “Alligator” (The _Alligator’s Garden). The exhibition was organized by the Künstlerhaus and the Kiel Museum for Contemporary Art and Art Deco. The 2018 edition was organized by the Künstlerhaus.\n\n\nThe Metropolitan Museum of Art (MoA) in New York has received a $3 billion donation from the Solomon R. Guggenheim Foundation in honor of the museum’s Centennial celebration this March 26–March 29. The gift includes $1.2 billion for the construction of the new museum, which will open in 2021 and feature more", "The next Biennial should be announced soon. \n\n\nThe Hungarian government has ordered that the country’s national folk art museum, the Musezvala Kultur in Budapest, close down for a period of twenty-four weeks due to the coronavirus. The decision was made in a decree issued by Prime Minister Viktor Orban on December 5.†The government had warned that the annual event, which was originally scheduled for March 16–March 19, would be canceled unless the center reopens by March 13. The decision has forced a delay of the opening of the museum, which houses some three hundred thousand works.In a statement, the government said that the decision to suspend the museum’s operations was made amid “difficult and complex circumstances.” It said that the museum had been working at a loss since the end of March. The government’s move has forced a rethink of the institution’s programming, which is normally held in the spring. After the museum reopened on March 13, it moved the exhibition of the artist’s work, “Nadya Naidu: Life and Art in the Art World,” to the summer, and it has also given the institution a new", "The next Biennial should feature the works of fifty artists in the exhibition. Among the participants are Yoko Ono, Dorothea Rockburne, and Tunga. The festival will be held at the Crystal Bridges Museum in Seattle.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Jessica Teitelbaum as its new assistant curator of American art. She succeeds Elizabeth Cady, who departed the institution earlier this year to head the Metropolitan Museum of Art, and will begin her position on January 5.“Jessica is a superb curator who brings a unique perspective to the museum and will help us build upon the strengths and achievements of our talented curator team,” said Guggenheim director James Guggenheim. “This is a challenging time for the museum. We are currently rebuilding our future in terms of our programming, our exhibitions, our collection and exhibition design, and our collection and exhibition design, and it is also a challenging time to re-design our collection and exhibition design. We are confident that she will bring that energy and passion to the Guggenheim.”Teitelbaum will begin her position at the museum through the end of January. She will be responsible for helping the museum", "The next Biennial should be held in 2020, as described in an open letter published by the London-based cultural center the Southbank Center for Contemporary Art in the United Kingdom. The institution is currently accepting applications for its 2019 event, which will take place in November. The 2020 event will be held at the Art Institute of Chicago (We Are Chicago), which is currently undergoing a $1 million renovation, and will be co-sponsored by the Chicago Foundation for African Art and the Art Institute of Chicago. The 2019 event, titled New Realities, was organized to coincide with Art Basel Chicago and was curated by art historian and curator Merritt Rutt, who is also the curator of the exhibition “Acts of Resistance: African Art in the Age of Black Power” (2018–19) at the Art Institute of Chicago. The 2020 event will be hosted by the Art Institute of Chicago and will be co-produced by Nam Y.A. Leibowitz, Anuja Guha, and Diana Nijjar.\n\n\nThe Institute of Contemporary Arts (ICA) in London recently commissioned a new work by South African artist Ralph Whitaker, Miranda, to create an exhibition that addresses", "The next Biennial should be held in 2020.\n\n\nThe Metropolitan Museum of Art in New York has announced that it will provide $10 million in aid to the construction of a new Jewish Museum, situated at 528 West Twenty-Second Street, following the city’s announcement that it is preparing to move the institution to a new building as part of a $3.6 billion overhaul of the city’s transportation infrastructure. The new flagship museum will open in 2023 and will host more than 4,500 exhibitions, including an exhibition devoted to the life and works of Michelangelo Antonioni.The Metropolitan Museum of Art has spent more than two decades developing the design for the new museum. Its chief curator, Mark B. Levin, the founder of the firm Levin and Tom, designed the museum’s contemporary space, a fifteen-thousand-square-foot building with a design by the firm Mies van der Rohe, in collaboration with the city of New York. Mies van der Rohe is the same architect that designed the museum’s current home, the beautifully restored Warhol Museum on Manhattan’s Hudson Yards, and the Museum of Modern Art’s new home in Northern Liberties.The plan for the new", "The next Biennial should be held in the Spring of 2020. The 2020 edition of the Biennial will include a selection of visual and performance works created in the United States and a new program for young artists. The 2019 edition of the Biennial will be a combination of exhibitions and residencies and will focus on the life and artistic development of the artist with a representative selection of works. The 2019 edition of the Biennial was organized by the nonprofit organization ARTtuals United States and was presented by Expo New York. The 2019 exhibition was organized by the New School for the Arts, the Museum of Modern Art, the Metropolitan Museum of Art, and the Whitney Museum of American Art. The 2019 exhibit was curated by Alan Ladd, Michael Shepherd, Claudia Parrish, Laura Owens, and Jonathan Mott, and was presented by the New York Creative Alliance.\n\n\nThe Contemporary Jewish Museum (CIM) in New York has been forced to move its exhibition “The Last Days of Judaic Civilization” due to the pandemic. The show, which explores the fate of Jews in Nazi Germany and the Holocaust, was scheduled to run from March 22 to March 29. Although the exhibition was", "The next Biennial should take place in 2020 and is currently on hold due to a lack of funding. The 2019 event, which involved over a hundred artists and collectors, was supposed to include forty works by the likes of Alexander Calder, Ateliers Simultan, Bernard Auguste, and Juliette de Magalhães.\n\n\nThe Fair of Paris’s board of directors has suspended two-thirds of its members, citing a lack of interest in the city’s art market as a reason. The move follows the announcement of a new €1.7 billion ($1.85 billion) art fund, an extension of the city’s newly created Cultural Impact Fund, which will support up to twenty-five artists.“We are deeply disappointed by the decision of the board of the Fair of Paris,” Anselm Kiefer, the board’s president, said in a statement. “The board was elected by the city of Paris and the French Republic in an electoral college, and its members represent a wide range of cultural interests. The board has made the decision to assume more responsibility for the management of the Fair of Paris, and to reconsider its future with the city of Paris", "The next Biennial should be held in São Paulo in March 2020. The artist-run studio will also organize a retrospective of the work of Lucio Fontana, which will be held in the city in June 2020, and will present the first exhibition of work by an artist from Brasília.The event has been invited to participate in the upcoming edition of Art Basel Sao Paulo, which will take place in the Brazilian city from May to June 2020. The twenty-fifth edition of the event will be held in Algarve, the city of Portugal, in August 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Dorothy Allen as its next director and CEO. Allen comes to the institution from the Museum of Contemporary Art (MoMA) in Los Angeles, which she has helmed since 2013. She succeeds Diana Tepper, who announced on Monday that she is stepping down to pursue new projects.“We are thrilled to welcome Dorsey to the museum,” Museum of Modern Art director Christopher Campbell said. “Her record of success, as an architect and collector, and her passion for the arts and collections reflect her mission to make MoMA a top-level institution", "The next Biennial should be held in 2021. \n\n\nThe Institute of Contemporary Arts (ICA) in Brussels announced today that the city of Petit-Quatre-Duc, Belgium, is the next home for the Institute of Contemporary Arts (ICA). The new twenty-six-acre site will be managed by the French architect Christian Vandeep, who will be based in the city from January 2020 to August 2021. The institute was established in 1907 by the Dutch architect Le Corbusier and the German architect Joachim Neugroschel in Brussels. It was spun off into a company in 1977 and has since been incorporated into the city of Brussels.The institute will be housed in the former Breguard building, which was completed in 1932, and will be inaugurated by a contemporary exhibition, “Joseph-Koenig: Force of Nature” (2019), and will be followed by a symposium on the artist’s practice, “Joseph-Koenig: 2+2” (2019), and a collaboration with the Württembergische Stiftung München (WIM). \n\n\nThe Museum of Contemporary Art (MoCA) in New York has announced the opening of", "The next Biennial should focus on the collection of the works of the great Italian futurists, such as Gian Lorenzo Bombani, Giacomo Costo, and Sixto Moro. The forthcoming exhibition will also introduce a new structure for the exhibition, which will be themed “Yukos: Visual Artists in Contemporary Life” and will feature fifty works, including works by Imogen Harrison (1902–1985), and seventy-four works, including works by Maurice Staudt, John Vincent Baker, Joseph Beuys, and Franz Kammerer. \n\n\nThe National Gallery of Art in Washington, DC, has appointed Cynthia Ashmore as its next executive director. Ashmore will be responsible for overseeing the conservation, preservation, and dissemination of the institution’s collection and collection-based activities. She succeeds David Crane, who retired in May after seventeen years at the helm of the museum.“Cynthia Ashmore’s independence and enthusiasm for the National Gallery of Art and National Gallery of Art’s collection are inspiring,” said National Gallery director Matthew Teitelbaum. “Her dedication to expanding and strengthening the National Gallery of Art as a national cultural resource, reimagined by", "The next Biennial should take place in the spring of 2021, with the help of an additional exhibition in the spring of 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has commissioned artist Mark L. Jackson for a new project, “In the Time of Crisis,” which will rise in the Museum’s Marriott Center in the spring of 2020. The event will be hosted by Davey, a contemporary art collective, and will be organized as a series of performances, performances, and other events centered on themes of resilience and a crisis that has recently struck the United States.“The project reflects MoMA’s deep commitment to the histories and cultures of the Pacific Northwest,” said Kate Connor, MoMA’s director and chief curator. “The show will address the legacy of artists and will introduce the public to a wide variety of art in the Pacific Northwest, including new work by artists whose work has previously been overlooked or underrecognized.”The exhibition will be themed “In the Time of Crisis: Pacific Northwest Artists’ Legacy,” and will be curated by Leo Bucher, who previously served as curator at large for the Whitney Museum of American Art in New York and", "The next Biennial should be held in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Stephanie Sofiya as its next director. She will take the helm from director Nicholas Sarkis, who will resign in January 2020, and will assume the role of director of the institution from May 15 to May 18, 2021.“Stephanie Sofiya’s strong track record of innovation and passion for contemporary art and her commitment to supporting and elevating marginalized artists make her ideal candidate for the position of director,” said museum director and CEO Michael Govan. She succeeds David K. Abram, who departed the institution in June after a contentious twelve-month tenure.“While I deeply appreciate David’s dedication and efforts to guide the museum through a challenging period of its history, I am proud to work with Stephanie to continue to grow MoCA’s arts community, public profile and visibility in the city of Los Angeles, and discuss the future of the institution.”Abram’s departure followed a tumultuous period for MoCA. It closed in 2016, following a serious fire that was extinguished by firefighters before the building’s 2015 reopening in the spring of that year.", "The next Biennial should be held in the spring of 2021. \n\n\nThe Art Newspaper has announced its list of twenty-five artists who will participate in the upcoming exhibition “The Art of Life: Avant-Garde Modernism” at the Berlinale. The exhibition will feature works by artists including Robert Irwin, Enrico Castellani, and Thomas Young, which will come together to form a longer work, “The Art of Love: Avant-Garde Modernism” (Sie aktivie zur Evolutionäre), which will open in the autumn of 2020.“This is a challenging exhibition at a moment of transformation for art and architecture,” said Bernardo Nanni, the artistic director of The National Museum of Contemporary Art (MoCA), Berlin. “We are grateful to the artists who have agreed to participate. They have given us the opportunity to present the exhibition in a new way, in a different setting, in a new city, and in a different way.” Young, who was imprisoned for four years for an attempted murder charge by the FBI in 1984, will be presented in the exhibition as a presence of two worlds—the avant-garde and the", "The next Biennial should focus on emerging works and the impact of artworks in the Pacific Northwest’s First Nations and in the culture, art, and architecture of the Pacific Northwest. The next iteration of the Biennial will focus on the history of art in Canada, the United States, and Europe. The 2019 iteration of the biennial will be held at the Seattle Art Museum. The 2017 edition of the biennial, “Frontier Art,” curated by Paradise Design Gallery, featured work by twenty-six artists. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has welcomed KATHMANDU DASIE, Edward Said, and KARINA RABB, among other artists, to its curatorial team. In addition, the institution has commissioned three works by the group Spike Lee and will present them at the Falklands Art Museum in Portland, Maine, next month. Pierre-Olivier Focht, the director of the Free Library of New York, confirmed that the three works by the trio will be on display in the institution’s new exhibition, “Uptown: Artists in the Age of", "The next Biennial should be a tribute to the artist’s work, which is currently on view in the museum’s office of art, in the summer of 2021. The biennial will consist of biennial‐level exhibitions, including the exhibition “Sukhjeet Singh” (2018), an exploration of the artist’s journey from an infant to a functioning adult; “The Man in the Shadows” (2017), an exhibition exploring the evolution of the artist’s body and the relationship between the visual arts and domestic life; and “The Voyeurism of Adrian Piper: The Making of American Art” (2016), a survey of the artist’s multiple collaborations.Frieze announced its representation of the Pakistani artist Haider Ullah, who formed his career in the 1980s by documenting the lives and works of 13 American soldiers, including two who were killed in an action that took place in the city of Baghlan, Afghanistan, on June 12, 2001. The work, titled Freedom, was included in the fifty-first edition of the Black Art Biennial at the Museum of Modern Art in New York, which runs until October 8. The show will also welcome a selection", "The next Biennial should be held at the S.M.A.W. Research Center in Everett, Massachusetts, and should open in the spring of 2020. Reflections on the Past: A Biennial at the Oxford Art Gallery will be held in the same venue next year. Both events will be organized as part of a new initiative launched this spring to highlight the work of contemporary artists who have entered the public eye through the years. Adeline LeBlanc, the chair of the Biennial and director of the S.M.A.W. Research Center, told the Art Newspaper that the venue would be a “natural home” for the exhibition. “We are thrilled to be opening the new exhibition in the new location in March 2020. The exhibition will be curated by Léonie Bénédicte Pascal, the head of the Biennial; Anne-Marie Winograd, the curator of the gallery; and Richard Roesler, the director of the Smithsonian American Art Museum. We hope it will be an invitation to revisit the artworks of this century in the same spirit of reverence and appreciation that these artists have always carried out in their studio and will introduce a new generation of contemporary artists to the heart", "The next Biennial should open in the autumn of 2021. The site will be inaugurated by a public performance by the organic dance group Arctic Monkeys. In the second part of the four-day event, which will be divided into two parts, the exhibition will conclude with the exhibition “For All the World To See.” The exhibition will travel to the Para Club in Auckland, New Zealand; to the Museum of Modern Art, New York; and to the First International Biennial, the Winter Biennial, and the Autumn Biennial in Vienna.\n\n\nCiting the Covid-19 pandemic, the Metropolitan Museum of Art (the Museum) in New York has canceled its 2020 edition, “For All the World To See.” The announcement comes two days after the museum issued an apology for its failure to inform the public about the Covid-19 lockdown and raised questions about whether the March 11 cancellation was an attempt to cover up its complicity in the global health crisis.In a statement issued on Wednesday, the museum said: “The March 11 cancellation was a mistake. We were not aware of, and did not intentionally mislead the public about the duration or safety of the exhibition. We are committed to giving our employees and", "The next Biennial should take place in the autumn of 2019, and the twenty-fifth in December 2020. The programme, which is funded by the Stockholm-based artist and curator Anna-Sophie Olsson, will also include an exhibition of work by three artists whose work was selected by the biennial’s committee: Jørn Rasmussen, Hans Christian Andersen, and Olga and Olga K, a nod to the Swedish artist-turned-activist, activist, and writer Anna-Sophie Olsson. The festival’s inaugural edition, which kicked off in April 2019, drew 1,460 visitors.\n\n\nThe Museum of Modern Art (MoMA), in New York, announced today that it is planning to close its doors permanently in February 2021, ending its fifty-two-year run as the central hub of American art. In a statement, the institution said: “We are acutely aware that our legacy of innovation and creativity is a product of a deep commitment to giving the world the works that defined our times. We are also acutely aware that the museum’s most recent incarnation has been the subject of enormous critical interest and has been a powerful engine for the city of New York. As we approach the milestone,", "The next Biennial should take place in the coming years, said the organizers. “This is an important and timely time to consider the future health of the biennial as we face the consequences of a global health crisis.”\n\n\nThe June 25 opening of the biennial of the Rijksmuseum in Amsterdam, inaugurated by artists and visitors from Hong Kong, has been pushed back to November. However, the November 19 show, titled “Ateliers de l'art et de l'histoire,” is still slated to run from December 17 to December 21.According to Dutch daily newspaper De Standaard, the exhibition, which was supposed to kick off at the museum on November 13 and close on December 14, was pushed back because of the Covid-19 pandemic. It is now scheduled to run from December 16 to December 21. The exhibition’s exhibition hall will remain open, but it will be closed to the public and only on December 21. The biennial’s opening was also pushed back from December 11 to December 13 due to an illness-related stoppage at the institution. The November 13 event was rescheduled for December 16, and the November 14 show was resched", "The next Biennial should be scheduled for March 2019, and the fourth and final shows will be staged in May and June 2020. The art for the 2013 and 2019 editions of the biennial was curated by Martin, and the Paris art fair, Art Basel, and the Hong Kong art fair, Art Hong Kong, were supported by Tate and the Hong Kong Foundation.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Neil Armstrong as its first director. Armstrong—a cofounder and former president of the Museum of Modern Art in New York, and a Rhodes scholar who is also a professor of art history and the history of art at Columbia University—has been appointed from the board of trustees of the Solomon R. Guggenheim Museum, which he will assume on December 3.“Neil is a passionate, brilliant, and talented leader, and we are committed to his leadership and vision,” said Solomon R. Guggenheim Museum’s board chair, David Guggenheim. “At this point in his career, Neil has established himself as one of the most highly regarded and respected directors in America, and we are confident that he will continue to lead the museum through this challenging", "The next Biennial should be held in the spring of 2020. This would be the twenty-third iteration of the annual event, which has been held at the National Museum of Art in Washington, DC, since 1972 and is one of the largest events in the world dedicated to the study of the giallo artform. The exhibition will feature four titles by artists whose works were featured in the first biennial:\n\nToccarra, Kanu, Londo, and Masina. The next edition of the fair will be held in the summer of 2021 and will take place at the National Museum of Visual Arts (MoVA). A website will be launched soon for the event.\n\n\nAs the number of coronavirus-related deaths in the US continues to climb, the number of art institutions that have closed their doors in protest of the novel coronavirus as well as the museums that have suspended programming or laid off workers has dwindled. But as of Monday, there are still several organizations that are withholding funding from museums that are facing financial hardships brought on by the novel coronavirus—a coronavirus-related economic blockade.Among these are the National Endowment for the Arts (NEA), which announced on Monday that it", "The next Biennial should also include a public performance and a presentation of work by more than fifty artists. It should also be a reflection of the city’s cultural and artistic life.”\n\n\nThe M Woods Museum in Garden City, New York, has appointed Kate Hawkes as its new executive curator. Hawkes comes to the institution from the Museum of Modern Art (MoMA), where she has served as interim director of curatorial affairs since December 2019 and is currently the director of educational initiatives.“The M Woods Museum is pleased to welcome Kate to its team,” said director Ellen Salpeter. “Kate joins us from MoMA, where she has served as the director of collections and exhibitions for six years, and brings an incredible perspective and breadth of experience to our curatorial leadership.”Previously, Hawkes held senior administrative and curatorial roles at the Museum of Modern Art and the San Francisco Museum of Modern Art. During her tenure at MoMA, she organized first-class exhibitions such as “Architecture in the Age of Black Power” (2019), “Blue Lines: Landscape and Architecture from the M Woods” (2018), “Alberto Burri: The Big Freakin�", "The next Biennial should begin as soon as possible and be held in June 2021. The Board of Directors will then prepare a funding proposal for the event.\n\nThe Asia-Pacific Foundation (APF) announced today that it has been awarded a $2 million grant to facilitate the publication of the first edition of its “Pacific Century: Re-Envisioning Peace and Prosperity” series. The $12,000 grant was made through a program that supports the work of artists, scholars, activists, and other cultural professionals working in the Asia-Pacific region.The grant will help fund the publication of the first volume of the series, which was initiated by a group of scholars and activists in the Asia-Pacific region in 2017. The inaugural exhibition will feature the work of forty-two contemporary artists in the region and will be held at the Art Institute of Chicago.“The Asia-Pacific Foundation is thrilled to award this grant to help advance the exhibition’s publication and further the work of the artists who were selected by the participants who were invited to the first edition of the Asia Pacific Century as well as to support their future exhibitions,” said Sebastian Payne, director and CEO of the APF. The grant", "The next Biennial should present a major exploration of the history of art, including a new work by the artist; a presentation of a selection of his paintings; and a selection of his sculptures. The theme of this year’s event will be “In Praise of the Art.” The inaugural event, “In Praise of the Art: The Neurotic Life of Man and Death” will take up the theme of the twenty-fifth Biennial, “In Defense of the Art of Art.”\n\n\nThe Institute of Contemporary Art (ICA) in Paris has appointed María Berrada as its new director. Berrada will be responsible for planning, developing, and executing a program that will include the curation and development of exhibitions, residencies, and projects, as well as the execution of programming through partnerships with local, regional, and international organizations. Berrada will take up her new post in August.“This is an exciting time for me personally and for the ICA, as we embark on this new chapter as a public institution,” Berrada said in a statement. “The ICA and the Institute have a long history of collaboration and collaboration, and I am looking", "The next Biennial should be launched in 2021.\n\n\nThe revival of the theater as a global community gathering together for the common good has always been the theme of the upcoming season of the Metropolitan Opera. The initiative, called the Met, is reinstating the Met, with a new show, The Met, at dusk. The show will be the first time the Met’s main building, which is currently undergoing a $200 million expansion, will be lit during the daytime. The project, which was led by architect and developer Christopher Woolf, is part of a wider plan to improve the environment for opera theaters and to increase the accessibility of the institution for everyone.“We believe that the Met is at the forefront of the way opera is practiced, and at the forefront of the way the arts are made and shared,” said Woolf. “It is in our long-term interest to continue to support the Met’s mission to make the arts accessible for everyone, and to improve the condition of the building and the arts for future generations.”The next season of the show will be the first time the Met’s main building, which is currently undergoing a $200 million expansion, will be lit during the", "The next Biennial should be held in no later than 2020, when the programme will have completed its second year. Afterward, a special exhibition of work by the curators will be staged at the Pavilion des Arts et Lettres.\n\n\nThe Museum of Fine Arts (MFA) in Phoenix has released new guidelines for how museums should handle contentious exhibitions that involve controversial figures such as Cyrus the Great and the late former kingpin Pablo Picasso.The guidelines were written by Max Hollein, the deputy director and chief curator of the MFA, who was told a Picasso exhibition slated for next month would be compromised due to the 2010 earthquake and tsunami in Japan, and were published in a letter addressed to the artists.The letter, which was sent from the MFA to the artists on August 13, outlines how a “disruption plan” would allow the gallery to “implement an immediate and comprehensive restoration of the works” and says the museum wants to “implement an immediate and comprehensive restoration of the works’ materials.” The gallery says the process need not be ­comprehensive, but will need to ‘independently’ assess the environment and the artistic legacy of the work.The letter", "The next Biennial should be held at the new Jack London Square, which is being built by Grafton-based architects CAA Grafton and W.A.G. for a new exhibition, “Totally Inside,” in 2022. It will be inaugurated by a 10,000-piece installation, “Greetings from the Native,” that will include sculptures by Konrad Zuse, Kiki Smith, Simon Rogers, and other key figures from the cultural history of the city.For Düsseldorf, the exhibition should be about “the art of the afterlife,” a theme that arises from the Gäst-Ersch-Güter-Südaberg district. The city’s Städelsplatz, which was converted into a museum in 1989, had previously hosted a retrospective of the work of locals by the Polish-born, German-American sculptor Joszko Wojtyla.While the new exhibition will focus primarily on the city’s history and culture, it will also include photography and videos, artworks, and performances by local and international artists. The show will have an English-language section, with the first content appearing", "The next Biennial should be held in 2020. The list of participating artists is as follows:FACTSHEET at the Museum of Modern Art  New York  (New York)Fernando de Castro Gallery, Buenos Aires, ArgentinaKumi Kanno Gallery, New York (New York) Kiowa Mediterranea, Puebla, MexicoKatherine Kassel Gallery, Bonn, GermanyTani Barucci Gallery, Milan, ItalyAlfredo de Castro Gallery, Buenos Aires, ArgentinaKaelen Barucci Gallery, New York (New York)The art of Tania Bruguera, Buenos Aires, ArgentinaBogotá Museum, Bogotá, ColombiaNancy Cartagena Gallery, New York (New York)Fernando de Castro Gallery, Buenos Aires, ArgentinaTania Bruguera: “The Modern Way (2006–2019),” Fernando de Castro: “Bernardo Berrada (2019),” and Fernando de Castro: “The Night Mirrors,” are currently on view at the Biennial.\n\n\nArtist-run venues are again facing intense pressure to close their doors amid", "The next Biennial should be held in 2021.\n\n\nThe Bessies—an intergenerational collection of Washington, DC–based artists who are known for their bold assemblages that address issues of race, history, and politics from a feminist and radical feminist perspective—has announced that it will no longer receive funding from corporate sponsors. The organization’s next annual awards will be given by fellows, who include Tia Bonetti, Christopher Wool, and Jumaja Mire, as well as members of the BlackMesh collective, which comprises six artists. “In response to the current climate, the BlackMesh Foundation’s board of directors decided to terminate our relationship with the three major corporate sponsors of the Biennial: CapitalG, Pembro, and BlueBridge,” reads a statement made by the foundation. “Since the board has made this decision, we have struggled to come to terms with the loss of our annual grants. But it’s a decision that we hope will set an example for others who may struggle with the same decision.” The decision has led some to believe that severing ties with these corporations was not the intention of the foundation, but rather that this was a symbolic gesture in solidarity", "The next Biennial should be located at a site that is accessible to the general public, and should be organized in a way that will allow the public to experience the exhibition in a meaningful way. The next edition of the biennial will take place in Helsinki in 2021. \n\n\nMassimo Faccioli, the Italian architect, curator, and educator best known for his monumental residential projects, such as the world-famous Turin–Montecina y Gabriella (Turin–Montecina, Guggenheim, and the Guggenheim) and the gorgeous new home for Italian art, the Museo d’Arte Moderna, in Milan, has died at age eighty-eight. He is survived by his daughter, Luca; his son, Fabio; and his son-in-law, Stefano Rondinone.Born in Turin in 1943, Faccioli studied at the prestigious Ecole Nationale de Villebon, the Ecole Nationale d’Arte Contemporanea (EEC), and the Ecole Nationale d’Arte Contemporanea in Milan, where he was a professor of architecture and design. He continued his studies", "The next Biennial should be held in Yaroslavl, Russia, in February 2021.\n\n\nThe University of the Arts (UWA) in London announced today that it will welcome three new artists into the institution next year, following a three-month period of exclusivity for those selected by the curators of its inaugural exhibition, “Becoming Human: The Art of Misery,” which opened on April 4.  “In our view of the Arts as a living entity, there is a direct and significant connection between the work and the experiences of the participants of the exhibition,” said Andrew Gilligan, director of the UWA Centre for Performance Art. The new artists will be inaugurated by a series of presentations and performances that will take the form of biennial exhibitions, during which they will experiment with new and hitherto unexplored materials.The exhibition, which was inspired by the work of artists such as the Czechoslovak painter Valentin Leitner, was organized as a joint project between Alex Nosenko (Chief Curator), Sarah Parrott (Curation Manager), and Numan Prasad (Curation Consultant). In preparation for the exhibition, the curators created a series of works for the exhibition", "The next Biennial should take place in Los Angeles in 2021. The twenty-second edition, which will be held at the San Francisco Art Museum, will also be staged in 2020 and 2021, respectively. The rest of the year will see the museum’s exhibition schedule shifted to follow a biennial theme. An opening of the museum’s new sculpture house, the Museum of Contemporary Art, Los Angeles (MCA). The museum will be open from 7 AM to 5 PM on weekdays. The next series of Biennial Events will take place in New York in 2021. \n\n\nThe Art Newspaper, a Spanish daily publication published by the Art Newspaper Group, has announced its representation of the French artist -designer Léa-Lise, who is known for her striking and contemporary collages. The announcement is the second of three collaborations between the magazine and the artist. The first was with the French designer Thomas Morel, who designed a series of geometric abstractions for the October 1979 issue of Art Newspaper. For its October 2017 issue, Léa-Lise created a full-scale replica of the Parisian Gare de Lyon, which was dedicated to the French royal family.In the new partnership,", "The next Biennial should be held in 2020. \n\n\nThe New York Public Library has released the list of seventy-six artists and collectives who will participate in Art in America 2020, which will run from March 21 to March 23. Titled “The Future Is Now,” the exhibition will focus on themes of memory, commemoration, and future. Particular highlights include José Berrí\u0097from Spain, whose works are on display in the exhibition “Drawn to Light,” which was curated by Alberto Bedoya, and James Turrell, whose paintings are part of the exhibition “Against the Power of Painting” at the Tribeca Film Festival.While most of the artists on the list are based in the United States, London, Tokyo, Nairobi, and Hong Kong, the artists who are most at risk are from outside the country. In addition, several of the ninety-nine projects on display at the event will be funded with funds from the National Endowment for the Arts’ general fund, which was established in 1935 to ensure that the arts were not overtaxed. “The Future is Now” is being organized with the help of Charles", "The next Biennial should take place in 2021, and the museum’s “dream team” will continue to work closely with the artists of the region to flesh out that vision, Wallace said.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to shutter its doors to the public on March 31. According to the Los Angeles Times, the institution did not anticipate the sudden, nationwide shutdown of its art holdings. “To us, this was not an emergency,” said director Michael H. Lee. “Rather, it was a decision to focus our efforts and energy on the art we continue to produce and will continue to produce in the years ahead.”While the museum closed due to Covid-19, on Thursday it announced that it is reopening with a full staff and institution-wide celebration. The celebration will take place on Sunday, March 27, from 11 AM to 2 PM and will be held at the Museum’s new home on Wilshire Boulevard, where the institution will temporarily relocate to reduce the risk that Covid-19 will return.“We have contemplated this decision for some time, and I welcome the opportunity to emphasize that the decision was not made lightly or in a vacuum", "The next Biennial should take place in October 2020, and the event’s organizers have already received a pledge of $50,000 from the artist-run group Artadia.\n\n\nThe Hopi Tribe of Arizona, which has suffered through the loss of forty-two members of its immediate family over the course of a decade, has appointed artist-run nonprofit the Hopi Artists’ Association (HPA) as its new board chair. HPA was founded by artist-activists Ben Lerner and Thomas J. Price in 2017 to support the survivors of the February 11, 2018, arson attack on their home in an attempt to prevent them from leaving their home state of Arizona to pursue alternative careers. Since its founding, HPA has worked with a variety of partners, including the National Center for Arts and the Arizona Museum of Art, to produce over seventy presentations, including the rarely shown biennial “The Life and Death of My Family,” which debuted at the Arizona State Fair in January 2020 and was followed by a special exhibition at the Museum of Mormon Art in Salt Lake City in February 2021.The new chair will be created by Billie Tyles, who currently serves as the director of the Arizona Museum of Art, and will be", "The next Biennial should be held in 2019. “Groundswell’s efforts to raise funds for this exhibition have been instrumental in its future,” said David Cioffi, president and CEO of the Art Institute of Chicago.  “On behalf of the board and staff, I’m proud to partner with Groundswell to organize this year’s exhibition. We hope that the exhibition will become an example for other artists to think about the importance of support in their creative endeavors. The foundation is now more than ready to welcome visitors to the exhibition.”As a part of the same triennial, the foundation also created the biennial-size exhibition “Groundswell: The Art of Living.” That exhibition, which opened last week at the Museum of Contemporary Art Chicago, is on view until October 28. A second exhibition, “Groundswell: Live,” scheduled for October 24 to October 28, will continue to run through the end of October.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released the list of seventy-five artists who will receive a gift from the estate of artist Alighiero Cipolletta, whose work", "The next Biennial should be ready by the end of the year. Museumgoers will have the opportunity to view the exhibition through an immersive 360-degree video experience, and the exhibition will return to the United States next spring. In addition to the biennial, the Foundation will invest $1.5 million into the arts and culture of Bristol and the City of Bristol. The money will go towards the creation of a new community art space, an artist-in-residence at the Bay Arts Campus, and an engagement with the local community. The Biennial will also host a number of events and activities in partnership with the surrounding local communities, including the Museum of Bristol and the National Maritime Museum. The University of Bristol is reluctant to comment on the future of the Biennial, but said: “We are working hard to ensure the future of the biennial is protected. As we continue to move through the repair of the Bay, we will continue to support and inspire our audiences and communities through an array of contemporary artworks by our artists and curators. We hope that today’s announcement will not be the last as the Museum of Bristol and the Bay continue to perform and engage with the", "The next Biennial should be an epic success, they said, and should be attended by as many people as possible. The organizers said that a new exhibition for the series will be organized and presented in the coming months.\n\n\nThe Saudi Arabian Ministry of Culture has released an updated design for the Grand Mosque in Mecca. It comprises three sections, each with a different theme, and was curated by architect Ahmed al-Qasimi. The pavilion, which was built to house around one thousand people, will reopen in 2022.The ministry chose to create a new building, named the Al-Muhajirin, to host the pavilion in 2022. Al-Muhajirin is one of the two new buildings to be constructed in Mecca. The other pavilion, the Al-Nujaba, is planned to be completed in 2025.According to Saudi Press Agency, the ministry’s remarks about the pavilion were made in response to a question regarding the construction of the pavilion. Al-Qasimi told the royal news agency that the ministry’s announcement about the pavilion was not related to his work, and was not aware of it when he was making it. The Al-Muhajirin pavilion will be inaugurated", "The next Biennial should be held in the city in 2022 and will expand the theme to include “California and the Pacific,” a project of the Department of California, which has awarded the winner $3 million.\n\n\nThe SculptureCenter in New York is teaming up with the Metropolitan Museum of Art in New York to create a series of works that examine the relationship between artists and the city. The first exhibition, “The Metrics of the City,” will open on March 20 and will feature work by artists such as William Eggleston, Tony Hsieh, and Louise Bourgeois. The second will open on July 1 and will feature work by artists such as Robert Irwin, Tadao Ando, and Laura Owens. The third will be held in the summer of 2021 and will include work by artists such as Louise Bourgeois, Abigail Henningsen, and Sarah Luft.The partnership was formed in order to extend the reach of the Museum of Modern Art’s annual Biennial to people who live within a one-hour drive of the Museum of Modern Art in New York as well as to promote the museum’s collection in a manner similar to the Diaries series, which", "The next Biennial should be held at least twice a year. The festival will begin with a free program of speeches, performances, screenings, and other events on October 29. The 2019 edition, which was organized by the same organizers as the biennial in 2020, was postponed due to the Covid-19 pandemic. The twenty-third edition, which was originally set to take place in March will now likely take place in October 2021.The project of the biennial, called Biennial of States, was inspired by the essay “We are States,” written by the American theorist Robert Irwin in a 1929 essay titled “Sovereignty or Sovereignty Contradict” for the introduction of his book Sovereignty and States. This book remains a foundational text for understanding the history of states. The theme of the biennial was established through a series of participatory arts and cultural events organized by the United States in partnership with twenty states, including California, Colorado, Florida, Hawaii, Maine, Maryland, New York, New Jersey, and Pennsylvania, as well as Mexico, Honduras, and Guatemala. Each state, in turn, selected an artist or writer to represent their state. The artist chosen to represent each state was determined by an", "The next Biennial should focus on the intersection of art and technology and other disciplines including art history, design, and medicine. The 2020 edition will take place at the Toca Boca in Barcelona, Spain.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta is seeking the services of artist-in-residence Haleigh Yee as its next academic artist-in-residence. Yee, a native of East Atlanta, will serve as the MFA’s associate curator of contemporary art and technology. She will also assume her responsibilities as associate curator of media, technology, and performance.“At this very moment, as we face the daunting challenges of climate change and the impact that the arts and technology sector will have on our climate, I’m honored to be selected as the MFA’s next MFA artist-in-residence,” Yee said in a statement. “I’m excited to begin the new chapter with the MFA, its amazing and dedicated curators and staff, and the incredible Atlanta community.”Yee will begin her tenure in November, 2020, and will remain there through March, 2021. During her tenure, she will collaborate with the MFA�", "The next Biennial should be held in 2020, and the next should be organized in the United States.The biennial will be held at the Hayward Gallery in Los Angeles and will employ an indigenous and internationally acclaimed contemporary art practice—Architecture School of the Arts, Los Angeles (ASLA), the Los Angeles Museum of Art (LA MoCA)—to present the exhibition. The fifty-first edition of the event will be held at the Broad in New York on February 20.In a statement, the Broad said: “The biennial will focus on the history of the contemporary artist as well as the history of art in general, and will encompass a combination of contemporary art, architecture, and design and is projected as being in line with the themes of the biennial, which is that of culture and design in general.There will be an exhibition at the Broad and a number of venues that are part of the LA MoCA community, including the Broad’s Center for Contemporary Art and the Contemporary Art Museum Los Angeles, both of which are currently opening, and the LA MoCA Museum of Art.” The Broad’s Jane Panetta, who is currently an assistant curator at the Portobello Sculpture Garden in Fort Lee,", "The next Biennial should be awarded to a different artist on February 23, 2020; and the 20th to a different artist on March 25, 2021. The design for the museum, which will be located in the old Dunbartonshire site on the banks of the River Dee, was submitted by the artist Laura Owens. The nomination was made by Diana Furr, director of the Tudor Museum, London, and John Middleton, artistic director of the Museum of Modern Art, Manchester. The full list of curators  for this year’s Biennial is as follows: Artist:Wei Zhang/Phoenix Wright/Frank Gehry/Anna Atkins/Saara Asaad/Pei Gobbe/Luta Büttner/Paul Gauguin/Arthur Schopenhauer/Robert Irwin/Josie Pickering/Tina TungOther:Complementing the exhibition are performances by the artists featured in the exhibition, including Sittzza Huyghe, Museum of Contemporary Art, Atlanta, Atlanta, Georgia, and HIR/UPD’s presentation of Rory Mulligan’s Selected, a self-portrait and portra", "The next Biennial should be held in the summer of 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed David Koepp as its new chief curator. Koepp comes to the institution from the Museum of Modern Art, New York, which he has led since 2014. He succeeds Loring Randolph, who departed in the summer of 2021 to become the museum’s new curator-at-large, and will assume his responsibilities in January 2022.“I’ve long admired David’s talent and vision, and his ability to shape the Museum’s exhibitions and collections in ways that make them uniquely his,” said David Siegel, chair of the museum’s board of trustees. “On behalf of the board, I’m excited to welcome him to MoMA. He comes to the institution with a proven track record of delivering major exhibitions in thoughtful and innovative ways, and I look forward to seeing how he works with the current group of artists attending the Biennial.”Koepp joins MoMA from the Metropolitan Museum of Art, where he has served as chief curator since 2015. In his new role, Koepp will lead the museum’s annual", "The next Biennial should also aim to introduce a new generation of artists to the history of biennial, this time focusing on the careers of the three discoverers of the prestigious Baudelaire/Global’s “Risschop Gold” series. The new collection will take its title from a series of paintings created in the mid-1950s by Marcel Proust, Gertrude Stein and Isamu Noguchi, and will be curated by Sara Cwynar, director of the London Biennial, and the Lincoln Biennial.\n\n\nThe Israel Museum in Jerusalem announced on Tuesday that Ariel Sharon, the former prime minister of Israel and the current director of the Israel Museum, has been appointed as its next director. Sharon was selected unanimously from a shortlist that included Orit Steyerl, Eli Elkin, Nikhil Palani, and Omer Gabi. Sharon previously served as head of the Israeli Arab Museum in Jerusalem, where he was involved in organizing the exhibition “Arab Spring: From Arab Spring to Arab Spring,” 2013—a retrospective of twenty-two works by Ghanim Salam, G", "The next Biennial should be held in 2021 to coincide with the twenty-fifth edition of the Berlin Biennale, which was announced last month. According to The Guardian, the event will take place in the new site of the Schönefeld Gallery, and will be hosted by the Institut für Deutsche und Internationale. The venue will also host exhibitions dedicated to Franz Kafka, Max Beckmann, and the artist-communist Emma Goldman. In a statement, the museum said that the decision to abandon the project was made over two years ago, and said that it will continue to work with the Schönefeld Gallery and the Berlin Art Market to present programming in the new venue.\n\n\nThe Carnegie Museum of Art in Pittsburgh has been hit by a loss of $11.6 million in revenue since March 20, 2020, due to the Covid-19 pandemic. The state-run institution attributed the shortfall to fluctuating ticket sales and collections, low attendance at special events, and the cost of overtime and living expenses. “When the Covid-19 pandemic first started in late March, we anticipated a shortfall of $11.6 million,” said Christopher McClellan, director and CEO of the museum. “", "The next Biennial should be held in 2021. The show, which was founded by two British Columbia artists, Catherine Martin and Jasper Johns, will draw from biennial collections across the globe. It will also feature a selection of works by artists who were not involved in the first edition.The next edition of the biennial will be held in the city of New Delhi on March 28, 2022. The show will serve as a platform for artists from India, the Maldives, Nepal, Sri Lanka, Pakistan, China, and Japan.<|endoftext|>The South Asian American Arts Festival, which was held last year at the Brooklyn arts space the Brooklyn Museum, has canceled its next edition, slated to run September 12–September 15, 2020. Organizers cited the coronavirus pandemic as the reason for the move.“The South Asian American Arts Festival, an annual event that celebrates the indigenous arts of South Asia, was canceled due to the coronavirus pandemic,” said Brooklyn Museum director and CEO Daniel H. Weiss. “We are devastated. The event will resume as soon as possible, but it is doubtful that the 2020 edition will go forward.”South Asian American Arts Festival presentations have been canceled every year since", "The next Biennial should be held at the Meiji Museum in Tokyo in 2021 and the proposed 2020 iteration should be held in the Miyazaki Museum in Kyoto. The 2013 edition was held at the historical center's new building in Ginzu, with the theme Nanami. The 2020 event will be held in the museum itself. \n\n\nThe Rosha Art Museum in New Delhi has appointed Manoj Mehta as its new director. He replaces Karnataka governor Ravi Shankar, who has served as the Vice-Chairman of the institution since 2014.Mehta was appointed director in September 2019 after serving as the director of the prestigious Art Authority of India (AIA) in New Delhi from 2017 to 2019. He succeeds Ravi Shankar, who is currently on a four-year sabbatical, and will take up his new post in January.During his tenure, Mehta oversaw the 2016 and 2017 editions of the Rajadandikus, which were staged in New Delhi, and organized several exhibitions, including a retrospective of the work of the late Pakistani artist Abu Saeed, which was presented by the AICC Museum of Modern Art in Mumbai. \n\n\nThe Stedelijk", "The next Biennial should continue to work with a number of local groups to create an immersive environment for visitors to experience the works in a way that will allow them to fully participate. We hope this work will encourage you to continue to work with the curators and the artists to create an immersive experience for our visitors to our galleries.”The 2019 exhibition will be at the Museum of Modern Art.\n\n\nThe German government is preparing to spend nearly one hundred million euros to create the new cultural center of the capital city of Cologne, as part of a regional plan to stimulate the local economy. The federal arts agency BILD estimates the $107 million project will create at least 25,000 new jobs. The announcement follows a plan to spend a further $76 million to create around three hundred new jobs in the city.“Capital projects are the fundament of economic development,” Alexander Neugebauer, a former minister of cultural affairs who is now the minister of culture in the state of North Rhine-Westphalia, told the Art Newspaper. “This can be realized by developing a local cultural center in the city, and by supporting the local arts in the city, and by encouraging a local economy in the city. Such projects are the foundation", "The next Biennial should be the first to take place in the new museum’s former location in Dubai. The exhibition will feature work by sixty artists from twenty-three countries, including China, India, Japan, and Korea, and will have a seventy-three-meter-tall replica of the 1893 World’s Fair in New York. Artadia, the Dubai-based arts-focused incubator, has been awarded a $149,000 grant from the Dubai Foundation for Contemporary Arts (DFCA). The prize honor comes with a $100,000 cash prize and a unique embossed steel sculpture by the artist Samy Amimor, a work that will be installed in the museum’s courtyard.Just last month, the DFAA announced that it received a $242,000 grant from the Ruler of the United Arab Emirates, Hamdan bin Zayed, and announced that it is planning to create the largest multi-million-dollar arts complex in the world. The new 272,000-square-foot museum will feature twenty-seven curiosities, including the museum’s current headquarters and the Art Institute of Chicago, as well as a new auditorium, gardens, a theatre, and restaurants. The project is", "The next Biennial should open in the spring of 2020. The festival will be held at the Museum of Modern Art, in New York, and will run from March 17 to March 21.\n\n\nThe Australian Museum of Fine Arts (AusMFA) in Melbourne has received a $10 million donation from a private collection led by the late Australian curators and collector Peter Drucker, who passed away on October 10. The gift includes a series of works by forty-two artists, including Helene Ghebaly, Sali Sunak, and Adam Mickens, and is valued at $16 million. The funds will help fund the renovation of the museum’s collection, which Drucker organized with his wife and fellow Australian collector Alice Drucker, and will also support an exhibition of work by twenty-eight artists, including Mark Salter, John Graham, and Dennis Hopper.“The Drucker family have been instrumental in transforming AusMFA into one of the most prestigious and respected institutions in Australia,” said museum director Elizabeth Ann Macgregor. “The gift of these works is a great tribute to Peter and Alice Drucker, and to the enormously talented team at AusMFA. We are thrilled to open our doors to", "The next Biennial should focus on the representation of black women in the arts. “This is a challenge that is as important for us as it was for the African diaspora to be able to organize in the first place,” said Guggenheim curators Trisha Brown and R. Rosalyn R. Davis. The show will address issues such as the legacy of the Black Power movement, the legacy of Black women, and the work of Black female artists. The exhibition will also explore the history of the late nineteenth-century genre of illusionism, with a particular attention to the work of the Black body artist Mary Compson and the Black artist and activist Betsey Wright. The exhibition will include works by twenty-one artists between the years of 1934 and 1959, as well as a selection of work by Black American artists. The 2019 edition of the Biennial, titled “Revolution of the Body,” is scheduled for the Manhattan Museum of Art. \n\n\nThe Museum of Fine Arts (MoFA) in West Palm Beach, Florida, announced today that it is planning to open a new five-thousand-square-foot exhibition space in its Contemporary American Art (CAFA) campus next month. The", "The next Biennial should be announced in October 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that Amanda Halperin, the curator and director of the exhibition “The Power of Print: Modern Art from the 1970s to the Present,” will return to the institution to helm the third biennial, “The Power of Art: Art from the 1960s to the Present.” Halperin will serve as interim director until the permanent director is appointed. “For nearly twenty years, Amanda has been a central force in the quest to understand art history through the lens of photography,” said Mark Wallach, chair of the board of trustees of the Whitney Museum of American Art and the inaugural chairman of the rich list. “Her extensive experience, her commitment to diversity and inclusion, and her eagerness to challenge what it means to be an art historian, make a difference in the world, and think about art history through the lens of photography make her an ideal fit for the role.”Halperin first joined MoMA in 1996 as a curatorial assistant, working her way up to the position of senior curator by 2015. She cofounded the photography club photojournalism and was", "The next Biennial should include a retrospective of the work of São Paulo-based artist-activists João Pessoa and Augusto Mujica. They will be the first artists to play the pivotal role in the history of the Biennial.\n\n\nThe Florida Museum of Art (F.M.A.) is preparing to reopen to the public this week following a $50 million expansion. The institution, which was forced to move the 2015 exhibition “Color and Light: Contemporary Art in the Age of Color” due to the coronavirus, is opening in the historic and quintessential Manatee County venue on May 23. “The restoration of the permanent collections and galleries of F.M.A. and the natural setting of its campus has been the theme of this year’s Bicentennial,” said museum director Jean-Jacques Ghebaly, who added that the new building will improve visitor access to the museum, accommodate more exhibitions, and incorporate a new library.According to the New York Times, the $50 million expansion has been made possible through a donation from the late collector and philanthropist Peter W. Peterson. A Florida native and philanthropist, Peterson, a former chairman of the New York", "The next Biennial should be held in 2021. Currently, the subject of the exhibition is a reconstruction of the Château d'Honneur in France in the year 1750. The biennial will present the works of more than eighty artists, including Isamu Noguchi, Canradino Rondinone, and Zoya Mier. The exhibition will also include a presentation of works by contemporary artists including Minayoshi Nara, Roberto Cicutto, and Antonio Grinbergo. In the first annual edition of the show, published by the festival in 2012, Meryl Stephens, director of the Biennial de Lyon, France, gave an overview of the fiveteenth edition. Renowned for its precision and history, the exhibition is the fourth edition of the annual Biennial du Lyon, which has taken place annually since 2003. The event, which has received many accolades from art critics and cultural figures, including from the pope, was founded by Bertrand Goldberg, the former president of the French Ministry of Culture, in the Parisian rue Vendôme in 1976. \n\n\nA group of artists and collectors are challenging the sale of works by the late Egyptian architect Mohamed Salah, who", "The next Biennial should have a presentation of a work by a single artist to mark the occasion. The second edition of the exhibition, to be held in 2020, will have a selection of works by forty-six artists, who will be given three years to write their reflections on a single canvas. Commenting on the exhibition, Artforum editor-in-chief Daniel H. Wilson wrote: “The exhibition will showcase the most ambitious and visionary renditions of works by artists of every generation, from the avant-garde, to the contemporary, and to the past. It will also present a reexamination of the cultural landscape through a combination of new and traditional approaches, elevating the exhibition’s themes and the works on display to new heights.”\n\n\nThe twenty-third edition of the Fifty-Third Venice Biennale, curated by a collection of forty-three artists and curated by Andrés García-Sánchez, Domenico Cattelan, and Edoardo Fusi, has announced that eleven new works will be presented at the event, which will take place in Kassel from March 14 to March 16, 2020. The event will also introduce a new edition of the Universal Hour", "The next Biennial should be held in 2021.\n\n\nThe Museum of British Art (MoB) in London is rethinking its future after it was forced to move its 2020 edition—which was canceled due to the Covid-19 pandemic—out of a climate-controlled building because of safety concerns. The change marks the third attempt the museum has made to move its exhibition space since the pandemic began in late March. The previous two attempts, which were both unsuccessful, resulted in the museum moving the show to a different space in the city.“We have made an enormous commitment to working with our partners to create a plan that ensures we have the capacity to continue to present internationally acclaimed work in the coming years, and that we are able to continue to support the creative and cultural life of the city,” said Tom Barclay, director of MoB. “This change will ensure that we are able to present in the future a collection that represents the breadth and quality of British Art’s history.”MoB’s new climate-controlled exhibition spaces will be inaugurated by “The Black Museum’s’s” reconstruction of a museum exhibition in the 19th century, which will be inaugurated", "The next Biennial should be on August 25–September 1.   This article was first published by Artforum’s Summer 2018 issue.\n\nThe Queens Museum in New York has appointed two new curators: Reem Al-Khalili and Hamza Walker. Al-Khalili, who previously served as a curator at the Brooklyn Museum and as the inaugural director of the Queens Museum, is a Los Angeles native who studied at the California Institute of Technology and the University of Hawaii. She is the author of several books, including The Anatomy of the Movement: Power, Politics, and Politics at the Embarrassment of the World (Norton Simon & Schuster, 2018) and The Teaching of Islam: From the Quran to Americanism (New York University Press, 2018). He is also a professor of art history and theory at the University of Chicago.The appointment of Walker, who has been a curator at the Los Angeles County Museum of Art for more than twenty years, follows the institution’s decision to move the exhibition The Rehearsal (2017), which is currently on view in the institution’s former location at 638 West Twenty-Third Street, to a new home in the", "The next Biennial should see the return of the work of many of the best-loved artists of the twentieth century—including João Fábio, Luis Miguel Pérez, Andrés Manuel Pérez, and Lucio Cruz. The 2020 event will be in its first year and will feature works by artists such as Ricardo de Holé, José Delia, and Gabriel Garcia María.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles revealed today that it will reopen on Thursday, March 23, 2020, following the completion of a $450 million renovation and expansion project, which ushered in a new, more visually engaging exhibition space and ushered in the renovation of the museum’s original building. The museum will reopen on a weekday schedule, beginning at 10 AM, and will host two exhibitions, “The Body and the Body Art” and “The Body in Art.” The construction of the new museum and the renovation of the institution’s existing spaces was overseen by architect John Lee, whose firm, Lee & Arab, designed the renovation of the institution.“Art has always been central to MoCA’s mission and it", "The next Biennial should take place at the Hirshhorn Museum as soon as possible. “The next Biennial is the best way to think about the future of art and culture in America,” said Deborah Rich, chair of the board of trustees of the Hirshhorn Museum. “It is about time that we considered what it means to be part of a larger world, a larger collection, and a larger world’s story. Art and culture is about more than the sum of its parts and about making things of art that are made by artists. . . . The next Biennial will be a chance for artists to make an important contribution to a larger and broader group of artists, and will be a powerful moment for museums.”Since the highly anticipated new exhibition, “The Lighthouse,” will be staged at the Kunsthalle Basel until December 22, the exhibition has faced a number of delays, including a redesign of the venue that was supposed to take three years to develop. The redesign was completed in 2016 but only recently began to go ahead, and while the new exhibition will bring together more than thirty artists, the revised Kunsthalle will only display their works. \n\n\nThe Emperor’s New", "The next Biennial should be held at the Nelson-Atkins Museum of Art in Kansas City, Missouri, in 2022. Sam Varnham, director of the J. Paul Getty Museum, said: “That is an extraordinary achievement, given the difficult circumstances that we are all facing, and it certainly is a legacy that we wish to pass on to our children and grandchildren. We will work with the Smithsonian to ensure that the next Biennial reflects the spirit and spirit of the past.”\n\n\nThe National Society for the Arts (NYC) has received a $500,000 donation from the estate of the late art collector Paul Graham, founder of the eponymous company, which was formed in 1956 to market and distribute art. The gift follows a three-year campaign led by arts advocates and a coalition of arts and cultural organizations to secure the organization’s future through a public offering. “The estate’s commitment to supporting the arts is a great victory for the campaign to save the National Gallery of Art,” said Sarah Wiles, executive director of the Campaign for the Future of the National Gallery of Art and Museum of Art. “We are so proud to share such an important gift with the", "The next Biennial should also aim to re-imagine the exhibition and the collection in order to make it more relevant to the contemporary world, and should include an open-air sculpture garden in the heart of the city.”Cultural critic Arazul Rasool, who was appointed curator of the second exhibition at the Biennial in 2015, told the Art Newspaper that the fundraising drive is part of an effort to “rebalance” the exhibition, which comprises forty works by thirty artists, toward a new era. “The current exhibition is designed to represent several different strands of work that are seen together in a particular moment in time, in this case the exhibition of the first work by Zaha Hadid, 2015, and his new sculptures.”The artist-run gallery is planning to raise $20,000 for the project, which is part of its mission to present “contemporary art” at an affordable price. If the fundraising effort is successful, Biennial 2 will open in 2021.\n\n\nThe Honorees of the Order of the British Empire (OBEs) have come together to condemn racist violence and attacks on Black and Indigenous people and their cultural heritage in the UK. Following the racist attack on a Black artist", "The next Biennial should be in the second half of the year.” The museum will also consider new ways to support the arts through programming and exhibitions and the development of new events and programs.\n\n\nThe São Paulo Biennale team announced today that they have received a gift of 112 works from the former director of the Museum of Modern Art José Ferrer-Pereira, Brazil. The donation includes works by artists such as Nude, Heather Klein, and Anita Kahana, as well as other historical and contemporary works by Ferrer-Pereira and other biennial directors, Marcelo Boarzano, and Risa Quintana, as well as a selection of contemporary Brazilian artists.Ferrer-Pereira’s gift includes works by seventy-four artists, including Alexandre Bochereau (1958), Peter Andre (1962), Cristina Alves (1963), Rory Baccari (1968), Anna Miro (1979), Luiz Andujar (1989), Nicoletta Maric (2018), and Amanda Pilar (2019).According to the museum, the works were purchased from the collection of Marcelo Boarzano and", "The next Biennial should be announced soon. “The same is true of the National Geographic Society,” said James Cuno, the director of the exhibition space. “When you have somebody as rich and prestigious as John Siracusa, you want to have an institution dedicated to his work that will inspire people to do more in the future. That’s our mission.”Biennial organizers announced their plans for the 2020 edition, titled “The Past,” in March, after receiving a $2 million donation from a group of wealthy collectors. The fund will allow organizers to duplicate a twenty-year retrospective of Siracusa’s work—there are currently no plans to organize such a show again—and to create a new platform for the artist’s work.The public will be able to see the new work, which will be mounted in a new gallery, at the Smithsonian Design Museum in Washington, DC, in June. “John Siracusa’s work is timeless, and it is also filled with stories that are timeless,” said Sylvia Katz, the chair of the exhibition. “We are thrilled to gather together to see these stories told through", "The next Biennial should take place in 2020, and the entire project, which was developed in partnership with twenty-five local, regional, and international artists, should begin shortly thereafter.“In the last twenty years, the Phoenix Art Museum, the Walker Art Center, the Art Institute of Phoenix, and the KTH, among other institutions, have successfully transformed their collections through the exhibition model,” said Marc Glimcher, director of the Dayton Art Museum. “The new Biennial, with its focus on research and critical reflection, will bring a fresh and dynamic point of view to these works, as well as provide a means for the public to experience and connect with the artists, their projects, their art, and their collections in a meaningful and creative way.”Glimcher also said that the new series \"will offer a new and diverse perspective on the biennial, serving as a time for the artists and the museum to reflect on the themes and concepts that shape their lives and work.” The 2020 theme, “Mesmer: One Life,” is a reference to the theme of the biennial’s inaugural edition, “Mesmer the Imaginator.”\n\n\nThe Museum of", "The next Biennial should be held in 2020.\n\n\nThe São Paulo Biennale, Brazil’s edition, which was canceled due to the Covid-19 pandemic, is back on. The fair announced on September 22 that the event will officially open in the city of São Paulo, Brazil, on September 29. The first show, titled “Talking About History,” will run from September 24 to September 28.The Brazilian artist and activist Ana Isabel Oiticica, whose work combines both pulchritude and historical specificity, resigned from her position as creative director of the Bâtica Foundation, which supports artists who have been imprisoned or who were victims of torture during the dictatorship of Jair Bolsonaro in the 1980s, in protest of the group that organized the event through a New York–based nonprofit called the Center for Contemporary Art Research (ACAR).“I want to make it clear that I am not against the Center for Contemporary Art Research (ACAR)’s mission, but I would like to see them change their name and work with a different organization in order to be recognized as an art center,” said Oiticica. “This is a political act,", "The next Biennial should open in 2021. About the Author: Tae-lin Lee is a freelance writer and educator based in Los Angeles, California. Lee is the author of the forthcoming book Tongue Tied: The Modern Sexualization of Literature (Hogarth Press, 2019) and the forthcoming Tongue Tied II: The Modern Ghetto (Hogarth Press, 2020).Lee is also the cofounder and director of the media and performance program Artistic Space, which he founded in 2010. He writes about performance, performance art, and performance art in his blog, HowToSpillThruBooks, and tweets as @TaelinLee. He has been nominated for a Pulitzer, a Guggenheim Award, and the Los Angeles Urban Film Festival. The Art Newspaper said that Lee \"plays with lines of dialogue and the limits of the medium. His writing has been called far-out, thought-provoking, and beautiful, and his performance is stellar. His work embodies the best of contemporary performance and his performances reflect his own—a kind of gestural coven that opens up visions and boundaries of what we can imagine and what we can radiate. His performances are perfect for", "The next Biennial should be held at the XVIII Olympiad, in Cinnari, Italy, in 2022. The upcoming edition of the biennial will feature ten artists from the developing world. “While the exhibition will be an extension of the present, the position of the artists in the exhibition will be as relevant as possible,” said director and CEO Loring Randolph. Acknowledging the importance of the exhibition for the generation who grew up with it, she added: “I feel very lucky to be able to present this exhibition with a team who is dedicated to this project.” The 2018 edition of the exhibition, “The Future Is Now: Artists in the Age of Black Power” was nominated for a Golden Lion at the Fifty-Ninth Venice Biennale, and the first half of the exhibition was shown at the Museum of Modern Art in New York from November 13, 2019 to March 21, 2020.\n\n\nThe National Geographic Society (NGS) in Washington, DC, has announced that it will move its headquarters from its current home in the historic East Wing of the Smithsonian Institution to the new National Geographic HQ in the West Wing. The announcement follows a yearlong investigation that began with a survey of the", "The next Biennial should be staged in 2021.\n\n\nThe American Israel Museum (AIM) in New York is preparing to welcome visitors back to the institution next month following a six-month closure due to the coronavirus pandemic. The institution, which was forced to move the exhibition “Beauty and the Beast” from its temporary home in the Brooklyn borough of New York to a larger outdoor space in a building adjacent to the museum last fall, announced the news on Monday.AIM director Christopher Woolard said: “We know that the threats to our staff and the future of the exhibition are grave and continuing, and we are working hard to address them. The decision to reopen was a no-brainer. The state of our health and safety is of paramount importance to us, and we fully expect that our visitors will return for a retrospective of this or the next year.”Ishigarow (Japan)’s Midway Museum in Tokyo has announced that it is preparing to reopen in March 2021 following a five-month hiatus. The newly renovated museum, designed by the architect Tadao Ando, features a new exhibition on the life and death of Japanese artist Yukio Mishima, as well as new works by", "The next Biennial should take place in the summer of 2021. “The path that we have chosen today prioritizes cultural preservation,” said director Junya Nakano. “We hope that this year’s exhibition will serve as a signal that our city, city of Osaka, and city of the future will indeed present a truly extraordinary array of works in the future.”Since the institution declined to increase the funds for the biennial by four hundred million yen, the Art Newspaper reported on March 34 that the Japanese government had committed to giving the financial support to the museum in a bill that was passed by the senate last week. The legislation will allow the government to set up a special fund for works in the museum, which will receive ¥100 million per year.The bill stipulates that the fund will be managed by the Japan Foundation for Art and History, which will manage the fund in accordance with a plan developed by senior art historian Tadao Ando. The foundation will also be given ¥50 million for each of the next two years, and the government will provide another ¥50 million for a third year.\n\n\nThe University of Washington in Seattle has announced that its graduate center will become the first in the country", "The next Biennial should begin shortly after the closure of the Museum of Modern Art, and will open on August 24. The first episode of the biennial, “The Beginners” will focus on three decades of work by twenty-three artists, including Berenice Abbott, Richard Anagnos, Cora De Martin, Ailan Geller, and Peter Hujar. The second episode will feature works by twenty-four contemporary artists, including Filippo Arcimboldi, Francesca Barotti, and Filippo Faiori. The third installment, “The Moderns,” will be about twenty-five artists who have made their mark on contemporary art over the last twenty-four years.In celebration of the ten years of the the Biennial, the 2019 exhibition will be launched with “The Times,” a special exhibition of work by fifty artists that will open at the Museum of Contemporary Art (MoCA), New York. This year’s edition will include the first retrospective devoted to a single artist in Los Angeles and will run for twelve weeks. The show will also feature the first solo shows of artists such as Michael Brodsky, Olga Albizu, and Urs Fischer.The Museum of Contemporary", "The next Biennial should probably be called Guerrilla: Why Art Matters. Already, the answer is not a resounding yes.<|endoftext|>Eddie Vedder, the cofounder of the experimental New York electronic music collective SIREN, has died at age fifty-two. He was a beloved mentor and friend of many an aspiring artist and a beloved teacher.Born in Queens, New York, in 1962, Vedder studied at the city’s Pratt Institute before beginning his musical career in New York’s Greenwich Village. In 1986, the year he died, he was awarded a lifetime achievement award from the New York City–based arts organization the Arts Council. An accomplished choreographer, actor, writer, and producer, Vedder established himself as one of the leading figures of the electronic music scene in the 1980s. He would live out his final years in London, where he had spent the previous decade traveling the world and recording his work. His music, which came from a mix of progressive and classical styles, was influenced by the likes of Curtis Mayfield and Sonic Youth, and his art was made in response to a primal urge to dance. In 2017, the Museum of Modern Art in New York commissioned his work, the Virtual Eden,", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Boston has unveiled a new initiative that will offer free admission to twenty-six artists through its 2017–18 season. The program, called the Free Fall for Artists, will run through October 21 and will include a series of performances, residencies, and other public engagements.The program, which has been in the works since 2015, aims to raise $50,000 for the museum. The twenty-six artists chosen for the program are:Adrienne Boudin, Brooklyn, New York;Anish Kapoor, New York;Arts State, New York;Ashley Laure, New York;Borota Chan-Davis, New York;Bradley Crivens, Chicago;Brennan Doran, Philadelphia;Carol Eubanks, New York;Michael Rosenfeld, Chicago;Darren MacGill, New York;Bryan Lee, New York;Brianna Martin, New York;Carolyn Oduya, New York;Carolyn Porco, New York;Cara Prosser, New York;Carolyn Ross, New York;Celeste Ritter, New York;Dara", "The next Biennial should, like its predecessors, bring together a large group of internationally recognized artists, from seventeen countries, as well as a small group of curators and researchers.  The first iteration of Biennials for the Arts was organized by the Alipay organization, which is based in Beijing.   The upcoming event will be held at two locations—the Art Museum of Beijing and the Museum of Contemporary Art Beijing—on the Beijing River, the historic Yangtze River, and the Incheon Sea\u0097as well as at two locations in Liaoning, Suzhou, and Kunming, and will run from March 7 to March 10.\n\n\nThe Museum of Contemporary Art Singapore (MCA Singapore) has received a $25,000 donation from the William Blair Foundation. Established in 2012 by William and Barbara Blair, the foundation's board chair, MCA Singapore is prioritizing giving the family an additional $5,500 to continue its work in supporting contemporary art in Singapore. The sum is part of a commitment to support a greater diversity of ideas and approaches in the arts.“The foundation is honored to receive the William Blair Foundation’s support of this year�", "The next Biennial should focus on the 'art of life', which should incorporate the work of artists and their communities, as well as the changes that are happening in the world and the artists that make it possible.  The next edition will focus on the art of the body, and an effort should be made to consciously re-create the feeling of being alive. The next edition should aim at highlighting the contributions of the particular artists whose works are selected for the fair’s programming.  The 2020 edition will be curated by Steven Foster and Hiromi Takahashi, who have served on the annual exhibition for the past twelve years. “The Biennial’s theme of Art and Life should be explored in depth through the exhibition’s curatorial program,” said Steven Foster.  “Both Hiromi Takahashi and Steven Foster have shown great artistic integrity through the years. We will continue to make our own creative decisions and will therefore continue to do this work. The new partnership framework for the 2020 Biennial will allow Hiromi and Steven to continue to develop and explore the themes and artists of Art and Life and will give us the opportunity to continue to focus on the work of the artists who", "The next Biennial should focus on the legacy of the Soviet architect Andropov, who designed the Grand Kremlin Palace in Moscow, as well as reconstructing the Bayrut-Voskresnaya River in the city of Volgograd in the center of the country. The exhibition will return to the Soviet Union in 2020.In a review of the exhibition in the May/June issue of Artforum, Peter Hujar wrote: “The show, which was curated by Mikhail Botkin, in collaboration with Alexander Shcherbakov, is the first to have been held in the Soviet Union by a non-Russian director (and in the only event held in the country outside of Russia). Botkin and Shcherbakov’s work derives from the same background as Andropov and Elisheva, and extends the theme of the program from a contemporaneous perspective. Though the show has some of the hallmarks of Botkin’s prior works, it is particularly his first work, which addresses a ‘flexibility of human perception,’ and these themes are central to his subsequent work.”The biennial will be staged at various historical sites throughout the city of Novosibirsk, including the", "The next Biennial should be held in the spring of 2020. If the project is approved by the Council, the venue should open to the public in December 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received an unexpected donation of eighteen works by well-known contemporary artists, including Robert Irwin (1957–1966), Barbara Kruger (1957–1966), and Andreana Johnson (1958–1964). The donation, which adds twenty-three works by ten different artists to its collection, includes works by Jane Birkin (1943–1954), Carlos Castaneda (1957–1965), David C. Driskell (1957–1966), and Erma Sharp (1947–1964).“We are thrilled and grateful to the recipients of this extraordinary gift,” said James Cuno, director of the Museum of Fine Arts. “Bridget and James are longtime patrons of MFA and are grateful to the MFA for continuing to support their passion and vision for the collection, and for their continued efforts to advance the museum’s art and art history.”The works in the gift package will be presented in a series of exhibitions that will explore the impact of the gift on", "The next Biennial should be held in 2021. “The next Biennial will not be the grand event of our time, but an extension of the work of our elders, who have guided the exhibition in a manner that will last for generations.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has been awarded a $50 million grant from the John D. and Catherine T. MacArthur Foundation to help address the exhibition and research needs of a cost-effective and diversified public arts and culture workforce following the pandemic.The grant was delivered in addition to a $75 million enhancement of the museum’s collection and staff in 2018 as part of a $100 million expansion and renovation of the museum’s collection and collections, including the establishment of a new featured work and exhibition, “The Righteous Mind: Art and the Creative Life of Art” (2019), and the acquisition of “Supercalifragilisticea” (2018) and “The City and the Sun: 9,600 Photographs from the Life of Yoko Ono” (2018).The vision behind the grant, which is part of MFA’s strategic plan to", "The next Biennial should take place in Lyon, France, and is currently on schedule to open in mid-November. The exhibition, titled “The Body of Art,” will highlight the work of seventy-three artists from twenty-four countries and territories. The exhibition’s theme of the year, “the body,” refers to the body as a whole and is a way of linking contemporary art with historical, contemporary and contemporary art. Other themes of the exhibition will include the relationship between the body and the artist, the body and the medium, and the body and art.“The Body of Art,” will run alongside the upcoming exhibition “The Body of Art: Transforms,” which will be staged at the Institut Luisa: Le Monde in Paris on November 19–22. The thirteenth Venice Biennale will be held in 2021. A full list of participating artists can be found on the Venice Biennale’s website.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Molly Schoof as its first senior director of curatorial affairs and curator-in-chief. Schoof comes to the institution from the Museum of Contemporary Art (", "The next Biennial should examine the history of the exhibition from the perspective of the artists and should consider how the exhibition might be organized in a location other than at the Museum, which is currently under construction. The announcement coincided with a wave of protests against the museum in New York, where hundreds of art workers staged a sit-in in April. Art critic Roberta Smith’s letter to the Art Newspaper s February 27 issue claimed that the new exhibition “will comply with the Museum’s policy on the exhibition of contemporary art, but will be less exhibitionist and more participatory.” While the Biennial’s current exhibition “The Lasting Presence of Art: Art and the Cosmic Body”  isn’t a pity show, it does not attempt to analyze or explain the role of art in the lives of the various participants in the exhibition. Instead, it presents a series of paintings by the Brazilian artist-activist Evelyn Pimentel. The show will consist of twenty-one works by Pimentel, two of which are scheduled to open on September 6 and September 7, respectively.The works in the show have been nominated for the 2018 Pulitzer Prize in criticism, which will be", "The next Biennial should take place in 2021 and will receive a twenty-first-century audience. \n\n\nThe Museum of Modern Art (MoMA) in New York has announced that it is preparing to welcome visitors back to the institution in 2020. The museum has been closed since March 14, amid the Covid-19 pandemic, and has been working to determine the exact date for its reopening. The institution will hold its first exhibition of works by the Stanford University Graduate School of Art (SFGH) in 2021.The institution has also updated its 2020 budget and schedule. During the coronavirus pandemic, MoMA paid $9 million in damages to the artist-run collective Laundromat Workshop and Arts and $3 million in damages to the tenants of the former Laundromat building at 1490 East Twenty-Fourth Street. The institution plans to pay out of its own resources but will cut the rent of two buildings next-door at $1.5 million each. In addition, MoMA has committed to rebuilding the entire building and creating 1500 new square feet of public space to replace the three-story, half-century-old museum.In a statement, MoMA said: “We are excited to announce our 2020–", "The next Biennial should be announced by the end of the year. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to expand the scope of its relationship with the California Institute of Technology (Caltech) in the United States. The museum has hired Maureen Shanahan, who has worked for the institute since 2008, as its chief executive and general manager. She will assume her responsibilities on January 5, 2020.“We’re thrilled to hire such a respected and talented woman to lead our next iteration of 'The Future Is Present: Digital Art, Technology, and the Art of Tomorrow,” said museum director Matthew Teitelbaum. “Maureen is uniquely positioned to continue Caltech’s work and future vision as a leading institution of modern art and technology in North America. We look forward to working with her to realize this vision and to deepening our relationship with the California Institute of Technology.”Maureen has worked for Caltech since 2012 as a visiting assistant professor of art history and director of curatorial affairs. During her tenure at the institution, she organized three exhibitions that faired particularly well at the Biennial, including “Visual Arts ‘50/80: The Art of the Digital", "The next Biennial should take place in the year 2021–20 and will be held at a venue that will be chosen by the artist-run organization. The biennial will then examine how the relationship between art and science can be reconsidered and re-imagined.  \n\n\nThe Israeli artist and educator Omer Baruch, whose practice explores the ways in which contemporary art and technology can be placed at the center of both new and old Israel, has died at age seventy-eight. Backed by a ten-person team of curators and engineers, Baruch created works that include installations and live performances, hybrid performances and videos, books, films, an urban landscape, and a book of poetry.Born in Tel Aviv in 1937, Baruch studied at the Technion-Israel Institute, Tel Aviv University, the Bezalel Academy of Art, the University of Arie, the University of Haifa, and the University of Ben Gurion. He also studied at the Technion and Walt Disney University before moving to the University of California, Los Angeles, where he received his Ph.D. In 1974, he moved to New York, where he studied with Baruch and learned the methods and techniques of the software and is-art movement", "The next Biennial should take place in the summer of 2021. The next iteration of the biennial will take place in the spring of 2022.Following the biennial will be two exhibitions, “The Structures of Life” and “The Mediums of Life.” The first show will be housed in the exhibition space the Marfa Art Museum in Texas; the second in Menorca, Italy.\n\n\nWhile the Art Newspaper has published several reports about the steady decline of art galleries and their artists\u0097dissolving away from the New York art world into the suburbs and the commercial real estate in which they operate\u0097there has been no shortage of discussion about the future of the art market.For the London-based collector and art historian Peter Tatchell, who sold his studio in New York to the city in 2017\u0097the Art Newspaper article was “the cherry on top, the cherry that took everything away from me.”Since the article, which was published June 7, 2018, has been widely circulated, Tatchell and his wife have been receiving death threats and have had numerous people contact them to say that they plan to burn the entire article\u0097which was written by David Streb, of the New Art Deal", "The next Biennial should be in New York at the Brooklyn Museum, which is also hosting a free public event on March 18, 2020. The 2020 edition will feature new works by thirty-five artists, including Marcel Prouvé, Isamu Noguchi, Evelyn Waugh, and Joël & Anke Hauptmann. The 2019 edition, titled From the Woods to the Floor, was curated by Christine Michael and Kris Olah.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of two early works by Charles I. & Charles II. Both the artist and his wife, Muriel I., were intimately involved in the design and construction of the museum, which opened in 1949 and houses a collection of more than 1,500 works\u0097the largest collection of work from Charles I. to Charles II.“Through their relationships with their clients and clients’ designers, Charles and Muriel I. have been instrumental in the development and design of the MFA,” said Marc Glimcher, the museum’s director. “Their gift celebrates their years of together designing and designing for clients, and the MFA’s new relationship with Charles I., as well", "The next Biennial should be held in the spring of 2020. \n\nThe Sci-Fi and Fantasy Art Museum Houston (SFAM) has appointed Alison Horwitz as its next executive director. Horwitz succeeds Ed Solomon, who departed the institution in March 2019 to head the University of Houston. Horwitz will assume her responsibilities in August.“We are thrilled to welcome Alison to SFAM,” said Sarah McNamara, chair of the board of trustees. “She has developed a strong and growing reputation in the art world for championing artists, espousing a strong sense of community, and cultivating a strong network with the Houston community. The board and staff are grateful for her tenure and wish her continued success in leading SFAM.” The institution, which recently celebrated its fiftieth anniversary, currently has a staff of thirty-three and has recently added two more positions to its board of directors: it is now accepting applications for its first full-time position in the museum’s current name; and it is developing a new collection project for the museum. The board of directors has also awarded $20,000 in scholarships to two students this year. \n\n\n\n\n\n\n\nAlison Horwitz, executive director,", "The next Biennial should be held in 2021. The same year, the Netherlands will hold a second exhibition at the Biennale, this one titled “Unfinished Business: Painting in the Seventeenth-Century.” The first show, “Tacita Bernhardt: ‘Like a Virgin,’ was staged at the Museum of Modern Art in New York in 2008. Curated by Anne-Sophie Herzog of the University of Amsterdam, the exhibition was a joint exhibition between the two institutions and was a part of a larger project titled ‘Post-Modernism.” Bernhardt’s work is now housed in the collections of the Biennale, the Museum of Modern Art, and the Museum of Contemporary Art Rotterdam.\n\n\nAs the United States prepares to celebrate its first black president, the Museum of Fine Arts (MFA) in Boston is preparing to welcome a new group of artists and activists to the institution, dubbed “Our Way Forward,” in 2021. Represented by artist-run nonprofit Artadia, the group is led by Hanna-Kate McKoy and includes artists including Phoebe LeBlanc, Domenick Maier, and Hilar", "The next Biennial should be held in the fall of 2022. “The Biennial is not an exhibition, but a living organism, a living work,” said Toyosaki. \"In order to create a new work, we need to open up our artistic spaces and organize events within them. This is our chance to create a new identity for the Biennial. We cannot let this chance pass us by.” In the future, the biennial will work with artists and galleries to present a selection of works from its collection, which also comprises works by many of the artists represented in the exhibition, for their exhibition and for the general public.\n\n\nNatalie Nogier, a New Orleans–based artist and educator, has been named the winner of the $25,000 Leonardo da Vinci Legacy Award. Presenting his \"Portrait of a Lady\" in the French pavilion at the Venice Biennale in 2015, Nogier developed a new way to visualize the artist’s most famous work, a painting titled The Affair of the Dancers, 1987. “Nogier has managed to create a new way to see the work, one that is both personal and relational,” said prize jur", "The next Biennial should be in 2021 and the show should be held in California. “It’s a real shame and a serious disappointment that the decision was made so early,” said biennial director René Morales. “The Art Newspaper reported last week that the commissioners had come under strong political pressure from the desert region to cancel the event. We don’t want to see the event tarnished by such a scandal.”The organizers said that the decision was made in the context of the newly elected National Council of the Arts. Its members included representatives from the National Democratic Institute, the Environmental Protection Agency, the Department of Health and Human Services, and the Department of Education. The council’s composition was also influenced by a group of thirty-seven California legislators, who sent a letter to the organizers of the biennial in October 2019, urging them to delay the event until the legislature could act on bills that would address climate change.The California Democratic Party, which launched a campaign to condemn the commission and to urge the institution to cancel the event, has since received a letter from twenty-eight lawmakers in support of the decision. However, the letter, which was signed by Senator Adam Driver, chair of the Senate Democratic caucus", "The next Biennial should be held at an undisclosed location in the city of Akron. The 20,000-square-foot museum is currently under construction and is expected to open in the summer of 2021. “The future of the Biennial is at risk,” said Ciara Iannone, director of the Museum of Contemporary Art Cleveland. “We must act now to protect the future of this unique exhibition space and of the city of Cleveland. We must also ensure that the Museum of Contemporary Art Cleveland maintains its unique identity and attracts new audiences year round.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to divest from its parent company, the Beaux-Arts Foundation, and reinvest the funds into artistic projects that will benefit the local arts and cultural sector. The move, which was made in the interest of reducing the museum’s financial contribution to the Beaux-Arts Foundation, will allow the foundation to focus on its core mission of advancing the work of contemporary artists.“We are confident in the long-term success of the MoCA Foundation and our artists,” said museum director David Kamin. “But as we consider the impact", "The next Biennial should be held at least two years after the completion of the first edition, and the first edition should be a good representation of the current developments in the field. In addition, the Treasury Board should invite representatives from India, the US, and Australia. The UK is also a strong participant, as evidenced by the Expo London , which was held in July 2019 and drew an audience of 120,000 people. The tour will also include an exhibition of the work of British artists, and the London Biennale will be staged in the City of London.According to Artnet, the project of the biennial will cost $10 million, and will be organized as an exhibition of twenty works by British artists, including Nigel Landy, Peter Sellout, Mark Rylance, John Sze, and David McAllister. The full list of participating artists is as follows: Ashraf Amira, Sara Adams, Larina Adeva, Peter Cook, Kazheon Gadd, Sarah Hannah, Bridget Riley, Wilfred Steeves, Dirk Vogels, Mark Rylance, Alistair Wilfred, John McAll", "The next Biennial should be held in 2020. The next one, which will be held in 2022, should be held in the same location. The organizers of the new exhibition, Space, are hoping to raise $100,000 in support of the new partnership. \n\n\nThe Selenis Center for the Arts (SCA) in Stockholm, Sweden, has welcomed David McAllister as its new dean of contemporary art. McAllister joins the Selenis from the Kunsthalle Dusseldorf in Germany, where he leads the Museum of Modern Art (MoMA), and will be responsible for the development of the institution’s institutional collection. He succeeds Bjorn-Olofsson, who was named dean in February 2019, and will begin his tenure in March.“We are delighted to welcome David, who has been a valued member of the Selenis Foundation family for more than two decades, and to his growing board of trustees,” said board chair Katja Johansson. “We know that he will make the Selenis Center for the Arts a key institution for the development of contemporary art in the United States and Europe, and an institution for which we can be proud to be a part", "The next Biennial should be a success. I predict that over the course of the next eighteen months, we will be able to come together as a community to witness and experience the magic of art in the city. I am grateful for the opportunity to lead this effort. Sincerely, Robert C. Farquharson Executive Director \n\n\nThe Museum of Fine Arts (MFA) in Boston is preparing to reopen to the public in September with a retrospective of artist-built works that is being co-organized by Ian Scott-Railton. The exhibition will highlight the contributions of seventy-four contemporary artists to the theme “Building Blocks of Design” and will be held at the museum from September 9 to September 11.The construction of the exhibition and the history of the exhibition are intertwined. The museum opened in 2015 with the exhibition “Spilling Over: Painting and the Construction of Modernism” and “Marching Band: Art as Happiness,” which examined the avant-garde performance of Dutch artist Christian Marsch. The show finished its run in 2017 and was acquired by the curatorial team of Helen Cammock and Loring Randolph.In a statement, the museum said: “The future of", "The next Biennial should begin with a presentation of a selection from the exhibition “Feminine.” The exhibition will then proceed to a lecture by Christine Miller, the curator of feminism and gender studies at the Museum of Fine Arts in New York and the author of Sisterhood’s “Women” (2019), and then a daylong workshop with artists in the museum’s newly refurbished space, the Museum of Arts. Set to open in 2022, the exhibition will be hosted by the Museum of Modern Art and the Los Angeles County Museum of Art in conjunction with the institution’s forthcoming sixteenth edition. The first exhibition—originally titled “The Women in Paris”—is now closed.“This is a very exciting time to become a curator,” said Kelly. “We will continue to present women artists to you here on the Biennial, and I am eager to see the work of women artists in the upcoming exhibition.”\n\n\nThe Metropolitan Museum of Art in New York has named Gertrude Bello as its inaugural director. Bello succeeds the late Helen Frank, who was responsible for spearheading the organization’s landmark retrospective of the artist", "The next Biennial should take place in Tokyo in 2021 and will be hosted by the Tokyo Metropolitan Museum of Art. The exhibition will encompass work by twenty-four artists in addition to the twenty-fourth volume and will be led by the Japanese-American artist Katsu Kondo.\n\n\nThe Metropolitan Museum of Art in New York has hired Leslie Rutledge as its next director and chief curator. The appointment marks a new chapter for the institution, which has been dealing with the aftermath of the devastating September 11, 2001 terrorist attacks on New York and Washington, DC.In an announcement on Monday, the museum said that Rutledge will be responsible for \"engaging with the cultural and social landscape in order to advance and enrich the museum’s important collections and programs as well as the museum’s mission.”Rutledge comes to the Met from the University of Chicago, where she has served as a curator for the last five years. She has worked as an independent curator since 2007 and is currently a visiting lecturer. During her tenure at the school, she curated “Lévy Gorvy: From the Arts to the Streets” (2018), “Aldous Huxley: The Mystery of Paintings” (2015), and", "The next Biennial should take place in Washington, DC, in 2022. The event will be hosted by the Smithsonian American Art Museum in partnership with the National Museum of African Art in Atlanta.The exhibition will focus on the history and theory of European masterpieces through an international cast of curators that includes José Cabuera, Lucy Lippard, Adriana Pindell, and Mimsya Talbot, and will culminate with a reception for the eight finalists. The winner of the prize will be announced in the autumn of 2022.“We are thrilled to be working with the Smithsonian American Art Museum to present a retrospective of José Cabuera’s first exhibition in the United States,” said Mark Thompson, the museum’s director. “As a curatorial team, we are inspired by the gift that the Smithsonian gave us in 2018. The prize is a powerful illustration of the breadth and depth of our gift, and the importance of Leonardo for the institution in the year 2022.”\n\n\nThe Royal Academy of Arts (RA) in London has appointed Jack Reynor as its new chief executive. Reynor replaces Paul Mpagi Sepuya, who was appointed as RAE’s director this summer,", "The next Biennial should take place in 2022.\n\n\nGreek Culture Minister Yanos Tsakalotos announced that the government will create a new fund for the promotion of Greek culture in an effort to stem the country’s economic crisis. The announcement comes as the government is preparing to take the first steps in a massive restructuring of the Greek economy that will involve the sale of state assets and the restructuring of the public sector. Tsakalotos told the Art Newspaper that the program will be a “bridge to a new era of cooperation between Greece and Turkey.” The plan has faced opposition from some members of the governing Syriza party, which is seeking a fifth-year budget surplus, and has been criticized by the Left-Green Movement, which is campaigning against the restructuring.\n\n\nThe British Museum in Athens has received a gift of more than a thousand artifacts from the British Museum in Rome. The gift includes artifacts dating from the Renaissance to the Victorian period and includes pieces dating from the Ottoman period to the 1930s.British Museum director Hartwig Fischer confirmed the donation as part of a project to create a new collection with Greek and Italian collectors. “The team achieved an unprecedented feat this year: bringing together more than one hundred objects together in one", "The next Biennial should be held in the spring of 2021. If the timetable is followed, there would be no need for the capital to re-open in order to support the reconstruction of the Fondazione di Louisa and its redevelopment into the Piazza della Francesca. “At a time when the crisis in our city, our country, and our world is global, we must invest in art and culture in order to sustain its vitality and creativity,” said Mayor Luigi Brugnaro.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than 1,600 photographs and films made by artist Thomas Newcomer. The donation was made in honor of the artist’s birthday, March 17, and comes on the heels of a donation of photography paraphernalia made in memory of his father, Fred Newcomer.Born in 1937 in New York City, Thomas grew up in a family of photographers. His father created a large-format family photograph of his mother and father’s wedding, for which he offered to sell the prints, and the family moved to California, where his mother took the family to visit her sister and her parents in the Pacific Palis", "The next Biennial should be held in 2021.  The absence of a successor museum in Rio de Janeiro, where the Brazil 16 was held, is a concern for the city’s future. The World Museum in Prague, previously slated to open in 2020, has also been threatened. Brazil’s president, Jair Bolsonaro, however, declared that a new exhibition and exhibition would be presented at the institution in 2021. In a speech at the National Museum of Brazilian Art in the capital Brasilia, Bolsonaro said: “Our state is strong and will continue to be strong.” The exhibition will focus on the Rio de Janeiro-born artist Mariana Alves, who, in a 1989 show at the museum, made historical drawings of the Amazonian region of Pernambuco. The work will be on display until July 28, 2021.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Matthew Schwartzman as its next director and CEO. Schwartzman succeeds Caroline Ortega, who was hired by the MFA to lead the museum, and will take up the post on January 9. Schwartzman has previously served as director of Massachusetts’s Public"]