["The next Biennial should take place sometime in the next few years.\n\n\nThe Masai Museum in Japan is taking a new step in its plan to open a new 1,300-seat museum in the city of Nagoya. The institution, which was already working with a team of architects to design a new building for the institution in the city, has now hired Shenandoah Glass to design the new museum. The company will work closely with architect Masaoka Takeshi, who is spearheading a $150 million revitalization project for the city, as they come up with the architecture for the new museum.“The new museum will enter an exciting time for it,” said Shuji Nakayama, director of the Masai Museum. “It will be a landmark in Nagoya, and in the world. Its new mission will be to further be a bridge between Tokyo and Nara, and to engage with the local community and the people of Nagoya. I’m keen to see how this museum will be received by the local community and I look forward to working with the local team and the local designers to create the new museum as a wonderful home for the institution.”Founded in 1950s, the museum has been", "The next Biennial should draw a crowd of 20,000. The next will be held in 2019, and it is possible that the last will indeed be held in 2020.The mountains of the Andes are vast, and their diversity of flora and fauna unparallelled by any that has ever lived. But how can they be represented in such a manner? The answer lies in the iconic sculpture, La Pintra, by Pablo Picasso, which is situated in the capital of Bolivia, the Andes, not far from the pristine Andes. The work was born of a dream of a large-scale installation for the Bolivian Ministry of Culture in 1994. The installation, titled Monarch of the Clouds, featured a group of yellow, red, and white birds, each surrounded by a single, reflective glass pyramid. The performance was inspired by the Bolivian Bolivian People, who all too often are treated as exotic and disembodied. The exhibition was staged in collaboration with the Bolivian artist and theorist, Agustín Pérez-Montenegro; the artist and architect, Naima J. Farah; and the architect and curator, Íñigo Villar.The exhibition was designed by", "The next Biennial should be held in 2022, and the organisers are currently drafting the theme for the exhibition. \n\n\nThe New York State Court in Manhattan has ordered the Metropolitan Museum of Art to pay $3.15 billion to Sotheby’s following a legal battle over the auction house’s sale of works by American painter and activist Andy Warhol in 2016, the New York Times reports. The court found that the museum failed to properly compensate the artist for the value of his art and concluded that the forfeiture is illegal.The case stems from the Met’s attempt to collect $1.5 billion in unpaid sales tax following a civil lawsuit brought by the United States after a former Sotheby’s employee sold an Andy Warhol painting, The Warhol Collection, in 2008 for $524,000. The court awarded the estate $4.7 million.When Sotheby’s filed a counterclaim, the court found that a initial appraisal of the work by the estate valued the works at $1.3 million but called the value of the next work by the Andy Warhol family, created in collaboration with Robert Rauschenberg, at the auction house “incomplete” and ruled in", "The next Biennial should focus on the history of contemporary art in Spain, with a particular focus on the work of Santiago de Almagro, Adrian Piper, and Guadalupe Cesarco, and on the influence of the Spanish Middle Ages in the development of contemporary art.Commenting on the exhibition, José Antonio López, the executive director of the Student Union at the University of Rijeka, said: “We are pleased to host this exhibition, which will deepen the understanding of the history of contemporary art in Spain by introducing new and unexpected perspectives.”\n\n\nThe Lahore Biennale Foundation has announced that it has received a $1.2 million donation from the Italian conglomerate Anselm Group, the parent company of Generalità delle Papesco, one of Italy’s largest arts corporations. The donation brings the total amount raised for the LOCAD Art Foundation to $1.2 million and recognizes Lahore’s role as an important cultural and creative hub in South Asia and the Arabian Peninsula.Lahore’s contribution is also significant in light of the current tensions between Italy and India over the ten-year-long construction and renovation of the UNESCO World Heritage Site of the Taj", "The next Biennial should be in 2021, where it will open two years early in order to accommodate the unprecedented global health crisis. “The greatest challenge of the event will be to make a work that reflects and embodies the spirit of the best of contemporary art,” said Alexander Lütjai, director of Art Basel Hong Kong. Though the institution has yet to decide whether to extend the theme, the first pavilion, “Ascension,” will feature works by artists such as Anna Atkins, Guggenheim, and Prospera. The second pavilion, “The Unseen,” will present works by artists such as Wolfgang Päch, Arsht Animation Company, and Olu M.L. and will open on November 17.  The biennial will also introduce new programs and events that will engage with the theme.  The theme for this year’s event is “Connections,” and will be communicated through the artists who will each design a piece for the exhibition. The selected artists will be announced in the fall. \n\n\nThe National Galleries of Scotland and the National Galleries of England announced today that they have completed their multimillion-", "The next Biennial should take place in 2020 and will aim to \"expedite the transformation of the festival’s programming to reflect the region’s needs and to include new creative and experiential possibilities.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that the institution will remove the sculpture, which was installed in 1969 as part of the installation “The Body and the Machine,” in protest of the Vietnam War, on display in the museum’s collection. The work, which was made by artist Robert Irwin, was commissioned by MoCA director Norman Foster. The installation, which was installed in the museum’s courtyard, features three bronze statues of women celebrating a woman’s right to choose. “The Body and the Machine,” was commissioned by Foster and artist David Anthony, who died earlier this year, as part of a series of “anonymous” works whose subjects include bodies, drugs, and politics. According to the Los Angeles Times, the work, which was financed by Foster, was removed from the museum in March 2019 after more than three hundred individuals signed a petition protesting its “hidden” content.The petition reads: “The", "The next Biennial should be held in the spring of 2020.\n\n\nLille Art Museum, France, has received a gift of seventy-nine works from the French curator Joseph Lecavalier. The Museum of Modern Art (MoMA), New York, is also planning to reopen in the fall. Lille, which has been struggling since it was founded in 1874, has been working to secure funding for its renovation and has received funds from the French Ministry of Culture and from the government of France, the Ministry of Culture and the Institu de la République (IRI), the Institut national de la fabrication et de l'époque (INPE), and the French Ministry of Education.“The Museum of Modern Art (MoMA) is putting its art in its collection and collection in these works is of great importance for the development of our collection,” said Liwaa Jawad, director of the museum. “With this gift, the Museum of Modern Art (MoMA) has scored a great victory with respect to its collection. As a matter of fact, it is the first institution in France to receive the gift of these works. The work is a masterpiece of the French avant-garde and will", "The next Biennial should focus on the history and current problems of the ‘Arab Spring,’ as well as the art and architecture of ‘60s and ’70s Iran, and will aim to “explain the evolution of contemporary art during the tumultuous history of the Islamic Republic,” according to the invitation. The institution also indicated that it is planning to make a “strong artistic statement in the form of a ‘art museum’ dedicated to the art of the future.”In an interview with Artforum in October 2018, Gardner described his upcoming exhibition as “a response to the current crisis.” He said: “I hope that this exhibition will be a wake-up call.”\n\n\nThe American Alliance of Museums (AAM) has welcomed Kevin F. Walsh, a leading American artist and scholar who helps organize exhibitions and engages in national public policy, to its board of directors. Walsh has served as the director of the National Museum of the American Indian (NMNA) in Washington, DC, since 2016. In his new role, Walsh will be responsible for leading AAM’s national program, which has been partially funded by the National Endowment for the Arts, and", "The next Biennial should be held in May 2021. The board is currently working through the planning of the event, which will involve the installation of fifty glass panels in the museum, representing twenty-eight different biennial themes. The exhibition will also include a documentary about the exhibition, titled Kiss of Death.\n\n\nThousands of cultural workers and activists are participating in an international strike that will last for forty days, from March 7 to March 12, in an attempt to secure higher pay and improved working conditions. According to the London-based arts advocacy group the Office, sixty-six percent of UK museums are refusing to reopen, and seventy-seven percent are planning on continuing with business as usual.The Local Government Association (OGA) and the Royal Association of Graphic Arts (RA) have announced their support for the strike, which will last for thirty days, and the majority of galleries and other cultural institutions have since followed suit. Among those unable to are the Palais de Tokyo and the Tate. However, on Friday, March 12, the Royal Shakespeare Company (RSC) announced that it would suspend its March tour until March 14, as part of a wider international campaign to protect the public’s economic security. The strike will run from", "The next Biennial should be announced in 2020, the organizers said.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of more than five thousand photographs by John Stuart Mill, a leading Victorian artist whose controversial use of reproduction techniques was explored in his landmark 1968–73 exhibition “The Death of Nature” (1972–73). The work is on display in the institution’s Gordon C. Daniels Gallery and will be included in a special exhibition “John Stuart Mill: The Living Tomb” that opens on April 3.The donation, which was made by Turner Prize–winning artist Avery Johnson and his wife, Caroline, was made during a show of the artist’s work at the museum in July 2018. An online auction of the photographs was held, and the work was donated to the museum by artist and collector Julie Parsons.The gift includes five photographs by Mill, “The Death of Nature” (1962), “The Dying Star” (1966), “Jasmine” (1966), “The Beehive House” (1974), and “Made in London” (1977). The final photograph, which is titled “The Crying of Rivers", "The next Biennial should be in December 2025, and the first show in June 2021.  The institution is planning to open another exhibition space in the building currently occupied by the museum, the X-Art Gallery.  In a statement published by the museum, it said that it is looking forward to welcoming visitors again and being able to “explore the conceptual and creative possibilities of art and architecture through the museum’s collection, design, and installation.” \n\n\nThe Royal Academy of Arts (RA) in London announced today that it is creating a new role for women within the arts, with the appointment of Hannah Behan as its new chair. Behan joins the academy from the Royal Academy of Arts (RA) in London, where she has held the role of chair since 2013. She will take up the post on January 3, 2021.“The RA is committed to supporting the careers and ambitions of women and we are working hard to build on the legacy of Gere Kavanaugh, who gave his life to the arts to help achieve equal opportunities for women in the arts,” said Paul Mayhew, the chair of the RA. “This is an exciting time for the RA, as we look to", "The next Biennial should not take place until the spring of 2021, but the organisers are hoping to make the move possible as soon as possible. The exhibition will be hosted by the Parisian cultural district La Belle Equipe and will culminate with a virtual reality exhibition. The exhibition will include works by seventy-five artists, including Pierre-Auguste Renoir (Abenexheuil), Pierre-Auguste Renoir, Robert Antonacci (Arles), and the Painted Ladies (Prélude Unité d'Art Contemporain), and will be inaugurated by a virtual reality performance by the Slovenian artist Sarina Heimer and will take up themes such as privacy and the boundaries of the self and art and will conclude with a discussion of modernism and its relation to the biennial. The reopening of the exhibition will be celebrated with a concert and rally by the National Association of the Arts (NA), an umbrella organization of the arts and architecture in Finland. The event will also include the installation of a mural that celebrates the history of the first exhibition, the theme 'Lévy Goriot: La Belle Equipe” by artist Marc-Olivier Bénétière, which will be on display in the", "The next Biennial should focus on how the human condition will respond to the pandemic. The next will focus on how art and disease can re-claim and re-shape our collective lives. The next will focus on how art and artworks can become instruments of social change. We will know that we are living through a moment of transcendence when, one hundred years from now, we will look back on these works and wonder how our world has come to be.”  The third phase will be a discussion of how artworks, including ceramics, glass, and paintings, can shift through time in order to affect the course of history and the world. In the final phase, the exhibition will conclude with a question-and-answer session and a reception.The Biennial will be hosted at the Uffizi Gallery in Venice from March 21 to March 25, 2020. The exhibition will be curated by Aldo Pindell and will be organized in partnership with the Italian Ministry of Culture, the National Institute of Cultural Heritage, the Uffizi Gallery, and the Uffizi Art Museum and will be sponsored by the Uffizi Foundation. Note: The full list of participating artists is as follows:Devote", "The next Biennial should be held in the summer of 2021.The biennial will be organized as a series of exhibitions that will engage with contemporary art issues, in consultation with local and international artists, galleries, and scholars. The inaugural exhibition will showcase the work of twenty-four artists. The closing exhibition will include the work of ten artists. The exhibition will be curated by Art and Life Institute staff and will be held in conjunction with the Fall/Winter biennial of the Greek city of Olympia.Other partners of the biennial include Altwire, Gogol Bordello, Lisson Gallery, Haus der Kunst, and Polifya. The concept of the new partnership is that each institution will present their respective works in a different atmosphere, but with the same goals, articulated by Art and Life Institute: in a way that will be relevant to the audience.The first show, “Monopol: The Body and Art of Michael Olowu” (2019), is a multi-part exhibition that will explore the experience of the artist from his work in the Bay Area during the late 1970s through his current project, “I’m Not a Robot: Reframing Capital,” which will run in the August/September", "The next Biennial should be held in late August or early September at the Velodrome Montréal in the city of Montreal. In the past, the event has been held every two years.The exhibition will feature new works by thirty-eight artists and will draw from forty-five years of the biennial’s programming. The next iteration of the biennial will take place at the Toronto Art Gallery in August 2020.\n\n\nWatermill Arts Center in Doylestown, Pennsylvania, has received a $10,000 donation from the Larry and Rebekah Lawrence Foundation. The $9,500 gift was made in recognition of the Lawrence’s support of local artists throughout the United States in support of programs that promote a more diverse range of artistic practices, foster artistic experimentation, and support the development of creative communities.“This is a very important year for artists,” said Krista Schmitz, president of Watermill. “The foundation is committed to supporting artists and their ongoing work in supporting the Lawrence family as they pursue their own creative projects. Larry and Rebekah Lawrence was founded in 1997 by their parents, Larry and Shirley Lawrence, and their siblings, Rebekah and Michael Lawrence. The foundation came under", "The next Biennial should be held in 2021, and the last in 2015, and the last in 2025. The organizers have also been working on revising the code of conduct, which will be simpler, more streamlined, and more responsive to the needs of the historical site. Artforum visited the museum in March to ask the following questions:“What are the goals of the upcoming exhibition?” The museum had previously announced that it would focus on reinventing the exhibition as it has in the past. But its president, Michael Detroit, said that the museum will focus on 'expanding the exhibition’s public presence, focusing on the latest in contemporary art, and delivering a show that will engage with the broader cultural landscape of Chicago.”Detroit also said that the museum will launch a new digital platform that will be free to the public. The platform will be powered by the same open-plan design as the museum’s current digital platform, but will be divided into two pieces, one for the public, one for museums. MUSEums in the city are not allowed to build their own physical spaces.\n\n\nThe Greek and Italian governments are pushing ahead with plans to open the country’s first museum of ancient art", "The next Biennial should be held in Los Angeles in 2021 and will not only look at the influence films and music have had on the development of the artist-directed biennial, but will also consider the relationship between movies and art and the upcoming film biennial.The festival will be hosted by Lloyd Broadcast Group. Its inaugural edition, titled “A film is only a movie,” explored the relationship between the cinema and the natural world, including the relationship between art and nature. The show will be followed by the exhibition “A Film is Not a Picture” (2019) in London and the exhibition “Art and Cinema: Art and Film” (2019) in Los Angeles. The digital program will be delivered via a biennial-style exhibition space, which will also be housed within the building, the Los Angeles County Museum of Art, and will run from November 8 to December 2.  The exhibition will be curated by Kiki Smith and will feature works by seventy-nine artists, including Jeffrey Gibson (2019), Mieko Kiki (2019), Rina Kyra (2020), Hayao Hidaka (2020), Lilya Lee (2019), Lydia Long (2019), Tanya Man", "The next Biennial should, in fact, be held in the same building as the museum, in September 2020. The theme for this year’s iteration of the gallery show is “The World We Made.” (and a hundred other films and artworks). Philip Klass, director of the museum, said: “The museum will continue to be a beacon for New Yorkers, drawing visitors to see exciting new works by contemporary artists and new works by celebrated artists and artists who have been neglected or overlooked. We look forward to the future and will continue to be a place for the art of our time.”\n\n\nThe Chinese artist Wang Xianmei has died at the age of seventy-eight. He was born in Shanghai in 1932, the son of a Sichuan cotton merchant and a Māori woman who immigrated to Japan in the 1940s. In 1947, Wang transferred to a formal art school in Nanjing, where he graduated in 1966. In the following years, Wang’s art was exhibited at international fairs and was included in numerous Chinese and international art books. In 1997, he was awarded the first prize at the Shanghai Art Biennial, and in 1999, he received a National Artist", "The next Biennial should take place in 2020, and the first in the United States in 2022. The exhibition will mark the centenary of the start of the American Biennial, which was held in Philadelphia on March 23–March 29, 1915.\n\n\nThe Arts Council, the UK’s professional body for the visual arts, is launching a £50 million fund for cultural producers. The arts sector contributes around £115 billion to the UK’s economy and supports more than 4.3 million jobs.Launched by arts minister Maria Asbill and arts patron Sir David Mitchell, the £50 million fund will be administered by the council, which has received more than £500,000 since the announcement of the fund. The fund will be made up of a combination of grants and loans and will be delivered in stages.Stage 1: The arts sector is a net contributor to the UK’s economy, providing around one in three jobs and one in ten council tax revenues. Stage 2: The arts sector provides around one in five jobs, accounting for almost two thirds of all full-time work in the UK. Stage 3: The arts sector employs around one-third of the UK’s total workforce, accounting for a", "The next Biennial should be held in 2020. The next iteration will be held at the Museo de Arte Contemporáneo in Madrid, which will host the event in March of 2021. From the cover of the biennial: 'Themes of fear, the future and the body, the work will be an exploration of the relationship between the body and the world. ‘The Body to Body’ will bring together three communities: the native inhabitants of the Amazon Basin, Argentina and Brazil, and the artist communities of Peru and Brazil, to create a shared vision of our shared history.”\n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has appointed Stephanie Rojas as its next executive director. Rojas, who will assume her position on January 6, 2020, succeeds Carolyn Spilker, who has served as the institution’s director since 2009, and will begin her tenure in January 2021.“Stephanie has been instrumental in many key initiatives at SAAM, including the reopening of its new Museum of the American Indian (Museum of American Indian, or M.A.I.), the 2018 reopening of its new curatorial galleries, and the", "The next Biennial should take place in 2020.\n\n\nThe Portuguese architect Luiz de Almeida has won the 2020 Pirelli World Road Championship. The biennial, which celebrates the history of Italian road design and the work of over seventy artists, aims to raise awareness of the importance of art in driving innovation and economic growth in the country. “We are thrilled with the result,” said Giancarlo Mediani, the winner of the Gran Canaria Award, which is awarded annually by the Pirelli Group to a Tunisian architect. The Pirelli–designed pavilion opened to the public in the city of Castelo Branco in southern Portugal in February.Commenting on his design, de Almeida said: “In my designs, I give myself the responsibility to create a permanent record of the accomplishments of the artists. I hope that this Pirelli World Road Championship will give the chance to other artists to form an impression of my work through a real exhibition.”The artist-in-residence at the Pirelli pavilion will be Roberto Padova, Fabio Fusi, Filippo Bonini, Lenna de Cesarco, Ruba Mautz, Mau", "The next Biennial should take place in 2023. The 2018 event, which was organized by the Museum of Contemporary Art Sydney, was a hit and drew an audience of almost 3,000.\n\n\nThe Library of Congress in Washington, DC, has appointed William C. Jones a board member of the National Endowment for the Arts (NEA), which manages a collection of over three thousand works of art. Jones is the author of the forthcoming book “The Library of the American Book: From the Archives of Art” (Yale University Press), with Polly Podmore and Laurel Morgan. The book will reveal how the NEA has funded the acquisition of more than five hundred works of art since its founding in 1958, including work by Jane Austen, Goya, and Rembrandt. “Jones is one of the earliest and most distinguished scholars of twentieth-century art and is a leading authority on twentieth-century American art,” said John Roach, the director and chief curator of the Smithsonian American Art Museum in Washington. “His work is a precious tribute to the NEA’s long legacy of presenting important works to the public.”A scholar of the twentieth-century American art and literature, Jones", "The next Biennial should be held in 2021.  The artist’s current project will be to create a new work for the exhibition “Wu Shanshu,” organized in partnership with the Beijing Art Museum, which will open in 2021. The exhibition will focus on the concept of the journey through space. “Wu Shanshu is a monumental journey through water,” said Wang Yuanyuan, an artist and curator who is collaborating with the Beijing Art Museum to create a new exhibition, “On a Journey through Water,” which will open on March 21.The exhibit, titled “Speed Racer,” will debut at the Museum of Contemporary Art Shanghai in September. It will be followed by the artist’s new work, “Wu Shanshu” at the Beijing Art Museum in October.\n\n\nArt critic Elizabeth Kindy of the New York Times and author of The Heart of the Matter: Art and the Body (Kunze Books, 2020) has been tapped to write a new book about art and art history. The author will be a senior curator at the Museum of Modern Art and will co-author with Renata Martino the book “", "The next Biennial should take place in 2022.\n\n\nThe museum in Bilbao, Spain, has announced that it is planning to re-open with a new collection of paintings by the Spanish artist Fernando Tejada, a leading member of the feminist and socialist CNT. Titled “Anarchy in the Garden of the Art” (Anarchy in the Garden of the Art), the exhibition will focus on “powerlessness,” “oppression,” and “self-annihilation.”The new exhibition, which will be inaugurated by a new exhibition of the artist’s work, “The Artificial World,” will take up issues of the body and its relationship with the environment, its erosion, and the possibility of ‘virtualization’ in the exhibition.Dressed as anthropomorphized women, with their faces and bodies drawn from the artist’s own drawings, the works will engage with issues of the body, the body and the body-image, and the relationship between the artist and the viewer, including themes of art and the artist’s own body and the world.The project, which was initiated by the artist and feminist group P.A.N.", "The next Biennial should be in 2021, and the first show in 2024. “We are actively working towards this,” said Arne Glimcher, the artist and curator who will become the first director of the exhibition. “The project of the exhibition is to create a global forum for art. We are in the process of developing a new project that can engage directly with the mind and spirit.”\n\n\nThe New York Foundation for the Arts (NYFA) announced today that it has awarded three new fellowships to artists: Adam D. Bernstein, Rachel C. Franklin, and Mark A. Roscoe. The fellows will each receive $20,000. Each is working to create works that address contemporary issues of artistic practice and have a special relationship to the city.The inaugural fellows were selected from a pool of five artists whose work was presented at the upcoming Creators Conference, held in Eugene, Oregon, on September 27–September 29. The winning works will be presented at the upcoming Art Basel Hong Kong fair, which will take place in December in a venue that is currently not yet designated, in January, and will be presented by Adam D. Bernstein, Rachel Franklin, and Mark A. Roscoe.According to the New", "The next Biennial should launch in 2020 and will include a selection of the work of ten creators: Hsin-Chien Huang, Ting-Yin Hu, Ng-Hung Sze, Trul State, and Ting Thui.\n\n\nIn an attempt to alleviate fears that the New York City Department of Cultural Affairs (DCLA) will make it difficult for independent arts organizations to receive funding from the Metropolitan Museum of Art (MoMA), a group of artists and arts workers are urging the agency to divert funds from the $6 billion redevelopment of the museum toward supporting the cultural economy.The artists and the DCLA are asking the Met to incorporate a “shareholder democracy” principle into its new five-yearly funding plan, which was released on April 4 and outlines the organization’s proposed capital campaign to enhance the museum’s collection and improve its collection-to-work relationship.The proposal states that the balance of the funds should be utilized for “permanent capital improvements” and that the museum should invest “at least 80 percent” of the proceeds from the sale of works by artists in the triennial to support the cultural sector and its workers.The petition comes amid a deepening crisis facing the cultural sector", "The next Biennial should commence in January 2020, at the same time as the forty-third edition of the Biennial, and will be held at Haus der Kunst, Düsseldorf. The exhibition will include work by twenty-six artists for a special exhibition of works on paper.\n\n\nThe Carnegie Museum of Art in Pittsburgh has announced that it will admit two more visitors at the museum in the coming months—one on Tuesday, March 22, and one on Wednesday, March 26. The admission is part of a $10 million plan announced by the museum in March to make its annual spring exhibition, “Spring/Break,” a reality. The plan also includes the construction of a new 200,000-square-foot research library, the reopening of the museum, and the expansion of its collection.In a joint statement, the institutions said the new visitors will join the rest of the public at the museum in April. The announcement comes amid the ongoing investigation into the circumstances surrounding the death of eighteen-year-old Meredith Kercher, who was strangled to death by her ex-boyfriend, Anthony M. Pirie, in Philadelphia on January 28.Meredith Kercher was one of three people who falsely implicated", "The next Biennial should be in August 2019. The full list of curators is as follows: Herbert F. Schrader (Germany)The Biennial of the Experimental Artists (Germany) Klaus Fiedler (Germany) This exhibition will be hosted by the Max Hetzler Foundation in Willem- de-Kruijswijk. Katherine Lavin (United Kingdom) The Biennial of Directing and Painting (United Kingdom) Nadia M.A. Shapiro (Indiana) Beginning in September 2019, this exhibition will be on view in the National Museum of the African Diaspora (US) The Lincoln Center for Arts and Culture (US) The Biennial of Dance (US) For the next year, the museum will be hosting the exhibition The Future Is Now: Modern Dance, and the biennial of the arts will again be in the National Museum of the African Diaspora (US) The fifth and final Biennial of Frida Kahlo (Italy) Originally scheduled for March 2019, the show will now be held in September. The next iteration will be held at the Museo di Artesia, Milan. The Broadway Production of Arthur", "The next Biennial should be held in the city in 2022.  The event will be hosted by the artist-run, artist-run museum and will be led by two of Biennale’s founders, Hannes M. Heckel, and Volker Kiesewetter. \n\n\nThe British artist, feminist scholar, and activist Iris Murdoch, who was a friend, sometime collaborator, and confidante of Margot Adler and Joan Miró, has died. She was eighty-nine years old.Born in London in 1939, Murdoch moved to Paris in the 1960s to study at the Sorbonne. She studied there, then at the University of California, Berkeley, where she met Adler, whom she married in 1964.Adler and Murdoch became close friends and became a family. While in California, they and their four children were active in the feminist and anti-racist movements. In 1997, Murdoch wrote a memoir, Margot: A Life of Mystery, about their relationship. Adler died in 1993 and was buried in the family’s Paris home. Murdoch remained engaged in activism throughout the ’80s, when she worked as an editor and writer for the journal No More Power, ", "The next Biennial should be held at the Catalan National Museum in Barcelona in 2022. The biennial will be inaugurated by the exhibition “Prada: Fashion, Politics, and the Body,” which will feature more than twenty-five hundred works by sixty-five artists from the cities of Barcelona, Malaga, Marbella, and Santa Cruz. The show will also present the biennial “Madrid in a Day’s Flight,” the tenth edition of the annual Día de Luz, which was held in the capital of Spain from March 21, 2019 to March 24, 2019, and will run until February 5, 2020.It will be staged in a number of ways, including as a biennial. In the first part of the exhibition, the artists will have the opportunity to present their work for the first time. The exhibition will be accompanied by a series of multi-sensory experiences, which will be organized in a similar way to the Día de Luz. The second part of the exhibition will focus on the canonical works of the artists, which will be curated by José Luis García-Perez, and will take place in the city of Almería, which will be reorganized", "The next Biennial should be held in Los Angeles in 2021. In a letter dated October 1, 2020, the Museum of Contemporary Art (MoCA) in Los Angeles stated: “We have been in discussions with MoCA staff, artists, and curators for some time about when the fair would be possible again. As we continue to evaluate the feasibility of relocating to Los Angeles, which would be a significant evolution in MoCA’s programming, and when the time comes to launch the fifty-ninth Biennial in New York, we will do all we can to support their decision.” The letter concluded: “We hope this letter will be of some comfort, and we are grateful for the opportunities that were available to the artists featured in the exhibition. We hope that the fair will take place in 2021, and we hope that the artists in the exhibition will continue to be able to present their work in future years. We hope that the art fair will continue to be an important opportunity for visiting artists to see and experience work from the rare and contemporary.”Artsadia Whitney Biennial Rankings: Artadia 2015: 10th (45th overall)Artadia 2020: 25th (23rd overall)Artadia 2021", "The next Biennial should be held in 2020, and the first in 2021.\n\n\nThe Fifth Biennial of the Nineteenth-Century French Contemporary Art, Oolite and Latex, will not be held in the United States. Instead, it will be held in Shanghai. The event, which originally was slated to take place in November 2021, was rescheduled for March 30, 2022.The 2020 edition of Oolite and Latex will be titled Oolite et les Fifthes: Paris in the Late Eighteenth Century, and will feature work by twenty-eight artists, including Pierre-Auguste Renoir, Constantin Brancusi, and Jean-Michel Basquiat. The event will also include paintings by artists such as Louise Nevels, Renaud Léger, and Elisee Reverie. The 2022 edition of the exhibition will be titled Oolite und l'América, and will feature works by twenty-five artists. The event will also be livestreamed.\n\n\nThe Andrew W. Mellon Foundation has released guidelines for how museums should respond to protests nationwide over the recent police killings of George Floyd and Ahma Akkad, the recent unrest in Ferguson and the ongoing nationwide", "The next Biennial should be held at the Veljko Studio in the Czech Republic from March 20 to March 22, 2020. The theme of the year will be “Creativity and the Body: From the Biennial” and will include the works of fifty-four artists. The thirty-fifth programming event will take place in Mexico City from March 21 to March 24, 2020. The thirty-fourth edition, “Sara Blythman: The Golden Age of Painting” will be held at the Museum of Modern Art in New York from March 28 to March 31, 2020.\n\n\nThe University of St Andrews, in Scotland, is planning to slash the salaries of four of its senior lecturers as part of a £30m funding package, The Times reports.Students’' union UUP claims the changes will result in a “toxic” environment for teaching among students, with the future of the institution now at stake. UUP represents some 5,700 undergraduate and graduate students at the school, which was founded by Queen Mary in 1855 and comprises a conserved medieval art museum, a contemporary art school, and a historic library.The announcement of the cuts, made on the eve of the", "The next Biennial should be held at the Blue Mosque in Mecca from February 22 to February 25, 2020. The next edition of the International Festival of Photography should be held in the capital of Saudi Arabia from March 6 to March 8, 2020. The next edition of the Sundance Film Festival should be staged in Stockholm from March 22 to March 24, 2020. The next edition of the Venice Triennale should be held in Venice from March 19 to March 22, 2020. The next edition of the Doha World Film Festival should be staged in Qatar from March 16 to March 20, 2020. The next edition of Art Basel Hong Kong should be held from June 9 to June 12, 2020. The next edition of Art Dubai will be held from March 25 to March 28, 2020. The Next Dubai Film Festival will be staged from March 30 to March 31, 2020. The next edition of the Dubai Art Festival will be held from March 28 to March 31, 2020. The next edition of Art Dubai will be staged from March 29 to March 31, 2020. The next edition of Art Dubai will be staged from March 29 to March 31, 2020. The next edition of Art Dubai will be staged from March 29 to", "The next Biennial should be held in the spring of 2020. “The biennial has been a strong platform for women artists, and the exhibition has been a canvas for their work,” said Sinthujan Varma, director of the biennial. The biennial will be hosted by the Museum of Fine Arts Mumbai (MFA), in partnership with the Mumbai Design Academy.The biennial will be organized as the world is waking up to the effects of the coronavirus, which is spread primarily from person to person, but also from plant to plant, and will feature a wide range of works by women artists. The first exhibition was organised by the Mumbai Art Book Exchange (MBA), and Kala Passthru is organizing the second one.\n\n\nThe Metropolitan Museum of Art in New York is planning to open a new three-story, 300,000-square-foot museum next year, with a new exhibition space, called the Museum of Women Artists, in Manhattan. The museum will also launch a $25 million endowment fund for female artists.The institution stated that the new museum will “expand our current collection by making it easier and more accessible to women across New York City.” It will also introduce", "The next Biennial should be held in 2022.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Gina C. Bichta, director of the Hammer Museum in Los Angeles, as its next executive director. She succeeds David H. Koch, who served as director of the museum for eight years before his death in April.Bichta joins MoMA as director of curatorial affairs and chief curator of modern and contemporary art. Previously, she was associate director and curator at large at the Hammer, where she organized numerous exhibitions, including the fourteenth National Museum of African Art, the fifth Venice Biennale, and the twenty-fifth Venice Architecture Biennale. She also worked as a curatorial assistant at the Museum of Modern Art, where she organized the exhibition “Sawamura Maiko: Kanaishiyama Dōshima” (Kanaishima, Ichiyama, Japan).“Gina has been instrumental in shaping MoMA’s curatorial strategy since she arrived at the institution in 1996, when it was still known as the Hammer, and she has been instrumental in the development of our contemporary art holdings, including our collection of art from postwar and contemporary art,” said", "The next Biennial should be up in the spring of 2021. After cuts and delays from US and European governments, the exhibition was held up until May, when the Rio+20 assembly for tropical diseases in China opened. This year’s event, titled “Rio+20: Tomorrow We Lie,” was canceled. The show was supposed to open in February, but was rescheduled for March when the US Congress voted to extend the deadline by three months.The exhibition was supposed to close on March 23, but the exhibit was supposed to open on March 31. The shutdown has also delayed the reopening of the Taft’s Midsummer Night Celebration in 2021, which was to take place on March 27, and the reopening of the International, which was to be held in June. The US Geological Survey (USGS) has said that it expects the minimum temperatures in the Rio+20 region to be between 20 and 27 degrees Fahrenheit.The US Centers for Disease Control and Prevention (CDC) said on Friday that it expects West Africa to be relatively warm this summer, with highs in the high twenties by the end of September, with the possibility of more than a cooler-than-average summer ahead. The", "The next Biennial should begin with a discussion about the relevance of the work of the past in the present and the future, and will focus on the current exhibition of the National Gallery in London, “Love in Time,” which has been on view since October 29, 2019.  Cultural historian and curatorial researcher David C. Driskell, who served as a curatorial consultant on the exhibition, told the New York Times that the installation is “a living, breathing entity.” The work, which was commissioned by the gallery and built by the artist, is based on his concept of “time as a continuum as well as a continuum as a body.”For its inaugural edition in 2015, the exhibition showcased work by sixty artists, including Alex Bell, Taniyeh Terma, and Caridad Iarà-Carraga. The next Biennial will be held at the National Museum of Scotland in Edinburgh from March 21 to March 27, 2020, and will be hosted by the institution’s curators, John Parrish and Mary M. MacGregor.\n\n\nSean Kelly, the British artist best known for creating works that reflect the contemporary American experience, has died at age eighty-", "The next Biennial should be held at the Museu di Architettura in Rome in the spring of 2021. The exhibition will be preceded by an exhibition of work by the artists chosen by the public for the final edition of the grand prize, entitled “On Resistance,” which will open on September 18.\n\n\nIn an attempt to ease tensions between the United Kingdom and France, the country’s Culture, Media and Sport (CMS) Minister, Oliver Dowden, announced this week that the government will allow some 1.2 million cultural workers in the UK to stay at home and work from September 8 to 23. The move is part of a wider cultural strategy that aims to encourage people to shift to online and remote viewing rooms in an effort to reduce the UK’s greenhouse gas emissions.According to the New Statesman, the government estimated that employing over one million workers for an eight-day week would reduce the UK’s greenhouse gas emissions by 111 million tonnes of CO2—a staggering 92 percent reduction. However, the move has faced backlash from environmental groups and some politicians, who say that it will only push more people to the couch and worsen air pollution. In an attempt to placate these concerns, Dowden", "The next Biennial should be held in the Fourth of July, to coincide with the Fourth of July Festival, and should be organized in the same way as the previous two. In addition, the organizers are proposing to move the current exhibition from the premises of the Bibliothèque Nationale de Paris (B.N.P.) to the Museo de Arte Moderno (MASO), and to reopen the exhibition in the French capital during the winter months.Commenting on the decision, Saad said: “We are delighted to recommence the Biennial in the French capital and we hope that the tourists of the world will soon return and visit this exhibition. The exhibition is the most popular exhibition at the venue, and we are confident that the visitors of the Biennial will enjoy the first edition.”\n\n\nThe Cleveland Museum of Art (CMA) has received a donation of more than eighty works by artists who are part of the Southern California-based nonprofit Southern Exposure, including Tanya Baldi, Lily Aldridge, Claudia Benavides, Carol Breiter, Suellen Cano, and Hannah Cooper. The gift also includes works on paper and on canvas by", "The next Biennial should also focus on archaeological and historical research in the hope of producing a more balanced programme.\n\nThe event’s inaugural iteration, which was held last year in New York, was marred by controversy and disruption. While the exhibition featured the artist’s best-known works, such as her 'Poseidon’s Gate, 1975, and “Dead Souls in Motion” (2019), it was also beset by criticism over its absence of a central theme. The exhibition was scaled back further last year due to social unrest, and the 2018 edition featured only twenty-four works, the lowest number of works to date.The 2019 edition of the Biennial, which opened on October 7 and ran for twelve days, featured works by thirty-six artists, including Jane Panayiotou and Alexis Olivier, and was curated by José Luis Hoffman-Santos, the director of the Centre d’Art Contemporain, in partnership with Lévy Gorvy & Paris. The biennial’s artistic director, Ana Zúñiga, told the Art Newspaper that the themes of the exhibition were “religiously oriented,” “culturally specific,” and �", "The next Biennial should be in September 2020. It can also announce a new theme for the 2020 edition. The Biennial will be held at the Museo de Arte Contemporáneo Argentino (MASA), Buenos Aires; the Museo de Bellas Artes (MASB), Santiago; the Largo da Universitat de Buenos Aires; and the Palacio de Arte Contemporáneo de Buenos Aires. The exhibition will begin with a presentation of the major works from the exhibition “Conceptualos” in 2019 and will stay there for seventy days. The next exhibition will be held in March 2020.Exhibition organizers are also considering various exhibition ideas, including a “True Story” tour, a “Examining Violence” exhibition, and a “Conceptualos: A Retrospective” exhibition.The 2019 edition of the exhibition brought seven works by fifty-nine artists, including Carlos Egö, Carlos Garaicoa, Carlos Pérez-García, Ana Maria Vidigal, Carina Zverova, and Luisa Cipolletta. This year’s edition featured work by forty-nine artists, including", "The next Biennial should take place in 2020. \n\n\nThe New Museum in New York has announced that it is preparing to welcome visitors back to the institution, following a temporary closure due to Covid-19, on January 12, 2021. The museum’s director, Andrew W. Mellon, said: “The future of the Whitney Museum of American Art is closely linked to the health and well-being of the Whitney’s artists, staff, and visitors. As we work to reestablish our infrastructure and to re-open in early 2021, I’m confident that we will be able to welcome the entire community back to the museum, including thousands of artists, galleries, and other significant patrons.”Commenting on the upcoming tour, which will take approximately three weeks, Mellon added: “We will continue to provide the most compelling exhibitions, the most exciting programming, and the most accessible exhibitions. As always, our priority is the artists and the work of the Whitney and the many important contributions we make to the cultural conversation. We hope our visitors and community will join us in celebrating the achievements of the past year.”\n\n\nA group of California artists, including Oscar Murillo, Rirkrit Tiravanija", "The next Biennial should be held in the city in 2021, with a 2019 edition to follow in 2021.The first exhibition by the group was “Abraham Szybala: Biennial” (2019) at the Museum of Modern Art, New York. The show included works on paper and wood by forty-three artists, including the Hange Group, Tanya Sze, Joachim Stephan, Hanna Varejani, and Osei.The Hünnanese-born Szybala, who moved to New York from Georgia in 1957, has been the subject of numerous exhibitions, including the Biennial “Tit for Tat,” at the Museum of Modern Art in 2010, and “Sara J. Duarte: The Past Is All,” at the Museum of Modern Art in 2013. Critics praised the museum’s dedication to presenting the work of emerging and established artists, including Szybala’s work for its exhibition “Porquériao Antonio Barrios” (2018), “Non Sistema: Libertad Colisiana” (2019), and “Untitled: Abelardo Barrios” (2019). S", "The next Biennial should hold a session of the national Council of Architects of Modern Art (an interdisciplinary group comprising architects, curators, historians, and polymaths) and the next will be a biennial of the maker-artist projects. The museum will also organize the first exhibition devoted to the subversive political ideas of Joël Escoffier, the architect whose work emphasizes the interdependence between the real and the imagined. The exhibition, which will be staged in the same building as the contemporary art museum, will consist of photographs, videos, and paintings that reflect the artist’s sensorial vision.\n\n\nThe Museum of Fine Arts (MoMA) in New York has released its 2018–19 visitor statistics, which reveal that 128,106 visitors have visited its Museum of Modern Art, and that the museum has lost a total of $49 million in revenue because of the pandemic. MoMA’s current exhibition, “Blackout: The Art and Politics of Noise,” which opened September 8, 2018, and ran for eight weeks, was the only show in the institution that was not temporarily closed due to Covid-19. As of November 5, the museum had already reported losses", "The next Biennial should start in March 2020 and will consist of three exhibitions, of which the first will focus on “Endangered Art”; the second will embrace themes such as war and migration; and the third will examine topics such as racism and sexism. The events will be curated by Amira El-Inayat, the director of the AlUla Sculpture Center in AlUla, in partnership with American artist and scholar Jorge Luciano, and will take up a theme of “The Art of Human Rights” and the history of the struggle for human rights. The theme will be “Away from the Fear: The Art of Fear” and will be supported by the Netherlands, Belgium, France, and the United States. The 2019 edition, for which the art was created by Amina Akram and Liya Botelli, was held at the Museum Freij, Amsterdam.\n\n\nThe Museum of Contemporary Art (MoCA) in Chicago has received a gift of more than one hundred works by the late Italian architect Natalia Bocchieri, whose architectural style and design has shaped the city of Rome, and whose work is currently on display in the Italian capital�", "The next Biennial should be held in 2021, said the Arts Minister, Anne-Marie Asselborn. “This is an unprecedented crisis, and we must do all we can to protect the biennial’s future. The current situation makes it imperative to accelerate the biennial’s return to the city of Brindisi, and to develop more effective and flexible ways of supporting the exhibition,” she said.  The Italian government confirmed that it knew of the 7.3-magnitude eruption in the Tepozdorf region of Umbria in May 2015 and was working to prepare for it, but said that it did not take any measures to mitigate the risk.The Italian government has since attempted to encourage the exhibition to return to Rome. In September 2019, it reissued a half-million tickets for the show, which was originally scheduled to run from September 23 to September 26, and announced that it would provide $18 million in aid to help the government mitigate the risk of a third-world-scale eruption. \n\n\nThe Omaha-based nonprofit the Omaha Art Museum (MOAM) has welcomed Amanda El-Hadid and John Zug to its board of directors. El-Hadid, a British artist", "The next Biennial should be held in 2021. The MCAF, which was founded by Daniel and Mira Boccalero, is currently working with the MCAF on a new, contemporary installation of art and architecture that will be staged at the MCAF Center in Santa Fe, New Mexico, in 2021. The first event, titled The Call of the Wild, will be on view in March 2022. The MCAF is continuing to present a series of international exhibitions that will include works from its collection and will have the first show of the new collection, “Inside the Body,” at the Museum of Modern Art in New York, which opened on January 30 and runs through March 24. The MCAF will present an exhibition of work by artists who are based in the United States, the United Kingdom, and Europe in October 2020, with a tentative opening date of November 18. The MCAF will represent the United States at the 2020 Venice Biennale in June and the first exhibition of work by the MCAF in June 2021.\n\n\nThe Walt Whitman Foundation is releasing more than 250 free artworks from its collection in an effort to generate funding for local, state, and federal initiatives that promote the", "The next Biennial should be held in 2021.\n\n\nThe 100th anniversary of the birth of American painter Frank Stella has been marked by a resurgence of interest in American art through exhibition-making and scholarship. Among the works that have come to the fore are the works of artists including Edward Kienholz, Robert Irwin, and Rineke Dijkstra. In an issue of Arts in the Age of Romanticism (ETOW) published today, the New York Times criticizes the exhibition as a 'subversive anomaly.”The exhibition has attracted the interest of scholars who, according to the critic, question the exhibition’s religious origins, placing it in opposition with American art that celebrates “soul, spirit, and vital energy.” The criticism follows a series of exhibitions at the Venice Biennale (2014), at the Pantheon (2015), and at the Los Angeles County Museum of Art (2016), which were also criticized for being “radical” and “anti-Christian.”The author of “Biblical Capitalism” (2017), Andreas Rosengren, argued that the work of the exhibition was “pure political activism.” He also questions why the work was excluded from the bi", "The next Biennial should be over the next few weeks.After ’60,” the Archive of the Museum of Fine Arts, Boston, which has struggled to move past the museum’s acquisition of more than two hundred works from the collection of its founder and namesake, added five more works by female artists to its collection in the years since it reopened in 1972.\n\n\nEuropean Arts Minister Monika Grütters announced today that the European Commission has launched an initiative to help curators and arts professionals in the 28-nation bloc adapt to the impacts of the Covid-19 pandemic. The initiative, which will allow member states to request emergency funding to help with staffing, operating costs, and other costs related to evacuations and curating exhibitions and events that are scheduled to take place in the coming months, was established as part of a comprehensive six-year budget proposal unveiled by European Commission president Jean-Claude Juncker on April 1. The 2018/2019 financial year, which ended March 31, is projected to be the third-busiest ever for Brussels and will likely see an average of four new exhibition events every week. “The future of Europe is at stake,” Grütters said at a press conference", "The next Biennial should start a week later than the current date of February 14, 2020. The first round of exhibitions will run from February 16 to March 10, 2020.“We are delighted to have the opportunity to present the first Biennial on the theme of the relationship between Europe and the Americas,” said László Naftali, Director of the National Museum of Fine Arts, Trondheim; Lévy Gorvy in Paris, the Louvre, the Musée de l’Amiti’s, and the Louvre, as well as the royal palace of Nice-Grâce and the Palais de Tokyo in Paris. France and Mexico will participate in the twenty-third edition of the Pan American Biennial, which will be held in Mexico City from March 9 to March 12, 2020. Mexico City was selected as a UNESCO World Heritage Site in 2008 and has won the World Heritage Award for its history of human evolution. It is the site of the largest exhibition of ancient art in the Americas and one of the most visited places in Mexico City.\n\n\nThe Indonesian artist Suu Kyi, who was named the winner of this year’s Nobel Peace Prize, has pledged", "The next Biennial should then be held in the autumn. At that point, the gallery will consider whether to bring the exhibition to New York in order to avoid disrupting its spring/autumn tour schedule. The decision was made on the basis of a letter written by Stephen Kaplan, a curator and art historian based in New York, who said: “In the case of the museum, it is exactly at this moment that the museum cannot possibly be perceived as an important cultural institution, and yet should be. The exhibition should then go ahead, and we hope that the exhibition will be an expression of the deep esteem in which the museum is held.”The exhibition’s organizers said that the decision to cancel the exhibition was not unexpected; it was made in order to “preserve the continuity and vitality of the Art of the Year series, and to facilitate its long-term development.” The move is thought to be the first time the museum has canceled a major exhibition because of the pandemic.The April 24 edition of the Art Newspaper featured a statement by Professor Michael L. Bradley, director of the Art of the Century Foundation, which said: “When we considered the possibility of canceling a special exhibition in", "The next Biennial should be in October 2020, the organizers say. The Diller Scofidio + Renfro–designed exhibition will be a continuation of the festivities taking place each March, including the País Santo Domingo and the Palacio de Cultura Maravilhã. \n\n\nThe National Gallery of Canada announced today that it is expanding its board of trustees, which has been in place since December 2016, and that it is preparing to welcome visitors once again in the months of March and April. The institution’s president, Harriette Bondil, said that the expansion will allow the gallery to expand its reach and reach an even broader audience across Canada.“The National Gallery of Canada is in the midst of a transformative experience as we launch a new chapter as part of the National Gallery’s 150th anniversary,” Bondil said in a statement. “It is inspiring to see our communities react with enthusiasm to the opening of this new chapter, and it is inspiring to see our artists, curators, researchers, and staff celebrating their achievement. I’m incredibly proud to be able to serve as president of the National Gallery of Canada and to continue working with my colleagues and the incredible team", "The next Biennial should be held sometime between February and April. The first was held in the summer of 1972. It was organized by the Seattle Art Museum, and the architects were Lyle LeBlanc and Terence and Julie Lunder. In 2013, the museum staged its seventh exhibition.\n\n\nThe Israeli Ministry of Culture has expressed its solidarity with the European Union in a move condemned by the United States as a potential setback to the Iran nuclear deal, which has been finalized by Iran and six world powers. The United States has since claimed the deal will stifle Israel’s security, but the deal limits Iran’s ability to enrich uranium and only allows for restrictions on its nuclear program in exchange for the lifting of economic sanctions.The United States does not oppose the demolition of homes and the dispossession of Palestinian communities in Israel in order to make room for a massive new settlement in the occupied West Bank, but the settlement of Ariel, built on Palestinian land, is considered a security threat to the deal. The United States has accused Israel of breaking the deal by building unauthorized structures on Palestinian land. The White House cited reports that Ariel will be demolished as a reason for the move as part of Israel’s campaign to rescind its right to exist as a", "The next Biennial should be announced soon.\n\n\nThe Maltese Museum in Rome in association with the Falange Foundation, the Palazzo Nazionale di Rosa, and the Piedmont Foundation, has announced that it is reopening without the assistance of the Italian government. The institution’s board president, Gio Ponti, told the Art Newspaper that the decision was made to “re-examine the future of the institution, considering a number of possible alternatives, and take the necessary decisions regarding the future of the institution.”The new eight-hour biennial, titled The Foundation, will be inaugurated with a performance by Juliette Marsic, a collaboration between the company and the Museum of Modern Art. The show will be preceded by a book launch featuring a lecture by Amalia Mascaro, as well as a reception featuring Nicoletta Battista, a partner at the Piedmont Foundation; and will run until September 11.“Juliette Marsic is a super-talented artist whose coming together of Powell and Falange has been enhanced by their collaboration in our online platform,” Ponti said in a statement. “The Foundation is a unique and ambitious project that has", "The next Biennial should be held at the Museum of Modern Art in New York in 2021.\n\n\nThe Palace Museum in Riyadh, Saudi Arabia, has appointed Reem Al-Qasimi as its new deputy director for collections, exhibitions, and research and is preparing to welcome visitors to the institution in early 2021. Al-Qasimi comes to the institution from the Metropolitan Museum of Art, where she has been director of collections since 2015. Previously, she served as director of the Metropolitan Museum of Art in New York. During her tenure at the museum, she helped organize the exhibition “Kingdom: A Visual History,” which premiered at the Frieze London triennial in January 2019 and was one of the first international works to be displayed in the new Museum of Modern Art, which opened in the Saudi Arabian capital in June 2020.“After a thorough search, we selected Reem because she possesses the unique experience, knowledge, and leadership qualities to use the new wealth of expertise of the Museum of Modern Art in the Museum of Modern Art to make the Museum of Modern Art Saudi Arabia’s first institution dedicated to the study and exhibition of contemporary art,” said museum director Adnan Abu Ali. “Reem joins us from the", "The next Biennial should focus on creating a new vision of the city as a living organism, as embodied in the movements of the city. It should introduce a new program of public art, drawing, and performance. “Over the last twenty years, BIC has taught us and changed our lives,” said biennial director Ann-Marie Abou-Rahme. “Through exhibitions such as this and our renowned biennial, we hope to bring a new awareness and appreciation of the city and its inhabitants, and to help shape a new future for Philadelphia.”Last year, the biennial team wrote the theme for the biennial’s fifth edition, titled The City, which debuted at the Museum of Art in New York in May. The exhibition included work by twenty-six artists, including Damien Hirst, Salah Abdeslam, Andrej Pejic, and a selection by Peter Zumthor. The exhibition featured work by seventy-five other artists, including Alex da Corte, Erano Alarcon, Matthew Arnold, and Nick Landry.The full list of participating artists is as follows:Andre Jørgensen, StockholmAndreas Lück, CopenhagenAndrea Catellani,", "The next Biennial should take place in 2020. I am looking forward to the challenge of making these lectures possible in a future year.”\n\n\nThe Red Hook Arts and Culture Partnership has announced the launch of two new initiatives that will provide free, nationally acclaimed, artist-in-residence residencies for artists who live and work in the Red Hook neighborhood of New York City. The program, which was established in response to the local arts community’s need for support, will launch with the release of the first initiative, “Artist-In-Residence,” which will focus primarily on the work of emerging and established New York artists. The second initiative, “Artist Residency,” will focus on the careers of thirty-six artists who have had residencies at the Red Hook Arts and Culture Partnership since the organization’s inception in 1999.“We are excited to launch these initiatives in the hopes that they will inspire and provide inspiration for our artists and will give them an opportunity to make their voices heard and have their work exhibited in the coming year,” said Jessica Morgan, the program’s program director. In addition to convening artist-in-residence panels, the program will present a series", "The next Biennial should be held at the museum in 2021.\n\n\nThe Royal Academy of Arts (RA) in London has appointed Eamonn Dolan as its new director. Previously, he has been a member of the Royal Academy of Arts (RA) since 1968 and has served as its chairman since 2002. Dolan will take up his new post on February 27.  Dolan, who served as the RA’s director of exhibitions and current board chairman through 2019, said: “I’m thrilled to be appointed as the RA’s new director. I’m eager to help the RA become ever more vibrant and relevant to the diverse communities it serves. The appointment of a leader as important as Eamonn is the most important development in our relationship with the RA, and we are grateful for his commitment and experience.”Previously, Dolan has worked as a curator at the Museum of London Galleries (MoL) and as a writer and curator. He previously served as director of exhibitions at Tate Britain and as the director of Fogg Art Gallery, London.“The RA’s transformation has taken a number of forms since I became director, from the opening of a modern", "The next Biennial should take place in 2020, but there is no set date and architects are currently working together to think about the dates. The theme of the 40th Olympiad is “cool and art and the self,” and that will be reflected in the exhibits, which will reflect the themes of the past three decades and will focus on contemporary life in various countries around the world. The 2020 event will take place in Romania, which is currently restructuring and is working on a new federal constitution. The year 2020 will be celebrated as the thirteenth anniversary of the Biennial, and the theme of the event will be “re-constitution, re-creation, re-creation, re-constitution, reconstituting the world.”The 2020 theme will be “Art and Culture in the New Millennium” and will be unveiled by Romanian director Ondine Cea, who is known for creating performances, documentaries, and plays that delve into the theme of the year 2020. The artwork in the exhibition will be created by curator Anna Csíkuleanu, curator of cultural development at the National Gallery in Bucharest, and will be on view in the exhibition “The New Millennium: Art and Culture", "The next Biennial should be delivered in the Spring of 2020. For the second time a year the festival will take place in Santarém. The biennial will be hosted by the Museu de Arte de Barcelona. The event will run from March 7 to March 16. The full list of participating artists is as follows: Asya Calvento, PeruPhilip Collins, EnglandEden Kremer, GermanyNicholas Newcomer, New YorkCity Philharmonic, New YorkUrban Institute of Arts , New YorkUrban Institute of Arts, New YorkUrban Institute of Arts, New YorkUrban Institute of Arts, New YorkUrban Institute of Arts, New YorkUrban Institute of Arts, New YorkUrban Institute of Arts, New YorkUrban Institute of Arts, New YorkUrban Institute of Arts, New YorkUrban Institute of Arts, New YorkUrban Institute of Arts, New YorkUrban Institute of Arts, New YorkUrban Institute of Arts, New YorkUrban Institute of Arts, New YorkUrban Institute of Arts, New YorkUrban Institute of Arts, New YorkUrban Institute of Arts, New YorkUrban Institute of Arts, New YorkUrban Institute of Arts, New YorkUrban Institute of Arts, New YorkUrban Institute of Arts, New YorkUrban Institute", "The next Biennial should be held in 2022, and the 2019 winner will be selected from a shortlist of fifty. The recipients of this year’s award will be announced in late October. \n\n\nThe Neue Galerie in New York has announced that it will open a new, fully immersive arts space in the city’s Hudson Yards neighborhood in 2021. The new venue will be named the Neue Galerie East, and will be built on the former site of the former New York Public Library.“Neue Galerie East is a direct descendant of the celebrated gallery located in the heart of the city’s historic Middelheim neighborhood. The new site will be a collaboration between the Neue family, the Middelheim Gallery, the Museum of Modern Art, the Museum of Contemporary Art, and the Hudson Yards Museum of Art,” said Maren Hager, president of the Lisson Foundation. “Its architecture and interior design will embody the spirit of Middelheim and its former environs, adding a new dimension to the intimate and dynamic gallery experience.”The gallery will also launch a new digital platform that will showcase its work and will host live performances. The artist-run platform", "The next Biennial should be held immediately. It is hoped that this will give the time and space to consider the question of how art and architecture, the body and the body of work, are related to and interlinked with the project of art and architecture. Therefore, we suggest that a preliminary exhibition of the work of the artist, which is expected to open in the summer of 2021, be organized as soon as possible. The artist(s) and the architects may choose to stay with the organization of the upcoming exhibition.The ceremony will take place at the Museum of Fine Arts, Boston, on December 8 and will run for twenty-four hours. \n\nThe Los Angeles County Museum of Art (LACMA), where the upcoming edition of the Biennial Los Angeles will be held, has issued a statement regarding the upcoming festivities: “We are aware of the upcoming edition of the Fifty-Ninth Venice Biennale in Venice, and are following its instructions closely.The theme of this year’s biennial is ‘interconnectedness.” LACMA’s director, Robert Carbonell, said that the museum is “understanding that ‘interconnectedness’ is something that we have to", "The next Biennial should be held in 2022 and will be entitled “Civilizations of the World,” and will be hosted at the Museum of California, Los Angeles (MCA). It will also feature the final works of the first five members of the group, which are Haydn Hopper, Oscar Hammerstein, Jean-Michel Basquiat, and Virginia Woolf.The first event of the new edition will be “Holas del Toro:” directed by artist-in-residence, Manuela Saavedra, who is also the architect of the project, “Anais Nin, Bouya Brawley, and Carlos Nocita:” or “Arte Povera” in partnership with architect W. Eugene LaBarre, which will be curated by sculptor Paul Gauguin.The next edition of the Venice Biennale will take place at the Venetian city hall from January 25 to March 9, 2021 and will be hosted by the Museo d’Arte Contemporanea Spazio in Venice. It will be followed by the Pirelli Arti, in Milan, on May 9; the Guggenheim Museum in New York, on", "The next Biennial should be held at the same venue as the first, in 2019. Curated by Ahmed Ben Abdallah, the former president of the Arabic University of Medina, the biennial will consist of a series of lectures, performances, seminars, and workshops.“The theme of this year’s biennial is ‘Resistance.’ We hope that the country will remember that all resistance is resistance and that we will not give in to terror,” said Abdelmalek al-Asad, the organizers of the biennial. The works that will be staged at the institution will vary according to the theme of the year, but will be “action,”” “visibility,”” “formless,” “immersive,” and “invisible.”The institution will also be providing $56,000 in grants to artists as part of a multiyear initiative that will help them create new work. In an attempt to prevent the exhibition from becoming a distraction for the Parisian public, a note that was left by the artist Elie Wirth on the wall of the Louvre will be included in the exhibition.  The biennial is the", "The next Biennial should take place in 2021, with the exhibition opening on October 22. In the meantime, the organizers have released a statement announcing that the festival will continue to be held as planned. While they have yet to announce the next iteration of the protest, the activists are already planning an action for the first event to take place in 2022. The Congress of South African Artists (CSBA), which represents South African creatives, is also waiting on the sidelines to see how the protests develop. The protest comes amid an escalating crisis for African museums and institutions facing cuts and closures due to the coronavirus pandemic. The African National Congress (ANC), which has been fighting for the survival of the cutbacks for decades, announced on Sunday that it is now preparing to march in the upcoming presidential election, and on Monday, the United States Congress passed a $1 trillion aid package that will push back the Covid-19 pandemic by $1.2 trillion. “We are prepared to fight to the very last drop of blood, sweat, and tears to secure the future of our museums and we are ready to mobilize for democratic change,” said Carol King, the executive director of the African National Congress.\n\n\nThe National", "The next Biennial should aim to draw together the entire geographical expanse of the developing world, and by doing so, to connect the emerging world with the rest of the world. The biennial’s inaugural exhibition, “Visions of Art” (2019), showcased the work of forty artists. The following year, “The Present: Art, Politics, and the Rising: the Japanese and the Korean War,” was staged in Tokyo; the exhibition “The Body in Politics” (2019) explored the concept of the body in art; and the following year, “Becoming Human: Oil Painting, Religion, and the Body,” was staged in Seoul. The third Biennial will take place in the United States, and will focus on the global emergence of American artists in the twentieth century, with the theme “Art, Politics, and the Body: American Painting, 1967–1975,” curated by the Foster Peiffer Foundation and curated by David Brown, the curatorial director of Tate Britain.\n\n\nThe Seattle Art Museum (SAM) has received a gift of twenty five rare works by artist and activist Mark Di Stefano. The works, which were donated by the artist and his daughter,", "The next Biennial should be the defining of the art of our time.”Emma Brown’s The Magic Mountain (1957), a work that explores the power of memory and the nature of the self, will be the theme of the biennial. The exhibition, which was one of the first works by Brown to be published, was retitled The Magic Mountain, and covered the life and work of Olafur Eliasson. The work was selected by an international jury comprising Arthur Schlesinger, John Constable, and Gerald Steinbrenner. The exhibition was the first of its kind. The other works featured in the exhibition were the Untitled, 1959, which was a special collection of works that included photos by Herbert Sievers, and the Dissolve, 1961, a collection of sculptures which featured the work of four artists who worked simultaneously: Eric Hobsbawm, B.J. Brown, and Anton Kern.The biennial will be hosted by the Toronto-based collective ▶Cinecittà, which will oversee the exhibition. The show will take up themes of memory, evolution, and memory reconsidered, and will also include a late-life retrospective of the artist Pellethea Laverdière.", "The next Biennial should aim to redress the balance between the two communities, and to serve the interests of the two communities through a detailed survey of the major discoveries and the cultural traditions through which the Museum is connected.”While the models for the exhibition are different, the themes are often the same: the exhibition is a reflection of the community. The will of the community is central to the theme of the exhibition, “In Memory of a Community.” Thus, in a previous work, “The Future Is All Around Us,” Christopher Wool (1921–2012) presented an exhibition of works by artists whose works are currently on display in the Museum. The next Biennial will run from September 7 to September 11, 2020.\n\n\nThe Simon Wiesenthal Center in Berlin has released a statement regarding the controversial death sentence handed down to the Prisoners’ Association (P.A.) for their role in the terrorist attack on Berlin’s Brandenburg Gate on December 9, 2016. The P.A., which is made up of approximately forty artists and activists, was protesting the Bundestag’s decision to move the blasphemous monument, the Brandenburg Gate, to a new site in", "The next Biennial should be held in the autumn of 2022. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released a statement regarding the controversial removal of a statue of Black feminist artist Betty Friedan, whom biennial director and CEO Mira D. Guggenheim enlisted to the fold in 1996. “The Museum’s policy regarding Black Lives Matter has been consistent: we do not remove or alter significant cultural heritage in order to advance a specific cause,” reads a statement provided by the museum. “To do so is disrespectful to a great and esteemed artist, an extraordinary woman, and a visionary leader.”The decision to remove Friedan from the pedestal of the museum was made in 2016, following months of protests and the conviction of a Black man, who had been convicted of threatening to set fire to a white woman’s home, and several months of legal battles that culminated in the acquittal of both victims in 2017.In the three-to-four months since the courageous act was made, the public and cultural sector in Los Angeles, including the Los Angeles County Museum of Art (LACMA) and the Los Angeles Black Chamber of Commerce, have been mobilized to pressure the institution", "The next Biennial should be held in 2021. \n The biennial’s next exhibition will be a retrospective of the work of Jürgen Lüpertz (1874–1973) at the Museum of Modern Art in New York in 2021. The exhibition will feature works by artists such as Ursula Breza, Jan & Jan; Gabriel Zucman, The Power of the Sun; Chris Ofili, Journey to the Islands of Maui; and Tomáső Gosch from The Power of Love.\n\n\nMuseum of Modern Art (MoMA) director Daniel H. Weiss has issued an apology to future generations of New York art lovers for the museum’s decision to shutter twenty-four hours of programming in the annual “Museum of Modern Art” retrospective.“We now know that the closing of the exhibition was never our intent, and that it was harmful to artists and many others,” Weiss wrote in a letter to future generations. “The museum was not able to conduct this show in the way that was planned, nor could it have been in the way that is depicted in the show. We deeply regret the hurt that this exhibition has caused.”In an", "The next Biennial should take place at the Museum of Fine Arts in New York on December 23–January 3, 2021. \n\n\nThe Institution of Fine Arts (IFA) in Chicago has approved a $2 million fundraiser for the William Wayne Cox Foundation for the Arts. The fund will provide funds for grants for artists and cultural organizations and will also establish a new interdisciplinary commission dedicated to the arts and the environment.Cox, who passed away last month at age eighty-two, established the foundation in 1988 after he was diagnosed with terminal cancer. Cox founded the foundation with his wife, May, after they were married in 1975. The foundation has awarded more than $1.8 million to support artistic endeavors in the United States. The arts charity was founded by his daughter, Catherine, and his son, David.Prior to founding the foundation, Cox was a professor at the University of Chicago. He taught at the university from 1976 to 1977 and taught at the university from 1982 to 1985. During his tenure, Cox helped establish a scholarship program for African American and African American Studies, and helped the Center for Arts Diversity in Chicago to recruit forty-nine artists to its roster. He also oversaw the collection and management of the museum’s collection of African American art", "The next Biennial should take place in 2018. \n\n\nThe architects behind the National Museum of Fine Arts (NMFA) in Washington, DC, have received a $25 million donation from the philanthropists of Frank Gehry’s newest organization, the Frank Gehry Foundation. The gift will allow the museum to begin hosting the annual exhibition, “AoA: A Beautiful Future,” which will also include an expanded collection of works by the artist. The institution previously announced that it would hold the exhibition in 2020 and that it would begin work on the building of the museum’s new headquarters in the fall of 2021.The donation was made by Roy and Patricia Gehry, the parents of Frank Gehry Sr., and their daughter, Jane. The couple’s foundation was founded in 2006 to organize events and exhibitions that support the museum’s collection and enhance the educational and research mission of the museum. The Gehrys first donated $5 million to the museum in 2018. They raised the rest of the funds through the sale of works they had created for the institution, which include a 1910 work by the Chicago School of Architecture, a 1949 work by the architect Alexander Schwartzman, and an installation by the artist Jack N", "The next Biennial should cover the latest advances in the history of the Arts and Design and will be organized in partnership with the city of Atlanta and the Atlanta Museum of Art. The inaugural exhibition, “Watercolor: The Children of Modernism,” will open in January 2022; the second, “Feminine: Contemporary Art of the Fall 1960s” will open in March 2022; and the third, “Sculpture with Women: Between the 1930s and 1970s” will open in October 2022.For the Philadelphia region, the 2020 biennial will mark the centenary of the city’s founding, and will be centered around the themes of the year: “1960–1962,” “1960–1970,” and “1970–1980.”The 2020 biennial will be hosted by the Pennsylvania Academy of Fine Arts in Philadelphia, followed by the Pennsylvania Museum of Art, followed by the SculptureCenter, and finally Pulaski. “The 2020 Biennial is a great honor and an exciting opportunity for the people and city of Philadelphia,” said museum director Matthew Teitelbaum. “The exploration of the human condition is imbued", "The next Biennial should be held in 2020. Stevenson will be the first artist to direct the biennial in more than two decades.  The exhibition will share a common theme of the ’60s and ’70s and will include works from the studio and the artist’s home.\n\n\nA group of artists have created a new exhibition in the United Kingdom that has been called “transformative” by critics. Titled “Feminine” and curated by Gere Kavanaugh, the exhibition will exhibit work by thirty-three artists. In addition to the showcase, the curators will focus on how the exhibition reflects the cultural and political values of the UK and will launch a website dedicated to the exhibition.“The show will examine the ways in which art and sexuality have historically been conflated, and will explore the possibility that the male gaze can be re-created by a feminist, queer, trans, and nonbinary point of view,” the organizers said in a statement. The work of the thirty-three artists featured in the exhibition is divided into four categories: contemporary art and design (dramatic, abstract, and mixed media), performances (dramatic, play, and cinema), performance", "The next Biennial should have an opening by invitation only, and will be held at the studio of artist/Yelena Mizrahi in the capital of the Russian Federation, Moscow. This biennial will attempt to embody the spirit of National Geographic’s earlier exhibitions, which focused on the history of mountaineering in the Sierra Nevada.The move to Moscow follows the official opening of a new exhibition dedicated to the history of the Central Asian state, The Great Central Asian Dictatorship, at the National Museum of History in Kiasma, Russia. The show, titled On the Wall, reflects the central role of the artist in motivating the preservation of the country’s cultural heritage, and the importance of his art in conceiving and organizing the exhibition. The selection of the twenty-six workstations from the collection of artist-activists Lululemon Athletica, a subsidiary of the brand, was made by a committee chaired by artist Martin Rowland, and drawn from a pool of twenty-six artists; the thirty-five who had previously been selected for the exhibition were chosen for their creative achievements in the exhibition.“Today we are proud to present the first exhibition dedicated to the history of Central Asia", "The next Biennial should be held in 2021. \n\n\nCultural historian, curator, and theorist Carol Bellamy, whose avant-garde conceptualist and theoretical-art‐historical style was shaped by a deep understanding of the metaphysics of art and a commitment to cutting-edge research, has died at age eighty-eight at her home in New York City at the age of ninety-one.Born in 1940 in Manhattan, Bellamy earned her Ph.D. at Columbia University in the early 1950s, after which she taught at the university for a decade. Bellamy’s most recent book, Art for Life: A Historical Review, 1967–1975 (New York University Press, 2019), analyzed the evolution of the classical liberal arts, including painting, sculpture, and music, and sought to advance a radical conception of art history. She also organized exhibitions at the Museum of Modern Art, the Museum of Modern Art, the Museum of Modern Art, and the Museum of Modern Art, and wrote for the New York Times, the Washington Post, and the Los Angeles Times.Born in 1961, Bellamy grew up among artists and academics in Chicago and the Washington, DC, areas. She graduated from Columbia University in the early 1970", "The next Biennial should take place in the city in 2021, and the inaugural exhibition, “The Perils of Love”\u0097which was staged in Nottebohm, Austria, in March 2018\u0097will be staged at the Rijksmuseum Amsterdam in 2020.“The first workshop was a bit over two years ago, and while it ended with a very happy ending, it was followed by the second workshop several months later, and the third workshop in February 2021,” said Juergen Teller, director of the Biennial. The artists participating in the 2020 edition of the biennial include Anton Kroon, Jan-Philippe Meule, Jan-Philippe van den Bosch, Anna-Sophie Van Eyck, and Willem de Kooning.\n\n\nThe Alexandria Art Museum in Egypt announced today that Salem El-Khatib, who was detained by the Egyptian authorities on February 16 for allegedly attempting to join the outlawed group the Muslim Brotherhood, has been released. The twenty-six-year-old was released on February 16 after he was imprisoned for five weeks and six days. While in custody, El-Khatib was questioned and held for two days before he was released", "The next Biennial should be held in 2021, but it is uncertain whether it will be possible to move the exhibition forward in 2021 because of the ongoing health crisis in Syria. The Goethe-Institut in Vienna has reached an agreement with the Syrian authorities, which will host the exhibition in the first half of 2021.The exhibition will be organized as follows:<|endoftext|>Wang Chi-An, the Hong Kong–born, New York–based artist whose concept paintings conveyed a range of emotions, has died at age sixty-nine. In an interview with Artforum in 2013, the Hong Kong-born artist said that his work was inspired by \"the influence of Jesus Christ and Buddhism, which is very important for me. . . . I think that what is there is a kind of universal truth, and that the world is a reflection of this universal truth. I want people to see it as a kind of mirror that reflects what is in them. And what they see is what they reflect.”Born in 1978 in Beijing, Chi-An studied at the National Art School before opening his first art studio in 1997. His work has been featured in solo exhibitions at Hong Kong Museum of Art (2007), the Hong Kong Jufang Museum (2007),", "The next Biennial should have been announced earlier this week, the days of the biennial being held at the same time the Paris climate accord is being negotiated, and will now be held in May. As of Monday, June 4, the event will still be running as planned. The full list of participating artists is as follows: 1. Joël & Anneke 2. Liège-Palais de Paris 3. José André Assante and his Partners  4. Jean-Baptiste Auguste Alberts, Frankensteiner & Hoch-Roth, and Albright-Knox Art Museum, New York 5. Oolite Games Gallery, New York 6. John Derbyshire Gallery, New York 7. No, We Can't, New York 8. Vincent van Gogh Museum, Amsterdam 9. Cameron Brown Gallery, London*10. Louis Vuitton Foundation, New York 11. James Turrell Gallery, London*12. Matthew Wilson Gallery, London*13. Hans-Ulrich Ude, Germany**14. Marc-Olivier van de Wijngaerts, New York", "The next Biennial should be held in 2021, but Carlotta Boëshberg, the president of the biennial, said that it will not take place this year.\n\n\nThe Metropolitan Museum of Art in New York has released a statement regarding a spate of recent murders in the city. According to the New York Times, the institution received a letter from the New York Police Department on November 4 warning that those responsible for the homicides will be apprehended and charged. Police have identified twenty-six people who have been charged in connection with the incidents, which occurred between October 29 and October 31. The twenty-four were arrested on Wednesday, and all but four have been released without charges.According to the New York Times, the letter reads: “We are aware of the instances in which individuals have been arrested and charged and in which we take the position that there is not enough evidence to prove beyond a reasonable doubt the claims made against the individual. We therefore encourage individuals to consult with their lawyers regarding their rights under the law before making any statement.” The letter goes on to say that the defendants “have the right to an attorney review.” The letter also suggests that those who have not yet been charged may be charged", "The next Biennial should open in 2020. The exhibition will also include a new studio, which will be led by a curator and artist and will focus on the history of the contemporary and how the museum can function on the themes of its collection through an indigenous American aesthetic.In, the artist described how the exhibition is a continuation of his later artworks, which are considered the earliest works by the artist to be internationally exhibited. He said that his intention is to conceptualize a new cultural space for the city of Detroit by showing the works and their interrelationships with the city. He also said that the program will invite the artist to participate in a conversation with Detroit-native Eva Langret, a long-time collaborator. “The exhibition will explore the origin of the works in order to create a dialogue with the people of Detroit and is a reflection of our city’s history,” said the artist. The exhibition will also include works from the artist’s past that are currently on display in the exhibition. The Art in the Life of Us series, which will highlight work by artists whose works are not currently in exhibitions, is the theme of the Biennial. \n\n\nThe University of California Berkeley (Berkeley), which is currently", "The next Biennial should be held in 2021.In the meantime, the museum will continue to host over twenty-five exhibitions a year, including biennial exhibitions of work by artists such as Marc-Hen Chen, Werner Hochreiter, and Carlos Álvarez-Omaro as well as a series of solo presentations by artists, including Issa Fried, Cécile Pape, and Nari Ward. The museum will also continue to develop its collection of African art through exhibitions of work by Abdulmalik Seale, Tiwa Nzemba, and Anselm Kiefer.\n\n\nThe Museum of Fine Arts (MA) in New York has announced that Dario Catellani has been appointed its next director. He succeeds Neil Scheiber, who was appointed executive director last month.“The museum is thrilled to welcome Dario to the MA team and is confident he will continue to serve our guests, our staff, and our community with exceptional leadership and vision,” said Mark Burton, director of the museum. “From his early days as a curator, to his years leading the MA, Dario has demonstrated a remarkable breadth and depth of talent and has built the institution’s collection for more", "The next Biennial should be held in December and will be the first full year of the new institution, which will be inaugurated by a montage of the artist’s works before moving to the collection of the museum. \n\n\nThe City of New York has added a new section to its official website entitled Annual Report Card for Public Art, which has previously focused on analyzing the performance and performance-based work of current and former NYC residents, and which is now available online. The annual report card, which was commissioned by Mayor Bill de Blasio and published by the Office of Annual Report Cards, offers brief summaries of the city’s arts and cultural sector, including an assessment of the arts and cultural experience across the city, a list of the city’s major donors, and a ranking of the city’s major art institutions.“The City’s arts and cultural sector is one of the largest, most diverse, and most resilient parts of New York City,” Mayor Bill de Blasio said in a statement. “Over the last fifteen years, we’ve invested in tens of thousands of jobs and invested in the arts education and training needs of New York City’s", "The next Biennial should be held in 2020, and the first Exhibition should take place in 2022. The museum is currently working on a revamp of the building, which aims to incorporate more of the museum’s contemporary collections and is expected to be completed by December 2022. The organization is also planning to create a new space in the center of the museum, a development that will include spaces for educational initiatives, exhibitions, and educational programming.The project will also involve the design of a new educational theater, a new public café, and the construction of a new museum archive. “While the renovation of the museum is not without its challenges, the prospect of a new, expanded, and modern museum is a strong incentive for the board to allow the institution to continue its important historical collection work,” said board president David Scharfenberg. “We are confident that this project will bring great benefit to the people of St. Louis, and that its achievements will help to shape the future of the museum.”\n\n\nThe James A. Farquharson Center for Strategic and International Studies at Columbia University in New York has appointed Franck Ribery, a French curator and writer, as its next director. Ribery is the author", "The next Biennial should focus on the history of the new studio, a house built using materials from excavation sites in the Caspian Sea in the first half of the twentieth century, and will examine how the collective memory of artists worldwide has been shaped by the discursive strategy of digital media.  ***\n\n\nArtist A.J. Delgado, a Cuban American, has won the 2019 Pulitzer Prize. Delgado, a New York–based painter, won the prize for his depiction of the American Southwest. His work, which explores the history of the West Coast from a Cuban immigrant perspective, was chosen from a shortlist which included Nicole Estrada, Naomi Klein, and Laura Aguilar.Born in Puerto Rico in 1962, Delgado first studied at the Panamerican School in New York, graduating in 1989. He returned to his native country in 1999, where he began a family, and is now based in San Juan, Puerto Rico. In the 2018 issue of Artforum, Artforum editor-in-chief Paul Mpagi Sepuya claimed that Delgado’s work is “more Cuban and less New York, a mix of embrace and distancing.” The artist’s work was included in the Bi", "The next Biennial should be ready by the end of the year. The event will also aim to shed light on the complex interplay between art and science. The biennial will be an extension of the annual MAAAT—for MAAAT is a platform for the best studies and exhibitions of contemporary art in the city of New York.In a statement, the museum said: “While we understand the importance of the MAAAT to our community, we recognize that this year’s version is not representative of our work. We have made some progress in rebalancing the biennial, and we intend to continue to do so, but we believe that the biennial’s future is at risk if this iteration of the exhibition does not change.”\n\n\n\n\n\nGerman artist, choreographer, writer, and educator Anton Kern, who pioneered a generation of post-Beat Generation composers, has died at age seventy-two at his home in Frankfurt.Born in the industrial city of Bremen in 1932, Kern first studied with Erich Weise at the School of the Art Institute of Chicago (SICC), and later at the University of Tübingen. He would later collaborate with the German composer Klaus", "The next Biennial should take place at UCLA in 2021, and the next should be in 2021, with the first exhibition taking place at UCLA in 2021. Both exhibitions will be hosted by the same architect, Richard Meier. “What has kept me grounded, and what has kept the past alive,” said Meier. “I believe that historical architects have a role in the future of our city and community, and a role in shaping our future.”\n\n\nThe Vitra Foundation in Los Angeles has appointed Kate Reid as its next president and CEO. In her new role, which will last for two years, Reid will serve as the “hub” for art and technology projects to support the Vitra Center for Contemporary Art and the Vitra Institute, which focuses on experimental art and is currently being renovated. “Kate is a visionary leader who has built a career around developing innovative, high-impact, and free-spirited work. In her new role, she will continue to build upon the foundation’s reputation as an innovator and provider of high-quality art and technology, in support of the Vitra Center and the Vitra Institute, ensuring a vibrant and sustainable future for these organizations,” said foundation president", "The next Biennial should take place in the city in 2022. The institution also plans to create an additional archaeological mission on the city’s campus, which would be located in the city’s historic centre, and is hoping to attract more than ten thousand visitors.\n\n\nThe British artist and activist Nia Barnes, known for her gestural, geometric sculpture works that are infused with social justice, has died. The artist was eighty-five years old.Born in London in 1946, Barnes studied under Phillip Glass, who experimented with wood and steel in his second-class gallery, the Glass Gallery, before he began selling Glass Works in the late 1960s. Among the works in the show were the Glass-Mori Memorial Garden (1964), a series of miniature sculptures made from glass that are located at the rear of the museum; and the glass-enclosed greenhouse (1968), an open-concept installation of glass and molded plaster.Barnes would later allege that Glass framed her work as a protest against an industrial revolution that would reshape the world. “My work confronts glass as a central engine of the new economy,” she said in an interview in 2015. “It is about glass that I am making this work, about glass", "The next Biennial should be on June 11, 2020. \n\n\nMore than 90 artists and collectors have pledged to donate works to the Smithsonian American Art Museum in Washington, DC, which is working to put together a new retrospective of the late American painter Luis Buñuel\u0097The Smithsonian American Art Museum (SAAM)\u0097after a $1 billion fundraising effort. The institution is also working to purchase the original works from the artist and is hoping to raise $1.5 billion for its acquisition, renovation, and expansion.“We are very excited to bring the new works back to the institution,” said curator and founder of the Michael W. Peiks, Jr. Center for American Art L. Frank Lee. “This is an incredible achievement for the museum and we are confident that with your financial support, we will come back.”The institution also revealed that it will donate one thousand paintings and one hundred works on paper to the museum. “In celebration of this milestone,” Lee said, “we have created an online survey that you can complete anonymously to ask us questions about your work. We are planning to have a discussion about the online survey and how it might help us to avoid the challenges associated", "The next Biennial should open sometime this year and will be a continuation of the theme “Our Place: Art and Politics in the Twenty-first Century.”\n\n\nThe de Blasio administration approved a $2 billion expansion of the city’s public library system in December 2019, but the construction of a new building and staff shortages in the city’s ten boroughs have delayed its implementation. According to the New York Times, the Department of Cultural Affairs issued an order to cut $1.1 billion from the budget of the city’s arts and cultural nonprofit institutions in an attempt to calm financial markets and spur the creation of new revenue streams for the city’s public libraries.The plan to make New York’s public libraries more accessible and improve the efficiency of their operations was announced in 2018. The plan was made in response to the city’s ongoing financial crisis and ensuing economic meltdown. The plan was in response to the city’s protests against construction of new public housing units for low-income residents in the city, and it was also in response to the city’s protests against the controversial reopening of the Brooklyn Museum of Art. The revised budget for the city’s public libraries", "The next Biennial should be in 2021, and the first year of the first-person documentary, titled Danglijst, will be held in 2021. The first public screening of the film will be on September 10, 2019 at the Kunsthalle Basel in Switzerland.The next exhibition devoted to the history of photography at the Museum of Modern Art will be “The Digital Age: Photography in the Age of Digitality” in 2020. The exhibition will also showcase work by the artists who created a photographic corpus that comprised fifty thousand works between 1910 and 1950. \n\n\nThe Art Newspaper reports that the Museum of Modern Art (MoMA) in New York has appointed Amy A. Cohen as its next director. She will take the helm of the museum from Ted Chiang, who departed in February 2019 to head the Mars Center for the Arts, and will succeed Charles Henry. Cohen comes to MoMA from the Metropolitan Museum of Art, where she has served as director since 2006. She succeeds Joe Castro, who was well-known at the Met as a proponent of experimental architecture and a champion of contemporary art.During her tenure, she oversaw the reinstallation of the museum’s David-and-G", "The next Biennial should take place in 2020.\n\n\nThe Amsterdam-based artist Beatrice Eliasson has been selected as the winner of the twenty-fifth edition of the Dusseldorf Biennale. The announcement marks the first time the exhibition has been won by a woman and the first time any prize has been awarded by the Dutch Arts and Culture Authority (VVD). The five-year, $76,000 prize will be given in May.Born in the small town of Rech, in the canton of Voorhees, in the Netherlands, in 1975, Eliasson has been a living artist since 1987. The artist is known for her conceptual installations\u0097often composed of small objects, such as flowers, that are placed in her studio to interact with her audience\u0097and for her paintings, which often feature figurative representations of living objects.Her work has been exhibited at the New Art Museum in New York (2011), the Museum of Fine Arts, Manchester (2011), the National Museum of Art, Washington, DC (2015), the Museum of Contemporary Art, Los Angeles (2017), and the Museum of Modern Art, New York (2018). Her projects have been included in the exhibition “Arts and Culture", "The next Biennial should be at least three years from now. The next Ticino Biennial will be at least five years from now. The next PEN/SAFE Biennial will be at least three years from now. The next Maritime/Oceanic Design Biennial will be at least three years from now. The next Art of Humanity Biennials will be at least five years from now. The next Lincoln Center for the Arts will be at least six years from now. The next Marciano Art Museum, New York, will be at least seven years from now. The next Kunsthalle Basel will be at least eight years from now. The next Art of Life, a New York Art Museum exhibition, will be at least ten years from now. The next Art of Life, a museum of modern art, will be at least twelve years from now. The next Art of Life, a museum of modern art, will be at least thirteen years from now. The next Art of Life, a museum of modern art, will be at least fourteen years from now. The next Art of Life, a museum of modern art, will be at least fifteen years", "The next Biennial should take place in 2022, with a debut exhibition opening in the summer of 2020. In a review of the project for Artforum in October 2019, Keith Bove, editor of Artforum, wrote: “The exhibition will have a direct impact on the lives and work of the participants, who will have the opportunity to create their own narratives. The Artforum team is working closely with the artists and their families on this particular project, and is working with the government and local authorities to ensure that this unique event will be an exceptional success.”The first edition of the Biennial, staged at the Museum of Fine Arts in Boston in 2007, featured work by thirty-nine artists. The show opened with work by the Italian revolutionary writer-activist Cattelan, who considered the art of sculpture to be the central activity of the body, and featured work by the Argentinean Iranian artist Zulfiqar Ali Bhuiyan. The twentieth edition, staged at the Southbank Centre in London in 2012, featured work by twenty-nine artists. The fifty-third and fiftieth editions of the exhibition took place in Tokyo and Berlin in 2016 and 2018, respectively.\n\n\nThe Museum of Fine Arts (MFA) in", "The next Biennial should be in the spring, and the theme should be “The Life and Death of a Nation.” The theme should be adapted from the “The Life and Death of India”, a book by Charles A. Hennessy, which was released in 1962. Hennessy was a Harvard University alumnus, and his book explored how the “nation state” had become a “central feature of Indian history.”The next edition of the exhibition will be held in New Delhi from March 8 to March 11, 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Romina C. Robinson as its new assistant curator of modern and contemporary art. Robinson comes to the MFA from the Getty, where she most recently served as director of collections and exhibitions. She will assume her new post on March 21.“Romina Robinson is a seasoned curator and scholar whose research, writing, and curatorial practice has been a consistent thread through the MFA’s collection and exhibitions program,” said museum director Joshua Siskind. “We are excited to welcome her to the MFA and to her team. Her expertise and passion for art and her ability", "The next Biennial should be held in 2020. “The need for cultural institutions to be able to offer a comprehensive and timely platform for art and ideas is growing more urgent,” said Francisco Pires, director of the Museo de Arte Contemporáneo Antropologico (MAAC). “MAAC has been working for more than twenty years to develop and realize a vision for a new Museum of Contemporary Art in the city of Córdoba, and we are pleased to contribute to this ambitious project. We are eager to expand the reach of our program and to become a part of the city’s rich cultural heritage heritage.” MAAC takes place in a former textile factory in the city of Cordoba. The institution currently has a permanent collection of more than 3,600 works, with a primary focus on the twentieth-century.\n\n\nRomanian & Canadian artist Amit Berenbaum, whose sculptural and experimental installations often confront themes of memory and displacement and fuse surrealism, projection, and performance, has died of cancer at age seventy-eight.Born to a family of prominent industrialists in 1960 in the industrial city of Bucharest, Berenbaum studied with painter", "The next Biennial should be held in December 2020.\n\n\nThe Royal Academy of Arts (RA), the London-based contemporary art organization, announced today that it is holding an emergency meeting to discuss a potential shutdown of the institution in an attempt to prevent the spread of Covid-19, the deadly virus that has since taken hold in the United States and has been linked to at least 200,000 deaths.The academy, which was founded in 1835, has had to close its doors for a third day in a row to prevent the spread of the virus. According to the Guardian, the Royal Academy of Arts has had to deploy the majority of its full-time staff to help prevent the coronavirus outbreak. The Royal Academy of Arts, which was forced to cancel two of its annual festivals due to the virus and has already laid off half of its curatorial staff, is trying to limit the number of visitors it will have to the museum; reinstall the museum’s elevators; and re-purpose the museum’s collection space.The Royal Academy of Arts was forced to cancel a fourth edition of the Royal Academy of Arts (RA) in January 2019 after an exhibitor informed the institution that they were unable to carry out a series of", "The next Biennial should take place in 2020. The exhibition will also include the first-ever biennial survey of the work of the late Soviet artist and architect V. L. Sizemore, directed by Rossana Tyurina (the winner of the $1 million Leningrad Art Prize in 2009 and the winner of the $5 million Leningrad Biennale in 2010); and the first retrospective of the work of the Russian artist and architect Alexei Pushkin, which will be staged in the first half of 2020.The announcement of the 2020 Biennial of Modern Art in St. Petersburg follows a wave of criticism following the events of 9/11. Activists, human rights defenders, and politicians condemned governments and security forces in the United States and Europe for failing to prevent the attacks, and for failing to adequately punish terrorists. In the immediate aftermath of 911—when the Twin Towers in New York were just beginning to collapse and the World Trade Center in New York was still standing—Russian president Vladimir Putin ordered a crackdown on anti-government activists, including the detention of dozens of suspected anarchists. The government has since prosecuted dozens of suspected terrorists and activists, including Alexander Litvinenko, a Russian citizen who was arrested in Britain on suspicion of the", "The next Biennial should launch in 2020 and will take place in the city’s Art Museum at the University of São Paulo (UBP) and the Museu de Arte de São Paulo (MASP) in Rio de Janeiro.The theme of the exhibition, “Art and Death,” is a combination of the Brazilian artist and the Brazilian myth about the Creation of Death itself. According to the artist, the artist creates objects that are both embodiments of his metaphysical reality and objects that are manifestations of the creation of the material world. The creators of the objects are not able to exist apart from each other and are united in their creation. The artists create a world out of nothing and are able to put their personal artistic interests before the interests of society. \n\n\nThe Oakdale Art Museum in Minnesota has received a gift of forty-five works from the Annenberg Collection. The museum donated twenty-six works from the collection that were previously on display in the Tate’s exhibition “Annihilation: Art in the Age of Stanley Kubrick” between 2003 and 2009. The works are from the previous decade and are currently on display in the museum’s new exhibition, “The Arts and Politics of Death: Art in", "The next Biennial should take place in the spring of 2021. The committee will decide whether to launch the exhibition in the spring of 2022. One of the exhibition's artists will be selected from the shortlist for the prize next year.A full list of contributors can be found on Biennial’s website.\n\n\nThe Museum of Arts and Design (MAD) in London announced today that it has appointed Adrienne Edwards as its new director. She will be responsible for driving MAD’s artistic and educational mission through programming and exhibitions, research, and education.“I’ve long been inspired by Adrienne’s understanding of the power of ideas to affect and shape people’s lives,” said Nicola Pickering, MAD’s board chair. “In the immediate future, she will be instrumental in helping MAD to build on its legacy of engaging with and testing emerging ideas through over two hundred exhibitions and projects over the last twelve years, and continuing its long-standing commitment to local and international initiatives.”EDWARDS, who has worked as a curator at the museum since 2016, has curated more than seventy-five shows at the institution, including “The Place Beyond the Clouds: Visuals", "The next Biennial should take place at the Grand Palais in Paris in 2021; the exhibition will be staged by the French institution rebranded as the Institut Nationale de l'Art et l'histoire. The next edition will be held at the Institut in Basel in 2022; the show will be held by the Museum of Modern Art.The 2020 edition was organized by director-general Joël Benoît; the 2020 theme was 'Creation and Destruction, a Time of Crisis.” Benoît also expressed his wish to hold a second edition of the exhibition at the Museum of Modern Art in 2020. \n\n\nThe Bessies, a British art museum founded in London in 1893 and based in Bessies, near Stratford-on-Avon, England, has received a gift of one of its collection, a set of four oil paintings by Pierre-Auguste Renoir. The contemporary artist was a friend of the Bessies’ founders and board members and was in the process of creating a monumental painting for the institution when the accident that claimed his life, on December 14, 1923, occurred. “The Bessies are deeply touched by this gift and are preparing", "The next Biennial should take place in 2021, near the opening of the new, reconfigured museum. The protesters’ demand that the institution re-envision the exhibition “In the Image of the Black Madonna” (2016), a presentation of works by artists such as Vincent van Gogh, Charles Burnett, and Rudolf Hoess.“The Haus der Kunst (HDR) in Berlin is an important and important museum, but it is also far from unique in its political and cultural commitments,” said Bernd & Main, the organizers of the upcoming exhibition. “The new museum will incorporate both the best and the worst of the recent history, and will reflect the spirit of the city where it will open: the municipality of Berlin. The changes will be radical, they are not easy, and they will take time. But we will do everything we can to make the museum back to its former glory.”\n\n\nThe Associated British Artists (ABA), which represents more than 1,500 visual artists, has released its list of seventeen individuals, including Nirvan Patil, Amy Chua, Suellen Casteel, Eleanor Clift, and", "The next Biennial should be the culmination of a remarkable and multi-layered journey that began with a donation from Sir David Attenborough, in recognition of his extraordinary and enduring contribution to science and art, and has now yielded the most beautiful result: his image, which is now being brought to life by the Royal Shakespeare Company, at Stratford-on-Avon. In the early days of the institution, when it was still known as the Royal Shakespeare Company, the work of the artist was featured in only a very few places. The first exhibition was in 1974, at the London Biennial. This was followed by his first major exhibition at the Royal Institute of British Architects (RIA), at the Rijksmuseum in Amsterdam in 1981, and then three more trips to the Rijksmuseum in the Netherlands, the Netherlands, and the United Kingdom, in 1999, 2002, and 2007, respectively. In 2004, the museum staged a major retrospective of the artist’s work in the Netherlands, and in 2006, the biennial was renamed the Ploughshares Prize. The Biennial of Kwanza, London, was also awarded the Rijksmuseum’s prestigious James Gandon Medal in 2009.In his", "The next Biennial should be held in the spring of 2020. \n\n\nThe Museum of Fine Arts (MFA) Miami Beach has received a donation of eighty-nine works from the private collection of David-and-Goliath collector Nelson Peltz. Since its founding by John Mercant in 1931, the museum has amassed a collection that is valued at approximately $3 billion. In recognition of the works’ remarkable collection, the institution has put forth a new series of biennial auctions that will streamline the auction process and take place throughout the museum’s complex in the summer of 2020. “As we approach the fiftieth anniversary of the museum, it is truly exciting to welcome the works of David-and-Goliath to Miami Beach for a series of auctions that will involve a wide and diverse audience,” said MFA director Marie Schubert. “The auction process will be simplified; the literary and biennial presentations will be enhanced; and the artworks will be brought to life by talented and dedicated staff, artists, and architects.”The auction is being organized as part of the museum’s ongoing efforts to include more contemporary artworks in its collection and to present them in greater depth,", "The next Biennial should take place in the spring of 2020.<|endoftext|>As parts of the United Kingdom intensify their deadly reign of terror with more massive and deadly air and sea strikes, protests against the government’s handling of the coronavirus outbreak have taken place across the globe. Tens of thousands are now demanding an end to air strikes in Syria and the United Kingdom, as well as the killing of a British citizen who was arrested on suspicion of terrorism-related offences in the UK.The London-based group PEN American wrote a letter to the US Congress on Wednesday urging Congress to authorize military strikes against the Syrian government, an escalation of previously held calls for the US to launch airstrikes against the government of President Bashar al-Assad. The letter notes that US air strikes in Syria have already caused more than 340 deaths since the attacks began, and that the Syrian Civil War has already claimed the lives of more than 62,000 people.The letter, which was signed by Nancy Eastman, executive director of the American Coalition to Ban Chemical Weapons, and Christopher Sexton, director of the Art Institute of Chicago’s Center for International Security Studies, argues that the US has been arming and funding terrorists for more than a year, that airstrikes are no substitute", "The next Biennial should take place in 2022, and the first in 2021.  The dates for the first up-close exhibition, “A Trip to the Moon,” are still being finalized. The museum is also working on a redesign of its building, which is scheduled to open in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Lori Azzopardi as its new associate director of artistic experience, effective immediately. Previously, she held the position of director of the exhibition space, the Los Angeles County Museum of Art (LACMA), from 2013 to 2016.“Lori brings to LACMA a wealth of experience in the fields of curating, technology, and digital transformation as well as a keen understanding of how artist partnerships can improve the museum’s collection and operations,” said director Marc Glimcher. “Lori’s leadership and ability to prioritize and prioritize her work will ensure that LACMA’s collections and experiences are developed in a way that works for both dedicated collectors and the many unique and growing audiences that LACMA has.”Azzopardi succeeds Elizabeth G. Johnson, who has helmed the museum since 2006", "The next Biennial should focus on bringing together artists from the Gulf and Central Asia, with the aim of working together on the future of our planet. This is an urgent situation, since climate change will likely become the most severe emergency on our planet in twenty years.\n\n\nThe Soreski Museum in New York has announced that it plans to open an artist-run location in its basement in the fall. The institution is currently working on a redesign that will incorporate more artist-friendly spaces and a smart home that will integrate art and technology. The project was led by Soresek Sculpture Center cofounder and New York–based urban designer Daniel H. Weiss and is slated to be completed in 2020.“We are thrilled that the renovation of the museum will result in a new generation of Carol Brown and Ira Brown’s works on view in the fall,” said Soresek CEO Monica S. Soltanovich. “Soresek is the perfect partner to bring these works to life in the Soreski, as we reimagine the future through the vision of our future generations. We look forward to sharing these visions with the public.”The Soreski will also include new public spaces, a library", "The next Biennial should take place in the first quarter of 2020 to coincide with the opening of the new exhibition area in the museum. The biennial will present the first exhibition of the new collections and will premiere the works of twenty-five new artists.\n\n\nThe inaugural Biennial of Modern and Contemporary Art (BMA) in Miyazaki, Japan, will now have an opening date of March 20, 2020. The exhibition will be hosted by the Japanese National Museum (Nemo) and will draw approximately 3 million visitors.It will be held at the museum, which was founded in 1946 by Japanese artist Masayoshi Tanaka, and will feature artists such as Tadao Ando, Oda Nobu, and Yoshitomo Nara. The event will also include a concert series and a reading series. The full list of participating artists is as follows:ARTIST:Laurent LégerCyborg Alice (France)Cyanale Lefebvre (France)SARA:The Artist\n\nArt Museum Tokyo (Japan)Tadao Ando (Japan)Ajinko Ito (Japan)Mackenzie Love (UK)Peng Matsu (Japan)Jinny Lemon (USA)", "The next Biennial should be held at least annually, with a minimum of two exhibitions per year. Historically, Art Basel Hong Kong has hosted several annual exhibitions a year, but its new plan will mean that only one exhibition, The Dynamics of Light, will take place in 2020. Previous editions of the event, which were held at the Museum of Contemporary Art in San Francisco from 2003 to 2014, were part of the Beijing Art Fair and the Shanghai Art Festival.The original 2020 theme was Australian Institute of the Arts. The consortium including Art Basel, Australian Museum of Contemporary Art, Sydney, and the Australian Museum of Modern Art, Melbourne, has since been asked to consider themes such as: The Duality of Life, The Spirit and the World, and The Past and Future.\n\n\nThe United Kingdom will not be forced to take part in a military action against Islamic State (IS) militants in Syria, the New York Times reports. Prime Minister Boris Johnson announced on Thursday, April 6, that the country would remain in its current position as the world’s only member of the coalition fighting the group, called the Syrian Arab Coalition. The UK’s decision was made after a meeting with British, French, and Italian leaders, including French Foreign Minister Jean", "The next Biennial should be in 2020. A series of exhibitions, residencies, and other programming is also in the works. \n\n\nThe Solveig Museum in Zurich has named Elisabeth Büttner assistant curator of contemporary art. Büttner joins the Solveig from the Museum of Modern Art (MoMA), where she was the curator of “Reality and History in Design” (2017–18), and will be responsible for integrating the museum’s collection of contemporary art into the Solveig. She will assume her responsibilities at the Museum of Modern Art in March.“We are very pleased with the addition of Elisabeth Büttner to the Solveig team and to the museum. Her insights, experience, and passion for contemporary art make her the ideal candidate for the Solveig,” said Stefan Dähli, director of the Solveig. “Her expertise and knowledge in contemporary art and her ability to bring our contemporary art collection into action will make her an ideal collaborator for Solveig.”Büttner’s first major retrospective at MoMA was “Theatre of Modern Life” (2017–19), which opened in", "The next Biennial should take place in the spring of 2020. According to a statement released by the event’s organizers, the exhibition will bring together contemporary artists from forty-eight countries. The first iteration of the biennial, titled “Cyanide,” was held in the form of a phone call to the artist\u0097Jared Casteel, who is currently incarcerated in the United States\u0097in the winter of 2017. The exhibition highlighted the work of emerging and established artists in China\u0097both domestically and internationally. The exhibition also featured a documentary about a group of artists who were imprisoned for stealing a painting from a museum in Beijing\u0097the exhibition was titled “Art and the Punishment of Justice.”The exhibition was chosen over a number of other projects, including an exhibition of work by Chinese artists in the United States, a solo exhibition at New York’s Museum of Modern Art, and an exhibition at the Guangdong Art Museum. Former director of the exhibition, Tzhe Chinese artist Hu Jia, told Naver Magazine that he was “surprised” that the Biennial’s selection committee concluded its work in such a way as to favor a work by a Chinese artist", "The next Biennial should be held in 2020, and the last in 2022. The venue will be moved to the São Paulo State University.The museum is currently closed until further notice because of the Covid-19 outbreak.The contest’s inaugural exhibition, “Spiel einer neue Bildungsrecht—” (Tomorrow is Not Enough), will open at the museum on September 22. The biennial will be followed by “Hegeschäftungen” (Homeland), “Funny Things” (2019), “Paris: a city that transcends time,” and a new film by the German artist and director Matthias Köhler.Köhler’s film, which premiered at the Berlinale Film Festival in September 2019, is a meditation on the double life of art and art works of art, a world where the art of the body and the art of the mind are intertwined. In a review of the film, the Art Newspaper said: “If the film is a satire of the exhibition, it is a very serious one. Köhler plays with the concept of the exhibition, the exhibition, and the audience. He who is there is not alone", "The next Biennial should take place in 2020, with the demonstration of the new \"greater-art\" phase, which will take place during the first half of 2020.The decision to halt the exhibition was made following an emergency meeting of the board of directors of the Royal Academy of Arts in London on January 31. “The board of trustees of the Royal Academy of Arts is incredibly disappointed that the show will not conclude in the coming twelve months,” said the academy’s director, Hamish Anderson. “It is also deeply concerned that the show will not be completed in time to mark the twenty-fifth anniversary of the event.”He added: “The board is committed to working with the artists, curators, and producers of the exhibition to ensure that the showcase is delivered in the best possible way. We are assured that the Academy will work with the Royal Academy of Arts to find a solution that maximises the exhibition’s potential and to ensure the future of the exhibition.”The Royal Academy’s role, which dates back to 1922, is to promote the art of the Royal Academy of Arts and to represent the academy at large. It also oversees the exhibition “The Art of Man” (", "The next Biennial should focus on the use of new media to address the social, political, and ecological crises of our time, including the global pandemic, the impact of climate change on human health and well-being, and the ecological crises of our environments. In addition, it should consider how art can continue to play a positive role in addressing the social, political, and ecological concerns of our times through ‘institutional culture.’ The 2019 exhibition will be curated by Nick Rondin, president of the Rondin Collection, and will take place at the London Art Gallery from March 10 to March 13, 2020. For more information about the 2019 Biennial, visit: http://www.theartofusiness.com/biennials2018/ Gallery Holidays: The Hague (6): The Holland Biennials have announced that it will be a “holiday” in March. The event will include a number of new events, including a special exhibition at the Amsterdam Biennials, the first international event in the Netherlands, which will be held at the Fleming Gallery in the Hague, and will run from March 15 to March 16. Previously scheduled for March 12–March 18", "The next Biennial should focus on how art is embedded in the lives of rural communities in the Philippines, and how art and culture can help alleviate the social and economic distress of these communities. The fourth exhibition should focus on the contemporary practices, theories, and recreations of the Filipino artist and philosopher Juan Ponce Enriquez, and the fifth exhibition should examine the relationship between filmmaking and the Philippines art scene.The exhibition will mark the opening of the new documentary series Cinema in the Philippines (CIP). The inaugural episode, “The House Of Pines,” will screen at the Palawan Bicol, and the second episode, “The Art Of Film,” will be shown at the Bicol. CIP will be followed by The New Pangang Culture and the Philippines, which will open at the Palawan Bicol in September 2019.\n\n\nThe National Museum of Art in Washington, DC, has appointed Kate McKinnon as its new executive director. McKinnon joins the museum after serving as a deputy director for development and research at the Smithsonian American Art Museum in D.C. and as the deputy director of the Metropolitan Museum of Art.“Kate’s appointment demonstrates the National Museum�", "The next Biennial should be held in 2021. Central to the exhibition will be the exhibition of the work of forty-five Nigerian artists. The thirty-six women artists will be presented by the National Arts and Artologies Centre, Abuja; the thirty-four men artists will be presented by the National Gallery of Art, New York; and the thirty-three men artists and women artists from the Palawan archipelago.“The themes of the Arts and Design Biennials are challenging, yet inclusive, as they reflect and expand upon the paradoxes and contradictions of Contemporary African art,” said architect Christopher Uyenchuk. “You don’t have to be an expert in Nigerian art to appreciate the significance of these artists and their work, and we’re confident that they will deliver compelling and imaginative exhibitions that celebrate these artists’ extraordinary work.”The first Biennial was curated by Adrian Piper, the former head of heritage at the Museu de Arte de São Paulo and the former managing director of ADCO, and took place in 2015. The exhibition featured work by fifty-three artists, including Richard Solomon, Bugi Mabaso, Zulfiqar Mire, Kato Gebre", "The next Biennial should be held in 2021. The 2019 edition, titled Unseen: Art and Politics in the Age of Mechanical Reproduction, was held at the Museo de Cultura Autodromo de São Paulo (MASP) and featured works by twenty-two artists, including Edson Araújo, Tania Barbosa, and Elvira Baltag, and was presented by the curator of the exhibition, Viana Ovenden, as well as José Antonio Bastos, editor of the journal Artforum, and Ronald K. Bowman, a curator at the United States’ Department of State.The 2020 edition, titled Beyond Design, will be held at the Museo de Arte Contemporáneo in Lisbon and will feature works by fifty-five artists, including Levi Basu, Alejandra Catellani, Cécile Botta, Fikret Saar, Andreas Schlechtriem, and Peter-Paul van der Heyden.\n\n\nThe National Gallery in London announced on Friday that it will reopen with a bang, with the launch of National Treasure, a new series of exhibitions and concerts that will run from October 5 to October 7. Titled “National", "The next Biennial should be staged in 2021. If the museum decides to move forward with the exhibition, it will do so with the assistance of an endowment fund. The museum hopes to raise $10 million for the project. \n\n\nThe Estate of Vincent van Gogh has asked the Netherlands government to consider a payment of $100 million for the estate’s ownership of the work, which was sold by collector Bernard van Gogh in 1967 for $141,900. The donation was made after Dutch media outlets began reporting that an estate representative promised the museum that it would pay $150 million for the painting.The estate is now asking for the Dutch government to extend the deadline for payment to December 31, so that the estate can collect the promised $175 million. The estate’s lawyer, Christian Boesel, told the Art Newspaper that the estate is still awaiting the return of the painting, which was sold by heir to a German family named Hetain Van Gogh in 1968.\n\n\nThe Museum of Modern Art (MoMA) in New York has announced that its collection of thirty-three Van Gogh paintings will be taken over by the public collection of the Dutch-born, Brooklyn-based collector Bernhard Lautens", "The next Biennial should be held in 2021, the magazine said. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the relocation of works from the Metropolitan Museum of Art (MoMA) in Manhattan to the Bronx. “The Met is committed to fostering an environment of mutual respect and admiration between our museums and the community,” said museum director Daniel H. Weiss. “By moving the pieces, we are saying that we value the art of our institutions and they value the art of our communities.”According to the guidelines, the Met will preserve the collection and future exhibition program at the institution, but will not move the works. While the institution is not planning to close, the collection will be moved to a storage facility in the Bronx.The guidelines state that the museum will “take all feasible actions” to protect the collection, including reviewing leases and securing additional financing, and that the museum will “take all feasible actions to protect the institution’s intellectual property, including the transfer of intellectual property to the Met.” The guidelines also outline how the museum will avoid the loss of revenue from visitors visiting the Met, but will disclose additional financial details when the guidelines are finalized.The", "The next Biennial should be held in the spring of 2021.  The central theme of the project is “strategies, methods, and representations.” It will also include the work of new and established artists and will be led by a select group of curators and critics. The biennial is supported by the Kaviar Foundation, the Kaviar Foundation Arts and Culture, the Kaviar Curatorial Council, and the Ford Foundation. The 2019 edition of the festival was held at the Brooklyn Museum and was preceded by “Sensational,” an exhibition of new work by S.M. Kareem at the Museum of Modern Art, and “Burn the Witch,” a series of drawings by Peter Wollen.\n\n\nThe Oakland Museum of California (O.M.C.) has appointed Nancy J. Kipp as its next director. Kipp will be responsible for leading the museum through its three-year privatization plan and will take the helm from Nancy H. Almendarez, who retired in May after nearly a decade as director. “In the past year, O.M.C. has made significant progress in building a brand-new facility that will better serve the community and", "The next Biennial should be held in Moscow, the Russian capital, and will highlight the work of young Ukrainian artists and will take place in various locations across the city. The event will include programming by curators, writers, and artists, including Zora Gabor, Kateryna Jakubkina, and Aleksandra Kalmeszko, and will be hosted by the Russian Academy of Arts in Moscow.\n\n\nThe Dusseldorf-based nonprofit Artforum, which was founded by German artist Barbara and American artist Markus Kander in 2012 as an alternative publishing platform for the couple, is to launch a new digital platform that will allow the public to share photographs, artworks, videos, and other digital works with one another.The initiative, titled Micro-Art, was inspired by a photograph that Markus shared with Barbara that year, when the couple were still in their twenties. In the photograph, Barbara can be seen riding a scooter in the city of Dusseldorf. As the bicycle reaches a stop sign, an elderly woman, who appears to be in her fifties, stands in front of the bicycle and lets the bicycle pass her by. The bicycle then stops, and the woman, who appears to be in her f", "The next Biennial should have been held in October or November, but was postponed due to the Covid-19 pandemic. The new date will be announced soon. The third iteration of the free, photographic exhibition will be held in late February, with the exhibition opening at the Museum of Contemporary Art Los Angeles (LA MoCA) in March. The fourth and final edition of the biennial, “Art in Motion: The Bicentennial of Art in Motion,” which will run March 11–March 16, 2020, will be held at the Los Angeles County Museum of Art (LACMA), on December 23–January 7, 2020. This year’s Biennial will present more than 150 artists, including David Goldblatt, Kurt Wien, László Nemesi, Anish Kapoor, Jonathan Negret, and Sohrab Mohebbi.\n\n\nArt was on the mind of many when the assassination of Martin Luther King, Jr., on June 4, 1968, brought America to a standstill. King, a seventy-nine-year-old civil rights attorney from Memphis, Tennessee, was the twenty-nine-year-old president of the Southern Christian Leadership Conference (SCLC", "The next Biennial should be held at the Museum of Modern Art in Rome, which has already committed to staging a show on the history of art in 2020; the Palace Museum in London, which has already allocated $25 million for the exhibition of work by artists of South and Southeast Asia, and the Kunsthalle Basel in Switzerland, which has already committed $30 million for the exhibition of work by contemporary art of the Third World.\n\n\nThe French government has appointed protocol artist Christophe Breton the new director of the Metropolitan Museum of Art. The appointment was made on Monday, March 2, following a board meeting chaired by Culture Minister Franck Riester, who will now oversee the museum through 2021. The move follows French Culture Minister Franck Riester’s April 5 announcement that the museum would reopen, following the conclusion of a major renovation and expansion project, in 2021 following the completion of a two-year campaign.“On behalf of the government and of the French people, I welcome the opportunity to lead the Met, one of the oldest and most important cultural institutions in the world, in promoting the museum’s core values, Riester said. “The Met’s transformation, which began in the late 1980", "The next Biennial should focus on presenting new work by established and emerging artists and should include new collaborations between artists and the museum, which would then become eligible for a permanent endowment. The museum would then be able to continue to display the work of a select group of artists through its permanent collection, which would be dedicated to art.“We are extremely excited to work with the artists and the Museum to create an exhibition that embodies the spirit of Art Basel in the City of Tokyo,” said Yoshihide Sugano, director of the Biennial.The inaugural exhibition, “Art in the City,” will open in February 2020 and will organize numerous new commissions, including new works by renowned artist Joseph Beuys. The art of Lévy Goriot will also be showcased on the museum’s campus, alongside works by artists such as Pierre-Michel Basquiat, Alfred Stieglitz, and John Muir. The museum’s collection is also being reorganized to better serve the needs of visitors. The museum is planning to launch a digital platform that will allow visitors to explore the artworks of the collection online.\n\n\nThe European Commission has released a plan to lift the tax-exempt status of the", "The next Biennial should take place in 2021. \n\n\nAnne-Marie Kupenhoff, the chief curator of the new year’s edition of Frieze New York, has announced that the next edition will feature works by forty artists. Kupenhoff explained that the move was made in order to include more female artists on the 2015 edition, the first of the new century.“Frieze is making a bold new statement with our first New York exhibition, a collection that is acutely concerned with female artists, and with an exhibition that reflects that theme,” Kupenhoff told the Art Newspaper. “We are honored to bring to the New York public a new collection of work by forty women artists, and this is the first time they will be represented in the United States.”Born in 1972 in New York, Kupenhoff has worked in curating at different levels of art and culture in New York and Berlin. The artist formerly worked as a curator for the Center for Art at the Museum of Modern Art in New York, and as an editor of the German daily Süddeutsche Zeitung. Her first solo show, “Frieze Sculpture ‘20/20”", "The next Biennial should feature works by over seventy artists from twenty-six countries and the United States, and will be held at the Emmanuel Art Institute in Paris from November 21 to December 10, 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it is restoring the landmark Huntington Library on the Lower East Side to its former glory through a $1.5 million gift from philanthropists George and Iris Murdoch.“As a result of a $1.5 million gift made by George and Iris Murdoch, the DCLA was able to restore the historic Huntington Library to its former glory,” Dale Rinehart, chair of the Murdoch empire, said in a statement. “The gift also made possible the work of hundreds of volunteers, including many who were not aware of the gift's potential, and made possible the department’s historic exhibition ‘Theo and the Art of Photography.� Together, the volunteers and the scientists, we are thrilled that this gift will ultimately help make this landmark exhibition a reality.”The donation also brought about one hundred photographs of The Artists’ Works, a major exhibition that opened at the Huntington in 1977 and featured works by fifty-three artists. The exhibition was", "The next Biennial should be held in Minsk, Russia, in early 2021. The biennial’s new president, Antonina Milosevic, has said that the event should consist of a series of discussions about the current situation throughout the world and its future.\n\n\nCulture Minister Monika Grütters has given the go-ahead for the United Kingdom to leave the European Union by June 30. The move comes after Brexit Secretary David Davis warned that Britain will not be able to stay in the bloc if it doesn’t begin negotiating a new trade deal by June 29. British Prime Minister Boris Johnson also stated that a vote to leave the bloc would be a vote to leave the European Union—a clear violation of British Prime Minister Theresa May’s pledge to hold a referendum on Britain’s membership of the bloc in June.“It is now clear to everyone that we are leaving the European Union—and we are leaving in a way that will truly deliver for British businesses and British workers,” said Johnson. “The European Union is collapsing, and we’re not going to get any deal done without a vote in Parliament. We need to act now to get the best deal for Britain.”Johnson"]