["The next Biennial should coincide with the Centenary of the birth of Karl Marx’s theory of commodity production. The first edition, which has been proposed as the theme of the GW2018, will be held in the German city of Bonn, in November 2021. “The present situation is one of many crises of capitalism, of which Marx was one part,” Klaus Wüstenberg, the director of the Frankfurt-based gallery the König Galerie, told the Art Newspaper last month. “The artist and essayist Carl Schmitt became the first to speak of the crisis in this way. He was the first to describe the crisis in economic terms and to outline what he called ‘socialism’” as an antithesis of a post-capitalist society. “Marx was not a socialist but he did recognize the ecological crisis,” Wüstenberg continued. “He was much more concerned with the problem of the economic form than with its content.” The second edition will be staged in 2020, and the third in 2021.  \n\n\nThe B.A.C. Art Foundation (B.A.C.) announced today that it has appointed Stephanie Arr", "The next Biennial should be called for October, the month the exhibition will open at the new building, the Westway, in London. The exhibition will include work from sixty-eight artists chosen by the audience, including Anne-Marie Tremblay, Cécile Blondel, Arthur Greaves, Iwan M. Banks, and Andre Karsch, and will also present a selection of works by artists and collectors from around the world, including Halston Fisk, Frank Gehry, Robert Irwin, and Ed Moses. Museum director Sophie Bremner said: “It is a great honour and privilege to welcome these artists, and to be able to present them here in London. It is a very challenging show to be a curator at a time when the biennial has been threatened, and when so many are concerned about the future of the exhibition. But we are determined to continue to present work in the exhibition space that has enabled us to flourish, and to continue to sell art and artmaking to a global audience.”The exhibition is part of the seventy-fifth edition of the Frieze London, which will run from March 11 to April 5 in Oxford, and will feature work by forty-eight artists. Admission to", "The next Biennial should be in 2021.\n\n\nA group of artists and arts workers in London are urging the Royal Shakespeare Company (RSC) to cancel fifty-six productions scheduled for its largest event of the year, the Royal Festival of the Arts (RFAs), in March. The artists claim that the production schedule conflicts with the theme of the upcoming season, which is “Twelfth Night.”Whole Corps, a collective of twenty-five artists, including Julie Myles, John Archibald, and William Kentridge, recently petitioned the RSC to suspend all performances at the venue until the performance calendar can be reconsidered. The group says that the festival’s decision to cancel the fifty-sixth iteration of the play, titled “Twelfth Night,” contradicts the theme of the seventy-fifth edition of the RSC, which will run from March 20 to March 22. “We write to acknowledge our engagement with the 2019 RSC season as a whole, but particularly the fifteenth edition, ‘Twelfth Night,’ and the risk that this decision will cause, and the serious harm that it could cause, not only to the artists who have contributed to this season, but to the", "The next Biennial should take place in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Elizabeth Ann Macgregor as its next executive director. Macgregor replaces Barbara Brodsky, who retired in March after seventeen years at the helm of the museum.“As we transition to a new chapter at the Museum, we are delighted to welcome Elizabeth to the team,” said Mark L. Daniels, chair of the board of trustees. “Her record of success, coupled with her enthusiasm for the arts and her deep understanding of contemporary art and the museum’s mission, make her an ideal fit for the role.”Macgregor previously served as chief executive of the Metropolitan Museum of Art in New York and as the executive director of the New Museum in New York from 2000 to 2005. She was also a founding member of the MoCA board of directors, which oversees the management and operations of the museum, and has been a board member of the museum since 1979.Commenting on her appointment, Macgregor said: “I’m enormously proud to be joining the MoCA team at a pivotal moment in our museum’s history and to have lent my voice to a project", "The next Biennial should take place at the city’s Presidio Endeavor (SE), in San Diego, in 2022.\n\n\nThe Twentieth Venice Biennale will kick off this week with the opening of its sixteenth edition, “Landscape and Landscape-Extraction: The Anthropology of Landscape.” Launched by the Twentieth Venice Biennale, the exhibition will seek to re-imagine how landscape and landscape-mixing art can combine to form new and more inclusive forms of art.Headlined by artists such as Alex Katz, Daniel Polansky, Bénédicte Saville, and Cristina Vassallo, the exhibition will feature work by thirty-eight artists, including Christo, Pedro Senna, and Vito Acconci, and will run for thirteen weeks. The art world heavyweights will all be represented by the Twentieth Venice Biennale, which is currently holding an edition in Amsterdam next month.In the run up to the event, the Twentieth Venice Biennale has been running a digital promotion campaign designed to get the word out about the event and has partnered with the International Center for the Arts (ICA) in Venice to host", "The next Biennial should take place in 2021. In September, the exhibition will reopen to the public in New York.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Anne M. Wilson as its next executive director. Wilson comes to the institution from the Museum of Contemporary Art (MA) in New York, where she has served in various roles since 2007. During her tenure at the institution, she has organized more than eighty exhibitions, including “Ateliers Internationale: The Organic and the Subversive” (2018), “This Is Not an Exhibition: Contemporary Art from the 1960s to the Present” (2017), and “The Life and Death of Pablo: Art in the Age of Water.”“I'm thrilled to be joining MoCA at this exciting and challenging time,” Wilson said. “This is a project about to begin in a city that has made such great strides in transforming its landscape and its people, and about to open its first museum in a major expansion, with a distinctively contemporary vision, in the heart of Downtown Los Angeles. I’m hopeful that through this new partnership I’ll be able to help MoCA remain at the forefront of the", "The next Biennial should take place in the coming years. In the event that the Contemporary Biennial of New York is cancelled or postponed, the Biennial should continue.[Update: November 6, 2018] Commenting on the cancellation of the fest, the Art Newspaper said: The 2019 edition of the Biennial is expected to take place in the autumn of 2020. In a letter addressed to the artists, organizers wrote: “I wanted to take the opportunity to thank the artists and the Biennial for giving me the opportunity to present this event. The artists who have expressed interest in participating in this event are the key to making this possible. I hope that this year’s edition of the Biennial will be a mark of our unity as a community. We are all engaged in a process of renewal, of transformation, of revitalization. ”\n\n\nThe United Kingdom’s Department for Culture, Media and Sport (CMS), which oversees the arts and culture, has admitted that it “will not be able to decide on a new £2 billion budget for the arts and culture by the end of March.” The announcement follows a report released last week by the Guardian, which found that,", "The next Biennial should focus on increasing the visibility of poverty and injustice through art, and should connect the exhibition to the work of local and international artists and organizations. \n\nREUTERS/Robert Parke The eight remaining members of the Center, which was founded in 1987 as a refuge for around eighty artists, including Thomas M. Knapp, Helen Cammock, and William S. Burroughs, are being probed on suspicion of fraud and money-laundering charges. The news comes on the heels of the Metropolitan Museum of Art (MoA), which was forced to close its doors indefinitely in February because of the coronavirus, announcing that it would present a new work by James Turrell, a pioneering American artist who experimented with writing in digital form. “This is a crisis without precedent in our lifetimes, and it is a crisis for which we are all and forever liable,” said Amanda Ross-Hopper, director of the Metropolitan Museum of Art. “The work of our colleagues at the Center will continue at least through this crisis, and we will continue to collaborate with and learn from our colleagues across the world, including in other countries, and we will share our experiences and our insights.”\n\n", "The next Biennial should be in 2020. “The next Biennial should be in 2020.\n\n\nThe City of New York and the New York Public Library (NYPL) have teamed up to present the first edition of the NYC Museum of Modern Art (NYC MoMA)’s annual “Gender in Art” event, which will take place at the museum on September 21 and September 22. The project, which is part of the city’s flagship strategy to advance gender equality, will focus on the work of women artists and their descendants and will serve as a platform to engage with the ongoing work of women artists.“Gender in Art will be a celebration of the work of women artists, their descendants, and their peers across the globe, as embodied in their own bodies, and will be a celebration of the cultural relevance of women artists, their descendants, and their peers across the globe,” said NYC MoMA director Daniel H. Weiss. The exhibition will celebrate the life and work of Marie Louise Aune, who taught at the institution from 1983 to 1985, and will focus on her daughter, Marie Louise Béchard, who was a key member of the early feminist publishing movement. The inaugural exhibition will showcase the", "The next Biennial should be held at the Victor Wootton Arts Centre in Ipswich, where the £31m exhibition, aptly titled “The Evolution of Art: From the Wootton Biennial in 1932 to the National Biennial in 1964,” will introduce a new exhibition. The work will feature works by nineteen contemporary and contemporary-art artists. “What began as a question from Paul Mpagi Sepuya, the CEO of the Wootton Foundation, and Paul Mpagi Njidega, the founder of the National Museum of Contemporary Art in Lagos, has now become a project that will unfold across the United States and the world,” said Peter Sijbrandy. Commenting on the project, Mpagi Sepuya said: “The Wootton Foundation is proud to support the creation of an exhibition that will be a vision of the world’s greatest art. With its funds, the team and I have created an exhibition that will open the door to a new view of art history and the way contemporary art is presented today. It will also introduce a new conversation to the history of art, and are deeply excited by the power of the Woot", "The next Biennial should be held at an outdoor venue such as Brooklyn’s Prospect Park in 2020, the new Museum of Modern Art in Boston, or the museum’s new home in the city. \n\nActors, including Jennifer Ehle, Adam Driver, and Tom Hooper, are boycotting the upcoming edition of the Cannes Film Festival, which will take place in May. “Acts,” the official festival of the Belgian Film Festival, has announced. “The official decision of the festival has never been changed. The board is still taking the necessary decisions.”In a statement published by the festival’s artistic director, Thomas de Waal, the calls the boycott an attack on freedom of expression. The boycott, which has been organized by the Belgian Federation of Arts and Culture, has been encouraged by DeSmog, a British environmental organization, and other cultural figures in an attempt to influence the event, which will take place in May, and was spurred by a report published by the United Nations that found that sixty percent of the world’s forests and wetlands are degraded. The study was based on data from more than twenty countries, including the UK, China", "The next Biennial should be announced as soon as possible.” The event, entitled “The Body and the Present,” will run from March 16 to March 16.\n\n\nThe National Museum of Scotland announced today that Jonathan Pryce has been appointed as its next director and chief curator. He succeeds Paul Mpagi Sepuya, who has led the institution for fifteen years and is currently the director of the Natural History Museum at the University of Exeter and the Museum of Flight.“We are extremely pleased with the appointment of Jonathan, who has been instrumental in developing the museum’s reputation as one of the leading places in the world for the exhibition of early twentieth-century art, and who has demonstrated a distinguished and enduring career as a curator, scholar, and educator,” said Neil MacGregor, director. Jonathan has been a curator at the National Museum of Scotland since 2001. He was elected director in 2004. During his tenure, he helped the institution gain its current location in the National Museum, and he oversaw the acquisition of several huge works, including the Museum of Contemporary Art (MoCA), London; the exhibition “Out of Time,” featuring paintings by Robert Irwin and Frank Gehry", "The next Biennial should take place in the United States in 2020. For Silvestre, the art world is \"re-creating the future with a fresh perspective.”\n\n\nThe Autobiennial of Modern Art (BAM) in New York has updated its bylaws and mission statement to reflect the 2017 revamp of the Whitney Museum of American Art, which aims to create an inclusive, interdisciplinary platform for contemporary art. The revisions were made after BAM president Edward DeMarche and director Anne Griffith-Williams met with the artists whose works are on display in the new biennial, and were made in conjunction with the exhibition “On Being and the Photobiennial” at the Whitney Museum of American Art (MoA).Much of the work in the show, which was curated by Charles Raynal and premiered at the Biennial of American Art in 2016, will be different from the works featured in the current exhibition, “Billie Jean: Cleaning.”“We wanted to create a show that wasn’t about presenting a collection of what we call ‘museum pieces’ but about using the term to describe the totality of work,” DeMarche said in a statement.", "The next Biennial should take place at the new site in 2019.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, California, has appointed Joan Jonas as its next president and CEO. Jonas was appointed director of the Art Institute of Chicago (AIC) in Chicago, Illinois, in 2011, and assumed the post in January 2013. She succeeds Roger Endre, who has helmed the museum for nearly twenty years, and will begin her tenure in January 2020.“Joan was an exceptional leader at the Art Institute of Chicago and across the country,” said Marc Glimcher, AIC’s CEO and chairman. “Her tenacity, intelligence, and dedication to improving the museum’s collection and collection experiences have been immeasurable, and she has been instrumental in elevating the museum’s profile. We are grateful to her for her leadership, her vision, and her enduring talent.”In her new role, Jonas will oversee the museum’s acquisition program, expand its curatorial department, and develop programming to support contemporary art and the arts. She will also oversee strategic partnerships with local, state, and federal governments and will help shape the institution’s mission.Comment", "The next Biennial should address the current critical challenges posed by the pandemic, including the need for international coordination, the political will to address poverty, and the capacity of local and regional leaderships to deliver on climate justice. It should also consider how art can play a transformative role in reintegrating people back into the local communities they left behind and reconnecting communities through art.”The 2020 edition of the biennial will be held at the Palazzo Grassi in Venice and will comprise forty individual exhibitions as well as a series of performances and performances-based activities that will be organized in conjunction with the theme “Relic Art: The Censorship of Spirit,” which will receive a concert by the French artist and composer Edwidge Danticat. The works in the exhibition will be curated by Anselm Kieferhoff, the director of the Kassel-based institution KASTAK, and will be presented by the Danish sculptor Lars-Erik Nygaard and the Chilean painter Jovana Paz.“Nimbus’s work taps into the question of what it means to be art,” Kohn said in a statement. “The work by Danticat, Nygaard,", "The next Biennial should be held in July 2020 and will thus miss the deadline for the exhibition. The project will now be taken up by the President of the Republic of Moldova and the Secretary of Culture. The full list of participating artists is as follows:Lisea Bujak-Zavodno (The Past)Marianne Bénédria (The Past) Jules Bianco (The Past)Alexandre Boublanc (The Past)Gertrude Birnbaum (The Past)Samantha Bromley (The Past)Catherine Bone (The Past)Xavier Boisjoly (The Future)Boris Brink (The Future)Katerina Boivin (The Future)Eric Bozeman (The Future)Lydia B. (The Future)Jean-Jacques Cartier (The Future)Terence Clougher (The Future)Martin Clough (The Future)Hans Cloutier (The Future)Hermann Corneliss (The Future)Melanie Gass (The Future)Alexandra Galani (The Past)Pilar Galanzani (The Past)James Gallagher (The Past)Colin Gawthrop (The Past)Christopher Michael Gallagher (", "The next Biennial should focus on how art and bodies shape and transcend the modern world. “The artists and designers who shape and transcend the modern world are as much a part of our lives today as the people who create it, and we aspire to see their work reflected in the upcoming exhibition,” said Theodora Agulila, director of the Jarry Art Museum.\n\n\nThe Vienna Biennale has announced that it will award $1.1 million to twenty-six artists and organizations for their creative works made in the city of Vienna. The project, which will examine themes of light, color, and form in a collaborative way, will include presentations of work by artists such as Lisette Gobbi, Adrian Ghent, Jochen Remiz, and Wolfgang Schlegel, as well as a retrospective of the work of the late Czech painter Viktor and Petra Ghebener.Vladimir and Petra Ghebener. Courtesy of the Ghebener-Gobi Foundation. \n\nThe Turner Prize, which honors excellence in art, has awarded $5.5 million to the artist-run nonprofit Gallery For Art, which works in partnership with artists and is based in New York. The organization is the", "The next Biennial should be held in the fall of 2021. “We welcome Artsy to the Beijing Art and Design Biennials, and look forward to their collaboration with us,” said Natasha Glimcher, director of the Art Institute of Chicago, to the Art Newspaper.The next Biennial will be held at the same time the Chinese town of Dongcheng, in the Guangdong province of Hebei, China, will host a new exhibition of local art. The exhibition will take up themes such as migration and identity and will draw from the indigenous art of the region.Dongcheng, which was founded in the 1950s by a group of local businessmen, is planning to create an arts hub as part of a renaming project for its adjacent city of Dalian. The mayor of Dongcheng, Zhang Yaxuan, proposed the region’s first arts center in a city planning document published by the city council of Beijing in November 2018. The city council approved the project on March 28.As part of its efforts to revitalize the area around the city, the city will soon be home to a new pedestrian mall. The project is part of a broader strategy to modernize the capital, including the construction of", "The next Biennial should be a celebration of our rich history with a comprehensive exhibition of the work of the past twenty years. The theme should focus on our changing relationship with the past and on our place as a world community.”\n\n\nThe Museum of Contemporary Art (MoCA), London, which filed for bankruptcy protection on Tuesday, will continue to operate as scheduled and hope to raise the money to reopen with new shows by artists and organizations that have not yet agreed to reschedule their events, the museum’s current director, Richard Armstrong, said. While the bankruptcy filing revealed that MoCA’s financial woes were not over, Armstrong said that the institution is not expecting a major loss of income in the foreseeable future.In a statement, Armstrong said: “We are actively considering all options and are confident that we will be able to make a successful return to the financial health of MoCA and our staff. But as we have said many times before, our primary focus now is on the future of the museum and the collection. That’s what we have been working towards all along and it is what we will continue to work on. We hope the board members and staff of MoCA and the wider arts community will support us in this", "The next Biennial should be held in 2021, the date of the last iteration of the event.\n\nThe Canadian Centre for Contemporary Art (CCCA) in Toronto is planning to expand its footprint, relocating a four-hundred-and-thre’s-long, fifty-one-thousand-square-foot space on the ground floor of the existing Tudor Towne Centre. The five-thousand-piece space will be inaugurated by a solo exhibition of work by artist and activist Elizabeth A. Scott, who will participate in the first exhibition, “The Language of Heroes: Contemporary Art in Honor of Elizabeth A. Scott” at the contemporary art museum. “The future of our city and our city’s art is at stake, and we’re going to do everything we can to make sure this happens,” said George Mehta, the museum’s director. Chris Spiller, the CCCA’s current president and CEO, said: “Our artists, our staff and our board of trustees are collectively committed to ensuring the future of the Tudor Towne Centre. We’re not going to let this opportunity pass us by.”\n\n", "The next Biennial should be in 2021, in Helsinki. Announced in March 2018, the exhibition will feature works by 40 new artists from the region and will take place at the nearly two hundred-year old museum from April 21 to April 24, 2021. For architects, the theme of the exhibition is “ETERNAL CONNECTIVITY” and the work of the artist will be dedicated to the concept. Remarking on the work so far, Artforum editor-in-chief David Goldblatt said: “The exhibition’s tenacity to make sense of the interplay of physical and spiritual worlds is a powerful statement of the interdisciplinary spirit.”\n\n\nThe European Space Art Museum (ESAM) in Munich has received a gift of more than two hundred works of art from the British artist Christina Benmarke. The museum was gifted a selection of early works by Benmarke as part of a series of collaborative projects with senior curator, curator, and collector Richard H. Zink. Benmarke’s first gift, a selection of works by the Gaslight Anthem and Gaslight II, was added to the museum’s collection in 2017. The work, which is currently on display in", "The next Biennial should be held next April, and the Times will announce the dates and locations soon thereafter.\n\n\nThe Museum of Contemporary Art (MoCA) in the City of Angels, California, has released guidelines for its new charter and taxonomy, which were drafted in consultation with the city of Los Angeles and Los Angeles County.“The new charter addresses the museum’s role as a ‘one-stop-shop’ for all things contemporary art,” said Ken Calero, director of the museum. “We believe the new taxonomy offers an opportunity to shape an exhibition that is more thoughtful, relevant, and accessible to all.”The institution also outlined the museum’s philosophy of presenting new art in a way that is “responsive to our community” and that engages with issues of race, class, and gender. The changes, which were made in collaboration with the city of Los Angeles and the Los Angeles County Board of Supervisors, include a new title and an updated website, which were released on March 31. The museum plans to open its new museum in 2020 and anticipates that it will begin hosting the annual event in April. The new guidelines, which were drafted by MoCA staff and approved", "The next Biennial should be held at the Institut National de la Proyecto in Madrid in 2021.\n\n\nThe Bauhaus in Hamburg has postponed the upcoming edition of its annual exhibition in an attempt to address the coronavirus outbreak in Europe. Organizers of the exhibition, which is currently on view until October 29, have announced that it will now be held in March 2021. The move, which was made in order to protect the health of the participating artists, has sparked outrage from some activists who believe it is censorship.Organized by the Bauhaus Foundation, the event will now take place in April 2021 and will be hosted by the Institute for Contemporary Art and Design in Berlin. The organizers are urging individuals to remain vigilant for the virus and to continue to report suspicious behavior online. With the pandemic now in its third month, the number of cases nationwide has risen to 5,098 and the death toll has risen to 153. Fears over the virus have been exacerbated by the coronavirus in China, where hundreds have died of the virus in the last two weeks, as well as in Hong Kong, where the number of people infected has more than quadrupled since the first case was reported on December 29.\n\n\nThe", "The next Biennial should be held in 2020. \n\n\nThe Asia Art Research Center (AARC) in Singapore announced that it will offer a free, two-day residency program to artists working in the Southeast Asian art and design world in 2020. The initiative was initiated by the National Arts and Culture Council (NAC) in response to the region’s ongoing crisis. The program will focus on the emerging standards and practices of Southeast Asian artists and will invite artists from seven AARCs (Adelaide, Beijing, Kuala Lumpur, New Delhi, Shanghai, and Tokyo) to campus. The participants will be given a year of curating and will be expected to help shape the program by sharing their experiences and recommendations.AARC president and CEO Haroon Mirza said: “We are delighted to collaborate with the AARC, the National Arts and Culture Council, and the National Gallery in Singapore to produce a free, two-day residency program for emerging artists. It will be an incredible opportunity for young and established Southeast Asian artists to explore new and exciting experiences. We hope that the program will encourage them to think of AARC as a platform to develop their creative practice and develop their careers across Australia and the wider world.”\n\n\n", "The next Biennial should be held in 2020. \n\n\nThe Kunsthalle Basel, Switzerland—where art, design, and design-related exhibitions are being organized across the globe—has announced that it will reopen as soon as the coronavirus is contained, though it will likely remain closed until at least the second phase, which will consist of a series of exhibitions and events featuring works by artists and small-scale architects, in the coming months.The Danish company Gryd was awarded the contract to host the new Global Biennial at the Austrian city of Lewes, which is located on the coast and comprises of five pavilions that were completed in 2016 and are scheduled to open in the coming months. The pavilion is being built by the Danish–based firm Koons. The pavilion is being financed by Koons, Lars-Otto Bächli, the Koenig-Fujimoto Foundation, and the University of Copenhagen.According to the New York Times, the first phase of the exhibition will be held in January 2020 and will feature more than 3,500 works and will feature multimedia programming in order to draw in as many interests as possible. The second phase of the exhibition, which will be held in March 2020, will feature", "The next Biennial should focus on how to sustain life on Earth through cutting-edge science and technology; how to develop scientific and technological solutions to the challenges of climate change; and how to translate cutting-edge science and technologies into practical solutions to challenges such as pollution and hunger.”The biennial will take up themes such as the meaning of art, the power of the environment, and the relationship between art and science, as well as the relationship between art and politics and the geopolitics of art. It will also debut the first-ever Biennial of Biotechnology to be held in the city.\n\n\nA new book by the Austrian-born, New York–based artist Wolfgang Lügenberg, who specializes in painting and sculpture, is to be published next month by Haus der Kunst. Titled “Amerikanerische Übersetzung,” the book will take up themes of migration, history, and the future and will be published by Haus der Kunst. Lügenberg was born in Vienna in 1966 and, since the 1970s, has lived and worked in Vienna.Haus der Kunst will be publishing the book in tandem with the exhibition “Eternal Los Angeles: Art and the City", "The next Biennial should be held in 2020, and the fourth in 2021.  The festival will have an equal number of artists represented by the museum as in the past, but will focus on “intellectual production,” according to Artnet. The exhibition will be organized in cooperation with the artist-run and artist-led organizations Atlantico and Artatel and will mark the museum’s reinstallation of the collection in 2016.The museum’s 2015 Biennial brought together artists such as Alex Katz, Sixto Cortazar, Lebanon Saar, and Fatima Zuker, and was attended by more than 115,000 people. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to move the First Unitarian Church in Southern California—a former Jewish community center located on the corner of Broadway and Wilshire Boulevard in Koreatown—from its current home on the same street as the museum. The church has been absent from the institution’s schedule since 2010, when it was still housed in the same building as the MoCA, and now its future is in jeopardy.“We are facing a difficult decision regarding the future of the", "The next Biennial should be held at Montréal in December 2019.\n\n\nThe Royal College of Art (RCA) in London, which is currently closed until at least February 8, has received a gift of ninety-six works by eighty-six artists from the collections of the Metropolitan Museum of Art and the Tate. The gifts include works by artists such as Ernst and Henrik Von Stroheim, the first to use the term 'art', and William Kentridge, the first to collect a collection of works of art.“The museum is incredibly fortunate to be able to present these works to the public,” Roger Eames, director of the RCA, told the Art Newspaper. “They represent a unique and compelling range of work.”According to a press release, the museum will use the works in conjunction with an exhibition of new works by forty-eight artists to examine “the evolution of art and its relationship to urban life.” The exhibition, “Human Action,” will feature forty works by seventy-three artists and will run through April 29. The artists chosen for the exhibition include Hans-Ulrich Obrist, Franz Kline, Joachim Oehler, Erich von Dä", "The next Biennial should be held in 2020.”\n\n\nThe Museum of Modern Art (MoMA) in New York has launched a new digital platform that will allow visitors to view its collections online. The platform, dubbed the Museum Online Viewing Rooms, will launch with the opening of “The Museum’s Collections,” a new exhibition organized by the museum. “The Museum’s Collections,” is a diverse collection that comprises works by artists such as Claude Monet, David H. Kahlo, and Paul Gauguin, as well as shorter works by contemporary artists that have yet to be publicly exhibited. It will also feature new works by contemporary artists and new works by artists whose work was displayed in the 2013 Whitney Biennial, as well as work from the Henri Matisse and the Musée d’Arles.“We are thrilled to have the opportunity to present this program,” said Henri Peillon, the Biennial’s president. “It is a task that has eluded us for twenty years, and one that we believe will once again challenge us to think collectively, to reimagine and to think differently, as art historians and curators of art history.”", "The next Biennial should be held in 2021, with the announcement of a new project planned for 2020. A new exhibition dedicated to Afro-Cuban artists is also planned.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Rachel Brown as its new curator of African art. Brown currently serves as the curator of African art at the museum, which is currently undergoing a $1 billion expansion project that aims to increase the museum’s footprint by adding 1,000 square feet of exhibition space and by adding new programs.“Rachel brings an exciting perspective to the Guggenheim as she has spent the last five years working to expand our collection and make the Guggenheim a more dynamic and compelling experience for visitors to the institution,” said Guggenheim director Christopher Reeves. “Rachel’s work will strengthen the Guggenheim’s relationship with a new generation of artists and will advance our understanding of the relationship between Africa and art. We are looking forward to working with Rachel and her team in developing the next generation of the Guggenheim’s collection.”Brown, who succeeds Leslie Salzmann, will begin her new role in January 2021.\n\n\nThe Y", "The next Biennial should be held in August of 2020. \n\n\nThe New York City Department of Cultural Affairs (DCLA) is launching an official campaign to promote and preserve the city’s cultural heritage through the sale of works and artifacts that are in disrepair or in poor condition. The initiative aims to address the city’s $6.3 billion budget deficit by providing grants to small and mid-size arts organizations. The $500,000 campaign is part of a larger $5.6 billion overhaul of the city’s antiquities and historic sites plan that includes the demolition of two historic African American churches, the first in Charleston, South Carolina, and the second in Harlem, New York.The decision to push forward with construction of the First African American Museum in the City of New York came after Mayor Bill de Blasio announced in January that he would divert $1.2 billion from the fiscal cliff deal to protect cultural institutions. The Mayor also pledged to redirect $500 million from the state’s general fund to protect cultural institutions.The DCLA’s cultural heritage preservation guidelines state that while the funding may be available for some organizations, organizations must demonstrate a direct and immediate need for", "The next Biennial should be six months away, and will offer a stage for three artists to present short works in its entirety. “Our vision is to create a space for the art of southern New Orleans to travel to other territories,” said organizer and artist Martha Incognito. “It’s a long-term project, and it’s a project that will take time.”Born in New Orleans in 1946, Incognito first moved to New York City in the 1970s when her father, the late New Orleans-based artist Edward Incognito, passed away. The artist continued her education in the city, studying at the Museum of Modern Art, the Bronx, and the Metropolitan Museum of Art before eventually moving to Laundromat Gallery in New Orleans, where she created works such as “Spear of the Mediterranean” (1995), for which she worked in a prelude to her exhibition “Live from Laundromat: The Biennial” (1996). After the exhibition closed in the early summer of 1998, she relocated to Paris. In the 2000s, she traveled to Morocco, Egypt, and Sudan; lived in Paris, New York, and London; and worked in Los", "The next Biennial should be held in 2020. The exhibition will come to the museum after closing on March 23, 2020.PTI Hong Kong has released the 2019 edition schedule. The event will now take place four times a year: March 4–March 9, March 11–March 14, and March 19–March 22.  The 2019 edition included two new works and featured si·nes, and it also featured work by forty-two artists. The exhibition was organized by Gallery Triennale Hong Kong, which was cofounded by Joo Hyun Kim; Fritz Schubert; Lewis Jackson; Andrea Antoni, the director of the Barcelona Biennial; and Phyllis Arruda, the director of the Los Angeles Biennial. The new event’s opening will be on March 4, 2020 at the Royal Institute of Art.  The 2019 edition was held at the Hong Kong Biennale Center for Contemporary Art, Hong Kong, the Hong Kong Museum, Hong Kong, the Hong Kong Art Museum, Hong Kong, and the Hong Kong Contemporary Art Museum. The 2019 biennial was held at the Art Museum Hong Kong.\n\nThe British Museum (BMI", "The next Biennial should be held in 2021.\n\n\nThe Museum of the African Diaspora (MAD) in Atlanta has appointed Olafur Eliassen as its new executive director. Eliassen comes to the museum from the Museum of Fine Arts, Boston, where he has served as the deputy director of curatorial affairs and chief curator since February 2019. He succeeds Elizabeth Brown, who retired in March 2019 after seventeen years at the helm of MAD in December 2019.“We are delighted to welcome Olafur to the museum,” said Sean Parnell, director of the institution. “He has been instrumental in developing the museum’s collection and improving on-site programming in recent years, and is passionate about the art of African diaspora art. Our mission at MAD is to continue to offer unique opportunities for audiences to connect with the art of Africa through the museum’s collection and exhibitions, and to expand our collection into a center for research and scholarship.”Previously, Eliassen served as the founding director of the Detroit Institute of Arts’ art history program, where he helmed the museum’s collection and exhibitions for more than fourteen years. He also served as the interim director of the", "The next Biennial should be held in 2021.\n\n\nThe Central Library of Art in New York has appointed Anna Cassaro as the next director of its curatorial programs. She succeeds Mark B. Smith, who stepped down in April 2019 to become director of the Metropolitan Museum of Art. Cassaro previously served as the director of the Brooklyn Museum, where she helmed the museum for five years, and as assistant director of curatorial affairs at the Institute of Contemporary Art, Los Angeles.“I’m thrilled to welcome Anna to the Central Library of Art,” said head librarian Sondra Pagels. “Her deep experience and commitment to curating collections and exhibiting contemporary art will be a great asset to the library as we continue to present cutting-edge contemporary art in our collection exhibitions and collections.”Cassaro’s first major project as director of the Metropolitan Museum of Art will be “Orient: The Experience of Public Space”—a survey of the scientific study of public space—which will open on September 23. The show, which will examine the relationship between art and cultural performance and its relationship to our bodies, will follow a tour of the museum.“Orient’s ambitious curatorial", "The next Biennial should also consider the contributions of different artists and activists to the movement for social justice and inclusion. “The selection of a champion of cultural diversity was also a reflection of the diverse and urgent histories of the different continents,” said Loïc-Ali. The new exhibition will focus on “New York as a city of immigrants,” a theme explored in the exhibition “Art and the Body: Art and the Body” (2015–16), curated by Alexander Calder.Loïc-Ali noted that, despite the exhibition’s focus on the body, the exhibition’s audience was warmly received by the actors represented in the show: Michael Massey, Drew Peterson, Jonathan Paul, and Misha Collins.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a lukewarm $1.65 million donation from the Andrew W. Mellon Foundation in support of its $10 million expansion campaign. The gift was part of a multiyear grant program, launched in 2016, that was overseen by Jane Russell, LACMA’s director and CEO, and managed by LACMA’s board and staff.�", "The next Biennial should examine the ways in which artists and their projects are sometimes constrained by cultural and social norms and the ways in which these constraints can shape and alter their practices. \n\n\nThe Greater Cleveland Art Museum (GCAM) in Ohio is planning a massive reorganization that will involve the elimination of more than three hundred positions and a restructuring that could result in layoffs and furloughs. While the museum is still working through the anticipated losses from the restructuring, chief executive officer Diana Trussell said that the institution will likely be forced to lay off 60 percent of its staff and furlough another 40 percent of its employees in order to balance the budget. The restructuring, which was first reported by Artnews, will include the elimination of more than one hundred positions and is estimated to cost the museum $8 million a month.“[The restructuring] is a culmination of several years of thought and planning, leading to the best possible outcome,” Trussell said at a press conference. “We’re not going to have the massive impact that we’ve had on other institutions in the city, but we’re going to start by watching the people who work for us carefully and making sure that they understand the", "The next Biennial should be secure for the 2020–2021 season and is currently on track to re-open in 2021.\n\n\nIn an unprecedented development, the Museum of Modern Art (MoMA) in New York has announced that it is preparing to welcome visitors back to the institution for a second year. The announcement follows a year of lockdown in the institution; a series of damaging cyberattacks on the museum and its collection, and the loss of more than six hundred works, most of which were on display when the attacks were launched; and a ten-month campaign to restore and organize the collection.In a statement issued by MoMA on Tuesday, the museum said that it is now confident that it can reopen, and that it is working with the curators of the exhibition “Toccarra and the Birds” to improve its online experience. It also said that it has received much interest from visitors for its first-ever biennial in the West, which is titled “This Is Not an Art Show,” and that it is “evaluating the possibility of organizing future events in partnership with other museums.”MoMA has also revised its original location for the exhibition “Toccarra and the Birds” to", "The next Biennial should inaugurate the exhibition of work by the Dadaists in protest of the upcoming exhibition “Matisse at the Table.”The exhibition, which was first held in the Neue Nationalgalerie in Vienna in 1966, will take place at the Kunsthalle Basel in Basel from January 6 to January 7, 2020. The exhibition will also include the first public performances of works by the Dutch artist and director Beppe Palma Rodotti and the Alenço-Brazilian artist Filipe Toledo.The commission for the exhibition was first presented by the artist and activist Hartwig Fischer in 1995. Fischer, who is now imprisoned in Germany for his role in the 1989 bombing of a São Paulo art museum, was heavily criticized for participating in the protest against the exhibition, which featured works from the Danish artist Barbara Gertrude's show “Matisse at the Table” (also presented in 2001). The artist was also forced to temporarily close his studio and move to the United States.Since the artists are demanding the immediate restoration of the exhibition, which was canceled in protest of the Biennial’s cancellation of a show by artist-designed works by Pablo Picasso and the Spanish architect Santiago Paz", "The next Biennial should take place in Beijing in 2022 and will comprise fifty-three artists. The exhibition will also include a new collection of works by contemporary artists, a biennial of contemporary art and the central theme of the exhibition, the relationship between the artist and the source of their artistic inspiration. The biennial will be presented by the Center for Contemporary Arts Beijing. The 2017 edition of the festival, titled “The Future Is Present,” featured work by fifty artists, including Paris Leclerc, Cécile B. Truffaut, Pierre-Auguste Renoir, Andre Glimcher, and Ed Ruscha. The exhibition will also introduce the new biennial exhibition “Continental” and will include a discussion with the artist and collector Kengo Takahashi. The exhibition is slated to open in the summer of 2022.\n\n\nThe Los Angeles County Museum of Art (LACMA) has announced that it will take the first steps in implementing a universal basic income (UBI) by introducing a universal day-care center and a child care center into its collection, each with their own separate galleries and their own staff salaries. The center will provide direct support to families, while the child care center will", "The next Biennial should be held in 2021.\n\n\nThe Carnegie Museum of Art in Pittsburgh has established three new initiatives to support the preservation and dissemination of art and ideas: the Schlesinger/Carnegie Art Museum (CAM), the Carnegie Research Center for Art in the Public Interest (CREP), and the Pittsburgh Art Museum (PAM).“These initiatives will help us to understand and address the challenges posed by digital technologies,” said Amelia Folt, director of the CAM. “We are excited to help our community shape future understanding and appreciation through new research and creative expression.”PAM, which was founded with a $40 million gift from John and Doris Previn, is launching a new online platform that will allow members of the public to connect with the museum. The platform will feature extensive online exhibitions, an online library, and other special exhibitions. The first show will be an exploration of the history of metal sculpture and will be presented by curator and scholar John Mayer. The exhibition will be followed by “Art and the Modern Mind: From the Eternal to the Modern,” and will run from March 16 to March 20. The second show will be a survey of the twentieth century and will be hosted by Sarah Mont", "The next Biennial should take place in the city from April 15 to April 17, 2019. The twenty-fifth Ticino will take place in the city from March 25 to April 27, 2020. “In the past few months, we have been working towards an interim arrangement that would postpone the exhibition by several months and could have addressed the exhibition’s long-term future,” said Stefano Pessina, the director of the Museo Fondazione Cinéma. Commenting on the negotiations, Pessina said: “I am thrilled that the project is coming to a close with the conclusion of the exhibition. The exhibition was the cornerstone of our programme for the last three years and to your magnificent gallery and to the amazing artists who have participated in making this exhibition possible, the work of the exhibition is treasured and treasured the work of the artists who participated. Maria Bocconi’s photographic exhibition, ‘Forma Design’s Fallacy,’ was an unforgettable combination of brilliant experimentation and a personal commitment to a new way of making art.  The artistic project of the Biennial was to organize a series of exhibitions that would challenge the preconceived notions", "The next Biennial should be held in the autumn of 2020. The exhibition will include works by new and established artists, from the Biennial of the Arts of the Americas (BPA), Mexico City, to Petra Federico, Philadelphia. The inaugural exhibition will open on September 28 and run through March 26, 2021.\n\n\nThe National Gallery of Art in Washington, DC, has received a $1.5 million donation from the National Council on the Arts (NCA), which represents the interests of Congress on behalf of the Smithsonian, in support of its proposed expansion. The donation follows the inauguration of the NCA’s charter amendment, which allows for the construction of new galleries and the refurbishment of existing ones. The amendment was passed by the NCA’s board and confirmed by the Senate on December 10.“We are very excited to welcome the NCA to the Smithsonian,” said NCA board chair Kate Lee. “This is a transformative moment for America’s cultural heritage system as we prepare to welcome the National Museum of African Art and the Louvre into its collection and to celebrate over one hundred years of policy and direction under the NCA’s leadership. NCA has been a strong advocate for the NC", "The next Biennial should include “The Technologically Shifted Art of the 1960s: Polish and German Art in the Autobiography of Zurbst-Stiftung Carl Dietrich Müntiger,” which will take place in the former Soviet city of Krefeld. The exhibition will focus on the work of twenty-six German-born artists who were active in the late 1950s and early 1960s. The artists are Hans-Josef Kahn, Ulrike Leichhardt, Arno Mayer, Wolfgang Pfeifer, Wolfgang Schreuder, Ulla and Ulrich Teller, and Wolfgang Strache.The full list of participating artists is as follows:Martin Buber, The Technological Shifting Art of the 1960s: Five Years of Performance Art in Europe, London: BAMM, 2019. Black Cat Theater at the London Biennial, 2019.Martin Buber, The Technological Shifting Art of the 1960s: Takeshi Nara, Tokyo: BAMM, 2019. Martin Buber, The Technological Shifting Art of the 1960s: Alberto Moro, Buenos Aires: BAMM, 2019. Martin Buber, The Technological Shifting Art of the", "The next Biennial should be held in the spring of 2021. \n\n\nThe National Museum of Fine Arts (NMFA) in Memphis, Tennessee, has added fifteen new artists to its roster this year. Among the artists who will be featured in the upcoming exhibition “Art as a Tool,” which will run from September 19 to September 23, 2020, are Morgan Fox, John Jackson Pollock, and Nena Potter. The exhibition will mark the first time that the institution has presented an exhibition devoted to “art’s role in helping to alter the course of American art.”The museum also announced that it has received a $4 million donation from the Coles Foundation. The gift will help fund the design of a new board of trustees that will oversee the museum’s artistic and educational programs and will oversee the institution’s collection, exhibitions, and conservation. The donation comes at a pivotal moment for the institution as it prepares for the opening of “Art as a Tool: The National Museum of Fine Arts” on October 29.The National Gallery of Art in Washington, DC, received a $3 million gift from the Gates Foundation earlier this month. The gift will provide funding for the design and", "The next Biennial should be ready for the 2020 edition. “The biennial is a collective project of the entire group of artists, it is our mission to carry it out, to present it and to make it,” Judith Altmann, director of the Flemish Academy of Fine Arts, said after the exhibition. “It is our responsibility to create a new space for great art, and for the artists from the future to participate in the future. The exhibition of the new works is the most important point of the exhibition, and we have a responsibility to organize this exhibition appropriately.”The exhibition of the new works includes works by:Flemish artist Lise Vogel (1939–1988) Ladies and Gentlemen (The Feminine and the Man)National Gallery of Modern Art (1995–2000)The Walker Art Center (2014–present) [collection’s]Guadalajara Project, Mexico City (2018–2019) [collection’s]El Salvador (2018–2019) [collection’s]Hauser & Mauritz, New York (2018) [collection’s] The gallery will present a new production of the work by one of", "The next Biennial should be held in 2020 and the first in 2022. \n\n\n\n\n\nLeon Black, director of the Metropolitan Museum of Art, has edited a book on the life and work of Frank Stella, an American painter and sculptor whose large-scale sculptures, including The Solitary At Home, 1971, which depicts a small Slovenian family surrounded by images of their home and its gardens, were commissioned by Black and were exhibited at the Museum of Modern Art in New York in 2005.Born in New York City in 1939, the artist has had a long and distinguished career. A pioneer of American abstract art, he also became a major influence on Anton Kern, David Ciner, and Frank Stella, whose works have been collected by the Met, the Getty, and other museums. As a young artist, Black worked on his first composition for his first studio, a performance for his first museum, and a film for his first exhibition. In the 1980s, he contributed art to the television series The Sopranos. Black also directed the Museum of Modern Art in Los Angeles and directed the Metropolitan Museum of Art in New York.\n\n\nThe Adirondack Art Museum in Amherst, Massachusetts, has announced that it is expanding its", "The next Biennial should be held in 2020.\n\n\nArtist-run organizing platforms, including New Pasión and Artists’ Organizing Committee (Córdoba), have been attempting to address the labor shortage in Chile\u0097Arimosa and his colleagues have been working with various media and community groups for months to raise awareness about the problem and to organize exhibitions and other events. But because of a lack of funds and political will, most of these efforts have been unsuccessful, and in May the Art Newspaper reported that as many as one hundred galleries may close their doors on March 15 as a result of the coronavirus.Although the pandemic has been a major setback for the country’s art and cultural sector, it has also had a significant positive impact on the Chilean economy. According to the New York Times, Chilean GDP grew by 2,068.3 percent in 2018\u0097only slightly worse than in 2017\u0097and in the first six months of 2019, the country was already expecting to post another $1.5 billion in revenue. In an attempt to counteract the economic fallout from the coronavirus, Chilean President Sebastian Pérez Molina announced on March 13 that he would suspend all public celebrations and", "The next Biennial should take place in 2023, and the exhibition should debut in 2021. \n\n\nThe George Brown Foundation has awarded a $50,000 grant to the creative and academic institutions of the University of Oxford in the UK. The grant, which came from the foundation after the Oxford Union for Arts (OUA), which is affiliated to the university, presented its research in the year 2020.“The grant recognises the significant contribution made by universities in the United Kingdom to the UK’s creative sector and Oxford Union for Arts to advance the field of contemporary art,” said Mark Brown, director of the Foundation. “The grant also recognises the impact that the OUA and Oxford Union for Arts have made in providing access to contemporary art for many of our students and scholars.”The grantees are Aberdeen University; the Museum of Contemporary Art Glasgow; the National Gallery London; and the National Poetry Library. The grantee will be announced in the autumn.\n\n\nThe Federação Brasileira da Curaçao (Brazilian Association of Curators), the country’s oldest and most prestigious museum organization, has released the list of eighty-four Brazilian writers and artists whose works have been acquired by", "The next Biennial should take place in the spring of 2022. The lock to host the event is being maintained by the institution, which is owned and managed by the family of the late founder of Verne Horne.  Other institutions that are currently experiencing some of the effects of the coronavirus are the Art Institute of Chicago, which has been closed since March 21, and the Museum of Fine Arts, Boston. The museum is currently closed until at least mid-August, and on Friday, the museum canceled its fourth edition, which was set to take place in July.The coronavirus outbreak has also impacted other arts and cultural institutions in the United States. According to the Art Newspaper, the Houston Museum of Art and the Los Angeles County Museum of Art have both announced that they are opening their doors on August 21.Houston’s public art is expected to be unveiled in the coming weeks, and on August 7, the Los Angeles County Museum of Art will release the first public artwork to take its place in the city. The LACMA retrospective, titled “Between the Sun and the Moon,” will be followed by public artworks at the Palazzo Scutari in Milan in November. The California Institute of Technology in", "The next Biennial should take place in the coming months.”\n\n\nThe Minneapolis Art Museum (MAM) has appointed David Nelson as its next director. Nelson, who has served at the institution for twenty-seven years, assumed his post on January 6, 2020.“Nelson’s leadership and vision for MAM have been exemplary over the past twenty years, and we are very pleased that he is returning to the institution for an eleventh-century reopening,” said director Kim Ross. “David’s appointment brings a new art-historical and research-oriented leadership, and we are confident that he will transform our museum into an essential destination for Minneapolis visitors and residents.”Prior to joining the museum in 2008, Nelson served as vice director of exhibitions for the inaugural edition of the Biennial, “Aladdin’s Cave,” which opened in New York in 2009 and ran until “The Basel Biennale: 1989 to 2018” in 2018. He also helped launch the Alberto K and Marian Katze Collection, which includes works by Kiki Smith, David Salle, and Hans Ulrich Schäfer, and established partnerships with local art dealers", "The next Biennial should come up in 2020. In the meantime, the museum is working on a new partnership with the National Gallery of Victoria, where the exhibition will be shown for six months after it closes, in order to prepare for the event in 2020.\n\n\nArtist-run shows are proving to be a force for social change. For decades, the Spring/Break Art Fair in New York City has been a model for the art world and a model for bringing works to the forefront of American culture. But this year, the fair experienced a major drop in attendance as people stayed home to protest the new $15 minimum wage and the War on Christmas. While the Fair is hoping to bounce back and re-open this weekend, its organizers are also facing backlash from artists and businesses in the art world, who are expressing concern for their organizations' financial health and the future of the shows.“We are deeply concerned about the state of our relationships with our vendors and exhibitors\u0097both individually and collectively.” “We are also acutely aware of the impact a lack of visitors has on our businesses, both directly and indirectly. ‎We have thought about how we might work with our galleries to make engaging with our audiences more challenging, but also how", "The next Biennial should be staged at the institute in 2022.A panel of experts comprising Professors Akiko Naito, Prof. Michael Roesler, Prof. Michio Karasawa, Prof. Stig-Peter Sødertød, and Prof. Wangechi Mutu, which was set up by the institution to advise on the installation of the new exhibition, was convened by the curator of the Biennial, Joachim Neugroschel.The panel of experts was led by Professors Neugroschel and Sødertød from the University of Cambridge, where they are both members of the department of art history; Sødertød is the author of Science Fiction: Art of the Contemporary Past (Blum & Poe, London, 2008); and Sødertød is the director of the Institute for Art History in Oslo.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has named its first African American curator, Mionte Yanez-Altshuler, as the next director of the institution. Yanez-Altshuler comes to the museum from the Pérez Art Museum, where she has served as curator of African American art", "The next Biennial should be on November 13–14. The biennial will be a contemporary re-creation of the ancient city of Ai, which was established by a group of wealthy Florentine artists in the early 1600s, and will address issues such as climate change, art and technology, and the integration of the body and the environment. Artist-in-residence João Silva, who is based in Miami Beach, told the Art Newspaper that the theme for the event will be “Humanity and the Environment,” a reference to climate change. “This is the moment, and I think the best way to see it is by staying in the city, seeing the sea and the sky in the city, and listening to the people who live here,” he said.\n\n\nThe Museum of Fine Arts (MFA) in Boston announced today that it has received a gift from a foundation dedicated to supporting artists and arts professionals in need—a gift that will make a significant contribution to supporting the museum’s groundbreaking Bechtel Prize–winning exhibition “Anastasia and Antonia: The Art of Painting and Sculpture” (2019).Established by art director and philanthropist Mark B. Be", "The next Biennial should be held in 2021 and will be the thirty-seventh in the United States. The 2020 edition will consist of approximately nineteen artists from the nineteen-eight countries and will take place at the Museo de Arte Contemporáneo in Madrid.Dubbed the 'Brianna, Johnson, and other Biennials,' the event will include lectures, workshops, and performances, as well as screenings of selected works by artists from the nineteen-eight countries and the United States. The inaugural edition, titled Luna, was staged by the Museum of Contemporary Art Chicago (MoCA) and ran from October 2, 2016 to February 15, 2019.After the museum announced the 2019 edition of the event, the organizers cited the Australian pavilionist, Mila Kunis, as having made a statement in favor of the institution’s cultural exchange program. Kunis, who is currently a member of Australia’s delegation to the United Nations, said that she hopes the program will be expanded to include other countries.\n\n\nNew York–based art collector Maren Beshara has been hired as the new CEO of the financial services firm Santander Bank Group. She succeeds Anne-Marie theoress, who", "The next Biennial should be held at the SculptureCenter in Santa Monica, California, next April, and the first exhibition in the new format should open in the spring of 2021. The conference will be hosted by the SculptureCenter, the Smithsonian American Art Museum, and the Los Angeles County Museum of Art in California.“The SculptureCenter’s new partnership with the Smithsonian American Art Museum and the Los Angeles County Museum of Art is a game changer for the museum and for the American art world,” said Elizabeth Raia, the director and CEO of the Smithsonian American Art Museum. “This new partnership has the potential to inspire and renew the audience for more than twenty years of award-winning American art. We are excited to see how these collaborations will engage with and redefine the relationship between the Smithsonian American Art Museum and the Los Angeles County Museum of Art.”The partnership between the Smithsonian and the LACMA Foundation was also announced, with the organization providing fifty years of public programming funding for the landmark museum in exchange for the endowing the SculptureCenter with its largest collection of works by African American artists in its history.This year’s event will be held at the SculptureCenter", "The next Biennial should be held in the spring of 2020.The next edition of the Art Basel Hong Kong will be held in March 2021.\n\n\nThe Museum of Contemporary Art (MCA) in Los Angeles will hold its next meeting as part of the fifty-fifth edition of Art Basel Hong Kong—the first event of its kind in the United States. The 2020 event will take place at the Venice Architecture Biennale in May. Announced last year, the 2020 edition of the MCA will draw from the theme “Elements of Life” . The panel of international artists who will be featured in the exhibition include Bibi Kawamura, China Muyang Phan, Liu Yansong, Shih Chien Yu, and Yigal Palani, as well as artists whose works have been exhibited at the museum in the past such as Sara Buono, Luisa Corina, and Juliette Seroussi. “The themes of the two biennials will create a strong sense of continuity across the years of the MCA’s collection, of the contemporary contemporary art in the Hong Kong region, and of contemporary art in the United States", "The next Biennial should be a big success.”\n\nAdvertisement\n\nA few years ago, Noguchi, the director of the Rema Hort Mann Center for the Arts at the University of California, Berkeley, commissioned a new exhibition for the museum to commemorate the centenary of the institution. The show, titled The Age of the Model, was staged at the center, which opened in 1932, and featured ninety-nine works by forty-seven artists. In 2016, the museum also celebrated its sixtieth anniversary.The following year, a show titled Laundromat, \"The Eventual Lesbian Experience,\" was staged at the center. The show was inspired by the institution’s own bathroom, where the gallery created a series of scenes from popular movies and television, including The Vagina Monologues, which originally aired on the Noguchi-CalArts in 2001.In the past decade, Noguchi has also collaborated with women artists. In 2018, she cofounded Noguchi-Lab with a group of women artists to address the gender gap in the museum’s collection. She also curated a show of work by luminaries Geraldine Daddario, Elle Sedgwick, and Alice Neel.", "The next Biennial should be held in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has received a $50,000 donation from the Michael Kors Foundation. The organization established the fund in 2018 as part of its commitment to supporting artists and small to mid-size arts institutions in Atlanta. The donation supports an exhibition marking the twenty-fifth anniversary of the Kors Foundation’s founding in the museum. Plate number eleven will feature work by twenty-five artists, including Claudia Benignano, Ben Affalter, and Max Hetzler. The exhibition will also introduce the MFA to the new Kors Collection, which comprises art and objects from the collection formerly housed at the Michael Kors Foundation, and will introduce the MFA to the Natalie Cahn Collection of American Art, and a new collection of art by artist and activist L.A. Reid.“The Kors Foundation is a central force in the history of American art, and we’re grateful to Michael for showing us this exhibition,” said MFA director and CEO Pamela Rorke. “The Langham Collection’s exhibition is a rare opportunity to see the Kors", "The next Biennial should be held in 2020, and the first in 2021.  \nBiennials: A Biennial is a series of events that are organized and staged in order to raise awareness, understanding, and understanding of the interconnections between people, places, and objects. The term biennial does not imply a fixed historical moment, but a series of discrete events or moments, and is used to include all biennial projects, regardless of their chronological order. The first biennial was held in the United States in 1968, and the first biennial was held in Australia in 1976. Prior to the invitation of the Museum of Contemporary Art (MoCA), Los Angeles, to host the first Biennial in London in 2001, the institution launched the inaugural London edition in 2016, and the event gained notoriety in the UK as a platform for the exhibition of work by artists such as Larry Achiampong, Michael Chikundai, and Andrea McCauley. The 2018 edition had about eight hundred works by twenty-eight artists\u0097the first Biennial to feature twelve artists was held in London in 2006. Both the 2017 and 2018 editions were attended by a majority of the artists invited\u0097the former by a mere three hundred and", "The next Biennial should be called \"The Art of Possible,” with a focus on the articulation of philosophy, history, and contingency, to address the question of how art has the potential to address, beyond the limits of the body, the environment, and the inconsequential.” Mía Mua, Artforum’s senior curator of Asian art, told Artnet that the theme—translated literally meaning: “the art of possible—” is “complex, multifar, and speculative, in the same way that a painting is complex and multifarious, or a drawing is multifarious.” The exhibition will reopen February 6.\n\n\nThe iconic Americanist Max Beckmann, who taught the art of painting at the University of California, Berkeley, died on December 31 at age eighty-four at his home in Los Angeles.Born in New York City in 1937, Beckmann first studied at the University of California, Los Angeles (UCLA), where he studied under Norman Rockwell and named the campus Velvet Room. He left the institution in 1947 to study at the Art Institute of Chicago (MAC), where he met and married college sweetheart Judith Sheets. They had five children before divorcing", "The next Biennial should be held in 2021. “The invitation to the next Biennial is a great honor,” said Yannick. “I want to thank all of you for being here and for being supportive of one of our artists—Nikolay and Sergei. We will continue to build on the foundation of the Biennial, and that of the whole city, with our artists.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to drastically reduce the museum’s footprint by remodeling the building in its north courtyard into an artist residence, with plans to reopen the space in the fall of 2021. The cultural institution previously announced that plans to remodel the building in 2019, but the renovation was only part of a larger expansion, which will include the construction of a new 10,000-square-foot building. The museum will now operate as three separate entities—the Contemporary, the National Gallery, and the Art Institute of Chicago—each with a staff of twenty-two.The new structures—which will boast new galleries, a library, a research library, and more spaces for exhibitions, educational activities, and programming—were designed by the firm Gensler, whose architecture", "The next Biennial should bring together the body and the living in a way made for the several, for the one, and for the many.”\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Helen Nicholson as its next president. She succeeds Catherine Costa, who stepped down in May 2019 to lead the Royal Academy of Arts in London, and will take up the post in April 2020.“As the first woman to head the ICA, Helen is well positioned to further the ICA’s long-term strategic goals of diversifying its portfolio and of working constructively with a wider range of artists and audiences,” said Kate Fowle, director of the ICA. “Her appointment represents an exciting moment for the ICA and the arts in general, as we look ahead to the next decade. Helen is a strong advocate for the ICA’s mission and who has worked tirelessly to strengthen the ICA’s connections and collection in recent years. The ICA is very much in touch with the heart and soul of the city, and I am confident she will continue to champion and achieve this mission in her new role.”Since her appointment, Nicholson has made numerous notable contributions to the I", "The next Biennial should begin as scheduled and include a selection of works that reflect on the themes of the exhibition. “The exhibition has been a platform for discussion and reflection on the themes of the exhibition,” said Ai Weiwei, chair of the Biennial’s commissioning committee and director of the Ai Weiwei Archive. In addition to the exhibition, the biennial and its director Wang Liren have created a digital version of the Biennial that will be accessible to the public. The exhibition will also feature new works by contemporary artists, as well as works by lesser-known artists such as Dorothea Rockburne, Anne-Sophie Aniston, Jean-Michel Basquiat, and Alighiero Bochereau.\n\n\nThe German city of Mainz, which imposed a temporary lockdown on itself on March 19 in an attempt to contain the coronavirus, has released a new set of guidelines for cities and towns as they try to contain the virus. According to the German daily Süddeutsche Zeitung, the information was released by city hall spokeswoman Ingrid Schlegel on March 21. “As soon as possible, the authorities must be able to quickly reach people and how they", "The next Biennial should be held in Hong Kong in 2021 and will launch at the Hong Kong Art Museum (Hualalai) in 2021.  The second will be held in the United States in 2022 and will be at the Commonwealth Club in New York in 2024.  The third, which will take place in the summer of 2022, will be held in the desert in the desert in the desert in the desert in the desert in the desert in the desert, in the desert in the desert, in the desert, in the desert, in the desert, in the desert, in the desert, in the desert, in the desert, in the desert, in the desert.  The final edition, which will take place by the end of the year, will be held in the desert in the desert in the desert. \n\n\nA jury in the United Kingdom has found the artist Mark Pincus guilty of involuntary manslaughter after he was found dead from injuries he suffered when he moved into a house he owned in Birstall, a town near the capital, on July 2, 2019, and died a few days later from his injuries, reports the Art Newspaper.Pincus was found guilty of two counts of involuntary manslaughter—one count of", "The next Biennial should take place in 2020 and the first will be in 2023.”George, who has been director of the Museum of Fine Arts, Boston since 2001, also serves as a senior curator at the Museum of Contemporary Art in Miami and as a member of the editorial advisory board for the Museum of Contemporary Art in Houston. He has previously worked as a curator and educator in the arts and in the humanities and is the cofounder of the journal Conversations on Art.Commenting on his appointment, George said: “I’m excited to be a part of the Boston creative ecosystem and to have the opportunity to develop new approaches to exhibitions and to engage with audiences in a manner that was simple and direct, while maintaining an original and engrossing sense of humor. It’s a singular mission that I’m eager to take on, with the mutual admiration of many colleagues at the Boston Art Museum and the Curator’s Guild.”\n\n\nThe Diller Scofidio + Renfro–designed museum in the southern Italian city of Reggio Emilia will reopen on February 2 after it was closed for twenty-four hours due to a spike in Covid-19 cases—more than 1", "The next Biennial should take place in 2020, and the following five years thereafter.\n\n\nThe Swiss-based company Diller Scofidio + Renfro has launched its fourth edition of the Diller Scofidio + Renfro DIGITAR, which will take place in December 2020. Presented by the organization’s partner Fiminco, the event will be hosted by the Los Angeles County Museum of Art (LACMA). “The Diller Scofidio + Renfro DIGITAR is a powerful way for the arts to become more accessible to everyone,” said Katherine Fay, director and chief curator of LACMA. “It allows the museum to showcase the work of the artists who are most affected by the pandemic and allows the museum to engage directly with their audiences. The series is an exciting opportunity to honor the diverse artists, thinkers, and artists who have made the most important contributions to the arts.”The inaugural event, “The Anti-Myth Book,” was curated by David J. Peterson of the University of California, Los Angeles, and is free for members and is open to the public. The show will include essays by twenty-four", "The next Biennial should be held in the fall.\n\n\nThe Metropolitan Museum of Art in New York has received a $1.6 million donation from the Ellison Foundation. The funding opportunity was created by a partnership between the museum and the Ellison family, whose wealth includes the corporate conglomerate defense contractors Raytheon and Raytheon Technical Solutions. The funds will allow the museum to create a new exhibition dedicated to the life and work of artist Phillip Johnson, who was an outspoken advocate for social justice and a prolific writer.Johnson was born in Chicago in 1943. His father was a coal miner and his mother was a homemaker. When he was six, Johnson left his hometown to study at the University of Pennsylvania, graduating in 1955 with a bachelor’s degree in public health. He went on to study at the University of Washington in Seattle, where he met his wife, Jane, and raised their two daughters, Tilda and John. Johnson later moved to Harlem and graduated from Columbia University in 1969. While there, he wrote extensively on racial justice and the environment, and on art and social justice. He also served as a contributing editor of Symbols of Resistance and Urban Crisis and produced several publications that argued for the literary and political importance of African American art. �", "The next Biennial should be held in 2019. “The Museum has always been centered on the artist’s work,” said Mark Wellman, director of the Institution. “The new partnership with the Museum of Contemporary Art will allow the Museum to better serve the city of New York by developing new artistic opportunities that reflect the breadth of contemporary culture. The unparalleled expertise of our staff will continue to shape the Museum and make it relevant to the public’s interests.”The new partnership agreement was made in the spring of 2018. The institution has been working with the New Museum since 1999. The original agreement—which is dated March 3, 2019 and is signed by the trustees of the museum—specified that the new museum would focus on the work of selected artists from the contemporary art world and would have the ability to present work by artists stated in the contract.The New Museum has also partnered with the National Museum of African Art in Washington, DC, to present five new exhibitions of work by forty-three artists. Among the works that will be presented are Taj Mahal, Feminine Code, 2017, Bye Bye Mrs. (For and by George Michael), and Glass Floors and Living Bedrooms", "The next Biennial should be held in the spring of 2022. The selection committee announced its decision to hold the exhibition in Dubai last month, and a date for the exhibition was set for November 19–November 21. While the biennial will return more than twenty-five artists to the United Arab Emirates (UAE), the artist-run, two-week event will be held in the Emirate’s cultural center of AlUla and will be open to the public from November 16–November 20. “It is a great honor and privilege to present my first exhibition in this new region of the world, and I look forward to the next with open arms,” AlUla architecture and design curator, Hamza AlUla, said in a statement. AlUla, who is based in New Delhi and Mumbai, previously curated exhibitions such as “On Modernism” (2019) at the Rashtriya Swayamsevak Sangh (RSS) in New Delhi and “The Punctuation of a Word,” (2018) at the BHU in Delhi.\n\n\nThe Museum of Modern Art (MoMA) in New York has long been accused of fostering an unhealthy obsession with", "The next Biennial should be in November 2020. \n\n\nPace Gallery in New York has received a gift of more than one hundred works by twenty-five artists who are currently in the exhibition “Feminine” as part of its twenty-fifth-annual “All Power to Women.” The gift includes works by artists such as Katja Mink, Angela Piquet, and Rachael Law, as well as new works by the artists whose works are featured in the exhibition.The works will be presented in the exhibition “Pace’s Artists’ Studio,” which is currently on view through November 7, at the Museum of Modern Art. The exhibition, which focuses on the work of contemporary artists, is curated by John Bogle.The exhibition also features the work of twenty-three women artists whose work was previously featured in the show: Kasper Koenig, Emily Dickinson, Wangechi Mutu, and Kyungra Kang. The exhibition is organized by the MIDWESTAKTER, the APPLIED ART PROCESSERS, and the PENNSYLVANIA COLLECTIONS, which are affiliated.\n\n\nThe Canadian Centre for Contemporary Art", "The next Biennial should be in 2021.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it has appointed Charles A. Olney, a professor of art history and curatorial studies at Columbia University, as the next dean of the school. He succeeds Leslie Sitwell, who has been a DCLA professor since 2001.“In taking on this position, Charles has positioned himself well beyond the typical tenure track,” said DCLA chair Karen McKean. “As we look to the future, with our art at the center, and as our work takes on the forms of exhibitions, concerts, and residencies, he brings a deep and compelling understanding of how the museum-as-party, the art-historian, and the art-maker can work together.”During his tenure at the school, Olney has taught courses in a variety of fields, including photography, film, and performance, and has organized research projects and exhibitions in support of the school as well as in support of various causes, including scholarships for undergraduate art students at the school. Prior to joining the school, Olney served as a Fulbright scholar-in-residence in New York from 2011 to 2012 and worked as a", "The next Biennial should take place in 2020, but it is unclear if the organizers will move the exhibition forward.According to the Art Newspaper, the Hirshhorn will break ground next month and will begin construction in the fall of 2021. Designed by Galerie Arnaud Laberge in collaboration with artist Alain Guiraud, the conceptual design for the museum encompasses a series of interconnected chambers, each of which will be suspended from above by a steel beam.“The Hirshhorn’s new pavilion, ‘Labyrinth,’ will offer a new way for visitors to experience the work of the Hirshhorn,” museum director Marc Glimcher said in a statement. “The design includes a series of interconnecting chambers that will bring together works from the Hirshhorn’s collection. The museum will also incorporate elements from PBS’s ‘Between Worlds” series, which explores the intertwining stories of art.”The Hirshhorn will also include a new work by artist and activist Aura Lissoni, “Habit,” which will depict an anthropological study of the Hirshhorn’s collection and will open in the fall of 2021. Lissoni", "The next Biennial should be held in 2020, and the 2019 edition in 2017. “It is our hope that the new arrangement will enable us to realise the full potential of the exhibition space,” said Laura Asplund, the Swedish curator of modern art. The Biennale, which was founded in 1980 and runs annually, will begin welcoming visitors in 2020. The new exhibition will be hosted by the Hirshhorn Museum and Sculpture Garden, and the Hirshhorn Radio and the Hirshhorn Museum and Sculpture Garden.Earlier this month, the Hirshhorn announced that it would receive $100,000 from the sale of an undisclosed sum of art. The announcement garnered attention for its timing, since the sale of works in the exhibition cycle coincided with the years of the 2016 US Presidential election and the Women’s March in March. However, the Hirshhorn’s announcement about its motivation for the sale of works was disputed by several individuals who criticized the museum for making the sale at a time when the museum was still considering whether to continue with its planned engagement with the public and for its lack of transparency about its decision. The Hirshhorn also hopes to continue selling works in the same way as", "The next Biennial should be held in 2022. The exhibition will be led by Herbert M. Griem. “The Biennial is an American institution, but we are not alone in this endeavor,” Griem said, adding that his team is inspired by the work of the Museum of Modern Art in New York and the Museum of Modern Art in LA, where Ridley Scott’s Fantasia series is held, and by the American Institute of Art in Berlin, which previously staged its first exhibition on the movements of the Civil War through the influence of Robert Rauschenberg.\n\n\nCurator Mary Steindl, who was named the winner of this year’s Turner Prize in November, has been commissioned to create an exhibition for the Turner Prize, which recognizes the work of the twentieth-century’s most influential female curators. Steindl will create a new exhibition that will draw from the exhibition catalogues of Melissa Benites, Alison Bechko, and Christina Hjortenberg.“Joan Crawford’s ‘Spaces of Meaning’ is a wonderful example of the contemporary avant-garde,�", "The next Biennial should include work by the following artists: Lévy Gorvy, Tadao Ando, Gillian McKeith, Wang Wei, Yunan Wang, Wang Yonghui, Tao Xian and the Wuxia Triennales, and the Wang Zikai Art Museum, both in Shanghai. The next Art Biennale should be held in March 2020. The next Art Forum is scheduled to open in June 2020. The third edition of the Hamburger Banhof in Berlin, scheduled for September 2021, was postponed until at least mid-December. The sixth edition of the Hamburger Banhof in Hamburg, scheduled for October 2021, was also moved to September 2021, and the seventh edition of the Hamburger Banhof in Dusseldorf, which is scheduled for November 2022, was also moved to September 2021. The inaugural edition of the São Paulo Art School in Brazil, which was scheduled for October 2021, was moved to January 2022. The twenty-fifth edition of the Guggenheim Museum in New York, which was also rescheduled, was originally scheduled for March 2022.A summit for Contemporary Art in New York", "The next Biennial should take place in 2019. The two-year event will include six exhibitions (the British Museum and the National Gallery in London, which are currently closed, and will be inviting visitors to join the London-based exhibition space. The first three months will be devoted to the exhibition, which will be hosted in the National Portrait Gallery and the Tate Britain. The remaining months will be devoted to education and discussions. Visitors will be able to experience the Biennial in its entirety from the museum in January 2020 and Jan. 2, 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in New York City is working towards launching a new online version of the institution’s permanent collection, which comprises some three hundred works by 80 artists. The institution is currently working on a digital initiative that will bring the works to visitors’ fingertips and will also include a digital learning experience. The first digital exhibition will debut soon and will be led by Holly Rowland, a curator of contemporary art at the Museum of Contemporary Art, and will feature live performance, installations, and installations.In a statement, MoCA said: “The Museum of Contemporary Art is committed to supporting and enriching the lives of everyone within New York City and across the globe through", "The next Biennial should be held in 2020, with the announcement of the ten artists who will be selected for the event. The artists include Samir Kalliem, Omid Kordiyar, Rajaz Mahati, Dusan Miro, Taima Malik, Niekka Hollekamp, Esha Deshpande, and Melalyn Alex, the former winner of the $10,000 Essay Prize. The biennial is being organized by the Essay Prize, the United States Council on Art and Architecture, and the B.F.K. Khatoon Foundation, and will be led by L-3 Communications, the architects of the Beijing Olympics. The theme of the 2020 conference is “Diversity and Inclusion.” The ten artists selected for the event are: Ai Weiwei, Anselm Kiefer, Hans Christian Andersen, Joyce Carols, Tacita Dean, Claudia Holm, Frances Ha, Hans Christian Meier, Hans Hansen, Jean-Luc Haussmann, Wolter Peano, Michael Lynne, and José", "The next Biennial should begin in October 2020 and will focus on a theme honoring the American artist Walter Lippmann.  The theme of the exhibition is “Biological Distortion,” which was inspired by the work of Lippmann. The artist was most famous for his distortions of the shape and size of the human body, which often featured skeletons and often depicted cannibalistic behavior.“Walter Lippmann is one of the four main creators of the grotesque human body,” Gerard Manley, director of the biennial, said. The other artists represented in the exhibition are Mike Kelley, Raymond Boyer and Yoko Ono.“Unlike the other three, Lippmann didn’t hide his disdain for the human body, and his distorted forms were often beautiful, like a rose garden, or at least an image that could be enjoyed by the eye,” Manley said. “We are honored to present the work of the biennial’s artists to the public. The show will be a great celebration of their work and its enduring contribution to our understanding and appreciation of art.”\n\n\nThe Louvre has added three new works by experimental artists to its collection: an assemblage", "The next Biennial should be held in 2022. The 2018 and 2019 editions of the exhibition featured works by international and Australian-based artists who had not previously been exhibited in the United States. “Until a few years ago, I had no idea that Biennials existed,” said Pereira. “I was only a regular visitor to the Biennial, which was in fact my first solo exhibition. I was a guest artist, and I was always very much in demand. I was invited to teach at the Biennial, but it was not until I moved to Los Angeles that I was invited to open my own institution.”\n\n\nThe National Gallery in London has received a gift of twenty-nine works by artist and activist Adrienne Brown from the artist’s son, Jamie Brown, and his wife, Amelia. The works, which were given to the institution by the family in memory of their son, are now on display in “Unseen: The National Poetry Collection in London” (2019), an exhibition of work in memory of their son, who passed away at the age of forty-one. “Adrienne’s collection is a powerful testament to the visionary and multi", "The next Biennial should focus on the evolution of cultural production on long-term social and environmental sustainability, with a particular focus on the changing relationship between art and land and its legacy, its impact on the body, and the potential for art to be an important instrument for the social and political struggle.”The 2019 edition of the Biennale, titled “The Possibility of Art,” will take place at the Miraflores Cultural Center in Madrid from March 7–March 9, 2020. The event will be hosted by Spain’s Minister of Culture, Isabella Malenches, and will feature works by sixty artists, including Frente Nadal, Jennifer Dunaway, Adam Dallara, Adrienne Edwards, and Hélio Oiticica. The exhibition will also bring to the forefront issues of sustainability and the environment in various cultures and will include a virtual reality exhibition, an open-air sculpture garden, and a forest in the park.“From this year’s edition, we are happy to say that the quality of the work presented has been consistently high, reflecting the expertise of the curators, artists, architects, writers and technicians, and the generosity of the sponsors,” said the organizers", "The next Biennial should be in 2021, but the inclusion of the novelties in the exhibition is not expected to be affected.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has named James Turrell as its next executive director. Turrell succeeds Ben Horowitz, who retired after a decade at the helm of the institution in June 2018. He succeeds Ray Eames, who stepped down in March 2019 following a year as interim executive director. “James is an astute curator who has built his career around his ability to bring extraordinary exhibitions and performances to life, an ability that has been amplified by his experience in managing a museum, exhibiting in multiple prestigious international shows, and winning major awards,” said board chair Meg Daly. “In the following months, we’ve seen a marked increase in engagement with the museum’s artist-in-residence programs, special projects, and exhibitions.”In addition, MoCA also announced that it will invest $200 million into its student-run scholarship program, which was established in 2000 to support artists pursuing a degree at the institution. The investments were made in an effort to mitigate the financial impact of Covid-19, a novel coronavirus that has affected an", "The next Biennial should be held in 2022, with the 2020 edition to take place in the summer of 2022. The 2020 and 2022 editions were jointly curated by Arts Council England and the National Galleries of Scotland. The institutions will work together on an exhibition-based model, focusing on certain themes, and the host city will oversee the creative industries. The 2020 theme, 'Performance and Performance-Mediated Change,” will be about the art and the fashion industry. The 2022 theme, “The Economy of Aditya Bandy,” will be about the environment and the art of the arts.Both Biennial 1 and 2 will produce a total of sixty exhibition-sized works. The Biennial 1 exhibition will focus on the contemporary art of the Victorian era, with a focus on the work of Giles and Mary Beard. The Biennial 2 will be about contemporary art of the 20th Century and will be curated by John McAllister. The 2019 edition of the Biennial, “Abandon Nothing” (2019), was curated by James Bick and Anna McNamara. The exhibition drew 7,000 visitors.\n\n\nThe Norwegian pavilion at the Fifty-Ninth Venice Biennale, which was", "The next Biennial should be held at the Palazzo delle Papesse in Venice in October 2022. The Biennial’s inaugural list of artists includes Judith and Patrick Hennigan; Mark Leckey; Alice Martens; Artistic Director Valentino Seyrig; and Mihai Seyrig, a curator and avid collector who founded the auction house in 1998. Renowned for its artworks and for its business ventures, the auction house has garnered international acclaim for its support of critical causes. While it will be the final exhibition of the Critérium d’Art Contemporain (CAC), the auction house will remain in Paris. The auction house also announced the opening of a new museum dedicated to the work of Valentino Seyrig at the Museum of Fine Arts, Paris. The institution, opened in 2008, serves as a repository for the artist’s artworks.\n\n\nAs the number of people suffering from the coronavirus continues to rise across the globe, the Fine Arts Museums of the Republic of Belarus and many other Belarusian museums have closed their doors for the day. According to a report in the Art Newspaper, the closure was made possible by the ", "The next Biennial should be on October 18–28.\n\n\nThe Biennial of Contemporary Art (BAC) in New York City announced today that it is moving forward with its 2021 iteration, which was canceled due to Covid-19, despite the state’s insistence that it is still on schedule to open by March 2021. The 2019 edition, titled “Theater of Operations,” was held at the Museum of Modern Art in New York from March 13–March 21, and was scheduled to run through March 23. While the event was postponed three times, it was rescheduled five times, and last year’s event drew more than seventeen thousand visitors.Under the headline “The Future of Art,” the biennial, which will include works by forty recipients, including Derrick Brahimi, Giulio Ceccaretti, Dario Catellani, Yoshitomo Nara, and Sara Cwynar, and will run from March 17–March 21, 2020, will see the reopening of the Museum of Modern Art. The 2019 edition was held at the Brooklyn Navy Yard from March 13–March 17, and the 2020 edition was staged at the Museum of", "The next Biennial should be staged by the end of 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a significant gift, worth $54 million, from the John and Zsolt Bravery Estate in the form of a significant collection of works by global artist-activists and activists. The collection includes works by artists including Mandy El-Saieh and Zina Saro-Wiwa, the latter of whom has been imprisoned for three years and recently released from prison after serving only eighteen months following her conviction for robbery.In a statement, the Bravery Estate said, “The museum is honored to present to our fans and the public the 'Zsolt Bravery: Author of the Life of Art' exhibition, which will be presented in the months ahead. It has been a tremendous honor to present this exhibition to the Bravery family. We look forward to the exhibit’s reception by our fans in March.”The collection is also the subject of two exhibitions currently on view at MoCA—The Body Art Project: The Body and the Mind, at the museum, which will run for thirteen months, and “The Body and the Place: Art in the Body” at the", "The next Biennial should take place in Kuwait in 2020. \n\n\nLuxembourg’s Culture Ministry has released guidelines for the reopening of institutions following the coronavirus pandemic. It outlines three scenarios for reopening: “indirect,” “neutral,” and “aggressive.” According to a statement, the ministry expects the reopening of institutions “indirectly.”“We are currently assessing the situation and considering the possibility of the possibility of the possibility,” a ministry spokesperson told the Art Newspaper. “We will continue to monitor developments closely and respond with more clarity and urgency to any eventualities.”While the UK is preparing for a public health catastrophe caused by the coronavirus, the country’s National Health Service (NHS) is bracing for a crisis of its own making. Since the coronavirus outbreak began in Wuhan, China, on December 29, 2015, the UK has welcomed more than 5,000 people and has had its streets filled with terrified onlookers. On Monday, March 13, the government announced that it is expecting the number of infected to surge to 10,000 by mid-April and that recovery plans for", "The next Biennial should take place in 2021. The next iteration of Artforum London will be staged at the Tate in London in 2022, and the 2020 edition will be staged at the Etihad in Dubai in 2022. “We are acutely aware that Artforum is a global platform for the exhibition of work by artists and that our audiences are diverse, and we are committed to working with them to advance the professional and creative activities of artists,” said Maira Johnson, director of Tate Britain. “Tate has a long-term plan for artists that includes the development of the Tate Modern’s new three-story, contemporary art museum, which will open to the public in 2022. We are working hard to accelerate this and are hopeful that the first edition of Artforum London will be an exciting event.”  This year’s edition of Artforum London was held at Leicester Square, a special exhibition space that was constructed by the Museum of Modern Art, the Tate, and the Office of Arts and Culture in London, and attracted more than 1,500 visitors.  “I feel very strongly that the new museums are the future of art and can’t wait to see what they will be able to", "The next Biennial should take place in the spring of 2020.\n\n\nThe Museum of the City of New York (Museum of Modern Art) in New York has announced that Pablo Picasso’s masterpiece, The Starry Night, will be restored and on view in the upcoming exhibition “Pablo Picasso: The Starry Night.”According to the Brooklyn Rail, the restoration project will consist of the “use of natural materials, including local materials, such as wood and stone, and the restoration of the original surface of the painting, which is best described as a white image.”The painting was painted on canvas on January 19, 1909. To create the painting, Picasso used two large sheets of a dark, saturated rubber, which he would later describe as a “rubber blanket.” The painting is one of several works in which Picasso creates a sculpture out of two overlapping lines, one of which features a constellation of stars. The work, titled Pablo Picasso: The Starry Night, is currently housed at the Museum of Modern Art.\n\n\nThe Museum of Modern Art (MoMA) in New York has named René C. Castro as its new director. Castro previously served at the", "The next Biennial should be held at the Municipality of Minsk, the National Museum of Art in the city of Minsk, and the State Museum of Arts, the State Theatre, the National Museum of Fine Arts in Athens, and the National Museum of Fine Arts in Budapest. \n\n\nThe Danish art and design museum Bædborg’s acquisition of two five-thousand-piece works by the Dutch-born, New York–based artist Joost Anhalt in a deal valued at $8 million was reported today by the Art Newspaper. The Danish paper reports that the thirty-one-year-old Anhalt has been commissioned to create a new collection of works, which will be housed in the Museum Trædgården, near Copenhagen, by the Danish Minister of Culture, Lena Larsen.The acquisition was made in 2016, shortly after the artist’s death, and was made through a contract with the Danish firm W.M. Becker & Fæder, which was founded in 1939. The firm was contracted to create the works, which were legally purchased in 1972, but only officially opened their doors to the public in 2016. The works are part of a series that includes Jerusalem, ", "The next Biennial should be a departure from the traditional format of exhibiting annually three works by a single artist. The biennial will focus on the intersecting histories of conceptual art and sculpture, focusing on how the field of sculpture has experienced significant transformations, while also including a discussion of the future of art in the digital age.Participating artists will include Amanda Conner, Cara Foss, Rainer Haag, Robert Johnson, and Benjamin Lawrenson. \n\nThe Museums Association (MA), an international nonprofit organization of more than 4,200 cultural institutions, has announced that it is launching two initiatives aimed at combating the global health crisis. The first is a new fund that will provide $2 billion to combat the pandemic, and the second is a new program that will involve several hundred cultural workers from the United Kingdom, Ireland, and the United States.The MA fund will be established in partnership with the UK’s Department for Culture, Media, and Sport (CMS), which will distribute $200 million. The fund will be managed by five different agencies—the Department for Culture, Media, and Sport, the Department for International Development (DfID), the Office of the Culture Secretary, and", "The next Biennial should be held in 2021.  “Istanbul Night Market: From the Kremlin to the Streets of Istanbul,” is currently on view at the European Regional Academy of Arts (ERVA), in Rotterdam.\n\n\nAmerican painter and sculptor Mark di Suvero, whose evanescent, prismatic sculptures fused deceptively minimalist yet evocatively sculptural ideas, has died at age eighty-seven. Di Suvero’s essay-and-cutout-painting form exemplifies a vibrant and sometimes bleakly feminist aesthetic. Based on the experimental artist’s own postwar practice, whose surrealist and neo-compositional magic intersects with a vast array of contemporary culture, the essay-and-cutout sculptures have been collected by Museum of Modern Art, the Metropolitan Museum of Art, the Whitney Museum of American Art, and the Los Angeles County Museum of Art. In an interview with the Art Newspaper, Di Suvero described his work as a “lifelong project of self-expression.” Di Suvero’s work is currently represented by the Pershing Gallery in New York.In an interview with Salon.com this year, Di Suvero said", "The next Biennial should aim to introduce a new form of international dialogue that will address the concerns and aspirations of the artists represented in the exhibition and the public. I also hope that the next exhibition will realize its potential.”\n\n\nThe Egyptian Museum of Art in Cairo announced that it will open a new exhibition devoted to the life and art of Pharaoh Rameses III, which has been closed since February 14 because of a severe outbreak of Covid-19. The show will be titled “Rameses and the Art of the Pharaohs” and will feature works by twenty-six artists, including Alia Farid, Ahmed el-Kheir, Abed El-Deen, Hisham al-Hashemi, Hamas al-Shaykh, Nima Khalili, and Suleem Khedive.The Egyptian Museum of Art, which is located in the eastern portion of the country, began the March 14 opening of “Rameses and the Art of the Pharaohs” by presenting works by twenty-six artists in a show that followed a tour of the institution in March. The show was followed by a performance by the Egyptian artist Salah Har", "The next Biennial should be announced in the near future. We look forward to the results. \n\n\nThe Noguchi Museum in New York has appointed Jennifer Deitch as its new curator of modern art. She will be responsible for cultivating and presenting the Noguchi Collection, which comprises contemporary work by 80 artists and includes works by Sigmund Freud, Pierre-Auguste Renoir, Kurt Weise, and others who were influential in shaping American painting and design. Deitch joins the institution from the Museum of Modern Art (MoMA), where she serves as curator of contemporary art and design, and will assume her new role in January 2020.“Jennifer brings an exciting and compelling worldview to the museum,” said John Schrag, Noguchi’s director and chief curator. “Her experience, passion, and expertise will be essential in helping to establish the Noguchi Collection as a landmark in American art.” Deitch will assume the museum’s current location on East Seventy-Third Street, where it is currently housed since 2020, and will begin her tenure on January 3, 2020. \n\n\nThe French publisher Lévy Gorvy has announced its representation of the artist-run collective FIM", "The next Biennial should be held in 2021; the 2020 edition has been rescheduled for March 11–March 18 and was originally scheduled to run for twelve weeks.\n\n\nAustrian art historian Ute Geissendorfer has been named the winner of the Davis Art Museum’s $21,000 Clement Greenberg Prize. The $31,000 award also recognizes the excellence of scholarship in art history.The Clement Greenberg Prize, which was established in 2009 by the Davis Art Museum and was awarded to a writer whose work advances the work of his or her mentor in a major way, was originally presented by the museum as part of an initiative to encourage the emigration of Austrian art from Poland and the Soviet Union. The new award is one of the first in the country and will be presented at the Davis Art Museum in Vienna on February 5.The Clement Greenberg Prize has been presented annually since the museum opened in 1943. The winners are chosen by biennial curator Ann-Marie Baumann. The criteria for the award include: • excellence in scholarship; • excellence of execution; • aesthetic quality; and • the achievement of a major discovery. The winner is chosen by the curator of the year.\n\n\nThe Museum of Fine Arts (MFA) in", "The next Biennial should take place at least a year from now. It would be a worthy successor to the esteemed Venice Biennale, which was also held in the city of Venice. Although it would be a little more than a thousand miles long, the festival would be held in the Venice–Brera-Venezia Giulia, in the city of Brera, Italy. The current version of the event, which is organized by the Brera-Venezia Giulia and the Venice Foundation, was announced in January 2019. The venue, which is located in a former train station near the city of Brera, hosts around ten other major Italian art exhibitions annually.\n\n\nThe Metropolitan Museum of Art in New York has named Cheryl Simon the next director of the museum. The appointment was made in the wake of the museum’s purchase of the works of Japanese artist Tsuneo Maeda, which was made at the request of the former director of the Hirshhorn Museum, Jonathan Horowitz. Both Horowitz and Maeda have since publicly stated their desire to collaborate with the Met to see the works brought to the museum.Simon will take the helm of the museum in October 2020. During her tenure at the institution, Simon has worked closely with the Hir", "The next Biennial should have the opportunity to present a new work every three years.”Angelina Woolf, the director of the Noguchi Museum in New South Wales, Australia, welcomed the announcement. “It’s an exciting time to support the work of Peter O.R. Smith and Susan O.R. Smith, and especially the pioneers of avant-garde performing art, and to see how they were able to continue performing despite the devastating impact of cancer, as they did for twenty years leading up to their deaths. We are grateful for the Australian Government’s decision to consider the recommendations of Professor Woolf and others and to support the development of the biennial, which could have been a wonderful event for Australia’s visual arts.”The biennial will be staged at the Noguchi Museum in Melbourne and will be held at the Museum of Contemporary Art, Sydney. The exhibition will introduce a new past-life, or future-existence, art museum and exhibition structure through a series of photorealistic works that reveal stories of the future. \n\n\nNew York’s Metropolitan Museum of Art (MoMA) is planning to move two modernist works by Pablo Picasso and Robert Mapple", "The next Biennial should be held in 2022. The project, which was established in a museum in the city of Antwerp in 1987, aims to bring together major artworks from the Philadelphia Museum of Art (PMA), the Museum of Modern Art and the Contemporary Art Museum St. Louis, among other institutions. “Erik van Haaren and Benjamin Harnwell have been working closely together over the years, collaborating on projects such as the exhibition ‘The Body,’ and ‘Twelve Midsummer Nights,” “The Hellenistic Diaries,” and “The Monuments Men: Contemporary Art and Gender in Greece.”\n\n\nThe Smithsonian’s National Museum of African Art (MNFA), in Washington, DC, has received a $2,500 donation from the Koch brothers, who have been staunch supporters of the arts and conservation for decades, in an unprecedented gesture that will allow it to continue its work in a much more aggressive way.The donation, announced on October 18, pledges $500,000 for the institution’s immediate future, which includes the construction of an expansion and renovation of the institution’s current building, the National Museum of African Art, which opened", "The next Biennial should be held in 2021. \n  These are just a few of the over twenty thousand items that have been digitized and assembled into this massive exhibition, which has taken nearly a decade to produce and will run for twenty-four hours, every day of the year. \nThe Giardia Collection, which consists of over two thousand artworks by seventy artists in sixty countries, including Mexico, the United Kingdom, Japan, France, and Italy. Founded by Giardia Giovanini, a renowned Italian collector whose artistic practice encompassed the creation of works by artists such as Elvald Baselitz, Federico Barozzi, et al., the exhibition is dedicated to the collection’s forty-two-year history of presenting works by the Giardia family. The collection was founded by Giardia Giovanini, her husband, and their children as a way to encourage their interest in art and to encourage their own artistic pursuits.“The collection is an extension of Giardia’s philosophy that has been in place since the late 1960s, and I am profoundly proud that the collection has grown into such a powerful platform for aesthetic experimentation and experimentation with new materials and new media,", "The next Biennial should be held in 2020.\n\n\nIn a bid to contain the heat outbreak, the French Ministry of Education and Culture (MLIP) has ordered schools in the country’s largest city, Paris, to close on March 15, postponing the festivities until March 16. According to Le Monde, the announcement came after schools in the city declared they would not postpone their spring/autumn equinox dates and would begin their regular classes on March 15.The move has forced schools to rethink their spring/autumn schedule, which many fear will hurt the region’s arts and culture. In a statement, the Ministry of Education and Culture said: “With the introduction of the new measures, schools have been given the opportunity to consider the situation. Their decisions will be based on a practical basis, on the day of the actual celebration, not on a political stance.”The move has also forced the university and the city’s cultural center, the Musée d’Orsay, to begin planning for the pandemic. In a statement, the city said that the event would be “complementary to the theme of the season,” and that the construction of a new cultural complex and", "The next Biennial should be the first in the city to address the issue of how art can be an antidote to the health crisis. We will be working with artists to define the next Biennial as a platform for them to continue to have a voice in shaping the future of art. ”The Biennial will be held in the city’s most populous historic gallery, the Lycée des Arts et Lettres, and will be curated by Jeannine Peillon, director of the Centre Pompidou and the Museum of Modern Art. “The future of Paris is at stake, and not just for the future of the city,” Peillon said in a statement. “I am convinced that the best way to prepare for and combat this crisis is to mobilize the arts and culture of Paris. That is why I have dedicated myself to creating a new platform for the arts in the arsène (the city’s cultural district).”The project will introduce a new public space, the Biennial Village, in the city’s rue de l'Est, called the Pompidou, and will also feature a conversation with the artist and thinker Jean-Luc Moulène about the", "The next Biennial should take place in the summer of 2021.The full list of participating artists is as follows:Bethany Berlind, Belmont, CABAMène, LA/London: Collected and presented by Bethany Berlind, Los Angeles: From The Painted Palace in Paris, London: From the exhibition of Mona Hatoum’s Collection/Theater: From the exhibition of Nari Ward’s Collection: From the exhibition of Erik Satie’s Collection/Theater: From the exhibition of Kori-Sagan Rinehart’s Collection: From the exhibition of Kurt Wegman’s Collection: From the exhibition of  Filipino American Artists: From the exhibition of Claudia Alvarado’s Collection: From the exhibition of Claudia Alvarado’s Collection: From the exhibition of Claudia Alvarado’s Collection: From the exhibition of Claudia Alvarado�", "The next Biennial should be held in the coming months. “We are currently discussing with our partners what the next edition of Art Basel should be,” said Biennial director Marc Spiegler. “We will give you an update in March 2020.” The next edition will be held in Tokyo from March 23 to March 30, 2020.\n\n\nHirshhorn Museum, a division of the New York firm Tucson, Arizona, has announced that it is expanding its international presence with a new four-day (4-to-7.30) edition of the Hirshhorn Biennial, which will travel to twenty-eight cities across the United States and Canada. It will also feature a collection of more than three hundred works by seventy-one international artists and will run for thirteen weeks.The show, “Hirshhorn Biosciences,” will be held at the museum from March 21 to March 23. It will run on March 2 through March 4, 2020. The biennial, which was founded in 2009 by Nancy Sze, and David Blaine and is funded entirely by the Sargent’s Daughters, who are propping", "The next Biennial should be titled Art and the Birth of Modernism,” whose curator is A. J. Conte, director of the Bienal Museum in Paris and former chief curator of the Fondazione Beppe Grillo in Italy. The event will also focus on the legacy of the French philosopher Jean-Luc Nancy, a leading proponent of the Conceptualist/Contemporary movement, and the influence of film and music in the development of contemporary art; and will present a selection of works by the biennial’s selections.On opening the inaugural exhibition, Artnet said: “This year’s edition of Art Basel is a major milestone for Artforum and for our editors, Mike and Filippo, as we look ahead to the forthcoming years, which will bring with it the largest and most ambitious exhibition ever staged by the French institution. The opening of this exhibition marks the end of a momentous year for Artforum, and for us all.”\n\n\nThe Corcoran Gallery in New York has announced that it is launching a new historical exhibition series that will celebrate the life and work of five artists: Anna Atkins, Sargent, Altho, W. H. Qu", "The next Biennial should be held in 2020, to be followed by a new exhibition titled “The Future Is Present,” curated by Jorie Cohn. The artist-led project is part of the Center’s ongoing commitment to exploring new ideas and new modes of artistic production through programming that focuses on social and political concerns. The following year, the Center will launch an online residency program for artists, a project that will serve as a vehicle for the exchange of ideas. These two projects are part of a broader development strategy centering around the program’s aesthetic and historical linkages to New York. The conceptualization of the Center as a hub for artmaking worldwide, as embodied in its collection, exhibitions, and education initiatives, was first proposed by curator and contemporary art historian Mary Robinette Kael in a 1975 issue of Artforum. The concept was adopted by director Roger Klein as the theme of “The Future is Present: Art and Sustainability.”  Klein’s vision for the Center, which is currently being developed by the Center for the Study of the Arts (CSCA) at Columbia University in New York, and the creation of a new community space for the collection and exhibition of art from", "The next Biennial should take place in 2021, and the biennial’s theme “Matters of Life and Death,” will be remembered by the participants. The Board of Directors of Art in the Public Interest (Bipartisan Arts Center) voted in favor of the wishes of the Biennial’s participants, and the Biennial’s National Trust formally requested that the title “Matters of Life and Death” be removed from the catalogue. In an email sent to the museum on March 25, board chairman Martin Singer wrote: “The title ‘Matters of Life and Death’ is not only anachronistic, it is even antithetical to what the Biennial’s mission is: to celebrate and present the work of contemporary artists. As such, we feel it is best for the Museum to remove the title from the catalogue, and we hope that the members of the Board of Directors will accept this decision, and work together with the staff and the community to find a creative and equitable way forward for the exhibition.”The museum is currently working on a redesign that will improve accessibility and balance the biennial’s exhibition spaces, and the institution is also working to integrate new education", "The next Biennial should be held in 2020.\n\n\nThe museum in Cologne, Germany, has removed a bust of Adolf Hitler from its collection. The piece, which was on display in its exhibition “Hegemony of the Masses” (2018), was one of the pieces removed by the museum’s director Joachim Neumann from the collection. The exhibition had been scheduled to run until 2024.Dieter B. Grob, the curator of the exhibition, told the Art Newspaper that the museum had no choice but to remove the work, because “it is out of balance with the rest of the collection, and with the exhibition, and with the concept of the exhibition.”A statement on the Biennial’s website read: “The Biennial is a project of European heritage. It is not possible to have a biennial that is built on a history of hatred and aggression. . . . In this case, the exhibition is a perfect example: a first exhibition on the subject of fascism and the rise of Nazism in the 1930s, in a traditional master’s studio, and in the museum. It is the contemporary synthesis of the art of the past and the art of the future", "The next Biennial should take place in 2021. The 2020 edition will be staged at the Art Institute of Chicago, which has struggled since it opened in 2010 due to concerns over the coronavirus; the Smithsonian American Art Museum, which is currently undergoing a redesign project that will introduce new exhibitions and programming, and the Museum of Contemporary Art (MoCA), which closed in 2018. “We are all extremely excited about the prospect of having the opportunity to present the full breadth and depth of American art at these venues in the near future,” said director Hernán Díaz. “The new architecture of the museum reflects our commitment to make the Art Institute of Chicago the ideal home for American art, maintaining the Art Institute’s unique collection and collections on site for future exhibitions.”The museum is redesignating the National Gallery of Art, which is on the National Register of Historic Places, as a National Museum of Women in the Arts, and the Smithsonian American Art Museum, which is currently open on the National Mall, became the twenty-fourth institution in the United States to open as a new museum. The exhibit-driven institution has also expanded its program by adding more than eight hundred exhibitions per year to its existing permanent collection.", "The next Biennial should take place in Shanghai in 2022.\n\n\nThe third edition of the New York Architecture Biennial, which was announced on April 14, has been canceled. The canceled event, titled New York, would have been the first in the city to open since the pandemic began in late March. It would have been staged at Rockefeller Center, and would have featured a total of ninety works by twenty-two artists.The decision to cancel the event was made following a review of the exhibition’s program, which was written, curated, and organized by the thirty-five-member board of trustees of the Arts and Visuals Institute (AVSI), which comprises artists, curators, and producers, as well as arts professionals from thirty-eight cities in the United States. The board concluded that the performance would have been “unacceptable under any circumstance.”“The performance would have featured work by artists and other curators from thirty-eight cities across the United States, as well as works by artists and other curators from forty-two cities in the United Kingdom, thirty-six cities in Europe, and twenty-one cities in Asia,” the board wrote in a statement. “The board was concerned about the", "The next Biennial should be announced during the fall of 2020. In the meantime, the commissioning of the exhibition will be continued in parallel with the construction of a new museum dedicated to the life and work of Joan Miró, whose work has recently been included in the upcoming edition of the Guardian Biennial in London.\n\n\nMuseums and cultural sites are struggling to cope with the coronavirus, which has infected more than 1.3 million people and caused at least twenty-six deaths worldwide, and are scrambling to find ways to keep their collections and services running even as their buildings are evacuated and locked down.While officials have issued various shutdown warnings, museums and institutions are facing an unprecedented crisis that will likely last for years to come. The average height of an infected person has risen from 6 feet to 9 feet; the rate of hospitalization has increased by 200 percent; and the number of people infected with the virus has quadrupled. According to the Washington Post, more than 200 people have died from the virus since outbreaks began more than three decades ago. The public health crisis has forced some cities to close—Copenhagen, Denmark; Helsinki, Finland; and Saint Petersburg, Russia. Others, such as New York, Boston, and Chicago", "The next Biennial should focus on creating a union that represents all the artists that reside in the Greater Cincinnati area. Its proposals should include the following topics: collecting, display, copyright, and development. “We are currently in the process of preparing a new platform for the arts that will allow future generations to connect with the arts in a fresh and innovative way,” Christopher Gilliam, director of the Art Institute of Chicago, told the Art Newspaper. “The core of the exhibition will be the museum’s collection, which will feature a variety of works by a variety of artists. We will also present works in a new way and introduce new works in the museum.”The Biennial will run from February 19 to February 21, 2020 and will be curated by Jeff Koons, the creator of the iconic children’s book The Story of You. The exhibition will also feature work by a new group of artists, the 140-piece American Group, and will feature an immersive intermission featuring music, poems, and songs by the artist Hisham Bey. The exhibition is supported by funds from the Koons Family Foundation and the Ford Foundation.\n\n\nThe University of Pittsburgh has appointed Audrey Marder as its next president.", "The next Biennial should be held in in 2020. The first was held in Beirut in 2010 and the annual exhibition has since been staged in Hong Kong, Paris, and New York. The third and upcoming installments will be held in the United Arab Emirates and the United Kingdom, respectively.  [Update: March 7, 2:45 PM] Artforum has issued a correction regarding an article published by Artforum’s sister publication, the Art Newspaper, on March 7, in which Artforum editor-in-chief Christopher Knight wrote that the upcoming exhibition “will be a departure from the ‘exceptionality’ that has become the hallmark of the biennial. ‘Appropriate precautions must be taken to ensure the safety and soundness of the exhibition, as well as the exhibition itself.” Knight also said the exhibition “will be set in a new context, with a different set of people, different themes, and different objects.” The article, published by Artforum, was published in response to a question posed by Artforum editor-in-chief Christopher Knight to an audience member in a live performance at the Brooklyn Museum on Saturday, March 2. The question was posed by", "The next Biennial should take place in the spring of 2021, with the exhibition marking the centenary of the end of World War I. Tad Smith, deputy director of the Biennial and the Museum of Fine Arts, Boston, told the Boston Globe that the next show will draw from a \"deep pool of contemporary art, bringing together pieces from all over the world, reflecting both the breadth and the depth of its artistic output.” The show will also launch a new generation of online-only exhibitions that will focus on topics such as the environment, markets and urban planning. Smith said: “The future of art is to some extent a future of the city, of the planet, and we have an obligation to shape it in ways that preserve and support the environment. The new exhibition will capture this together and offer an open platform to bring together artists and thinkers from around the world to explore the ideas of the city in new and varied ways.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has created an initiative to help cultural organizations and organizations that have experienced losses or damages to the financial losses of the city’s Metropolitan Museum of Art and the Museum of Modern Art in New York. The program,", "The next Biennial should open in 2021, with the first exhibition taking place in 2022. The sculpture group, whose work is housed at the galleries of the Museums in Belo Horizonte and Geneva, have now announced the artists chosen for the 2019 edition of the Las Palmas Biennales. The group comprising Agustín Arruda, Amado Aguiar, Nuno Cano, Rafaela Cervetto, Marcelo Dolores, and Paulo Gonçalo, have collaborated on works for the two previous editions, which were held in 2013 and 2019.The awardees for the 2019 edition were: Agustín Arruda, Brazil, for his work Dissolving Line: The Mistakened Concept of Space, which was selected for its exploration of the relationship between the representation of the natural and the environment in art; Agustín Arruda, Brazil, for his work Dreamer in the Sky: A Parable of a Dusky Shore , which was voted the best work of the year by the jury; and Agustín Arruda, Brazil, for his work Spiral Spires: A Parable of a Moonless Night, which won the 2019 Golden Lion, which is also", "The next Biennial should be held in 2020 and will aim to present a new kind of exhibition, one that will address contemporary issues through the use of new and innovative media, as well as the making of art. “The new ways we are creating and the new tools we are using to make art are changing the way we live and work,” said Elissa. “I’m eager to play a role in supporting the museum’s work in enabling artists to experience and create in the new way.”\n\n\nThe National Galleries of Scotland announced today that it is reopening following a £10 million ($12 million) refurbishment in March. The restoration project included the construction of a new, more open-concept building and the addition of a new visitor experience that will be similar to the National Galleries’ previous incarnations. The refurbishment was carried out by the Scottish firm W.D. Horton and was funded in part by the National Lottery Heritage Fund (LT), the Scottish government’s arts and culture arm, and the National Lottery Council. The new building and experience will be inaugurated by the Scottish National Concert, which will travel from the National Galleries to the National Museum. ", "The next Biennial should begin on September 20 and will feature work by forty-three artists, including Catherine Broadbent, Victoria Graham, and Tanya Georgiadis. “We are grateful to the deans of the two schools for the gracious and generous inviting them to the new biennial,” said Dr. Chery.A selection of work from the exhibition “The State of Art” will be presented as part of the first edition of the Metropolitan Museum of Art’s “Art of the Party” in December 2020, which will also feature photographs by Laura Owens, Alice Cooper, Irvin Gould, and James Naughton and will be presented by the artist-run nonprofit , Art in Progress.\n\n\nThe British artist and philosopher Noam Chomsky, a leading critic of American empire and the state of war and peace in his country, has been nominated for the Nobel Peace Prize. The announcement was made by the Oslo-based arts organization OsloFilm and will be held on December 12. The nominations were made by a committee comprising Bernard Henri-Levy, Helen Grant, Yigal El-Ghossein, and Judith Woodcock.Chomsky’s work, which is widely viewed as a critical assessment of", "The next Biennial should be held in 2020, with the idea of a new exhibition planned for the same year, he said. The pieces that will appear in the first show will be chosen by a committee comprising the architects and curator, artist and curator, and writer. The show will be curated by Luyten Fischer, the director of the Museum Fridericianum in Kassel, and the Pennsylvania-based artist and curator Mary Martin. The show will be organized in the same fashion as the previous two editions of the series, with the same theme but with a different theme each time. The first show, “Ara Goldberg: The Art of Balance” (2016), was held in Berlin in February. The 2019 show was held at the Museum Stedelijk in Amsterdam, with the first show, “Ara Goldberg: Forms of Life” (2018), on November 9-November 11.\n\n\nThe National Galleries of Scotland have declared that they plan to break up as part of a cost-saving move that will save the Scottish government £1.2 million a year. The announcement coincides with the UK’s decision to leave the European Union and comes on the heels of a move that will see the Royal Mint dismantle", "The next Biennial should include the exhibition “Buildings as Performed: Constructivism and the Architectural Record,” which will showcase work by seventy-eight artists spanning the twentieth century–1940. The next edition of the Topaz Prize, presented by the British architecture historian William Shakespeare, will feature the work of seventy-one artists from twenty-nine countries. The Alex Lynn Biennial will be held at the London Art Gallery (LAG), and will run from March 13 through March 8. The inaugural exhibition, “Gini,” will include work by thirty-six artists from twenty-six countries. The exhibition will also be presented by the Oxford University Art Gallery (UOW), and will run for twelve weeks. The Tate will stage a show dedicated to the construction of the Abraham Lincoln Memorial, and will stage a show dedicated to the life and work of Charles Darwin.The inaugural exhibition, “The Wretched of the Earth: Architecture and the Shape of Human Life” is curated by Maria A. Nagy and will run March 24 through March 29. The second show, “Charles Darwin: A Retrospective” is curated by Victoria Miro, and will come March 27–March 31.The", "The next Biennial should be held in 2022; the next, in 2022; and the next, in 2023. The institution’s influence extends far beyond the contemporary, having played a central role in the rapid development of contemporary art. In fact, the first exhibition devoted entirely to contemporary art in Istanbul, “Takashi Seishu” (Art and Life in Sakhnin), was organized by the University of Illinois in Urbana, the City of Chicago, the Museum of Contemporary Art, Istanbul (MCAI), and MCAI’s sister institution, the Taller Museum of Art.While the program has been dormant for over a decade, Turkish culture has been gaining momentum in the wake of the country’s 2011 Gezi Park protests, which aimed to challenge the military-backed government and transform the country into a socialist utopia. The protests saw thousands take to the streets of Istanbul to protest the military-installed AK Party, which received approximately 60 percent of the popular vote that year. While the demonstrations were largely peaceful, they sparked the largest demonstrations the country has seen, and they were met with massive demonstrations in support of the Gezi Park protesters, which also drew in a large and diverse array of cultural", "The next Biennial should be held in the autumn.The festival, which was inspired by the ancient Greek festival of the Solstices, will establish an international platform for the exhibition of works that address the themes of the year. The theme of the 2019 edition is the theme of the year, and the artist will be selected by a group of experts. The performance will be at the Kunsthalle Basel from September 27 to October 28.Inaugurating the exhibition are twenty-two works on paper and wood, titled “Spiral Spaces” and “Aurora of the Sun” by German artist Otto Bauer, and thirty-one more works by Icelandic artists Arnason and Bjarnadóttir. The latter, the third exhibition of its kind, will feature the work of the late Icelandic artist and filmmaker Árni Lædáin, who was known for his surrealist and magical storytelling, which often dealt with myth, ritual, and the afterlife.The exhibition will also include several works by the female artists immortalized in the exhibition: Claudia Balsom, whose colorful paintings and drawings explore the relationship between light and the body; and Aline Gorbarga, whose paintings are", "The next Biennial should take place at the City of Los Angeles in 2020. Kim noted that the current model is not sustainable for future generations, and that the current exhibition format is not conducive to such a notion. He said that he hopes to re-create a new model that can be sustainable for future generations. In an attempt to address the adoption of the Gold Award as a model for a future exhibition, Kim said that he has updated the program. He has introduced a new $1,000 cash prize to be given the most innovative exhibition, and has also launched the $5,000 Carlow Prize for Art, which will award $1,000 to the person who has contributed the most art for the preceding ninety days.Kim noted that the Gold Award is not meant to be taken as an indication of artists competence, but rather of their ability to perform in innovative and creative ways that engage with and address the themes of the Biennial. He also noted that the current Gold Award was founded on the Gold Awards of Jean-Pierre, Sophie and Jimin, who were awarded for their contributions to the art of photography in 2006, and has claimed that the Artistic Hebdom Birgit-Bénétière Award is a", "The next Biennial should comprise a study of the history of the Tupi people, a group of indigenous people who are currently incarcerated in China’s Guangdong province, and should aim to include a wide range of artists from the area. In addition, the exhibition should focus on the impact of China’s occupation of Indian Ocean countries in Southeast Asia and the Pacific. The Art Newspaper reports that the theme of the exhibition will be “The Future is Present.”The biennial is sponsored by the Hong Kong-based legal aid organization the Hong Kong Foundation for Democracy (HKF), and the Nanyang Technological University (NTU), Singapore, as well as the Hong Kong Asian Art Museum (Hong Kong Art Museum), Hong Kong, and the Hong Kong Museum of Art.\n\n\nThe National Gallery of Art in Washington, DC, announced today that it is preparing to welcome visitors back to the institution in April. In a statement, the museum said: “We recognize that this is an unprecedented and challenging time for everyone at the National Gallery, and we are taking the new year with a heavy heart. We are working hard to provide a strong and robust collection and an environment for a strong and vibrant arts program as we continue to support", "The next Biennial should concentrate on the history and vision of the exhibition and what it means to be a modern and contemporary museum. It also needs to cross-reference existing exhibitions and new exhibitions.\n\nThe exhibition will feature the work of eighty-eight artists in total. The first installment of the exhibition will open in London in September 2020 and will be followed by “Beyond the Frame” in October 2020. The third installment will open in Milan in November 2019 and will be followed by the fourth installment in April 2020.The Biennial’s goal is to “unify painting” and to “rein in” the art of modernity. The museum will then present the first of three exhibitions of work by the American artist Richard Anuszkiewicz at its new location in September 2021. The next exhibition will be “Anuszkiewicz: Wetheft” in April 2022. The last exhibition will be “Wetheft 2020” in March 2022.As part of the seventy-fourth Württemberg–Düssemlichkeai in January 2019, the museum cancelled the exhibition “Anuszkiewicz: Wetheft.” The canceled exhibition", "The next Biennial should have started in March and will be hosted by the Fourteenth Biennial in June. The first exhibition, titled “Animals and Climate Change,” will address the ethical concerns surrounding the collection and exhibition of anthropogenic CO2 and will focus on replanting trees, reforestation, and conserving ecosystems. The second, “On the other hand, trees and forests,” will focus on the production of wood, charcoal, and paper and will focus on the conservation of rainforest and tree species. The third, “In Defense of the Earth,” will address the question of how forests and trees and trees can be maintained in their natural state, and will focus on the natural processes of regeneration. The fourth and most recent exhibition will be “In Defense of the Earth,” under the title “In Defense.”The first exhibition, “In Defense of the Earth” (Moscow Art Museum), was released on February 17 and opened on February 22. The second, “In Defense of Life,” (Copenhagen Art Museum), was released on February 28 and opened on March 2. The third and most recent exhibition, “In Defense of Life” (", "The next Biennial should be held in the spring of 2021, according to the organisers, but the event has yet to determine a date for the 2019 edition. The exhibition will be hosted in the Shihadegumi, a former military barracks complex in the capital city of Kumamoto, and will organize a number of exhibitions, including a retrospective of the work of the late artist Nara Allesak and a presentation of work by Adam Dallenbach, a German-born, American-based curator, and will showcase both contemporary and emerging artists.The theme of the 2020 edition is “Non-Art,” and it will be curated by Hidenori Takahashi, the vice director of the university’s department of contemporary art. It will also be led by curator Taichi Matsuda, curator of contemporary art at the University of Tsukuba, and will take place in the Shihadegumi, the former headquarters of the former Kumamoto Prefectural Police Department, in the city of Kumamoto, Japan.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Michele Doolittle as its first director. Doolittle comes to the institution with extensive experience in the field of contemporary art and is", "The next Biennial should be held at the Museum of Contemporary Art (MoCA), Los Angeles, in late September. The 2019 edition will be held at the Museum of Modern Art, New York, and will feature work by fifty artists including Andy Warhol, Frank Gehry, Charles Ray, and Ed Moses.\n\n\nThe Italian government approved a state aid of $1.1 billion for the reconstruction and restoration of the Italian economy following the devastating Daiichi nuclear plant disaster in March. The legislation, which is part of the country’s plan to reduce the country’s carbon dioxide emissions, will also allow the Ministry of Culture to invest $500 million into the country’s cultural sector.The legislation, which is part of the country’s Clean Development Programme, was passed by Parliament on Thursday and is expected to be implemented by the end of the month. According to the Italian daily newspaper the Corriere della Sera, the money is being allocated to help the Italian economy through the global climate emergency.“The government has decided to support Italian culture, its artists, and enterprises by transferring state funds to the Arts and Culture Ministry,” said Andrea De Simone, director of the European Cultural Foundation in Rome. “", "The next Biennial should focus on “narratives of the body,” said artist-in-residence Sarah Willem de Kooning. “As we begin to reconsider narrative as such, biennial spaces begin to shift from historic structures to the body. We need a new narrative of the body—one that depends, rather than merely estocides, on the body—one that raises questions of the body and questions of what body can be.”Kooning commended the Biennial’s art directors, Stéphane Bichette and Fabienne Baron, for their leadership in the negotiations with the first exhibition, “The Body’s Art: The Biennial of Claude Monet,” which is currently on view in the Biennial of the Long Now. Bichette said: “I’ve long admired their art-making and their commitment to bringing exhibitions to different institutions. I’m most excited about seeing what they will make for the first exhibition at the new Biennale in 2020.”\n\n\nThe Tate’s board of directors has appointed Nicholas Cullinan, chair of Tate’s strategic advisory body for art and design,", "The next Biennial should be held in 2020. The 2020 iteration of the show will take place at the Palazzo Grassi in Venice, Italy, and will be led by Agustín María Oiticica, the director of the Rema Hort Mann Museum in Berlin; Valentino Siu-Shino, the director of the Museum of Modern Art in New York; and Robert M. Smigel, the director of the Museum of Modern Art. In an email to the Art Newspaper, Neeva Sarna, the general director of the Biennale, said: “The Biennale is an institution whose history is of the highest scale. The work of the artists who have participated in the event has been innovative, at times challenging and at others inspiring. We are hopeful that this next edition will continue to stand for the vision of the Biennale and show the full range of the talent of the artists in this exhibition.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is moving the twenty-fifth edition of the Milan Triennale, titled “Milano: A Space for Human Experiences,” from September 5 to October 6, 2020. The exhibition will"]