["The next Biennial should take place in Barcelona in 2022. The programme will be hosted at the new Museum Universitat Dr. J. H. Höller.\n\n\nThe Brooklyn Museum in New York has appointed Steven DeAngelo as its next executive director. The museum’s board of directors voted unanimously for DeAngelo’s appointment on Monday, and he officially took the reins in December.DeAngelo was hired in 2015 after serving as the director of the Museum of Modern Art in New York from 2002 to 2007. He was also the head of the Brooklyn Museum, which was founded in 1936, and served as interim director of the museum before it closed in 2008. DeAngelo was re-hired as director in 2013, and he has since overseen the museum’s expansion, which added new galleries and public spaces, expanded programming, and introduced new exhibitions and events.DeAngelo’s first order of business as board president will be to elevate Joan Levin, who retired in January 2019, to the role of director, which she will assume on January 6, 2020. She will assume the helm from Mary M. Patchett, who will resign from the post in February 2020.“Steven’s leadership, his vision, and", "The next Biennial should take place in the fall of 2021. Its theme will be “Time and History.” The event will include the exhibition of work by twenty-eight artists and will be organized as a series of group presentations. This year’s iteration of the event will be hosted at the Museum of Contemporary Art, Boston.\n\n\nThe Fine Arts Museums of Minnesota (FAUM) has appointed Steven M. Feinman as its next executive director. He succeeds Patricia Tyler-Reed, who departed the institution in August 2019 to head the Los Angeles County Museum of Art (LACMA), and will take up the post on January 6, 2021.“Steven’s leadership and vision for the organization will ensure we achieve our goals to remain a strong, globally recognized cultural destination,” said Mary Ehrlich, chair of the board of trustees. “He has the breadth of experience necessary to help ensure FAUM’s long-term future as an important and widely-envisaged cultural entity.”Tyler-Reed made the announcement in August 2019, shortly after she and Harvard University professor Lawrence Abu Hamdan, director of the Lawrence Abu Hamdan Institute for the Arts at the University of California,", "The next Biennial should begin with an exploration of the way that art and politics are intertwined through a discussion of energy and its relation to ritual and the body. Allan Kaufman, the director of the New York–based institution, told Artforum that he believes the architecture of the exhibition is important: “I think it will propel the conversation further into the dense world of art and philosophy and into the public sphere.”\n\n\nThe exhibition’s German co-curators, Markus Lüpertz and Robin Montgomery, have been invited back to Berlin to continue their work in the new year. The commission, which was organized by German gallery S.A.G.F. (Society of Arts and Galleries) and was organized at the Berlin Gallery Show, was announced last month and was open to the public from December 31 to January 3.The open-air exhibition will feature works by 150 artists, including Carlo Coccopalmera, Matthew Graf, Jens Illme, and Elin Nordstrand, and will feature programming that addresses issues of environment, climate change, migration, and the environment in general, such as the installation of a sculpture by the German artist Rindo Knebel that uses a rotating platform", "The next Biennial should take place in 2020–21. In a letter addressed to the Board of Directors of the British Foundation, which represents most of the world’s major art museums, the biennial’s director, Sharon Todd, said: “We are delighted that the Board of Directors and the Royal Academy of Arts will receive the nominations from fellow artists who have expressed their interest in showing the Biennial. We hope that they will encourage the Royal Academy to consider the proposals and see how we can make a new Biennial possible. We are also concerned by the objections raised by scholars such as Richard Armstrong, Gary Barlow, and Richard Finlayson that the exhibition must be restricted to artists whose work is currently exhibited in the United Kingdom. The exhibition ‘The Turn of the Screw’ has been very popular with academics, and we hope that other scholars will be inspired to participate in the next edition of the Biennial.”The biennial’s inaugural episode, “The-Body and the-Mind,” was staged by the Royal Academy of Arts in London. Set in the academy’s gallery, the exhibition raised the topic of contemporary art from an academic perspective, examining, among other things", "The next Biennial should be held in 2021, and we are prepared to organize a biennial of our work in 2021. We hope that in the meantime other institutions and artists will consider participating in the tenth edition of the biennial.”\n\n\nThe National Gallery of Canada announced today that it is establishing a new ten-year capital campaign to attract and retain visitors to its exhibitions, a step that will involve an online-only platform. Titled Coffee with a Purpose, the initiative will aim to help the gallery raise the $150 million it needs to open a new location in downtown Ottawa.The new platform will offer visitors curated experiences in real time, and will feature a virtual experience of the galleries’ collections, exhibitions, and research. The project will also introduce a new service called CIAT, which will allow visitors to experience the physical space in the month of June.“While CIAT will be an exciting new experience for many visitors, we know that it is a challenge for our current online audience,” said Kristina White, the museum’s director of exhibitions and research. “We recognize that many of our visitors are eager to share that virtual experience with others, and that is why we are creating a new platform", "The next Biennial should be in 2021. Romain Grosjean, a professor of architecture at the École Polytechnique Fédérale de Lausanne, told the Art Newspaper that the issue of urbanity was central to the institution’s decision. “The Museum wants to create an image of a city, of a city that is linked to Régis and to its surrounding region,” Grosjean said. The artist hopes that the project will open up new images of museums in a city, one day, and inspire visitors to think about urban architecture and design in the region.The institution is one of several major French museums to begin accepting visitors from China in recent years, including in Paris and Lyon. In February 2018, the Louvre opened its doors to visitors from the country for the first time and in October 2020, the Louvre reopened to the public after a $4 million upgrade.\n\n\nArtnet reported on Friday that a group of artists are urging the Royal Academy of Arts (RA) to cancel the upcoming edition of its Royal Jubilee, which will take place on March 21, 2021. The event, called Royal Jubilee 21, will be staged on two levels at the academy", "The next Biennial should take place in the year 2022. The third and final editions of the Exposition were held in 2025 and 2019, respectively.The California Polytechnic State University, San Francisco, is currently working on a new agreement with the Biennial, which will involve the completion of a five-year renovation of the museum. The project is slated to be completed by 2021. The renovation, which will be overseen by architect Harald Szeemann, will include the construction of an exhibition space, a public courtyard, and the construction of a new floor and walls.The seventy-fifth Venice Architecture Biennial, titled “Stages 1-4,” will take place in June 2020.\n\n\n\n\n\nJohn Leavitt, the founder and director of the San Francisco Museum of Modern Art (SFMoMA), received the 2018 Christopher Walk of Fame. Leavitt was chosen for his contributions to the museum’s architecture and design. He is the fourth architect to receive the honor for his lifetime. Among the ten finalists for the Golden Lion, which honors individuals who have shaped their field for the betterment of society, were architect Robert Irwin, designer Michael DeLuca, and director of the Jewish Museum Frank Gehry.\n\n", "The next Biennial should be an occasion for reflection on the historical and contemporary contributions of the three artists that are central to contemporary art: Pierre-Joseph Pacin, who will receive the award in the first exhibition of its kind in Paris; Berthold Kasper and Johan Agbène, who will receive the second exhibition of its kind in New York; and Andrea Bündchen, who will receive the third exhibition in New York.\n\n\nThe Museum of Fine Arts (MFA) in Boston has approved a new $500,000 grant for artists whose work is inspired by the city of Boston, the historic site of the 2012 Boston Marathon bombing.The $500,000 Grant Program, which was established to support the creative practices of underrecognized early-career artists, was established in 2018 as part of a $3 billion overhaul of the MFA. The grant program will now support fifteen artists, selected by curators, who have worked toward advancing their careers in the region in the last twelve months. The MFA will consider applications for the fellowships through August. The fellowships will be awarded by the curators through a rigorous application process that will focus on an artist’s ability to demonstrate an engagement with the Boston cultural", "The next Biennial should be held on the campus of the Russian Academy of Sciences in Saint Petersburg, which will also host a workshop titled “Biennial of the Russian Academy of Sciences,” an exhibition of works by artists of different nationalities, and a four-day event entitled “Geometry” at the Museum of Contemporary Art in the City of Saint Petersburg.Along with the exhibition, which will be hosted by the Russian Academy of Arts, an online platform will host a digital edition of the exhibition, entitled “The Art of the World” and will offer access to a special exhibition composed of works dating from 1940 to 1970. The exhibition is part of the country’s effort to modernize its collections and is scheduled to run until May 2020.\n\n\nThe Smithsonian’s National Museum of African Art (NMAA), which recently announced plans to relocate from its current home in Washington, DC, has received an outpouring of support from Washington, DC, residents and thousands of supporters from around the world. Among those who signed a letter in support of the institution are politicians and lawmakers from every congressional district in the United States and dozens of mayors and city councils from across the District of Columbia.“We are writing to express", "The next Biennial should be held in 2020.\n\n\nThe Museum of Fine Arts (MoFA) in Boston has appointed Jaye C. Anderson as its next executive director. Anderson will be responsible for leading the institution’s board of directors, which is made up of four to four hundred individuals, and managing a $130 million endowment. Prior to joining the museum in 2004, Anderson was head of the arts programming at the Museum of Fine Arts in Boston, where she oversaw the development of the museum’s collection of more than one hundred works of art.“Jaye is a seasoned executive who has been instrumental in building the MoFA board over the last twenty years, leading a successful transformation of the institution into the powerhouse it is today,” said David H. Remes, the museum’s executive and director. “Jaye’s leadership and background in the arts and her proven track record as a professional make her uniquely qualified to lead MoFA through this difficult time.”Anderson comes to the institution from the Metropolitan Museum of Art, where she worked as a strategic advisor and curator for twenty-five years. During her tenure as a curator, she organized more than two hundred exhibitions, including “Annie", "The next Biennial should be held in the year 2021, but the decision to postpone the event was not unexpected. Originally scheduled for March 2020, the event was pushed back to April 2021 after the authorities received a large number of complaints from residents. The cancellation of the upcoming exhibition follows an announcement by the city of Riga that it will extend the opening of the exhibition by three months due to the coronavirus pandemic.City councilors decided to postpone the event, which was supposed to kick off on March 27, two weeks ago. The move meant the exhibition would still open on March 29 but would be able to hold an additional two weeks of activities, which are usually held between April 20 and March 22.The decision to postpone the exhibition was made in order to allow the city more time to prepare for the coronavirus outbreak. The full list of participants in the biennial is as follows:Board of Governors of the Royal Academy of ArtsBeijing Art MuseumXinjiang Art Museum (Beijing)Xinjiang Art Museum (Beijing)Art Science Center (Beijing)Art Yuan Art Museum (Beijing)Art Museum (Beijing)Art of the World (Beijing)Art Museum (Beijing)Art of the East (Be", "The next Biennial should take place in Melbourne in 2021. Artist response to the event, which focuses on the study and exhibition of contemporary art, has been mixed. In a letter published by the Art Newspaper, artists such as Helène Aivazio and Anton Webermann have criticized the art of the event, which they say lacks the seriousness and rigor that made the inaugural event so popular. Artforum has reached out to the Melbourne-based artist Danny Hell. Hell is currently a visiting assistant professor at the Art Gallery of Ontario and is writing a book about the exhibition.  John Gormley, the director of the Art Gallery of Ontario, told Artforum that the institution is not opposed to the exhibition. He said: “I think it’s an exciting time to hold an international exhibition in a major city and to have a collection of contemporary art that has a contemporary context that is of that time and place.” Hell is planning to present “Asymptote:  An Inflected Steel Ball,” which will include paintings by Paul Gauguin, Robert Irwin, Peter Hujar, Frances Drake, Richard Avedon, and Peter Svante, an exhibition centered around", "The next Biennial should be held in 2021. Mellon’s proposed redesign was first announced in a letter to the Arts Council in January 2019. Following an outcry from local arts organizations, the commissioning board of the DMA withdrew the proposal and the DMA moved the show to the Art of the Party, where it will remain until at least 2024, when the next edition, dubbed Art of the Future, will take place.A festival of sorts, the DMA uses the event to present more than fifty exhibitions a year, including the first series of exhibitions on Mondrian’s work on paper, “Mondrian: The Memorable Paintings” (2019) and “Mondrian: The American Paintings” (2019). The event will also continue to present works by artists outside of the United States, such as Anna Atkins, John Akomfrah, and Laura Owens.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that it is planning to remove a bust of Winston Churchill from the premises where he lived and worked for more than eighty years, in a move that will also see the building reopened as a Churchill Museum. A public statement about the decision was released", "The next Biennial should be organized in 2021, with the opening of the exhibition “The Handmaids Tale.” If the project is successful, it will mark the first time the museum will have staged a staged exhibition dedicated to the life and works of the fictional character Handmaids, the highest-profile dystopian novel of the novel The Handmaids (1948), a feminist critique of modernity and the body, and the first to explore the creation of the dystopian utopia in a rural space.The first exhibition of the biennial was organized by the artist and curator Elsa Verhaeghe, whose work was recently exhibited at the BIC and the Miami Art Museum. The exhibition was selected by the biennial team, which included Olivier Block, director of the Centre d’Arles; Jean-Jacques Petzold, the curator of Modern art at the Museum Freie Kunst; and artist Amanda Rizzo.The biennial will stage a number of works by contemporary artists, including Min, Shih Tsang, Rosalind Russell, and David Salle, and will be organized as a series of live performances, beginning on Friday, March 7 and running through March 8. At the Hammer Museum, the biennial", "The next Biennial should take place in the Spring of 2022.  A biennial is a group of exhibitions organized by a single institution. For the past twenty years, the Biennials have been organized by the same institution or a group of institutions, as a whole or in part. They are not affiliated with any particular institution or with the artist(s) whose works are featured in the exhibition.The seventeenth Biennial will be organized at the São Paulo Art Museum in Brazil in September 2022. The next edition of the Biennials will be organized in the spring of 2024.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has launched an initiative to encourage cultural producers to utilize public art in their communities with the launch of a $500 grant program. The program will lend cultural organizations a $500 grant to use in their communities through the Fulton Preservation Fund, a government program that aims to preserve more than 3,800 works of art. The incentives include the ability to conserve one work for a maximum of four years, the development of a new public art project, and the design of an exhibition.The initiative first rolled out in 2018 with the launch of the Fulton Arts and Culture Initiative, a city-backed", "The next Biennial should be an incredibly diverse collection of works, which will be organized as an amalgamation of traditional and contemporary. The theme will be “The Future We Want” and the work of the studio will encompass work by artists from Greece, Italy, Morocco, and North Africa. The exhibition will take place in the space formerly occupied by the Minister of Culture, the Minister of Education, and the Minister of Culture, with the cooperation of the municipalities of Athens, Kias, and Thessaloniki.The themes of the next Biennial include “The Future We Want” (2014–2015), “Close Encounters: Artists in the Image of the World” (2017), and “Balance: The Future of Art” (2019).\n\n\nThe Museum of Modern Art (MoMA) in New York has created the first ever curatorial position at the National Museum of Women in the Arts (NMNA). The new position, which is part of the institution’s ongoing consolidation of its holdings of women’s art, will be announced in the coming weeks.“The appointment of Doris Bénétière as the museum’s first National Women’s curator is a milestone that", "The next Biennial should be held in 2021, which would coincide with the twenty-fifth anniversary of the festival, and the first year of the park. The 2019 edition, “The Unfinished Art of Biennial,” showcased the exhibition of work by twenty-one artists. The exhibition was organized by the artist-run platform Gallery86. “Two hundred years after the festival, in the year 2030, we are going to celebrate biennial,” said Yorgos Lanthimos, chairman of the exhibition and the museum. He added that there are currently more than thirty artists participating in the Biennial.The park will also be inaugurated with an exhibition dedicated to the history of the island and the region of Cyprus, titled “In Cypriot.” The exhibition will follow the historic event, which will feature some sixty hundred works by artists from all over the world. The artists will be selected by the renowned curator of modern and contemporary art, Osei Kounellis, who has curated the Venice Biennale for twenty-seven years. Kounellis will create a catalogue of the artists’ exhibitions, which will be on display in the new exhibition space.A retrospective of artist-designed UOV", "The next Biennial should be held in 2021. \n\n\nPioneer Works, a group of artists and designers based in New York City, has been awarded a $100,000 grant from the Charles and Lucille King Family Foundation. The funds will enable the group to design a new work for the nonprofit that will commemorate the family’s legacy. Designed by Pilar Zagorska, an independent curator based in New York City, the work will be based on works by the grant recipients from the first decade of the twentieth century.The Foundation first awarded the grants in 2015 in honor of its founder, the late Charles King, who successfully campaigned for the organization to begin hosting biennial exhibitions in the United States. In recognition of his efforts, the foundation will also name a street in honor of King and his wife, Lucille, and will install a plaque in front of the Whitney Museum of American Art, which is adjacent to the institution, that reads “Lucille and Charles King: Twenty-Fifth Century” in large type. The grant also includes a workshop on contemporary art and design at the Whitney, which will be organized by Marisol Meneguzzo, and a lecture series at the Whitney.Commenting on the foundation�", "The next Biennial should be called off if it does not address the current crisis—“the emergency,” the organizers write.\n\n\nThe German city of Baden-Baden announced that it is planning to shut down its Oktoberfest after the festival enters its third year of the event next month. The decision was made following an analysis of the festival’s projected revenue, which would have run into the hundreds of millions of euros, and the city’s plans to spend $90 million to relocate the biannual event to a new, state-of-the-art facility. In a statement published on Monday, the city said that it “wants to stop the festival’s main event, the New Year special, and to prepare for an uncertain future.”The announcement follows a spate of other drastic actions taken by German governments in recent months: Chancellor Angela Merkel announced in September that the state of Lower Saxony would be temporarily closed to the public for an undisclosed period of time, and President Horst Seehofer announced in September that the city of Bonn would be closed for six months. Another government-backed initiative, the Reinventionbau (Restructuring for the Future), aims to reduce", "The next Biennial should coincide with the twenty-fifth edition of the Biennale d'Art Contemporain, which is currently underway. That edition will be held in September 2020. The 2019 and 2020 editions were held simultaneously.\n\n\nThe Künstlerhaus in Vienna has been granted a temporary closure by the Austrian government because of concerns over the spread of Covid-19, a coronavirus that has killed at least twenty-nine people in Austria so far. The building, which is located in a former munitions factory and is located in the capital city of Vienna, has been closed since February 13 and has faced a shutdown since March 21. The Künstlerhaus, which has been shuttered since March 12, is also responsible for hosting numerous other artists and institutions. In March, the Künstlerhaus and the VU Berlin were also forced to cancel their spring and fall exhibitions, and this month the Künstlerhaus reopened in a palace in central Vienna.ÜAs a precaution, the Künstlerhaus is preparing to close down from March 14 to March 16, and temporarily suspend operations,” Austrian Culture Minister Monika Grütters said in a statement.", "The next Biennial should take place in 2020, and participants will include Akira Kawamura, Koji Nara, Rory St. John, Rayya Shoryuu, Yoshitomo Hoshino, Kazuto Takayama, and Louise Bourgeois. The theme for the centennial will be “We Are All in This Together.”The 2019 exhibition, “The Present,” was organized by a group of artists and intellectuals in collaboration with the Royal Academy of Arts to highlight the history of postwar and contemporary art and the present, and was staged at the Royal Academy of Arts in London. The show will feature twenty-one works by thirty-eight artists, including Andreas Georg Fischer, Cliff Richter, Jean-Michel Basquiat, Léuli Chernow, Alfred Kruger, Charlotte Sommer, Eleanor Roosevelt, Louis Vuitton, and Adrian Piper.The exhibition will include works by artists who have been active since the 1940s including Dyal Moth, Lippa Childs, Frederick Oosthuis, and Fiona White. �", "The next Biennial should be held in 2020.\n\n\n\n\n\n\nMina Laudel, the curator of modern and contemporary art at the City Museum of Art in New York, was named the winner of this year’s Tulane Arts & Culture Award. The $25,000 award recognizes a contemporary art curator who has demonstrated excellence in their field for the last twelve months. The 2019 recipient, Moma Elsayed, director of Contemporary Art at the Getty Center, was selected for her work, The View From My Window, which is currently on display in “The Room,” at the Museum of Modern Art in New York.Elsayed was nominated for her work, which explores the relationship between the artist and the viewer through the medium of cinema, and was awarded the award in recognition of her performance of the work in a performance that was staged at the Pulitzer Prize–winning Art of the Spot. The seventy-five-minute video is based on a story of a young Syrian artist who leaves his family to go to the United States to study at the University of Pennsylvania and eventually returns to his hometown to live with his grandmother. The artist’s grandmother becomes the subject of his first documentary film, a 2017 film", "The next Biennial should bring together scholars from the disciplines to reflect on the interdependence of art and the body and will include a virtual reality experience. The exhibition will invite both visitors and the public to experience the exhibition through the work of the artist.\n\n\nThe Museum of Fine Arts (MFA) in Boston has formed a new tenured position in the field of art conservation. Named William H. Smith Conservation Curator, Smith will be responsible for helping the museum raise the funds to conserve two hundred works of art and will take up his new post in January 2021.“In the years since we founded the Conservation Curator program, MFA has grown in stature as a global leader in conserving works in museums and collections across the city, and we have continued to grow in our ability to bring works to the museum for exhibition and research purposes,” said Mike Fries, chair of the board of trustees. “With our new mission, we are recognizing the importance of conserving the great art of our time and the importance of our collection for the museum and for the greater Boston community.”Smith, who has served as the Conservation Curator at MFA from 2010 to 2012, has recently been working with the conservators at the excavation", "The next Biennial should be in Washington, DC, and the West Coast, with the theme 'Sustainability and the Art of the Body.”The announcement was made on September 7, at a ceremony in Washington DC, where the biennial was originally scheduled to open in 2021. The twenty-third edition of the exhibition, titled “The Body in Art,” was originally scheduled to open in Tokyo in October 2021. It has since been postponed to October 21, 2021. An exhibition of twenty-seven works by twenty-four artists who are currently working in what biennial curator Sina Flemons describes as “virtual reality”\u0097the exhibition is currently being curated by Virginia Mullen, formerly of the Wellcome Collection\u0097will also take place in Los Angeles. The works will be on display alongside works by the artists themselves. “We are incredibly excited that the next Biennial will be devoted to art, and to the body in art,” said Michael J. Oster, director of the Walters Art Museum Los Angeles, who also serves as chair of the exhibition. “The Body in Art is an ambitious project, but a project that will deliver on the potential of the unique and", "The next Biennial should focus on the central role of the national art museums in the development of contemporary art in the country.\n\nMuseums, which have traditionally been considered the backbone of a cultural institution’s collection, are increasingly facing a financial shutdown. The first exhibition of the new exhibition season will open at the National Gallery of Art in Washington, DC, on March 15, 2020. Nearly two hundred other exhibitions, concerts, and other events scheduled for the gallery will also be canceled, and the gallery will be closed until November 27. The move follows a decision by the Smithsonian American Art Museum (SAAM) in D.C., which suspended events and exhibition programming across the board until March 15, and a decision by the Metropolitan Museum of Art in New York, which suspended all new exhibitions and events through at least April 13.While the timeline of the shutdown may seem daunting for many arts institutions, the National Gallery of Art in Washington, DC, which had hoped to host an exhibition of artworks that day, is anticipating a difficult reopening date of April 14, Chair Deborah Graner, the museum’s head of curatorial affairs, told the Washington Post that the institution is preparing for a three-week period of operations", "The next Biennial should take place in 2022. \n\n\nThe Louvre in Paris has released new renderings of the works that will be on display in the city’s Grand Palais on October 29, 2020, a day before the grand opening of the exhibition “Amerika,” which will be inaugurated by an exhibition of the artist’s works at Radisson Blu Marais in Paris on February 23. The exhibition will remain closed until March 14, 2020, and will feature work by fifty artists, including Aya J. Ben Amaya, Toshiro Mifune, Konrad Kamb, Yaakov Lipschutz, and Alan Moore. The show will be inaugurated by the installation of the artist’s first work in the Louvre.“Anomaly” will include works by twenty-four artists (including David H. Dinn, Catherine Bénétière, and Léonides Hardrada), including Antoine-Luc Michel, Rasmus Oehlen, and Victor Verlet, and will set the stage for “Amerika: A Modern History,” which will feature the works of forty-four artists", "The next Biennial should take place in 2020. \n\n\nThe collection of the German artist and scholar Wolfgang Augstein, whose work often incorporates photographs, drawings, and prints as well as monographs and sculptural projects, has been acquired by the Pires de la Villette Foundation, the Paris-based public collection center founded in 2015 by architect Marc-Olivier Pérez-Borósi, the former chairman of the firm Euler & Wolff Deringhaus.Pires de la Villette, which operates three locations in the city of Mirabel, consists of approximately 9,600 works in its holdings, which include paintings, prints, sculptures, drawings, architectural models, and historic works. The foundation plans to present its first exhibition of work by the artist in 2021.The acquisition of the artist’s collection has been made through the sale of works by the artist. The works received the designation of the Pires de la Villette Prize in 2017 and were exhibited in the third edition of the Museum Düsseldorf (Düsseldorf + Berlin), which took place in the German city of Düsseldorf in January of 2018. The works’ inclusion in the retrospective also coincided with that", "The next Biennial should be held at the end of the year, and the event would then have the opportunity to celebrate by presenting an exhibition on the concept of art in its entirety during the previous year, the artist said. The exhibition would also include an artist-in-residence program and a curator-run program, as well as a series of performances and other activities to mark the completion of the biennial cycle. Mulholland said that the program would offer a unique experience for visitors to the biennial. “This is a transformative year for art, and I am thrilled to be able to serve as a platform for artists to create experiences that reflect on the possibility of art as a tool for social change,” he said.\n\n\nThe London-based nonprofit Sargent’s Costume Institute (SCI) has received a gift of $115 million from the Christie’s consortium, which includes Christie’s, Marc Glimcher, and Michael Kors, in support of its expansion into the luxury goods industry. The donation includes $56 million for the institute’s new home in London’s Regent’s Park, and $16 million for its acquisition of a portfolio", "The next Biennial should be a celebration of the life and work of the late Russian critic Maxim Gorki. . . . The first exhibition in the series will feature works by seventy-five artists. The exhibition will run from October 8 to November 7.”A second exhibition of work by the same group will open at the Stedelijk Museum in the Netherlands in 2021. The fairs inaugural edition was held in July. This year’s edition will feature works by forty-eight artists. “The biennial is a modern artistic experience that is growing and evolving with us throughout the year,” said Marc-Olivier Bak. “We are thrilled to continue the work and to present the artists of our time. They are exceptional and will continue to be so.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) has granted the Museum of the City of New York a $1.1 billion expansion project, dubbed the CityBridge Initiative, to better serve its growing collection of more than six hundred works by artists of every generation. The $629 million project will add twenty-six acres of land and renovate the museum’s existing structure, which is currently home to the museum’", "The next Biennial should be held in 2020, with the date to be determined by the next President of the Republic of Croatia. The pavilion will be relocated from the Parliament to the Fondazione Centro di Finanzione in Turin. The exhibition will then travel to the Palazzo San Paolo, where it will be presented by the Croatian Museum of Art in the summer of 2021.\n\n\nThe Portuguese Museum of Fine Arts (Pramão) in Lisbon has appointed Alexandra Mallyon director of the new exhibition, “Les femmes du meno,” which will open in the capital city on September 2. Mallyon succeeds Játas and César Nilot, who will continue to direct the institution, which is currently closed due to the Covid-19 pandemic, and will be responsible for the development of the exhibition, which will take an interdisciplinary approach to the exhibition, construction and performance, and its interdisciplinary design team.“I’m delighted to be able to share with you the new stages of my career at Pramão,” said Mallyon. “I have deep respect for the team, the institution, and the architects behind the ambitious project of the", "The next Biennial should commence in 2021. \n\n\nThe Rema Hort Mann Foundation has announced that Christiane Herman has been named its next executive director. Herman comes to the organization from the New Museum in New York, where she has served as senior curator of modern and contemporary art. She succeeds Kate M. de Kooning, who retired in January 2019.“Christiane’s commitment to our work and her ability to understand and communicate with our artists, curators, and staff and her ability to bring those people together, has been immeasurable,” said Ann Kasteen, the foundation’s executive director. “We are very happy that this decision was made in their best interest.” Herman will assume her responsibilities on August 3. “The foundation has grown enormously in stature since its inception in 1984, and it has proven a model for how an art museum can work through difficult times,” Herman said. “I’m eager to work with the staff and artists on a variety of projects, and to expand the scope of my curatorial practice.”Commenting on her appointment, Herman noted that the organization’s new location in the heart of Manhattan has made", "The next Biennial should be the centenary of the opening of the exhibition “Spirited Away: A Return to the Art of the Silver Age”—a show of works by nearly sixty artists selected by the Dutch curator Joost Meeuwsen—and will launch on September 24.The Biennial will present works by artists such as Carl Yudof, John Paul II, and Willem de Kooning, as well as the late Belgian architect Antony and Henri-Marie Bielk, who were active in the 1960s and 1970s, and will also consider the work of recent decades, and will present a selection of special exhibitions. \n\n\nThe Anson Memorial Foundation, the Arizona-based nonprofit founded by the Anson brothers in 1988 to ensure the long-term care of their parents, has appointed John Hoberman as its next director and CEO. Hoberman takes the helm of the organization from Grant Thornton, which has been in the process of moving to the Phoenix headquarters since 2009.Hoberman, who has served as the Anson Memorial Foundation’s chief operating officer since 2013, will assume his responsibilities in June. Prior to joining the foundation, Hoberman worked as the chief curator of Contemporary", "The next Biennial should be organized as follows: 1. October 27, 2019. Saturday, October 27, 2019.  Saturday, October 27, 2019. Saturday, October 27, 2019. Saturday, October 27, 2019. Saturday, October 27, 2019. Saturday, October 27, 2019. Saturday, October 28, 2019. Saturday, October 28, 2019. Saturday, October 27, 2019. Saturday, October 28, 2019. Saturday, October 28, 2019. Saturday, October 27, 2019. Saturday, October 28, 2019. Saturday, October 27, 2019. Saturday, October 28, 2019. Saturday, October 28, 2019. Saturday, October 28, 2019. Saturday, October 27, 2019. Saturday, October 28, 2019. Saturday, October 27, 2019. Saturday, October 28, 2019. Saturday, October 27, 2019. Saturday, October 27, 2019. Saturday, October 28, 2019. Saturday, October 27, 2019. Saturday, October 28, 2019. Saturday, October 28, 2019. Saturday, October 27, 2019. Saturday, October 27, 2019. Saturday, October", "The next Biennial should make its debut sometime in the first half of 2020. The 2020 edition was originally scheduled to take place in January, but was moved to March due to the coronavirus. The March event will also feature a Summer Festival, a biennial of contemporary art.\n\n\nThe Jewish Museum in New York has received a gift of more than 1,700 works from the family of Andrew and Mina Eyre, who were a leading collector of Jewish art. The donation includes works by artists such as Louise Bourgeois, Pierre-Auguste Merak, and Joan Miró, among others who were a major part of the museum’s collection.“The family has been extremely generous in selecting works by artists they really admired,” said museum director Daniel H. Weiss. “The museum has been in the works for more than a decade, and only recently completed a comprehensive tour of the collection. They have been wonderful to work with and, like many families, Andrew and Mina’s insistence that we open a new facility in the city has been a source of great pride to all.”While the museum has been heavily criticized in the past for its decision to move several thousand works, the Eyre Collection has", "The next Biennial should examine the interrelationship between the modern and classical world institutions in Europe and the United States. It should also be concerned with the future of classical music and its relationship to the arts in Europe. We wish to see further that the exhibition is able to reflect the spirit of the past while reflecting upon its present. We are hopeful that the Biennial will become a new source of inspiration for contemporary artists.\n\n\nThe National Galleries of Scotland announced that it has received a grant of $1.4 million from the National Loteries and the Arts Fund. The partnership between the two organizations is designed to provide additional funding to the arts in Scotland. The National Loteries is an initiative of the National Loteries and Arts Fund (NLA) that provides more than $1.2 million in support of young artists through grants and fellowships. The NLA grant program was launched in 2011 to support the careers of young Scottish musicians. Since its inception, the fund has awarded more than $1 million to more than 1,500 musicians.“The National Loteries and the Arts Fund are committed to supporting young people by supporting their careers and helping them to secure work in the arts in Scotland,” said National Loter", "The next Biennial should be held in 2020, and the twentieth in 2021. The twenty-first in 2022.The Artist-in-Residence, Graham Linehan, will also continue to direct the exhibition space, and executive director Anna Wintour will serve as the presenter of the biennial. The biennial will now take place in New York, at Rockefeller Center, and at the Metropolitan Museum of Art. The 2020 edition is slated to run September 18 to September 20.The 2020 edition of the Biennial was originally commissioned by the artist-run space Artspace NYC, and was organized as a collaborative project between Linehan, Artforum editor-in-chief David Cheskin, curator Marisa Mendoza, and artist-activists and activists. The exhibition, which was curated by Linehan and inspired by his own life, will now be organized by the New York–based firm Twelve Arts and the artist-run space Biennale New York. The remaining artist-involved artists will collaborate with Linehan—including Rene Guggenheim, Robert Irwin, Robert Johnson, and Mark Dixon—to create an ideal platform for a new generation of artists.“I was inspired to create this exhibition at the invitation of the artists who created the", "The next Biennial should be held in 2021, said the organizers, who cited the festival’s continuities with the theme “in the tradition of Campo di Biennale, the relationship between artists and the historical organization, as well as the importance of community and of the creative processes in the city.”\n\n\nThe National Museum of African Art in Atlanta, which is undergoing a $450 million expansion, has announced that there will be a new, larger-scale version of its African American Art Museum (ABAM) as well as a new exhibit dedicated to the life and work of pioneering African American artist Bea Arthur. The institution also plans to open a new research center dedicated to African American art and the African diaspora in 2020.The $450 million upgrade is made in response to ABAM’s five-year goal of becoming a “modern, contemporary African American museum.” In an effort to achieve this, the museum’s existing building and grounds will be renovated and expanded, with a new museum-like building and grounds designed by the same team that designed the museum’s original location in the former Atlanta City Hall.“The design of the new museum is a reflection of how we as", "The next Biennial should be inaugurated by a bronze sculpture by legendary artist Ruy Teixeira (1909–2004) titled Tacita (Portrait of a Woman), which will be on view until January 25, 2020. The 2020 exhibition will comprise pieces by twenty-five artists, including Simone Leigh, Anne-Marie Lepine, Manuel Le Sippel, Cecil Massé, and Ed Ruscha. The full list of participating artists is as follows:ArtsPrize\n\nBeijing Art and Art Culture Centre (BACC) has announced that it has received a gift of 266 works from the Zheijiang Museum of Art in Suzhou, China, which was established in 1949 by the Communist Party, in an extensive project led by architect and urban designer Wang Zhijie. Wang’s wife, Wang Jiang, and his daughter, Li Yinyi, opened the museum in 2012 after several years of managing the family’s art, and the couple commissioned Wang to create the works after she met him at a party in Beijing in the early 1990s. The gift includes a selection from a collection that was recently sold at a Sotheby’s auction at a value of $91", "The next Biennial should take place in 2021, with the exhibition opening on November 6. For the first time ever, the show will be held in Hong Kong, the country that has been the epicenter of the ongoing pro-democracy protests in the city. The event will include a series of performances, readings, lectures, and other events that will be curated by artists from twenty-six countries, including China, Iran, Italy, Monaco, and Japan.  Hong Kong’s artist-in-residence, Liu Fei, told the Art Newspaper that the new theme is “a collection of the works of the Hong Kong Academy of Fine Arts, a group of contemporary artists and designers based in Hong Kong.”In her statement, Liu asserted that the exhibition’s new narrative, which focuses on the history of Hong Kong from an artist’s point of view, will “provide a new historical context for Hong Kong’s history.” She added that the exhibition will also “constantly challenge the liberal, pro-democracy agenda, which is currently dominating Hong Kong and attracting international media attention.”\n\n\nThe Pérez Art Museum Miami (PAMM) is preparing to", "The next Biennial should be held in 2020. S.A.M. will continue to organize biennial exhibitions to reflect on the work of a number of outstanding artists.\n\n\n\n\n\nThe Museum of the Modern Arts (MoMA) in New York has announced that it will open an endowment to establish the category of “artistic integrity.” The move is part of the institution’s ongoing efforts to recognize and celebrate the legacy of Louis Vuitton founder Joseph and Edythe Vuitton, who ran the company from 1948 until his death in 1967. The foundation was founded in 1995 as a way for MoMA to preserve and present Vuitton’s art, which includes the works of Renzo Piano, Paul Gauguin, Mark di Suvero, and William Henry Fox Talbot.The foundation will also invest $5 million to preserve more than 150 works by African American artists in the United States and will organize an exhibition dedicated to the collection in 2017. The first exhibition, “Sally Mann on Art,” will open at the museum in 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Amy Sher as its next executive director. Sher comes to the organization from the Metropolitan", "The next Biennial should be held in the spring of 2020. If all goes according to plan, the launch of the biennial will take place in the summer of 2020. The festival will be hosted by the Museum of Contemporary Art (MoCA), New York, and will run from March 22 through March 27.  The artist-run festival will be hosted by the artist-run group New Yorkers Against Art (NYCA), who are currently working toward reopening Central Park in the spring of 2021. Organizers are working to raise $200,000 for the event and are currently accepting donations.\n\n\nThe Noguchi-Henry Museum in Dorchester, Massachusetts, is currently seeking a new director. In its fourth year, the museum has hosted more than 1,200 artists and is currently home to the collection of Henri Matisse, Pierre-Auguste Renoir, and Pierre-Auguste Pereira. The search for the new director comes amid the ongoing controversy over the museum’s relationship with the controversial $3.7 billion renovation of the building, which is currently under construction and scheduled to open in 2021.Following a three-month public hearing, which was held on February 21, the museum board voted unanimously to appoint Sue B. Her", "The next Biennial should be held at the Museum of Modern Art in New York in 2021.  The Art Newspaper reports that the next edition of the exhibition will take place in April 2022, and the Biennial will be held in September 2022. The opening of the exhibition will be marked by a dedication ceremony attended by the museum’s director, Michelangelo Antonioni, and Roman Polanski, director of the Venice Biennale. The exhibition will be curated by Terena Viso, the director of the Museum of Contemporary Art in Hamburg and Berlin; David Winton, the director of the International Film Festival in Cologne; and Sara Zegart, the director of the Museum of Contemporary Art Cologne.“The Biennial is the most important project of my career, not only because of the achievements of the first twelve years but also because of the legacy it leaves for the future,” said Antonioni. The Biennial will be inaugurated by an exhibition of new work by twenty-one artists, and will return to the Museum of Modern Art in 2020 to celebrate the twenty-fifth anniversary of the inaugural edition. The series of exhibitions will be organized by theme. The Manila-", "The next Biennial should be held at the old Skeleton Museum in Halifax, Nova Scotia, in 2021. The first exhibition, “The Future Is Present,” was a retrospective of work by artists such as Galtān Chase, Robert Eggers, and Diane Arbus. It received a special award at the opening of the inaugural Biennial, which was hosted by the museum in 2012.\n\n\nGina Beavers, the former director of the Museum of Contemporary Art (MoCA), Los Angeles, has been named the next director of the Los Angeles County Museum of Art (LACMA). Beavers currently serves as the director of the Los Angeles County Art Museum.LACMA currently has a permanent collection of more than 1,500 works, including works by Kurt Weill, Ray Eames, and Louise Nevelson. It also boasts a permanent collection of more than 1,400 artifacts from the 1940s to the 1960s, including photographs, early paintings, and photographs by artists such as Andrew Lloyd Banks, Louise Bourgeois, and Robert Irwin.“I’ve been inspired by Gina’s ability to see and understand how important it is to have the option of participating in the LA County Museum of Art,", "The next Biennial should be held in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Atlanta has received a gift of seventy-five works from the Atlanta-based artist Thomas Harris. In a multi-year, $28 million refurbishment, the institution opened a new Thomas Harris Gallery in the Bicentennial Center on the museum campus in 2017. The gift includes the works of fourteen artists, including Roger Ailes, Mark Healy, and John Zorn, as well as the artist’s studio, the studio of a painter named Sue Campbell.Other works previously acquired by the museum include its collection of thirty-six Samuel Johnson paintings, which were recently moved to the Georgia Museum of Art; a work by Paul Gauguin, which will be placed on display in the museum’s permanent collection; and a collection of photography works by Henri Cartier-Bresson, known for creating this theory of light and its physical representation as a thin sheet of film.“I’ve been a big fan of Thomas Harris for forty years,” said museum director Roberta Smith. “And it is a pleasure and a joy to share this collection with our dedicated collection, and to bring it home to Atlanta.�", "The next Biennial should take place in the spring of 2020. This will be followed by a second one in the autumn of 2020; a third in the spring of 2021; and a fourth in the fall of 2021. \n\n\nAuctioneer Tadashi Moro, the Japan Contemporary Arts Festival (JCF), which has staged some of the country’s most significant exhibitions since it was founded in 1998, has announced that it is being discontinued. Its next edition, to be hosted by the Kobe Metropolitan Museum of Art in 2020, will be organized in collaboration with the National Museum of Fine Arts in Tokyo, which has relocated from the old venue, which is located in the city of Kobe, to a new location in the city of Nagoya.“I have been involved in the exhibition business for twenty years and am deeply honored by this new role,” Moro said in a statement. “The new arrangement will ensure our future exhibitions are accessible to a broad audience. I am confident we can achieve this goal.”The auction house will retain full control of the exhibition, as it has with all previous editions of the event, including the previous two editions, which were staged at Tokyo Metropolitan Museum of Art and at the Noguchi Museum", "The next Biennial should take place at the Museo de Arte Contemporáneo (MASC) in Madrid from March 20 to March 21, 2020. The theme, “Bienalismo” (Land and Life), will be the subject of a new exhibition, “Bienalismo II: Extraction and Embracement” (March 19–March 23, 2020), at the Museo de Arte Contemporáneo (MASC), curated by Stefano Gattani. The exhibition will be preceded by a “Three-Year Anniversary” of a group show at the Museo de Arte Contemporáneo (MASC) on January 24, 2019–February 5, 2020.The first show of the trio will take up the theme, “3-Year Anniversary” at the Museo de Arte Contemporáneo (MASC). The grouping, which took place in several countries across Spain and the northern region of Catalonia, included a collaboration between artists, architects, collectors, and collectors’ palmares, such as Maria Mals at the Museo de Arte Contemporáneo, Barcelona. The exhibition will be divided", "The next Biennial should be held in 2021. The theme of the upcoming exhibition will be “The Body/The Life of Art.”\n\n\nArt Basel Hong Kong has announced that it is moving the next edition of its Hong Kong fair to March 26–March 28, 2020. The decision was made after Art Dubai, Art Dubai America, and Art India canceled the fair due to the ongoing protests against a new contract awarded to British artist Pendleton Hawes, who is currently working on a new exhibition at the fair.Organizers cited security concerns as the reason for the cancelation, but questions about the security situation in the city remain. Some art dealers and collectors are concerned about the timing of the move, as many protesters are protesting the announcement of a new labor contract, which would run through 2021, and are demanding that organizers delay the opening of the fair and postpone its 2020 edition.As the protests in Hong Kong escalate, the British High Contracting Authority (HLCA), which represents galleries and auction houses, announced that it will not renew contracts with galleries that fail to implement changes made to prevent the coronavirus. Among the institutions that are facing financial losses are London’s Tate galleries, which are estimating a loss of $160 million,", "The next Biennial should be held in late spring/early summer 2020. The fall 2019 edition, “A Legacy of Mirrors,” will be staged at the V&A until 2021.The biennial will feature works on paper, sculpture, photography, performance, performance-video, and installation, and will take up themes from Ralph Waldo\u0097who was a curator at the V&A and a teacher at the Kalamazoo School of Art\u0097to the history of architectural design, the art of architecture, and the history of art. The 2019 awardees were: Astro Al-Hussein\u00972001, “Sharon Bossuyt,” 2011, Kirsten Lewis’s Babylon,” and John Nash’s Heroes of the Nile,” all of which were presented at the exhibition.\n\n\nIn the wake of the devastating fire that tore through the experimental east London institution the Pint Shop on December 2, 2016, the Pint Shop Foundation and the Royal Shakespeare Company have launched a new £10 million fund to help rebuild its archives. The £10 million fund is part of a $12 million package that also includes", "The next Biennial should be held in 2020. “While it is a great honor to present the 25th Biennial of the Biennials in the Grand Galerie, I am confident that we will achieve this goal,” said Søren. “And I am confident that we will continue to advance our work in this way for many years to come. All things considered, I think it is good news that we are finally able to launch the exhibition. I believe that we will become the first and probably the only major museum to launch a new series of exhibitions in the new millennium.”\n\n\nThe Japanese artist Katsuya Nakahara’s recent exhibition at the Museum of Contemporary Art (MoCA), Los Angeles, has received a major boost from the Los Angeles County Museum of Art (LACMA), which unveiled a new ten-thousand-piece, twelve-acre sculpture garden in the city last week. The sprawling green rectangle, which stretches approximately eight miles\u0097Nakahara’s final work for the exhibition, Anata no Uta, is set in a lush, painted garden surrounded by trees and has been installed in an area that was once a pasture. Built in response to the", "The next Biennial should also include a survey of the work of the Hirshhorn Museum and Sculpture Garden, which reopened in 1882 after more than twenty years of renovation following the construction of its new campus in 1999. The museum is currently working toward completing a new survey of the work of the Getty Museum, which opened in 1971, and a new exhibition dedicated to the history of Jewish art.Commenting on the biennial, Sharon Rosenfeld, director and chief curator of the Hirshhorn Museum and Sculpture Garden, said: “The first Biennial was a major step in the long history of the Museum, and we are extremely proud of having contributed to its legacy with the selection of seven outstanding works for this year’s edition. We are especially delighted to present the work of artist Martin Luther King Jr. for this year’s occasion. His work embodies the spirit of the museum as it has always lived and thrived in the diverse communities he lived and worked in.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has announced that it will no longer host the three-day exhibition “NIRIN,” which was held in the museum since 2015. The exhibition has been closed since", "The next Biennial should, in my opinion, be on subjects of the relationship between art and the body. The next will be on the relationship between the body and the environment. And the third should be on the body and life itself.”However, according to the New York Times, the upcoming exhibition may not be realized. The show has been moved to a different venue due to the Covid-19 pandemic, and the 2019 edition, titled “Lincoln,” will reopen in the fall.According to the New York Times, the museum is planning to close its current exhibition space, the Science Fiction Theater of Harlem, in March 2020 and to construct its new Science Fiction Museum in the fall of 2020. The museum is currently working on a redesign for its building, which is bisected by the Hudson River in Manhattan, including the redesign of the galleries and the event spaces. While the redesign is expected to be completed by December of 2020, the institution will not reopen until March of 2021. While the redesign will not impact the primary exhibition spaces, it will affect how the public will be able to access them.In an attempt to encourage more participation from visitors, the museum will offer free admission for children under eighteen years of age on several Saturday evenings", "The next Biennial should take place in the fall of 2020. The art of the future, Hiroshima-Yamato, is currently on view in Tokyo from February 12 to February 14. The exhibition will also feature work from the newly established Annapurna Art Museum. The exhibition, titled  “The Future of Life,” will be on view until February 17. Following the show, the museum will hold an open house to the public from February 17 to February 22. The exhibition will be followed by a lecture series on March 7 and a special exhibition on March 13. The first chapter of the third Biennial will open on December 14. Foremost Contemporary Art is also organizing a series of exhibitions in collaboration with the National Gallery of Art (NGA) in Washington, DC. The first show is titled “KIN” and will run through March 24. The second show is titled “Theoretical Art” and will run through March 20. The third show will be titled “On the Nature of Things” and will run through March 22. The Brooklyn-based nonprofit art distributor Lisson Gallery is joining the NGA and the Metropolitan Museum", "The next Biennial should be held in the spring of 2020.\n\n\nThe German parliament voted on Thursday to establish a new $100 billion fund to compensate cultural workers who were negatively affected by the coronavirus. The measure was approved by a vote of 248 to 129 and now goes to the Bundesrat, the German parliament, for its approval. The federal state of North Rhine-Westphalia will get $65 billion, while the federal state of North Rhine-Westphalia’s state government will get $42 billion. When the federal government created the fund in 2016, it set up the fund as part of a deal with the European Union to compensate the states for billions of euros owed them by the multinational pharmaceutical company Bayer.Under the deal, the states were allowed to sue Bayer for up to $10 billion—roughly tripling the $6 billion that the company owed the EU. However, the lawsuits are only valid if the EU agrees to pay the states back at some point between April and June of 2021. If the lawsuits are successful, the states will be able to claim up to $16 billion—more than tripling the $3 billion that the company owes the state of North Rhine-Westphalia. Artist-", "The next Biennial should be a \"ruthless attack\" on the institution, said director Matthias Preuss. “Each year we strive to introduce a different strategy and this year we want to make the Biennial a true reflection of the city and the collection. There is a certain elegance in this way of looking at the collection and of doing things which is antithetical to the monolithic and monotonous art collection, but is in keeping with the great traditions of the museum.”\n\n\nThe City of New York has awarded the estate of Frank Gehry and Robert Rauschenberg $8.5 million in a settlement involving a grand-scale renovation of the Frank Gehry and Stanford Mathers’s former headquarters in Midtown Manhattan. The funds were announced today by the city’s Cultural Affairs Agency, which represents the Architectural and Sculpture Biennials, and the firm behind the work, Hogan & Hartson (H&H), as part of a $50 million settlement that resolves an ongoing legal dispute between the two sides. “This is a historic day,” said cultural affairs commissioner Tom Finkelpearl. “It’s a victory for the city of", "The next Biennial should be held within six months of the date of the present exhibition. The year 2020 should be chosen by the artistic director of Milan, Roberto Cicutto, who has already stated that the event will be about the future. “I think we need to create a new space to move beyond the current exhibition, to think about new spaces, new kinds of exhibitions, new visions,” Cicutto told the Art Newspaper. The Florence Biennale is set to run from April 23 to April 29, 2021. \n\n\nThe City of Toronto is preparing to welcome visitors back to the city from a nearly six-month hiatus due to the Covid-19 pandemic. City council approved a $3.4-billion budget for the 2021 fiscal year, which was introduced on Monday, and enacted a slew of economic and infrastructure initiatives in an attempt to help the tens of thousands of people who were forced to evacuate their homes and businesses since the city began reopening on March 16 due to the virus. “We are now ready to welcome you back to Toronto,” Mayor John Tory said, adding that the city is working closely with the province, the federal government, and First Nations to ensure the city", "The next Biennial should be held in Paris in 2022. The event has received funding from the French Ministry of Culture, and is supported by a budget of €166,500.\n\n\nThe Fine Arts Museums of the Philippines (FAMA) and the City of Manila have jointly launched a new joint venture to promote the collection and exhibition of art in Southeast Asia. The initiative was launched in partnership with the City of Manila and the University of Santo Tomas.“FAMA’s mission is to foster a sense of community among artists, enhance their understanding of art and culture, and facilitate their appreciation and appreciation of the arts,” said George Torga, president of the two organizations. “Through the partnership we hope to continue to host important works and to serve as a model for collaboration and exchange in the art and culture sector of Philippine society.”The new initiative, “Para Tropas Artes” (Triple Seas), will launch in two phases: Phase I will launch in Fall 2022 and Phase II will launch in Spring 2020. Both institutions will be located at 8400 Cebu Davao Boulevard, the same building where the former headquarters of the Philippine Film Academy (PFA) were relocated last year.", "The next Biennial should address the movement from one form of art to another, and should consider how the work of contemporary artists may be rendered in a new medium. The exhibition should also consider how “non-institutionalized art” may be further reconceived in the future.\n\n\nSittke Gallery, which represents the late Swiss artist Max Beckmann in the United States, has appointed Jillian Gallant as its new senior director of contemporary art. Gallant, who rose to prominence in the 1970s as a key member of the experimental New York–based group CAA/CAMM, died in New York on March 31. She was seventy-one years old. Gallant’s work often reflected a deeply contemplative quality, a near-monastic, meditation-like quality, that defied easy categorization and served as a spiritual refuge for the artist. Gallant’s art, which often represented a spiritual element of the artist’s existence, was often at odds with conventional conventions of postwar art and in constant flux. In 2015, a retrospective of the artist’s work at the Museum of Modern Art in New York was held at the Swiss Federal Museum in Zurich, but the institution canceled the show after", "The next Biennial should begin in 2020 and will encompass twenty-three artists, including activists, artists and writers, and will focus on the contributions of women and girls through visual arts and culture.\n\n\nThe Musée d’Art Contemporain (MAD) in Paris has appointed the Tunisian artist Jumana Aziz as its next director. Aziz, who was selected by a jury composed of Métaux-Berger, Daniel H. Basquiat, Jean-Michel Basquiat, and François Ghebaly, will be tasked with moving the museum from its current location in a residential building in the city of Ghebaly to a new facility in the Musée d’Art Contemporain.“The proposal for the new MAD covers a number of ideas that are deeply rooted in the Musée d’Art Contemporain’s own history. Its contemporary, contemporary-oriented architecture, on the one hand, and the museum’s tradition of creating new works of art, on the other, are extremely important for the institution, which has recently received a lot of attention from new and established visitors,” said Métaux-Berger. Aziz", "The next Biennial should take place in the village of Corotina and will be held at the Museo de Arte Contemporáneo de Porto, Bogotá, from September 25 to October 5. The exhibition will be organized in collaboration with the local community.\n\n\nThe National Geographic Society’s Endeavor Contemporary’s 2018 edition in Beijing was canceled last week after a fire damaged the sixth-floor exhibition space. The fire, which is still under investigation, may have started on the fifth-floor terrace, where the exhibition was taking place, or the roof of a nearby building, which is owned by the organization. The exhibit, which was to feature work by contemporary artists such as Richard Diebenkorn, Joel and Ethan Coen, and John Currin, was to open to the public on October 18.The first fire alarm was raised around ten A.M., when Sarah Sze, an international curator, said she saw a large fire in the building. She rushed upstairs to the sixth-floor terrace and called for the firefighters to come quickly. The building, which is on the fourth floor of a gray building in Beijing’s 798 district, was not damaged. The fire", "The next Biennial should be held in 2022.\n\nThe Institution of Contemporary Arts\n\n(New York: the newly renamed Richard A. Kaplan Center for the Arts, founded in 1991; the organization is run by an executive committee that comprises two academics, Daniel B. Kaplan and Hezekiah Johnson; and the organization recently received $7.2 million from the Breitman-Kemp gift to assist in its expansion. The artist-run centers will remain open until March 31, when the institution’s regular opening date will be moved to April 14, 2022. According to the New York Times, the center will also host seventy-eight exhibitions in all of its sixty-three venues from March 25, 2022 to March 31, 2022.In addition to its partnership with the Center for the Arts, the institution has partnered with the Museum of Fine Arts, Boston, the Museum of Modern Art, and the Metropolitan Museum of Art to help advance its mission. The projects include the development of a new public gardens in the Home Depot where the institution’s three-hundred-year-old Ethiopian art museum will be located; the acquisition of more than four thousand works by seventy-five artists who are currently on display in the museum’", "The next Biennial should be held at the Historic Jewish Museum in New York in 2021, the New Art Dealers Alliance (NADA) in November 2021, and the Metropolitan Museum of Art in March 2021.\n\n\nThe British artist Paul Gauguin has passed away. He was ninety-six years old. The French philosopher developed many of the modernist paintings and sculptures that have influenced the twentieth and twenty-first centuries, and he was a leading proponent of the \"new art\" movement.Born in Paris in 1926, Gauguin began his artistic career as a painter in the 1940s. He continued his art practice at the Museum of Modern Art in the early 1950s and began to break away from the mainstream in the 1960s, pursuing a radical and avant-garde style. His experimental art was influenced by the avant-gardes and the avant-garde movements of his youth, as well as the work of contemporaries such as Jean-Michel Basquiat and Henri-Georges Apostu. It also reflected his growing awareness of the impossibility of building an audience for an art exhibition, and his desire to explore new forms of performance through light and sound.“Gauguin’s three-dimensional paintings are", "The next Biennial should take place in 2021. Participation in the 2020 iteration will begin in February 2022.\n\n\nThe Institute of Contemporary Art (ICA) in London has appointed Lévy Gorvy, Paris’s Rochat and Sacher-Jackson as partners in its upcoming exhibition “Art in Motion,” which will bring together works by twenty-six artists in the exhibition from April 20 to May 28, 2020. “As all of us who love art know, the art of motion is a central concept in contemporary art,” said ICA director Kamala Islam. “The exhibition will allow artists to take a leap into the future and into the future will allow artists to take a leap into the future.”The new partnership will focus on two themes: the development of new ways of looking at and working with art and the relationship between artists. The first section of the exhibition will focus on how art can be reworked to benefit and challenge contemporary issues such as climate change and social injustice. The second section will explore the ways that art can act as a tool for social change such as the Paris Climate Accord.The new exhibition, Art in Motion, will take place in the museum’s new former location", "The next Biennial should be held at least once a year, but might be extended to coincide with the actual lunar eclipse. As well as the exhibition, the museum will stage an educational yearlong program, which will explore aspects of lunar architecture and history, and will organize a variety of activities, including performances, performances, concerts, screenings, presentations, exhibitions, tours, performances, exhibitions, screenings, presentations, lectures, performances, concerts, performances, performances, performances, performances, performances, performances, presentations, performances, exhibitions, exhibitions, lectures, performances, concerts, performances, performances, performances, presentations, lectures, performances, plays, performances, plays, performances, plays, performances, plays, plays, plays, plays, plays, plays, plays, plays, plays, plays, plays, plays, plays, plays, plays, plays, plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Plays, Playners, Playists, Playists, Playings, Playing,   Playings, Playings, Play", "The next Biennial should be held in 2022 and will be led by Professor Mark Dekker, the director of the A.I.R. Gallery in London and a professor of Russian and Russian studies at the University of Greenwich. In the meantime, the Biennial Research Group, which was established by the A.I.R. Gallery and the University of the Arts London, has published a paper on the exhibition that cites the experimental art of the exhibition as one of the reasons for its focus.The full list of participating artists is as follows:Andreas Deimann (Germany)Ajay Agrawal (India)Ben Brown (USA)Ben Gass (Australia)Ben Jonson (USA)Bennaro P asano (Italy)BORIS DASCHLE (Germany)Borislav Mertchevski (Russia)BORIS LAUTENS (Germany)BORIS LAUTENS (Germany)BORIS LAUTENS (Germany)BORIS LAUTENS (Germany)BORIS LAUTENS (Germany)BORIS LAUTENS (Germany)BORIS Mertchevski (Russia)BORIS LAUTENS (Germany)BORIS LAUTENS", "The next Biennial should be staged in 2021. “The biennial, like all the rest of its kind, is a process, and a process is what we do,” said the artistic director, Yvonne Hermens. “We are making the best possible exhibitions possible, which are free to the public, under the great supervision of the curator, which is why the exhibition is still in the planning stages.” Regarding the biennial’s future, the curator commented: “We are still working through a number of issues, including whether to start a new museum, and how to organize exhibitions in an open and collaborative way. We will continue to make exhibitions in our normal way and will decide together in the coming months whether to start a new museum.”\n\n\nThe exhibition “Infinite Jest,” curated by Gilbert & George, will move to its new home at the New Museum in New York next year. The show, which celebrates the work of contemporary artists in the United States, will include works by artists such as Hélio Oiticica, Matt Hullum, Kate Mulgrew, and Craig Pearson, as well as an exhibition of work by American artists such as Rex Alber", "The next Biennial should be held at the Royal Academy of Arts, London, in 2021.\n\n\nThe National Galleries of Scotland announced today that Alyn Hewitt has been appointed as its next chief executive. She succeeds Suebik Shah, who has led the institution for twenty-five years, and will take up the post on January 5, 2022.“I’ve been involved with the National Galleries of Scotland for twenty-five years and have witnessed first-hand the growth in stature, international reputation, and impact of the National Galleries,” Hewitt said. “I’m excited by the prospect of working with Ruth and the National Gallery team to advance the National Gallery’s ambitions in multiple new ways.”Hewitt joins the National Galleries of Scotland from the Royal Academy of Arts, where she has served as chief executive since 2010. She succeeds Suebik Shah, who will retire in March 2020 following twenty-six years at the helm of the institution. Shah, who was appointed director of the National Galleries of Scotland in March 2018, was succeeded by Mary Grafton at the helm of the National Gallery of Wales in March 2019.Commenting on her appointment, Hewitt said:", "The next Biennial should take place in the fall of 2019 and will focus on a new and larger collection of prehistoric and early modern art from the Americas. The theme of the exhibition will be “Life in the Late Pleistocene.” The artworks will be presented in a new exhibition titled “Life and the Late Pleistocene,” which will open on February 29, 2020 at the Museo de Arte de San Andrés in Madrid. The show will include works from the exhibition “Echoes of Life” (2019); “Life as Contemporary Art” (2019); “Laying the Ground for Art” (2019); and “Lehmann Maupin: Curse of the Modern ‘Life’” (2019). This year’s edition of the biennial will be hosted in the museum’s new building (designed by the architect Cécile Bailleux) and will be accompanied by two special exhibitions, “Nan Goldin: The Art of Life” (March 14–March 21, 2020) and “Nina Grant: The Land on Life” (March 21–March 29, 2020).The biennial�", "The next Biennial should begin with a community workshop in September. Guests will be asked to provide images of themselves in their homes and will receive a guided tour on the museum’s years-long journey to bring exhibition-quality works by innovative artists of color.The first exhibition of work by visual artists of color is a multiyear collaboration between the Milwaukee Art Museum and the Seattle Asian Art Museum. Titled “Mid-Century Modernism after the Fall,” this show will showcase work by nineteen African American artists, including Don Carolina, Donald Byrd, and Ruth Harlow. It will also include a discussion of the impact of the Black Lives Matter movement and the legacy of African American artists in the United States.“Contemporary Art’s Future: Race, Civil Rights, and the Present” will be presented by the Dallas Museum of Art in March. The first half of the exhibition will be divided into biennial sections, which will focus on contemporary art from the Black and African American communities. The second half will feature work by artists whose work is currently on view and will be free to the public.The Tulsa Art Museum is launching a new initiative focused on diversity and inclusion. Called “Diversity Explorer,” the program will", "The next Biennial should be held in May 2020.The announcement follows a number of major exhibitions, including the Los Angeles–based independent biennial For the Selfish Art of Art, which was canceled last month, and “City of Sun, City of Rain,” which was scheduled for March 2020. The exhibition was moved to June 2020 and “Arts in America” was rescheduled for April 2020. The Cannes Film Festival, hosted by French giant Agnès Varda, is still scheduled for May 2022; and the Hong Kong Biennale, which was rescheduled for March 2022, remains on schedule for May 2022.\n\n\nFrench president Emmanuel Macron has granted the National Assembly the authority to ban five hundred religious organizations from the country’s capital, Paris, for failing to secure the support of sixty percent of the country’s MPs. While the institutions must show a commitment to “deepening the understanding of the French state and society, to guaranteeing fundamental freedom of religious expression, and to achieving a political decision based on the values of tolerance, solidarity and solidarity,” Macron said in a statement. “All these steps are necessary to fulfilling the tasks entrusted to us by our", "The next Biennial should run from February to March 2021, and will host activities such as a symposium on “intimate art,” and “love and marriage,” according to the organizers. “The museum is committed to supporting the work of the distinguished professionals who have created the most important exhibitions of our time,” wrote Maurizio Giannini and Andrea Tschäpe in a joint statement about the new partnership. They added that the two institutions will continue to collaborate as they continue to support the biennial’s programming and the public.\n\n\nThe Victorian and Edward Hopps Art Museum in London has canceled a presentation of a new project by Canadian artist and painter Cindy Sherman after she posted a statement online accusing the institution of promoting “anti-feminist” and “anti-humanist” content. The program, titled “Earthness,” was to feature photographs by Sherman that were sourced from her own personal collection. The installation, which was to open on March 12, was meant to celebrate the opening of the museum’s new building, the David and Lucie James, the former residence of James and Violeta James, in Kingsland.According to Art", "The next Biennial should be held in 2021. If the project is approved, the project will be completed in 2021. Commenting on the project, Malaysian artist and curator Tan Sri Siti Nusseibeh will head the first art-world biennial. Siti Nusseibeh will be accompanied by a team of sixty artists, technologists, and designers. She will also create a new digital platform, VIP, that will allow visitors to experience the latest and greatest works from the contemporary Malaysian curatorial scene. The first pavilion is currently undergoing the construction of the new National Gallery of Malaysia. Commissioned by the National Gallery of Malaysia (KIM), the inaugural exhibition will encompass seventy-nine works that depict contemporary art, as well as a reinterpretation of the Malaysian constitution. Inaugurating the Biennial will be a special exhibition titled \"In Defense of Diversity.” The exhibition will feature works by seventy-eight artists from fifty-seven countries and territories and will present them against a backdrop of a biennial-sized installation that will feature more than 365 sculptures. The inaugural event will be staged at the Haida Museum of Art, B.C.,", "The next Biennial should be held in 2021.\n\n\nAfter the Museum of Contemporary Art (MoCA) Chicago canceled its March 14 edition, citing the financial impact of the coronavirus, citing the “health of our staff, our collection, and our visitors.” The cancellation was prompted by a lack of interest from the institution in attracting more visitors, particularly in the form of large corporate or institutional events. The March 14 edition featured work by forty-six artists, including Bernardo Cali, Carlos Castillo, and Valeria Cervetto, among others who were invited to the museum, such as Joan Miró, Robert Irwin, and Shirleyne Houde.On March 12, MoCA issued a statement about the situation, which read: “We are aware that many visitors are disappointed due to the cancellation of our March 14 exhibition. We understand that these were some of the most anticipated and most enjoyable exhibitions of the year and many of them will be back to see our shows next week. We are sharing our thoughts with our staff. We are gathering ideas for how we can work with our galleries to make MoCA even more accessible to audiences of all ages.” The statement concluded with a promise to “continue to listen", "The next Biennial should focus on how experimental and conceptual art can be reworked to address and explore themes such as citizenship, citizenship's relation to the body, and the body as a social and political institution. The next edition will also feature new works by young and established artists.“Art, culture, and social reform in the twentieth century is a long road ahead,” said Pilar Corrias, president of the Biennial Fundamentals, the nonprofit organization that runs the biennial. “We look forward to welcoming you to our great city!”Salvador Dalí, Pablo Picasso, Frank Stella, and Damien Hirst will speak at the biennial’s event on October 5. The biennial’s press release does not mention the upcoming art event.\n\n\nThe Institute of Contemporary Arts (ICA) in New York is releasing several curators from prison for their role in the death of Charles Lenoir, a man who was arrested in 2014 after he allegedly choked to death his ex-girlfriend in their apartment in Midtown Manhattan, then tried to burn her body in a fireplace in January of 2019. “Charles Lenoir was an abusive partner and a shitty human being,” said Kennedy", "The next Biennial should be held on January 10–January 13, 2020.\n\nThe next edition of the Triennale will take place in Helsinki in March 2020. The third edition will take place in the Finnish capital in September 2020.\n\n\nThe fourteenth edition of the Fifty-Ninth Venice Biennale, curated by a select group of under-recognized and highly talented artists from twenty-six countries, will take place in Rome in March 2021. Titled “After Venice,” the exhibition will comprise three studios in Venice: the workshop, which will showcase the work of a select group of under-recognized and highly talented artists from the eighteen countries, and the exhibition, which will bring together the work of art of twenty-six under-recognized and highly talented artists from fifteen other countries.“The Venice Sculpture Biennial: After Venice” will be hosted by the Italian city of Rome, the Italian state of Lombardy, and the Italian state of Sicily.“We are grateful to the participants of the Venice Sculpture Biennial,” said Stefano Cipolletta, president of the Italian state of Lombardy. “They have given us the opportunity to", "The next Biennial should be held in 2022.\n\n\n\n\n\nThe New York artist who created a series of installations that dramatize the New York City subway system, called the Met-6, commissioned by the artist and the artist’s son, Jonathan, to make the installations a work of art. Titled The Met-6 Works, the installation was made in collaboration with New York–based artist Renzo Piano. The works are located on display in the exhibition “The Met-6: Works on Paper” at the Museum of Modern Art.The works are centered around a subway car, which actually consists of two different cars traveling in opposite directions. Jonathan and Renzo created the subway car, which is 4,500 feet long, as a series of interactive installations. On the car, which is aboveground and encased in glass, are paintings, sculptures, photographs, and videos, as well as a pair of subway doors, which open to reveal subway tunnels.The Met-6 works were created using metallurgical, chemical, and hydrographic technologies. The artist started the series in 2009, when he was commissioned to create a work for the exhibition “Christopher Wool” at the Armory, the Museum", "The next Biennial should take place in the fall of 2020.\n\n\n\n\n\nThe Museum of Contemporary Art (MoCA) in New York announced today that it is now accepting applications for the 2019 iteration of the “Art of the Party,” a contest that provides $25,000 to artists who demonstrate their work at a live event. The collaboration, organized by the New American Foundation, will award $5,000 to the first person to win the $50,000 prize.The 2019 winner, a Chinese artist named Guanyin Shangqiu, will receive $75,000 in prize money. Shangqiu, an artist who specializes in modern and contemporary Chinese art, has yet to present the work that will be featured in the 2020 edition.A long-standing MoCA curatorial practice, the exhibition featured work by seventy-five artists, including Naomi Campbell, Barbara Kingsolver, and Karla Cole-Brown, as well as a retrospective of works by artists such as George Condo, Robert Irwin, and Rosalind Nash. The exhibition also celebrated the institution’s acquisition of the oldest surviving work by American painter Claude Monet. The work, The Moon, is one of fifty works acquired by the museum in a six", "The next Biennial should be a continuation of the themes of the previous two, and should take place in Europe and Asia, respectively. For the first part of the exhibition, the new venue will feature more than 2,500 paintings by contemporary artists, with the exhibition marking the first major retrospective dedicated to the artist in his home country.\n\n\nThe Museum of Fine Arts (MFA) in Pasadena, California, has awarded $25,000 to five artists whose innovative work addresses issues and topics that are central to the contemporary art world: Ali Fadlallah, Tarek Atoui, Hadi Engy, and Nima Herat. The winner of the $15,000 grant will be chosen by a jury composed of Alex C. McLachlan, director of the MFA; Emma Melton, artistic director of the Los Angeles County Museum of Art; and Sarah Fogle, director of the MFA.The project, titled “The Date,” is based on the idea that the date at the end of the year is an important time for artists. In a blog post for Artforum, McLachlan explained: “It is the moment of greatest creative possibility, the moment when the artist, in his or her most", "The next Biennial should be held in 2020, and the venue should include a gallery as well as a museum. In a letter published last week, the organisers said that the title of the exhibition was an obvious departure from Biennial 39. However, the decision to alter the exhibition was made in a bid to reassure critics and other visitors that the Biennial would continue to be a platform for artistic and cultural diversity. The redesign, which is comprising of twelve new elements, was inspired by the redesign of the Biennial 6, which took place last year. The new spaces are designed to act as a hub for the exhibition and its collection. The five-meter-high pavilion will also boast a new, five-story library that will house a series of exhibitions. The architects designed the building and the surrounding campus in response to the needs of a contemporary, urbanist, who is increasingly concerned with the sustainability of urban spaces, and a capital-intensive, multimillion-dollar capital-intensive art museum.The new exhibition space will be situated atop the current industrial estate, designed by the German firm Koenig & Partners, and is expected to cost RM2.5 billion (US$2.5 billion) to construct. The renovation of the", "The next Biennial should focus on the legacy of Sir Richard Attenborough and the exhibition should explore the intersection of art, life, and politics. The theme of the 2020 iteration should be “Forms and Actions: Contemporary Art and Politics” and the biennial should be held in partnership with the London-based exhibition space the Public Art Fund. The full list of participating artists is as follows:Andreas Ehrlich and the German conceptual artist Martin Balsom, Germany (April 15–April 19)Theoretical artist Erich Ezell, Germany (April 16–April 22)David H. Gibson, United Kingdom (April 15–April 19)Art historian Babette Adler and the Swiss artist Andreas Newkirk, Germany (April 15–April 19)Nina Montoya, Spain (April 16–April 22)Kai Hu, Finland (April 14–April 22)Christian Martin, Germany (April 15–April 19)Marianne Phillips, Australia (April 15–April 19)Theo Wirathu, Indonesia (April 15–April 19)Roberto Di Cáceres, Italy (April 15–April 19)", "The next Biennial should take place in 2019, and the first in 2021. The institution will also inaugurate an international exhibition of works by contemporary artists, an open-studio platform for the arts, and an online library of more than 4,600 works. The talks will be organized by theme, with Curator Hetain Gupta, curator of Indian art and architecture, and artist and researcher Ravi Shankar as guest curators.\n\n\nThe National Gallery in London has appointed Marc-Andre Joly as its new chief executive officer. He succeeds Lily Cole, who has helmed the gallery since 2017, and will begin in her place on January 6, 2021.“Lily was passionate about making the National Gallery a global leader at the time of her departure, and has been since then, leading the gallery to new heights of prestige and success,” Joly said in a statement. “Her ability to inspire and foster a sense of community, her vision for the gallery as a major cultural and creative destination, and the National Gallery’s ability to adapt and evolve to take on ever-more complex challenges, are all strengths that will help us to build on her legacy.”Cole, who succeeded J", "The next Biennial should be set up within the next two months, with the aim of developing a programme for the exhibition which is accessible to a wide public and which will include works which are available for free viewing.  \n\n\nArtnews reports that the British designer Ethridge Gee has won the first edition of the New York Creative Architecture (NECA) Show, which runs from March 27 to March 29. The two-month long event, which brings together a number of international and local designers, is sponsored by Christie’s and is held at Rockefeller Center in New York.The first iteration of NECA, held last year, featured works by twenty-six international artists and designers. The event’s founder—Nigel Adams, a British artist who has represented Britain at the Venice Biennale twice—said that the show will be “a deep reflection of the collective spirit of New York.” Gee’s design company, which is based in London, will represent the brand in New York, as will the artists whose works are featured in the show, including Alice Aiken, Daniel Barenblit, and Anish Kapoor.The first show in the United States, which will run from March 27 to March", "The next Biennial should be held in 2022. The venue for the event will be decided by the city of Antwerp. The major exhibition in the city will be the 2021 edition of the Biennial. The 2019 exhibition was held at the Stedelijk Museum in Amsterdam, which is currently undergoing a renovation. The 2020 edition will be held in the city of Antwerp, which will host the exhibition for the next four years. The 2020 edition will be organized as a multi-platform event. The 2019 event was held in the city of Antwerp; the 2019 event was held at the museum; and the 2019 and 2019 exhibitions will be presented simultaneously in the city of Antwerp and in London.\n\n\nThe Museum of Fine Arts (MFA) in New York has gained the rights to the English translation of the critically acclaimed Spanish play La Bamba, Anusara, which was scheduled to return to the MFA in 2020. The title was originally presented by the Spanish novelist José María Fernández, who was in a relationship with the institution, but it was taken over by Spanish director Roberto Montuño and his partner, Celeste, when the play was put on hold due to the Cov", "The next Biennial should be on the idea of the cultural body as a moral agency, not just a collection of objects, which is an important consideration in China’s contemporary culture. The Republic of Korea was excluded from the first edition, which was held in Seoul in 2002. The exhibition was hosted by the Korean Embassy in Beijing and the invitation was extended to the Republic of Korea.\n\n\nThe Museum of the City of New York has appointed Adam D. Weinberg, a professor of art history at Columbia University, as its next chair. Weinberg, who has taught at the institution since 1997, will serve as the director of the museum’s urban research and design program. He succeeds Daniel H. Weiss, who has held the position since 2013, and will begin his position in March 2020.“Weinberg’s appointment marks a watershed moment in the history of the Museum of Modern Art, a museum whose mission is to promote the ideas, the work, and the histories of the twentieth century through the collection, display, and research of contemporary art,” said Marc Glimcher, chair of the board of trustees. “While he will continue to strengthen and shape the Museum’s collection and research program, Adam�", "The next Biennial should focus on the “bottleneck effect,” which has been dubbed the “death of art.” Bénédicte Savignac, the director of the Museum of Modern Art in Paris, told Le Monde that the theme for the 2022 edition will be “Life After Life,” and that the exhibition should start in April. “I want to stress that the Biennial will remain an encyclopedic record of the life and work of Pablo Picasso, a statement of his art, and a reflection of the greatest intellectual and artistic achievements of the twentieth century,” Savignac said. “The exhibition will continue to be a platform for the drawings of Jean-Michel Basquiat, with the exhibition marking the centenary of the original museum and the exhibition centering around the artist’s career.” Though Art Basel and the FitzPatrick Whitney Museum in New York have since rejected the idea of hosting a major retrospective of Picasso, the event has been approached by a number of institutions, including the London Art Gallery and the National Galleries of Scotland, which are monitoring its exhibition schedule.\n\n\nThe Royal British Legion (RBFL) in", "The next Biennial should be held at the Palais de Tokyo, in the city of Paris, in 2019. Attended by more than two hundred international experts, the exhibition will also include a program of joint exhibitions and seminars on the topics of art, architecture, science, and technology. “Artists are always questioning the notion of a universal language, of a universal history,” Pierre-Auguste Kamm, the director of the Biennial and a founder of the French Institute for Humanism, told the Art Newspaper. “I think art has become an enigma, that is to say, a language of multiplicities and of seeming. This is what we are doing with the Biennial. We are not answering the question of what language is the human language, but we want to make people aware that it is an enigma.”Geneviève Berger, the president of the Louvre, said: “The Muse is a universal house, a living organism that is constantly undergoing changes and evolving. The challenge with the Biennial is to make it possible to take part in a process of constant change, of which the Biennial is part. The challenge is to create a new space for the exhibition that is respectful of", "The next Biennial should be held in the spring of 2021 and will feature a selection of works by forty artists and will be presented in a three-dimensional setting by the Berlin-based artist and curator H.E.A.R.D. (Hyperallergic Art Research Design). “The exhibition will be an attempt to bring together a large group of artists in the city of Frankfurt who share a common interest in the history and theory of the creation of the modernistic modernist modernist,” Biennale director Ingrid Schapiro said. “This exhibition will be different from what is currently exhibited at the Biennale, and will be a much more ambitious continuation of a long-term research project that began in the 1930s and has been ongoing ever since. The exhibition will be organized around a theme of the history of the office and the biennial will focus on the history of art in the modernist modernist-modernist movement. The exhibition will focus on the psychological and social effects of art and on the history of art, and will explore the ambiguities posed by art in the contemporary world.”The Biennale will be held in the newly renovated Marinara Marzia Campo, in the", "The next Biennial should take place sometime between May and October and will include an exhibition of contemporary art and will be hosted by the French Ministry of Culture. The biennial will be inaugurated by a presentation of an exhibition of work by the artist Elena Cinque. The show will include work by artists such as Konstantin Dolgopol, Négritte de la Bête, Lévy Gorvy, and and will be followed by a public reception of by the artist Luis Felipe. The first round of the biennial will be held in the summer of 2021 and will also feature the work of Karine Bergeron, a Polish-born curator, and her husband, Bruno.The biennial will be organized as a platform to support the French artist and to reflect on the French identity. The new exhibition will present a selection of work by the artist Jonas-Olivier-Houde, a complex, hybrid, and abstract form of the French spirit, and will take up themes such as the afterlife and the creation of the universe. The exhibition will consist of three parts: 1. The exhibition of Jonas-Olivier-Houde’s work2.", "The next Biennial should be ready in February 2021. The first will be held at the same venue as the exhibition, in April 2020, and will reprise the icon from the show that year. “The Biennial is about to enter a period of transition,” said Mona Louis, director of the Biennial. “We are excited to share with our guests the work of our talented and dedicated staff, the many projects that will be held as part of the new biennial, and to present this year’s exhibition in Tokyo.” \n\n\nThe MCA Forum in London has been awarded the 2019 Simon Keesler Prize for its contribution to the art of photography, which was established in 1988 by Diane and Simon Keesler. The annual $10,000 award recognizes a contemporary artist whose practice engages with issues of photography and photography culture. The MCA Forum is a platform for contemporary art, photography, and photography culture. The award jury comprising James Clare, Paul B. Williams, and Howard Knauth awarded the award to the MCA Forum in London in honor of its “commitment to the art of photography” and the site of its new, expanded studio, the MCA Gallery.", "The next Biennial should be held in the autumn of 2021. \n\n\nThe Museum of Fine Arts (MMMA) in Los Angeles, California, has appointed Anna-Marie C. Benites as its next director. She succeeds Neil Jenkin, who resigned last month after a series of controversies.“Neil and I shared a vision for the Museum as a cultural institution that was responsive to the needs of a diverse and plural community. We wanted it to be a place where we could feel part of a community, where we could learn and experience and be part of a community,” said Benites. “Our new role at the institution aligns with our desire to build on the Museum’s history of championing LGBTQ+ artists and fostering a more inclusive, diverse, and contemporary art community, and we are excited to work with the board and staff to realize that vision.”Citing the institution’s history as an incubator and supporter of LGBTQ+ artists, Benites also noted that the Museum has an agreement with the California Human Rights Commission that will allow the institution to receive $2 million of the proceeds from the sale of works by artists who choose to donate their works or the proceeds from the sale of donated works. The", "The next Biennial should have no hesitation about its themes and its medium. It should be a show of the world at its highest. It should take place on a grand scale. It should not be confined to a single location. It should be a voyage across the seas, a voyage across time. It should be a voyage of discovery, a voyage of discovery within the memory of the living. It should be a voyage of discovery within the memory of the dead. It should not be confined to a particular tradition, but should take place within a specific context. It should be a voyage of discovery within the memory of the living and a voyage of discovery within the memory of the living. It should be a voyage of discovery within the memory of the living and a voyage of discovery within the memory of the living. It should be a voyage of discovery within the memory of the living and a voyage of discovery within the memory of the living. It should be a voyage of discovery within the memory of the living and a voyage of discovery within the memory of the living. It should be a voyage of discovery within the memory of the living and a voyage of discovery within the memory of the living. It should be a voyage", "The next Biennial should be held in 2021, with possibilities for the future exhibitions being developed. The art history students of Bali, who comprise a quarter of the university’s graduating class, are requesting a long-term program, which would include workshops, seminars, and exhibitions. \n\nArt historian Jeffrey Gibson, a professor of art history at the New School and the author of Evolution of the Eye, a 2015 collection of drawings, paintings, and prints that is currently on display in the Whitney Museum of American Art, New York, has been appointed director of the Bill Strebman–Tacita Duren Art Museum in southern New York. The institution will be rechristened the Bill Strebman–Tacita Duren Art Museum after the museum’s inaugural exhibition, “The B-Side: Art in the Age of AIDS” (2019–20), which will open on October 29 and run until December 4.“I’ve been a big fan of Gibson’s work for years,” said Whitney curator and archivist Lisa Steiner. “He has an incredible record of being a very thoughtful curator, and I’m thrilled to see him continue to", "The next Biennial should be held at the town hall in the city of Bruges, the arts hub of the central European country. The event would be hosted by the city of Zuul and the city of Saint-Odéon, the two locations of the exhibition.The 2018 edition of the Biennale took place in the town of Zug, Belgium. The event was inspired by the city of Zug, which is located in an area of the country where the first permanent works of art were made in 1875. This year’s event, entitled In Situ: Biennale, was conceptualized as a reopening of the exhibition that had been closed since 1993.The full list of participating arts and cultural groups is as follows:The full list of participating artists is as follows:The full list of participating galleries is as follows:This slideshow requires JavaScript.<|endoftext|>by JANICE ROBERTS on September 19, 2018\n\nThis article was originally published on September 12, 2018. It has been updated to reflect the latest research.\n\n\nThis year’s edition of Art Basel Hong Kong was a success, attracting an estimated 114,000 visitors, according to the organizers. “The number was higher", "The next Biennial should be in 2020, and the first triennial in 2021.\n\n\nPrescott-based artist, curator, writer, and educator Larry Gagosian, a longtime trustee of the Westside Museum of Art in Gardena, California, has died at age eighty-four at his home in the Santa Monica Mountains. According to the Los Angeles Times, the cause of death was pneumonia caused by bronchiectasis, a rare but aggressive form of cancer.Gagosian began his career in the art world by co-founding Center for Art and Modern Life in New York, where he became known for his take on early twentieth-century art. In an op-ed published in the September 1993 issue of Artforum, Gagosian wrote: “The museum is not the place where the work of a truly great artist should be displayed. . . . The problem with the Westside Museum is not that it has a large collection of modern art, but that it is too small. It has no director, no board, and no curators. It has no staff, and no board members who are fully independent of one another. It has no institutional memory, and no future. . . . The museum is a grave threat to the", "The next Biennial should take place in 2021 and will be hosted at the museum. The museum, which has been working on a plan to close for two years, said it was looking to the future. 'We are at a critical juncture where we must decide whether our future relationships with visitors will be with the museum or with another institution, and how we will balance the need to be a civic and educational hub with the need to ensure that the museum remains open. “I’m optimistic that Biennials can remain at the forefront of the fight for social justice and ecological balance.”\n\n\nThe seventeenth edition of the José Andujar Prize\u0097the annual $100,000 award that celebrates the Venezuelan artist’s commitment to his work and which was given to Salvador Dali\u0097was awarded on Monday, February 8. The Biennial was held at the Villa de Cultura and was presented by José Andujar Foundation. Among the many works that were showcased at the exhibition were the “Paranoias,” a group of photographs which depict Víctor Miranda and the artist’s wife, Felipe Miranda. The work was created in collaboration with Salvador Dali and was shown", "The next Biennial should be staged in the spring of 2021, with the fourth iteration to take place in 2020. The decision to move the event forward, which will mark the final year of the exhibition, follows the announcement of the 2019–20 edition of the Jakarta Biennial, which will be held in the city of 140,000 in the Indonesian province of Papua New Guinea. The 2019 edition was canceled due to the coronavirus, which affected all of Indonesia. The event will take place in the capital of Jakarta, in the same building as the Indonesian Embassy. The 2019 edition of the exhibition featured new works by fifty-six artists and forty-eight curators.\n\n\nThe National Gallery of Canada has hired Neil MacGregor as its new director. MacGregor will be responsible for leading the organization through its next yearlong general and special exhibitions season, and will take the helm from Karen Pope, who will resign in the spring of 2021. MacGregor will assume his new role in June. Since Pope departed the institution to head the Lincoln Memorial Museum in Washington, DC, in March 2019, the National Gallery has experienced a tumultuous two years as it awaited a new director. In the lead-up to her departure", "The next Biennial should focus on how representations of women and images of women are deeply implicated in the formation and circulation of jihadist narratives and how we respond to the current situation through the lens of feminist and radical theory. ”The Architectural Feminist Initiative (BFI) is also urging the Ministry of Culture to reconsider its plans for the 2020 edition, which is currently on hold due to concerns around Covid-19. “One hundred years after the 1917 outbreak of the Great British Bazaar Fairs, the United Kingdom is still facing the consequences of the pandemic. We call on the Ministry to reconsider the 2019 edition, which included a feminist analysis of the power structures that bring about gender-based violence and the histories of women and girls, and to re-examine the selection of the pavilion, which suggests that certain aspects of the pavilion are in jeopardy. We also call for a discussion around the pavilion, future exhibitions, and the pavilion’s participation in future years.”The call is part of “BFI 100: Feminist Artists in the Age of Covid-19 and Beyond,” which aims to raise awareness and increase public understanding of the global feminist and radical movements. The pavilion will be the first", "The next Biennial should be staged at the Museum of Contemporary Art Los Angeles in 2021. Originally scheduled for March 2019, the event was pushed back by a few months because of Covid-19. The exhibition will now be staged as planned. \n\n\nThe Thirteenth Venice Biennale, which was originally scheduled to take place in 2021, has been postponed. Organizers have announced that the event will now be held in 2022. The announcement follows a February 23 update on the exhibition's website, which notes that the construction of a new pavilion for the festival will be delayed. Originally scheduled for March 26 to March 28, the exhibition will now be held in 2022.“We have been working through a number of options in an attempt to avoid the departure of the Festival of Venice with all possible feasible initiatives in order to make sure the Venice Biennale 2020 remains a unique and contemporary event,” said director Roberto Cicutto. “The problem of the Festival of Venice has always been that the date has to be decided by the Court of First Council, which is already starting to feel the effects of the Covid-19 pandemic.”The reopening of the main square of Venice is currently dependent on the", "The next Biennial should be shown in the spring of 2021. “This will be the last exhibition of its kind in the city,” said French Culture Minister Franck Riester. “This exhibition will be the final public experience of Biennales. It will be the last exhibition in Paris and will end with the exhibition of the new Titanic, in the autumn.”The Biennial was founded by French sculptor Jean-Luc Biennale in 2003, and was a joint initiative of the city of Paris, the French Ministry of Culture, the city of New York, and the New Museum in New York. The show was staged by the local Polytechnic University in Paris, in conjunction with the city’s public art collection and the museum. The exhibition was produced by the same team that created the works of Jacques Savoy and Serge Gainsbourg; the curators were invited to create works in collaboration with the artist in order to shed light on the city’s abandoned industrial sites. In addition to the curatorial team, the Biennial also comprised artists Jean-Luc Latour, Hougaard-Dumont, and Sébastien Papon; and the institution received funding from the Museum of", "The next Biennial should be held at the CNE in Paris in March 2020, and the 2019 edition should open in May 2020.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Michelangelo Antonioni as its next director. Antonioni will take the helm of the institution after overseeing its transformation from a classical arts museum into a museum featuring contemporary art.“This is an exciting time for the MoMA, as we head into the next chapter of our history as a community institution,” said Mark Thompson, director and chief curator of the Museum of Modern Art. “We are grateful for Antonioni’s leadership and vision for MoMA that has resulted in a decade of exhibitions, projects, events, and collections that reflect MoMA’s international reputation.”Inaugurating the institution’s new North American headquarters in the Museum of Modern Art in the former St. Louis Furniture Mart is an exhibition “The Future Is Present: Michelangelo Antonioni’s Birth of Modern Art” (November 15–December 3, 2019), which will be held in the building from January 21–January 24, 2020. “Over the course of his career", "The next Biennial should kick off in late August, with a program of lectures, presentations, performances, and performances, and will include the theme \"Wangechi Mutu: A Tribe Called Rage,\" a reference to the 1990s hip-hop group The Wu-Tang. The 2019 edition of the Biennial, titled Wangechi Mutu: A Tribe Called Rage, was held at the Black Rhino in Johannesburg, South Africa, and was curated by Michele Bruguera. The theme of the event was “Rage, rage, rage, rage.” As is the tradition with Biennials, the theme of the event will be chosen by a jury, chaired by Bernardo Gomes, director of the Promotion of Contemporary Art, and comprising of Mali Kia Kui, director of the Black Rhino; Christopher Furlong, director of the Black Rhino; Jose M. Alvarez, director of the Sala del Barrio; and Kirsten Moore, director of a contemporary art museum in Sydney.The 2019 edition of the Biennial, titled “Wangechi Mutu: A Tribe Called Rage” , was curated by José M. Alvarez.\n\n", "The next Biennial should coincide with the opening of the exhibition “In the Name of the Other: Images of the Other,” which opened on April 11. This year’s edition will feature forty-five works by twenty-three artists who are yet to be selected for the upcoming exhibition, entitled “In the Name of the Other: Twenty Artists.”\n\n\nThe Tunis Museum of Art (TMO) announced today that Oussama Saar, the director of the Stedelijk Museum in Amsterdam, will be the next director of the museum. Saar has served as the director of the museum since 2015. He succeeds Nima Nabavi, who has served as the head of the institution for the past twelve years, and will take up the post on January 18.“Oussama Saar’s appointment is an enormous step for the TMO and I am very much looking forward to working with him and his talented team,” said Fototopaz director Elissava Mukherjee. “I am sure that he will be able to strengthen our cultural network in the Netherlands and beyond, and bring us new and exciting artists and stories.”Sa", "The next Biennial should open in 2022. “KAMM is a vital asset to the city of Vancouver, and we hope that this year’s edition will provide a huge boost to KAMM’s profile,” said city council. But the council also warned that the event’s inclusion in the next edition—which will take place in the spring of 2022—may prove controversial. The full list of participating artists is as follows: 1Hangar 1Hangar 13Hangar 14Hangar 16Hangar 22Hangar 30Hangar 2Hangar 3Hangar 7Hangar 8Hangar 9Hangar 11Hangar 13Hangar 14Hangar 15Hangar 16Hangar 23Hangar 4Hangar 12Hangar 13Hangar 18Hangar 18Hangar 19Hangar 23Hangar 4Hangar 13Hangar 18Hangar 21Hangar 27Hangar 31Hangar 33Hangar 34Hangar 39Hangar 50Hangar 51Hangar 52Hangar 53Hangar 56Hangar", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Jennifer Breit as its next executive director. Breit comes to the institution from the close-knit San Francisco chapter of the AFI, which has hosted the festival since it was founded by John and Rosemary Leavitt in 1976 as a way of diversifying the collection through the collection’s collection of contemporary art.“At this pivotal moment in MoCA’s history, as we strive to remain true to our mission to present works that are not only relevant, but that engage with contemporary issues and events,” Breit said in a statement. “I am honored to join MoCA’s visionary leadership team in bringing this exhibition to life for the first time in the history of the festival. The future of the AFI and the museum is ever in the balance.”\n\n\nThe Canadian-born, London-based artist Banksy, whose surrealist, often political sculptures were often inspired by the migratory rhythms of African and African American art, has died at age eighty-one. The artist’s art and politics—often depicted as he or she stood, stretched, or", "The next Biennial should be held in 2021, said the organizers. The new exhibition will be inaugurated by an exhibition of work on paper by artist Ubane Smith. The show will center around the concept of paper and the process of creating it, focusing on Smith’s series “Primitive Sculpture,” 1972–74, which consists of three exhibitions. The first will feature Smith’s work, which is currently on display in the exhibition “The Paper Museum” at the Museum of Modern Art in New York. The second will be a retrospective of Smith’s work, which was previously featured in “Primitive Sculpture: Art, Art, Art” (2003–2006) and “Primitive Sculpture,” (2006–2009), which were presented in conjunction with the exhibition “Avant-Garde and Abstract Art” (2010–2014). The third show will focus on Smith’s practice of cutting and creating abstracts in his studio, which he abandoned after his death.\n\n\nThe Louvre has received a gift of 138 works from the estate of French artist Michelangelo Antonioni. Titled “Michelangelo Antonioni and", "The next Biennial should be held in the fall of 2021 and will be curated by Torsten Raze, who currently serves as the artistic director of the Haus der Kunst in Berlin. “The performance of the exhibition and the movement of our city is our mission,” said Raze.The biennial will cover the life and work of the artist Cassandre Blom, who is best known for her charcoal drawings and collages depicting landscapes and people in a variety of stylistic settings, including the interior of a supermarket, factories, and old cities. Blom’s ephemeral landscape paintings will be included in the exhibition “Theater of the Present: The Life and Art of Cassandre Blom” (2019).Blom’s most recent work, the large-scale painting The Gravity Girls (1971–1972), was exhibited at the Fourteenth Venice Biennale in 1972. The work appeared in her first solo exhibition at the Haus der Kunst Berlin in 1978 and its follow-up exhibition at the Kunsthalle Basel in 1990. In 1995, she received the Biennial Prize for her exhibition “The Gravity Girls” (2016).Commenting on the exhibition, Raze said:", "The next Biennial should open in 2021, and the first in 2022.According to the Washington Post, Dr. Martin Luther King Jr. gave a speech at the Lincoln Museum in Washington, DC, in which he stated: “I want the next fifty years to be the year of the Black Power movement.” In order to make room for the new exhibition, the museum will relocate the collection, and the venue for the 'Black Decade’s twenty-fifth anniversary will be moved. Each year, the museum will stage thirty-five exhibitions. The first show will be “The Black Decade: History and Art from the Black and African Diaspora”, which will highlight works by ten artists during the Black Power era. Participating artists include Tarek Atoui, Mpagi Sepuya, Sarah Ray, and Yinka Shonibare.The institution will also unveil a new venue for its annual commemoration, “The Birth of the Black Nation,” which will feature fifty-two works by seventy-three Black artists from the period 1940–80s. The exhibition will be preceded by a reimagined exhibition of the work of El-Khoury, “The Holocaust:", "The next Biennial should take place in the autumn of 2021.” \n\n\nTwo hundred members of the Belgian National Socialist Party (Vlaams Belang), who were elected to the Belgian parliament in January 2018, were arrested on February 7 after a protest against a proposed EU-US trade deal, the Transatlantic Trade and Investment Partnership (TTIP), in Brussels on February 6. The arrest of the activists, who were protesting the controversial deal, followed a weeklong sit-in at the Belgian Embassy in Washington, DC, in February 2022.The activists, who had been participating in a sit-in at the Belgian Embassy in Washington, DC, in February 2022, were charged with violating a law against protests and released on February 8, the day of the sit-in. The following day, the activists were fined EUR 100 ($128) for violating public order. [Update: March 3, 20:00] The students were released on March 3, just days after they had been arrested. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of four works by the late sculptor Ed Moses from his estate in Manhattan. The donation, made by the late American Indian activist and activist Anna Brown, includes", "The next Biennial should be the last, and will not include any new works, but will focus on the current exhibition and programme of the exhibition. The next Art Biennial will be the third in the series, and will be organized in the same way as the previous two. The new theme for the biennial will be “How Assisted Dematerialization Can Change the World.” The biennial will be held in the same space, in the same location, and at the same time that the biennial will be staged. The new format and its accompanying ticketing system will be announced in the coming weeks.\n\n\nDavid Mitchell, the British artist best known for creating works that merge painting, sculpture, and sound to highlight the possibility of freedom from oppression, has died at eighty-eight years old.Born in London in 1953, Mitchell first studied under the British artist and theorist Ian McEnery (1937–1979). He studied with McEnery at the Studio Museum in London, where he learned the techniques of sound engineering and met Mitchell, whose wife, the painter Alison and son David Mitchell, became friends. In the early 1970s, Mitchell moved to New York, where he studied with the eccentric Howard Hawks at the", "The next Biennial should be held in 2021, when the new curators will be selected by an international panel comprising Rainer Bürger, Joachim Neuhaus, and Marco Tavella, and will be hosted by the Museo de Arte Contemporáneo e Histórica, Barcelona.\n\n\nThe Museum of Modern Art (MoMA) in New York announced that it is working with the estate of the late art collector Charles \"Art Pope\" Artmon to identify and conserve the works of the late artist-activist Pablo Picasso. The museum’s collection comprises works from the artist’s many collections, including the Art of Art of Life series (1973–1980), a series dedicated to his work that was presented at the Museum of Modern Art in Houston, Texas, in 1980, and the Art of War series (1980–1983) that was presented at the Museum of Modern Art in New York.“Pablo Picasso: A Collection of his Art and Other Essays,” the institution said in a statement. “This is the first time MoMA has collaborated with an individual to identify and conserve works by the artist. We are confident that this unique opportunity will help us to realize", "The next Biennial should be held in 2022.“The Museum of Art: ‘Beauty and Illusion’ is an encyclopedic collection of some twenty thousand works, of which more than half are newly discovered, from a remarkable collection of thirteen thousand contemporary artworks, from the collection of the two founders of the Wellcome Collection, Louise and Wilfred Wellcome, and a selection of works from the private collection of the late British collector and art historian Andrew Wightman,” the inaugural exhibition will be held at the galleries, Manchester, and London, in September 2022. The 2019 show, “Art in Motion,” was staged at the Manchester Art Gallery and the London Gallery of Modern Art, as well as at the Whitney Museum of American Art in New York, and was curated by Louise Arden.\n\n\nThe Hubert Jones Collection in London announced today that its holdings of Jones’s work, which spans art, design, design design, and design, along with paintings, sculptures, and photographs, are now available for the first time online through Amazon.com. Jones’s work and designs from the collection are organized by medium and region and will instantly bring an energy and sense of modernism and immedi", "The next Biennial should take place in 2021 and will examine the social, political, and economic changes that have affected and are being experienced by people all over the world. The theme of the exhibition will be “An Open Book,” and the exhibition will be curated by Alberto Cali and Dario Caruso. The seventy-seventh edition of the exhibition will be held at the LACMA in Los Angeles, California, from February 16 to February 19, 2020.\n\n\nSpain’s Culture Ministry has launched an investigation into complaints that a number of state-run museums were engaging in “marketing” by showing a “dual-use” product, and that some of the works were of questionable provenance, The Independent reports. The ministry is also reviewing the exhibition catalogues that were presented at the six international fairs over the weekend, which was deemed “arbitrary, discriminatory, and in violation of human rights” by Spain’s Supreme Court.The ministry said that the ministry “takes seriously any violations of the provisions of the Civil Right’s Law, including the display of works in a manner contrary to the terms of the law.”", "The next Biennial should take place in the coming weeks or months.\n\n\nThe Egyptian Museum in Cairo resumed construction today on the third phase of the $1.3 billion museum, which was completed in 2012 and is currently being renovated, as the country heads into a fourth year of political instability. The new phase, originally slated to open in 2022, is now plagued by technical difficulties and has been pushed back to 2021.The museum, which includes a new 5,000-piece Arkadia building, completed in 2017, has been shut down since the Sisi government expelled thousands of Islamist protesters from Tahrir Square in January 2018 and stepped up security measures after the ousting of longtime president Mohamed Mursi. The museum’s construction, which was scheduled to be completed in 2021, was further delayed by the outbreak of the virus in January 2019.Egypt’s Ministry of Antiquities and Museums announced last month that the reconstruction of the museum would begin in 2021, but the construction team will not be able to begin the project until at least 2023. The timeline was also revised to remove the possibility that construction would begin in 2022 and would begin as early as 2021. The ministry’s director, Nima Nabavi, said: �", "The next Biennial should take place at the Museum of Fine Arts, Boston.  A new exhibition at the Museum of Fine Arts, Boston will take up the theme \"The Future Is Different Now, but It Can Stay.\"  Other curators and artists scheduled to participate are Frank Gehry, David Salle, Robert Irwin, and Thomas M. Jones.  Artforum will provide more information in the coming weeks. \n\n\nThe Institute of Contemporary Arts (ICA) in London will present the first solo exhibitions of work by British artist Grant Morrison to-date at the institution in November 2021 and January 2022. The exhibitions will be inaugurated by Morrison’s first solo show at the museum in January 2019.“Grant Morrison’s solo exhibitions have been a source of inspiration and support for the years since they first began,” said ICA director Alasdair Gilbert. “His performances, films, sculptures, paintings, plays, and readings have challenged and transformed the notion of art as personal and universal. His work is so richly textured and nuanced that his solo exhibitions have often found ways to reproduce the central elements of his career.”Since its founding by the British architect Grant Rowland in 1936, the I", "The next Biennial should begin in 2020 and conclude in the second half of the decade.\n\n\nThe Italian artist Andrea Corriotti has opened up a new feminist arts space in Rome that aims to promote Italian realism. The group, the 'Romean Roundtable, launched last month by comedian Stefano Cattelan, a former president of the Exhibitionist Group of Italy, aims to invite more women to the country’s art world.Cattelan, who represented Italy at the Venice Architecture Biennale in 2011, told the Art Newspaper that the new group, which is working with a budget of $100,000, will help promote the work of several artists, including Giampiero Bonotti, Nicola Miro, and Vittorio De Sica, with the goal of engaging more women into the art world. Bonotti, who is known for his outspoken critiques of the Italian establishment, has led the charge against the Italian government’s support of the arts for years. He has been arrested numerous times for his outspoken criticism of the government’s handling of urban affairs, and in 2015, he was given a five-year suspended sentence for “informing a criminal organization” and fined $", "The next Biennial should take place in 2020. The new location for the exhibition is the Museum of Contemporary Art, Atlanta.\n\n\nThe Brooklyn Museum in New York has given its first significant gift to the artist-led group P.A.I.N., whose mission is to promote access to art for people in need of contemporary art and art-collecting tools. The gift includes a set of two steel-framed Koons boxes that were the centerpiece of a significant display at the institution last year, and can be used as a permanent home for the group’s collection, which includes works by Harvey Koons and Federico Solmi.P.A.I.N. was founded in 2010 as a nonprofit that serves as a platform for artists and activists to have their works included in major P.A.I.N. exhibitions. The organization announced at the time that it was planning on giving away the works in 2019, but that was before the hurricane Matthew devastated Puerto Rico, killing at least sixty and causing devastating damage to the island. The hurricane made landfall on British Virgin Islands in the United Kingdom, and Harvey had already forced the cancellation of a number of exhibitions.P.A.I.N. came under fire for not acting swiftly", "The next Biennial should be held in 2019 and the first in 2020. The museum’s director, Hernán Díaz Moro, said that the institution is instilled “with a cultural curiosity, a visceral affection and an emotional depth that are much greater than the sum of their parts.”One hundred and forty-seven artists, including Agha Khan, Ana Mendieta, Max Hetzler, and Sinthujan Varatharajah, have signed an open letter demanding a “radical rethinking of art,” including the “reorientation of the museum’s exhibition-making and educational programs to focus on the production of work by established and emerging artists as well as the history of art and its relationship to contemporary society.”The letter states: “The new biennial will not only be a celebration of the history of the art, but it will be an instrument for the creation of a more just and inclusive future. It will also be a platform for artists in the fight against racism and discrimination, in solidarity with the workers and the students of the institution, and in opposition to the political, religious, and economic systems that perpetuate racist violence.”The letter was", "The next Biennial should be hosted in the Netherlands - although, given the current situation, it may well have to remain in the country for the foreseeable future. Details about the upcoming event have yet to be released. \n\n\nThe Turin-based nonprofit Artnet, which was founded by collector and philanthropist Manuela and Antony Arti in 2008, has announced that it is putting out a press release with the title The Future Is Present, ahead of its June 28 launch. Titled The Future Is Present, the statement claims that the collection will be presented in multiple formats, and that the exhibition will feature works that never were shown in the art world, not merely exhibited. The statement also claims that the exhibition will provide a glimpse into the future and will feature new works by artists from the collection that have never been shown in the United States and Europe.The exhibition, which will take place at the La Scala gallery in Rome and will be organized by Andrea Battista, director of the Turin, will be curated by Carlo Catellani, the director of the Bologna Biennale and the LA Biennale dell'Arte, and will feature work by twenty-six artists, including Alejandro Campos", "The next Biennial should take place in 2022. The 7th will be held at the Kunsthalle Basel in 2020.  The organizers of the upcoming event plan to create an online version of the exhibition in order to allow the public a chance to participate in the exhibition. The first iteration of the exhibition was held in 2017 and was the first of its kind in the Czech Republic. The exhibition was inspired by the legend of the Prague-born Czech artist Bernini and the author and activist Erich Maria Remarque.“The goal is to create a vision of the future that is more connected to the current moment and more visible to the public, and to show that the art of the twenty-first century is much more alive, and much more diverse and dynamic,” said Jakob Nielsen, the deputy director of Nordiska, the organization that organizes the Biennial. \n\n\nThe Bechdel Test, an annual $3,000 award given annually to an individual who creates a work of art that is at least five hundred years old, has voted to expand its reach by awarding $3.5 million to two New York–based artists this year. The artists are William S. Burroughs and William Eggl", "The next Biennial should be held at some point between December and March. The new theme will focus on “future visions,” “Potential futures,” and “Future Present.” “I am excited to be working with the great team at the Diller Scofidio + Renfro Museum,” said Mark A. Finkelpearl, director of the Diller Scofidio + Renfro Museum and an expert on the pavilion.Finkelpearl added: “The museum is undergoing a major transformation as it transitions from a museum dedicated to the history of art into a museum dedicated to the future of art. During the next three years, we will give visitors a new and exciting experience at the Diller Scofidio + Renfro Museum. The museum’s new mixed-media exhibition ‘Future Present’ will showcase the work of seventy artists and will draw upon themes from the museum’s collection including “Lily,” “Luis Buñuel” and “Scandinavian Art.”In addition to its new theme, the museum will develop new programs and exhibitions with the collection. The new", "The next Biennial should have been held in 2019, but was postponed due to the Covid-19 pandemic. The future of the a’Friedrich Baerker Prize, which has honored German artists since 1982, is also in question. The seventy-fifth Berlin Art Week will be held in January 2020. German Chancellor Angela Merkel has repeatedly said that the government will not seek to lift the ban on the exhibition of works by non-European artists, including works by non-Germanic peoples\u0097on the grounds that the exhibition is not critical enough of the Nazi regime. “We have to decide whether it is more important to protect the dignity of art and the freedom of speech or to limit them,” Merkel said. The government approved a temporary ban on the exhibition of works by the non-Germanic peoples in March 2019, but that measure only lasted for three months.After a series of threats made by the German government to shut down the Helsinki art fair unless the show was moved to another location if the a’Friedrich Baerker Prize was not moved to January 2020, the organizers and organizers of the Berlin Art Week announced on Monday that they have agreed to reschedule the event for", "The next Biennial should have been held in the spring of 2020, but was postponed because of the Covid-19 pandemic. Since the festival is one of the oldest in the country, and because of the popularity of the art, it has experienced a huge boost in attendance in recent years.The next edition will take place at the Düsseldorf Reeperbahn from March 22 to March 29, 2021, and will be hosted in association with the Düsseldorf BAM. Its inaugural exhibition, “Be/longing,” will be held at the Düsseldorf BAM from March 14 to March 17, 2021, and will be followed by a special exhibition of art from the Düsseldorf BAM in the Spring of 2020. \n\n\n\n\n\nA group of artists and collectors have joined forces to create a partnership for an exhibition dedicated to the work of Japanese postwar and contemporary art. Called the “Japan Art Museum” (JAM), the exhibition will be organized in collaboration with the museum and will be held in the museum’s fifth building in the city of Nagoya. The partnership will utilize art from the collections of the two organizations for the first time", "The next Biennial should open in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released the list of seventy-two artists who will participate in the second edition of the Los Angeles Biennial in 2020. Titled “Los Angeles at the End of the World,” the exhibition will travel to the Los Angeles County Museum of Art (LACMA) in 2020 and will run from April 14 to April 16. The seventy-two artists included in the exhibition include George Albian (United States/United Kingdom), Cheim & Read (United States), Eleanor Atkins (United States), Cayetano & Santos (Portugal), Autumn Bullock (United States), Carol Curtis (United States), James Cuno (United States), Luca Ciavarella (Italy), Robert Rauschenberg (Germany), Larry Rada (United States), David Salle (United States), Kenneth Sutton (United States), Hans von Strals (Austria), Andrea Zuniga (Italy), Beth Allen (United States), Calvin Andrews (United States), Rosemary Barr (United States), K", "The next Biennial should be held in twenty-six months’s time.\n\n\nOn Thursday, the German government passed a series of bills that will grant greater autonomy to the state‐run museums, including the Riga Academy of Fine Arts, and the Neue Nationalgalerie in Berlin. Titled Thee Riga,” the legislation will extend the curatorial autonomy of the Federal Office for Culture and the Museum Federations to the fourteen state‐run museums. The proposed overhaul of the German museum system is being spearheaded by the Christian Democrats (CDU), who have been campaigning for the legislation for several months and have successfully pushed through legislative changes to the art museum system twice already.The new legislation will grant the CDU the ability to regulate the museum environment more directly, by limiting how much museum groups are allowed to display and how much time museum employees have to focus on exhibitions. The legislation also aims to address the challenges the government faces in defending its controversial cultural sites, which are often targeted by activists , and to promote greater transparency when it comes to the management and budget of state-run museums.“The bill introduces a new kind of management for state-run museums and will give the Federal Office for Culture and", "The next Biennial should center on the history of the Antique and Modern Art in America, with a specific focus on the changing American visual culture through the lens of contemporary Italian and Italian-American art. The exhibition will be curated by architect Antonia Biaggi, who is also a founding curator and curator at the Museum of Modern Art in New York, and will open in the fall of 2020.The fair, which has hosted several editions, including its inaugural edition in the city of Rome in 2014, is planning to return to the States in 2021. Its Rome pavilion will be replaced by the new independent biennial events festival, which will take over the inaugural location and will run alongside the upcoming exhibition, “The Silicon Valley Collection: The Art of Antonia Biaggi” at the San Francisco Museum of Modern Art (SFMoMA), in 2020.The announcement follows the announcement of the biennial’s first director, Jacopo Cipolletta, and the selection of Zina Saro-Wiwa, Cécile B. Evans, and Sarah Lee as co-chairs. The decision followed an analysis of the biennial’s first edition, “The Hotels and Restaurants of the Hellenic", "The next Biennial should take place in Shanghai in 2022, and the first since the fall of communism in 1989. The event, which will be organized in partnership with the Chinese government, will also feature new works by artists such as Gu Kailai, Li Bin, and Wang Dufu. The upcoming event will be held in the Chinese city of Xian, which has a population of 5.3 million, and will be led by a committee composed of five artists. The inaugural exhibition will be curated by Li Yun, who previously served as the curator of Contemporary Art at the Palace Museum of Fine Arts in Beijing. \n\nArt historian, curator, and educator Lucy Lippard, who was the first American to be awarded the Nobel Prize in art history in 2017, died on January 26, 2019, at Rockefeller University, New York. She was ninety-two years old.Born in New York City in 1932, Lippard studied at the New York Academy of Art, the University of Pennsylvania, and the University of Chicago, and studied under the tutelage of Frank Lloyd Wright, the sculptor Augustus London, and the painters Robert Irwin and Jean-Michel Basquiat. Lippard had written her first biography, with", "The next Biennial should have a budget of $10,000 and will be hosted in the Museum of Modern Art in New York, at an institution that recently announced plans to close its doors for a period of twelve weeks. The institution will then reopen with an additional exhibition at the opening of the year.  The deadline for the space is December 22.Chicago has announced that it will hold an additional exhibition of works by the artists that won the $10,000 Biennial Prize, titled “Where Are You Now?” The title refers to the cumulative forty-nine years of work by the five finalists for the honor, who are Joe Bradley, Tomi-Lynn Tanja, and Michael Koslicki. Both the Chicago Arts Institute (CAA) and the Architectural Association of America (AOA) have expressed interest in presenting the works, and the designers have indicated that they might collaborate with the rest of the finalists on a show about contemporary life. “This is an exciting moment,” said CAA president and CEO Susan Scheele. “The five finalists have asked to collaborate and are collaborating here, and we welcome their contributions to the next Biennial.” The exhibition will be curated by", "The next Biennial should be held in 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) is planning to move the exhibition “The Lost Art of Death”—a presentation of artworks that were either removed from the museum or given to the institution by the heirs of the deceased—to its new home in Downtown Los Angeles in an effort to reduce the museum’s carbon footprint.The new museum, which has been under construction since 2022, will be built on the former site of the former California Pacific Electric Railway station and will boast a new 25,000-piece collection of works by forty-eight artists. At the same time, the museum will host forty-six exhibitions and events, including a “Collezione Dalla Artica” (art for the people) series, which will draw more than one thousand visitors at a time, and will offer classes and residencies for the public at a virtual museum. The institution will also boast a new lobby, a public plaza, and gardens.LACMA’s current home on Beverly Boulevard is in a state of disrepair. The renovation project, which is being funded entirely by the museum, is being led by architect Adrian Gelber, who previously designed", "The next Biennial should be held in the Spring 2019.If the first year was successful, the 2019 Biennial could be held in Spring 2020. If the new Five-Year Plan is implemented, and the city council approves the plan, the 2019 Biennial could be held in the Spring 2021. The 2022 edition of the Biennale will also be staged in the same location. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Jennifer L. Smith as its next executive director. She succeeds Marian Wright Edelman, who retired in February 2019 following months of protests and calls for her ousting.During her tenure as interim director, Smith oversaw over seventy-five exhibitions and was involved in the development of the museum’s collection, exhibitions, and programming. She also coordinated the institution’s collection of Frank Gehry’s work, organized the institution’s first multi-venue event, “Frank Gehry: Falling into Place,” in 2013, and oversaw the museum’s acquisition of works by Jane Panetta, Louise Bourgeois, Michelangelo Antonioni, James Turrell, and Grafton Crews.“We are thrilled that Jennifer has been chosen by our board"]