["The next Biennial should be held at least once a year. A spokesperson for the festival said: “In order to create a special show for the first time since the museum’s reopening in 1970, the gallery has decided to postpone the exhibition. The exhibition will be held at a different time in 2021. ”\n\n\nThe museum in the former Northwest Territories (Netherlands) whose director announced his departure in April 2019 following a controversy related to a controversial painting by Dutch master Adrienne Atget was awarded a $75 million government donation today. It is the largest gift to the museum in twenty years. The donation, totaling $72 million, is the second-largest ever for a Dutch art museum in a country that had been under Dutch jurisdiction for only twelve months when Atget died.“The donation aims to overcome long-standing historical challenges and to create a new center for the legacy of Adrienne Atget and to support the special exhibitions and research that are planned in the new museum,” museum director Johanna Dijkstra said. The gift was made in recognition of the work’s fifty-six years of work, which is currently housed in the National Museum in Oslo. Titled One Step From", "The next Biennial should be held in September 2020.  The Biennial will be led by the artist, curator, writer, and educator, Vladimir Kuznetsov, and will be the latest in a string of exhibitions dedicated to literature and art that have been organized by the museum. The next iteration of the exhibition will be organized by the same team that produced the exhibition “2015: A Year of Crisis.” The theme of the exhibition will be “The Future of Art.”\n\n\nIn the wake of mass protests and a wave of violence against undocumented immigrants that has taken place across the United States since Donald Trump was elected president, the Museum of Contemporary Art (MoCA) in Los Angeles is preparing to reopen. On Monday, the institution announced that it will open its new Museum of Contemporary Art (MoCA), a former industrial complex that was completed in 1967, in a Mexican culture center in the city, which has a total population of around six million people, on November 23.The redevelopment of the former industrial site, which sits in the city of Glendale, the southernmost city in Southern California, will include the construction of a new visitor entrance and lobby, a public courtyard, and new galleries and studios for the museum.", "The next Biennial should be in at least November 2021.\n\n\nThe New Museum in New York has launched an initiative to bring more than three hundred artists and art workers together in one location to engage with the city’s cultural heritage.Bounded by the Hudson River in the Catskills, the museum will house an exhibition of New York’s most established artists, a community gathering space, and a space for educational programs. The project, titled “New Faces,” will feature new work by ninety-nine artists and will be organized as part of a larger program that aims to increase cultural exchange between New York and neighboring states and countries.“This is a moment of great change for New York City,” said Christopher Solomon, the museum’s director. “The project will be a collaboration among artists, museums, writers, musicians, architects, designers, and other cultural producers, and will be a really exciting way for us to open up new horizons for our city.” The program will also bring local artists and artworks to the museum and will be organized in partnership with the New York City Council, the New York City Department of Cultural Affairs, and the New York City Department of Cultural Affairs.Particip", "The next Biennial should focus on how the cities of the world are responding to the coronavirus, and what can be done to prevent further spread. The Ninety-Third Biennial of London is also currently on.\n\n\nThe Art Newspaper in New York has released the list of ten artists who will be featured in a new exhibition at the Hammer Museum in Los Angeles next month. Titled “The Past and Future of Modern Art” and curated by Alex Katz and Monica Iannone, the exhibition will feature forty works by eighty-three artists, including Robert Smith, Mark di Suvero, and Nicky Hager. The show will run from April 3 to April 14, 2020 and will be on view in the Hammer’s new home at 600 West Twenty-Five Street in Los Angeles from April 26 to April 29.The ten artists chosen for the exhibition are Alexander Calder, David Cone, Janusz Kliment, Nicky Ho, and Robert Knoedler. The list contains works by twenty-seven new and established artists, including Amanda Chiu, Alex Chiu, Laura Delis, Bénédicte Delano, Barbara Foord, Yury Gavrilov, and Chantal", "The next Biennial should draw from a pool of twenty-nine artists in order to choose twenty-nine artists for the main series and twenty-six artists for the biennial as a whole. The 2014 exhibition “Youtube Art” received twenty-nine artists for its first exhibition at the museum in January. The next exhibition will focus on a trailer for a documentary by artist Maya Lin, who is currently incarcerated in a US military facility in Guantánamo Bay, Cuba. The 2020 event will be at the Gaillard Gallery in Paris and will be presented by the biennial’s director, Alain Guiraud, and director of the exhibition space Savoy Design, Minna Benoît Ghebaly.Guiraud said: “The themes of the next Biennial are clear, they are the questions: How do we live together, how do we live as a community, and how can we live in harmony with one another? We must once more try to imagine what this future may hold, even if only in philosophical terms. The next exhibition will present an opportunity to move beyond the present and to reexamine all our lives together.”\n\n\nThe Institute of Contemporary Art (ICA) in New", "The next Biennial should take place in 2021. (Source)\n\nThe Mitsubishi Museum of Art in Tokyo is planning to move the museum from its current location in the Mitsubishi Building, which is currently undergoing a $300 million expansion, to a new, larger building. It is also planning to add more galleries and more exhibitions, and has hired former curator Xenia Cattani as its next curator of Japanese art.The move, which will be completed in the spring of 2021, will set the new museum apart from its sister space in the former Mitsubishi Building. Titled “Imagination in Images” and curated by Kenneth Habegger, the exhibition will focus on the relationship between photography and popular culture. To coincide with the exhibition, the museum will also launch a new digital platform that allows users to upload images from the exhibition and view them on-screen. Both Tobe Honma and Ileana Salkeldy will serve as curators.For the first time in its seventy-five-year history, the MGA will host an exhibition of photography works. The show will feature work by sixty-two artists and will open at the center in January 2020. From May to November 2020, the", "The next Biennial should open in the years to come, but for now, we are pleased to present our work to the public.”\n\n\nThe Centre Pompidou in Paris has placed the Boucher-St-Michel, a massive restored Renaissance work, on display for the opening of a new exhibition that will feature work by fifty artists from the Centre’s network. The exhibition, “Pompidou,” will travel to the National Museum of Fine Arts in Paris in January 2020 and will include works by forty-five artists whose works were previously on display at the centre.The exhibition is part of a larger strategy that aims to engage with and extend the collections of the Museum of Modern Art (MoMA), the Metropolitan Museum of Art, the Musée d’Art Moderne, and the Musée d’Orsay. The Center aims to organize more exhibitions featuring new works by women artists, and recently unveiled a new exhibition series about technology and finance that will run for six weeks in November 2020.\n\n\nThe British artist Peter Sellars, whose conceptual and geometric gestural installations, sculptures, performances, and videos combine geometric elements such as lines, triangulations, and curves, has died.", "The next Biennial should focus on the history of painting in the university’s collection. Its next edition will be held in 2021–22, with the completion of the university’s permanent collection, which comprises over 1,500 works by more than 1,500 artists. The exhibition will also include new scholarship on the evolution and development of Modernism and the Modernist movement, as well as a selection of works by artists who have had significant contributions to the university’s collection.“We look forward to the inaugural exhibition of the new exhibition program at the Biennale, which will include work by some of the most distinguished artists of our generation and will continue to support and nurture the great art of our time through exhibitions, scholarships and other activities,” said Natalia Louther, artistic director of the Biennale. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the collection and display of cultural artifacts in the city’s public art institutions. The guidelines outline how museums may display works on loan from the city, but not on the institution’s own behalf, and how the owner of the works may request that they not be exhibited in public.“The DCLA has", "The next Biennial should be held in 2024. The first edition of the Exhibition was held in 2002 and the 20th Biennial was held in 2013. This year’s edition will be hosted by the Museum of Modern Art in New York.\n\n\nThe Art Newspaper has revealed the twenty-nine artists who will participate in the next edition of the Italian pavilion at the Venice Biennale, which will take place in 2021. The event will be curated by Soren Reinhold, who will return to the pavilion following his departure from the Turin-based firm Kassel in February.The list of participating artists is as follows: Completed works: Nino Cattelan, Los Angeles, California, USA, 2018The Maltese director behind The Maltese Pavilion (TMP), Punta della Dogana, and The Maltese Studio, Joseph Minogue, New York, New York, 2018Finished works: Carlo Mollino, Paris, France, 2018The Brazilian painter whose dark and dreamlike works are filled with human and animal details.  Amanda Hopkins, New York, New York, 2018 Ready to move on to the next, but not sure yet what the", "The next Biennial should be held in 2021.\n\n\nSculptor and activist Victor Hugo Gass, who championed Jews, Christians, and women as important figures in his art, has died at the age of eighty-six. The French sculptor was a staunch Zionist, who often questioned whether a Jewish museum should be built in Paris. His work can be found in the collections of the Museum of Modern Art (MoMA), the Jewish Museum in New York, and the Museum of Modern Art in the United States.Born in the small French town of Toulouse in 1940, Gass emigrated to Palestine in 1948, where he studied at the Hirshhorn Museum in Washington, DC, and the Museum of Modern Art in New York. In the early 1950s, he moved to Tel Aviv, where he stayed for the rest of his life. In 1974, he and his wife, Jeanne-Claude, formed the collective Victor Hugo Gass and Jeanne-Claude, and the couple moved to France, where he settled in their garden apartment in the Riviera neighborhood of Paris. In 1985, the couple returned to the United States, where Gass grew up and pursued a career as a sculptor. He was also involved in the early feminist", "The next Biennial should be held in 2021, when the museum will have reopened following a $1.5 billion expansion.  The museum is also currently working on creating a new section dedicated to the history of Brazilian modern art and is hoping to open to the public in the summer of 2022.\n\n\nThe Museum of Arts and Design (MAD) in New York announced today that Jack Shainman, the director of the Diller Scofidio + Renfro–designed space, will take up the post of “artistic director” at MAD next year. Shainman succeeds Benoît‐François Pinault, who departed in the summer of 2019 after a decade at the helm of the institution.“A brilliant and dedicated director, Jack has proven time and again that he is capable of bringing extraordinary exhibitions, programs, and events to life,” said Mad director Ryan Stacey. “His vision and energy for MAD, and for the gallery, have been tremendous, and will continue to be so.”Shainman joins MAD as director of the Diller Scofidio + Renfro–designed space São Paulo in 2006, and has served as director", "The next Biennial should be held in 2020 at the New Museum, New York; Helsinki, Finland; and Moscow, Russia. The institution will unveil the first design of a Next Generation Art Biennial at the second edition of the biennial, which will take place in 2021.\n\n\nThe National Gallery of Art in Washington, DC, has received a gift that will allow it to reopen, following an eight-month closure, for three weeks. The gift, which was made by a group of arts patrons in support of the upcoming exhibition “Between the Sun and the Moon,” will mean that the museum will be able to continue with its programming and have access to its collection. The work, which is part of the National Gallery’s series “To the Moon,” is a public performance that will engage with themes of the exhibition.The National Gallery of Art is not necessarily closing as a result of the exhibition’s opening, but the institution will be temporarily closed as part of the rest of its schedule. The reason for the temporary closure, which will begin on September 1 and run through December 31, is to allow the collection and staff time to restructure their lives around the exhibition. The National Gallery of Art has also been working", "The next Biennial should focus on the history of art’s relationship to digital technologies and how artworks can be perceived, experienced, and transmitted digitally. The second section of the biennial will be “new and contemporary: the medium and its relationship to art.”\n\n\nThe Museum of Modern Art (MoMA) in New York has received a gift of seventy-six works by American painter J. M. W. Chung, who passed away on September 4. The donation includes six works on paper, seven paintings on paper, and several videos on video. The works, which were donated in 1992, were acquired by the museum in an auction that was held in 2017.“J. M. W. Chung is perhaps the most celebrated and influential American painter of the twentieth century,” said MCA director Christopher Simon. “He leaves a legacy as rich and complex as his own, and one that will resonate for generations to come. We are grateful to the Chung family for this extraordinary gift.”Hiroshi Ibaraki, the son of the late sculptor Masaoka Takashi, told the New York Times that the family received the works from a Taiwanese collector, who was planning to sell the works at an", "The next Biennial should be held within months, despite the girls’ protests. If it isn’t canceled, it will be pushed back. The girls’s movement is not going anywhere and is preparing to fight for more equality and racial justice.”\n\nThe New Black Panther Party (NBPP), a New York–based black political organization founded in 1990 by Fred Hampton, Sam Giancana, and Alexander \"Sasha\" Carter, has lost a key member of its leadership team. Named as person of interest in the brutal beating and strangling of Darius Graham, the twenty-six-year-old, half-sister and former member of the radical group, the organization announced on Monday that the party’s founder and executive director, Allen Jones, was arrested and charged with one count of second-degree murder.According to the New York Times, the charges were filed after a grand jury in Brooklyn, which began hearing complaints from people who were present at the brutal attack on Mr. Graham on January 20, charged the young man with manslaughter last week. After a hearing in Manhattan Criminal Court on Monday, Brooklyn District Attorney Cy Vance Jr. announced that he would not seek the death penalty, but would instead seek a manslaughter conviction", "The next Biennial should take place in 2021.” The Art Newspaper reports that the museum has received a donation of $4 million from the Yalta Group, which manages the Institute of International Cooperation in Moscow, and that the institution will receive another $3 million from the state-owned Energomash, the State-owned Russian Railways, and the State-owned Gazprom.According to the Art Newspaper, the newly renovated museum is set to open in October 2020. Its current exhibition, “The Making of Modern Russia,” is expected to close in March 2021.\n\n\nThe Museum of Art in Chicago announced today that it has received a $3 million donation from the Saul and Ida Metzger Foundation. In support of the museum’s 2018–19 season, the foundation has arranged for a new collection of works by artists such as William Gavin Brown, Deborah Ellsworth Kelly, and John Graham. The donation follows a grant that the foundation gave to the institution in 2017, which will help fund the installation of new works by artists in the event that the museum’s current collection is sold or transferred. In addition, the foundation will provide the museum with $3 million for its 2019–20", "The next Biennial should be set up in 2020 and be able to hold up to 160,000 visitors.\n\n\nThe National Museum of Fine Arts (MMFA) in Pittsburgh has appointed Luke Oehler as its next executive director. Oehler comes to MFA from the Pittsburgh Art Museum (PAM), where he is the chief curator of art history. He succeeds Linda Zengerle, who retired last month after seven years at the helm of the museum, and will assume his post in January 2021.“Since my arrival in the Pittsburgh region in 2013, I have witnessed and supported the transformation of the museum, operating as a group as a nonprofit organization for the last six years,” Oehler said in a statement. “I am honored to have been asked to lead the museum into the future, and excited to work with the talented and dedicated staff and the community.”“As we work toward a new chapter in the museum’s history, I look forward to developing new and innovative ways to further the museum’s mission to provide exhibitions and educational programs that engage with the history of Pittsburgh.” \n\n\nThe Baden Cultural Center in the southern German city of Baden-Baden has welcomed", "The next Biennial should be held in 2021, at a date yet to be decided by the Executive Council, and will comprise the retrospective of the first exhibition organized by the Biennial, “The Activities of Women,” curated by Phyllis Důth, with the opening of “The Situations of Children,” curated by Amanda Lee. The biennial will also include a new exhibition dedicated to Bertrand Goldberg’s Darkness At Noon, which will be on view until October 29, 2020. Artforum was given exclusive preview tickets to the inaugural exhibition, “The Events of the Biennial,” which will run until June 12, 2021. The exhibition will also introduce new galleries and special projects and will present the first ever “Collective Experiences” exhibition, which will be held every three years.The title of the Biennial is “The Boxes of the Existence,” a reference to a painting by American artist Paul Gauguin that embodies the ambiguities and conflicts of the contemporary world. The piece was created in 1955 at the Stedelijk Museum in Amsterdam. The exhibition will feature artists such as John Guiri, Elissa", "The next Biennial should include a performance by a team led by curator Jes Fan and curated by Mia Fattal.  The inaugural edition of the exhibition, “To Sunder the Sky,” was staged at the Los Angeles County Museum of Art (LACMA) in December. \n\n\nThe Architecture Research Center (AR) in Boston has announced that it will relinquish the title of the center, which was founded in 1976 by Charles and Diana Duke, in honor of a new partnership between the two organizations. Under a new arrangement, the center will focus on research and educational initiatives with a special focus on the history of contemporary architecture and design.The partnership, which will extend into 2020, is called the Collaboration for the Development of Modernity. The center will be housed in a former English factory in Cambridge, Massachusetts, and will champion the history of modern architecture and design through cultural and educational programs and exhibitions. The center will be housed in an artist-owned space in Cambridge, and the museum will receive funding from the Duke estate.“In a world where art and design are increasingly intertwined, we are excited to partner with a museum that celebrates the rich and enduring legacy of the Duke dynasty,” said Elizabeth", "The next Biennial should be held at least four years from now, and the next should be in the year 2021. The next World Summit should be in the year 2023. All of the above have been proposed by people who are involved with the process of governance in the Kingdom. However, the question of whether a new monarch will be installed is still unresolved.  What about the future of the institution, and of the whole of Saudi Arabia, after this new king has been appointed? \n\n\nThe Museum of Modern Art (MoMA) in New York was ordered to open its new museum on Saturday by the City Council, which voted on Wednesday to extend its deadline for revising the landmark 1928 World’s Fair into 2024. The museum, which has been undergoing a $1.2 billion revamp since 2015, will inaugurate its new home at 509 West Twenty-Second Street in the City in May.“The City’s decision to extend the deadline for revising the World’s Fair is a victory for the workers at MoMA,” Ann Marie Davis, the executive director of the Museum of Modern Art (MoMA), told Artnet. “We’re thrilled by the timing of", "The next Biennial should take place in the spring of 2021. If the scheduling remains the same, there will be a third exhibition this fall. The first two exhibitions, which dealt with the life and works of Henry James, will be presented at the Museum of Contemporary Art, Los Angeles (MCA), in 2020 and 2021. The 2019 event, “Henry James’s Times Square,” was held in the spring and drew some 8,500 visitors.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that it will welcome visitors back to the institution in 2021. The announcement was made on the heels of the ten-year anniversary of the catastrophic fire that broke out in a neighboring building on January 5, 2020, and killed six people and caused at least $100 million in damages.In a statement, MoCA said: “We are actively planning for the possibility that we will reopen with full and robust security, health, and safety in mind. We have been in contact with a number of organizations, including the Fire Department, Mayor Garcetti, and the California Department of Public Health, and are monitoring their recommendations as we consider possible rescheduling.”The institution also noted that it is", "The next Biennial should take place in 2021, and subsequent editions in 2022 and 2022, the Los Angeles Times reports. [Update: March 28, 9:55 AM] The 2018 edition that was canceled due to the Covid-19 pandemic in January was rescheduled for March 28–March 29.\n\n\nThe Advisory Council for Contemporary Art (ACE) in New York has announced the forty-six artists who will receive a lifetime achievement award at its next GenCon. The award, which will be presented at the annual awards ceremony in New York City on May 25, will be presented in addition to the original list of seventy-five artists who received the museum’s Lifetime Achievement Award in 2017.“The ACE takes pride in the fact that, unlike most of the major arts institutions, the museum is able to continue to present an important and relevant international perspective on art and the environment,” Michael Savitz, the executive director of ACE, said in a statement. “While the institution has made significant progress in the twenty-first century, it remains a major cultural force of the twentieth. This is especially true since its initial founding by Leonard A. Lauder in 1962. The award recognizes this vital contribution to the museum and our", "The next Biennial should focus on “the male gaze,” Bjorn Lomborg, chair of the research committee, told the Art Newspaper. The committee also said that the exhibition should include “a more diverse range of artists, and more of their work being exhibited.”The Biennial will be held at the Swedish Kunsthalle Basel from August 28 to August 31.\n\n\nThe Los Angeles County Museum of Art (LACMA) is launching an online museum search tool that will help visitors find free exhibitions, special programs, and educational programming across the city and county through the use of artificial intelligence. The service will be available to LACMA visitors as part of the museum’s “Intelligent Nearby,” which is currently undergoing a redesign. The exhibition, “Intelligent Places: Art, Politics, and AI,” will feature work by artists including Erik De Castro, Tania De Sousa, Eden Gopnik, Ola Eyal, and Aria Joel.“Intelligent Nearby” is a collaborative project between LACMA, NYU, and the Museum of Contemporary Art (LA) in the City of New York and will be curated by LACMA curator", "The next Biennial should focus on “Arts and Culture: From Form to Reality”\u0097a project developed by the British Museum in London and the Museum of Modern Art in Los Angeles\u0097and examine how art, architecture, and design influence our world today. The museum hopes to present the first iterations of Arts and Culture: From Form to Reality in 2020, with a location in the city of New York.\n\n\nCanadian artist and educator Harald Szeemann has been selected as the winner of this year’s $110,000 Caldecott Medal in Arts. The prize was established in 2013 to recognize excellence in art and design. The inaugural honorees were Fabrizio Cattelan, Dario Cattelan and David Kiehl, and the winner of the Caldecott Medal, Robert Irwin, was also given an honorary medal in 2016.Since its inception in 1985, the award has honored a Canadian artist who has made significant contributions to Canadian visual art. Szeemann, whose practice spans sculpture, painting, collage, performance, printmaking, performance, installation, and performance/sound, has received the Caldecott Medal for his work “The Cardigan (", "The next Biennial should take place in the spring of 2024.\n\n\nThe Eucharist Museum in Cologne, Germany, has received the first round of funding from the German government’s Vision for Europe initiative. The Eucharist Museum\u0097which was founded in 1943 by the former Rothschild banker Klaus Allofs as part of a plan to decrease the influence of the Catholic Church in Germany\u0097was given €25,000 (US$30,000) from the program, which aims to encourage cultural and social cooperation between Germany and the EU, Dusseldorf, and North Rhine-Westphalia, and will use the funds to purchase a spherical sculpture and a pottery set from the collection.“We are delighted with the decision to launch this program, which strengthens the Church’s role as a bridge between Germany and the rest of the EU,” Stefanie Schmidt, the commissioner of the Horizon 2020 project, said. “This project is an expression of the dignity and the richness of the Eucharist, and its importance for culture in general. We are currently working on creating a new Eucharist, a new instrument to be a symbol of reconciliation between the Church and the state, and to", "The next Biennial should be staged in the first quarter of the next decade. The final chapter of the exhibition should follow in 2021.\n\n\nThe National Geographic Society in Washington, DC, has announced its representation of the first-ever artist-in-residence at the Museum of Modern Art (MoMA), in a six-week exhibition titled The Artist℠s House: The Traveler, which will run from April 7 to April 11, 2020. In the exhibition, which will be positioned in an unspecified building in the museum, the artist will be housed in a studio with his wife and will undergo a program that will include psychoanalysis, philosophy, meditation, and performances.“The Architectural Record’s ‘Artist’s’ House’ is a new project in the National Geographic Arts Center, where we are currently transforming the space into a new visitor experience that will make visiting the museum a truly inspiring experience,” said National Geographic director and CEO Daniel H. Weiss. “The new space, which will be inaugurated by an artist’s residency, will present the artist’s work in a new way that will engage the visitor directly, while celebrating the work of the lifetime of the artist.", "The next Biennial should be dedicated to the Spanish Civil War and should feature films by the foremost directors of the period, including Luis Buñuel, Sam Peckinpah, Andrei Tarkovsky, and Francis Stradling.\n\n\nMONACO, Italy—The Italian state is preparing to allocate $125 million for the construction of a new monument commemorating the Italian author and Marxist-socialist Antonio Gramsci, who died in Milan in 1951. The organization that will oversee the project is the Centro delle Pagine di Artista (the Painted House), led by Francesca Cipolletta, the secretary of the Democratic Party. Implemented by the Pirelli Group, the Painted House will consist of a marble amphitheater, a sculpture garden, a museum, and a library.The Painted House, which has been under construction since 2016, will be inaugurated in the town of Monaco and will be named after Gramsci. Since his death in 1951, the Italian leftist icon was one of the most celebrated and influential artists of his generation after designing and redubbing his famous Fourteen-Mile Run, the first work of art to ever be staged in Italy.The Painted House", "The next Biennial should take place in 2022. Framed by the artist Yinka Shonibare, which was sponsored by Tate Britain and the British Council, the exhibition will feature new works by forty artists to be curated by veteran British curator Nicholas Cullinan. The biennial is a continuation of Biennial of the British Empire, which took place in London in 2005. Prior to partnering with Tate, Shonibare was a curator at Tate Modern, where he served as an assistant curator in the Department of Contemporary Art from 1999 to 2001. He curated the 2013 exhibition “Primitivity” and the 2017 show “Ateliers Dernière” in Paris.\n\n\nThe Iran Contemporary Art Fair (ICAF) in Baghdad announced today that it has received $2.5 million from the Iraqi government in support of the reopening of its art galleries in March 2019. The sum includes $1.5 million for the restoration of some of the remaining works in the country’s National Museum of Art and the restoration of the Safavid Museum. It also receives $1 million from the Sovereign Fund, an initiative set up in 2018 by the Iraqi government in support of the art sector,", "The next Biennial should consider the potential of contemporary art and its relation to contemporary life in a contemporary setting where the art of the future will be quotidian, it must be embodied.”The press release said the panel will invite a slate of new artists for a \"New Art for Tomorrow\" and will present projects to \"encourage a more holistic view of art and the world.”The exhibition will open in the French capital on April 8 and will be on view through April 11. \n\n\nThe Broad Foundation, the nonprofit that is devoted to supporting artists and their projects, has launched a new year-round arts programming initiative, dubbed Art for Tomorrow. The program, which will run from April 5 to April 7, 2020, will feature more than forty artworks by sixty artists, including Alice Aycock, Elise Barlow, Gertrude Benjamin, Mariane de Alter, Mary Ellen Mark, and Mary Ellen Thomas, as well as a music video by the French artist Philippe Parreno.Inaugurating the initiative are the Artists First Projects, which will feature works by seventy-five artists, including Anna Atkins, Arash Bouzar, Billie Tsien, Carolyn Seroussi, and Kiki Smith, as", "The next Biennial should be held at the Museum of Modern Art in New York in 2022. The museum has yet to announce plans for the exhibition, which will focus on the contributions of African artists to modern art, and has yet to determine a theme for the event. According to Artnews, the next iteration of the exhibition will take place at the Los Angeles County Museum of Art (LACMA), beginning on October 6, 2022. \n\n\nThe University of Chicago has put forth plans to shutter the institution’s Graduate Center in the fall of 2021 after it failed to raise the $4.5 million in its first round of funding. It also recently slashed the number of its fellowships and the salary of the president, Jonathan Johnson, who has been at the center since 1987. The decision to eliminate the position of dean of arts and to reduce the institution’s annual stipend was made in the fall of 2021, the Chicago Reader reports.“I’m sorry, but we cannot keep collaborating with our alumni and our partners in order to keep our doors closed,” Johnson said in a statement. “We’re obviously disappointed in the decision, and we’ve been working with the students", "The next Biennial should be held in 2022. Curator, curator, curator, curator. In the meantime, the museum plans to launch a new online-only, collaboration-based initiative, “The Art of Climate Change” (TAC), in 2019. In 2020, the institution will launch a new research platform, “The Future of the Future,” which will present the results of a new survey. The survey will also include a virtual reality section and will be free to the public. Artforum has asked the Dusseldorf-based artist, Gerhard Richter, to be the next installment of the “grand tour.” The artist will produce a new work for the exhibition, titled “Avant-Garde” (2019), at the beginning of March.\n\n\nThe Museum of Contemporary Art (MoCA), Japan, is planning to build an artificial island in the waters of the Pacific Ocean to house the collection of the Japan-based collector and architect Shinichiro Watanabe, a Japanese artist best known for his vast holdings of early modern and contemporary art. The museum has laid out a twenty-foot-wide, glass-enclosed island in the water in a", "The next Biennial should include works by the following artists: Blum & Poe (Toni Barron), Cristina Alÿs (Ekaterina Nuñez), Emily Atkin (Hannah Brown), and Jacques-Louis Jean (Jacques le Sallee). The theme for the twentieth edition, “The Body,” will be the work of Merry Roldan, an American artist whose series of sculptures and paintings have explored the boundary between body and body image. “The Body is a question of what is the body and what is the body image,” Roldan said in a statement. “I have never been a great fan of the word body, but I have always admired American painters, and I have always been drawn to the body as a medium, as a form, as a form from the very earliest times, as a reflection of the human spirit. I have always felt that the body has been inextricably linked to the soul, that body is the soul: the body as a whole as well as individual parts.”In its first edition, the 2019 event was cancelled following a fire that broke out at the Museum of Contemporary Art (MoCA), the", "The next Biennial should be staged in July 2020. With the completion of the project, the museum will return to the island in 2021.\n\n\nItalian artist and educator Filippo Bellini has been selected as the next president of the Museo de Arte Contemporani de Venice. Bellini, who has been a passionate and dedicated supporter of the city-state of Venice since 1989, will take up the post in June.“I have been a friend of Venice for forty years, and have been planning to work here for twenty years,” Bellini said in a statement. “We are in the process of rebuilding the city and will be able to celebrate a hundred years of its existence with the completion of the renovation project.”Bellini will be collaborating with the city to establish the new Venice Biennale, which will take place in May 2020, the official designation of which is currently suspended due to the Covid-19 pandemic. The project, which will be funded by the city and the city’s own funds, will include the installation of twenty-six works from the artist’s temporary holdings, including the works “Reflections at the Palazzo delle Papesse in Venice", "The next Biennial should be held in 2 years and will be a collaboration between the artists and the architects, and is also working with a new generation of architects that have not been involved in the collection for some time.”\n\n\nArt Basel Hong Kong announced today that it plans to open a new exhibition, “Innovation in Art,” at the Hong Kong fair next month. The inaugural exhibition, titled “This Is Not a Play,” will be staged at the Hong Kong’s Buddhist Temple, a former British colony that is currently undergoing a major restoration, and will feature artwork by twenty-eight artists. The exhibition is slated to run from May 29 to May 31.“Innovation in Art’s mission is to present the work of contemporary artists, in a dynamic and international setting, which brings together the works of these artists and will also introduce new architectures for their exhibitions,” said Robert Warren, Art Basel’s director of Asia. “The Hong Kong fair welcomes an expanding range of artists and has our attention and commitment to deliver a diverse exhibition of contemporary works and inspiring exhibitions. We look forward to seeing how these works and exhibitions will open new opportunities for the art world", "The next Biennial should be a celebration of the creative process and the new cultural and historical context. The next edition should be related to the theme of sharing, so that it will be about what it means to be a part of a larger community and what it means to be an American. It should reflect the spirit and the spirit of the United States, reflecting the diversity of people and cultures of the country. We believe that the more we learn from each other, we grow closer, we become one. We hope that this year will be a year of growth, excitement, and achievement. We welcome your comments, suggestions, and suggestions for future biennials.\n\n\n\n\n\nArtsPrize.comAnnounced this week that it will further expand its prize-giving to include a “compelling work of art or a ‘painting’\u0097an intellectual endeavor that exemplifies the spirit of the artist. According to ArtsPrize’s CEO Jonathan Givens, the new prize will be announced in mid-April.The announcement is an attempt to further increase the prize’s reach beyond the galleries, which has shown the works of twelve artists since its inception in 2007. The move will undoubtedly increase the", "The next Biennial should be held in 2021.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) is planning to open a new collaborative contemporary art project to address racial inequities in the arts. The endeavor will involve the museum’s curatorial staff and the local communities that comprise the city’s Mission District. “The Paris-based firm Diller Scofidio + Renfro has joined the SFMoMA team in a strategic initiative to advance the museum’s mission and strengthen the institution’s capacity to be a catalyst for social change,” said Alexis Crockett, the museum’s director and CEO. “The Paris-based firm Diller Scofidio + Renfro has joined the SFMoMA team in a strategic initiative to advance the museum’s mission and strengthen the institution’s capacity to be a catalyst for social change,” said Alexis Crockett, the museum’s director and CEO. The Paris-based firm will consults with local communities to create an interactive experience that connects the museum’s original West Coast location, which was moved to a new building on the museum’s southwest corner", "The next Biennial should be the first in the island to celebrate the centenary of the Meiji Restoration with a retrospective of Japanese art that takes place in 2021. The exhibition will also include a new book, a digital exhibition, a public performance and a documentary.The exhibition will also include a new programme of lectures, seminars, and public programs. The programme will be relocated to the Shinsaku National Museum in Tokyo in 2021 and will be accompanied by a new event of the Meiji Restoration in 2021.\n\n\nThe British Council has unveiled twenty-six artists for its 2019 biennial, “Ateliers Anciennes A and B” (later moved to the BÄMHA collection), which is sponsored by the British Museum and the National Galleries of Scotland. The programming, which will take place in central London from March 21 to March 23, 2020, will address contemporary issues of art and architecture. The exhibition will draw from a collection of more than four thousand paintings by the contemporary artists Charles Aitken, David Hockney, Frank Gehry, Jean-Michel Basquiat, and Pierre-Auguste Renoir.“The combination of art and architecture is a powerful platform for inspiring and informing conversation,” said", "The next Biennial should be announced soon.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of three new works by the artist Peter Dreher. The works, which were donated by his sister, Anna Dreher, to coincide with the institution’s reopening, were given to the museum on November 8. The museum is currently home to a selection of new works by the artist, including eight new works on paper by the late American painter Isamu Noguchi, and is slated to unveil a new set of drawings by the artist in January 2020.The works, which are valued at between $100,000 and $250,000, were donated by the Noguchi family to the museum in a long-overdue show that was currently on display in the museum's permanent collection. While the new work by Dreher, titled On a Laundromat, is a figure drawing as a woman, the work is not a work of art, but is a reproduction of a scene from film,” said museum director Christopher Simon. “It is a very personal work, and to have a piece of this work in the museum is an extraordinary honor. We are grateful for Peter’", "The next Biennial should be held in some of the city’s most popular sites with a selection of new works by emerging and established artists. The first edition of the exhibition, which was staged in the city’s Art Museum and ArtCourt in 2012, came to an end in May 2020, just six months after its inaugural exhibition, titled “ecstatic and ambitious.” The exhibition featured work by forty-one artists and expressed the hopes of the biennial to become a platform for the exchange of new works and the sharing of ideas. The biennial will return to the city of Beijing in 2020, when it will host its fifty-ninth edition.\n\n\nThe Carnegie Museum of Art in Pittsburgh (CMA) has appointed Laura Minton as its new executive director. Minton comes to the institution from the Carnegie Arts Center (CAC) in New York, where she serves as deputy director of external affairs. She succeeds Laura Sifton, who departed the CMA in January 2019 to head the New York Philharmonic, and will assume her responsibilities in April.“Laura and I have been working for some time to identify a vision for the CMA that is inclusive and", "The next Biennial should take place in 2020.\n\nThe Museum of Arts and Design (MAD), a contemporary art museum in London, is planning on moving to a new venue in the city. The announcement came after the museum received a £3 million donation from the estate of Bernard and Edythe Maxwell, the creators of the British luxury watch brand Tudor.“We are delighted to welcome the museum to the new Eaton Gallery, which will be an expanded and better-equipped Mad,” said Neil King, the director of MAD. “At a time when the museum is at the heart of the city, MAD is delighted to be able to announce that it is moving to a new location in the city. We are also looking forward to the inaugural exhibition at MAD in 2021.”The team also noted that the new exhibition space will boast more than 180,000 items that will be presented by leading international artists during the exhibition’s first year. It will also boast a museum accessible by car from the museum’s main premises, and will feature new works by artists whose works are on view in the new space.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it will begin welcoming visitors", "The next Biennial should commence in 2020 and will take place at the Museum of Contemporary Art (MoCA) in Los Angeles.\n\n\nThe Smithsonian Asian Art Collection (SAAC) in Beijing announced that it will receive the first shipment of twenty-first century art from the institution in 2021. The collection comprises works dating back to the twentieth century and will travel to the Smithsonian Art Museum in Washington, DC, where it will undergo a major expansion. The exhibition, “Drawn Together: Modern and Contemporary Art in Asia” will be presented in a new museum in Beijing, the National Museum of Asian Art, and will kick off with a lecture by artist and curator Hsin-Chien Huang.The exhibition was inspired by the museum’s acquisition of modern and contemporary art from the collection of the late collector and collector-artista Yixian Huang, who passed away in May 2018. In addition, the lot was selected to represent the collection of the late collector and collector-leaders Bao Bu, Mao Tse, and Chien-Sen Li, who were among the first to establish the modern art museum in Beijing. The institution began its expansion in 2014 and is currently constructing the new twenty-fifth floor. The renovation of the institution is estimated", "The next Biennial should open in May 2020 and will be a joint project between the Museum of Fine Arts, Boston, the Massachusetts Institute of Technology, and the artist-run nonprofit Celestial Voyage. The inaugural exhibition will feature new work by Davis and will only run for three months.“As David Davis has said, he’s not interested in making a career of a museum’s collection,” said Steven Keating, president of the Greater Boston Cultural Council, which represents the city’s arts and cultural agencies. “He wants to focus on the collection as a whole. He’ll be a great addition to the collection as he enters its eighty-second year.”Davis is perhaps best known in the United States for his sculpture The Vessel, 2013, a series of translucent Plexiglas tubes that float in an atmosphere of water, which he started creating in 1973 and finished in 1997. His work has been exhibited at the Venice Biennale in 2012, the Toronto International Film Festival in 2013, and the Los Angeles County Museum of Art (LACMA), which he founded in 1989, and will be included in the upcoming exhibition “The Manse: A Century of Contemporary Art” at the Museum of", "The next Biennial should be a virtual reality version of the Mall of Asia, which opened in June 2019 and is already being replicated at multiple museums across the city. The third installment of the exhibition will launch in October 2022.According to the Chinese Cultural and Art Association (CACAA), the upcoming exhibition will be the first under the new president and will feature more than 3,000 works from 40 countries. The theme of the 2020 edition will be “Wu Pu,” a colloquial term that roughly translates as “people’s world.”CACAA also revealed that the museum’s Beijing pavilion will be transformed into a virtual reality museum, while the Shanghai pavilion will be transformed into a “virtual city.” “Virtual cities are an innovative concept that has often been leveraged to explore the boundaries of the real world,” CACAA said in a statement. “This is a time of crisis for art and architecture, but with the advent of the VR, it seems that art has no longer any more right to exist but has instead become a new object detached from the physical world.”The institution also announced that its archives will be digitized and video shows will be", "The next Biennial should be held in September. It will be held at the University of California, Los Angeles (UCLA), and will be led by curator and curator of modern art Margaret Weisz.\n\n\nAmerican Art, a Los Angeles–based nonprofit that supports cultural and artistic excellence in the United States, has announced that it is ending the contract with the Metropolitan Museum of Art (MMMA), which has held the museum for more than eighty years. The organization will also shift its programming and its legacy production across the country.“American Art’s partnership with the Met has been mutually beneficial for both organizations and the museum has provided the Met with a unique and important collection of works from a wide range of contemporary artists,” said Marlene Cheever, director of American Art. “While many of these works were on display at the museum in the past, the museum will no longer use these works in its own programs and will instead restitute the works to the new museum.”Since the end of its contract, American Art has donated approximately 1,400 works to the museum. In 2017, the museum received more than 1,000 pieces in the form of gifts. American Art will continue to provide support to the", "The next Biennial should take place in the spring of 2021.\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles is working with the Los Angeles County Museum of Art (LACMA) and the Los Angeles Memorial Museum (LAM) to create a modern-day version of a Victorian home, complete with a gallery, private library, a café, and a full kitchen. The new project, titled The Maker, is a collaboration between the museum and the Los Angeles City Council on the promotion of maker culture, a nonprofit organization that works to increase awareness of and appreciation of craft and design.“We are thrilled to be working with LACMA and LAM to bring you The Maker,” said Marc Glimcher, director of the museum. “The Maker is a collaboration between the MFA and LACMA, and our artists and curators. We have created a new space for the museum to present these works, and we will continue to present these works at LACMA and LAM, both on a large and small scale.”Developed by Los Angeles–based artist and civic leader Joe Lauter, The Maker was created as a public space for makers in Southern California, and is an", "The next Biennial should take place in the fall of 2020. The 2019 triennial, “The Black Years: From Māori to Black,” curated by Wangana Huttanui, Kamehameha, and Martin Marcon, will resume in September.\n\n\nThe Museum of Contemporary Art (MoCA), London, has appointed Mandy El-Shirazi as its next director and CEO. El-Shirazi joins the institution from the Agey-New-Papua Gallery, where she has served as interim director and CEO since March 2019. She succeeds Anne-Marie Blake, who has served as director of the museum since March 2013, and will take up the post in September.“I’m extremely excited by being able to bring Mandy to MoCA and its visionary team,” said El-Shirazi. “I’ve been deeply inspired by the artworks and design of the museum and am proud to have been able to work with Anne-Marie and the team. Mandy has been a visionary leader in her history and has been instrumental in shaping Museum of Contemporary Art London into a thriving institution with a strong and long-term future.”According to the London", "The next Biennial should arrive no later than March 2021. Trek Factory hopes to open the museum in Spring, California, in April 2020, and intends to break ground by spring 2022. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of twenty-three works dating from the mid-Nineteenth Century that were on display in its inaugural exhibition “A Century of Exhibitionism: Agrarian Ambitions and Modern Art” at the museum in January 2019. The works, which were on display alongside works by artists such as Robert Irwin, Robert Mapplethorpe, and Louise Nevelson, are part of an exhibition organized by curator Susan Miller.“In celebration of the twenty-third anniversary of our archival work, we are thrilled to present the works on display in the first exhibition of the new exhibition project, ‘A Century of Exhibitionism: Agrarian Ambitions and Modern Art” at the museum,” said Miller. The works, which were on display in the museum’s inaugural exhibition “A Century of Exhibitionism: Agrarian Ambitions and Modern Art” (November 14, 2019–January 4, 2020), were selected from a short", "The next Biennial should be in the fourth quarter of 2020, so we hope that the artists and organizers of the forthcoming exhibition will be able to recover their creative energies and to take the next steps in making their program, exhibition, and lecture series available online and in real life.” The biennial is supported with funds from the Riga Foundation (Riga Foundation for Contemporary Art), the European Regional Development Fund (ERDF), and the ERC.\n\n\nA group of artists, curators, writers, and other cultural workers in Ecuador, founded in 2017 to protect the cultural heritage of the country’s indigenous people, has filed a lawsuit against the government of President Jair Bolsonaro, alleging that the government suppressed opposition to its plans to sell off artifacts and the cultural heritage of indigenous peoples.The lawsuit, filed by the Association for the Protection of Indigenous Cultural Heritage (APIC), was filed in the United States District Court in the Southern District of New York on January 17, 2020. The complaint is not a legal challenge to the proposed sales, but the group argues that the government used the legal system to silence them.“We’re not going to rest until the government stops denying the people their rights,” said AP", "The next Biennial should be held in November 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has unveiled its new arts and culture platform, the artist-run portal Art + Paddle, which will host a series of programming that will engage with the museum’s vast collections and visitors through virtual reality and social media.“With Art + Paddle, you can experience the performance, art, and culture of your dreams in the Museum of Contemporary Art, LA in virtual reality—at discounted rates, with curated exhibitions, and with exclusive offers,” said curator and founder Remo Peña. “The new platform is a descendant of Art + Pitch, the world’s largest virtual reality platform. We invited some of the world’s most daring and talented VR artists to create innovative and compelling VR experiences that were updated every day. We also invited the team to reimagine how art could be experienced in a virtual world and to present their visions in a virtual museum.”The museum also revealed a new series of exhibitions dedicated to the work of Late Night with Seth Meyers, which will highlight the art of late-night television. The new series, “First to None,” will feature works", "The next Biennial should open in 2020 and will consist of a range of works by artists from across the globe. “We are extremely excited to support this growing generation of artists in the Art and Design disciplines,” said Said curator Helena Groschack. “The next iteration of Biennials will be full of new and exciting artists. We are eager to see how they will at the famous Grand Palazzo Croce (the MoCA of the Italian Architecture) and to collaborate with the artists who have created their own homes in Italy over the years.”\n\n\nThe Museum of Modern Art (MoMA) has received a gift of eighty-seven works from the Dailies of Ireland. The works, which were donated by Penny Dreadful, were given to the institution in recognition of their contribution to the publication of stories in our June/July issue. “These works are a treasure trove of contemporary art from the Dailies of Ireland, and we are privileged to receive them in such fantastic condition,” said Museum director Brendan Leahy. “The works on display are a tribute to the tireless efforts of these talented artists, and their dedication to the arts, and their outstanding", "The next Biennial should include the arts and culture of the Philippines, as well as the biennial of the Philippines’s largest private employer, the Philippine Film Institute (PGI), at the University of the Philippines, Mandaluyong, and its 150th anniversary celebrations. The CNA reports that the Biennial of Arts and Culture will be held at the Church of the Nativity of the Catholic Church in Manila (CofCC), a former U.S. military installation in Manila, from May 25 to May 28. The seventeenth edition of the exhibition will take up themes such as the American Civil War, the Philippine liberation movement, and the history of the Philippines. The event’s inaugural edition, “The Filipino Crocodile: From Colonialism to Modernity” (2019), brought together artists from twenty-four countries to exhibit their work in Japan, China, Hong Kong, Korea, and the United States. The twenty-fifth edition of the exhibition will take up themes such as the contemporary art of the Philippines, the arts of the Philippines, and the history of the Philippines.  The seventy-fourth edition of the exhibition will be held at the Manila Museum of Art, the institution that", "The next Biennial should be held at the Athenaeum in Rome in February 2021. The museum will then stage a new exhibition of the work of the artist-in-residence, Sinthujan Giri, in May 2021. The biennial will include works by artists from every region in the world, as well as the first exhibition featuring work by the artist-in-residence. The first set of twenty-four works is currently on view at the Art Gallery of Ontario until September 22.  ADVERTISEMENT Thanks for watching! Visit Website\n\n\nThe Paris-based nonprofit organization Neue Galerie Teile has announced that it is planning to open an outpost in New York City. The new space will be called the Centre Pompidou, and will be built in a former factory on West Twenty-Fourth Street in Manhattan. The institution will be helmed by a grandson of the late French president Jacques Chirac, Pierre Pétain Pétain, and will host solo exhibitions by artist-in-residence Nadine Conti and Nude with Dignity. The exhibition, which will take place in October and November 2020, will feature work by the likes of Roberto Benigni, Robert Irwin, and Tunga", "The next Biennial should be held between February and May 2021.The participation fee will be $75. The 2018 edition of the Biennale was held in the town of Marrakech in Morocco. “This year’s exhibition features work by twenty-nine artists whose practice spans the visual art spectrum, and is curated by a legendary Moroccan curator, Abraham Salah,” said ​Mali director Guiney Adwa. “The exhibition is a testament to the diversity of the contemporary Moroccan art scene, and to the breadth and depth of the gender and racial line in the field.”\n\n\nThe Lygus Foundation, a nonprofit organization that works with artists and institutions to address the challenges of HIV/AIDS in Africa, announced today that Wangechi Mutu, the president of South Africa, has donated $1.5 million to the organization. The donation was made in support of the organization’s Nairobi Biennial, which was held last year at the Wangechi Arts Complex in KwaZulu-Natal and was one of the first events organized by the newly elected African head of state.“Wangechi Mutu is a great supporter of the Lyg", "The next Biennial should be held at the Tartu Gallery in Helsinki in April 2020 and will feature work by forty-five artists from twenty-six countries. Its inaugural edition will be held at the Tartu Centre for Contemporary Arts in Helsinki and will be hosted by the Danish contemporary art museum Bentekemonte. Kasmin is also planning to expand its present-day exhibition exhibit space in Shanghai. The institution recently announced its representation of the French artist Jean-Michel Basquiat at the upcoming Art Dubai. Other artists slated to participate in the new exhibition are Victor Hugo, Agnes Martin, Emeric Pressac, Simão and Constantin Brancusi, and Paul Gauguin.\n\n\nThe Sackler Family Fund, one of the largest philanthropic organizations in the United States, has pledged $2.5 billion to help the arts and cultural sector in the US as part of its Capital Impact Awards (CIA). In support of the creative and cultural sector, the fund will establish the $500,000 K-12 Opportunity Capital Fund, which will invest in cultural entrepreneurs who are creating and creating jobs and are making a difference in the communities they serve, and will distribute the funds in the form of grants.In recognition", "The next Biennial should be held in the autumn of 2022. The exhibition, titled “Gabriel García Márquez: My Struggle,” is scheduled to open in the spring of 2021. The three-day event will be staged at the Brooklyn Museum and the Museum of Modern Art in New York. The Helsinki Biennial will be held at the Helsinki Art Museum until the autumn of 2021. Where will the directorship of the artist’s studio go from here? “The artists who lived and breathed him are now gone, but the dialogue continues,” said the artist, who has worked on the exhibition space since 2006. The Los Angeles residency will take place at the San Diego Museum of Art through October 20. In the meantime, García Márquez, whose work has been exhibited at the Museum of Modern Art, the Metropolitan Museum of Art, and the Whitney Museum of American Art in New York, will hold a solo exhibition at the Los Angeles County Museum of Art in April 2020.\n\n\nThe National Museum of Scotland has released several newly-compiled drawings of the country’s monarchs as well as the Royal Coat of Arms. The work, titled Monarchy and Arms, was commissioned by", "The next Biennial should take place in the Swiss Alps in 2021. The 2019 edition in Hong Kong was postponed due to the pandemic. Though the event was supposed to kick off in March 2019, a string of setbacks forced the cancellation of the event in March and April, respectively. Last October, the first exhibition of the new program, “The Art of War,” was canceled, marking the first time the program has been offline since 2009. The exhibition, which was curated by Kunsthaus Berlin director Christian Stebbings, was supposed to kick off in March, but it was pushed back due to the coronavirus.\n\n\nThe Museum of Fine Arts (MFA) in Boston is facing a backlash from the LGBTQ community after it set an LGBT-inclusive policy that severely restricts access to some exhibitions and programs. According to the Boston Globe, the museum’s director of public programs, Daniel H. Weiss, announced that the museum would alter its programming in an effort to “encourage and extend a sense of inclusion and tolerance that is core to the museum’s mission.” He also argued that the museum has made progress in recent years, noting that the institution now has a lesbian bar and a", "The next Biennial should focus on expanding the work of women artists, “giving greater attention to their practices, and examining how their projects are related to and empowered by contemporary and regional practices.”\n\n\nThe Hong Kong Museum of Art (HKMA) and the Museum of Contemporary Art Hong Kong (MCA) have announced that they are preparing for the possibility that the Hong Kong Special Administrative Region (HKSAR), a region comprising parts of East, Central, and West China, may be annexed by China. The HKSAR includes Hong Kong’s financial district, the East Bund area, and the area around the Louvre.The announcement comes amid heightened tensions between Hong Kong and Beijing. On September 1, China began deporting hundreds of mainland residents suspected of supporting pro-democracy protests in the Hong Kong region. More than 1,400 people have been arrested and thousands are still being held in detention, and the situation in Hong Kong has become a flashpoint for human-rights activists.The two institutions have yet to publicly comment on whether they plan to move forward with construction projects, but both said that they will continue to collaborate with local government leaders to ensure the safety and security of the work for visitors to the museums. The HKSAR is", "The next Biennial should be held in 2021, when the exhibition will close to the public for a month. The director of the event, Adam D. Wein, said: “We must work together to create a new kind of environment for the exhibition, one that facilitates the effective exchange of ideas and ideas that create new possibilities for art. We must find a way to sustain exhibition through the winter months and through the reconstruction of the museum.”\n\n\nThe Museum of Fine Arts (MA) in New York has appointed Paul Efstathiou as its new director. He succeeds Christine Stier, who departed the institution in September 2019 following a three-year tenure. “Paul brings a wealth of experience, vision, and desire to the museum, and we are thrilled that he will be our next director,” said Marc Glimcher, head of the Victoria and Albert Museum. “His vision and commitment to MA aligns with the museum’s mission to foster a deeper understanding of the museum’s collection and exhibition program, and his successful leadership experience and reputation make him an ideal leader for our team.”Efstathiou first joined the Victoria and Albert in 2007 as assistant curator of modernist works and", "The next Biennial should take place in December 2020.Artists who are interested in collaborating with an exhibition in the near future should contact the Wapping Project at the Serpentine Galleries, London, or the Tate, London, with a proposal for a series or a retrospective.\n\n\nThe Los Angeles County Museum of Art (LACMA) is working with the Museum of Contemporary Art (LACMA) to launch a digital platform that will allow the public to see and purchase works by artists whose works are currently on display. The platform, called the Museum Access and Experience, will allow visitors to view works by twenty-eight Chicago-based artists at any time on the museum’s New Window platform.The partners are Marc Cohl, Angela Cisneros, and Krista Pérez-Pérez, who will present a free public program for any age group at LACMA on Saturday, March 16. The event will run from 10 AM to 6 PM. “We are so excited to work with LACMA to support the work of twenty-eight artists who make so many extraordinary and powerful works,” said Linda Bean, executive director of the Museum of Contemporary Art. “With your help we can", "The next Biennial should take place in 2022. “A lot remains to be done, but we are optimistic that in the near future we will emerge from this crisis with a new and better understanding of what constitutes a flourishing and flourishing community,” said Maureen M. Burke, president of the Biennial. \n\n\nThe Museum of Modern Art (MoMA) in New York is planning to build a new $250 million museum dedicated to the work of the late Italian architect Filippo Cattelan in the city’s Little Italy neighborhood. The ambitious project, which is part of a $1.2 billion overhaul of the museum, will include the construction of a new 500,000-square-foot exhibit space, a special collection area, and a public courtyard.The extension of the museum, which will eventually sit in the same building as the Louvre and the Palazzo Beccaria, is part of a major renovation project that includes the renovation of the Beccaria’s original façade as well as the renovation of the museum’s present-day interior. The project, which will also encompass the addition of two new galleries and two new rooms, is part of the institution’s", "The next Biennial should be held at a location other than the Schloss in Berlin, and the next should take place in a city in the German state of North Rhine-Westphalia. According to a press release, the 2016 edition of the biennial will be held at the Schloss until 2021, and the 2017 edition will take place in the German city of Baden-Baden. The new pavilion will be designed by architect Tobias Ritschel and will be located in the former Heinrich Büchner building. The pavilion’s inaugural edition was held at the Schloss from 2013 to 2017, and it was staged by curator Hildegarde Gerber and director Anna Trzaska.\n\n\nThe Toronto arts and culture organization the Toronto International Film Festival (TIFF), which celebrates Canadian cinema with a series of events that culminate in a double-bill at the Toronto Film Festival (TFF), announced today that it has merged with the International Film Festival (IFF), which runs in Montreal and is sponsored by the Montreal Museum of Fine Arts (MMFA). The move means that the annual event will now be hosted by two organizations: the Toronto Screening Room and the Toronto International Film Festival (TIF", "The next Biennial should be held in the autumn of 2021, with an exhibition of works by the group of artists whose work first entered the museum in the spring of 1975. The biennial, which will be held at the Lamart–designed museum, will be modeled after the museum’s central building, the Annex, which opened in 1973 and has served as a cultural gathering place ever since.The project was inspired by the Lamart Group, whose structure includes the Lamart , the Lamart Group Art Museum, the Museum Ingloria d’Alto Marzio, the Lamart Museum in the Museo de Arte Contemporáneo y Paz, and several smaller museums. The Lamart Group also owns and manages the Art de Portugal, a museum in Lisbon. The Lamart Group is preparing to open a new museum in the city of Belem, in the south of Portugal, in 2021.\n\n\nThe British artist Marc Quinn, best known in the United States for his large-scale paintings of people performing and landscapes in urban settings, has died at age seventy-four at his home in New York.His works are often found in the collections of the James Portis Museum in London and the Metropolitan Museum of Art", "The next Biennial should take place in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has added two new artists to its roster. The museum has also announced the addition of two new works by Tania Bruguera, a New York–based Brazilian native, and Luiz Lopes, a Salvadoran-born, Houston-based American artist whose works are set in the city of San Ildefonso, in the state of Mato Grosso do Sul.The works, which were chosen for their potential to draw attention to issues of global migration and displacement, were selected by an interdisciplinary committee chaired by John Pash, director of the Los Angeles County Museum of Art, and comprising Ricardo Almeida, director of the San Diego Museum of Art; Luis Fonsi, artistic director of Los Angeles’s Monument Valley; Sara Zwerin, director of the San Francisco Museum of Art; and Lorna Wood, director of the San Francisco Museum of Art.“In this new era of migration and displacement, we are excited to support more artists that embody the spirit of the city of Los Angeles by supporting their work in this year�", "The next Biennial should take place in September 2020, the month of the coronavirus. Its theme, \"New Frontier, ” will be inspired by the theme of the pavilion, the Human Centipede Museum, which was first commissioned by the city of New York in 1993 and completed in 2004. The 2019 edition, titled Cannavirus, was held at the SculptureCenter in Long Island City, New York; the Museum of Modern Art in Manhattan; and the San Francisco Museum of Modern Art. The 2019 edition was co-curated by Sean Kelly, the executive director of the International Center for Photography in Houston, Texas; and Simone Biles, the artistic director of the International Center for Photography in New York. The theme of the 2020 edition, “New Frontiers,” will be inspired by the theme of the pavilion, Art Nouveau, which will be represented by an artist-in-residence, Craig Barré, who is currently at work on a new exhibition titled “Feminine” at the gallery.\n\n\nRobert Mapplethorpe, the British sculptor who created the iconic Seven Sisters statue in London and gave it his", "The next Biennial should be held in 2020.\n\n\"The exhibition is an important step in the long-term process of creating a cohesive and relevant environment for the art and architecture of the Americas, and in demonstrating the cultural linkages between the Americas and the rest of the world, and thus connecting our peoples in different parts of the world with each other and with the cultural heritage of their countries and continents,\" said Matias Boajay, director of the Museum of Modern Art, the MFA, and the Golden Gate Museum. “These projects form the basis for the rest of the exhibition, the exhibition of which will be staged in the next three years. It will then become our goal to create a new exhibition for the Pacific Standard Time, to present a new piece for the upcoming exhibition.”The Pacific Standard Time will be the first exhibition of the new complex, which will be inaugurated in 2020, in the Philippines. The design was conceived by architect and local government official Benito Salaverra and was commissioned by architect Jose Arroyo, who is the architect of the Filipino National Museum of Art (PNA), and the city of Pasay City, El Paso.The structure will also feature integrated retail, public gathering spaces, classrooms,", "The next Biennial should take place outside of Hong Kong in 2020. The organizers have also asked the public to submit their ideas for the next event on their site, and have provided links to their forum, as well as to a survey that can be filled out by Hong Kong residents.While Hong Kong is known for its pro-democracy protests, in recent months the number of mainland Chinese visitors to the island has been on the rise. In an attempt to ease the situation, the government has allowed some foreign nationals to stay in Hong Kong for a limited time. The exhibition will be curated by Ondine Di Mezzano, who was recently appointed director of Liberté Art and Design in the Italian city of Venice, and will take place at the Port of Atlantis in the city of Sant'Anna, in central China, from May 13 to May 17, 2020. Di Mezzano previously curated Art Unplugged: Art in a Time of Change (2013) at Art Basel Hong Kong and curated the first show of work by Chinese artists at the Venice Biennale in 2009. Commenting on the current exhibition, Di Mezzano wrote: “I am delighted to return to Hong Kong in 2020 and to present the first", "The next Biennial should be held next month. \n\n\nThe Museum of Fine Arts (MFA) in Miami Beach has received the inaugural donation of $2.5 million from the public. The gift was made by a group known as the \"Miami Fund for Contemporary Art\" who are raising funds to repair and rebuild the Willem de Kooning–designed Renaissance Theater, which was damaged by a hurricane in 1996.“The restoration project is essential for the future of the theater and the city of Miami as a whole,” said museum director, Victor Vicente. “We are grateful to the public for their overwhelming support.”The gift comes after Miami-based artist George Ahearn was awarded his first major solo exhibition at the MFA this spring, with work by his own group, the Ahearn Group. The exhibition, which closed on October 30, featured work by fifty artists, including William Kentridge, Jerry Coleman, and Nicole Holofernes. Ahearn’s second exhibition at the MFA, which opened in May, was a collaborative performance art project, “George Ahearn,” and the latter's first solo exhibition, “John Goodman,”", "The next Biennial should be staged by the end of the year. Its next edition will be held in Württembergia and Berlin, and will take place in August 2020 and September 2021. \n\n\nA woman who was killed when a tram carrying a group of people in a mass gathering in central London derailed on Friday, March 8, has been identified as Shaniqrul Islam, a student from the city. London Ambulance Service (LAS) confirmed that Islam was one of five people who were taken to hospital after the accident, which took place at about 1:45 PM on Friday, March 8. Her injuries are not life threatening.“We are obviously devastated by the loss of Shaniqrul Islam and her family, and are working closely with the family to try to support them as they adjust to their new environment and to their new reality,” said a spokesperson for LAS. “The circumstances surrounding this accident are still under investigation and we are providing support to the family as they approach this very difficult period of their lives. At this time we can say with certainty that Shaniqrul Islam was one of the four people taken to hospital following the accident.”The tram, which", "The next Biennial should take place in September 2021, and the event’s theme “Life and Art: From the Margins to the Streets” will be the theme of the 2020 iteration. Commenting on the upcoming event, Jackie C.S. Cheng, president of the museum, said: “Life and Art is a powerful, transformative force. It is life itself, in action. The engagement with the world and with each other is an exhilarating experience. We are very much looking forward to the 2018 edition and to the upcoming 2020 iteration.”\n\nThe Museum of Fine Arts (MFA) in Boston has announced that it is planning to move its spring 2019 exhibition “Towards a Life of Art,” which was held at the museum since 2009, to its new home at 975 Tremere Street, in Chelsea. Museum director Deborah Hoberman told the New York Times that the move will “protect the growth of the program, foster an appreciation of the work, and bring artists and scholars together in a way that is meaningful to both audiences.”The move follows a public campaign led by artist-activists, artists, writers, and other leading voices in modern art who were petition", "The next Biennial should be held in 2021 and is currently on track to be completed by 2021. The exhibition will feature the work of seventy-four artists from twenty-six countries. The commissioning of the exhibition has been stalled since mid-March due to the Covid-19 pandemic. The Biennial is a fulfillment of a lifelong dream to have the chance to visit forty of the world’s leading contemporary artists. The twenty-six artists chosen to represent Europe at the exhibition are: Aleksandr Wojnarzak, Klaus-Dieter Müller, Julien Gide, Jürgen Magers, Ajaz Atoui, Anne-Marie Procter, Shaniya Okpala, Dennis Voigt, Paola Zingaretti, Zoran Zivkovic, Andrea Bonava, Layla Bouya, Ciara Bickel, Ebony Adams, Vivian Melissa, Jessica Redfield, Tanya and Steve Stern, Natalie Sunferno, Kaara Yasada, Arashiyumi Takeda, Gillian Wearing", "The next Biennial should be held in 2020, and the third in 2022. The third is an exhibition devoted to the life and work of Pablo Picasso. The more than two hundred works in the exhibition will be curated by artist and Laureate, MJ Akapo; the artist Jorge Alcántara; and the artist María Berríos. Similar exhibitions have been held in the past at the Instituto de Cultura Pinera (C.A.P.R.O.) in Lisbon, and at the Museo de Arte de São Paulo, Brazil, in 1998. The exhibition will also feature works by artists such as Anna Atkins, Mark Băngssi, João Campos, and Zina Saro-Wiwa. The exhibition’s fourteenth edition, slated to open in 2022, will take place at the Museo de Arte de São Paulo and will be curated by the artist and director of the Museum of Modern Art, João Campos.PICTURE: ARTIST ORDER OF THE DAY\n\nIn an effort to address concerns over the exhibition’s future due to the Covid-19 pandemic, the Central Gallery in London is closing its", "The next Biennial should be in 2020, and the 20th will be in 2022.\n\n\nVeteran dealer Bruce Mann’s iconic American Art Museum (AAM) in Chicago has announced that it will reopen in the summer of 2020 following a $1.5 billion expansion and renovation. The museum’s new 16,000-piece Art of the Party building, which opened on the east side of the institution in 2015, and the building’s new gardens and galleries, which will boast more than 1,300 artworks and exhibitions, are slated to open in the spring of 2021.As part of the $3.5 billion renovation, the museum’s historic building and grounds have been transformed into an arboretum. The expansion also added a new structure and grounds for the Fine Arts Research Institute (FAR), which will pursue research into the history of American painting and sculpture to better serve the gallery community, and expanded the AAM’s footprint by adding a new outdoor courtyard and a terrace. Additionally, the north entrance to the museum has been reconfigured so that it will open on the west side in the summer\u0097the south entrance will remain closed.“We are encouraged by the prospect of an opening", "The next Biennial should be held at the Kupala Art and Design Park—a former government-owned campus of the Gandhinagar University, where the exhibition focuses on African art—in September 2021.\n\n\nThe Metropolitan Museum of Art in New York has announced that it is planning to reopen in 2020, following the completion of a major restoration project. The plan is to open the museum on the West Twenty-Second Street campus of the Museum of Modern Art, which will become the center of the new Diller Scofidio + Renfro–designed Diller Scofidio + Renfro.The restoration project—completed in partnership with the architect-historian Peter Zumthor, the city of New York, the Metropolitan Museum of Art, the architectural firm Skidmore, Owings & Merrill, and the heritage conservation nonprofit the National Trust—rebuilt the institution in order to make room for a new exhibition, the first of two, titled The Art of the Future.“With the completion of the renovation of the northern portion of the Museum of Modern Art, the Met became a museum of the future. It has also become a museum of art of the past,” said David Rubenstein, the museum�", "The next Biennial should be held at the Museo de Arte Contemporáneo, Madrid, in 2021. The next edition of the show is scheduled to open in February 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of more than 2,800 photographs from the late Lebanese artist Walid Raad. The donation includes some 400 photographs signed by the artist in his will. The institution had previously given Raad a lifetime achievement award in 2008, but the collection was not announced publicly until 2011, when the works were sold by the artist's heirs.According to the Los Angeles Times, the works, which are among the most important works by Raad, were part of a series that was produced in the 1970s and 1980s. In 1988, the third edition of his series, titled “The Origins of the Image,” was published by the American art historian Sue Williams. The works were also included in a special exhibition at the Museum of Modern Art in New York in 1998.In 2009, the works were included in a retrospective at the Museum of Contemporary Art in London. In 2011, the museum sold them for $5.5 million to the late collector James D. Farqu", "The next Biennial should take place in the spring of 2020. It will also be the last for a group of high-profile contemporary artists that were participating in the event. The artists, including Roberto Cicutto, Naveen Andrews, and Marc-Olivier Peau, are all currently represented by the London-based Artists Agency, and a new venue will be established to launch their next exhibition. The exhibition will be curated by Alexander Bloom, director of Tate Britain, and will be staged at a time the artist most associates with his is now. The artist’s estate has also announced its representation of the Polish sculptor Wojciech Wodiczko, whose artwork explores the relationship between the physical world and the psychological world. The sculpture, which was created during World War II and consists of more than three hundred miniatures, was performed by the artist at the Museum of Contemporary Art in Warsaw. \n\n\nThe Metropolitan Museum of Art (MoMA) in New York has named Emily Chiu as its next executive director. The appointment was made through a collaborative agreement between the institution and the artist’s collective, the Valerie Arsht Gallery, which is represented by Art in the City in partnership with Solve", "The next Biennial should be in 2021. Here is a complete list of all the artists participating in the first round:ADAM ROBERTS (United States)LOUIS PICKENS (United States)ROBERT PAUL (United States)JAMES POSEy (United States)JASON PUTT (France)KEVIN RODRIGUEZ (Mexico)HELEN SULLIVAN (United States)JOSEPH STEVENS (United States)MARY STEVENS (United States)Anastasia Stebbings (Austria)Art is always about the most defined, the most personal, the most present. The exhibition of Robert Paul is both a way to recognize this, and to reimagine and push the boundaries of what art can be.”\n\n\nThe Arts and Cultures Fund (ACF) has announced the sixty-five artists and collectives who will receive a $10,000 grant from the organization in recognition of their contributions to the arts. Last year, the organization awarded $9.5 million in grants to artists and their collectives. The designation was established as part of the 2020 Annual Research Awards, which were presented at the A.F.H.", "The next Biennial should be held in 2020. \n\n\nThe Milestone Foundation, which supports artists and arts organizations through its long-standing grant program, has awarded $2.5 million to fifteen artists in New York City. The tenure-track writers’ first-place prize, which was established in 2007, is one of the organization’s largest fundraising events.Established by the family of Vincent Milestone, the founder of the publishing company the Milestone Group, the event honors the development of innovative and notable work in the field of modern art, and is held at the architecture and design firm Foster + Partners, offices in New York, New York, and New Mexico, and at the artist’s home in West Palm Beach, Florida.The tenure-track gals have won the prize twice, in 2003 and 2011. During the run-up to the 2013 edition, the Milestone Foundation hosted a series of free public performances, curated by the awardees, at which the artists performed solo, alongside other artists from the same year, and the rest of the awardees were selected by a jury comprising Daniels, Richard Armstrong, and Julie Salte, among others.The tenure-track gals will be honored at an", "The next Biennial should address the social, political, and spiritual roots of the pandemic, and the need for new connections between people and art. The exhibition should also consider how biennial programs can continue to contribute to the shaping of the future.”\n\n\nThe British artist and activist Rose Tattleton, who was considered one of the first female artists to be featured in a major retrospective, has died at age ninety-one. The British Foundation announced in March 2019 that she had died at her home in London from kidney failure. The cause of death was chronic fatigue syndrome, and the cause of death was a combination of the two. She went on to exhibit at twenty-eight international exhibitions, including the Sixteenth Venice Biennale in 1998; the Fifty-Third Venice Biennale in 2003; and the Fifty-Sixth Venice Biennale in 2007.Tattleton first made her public mark in 1977 with an exhibition at the Museum of Modern Art in New York, where she worked with the artist to create a new sculpture for the museum titled The Time Traveler. That same year, she moved to Cambridge for a year of study at the Art School, and enrolled in the Art Gallery School in London. In 1979, she moved to New", "The next Biennial should focus on the history of performance art in America. In the meantime, the museum will organize the first Uncorked, an annual celebration of emerging artists in the United States. The biennial will be hosted by the museum and will often feature a selection of artists from the Chicago area.\n\n\nArt Basel and Dior are launching a new campaign designed to raise awareness of the impact that the coronavirus (CVC) and the pandemic has on art collecting. The initiative will include a collection of 200 artworks by twenty-seven artists and will kick off with a virtual reality exhibition at the Miami Beach Art Museum in August.The crowdfunding campaign, which was organized in partnership with Artforum, was launched with the goal of reaching $100 million by the end of the year. “We know the challenges facing collectors and institutions, and we are committed to helping them through our new platform to better understand and value art,” said David Gallop, head of global marketing at Art Basel. “Through a unique partnership, we were able to give some of the most valuable works in the world a virtual reality setting to explore and appreciate their value in a virtual space that is hand-made, explorable,", "The next Biennial should be announced by the end of the year, but the biennial is currently on hold due to the Covid-19 pandemic.Starting in August 2020, the art biennials will be held twice yearly with a theme chosen by the Art Newspaper. The biennial will be curated by Hieb, who previously curated the inaugural exhibition. It will be hosted by an independent, nonprofit organization, in collaboration with the local communities of Oslo and Åbo-Abilene, who will receive $10,000.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than 500 works from a donor who had the fortune to be one of the largest collectors of American art in the country. On Wednesday, the institution announced that it had received a donation of works by artists such as James Turrell, Frank Gehry, and Pierre-Auguste Renoir from a man named Alan Zegart. The museum was also given a crucial volume of work by the artist Ryan Breslin\u0097the first work from the collection to be displayed in the museum.“The gift of Alan Zegart’s work is a triumph of institutional memory and an inspiration for generations of Los Angeles", "The next Biennial should be held in 2021. I suspect that the six-year cycle would have been more beneficial for the institution if the institution had been able to exclude one or two exhibitions a year. The current three-year cycle would have allowed the exhibition calendar to follow a trajectory of some forty years, ensuring that both sustainability and art history were at the forefront of the planning process. I also believe that having a year-round exhibition calendar would have allowed the institution to take more risks in preparing for and hosting festivals; given that it is currently facing several unexpected disruptions, the museum is likely to be forced to move a number of exhibitions later this year—the institution already announced plans to move several shows at once—and also to have more time to rethink and rework its programming. I strongly believe that the ten-year cycle would have been more sustainable for the institution if it had been able to continue training new staff and drawing on the expertise of existing staff. I believe that the current ten-year cycle will only be sustainable for the institution as long as it remains committed to engaging and supporting the local community, to growing the breadth and depth of its collection and to providing opportunities for new and renewed engagement with our audiences. I believe", "The next Biennial should realize the work of all its participants, and should include a discussion of the differences between art and science, and of the possibility of mutual support.” While the biennial had originally been scheduled to take place in September 2019, the organizers decided to move the event to March 2020. Artforum had the opportunity to present a preview of the 2019 edition at the Contemporary Art Museum Stuttgart, Germany, last week. The exhibition, which was curated by Fabian von Brandenburg and Sarah Brandenburg, featured new works by forty artists, including Amitai Etchever, Christo, Dennis Ho, Alynne Balsom, Julie Glass, Wangechi Mutu, and Zoë Wanner-Ross.\n\n\nThe Teppanybayashi Museum in Tokyo announced that it will salvage five ancient terracotta statues that have been missing for more than two decades and donate the pieces to the Japan Foundation for the Arts (JFA) in Tokyo. Founded in 1972 by former artists and collectors to combat the increased popularity of the sculptors of the Shinto godfathers, the institution is currently closed due to the Covid-19 pandemic.Its announcement", "The next Biennial should focus on the relationships between indigenous and pan-Indian art and culture and will attract seven hundred artists from diverse cultural and artistic backgrounds. According to the organizers, the biennial will be organized as a platform to develop and amplify the work of indigenous artists. Commenting on the event, Christopher Edwards, Vice Chair of the museum’s board of trustees, said: “While we have always focused on indigenous artists, the Biennial has evolved into a platform for the development and appreciation of contemporary art and design, a platform for the exchange of ideas and creative projects between the art world and indigenous communities, and a site for public programming. We are very much looking forward to the exhibition and the exhibition of our artists’ work at the same time as they are exploring and displaying their voices in the exhibition.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than a thousand photographs by Cézanne’s husband Jean-Luc Godard, a gift which will also include a selection of his drawings, paintings, prints, and posters. The gift, which was made by the family of Charles Godard, came in the form of a series of boxes, each containing", "The next Biennial should be held in the fall of 2021. \n\n\nFrench artist Georges Apostu, whose monumental figures, including the figures of the Virgin Mary and the Virgin Mary and Jesus Christ, were intertwined in the making of the work that is now the subject of an exhibition at the Musée d’Art Moderne in Paris, has died at the age of eighty-five. Interviewed in an Artforum article in December 2017, the artist said: “My work has always been a way of achieving a certain quality of my own personal existence. . . . I am an artist who is both a poet and a sculptor. My subject is my own life.”Born in Paris in 1929, the son of an industrialist, Apostu studied at the Académie des Beaux-Arts before moving to the university of Ingolstadt in Hungary and then to the École Polytechnique in Paris, where he studied under Marcel Perrin. In the 1960s, he moved to New York, where he lived in a house of Pierre-Auguste Renoir and worked on his first project, the monumental “La Cité des Bénédictines” (Culture and Color). He", "The next Biennial should be hosted by the Museum of Fine Arts in Philadelphia next year. The next is likely to be held in a location in the city’s East End. The museum currently has no plans to move the exhibition, which is currently on view through October 29. The design of the fair was inspired by the city of Chicago’s North and Central cities, which are currently recovering from the effects of the coronavirus. Mayor Rahm Emanuel recently announced that the fairs would open in mid-October, to coincide with the holiday shopping season, and would have three days of running.The partnership between the two cities extends to the USCCA, where Plans for a Regional Art Fair in the East, to take place in late October, in the city’s West End, is still underway.\n\n\nNYC’s Metropolitan Museum of Art—a museum of modern art dedicated to fifty-four artists and collectives whose work has been assembled into a single exhibition—has announced that it is preparing to reopen in November 2020 following a $500 million expansion. The museum will also introduce a new public programming series, “Art of the City,” which will focus on how art is", "The next Biennial should be a reconstituted exhibition that incorporates the original pieces by the artists in the exhibition's collection. While the title does not provide enough background for the artworks to be brought back together, the artist’s concept of a “bio-present” (garden of the mind) is a crucial aspect of the exhibition. The pavilion’s abstract, '80s and ’90s sculptures will also be revisited.\n\nThe Whitney Museum of American Art, New York: The museum announced today that it plans to merge with the Whitney Museum of American Art in a deal valued at more than $2 billion. The move follows the United States’ decision to exit the Paris Climate Action Summit. While the two museums will remain separate, the cultural site will feature new works by Joachim Neugroschel, Tadao Ando, Marcos Oliva, and Ricardo Pedrosa.“The current exhibition is not ready to attract new audiences, or to continue the work of our great artists, nor to present their monumental achievements in a contemporary context,” said Richard Armstrong, director and CEO of the Whitney. “We will continue to innovate and strengthen", "The next Biennial should be held in 2020, and the next year, the museum should be able to move forward with the activities as scheduled, said Anna-Sophie Biogeras, the director of the Biennial and the institutions’ deputy directors. The next edition of the event will take place at the Museo de Arte Contemporáneo in Madrid in December 2020. The 2019 edition was held in the city of Santiago, Spain, and was hosted by Grammy award-winning artist Ana Mendieta. The exhibition was a collaboration between the artist and the museum. \n\n\nThe Open Institute, an Albuquerque, New Mexico–based nonprofit, has received a $3 million donation from the Sacklers, the family whose private equity firms have been accused of intentionally underpricing their stake in the New Mexico Museum of Art (NMMA), leading to a class-action lawsuit that has yet to be resolved. The $3 million gift is the largest ever made by an individual to the institution, which is currently seeking around $2.5 million in damages from the lawsuit. Museum board chair and CEO Kimerly Rorschach said the gift is “a significant step in the fight against the", "The next Biennial should take place in May 2020. “The Festival of Cambridge is a global community initiative that brings together artists, thinkers, researchers, architects, technologists, and others from around the world to explore and rethink the work of renowned British artists,” said Gavin Brown, the festival’s director. “The next edition will be an immersive experience that will empower and inform the British public about the creative and physical possibilities of our planet.”Commenting on the themes of the event, Brown said: “There is an urgent need to push back against the commodification and destruction of art and the future of human activities on this planet. We must demand that governments and cultural institutions break with their own rhetoric, and start by rethinking the world in which we live.”\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Margo Higgs as its next executive director. Higgs comes to the institution from the American Institute of Art (AIA), where she has served as deputy director since 2017. Previously, she was the deputy director of the AIA Art Museum in Philadelphia, where she has served as interim director since October 2018.“We are delighted to welcome Margo", "The next Biennial should be held in 2020. Alexander Kuzma (1924–present) will be the final director of the Museum of Contemporary Art St. Louis. He will succeed Ruth Estévez-DeMar, who has helmed the institution for twenty-five years, and will take up the reins of the museum in July.“The biennial is a challenging project, both for its subjects and for its institutions,” Kuzma said. “I look forward to working with the Museum’s extraordinary team, to creating an exhibition that reflects and celebrates the full range of the work of our curators and artists.”\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) announced today that it has received a donation of twenty-six works from artist and scholar David Barash. The works, which were donated by Barash, Yoni Push, and Manfred Galland, were created in collaboration with François Truffaut, who has served as the director of the Museo de Arte Contemporáneo (MAS) in Madrid since 1985, and were displayed as part of the museum’s long-awaited reopening on September 12. “In the coming months", "The next Biennial should focus on the history of the exhibition and will host a selection of contemporary art by selected artists in the coming months. The institution has also announced that it will open a branch in the United Kingdom shortly.\n\n\nThe Spanish government approved a $4.5 billion loan to the Spanish National Museum (Museas de las Cultura), an attempt to raise funds for the institution sparked nationwide protests in 2015. The payment was made on June 1, the same day that a new museum was inaugurated in the capital, Madrid, that will present the country’s indigenous heritage. The institution is currently undergoing a $1.5 million expansion.Museas de las Cultura is situated in a former sugar refinery in the city of Iglesia, south of Madrid, and will be inaugurated by Juan Antonio Martinez, a descendant of the sugar producer Casa de Santandrina, in September. The museum will also showcase contemporary art by artists including Agustín Arruda, Laura de Cáezas, and María Elena Rivera, and will house historical works by artists such as Ed Ruscha and Pablo Picasso. Inaugurating the museum will be a new theater, and in the academic year 2019 will mark the", "The next Biennial should feature the work of fifteen artists, including Peter Kuznick, Ondine de Zegher, and Laura Owens, who will exhibit new work in multiple locations, including at the museum.The theme of the new exhibition is “Influence of the Past on the Present,” and the seventy-third edition of the biennial is currently underway.\n\n\nThe Israeli Museum of Fine Arts (IMMA) in Jerusalem has appointed Lieberman Ariel the next director of the institution. In his new role, Ariel will be responsible for overseeing the reconstruction of the institution’s campus in an effort to strengthen its international profile. “The project of a new campus for the museum is a project of many years in the making, and has included a number of years of public consultation, public engagement alongside the institution’s board, and a number of international exhibitions,” Ariel said in a statement. “I’m particularly pleased to be able to make such a big contribution to enhancing the museum’s international reputation and to be able to help to shape its future as a major international art institution.”In his new role, Ariel will work closely with the board and the staff to ensure the", "The next Biennial should take place in the spring of 2021. It is expected that the exhibition will include work by sixty artists.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has acquired forty-seven works by the late American artist Jerome David, who, in addition to painting and sculpture, also created paintings and drawings. Among the works are David’s work, “Diana,” 1959, which was presented in a collaborative exhibition at the museum in 2001 and is currently on display in “Diana: She and Jerome” (2019). The exhibition has also featured works by Dev Patel, John Carlson, Jean-Michel Basquiat, and Edward Hopper.“The exhibition is a landmark in the history of twentieth-century art,” said John L. Evans, chair of the museum’s curatorial team. “It is a tribute to all those who have had a major role in bringing these works to light, and to all those who have made this possible.”In addition to the works acquired for the exhibition, several works, including two models of a gladiator and an African-American woman in a wheelchair, were included in the first edition of �", "The next Biennial should focus especially on gender and sexuality. This theme will launch with a series of events that will unfold across the world as a celebration of the legacy of the late poet and scholar Noël Carroll. The opening ceremony will take place in the exhibition space Centerpane, which will be transformed into a gallery and museum for exhibitions featuring work by contemporary artists. The event will also introduce a new series of concerts, performances, and screenings, called the Seths Curated Showcase, and will be supported with an advertisement campaign that will feature the work of artists and will be curated by the Seths. The biennial’s inaugural edition, which would have taken place in 2018, was postponed because of the Covid-19 pandemic. The 2019 edition will be held at the United States Bankruptcy Museum in Detroit and will run through January 2021.\n\n\nArtnews reports that the Venice Architecture Biennale will be held in 2022 and will feature eight works by twenty-three artists, including Konstantin Dimitrov, Johannes Dochantschi, Adrian Ghenie, Oksana Kudryavtseva, and Dmitri Mendeleev. The exhibition will revolve around the themes of refugee and", "The next Biennial should be held in 2021.\n\n\nThe National Museum of Fine Arts (NMFA) in Kansas City, Missouri, has welcomed Margaret Hamilton to its staff and board. The seventy-nine-year-old curator and art historian will be the first woman to helm the institution for nearly forty years.“Margaret has already successfully led several excellent institutions over the past twenty-four years, and she is poised to continue to push the boundaries of art history and contemporary art by establishing a strong institutional history museum in the heart of Kansas City, Missouri,” said museum director Edward DeNiro. “Her appointment affirms the importance of the museum in both of her prior roles, deepening the museum’s already important relationship with its community.”Hamilton first joined the institution as a curatorial assistant in 1976. She later became an assistant curator, and in 1988, she took the helm of the museum. Her tenure has been marked by frequent collaborations between the museum and the local community, including with artists and activists such as Illinois native and rapper P. Diddy, the artist Tanya Bonakdar, and artists such as Tracy James; Lori Bruce; and Marwan Chery. Hamilton also fostered the institution’s", "The next Biennial should include a new lecture series; a public public program for drawing/painting/printing; and a construction of the third floor of the museum.\n\n\nThe Manchester Art Museum (MA) has appointed David McAllister as its new deputy director and chief curator. McAllister is the founder and director of the Los Angeles–based nonprofit the Mid-Atlantic Community Center (MACC), which serves as a hub for artists in the Southeast United States. He succeeds Liz Salter, who will retire at the end of the year, and will take up the post in June.“David is a gifted curator who has been instrumental in developing new and important work in the MACC’s library. His work has been collected by the Los Angeles County Museum of Art, the San Diego Museum of Art, the New York Museum of Modern Art, the Whitney Museum of American Art, the Museum of Modern Art, the Metropolitan Museum of Art, and the Whitney Museum of American Art, among other institutions, and has been presented at major international exhibitions, including the Venice Biennale and the Venice Architecture Biennale, which took place in Lisbon in 2017 and 2019.“I’m excited to welcome David to the MACC", "The next Biennial should take place in 2021, but organizers are currently evaluating which cities in the world are best equipped to host the event. The next edition will be hosted at the V&A in London, and will include the works of fifty artists chosen from a shortlist that included Marcel Proust, Bernardine Miro, and Udo Kittel.The selection committee members were:Albert Mohler, Switzerland•Alda Zervos, Australia•Andrea Pincher, Italy•Sarah Tse, United States•Hannah Wilkes, Canada•Andrea Montanari, Italy•Brian Van Impere, Germany•Benedict Evans, Australia•Benedict McArthur, Australia•Bijan Majeed, Pakistan•Bijan Mandir Sharma, India•Bijan Sujata, India•Bijan Sharma, India•Bouverie Gammon, Australia•Bitch Shively, Australia•Amanda Rossiter, USA•Andrew Presgrave, England•Andrew Smith, Australia•Catherine Roscoe, UK•Carlotta Olver, UK•Caroline Johnson, Canada•Car", "The next Biennial should take place at the Museum of Contemporary Art Paris in 2020; and in order to give the assistant curators, Maia Vassallo and Aurel De Malo, more time to organize the exhibition, the institution has also extended the opening date to July 25.“I believe that all art is created from the same soil,” artist and curator João Barbosa, a founding member of the contemporary art group Socialista, told the New York Times. “The ground of the artwork is the soil of the artist’s life, and we need to change that by creating more space for that to happen.”Since Barbosa moved to Paris in the early 1980s, his work has been collected by the French National Collection and the Metropolitan Museum of Art in New York. Barbosa has also been featured in the third Biennial, the exhibition “Louise Bourgeois: a La Opposition” (2015), at the Museum of Modern Art in New York, and the first show of Barbosa’s art at the Museum of Modern Art in New York, “José Lorraine: Overture” (2016). The museum selected Barbosa’s work for its 150th anniversary", "The next Biennial should be held in the United States. “We are optimistic that this year will be a landmark,” said William Koch, chairman and CEO of Koch. “The current climate is changing rapidly and we need to do everything we can to slow this down. Yet, we must not give up. We cannot allow the current unsustainable trends to continue. The question is: how do we prepare for the worst?”A special exhibition of works by artists from around the world is currently on view at the Kunsthalle Basel, Switzerland, from March 21 to March 25. The first of the four shows is titled “Unfinished Business.” The show consists of thirty-two works, divided into twenty-three categories, and contains two hundred photographs by the American artist, including some of the earliest contemporary examples of his paintings. Opening the exhibition is a special collection of twelve photographs by the late Italian architect Carlo Cattelan. The exhibition is part of the first two-year round at the museum, which opened on Wednesday, March 13. \n\n\nSometime on Tuesday, the French Ministry of Culture, Culture, Sport, and Sports will present the country with a major new law. The bill,", "The next Biennial should focus on the history of the art and not about the artist, but about the art itself, its relationship to the real world, and its relevance to the future.” The 2019 edition of the award will feature thirty works by eighteen artists, including an exhibition of work by Minchin, Lee Joon-hee, and Lee Ho-kyu, as well as works by artists who are excluded from this year’s show: Hans Streib, Seo-kye Kim, and Yung Gook-kyu. The awards will be presented by the Roy and Virginia Lucas Foundation in partnership with the National Museum of Modern Art in Seoul and the Griffith Museum of Art in Los Angeles. The winners will be chosen by a jury composed of Becca Max and Larry Fink, the founder of the Max and Virginia Lucas Foundation, as well as Jennie O. Lee, director of the Griffith Museum of Art and former head of the Office of Contemporary Art at the Griffith. Biennial Director Jogo Oiticica said: “The awardees demonstrate a remarkable breadth and depth of artistic practice across the six themes featured in the award, representing a range of different approaches to art and the human condition. We are eager to see how", "The next Biennial should take place in 2020, and the ninety-seventh will be staged in 2021.\n\n\nIstanbul’s pro-Kurdish People’s Party (HDP) has been banned from staging a performance at the exhibition “Adham Dalal: Rising to the Challenge” in the southeast city of Adana, Turkey, until March 14. The law enforcement agency that carried out the suspected coup last June, which killed at least 240 people and wounded another 1,300, has now arrested twenty-one suspects in the case and has issued thirty-three fines, and the party has been held responsible for violating a number of articles of the country’s constitution, including an article that declares the leader of an opposition party “the enemy of the state.”The list of twenty-one people who were arrested for the allegations against the party reads like a Who’s Who of Turkish secular political figures. Most notably, it includes former deputy prime minister Mehmet Simsek, who was forced to resign in February 2019 after he showed up at an opposition rally accompanied by a group of around twenty other parliamentarians in Istanbul in July 2018; and Meral Yağıl, who was elected", "The next Biennial should be held in the summer of 2021, with the premiere of the work of the first iteration being held in the autumn of 2021. The 2020 exhibition was curated by Sophie Weafo, the director of the new Kunstraum GmbH in Graz, Austria. The 2020 exhibition will be held in the newly opened Kunstraum GmbH in Graz, Austria, where it will be curated by Kunstmuseum Fünsternhaus Vienna. The program will be presented by Tomáš Zegada, director of the newly opened MAMCOFSTA in Vienna, and will be held at the Kunstmuseum Fünsternhaus in Zürich. The 2020 exhibition will be hosted by the Center for Contemporary Art in Herzogenaurach, Austria, from July 7 to July 10. It will be followed by a series of lectures, exhibitions, and other events in the city of Reims, from July 15 to July 21. The exhibition will be directed by Kjartan Černa and will include work by thirty-four artists selected by a committee chaired by Zoran Popovici, director of the Gal", "The next Biennial should take place in 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than 8,500 photographs by David H. Koch, the billionaire industrialist and founder of Koch Industries, in support of the institution’s effort to increase the museum’s budget by $4 million over the next two years. The gift includes 4,500 negatives, many of which were acquired between 1962 and 1974, and will enable LACMA to build an additional 1,200 images of the billionaire’s collection, which comprises more than 8,300 photographs.“If we don’t do this, we’ll never get these photographs to the public,” said museum director Marc Glimcher. “We will never have the opportunity to study them in their entirety, and we will never be able to appreciate them fully. We will never have the opportunity to study them in any detail, and we will never be able to publish them.”Koch’s gift includes the negatives, which he acquired from a former employee of Koch’s, Ernst Weizsig, who was a photographer at the company from 1981 to 1994. Koch recruited We", "The next Biennial should take place in the spring of 2021. Bhaskar, a master curator whose work explores the concept of the composite, will lead the exhibition. In a letter to the curators, Zoya’s Chelameshwar Rao and Manoj Sharma said: “We are thrilled to be able to organize such an amazing exhibition with the clear and engaging vision and vision of the curators, as they have enjoyed a lifetime of success and excellence. The exhibition will have a major impact on the lives of many generations. We hope that you will join us in this journey and see the exhibition again in the spring of 2023.”\n\n\nThe new $100 million The Metropolitan Museum of Art in New York is planning to begin welcoming visitors again next spring after a temporary closure due to Covid-19. The institution—which last month laid off or furloughed more than 1,500 employees—said it expects to reopen in the fall.Following a meeting with employees on Tuesday, April 7, the museum raised its tentative opening by a week to June 3. The announcement follows months of protests and pleas from employees, who called for the institution to defer opening until the government lifted its import ban.“We", "The next Biennial should be held within a year; in 2020, the second and final editions are scheduled to open in the spring.According to the organizers, the major themes of the twenty-third edition of the exhibition are “museum as a platform for radical imagination\u0097as a tool for the actualization of radical aspirations\u0097and ‘the museum as a place of dialogue.” Edelman also stated that the exhibition will include “new and innovative textual and performance work,” which is part of a project that focuses on “more than a cataloguing of objects; it is a collection of new possibilities that enable us to live and act differently.”The 2020 edition of the Biennial will be held at the Saint Louis Art Museum until March 29, 2021. The 2022 edition will take place at the Museum of Fine Arts, Boston.\n\n\nNew York’s Metropolitan Museum of Art (MoMA), which faced a legal action from the families of eight people who were killed when the museum’s New York storage facility, the Met, shut down in September, has settled with the families of three others for $7.5 million, the New York Times reports.The settlement, which involves four individuals:", "The next Biennial should take place in 2021’s iteration at the Grand Palais de Tokyo. Its staff will be announced in July, and the full list of participating artists will be announced in September.\n\n\nThe Museum of Contemporary Art (MoCA), Chicago has appointed Aurora Castellano as its next president and CEO. Castellano comes to the institution from the Metropolitan Museum of Art, where she has served as director of exhibitions since 2000. During her tenure, she curated “The Untouchables: Contemporary Art from the Untouchables,” which premiered at the Metropolitan Museum of Art in January 2019; “Live and Embodied: Biennial of Expression at the Metropolitan Museum of Art” (2019); and “Raide the Moon: Contemporary Art in the Sky,” which opened at the Met last spring.“I’m so thrilled now to welcome back to Chicago one of the most celebrated and respected figures in the field of contemporary art,” Castellano said. “Alistair is an international iconoclast and a master of his craft, and it is his responsibility to sustain MoCA’s artistic mission while leveraging space at the institution for the next generation of thinkers, artists", "The next Biennial should be held in 2022, and the show’s conclusion in 2024. It is currently slated to run until February 11, 2023. The biennial’s first edition, “The Future Is Present,” will be staged in the United States in July 2021. In October 2022, the show will return to London for a second edition.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Diana S. Martin and Sherri Rizzo as interim directors. They are currently the cochairs of the institution’s board of trustees, which oversees the museum through its annual fall exhibition, “The End of an Era,” as well as in charge of the institution’s programs and collections.“We’re thrilled that Diana and Sherri are coming to our institution as we continue our work to expand the exhibition and education programs that have made MoCA unique,” said Matt Lloyd, chair of the board of trustees. “Their expertise, dedication, and enthusiasm will be a wonderful addition to our talented and dedicated staff and board. We are confident that their ability to translate their strong understanding of both art and their unique visions for the museum will be an added", "The next Biennial should be held in 2022, and the first in 2021.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released an open call for proposals for the 2020 season. The call will run until September 1, 2020. The deadline for the institution—which will be renamed the Cultural Fund in honor of the city’s generosity in support of the cultural life of the city—is September 10. Cultural Affairs director Daniel H. Weiss said: “The cultural experience the city has created for New York City is unique, and we are eager to support this city’s arts and culture in any way we can. We know how important it is for arts and cultures to thrive and thrive in communities; we know how important it is for artists and cultural workers to be supported and incentivized; and we know that cultural institutions play an integral role in attracting and retaining new residents. I’m excited to see what the next season of the Cultural Fund will look like.”The Eliot-Sweeney Cultural Fund was established in 2009 to help New York City’s arts and cultural organizations through the economic impact of the Covid-19 crisis. The fund is charged with administering grants ranging from $", "The next Biennial should be held at the Pérez Art Museum Barcelona in the spring of 2020. The next edition of the festival will be held in the autumn of 2020.An open-air exhibition of works by the biennial’s curators, Fernando Rojas and Nuria Alves, will be staged at the National Gallery in Madrid in the spring of 2021. The exhibition will include works first exhibited in the biennial’s third edition, “Avant-Garde in Social Practice,” which was staged in the city of Barcelona in the spring of 2019. The show will feature works by twenty-eight artists, including Amalia Cäsaro, José Luis Campos, Francisco Cháire, Ana Modrúa, Javier Bonucci, and Arash Ghani.\n\n\nAfter the Museum of Contemporary Art (MoCA) in Los Angeles closed for a ninety-day exhibition at the end of February to promote the exhibition “Japan and the West: From Modernism to Ambience,” the institution abruptly reopened in March, announcing the purpose of the event, “to begin exploring how contemporary art and Japanese art has undergone a radical change from Modernism to the post-Modernist vision", "The next Biennial should be held in September 2021. Architecture historian Daniel Holleman, who toured the new exhibition in Tokyo this summer, said: “The new exhibition, ‘Inaugurations,’ marks the first time the institution has presented an exhibition dedicated exclusively to the exhibition of the work of the artist. I strongly feel that the exhibition is the ideal occasion for the exhibition of the work of the artist in the country. It is an opportunity to re-invent the exhibition, and to re-create the exhibition.” The project has been supported by the Riga Foundation and the Kursk Prize. A selection of works by the show will be presented at the exhibition as part of the ongoing series “Volta: From the Circus to the Museum” (2019–20), curated by the Riga Foundation in collaboration with the museums of the city.\n\n\nThe Prince George Museum in London has announced that it will stage a new exhibition, “From the Circus to the Museum,” on September 23, 2020. The exhibition will consist of a group show on the life and work of Duru Mirza, a Latina, Brazilian, and Italian artist, and will take", "The next Biennial should have a strong, interdisciplinary and international lineup of artists, architects, thinkers, and performers who are entering the third edition of the International. The exhibition’s opening reception will be held on November 22 at the Secretarÿÿs headquarters in Vienna. \n\n\nThe MCA Southbank Center, a new arts hub in the city of Bristol, England, has launched on the London Borough of Southbank and is planning to open to the public in 2020. The center will feature the permanent collection of the British architect and institutional space for contemporary art, which will be housed in a renovated old train factory that is currently undergoing a $2.5 million expansion.The new space will be inaugurated by a solo exhibition by British artist Rachel Whiteread, which will be followed by an exhibition of work by British-based Latino artists Miguel Vivian and Marc Sender, as well as a solo presentation of work by Sarah Latimer and Mark Rylance.The new museum will also have a replica of the Underground, an ancient tube system that runs between Chisenhale and Whitechapel in central London, as well as the main building, which will be transformed into a hub for local, regional, and international contemporary", "The next Biennial should be held in 2020. The next iteration of the '60s Biennial will take place in 2021. A new exhibition, “Fashion” will be presented by the UW–Madison. A new information and programming platform, “Fashion Central,” will be launched by the UW–Madison. The department of commercial art and design, which has been in operation since the ’60s, will continue to operate, consolidating, organizing, and presenting works.\n\n\nThe Ottoman Sultan, Abdussalam M.I. Azzam, and his son, Abdussalam II. Photo: Fotopress.\n\n\nThe Egyptian artist Talaat El-Khatib has been selected as the recipient of the 2020 Jordan-based Prix des Arts et Papes, which honors emerging and established artists. The prize, which is given annually to a contemporary artist and is sponsored by the state of Jordan, is one of several prizes awarded by the country to honor the life and work of individuals. El-Khatib, who grew up in the northern city of Beit Hanoun and studied at the prestigious Amherst College in Massachusetts, was chosen for his 2014 installation The Circle,", "The next Biennial should take place in 2020.\n\nAdvertisement\n\nThe biennial will include more than 150 artists, including Yoko Ono, Nari Ward, and John Aloysius, and will be held at the newly renovated Art Museum Houston’s new home, the Yuz Museum, as well as at the Houston Museum of Art and the Texas A&M University Health Science Center. The event is being hosted by the Southern Exposure Foundation, an affiliate of the Foundation for Contemporary Art and the Healing Arts, and the City of Houston.The event will come on the heels of the city’s first-ever Art and Science Festival, which will take place in December. This year’s event will feature work by twenty-nine artists, including Ryan Chen, Jean-Luc Godard, and Jean-Michel Basquiat. The biennial’s theme, “Plants, Animals, and Life in the Garden,” will be “Plants of Time,” “Animals and Life in the Garden,” and “Plants of Life and Water,” among others.\n\n\nThe Hungarian-born, Los Angeles–based artist, theorist, educator,", "The next Biennial should take place in 2021. “The exhibition and the show are not done yet,” Kunsthalle Basel said in a statement. “We are working with the future artist to make sure that the exhibition is a success.”\n\n\nThe Metropolitan Museum of Art in New York has announced that it will reopen in the fall with an exhibition encompassing the work of 148 contemporary artists and collectives. The twenty-eighth edition of the Biennial, “The Only Way: The Modern Art of New York City,” will open on September 23 and be hosted by the museum's New York Gallery of Art. The show will also be shown at the Whitney Museum of American Art, which recently celebrated its thirteenth anniversary with a show that encompassed work from the New York Currier’s collection.The exhibition will touch on themes such as the 'New American Poor,” and the present state of American art, with work by eighty-six contemporary artists from thirty-six cities across the United States. The biennial will conclude with a review of the work of forty-eight contemporary artists from thirty-eight countries.\n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco has appointed", "The next Biennial should take place in 2023.“This is a moment of change, and we must work together,” said Hans-Georg Maaßen, the director of the Biennale d’Arles, in a statement. “It is also a moment of opportunity, of a new beginning, of creating new bonds of solidarity between people of all cultures. The Biennale d’Arles will be the beginning of a new way of thinking about the art of the future through the medium of art.”\n\n\nThe Library of Congress has released the list of fifty-five artists whose works will be included in the forthcoming exhibition “Art and Architecture in the Age of Mechanical Reproduction” at the Smithsonian American Art Museum (SAAM). The seventy-one works are listed in the exhibition “Art and Architecture in the Age of Mechanical Reproduction” and are curated by Andrew Kreps, who is also the curator of modernism at the Museum of Fine Arts in Detroit. The exhibition will open on September 22 and will run until November 21, 2020.The fifty-two artists on the curators’ list are: David Adjay (New York City), Rirkrit Tiravan", "The next Biennial should be held in the spring of 2020, with the objective of gathering the biennial’s audience and of incorporating new and traditional approaches. \n\n\nThe MFA in Shanghai has appointed Dr. Sunil Gupta as its inaugural director, effective immediately. Gupta comes to the institution from the Taiwanese Cultural Association, the largest patron of artistic endeavors in China; the MFA in Shanghai.Born and based in New Delhi, Gupta is the founder of Sunil and Associates, a New Delhi–based arts consultancy. He also runs his own practice, which focuses on integrating contemporary art and philosophy, and his own eponymous practice.“Sunil has built a successful career and career of his own through his extensive experience in the business of art and his vision to develop and support the MFA in Shanghai,” said MFA director John Hirst. “In this new phase of his life, he has the opportunity to realise this vision to build upon the MFA’s reputation for exceptional exhibitions and scholarship across the globe.”Gupta joins the MFA in Shanghai from the Taiwanese Cultural Association, where he has served as the general manager since 2015. He also previously held the positions of chief executive and director of the Beijing", "The next Biennial should take place in 2021 and will be a combination of two formats. The first, a contemporary biennial, will present innovative new works, from a cross-section of artists and would-be collectors, and will include a 3,000-piece exhibition featuring work by artists and collectors across the globe. The second, a traditional biennial, will present works by known and unknown artists, focusing on the influence of the different forms of art in the museum. The theme of the upcoming biennial will not be “art in the museum” but “the museum as a platform for art.”According to the Los Angeles Times, the museum is currently discussing ways in which it can become more technologically sustainable, as it attempts to address the long-term health and sustainability of the institution. The museum’s board chair, Richard Serge, said: “We are aware of the challenges that are ahead and we are actively working to ensure that we have the technology and the knowledge to make the Biennial 2020 a reality.”\n\n\nThe Royal Academy of Arts (RA) in London has appointed famous British painter John Gay as its next director. He will succeed Sir David Attenborough, who has been appointed director of", "The next Biennial should be held in the spring of 2021. \n\n\nThe Museum of the African Diaspora (MoAD) in Atlanta announced today that it is reopening to the public in the spring of 2021. The museum has been closed since October 29 due to Covid-19, and has been closed ever since. The museum has faced numerous setbacks since it began closing its doors for good on October 29, as the United States attempted to contain the virus.In a statement, the museum said: “The museum has been a beacon of hope for many during these last weeks and months for those in need of a place where they can come together and feel welcome. At the same time, we are conscious of the challenges that we face as we move forward with our plans for the future. We will have more to say about our future plans as we work through the post-coital period.”For those who were unable to travel to the museum on October 29, MoAD will schedule a virtual tour of the museum later this month. MoAD will also have increased its hours to accommodate the anticipated crush of visitors. \n\n\nThe Museum of the African Diaspora (MoAD) in Atlanta has received a $5.5 million", "The next Biennial should take place in 2021 and will draw from stories told by three hundred artists from fifty countries. Among the works selected are the work of Max Beckmann, Terence Blanchard, Jocelyn Tran, Nicky Smith, Aishwarya Naidu, Adrienne Buss, and Mary Ault.The exhibit will present the work of artists whose work has been digitized and will include works by artists such as Moes Akerman, Zoya J.P. O'Brien, and David C. Driskell. In addition to a selection of the exhibition’s artwork, a selection of the exhibition’s non-artistic works will be available to view on the exhibition’s website.The Biennial will also be hosted by the University of Exeter, in partnership with the University of Oxford, the University of Glasgow, and the University of Cambridge. The exhibition will be hosted at the Exeter Museum of Art from September 13 to September 20, 2020.The 2019 exhibition was curated by Kate Sulloway, curator of modern and contemporary art at Tate Britain, and consists of sixty paintings by twenty-seven artists, including Timothy White, Terence Blanchard, Maud Perretta", "The next Biennial should be held in 2022.\n\n\nAfter a long-overdue redesign, the Museum of Fine Arts (MFA) in Boston was awarded the 2019–20 National Endowment for the Arts (NEA) Leadership Award. While the NEA does not award the Leadership Award to a museum in its entirety, it does recognize one institution as the \"Center of Excellence for Art Discovery in America’s Cities.” The 2019 winner is, currently, a curatorial project called Footprints, a collaboration between artist and architect Mariette de Vries and their London-based nonprofit organization the Centre for Architecture and Design (C8AD). The project will showcase the work of sixty-five artists in a series of exhibitions, culminating in a solo exhibition at the Museum of Modern Art in 2020.Curated by Mariette de Vries and Richard Sack, a senior curator at the Museum of Modern Art, Footprints will be the first exhibition at the Museum of European Art in Paris. The project, which is being organized as a collaboration between the two institutions, will feature twenty-six works by artists whose work was included in the 2019–20 edition of the National Book Award. In addition, the center will present a series of exhibition", "The next Biennial should be held in the next few months, and should be a full exhibition of the work of the artist, with a new exhibition organized to follow. This year’s theme, “Children of God,” is a reference to the famous painting by the German artist Dietrich Ludwig (1792–1860), which shows a child holding a cross. The winner of this year’s $3,500 Prize will be announced on August 27. \n\n\nThe Museum of Modern Art (MoMA) in New York revealed today that it is planning to move the legendary acquisition site for the collection of the late Egyptian architect Mohamed Alia Al-Khalili, known for his monumental Great Pyramid of Giza, and has opened a new digital platform for the exhibition. Called the Catalog of Egyptology, the platform will allow visitors to browse through the history of the collection from the Egyptian architect’s point of view, as well as to purchase works by Khalili’s immediate circle, including Alia’s grandmother, Alia Saad, and his cousin Khaled Saad.The Egyptian architect was a prominent supporter of the Museum of Modern Art in New York, which he started in 1976", "The next Biennial should take place in 2020, and the first at least ten years after that.” The next edition of the International Femke Papp, which will be held in the city of Aarhus, Denmark, will be held in the city of Copenhagen in 2022, and the Danish pavilion at the forthcoming edition in Beijing will be staged in 2020.The 2019 edition, curated and organized by Østbyrød Larsen in Amersfoort, Denmark, was shuttered in April 2019 due to Covid-19. \n\n\nThe Pérez Art Museum in the City of Mexico City and the National Museum of Modern Art in the Mexican State of Oaxaca have announced that they will not open their first exhibitions since the pandemic began in earnest. The institution’s distribution center, Pérez Histórias, is currently closed and the museum’s four other locations are expected to remain shuttered through at least the end of August.In a joint statement, the museums said that the pandemic has forced them to “work together,” and that they are “concerned for the well-being of the staff and the Pérez Art Museum.” It also noted", "The next Biennial should be held in 2020. The Biennial is a joint initiative of the Centre d'Art Contemporain (CADA), the Centre d'Art de Lyon (CAL), and the Centre national des Arts et Lettres (CNA). “The future of art is fundamental for the future of humanity,” said Paris-born and Berlin-based artist Ed Moses. “I hope that this year’s show will be the last, and that next year will bring us the first.”The exhibition will be curated by Gilles Jarre, curator of contemporary art at the Museum d’Arles in France; Olivier Jakob, assistant curator at the Museum of Modern Art, New York; and David McAllister, curator of contemporary art at the Museum of Modern Art, Los Angeles. The show will feature works by seventy-five artists, including Yinka Shonibare, Irman Gebreel, and Lina Gebreel, as well as works by contemporary artists, including Thomas Cairoli, Oscar Cervino, and Jérémie Galetti. The 2019 exhibition, titled “The Coming of Age of Art” and", "The next Biennial should take place at the Geisstheater in Vienna in 2021.  The upcoming São Paulo Biennial will be held at the Museu de Arte Contemporáneo in the city of São Paulo in 2022.\n\n\nThe Museum of Fine Arts (MFA) in New York, which celebrates the work of over eight hundred contemporary art critics and artists, has launched a new initiative to support artists in need, offering them grants ranging from $500 to $3,000, in an effort to help them afford housing and other expenses related to moving to and from the institution.The program, called Artist Resilijan, will provide art scholars with a $500 cash grant for moving expenses; $500 for moving to and from the institution; and $500 for moving to and from another institution. Applicants will be required to demonstrate financial need as well as an ability to demonstrate that they have a one-to-one match for funds. “MFA is committed to supporting the artists and their families who make its exhibitions and to supporting their creative practices through an open and transparent program of grants, loans, and fellowships,” said MFA director Kathryn Lozano. “We", "The next Biennial should be held at a location that has a contemporary art museum, as long as it is not too far from the center of the city, such as the Marfa Museum of Art, which is located in a former auto body shop. The venue should be an open area, with plenty of natural light, and should be accessible by public transportation. “The work of scholars such as Ed Moses, Jeffrey Gibson, and the late Israeli artist Orit Ben Dahan is an inspiration to us all,” said Andrew Kreps, chair of the board of trustees for the Museum of Contemporary Art Chicago. “This is a moment of profound change for Chicago and the world, and it is our job as curators to shape the future through engaging with contemporary art. We are committed to working with our community to help shape the future of the museum, and when it reopens next month, many of our new questions, answers, and proposals will be relevant to the history of the institution.”The Museum of Contemporary Art Los Angeles announced that it will change the opening hours of the museum and its adjacent location, the Museum of Contemporary Art San Diego, and the Museum of Contemporary Art San Francisco, which are currently open seven days a week.", "The next Biennial should take place in 2021 and the 2019 Biennial will be staged in 2018. \n\n\nThe Manchester Museum of Art (MMA) has commissioned the Swedish artist and designer Annika and Risto Kristensen to create a new drawing and installation, titled Art and Love, for its upcoming exhibition “Seeds of Love: Art and Politics”–a collaboration between Annika and Risto. The installation will open on the museum’s collection space, “Nirvana’s Office, on March 6. The work will be on view until November 27.”The commission was made after the two artists, who are known for their experimental installations that largely consist of drawings and sculptures, met in 2017. The pair then decided to create a collaboration between the two artists that would explore the relationship between religion and art. In 2018, the installation was exhibited at the Sundance Film Festival and was included in “Artists Speak Out: Inside the Church of Minimalism,” a special exhibition organized by the Manchester Museum of Art to commemorate the centenary of the institution.The work, which was created in collaboration with artist-in-residence Evgeny Morozov, will be placed", "The next Biennial should focus on the changing role that art and science play in contemporary life. “We are at a crucial point in our history,” director Sarah Lawrens said. “We have the chance to transform our world, and to shape it, with art. . . . Art will continue to shape my life, shape the course of my career, and shape the future of art.”\n\n\nThe Fay Art Museum and Sculpture Garden in Detroit has announced its representation of the artist-designed contemporary art museum, which has hosted the Fay Gallery since 1988. The institution is currently home to a renovation and redevelopment project led by the Center for Contemporary Art (CCA), and will open in the summer of 2021.The museum will incorporate more than 250 works by the institution’s artists and will feature three new works by British artist Jon Pert, who will be featured in a retrospective organized by the CCA in 2022. The museum will also include a new public space on the first floor of the institution, a new public courtyard, and a two-story, 270-seat theater. In addition to these initiatives, the museum will present its inaugural exhibition of modern and contemporary art: “Jon Pert: Pol", "The next Biennial should be held in 2020, according to the exhibition’s organizers. The twenty-second edition of the festival, scheduled to take place in the city of Biennale Rotterdam, was cancelled due to the Covid-19 pandemic in March. The event was rescheduled for June and will be held in June 2021. The 2021 biennial will also feature an exhibition of new works by artist Ramón Huertas.The new edition of the festival will be organized as follows: If you already bought a ticket to the show, you can re-register as many times as you like. However, once the show reopens on July 16, no more than two performances may be staged at one time. The show will also be open to the public again on July 17. \n\n\nThe Museum of Fine Arts (MFA) in Boston is planning to move the exhibition “The Great American Novelty Fair,” which runs from March 17 to March 19, 2020, from its current home in Dorchester—where it will remain closed until March 21—to a new space in Cambridge. The move is part of a $50 million renovation project that will also include the addition of a new public", "The next Biennial should be organized in the spring of 2020.\n\nThe Museum of Modern Art (MoMA) has released a list of thirty artists who will participate in its forty-fifth edition, titled “Art in the Age of Resistance,” at the Museum of Modern Art in New York between November and March 2020. The twenty-first list was announced yesterday, and the twenty-fifth is currently undergoing certification. The theme of the biennial, “Intersection of Cultures: Art in Transition,” is an echo of the theme of the fifteenth edition, “Art in the Age of Resistance,” which was held at the Museum of Modern Art in New York between October 2017 and January 2019. “Although the 2017–18 exhibition season was a step in the right direction, the exhibition program for the fifteenth showed a notable lack of awareness of the current artistic landscape,” said David L. Zucker, chair of the institution’s board of trustees. “We are deeply concerned by the fact that the eighty-six artists selected to participate in this year’s edition were not consulted on the exhibition program or the selection of these thirty-six great artists. We hope that this will be", "The next Biennial should be in 2021, with the first edition scheduled to take place in the city in February 2022. The event will be hosted by the city of Manchester, with the help of a consortium of cultural and arts organisations including the Ballet, the Blue Peter Opera House, the Bluegrass Theatre Company, the Bluegrass Revival, and the Bluegrass Arts Festival.  “The Biennial is in a unique position at a critical point in its history, with the city as the epicentre of British cultural life for the first time, and with a remarkable collection of works to choose from,” said Mark Tiwani, chairman of the Manchester Biennial. The Biennial was founded by the Manchester City Council as part of a £150m regeneration plan that also saw the dismantling of the city’s Oldham Town Hall and the reopening of the city’s River Wear. The first edition of the event—which will be hosted at the Basilica of St. Paul’s—was canceled owing to the Covid-19 pandemic. However, following an outcry from the local community, the council decided to stage the event again, this time in September. The new date for the event"]