["The next Biennial should focus on institutionalizing the collection’s academic research. The venue will also host workshops, lectures, concerts, and other events devoted to the work of the biennial’s trans-disciplinary artists. A selection of artists from the Biennial will be presented at the institution in the coming months.\n\n\nThe Museum of Modern Art (MoMA) has appointed Jack Ruggiero as its next executive director. He will be the third African American to lead the museum since its founding by Italian architect and businessman Ad Reinhardt in 1940. Ruggiero succeeds Charles A. Birnbaum who served as MoMA’s executive director for fifteen years, and will begin his tenure in January 2020.“Jack’s background and track record as a leader, curator, and educator make him a uniquely qualified leader to help MoMA navigate the changing landscape of American art and architecture,” said museum director Noah Horowitz. “This appointment marks a moment of tremendous growth as we embark on our journey to create a new museum, one that is truly a home for artists.”Ruggiero, who is also a partner at the London-based firm Wig and Wanger, is currently the executive director", "The next Biennial should be held in 2021.\n\n\nThe New Museum in New York has appointed Sanjeev Gupta as its next chief curator of modern and contemporary art. Gupta comes to the institution from the Museum of Modern Art (MoMA), where he has served as deputy director of curatorial affairs since 2014. Previously, he was the curator in residence at the Knust Family Collection in New York and has held positions at the Museum of Modern Art and the Whitney Museum of American Art.Prior to joining MoMA in 2013, Gupta worked as a curatorial assistant at the Museum of Modern Art (MoMA), where he oversaw the collection and exhibition of work by Marc Chagall, Wassily Kandinsky, and Jean-Michel Basquiat. He also worked as a consultant for a number of museums, including the Metropolitan Museum of Art in New York and the California Academy of Sciences in San Francisco.Prior to joining MoMA, Gupta was a curator at the European Museum in Berlin and a curator at the Museum of Modern Art in the British Museum. He also taught at the University of Vienna and the University of Copenhagen.Commenting on his new position, Gupta said: “I am excited to take on this new challenge to organize and present art in a", "The next Biennial should take place in 2020.  The first, which was curated and organized by designer/intellectualist/artist Simon LeVay and premiered at the London Biennial last September, will be hosted by the Greater London Authority (GLAAD) in 2021. The next edition of the Biennial will take place at Historic Royal Palaces in London from September 27 to September 29, 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA), the Museum of Modern Art (MoMA), and the SLC Center for Contemporary Art (SCCA) have announced that they will contribute $100 million to the revitalization of their downtowns. In support of the new initiatives, which were introduced in conjunction with the reopening of the Museum of Modern Art, the Los Angeles County Museum of Art is donating $50 million to the city in the form of a bailout loan; $30 million to the nonprofit Coalition for a Better LA; and $10 million to the local arts and cultural community.The LACMA loan program was created in 2018 to assist the institution with its restructuring and construction as part of an agreement with the county. The nonprofit coalition, which includes the Los Angeles County Museum of Art (LACMA),", "The next Biennial should be held in 2022, but the first show is currently on view.\n\n\nThe Netherlands is planning to build a new biennial of contemporary art in the capital of Amsterdam, as the Netherlands gears up for the 2020 Rio Olympic Games. The event will be led by the Museum of Contemporary Art Amsterdam (MCA), and will take up themes such as the meaning of art and the connections between culture and people, and will run concurrently with the 2020 edition of Art Basel.Organizers have not yet decided when the exhibition will open, but it will be hosted by the new Grote Knappe building, and will be located in an area that was previously used as a temporary exhibition venue for the exhibition. The biennial is being organized as part of a larger plan to reinvigorate the city of Amsterdam and its surrounding area, and is part of a global initiative to offer new opportunities for artistic production and dialogue.The project began in 2006 with the creation of the city’s Biennale de Amsterdam and has since been expanded to include MCA’s upcoming exhibition “The New American Dream,” which will be curated by Antony Hudak, and “Eco-Feminism: From Dada", "The next Biennial should take up the idea of “fidelity,” the essayist Simone Forti wrote in a review for Artforum in September 1973. “Our present predicament can be overcome only by the transcendence of the past. . . . The future is the body of our present, the body of humanism, with its hopes and its dreams.” In the spring of 1974, the exhibition “Spiral Baths: Reflections on the Body” opened at the Croatian Pavilion at the New York International, first to the public, and then to a select few museums. The opening was controversial at the time, but the show soon attracted more than thirty thousand visitors, and the title of the exhibition was changed to “The Future Is Now,” a reference to George Bernard Shaw’s famous famous words. The exhibition was rechristened the Venice Biennale in 2017.\n\n\nThe Metropolitan Museum of Art in New York has launched a new digital platform that will allow visitors to view and purchase artwork from the artist-run public collection, the Arts and Cultures Conservation Trust (ACCT), in an effort to raise funds for the Met’s expansion of the Center for Signpost", "The next Biennial should be held at the Library of Congress, which is currently under construction and slated to open in 2021. The show will consist of three exhibitions: “The Beginnings of Anxiety” (2019), “Mo’daba” (2019), and “The Unbearable Lightness of Being” (2019). The institution will also present temporary exhibitions of work by artists such as Lawrence Abu Hamdan and John Akomfrah. The Metropolitan Museum of Art (MoMA) has yet to announce its plans for the 2020 event.\n\n\nThe Solomon R. Guggenheim Museum (S.G.G.M.) has added two new works by contemporary artists to its collection, and has released an artist-in-residence program that will provide support for students who wish to pursue a career in the arts.The Guggenheim has also launched the new entry-level fellowships, which will provide students with support in gaining experience in Israel. Each cohort will consist of two students and will award $30,000 at the end of their two-year years. Students will also be eligible for a maximum of $60,000 in financial aid.“As a contemporary art museum, we are", "The next Biennial should be held in the vernacular of the rising sun, in the spirit of its founder and in the year of the sun. The date of the next festival will be determined by the artist, whose work will be exhibited in a “new approach to art.”\n\n\nAlexandra Warhol, the American architect and collector whose contribution to the exploration of new ideas in art, design, architecture, and design was central to the development of the avant-garde, avant-garde-inflected, and avant-garde-cultures of postwar and contemporary art, has died at age ninety-eight.Born in Brooklyn in 1938, Warhol grew up in a working-class Jewish Jewish family in Queens, New York. Following his father’s death, she took over the family business and later became an architect, adding to her own repertoire of works by joining the influential group the New Industrial Arts, including the space-age Transformer. “The storied history of the family includes a long and storied tradition of inventiveness and innovation,” wrote Christopher Knight in a 2018 Artforum feature, “from the first interactions with Warhol’s father in the early 1960", "The next Biennial should be held in 2020, and the first in 2021.The event will be held in the Museo Poderre and will feature seventy artworks by forty artists, including Anthony Bourdain, Carla Colombo, and Alex Katz, and will run from October 19 to October 21. The theme, the theme of this year’s event, “tension,” will be “Intensities,” and the artists will be asked to reflect upon their lives and the dramatic shifts they have experienced. The museum will also present a work by the Swiss artist Andrea Büttner for the museum’s exhibition “Feminine: Art and the Body in Art” (2019), which was inspired by the Swedish artist Anna Laudel’s body in art exhibition “The Body Art Show” (2019), and its inaugural exhibition “Venice,” which will consist of two exhibitions, “One Hundred Artworks in Venice” and “One Hundred Girls in Venice” (2019), that will both be organized by Andrea Büttner.Commenting on her selection, Shinn said: “I’ve been fascinated by art since I", "The next Biennial should be held at the museum in 2021. While it has been closed since March 26 for maintenance, the venue can resume its programming in the coming months.\n\n\nThe Freer Gallery in the City of Los Angeles (GCA) has released the list of twenty-six artists who will be featured in the twenty-third edition of the Museum of Contemporary Art Los Angeles (MCA LA). The first fifty artists were selected from a pool of fifteen artists nominated by the GCA, which is located at 1175 Wilshire Boulevard in the City of Los Angeles, and will receive $10,000 in grants. Among the artists chosen are Eddie Gostin, Hannah Wilke, Anna Magid, Andrea Mavica, Annie Pei, Bibi Rivera, Geneva Zaveri, Dana Rippy, John Santacruz, Wangechi Mutu, Loretta Lynn Redgrave, Sara Van Doren, Alana Walton, Kiki Wolf, Seruji Yamamoto, Wangechi Mutu, Marta Yuen, Xavier Hufkens, Linda and Alexander We", "The next Biennial should be in January 2021. \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of $12 million from the Huntington Library in partnership with the Huntington Trusts. The gift includes the Huntington Library’s collection of more than one hundred works by American artists including Annie and Edith Whistler\u0097who are credited with creating the Whistler-Giroux Museum, an art museum in the foothills of the Blue Ridge Mountains in central California\u0097and four works by German industrialists Erich and Ott-Dieter Giroux.Giroux’s gift comprises fourteen works that were previously unopened, and were to be publicly displayed in a newly refurbished building at the Museum of Contemporary Art (MoCA). The work, Headquarters (1938), was originally on display in a vault in the museum’s collection. It has been rediscovered and is being restored to its original state. The other works that have recently entered the collection are Die Freiheit der Künste (1947), a piece by the German Expressionist Hans Neumann, and a work by the Russian painter Josiah Gordon Lewis.“We are grateful to the Huntington", "The next Biennial should be held at a location that is open to the public and allow the public to assemble and to have a voice in the planning and execution of the exhibition. We believe that the best way forward for the exhibition is to continue with the current format of the exhibition, with the same great artists participating together as before, but with a new location and a new exhibition.” \n\n\nTacita Dean, creator of the punk-inflected, collage-based website Death and All His Friends, has been named the inaugural recipient of the $16,000 Robert De Niro Prize. The annual $100,000 award comes with a $125 cash prize and is presented by actor Robert De Niro.Dean will be presented with the prize at a ceremony at the Museum of Modern Art in New York on September 23. The winner will be selected by jury members from the Los Angeles-based collective sampled by a panel of artists and writers, including D. James Macari, Erica Chenoweth, Sarah Lawrence, and Christopher Woolf.Dean will receive a total of $33,000. The deadline for applications is September 19.\n\n\nThe National Museum of Art in Washington, DC, is preparing to welcome visitors back to", "The next Biennial should take place at the Central Library in Dublin, from February 22 to February 24, 2020, and should involve the work of approximately eighty artists. The theme of the show should be “Anatomy of an Image,” a collection of paintings that examines the relationship between perception and the body. The Royal Institute of British Architects will represent London and will have the opportunity to present a new exhibition. “The show is a great tribute to the work of all those who have contributed to the greater good of the city and the wider world,” said Emma Allingham, chair of the Royal Institute of British Architects. “The Royal Institute of British Architects is pleased to announce the winners of the 2019 Artistic Achievement Awards. Each awardee will receive a cash prize of $10,000. Each awardee is also invited to present a show at the Royal Institute of British Architects in London in 2020.” The biennial will feature works by twenty-one artists, including Richard Avedon, Gérard Huyghe, Johan Jan de Bruijn, and Jules Bianchi. \n\n\nThe art market in London is reeling from the impact of the coron", "The next Biennial should be held in 2021. The festival, which was founded by novelist and art historian Dhanya J. Paltrimore in 1988, staged seventeen summits.  The 2019 edition featured the work of seventy-nine artists.\n\n\nThe seventy-second edition of the Tate London Arthouse was held on Tuesday, May 29, and released the final selection of the event, “Anselm Kiefer: The Expressionist” on Tuesday. In honor of the occasion, the museum also unveiled two new works by artist-in-residence Wolfgang Paalen, who will receive a special retrospective at Tate Britain in London on September 19, 2020.The retrospective will include eight works by artists working between 1960 and 1968, and will advance the museum’s longstanding commitment to contemporary art. “This is an enormous event for us,” said Tate director Maria Balshaw. “Anselm Kiefer, Wolfgang Paalen, and Ronald McDonald are among the artists whose works will be presented in the most recent edition, and we are thrilled that they will all be featured in this year’s tour. Their work will be examined and reinterpreted by the museum, the audience,", "The next Biennial should be held in 2021. “This is an unprecedented crisis,” said Maya Soltan, director of the Institute of Art History in the Department of Art History, the Museum of Modern Art, and the Museum of Modern Art. “The work of artists is at stake, and the future of the Art Deco museum is at stake. We must act now to protect the future of the museum.” The Uffizi Gallery in Rome has filed a complaint with the authorities over a denial of an exhibition of works by the Italian sculptor Cesare Prada at the institution earlier this week. The museum was forced to close permanently on February 13 after the Italian Ministry of Culture and the Ministry of Culture and the Government of Livestock and Culture in Rome issued a joint declaration declaring the decision to close the institution a violation of the country’s constitutional rights.According to the Italian daily newspaper the Corriere della Sera, the minister of culture, Dario Franceschini, told the paper that the decision was made “in the interest of the institution, the state and the government,” but that the museum had also requested that the declaration of the closure be postponed until at least", "The next Biennial should be held in 2020.\n\n\nThe Guggenheim in New York and New York’s Metropolitan Museum of Art have agreed to collaborate on the restoration of a nineteenth-century Gothic cathedral in the Bronx. The partnership, with the New York–based group Guggenheim Heritage Preservation, will launch a public campaign that will organize more than five hundred visitors to experience the cathedral, known as the Cathedral of St. John the Baptist, through performances, performances, performances, and more performances, and will feature documentaries and other works by artists including Rayyane Farsi, Yoko Ono, and Joan Miro.“The partnership marks an important step in the restoration of a vital Gothic cathedral that has survived and flourished in the city for nearly 150 years,” said Peter Guggenheim. “The restoration of the cathedral will require the collaboration of a number of professionals, but we believe the team we’re assembling can create a work of cultural and historic significance that meets the needs of both communities. We are committed to exploring all creative and technical possibilities to make the cathedral a reality for the people of New York City and beyond.” The cathedral is located on the ground floor of the old Metropolitan", "The next Biennial should be held in the autumn of 2020, and the inaugural exhibition should open to the public in the spring of 2021. The 2019 event, also co-organized by the National Museum of Modern Art and the Museum of Modern Art, was held at the same location and in the same timeframe as the 2016 event. The 2020 event will be held at the Museum of Contemporary Art Chicago, which opened to the public in September. The 2019 event was held at the same location and in the same timeframe as the 2016 event. The 2020 exhibition will focus on the legacy of urban planners, archaeologists, and urban designers. Inaugurating the museum will be an educational platform on the history of Chicago, curated by the city of Chicago, for whom the 2019 event was organized. The 2020 exhibition will be themed The Story of the City and Descartes: A Life and will be organized alongside the long-standing Taft Museum of Art (where the 2015 exhibition “Self-portrait: Aristo and Art in America” was staged) and will be held as a joint project by the City of Chicago and the National Zoo.The biannual event, titled “Generations: Integral to Chicago", "The next Biennial should focus on the question of how artists and institutions can be more involved in the management and financing of the collections that comprise the exhibition. It has previously acknowledged the importance of arts institutions in promoting the exhibition, but does not believe that the collection should be able to function without the museum. The twenty-sixth and twenty-seventh editions of the biennial will be held at the São Paulo de Mendes, Brazil’s Pireaus de Catalunya, from November 2015 to December 2019, and at the Museu de Arte de São Paulo, in the State of Pernambuco, Brazil, from January 2020 to March 2020.“It is an honor and a pleasure to collaborate with the museums and the city of Rio Grande do Sul,” said Paulo Pinheiro, chair of the International Commission for Museums. Former Brazilian president Jair Bolsonaro, who stepped down from the presidency in February 2019 to pursue a career in politics, said the exhibition will be a “treasure for Brazilians and Brazilians alone.” The Art Newspaper reports that the biennial is looking to recoup some of its $9 million in operating losses by continuing to earn sales through", "The next Biennial should be held at a location that will serve as a contemporary venue for the exhibition. The Biennial is part of a global movement of exhibitions that is calling for a greater recognition of African art and culture.” The 2019 event will consist of the exhibition “The Body in Art: Avant-Garde Art in Motion” and the exhibition “Arts, Architecture, and Life in Motion” and will open in the Museo de Arte Contemporáneo in Milan in December.\n\n\nThe New York City Department of Cultural Affairs has released the list of thirty-nine artists who will be featured in the 2020 iteration of the Museum of Modern Art (MoMA)’s “The Box” exhibition. The exhibition will showcase works by seventy artists, including a completely new group of contemporary artists each week, and will run concurrently with the Museum of Modern Art’s “Theatrical Meltdown” and “Broadway: Theatrical.” “The Box’s’ fifth edition featured works that explore the concept of theater as a necessary vehicle for social and political progress,” the exhibition said in a statement. “", "The next Biennial should take place at the Museum of Contemporary Art (MoCA) in October 2021. What is the next step? That is still in discussion. “The next step is to work with our partners to create a program of exhibitions, programs, and events that will allow us to become a beacon of cultural diversity in Los Angeles,” said Biennial Director Jodi Throckmorton. “The next step is to work with our community to create a strategy for moving forward that will meet the needs of our rapidly growing region.”The museum did not specify when or where the next exhibition would be staged, nor did it address whether the institution will continue to operate in a fashion that is in keeping with its tradition. But in a statement, the museum said: “We are not able to predict the future, but we plan to continue to honor the legacy of the original Art Deco structure with new exhibitions, public programs, and public conversations leading up to the opening of our new museum.”\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it is expanding its efforts to support emerging and mid-career artists and their work through new grants and programs that will allow organizations", "The next Biennial should be held in 2021.  The application deadline for the 2019 event was March 30, and the winner was announced on April 2. The 2019 winner, a group of artists who were selected by a public jury, is Mateo Bruguera, who has been based in Mexico City since 1987, has also received the 2019 Prize for his work The Complete Story (2014).From its inception in 1985 to 2015, the festival hosted over 1,300 artists from thirty-two countries and the United States. The biennial was inspired by the 1955–55 United States–Mexico–Canada Multilateral Agreements between President John F. Kennedy and Mexican President Vicente Fox, which established the biennial as the major exhibition of the lifetime of Luis Villar-Boas. Other winners of the 2019 Prix include Pyotr Verzier, Elke Kok, Huyghe Wu, and Dalia Barba.The digital edition of the Prix will be delivered by the South African firm MediaMonkey, which presented the show in collaboration with the Beijing-based artist-run platform i8CPC (Instagram), and will be available for free download on March 3. The exhibition,", "The next Biennial should be held in early 2021. The next Biennial will also mark the centenary of the Belgian artist Jooste, a master whose works explore subjects such as the body and memory.In a letter he wrote to the biennial’s director, Jules Wohn, the artist expressed his hope that the event would continue to draw in visitors in the future. He also said that he wanted to continue to make artworks that focus on memory and the body, but in a more limited way. The artist suggested that the next Biennial would be a “place for the exhibition of the artist’s work.”In the letter Wohn noted that the previous year’s Biennial had been held at the Kunsthalle Basel and that “this year’s theme is ‘memory and the body.’” The committee is currently working on a new theme for the tenth edition of Biennial Berlin and is expected to release an announcement about the reopening of the biennial in the coming weeks.\n\n\nMore than 1,400 artists, academics, and other cultural luminaries have signed an open letter encouraging Udo Kittel to resign from his position as director of", "The next Biennial should be held in December 2020, according to Artforum. The next edition of the exhibition will take place at the Museo de Arte Contemporáneo in Madrid. The 2020 edition will be organized as follows: Themes: Theology, History, and the Church; Events: Theology, History, and the Church; Partners: Theological, History, and the Church. At the center of the exhibition will be a selection of works by contemporary artists in which the Church is represented.The artist-run space will be housed in a converted former mill and will have an outdoor space for the public to enjoy. The center will also have a learning center, a library, a café, and a restaurant. The venue will be co-organized by the Bishop's College of the East London and the Association of Photographers in Germany. The Biennial will be hosted by the American contemporary art museum St. Louis Art Museum, and will be led by curator and artistic director Philip Montgomery. The event will also be supported by the artist-run nonprofit art space Gallery For Life. \n\n\nThe Israeli government approved the construction of more than 1,500 housing units for Jews in occupied East Jerusalem over the objections", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has announced that it is planning to remove more than four hundred works by Amedeo Modigliani, an Italian modernist and theorist whose Studio Museum in Florence created a new literary canon in the early Eighties, and will replace them with works by lesser-known artists such as César Miro, Agnes Martin, Monir Shah, and Manfred Kugel.Kugel, who was born in the small town of Todi (near Turin) in Italy, was the first to make the transition to sculpture from the museum’s permanent collection. “Modigliani’s work embodies a vision that is at the heart of the Museum’s mission,” said museum director Jerome Talbot. “Manfred Kugel’s work, while drawing from the imaginative and anachronistic, is an authentic reflection of Modigliani’s own aesthetic temperament and the most recent aesthetic.”Actual results will be announced in 2020, when the museum will stage the exhibition “Modigliani: The Unseen.” The show will feature thirty new", "The next Biennial should be held in the summer of 2022. The Cultural Ministry however has yet to set a date for the 2020 edition, which will be held in the autumn.\n\n\nThe Solomon R. Guggenheim Museum in New York is asking the city’s Department of Cultural Affairs to consider extending the boundaries of the institution, which is currently undergoing a $450 million expansion, by three more miles. The request comes amid a growing concern over the expansion of large public art institutions, including the Metropolitan Museum of Art, the Museum of Modern Art, and the Whitney Museum of American Art, and is one of several attempts made by museum directors to mitigate the environmental and financial impact of construction.The Community Art Museum (CUM) in Manhattan, which is currently expanding its footprint by 17 miles, is also asking for more land. In a letter, the institution claims that the expansion will result in a “tremendous increase in the size and scope of museum, and certainly in the impact of its exhibitions and collections.”In a letter published by the NYC Department of Cultural Affairs on September 6, it declared that the agency has received twenty-four proposals for the expansion of the Guggenheim’s footprint", "The next Biennial should be held in the spring of 2021. “The Podunk’s temporary closure was prompted by the Covid-19 pandemic,” said Jack Mathews, president of the Biennial and a professor of art history at the University of Texas.The institution will welcome visitors again in early 2021, and will begin welcoming visitors again in the spring of 2022.\n\n\nThe Progressive Arts Museum in Minneapolis has appointed Julia Hahn as its next executive director. Hahn comes to the institution from the Minneapolis Art Museum, where she has served as interim director since October 2019. She succeeds Carolyn Corcoran, who was appointed interim director in January 2020, and will assume her responsibilities in the fall.“Julia is a fierce advocate for the museum’s mission, and a leader who has been instrumental in extending the museum’s reach and strengthening its reputation,” said Steven H. Rosenthal, president of the museum. “Her tenure was marked by her ability to help the museum become a key player in the city’s creative ecosystem, as well as her ability to prioritize the museum’s long-term preservation needs and production over short-term fundraising. We are pleased to welcome her to the", "The next Biennial should aim to explore the intersections of art and science in the context of the upcoming Redshift project. In addition, the tenth edition will include an exhibition of work by all the artists who are participating. The theme of  “Art and Science” will be evolving through five phases—Recycling, Art and Design, Art and Science, and Art and Technology—and will now include a new section on Multidisciplinary Art in the museums. The following year’s edition will encounter a new “Space Between Worlds” conference, which will be held at the Centre Pompidou.Speaking at the closing ceremony, Jean-Jacques Anna, president of the National Council of the Arts, and a member of the committee that selected the artists for the exhibition, said: “This will be the exhibition that shows the ­‘organic’ connection between art and science, between art and scientists.”\n\n\nThe Office of Naval Research (ONR) in Washington, DC, has appointed Joshua J. Reilly as its next director. He has been appointed for a two-year term, starting May 1, 2020, and will assume his post on March 31, 2021.“Joshua", "The next Biennial should focus on the history of the art and culture of the Biennial. The first exhibition should focus on the architecture of the Museum, with its changing social and cultural contexts.”Inaugurating the pavilion is a new project by the artist and essayist Michelle Obama, “The Body,” an exhibition that explores the social and political effects of the body. The show will feature work by forty-four artists.\n\n\nNew York’s Metropolitan Museum of Art is planning a major renovation and expansion of the institution, which has faced numerous expansions and expansions over the course of its seventy-five-year history. The $150 million overhaul will include the construction of a new, more expansive building, dubbed the Met, and will also include the renovation of the museum’s existing campus.The plan is part of a $300 million plan to increase the museum’s footprint, expand its exhibition-viewing capabilities, and enhance the museum’s collection. The Met hopes to be completed by 2022 and is currently constructing a new three-story, 600,000-square-foot building to house its permanent collection. The museum also currently has a new building under construction, which will house its archives, but", "The next Biennial should take place in September 2020, but the venue has yet to announce additional dates.Source: (1)<|endoftext|>After Victoria Miro and Yelena V.  built their first museum in New York City in the 1920s, they were the first to build a museum in the city. On October 21, 1929, the museum opened in Chelsea. Four years later, it moved to a new space in West New York, where it stayed until the redevelopment of the area in the early 1940s.  In the 1970s, the Museum of Arts & Design was born in Chelsea and rebranded as the Chelsea Museum of Art. In 1988, the museum moved to its current location on the ground floor of the Hudson Yards development project. \n\n\nThe National Museum of Women in the Arts (MoWA) in Washington, DC, has appointed Tracy Clayton as its inaugural board president. Clayton will be responsible for overseeing the institution through its next two years of operation and is the only person who has previously held the position.“We are thrilled to appoint Tracy as our next president,” said director Carolyn Wilkins. “Tracy’s background and passion for the arts make her uniquely qualified to lead", "The next Biennial should be in 2021 and will be funded by the Tata Foundation, the Tata Group, and the State of Maharashtra. The Farmanad .’s last iteration, titled AmeriBihar, was canceled after protests from activists and local officials, and its successor, AmeriWomen, was also canceled. More recent years have seen the construction of new cultural centers in cities across India, including Mumbai, Ahmedabad, Bengaluru, and Kolkata.\n\n\nThe Royal Canadian Geographical Society (RCGS) in Ottawa announced on Thursday that it is instituting new domestic abuse-awareness guidelines designed to prevent the spread of sexually transmitted infections (STIs) and promote safe sexual practices.The recommendations, which were released in a forty-six-page document titled On Behalf of Others, include the following: 1. Avoid all sexual activities that draw victims’ attention, such as theater, film, video games, and social gatherings. 2. Examine your social media, including your favorites and your followers, and make sure they understand the safety and behaviour guidelines in the document. 3. Educate yourself about STIs and how to prevent them. 4. Learn about safe sexual practices and what to", "The next Biennial should be an opportunity for participants to explore the impact of the exhibition’s collection on local communities. The collection is also intended to serve as a model for how artworks can be used in the future.The Biennial will be held at the Museum of Modern Art, New York. The inaugural event was organized by the artist-run nonprofit the artist-run cooperative Coffee House for Art, Architecture, and Design, whose current program consists of “The Future Is Now: The Art of Getting There,” which is on view through March 16. The 2020 edition will be held at the Pershing Square in Manhattan and will draw from the works of nine artists: Adrian Piper, Roger Negret, Frank O’Hara, John Patrick Kyle, Robert Rauschenberg, and Paul Gauguin. The biennial will include a number of performances and events, including the inaugural exhibition “Return of the Biennial,” which will be followed by a lecture series titled “The Future Is Not What It Used To Be.”The 2020 theme is “Bipedalism and the Design of the Body,” which will be based on an exploration of the relationship between art and biology", "The next Biennial should be held in 2021. The institution is working with artist-run studios to create a platform that will enable organizers to showcase the work of twenty-five artists and their teams. Held at Woods Hole Oceanographic Institution, the biennial’s inaugural exhibition, “Reclaim the Battlefield: Art and the Struggle for Civil Rights” will run from March 7–March 10, 2021.“We are thrilled to partner with the Museum of Modern Art and encourage the Biennial at Woods Hole to grow and fulfill its longstanding mission to offer new perspectives and for the Solveig to continue to present compelling exhibitions and projects,” said Elizabeth Fields, director of the Museum of Modern Art. “The Biennial has been and will continue to be an important showcase for contemporary art and a powerful community gathering space for people from all over the world. We are confident that this year’s event will enable us to present the best exhibition on the Solveig’s collection and to continue to present new and original works with a view to enriching the already established collection.”\n\n\nNew York’s Metropolitan Museum of Art, which is closing its five-story, glass-enclosed museum space", "The next Biennial should take place in 2021 and will explore the lives and works of forty-five artists, including Janice Black, Janelle Atwood, and Kayode Kouno. The show will also feature work by some of the most influential contemporary artists of the twentieth century, including Frederic Remont, William S. Burroughs, and Diane Arbus.\n\n\nThe second edition of the Swiss pavilion at the upcoming edition of the Venice Biennale, curated by Italian architect Lorenzo Cipolletta, has announced its list of seventy-four artists who will participate in the exhibition, titled After Venice, which will take place on February 4 and run through March 6, 2021. The twenty-seven shortlisted artists will be presented with ten works by the artists invited to select a theme from the pavilion’s previous iteration, In Praise of the Open, and will receive $70,000 in support of their projects. This edition of the pavilion is set to include the work of artists such as Alexander Calder, Mihai Csikszentmihai, and Frank Gehry, as well as works by some of the most recent and notable names in modern art.�", "The next Biennial should take place in 2020, and the first in 2021. \n Eddie Alan Cox, a professor of art history at the University of California, Los Angeles, founded the nonprofit, nonprofit, arts organization Arts Alliance. Its mission is to support and extend the work of American artist-run collectives. It works with the artists and organizations through a program of conferences, residencies, and other events.\n\nThe Philadelphia Museum of Art (PMA) has received the commissioning of a new work by the Korean American architect Park Seo-kyung. According to Artnet, Park will create a building for the institution, which will be located on the ground floor of the Philadelphia Museum of Art (PMA), in the city of Philadelphia, Pennsylvania, that will serve as a permanent home for American art.Park will be designing a five-story, 116,000-square-foot museum in a former textile factory in Kirksville, Illinois. The building will be located in a former former CVS drugstore and will be completed in 2022. The museum will house fifty-three works by fifty-five American artists and will offer a number of exhibition spaces, including a gallery and the archives.A retrospective of the works", "The next Biennial should be held in 2021, and the first international exhibition of work by a team of fifteen artists scheduled to open in 2022, “Artist Spotlight: China’s Contemporary Artists” will be held in 2022.\n\n\nThe University of Houston has received a gift of more than 1,250 works by the eminent British artist David Hockney. The work, which was donated by the artist to the University of Houston in 2009, includes works by such luminaries as Ed Moses, Emile Hirsch, Charles Atkins, John Chamberlain, Charles Dean, and Robert Irwin. A selection of the works will be presented in the inaugural edition of the Hockney Prize, which honors the artistic achievement of British artists in the twentieth century. The Hockney Prize exhibition will open at the University of Houston in the fall of 2019.“David Hockney is a timeless artist who transcends the medium of painting and sculpture with his incredible variety of forms, “Tangerines,” 1987, a composition for which he first painted an abstract screentestopper around a large red-and-white painting of a Tangerine tree in the studio, and his first public installation, the 1981 installation “The Crucible", "The next Biennial should take place in 2020. This year’s edition will be staged in London, Los Angeles, and New York. The museum has yet to announce a date for the 2021 edition.\n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) in Philadelphia has received a gift of more than 5,000 photographs by Maurice Breuil, a French-born, New York–based artist who worked in several mediums such as film, painting, photography, and printmaking.The museum acquired Breuil’s first works in the United States at the age of twenty-one, when it acquired his first set of photographs at the age of twenty-two, the same year that Pierre-Auguste Renoir began to publish his monumental “Un Freaks of Nature” (1901). The great American landscape painter also created the first work of his Image series, a series of photographs that are still considered essential to the history of photography.“In the early 1900s, Breuil began his Image series and, in a very short period of time, established his reputation as one of the leading painters of the twentieth century,” said museum director Felicity Hammond. “After several years of thoughtful", "The next Biennial should focus on ways in which technology and the connection between artists and their environments, both within their own lifetimes and across time and space. In the coming weeks and months, the biennial will fully reflect its visionary exhibition as it unfolds. The exhibition will feature works that have not yet been exhibited in the Biennial, and will inaugurate the inaugural Biennial at the Village of Bech in the Sierra Madre.“The art I’ve done for many years is prepared by observing what you’re doing,” said curator Richard Avedon. “I’ve also tried to make art that isn’t about me. I’ve tried to give examples of the things that I’ve done that don’t follow my own ideas. I’ve tried to make art that is about the relationship between art and people.”Avedon’s art has been exhibited in the exhibition “Avenir: Art and the Environment” (2019), “The Prude Project” (2017), and “Theater of Operations: The Art of War,” (2016), among others.\n\n\nThe São Paulo Biennial,", "The next Biennial should be held in 2020. \n\n\nThe Japanese artist 平里空 (1926–1971) has died at eighty years old. The artist, whose works explore and mix the experiences of black people and white people, was the subject of a retrospective at the Museum of Modern Art Tokyo in April 2018. This spring, the Museum of Contemporary Art (MoCA) Japan presented a retrospective of his work at the institution in May.Born in London in 1926,  Before the Fall, exhibited at the Museum of Modern Art Tokyo. It also toured to New York and Berlin before it was acquired by the museum in 1949. In 1959,  After the Fall was chosen to return to Japan for a retrospective at the Museum of Contemporary Art Tokyo. The show was moved to the Museum of Japanese Art in 1974.In 1983,  After the Fall was included in the official catalogue of the Museum of Contemporary Art Tokyo. In 2001, a retrospective of  After the Fall at the Museum of Contemporary Art Tokyo was staged at the Japanese Embassy in Washington, DC. In 2002,  After the Fall was awarded an honorary doctorate by the University of Edinburgh, and its catalogue was nominated for a PEN/M", "The next Biennial should be sometime next year.”The 2019 edition will be held at the San Francisco Art Institute (SFAI), the same venue that will stage the biennial’s fifty-fifth edition, which will be staged concurrently with the institution’s annual summer public event, the Bay Viewing Party, which will be held at the museum this weekend. The 2019 iteration will also mark the museum’s thirteenth anniversary.\n\n\nThe National Gallery of Scotland announced on Thursday that Noël Carroll has been appointed as its next director. Carroll, who has served as the museum’s deputy director since 2013, will assume her new responsibilities on July 1. He succeeds Helen Richards, who departed the institution in March 2019 to head National Museums Scotland.“I’m delighted that Noël will be coming to the National Gallery of Scotland as director, and excited by the journey she has embarked on to build on the remarkable portfolio of work she has started,” said Richard Hogg, director of the National Gallery. “Her appointment reflects her success and vision for the gallery and I believe she will continue to build on the remarkable legacy of National Gallery Scotland. I’m looking forward to working", "The next Biennial should be on February 23, 2020.In the works since 1966, the exhibition has featured work by contemporary artists such as Jacques-Louis Kahn, Carlos-José Luis Borges, and Grace Hopper.\n\n\nIn a move that sharply contrasts with the European Court of Human Rights’s recent decision in the case of the Straits Times, the South China Sea archipelago in the East China Sea, the Philippines, and Taiwan, the United States on Thursday declared that it intends to block a court in the Philippines’ Palawan neighborhood of Manila from hearing a case brought by the heirs of a man who was executed in a military tribunal for allegedly smuggling illegal drugs from China. According to the New York Times, the patriarch of the claimants, who are encircled by two suits, is demanding that the case be transferred to a higher court.The Emoluments Clause, which prohibits foreign governments and corporations from benefiting from the office of the president, prohibits a president from accepting gifts or payments from foreign officials or companies. The clause has been invoked by President Donald Trump in a number of cases, including his controversial $US200 million ($104 million) donation to a new $US250 million ($163 million) building for the Mar", "The next Biennial should focus on how the experiences of artists, and the richness of artistic life, can inform social change and inspire social change.”The 2019 theme of “Memory,” which is a combination of memory and what Whitney-Hazel called “institutional memory,” will be the “essential relationship between artists and their audience.” The exhibition will include work by sixty-four artists, including Jodi Lynne, Adrienne Edwards, OJ Simpson, and John Kenner, and will run through October 29 at the Art Institute of Chicago.\n\n\nThe Whitney Museum of American Art announced today that Christo, a Romanian born and based artist, conceptual artist, and educator, has been named the winner of the $50,000 Noguchi Prize, an annual $100,000 award that recognizes a Luber’s work that is “in harmony with and rich in the art of the contemporary west.” Christo’s work, which was selected for its “Puff and Flutter” series, centers around a female voice that cries out, “I’m not enough, I’m not enough.” In an interview with the New", "The next Biennial should take place in June 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed John Lynch as its next director. Lynch is the director of the art-world Mecca the Museum of Modern Art in Manhattan. He succeeds Karen Tenenbaum, who departed the institution in June 2019 to head the Metropolitan Museum of Art in New York, and will take up the post on December 14.“John’s incredible leadership will provide a platform for an extraordinary collection of contemporary art at MoCA,” said Michael Govan, chair of the institution’s board of trustees. “He is someone who has had an extraordinary career on the art scene, and was instrumental in elevating the museum’s reputation from being one of the most phoney corners of the art world to becoming a major player in the art world’s most dynamic and exciting new arena.” Lynch’s tenure at MoCA has been closely watched since it opened in 1973, when he was twenty-seven years old. In the early years, he helped turn the institution into a major force in the city’s art world. In 1983, he was named the museum’s first director", "The next Biennial should be held at a location that has a current, and planned, capacity of at least 1,500 visitors, and will be comprised of a selection of contemporary art and contemporary design, including works by Ruth Graham, Charles George, Susan Black, Lisa Deane, and H. G. Wells, as well as modern and contemporary photography, video, and art. The presentation of the Biennial will take place at the Mall of America from January 12 to January 16, 2020.\n\n\n\n\n\n\nOn Thursday, January 4, the Supreme Court in the United States issued an emergency ruling that will allow law enforcement officials across the country to use warrantless cell phone records as evidence in criminal cases. The decision, which was made in a case brought by the American Civil Liberties Union (ACLU), overturned a lower court's ruling that had held that Americans' cell phone records were being used without a warrant.The decision means that law enforcement officials across the United States—including in cities such as Minneapolis, Michigan, and New York—will now be able to obtain a person’s phone records without a warrant if they have probable cause that they are involved in a crime. The practice was condemned by civil liberties advocates as a violation of people�", "The next Biennial should take place in 2021. The event will be hosted at the National Museum of Anthropology in Beijing, and will be organized so that it can be staged on a large scale. The theme of the conference is “Future Present.” Stages will be set up in the museums in order to host lectures, workshops, seminars, and other programming. The exhibition will be anchored by Wang Shiwen’s retrospective “Chronology: From a Young Age . . .” The exhibition will open on May 4 and run through June 8.\n\n\nAs the deaths of Keith Lamont and Isamu Noguchi and the healing properties of cannabis continue to gain in popularity, the Oakland Museum of California (OMC) has become the latest institution to remove its collection from its website and shutter its doors. The decision to remove the works from the institution resulted from an investigation into “potentially criminal behavior,” museum director Amanda Levin said in a statement. “This is an investigation that we’ve led for more than five years and one that has led us to conclude that Keith and Isamu Noguchi’s art is in poor taste.”The museum will permanently suspend", "The next Biennial should be held in 2021, and the next one in 2022. “The challenges of maintaining a vibrant, internationally recognised and legendary museum are immense, and the Bank of India’s commitment to supporting the institution has never been stronger,” said Y.V. Seshee, chairman of the Sridhar Museum, which is located in the city of Gurgaon, and the institution’s general manager.  The museum recently received a $55 million gift from the Tata Group, India’s largest private owner of the country’s art museums, which was announced in December 2017.\n\n\nThe École des Beaux-Arts (Beaux-Arts) in Paris has canceled its next edition, which was scheduled for March 26–March 29. The event, which was organized by the private museum in collaboration with the French Ministry of Culture and the National Assembly of the Republic of Finland, was to have taken place at the Beaux-Arts from March 19–March 21. This month’s edition, titled “Between the Sea and the River,” was supposed to feature work by forty artists, including Pierre-Auguste Renoir, Piero Manzoni,", "The next Biennial should be held in the spring of 2020. Artists who have worked on the exhibition’s previous iterations, which were held in the Fall of 2015 and Spring of 2017, are normally invited back for a reopening of the exhibition in March of 2020. However, the matter is currently under review by the Ministry of Culture. The Biennial of Modern Art will be hosted by the Université de Liège in Belgium and the Centre d’Art et de Liaison in Paris.The next edition of the Cannes Film Festival will be held from May to August. The Independent Film Festival in London will be held from April 28 to May 29. The 2019 edition of the Venice Film Festival will kick off at the Metropolitan Sculpture Garden in London on May 31 and run through June 27. The event will also feature an exhibition of art created by underrepresented artists, curated by a select group of curators, and curated by an international group of curators. The event will be held in conjunction with the Venice Architecture Biennale, which will take place in March of 2020. Events on the cusp of the Venice Architecture Biennale include the launch of “Intersection” this Thursday, May 27, at", "The next Biennial should focus on the history of the art and culture of the island, and on the need for sustainable development to ensure a good future for our island, the town of São Paulo, and the city of São Paulo. The next year will also include the presentation of a new exhibition of contemporary art, inspired by a children’s book by artist Ivan Serpa, entitled the toy of the artist.\n\n\nSão Paulo, Brazil, will stage the first edition of the Brazilian Pavilion, an annual triennial that examines the themes of contemporary art from Brazil. Titled “Art and Politics” (October 10–October 12), the event will take place in the capital city of São Paulo, Brazil, and will be co-organized by the Museum of Contemporary Art São Paulo (MASAP), the Museo do Povo Riba (MPU) and the Museo do Filho (MDFH).“Following the public artist’s ‘Art of Movement’ program, we wanted to present this program in a way that was most accessible to the public and would be of greatest interest to them,” Leonardo Pimentel, president of the Museum of Contemporary Art São Paulo,", "The next Biennial should be held in 2022. Artforum has contacted Paradise Rock for a comment. Artforum will update this post with their comments and will post a new listing of the festival in the coming days. This article is part of a series exploring the future of the festival. Artforum is a participant in the Amazon Cartel and employs artists and writers from around the world. Artforum is funded by natural resources and grants.\n\n\nThe Bosch & Nina Fries Foundation has named Jen Morrell, an artist, educator, and writer, as its inaugural recipient of the Philosopher Award. Morrell, a Berlin-based artist, educator, and writer, received the $50,000 award at a ceremony held at Gelsenkirchen on Saturday. “We are thrilled that Jen Morrell has been selected to be the first recipient of the Bosch & Nina Fries Foundation’s 2018Philosopher Award, which honors outstanding contributions to the field of art and is given to each of us individually,” said Matthew Bosch, the foundation’s founding director. “The award is a great honor that will allow her to", "The next Biennial should be held at the Museum of Modern Art in New York in 2021.\n\n\nThe Queer Issues Film Festival in Los Angeles has announced that it will withdraw from its scheduled third edition, which was set to take place in September, and has postponed the 2020 event to 2021. “We are deeply grateful to the organizers and the many artists who expressed their enthusiasm for the upcoming edition,” said festival director and CEO Larry Fink. “The postponement of the exhibition was not an easy decision but it is one that is the best way for the festival to continue to exist as a one-of-a-kind platform for LGBTQ filmmakers from around the world.” The festival’s award ceremony, which was to take place at the LAX Center for the Arts last week, was also canceled.The twenty-ninth edition of the Queer Thoughts Film Festival, which was canceled due to a lack of sponsors, was set to take place from the Beverly Wilshire Palladium on February 27 to the Pacific Palisades in Los Angeles. The 2019 event, which was cofounded by director Jeff Koons and his wife, Evie, drew around three hundred participants and featured work by seventy-five artists, including", "The next Biennial should take place in Florence in 2022, and in 2022 in Almaty. The 2019 event “was a triumph of artistic freedom and innovative thinking. It represented the future of modernism,” Oskar Schirn, artistic director of the Biennial, told the Art Newspaper. The Art Newspaper has reached out to the Biennial’s organizers for comment.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of more than fifty works from the artist-run museum, including thirty-six paintings, a selection of drawings, and a new book. The donation includes works by Eric-Anthony Guggenheim, the late French master whose body of work comprises more than one thousand works, including the long-awaited “Imagination From Oil: The Early Art of Max Beck and Eric-Anthony Guggenheim” (2016), a drawing by the artist-in-residence Walter de Maria, and two volumes of diaries by the late California native and educator Barbara Greene.The work and book are part of a new project launched by LACMA that aims to highlight the work of artists in the United States. The initiative, “LAC", "The next Biennial should be a celebration of the biennial, which is now on display in the Pennsylvania Academy of Fine Arts in Philadelphia, and its artists. The exhibition will feature work by forty-eight artists, including Carlos Ellich, Nari Ward, and David Goldblatt, and will run alongside the inaugural exhibition, which is currently on view.The exhibition will also include new works by award-winning artists from around the world, as well as a selection of works from legendary artist-in-residence Margot Young.“Selected from a group of thirty-four artists, including Gertrude Stein, John Graham, Irving Penn, and Pierre-Xavier Huygens, the biennial’s inaugural exhibition, ‘Phila and the Future,’ will present work by forty-five artists in the first event, which is curated by artist-in-residence Margot Young. “Nari Ward’s first solo exhibition in the United States, ‘The Venetian,” is now on view at the Art Institute of Chicago. Other works in the exhibition are Jean-Michel Basquiat’s The Washing Machine, 1947, in collaboration", "The next Biennial should focus on the contributions of the contemporary artist and, in particular, on the work of the late German-American artist Kurt Malsu. The exhibition will then move to Berlin’s Albert Speer Gallery, with an extension to the collection in the city center later this year.The biennial, which will begin in February 2019, will take place in the same location where the exhibition of Malsu’s work, “Inactive on the Scale” (2019), opened in November 2018. The show, which is currently on view at the museum, will feature the artist’s work in a twenty-year retrospective. “Kurt Malsu is one of the most critically important contemporary artists in the German-speaking world,” said Marcel Spiegler, chair of the department of the arts at the Kunsthalle Basel. “Although his art has been exhibited and reviewed by numerous international and regional institutions, his work is still in a transitional stage. We have already sketched out a set of indications for the future work of Malsu in our exhibition ‘Inactive on the Scale,’ and for the upcoming exhibition ‘Kurt Malsu: Full of", "The next Biennial should be held in 2021. For the past six years, curator Matt Lieberman has organized the biennial. In 2018, the event staged the first exhibition of work by an African American artist to date. In addition to the biennial, the museum has expanded the grounds of its New York outpost. The exhibition space has also added a public area for visitors to socialize and a rooftop garden. “One hundred percent of the proceeds from the sale of the biennial will go to the organizers of the event,” said renowned art collector Thomas D. Higgins, a partner at the law firm of Binder & Higgins who is a cofounder of the Black Arts Council.The institution confirmed that it is in discussions with the Sargent’s heirs about the future of the museum and their intent to develop a new partnership. However, the family would not elaborate on how the sale of the artist’s work might affect their plans to move the museum to a new location.“I believe the family wants to move the museum to a new location and not to lose the excellent collection and the programming,” said Michael Rosenfeld, the Sargent’s attorney. “I believe that", "The next Biennial should be held at least once every three years, with a single class at least two months long. The inaugural event, “The Phylogeny of the Group,” will be held in April 2020, and the third will take place in January 2021. The fourth and final exhibition will discuss the evolution of the genus and species; the Fifth will be on the history of art and the human species.The program will also include a biennial of photographs depicting artists’ work, a biennial of works by non-European visual artists, and a biennial of works by African and Latin American artists. The ten artists selected to represent the United States will be Whitney Biennialists Maud Lowry, Minutio Machete, Alex Merz, Rashid Johnson, and Laurie Anderson.\n\n\nThe Fine Arts Museums (FAM) in London and the city of Bradford have signed a historic deal that will see the Tracey and Stewart Casteel Foundation (TSCF), the world’s largest arts foundation, invest more than $250 million in artists’ collections and institution-building over the next decade. The multimillion-dollar donation will also see the Tscf raise funds for the restoration and conservation of", "The next Biennial should be held in the city of Tokyo in 2021. \n\n\nThe Organization for Economic Cooperation and Development (OECD) announced today that Lithuania, Latvia, and Estonia are receiving support from the sixteenth edition of the Art of the Deal, which will focus on economic issues such as research and innovation, research and media, and trade and will be held in various locations in the Estonian capitals of Vilnius, Tallinn, and Karelia. Lithuania began the negotiations for the exhibition with the United States and the European Union in July 2019 and was given a three-month window to present a proposal by January 21, 2020. In an attempt to avoid a repeat of the crisis in 2014, when the exhibition was canceled due to the impact of the coronavirus, the government decided to abandon the negotiations and instead began work on a comprehensive reopening plan. “The exhibition is an important step towards restoring trust between the countries and the international community,” said Lithuanian culture minister Katarina Pappas. “By organizing the exhibition in Lithuania, we are hoping to clear the way for the countries to return to the international theme, which is the theme of a", "The next Biennial should take place in October 2021. \n   \n\n\nThe Metropolitan Museum of Art is planning to demolish the aging, rickety, half-finished, and nearly-empty Stone Pony, the longtime home of the artist-run nonprofit Artadia, in order to make way for a $1.5 billion expansion that will transform the museum into something resembling a 21st-century version of the Met, the city-owned and operated cultural landmark located in the heart of Manhattan. The $665 million renovation is slated to open in 2022 and will focus on two main projects: a larger-scale exhibition space and a redesigned interior. The overhaul—comprising of 350,000 square feet of exhibition space, new galleries, a library, and a visitor entrance on the first floor—is part of a multimillion-dollar redevelopment plan that aims to revitalize the city and its historic core.“This is an ambitious project for the Met, but it is also a necessary one,” Steven Davis, the Met’s director of development, said in a statement. “It is an exciting time to build on the visionary legacy of the Stone Pony, and we’re committed to building on the Met’s rich", "The next Biennial should have been held in November 2018, but due to the Covid-19 pandemic, the exhibition was pushed back through March 2019. The biennial will now be held at the São Paulo Art Museum from March 23 to March 28, 2020. The list of participating artists is as follows: Elena Andrianova - Dangerous Liaisons (2017) 藤田樹材美Wang Yi - Paparalita: The New Indian Art (2017) 藤田樹材美Wang Yi - Paparalita: The New Indian Art (2018) Diana Bond’s Spiral Erosion (2018) Natalie Eckhart’s Stakeholders (2019) Natalie Eckhart’s Spiral Erosion (2018–2019) Natalie Eckhart’s Toward a Feminist History: Feminist Art, Feminist Theory, and Feminist Criticism (2018–2019) Natalie Eckhart’s Feminine Spirit: Women’s Art in the Eighteenth Century (2019) N", "The next Biennial should have a theme: “Death and Life in Art” and will be held at the Museo de Arte Contemporáneo in Madrid. The 2019 edition will be held at the Museo de Arte Contemporáneo in Madrid. The first edition of the event, titled “Arte Povera” (Artistic Povera), was held in 2005. The 2019 edition will also feature a presentation of the exhibition “The Rubbles of Venice” (The Rubble of Venice), curated by Bruno De Choiseul, and “Rendering of the Museo de Arte Contemporáneo de Madrid,” curated by Raffaella Laurenti.The 2019 edition of the GB Conference will be held at the Beyerbühler Museum in Berlin. The biennial, which will also include a virtual reality exhibition, will open on September 11. It will run until September 29. The publisher is organizing a special exhibition at the Beyerbühler Museum. The exhibition will be the first in the series, which was created by curator Wolfgang Widiger, on September 11.\n\n\nThe New York City", "The next Biennial should take place in the Central Art Museum, in the city of Foshan, in China, in 2022. Artist Tungchung will represent China in the event, which will also feature artist performances, and the first exhibition will open at the museum in March 2022. The event will be hosted by the Cultural Center, the Tseungkuk Institute of Art, and the Korean Cultural Center in Seoul.\n\n\nThe California Institute of the Arts (CalArts) in Pasadena, California, has announced that it is restructuring its long-standing $3 billion wing of the Museum of Modern Art (MoMA) in order to reduce spending and streamline its operations. The restructuring initiative aims to improve the museum’s financial health and to reduce costs for both the institution and the public.“California Institute of the Arts, Pasadena, has been a leader in transforming the central campus of the Museum of Modern Art (MoMA) into a new and diverse collection,” said museum director Elissa Bruschi. “This year’s budget presents a number of opportunities, including a new artist-in-residence at the museum, new programming initiatives, and a creative fundraising season. We are actively exploring all", "The next Biennial should take place in 2020—the current format, which was created in 1974, will be extended by a year. \n\n\nThe Danish government is launching a four-year plan to help Copenhagen’s arts sector, which has been struggling since the pandemic began. The plan was released on December 15, and consists of two parts: a long-term investment plan and a target year.The first phase, known as the Copenhagen Declaration, aims to:Provide financial support to support Danish artists and cultural organizations through 2020. The second part, known as the Copenhagen Impact, aims to: Increase the investment of Danish funds in Copenhagen’s cultural and scientific institutions. The first part of the plan will allow Danish artists to collaborate with international artists, who are currently excluded from the Copenhagen Biennale. Danish artists will also be allowed to create new works in collaboration with international artists at the Danish Cultural Center in Copenhagen. The Danish pavilion at the upcoming Venice Biennale will be filled by artist Neven Gropius.The plan will also offer incentives for Danish companies to relocate to Copenhagen, including an exemption from the city’s property tax, and will provide support for small and medium-sized Danish companies that are unable", "The next Biennial should be held in December 2020.\n\n\nThe London-based biennial Designers Arms, which began in the United States in 1988, has announced that it will no longer be held in December and will return to New York for the first time in its seventy-five-year history. The event’s seventh edition, “Designers Arms: The Next Generation,” will run from March 16 to March 21, 2021 and is organized to coincide with the opening of the Museum of Modern Art (MoMA). The exhibition will be the last of ten planned for the Museum of Modern Art, which opened in May 2019.“Over the years, designers have been at the heart of the Museum’s mission to be a laboratory of modernity for a generation of artists, as well as a bridge between contemporary life and art history,” said Sarah W. Henry, chair of the board of trustees of the Museum of Modern Art. “We are enormously proud of the work of the eighty-seven participants for this year’s event and to have commissioned the works of seventy-five outstanding artists. The exhibition is an opportunity for them to reflect upon their practice, their careers, and the ideas they have conceived over", "The next Biennial should focus on the history of the museum, the collection, and the building of the biennial exhibition, “The Great Exhibition,” which was organized in 2008 and opened in 2010. \n\n\n\n\n\nLuchita Hurtado, the Mexican director of the Los Angeles County Museum of Art (LACMA), has been appointed the winner of the 2019 National Endowment for the Arts (NEA) William G. Simon Prize.The honor is one of four that have been awarded this year and is one of the highest honors offered to a Mexico-based artist. Hurtado is the only Mexican to win the award, which is awarded annually to an artist who has demonstrated exceptional leadership and vision in the field of Mexican Photography.The NEA will be awarding the prizes in conjunction with the 2019 Mexico City Triennale. Hurtado was chosen by a jury that included Panayiotou, Gaitán, and Carmen Medrano, who were nominated by the NEA’s board of directors. The jury comprised Helen Oplinger, director of the California Institute of the Arts, Los Angeles; Bertrand Piccinini, director of the Washington, DC–based Center for Mexican Art, the New Museum, and Tod", "The next Biennial should take place in the city of São Paulo between March and April 2020. The third can be held in the city of Recife between September and October 2021. Last year the organizers said that they were working with the local governmental authorities to organize a musical setting for the event, but the event was postponed due to the Covid-19 pandemic. The fourth Biennial will take place in Trumplandia between December 10 and December 12 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is teaming up with artist-run incubators to create a new $1 million fund that will provide financial assistance to young artists and artists-in-residence. The initiative, called the Art Lab, will offer grants of up to $1 million to individuals who are facing financial hardships because of Covid-19.The Art Lab will be an extension of the Museum’s art and culture program, which has been ongoing since last March, and will launch with the premiere of “El Capitan: The Last Ransom,” a new documentary about the artist-led resistance against the extradition of Pablo Picasso, which will premiere in March. The exhibition will also highlight the work of the", "The next Biennial should be held at the Museo de Arte Contemporanea (MAS) in Madrid, next May. The seventy-sixth will take place at the Art Institute of Chicago, in Chicago, in November 2020. The seventy-ninth will be held at the J. Paul Getty Museum in Los Angeles in December 2021. Beginning May 8, the museum will temporarily close to the public. The museum’s next exhibition, “Following the Story: Making the Modern World” (March 21–March 23), will be moved to March 29–April 3.\n\n\nAs New York City heads into Phase 4 on Tuesday, April 15, 2020, the city’s Department of Cultural Affairs has issued a broad green light for major redevelopment projects at Art Institute of Chicago (CIC), which was founded in 1946 and completed in 1964.“This milestone year marks the beginning of a new chapter for Art Institute of Chicago,” city cultural advisor Andrew Cuomo said in a statement. “It is essential that we continue to support the CIC as it enters a crucial period in its history. We are confident that the next phase of the Art Institute’s renovation will further the museum", "The next Biennial should be held in 2020. \n\n\nThe British artist Glenn Ligon, whose custom-built, structural-plank sculpture, sculptures, and photographs reflect an intensely personal vision of the landscape, has died at age eighty-four.Born in London in 1936, Ligon first studied at the School of Drawing and Sculpture, London, before moving to the Bechcy Museum in Birmingham, where he began his career as a painter. He moved to New York in the 1960s and eventually found his way to the Tate. In the 1980s, Ligon moved to London as a curator, and in 1984, the same year his first solo exhibition at the Tate was staged, he began his series “Ligon Spaces.”The series, which is as varied as its subjects, from the sea to the trees, is divided into three sections: “Sea Life” (1985–1986), “Trees in Motion” (1989–1991), and “Trees on the Land” (1992–1995). In 1995, Ligon moved to the Serpentine Gallery, where he continued his practice, and exhibited his “Ligon Spaces” at the 1995 Venice Biennale. He", "The next Biennial should take place in the city in 2021, with the announcement to coincide with the start of the new academic year. The 2019 event, entitled “The End of the Image,” featured work by twenty-nine artists, including Kent Anderson, Volal Bairs, Judy Bentley, Daniel Loy,  Natalie May, René Magritte, Julia Mo, Simone McCaffrey, Ronnie Merz, Rory McEwan, Sara Zwek, and Philipa Soames.The 2019 exhibition featured work by fourteen artists whose work was presented as part of a project by the museum at various stages of its development. The Biennial was inaugurated by the exhibition “Audition: Why Art Matters” (2011), which was organized by the Kunsthalle Basel in Switzerland. The following year, “Avant-Garde and Modernism” (2011), organized by the experimental and critically oriented Basel, Berlin, and New York galleries, and the Biennial of American Photography (2013), curated by David Hunter, were staged.The artists selected for the 2019 exhibition were: Tony Curran, Kiki", "The next Biennial should take place in the spring of 2022 and will be led by the artist-run museum. The group will also present a new work by the artist-activists Art and Trigger—a collaboration between the artist and the artist’s studio; the artist and the artist’s studio will collaborate with the artist’s studio to create a new installation and a new series. The biennial will be supported with a yearlong scholarship program that will present the work of twenty-five artists and will introduce the first-ever biennial award.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, is expanding its curatorial team by four full-time staff members and bringing on two additional curators and one independent curator. The museum is also expanding its digital program and curating team by adding two additional curators, María Berrío and Steven Mullise, and is bringing on four additional writers and editors.In addition, the museum is expanding its offerings to more contemporary and avant-garde art and is preparing to launch its new online-only museum portal, MoCA. The museum will begin hosting on-site exhibitions of work by sixteen artists and will introduce an online community forum for collectors, art-", "The next Biennial should take place in the spring of 2020. The exhibition will include works by thirty-five artists from thirty-four countries. Among the artists selected from the forty-eight countries represented by the Biennial are Alex Black, made in Russia, and Nari Warda, from Mali, and will draw from the themes of 'displacement', 'relocation', and the social, political, and economic processes that have shaped our modern world.”The first editions of the Venice Biennale were held in Venice from June 15 to June 26, 2020, and were attended by approximately seventy-five artists. The second and third editions will be held in the spring of 2021.\n\n\nThe author has been awarded a CBE for Services to Art for his contributions to the study of art history, and his book A History of the Art (Hodder & Stoughton, 2019) was selected for its significant exhibition at Tate Britain in London in May. The exhibition is dedicated to the history of art and the exhibition represents the author’s contribution to the study of how art history is organized and developed.The award comes at a time when the museum is trying to re-image the Museum of Modern Art in London in an attempt to modern", "The next Biennial should be held in June 2021. “I am thrilled to see the new work of the artist,” said Miles.Hannah is the author of The Truth About Love: The Art of Love (Hirshhorn and the Metropolitan Museum of Art, New York) and the forthcoming book The Picture-Perfect Man: Painters and Performance in Modern Art (Hirshhorn, 2019). The book is based on her exhibition at the Art Institute of Chicago (2015–16), The Story of a Corpse, and her presentation of a work that uses her body to question the role of art in our lives. She has been awarded the Art Institute of Chicago’s Cesar Award for Outstanding Contributions to Art in 2021 and the Tate Diaries’ 2019.\n\n\nThe National Gallery in London is preparing to welcome visitors to the institution in two years as part of a $3.5 billion expansion, dubbed the 'syndrome,' that will bring the gallery, which is located in a former factory on the south side of London, two new spaces, a new exhibition, a new digital service, and a new exhibition. The institution will also open a new wing in an existing arts complex in", "The next Biennial should be held at the Alexander Graham Kennel in New York. The event’s organizers said that they are still finalizing the dates of the exhibition.\n\n\nThe Los Angeles County Museum of Art (LACMA) is working with the luxury goods company Gucci on a new collection of Gucci pieces, which will debut in the city next month. The exhibition, “On the Art of Fashion,” will feature work by fifty-three artists, including Ed Moses, Mark di Suvero, Johnnie M. Barlow, David O. Russell, and Hui Sun-Jin, who created works that address themes of gender, race, and fashion.“We wanted to create a collection that reflected the diversity of our communities and reflect the rich cultural and historical legacy of Los Angeles,” said David Beigel, director of the LACMA Art Museum. The exhibition is part of a larger plan to modernize the museum. The overhaul includes the construction of a new, state-of-the-art building, the creation of three new public galleries, and the introduction of a new program. The renovation also includes the construction of a new program, “Fashion in the Age of Gucci", "The next Biennial should be co-chaired by art historian and curator Marc-André Pérez, art historian and curator Clara Caland, and art historian and curator Jean-Jacques Petry and is slated to open in June 2020.\n\n\nThe National Gallery of Scotland announced today that Richard Schipper will become its next chief executive and director. He succeeds Tom Thomas, who retired at the end of last year following a decade at the helm of the institution. During his time at the helm of the National Gallery, he oversaw the expansion of the contemporary art museum, launched its new residency program, and expanded the museum’s collection.“Richard has built a distinguished career in the art world at enormous scale, and has been instrumental in steering the National Gallery towards a new high-profile position as a major international institution,” said Mark Siddall, chair of the trustees of the National Gallery. “We are delighted that he will be coming to Scotland and will be able to continue to support Richard’s vision for the National Gallery through his strategic contributions to making the museum a world-class museum, and through his impressive work over the years. We are looking forward to working with Richard and to supporting his efforts to build on his", "The next Biennial should be hosted in Geneva in December 2020, and the winner will be announced in June 2021. The inaugural exhibition, “advertisement,” was held in Hamburg in November 2019. The exhibition, which featured work by more than forty artists from twenty-nine countries, included a selection of art from the exhibition “May/June/March: The Art of Extinction.”\n\n\nA group of artists and collectors have launched a campaign to have the Royal Academy of Arts (RA) in London listed on the London Stock Exchange (London Stock Exchange). The group, which comprises Kirsten Adlington, Dragan Bengtsson, Andrew Cunningham, Andrew O’Leary, and Andrew Spitzberg, has created a petition in the form of a statement of purpose that will be submitted to RIAC in the coming weeks.“We are writing to express our deep concern and longing for the RA’s future,” reads the statement of purpose. “The RA’s present board and management have conducted themselves in a way that denies the artists and collectors who work at the institution the possibility of a future. We believe that the future of the RA depends on this statement of", "The next Biennial should focus on how the art of pain can be reconceived, displaced, and reconceived again, and on how art can be rediscovered, a process that will explore pain as well as the temporality of existence.Â\n\n\nThe William B. Jonas Foundation in Los Angeles, the John Simon Guggenheim Foundation in New York, and the Galerie Lelong and Coop in Paris announced today that they will allocate $10 million to the research and development of new painkillers and therapeutics designed to treat the chronic and debilitating pain of millions around the world.“For decades, scientists have tried to create painkillers that work by targeting the same chemicals that cause pain and are therefore safe and effective in treating pain, but they were never able to develop new drugs that were safe, effective, and nontoxic,” said foundation president and CEO Jonathan Guggenheim in a statement.The foundation has been working with a group of leading scientists to develop new painkillers and therapeutics, which will be presented to the public at a biennial at the Skirball Cultural Center in West Palm Beach, Florida, on November 28—a biennial that will select a new painkiller from an experimental group of ten to be developed by", "The next Biennial should take place in 2021 and is being organized by Kunsthalle Basel.\n\n\nDavid Winton, the British painter and sculptor whose work encompasses a series of nested stylistic and spatial relationships between light, memory and sound, has died at age eighty-one. His work has been collected by the Museum of Modern Art, the Musée Pompidou in Paris, and the Museum of Modern Art, London, and will open to the public in the United States in the fall of 2020.Born in Liverpool in 1948, Winton moved to the United Kingdom with his family when he was only four years old. After enrolling at the Royal Academy of Arts, he studied at the The School of Fine Arts, Cambridge, and the School of the Art Institute of Chicago, where he studied with John Currin—the architect behind the contemporary American modernism, Surrealism. Winton returned to his native land with a family in 1972 and enrolled in the city’s Folkestone Academy, where he studied with George O’Neill and Kiki Smith. In the late’s, he lived in Manchester and the United States, where he would continue to spend time, receiving fellowships at the Museum of Modern Art,", "The next Biennial should be held in 2021. “The emerging body of art history that is the subject of this exhibition, ” Vivian Black, artistic director of the Biennial, said. “The exhibition ‘Needle: Nude,’ was an important event in developing and articulating the exhibition as the first ever contemporary biennial in the UK.”The full list of curators is as follows:\n\nDAVID SIMMONS, ART Historian\n\n\nMary Beard, curator of modern and contemporary art at the Museum of Contemporary Art, Los Angeles (CAFA)\n\n\nEd Clark, curator of nineteenth-century art at the Museum of Contemporary Art, New York (CAFA)\n\n\nRené Gass, curator of twentieth-century art at the Museum of Contemporary Art, New York (CAFA)\n\n\nHannah Kuk, curator of twentieth-century art at the Museum of Contemporary Art, New York (CAFA)\n\n\nAndrea Kuk, curator of twentieth-century art at the Museum of Contemporary Art, New York (CAFA)\n\n\nLetha Laursen, curator of twentieth-century art at the Museum of Contemporary Art, New York (CAFA", "The next Biennial should be held in the capital city of Bangladesh in January 2021. The 2018 pavilion, hosted by the museum, featured works by twenty-four artists. During its inaugural edition, the exhibition was marred by a mechanical failure that forced the withdrawal of the exhibition. Check out our gallery’s full list of artists here.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has appointed Christian Oehler as its next executive director. He will succeed David Ferris, who retired in May following a ten-year run after a sexual harassment scandal involving a staffer.Ferris was accused of groping a woman and forcibly kissing her on the lips in a Manhattan hotel room in 2007, a New York Times article published on May 25, 2019 states. The allegations were first raised by Jodi Throckmorton, a former Met employee who alleged that Ferris made unwanted sexual comments to her in 2014. Ferris was never charged.In a statement issued on May 19, the museum said: “The board of trustees and I recognize the impact and impact that this scandal has on Art. We have taken a thoughtful and deliberate decision to move forward in a manner that protects the board of directors and the museum’", "The next Biennial should be held at the end of the last academic year, which would coincide with the end of the current school year. The venue is currently being renovated as part of the city’s plan to remove the building’s facade in order to make way for the construction of a new thirteen-acre arts center, the Biodiversity Hub.“We believe that a series of exhibitions, residencies, and other programming in conjunction with the redevelopment and reopening of the Museum of Modern Art, which is at the heart of this project, will allow the Museum of Modern Art to become a sustainable and attractive home for the enormous collection and exhibition holdings,” Alexander and Charlotte said. The funds will be distributed through a mix of grants and direct donations. As part of the museum’s master plan, incoming gifts include a new core collection dedicated to the art of industrial design and design-based practice, which will open in 2020, and the operation of a new exhibition space, the Museum of Contemporary Art, Design, and the Arts, which will launch in 2022. The project also aims to improve access to the biennial through the construction of a new public transportation hub, a museum for the collection, preservation, and display of works", "The next Biennial should be held in late 2018.\n\n\nThe Atlas Society in Norway announced today that it will extend its summer season, which was canceled due to the Covid-19 pandemic, by four weeks. The organization also revealed that it will open a new approximately 7,000-year-old island in the waters of the North Atlantic Ocean in September. The island will be named after the philosopher Niels Bohr and will feature a museum dedicated to Bohr’s theory of energy and the environment.The institution will be located on the island of Svalbard, which Bohr visited in June 2019. Bohr was invited to design the new site for the exhibition following a lecture he gave at the University of Oslo in November 2019, in addition to a lecture he gave at the University of St Andrews in October 2020, and an exhibition of his sculptures at the Aarhus Museum of Art in March 2021.The project will be funded by a gift of $12 million from the Norwegian government. The donation was made in recognition of Bohr’s contributions to society and recognition that he is a leading philosopher in the field of contemporary art.\n\n\nThe London-based arts collective the Cenotaph Foundation", "The next Biennial should be held at the Museo de Arte Contemporáneo Brasil, in the city of São Paulo; the Centre Française de Paris, in the French capital; and the Basel International, in Switzerland.  The theme of this year’s event is “Feminine, Human and Material: Contemporary Art and the Death of the Modern World” and will include works by eight artists who were either killed or horribly maimed during the conflicts in Iraq and Afghanistan. The institution said that the exhibition’s director, Cristina Alemane, was “overwhelmed” by the number of entries, but stressed that the commissioning of the exhibition was not meant to be “a statement on contemporary art,” but a statement on art history. She said: “This is a moment of great transformation: the collapse of the old order, the re-creation of a new, and the emergence of what is new and new again.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that the third edition of the Museum of Modern Art in Japan, which was scheduled for February 23–March 4, 2020,", "The next Biennial should be held in the spring of 2019. The 2019, for which the Biennial is modeled after the United Nations, will be held in the United Arab Emirates.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it will welcome visitors back from its temporary closure on January 3, 2020 through March 16, 2020. The temporary closure was imposed after it received a letter from the city of Los Angeles, which declared that the construction of the Museum would be delayed until 2020.“We are grateful to our patrons, partners, and city government officials for their understanding and support during this unprecedented and challenging time,” said museum director Manny Pacquiao. “We are also grateful to our staff and supporters, who have tirelessly organized and worked to make this possible, and to our guests, for their unwavering dedication, as we worked through the transition to our new home, which will be completed in 2022.”With the reopening of the Foster Museum of Art in San Francisco on January 25, 2018, the Museum of Contemporary Art (MoCA) opened to the public for the first time since it reconfigured itself into a complete contemporary art museum in 1989. The new museum is located in a former", "The next Biennial should be held at the Museum of Modern Art in New York, in 2021; the exhibition will be relocated from the Museum of Modern Art to the Courtyard at Rockefeller Center in 2021. The 2019 edition, “Culture and the City: From Graphic Design to Contemporary Art,” featured work by twenty-eight artists, including Jie Zhu, Liao Huang, and Liu Xiaoyuan.\n\n\nThe Metropolitan Museum of Art in New York will soon house a collection of more than five thousand photographs, prints, and drawings by Belgian artist Amélie Beno. The museum will unveil the new show, “Amélie Beno: The Arrival,” at a special exhibition of Beno’s work on November 6. The show will be curated by Philippe Starck, head of the artist’s studio in Brussels, and will present work by Beno from 1948 to the present.It will also feature drawings by legendary American artist Mark Rothko, whose work was featured in the museum’s “Monumental: Mark Rothko” (2019); photographs by American photographer Robert Irwin, whose work was featured in the museum’s “American Catalogue,” (", "The next Biennial should be announced later this month.\n\n\nThe Museum of Fine Arts (MoFA) in Boston has received a significant gift of more than four hundred works by the artist Rayyane Gholipour, who was hanged in Tehran in 1975 for allegedly seditious activities related to the 1979 revolution.Dated and signed by the artist, the collection comprises work by forty-six famous artists, including Rene Magritte, Pierre-Auguste Renoir, and Jean-Michel Basquiat. The work of the late Iranian artist and scholar Behrouz Nouri, known for his exotic and textured landscape paintings, is also included.Among the works in the collection are the works of which photographs are the most famous, and of which the photographer was the first to invent the medium. The collection was donated to the museum by artist and collector Mohammad Eshtayd, who purchased the works from a dealer in Tehran in 1981.Born in Tehran in 1963, Gholipour, who was named after the artist-in-residence, presented at least twenty works in the museum from 1979 to 1985. The artist was a prolific painter, whose paintings often bequeathed to museums and other cultural centers in the country.", "The next Biennial should be held in 2020. \n\n I would like to take this opportunity to thank the board members of the Asian art biennial Shanghai (AB) for their continued support of the exhibition and its program. While I have been asked repeatedly to step down from the board of the exhibition, this is not an offer that can be accepted without my full and unconditional support. I am sure that the board of the Asian Art Biennial Shanghai is happy that I am going ahead with the exhibition, and I will continue to work with all of its artists, galleries, and institutions. Sincerely, Steven Ting. \n\n\nArt historian and curator Walter de Maria, a cofounder of the Brooklyn-based nonprofit Visual AIDS, has died at the age of eighty-one at his home in Manhattan from cancer, the New York Times reports. De Maria, who was the founder of the Art AIDS Foundation, served as director of the inaugural exhibition at the Brooklyn Museum and a mentor to other iconoclasts such as Rachel Carson and Anne-Marie Ota.Born in New York City in 1941, de Maria was brought up in Birmingham, Alabama; attended the University of Alabama, where he studied theater; and went on to study anthropology at Columbia University", "The next Biennial should be held in 2021. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has opened an investigation into the fate of the Jin Group, a Chinese American art museum in Chinatown, which closed in 2017 and faced numerous preservation challenges.“The museum adopted a number of measures to address the deteriorating condition of its building, including the installation of temporary floor coverings and the construction of a new lobby,” DCLA director Audrey Lipman told the Art Newspaper. “While we are not able to determine the cause of the deterioration, we took action to protect the Jin Group’s collection and were proactive in promoting the museum’s collection and in working with local community leaders to make sure we had the resources and the political will to overcome the challenges posed by the pandemic.”Earlier this year, Artnews reported on the DCLA’s efforts to secure the future of the Jin Group, which was established in 1972 by Li Ting, Li Hong, and Niu Yinyi. The museum bought the building from the Lin Family in 2007 for $1.2 million and constructed a new lobby and a gallery in its former space. The gallery is currently scheduled to reopen", "The next Biennial should be on February 21st.  Once this is over, the program will reopen to the public and will continue to be presented as a work of art. The Art Newspaper reports that the museum is currently working on an exhibition entitled The Bio-Sphere. The biennial will include a selection of works that incorporate the current United States. According to the New York Times, the project, titled The Bio-Sphere, is still being organized and will include a number of works by artists of different disciplines from the United States, Europe, and East Asia. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has added three new members to its board of trustees: artist-activist and educator Eros Sims, designer Rachael Ault, and filmmaker Kenneth Delvalle.“Eros Sims serves as a great example for how a curator can shape a community through an inclusive and inclusive-mindedness; as a pioneer for the creation of a new campus for MoCA, and as a passionate advocate for sustainability and diversity;” said Wayne LaPierre, chair of the board. “I’m excited to support these thoughtful and dedicated curators with their visionary visions for how we can", "The next Biennial should be in late April or early May 2020. The full list of participating artists is as follows: The Hole Room, Alonzo Cattelan, Anselm Kiefer, Arts, Art, and Politics, Bekka Kasper, Bennimar Ferro, Bryan McCarthy, Birgitta Kjartansson, Becca Novak, Carlotta Parmegiani, Catherine Perrier, Caroline Riley, Catherine Swales, Chadwick Marden, David Wheeler, Emmanuel Pape, Elena Trusov, Evan White, Fareed Zakaria, Frederick Wolf, Hannah Musto, Ivan Tapert, Merry Dove, Monica Thomas, Matthias-Peter Zweig, Merry Wootton, Sara-Lynn Strebak, Sara-Lynn Steiner, ,Lori Taggart, Tanya Van Tilborgh, Tanya Van Tilborgh, Tanya Van Tilborgh, Tleilani Van Osta, Thaddaeus", "The next Biennial should be held in the spring of 2021. However, a decision regarding the location of the event will be taken by the city of Manchester.\n\n\nThe Tate Modern in London has suspended an exhibition featuring work by Jean-Luc Godard's nephew Jacques-Paul Godard (1902–1973), a move that has been described as a “miracle.” The show, “Le homme de l'Amiti” (The Stranger, the Lover), was set to go on view in the summer of 2021.The show was slated to reopen on August 30, but was pushed back three times, once in March and once in May. The delay was due to concerns around the coronavirus and the Government’s response to the crisis. On Saturday, March 16, the institution announced that it was revising its 2020 calendar, which will now be held up as a warning to future visitors.The news means that the show will be on view as part of a new partnership between the Tate and the London-based charity Art in the City, which will stage several exhibitions with the same theme for the next twelve months. The partnership was announced in a joint statement by the Tate and the charity. “", "The next Biennial should take place in the spring of 2021, and will be hosted by the University of the Arts London, the Tate, and the National Portrait Gallery.The projects will be curated by artist-in-residence and curator Ann-Marie McEnery, and will run concurrently with the exhibition “Point of View: The Biennial” (2019), which opened at the San Francisco Museum of Modern Art in September. The exhibition was presented by artist-in-residence Adam D. Martin and will run until March 24.\n\n\nArts workers in the United Kingdom have begun a new campaign that aims to pressure British Prime Minister Boris Johnson into reducing the size of the state. The initiative, dubbed #BeOneKind, was inspired by the country’s decision to leave the European Union in March 2019. While the government announced that it would continue to pay more than one hundred arts organizations across the country, it also announced that it would reduce the size of the state-funded sector. “While the government will continue to offer millions of pounds of support to arts and cultural organisations across the country, we must stop rewarding those that exploit the vulnerable and the unemployed, and reorganizing the economy in the way that is unfair and", "The next Biennial should be held in 2020.  The museum will be reopened in 2021. The biennial will include the first trans-Atlantic trips by a female head of state; the first visits by a woman to the museum in the country of Saudi Arabia; and the first visits by a Saudi Arabian monarch to the United Kingdom.  The biennials will be held in different ways. For the exhibition, slated to be staged on September 19 and September 20, the museum will host a special preview on September 17. The biennial will also host a retrospective of the work of the artist Kim Min-kyo, who is best known for her sculptural works, which feature men and women in various states of undress, in 2019. The biennial will also emphasize the role of art and culture in the lives of the people of Saudi Arabia.Among the highlights of the biennial are the debut of the Saudi Arabian artist Marwa Al-Qasimi’s Women’s Republic, 2016, which celebrates women’s liberation from the rigid gaze of society, and “Remembrance,” a monographic, polychromatic installation that combines three stories: one of the artist’s own personal experiences", "The next Biennial should feature a presentation of the work of Professor David M. Peña’s new series “New Ways of Seeing: Art and Popular Culture in the Twentieth Century” (2019) and “David O. Russell: The Postmodern Condition” (2019). The Biennial will also carry a show of the artist’s work, “Untitled: From the Black,” which is currently on view in the exhibition “David O. Russell: The Postmodern Condition” at the Museum of Modern Art in New York, as well as a statement by Russell himself, which is on view until November 21. The full list of participating artists is as follows:David M Peña: The Tenant’s Dilemma (2019)André Breton, The Little Red Book (2018)Andrew Breslin, The Change of Heart (2018)The Creators of Death (2018)James Blair, The Splendor of Death (2018)Ana Júlio, Sins of the Father (2018)Catherine Keith, The Plastics (2018)Robert Hernández, The Book of Life (2018)Catherine Keith, The Destructive", "The next Biennial should take place in 2021. While the dates of the first and the second iterations of the Whitney Biennial have not yet been set, Artforum has learned that the 2019 exhibition will be held at the New Museum in New York in 2020 and the 2019 exhibition at the Biennial of American Art (BAM) in San Francisco.The Biennial of American Art, which was founded in 1992 by American photographer Barbara Walker and Japanese artist Akira Suzuki, has announced that it will hold its first exhibition dedicated to American artist Thomas John Peck in 2020. The biennial will then return to New York for the second iteration, which is slated to open in 2021. The biennial will also follow the theme of the third and final exhibition of its kind at the Museum of Modern Art in the future.\n\n\n\n\n\n\n\nDavid McAllister, the British artist best known for his works that use photographic techniques to make their figures appear to have life and movement, died on April 15 at his home in Croydon. He was ninety-six years old. According to the Times, the artist was diagnosed with leprosy in 1944, at the height of the second world war. He was an avid photographer and began taking his work to London early", "The next Biennial should be held in 2021. “The future of the Biennial lies in ensuring that the programs are dynamited to reflect the most recent and dynamic of our times,” Alexander said. “I am confident that as we embark upon this next chapter, we will find that the many voices that we have in support of this legacy of fearless artistic collaboration will sustain us through this moment.”He added, “By working together across disciplines and voices, we are able to push forward the work of the great artists who have come before us and continue to produce a meaningful exhibition of contemporary art.”\n\n\nCultural historian Domenico Cattelan has urged the Italian government to establish a new $500,000 fund for working artists displaced by the coronavirus.Called the Cultural Activity Fund, the initiative will provide $150,000 to support retrenchment and restructuring in the art world’s “frontiers.” Cattelan, a professor emeritus at the University of Piedmont and former president of the Venice Biennale, said that the fund must enable institutions to “discuss and create projects to address the reorganization of the cultural sphere.", "The next Biennial should be held at the exhibition space Grindhouse, which has been closing down since March 2019, to coincide with the first exhibition of the new work by the artist, Maurice Victoria. The event will be held in October 2021.“The new project will be an extension of our existing programming, and the Biennial will take a back seat in the progression of the work,” Alejandro Salazar, director of the Biennial, said. “With the death of José Maria Álvarez Jiménez, the Biennial has been through a moment of revelation: we are now experiencing a new and fundamental moment, and we are re-emerging as a new, a post-narrative, a future-conscious, rather than a past-conscious, a future-oriented art.” The work, titled Titout, 2019, will be on view in the exhibition “The New World Order” (2019) at the exhibition space until January 2620.Rebecca Littman, director of the FIAC, said: “The Biennial’s work on transformation and on the evolution of the work will always be of great interest to us; it is just that we now", "The next Biennial should be completed by the spring 2020.\n\n\nThe Jersey Museum in Oxford, England, has appointed Laura Maltham as its new executive director. In her new role, which was created in August 2019, Maltham will be responsible for overseeing the museum’s global fundraising efforts, promoting the museum’s exhibitions, and developing programming.“Laura has been instrumental in driving the museum’s fundraising programs since 2015, and has led the museum through one of the most difficult and complex financial times in its history,” said John McKay, the institution’s board chair. “Having her on board will make the museum’s fundraising even harder without the support of the dedicated team. I am confident that she will continue to shape and develop the museum’s relationship with the local community.”Maltham joins the museum after three years at the Oxford Art Gallery (OAG), where she has been its assistant curator of modern art since March 2020. During her tenure at OAG, she organized more than seventy exhibitions, including “Spiral Pools: New Art from the 1940s” (2017), “The Art of the Movement: Movement Art in the 1930s�", "The next Biennial should take the form of an exhibition that will explore the continuing relevance and intention of the work of contemporary artists, while reflecting on the art world and contemporary life in general. The exhibition will be curated by Olafur Eliasson, chairman of the museum and the Frieze Group and a curator of contemporary art in Denmark. The exhibition will introduce two new works by the artists featured in the exhibition:  Sara Sattelan, from the exhibition “Salty,” which will open on September 21, 2019, and Daniel Barenboim, the artist portrayed in the exhibition “The Silver Linings in the Sky,” which will open on September 25, 2019. \n\n\nThe National Galleries of Scotland announced today that it is planning to create one of the largest and most ambitious new digital platforms for exhibiting and selling works in the country. The platform will be located in Edinburgh and will be coordinated by the National Galleries of Scotland (NGH), the National Poetry Library (NPL), and the National Galleries of Ireland.The new online platform will be powered by a new digital platform, the National Galleries Platform for Contemporary Art (NgcCA), which will be hosted", "The next Biennial should kick off with a vibrant installation of works by artists, including Hélène Guillemette, Ting Nguyen, and Felix da Costa, and will feature a show by the French artist Tarek Atoui.\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed David McAllister as its next executive director. He succeeds Steven Kim, who has helmed the institution since 1997, and will take up the post in January 2020.“David is a seasoned curator and scholar who has developed a deep and enduring expertise in both contemporary art and the Guggenheim’s collection,” James Cuno, head of the museum, said in a statement. “His tenure at the Guggenheim marks an important moment in its history as we embark on a new chapter and the institution becomes a major center for the study of the Guggenheim’s collection and exhibitions. We are extremely excited about his appointment and look forward to working with him.” When McAllister arrives at the museum, it will be the sixth iteration of the museum, known as the Solomon R. Guggenheim Museum, and the third run of the the museum�", "The next Biennial should take place in 2020 and the date of the exhibition should be decided by the board of trustees. The biennial’s theme will be “Technology as a System of Control.” The selection committee will convene in the months of May and September to discuss the theme and the biennial’s exhibition design.\n\n\nThe South American country of Argentina has announced that it will suspend production of the highly toxic nerve agent VX, which has been responsible for devastating epidemics such as the one that led to the death of more than 6,400 people in the country in 2017, and will begin a new production line that will process the herbicide at a reduced rate.The announcement follows months of protests in Argentina, which has the second-highest rate of deaths from the drug, behind only Chile, and has been hailed as a victory for environmentalists. “The suspension of VX is good news for all of us, as it means that the next phase of its production, its processing, will begin soon,” argued Manuela Pisani, director of the Buenos Aires-based NGO Artaparosa, which was leading the campaign against the drug. “Argentina’s primary industry—oil and", "The next Biennial should be held in 2019 and should be able to draw up to ten thousand visitors. The exhibition will be financed by a $7.5 million gift from the Koch brothers, the billionaire industrialists who are major supporters of arts and humanities. In a letter addressed to the museum, Charles and David Koch wrote: “The future of our nation and the world is at stake and we are honored to be able to play a role in ensuring that it is.”The Koch brothers also said that the Guggenheim will not receive a gift of $50 million for its collection this year, and that the $150 million that was pledged for the museum’s 2020 edition will be diverted to “upholding the values and values of the new constitution.”In response to the Koch brothers’ pledge to invest $100 million into the institution, the museum said: “We are not going to comment on individuals or institutions. We will continue to invest in art for the future of the museum. . . . The future of the Guggenheim Museum is at stake and we are taking all appropriate actions to ensure that it is protected.”The museum also said that the decision to move the exhibition was", "The next Biennial should take place in 2021–20, with a timeline of three to six years. How will the art from the exhibition be presented? Will it be displayed in the exhibition venue? The question of how to organize the exhibition is not new. In March 2019, the museum organized a tour of the exhibition space and its permanent collections. “The next Biennial should take place in 2021–20, with a timeline of three to six years. We will continue to evolve our program to meet the needs of our ever-changing world,” said Georges Stétié.\n\n\nLehmann Maupin, the London-based contemporary art museum, has appointed Kate Howarth as its new director. Howarth joins Lehmann Maupin from the Solomon R. Guggenheim Museum, where she has served as deputy director since 2016, and will begin in her new role on December 8.“I’m delighted to be joining the amazing team at Lehmann Maupin,” said Howarth. “I’m eager to learn from the talented team and to prioritize how we can work collaboratively and creatively with girls and young women in England and beyond.”According to the", "The next Biennial should be announced in the coming months.\n\n\nThe Royal Academy of Arts (RA) in London announced today that it will postpone its next edition, which was originally scheduled for June 23–June 28, because of the Covid-19 pandemic. Its next exhibition, “The Days We Were” (June 26–June 28), will now be held at the Royal Festival Hall in June 2020.This year’s show, which was curated by Paul Mpagi Sepuya, will feature contributions from Michael Hirst, Tarek Atoui, Victoria Miro, Gianluigi Battista, Diana Al-Saadi, Evan Brownlee, Sara Cwynar, Yoko Ono, Diana Al-Saadi, Mara Cohen, Lennie Bissette, Eleanor Carbery, Kate Cox, Haute Horlogerie, Laurie Darey, Benedict Cumberbatch, Hannah Digby, Tanya Delsol, Sara Fiore, Kate Goody, Liza Grant, Judy Flynn, Mihai G", "The next Biennial should be held at the Museum of Modern Art, New York, in 2021, and the Museum of Modern Art will hold it at the same venue in 2020. Most recently, the Winterthur Museum of Art in the Netherlands and the Centre Pompidou in Paris have committed to exhibiting works from the exhibition “The Future Is Now.” The Biennial is currently on view at the Museum of Modern Art in New York; the Centre Pompidou; and the Los Angeles County Museum of Art (LACMA); among other museums.  The artists selected for this year’s exhibition were:Nagashima Yoshiko (Japan), Nara Shonibare (Japan), and Tadahiro Hoshine (Japan), featuring  Chiharu Matsuda and Yohan Cohen. The jury for this year’s exhibition consisted of Masahiro Takahashi, director of the LACMA Chinese Art Museum, Los Angeles; Katsuya Nara, director of the Dangdai Museum of Art, Tokyo; and Han Wu, director of the Museum of Contemporary Art, Los Angeles.\n\n\nThe Rutgers Art Museum (RAMP) has added four", "The next Biennial should take place in 2020 and will be organized in the likeness of a traditional Garden. The exhibition will feature the work of seventy artists from sixteen nations and will run from April 7 to April 21, 2020.\n\n\nThe sad passing of French post-Enninful artist Salome Grisard leaves a sizable legacy. “Salome Grisard was more than a painter,” said Marcel Cédàs in a statement. “She was a scholar, a theorist, a lover, a friend, a teacher, a friend of art and intellectuals, a brilliant maven, an artist of beauty and a healer, an artist of life and death,” Grisard’s husband of sixty years, Pierre-Auguste Grisard. Grisard, who was born in Saint-Pierre-de-Mars in 1943, began her artmaking in the 1950s and continued painting in the ’70s. In 1988, the couple commissioned Jean-Luc Godard’s classic The Godfather—the film adaptation of Grisard’s 1971 Salome story—to be shown at the museum in Grisard’s hometown of Saint-Pétéré-de", "The next Biennial should be held at the Museo de Arte Contemporáneo Nacional de Madrid, in March 2022. The biennial exhibition will consist of forty-two works by fifty artists and will envision a future where El Museo are viewed as a universal culture, a cultural intelligence that contributes to the development of society. The initiative will also include the creation of a digital platform where visitors can share their thoughts and experiences with the artists of Museo. Mília Soltera, curator of the exhibition, said: “All of the artists are inspired by the moods of the cities they are based in, and so the show will present them each in their own way, as an encyclopedic collection of their work. We want the exhibition to be an ongoing experience, to inspire and challenge.”The inaugural event was inaugurated by the work of four new artists: Carlos Miranda, Martín Sánchez, Santiago Villar, and Manuel Varejão.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has removed the artist-designed building on its southwest facade from view in an attempt to become more accessible to pedestrians and bicyclists. The institution says that the alterations", "The next Biennial should take up the theme \"Spatial Intimacy: Conversations on the Limits of Space.\" The work will be curated by an intergenerational group of artists led by French conceptual historian Laurent Briand-Graphig, the founder of the philosophy-and-science museum the Centre Pompidou in Paris, and will be presented by Lorenzo Tittel, the curator of video art and film at the Museum of Modern Art, New York; Mihai Martini, the curator of contemporary art at the Pantheon in Rome; and José and Ana Andrés, the curators of the exhibition “Pasajé,” which will run for thirteen days.After a series of conversations with historians, scholars, and artists, the Biennial will invite ten artists to lead an online version of the exhibition, which will be curated by Guadalajara artist Álvaro Villar, in which the pieces will be presented in virtual reality. The virtual iteration of the exhibition will introduce the participants to a Polynesian culture, its themes of sacred geometry, mathematics, and the visual arts, and will be able to display the virtual creations of some of these artists within the virtual worlds created by the exhibition.In addition", "The next Biennial should take place at the Faraday Museum in London in October 2020.\n\n\nThe Museum of Fine Arts (MFA) in Portland, Maine, is working with the New York–based firm Hales & Biddle to create the next edition of the Museum of Modern Art (MoMA) Art of the Party, which will be held in 2020. The event will take place at the Maine Art Museum in Augusta.Hales & Biddle will be working with MoMA to create the next edition of the Museum of Modern Art\n\nThe Gilbert and George Gallery at the University of Arizona has appointed Matthias Bader as its next director. Bader will be responsible for overseeing the affairs of both Gilbert and George and will assume his post on February 1.“The Gilbert and George Collection has been a transformational collection for the university,” said Bader. “It has given the university and the community a new and exciting perspective on the art of the seventeenth century, and it has provided a platform for artists from across the world. We are grateful to Gilbert and George for their annual contributions to the museum and its collection, and to the many artists who have made a significant contribution to our collection over the past seventy-five years", "The next Biennial should have been December, but the organizers decided to cancel the exhibition, which was scheduled to run until January 15. Confusion has ensued as to whether the cancellation was related to the coronavirus. While the event’s organizers cited “cultural exchange” as the reason for the delay, others have accused them of protecting the coronavirus—not mentioning that the exhibition would have been a platform for the exhibition’s other creators, who were facing deportation, to the US. In the US, asylum seekers are being held at military bases and other locations until their deportation proceedings are complete, though some groups have argued that this is not the case in other countries.Certain countries, including China and Japan, have since threatened to withhold aid from the US in an attempt to induce other countries to begin resettling refugees. The White House has also stated that it would withhold funds from the US’s 2020 event—a decision that has forced US state leaders to make difficult decisions.If the US administration fails to act, tens of thousands of refugees may be detained by US Border Patrol agents at sea, while other migrants are being held in detention facilities across the US. The US has already held more than 1,400 people at sea", "The next Biennial should take place in Dubai from April 8 to April 13. The show will be hosted by the British architect Basil Fawcett and will be spearheaded by one of his contemporary designs, the Opera House, and will also feature the work of a select group of artists. Despite the exhibition offering a critical overview of modernist architecture, the event will not feature the works of any of the artists whose works have been previously featured in the exhibition. Many of these works are set to appear in the forthcoming biennial, which will be organized as a series of mini-exhibitions, composed of artists’ own materials. This will mark the first time the subjects of the series have been presented in the United Arab Emirates. The third edition of the Biennial will be held at the Abu Dhabi Museum of Arts from April 10 to April 16, 2020. \n\n\nThe Metropolitan Museum of Art (the museum) in New York has appointed Audrey White as its new chief curator. White comes to the Met from the Museum of Modern Art (MoMA), where she currently serves as head of curatorial affairs. She succeeds Kate Fowle, who retired in March after twelve years at the institution.“We’ve been looking for", "The next Biennial should be held at least twice a year, with a minimum of three exhibitions, and will be able to hold up to seventy-five visitors. The new pavilion will boast of new digital and multimedia initiatives.The company will also continue to develop and release new works in the form of the forthcoming biennial The Alternative, which will explore themes such as the future of creativity in the digital age, the environment, and the relationship between art and society. The exhibition will be organized as a series of lectures, performances, films, and videos, and will open at the New Museum in London on April 5. The artist-run event will then continue in the Arts Space at the New Museum in the fall of 2020. \n\n\nThe SculptureCenter in New York has received a $500,000 donation from artist-run museum Ai Weiwei’s foundation. The donation comes from environmentalist activist and art collector Peter Wächtler and his wife, Ann, who are frustrated by the museum’s decision to close the museum in favor of two complex expansions. The museum was supposed to house Ai’s large-scale works and continue to be open in the fall. The museum has faced the possibility of closure since 2015,", "The next Biennial should take place in the summer of 2021. The biennial will be held at the Kempeitung and will be organized as a triennial. In addition to the usual biennial exhibitions (Art, Architecture, and Design), a special edition of the biennial will be organized and presented in the studio of the artist Harald Szeemann, whose work has been assembled together with the help of a team composed of Harald Szeemann-Eckhardt, Wolfgang Könitz, and Hans Todendorfer. Hauptmann was awarded the Klemant-Bornem Prize for his achievement in 2011 for his collection of monochromatic paintings in which every single color combination is represented and will be returning the title of the award.\n\n\nThe Institute of Contemporary Arts (ICA) in London has released its annual list of the top ten galleries in the city as selected by London’s arts professionals. The list, which was compiled by the Institute’s board of directors, comprises two hundred and twenty-two galleries and is organized by geography, city, and institution, and excludes special interest organizations and non-profit galleries.“The ICA is", "The next Biennial should be in July 2021, and the last will be in March 2022.  The venue will be built in the former campus of the Metropolitan Museum of Art, the Metropolitan Opera House, and the Metropolitan Museum of Art in New York. \n\n\nThe Museum of Fine Arts, Houston (MFA Houston) is launching a new $10,000 cash grant program to support artists in the city through the Covid-19 crisis, which has affected more than 130,000 museums across the United States. The program will provide $1,000 grants to artists living in Houston and will partner with artist support groups and local arts organizations to determine the eligibility of the grantees. The grants will be distributed by the MFA Houston and will close on May 31, 2020.“Covid-19 has made clear that we live in a global epidemic,” said MFA Houston director and CEO John T. Richardson. “The local, regional, and national crisis can and will spread to other cities and states. We hope that this program will help reduce the impact of the Covid-19 crisis on our local communities, and we thank our city and county governments for their collaboration in this effort.”According to the Centers for", "The next Biennial should be held in the year 2176. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the permanent collection of Asian art in the United States. Under the direction of Dina C. Abney, the DCLA created the Asia Art Index (A.I.I.E.), a database that is curated by curators, scholars, and specialists in their respective fields. The guidelines are intended to serve as a starting point for future research, but they are not meant to be comprehensive and are not intended to be a substitute for professional advice.“The DCLA has created a new tool to help cultural organizations and individuals understand the history of art and design in America, and to provide a historical baseline for exploring contemporary art and design,” said Dina C. Abney. “The tool will help cultural organizations, architects, designers, and collectors better understand the history of art and design and will help them understand the current state of Asian art in the United States.”The guidelines are divided into three sections, “Art History,” “Architecture and Design,” and “Modern Art and Design.” The A.I", "The next Biennial should take place in 2021. The 2019 event, titled “The Future Is Present,” showcased work by a select group of international and emerging artists, including Elin Grisard, Joslyn Walker, and Mary Ellen Mark.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Karen Laursen as its next director. “Karen is an accomplished, award-winning curator whose contributions span an extraordinarily diverse and complex range of artistic practice,” said museum director Brendon Borthwick. She succeeds Ruth Hamilton, who retired in March 2019 after twelve years at the helm of the institution. Hamilton joined the museum in 2008 as director of the Albany Academy of Art; she began her tenure as director in 2016.In her new role, Laursen will work with and guide the institution as it prepares for its first reopening in more than a decade, which is now scheduled for 2021. The museum is also preparing for the opening of a new science and technology center, which will address issues of sustainability, and will reopen to the public in 2022.Commenting on her new role, Laursen said: “I’ve long admired MoCA because of its enduring", "The next Biennial should be held in January 2020 and will take place at the Al-Maʿrah Museum of Art in Al-Madina, Saudi Arabia.\n\n\nThe Office of the United States Trade Representative (USTR), which announced today that it is working with U.S. Customs and Border Protection (CBP) to make improvements to the digital and electronic travel records of travelers entering the United States from Canada, the United Kingdom, and other countries that are not party to the Paris Agreement, is also seeking more information about the impact of the deal on travelers. According to a document obtained by the New York Times, the documents outline several options that would involve the CBP expanding its digital footprint and tracking travelers, including bringing back the Check-in and Check-out screens that travelers have come to rely on, and allowing travelers to upload photos of themselves to social media sites.The document states that the “new ways for traveling will require travelers to navigate different systems,” and states that electronic travel records must be kept for an average of five years. It also states that travelers should have access to their electronic travel records within 30 days of departure and that electronic travel records must be accessible to the public for six months after departure.“The", "The next Biennial should take place in 2019, the organizers said, and that the exhibition would be dedicated to “the creative process through the path of women artists.”\n\n\nThe Museum of Modern Art (MoMA), the Arten Museum in New York, and the Metropolitan Museum of Art (the Museum), in New York, have announced that they are working toward bringing works by sixteen artists to the institution in the next few years. The artists selected for the exhibition—which will showcase work by forty-two artists—are Anna Atkins, David Locke, John Henry Moore, Elyn Zimmerman, John Newbery, David Salle, Anton Kern, Arne Glimcher, Mike Kelley, and Mark Rothko.The Metropolitan Museum of Art has yet to announce its plans for the exhibition, which will be titled “The Dance of Movement.” The Central Office said that it is still working out a series of exhibitions that will introduce the works of the following artists: Andy Warhol, David H. Koch, Andre Low, Carolyn Porcaro, Frank Gehry, and Jasper Johns.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Andrew Wiles its new associate curator of modern and contemporary art. Wiles", "The next Biennial should take place in 2020 and will be led by a new curator, Sohrab Mohebbi, who is based in Dubai and will host a retrospective of the work of the Danish artist Lars-Oliv Jonsson, who first demonstrated a “living sculpture” in the city in 2007.The venue, which has the capacity to hold 25,000 people, has faced many challenges in the past. In 2017, a bomb planted by the Islamic State group destroyed the Qatar-based institution’s temporary home and forced the closure of the area for a year. Its building, a former textile factory, was also damaged in a terrorist attack in the capital of Doha in 2016.\n\n\nThe University of Pennsylvania (UPenn) announced today that its student body has voted to establish a union with United Food and Commercial Workers (UFCW), the national union representing restaurant and retail workers in the United States. The vote came after a year of organizing by students from the school’s Culinary Arts and Design (C&AD) program, which is affiliated with the university.In a statement released by the union, which represents more than 1,800 employees, the students said: “The work of C&AD", "The next Biennial should take place in Munich in 2022 and will be supported by the Munich Foundation for the Arts (MFA), the city of Munich, and three Bavarian partners—the Munich Reise Foundation, the Munich Foundation for the Arts (BKA), and the Bavarian Heritage Foundation.\n\n\nThe Museum of Contemporary Art (MoCA), the Los Angeles institution founded by Richard and Stanley Kunst, has announced that it is working with the Los Angeles County Museum of Art to develop a new $5 million annual grant program that will provide $1 million each year for the next five years. The goal of the program is to provide direct support to cultural organizations in the greater Los Angeles area.“The Museum of Contemporary Art (MoCA) has been committed to supporting the local arts for over twenty years, and we are excited to work with the Los Angeles County Museum of Art to continue this work,” said Richard L. Spero, director and CEO of the Los Angeles County Museum of Art. “The new grant program will support a number of the museum’s most important programs and will introduce a new and more sustainable way for MoCA to support the arts in the greater Los Angeles area.”The money will be distributed", "The next Biennial should be staged in the autumn of 2020, in the words of a statement from the art organization. “We are currently discussing with the government and the government-appointed bodies regarding the optimal date, and will keep you updated with further developments.”Conceptually, the Biennial is an amalgam of the various Structural Design Biennials—Artforum’s 2011, Artforum’s 2011 and Artforum’s 2015—that were held in the late 1990s and early 2000s. The structure of the exhibition has been reconfigured to incorporate more of a “museum’s collection across its many locations,” and the collection will move around, with the aim of moving the work within the exhibition space.The first Biennial was held at Art Basel in 2001. Its successor was held at the Art Gallery London in 2010. In 2014, the show moved to the Tate, and in 2019, the Biennial was moved to the Prince Albert Hall in London. The new exhibition will run for eighty days, from September 11 to September 13, 2020.This year’s event, entitled “The Future is Present,” was organized by the London-based architecture firm W", "The next Biennial should be a celebration of the life and work of Vladimir Mendik, the father of modern Russian painting. The exhibition will include the first exhibition of his work in the country since the former director of the St. Petersburg Academy of Fine Arts Mikhail Trgubasovay, who is currently awaiting trial for a murder he did not commit, was declared a hero last year.Although the exhibition has been plagued by technical problems since it was set up in a massive state building in the center of Moscow and had to be shut down by the authorities for several months, in the exhibition’s first run it ran smoothly. Its director, Dmitriy Arkhipov, told the Art Newspaper that the show’s launch was postponed because of the Covid-19 pandemic. “Twenty-one days after we launched, I had no other appointments to show for.”The show will return in March 2020 with a second edition, “The Contemporary Life of Viktor Andreev,” and will feature the work of the artists who have been selected for the quarterfinalist list, which will be announced shortly.\n\n\nThe Metropolitan Museum of Art in New York has appointed Louis Vuitton as its new director and CEO.", "The next Biennial should be in 2021.\n\n\nThe National Museum of Fine Arts (the) in Washington, DC, has appointed Mary Ellen Schier as its next chief curator. Schier will be responsible for developing and promoting the institution’s collection of modern and contemporary art, which comprises thirty-three hundred works, and will assume her new post in January 2021.Schier’s first major public engagement with the National Geographic Society occurred in 1987, when she created a series of charts, posters, and photography prints celebrating the achievements of women artists in her first exhibition at the institution. She has since toured the museum, written books about its collections, and organized exhibitions. Schier is currently the author of Thirteen American Artists, 1960–1980, a history of American painting, and Art and the Body, a new 2014 exhibition focused on the career of Cézanne.Schier’s appointment marks a significant step in the museum’s journey to become a destination for visitors from across the country. In recent years, the National Geographic Society has established partnerships with local local, regional, and national arts organizations, including the Bentonville Museum of Art; the Georgetown Museum of Art; the Brooklyn Museum of the Arts; and the", "The next Biennial should take place at the Institut de l'Architecture et de l'Histoire in Paris (ALHO), which has moved from the former Villebon complex to the offices of the museum in a project that will also see the renovation of the building. The theme of the 2020 exhibition will be “Architecture of the Modern Life,” an idea that is becoming increasingly common in the arts sector and is often taken to reflect a middle-aged or elderly architect. The exhibition will be a mix of public and private works, including works by the French conceptualist Georges Apostène (who was known as “Elusive”), the American American urbanist Joe Infante (whose sculptures make for enchanting displays in the exhibition), and the Italian architect Adriana del Marzio (who designed the Museum of Modern Art in Rome). Nominated by a group of professional architects including Jean-Luc Moulène and Alejandro Cesarco, the next edition of the exhibition will feature works by forty-four artists with a total budget of $130 million. A total of twenty-nine works by artists whose work was selected for the 2021 edition, which is still being organized,", "The next Biennial should be held in 2021.\n\n\nThe French president has appointed Pascal-Emmanuel Macron as the next head of the French budget. Macron was chosen by far-right candidate Marine Le Pen, who was the favourite of the National Front (FN), and the center-right candidate Emmanuel Macron, who was the leader of the conservative Democratic Party, at a ceremony held at the Elysee Palace in Paris on October 22. At the same ceremony, Le Pen gave an emotional speech in which she described Macron as her husband and said that he was her \"hero.\" Macron will assume his role on November 7.According to Le Monde, Macron was asked to carry out an investigation into the finances of the controversial Art Nouveau museum, which was built in 1940, and his answer showed that he was in favor of the project. However, he said that he might have to consult with the European Commission and European parliament before committing to building the museum.“This is a historic moment,” Macron said in an interview with the French daily newspaper. “I will consult with the European Commission and with the parliament, and see if it is possible to overcome this obstacle.”\n\n\nA group of artists, including Alex Katz, Haider", "The next Biennial should be held in 2020.\n\nThe London-based nonprofit Artnet has announced that it will suspend its upcoming fall edition, which was set to run from September 22 to September 29, 2020. The 2020 event will instead be held in late October, and the 2019 edition was canceled due to Covid-19. The 2020 edition will be held in the capital of the United Kingdom, and will take place at British Museum. “For the past twelve months, we have been working closely with our Board to establish a schedule that will allow us to deliver a unique and exciting 2019 programme,” said board chair Rosanna Eggleston. “We are making great progress, but we need your help to continue to accelerate the project and achieve the ambitious themes for the exhibition. We are now at a turning point and we need your support to ensure we avoid a disruption to our artists’ programming. We are all very much looking forward to sharing with you our 2019 programme.”Since the announcement of the 2020 edition, which was originally scheduled for September 28 to October 3, the museum has faced a number of challenges, including a planned expansion and the departure of director Max Hill, who has led the institution for twenty-three", "The next Biennial should focus on “intersection of science and art,” said Danielle Oxtoby, curator and director of the exhibition. “This year’s exhibition is organized around the concepts of data, data science and data visualization, and the exhibition highlights the evolution of data visualization through the museum’s collection of more than two hundred objects and the institution’s development of new research projects. We welcome your comments on this year’s exhibition, which we hope will provide inspiration for the biennial.”The biennial will be held in the museum’s new building, the Kendall Gallery, at 1200 South Fifth Avenue in Manhattan, New York, from March 12 to March 15. The exhibition will feature more than two hundred works of art by twenty-seven artists. The full list of participating artists is as follows:Agnieszka Zdrojska (Poland)Luka Meeg (Germany)Dumitru Zdrojska (Poland)Kudrzysław Komorowski (Poland)Danielsko Sekigal (Poland)Mahmouda Saeed (United Arab Emirates)Nina Sehgal (US", "The next Biennial should be in March 2020. Among the work that will be on view in the exhibition will be two new works, “The Black Heart of Algiers” (2019) and “The Possession of a Man in Love,” (2019), as well as works by the artists who represent England in the exhibition.\n\n\nAn online petition launched by the Cannes Film Festival (CFCF) on behalf of the New York–based artists James Turrell and John Anthony, who were nominated for their works for this year’s festival, has been signed by more than 1,500 people. The petition argues that the biennial should cancel the pair’s performances at the Grand Palais in order to protect the programming that has traditionally been staged at the event.The eleven-person committee that selects the final shortlisted works for the biennial, which will be announced in May, was created in 1989 to address the possibility of the two artists being arrested for the crime of “contrary to public morality” and has since expanded to thirteen members, including two from the Cannes jury, and a further three from the judges of the Cannes Triennales, which are chosen by the directors of Cannes, Jean-", "The next Biennial should be on July 25–August 28, 2020. The exhibition will focus on the exhibition of work by artists of the contemporary South Asian sub-continent. The format of the exhibition is to be determined.The 2019 awards were presented by artist-in-residence Shrimila Bose, Artforum India Editor, and artist-in-residence Mihir K. Gupta. The winners were: Sara Bose, Shreve, LouisianaÂ\u0097Deana Galindo, New York, New York; Hannity Nusseibeh, Cara-Bec, New Delhi; and George and Elvin Best, New York.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is expanding its digital presence in both physical and digital form with a new initiative, “MoMesa,” which will host more than sixty artists in its New York branch over the course of three years. The initiative is designed to give MoMA visitors more opportunities to interact with its exhibition-driven programming, which currently comprises around twenty-four hours of work each month, with a new visual art and design exhibition, “The Future", "The next Biennial should be held in 2021.For the federal government, the theme is the question, How can we maximize the ecological and social benefits of biotechnology and assist in the transition to a regenerative biotechnology-based economy? However, the true focus of the exhibition should instead be on “the limits of human knowledge and ingenuity,” said Elizabeth Stoschek, the director of the Biennial. “These limits are the issues we face, and these limits are what we want to address.”\n\n\nAn open letter signed by more than 1,500 academics, scholars, and experts in the fields of art, architecture, designs, and design-based practices, and art history, art history, and art history and art history and art history and art history’s arts—including architecture, design, and design-based practices, and art history and art history’s arts—calls for the withdrawal of the $21 million Philip Johnson Prize—the $1 million expanded designation awarded this year for the first time—and the subsequent funding of $3 million of the $16 million awarded to the first-time recipients of the four-year award.The letter describes the", "The next Biennial should take place in 2022. The 19th edition of the exhibition, titled “Exhibitions of Contemporary Art” will be held in November 2022. The institution will be inaugurated by a new exhibition, “The Meaning of Art,” which will explore the development of concept art. In anticipation of the upcoming exhibition, the Biennial will have several programs, including an extension of the “Art of Happiness” series, which will present a selection of works that symbolize positive emotions, and its “A Night to Remember,” which will celebrate the memory of László Nemesi. \n\n\n\n\n\nMairon O’Donnell, a British artist whose practice explores the concept of time and the contemporary world through sculptural and installation works, has died at age seventy-nine.Born in London in 1939, O’Donnell studied under Sir Charles X-Ray Chambers at the University of Kent in 1945 before the outbreak of World War II. He resumed his studies at the University of the Arts in Paris in 1947, where he met his wife, the American artist Virginia Herlihy. Their first child, son Martin, was born in 1948. In 1949, the couple relocated", "The next Biennial should focus on “the camera and its impact on the human experience.” “We are committed to creating a biennial that is timely and relevant,” said Jean-Baptiste Blum, president of the biennial and the Hamburg-based photography fair. “We believe that the camera has played a fundamental role in the development of our culture, our world, and our lives, and we are determined to continue to explore and experiment with mediums in order to make our exhibitions accessible and our visitors feel included.” First up is a new exhibition, “Camera Art: A Century of Science,” which will see its inaugural exhibition at the Kunsthalle Berlin in May 2019.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Rand Spencer as its next director. Spencer will succeed Christopher Wool, who passed away in August 2019 at age eighty-one. Spencer comes to MoCA from the Metropolitan Museum of Art in New York, where she was the museum’s director of photography and UCCA/MMF for four years. During her tenure, she organized the first-ever “Light and Space” series, which showcased the works of", "The next Biennial should take place in 2021, and the first the same year, the organizers said. In a statement, the festival said: “Promoting diversity and inclusion through art is an important way of addressing the pressing issues of our time. As a result, we are organizing two biennials, the first of which will focus on issues of inclusion, and the second on issues of inclusion and diversity.”The decision to organize two biennials was made after discussions between the organisers and the Baltimore-based conceptual artist Naima J. Keith, who is also known as Naima Hassan. The artist, a former director of visual arts at the Baltimore Museum of Art, commissioned the two-year calendar in response to the 2017 unrest in the United States over the death of George Floyd, the black artist who was killed by the police in the line of his uniform on May 25.\n\n\nA group of artists and writers are calling for the Museum of Modern Art (MoMA) in New York to divest from the Black Lives Matter (BLM) movement in the wake of the 2017 unrest that erupted over the death of George Floyd, the Black artist whose life and death was disputed by the police. The artists and writers’"]