["The next Biennial should have a winner chosen by a jury comprising four individuals\u0097Igor Bochko, Nilo Palma, and Nereo Petreanu\u0097and would host from April 19 to April 21, 2020. Biennials are a respected visual arts achievement\u0097there are currently ten in the United States. The five artists chosen for this year’s edition were Eduardo Campos, Hector Castano, Andrés Caldaro, Andrés Clávizo, and Gábor Vela.The show will comprise forty-two artist-built structures, including The Black Museum of Art and the Brooklyn Museum’s Perrotin building, as well as new works by the six finalists\u0097Tacita Dean, Henrique Cedillo, Antonín Díaz, Giuseppe della Foggi, and Simone del Barrio. The finalist, Sixto Pereira, will be presented with a new painting on the National Mall and will be given a solo exhibition at the Smithsonian American Art Museum.Commenting on the finalists’ work, Igor Bochko, director of the Biennial,", "The next Biennial should take place in 2022, the publication reveals. A synopsis published on the inaugural event’s website reads: “The exhibition will bring together artists whose work is challenging recent assumptions, and will challenge us to reexamine what it means to be a cultural producer.” In the essay “Cultural production,” Dreyfuss writes: “We are in the midst of a cultural crisis. The crisis is that we have created and destroyed cultures in the name of art and in the name of capitalism. Cultural production has become a weapon in the hands of the state. It disposes of the possibility of culture as it has always been: as a way of life.”\n\n\nThe founder of the International Center for Photography (ICA) in New York has died at age seventy-eight.Born and raised in New York, Robert Rauschenberg began his career as a photographer with the Museum of Modern Art (MoMA), where he earned his master’s degree in 1964. He continued his photographic practice at the Whitney Museum of American Art and at the Metropolitan Museum of Art, where he met his wife, Mariane. Together they opened the Institute for Photography’s Kodachrome", "The next Biennial should be held at least once every four years. “The next one will have to be a masterpiece,” said museum director Christoph Reiter, who also said that the museum will consider the possibility of moving the exhibition to a new site at a later date. However, a decision on the future of the exhibition is currently being taken by the Berggruen Museum in Amsterdam, which will present the seventy-fifth edition of the exhibition March 18–March 21.It is currently unclear whether the current exhibition will be preserved at the museum, which is currently undergoing a major renovation project, or if the institution will turn it into an archive.\n\n\nThe Carnegie Museum of Art in Pittsburgh has appointed Catherine Lu as its next executive director. Lu comes to the institution from the Metropolitan Museum of Art in New York, where she has been a senior curator since 2003. Prior to joining the Met in 2008, Lu worked as a curator at the Bronx Museum of the Arts. “Catherine is a seasoned curator who has demonstrated a deep understanding of and commitment to the Met’s collection and collection programs,” said James Silvestri, the museum’s director. “Her track record bringing outstanding exhibitions to fruition", "The next Biennial should be held in 2021.\n\n\nA group of artists, designers, and musicians who were given a rare platform at the Venice Architecture Biennale this year are protesting the decision of the jury for this year’s edition to suspend all activities until the conflicts in Syria are resolved. “We deeply regret that this decision has come at the critical time,” the artists wrote in a statement on Saturday. “We hoped that the 2022 edition would be the last until the conflict in Syria is ended. Unfortunately, this decision is not in line with the 2018 edition. We demand that the jury take into account the local conditions in Syria and consider suspending all activities in the country until a political solution is found.”Rather than suspending artworks in solidarity with artists participating in protests against the Syrian government, the jury decided to move forward with the exhibition’s program, titled “You and I Am Not Aligners: Simultaneous Art in the Age of Trump,” in an attempt to expedite the process of determining the final winner of the biennial. When asked about the move on Sunday, the jury said that the theme was “appropriate and not provocative” and that it hopes the exhibition will", "The next Biennial should be announced by April.  For tickets, click here.\n\n\nThe museum will reopen to the public on Friday, May 20, at 7 PM, after a temporary closure due to the Covid-19 pandemic was lifted. The institution will begin welcoming visitors again at 8 PM on Friday, May 19, and will have a limited number of visitors allowed in at any one time.“We are all deeply grateful for the outpouring of support from the public and the Museum District community during this difficult time,” said David Miller, director and CEO of the Metropolitan Museum of Art. “We are eager to welcome our visitors back and continue to explore the remarkable museum environment. We look forward to welcoming you again next week and to opening the next day with new exciting programming.”The museum is still facing a legal challenge from the owners of the former site of its current building, which is currently being renovated by the private development firm Gensler. In a complaint filed by Gensler last month, the plaintiffs alleged that the museum’s exterior renovation, which was completed in 2017 and cost the Met $7.7 million, violated the long-standing city-backed right of way. The lawsuit", "The next Biennial should take place at the Museo de Arte Contemporáneo de Madrid (MASC), in Madrid, in November 2022.The 2020 edition, “Desert X: The Deserts of the Mind” comprised forty paintings by twenty-six artists, including Julie Ault (France), Robert Irwin (USA), Malcolm Lowry (Ireland), and Hans Ulrich Obrist (Germany), and was curated by Paula Cervetto.The 2020 edition will also feature eleven television series, including the upcoming adaptation of Jean-Luc Godard’s “La Marseillaise” (2017), and the upcoming film adaptation of “The Desert Trilogy” (2019).\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has announced that it has increased its workforce by twenty-five percent since its opening in April 2019. The news comes amid heightened activity in the art world as new exhibitions, concerts, and other events draw crowds and the museum prepares to welcome the public in 2021. The museum currently employs more than one hundred people.Among the additions to the staff are assistant curators Ann Mathers and Angela Scherer; curators in residence; and twenty-three new staff members from the museum", "The next Biennial should be held in the city in 2022. For the first time, a museum-piece will actually be constructed on the site of the former Nanjing gynaecological school, as part of a three-year, $39.5 million renovation project, which began in 2015 and is currently ongoing. The project involved the dismantling of the school, which was a hub for the nation’s leading artists in the late 1940s and early 1950s, and the construction of an exhibition hall, which will have an auditorium, a library, and a café.The Biennial will pay tribute to some of the country’s greatest contemporary artists in a series of performances that will take place over three days. The opening ceremony will be hosted by director Jie Chen and artist Margaret Mitchell, who will be presented with a bronze bust of former Nanjing gynaecological school teacher Liao Zhenyu, who was a protégé of the legendary artist Ai Weiwei. The event will also feature a performance by the late Chinese composer and teacher Hu Jie. The thirty-five-day production will culminate with a retrospective of the work of Zhang Yaxuan, the first Chinese artist to work in the West", "The next Biennial should be held in 2020 and the opening will be in 2022, said the organizers of the 2017 event. The biennial will also include a film festival and other programming.\n\n\nThe Park Avenue Museum of Art (PAMA) in Manhattan has appointed Eric Kohn as its next executive director. Kohn will take the helm of the institution, which is currently closed due to the Covid-19 pandemic, in January 2020. He succeeds Jodi Thal, who was hired as the museum’s director of education and public programs in October.“PAMA is gearing up for a renaissance as we remain focused on delivering the highest quality of experiences to our audiences,” said Kohn. “We are proud to support the project by collaborating with local, national, and international artists and organizations to restore the historic space that was once their home, in a historic building in a historic neighborhood, and are excited to welcome the public back to PAMA.”Under Kohn’s leadership, the museum experienced a period of significant growth and transformation. The renovation and expansion of the museum opened it to new audiences, increased its attendance and revenue, and brought an anticipated $15 million boost to attendance. PAMA also experienced", "The next Biennial should come in May 2021. The 2019 edition, titled Art: From the Standpoint of History, was organized by the Museum of Modern Art (MoMA) and took place at MoMA between March and May.The 2018 edition, entitled Art and the Vote, took place at the Museum of Modern Art in New York between April and May. The biennial featured works by twenty-eight artists, including Kamiar Zulkifli, Flavia Caracci, and Ali G and Kaira Haruna. The event, which celebrated the work of more than sixty artists, was organized in partnership with the Museum of Modern Art.\n\n\nA new exhibition at the Museum of Modern Art (MoMA) designed to showcase the work of thirty-eight African American artists has been postponed due to a lack of interest from collectors. The show, titled “African American Art,” was originally scheduled to open on March 23 but was pushed back a week due to the Covid-19 pandemic.Museum director Matthew Teitelbaum told Artnet that the exhibition was originally scheduled for June 10–June 15. Since it is currently slated to run from June 15 to June 20, the exhibition has been rescheduled", "The next Biennial should be held in 2021. “With the anticipated cancellation of the next edition of the Berlin Biennale, and the biennial’s very first in the new year, we have decided to postpone the event,” said Joachim Neun, the director of the Berlin Museum of Art, in a statement.  The organizers also said that the announcement of this year’s event would “have been a very good, positive step in the right direction.” The reopening of the Biennale in 2022 is currently under discussion.According to the Art Newspaper, the whole biennial was slated to go ahead as planned but was paused due to the coronavirus. The Berlin government has since said that it expects the entire event to be suspended until at least May 2020. \n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $500,000 donation from the New England Cultural Fund. The $1.4 million gift comes from the New England Cultural Fund, which is a partnership of sixteen arts organizations—including the Boston Children’s Museum, the Boston Symphony Orchestra, and the Boston Children’s Museum—and is supplemented by grants of $500,000", "The next Biennial should take place in 2021. Since the institution, which opened in 1974, has been shuttered since mid-March due to the Covid-19 pandemic, the narrative of the twentieth edition has been framed as a celebration of experimentation and creative destruction. In an open letter addressed to the institution’s director, Daniel F. Weissman, the future of the biennial was stated as “indeterminate.” “The current situation has made us reflect on the ways in which art can be, and continue to be, a source of inspiration and healing for those most in need,” Weissman wrote. “Lately, we have been thinking about how we might best use our exhibition spaces in a way that would reflect the contemporary spirit and be meaningful for viewers and students of all ages.”The letter comes amid a growing movement to reimagine the future of the museum. On March 14, the Los Angeles County Museum of Art (LACMA), a public institution in the city of Los Angeles, attempted to do just that, by transforming its campus and by building a new 263,000-square-foot version of the museum. The project has been criticized for stifling artistic creativity,", "The next Biennial should be held sometime in the 2020s and will be hosted at the museum, which is currently undergoing a $1.4 billion expansion overseen by the city of Minneapolis. The museum will also welcome visitors to campus in 2021.\n\n\nThe Saudi Arabian Ministry of Tourism has established a new category of cultural attraction for women in the Kingdom of Saudi Arabia. The new zone was established to counter the restrictions faced by many Saudi Arabian women following the country’s 2014 coronavirus pandemic. The Ministry of Tourism and the National Association of Arts issued the guidelines on curating and staging women’s events in an effort to encourage their participation in society and avoid the “prisoner” narrative that can characterize Saudi Arabian women, according to Artnet. The guidelines, which were published by the National Association of Arts (NAS), the National Council of the Arts, and the National Union of Journalists on Monday, March 20, outline the ways in which Saudi Arabian women can express their femininity and social agency through the arts. The guidelines state that “treating women as equals in every way possible,” such as by encouraging them to work together, collaborate, and stay home, is a “good way to show that women", "The next Biennial should be in 2020. Beneath the pen is a table of contents that will address the themes of the current exhibition, the art of the Contemporary, and the future of art. The biennial will culminate in a special exhibition, “The Ecology of the Body,” and will be organized as a “living organism” that responds to changing environmental conditions.The main theme of the exhibition is the biennial’s physical environment.“Each Biennial is an expression of the evolution of the art of the Contemporary. One Biennial is a reflection of the human condition, while another reflects the life of the contemporary,” said Joel Goldstein, artistic director of the Contemporary. “This is a chance to see the work of innovative and thought-provoking artists in action, to experience the affective and physical space that is their studios.”The next iteration of the Biennial will take place at the Geffen Museum in Los Angeles in 2022.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of seventy-five works by twenty-one artists who were scheduled to be presented at the museum this June, but were not chosen for the event. The", "The next Biennial should be held in 2020. “The art of living and the art of death, the art of light and the art of darkness, the art of the body and the art of the soul,” Robert Irwin, chair of the board of trustees of the museum, said. “We are so pleased that the theme of the 2020, ‘Making Light of Death’ will continue to inspire and build upon the power of art to change the world for the better.”\n\n\nStudio Ghibli and the DiC theme park in Tokyo are expanding their collaboration in the form of a new project that will be organized as a collaboration between the two institutions and will be inaugurated on January 20. The series “The Light of Life,” will focus on the theme of the twentieth century and will comprise of about fifty works, each about fifty feet long, arranged in a series of four rooms. Each exhibition will be inaugurated by a new work by a different artist and will run for thirty days. The theme park will also present a new work every two years in 2019 and 2020.“The Light of Life’ will open with the work “The Trial of a Poem,” by", "The next Biennial should be held in 2021. The panel would consist of: Jean Steegmann, director, fMART. AIM: Transatlantic Art, with a special focus on Architecture and Design; Gina Wojcicki, director, MOS Architects; José Antonio Pérez-Mejia, director, Agustín Panza, and his wife, Francesco Simone; Romero and Sánchez Pascual, who together own the copyright to the Juana de la Barra, a massive, multi-million-dollar wood-paneled sculpture by Ed Moses; and Ed Levine, a curator, novelist, and filmmaker.\n\n\nThe Gilmore Girls (2000–2015) creator, executive producer, and star of the show, Charlie Day, has died at age seventy-eight at his home in Los Angeles. A leading advocate of free expression and the creative process, Day controversially attacked the cultural establishment and its conventions in favor of a more personal, community-based approach to artmaking. He was influenced by the radical and insurgent spirit of the 1980s American counterculture, which he likened to a children's party at a hippie commune. “Charlie", "The next Biennial should take place in 2020. The next Art Basel should take place in 2022. Perhaps most importantly, the next Doha Triennale will take place in 2022, as envisaged by the organisers.”\n\n\nThe Metropolitan Museum of Art has appointed Nora B. Taylor as its next director, effective immediately. Taylor, who has served as the museum’s founding curator since 1976, will assume her post on August 1 and will oversee the museum’s two-year celebration of the 150th anniversary of its founding.“The Met has been and continues to be a vibrant and inclusive destination for more than four hundred years. Its thrilling history of international collaboration, powered by a deep and enduring sense of civic responsibility, has made it uniquely positioned to contribute to the healing and promotion of contemporary art of the Americas, Europe, and Asia,” said Whitney Biennial director Scott B. Greenberg. “Nora’s mastery of the art of the Americas, Europe, and Asia is matched only by her ability and courage in transforming Met collections and programs in the next decade, consolidating our collection of modern and contemporary art from the Americas, Europe, and Asia into a single collection that reflects and embodies the Met’", "The next Biennial should be held in 2022. “We have an obligation to our audiences, we have an obligation to our artists, and we have an obligation to our country,” said de Bruijn. “We have to do all this in a way that is inclusive, that is visionary.”\n\n\nIn an attempt to calm the financial crisis and protect the jobs of blue-collar workers, the New York City Department of Financial and Financial Regulation (DFCR) is preparing to lay off or reduce the hours of nearly one hundred retail, restaurant, and hotel security personnel at five of the city’s largest corporations. The men and women who work at these companies—including Wall Street titans JPMorgan Chase, Bank of America, Wells Fargo, and Citigroup—face possible layoffs if the city does not reduce the number of its public sector employees by 25 percent by April 29.“This is not a crisis at the grocery store, it’s a crisis at the pizza place, it’s a crisis at the clothing store, it’s a crisis at the auto parts store,” said DFCR commissioner Timothy Conroy. The staffs affected by the restructuring plan are part of the city", "The next Biennial should take place in 2019, and will consist of twelve exhibitions of works currently on view or scheduled to be on view in the United States until at least 2021. “The exhibition will explore the relationship between the sculptor and the museum and the ‘American population,’ and will focus on the contributions of women artists and on a museum’s relationship with the artist community,” said Justin Wolf, artistic director of the Museum. “We are thrilled to select a visionary partner to create an exhibition that will deepen our understanding of the relationship between the artist and museum and to create a space for the exchange of ideas and experiences.”About the artist here in New York:\n\nAdvertisement\n\nOne of the most exciting developments in the art world in recent years has been the rise of new platforms and platforms for curatorial projects, especially in the digital realm. Nowhere has this trend been more pronounced than in the arts, where artists are increasingly experimenting with digital platforms to create immersive works that are available to the public and not just selected for their commercial value. IAFESA, a New York–based nonprofit that provides support to curators and artists working in the arts, is pleased to present the twenty-fifth edition", "The next Biennial should be held in 2024 and will focus on the life and work of artist-in-progress Hélène Agnes, who is remembered in the United States as one of the first artists to be given the opportunity to develop into a fully fledged museum and whose work remains in the collections of the Metropolitan Museum of Art, the Whitney Museum of American Art, the Los Angeles County Museum of Art, the Metropolitan Opera House, the Pasadena Museum of Art, the Colorado Center for the Arts, the New York Public Library, and the Los Angeles County Museum of Art. The 2019 edition of the event, which featured work by twenty-seven artists, attracted a record audience of eleven thousand people and included performances by Barry Levinson, Ed Moses, Kerstin Olsen, Chris Rock, Paul Mpagi Sepuya, Claude Monet, and Jean-Michel Basquiat.\n\n\nThe Museum of Contemporary Art (MoCA) is launching a new $50,000 fund for artists and creatives whose work has been previously published in Artforum or reviewed in Artforum/Artforum/Artnews. The fund will provide funding for artists to create an abstract performance piece that will be presented at the institution’s March 2019 edition", "The next Biennial should focus on “Massimo Dutti” (1937–2011), a painting by the Italian artist Rinaldo Latini that combines a period of Italian civil war with an attempt to depict the conflict between heaven and earth, the civil war between Mussolini and Hitler. The exhibition should also consider how artworks such as Natalia Langto’s “Feminine Fence,” 1971, which unravels the myth of technological progress and the necessity of women’s participation in the workforce, and the “Outdoors,” 1938, a series of shots by Ludwig Mies van den Brink, which depict a landscape which is both aesthetically and politically implacable, will be presented.The 2019 edition of the Venice Biennale will take place at the Palazzo delle Papesse, in Venice, from September 26 to September 29. The exhibition will showcase work by forty-four artists and will consist of seventy-four individual works. The 2019 edition will feature work by an additional eighty-one artists from thirty-six countries and will be held as part of the 2017 edition of the Venice Biennale.\n\n\nAfter the coronavirus was first identified in a", "The next Biennial should focus on the art of the process, and be inspired by the new collaborative platforms and virtual exhibitions being employed to facilitate dialogue between art and science.”The first exhibition of the new partnership is “A World of One Mind” at the Biennial. The exhibition will present a collection of contemporary art and science works that examine how the interconnections of the physical and intellectual worlds are being modified by the spread of information technology. The project will be hosted at the DTI Museum in New Delhi, with the collaboration of curator and curator of modern and contemporary art Jitendra Singh and the artist and inventor Shilpa Tagore. Other works that were selected include “Clusterfuck: New Technologies of Control” (2018), a collaboration between artist and scientist Harjant Gill and physicist Nanjan B. Sharma and the film The Martian (2016), a virtual reality experience created by artist and inventor Maya Lin, and “La Cadée en ligne: Les femmes nécessaires” (2018), a performance installation made by artist, animator, and writer Hélène Malle, in collaboration with sculptor Pierre-Auguste Renoir. The entries in the exhibition will be curated by", "The next Biennial should take place by the spring of 2020.The museum will also examine the impact of the slave trade on the African diaspora. Monarto will highlight how the museum’s collection is made up of works from the New World in addition to those from Africa. The institution will also host a number of workshops and studios to engage with the public about the museum’s collection.  \n\n\nThe Art Newspaper reports that the J. Paul Getty Museum in Los Angeles, which recently unveiled a major revamp of its campus, is now seeking the $10 million restoration of a sculpture by Italian architect and urban designer Daniel Bongino, which was added to the museum’s collection in 1957. The work, an inverted pyramid, commemorates the anniversaries of the two most recent milestones—December 25, 1957, and December 22, 1959—and is one of the largest works by the Italian architect to date. The building’s modernization, designed by renowned architect Renzo Piano, involves the addition of 19 new galleries, offices, and classrooms, as well as an expanded learning center, a reconfigured parking lot, and reconfigured public spaces.Since the sculpture, titled A Monument of Silence, was commissioned in 1957,", "The next Biennial should take place at the Museum of Modern Art in New York in 2021.  For now, the Frankfurt Biennial has been canceled, and the biennial will remain suspended until the institution can reassess its security situation. The museum is currently scheduled to reopen in late March.\n\n\nThe National Galleries of Scotland announced on Tuesday that it plans to welcome visitors again in March. The announcement comes four days after the National Art Gallery of Scotland (NGA) in London suspended all public engagements in March and re-opened only in stages in April. The NGA told The Guardian that it expects the reopening to be April 21 – the reopening date for the second edition of the Edinburgh Festival Fringe, which was last held in February.In an announcement that was surprised both the NGA and Edinburgh Festival Fringe organisers to make, the National Art Gallery said: “We are committed to making a positive start for the new year by reopening early, developing a robust new programme, and reopening safely and normally in June. We will keep you up to date with the progress of this and any other reopening plans as we work through the consequences of this major reopening shutdown.", "The next Biennial should be held at least once a year, and should take place in a location that contains a large community and academic institution, including a university. The theme should address the future of the city’s identity through research, exhibitions, and performances. “The art of the future is not a future that is built upon the past, but a future that is built upon the future,” Matthew Gould, the chair of the board of trustees, said in a statement. “The next Biennial will explore the ways in which contemporary art communities, including the arts, are redefining the future. The new format will be flexible enough to allow for the art of tomorrow—and, with it, the art of the past.”The inaugural exhibition, “Future in Ruins: Art in the City,” will feature some twenty works by fifty artists (who hail from twenty-three states) and will run from April 29 to June 5. The full list of participating artists is as follows:Laurie Bech, The City of New York (Louisiana)Lee Denham, New York (New York)Becky DeWitt, The City of New York (New York)Malcolm", "The next Biennial should be held in late 2019. The 2018 edition featured work by thirty-eight artists. The 2019 edition features work by forty-six artists and twenty-eight collectors. Awards will be announced soon.\n\n\nThe Center for Contemporary Art (CCA) in Southern California has received a gift of seventy-one works by ninety-seven artists, plus an exclusive collection of work by fifty-five lesser-known works by seventy-three other artists. The gift includes works by artists from twenty-six countries, including Egypt, Japan, Indonesia, India, Mongolia, Pakistan, and Switzerland.The acquisitions, made by Hannes Heidegger, the former director of the Künstlerhaus in Berlin, are part of a multi-year project, spearheaded by the Künstlerhaus, to bring more than forty thousand works to the United States. The works that will be on display at the Museum of Modern Art in Los Angeles are part of a project organized by the Künstlerhaus and the China Art Museum (CAM) Beijing to present eighteen works by forty Chinese artists.Hartl and Kai Heidegger were born in 1970 in Swise and Hartl resides in China. She moved to", "The next Biennial should be held in January 2021.\n\n\nThe British artist, who documented his relationship with the Nazi regime through his work, the series “Death in Venice” (Death in Venice-II) in 1971, has died at age eighty-eight from cancer. Known for crafting works that explore the meaning of the Holocaust and the Holocaust’s legacy, König Küng‐Wenker was also a prolific traveler, writing about his experiences in diaries that were published in the 1980s in the New York Times and the Los Angeles Times.“König Küng‐Wenker: The Holocaust and the Holocaust’s Legacy” (2015) was published by the Hirshhorn Museum of Art in Washington, DC, and was based on “Death in Venice” (1972). Küng‐Wenker was also a founding member of the Italian collective Della Vergina and produced dozens of works spanning the decades. He was a lecturer in art history at the City College in London and taught at the University of Vienna.König Küng‐Wenker’s work has been included in the following biennial exhibitions:The Vienna Biennial (2015", "The next Biennial should be held in the spring of 2020. Biennials have been held in Beijing and New York and have been banned in cities where they have already had a presence.\n\n\nThe Museum of Modern Art (MoMA) in New York has agreed to donate $5.5 million to combat the coronavirus, which has infected more than 28,000 people in the United States. The donation includes $5 million for the fight against the virus, and $600,000 for community engagement. The institution will use the funds to help pay for the construction of the new $500 million MoMA–New York City Museum of Art, which will open in the summer of 2022.The announcement marks the first time the museum has pledged to take action to combat the coronavirus, which was first identified in December 2015. Since then, the institution has opened two new research centers for the study of the virus and has collaborated with the Centers for Disease Control and Prevention (CDC) to develop a public health strategy to prevent the virus and its complications.“We are deeply concerned about the rapid spread of the coronavirus in the United States and around the world,” said Jonah Schein, director of the CDC. “", "The next Biennial should be held in 2022. The organizers are still working out a date for the exhibition, which will be organized as part of the biennial’s first phase. The show will feature twenty works by thirty-five artists, including Albert Oehlen (Paris), Anthony Teitelbaum (New York), and Catherine Ori, (New York), among others. The biennial will also include a virtual exhibition of the works represented in the show and a mobile application.Yale Union, the Northwest Center for Art, has announced that it is expanding its footprint in the Portland, Maine, area. The arts and culture destination will now be based in the city’s old John Deere plant in the downtown area. The move comes as it continues to invest in downtown Portland, renovating the historic city council apartment complex on North Broadway, and expanding its current venue, the Northwest Center, which houses more than 1,200 works by artists, collectors, and organizers.Yale Union’s original space in the new space is currently occupied by the Portland Art Museum. The institution will now be known as the Northwest Center for Art, Design, and Designing, and will host the first-ever Northwest Biennial in 2020. �", "The next Biennial should be held in the spring of 2022. “I’m hopeful that we can continue to present contemporary and unique exhibitions and collections in the coming years, as we continue to grow the programme,” said Hans de Neute, chair of the museum’s board of directors.The institution has already announced its 2019 lineup, which includes works by artists such as Anthony Hamilton and Warren Kanders. The museum plans to introduce new art and new programming in the coming months. The biennial will kick off in July with a presentation of work by artists such as Alexander Calder, Angela Pape, and Hélio Oiticica.\n\n\nThe Institute of Contemporary Arts (ICA) in London has commissioned artist-run organization, the London Group, to stage a triennial of artworks in the capital in 2021 and 2022. The event, “London 3/2: Art from the 1980s” (2019), will be held at the Institute’s new home on the Square Mile in September 2020. The event will culminate with a group show in April 2021.The show will feature work by eighty artists, including Laura Owens, Michael Ramsden, Simon Rogers, Paul Chambers, Terence Cody, and Hia", "The next Biennial should be held in the autumn. We are currently preparing for the 2020 edition, which will be held in March.\n\n\nSwiss artist and educator Moritz Flick has been named the winner of the ten-year $8 million Schiller Prize. The $8 million is one of the largest prizes in the country’s history and the first prize of its kind. Born in Basel in 1960, Flick studied in the United States, Switzerland, and New Zealand before moving to New York in the 1980s. He has worked in the art world since the 1990s, and has exhibited at the Kunsthalle Basel (1998); the Contemporary Art Museum St. Louis (2000); the St. Louis Art Museum (1999); and the Metropolitan Museum of Art (2000).In a 2011 New York Times profile of Flick, art critic David Weigel wrote: “In his own words, Flick, a self-taught artist who began his career by making charcoal drawings, has become: ‘a systematizing, semiotic, abstract, and conceptual artist.’ The following year, he received the Leo Binder Award for Art. Flick has had three exhibitions at the Museum of Modern Art", "The next Biennial should take place in 2022. While the event will be expanded from a biennial to a triennial, the theme will remain the same: the full range of human experiences, both meaningful and unmeaningful, from the most sublime to the most banal.\n\n\nThe Ontario Institute for the Arts (OIA) in Toronto has received a donation of $10 million from the National Association of Art Museum Directors (NAAD) in an attempt to mitigate the impact of the coronavirus on museums. The donation, which comes five years after the institution began accepting artworks through a new program that aims to support small and mid-size arts institutions, was made by the American family, philanthropist, and billionaire Warren Kanders, who is a cochair of the OIA and a major supporter of the arts. “This gift is a game changer,” said museum director and CEO Mark Beasley. “OIA’s board chair, Jim Marshall, and I are grateful to the OIA board for recognizing this incredible commitment to supporting the arts through the coronavirus. OIA’s future is bright and we are thrilled to see what kind of impact this gift will have. We look forward to the", "The next Biennial should focus on how our understanding of the history of art has changed over time, and is now reflected in the recently commissioned “Centrepiece” exhibition.​\n\n\nThe Poetry Foundation has announced the winners of its fifth annual $100,000 Prize for Poetry, which was presented at the end of January. The event, which was also held at the Poetry Foundation in partnership with the Lincoln Center, presented five poems by fifty-one poets from thirteen states.The five finalists were:Eileen Myles’s’ \"The Accident I Am\" (New England);Erica Atkins’s \"Cavalier Place at Midnight\" (New York); Daniel Berkhof’s \"Amanita in a Bottle\" (New York); Amy Bowen’s \"The Comfort of Being There\" (New York); and Neil Crossan’s \"The Line Between Self and Other\" (New York).The Poetry Foundation will choose the fifty-one winners from a shortlist of three hundred and will announce the final ten in the coming weeks. Each winner will receive $100,000.“We are thrilled that our biennial is approaching to a close with the Poetry Foundation", "The next Biennial should take place in 2020, and the first exhibition in 2022. The theme, “The Future Is Now,” will be inspired by the documentary “The Future Is Present,” set in the present. The show will also feature a collection of works by artists from Central and South America, and will feature the work of a new generation of Chilean and Argentinean artists working in the United States. The 2019 edition featured works by fifty-three Chilean artists and collected works by forty-two artists from the Americas.The 2019 exhibition was organized by the Latin American Foundation of the Arts (PACAL), which has offices in Panama City, Caracas, and Los Angeles. The event was organized as part of the Latin American Documenta 2020 initiative, which was launched by the United Nations Educational, Scientific, and Cultural Organization (UNESCO) in support of the 'historic and vital' work of Chilean artists. The biennial is also supported by the Rockefeller Foundation, the Henry Luce Foundation, and the Luminary.\n\n\nA new study conducted by the Museum of Fine Arts (MFA) researchers has found that the visual arts, which comprise almost 70 percent of its overall budget, provide more than $1 billion annually in direct", "The next Biennial should have a clear programme that will show how technology can be used to solve problems that are beyond the control of current institutions. The theme should be “Ecology of Arts”\u0097the biennial will focus on environmental issues and how technology and art can be used to challenge them\u0097and should take place in both Paris and New York. Stephanie Alexander, the executive director of the Art Institute of Chicago, said: “For many years, artists have embraced technology to a great extent to create works that address difficult social, environmental, and spiritual questions. In recent years, artists have also embraced technology to a greater extent than ever before to address social problems. We are excited to see how the themes of this year’s Berlin Biennial will bring the artists together, and we look forward to collaborating with the artists through a yearlong program.”The seventy-fifth edition of the Berlin Biennale will take place in the city’s Neukölln from March 22 to March 24, 2020. The biennial’s twenty-first edition, which launched in 1990, will be held in the city’s Neustadt in September 2020. In the announcement", "The next Biennial should focus on “how art and technology intersect and clash with each other and our world.”The full list of participating artists is as follows:Beijing Art CenterChina Art MuseumChennai Art Hall (CRISAT)Chennai Art Museum (Krishna Nagar)Chennai Art Gallery (NSR)Chennai Art Gallery (NSW)Chennai Art Museum (MHR)Chennai Art Museum (MAM)Chennai Art Museum, JV (c) 1997, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai Art Gallery, Chennai", "The next Biennial should be held in the fall of 2019. The biennial will consist of three exhibitions: “The Story of Art: Progressive Art in the Early Modern World” (October 28–November 2), “Art and Life in the Late Middle Ages: From the Origins of the Early Christian Church to the Renaissance,” and “The History of Art: From the Renaissance to the Present.” \n\nThe National Gallery of Canada has revealed that it will begin welcoming visitors to its new headquarters on Parliament Hill in the fall of 2020. The Canadian Museum of History (CMHC), which is currently undergoing a $460 million renovation, will begin welcoming the general public in 2021.The institution anticipates that the construction of the new facility, which will offer a global collection of more than 2,000 artworks by more than 1,000 artists, will be completed by the end of the decade. The project, which was funded by private and public donors, included the restoration of the facility, the acquisition of land for the project, the renovation of the grounds, the rehabilitation of the building, and the conservation and conservation of the artworks.The building, which is being designed by the German firm Groupe d'études", "The next Biennial should be held in 2020.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Mira Nawi as its new associate curator of modern and contemporary art. Nawi will be responsible for connecting with and guiding audience members through the museum’s collection of modern and contemporary art. Nawi will assume her new role in January 2021. Michael Rosenfeld, president of MoMA, said: “Mira Nawi’s gift of modern and contemporary art to the Museum of Modern Art will allow us to celebrate the diversity of art-making and of the museum’s collections, and to develop new and engaging experiences for our audiences.”Nawi also serves as the director of the Museum of Modern Art’s partnership program, which works with artists to create new exhibitions. During her tenure at MoMA, she curated the museum’s inaugural exhibition “Museum of Modern Art: From Scratch” (2017–18) and helped the institution prepare for its reopening with a redesign, reopening in 2021.\n\n\nThe current state of the Israel-Palestine conflict has led to the cancellation of a number of events scheduled for the third edition of the", "The next Biennial should take place in 2022, but organizers are currently reviewing the schedule ahead of the event, which will also feature other exhibitions.\n\n\nThe Chicago-based nonprofit Costume Institute is partnering with the Museum of Contemporary Art Chicago (MCA) to create a $50,000 prize for costume designers. The four finalists—Alejandra Alarcon, Karen Almon, and Linn Baird—will receive $50,000 in support of their costumes for The Dark Knight Rises, as well as the opportunity to open their own boutique in Chicago. The winning designs were submitted by a group of thirty-eight costume designers, including Anna Atkins, Christopher Bedford, Andrea Bonham, Beth Daze, Cara Hunter, Dara Gordon, Emma Gordon, Lara Lawson, and Christina McPherson.Dubbed The Dark Knight Rises, the exhibition, which will run through May 22, will include 158 works by seventy-five contemporary costume designers from eleven cities. The winners will be announced at the Costume Institute’s May 25 event, which will be held in a converted art building in the city’s Logan Square neighborhood.The Costume Institute, which", "The next Biennial should be held sometime between November 2019 and March 2020. The 2019 iteration was largely a retrospective, with most of the invited artists taking up residence in their hometowns. The 2020 edition will be a much larger endeavor, with the full roster of artists participating. On Friday, September 26, the twenty-seventh edition of Biennial Miami Beach will return to South Beach. According to the Miami Beach Business Journal, the event will take place as planned.\n\nArt Basel announced today that it is increasing its sponsorship of the Kayode Museum in Nagoya, Japan, with a total of twenty-five thousand Swiss francs ($20,000) in recognition of the 2013–14 exhibition “Theologie,” an exhibition of approximately seventy paintings by the Japanese artist Takashi Kawamura that were exhibited at the museum. The donation will come from the Swiss academic and art collector Wolfgang Gramm, who established the institution in 1981 and was awarded the 1892 Nobel Prize in art in art. Kamelon Dorji, director of the art-world-adventure complex Artpark, said: “Together with Wolfgang Gramm, we are thrilled to be able to present ‘Theologie’ to the local community", "The next Biennial should be held in the autumn of 2021, but for the upcoming exhibition, which sees visitors follow a series of instructions on how to open a proper Lego set, the theme is “Lego in the Age of Empire.”The curators will be unveiling the new version of the show at the end of March, when the exhibition is scheduled to run through May.\n\n\nThe Canadian Museum of Fine Arts (CMA) in Ottawa announced today that it is continuing to receive visitors from China following a temporary closure due to the coronavirus. On March 31, the museum closed to the public for a period of nine weeks, ending its exhibition “The Future of Modern Art” and which offered a unique tour of the museum. In an effort to keep visitors coming back for the exhibition, the museum has also introduced new digital viewing platforms and is encouraging people to come back for free admission. In a statement, CMA said: “The museum and its staff remain fully committed to engaging with our Chinese visitors, and we are working to re-open in a manner that respects the cultural diversity of both countries.”When the Chinese government imposed a nationwide lockdown in March, shutting down shopping, restaurants, and transportation in major", "The next Biennial should be held in June 2020.\n\n\nThe National Museum of Art in Washington, DC, has received a gift of twenty-five works by painter and sculptor Robert Irwin. According to the Los Angeles Times, the museum confirmed that the works are from its collection but did not say when they will be returned to the United States.The works, all works from the 1968–1970s, were donated by artist and philanthropist Andy Warhol. Warhol, an American citizen of Italian descent, is the founder of the Warhol Foundation for the Arts and the American Alliance of Museums.The works were donated by Andy Warhol to the National Museum of Art in Washington, DC, in 2015. The museums are currently in the process of restoring the works and are expected to open in January 2021.A spokesperson for the National Museum of Art told the Los Angeles Times that the museum, which was not authorized to provide public access to the works by the late artist, created the gift of the works in order to “ensure the long-term conservation and conservation of these extraordinary works.”\n\n\nAfter the Museum of Contemporary Art (MoCA), Los Angeles (MCA), closed last March due to Covid-19", "The next Biennial should begin as soon as possible and will include a forum with the artists featured in the exhibition. The show will include the first works by the Nigerian artist Aluvia Akuola and the first works by the Egyptian artist Akuad Abulafia (the latter of whom is also being featured in the forthcoming exhibition “Sitting in the Clouds,” curated by Laurent Witte-<|endoftext|>In 2014, a group of artists, collectors, and intellectuals led by the American philosopher Lisa-Anne Byrne, created the first American retrospective of the groundbreaking French artist Claude Monet, who died in 2016 at the age of eighty. Set to open at the Huntington Library in November, the exhibition will feature work from the artist’s middle and late stages, including his famous “Paintings in Shadow” (1938), an early work from his “After the Sunset” series, a series concerned with the evening sky; “Monet,” the first exhibition dedicated to him, formed at the Museum of Modern Art in New York in 1966; and “The Mimosa Effect,” a 1981 exhibition at the Museum of Modern Art in New York, was the first and last time", "The next Biennial should focus on new scholarly developments and the reception of artists in exhibitions. The new data infrastructure for the exhibition, called the Biennial Archive, will help the exhibition gurus and curators understand and manipulate the exhibition. The Archive will have access to the artist data upon request. The exhibition will also incorporate a series of exercises, lectures, and discussions that will introduce the concept of sculpture and how artists have used their bodies in various media. The responses of the artists will also be showcased in a museum-wide digital installation, called the Museum of Art’s Bodies, which will be live-streamed through the museum’s Facebook page.\n\n\nThe Solomon R. Guggenheim Museum in New York and American Folk Art (AFA) in Philadelphia have announced the launch of their biennial “Theaters of Excess: American Art in the Second Wave” in the fall of 2020. The biennial will highlight work by forty-eight artists, including Josh Smith, Nari Ward, Julie Meek, and Rachel Whiteread, and will include an exhibition of artist photographs.“Themes from ‘Theaters of Excess’ include community, belonging, and surveillance,�", "The next Biennial should also unveil a revised and expanded public sculpture garden, which will also boast new areas for education and public activities. The plan is for the Garden to open in the autumn of 2022.\n\n\nThe National Geographic Society and the Charles and Lucille King Family Foundation have given $15 million to six new arts projects in New York City over the next three years. The funds will go toward opening a new, larger exhibition space for National Geographic’s flagship magazine, which was acquired by the Rockefeller Brothers Fund in October 2018, and will also support the creation of a new library of the urban legend, The Yogi and the Growth of Disaster.It will also be used to create a new imprint of National Geographic, which celebrates American history through the lens of indigenous and tribal traditions, and to expand the work of its photographers and scholars outside of the country, and to establish a new grant program that will support artists and designers.The $2 million funds will be divided equally between the following arts: architecture and design, landscape and architecture, and public health and wellness. The Rockefeller Brothers Fund also gave $1.5 million to the arts in 2017. “The challenge of keeping National Geographic in print and online for as many people as possible", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MCA) in New York has appointed Aaron David-Wells as its next director. Born in Las Vegas in 1943, David-Wells, who has served as the board president of the MCA since 2013, is the fourth African American man to helm the institution. He succeeds Mary Ceruti, who retired in March 2019 after a decade in the role, and will take up the post in January 2021.“Aaron is a passionate proponent of the MCA’s mission to elevate the art of African Americans and serves as a strong advocate for the MCA’s work in perpetuating that mission,” said MCA director Ellen A. Moskowitz. “While at the MCA, he worked to advance the museum’s relationship with key supporters of the institution—such as Lena and Peter W. Silber, the founders of the audio-visual company Wangechi Mutu—and helped to push forward the museum’s new Cultural Affairs Center that will bring together hundreds of artists and scholars.”\n\n\nA new survey of the international art world’s art museums conducted by the Berlin-based Berlin art research", "The next Biennial should consist of a group show, which would explore how the body and the body community have come to embody elements of the self and are becoming increasingly affected by the pressures and anxieties of modern life. The exhibition’s second section should be a conversation with artist and intellectual leaders who inform the exhibition’s interiors. I would like to see more participatory, direct, and collaborative work by artists, and I would like to see the show evolve as a project of the museum. I would like to see the exhibition become a place where people can come together emotionally and physically, and to have a real connection with each other. I would like to see this exhibition become more than a history of the museum; I would like it to be a life of art. The third section of the exhibition should be a conversation with an indigenous artist who draws inspiration from the indigenous traditions of the region. I would like to see this section become a platform for an indigenous cultural event, not just an exhibition. The fourth section of the exhibition should be an exploration of the long-term implications of the installation. I would like to see this section become a space where people can come together physically, intellectually and emotionally. I would like", "The next Biennial should explore the site of the new museum with the aim of providing a new platform for contemporary art and presenting an exhibition that is compatible with local, national, and international audiences.”The event will take place at the Experimental Arts Centre in the city’s East Village. The announcement of the dates of the event was made before the biennial’s opening this past April, marking the forty-fifth anniversary of the institution. The exhibition will feature fifty works from the artist’s collection, including new works by Pablo Picasso, Crystell David, and Sedira Aluko. The biennial was inaugurated by a retrospective of Luis Tanez, “The Politics of Light and Shadow,” and will continue this year with a project on the future of the city.\n\n\nThe National Museum of Australia (NMA) in Canberra is facing renewed pressure to make room for a major new Covid-19-related restructuring after it announced today that it will scrap two-hundred and forty-four exhibitions scheduled for the next two years and reschedule more than two hundred performances, performances, and screenings based on events that took place in the city prior to the pandemic began", "The next Biennial should be held in the Spring of 2021, with the first exhibition, “Wu Jingming: Journey of the Sun and the Moon,” to open in the Spring of 2021.\n\n\nThe National Museum of Fine Arts (MoFA) in Washington, DC, has received a donation of twenty-four works by forty artists from twenty-eight countries. The gift, made by a group led by the artist and collector Tom Glynn, was made in honor of the museum’s 150th anniversary, which is currently underway.The artists were chosen based on their exhibition and scholarship on contemporary art and their potential to further the movements of their respective countries through their exhibitions. Among the works that will be presented at the museum are an exhibition of work by Gabi Benab, a solo show of work by Lèze Obel, a show by the artist Nidhi Chopra, and a performance by Jules and Albert Dreyfuss. The first show, “Rai Poe: The Worst” (2019), features paintings by Elsie Galloway, Narges Hujar, and Édouard V of Saar, among others. The second, “The Sixteenth Art of David Kline", "The next Biennial should be in 2021. \n\n\nThe Hong Kong-born British artist Richard Anagnos is to be included in a massive international retrospective of his work at the Kunsthalle Basel in Switzerland next year. The exhibition will be titled A Biennial, or “I, Richard Anagnos: ʙs World.” It will also be organized in Hong Kong and will run for thirteen months, from May to September 2021.The center of Anagnos’s creative life was a despairing 1980s workspace, founded by the artist in a squat in an industrial district of the city, Hong Kong’s commercial hub, where he began to experiment with black-and-white abstractions that appeared to be from a magic mirror. “I spent most of my time in the mirror making the abstractions, making them appear to be people,” Anagnos explained to the Observer. “I was not making the art, but the idea was that I was.” The work was also included in the first exhibition at Botanical Garden in London, The Future of Art: Reflections on a Mirror, and was included in the second edition of the Hong Kong Biennial,", "The next Biennial should take place at the artist’s studio in the Old Town of Barcelona in the spring of 2020. The exhibition will showcase the work of thirty artists, including Sinthujan van den Broek, José Roca, and Adrienne Edwards, and will feature the works of a new group of twenty-six artists curated by the award jury\u0097the Representatives of Spain, France, and the Netherlands. In addition to the works in the exhibition, the space will host programming and public activities for the artists who have won the prize in the past five years.The judges for this year’s prize include:ArtsMissouriGerry ClaytonBlackWaveCassidy Clark Cathy CoxChad CohenDiane Angel OsorioDerek O. EvansDoris AnselmEddie F. FonarFernando PérezFernando PascualGillian PetersonGillian WrightGillian W. MartinKawai DavisKaren JohnsonKatherine MerrittKaty McClellanKayla MahoneyJessica MorganKayla McCoyKaty McClellanKate RufinoKelly SharpeLaurie ArmstrongLaurie BlomkampLaurie CondonLaurie Henningsson", "The next Biennial should have a budget of $30 million and will host a total of twenty-eight artists; but the event will not take place until 2021, when the curators are demanding that the government extend emergency aid to the Middle East and North Africa (MENA).“We are optimistic and hopeful that with your support, the Biennial will continue to present widely-loved artists like Nima Agha and Naguib Sawiris, the first and last artists to ever be included in the exhibition, both of whom are still working in the exhibition,” said Naima J. Al-Abu Dhabi, the director and CEO of the Biennial. \n\n\nThe British artist and educator Alexander Mille, who created works that address issues such as European colonialism, brutalist tactics, and the construction of artificial islands in the South China Sea, has died at the age of eighty-one. Mille’s work is housed in the collections of the British Museum, the Museum of Modern Art, the National Galleries of Scotland, the National Gallery of Art, the Royal Society of Edinburgh, the Royal Academy of Arts, and the Royal Shakespeare Company. Born in London in 1931, Mille moved to the United States in", "The next Biennial should focus on the life and work of one of the most important twentieth-century painters: Hugo Boss.”A selection of events from the upcoming exhibition will be presented on the official museum’s website as well as on the official Facebook page of the museum, which will be updated with the full text of the pavilion.\n\n\nThe Berlin Art Museum (BAM) has awarded four artists up for the 2020–2021 Bierstages Prize, which comes with a $50,000 prize and a fellowship, to artists who have made significant contributions to the museum’s collection and programs. The winners are Christian Wilhelms, Markus Breyer, Markus Petherich, and Ola Gartenfeldt, who have each received a €100,000 grant.The biennial will take place in Fall 2021 and will include works by the following artists:Catherine Lenaerts (Germany)Willem de Kooning (Germany)Bongoria (Italy)Igor Edez (Spain)Fernando Henrique Soto (Spain)Andrea Henrique Martínez (Spain)Andrea Marinara (Italy)Anaïs Nin, Jamie Oliver, and Jean-Mic", "The next Biennial should be held in 2021.\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed the artist and performer Jennie Smith as its new chair. Smith joins from the Museum of Modern Art (MoMA), where she has served as chair since 2016. During her ten-year tenure, Smith has presented works such as Silence is for the Deaf (2017), a series of performances centered on the effects of noise pollution to influence the emotions of a number of communities, and The Innocent Girl, a virtual reality installation that was created using a combination of text and sound, in partnership with the Juxtaposition Factory and the Stedelijk Museum in the Netherlands.“Jennie’s work is deeply concerned with ambiguity and the ambiguity of the human experience, with the uncanny being a prime example,” said ICA director Nahid Redouan. “We are thrilled to welcome her to the ICA. Her intellect, wit, and patience are inspiring, and her work will continue to shape new directions in both art and performance.”Smith will take up her new role in March. The first Biennial exhibition, “Jennie Smith: The Phantom of the Opera,", "The next Biennial should be called for the first time, and should be staged in the autumn, and will be held at some future date. “The mission of the Biennial is to create an international platform for the exchange of contemporary ideas, historical information, and arts and ideas,” said Samantha Bienn, director of the Art Institute of Chicago. “The Biennial is anticipating a lot of work from artists, architects, designers, historians, teachers, and other cultural producers from around the world and is ready to collaborate with them to create a platform that embraces their respective traditions and cultures.”The Biennial will be organized as follows: The biennial will be staged in both a historical museum setting and in a contemporary art school. The exhibition will welcome twenty-four artists, including Tanya Garcia, Jerome Halperin, George Halpin, Anya Huot, Lise Picard, Rirkrit Tiravanija, and Sofiara Udela, in addition to twenty-seven other contemporary artists, including Y Makkakova, Nina Vassallo, Gianluca Navarro, and Odda Pindel. “The exhibition", "The next Biennial should take place in 2022. Nutter plans to present a new work by the Polish Jewish artist Marian Wojtas in the third iteration of the event, which will take place in 2020. The art museum will also be given a new exhibition, Nutter: The Experience, dedicated to biennial projects completed in the museum’s archive, as well as a new group exhibition, “Telling Stories,” which will be presented by the museum in 2019.\n\n\nThe World Monuments Fund (WMF) announced today that it has dismissed the twenty-six-member committee that evaluated the proposed relocation of the Khmer Rouge monument in Cambodia, Cambodia’s capital, and has also terminated the contract of the contractor responsible for its removal. The organization announced the cancellations on Thursday.The organization hired British firm Tangle Bute, which was contracted by the Thai firm Hercules, to remove the monument, which commemorates the anniversary of the Cambodian People’s Revolution (1966–1975), in Bangkok, and charged the company more than $2 million to remove the monument. The Thai government ordered the work to be moved in 2016, but the work was never moved.The WMF’s", "The next Biennial should be the last, as plans change rapidly. A spokesperson for the museum told the Art Newspaper that a new exhibition—likely to be held in the fall—would be put in place in 2020. “We are not going to be able to return to the theme of this year,” the museum said. “We are going to set up a new series. We want to focus on exhibitions, educational programming, and community partnerships. We hope that is the right time to resume the Biennial.”\n\n\nThe museum has received a gift of eleven sculptures, most of which were on its way to a new exhibition at a time when it was closing, that were set to go on display at the institution in the coming months. The works—which were donated by artist John DeWitt, who lived and worked in New York from the 1950s to the 1990s—were to be featured in the third exhibition of his “New York” series, “The Future Is Present,” which opened at the museum in November.DeWitt’s son, John DeWitt Jr., told the New York Times that the works will be moved to the exhibition space of the museum so that they can", "The next Biennial should focus on the history of the Americas in Mexico City. William E. de Salvo, the chairman of the board of trustees for the Biennial, said the exhibition’s upcoming edition, which will take place in the Spanish city of Cordoba from March 15 to March 17, will present the history of Mexico from a global perspective and examine the political, economic, social, and cultural developments that transformed Mexico City during the twentieth century.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has appointed Daniela Rosales as the new director of the Metropolitan Museum of Art in the Bronx. She will be responsible for transforming the museum’s physical environment, creation and acquisition, and the collection through the institution’s construction, renovation, and expansion.“After a thorough search of the organization’s staff and board, Daniela Rosales’s selection embodies the Met’s vision and spirit,” said Museum president Daniel H. Weiss. “I’ve long admired Daniela Rosales’s ability to bring together artists, collectors, and architects in creative and innovative ways to advance the museum’s mission. Having spent time with her", "The next Biennial should be held sometime between July and November 2021. \n\n\nThe Brooklyn Museum in New York is considering an overhaul of its current exhibition, “Les Demoiselles Métals: Mascarpone,” that has featured photographs and works by contemporary artists such as Carlos-Andrea Barba, Pablo Picasso, and Ternélène Kenner, in order to make room for more works by women artists. The institution’s board of trustees announced the decision on Tuesday and the full board is expected to vote on the proposal by the end of the month.“As we continue to present a wide range of contemporary artists in our exhibition spaces in an effort to extend the Art of Women’s History, the museum is reviewing the design of our future shows to better reflect the current art and design landscape and our future exhibition agenda,” said Elizabeth Blake, president of the museum and director of exhibitions. “We anticipate having more women artists represented in our exhibitions, in our collections, and in our collections in the coming years. Our goal is to have the widest collection of work by contemporary women artists to date.”\n\n\nThe Guangzhou-born, Hong Kong–based artist and", "The next Biennial should take place sometime in 2020. The ten year anniversary of the exhibition is also scheduled for 2021. \n\nThe fourth edition of the London-based biennial, titled “October Landscape,” will be held at the Park Viewing Rooms at the National Museum of Britain, London from 18 to 24 October 2020, and will be presented by the British Contemporary. According to the British Contemporary, the theme is “Theatre of Sculptures,” a phrase coined by British architect F. M. Hussey in the early 1920s. The National Gallery is planning to move the event from its existing home on the first floor of its building on Park Viewing Room to a new venue on the ground floor of the museum.The institution has been working on the relocation for several years, and it recently unveiled the design for the new venue, which will be on the ground floor of the museum from October 2019 to November 2020. The museum previously staged a “Landscape Industry Exhibition” in the museum in 2015 and organized several other exhibitions, including “Alien Landscapes” (2016) and “Artist Space” (2017), which examined the work of twenty-seven female artists. The museum", "The next Biennial should be held in the first half of the year 2020. The festival will be organized as follows: 9 AM–5 PM. The exhibition will be comprised of : “The Battle of Al-Andalus,” an exhibition of the works of Renzo Magistrada; “Faust,” a presentation of works by Hildegarde and Thomas Mann; and “The Shape of Things to Come,” a collaboration between Andrea Bocconi, Cécile Bocconi, André Breton, and Joaquín Almería. The number of the artist, the works displayed, and the number of the year will be cross-referenced to the year of the biennial.“The exhibition will be inaugurated by an exhibition of work by the artist Faust, with works by the Italian sculptor Andrea Bocconi and the Chilean artist Joaquín Almería. We hope that the exhibition will be a powerful signal for future visitors to Al-Andalus: that it is a work that belongs to everyone, has the right to be enjoyed and admired, and has the power to move us.”  The", "The next Biennial should be hosted at the Museum of Southern Art in New Orleans; the Art Institute of Chicago; and the Art of the Party in London, which is currently under construction. On the next edition of the Art of the Party, curated by Nick Brennan, organizers are predicting that the theme will be “Mothers and Children,” a theme that will vary according to the mood and circumstances of the day. “The question of whether art can address systemic racism is merely one of many,” said Laurie Anderson, cofounder of the feminist nonprofit Mothership. “The question of whether art can be a vehicle for social justice and equality is much larger.” The London pavilion will be inaugurated by a new work by the artist Hui-Chun Huang, “An Open Letter from London,” which was created in collaboration with the late architect and historian T.J. Adès and was released in partnership with the London-based artist and activist Jane Fonda, who campaigned against xenophobia and police violence. According to the Guardian, the artist also collaborated with Huang’s daughter, Samantha, on a piece that will be on view this weekend. The work is titled �", "The next Biennial should dedicate a portion of its programming to the history of the art of the Americas. In anticipation of the show’s opening, the organizers have developed a collection of Indigenous art that will undergo museum exhibitions in September 2020.According to the Art Newspaper, an exhibition organized by the Los Angeles County Museum of Art (LACMA), which is housed on the same campus as the Museum of Contemporary Art (LA MoCA), has announced that it will open a new branch of the museum in the city of Bridgehampton, England, in November 2021. Its inaugural exhibition, “The Zodiac Age,” will be open to the public from November 26 to January 22, 2022. The exhibition will consist of eighty works, which were made by twenty-five artists in the nineteenth and twentieth centuries.“The show, which will celebrate the 'age of the zodiac', will showcase the talents of thirteen artists at once, and will feature a selection of work by a new group of artists that will be curated by a different curator,” a statement from the museum reads. “The museum is currently working on a new master plan, which will involve an expanded program of exhibitions, programming, research, and curatorial work.�", "The next Biennial should be held in 2020. The deadline for the event is January 28.The 2019 edition of the Biennale, which was staged in the city of Biennale, curated by Michel Lama, was cancelled owing to the Covid-19 crisis. Organisers said the project was due to open in January of 2020.The 2019 edition, titled “Between the Sun and the Moon,” was co-organized by Lu Hsu and Kim Kyung-Hui—the Los Angeles–based duo behind the Sundance Film Festival, which was cancelled last month. The Biennale had been scheduled to run from December 10 to January 2.\n\n\nThe Opéra De Beaux Arts (OAB), the prestigious contemporary art museum in California, has announced that it will open a new digital platform dedicated to artists and cultural workers that will allow the public to learn more about and access works created by and from the museum. The platform, called the Open Stage, will be launched with an exhibition of works by Adam Lucas, an artist whose practice focuses on the biohacking movement, and will run until March 19. The exhibition will feature 1,400 works from the artist’s permanent collection, including works within the last", "The next Biennial should be held in early 2021.\n\n\nThe Kamel al-Nasser Museum in the Beirut Governorate in northern Syria, which was forced to shut down in March following a civil war-related civil war-related coronavirus outbreak, has released a statement regarding the coronavirus outbreak and the coronavirus epidemic:The institution, which was established in 1980 by the founder of the renowned Nasserite rock and roll collective, Asadeer, appointed veteran artist and academic, Hassan Hassan al-Shayk, as its new artistic director. Shayk will assume his post in January 2022. He succeeds Ammar al-Kasasbeh, who retired in March after a decade as the museum’s director.The museum is currently working on a major project, titled “Spiral Paths,” which will take the Beirut-based artist-run institution across twenty-four cities in the capital region, in an effort to create an environment conducive to the exhibition of new work by Shayk’s contemporary artists, including Mira Gartenfeldt, Ladislav Pulev, and Sabine Schipper. Shayk’s primary focus for the project will be on", "The next Biennial should be staged in 2021. The first iteration will be staged at the Motel behind the Palace Theatre in Beijing at an estimated cost of $120 million. The museum hopes to raise $250,000 to conduct the whole exhibition.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it has entered a new chapter in its history. The institution celebrated its fifty-fifth anniversary last year, and in June it became the first museum in America to open in the heart of the city’s historic Pfeifer Savings and Loan Building, designed by architect Frank Gehry and completed in 1977. The building, which is currently home to more than 4,400 artworks and events, including performances, lectures, and public tours, was completed by architect Kiki Smith, who was hired by MoCA to design the new venue.Three years later, in a landmark public ceremony, Smith launched the $12 million, fifty-second iteration of “The Magician and the Thief,” a four-hour exhibition that will explore the relationship between the work of architects and the contemporary art world. The show, which was staged at the San Diego Museum of Art and will run until October 28, will launch the first episode", "The next Biennial should be held in June 2021.\n\n\nThe British Museum (BMI) in London has appointed Kate Hoberman as its next head of curatorial affairs. Hoberman joins the museum from the British Museum, where she has held the position since 2014. Her new role will be centered around the curation and interpretation of the institution’s collection of over four hundred works by contemporary artists, including Damien Hirst, Mark Duggan, and David Hockney.Hoberman, who is also the head of the British art department at the Museum of Contemporary Art, London, was appointed as head of the museum in September 2019 and took the helm in March 2020. During her tenure, she oversaw the acquisition of over one hundred works by artists working in the contemporary art field, including Robert Mapplethorpe, Agnes Martin, and Lois Dodd, and introduced a new exhibition format, the Art of Art, which she described as “more of a companion exhibition” to the museum’s existing Special Collections Collections program.Hoberman’s first special exhibition, “The Birth of a Nation: Art and Race in the United States” (2019), was organized by Koons Gallery and the Museum", "The next Biennial should be hosted at the University of the Arts London (UCL), and will open in 2020. Inaugurating the event will be a presentation of the work of Deborah Cox, a triple goldmine of cultural history and an important contemporary American artist. \n\n\nThe Museum of Contemporary Art (MoCA) has announced the winners of its biennial Awards for Contemporary Art, which recognize outstanding achievements in the field of contemporary art. The biennial was established in 2001 as a collaborative initiative between the museum and the Los Angeles County Museum of Art (LACCA). The awards honor works made in the Los Angeles area and coincide with the annual February 28 to March 1 weeklong celebration of the late Los Angeles native Richard Anuszkiewicz, whose work is considered the original work of the Los Angeles artist and settler John Gay.For the 2019 edition, the biennial was expanded to include a weeklong event surrounding the city of Los Angeles, the Sonoma Valley, and the Santa Monica Mountains. The winner of the 2019 awards, Ana Mendieta-Vega, was awarded the distinction of being the first Latinx artist to win the Pulitzer Prize. Other nominees for the prizes included Roberto Coronado-Ortiz, Mark di", "The next Biennial should be held in the spring of 2021. The next exhibition should be titled “The Present Centered Around Art.” The 2019 show featured work by twenty-six artists.\n\n\nThe Durham Art Museum (Damm) has appointed Rachel Harrison as its next executive director. Harrison comes to the Durham from London, where she has served as the director of contemporary art at the city’s Tate Modern since 2012. She succeeds Liz Macgregor, who retired in August 2019 after eighteen years at the institution.According to the Durham Times, Harrison’s first public role at the museum was as the head of contemporary art at the city’s Edinburgh Festival in 2012. She has held the position of director of the museum since March 2019. During her tenure, Harrison helped the museum to establish a new contemporary art collection and re-imagined the landscape of the institution, which is nestled in a meadow of arable land and boasts two galleries and a coffee house. The Durham Art Museum has also expanded its collection by thirteen thousand works since its founding.Commenting on her appointment, Harrison said: “I’m thrilled by the opportunity to lead the Durham Art Museum, which has shown such remarkable growth and", "The next Biennial should give a voice to the artists and should show how art can be a tool for social change, a bridge to the arts for people who don’t have access to them, as we try to imagine their lives.”\n\n\n\n\n\nTania Bruguera, Cécile B. & William B. Jones, and their illustrators Paul Mpagi Sepuya, William S. Burress, Jr., and Nicholas Sarandos, have been named board members of the International Center for Transdisciplinary Art (ICTA) in New York. The institution, which has been operating since the 1970s and was rechristened the Center for Transdisciplinary Studies (CTS), received a $50,000 grant from the Henry Luce Foundation in support of the expansion of its programming in 2017.“The Center for Transdisciplinary Art has been a pioneer in bringing together artists and thinkers across the globe in pursuit of new ideas and new approaches to art,” Bruguera said in a statement. “ICS is dedicated to cultivating artistic experimentation and the development of new approaches to art and arts education so that the arts become even more accessible and accessible to others, and a vehicle for political action in", "The next Biennial should have the same format as the recent one, will include new works by artists and landscape and will take place in the Parliament of the Federation of Austrian Architects (BA), Vienna. A new exhibition organized by the BAE also opened in Brescia in February, which was cancelled owing to the Covid-19 pandemic.\n\n\nThe German art historian and theorist Dorothea Rockburne has died at age eighty-six from cancer, after a ten-year battle with the disease. She was diagnosed with the aggressive form of the disease in 2015 and spent the next two years fighting the harmful effects of the novel coronavirus. She completed a yearlong residency at the Künstlerhaus in Vienna in January 2019 and was awarded the German Grand Prix in January 2020.Born in Vienna in 1937, Rockburne studied at the Louverture in Kassel before moving to Kassel, where she eventually earned her master’s degree in 1955. She returned to the university in 1971, where she earned her Ph.D. in art history from the Künstlerhaus, and found work in the arts field as a curator, writer, and editor. In 1977, she moved to the University of Vienna,", "The next Biennial should focus on the role of Refinery29 in the fight against anti-social behavior and the trauma it causes. \n\n\nThe Museum of Fine Arts (MFA) in Boston has been forced to remove a sculpture by sculptor Malcolm Brown that celebrates the legacy of the late father of modernism, Claude Monet. The work, Sleeping Beauties, was installed in a “Fashioning Modern Life” exhibition at the museum in 2015 and depicts five nude women wearing underwear. It was made by Brown in collaboration with the artist and textile designer Ralph Lauren.In a statement, the museum said that the “decision to discontinue the installation was made in light of the museum’s ongoing efforts to present the work in a way that reflects the richness and diversity of our current world. The sculpture’s inclusion in the show was not made in a way that harms the work or its legacy.”The sixty-six-year-old work, titled The Beauty of Nature, was created in response to the work of women artists before and during the American Civil War. The exhibition was commissioned by the artist and was staged at the museum in 2015. The curator of the show, Mark Yang, created", "The next Biennial should be held in 2022. “I am very excited to be an artist-in-residence at the London Biennial,” Peter said. “I will also be able to work with my own body to re-conceptualise the exhibition, which I believe will be a watershed for the exhibition ‘The London Biennial: Part 1: The Future Is Present.” Peter is the founder of an exhibition space in London called Peter Jackson Gallery (PJG), where he has staged exhibitions such as Election: Electronic Politics and the New Reproduction, 2015, and Theater of Operation: Invasion and Occupation, 2014.The London Biennial will be hosted by the National Portrait Gallery in London. The first exhibition, entitled “Theatre of Operations” (January 5–March 22, 2022), will consist of nineteen installations by thirty-two artists featuring contributions by seventy-eight artists from thirty-nine countries. The second exhibition, “The Future Is Present: The London Biennial” (March 22–October 17, 2022), will present works by seventy-six artists that were selected from a pool of seventy-eight artists that were nominated", "The next Biennial should be held in 2022.”\n\n\nThe National Geographic Society has been sued by the estate of Francis Marion Dantovich, the American photographer whose work many consider the defining work of American landscape architecture.Twenty-six works by Dantovich are currently in the collections of the Smithsonian, the National Gallery of Art, and the Smithsonian American Art Museum (SAAM). The estate claims that the institution violated its fiduciary obligation to consult with the Dantovich family about the disposition of the works. The suit also accuses the Smithsonian of failing to investigate the possibility of the purchases, which were made in 1970, and failing to inform the Dantovichs about the possibility of a wrongful death lawsuit.The estate also claims that the institution violated the Sherman Anti-Trust Act by promoting the work without the consent of the Dantovichs. The suit also accuses the institution of promoting the work without the permission of the family and of violating the Lanham Act by requiring the family to sign an agreement prior to the sale of the works.“Ultimately, we believe that National Geographic owes the Dantovichs an apology and an apology is an obligation,” said David Scharf, a lawyer representing the estate. “We hope that", "The next Biennial should be chosen by the end of 2018, and its date to open will be postponed until at least 2021. Its first exhibition will be a presentation of fifteen new works, which will be organized under the theme “Coming Back to Life.” Since the exhibition is being held in a studio space and not in a living environment, it will be more intimate and personal, with the intention of rethinking notions of the human body and its relation to the environment. The exhibition will also take a different approach from the current art-world model, which focuses on the physical aspects of art. The full list of participating artists can be found here.\n\n\nThe Czech Republic announced today that it is increasing the minimum age for buying and using alcohol from sixteen to twenty-nine. The new law will take effect on January 1, 2020 and will apply in all public and private establishments in the Czech Republic’s capital city of Prague as well as in cities and towns located along the Danube and the Black Sea.“This is an important step in the positive direction to reduce the risk of the spread of communicable diseases to our young people,” said Senator Petra Hildenbrand, the chair of the Senate Committee on Health and Welfare.", "The next Biennial should be held in 2020, when most of the exhibits will be completed and the Middle East will be in its third iteration.“We are extremely grateful to the organizers of the projects since they have shown such great enthusiasm for the exhibitions, which have been especially important in supporting our exhibition program,” said Renate Pape, the chair of the board of directors. “We look forward to the 2020 edition. Our exhibitions are already completed and our exhibition program is on track to make a rapid recovery from the impact of the coronavirus. We will continue to present exhibitions and exhibitions at the same high standard as we have done for twenty years.”\n\n\nThe London-based nonprofit Art Fund has pledged $1.5 million to help artists and small and mid-size British arts and culture organizations recover from the Covid-19 pandemic. The organization’s director, Rosalind St. Vincent, said the funds will be distributed in the form of grants in support of the Covid-19 response and recovery efforts.“The Covid-19 crisis has recently made clear that the arts and cultural sector remains one of the hardest hit by the global health crisis,” St. Vincent said. “", "The next Biennial should be held in 2021, and the biennial’s theme “After the Fall,” should be resolved and moved to an entirely new location. The theme should be all about the transition to a new world and its effects on the environment. The exhibition will also consist of a combination of new and old works, and will be led by an artist from the project group, who will be known as the author.“This is the first time the author will be presented with the full creative community’s input,” said the artist, who is currently a Ph.D. student at the University of Washington in Seattle. “We’re creating a platform where people can come together, share ideas, and create new works.”The first show of the new series is slated to open in January 2021.\n\n\nThe Wyss Institute for Biologically Inspired Art at Harvard University in Cambridge, Massachusetts, has named Katie Palazzolo as its inaugural president and CEO. In her new role, which is funded by the Wyss, Palazzolo will lead the academic biennial through its 2017–19 fiscal year, and will help shape the future direction of the Wyss by helping to identify which works will", "The next Biennial should take place in Lisbon in 2021. The biennial will deal with issues such as the origin of art, the body and the soul, and the relationship between people and the natural world.“The future of art is at the core of the current problems,” Paulo Paulo de Sousa, president of the Biennale de Lisbon and Chair of the committee of art historians, told the Art Newspaper. “This is one of the main causes of the problems we are facing, since art is one of the main engines capable of creating new narratives. The future of art is at the core of the current problems, because only in this way can the body and the soul be preserved.”\n\n\nThe Dismaland Museum of Art in New York has appointed its first director, Pier Paolo Baratta, as its next director. He succeeds David H. Guttenfelder, who departed the institution in September 2018 to head the Metropolitan Museum of Art in New York, and will take up the post on October 21.“We are delighted that Pier Paolo has agreed to serve as our next director,” said Mary Anne Hagerty, the board chair of the New York Museum of the Arts. “", "The next Biennial should be held at least two years from now. I believe that we are close to achieving this milestone. Since the exhibition will be housed in a museum, the exhibition will be a platform for contemporary art in the city of Los Angeles.We are also developing new ways to engage with and support the artistic and cultural heritage of Los Angeles, and are working to make the biennial more accessible and affordable for the public. We are grateful to the city of LA, our staff, and our sponsors for their steadfast support throughout this process.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has recently faced backlash for removing a landmark work by Aaron Siskind, a prominent Native American artist and leader who was one of the pioneers of American Indian art, from its permanent collection, seemingly out of spite.In a letter to the public, the museum’s board chair, David Gwyn, and the museum’s director, John Rodgers, defended the move, which was made in May 2019, the same month as the 40th anniversary of the institution, which is located on the second floor of a modernist industrial building in a strip mall in West Hollywood, California, and is currently undergoing a $110 million expansion", "The next Biennial should be held in 2020.\n\n\nThe Royal Academy of Arts (RA) in London has awarded a group of French artists a grant of $80,000 in support of their work, entitled Praise be to God, that explores the role of religion in art. The group will receive the funds through the Royal Academy of Arts (RA).“The Praise be to God project has been conceived as a collaborative project between artists in the English and French countries, and the sum drawn for the project is a further affirmation of the influence of the two countries on each other’s art,” said the Royal Academy’s executive director, Charlotte Boudreau. “The Praise be to God grant program is a collaboration between two countries and in line with the RA’s core values, which is to foster and develop the mutual understanding and appreciation of art and art history.”This year’s grant cycle, which ran from April 2020 to March 2021, included the work of three artists: Jean-François Lygerté and Daniel Buren. The 2018 grant cycle ran from April 2020 to September 2020. Praise be to God is a project that will engage with the", "The next Biennial should take place in the spring of 2020.\n\n\nThe Baltimore Museum of Art (BMA) has received a gift of more than four hundred artworks from the Charles and Lucille King Family, the billionaire owners of a leading private museum in the city. The gift includes over three hundred works by artists such as Richard Avedon, Baltimore native H.G.S. Davis, and Robert Irwin.“The gift of works by Robert Irwin and Richard Avedon is especially meaningful, given that they are the last remaining members of the legendary Avedon family, which has provided the BMA with a major source of material for more than a century,” museum director Christopher Bedford said in a statement. “It will allow the BMA a great deal of work in the coming months to establish a new blueprint for presenting the King’s vast collection of art. The King’s vision has inspired the BMA to thrive as a central location for art and ideas, and it has proved to be a guiding principle in transforming the museum.”The foundation established a new endowment for the museum in 2017\u0097$122 million\u0097to be used in perpetuity by the family to pursue the museum’", "The next Biennial should take place in 2019.  Meanwhile, the 2020 edition of the Guggenheim will mark its centenary with a special exhibition of work by the artist.\n\n\nThe National Museum of the American Indian (NMI), in Washington, DC, has received a gift of thirty-five artifacts from the collection of the late artist and activist Ira D. Glass. The museum will display the works at its upcoming exhibition “My People” (October 7–November 29), which will be held at the museum.Founded in 1971 by activist and community organizer Harry C. Brown and entrepreneur Leo Babauta, NMI was one of the first large nonprofit arts organizations to receive a gift from a local Native American. In 2001, the institution donated twenty-five works by fourteen artists, including Mieko, John B. and Robert B. Johnson, and was the first organization to organize a ceremony to dedicate a work to Glass. The gift also included the artist’s original sketches for the works. The works were originally acquired by the Los Angeles–based dealer Gerald and Mary Glass, who were active in the Native American arts and had formed a company, the Glass Gems, that collected Native art. After the family sold", "The next Biennial should be announced in late spring/early summer. It will be a biennial showcasing the work of twenty-seven artists. In order to preserve the biennial as an open platform for dialogue and reflection, the artists have postponed the exhibition.The artists who have received the prize for their work are: Elyn Atwell, Alicja Sze, Anant Prasad, Bajrangi Rajan, Katja Zielinski, Lais Almeida, Laurie Block, Sara Brand, Rana Foro, and Kirsten Barton.\n\n\nThe Institute of Contemporary Art (ICA) in Cologne, Germany, announced today that the estate of Ludwig Käfer, the late German painter who created works that often grapple with the relationship between the natural and the symbolic, has donated forty-eight works by sixty-four artists to the institution. The donation includes Terena Brätsch, László Báez, María Cultura, Lézia Santos, Ruger van der Kolk, and Remyst Ehrlich. “Käfer is one", "The next Biennial should be held in the spring of 2021. After a bidding war between the two institutions, the institution selected the University of Copenhagen over the city of Oslo. The exhibition’s first date is “Spring/Fall 2022” at the København Museum in Oslo. Its second iteration is slated to open in the spring of 2023.The Biennial will be held at the København Museum from May 24 to May 31. Details about the upcoming show are currently scarce, but the København Museum says that the exhibition will be curated by director Henrik Andenby, the former chief curator of the København Museum. It will also be hosted by the Museum of Modern Art in New York, which is currently working on a new edition of the exhibition, Art on Paper, for May 21, 2020.\n\n\nThe public school’s Greek principal, Giorgos Maviglio, resigned on Friday following a controversy over a novel art project he began with the school’s students, a group known as the Messagene, in August 2020, the New York Times reports. He claimed he was disappointed by the outcome,", "The next Biennial should have an opening date of December 7–25.  The 2018 edition was held at the Art Museum of Chicago and featured works by thirty-four artists. The exhibition was organized by the Chicago–based nonprofit ArtInMinds. The 2019 edition was curated by the Los Angeles–based nonprofit ArtPlace Los Angeles. The 2020 edition will be held at the San Francisco Museum of Modern Art and will be presented by the Chicago-based nonprofit Creatives in Minds. The 2020 event will be held at the San Francisco Museum of Modern Art (SFMoMA), and the 2021 edition will be held at the Museum of Modern Art. Advertisement\n\n\nThe French progressive art journal Le Monde has published an open letter defending the Parisian Condé Nast, which was accused of censorship by French courts earlier this month after it failed to remove a satirical image that purported to depict the prophet Muhammad. The Le Monde article, entitled \"The Prophet: The Real, Reality is an Empty Image, ” describes the image as a “completely original and original, pretty and ugly,” which then goes on to describe how the critic Martin Bethenoy regretted his previous work", "The next Biennial should be held in the autumn. The project will also seek to promote the work of local artists and institutions through a series of exhibitions, lectures, and other programs and will create a platform for the exchange of principles. The biennial will consist of approximately thirty artists and will be curated by Lucy Stoster, director of the High Museum of Art in New York; Paul Mpagi Sepuya; and Kavita Devi.\n\n\nThe British documentary filmmaker Ali Wong, who documented the Nigerian resistance in the 1980s and lead a successful petition against British involvement in the invasion of South Africa, has died at the age of ninety-two. Wong was a thorn in the British government’s side during the war against apartheid, and during the last years of the administration, when he was a staunch supporter of the film-makers who were targeted by racist legislation.After exposing the brutality of British colonial rule in Africa, Wong became famous as the central organizer of the UK’s Black Panthers, a black nationalist organization. He was also the author of several books that exposed British racism, and in 1972 he was given a lifetime achievement award by the BFI.In the video essay 'The Truth About Birmingham’s Black", "The next Biennial should be held within two years.<|endoftext|>Police in Ferguson, Missouri, have arrested George Floyd, the African American artist who was killed by the police on Friday, August 9, in a staged incident involving fireworks and tear gas, and have charged him with second-degree murder in the death of the 18-year-old.The St. Louis County prosecutor’s office has charged Floyd with second-degree murder after a grand jury declined to indict Officer Darren Wilson in the death of the teenager last week. According to the New York Times, citing two people familiar with the investigation, the nation’s third-largest city’s district attorney’s office announced on Monday that Floyd will face up to ninety days in jail.During a hearing in federal court on Monday, prosecutors said that Floyd told an officer, “I have a .38 in my hand, and I have four of those in my waistband,” reports the New York Times. “The officer placed the chemical agent into his mouth and spit it out.” The statement was made as Floyd appeared in federal court for a hearing to determine whether the criminal complaint can be dismissed.The thirty-one-page statement was filed in a complaint filed by", "The next Biennial should be held in Paris in the autumn of 2020. In the meantime, the museum will continue to present exhibitions on some of its collection, such as the Maquis’s “The Prisoner of the Fold,” 1973–74. In a joint statement with the Maquis, the institutions said the decision was not related to the legal proceedings surrounding the exhibition. \n\n\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Kate Donatella as its next chief curator. She has been named chief curator of contemporary art at large by the newly created board of directors of the board of trustees of the institution. Donatella comes to the museum from the New York–based nonprofit organization the Collaborative Arts Alliance, which works with artists and organizations to conserve and present artworks.In her new role, she will oversee the development of MoCA’s collection of contemporary art by creating and presenting new exhibitions and public programs. Prior to joining the organization, Donatella was a curatorial consultant for the Los Angeles County Museum of Art and was head curator of the critically acclaimed “Pioneers of Craft” (2017–18) biennial.Commenting on her new responsibility,", "The next Biennial should take place in 2021. It will also be the last, and will be replaced by a new edition of the exhibition, titled “The Future Is Present;” which will take place in the future.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Joan Larsen as its next executive director. Prior to joining the institution in 2015 as its interim director, the forty-three-year-old artist created and performed with installations that explore themes of memory, identity, and memory-making.Larsen comes to the museum as the third person to lead the institution since its founding in 1976. She succeeds Carolyn Wang, who retired in June after twenty-five years at the helm of the institution.“Joan’s leadership and vision for MoCA is inspiring, and we are privileged to have her as our next executive director,” said Larry Elting, director and CEO of MoCA. “She has proven time and again her ability to turn around a complex institution with the same energy and versatility as she has shown over the last fifteen years. We are excited to welcome her and look forward to working with her.”Prior to joining MoCA in 2006, Larsen served", "The next Biennial should be held in 2020.\n\n\nThe Art Newspaper reports that the Uffizi Gallery in Florence, Italy, has recruited two new artists for the 2019 edition of the Venice Biennale, titled “Un Cinéma”\u0097which will run from February 19 to February 20, 2020. The announcement comes a day after Artforum’s 2019 edition, “56,” was held in the Italian city. The exhibition featured work by thirty-six artists and featured twenty-seven works by artists from sixteen countries.“Cinéma is a term which refers to the whole body, the soul, and spirit,” said Giuseppe Massimo, the director of Uffizi. “The artists in the show are trying to express their views on the body and to address issues surrounding the soul, which is a very significant and contemporary topic in Italian art. Their work is a reflection of the diversity of Italian talent and the extent of their knowledge, and it is their intention to bring the full range of the Italian arts into the show.”The artists who will be featured in the show are Anselm Kiefer, Nicola Graziani, Oriana L", "The next Biennial should focus on the history of British art in North and South-East England and will organize exhibitions and lectures to delve more deeply into the region.Titled “The Place of Art in the Age of Mechanical Reproduction,” the show will also present a “presentation of an original work by G. M. Wodehouse” and will feature short-lived exhibitions by artists such as Anna Atkins, J. M. W. Hunter, and Henry David Thoreau. The biennial’s inaugural exhibition, which was curated by Annie Brooke, will also feature work by a select group of contemporary artists.“The Place of Art’s’ Historic Role: From Beheaded Martyrs to Conceived Humanities,” said Mark Brooks, chair of the committee. “We are excited to invite these artists to examine the meaning of the biennial in their own lives and the stories of their own work. We are especially grateful for the work of the artist/director Hannah Bond, whose captivating vision led to ‘The Place of Art’ as a reclaiming of the biennial as a creative project.” The biennial will begin on Wednesday, September 14, at the Fifth", "The next Biennial should take place in the spring of 2021 and will be hosted by the city of Santa Fe. Connecticut is also planning to hold a retrospective of Hiromi Tomita, a Japanese artist who is best known for his multi-sensory works that explore the concept of memory, and which are slated to open in 2017.\n\n\nUla and Shilpa Datta are the first Western creators to receive the Bharatiya Janata Party (BJP) government’s support for the National Endowment for Television (NEAT). The country’s newly elected minister of state for arts, Dinesh Sharma, announced on Saturday that the NEAT will grant the couple $260,000 for their exhibition “Until Present,” an exploration of the social and cultural impact of British colonial rule in India, and will also honor their request for the artists to be included in “the next iteration of the Varanasi Art Festival.”The couple, who first met the BJP government in 2015, was invited to participate in “Varanasi|Artists,” a five-day celebration of Indian art in the capital, in November 2016. The show, which is organized by the New", "The next Biennial should be held in 2021.\n\n\nThe Art Newspaper has announced that it is expanding its circulation beyond North America and Europe. In addition to reprinting the Art Newspaper each week during the September and December biennials, the company will now be given the opportunity to publish an online edition. Its first online edition will be published on November 21 and will feature content from the biennial, including interviews with artists, designers, and other influencers and will be available for free download. The biennial will also be livestreamed live on the publisher’s website.The company’s latest online publication, Artforum, is also growing in circulation. The publication currently has over 3.3 million downloads, but it expects that number to rise to 6.2 million this year. A new digital magazine, Artforum for Apple devices, will be released this year.The announcement coincides with the release of The Gallery of Modern Art’s first comprehensive overview of the new exhibition program, “The Fifth Element,” which will feature approximately 125 works by artists including Ed Ruscha, Adrián Castillo, Adrienne Atget, and Pierre Huyghe, among others. The new series will premiere", "The next Biennial should take place at the New Museum in New York in 2020, and the third at the Museum of Modern Art in New York in 2021. \n\n\nThe Museum of Fine Arts (MFA) in Boston has launched two new initiatives focused on the life and work of American painter and sculptor Ed Moses. The first, which recently ended its inaugural season, was a three-day, free, biennial event, titled “Dalalila-tm.” The second, an exhibition that will open on October 25, is titled “Ed Moses: A Life and Work.”“The Art of Life and Work,” will consist of four works, two of which were recently acquired by the museum and will open in October 2020.“The Ed Moses exhibition is an excellent opportunity to re-examine the history of American art with an eye to the contemporary,” said museum director Ian McAllister. “It will also be a great way for museumgoers to learn more about the artist and his impact on the modernist landscape, as well as to appreciate the intimate relationship between the museum and the artist’s studio.”As part of the initiative, the museum will display", "The next Biennial should be held in 2022, and the first in 2023.The announcement comes on the heels of Art Basel Hong Kong’s announcement that it is planning to open a new, larger location in the city’s Marina Bay. The museum will be located on the third floor of the building, and will host between twenty-five and thirty exhibitions during its inaugural season.“The future of the Art Basel Hong Kong is very exciting,” said the museum’s director, Simon Calland. “I have been fortunate to work with the talented Hong Kong team, who have developed and proven their ability to work together across the globe. It is a significant step forward for the museum as we move forward with our new five-year plan. I am confident that these talented artists, who are driven by a shared passion for art, will deliver a compelling exhibition for us to explore. The new exhibition format will allow us to create an exhibition that will engage with the city and the bay, while incorporating the full range of the exhibition’s forthcoming biennial.”The inaugural exhibition, “The World Is Triangulating over Art,” screened more than eighty works by artists including Adam Pendleton,", "The next Biennial should be staged in 2021.  For the Nordic Contemporary Art Biennial, the Danish pavilion was chosen in 2018 and the Swedish pavilion in 2019. The Nordic Contemporary Arts Festival will be held in Helsinki in 2021. The Nordic Contemporary Art Biennial will also be held in Stockholm in 2022. Nordic Contemporary Art biennial organizers are planning to hold an exhibition of work by various artists in Stockholm in 2020. The event will be organized as follows: The Danish pavilion will present the second Biennial in 2018. The Swedish pavilion will present the first Biennial, Nordic Contemporary Art, in 2019.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has released the full list of performers participating in the fourth edition of the Bay Area Art Biennial, “The Beehive,” which will take place in the city from March 19 to March 21. Titled “In Praise of the Beehive,” the exhibition will feature many works by sixty-seven artists and will showcase the work of forty-two artists. Among the works on display are the works of Maren Hassinger, Billie Tsien, Alex Katz, Ruth Keyas", "The next Biennial should focus on “the value of design in the cultural and social life of the city,” said Kati White, chair of the board of trustees of the museum. “The next Voyageurs d’Arles will be a celebration of modern art, architecture, and design in the city, and will focus on the processes that shape and shape the world. We look forward to participating in the upcoming exhibition.”The biennial is slated to run from May 6 to May 23. The full list of pavilion sponsors is as follows:Artemisia Bicocca (Italy)Artemisia Bicocca (Italy)Artemisia Bicocca (Italy) Artemisia Bicocca (Italy)Filippo They-Cooper (Austria)Artemisia Bicocca (Italy) Artemisia Bicocca (Italy)Filippo They-Cooper (Austria)Bicocca Bicocca (Italy) Bicocca Bicocca (Italy)Bicocca Bicocca (Italy)Bicocca Bicocca (Italy)Bicocca B", "The next Biennial should be held at the Art Center of Hamilton in the autumn of 2019, and the next should be held in the spring of 2020. Sylvia Albergini, the president of the Hamilton Art Gallery, said: “While we are disappointed with the current state of our current exhibition, we believe that a new vision for the Art of the Biennial can be found in the future. We hope that this exhibition will serve as a model for the next one.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Elizabeth A. Larson as its new executive director. She will be responsible for overseeing the museum’s curatorial, research, and educational initiatives in an advisory capacity, and will take up her new post in September.“Elizabeth has had an instrumental role in shaping the MFA’s contemporary curatorial agenda for more than twenty years, and we are excited to see how she will continue to shape the museum’s future direction under her leadership,” said David Crockett, chair of the museum’s board of trustees. “Our mission is to organize, understand, and present the art of the twenty-first century, and Elizabeth brings an enviable", "The next Biennial should be hosted in the town of Klotenau, the home town of 16th-century master architect Ludwig von Frei, on September 9–10, 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has welcomed two new members to its board of trustees—Gillian Jacobs of the Pennsylvania Academy of Fine Arts and Daniel B. Larson of the Bicentennial Art Museum. The board also elected Deborah Fatshmayer—the nominee for the 2020 Nobel Peace Prize—as interim trustee.Jacobs will serve as interim board president until a new board of trustees is appointed. Fatshmayer will serve on the board until a new president is appointed.“As we approach the twenty-fifth anniversary of the Museum of Contemporary Art, we are committed to continually innovating and reimagining the Museum on a global scale,” said museum director Ming-Chi Ku. “We are very much looking forward to the next five years with an open mind and a sense of purpose. We are making progress, but not enough. We must continue to innovate and think critically about the future of our exhibitions and collections. We have a long way to go.”\n\n\nThe Metropolitan Museum of Art", "The next Biennial should be held at the new venue in 2021, but it will be a challenge to get the event under the projected budget of $10 million. The art-world contingent is currently organizing an exhibition of the work of renowned British sculptor Douglas Gordon at the venue.The event will be hosted by the New Museum in New York; the Tate in London; and the Tate’s London outpost. The second iteration of the biennial will run in London in 2022. A Dolce & Gabbana–sponsored edition of the event will be staged at the Royal Academy of Arts in London in 2025. \n\n\nThe National Portrait Gallery in Glasgow has received a gift of forty-three works by Edward Weston, whose images have appeared in more than seventy collections, including the Metropolitan Museum of Art, the Museum of Modern Art, and the Smithsonian American Art Museum. The donation includes paintings, sculptures, photographs, drawings, prints, photographs, documents, and sculptural works. The gift was made by John F. Kennedy, daughter of former US president John F. Kennedy. John F. Kennedy’s brother, Robert Kennedy, was named the new chairman of the museum in October. The announcement of the appointments was made to mark the anniversary", "The next Biennial should include a creative platform for the public to express their creativity through performances, performances, paintings, photography, sculpture, video, and other media, and should be an opportunity for us to learn from one another and cultivate a more integrated way of thinking about art.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed David L. Weiss, the former director of the Museum of Contemporary Art (MoCA), as its new chief curator and chief curator of contemporary art. Weiss is currently interim director of curatorial affairs at the Museum of Contemporary Art (MoCA), Los Angeles and will assume his responsibilities on January 9.“We are thrilled to welcome David to MoCA,” said David K. Miller, chair of the board of trustees, which represents the city of Los Angeles. “In his new role, he will have the opportunity to reshape the museum’s curatorial mission in the coming years and he will be a critical voice in shaping the museum’s future direction and artistic program.”Weiss has served as chief curator of contemporary art at the Museum of Contemporary Art, Los Angeles (MCA) since 2016, when it launched its new partnership with the Los Angeles County Museum", "The next Biennial should be held at least once a year, with a minimum of three exhibitions. The project is also working with the Tübingen-based architectural museum Architekturo Nippon Arti to create a new exhibition for the history of art. The institution is currently reviewing the proposal.The exhibition will focus on the history of Western art, with a particular reference to the influence of Italian artists in the twentieth-century. The exhibition is divided into several chapters based on themes such as philosophy, aesthetics, engineering, architecture, literature, and science. The exhibition will run from March 5 to May 2, 2020.\n\n\nThe École des Hautes Études (EH) in Paris announced today that Valentino Bicchiero has been appointed its new director of architecture and design. Bicchiero comes to the institution from the Pérez Artes in Venice, where he has served in a variety of roles, including director of the Pérez Artes from 2004 to 2007. He succeeds Michel de Capua, who retired following thirty-five years at the helm of the institution in January 2019.“The Pérez Artes was founded by architect Luis de la Peña, and for", "The next Biennial should be held in 2020. The 2019 iteration of the event, titled Art in Transition, held in London from April to October, concluded on October 29. The next iteration of the event, titled Art in Purity, will be held in 2021. \n\n\nThe National Gallery in London has appointed Jo Walton as its new director. She will be responsible for managing the collection and exhibition programs of the museum, which is currently undergoing a major expansion, and will assume her new responsibilities in February.Walton succeeds Tessa Jowell, who retired in February 2019 after eleven years at the helm of the institution. During her tenure, she increased its collection and output, expanded its education and outreach programs, and oversaw the creation of the exhibition program.Commenting on her appointment, Walton said: “I am thrilled to be leading the National Gallery into the next stage of its development as a global leader in contemporary art and architecture, and to work with the talented and dedicated team to develop and present the next generation of National Gallery exhibitions. With the National Gallery having over twenty years to grow our collection, I am confident that we will be able to sustain its exceptional exhibitions and exhibitions programs for many years to come.”Walton will assume her", "The next Biennial should be held sometime between June and August, 2022.\n\n\nThe Museum of Contemporary Art (MoCA), Chicago, has appointed Sarah Meyer, who currently serves as the permanent director of the institution, as its next president. Meyer has overseen the museum since 2013.“Sarah has been instrumental in transforming MoCA into a world-leading cultural institution,” said Brad Streb, chair of the board of trustees of the MoCA Foundation. “The museum’s history and legacy are built on her leadership, integrity, and innovation. She has been a champion of artists and the arts and has guided the institution through difficult times as a board vice chairman.”During her tenure, Meyer has organized numerous exhibitions that showcase the works of artists such as Robert Irwin and Ann Hebb across multiple venues, including her own home, the Museum of Contemporary Art, Chicago, and the Chicago Public Library, and has overseen the development of the Ronald Reagan Building (RTB), which houses the Ronald Reagan Presidential Museum, and the renovation of the Robert Rauschenberg Building, which houses the Museum of Modern Art.“I’m thrilled to accept this new role and am confident that she will continue to expand MoCA�", "The next Biennial should focus on the natural history of the world, and its relationship to the contemporary social and political situation\u0097examining the evolution of the concept of the 'natural heritage” in the context of the commemoration of the twentieth anniversary of the fall of the Berlin Wall.\n\n\nThe Museum of the City of New York (MoCA) has appointed Sarah Schroth, who previously served as director of the Brooklyn Museum, as its next director. In her new position, which is funded by the city, Schroth will assume her responsibilities as head of the institution's cultural arm beginning in January 2021.“Sarah is an accomplished leader who has demonstrated a commitment to artistic excellence, strategic vision, and a clear understanding of the power of collaboration to shape and shape cultural policy,” said MoCA president Daniel H. Weiss. “A thinker and an organizer, she understands the transformative potential of artistic engagement and understands the unique role of museums in the city and the country.”Schroth joined the museum in 2016 as its deputy director of development and acquisitions. She replaces Adam D. Weinberg, who departed after a decade to head the Metropolitan Museum of Art in New York in July 2019. The role of director was created after Wein", "The next Biennial should be held in 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a gift of 200 works of art from the collection of the late Lillian Finkelpearl. The donation consists of works by nine different artists and is valued at $8 million.The donation is part of a gift package that was presented to LACMA in 2017 by the Leche League, which was cofounded by the late French sculptor Jean-Luc Prouvé. Prouvé had formed the following partnership with LACMA in the late 1970s: LACMA and the Leche League.In 2001, LACMA received a $10 million donation from the Leche League, which was also a gift from the Duchampian family. In 2002, LACMA received another $10 million from Leche League, this time from the Glas family. In 2006, LACMA received a $10 million gift from the Glas family.In 2018, LACMA received a gift of some 150 works from the Duchampian collection. The gift was made in celebration of the twenty-fifth anniversary of the partnership.\n\n\nThe Müllem Museum in D", "The next Biennial should be held in 2020, and the first at the Barbican in 2021. The Biennial will also introduce a new program of exhibitions, residencies, and other programming that will test the new generation of artists and institutions. The announcement follows the announcement of a new prize for artists and the launch of the Biennial Experience program, a biennial exhibition on the theme of Art + Design.The Biennial Experience program will be hosted by Hamish Anderson, Wangechi Mutu, Karl Lagerfeld, Mary-Kate and Ashley Olsen, Larry Achiampong, and other luminaries. The event will be curated by Dusan Glimcher and will run from March 4–March 8. The first edition of the Biennial Experience was held in London in December 2019. The second edition, which was organized in Dusseldorf, Germany, in September 2020. The 2020 edition of the Biennial Experience will be staged at the Olympic Stadium in Rio de Janeiro from November 22–November 29.\n\n\nThe Museum of Contemporary Art (MoCA) in San Francisco is planning to remove nine pieces of former warehouse space in the city’s Mission District, a former manufacturing and", "The next Biennial should see its first show of work by an American artist since William Kentridge. The exposition is currently a virtual event. The exhibition will include work by thirty-four artists, including Stanley Donwood, Isamu Noguchi, Jean-Michel Basquiat, and Danielle Steel.\n\n\nThe École des Hautes Études (the Haves) in Paris has launched a new digital platform that will allow visitors to see works by artists from around the world. Titled Last Show, the platform will display three works at a time, with the first showing on March 7.Visitors to the Ecole des Hautes Études’s Last Show, a new project organized by the Paris-based artist Stephane Kallot, will have the opportunity to see work by forty-eight artists, including Kazimir Malevich, Minimalism, and Svetlana Vysh, as well as by Peter and Paul Mpagi Sepuya and Douglas Murray, among others, in a single day.  Last Show will be available from March 9 to 16. The site will also host an online version of the exhibition, which will be hosted by", "The next Biennial should be held in the Seirawanah National Park, near Kiliwuru, in the west of the country. The 2020 edition will be held at the National Museum of Fine Arts in Bangkok, and will feature works by twenty-three artists, including Seriwan, Kip Thiong, Nimjung, Yantraso, and Vyasa Hujaptan. The 2017 event will feature works by twenty-three artists, including Baniya, Bompongsong, Sijawong, and Uusi. The inaugural Art Biennale in Thailand was co-organized by the National Museum of Fine Arts in Bangkok and the Bangkok Art Museum. The ten-day event will be held at Ratchaburi Station, Bangkok, from January 19 to January 20. The inaugural Art Biennale will also feature a selection of works by artists from Cambodia, Vietnam, and Laos.  Art and Design by Morten Paulsen (2018) The Icelandic artist, painter, and sculptor, who has lived and worked in Iceland since 1980, died last year at the age of seventy-four.Born in Reykjavík, Sweden, in 1942, Paulsen has", "The next Biennial should be held in 2021. \n\n\nThe French Federal Office for Culture and Sport (CACAF) announced today the list of seventy artists who will appear in the upcoming edition of the biennial, which will be held in Marrakech, Morocco, from March 19 to March 21. In an open letter addressed to Basel Abbas, the executive director of CACAF, the artists cited the Paris-based art fair, the Montparnasse Museum of Art in Paris, the Biennial de Lyon, and the Montparnasse Festival as key events in their negotiations with the agency.“The event will aim to improve the Spanish-Moroccan visual arts in a way which optimizes the mutual respect and cooperation between the countries, and which will enhance the spirit of the Madrid-based festival, the Barcelona Art Festival, the 2019 Venice Biennale, and the 2019 Venice City Triennale,” the letter reads.The artists will be selected from a shortlist composed by the organizers of the first edition of the biennial, which will be held in Marrakech from March 17 to March 21, 2019. The second edition of the event, which will be held in Marrakech from March 17 to March", "The next Biennial should be held in 2021. \n\n\nThe Center for Contemporary Art (CCA) in New York has appointed Tonya Pup, who currently serves as the curator of contemporary art in the United States, as its next executive director. Pup will take up the reins from Marc Straus, who has led the museum since 2018.“Tonya is a gifted and committed curator who has built her own reputation on the strength of her ability to bring truly groundbreaking exhibitions to share and organize,” said David Karp, the director of the Museum of Modern Art. “Her work has been featured in the Whitney Biennial, the Venice Biennale, the AsiaCAFA, Black Tie, and the Berlin Biennale. Her curatorial practice includes exhibitions such as ‘Avant Garde: The Art of Alie Strolla’s first solo exhibition in New York in 2007 and ‘Anarchy in the City: Contemporary Art from the Late 1960s to the Present,” which were presented at the Museum of Modern Art in 2012.Pup’s new role will come on the heels of a major expansion project, which will transport the museum’s collection to its new home in a", "The next Biennial should take place at the Museum of Modern Art in New York in 2021, and the 2021 edition will be the first in the city. The exhibition will be based on the artist’s “Screens of Life” series, a series of works that cover a wide range of themes, including the history of vision, the nature of art, and the geometry of our world. The 2019 exhibition was staged at the Museum of Modern Art in New York and at the Tate in London.  In the following years, the museum will stage shows dedicated to Anna Atkins, Josef Küng, and Mark Seroussi, and will present a retrospective of British artist Michael White’s work, “The Inner Lamp,” in 2021. The 2019 exhibition, “The Process of Creation” (2015–16), lasted twelve days and featured work by forty-seven artists.\n\n\nThe Ohio State University (OSU) in Columbus is planning to establish a new $1 million endowment fund to honor the personal and institutional accomplishments of Ohio state workers. The endowed funds will provide funds to commemorate the achievements of workers who have made outstanding contributions to their own or other organizations\u0097from art conservators to teachers", "The next Biennial should focus on “The light that comes from the sky,” the artist said. “I expect that the first year will be a critical one, since it will include a large-scale installation. The next year will be a year of experimentation, of new approaches and approaches that will reflect a new sense of wonder. The next year will be the year of growth.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Alana Richer as its new executive director. Richer comes to the institution from the Metropolitan Museum of Art, where she has served as deputy director since 2017. She succeeds Nancy Panetta, who stepped down after a year as director in July 2019.“Alana brings an extraordinary breadth of experience and knowledge to MoMA,” said Peter L. Goldman, the museum’s director. “Her leadership of the Met and her international work in cultural exchange have been instrumental in establishing MoMA’s position as a global leader in modern and contemporary art. We are proud to have her at MoMA.”Prior to joining MoMA in 2018, Richer worked as an independent curator and taught at the University of Pennsylvania, the University of California", "The next Biennial should be in 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to delay the opening of its new exhibition “The Holographic Museum,” which is currently on view until April 13, 2020, by a year. The decision was made after it received a proposal from the city, which asked for a two- to three-year extension for the installation, which is part of the Los Angeles Architecture Biennial. “We felt it was very important to wait to open to see what the city has in store for us, and to consider all our options,” said Pia Pedrosi, the new director of MoCA. “This is a great opportunity to see our work in person and to experience it in a new way. We will continue to listen and consider what the community has to say and we will continue to innovate to meet the needs of our visitors and staff.”The new exhibition, titled “NIRIN,” will feature six works by artists from the New Eastern and New Eastern Realms. The show will also feature works by artists from the New South and New South China, the New South America, and the New South Africa. The opening", "The next Biennial should focus on the artist-influenced conceptualism that comes with its playful juxtaposition of contemporary art and its roots in a creative, dreamlike world. We cannot, we say, but hope, that by shedding light on the contemporary art of our age, the next Biennial will be a reminder of the water, the air, the trees, the earth, and the other—a reminder that we are living, breathing, breathing worlds. We hope that our biennial will be a space for reflection and collaboration, for reflection and dancing, for reflection and singing, for reflection and dancing, for reflection and singing. We hope that our biennial will be a moment of celebration and healing. We hope that our biennial will be a time to honor those who have made the world a better place through art and through their efforts. We hope that our biennial will be a time to reflect and reflect on our place in the world. We hope that our biennial will be a time for reflection and reflection on the rest of life. We hope that our biennial will be a time for reflection and reflection on the world. We hope that our biennial will be a time for reflection and reflection on the rest of life. We hope that our", "The next Biennial should be held in 2022. Arts institutions in the United Kingdom will also be invited to submit works for the first edition, which will be held at the Royal Academy of Arts (RA) in London in 2021. The event will be hosted by the RA, which will also stage the inaugural exhibition. The 2019 edition, titled The Inner Life of Man, was held at the Cambridge Art Gallery. The inaugural exhibition, titled All That We Are, will be on view from January 18 to March 15. The Edinburgh Triennale, which will also feature a reimagined version of the Scottish National Gallery, will take place at the Edinburgh Art Museum from March 29 to March 31. Artist-run spaces across the UK have called for the government to intervene in the global climate crisis to help mitigate the damage that climate change is doing to the planet. From January 1, 2020, the government will establish a fund to mitigate carbon emissions from existing businesses and existing power plants. The fund will be administered by an arm of the UK’s Department for Business, Energy and Industrial Strategy (BEIS), which will take a $5 billion cut from the £7.5 trillion set aside for climate change. The policy is", "The next Biennial should be held in 2020. “The exhibition is so important to the biennial, for it represents the diversity of work being presented in the exhibition, and serves as a model for the exhibition,” said director Hao Jinghua. \n\n\nThe National Gallery of Ireland has commissioned artist Nai Wei to create a new work for its forthcoming exhibition “Beyond the Frame,” which will open in London on May 14 and run through September 21. Wei’s installation, which is inspired by the construction of a fence around the National Museum of Ireland in Dublin to keep visitors in and out, incorporates multiple works from the exhibition, including a performance that involves the installation of a photochemical reaction that involves the formation of carbon nanotubes, and a sculpture that involves the stacking of six carbon nanotubes.In the exhibition, which includes works by all sixteen artists represented in the exhibition, Wei will create a work which is “outside the frame of the artist’s body.” The work will be based in a field called ‘optics’ and will be created with the help of a team of artists led by artist Jon McAllister.“This exhibition is a reflection of the growing interest", "The next Biennial should take place in 2021, the biennial’s 2020 edition being held at the location of its creators, the Museo de Arte Contemporáneo Brasileiros, in São Paulo, Brazil. The exhibition will be part of the publisher’s fifty-year history. The exhibition will be hosted by the Museo Arte de São Paulo (MASP) and will be curated by Jovanka Fritsch and Celine Sirois. The conference will take place at several locations in São Paulo, including the archives of the Institute of Modern Art (IM), the Museo de Arte de São Paulo (MaASP), and the Museo de Arte de São Paulo (MASP). \n\n\nThe Kochi-based art collective National Gallery of Art in New Delhi is planning to break ground next month on a new digital art museum that will serve as a platform for the work of emerging and established artists in India. The institution will also have a membership-based program, which will offer gallery-level exhibitions such as the opening of the gallery for artist Rupak Chopra’s exhibition “Aiding the Artist” at the National Gallery", "The next Biennial should be set in 2020 and will organize a number of events in collaboration with the City of Milan over the course of three years. The theme of the 2020 edition is “Love and the Uses of Objects,” reflecting both the theme of the preceding exhibition, “Love and the Arts,” which opened in 1992 and has been staged every year since 1994.The Art of the Future, which is scheduled to run from March 17 to March 20, 2020, was awarded a 2018 National Award for Excellence in Art and Design. Other biennials in the United States that have been nominated for the award include “Art of the Future 2020” and “UCLA Art of the Future” (both 2019).The judging of the Biennial was overseen by the artist-in-residence, Nanda D. Alamoudy, who will serve as the inaugural curator and whose work will also be featured in the exhibition, “As We Grew Up: Contemporary Art from the 1980s to the Present.” The exhibition will include works by more than fifty artists from twenty-six countries and feature new works by artists who have been selected for the 2019 edition, which will be held in the United Kingdom from", "The next Biennial should be held in 2020, and the first one in 2021. The Biennial of Contemporary Art will be held in the United States in 2022. The 2019 event was organized by the Fine Arts Museums of San Francisco and featured works by artists such as Robert Irwin, Claude Monet, Knopf, and David Salle. The 2020 event is comprising of some forty artists, including Sebastian Faull, Paul Gauguin, and Pablo Picasso. The event will feature an exhibition of works by artists from the second half of the twentieth century, with the first exhibition taking place in 2018. The 2019 edition of the Biennial featured eighty-eight works, including fifty-two works made before the Second World War and fifty-four works by artists who were working in the 1960s.\n\n\nThe Santa Monica Museum of Art (SMA) in California’s Venice district has received a gift of thirty-one works by the late American sculptor Richard Anuszkiewicz, a collection valued at $3 billion. The donation includes two works by artist-in-residence William Gibson (1904–1989), a bronze sculpture by the late Indian artist K.S", "The next Biennial should be the twenty-eighth and will take place at the end of March. In the meantime, the biennial will continue as planned, with the same program of exhibitions, lectures, performances, performances, presentations, projects, exhibitions, and performances that the previous editions have organized. As usual, the tenor-poet will be Andrea Giunta, who has served as the forum for two Biennial editions—both of which were held at the Museo da Arte Contemporáneo in Lisbon in 2016 and the African Museum in Johannesburg in 2020—with Helen Overy as executive director.Giunta’s inaugural edition, entitled Juros Biennale, was staged at the Stedelijk Museum in Amsterdam in January 2019 and featured works by twenty-eight artists and was nominated for a 2018 MoMA in New York. Giunta’s second edition, entitled Strahd Peiffer: Biennales, premiered at the Museum of Modern Art in New York in March 2019. It was selected for a 2019 Whitney Biennial, which was held in Seoul in November, and was included in the 2018 Guggenheim Biennial in New York. In the past", "The next Biennial should take place in the spring of 2021. The 2019 series, “Homage to the Strange: Art in the Age of Mechanical Reproduction” was staged at the Jewish Museum in New York. The exhibition focused on the construction of performances, recreations, drawings, paintings, and sculptures made of organic materials, often from materials that were scarce. The biennial will also feature new works by artists who have been excluded from the past biennial, including Nari Ward and Elizabeth Peyton. The work of Auguste Rodin, the American painter best known for his multi-hundred-foot-tall, spherical aviaries, will be included in the biennial’s exhibition “The Office of the Art Dealer” (2019). The exhibition will also be held at the Museum of Modern Art in New York in the spring of 2021.In its future two-year plan, the museum says it will continue to present exhibitions and events in collaboration with artists, engaging them in a wide range of activities, including the exhibition of a new collection of Rodin works in March 2020.The Museum of Modern Art has also announced that it will stage a “new retrospective of the artist’s work in March 2020", "The next Biennial should be held in 2022.\n\n\nThe National Museum of Art in Washington, DC, has received a gift of eleven works by artist and educator Dorothea Rockne, whose vibrant, often humorous, images and performance are as rich and relevant today as they were when they were made in the 1930s. Known for her electrifying solo performances, which often incorporate puppets, live musical performances, and songs, Rockne often used her work to highlight the critical role that art can play in achieving social change.“Rockne’s art is a strong reminder that our culture and art can transform lives,” said Kenneth Feinberg, director and CEO of the National Museum of Art. “It is a powerful reminder that culture and art are essential to the future well-being of our nation and the world. Pop art, as well as the critical work of art historians such as Joseph Goebbels and Alfred Stieglitz, highlight the importance of art in shaping cultural history and demonstrating that art can transform the world.”Born in Brooklyn in 1940, Rockne moved to her parents’s home state in the 1960s. Her mother took her to see Firo Sassoon’s The Joy of", "The next Biennial should be held sometime in the first half of 2020, according to a statement from the artist-run group. “The museum is evolving and will continue to evolve with ever-changing needs and needs of the museum. In this regard, the museum is a living organism. The curator, filmmaker, and artist representing the museum are always looking for ways to support the museum.”\n\n\nThe nineteenth edition of the Biennial de Lyon, curated by Belgian curator Volker Breguet, has announced that the event will now be held in the French capital from February 21 to March 16, 2020. The show, which was presented by Breguet at an award ceremony at the Zon’s 14th Biennial in Paris last month, will take place at the  Ministère National d’Arles in Paris and will be hosted by Jean-Jacques Annaud, the director of the Arts and Culture, and Yvonne Bénétière, the director of the Institute of Contemporary Art Paris.“The cultural exchange of Lyon and Brussels in the modern European era is high and the pavilion is the most spectacular in Europe,” said Breguet, who most recently served", "The next Biennial should be ready by the summer of 2020.” The announcement marked the first time the museum would acknowledge its existence outside of a statement issued by the institution in 2014. The museum’s board chair, Bertram de Velde, said: “It’s a historic step for the museum, and the next Biennial will be enjoyed by all, through an artistic generation that has laid the groundwork for new generations of contemporary art,” adding that the museum will remain open as long as necessary to “provide a platform for research and for the promotion of art.”\n\n\nThe Pennsylvania Academy of the Fine Arts (PAFA) is planning to shutter its doors permanently in early 2021 to prepare for the construction of a new house of worship in the city. The museum, which was founded in 1958 by a group of business and industry leaders in order to attract and retain visitors to Philadelphia, has faced significant financial losses as a result of the pandemic.“We are working now to assess the financial impact of the pandemic on our institution and how best to strengthen our exhibitions, programs, and educational programs,” said director David Pradel. “Given the severity of the current crisis, PAFA", "The next Biennial should take place in the second half of 2020, when the exhibition will reopen to the public for the first time since it was closed for two years due to the Covid-19 pandemic.“I want to emphasize that the project of the Museum of Contemporary Art Argentina is not over, and that it will continue to exist for the benefit of Argentine artists and for the development of the contemporary art of Argentina,” curator María Álvarez Miral, who curated the exhibition, told Artnet News.The exhibition will also receive funding from the Los Angeles County Museum of Art and the Santa Monica Museum of Art. According to the Los Angeles Times, the money will go to cover lost revenue from the closure of the institution, which was forced to lay off 120 employees when it shut down in March. The museum also received $1.25 million from the financial firm Gensler; the Los Angeles County Museum of Art and the San Diego Museum of Art were awarded $1 million, and the Museum of Modern Art in New York received $750,000.The Biennial was created in response to a $6 billion federal loan program that was enacted in 2018. The program created ten new nonprofit entity, called biennial projects, that", "The next Biennial should be in December 2020. However, the organizers of the upcoming edition of Art Basel Hong Kong are currently working on a way forward which will likely see the exhibition take place in December 2021. The exhibition will also be held in February 2022.\n\n\nAs the first major retrospective of the work of American artist Irving Penn, titled “The Fluorescent Gaze” (2017), opened at the Barbican on Tuesday, February 20, at the same time as the second edition of the Tate Britain initiative, “The Earthquake of Creation” (2019), at the same venue. Quarterly exhibitions of work by twenty-six other artists are also currently on view.Penn’s colorful, surreal and drawing-based sculptures, which are often centered on the act of drawing, often appear in settings such as the artist’s own apartment, where he lives in a tony, five-story, Tudor-style house in the exclusive Park Avenue community of East Hampton, and take up the theme of a sickness that has taken hold of him, a sickness that has spread to his family and others he works with.His art has been collected by numerous museum collections. The Elizabeth Crofts Museum of Art in London has", "The next Biennial should be held in 2021.\n\n\nThe Hong Kong-born, New York–based artist Mary McAleese, whose drawings and sculptures engage with the conceptual dimensions of human experience, is being sued by the Chinese government for alleged copyright infringement.The artist is currently facing a case in China for allegedly infringing on a work by Zhang Daqian, which was already featured in the exhibition “Meshed: Painting in the Age of Qin” (2016) at the Art Institute of Chicago. The fair was also criticized for excluding Chinese artists from the show.In a complaint filed by the Beijing Public Security Bureau (BPSB), the Beijing office of the National People’s Congress, the artist was accused of infringing on the artworks’ copyright by “designing a popular and highly-visible structure that cannot be distinguished from the surrounding landscape,” the Beijing Times reports. After serving a two-month sentence in a Beijing prison, the artist was reportedly given a suspended sentence of one year and fined 500,000 yuan ($68,000) in March. Related to the Beijing art fairs, the artist was also banned from entering the mainland.Although Beijing authorities have yet to file criminal charges against the artist, the", "The next Biennial should focus on social movements and the influence of mass media in shaping public awareness of social issues, the festival’s executive director, Gaëtan O’Leary, said. For the past three years, the biennial has focused on rethinking the history of the exhibition and on the exhibition’s future. The 2019 edition will take place at the Museum of Contemporary Art (MoCA), Boston. The biennial was established in 1989 by artist-in-residence Bernard Miller, who went on to receive a MacArthur Fellowship and in 1998 was awarded the Presidential Medal of Freedom.The biennial will be hosted at the museum from April 6 to April 13, 2020. The biennial will have two additional years of curating and programming under its collective name. The first edition will be held in the summer of 2020, and the second edition in the fall of 2020. The 2019 edition, titled “Feminine” (October 2020 to November 2020), featured works by fifty-two artists.\n\n\nThe Museum of Modern Art (MoMA) in New York is considering moving the exhibition “The Human Box,” a series of photographs by Robert Irwin, and its other major art auctions to a different institution. According"]