["The next Biennial should be held in 2022.  Posted by: Claudia Catellani, June 11, 2015Source: Artforum June 4, 2015(Visited 423 times, 1 visits today)This article originally appeared in the June 2018 issue of Artforum.\n\n\nThe Fine Arts Museums of the United Kingdom (Families Museums) have asked the Department of Culture, Media and Sport (Dacre Ponds) to open a new £2 billion fund aimed at supporting cultural groups impacted by the coronavirus. The funding initiative, which is being organized as part of a £1.1 trillion package, is being spearheaded by the United Kingdom’s National Lottery Museum, which is seeking £1.2 billion for its expansion, and the National Galleries of Scotland, which is seeking £988 million for its expansion.The fund, which will be managed by the British Alliance for Fair Trade, will be offered a variety of funding options, including direct grants for small and medium-sized businesses, and will focus on two themes: 1. The future of the UK’s economy and culture, and 2. The role of museums.The move follows a series of announcements made by the", "The next Biennial should be held in 2022. The previous iteration, which was hosted in 2002, was designed by the French artist Yves Behar. \n A memorial honoring the ten members of the Gallery of Modern Art’s staff who were murdered in New York City will be unveiled at the museum next week. The twenty-fifth edition, titled “Fuck the Future,” was staged at the gallery’s New York outpost, the Gallery of Modern, on February 18, 2019. It was slated to run for a six-week period, from February 19 to February 22, 2020. The performance, which was organized by a group called the Modern Dance Theater, was supposed to be a celebration of the work of the artists who were killed, including Maren Hassinger, Vanessa Ise, and Audre Lord’s work, entitled Art and the Future, which was set to open on February 13, 2020.“In honor of the tenacity of our staff to push forward with the work of our predecessors, to celebrate the subjects of the exhibition,” said Gary Goldman, director of the Biennial. “We are sad to announce that the creators of Art and the Future, which included works by artists", "The next Biennial should be held in the autumn of 2020. The first edition of the event, titled “Doppelgängers,” was inaugurated at the San Francisco Museum of Modern Art in January 2018 and drew a total of 4,000 visitors. The 2020 edition will be held at the Sfeir-Semler in Berlin.\n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $50,000 donation from the City of Los Angeles. The donation, which is the largest gift made by the city this year, comes in addition to funds LAUSD received from voters in November 2019. The $50,000 is also the largest amount the museum has ever raised in its current form.“The money is very significant to us,” said Los Angeles County Supervisor Mark Ridley. “The LAUSD board has been working hard to move forward with an ambitious plan that will provide immediate relief to our teachers and staff, and create the conditions for long-term economic recovery. We’re working diligently with our board of directors and staff to make sure we get this done, and we’re hopeful that this will be a decisive step in our plan to reclassify the institution as a", "The next Biennial should be held in 2021, but is not expected to be held until at least 2023.\n\n\nSpanish artist and teacher, Carlos Pujol, whose career encompassed literature, architecture, film, sculpture, play, and video games, died of cancer in Madrid on Friday. He was seventy-one years old.Born in Santo Domingo, Spain, in 1941, Pujol studied under the avant-garde avant-garde in the Periphery, where he met and befriended Juan Luis, a fellow student from the Periphery school, whom he married in 1957. After graduating from the Periphery Junior High School, they moved to Barcelona, where they began working together with the Periphery collective. In a 1962–63 retrospective at the Baselart in Switzerland, the artist’s siblings Jorge and Juan Luis took the opportunity to honor their father.Titled Avant-Galleries: Carlos Pujol, the show featured works by twenty-two of Pujol’s fourteen siblings, the artists Jorge Pujol, Nuria Pujol, Lourdes Pujol, and the late Arseny Anagnos. It also included works", "The next Biennial should take place in 2022, and the last four years of the twenty-first century should be devoted to exploring the meaning of art in the twenty-first century. We are hopeful that next year will also be an opportunity to confront the fundamental questions that are at the root of the difficulties and tensions that currently beset our world: Are we aware of the historical lessons that we are teaching our children? And, most importantly, are we educating them in the ways that are in harmony with the future that we want for them and for the world?” \n\n\nThe Santander-based nonprofit CúTV has announced that it is expanding its programming in order to address growing concerns over the depiction of sexual violence in its television productions. The company’s board of directors said that it hopes the move will “prohibit certain harmful and degrading content in future programming.”“We hope that by providing more transparency and by providing a platform for artists and organizations to engage the public, we can work together to ensure that all programmes still reach a wide and diverse audience,” board president Ferran Santander said. “The more artists can communicate directly with the people, the better. And the more we can all support one", "The next Biennial should be held at least once a year. We are also considering creating new opportunities for the public to learn more about the contemporary art world, focusing on the contemporary art of the African diaspora. We hope that the new platform will become an important tool for the discussion of contemporary art in Ghana. \n\n\nThe City of Los Angeles announced today that it has received a $10 million donation from the estate of the late American painter Charles A. Birnbaum. The gift includes $6.5 million for the city’s arts and culture department, and $3 million for the cultural nonprofit Center for Creative Innovation (CCI).“The gift was made in recognition of the City’s commitment to supporting the arts and cultural sector,” said Cynthia Chen, director of the city’s Cultural Affairs Department. “Birnbaum’s vision to create an arts and culture ecosystem that connects people, places and things in Los Angeles has provided an ideal vehicle to support the city’s arts and culture.”The support comes on the heels of a $10 million gift from the estate of the late American artist Harvey Jordan, who passed away on May 3 at the", "The next Biennial should take place in the spring of 2021.  In June 2019, the museum received a grant of $5.8 million from the Frederick K. and Mary Talbot Foundation to develop a new collection of the artist’s works.The institution is also considering revamping its existing collection, which is currently housed in a former Woolworth’s warehouse in the city of Brighton, England, by adding more than four hundred works by artists and collectives from Africa, Asia, and the Americas.   The renovation of the building, which is partially occupied by the museum, is expected to cost around $8 million. The institution is also currently working on revamping the grounds of the museum. In addition to extending the seating area and adding more galleries, the renovation will also add more exhibition spaces, a café, and a library. The redevelopment of the museum is part of the project to create a new exhibition space in the former Woolworth’s warehouse, which is currently being constructed by the architects Herzog & de Meuron, and is part of a global campaign to save the Tate. The Tate’s board chair, Lesli Linka, called the renovation a “game changer.", "The next Biennial should be on the next iteration of the sculpture-world calendar, which is currently slated to run from March 21 to March 22, 2020. The artist’s next work, which is currently on view in the exhibition “Aqua,” will be on view in the event’s third iteration in September.\n\n\nCoca-Cola Bottling Co. is planning to open a new $1 billion bottling plant in the Bahamas next week. The new plant will be built in the city of Bahia, in the west of the country, and will produce around eight million cases of Coca-Cola a day. The facility will also have a research and development department that will analyze the scientific, technical, and economic opportunities that a bottling plant would provide to the global marketplace.“Coca-Cola’s commitment to our customers in the Bahamas is strong, and we are confident that this new facility will give our employees and the local community the opportunity to enjoy the beverage of the Caribbean Islands for many years to come,” said Martin Molen, president and CEO of the company.Coca-Cola Bottling is the latest company to announce plans to open a bottling plant in the country. Earlier this", "The next Biennial should be held in the spring of 2024. All of Art Romania was established by Romanian architect and writer Victor Leonidee in 1988 as a forum for the discussion of contemporary art from the Eastern Bloc, and the institution became a member of the European Union in 1995. Leonidee was commissioned to create a new exhibition of work related to his new movement, Art II, in 1977, and the exhibition was staged at the TU Düsseldorf in 1987. The program was expanded in 1987 with a retrospective of work by Romanian artists Felix Mager (2001) and Constantin Kudelsky (2009). In 2012, the institution hosted a retrospective of works by the acclaimed Romanian art historian Elinara Saitou-Makare (2015), and its inaugural exhibition section, “PRESS,” was a joint project of the TU Düsseldorf, the Museum of Modern Art in Rome, and the Fondazione Cinà Grazie.\n\n\nSam Rayburn, the British-born American artist known for creating works that challenge the structure and appearance of art and offer alternative narratives of human experience,”", "The next Biennial should be held at the new facility, which will be inaugurated by the refurbishment of the former National Gallery of Art (NPG) in Washington, DC, in April 2020. \n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Sarah Sze as its new deputy director of curatorial affairs and international partnerships, effective immediately. Sze will assume her responsibilities on June 18.“Sarah Sze is an ideal candidate to lead the Guggenheim’s diverse collection and programs,” said Robert S. McNamara, the institution’s director. “A curator of recent and contemporary art, she has the experience and the ability to develop and guide the Guggenheim’s exhibition programs in a way that ensures the Guggenheim’s artistic output aligns with our audiences.”Sze will succeed Susan Simon, who will retire in December. She succeeds Susanne Vielmetter, who has been with the institution for twelve years and will be succeeded by Sheri Lavigne, who will take up her new post in January. Sze will begin her tenure with the Guggenheim when the institution reopens in March.“Sarah", "The next Biennial should take place in 2020.\n\n\nThe New International Center for Art and Design (NewCIAD) in New York has received a $50 million gift from the New York philanthropists the Richard and Lucille Loeb Family Foundation. The donation includes the construction of a new $200 million home for the museum, which was established by the Loebs in 1997 and has recently been undergoing a $1.2 billion expansion.The gift is made in support of the museum’s new $1.5 million Bridgman-Bickel Fund for Art and Design, which will provide funding for the construction and renovation of the museum’s current building. The museum was awarded $20 million for its first campaign, which was launched in 2017 and is still ongoing. The museum is also working to improve its exterior appearance and interior spaces, which are undergoing a $500 million renovation, and has created new opportunities for new scholarship and educational programming.\n\n\nAndré Breton, famed French sculptor who founded the Rembrandt-Staltenade style in the 1960s, has died at age eighty-seven. The work is considered one of Breton’s greatest achievements and is often classified by critics as a “", "The next Biennial should be announced by March 14. \n\n\nThe Venice Biennale has awarded the French artist Wilfried Klaas a Bursar-en-Mayelah (BA) award for his work Saul Alès: The Unseen. The honor was presented to the artist, who has been commissioned to create a new work for the exhibition for the second edition of the bidding war, which opens March 22–March 26 in Salzburg, Austria.“Saul Alès: The Unseen’s sculpture depicts the confrontation of two men, Alès and Helga, in a small desert gallery, which was built in the desert, in a desert setting, in a desert village, in a desert town, in a desert city, in a desert town, in a desert city, in a desert town, in a desert town, in a desert city, in a desert town, in a desert city, in a desert town, in a desert town, in a desert town, in a desert town, in a desert city, in a desert town, in a desert town, in a desert town, in a desert city, in a desert town, in a desert town, in a desert", "The next Biennial should take place in the summer of 2021 and will consist of twelve groups of artists, whose works will be arranged in chronological order, and will focus on the human experience through the medium of art.The fifty-sixth edition of the Bilderberger Biennial will be held on June 5–6, 2022 and will be held in the Modern Studio in Munich. The event will be curated by Wolfgang Pfeifer and will consist of an exhibition of works by women and non-binary artists. The theme for the exhibition will be “Avant-garde and modernism: the period between 1936 and 1959,” and will be “Human reality and the environment.” The exhibition will feature works by sixty-six artists and will pay tribute to the biennial’s founding sponsor, the German state of Bavaria. In an interview with the Art Newspaper, Pfeifer said: “It’s a very special moment to celebrate the seventy-fifth anniversary of the Biennale in Munich, and also to be part of building a future for the exhibition in Munich.” The exhibition’s inaugural Venice biennial, in 1972, was held in the city of Venice, and its inaugural Berlin", "The next Biennial should take place at the Museo de Arte Contemporáneo in Madrid in 2022 and the third at the Museo del Prado in Madrid in 2023. The new event, titled The Future Is Present, will feature new work by twenty-four artists and will be presented by the Swiss curator Marc-Olivier Gaillard.\n\n\nThe Metropolitan Museum of Art (MoA) in New York is planning to return the works of the late American conceptual artist H. L. Menken, who coded the first version of the John D. and Catherine T. MacArthur Foundation (MACF) skyscraper in New York, which opened to the public in 1971, to the public for free, according to Artnet. The library also plans to donate twenty-six works, including The Dreamer and the Screamer, The Fruit of One Tree, The City of New York, and The Moon Is a Harsh Mistress.The works will be accessible through the museum’s public digital archiving service, which will house the works on-site. The service will also host additional works by Menken and many other artists in the future, when the museum is repurposed into a research center", "The next Biennial should be held in 2020. For the Médecins des Beaux-Arts’ next exhibition, which will be staged at the museum, there will be a new selection of works by the late sculptor Jean‐Michel Basquiat, which will be staged at the Louvre until 2021.\n\n\nThe National Museum of Fine Arts (MoFA) in Atlanta announced today that it will remain closed for a third consecutive year, in an attempt to reduce its carbon footprint and combat climate change. The institution has been working since March 16 on a series of efficiency improvements, including installing more efficient cooling systems, increasing the amount of sunlight that enters the museum’s exhibition-viewing galleries, and installing more efficient lighting.“We have been working to reduce our impact on the environment and our impact on climate change for more than three years, and this latest round of efficiency work is a critical step in becoming a net exporter of art and culture,” said Jordan Wolfe, executive director of MoFA. “At the same time, we are taking a hard look at how we can better share the collections and experiences of our distinguished artists and find ways to make their work more accessible and to help them get back into their", "The next Biennial should be held in the spring of 2021. The construction and execution of the event will be overseen by artist-activists Nasser Araeen and Mohamed AbdelKarim, who will work with the construction and performance team of the Abu Dhabi pavilion to present a combination of Live Art and Architecture, creating a platform for the installation of works by international artists.The exhibition will be organized as follows: From Chair to Table: The Art of Live Art, with Nasser Araeen and Mohamed AbdelKarim. The twenty-third edition of Live Art was launched in Abu Dhabi in March 2019 and was first presented at the Abu Dhabi Institute of Art in June 2020. The event was inspired by the opening of the new exhibition “In Praise of Art” at the Grand Mosque in Dubai in 2015, and was co-organized by artist Nima Noman, director of the Abu Dhabi Arts Centre, and Abu Dhabi’s arts director, Amira Abdurraqib.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has appointed Steven Schoonmaker as the next commissioner of the Metropolitan Museum of Art, which has a permanent collection of more than 4,500 works by over sixty artists. Schoon", "The next Biennial should have the same programming as the last, including the exhibition of the work of the artist who is the subject of the exhibition; and will be hosted in the same space. We hope that the future Biennial will be of the same quality as the last, will be of the same spirit, and will be open to all. We will continue to work to make the Biennial the center for the exploration of “the most important visual and artistic issues of our time,” and to find ways to integrate the work of many artists into one event. The first Biennial will take place in 2019 and will be hosted by the Bergen Gallery in Oslo, the Musée d’Orsay in Paris, and the Künstlerhaus in Vienna. The second biennial will take place in 2021 and will follow the same format as the first, but will include a different selection of works. The 2019 Biennial will have the works of thirty artists, including Alighiero Bocchino, Filippo Canepa, Gregorio De Sousa, Marko Kloos, and Gisèle Klimt, and will have the theme “What is art?", "The next Biennial should be held in 2020, to coincide with the 50th anniversary of the museum. Its theme will also be “Theoretical Feminist Criticism” and will initially be “pioneering new approaches to feminist theory.” The full list of participating artists is as follows:ArtangelsFrieda Gritsch, Germany-based artist and curatorAmanda Paul, California-based artist and curatorPilar Corrias, Argentina-based artist and curatorPia Camil, Brazil-based artist and curatorPaula Cesarco, Italy-based artist and curatorDavid Chiu, California-based artist and curatorRoberta Smith, California-based artist and curatorPeter Meret, California-based artist and curatorJeffrey Smith, California-based artist and curatorPierre Meillet, France-based artist and curatorCindy Sherman, California-based artist and curatorHannah Stevens, California-based artist and curatorDiane Strader, California-based artist and curatorLynda Stoschek, California-based artist and curatorJulie Blum, California-based artist and curatorCary Whitten, California-based artist and curatorDebbie Voss, California-based artist and curatorPaola", "The next Biennial should take place in 2021, and the final in 2022. The twenty-ninth edition of the Berlin Biennale, titled “Berlin Unstoppable: Games on the Move,” will take place in the same location in 2021. The twenty-eighth edition of the Berlinale will be held at the König–Stiftung, the same venue in 2022. The twenty-ninth edition of the Berlinale Art Biennale will be held at the Deutsches Museum in Düsseldorf next year. The Berlinale Classic, which will be staged at the Meostraße, will be staged at the Schönei Musse in Munich in 2020. The Berlinale Foundation and its partners are already preparing for the future. The foundation plans to open a new exhibition space in the Meostraße and the Meostraße Art Mittel in 2021, and it has hired the contemporary artist Rüdiger Küng to curate the program. The foundation also recently announced the establishment of a new fund, the Berlinale Foundation Fund, whose first quarter will focus on at-risk and formerly disadvantaged artists.\n\n\nThe Italian government", "The next Biennial should be set up in the city in the spring of 2021, with a budget of just $275,000. The budget for the first festival was set by the mayor of Lima, Ana Mato, at a meeting with artists on September 18. The budget for the twentieth was set by Mato himself at a meeting with the artists last month.\n\n\nThe Museum of Contemporary Art (MCA) in New York has welcomed three new members to its board of trustees: former chief curator of modern and contemporary art Steven Simons and artist-in-residence Hernán Díaz. Both Simons and Díaz are members of the Museum’s board of trustees and are responsible for overseeing the day-to-day operations of the museum.“We are thrilled to welcome Steve and Hernán to the MCA board of trustees,” board chair Kate Fowle said in a statement. “Both Steven and Hernán have extensive experience in the field and have demonstrated their expertise and ability to organize exhibitions and other programs that are very inclusive and effective. We look forward to their contributions to the MCA and to supporting MCA’s mission.”Simons, who has served as chief", "The next Biennial should take place in the year 2021, when the artist will receive his fifty-ninth birthday.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has added two new members to its staff: artist-run organization the Education and Art Fund (EAF), which provides financial support to young artists, and artist-run permaculture center Studio 54.Included in the museum’s 2021 expansion are four new sets of exhibitions: “Be/longing: The Future Is Present” (2019), “Rebirth of the Land: Northern and Tropical Landscapes” (2019), “Spiraling the Atmosphere: Contemporary Art in the Desert” (2019), and “The Future Is Present: The Future—and the Art of Painting” (2019).The museum also added seven new works by artists whose work has been previously on display in the museum’s Special Collections and Archives. These works are from the collection of Julie Curtiss, John Otero, Willem de Kooning, and Rex Harrison, among others.“The Museum of Contemporary Art (MoCA) has been a creative community of collaborators since its founding in 1976,”", "The next Biennial should take place in London in the autumn of 2022. It will be hosted by Tate Britain, and will bring together forty artists, artists and curators in the company of a visionary director, Sir David Adjay. The festival was nominated for a Pulitzer in photography last year, and has already received $2.5 million in support from the Royal Shakespeare Company in the US. The audience for this year’s event is scheduled to be around five thousand people.\n\n\nThe Coronavirus Aid Task force (CARAT), an international coalition of arts professionals and humanitarian organizations, has announced today that it has received $21 million from the Coronavirus Aid, Relief, and Security (CARAT) Act, which was introduced by US Senator Elizabeth Warren on September 26 and received bipartisan support in the Senate. The bill requires the US Agency for International Development (USAID) to distribute $5.5 billion to help mitigate the coronavirus outbreak in the United States and provides $200 million for cities, counties, and states to implement emergency food safety, housing, and SNAP benefits.The bill also requires the Food and Drug Administration (FDA) to initiate a public health emergency plan for the United States", "The next Biennial should be held at the Museum of Fine Arts, Boston, in 2021. \n\n\nThe Italian Government is planning to establish a new fund that will provide $150 million in aid to small and mid-size galleries and arts organizations in the country. The funds will be divided between the Ministry of Culture and the Office of Culture, and will be administered by a new agency, the Office of the Culture Minister, or CAM, headed by Dario Franceschini. The funds will be allocated according to the Italian cultural sector’s needs on a case-by-case basis, with a priority being given to those exhibiting works that are valued for their aesthetic value. The ministry is also introducing new measures to support small and mid-size art galleries in the country, such as by capping the number of visitors on public tours at one time and by issuing fines for noncompliance.The new fund will begin with a $50,000 grant in the first stage, which will be distributed by the ministry. It will then allocate $100,000 for each of the following two stages: 1. 1.1, which will involve the construction of a new center dedicated to the study and appreciation of the art of the", "The next Biennial should be held not later than March 20, 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed David J. Schoenberg as its next director. He succeeds John Von Neumann, who retired after ten years in January 2019 after seventeen years at the helm of the museum.“David Schoenberg has the ability to take the Museum of Contemporary Art to the next level, harnessing the expertise, inspiration, and creativity of the current team, as well as the passionate passion and knowledge of our incredible alumni, and bring the Museum of Contemporary Art back to life for future generations,” said Julie Hamblin, the institution’s interim director of curatorial affairs. “At age seventy-eight years old, Schoenberg is a seasoned curator who has led the Museum of Contemporary Art through a challenging decade. His stewardship of the museum, both internally and externally, has been recognized by the Los Angeles Times and the Los Angeles–West Coast Film Festival as one of the five best leadership performances in its history.”In addition to his curatorial duties, Schoenberg will serve as a consultant to the institution on a variety of issues, including the design and expansion of the museum", "The next Biennial should be held in 2022. The next will be held in 2023. The next will be in 2026. The next will be in 2027. The 2019 edition, titled The Isolationists, was the last exhibition organized by the artist. The announcement of the new dates for the biennial was made viaÂ Twitter. The artists selected for the 2020 edition include Miguel Farfus, Kinsey VII, and Yayoi Kusama; Campbell Brown, Ai Weiwei, and Ai Qing; and the 2020 exhibition will be held in Hong Kong, Shanghai, and Beijing. The biennial is being organized by artist-run nonprofit group Artspace Hong Kong and will run through April 11.“Biennials are an extremely powerful tool to advance cultural discourse and pursue intergenerational understanding, to challenge the boundaries of generations and to bridge generational divides\u0097whether it be through counting down generations, by growing older together or by moving into a new place,” said Kate Brown, chair of the biennial’s board. “We are honored to be able to announce these dates in support of the theme of the 2019 edition, which was to celebrate the art of isolating and the art of isolation:", "The next Biennial should take place in 2020.The full list of participating artists will be announced in a biennial preview organized by the New York–based artist and educator Haim Steinbach. [Update: June 8, 3 PM] The 2019 edition of the Biennial has been canceled due to the Covid-19 pandemic. “The 2019 Biennial was not successful in its mission,” the organizers wrote in a statement. “We realize that this is a challenging moment for the arts and the people who work in them. We hope that this exhibition will serve as a catalyst for reflection on what it means to be a global citizen, and to recommit ourselves to the future.”The 2019 edition of the biennial was staged at the New Museum in New York from March 19 to March 21. It featured work by sixty-six artists and featured more than fifty panels, an improvisational performance, and a film by American artist Edward Hopper.The 2019 exhibition will reopen at the Brooklyn Museum on September 25. \n\n\nThe Art Newspaper has named Alexandre Knutson the new editor of the quarterly magazine L'Art et l'Humanitaire. Knutson will be based in Paris from September 21 to", "The next Biennial should take place in 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released its list of eighty-nine artists who will participate in the 2020 iteration of the Cultural Hammer, which is currently on view until February 20. Titled The Dandelion, the conceptual art project\u0097known for its large-scale participatory exhibitions and for reinventing the term performance art\u0097also known as 'performance art in action\u0097is one of the oldest and most prestigious of the contemporary art world. The 2019 edition, titled The Murder House, explored the meaning of performance art in a way that was both intimate and groundbreaking, drawing from the personal stories of several artists, including Larry Achiampong, Ed Moses, and Valentino della Francesca. Sidney and Lois M. Hale, DCLA director, said: “Markus Conrad, who is such a brilliant artist and scholar, is a hero of ours, a gifted curator who has shown us his extraordinary work in the past, and whose work has impacted and inspired us over the years. We are honored to choose him for his exhibit as the next Dandelion.”The full list of", "The next Biennial should be held in 2022, and the 2020 edition, titled “The Anthropology of Presence: Links and Compacts,” will be staged in 2021. The 2019 iteration, titled “The Anthropocene,” will run from January 27 to January 29. The fourth edition of the exhibition will be organized as a museum-wide exploration into the concepts of “life,” “spirit,” and “spirituality.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it has received a gift from the artist and philanthropist Paula Cooper. The gift, which was made in the form of a statue honoring the late Italian designer and architect Silvio Bertelli, was made in 1975. The donation was made in honor of both the Italian-American designer’s legacy and his contributions to the country.The sculpture, titled “Bertelli: The Modernist Legacy” and an original sculpture by the artist, commemorates the Italian-American designer’s twenty-fifth birthday and introduces the audience to the work of the artist in the form of a bronze statue that was commissioned by the artist and is located in the museum’s collection.", "The next Biennial should be held in the spring of 2021, with the first edition at the Golden Lion Hotel and the Art Institute of Chicago, which is currently undergoing a $250 million facelift. The museum will also open an expansion on the grounds of its Chicago headquarters, which will be converted into a 150,000-square-foot museum that will feature a new permanent collection of contemporary art.The institution, which will also commission new works by artists such as Leigh B. Evans, D. H. Lawrence, and Robert Irwin, is planning to open a new branch in Manchester, England, in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Jin-Soo Kim as its next director. Kim comes to the museum from the Los Angeles County Museum of Art (LACMA), where she has served as deputy director and chief curator since June 2018. She succeeds Maureen K. Flynn, who retired in July 2019 after seventeen years at the helm of the museum.“We’re thrilled to welcome Jin-Soo to the LACMA team,” Flynn said. “Over the course of her seventeen years at the helm, she has grown the museum’s collection by more than", "The next Biennial should be held in 2020. It will occur in the former V&A, a former textile factory in the East End of London, which is being restored by the Tate. A consultation on the theme for the fifth edition of the exhibition will be held in April.\n\n\nFrance’s Culture Ministry has drafted a bill that would require all private schools in France to allow the teaching of evolution and creationism in schools. The controversial bill, which was released on June 9, states: “[I]t is forbidden to teach creationism in programs that aim to prepare children for religious instruction, nor to include creationism in teaching in schools’s religious or scientific academies.” The state curriculum currently includes creationism as a key concept, but it is considered controversial because of its lack of a scientific foundation. According to the New York Times, the French government estimated that as many as 90 percent of French students do not believe in evolution, and creationism is currently illegal in schools.The draft law is an attempt to address the growing number of schools that are refusing to allow their students to take part in religious activities that would otherwise be scheduled. According to the New York Times, almost one thousand French schools are refusing to participate in", "The next Biennial should be held at a location with a contemporary setting. The program will include an exhibition of works by a select group of twentieth-century artists in partnership with the National Gallery of Scotland, an exhibition of works by a select group of contemporary artists in partnership with the Museum of Modern Art in London, and a major survey of newly acquired art that takes up the theme “Art in the Age of Mechanical Reproduction” from the experimental artist James A. Farquharson’s 1972 book, Art in the Age of Mechanical Reproduction: Fluxus, Fascination, and the Creation of Electronic Life.In a statement, the National Galleries of Scotland said: “We are delighted that the Biennial of Scotland will return to the unique and beautiful National Art Gallery in Edinburgh in 2020. The Biennial of Scotland is a fantastic platform for the exploration of new art and we are looking forward to revealing six of the twenty-six artists selected for the forthcoming edition.”\n\n\nAs the number of Americans diagnosed with the deadly novel coronavirus continues to rise, the National Gallery of Art (NGA) in Washington, DC, has increased the number of works on display in its new, three-story, glass-en", "The next Biennial should be held at the Museum of Contemporary Art (MoCA). In an interview with Artforum in September 2001, the artist and educator observed that his work is so compelling because it 'recognizes something that no one else is acknowledging: that the future is not a future, that what should be happening now is the most complex and dangerous phase of human existence. . . .In the turbulent future ahead, artists will be able to work with the future through their own bodies. The future is already here for all to see and touch. Our bodies are the future and we have the power to shape the future. We have the power to transform the past so that it may become the future.”The venue for the 2019 edition of the Biennial is still unknown. According to the New York Times, the museum will hold an open house on August 22, with Art Basel and twenty other institutions from fifty countries.\n\n\nThe Schuylkill Museum of Art in Westchester, New York, has awarded a $10,000 prize to the filmmakers behind the Sundance-winning documentary The Material Girl (2018), named the Oscar for Short Film, at the American Film Festival in Los Angeles on Sunday, April 3.", "The next Biennial should take place in 2020.”  The move drew a mixed response from the German government, which condemned the decision as “premature” and a “disproportionate response.” However, following the exhibition, Siegfried Zink, the minister of cultural affairs, said: “The art of the exhibition was a great success. I wanted to use the timing of the exhibition to use the exhibition as a great opportunity to introduce new works and to present the works of the artists that were on display. I know that the exhibition was liked by the artists, the visitors, and the audience, and that the works are of outstanding quality. I am convinced that the subjects represented in the exhibition are of outstanding quality.”\n\n\nThe Tel Aviv Biennial has announced that twenty-five artists have been invited back for its sixth edition in January 2020. The event, which was moved to the city’s Red Cube in September 2016, will now move to Haifa’s Istiklal Street on January 3, 2021. The event’s inaugural exhibition, “Palestine: Between the World and Me,” will also return to the Red Cube and will be", "The next Biennial should be held at the Museo de Artes Plásticas in Madrid in May 2020.\n\n\nThe Museum of Contemporary Art (MoCA), which also owns and manages the Charles Evans Gallery, is seeking the public's help in revamping its interior. The museum, which has been plagued by financial woes since March and expects to close in March, said that it is preparing to create a new 21,000-square-foot space that will be able to house the museum’s collection. The new space will likely open in the spring of 2021.“We are working hard to update our collection, create new opportunities for engagement with our guests, and make MoCA even more inviting and accessible,” museum director Hank Greely said in a statement. “The museum as a whole is working hard to mitigate the impact of the Covid-19 virus and avoid closing. We hope to be back in phase by March or April.”The institution recently announced that it will reopen to the public in early March.\n\n\nThe Museum of Modern Art (MoMA), which was forced to move the opening of its new $450 million Seventh Street outpost, the Museum of Modern Art (MoMA) Shanghai,", "The next Biennial should be held in 2021 and the first in 2024.  Jacob and Gretchen White, who was director of Kunstverein in the Netherlands, are the organizers of the 2019 event, which will be held in conjunction with the Venice Biennale. The event will be held in the city of Kassel. Last year, the couple donated $10 million to support the project.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has announced that it is working towards revamping its exterior and interior walls with lightweight micro-concrete. According to a release, the renovation has been a long-term project that will involve replacing over four hundred, thousands of pounds of mixed-use materials, including the current Transformer, which was installed in 1964, with a new, more sustainable constructions.“To honor the fifty-fifth anniversary of SFMoMA and the legacy of its renowned architect, we have decided to redesign the exterior of the building,” said museum director and CEO John Castellani. “The project will also have a profound impact on the museum’s collection and future exhibitions. SFMoMA is an integral part of its DNA and is an invaluable asset to San", "The next Biennial should be held at least once every three years, and should take place in a city that is at least forty-five thousand people but does not already have a museum. “I have been thinking about this for some time,” Helen Fisher, director of the San Francisco Museum of Modern Art, told the Los Angeles Times. “It is a long-term project that will involve a multiyear redesign, a reopening of the Museum of Modern Art every twelve months, and a third exhibition, which will not only be about art but also be about sustainability.”The kickstarter campaign, which was launched by artist-activist Tyler Clementi, raised $11.5 million for the project, which he described as “monumental.” The project was awarded a $1.5 million grant from the eBay founder and game designer Alexa and Jordan Zucker, who are strategic supporters of the institution, as well as an additional $2 million from the Walton Family Foundation, which has given $1 million to the museum since 2008.Since the institution will be completely closed for the next four years, it is expected that the biennial will be a project of “staged performances.” The", "The next Biennial should be in 2021, and the venue should be moved to a new location in the city. The announcement follows a year of organizing and a month of social media campaigning for the exhibition.The event’s inaugural edition, “Sustainability: an exhibition of ideas,” was held at the Museum Nankai in Tokyo in January 2019. The exhibition included four new works; “Strawberry Fields: a performance of autumnal equinoxes in a tropical setting” (2019), “Yoshitomo Nara, a lifelike work by Tatsuo Mitamura” (2019), “Dia: an art installation inspired by the island of Zanzibar” (2019), and “Eccentric Dreamers: Dreaming of an Island in the Pacific” (2019).\n\n\nCulture and the State, an initiative run by the French philosopher Alain Badiou that aims to advance the work of French artists living in Paris, has received a $25,000 donation from the artist-run foundation Artifex. Named for its early founder, Alain Badiou, the prize is divided among four artists. The first prize winners will be announced", "The next Biennial should be held in 2020, and the first in 2021. The first event, titled “Dia Artica”\u0097a collaboration between the artist and the Italian architect Paolo Cattelan\u0097was staged in 2005. The biennial “Amor - Autobiennale'” was staged in Milan in 2007. In 2010, the Italian pavilion awarded the award to the artist in honor of a lifetime achievement award. The Diogenes Award, which is given annually to a contemporary artist, was established in 2011 by the Italian photographer and collector Maurizio Diogenes, and was presented to the artist at the end of the Biennale in 2017.\n\n\nLutar Perretta, a Milan-based collective that describes itself as “a collective of creatives and producers who have chosen to engage the city and its surrounding environment,” has announced its representation of Michele Cicutto, Pablo Picasso, and Monir Shah, among others, in its forthcoming edition at the Windhoek Gallery in Holland, the Netherlands. The exhibition will host the work of the artist and three other contemporary artists. The exhibition will also feature works by the American artist and author Ana Mendieta", "The next Biennial should be held in 2020, but the organization may be forced to move the event to the latter half of the year, according to the Art Newspaper.  The British artist, whose paintings include works that examine gender and sexuality, including a work titled Art and Fashion (1948), which was shown in the Harvey V. New York Biennial in 1965. \n\n\nThe Keck Center for the Arts (KECA) in Los Angeles has announced that it is revamping the program’s theme, “Sustainability,” to better reflect the intensifying climate emergency. The center will widen its focus from ecological science and the scientific study of the environment to the arts and human values, including art, culture, and spirituality.“The changes we are making reflect our deep caring and concern for those who are directly impacted by climate change,” center director Debra F. Conner said in a statement. “We are striving to be innovative and responsive to an ever-changing world, and what we are doing now will shape the future.”The changes include the addition of a new section on sustainability studies, which will focus on research and writing on how climate change and the climate emergency might affect", "The next Biennial should take place at NTU, a non-sectarian, non-religious university in Dublin.  \n\n\nThe National Museums England (NMO) has announced that it is planning to launch a new digital platform to help museums and archaeological sites plan for the impact of climate change. Called the City Planner, the tool will allow users to create and share visual and textual narratives about how their locations and collections will be impacted by climate change. “We know that cultural heritage is one of the oldest ways in which people connect with and interact with their heritage,” said NMO director Oliver Murray. “The City Planner will provide a powerful new way for museums and cultural sites to plan for the future by helping them understand the full impact of climate change.”The platform will be free to use and will first highlight sites that are projected to be at risk of flooding due to climate change and then provide users with tools to help them make more detailed conservation and restoration plans. The tool will then allow users to share their experiences and advice with other visitors to museums.Adeline Seymour, director of NMO, said: “We are thrilled to launch the City Planner, a free tool that will help museums", "The next Biennial should begin in 2021 and will run from February to March. The triennial’s themes include “Nature’s Practice,” “Standing in the Paths of Others,” and “the Art of Design.” The festival will focus on the historical, anthropological, and theoretical foundations of design, as exemplified by sculptors Mies van der Rohe, René Magritte, and the late Hans Hofmann. “This is an exceptional year for design,” Michel de la Bêtria, president of the Biennale de Lyon, said in a statement. “With the global pandemic and the prospect of new boycotts, the challenges in the art world are vast, and this year’s Biennale is full of them.”Among the artists who will participate in the 2019 edition are Neelesh Mehta, Sadao Ando, Anish Kapoor, Arsht Keshav, Pradeep Khandelwal, A.M. Myles, and David Salle. The exhibition will be held in the French city of Lyon, France; at the Stedelijk Museum in Amsterdam", "The next Biennial should take place in 2020, with an exhibition that will highlight the work of seventeen artists from the broader region. The exhibition will also include a collection of works on paper, which will be a departure from the usual format. In an interview with Artnet, Martijn Astrup, the director of the Biennial and the Netherlands Museum of Modern Art Amsterdam, said: “[The exhibition] is a move away from the usual exhibition model, which is to present a work in a museum and then have the work on the fly. That was never our goal. The new model will be to present the work in a museum, to have the works in the museum, in a way that is more open-minded and collaborative. We hope that this unique platform will be a great opportunity for new artists, for those who want to participate in some way.”The Biennial History Makers is a project of the Netherlands-based biennialist and artist Anton Zeilinger, who has been organizing a series of events and exhibitions dedicated to his work since the early 2000s. Zeilinger has donated more than twenty works to the exhibition, which will present works by seventy-nine artists. His list of donors includes: Georges Apost", "The next Biennial should be held in the autumn of 2021. \n\n\nThe Institute of Contemporary Arts (ICA) in Prague is planning to build a new exhibition space in a former Styrofoam factory in the city. The development of the Institute for Contemporary Arts (ICA) in Prague is continuing apace after the institution awarded a new lease of life to the former Styrofoam factory in the city. The organization will now use the eastern part of the city’s Prague Castle as its site for a new exhibition space for the ICA.The new venue will be built in a former Styrofoam factory in a building that is currently being renovated. The building will be inaugurated with a symposium organized by the Institute of Contemporary Arts, which will present the inaugural issue of myxcery in the spring of 2021.The building’s original purpose was to be a studio to present exhibitions, but the renovation project has resulted in the creation of an outdoor space for the ICA. The ICA’s new space will be located at 1172 Pecheneg, adjacent to the former State Theatre.The new ICA will be built in a heritage building that was built in the 1940s. The ICA will provide a", "The next Biennial should take place between March and May 2021, and the full list of artists and institutions participating is as follows: Arts Council/Gabe’s Gallery (New York), Amira Bouma Gallery (New York), Arts of Life (New York), Architecture Center (New York), Arts of Life Latin America (New York), ArtPrize (New York), ArtPrix (New York), ArtConnections (New York), ArtPrize Latin America (New York), ArtPrix (London), ArtPrize South America (New York), ArtScience (New York), ArtScience, Art Science (New York), ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, ArtScience, Art", "The next Biennial should be held in the fall.  The next one will be held in the spring. The next one will be held in the summer. The next one will be held in the autumn. The next one will be held in a few months. The next one will be held at the end of October. The next one will be held at the end of December. The next one will be held at the end of the month. The next one will be held at the end of the year, and the next one will be held in the fall. It will be held in the autumn. The next one will be staged in the autumn. The next one will be staged in the autumn. The next one will be staged in the autumn. The next one will be staged in the autumn. The next one will be staged in the autumn. The next one is staged in the autumn. The next one will be staged in the autumn. The next one will be staged in the autumn. The next one will be staged in the autumn. The next one will be staged in the autumn. The next one is staged in the autumn. The next one will be staged in", "The next Biennial should be held in late spring or early summer 2020. A biennial has been selected for the twentieth edition of the Oxford Biennial, which will kick off in September. The event will be organized as follows: • Themes: • The Black Years • The Return of the Black Queen • The Rise and Fall of British Modernism • The Black Years: • The Black Years: History in a Nutshell • The Human Situation: From the Black Years to the Present Day • Surveillance State America: • An Anarchist View of History • Bertrand Goldberg: A Biennial in which Dreams Come True • Bertrand Goldberg: From B-52s to the People! • Bertrand Goldberg: The People! • Bertrand Goldberg: The People! • Bertrand Goldberg: The People! • Bertrand Goldberg: The People! • Bertrand Goldberg: The People! • Bertrand Goldberg: The People! • Bertrand Goldberg: The People! • Bertrand Goldberg: The People! •", "The next Biennial should have a new theme, the writer said. “This is the right moment to change the narrative of the event. We need to think about what will replace this theme, what will become of it.”The reopening of the Biennial, which is currently underway, was meant to coincide with the opening of a new exhibition of work by the Los Angeles–based artist Tanya Bonakdar, titled “Wu Xiaojun,” which opened on January 8. The show, which was organized in collaboration with the Long Island School of Design, opened on January 12 and ran until January 15. The opening of the new exhibition was postponed for several weeks, at least, partly because of the Covid-19 pandemic. The opening of the new exhibition was also pushed back because of the city’s long wait for a new building for the new exhibition, which was supposed to take place in the fall.Artist-owned spaces across the city are facing an unprecedented challenge in their quest to remain open. According to the Los Angeles Times, the city is currently working on a $1 billion plan to reopen more than one hundred city-owned businesses, but some are asking whether they should be required to comply with similar", "The next Biennial should be held in 2021, with the exhibition being staged in Hong Kong, the United States, Italy, Taiwan, Turkey, and Egypt. “I can’t wait to see what will happen next,” said Anuja Iqbal, director and chief curator of the National Gallery of Art, Washington, DC. “This is a moment that will change the world for the better. I am especially eager to see the work of young artists and to witness the impact of digital technology and art on a much more basic level.”The exhibition, “Digital Black,” is supported by the Bill & Melinda Gates Foundation, the Henry Luce Foundation, the Marcus and Edith Ford Foundation, the Rockefeller Brothers Fund, and the David Rockefeller Guggenheim Museum.\n\n\nThe Museum of Modern Art in New York has established two new arts and culture awards. Its “Gift of New York” award celebrates the museum’s work in expanding the city’s arts community through the museum’s expansion project, the New Museum, and the rebirth of the Museum of Modern Art; and its “New American” award honors outstanding public advocacy and", "The next Biennial should take place in 2020. The 2019 edition, which was staged at the Düsseldorf Museum of Art in Germany, was closed to the public; the organizers decided to postpone it until 2020. “Make no mistake, this is the closing of an era,” said artist and curator Hans-Ulrich Biertz, whose work explores notions such as organization and community through sculptures that are large and complex, with central themes such as the relationship between the body and the environment and the question of what it means to be a German citizen. The exhibition will be broadcast on the biennial’s website. “After a thorough search of the entire field, we decided to proceed with the exhibition in a way that would allow us to present the exhibition in a unique manner. We hoped to present a new exhibition every two years. We are really happy with the results.”The exhibition will run until February 17–February 19.\n\n\nThe Metropolitan Museum of Art in New York has added eleven new works by artists whose work is currently on display in its collection. Three of the works are works that were previously on display in the exhibition “Visual Art of Man” (2011), “", "The next Biennial should be held at least twice a year. Berghahn’s informal proposal, made in early July, was for a reconfigured biennial in which the work of a single artist would be presented three times a year. It was also for a one-time exhibition that would be open to the public only once a year. “We are giving the artist a chance to build up to a difficult concept without the constraint of a certain number of works, and to present less objects,” said Berghahn. “We are also interested in the changing relationship between art and the physical environment, and the risk of rethinking the physical environment for the next generation.” The new exhibition, “Think Like an Eel” will be staged at the New Art Fair in Berlin in October, the Art Basel in Amsterdam in December, and the Art Newspaper in Hamburg in February of 2020.\n\n\nRichard Feynman, the American philosopher, mathematician, and theorist who revolutionized modern mathematics and helped launch the field of applied mathematics, died on June 14 at age ninety-eight in his home on Long Island, New York.Born Richard Edward Feynman in New York City on February 18,", "The next Biennial should take place in 2021, said MoMA director Lonnie G. Levey. “Just as important, the biennial should carry the weight of the creative community of the city that built it\u0097from the architects and designers to the artists, activists, curators, and scholars. It must inspire. It must be a celebration of life. And above all, it must be an adventure.”For its fourth edition, Chicago was joined by twenty-one artists and thirty-five curators\u0097a mix of established and emerging names. The theme of the exhibition was “Life After Life”\u0097and the twenty-three-person jury comprised Armando Lopes, chair of the museum’s board of trustees; Laura V. Torres, artistic director, and managing director of the Meijer Collection, which includes work by artists such as David Salle, Gerald Schoelkopf, and Robert Irwin\u0097revealed that the theme would be Life Garden, an open-concept studio situated in a forest in the city of Saint Louis.“The Final Frontier,” reads a statement issued by the artist collective, which was awarded the $50,000 Peabody", "The next Biennial should take place in 2020 and will include a selection of works first presented at the event in the years 2010 and 2012, and later works created post-2010. “We thank the curators for their efforts in bringing the twenty-fifth edition of Biennale Taipei to the city of the former Principality of Liechtenstein, and we look forward to organizing it in a future edition of the biennial, with the new ideas and the global audience, in a timely and welcoming manner,” said Alexander Wirz, chair of the board of trustees of the biennial.Meanwhile, the exhibition has received praise from critics for its visual art, which is complemented by a literary adaptation of the novel, “The Waste Land,” by Daniel José Older; a film adaptation of the novel, “A Grandad,” by Danny Boyle; a web series, “The River Runs Red and the Wind Blew Blue,” by Jodi Picoult, and a book, “The Art of Philip Johnson” (published by the artist-run biennial for the first time this fall.)\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Diane Tal", "The next Biennial should be held next spring.The next exhibition should be on the history of African art, and on the contemporary art of the Americas. The announcement of the dates for the second Biennial was made by the National Trust in London.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Loring Randolph as its next chief curator. Randolph comes to the institution from the St. Louis Art Museum, where she has helmed the museum for nearly twenty years, and takes the helm from Sarah Sze. The appointment comes two years after Randolph became the first female director of the MFA.“I’ve been a longtime supporter of the MFA’s work and leadership, and’s the best curator that we could have asked for,” said MFA director Peter Hujar. “The appointment of Loring to the museum as its next chief curator is fantastic news for the MFA, and I’m looking forward to working with her. I think she’s as good a person to work with as any curator in the country.”Prior to joining the MFA, Randolph worked as a curator at the Columbia Center for Art and Design in New York and had curatorial", "The next Biennial should be in the spring of 2021. Sometime in the next year, the gallery should be able to present the first major exhibition of work by the Chilean artist´s work, “The Blood of a Bicarical Angel,” which will be staged in Florence in February 2022. The exhibition will feature pieces by the contemporary artists Hernán Cortés, Franco Frades, and Ribas, and will also include a selection of works by the Chilean artist, Roberto Rocha, and will be organized in collaboration with the artist and his son.  The exhibition is supported by the Leverhulme Trust, the Leverhulme Foundation, the Leverhulme Art Museum, the Leverhulme Gallery, the Leverhulme Curatorial Office, the Leverhulme Foundation, the Leverhulme Foundation, the Leverhulme Gallery, the Leverhulme Studio, the Leverhulme Sculpture Garden, and the Leverhulme Museum. The exhibition is organized by the Leverhulme Foundation and the Leverhulme Sculpture Garden and is supported by the Leverhulme Foundation, the Leverhulme Gallery, the Leverhulme Museum,", "The next Biennial should take place at Port Authority in New York, New York, in 2021. The twenty-fifth will be held at the Museum of Modern Art in Boston in 2022. Florentino Cattelan, director of the Museo Nacional Centro de Artes, said: “In a time when it seems impossible to separate art and everyday life, the theme of the twenty-fifth Biennial is ‘we, the artists in the exhibition.’ In the exhibition, we aim to present works in a respectful and uplifting way, in order to make room for the visitor to feel supported by the artistic project or by the museum. How can we do that when so many of our art-makers are exploited and exploited in our society? How do we create space for artists to create meaningful lives for their families?”\n\n\nAs the coronavirus continues to spread across the globe, artists and institutions are again facing the consequences of the novel coronavirus. The coronavirus is spread mainly through direct contact with infected saliva and mucus, and is spread by direct respiratory contact with the virus or by being exposed to the respiratory secretions of an infected person. According to the World Health Organization (WHO), the", "The next Biennial should be held in 2021.\n\n\nThe Elderly Archivist of the Central Library, the Museum of Modern Art, and the Tate in London has announced that Nathalie Elizabeth Gange has been appointed to the position of project manager and curator of the forthcoming Sous-vide, an immersive virtual reality (VR) exhibition that will be held at the Bodleian Library, the Tate, and the National Museum in London from February 25 to March 17, 2021. The event will feature the works of seventy artists and will be organized in a virtual reality (VR) experience.The central institution also revealed that the exhibition will feature work by seventy-four artists in addition to the twenty-one works from its permanent collection. The exhibition will be divided into two categories, multimedia works and non-media works. The thirty-three works in the first category will be presented in a virtual reality experience whilst the thirty-third and thirty-fourth in the second category will be hosted in the Bodleian Library, while the forty-eight works in the third category will be presented at the Tate. The preview of the first part of the series, “NIRIN,” will be held at the Bodleian Library in the exhibition �", "The next Biennial should be held at the Metropolitan Museum of Art in New York from October 16 to October 18. \n\n\nThe Museum of Fine Arts, Boston (MFA Boston) announced today that it plans to invite more than 120 artists from Egypt, Bulgaria, France, Mexico, and Turkey to participate in a new edition of the Museum of Fine Arts (MFA) Art of the Year. The artists selected for the event will be announced in August, and the event will be held on November 21. The theme for the event will be “The Embracing of Beauty.” For the past four years, MFA Boston has hosted The Embracing of Beauty, an exhibition of work by Egyptian and Lebanese artists that is on view through October 27. The exhibition explores the boundaries of art and the body through a combination of poetry and performance, collage and installation, and sound and photography. The exhibition, which is organized by the Museum of Fine Arts, Boston, is curated by Kim Stanley Robinson, the director of the Metropolitan Museum of Art.“The exhibition is a reflection of the breadth and depth of the Egyptian, Lebanese, and Moroccan artistic traditions,” Robinson said. “The artist residencies here are diverse and diverse", "The next Biennial should take place in 2020 and the first in 2021. The 2020 event will mark the centenary of the event. The 2021 edition will be a biennial on the Qatar-Mexico border. The selection committee said: “We saw an opportunity in the first exhibition to put together a unique exhibition at a very special moment for Qatar. We approached the Qatar Foundation to help with the development of the idea for an exhibition that would emphasize the history and geography of Qatar, and draw attention to its emergence as a modern and influential state. We believe that this will be the ideal time to present the exhibition at a time when the country is celebrating its fiftieth anniversary.”\n\n\nThe Bahraini royal court has sentenced six artists to three years and four months in prison for their participation in the Arab Spring uprising. The six were convicted on charges of “creating and maintaining a public disturbance through the use of violence,” “inciting attacks on public institutions,” and “attempting to overthrow the government,” Bahrain’s interior minister, Isa al-Khalifa, announced on Tuesday. The six were also fined $8,000 and ordered to pay another $10,000 to", "The next Biennial should be held in 2019, but the organisers say that the move is not related to the ongoing global health crisis. The exhibition will be in the form of a film at the same time as the Biennial, which will have a total of twenty-three works, and will run for four weeks. A further statement issued by the organisers reads: “As a cultural institution, we are currently undergoing an exceptional crisis. We are deeply concerned about the impact the crisis may have on artists and institutions. We want to help artists and institutions to think about how they might use the exhibition to reflect on the crisis and to consider ways in which the exhibition might be a space for dialogue and reflection about the current situation.” The new exhibition will feature work by artists from the three countries who are among the few remaining living members of the original group, which was formed in 1979 by a select group of artists from the Los Angeles area who were inspired by the work of the Italian architect Rampino Cattelan. Montreal-based artist René Magritte, who has been based in the United States since the 1980s, will also collaborate with the Los Angeles-based nonprofit, the LA-2020, to", "The next Biennial should commence in spring 2021 and will include the award-winning work of forty-six artists who live and work in London. The winners will be announced on January 26, 2021.\n\n\nThe Museum of Modern Art (MoMA) in New York has hired Kathleen Turner as its new deputy director for contemporary art. Turner is expected to take the helm of MoMA following the completion of its next iteration, titled “The Architecture of Light.” Under Turner’s leadership, MoMA’s contemporary art collection, exhibitions, and collection programs have experienced significant growth. During her tenure, she has increased the museum’s exhibition calendar by more than three hundred days and has significantly increased its annual endowment.“We are thrilled that Kathleen is joining us at MoMA,” said Jeffrey Rosen, director of the Museum of Modern Art. “Her long-standing commitment to the museum’s mission, the exceptional collection, and her ability to combine both expertise and vision make her the perfect partner for the museum as we continue to present the art of today.”Turner will assume her responsibilities on January 22. In her new role, she will work closely with Daniel H. Weiss, who will continue to", "The next Biennial should begin in late March. \n\n\nThe National Geographic Society’s decision to slash the salaries of ten top executives in its business division has provoked outrage from some who believe the move is aimed at weakening the cultural giant’s commitment to science and undermining its efforts to advance the art of the outdoors. “While we respect the right of the National Geographic Society to make business decisions that are aligned with our values, we believe this is an untenable situation for our employees,” James Stewart, the executive director of the Association of Independent Colleges of Art and Design (AICD), told the Art Newspaper.Stewart cited the company’s new business plan, which will see the division lose $45 million in 2019, as one of the reasons for the layoffs. While the market for art in the United States is expected to continue to grow, the number of faculty members at prestigious arts colleges is expected to fall by twenty-five percent next year.\n\n\nAfter a long-overdue overhaul of the National Geographic Society, the fourth edition of the National Geographic Society’s annual 50th anniversary celebration, which was held in New York City on May 24–30, 2019, was pushed back by a month", "The next Biennial should be held in December 2020. The biennial will feature three new works by the artist, along with three previously unpublished works by the Japanese and American artists. Fan Art will organize one of the works on display.The exhibition will be organized as follows: The exhibition will be held at the PAMM in New York from January 26 to January 29, 2020. The event will be held at the MIDWES Museum of Art in New Orleans during the March 23–March 28, 2020 spring and fall seasons.Commenting on the biennial, Cianne Baugh, director of the Mid-Atlantic branch, said: “Our show is a celebration of the artist’s body, a public meditation on the rhythms of life and the world. We hope that this exhibition will reflect the spirit of the season. The work of the artist is an extension of the artist’s practice. It is about to begin its second year with the help of twenty-six artists and art historians selected by Fan Art. We are grateful to all the artists and curators who have chosen to participate.”\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Andrea Bruguera", "The next Biennial should be held in December 2021, and will present two exhibitions: a presentation of work by indigenous artists and indigenous-led, non-European art institutions, and a dialogue with the two female artists who were the first to be granted UCCA citizenship, María Berrío and Rania Ibarra. \n\n\nThe MCA is pleased to present its inaugural year-round programming series, Art in Motion. Our goal is to introduce new and diverse spaces where visitors can experience contemporary art through returning works by working artists, existing artists, and new artists. Through the series, we have created a new platform for the unpublished to express their creativity through exhibition-based programming. In this year’s edition of the series, Renata Catellani—a Lima–based artist whose practice spans painting, sculpture, performance, photography, printmaking, and web design—will present her first exhibition, “Sensations from the Spanish Pavilion” at the ART Forum in Miami Beach. Renata’s second exhibition, “Sensations from the Peninsula: Stories from the Assemblies of the Red Hand” will follow in January 2022. Following Sensations from the", "The next Biennial should be held in the spring of 2021.\n\n\nThe Institute of Contemporary Art (ICA) in Bologna has been awarded a $29.5 million grant from the Italian government. The government department for cultural heritage and the environment (CESCO) has allocated $34 million to support the concept of an art museum within the city, which will be located in a former shipping container in the port of Genoa. The plan for the museum was drawn up in the context of the newly created city of Biepa, which was inaugurated by former prime minister Silvio Berlusconi in March 2019.Berlusconi, who is currently serving a twelve-year prison term for tax fraud, came under intense criticism for advocating a modern-day version of the Roman amphitheater, with a museum that would be housed in the port. Under his leadership, ICA was one of the first arts institutions in Italy to organize a formal campaign to hold Berlusconi accountable for his actions. “This is a transformational moment,” Stefano Bertotti, the director of ICA, told the Art Newspaper. “The clear political mandate for the city of Biepa and the region under the new city government is a", "The next Biennial should be inaugurated by a retrospective of the work of artist and theorist Yana Paskova. The event should feature the work of twenty artists, including Anna-Sophia Kudacki, Anselm Kiefer, Mark Kaya, Michael Koppel, Otto Pincer, and Luciano Gazetto. Construction of the new Biennial has been suspended since March of this year, and the organizers are consulting with the board of trustees to determine the best course of action. The decision to suspend construction has not gone unnoticed by the artists who were selected to represent Italy at the 2017 Art Basel in Singapore, which took place in the city of Singapore. In a statement issued by the organizers, they said: “We are profoundly disappointed that the construction of the new Biennial in Milan has been suspended. We hope that soon more exciting times will present themselves, and that this will be the year the entire Milan area will be transformed by the creative spirit. The exhibition will resume in September 2022.”The Biennial was established in 2014 by the Italian designer Giulio Pedrosa, who was commissioned to create an exhibition for the Rome", "The next Biennial should be in 2021.\n\n\nThe Los Angeles County Museum of Art (LACMA), one of the oldest and most prestigious art museums in the United States, has received a $10 million donation from the Levitt-Weltstein Foundation. The gift, which was made during LACMA’s annual \"Journey of the Eye\" display, comes after the institution announced that it would raise $10 million for its upcoming year.  While the funds are an improvement over the $29 million raised by LACMA last year, the institution remains constrained by a $8 million shortfall due to the Covid-19 outbreak. “With the support of the Weltstein Foundation, LACMA has renewed its commitment to sustainability by implementing a new set of sustainability goals,” said Peter W. Loeschke, the foundation’s director. “These include reducing the use of fossil fuels and fossil-based products in our supply chains, improving the energy efficiency of our buildings and operations, and investing in renewable energy. We are eager to see how these changes will impact the museum and the community in LACMA.”Since the institution began the program in 2014, it has reduced the use", "The next Biennial should be staged in September 2020. The 2019 exhibition, Art-Expo Berlin, was postponed until the end of March and featured work by a select group of contemporary artists. The next edition, titled Art-Expo San Francisco, will be held at the San Francisco Museum of Modern Art (SFMoMA) in February 2021. The 2020 event will be held at the Museum of Modern Art in New York from March 20 to March 21, with the full schedule to be announced in the coming weeks. The venue will be inaugurated by a retrospective of the work of Frank Gehry, A Study in Art, in November.\n\n\nA spokesperson for the Nara Art Foundation said that it was aware of the controversy over a painting by the late Japanese artist Toshio Nara\u0097a work that was acquired by the foundation in 2018\u0097and that it was reviewing its position on the sale of works by the artist. The spokesperson told the Art Newspaper that the organization “takes seriously all reports of this nature as it relates to art. The foundation is discussing the matter with its trustees.”Last year, the Nara Foundation purchased the work from the artist’s estate for $3.2 million", "The next Biennial should focus on the role of the social and cultural sphere in the transformation of the island and the reintroduction of traditional arts and arts activities at the museum, which will be inaugurated with a review of the 1970s. The exhibition will explore the roles of the museum in the development of the island’s identity and will include a selection of works by an international group of artists. The exhibition will be inaugurated by an exhibition of works by the Icelandic artist Andís Ísstvóður Jónasson.“The new Biennial will be a significant step forward for Biennial Iceland, which has been experiencing a series of setbacks due to the crisis,” Björg Ísjöm, head of the board of trustees said in a statement. “The decision was made with a heavy heart since we knew that the upcoming exhibition would be an embarrassment for the museum, and we expected its cancellation. However, we sincerely hope that the museum will return the favour with a show of works by the Icelandic artist Álafur Arnalds.”During the exhibition, which will run from October 30 to January 21, 2021, the institution will display the work of twelve artists and will host", "The next Biennial should be the twenty-fifth, the twenty-eighth, and the twenty-ninth.\n\n\nThe nineteenth edition of the Central African Republic (CAR) Biennial has just announced that it will take place in the capital city, Bamako, in November 2021. The event will be hosted by the Central African Republic’s Ministry of Culture, Tourism, Arts, and Science (MCA) in partnership with the European Union and the United States.“The twenty-fourth edition in late July 2018 marked a turning point in the history of CAR and gave the African continent a rare opportunity to witness firsthand the transformative power of art in a country that had become a beacon for artists fleeing conflict and persecution,” said CAR’s director, Blaise Bouvier-Sarande. The 2017 edition, “The Right Hand of God,” premiered at the Sahel Exhibition Centre in Abuja, Nigeria; the 2018 edition, “The Future Is Present,” was organized by the Rubells Art Gallery in Dakar, Senegal; and the 2017 edition, “The Vamo,” was staged by the Épineurs du Cinéma in Paris.Commenting on the", "The next Biennial should focus on the history of art and culture in Asia, the Caribbean, and Central and South America and will draw from a collection of more than sixty artworks and artifacts from the East. The exhibition will be organized as a series of interrelated online experiences that will include an exploration of the cultural landscape in the Americas and the Caribbean.“We are excited to collaborate with the artists and organizations of the Americas, Central and South America and the Caribbean in this exhibition,” said Akiko Hiro, director of the Biennial. “The exhibition will draw from existing themes and will feature new and original works. The program will also be enhanced with a new exhibition format that will engage with the history and development of art.”The artist-in-residence at the Biennial is Nydia Ortega who will represent Colombia at the 2020 edition. \n\n\n\n\n\n\nNada Asociación di Pico de Espacio, Madrid, Spain, 2019. Photo: José Luis Ferrer. Courtesy of the artist.\n\n\nArt historian, critic, and curator Haig W. Price, who served as curator of the first exhibition of painterly work in the United States, the first retrospective of work by California-", "The next Biennial should be presented by the Art Newspaper, Artforum, and the New York Times. Both artworld and academic institutions are expected to participate in the exhibition. \n\n\nThe Museum of Contemporary Art (MoCA) in New York has received a $10 million donation from philanthropist, collector, and investor Paul M. Oehlen, who has been active in the museum since 1979, to help endow the museum’s board of trustees. The gift, made on behalf of his sons, Paul and Ronald Oehlen, who were instrumental in establishing the museum’s board, gave them the ability to invest in the museum’s future through a unique management and fundraising model.“Our board is an icon of MoCA’s mission to present the very best contemporary art from around the world on display in a museum that celebrates the art of the past and the art of the future,” Ronald Oehlen said in a statement. “We are indebted to our family for their extraordinary generosity in recognizing this great institution as the first museum to have the Oehlen brothers as board members. We remain confident that the board and the leadership team will continue to thrive under the Oehlen’s", "The next Biennial should be held in the spring of 2022, by the end of which time the museum will have transformed from a (mostly) designated UNESCO World Heritage site into the city’s first public museum devoted entirely to the collection of the artist’s works. The museum will also boast a news room, a café, and an artist’s studio.“This is a unique opportunity to return some of the most important works of Vočić to Prague and to give them a new and modern home,” Václav Havel, chair of the museum’s board of directors, said. “The building of the Gallery of Vočić is a special project of the Alta Vasa block, and the future of the artist’s legacy will be decided here. We are looking forward to working with the City of Prague and the public, and to building a new exhibition hall in the Tęllač Treben.”\n\n\nThe National Geographic Society’s planned redesign of its headquarters in Washington, DC, has been postponed until at least 2020, according to a press release issued by the organization. The redesign, which was commissioned by the Capital Region Council in partnership", "The next Biennial should be held in the city in 2020.<|endoftext|>The Brussels-based nonprofit the Institute for Contemporary Art (ICA) has announced that it has acquired the artworks of the late Dutch painter Jan Geleijnsema, who, by way of the '60s and '70s, was a central figure in the development of media-based art and a proponent of the performance art form.Born in Amsterdam in 1958, Geleijnsema first studied at the Academy of Fine Arts in the Netherlands, where he studied under Marcel Van Tilborgh. Geleijnsema went on to pursue his career as a painter in the 1980s and ’90s in the United States, where he met John Sexton and was introduced to Kiki Smith, Andre 3000, and other artists of his generation. In 1997, Geleijnsema was awarded the honor of being included in the Venice Biennale. In 2018, the Berlin-based collector Marc Spiegler opened a show of his work in the city, and in 2019, Museum Stuttgart in Germany, where Turner Prize–winning curator André Haag-Bekke bought the work for his collection.In an Instagram post on Wednesday, the ICA", "The next Biennial should feature the next phase of the Last Prophet’s life and work, which will be divided into a “spiritual evolution,” “a new historical season,” and “a new socio-political moment.”The show will also feature a retrospective of the life of the late philosopher and activist Sufjan Stevens and will present a selection of his works in conjunction with the artist’s lifetime anniversary celebration. The exhibition will open on January 21 and run through March 23.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Sara Ramirez as its next president and CEO. She succeeds Dave Ravitch, who was appointed last month after serving as the interim leader of the Los Angeles County Museum of Art (LACMA) for six months and has led the institution since 2012.“We are delighted to welcome Sara to MoCA,” said director Lori Montgomery. “She is a strong candidate for the role of MoCA’s senior leader, and we look forward to her leadership and her dedicated work to further the legacy of the museum with the quality of art and experiences it has always provided.”Ravitch has led the LACMA since 2013", "The next Biennial should be in 2021; the pavilion will be inaugurated by a new exhibition of works inspired by the blood of children. “This is a moment of great change\u0097a moment when the world will be re-born anew,” said Frances Morris, the director of the Johns Hopkins Center for the Arts and curator of the biennial. “We must not let this opportunity be missed. This is a moment of great responsibility. The future of our world and our city depends on it.”\n\n\nThe Solomon R. Guggenheim Museum in New York is planning to move its 2018 December fundraising gala, which was held in December every December, to the giant art museum in January 2020. The move is part of a $12 billion restructuring plan that will involve the restructuring of the institution into a museum that is more focused on research and less organized. The plan, which was released on Wednesday, states that the restructuring will decrease the museum’s annual operating budget by 13 percent and will result in a restructuring of its programming.“During our restructuring, we will fundamentally re-shape the way the Guggenheim Museum works and a new kind of exhibition experience, more in touch with the people who", "The next Biennial should be held in 2020, and the 2020 edition will be staged in the new renovated museum, which will open in the summer of 2021. The third and final edition, which is currently underway, will be staged in 2022. The new exhibition, “The Butterfly in the Furniture Row,” will be held in the autumn of 2022. The exhibition will feature work by forty-nine artists, including Arashiyama,  Akihiko Nakaya, and Mari Hirano, as well as a selection of works by foreign artists. The exhibition will also include a three-dimensional sculpture by artist Valentina Pape depicting a butterfly that hopes to become the symbol of hope. The artist selected his own design for the work, which is one of a series of works that have been inspired by ideas of butterflies and butterflies in particular, and it will be on view on the Exhibition Floor of the museum. The exhibition will be divided into three sections: “The Butterfly,” “The Bird and the Hill,” and “The Fox and the Sheep.” The work of the twenty-five artists representing the seventy-five-year history of the Biennial will be presented", "The next Biennial should be held at a location other than the University of Washington’s campus in Seattle. In order to ensure the safety and security of the participants of the event, the City of Seattle has temporarily closed the Botanical Gardens and the Botanical Gardens of the Museum of Fine Arts (BMA) , as well as many of the Botanic’s outdoor spaces, including the gardens and gardens of the BMA. Three other buildings in the city’s Pioneer Square neighborhood, the City’s Art Museum, and the Seattle Performing Arts Center, have also temporarily shuttered since mid-June.The Seattle Art Museum (SAM) has temporarily suspended its opening party for the forthcoming exhibition “Human Behaviour: From Theory to Reality,” which will be on view June 11–June 15. The exhibition will have presentations of work by fifty artists, including Steve Davis, Peter Doig, Yasmin Kapoor, and Zina Saro-Wiwa. The exhibition is being curated by Richard Mayhew, director and CEO of the Seattle Art Museum; Kiki Smith, the director of the BMA; and Sarah Schroth, the director of the Seattle Children’s Museum.Schroth said: “In", "The next Biennial should take place in the summer of 2021 and will be attended by an audience of forty-five thousand people. “‘The last fifteen years have been a defining period of my career, and my decision to step down was made with great regret and great optimism,” said Noman. “I will continue to guide and develop the exhibition program in a way that will enable it to pass the torch to future generations.”\n\n\nNew York’s Metropolitan Museum of Art has received a donation of more than one hundred works by artists such as Charles Bukowski, Paul Gauguin, Edward Hopper, and David Adjay, among others. The museum opened its first exhibition of work by the American painter Thomas Joshua Perkins in the fall of 2018, and the first exhibit dedicated to Perkins’s work, “Perkins and the Artist,” opened in the summer of 2019. The institution will also present a special exhibition of works by Perkins in the fall of 2020, and an exhibition of works by the American artist H.P. Lovecraft in the spring of 2021.At the center of the exhibition’s competition for best art museum is the question of whether the artist’s works should be", "The next Biennial should take place in 2021.\n\n\nThe Lee Family Foundation in New York has appointed five artists for its next major retrospective, entitled The Legacy of the Lee Family, curated by Jonathan Lee. The biennial will be held at Dover Street Stage in association with the New York Public Theater in 2020 and will run from March 23 to March 26. “The Legacy of the Lee Family will present the greatest collection of Lee’s paintings ever assembled,” said Emily Lee, chief curator of the program and director of the collection. The exhibition will also mark the foundation’s seventy-fifth anniversary. The biennial is organized in partnership with the New York Public Theater, which staged the first performance of Lee’s series The Graduates, in 1972, and will continue to present the series under the leadership of Douglas Kaplan. “The foundation’s original mission was to have the power to make a difference in the lives of children in New York City,” said Jonathan Lee. “It has been a privilege and a joy to support the playwrights of America. It was the foundation’s vision to create a new type of fellowship program that could", "The next Biennial should take place in the spring of 2022 and will be hosted by the Smithsonian’s National Museum of American Art in Washington, DC.\n\n\nThe Smithsonian Design Museum in Washington, DC, announced today that it has appointed Laura Abraham as its next president and chief curator. The Smithsonian’s longtime curator of modern and contemporary art and the author of a number of books on the subject, including The Mother of All Cooks, The Art of Making Things (New York: Simon & Schuster, 2016), and The Clean Hour: Art and the Artifacts of the American West (New York: New Press, 2014), Abraham joined the institution\u0097which has locations in the capital city and in its former home on Michigan Avenue, in the city’s Potomac River, and in the historic city of Charlottesville\u0097in 2011. Her new role will commence in May.“Laura has been a strong advocate for building a new and robust central collection that showcases the breadth and depth of American art,” said William Langevin, chair of the institution’s board of trustees. “We are excited to welcome her to the institution and look forward to working with her.”Previously,", "The next Biennial should be held in 2021.  Prizes for the 2020 edition will be awarded by invitation only, and no individual or institution will be given a directorship.\n\n\nWorkers in the construction and restoration industries in China have shuttered their operations in the country over the last two weeks, causing economic damage and disruptions to commerce that will last for weeks or months. The country’s factories and steel mills are one of the world’s largest industrial sectors and are dependent on international trade for 85 percent of their revenue.According to the China Labor Bulletin, the country’s factories have been shuttered since April 4, when the death toll from the coronavirus reached 2,916, and the factories have been closed since March 26, when the country was battling the virus. On average, factories in China shut down for seven days a week.Around 168 factories and steel mills have shuttered in the past two weeks, with an additional 103 factories and steel mills expected to remain closed for at least six weeks. The Ministry of Public Security said on April 3 that the number of days factories are expected to be shut down and a further 163 factories and steel mills have closed in the past two weeks. On Monday, the state-", "The next Biennial should be announced soon. The Biennial has had other iterations over the years. For the Detroit Art Institute in 1976, the theme was “An End of History,” and for the Metropolitan Museum of Art in New York in 2011, the theme was “The Future is Present.” The first edition was held at the Museum of Modern Art in New York, which reopened in 1979 after a $100 million renovation and reopening of the museum. In 2012, the museum staged its last edition, “The Stanley-Klondike Art Museum,” which drew an audience of more than 300,000.\n\n\nThe National Geographic Society’s efforts to discredit climate scientist deniers and their allies in the environmental movement were recently criticized by a group of conservation and conservation-minded American artists who staged a protest at the Frisco, Texas–based museum in March. The artist’s act drew the attention of the National Wildlife Federation, which sent a letter to the organizers of the event, which called the action “incompetent and in poor taste.” In response, the Museum of Natural History in Washington, DC, issued a statement saying that it “acted", "The next Biennial should be held in 2020.\n\n\nThe Venice Architecture Biennale announced today that the fourth edition of the exhibition will take place in the Italian city of Venice from November 28 to December 5, 2020. The event will be hosted by the architectural and design studio Gramsci, alongside the company Rovis and the interior designer Mercedes-Benz, and will include more than sixty artists, designers, and curators, including Roberto Cicutto, Andrea Lisi, Pierre-Olivier Giraud, Dieter Hahn, and Katja Mescoto.“This year’s edition, which also features a new digital exhibition, was developed by Gramsci and the artist-run studio Space in collaboration with the local authorities in Venice, the city, and the region,” said Edvideo Cipolletta, director of Gramsci. “We are in the process of organising a new exhibition for the Venice Architecture Biennale, which will exhibit the work of the artists who participated in the original exhibition, and we look forward to presenting the work of the artists who have contributed to the exhibition in the new exhibition at the Guggenheim in 2021.”Venice Architecture Bi", "The next Biennial should be in 2021, and the 2020 edition will be staged in 2022.\n\n\nAmerican Hustle, an acclaimed triennial that was inaugurated by the Chicago-based artist Joi Ito as part of the Museum of Modern Art (MoMA), has announced that it is leaving the city of Los Angeles in October 2022. The announcement comes two weeks after the artist revealed that he will no longer participate in the event.“American Hustle’s decision to cancel its 2021 edition was not made lightly or quickly, but we felt it was in the best interests of the organization and the fans,” said Matt Hull, the artist’s artistic director. “At this time of critical mass for artists, we must look to the future, and not back into the past. We hope that with this year’s iteration of American Hustle—and the ensuing months and years to come—that the American Hustle team will continue to be a inspiration for artists of all shapes and sizes.”American Hustle’s board president, Mark Brodsky, said: “American Hustle’s future with Los Angeles is not in jeopardy, and we look forward to welcoming the public to the 2020", "The next Biennial should be held in the summer of 2021. The first is the third South by Southwest, taking place in Austin, Texas, in March. The second will be held in the fall of 2022. The 2019 and 2022 editions were canceled, respectively, due to Covid-19. \n\n\nThe International Center for Photography (ICP) in Paris has received a gift of more than 400 photographs by the late French photographer Georges Apostu. The eight-thousand-work collection, which includes portraits, landscapes, and collages, was given to the museum by the French governor, Emmanuel Macron, in a special agreement that established an archive for the late photographer.The gift includes photographs created in the late 1940s by French artist Auguste Renoir, 1960s by French director Jean-Pierre Ghebaly, and 1960s by French photographer Etienne Stedelot, among others that were shown in a series entitled “Oui Se Livre” (The Unseeing Eye). The exhibition of the works, which are currently on view in the Louvre, will celebrate the museum’s centenary in 2022.“The ICP collection is a great success,” Anne-Marie Petit", "The next Biennial should take place in 2020. But for the first time, the entire exhibition will be divided into two exhibitions, with Ateliers Marcel Breuer and Pierre-Auguste Renoir. It will also introduce a new section to the exhibition, called the “Avant-Garde Structures” and will also present works that are currently on view in the biennial. “While the Biennial of Modern Art is a great honor, it is only a partial record of the remains of the seventy-seventh Biennial of the Museum Stedelijk,” said curator Georges Seifert. The museum, which is currently undergoing a $35 million renovation, is still awaiting a formal designation by the European Commission. The museum will stage its first New Orleans retrospective next month. \n\n\nThe waters of the French Channel are at an all-time high, and organizers of this year’s edition of Art Basel in Hong Kong are preparing to send more than 13,500 visitors to the Palais de Tokyo in Paris, the Louvre, the National Museum of Modern Art in London, and the Louvre Palais de Tokyo next year. Nominations for the 2020 edition, which will", "The next Biennial should organize a symposium, a presentation of an exhibition, or a reading group to address the following issues: “‘The role of art museums in a post-crisis world.’” The invitation comes at a time when the European Union and the United States are preparing to launch biennials of work by a wide range of artists. The first exhibition is being organized in the United Kingdom, the United States, and Italy, which will each host an artist for a second episode.In the United States, the exhibition will consist of fifty individual works by twenty artists. The show will be shown at the Smithsonian American Art Museum, Washington, DC; the San Francisco Museum of Modern Art, California; and the Metropolitan Museum of Art, the Museum of Modern Art, the Museum of Contemporary Art, the Museum of Modern Art, the Whitney Museum of American Art, the Los Angeles County Museum of Art, California; the Portland Art Museum, the Northwest Northwest Territories, the Solomon R. Guggenheim Museum, and the Los Angeles County Museum of Art; and the San Diego Museum of Art. In Europe, the show will consist of fifty works by thirty artists and will run from May 19 to May 21.A joint statement", "The next Biennial should be held in 2021.Photos: Beth Bradley/Wang Wei/Jiang Chen\n\nWang Wei, a Chinese artist who worked in the Kunsthalle Akademie Kunst (KAM), has been denied entry to the Art Basel Hong Kong fair for the third consecutive year. On March 29, the biennial was canceled due to the threat of a fire in a neighboring building, and on Tuesday, the twenty-fourth edition of the fair was canceled as well. Wang was scheduled to present a series of paintings in the exhibition “Wang Wei: A Statement of Fact” on June 25, but the first works were not unveiled until May 20. Since the fire took place on May 5, the artist’s house in Beijing has been closed and she has been staying in a hotel as well as at home. In March, the author was charged with one count of subversion of state power and one count of defamation.\n\n\nFrance and Germany announced today that they have agreed to temporarily lift economic sanctions against Iran, lifting the restrictions for a limited period of time, in an attempt to ease the international financial crisis caused by the country’s disputed 2015 nuclear deal with", "The next Biennial should aim to facilitate an 'open and free' exhibition of the work, a new exhibition of the work, and an exhibition of the work together. The aim is that the event will be a platform for the exchange of ideas and for the exchange of knowledge.  In the interests of serving the creative and the public, we have already launched a Tumblr, on which you can also find the first two exhibitions of the biennial. In addition, you can also follow the Biennial on Instagram. The exhibition will be on view in the exhibition hall from November 7 to 11, 2020, and will take place on the twenty-seventh floor of the National Museum of Fine Arts in Beijing from November 10 to November 16. \n\nIn the latest issue of the New Zealander, Joyce Newlands, the publisher and director of the country’s premiere literary magazine, has announced that she is retiring after eleven years at the helm of the publication. She succeeds Dorota and David Gladwell, who was appointed in September 2020, and will take up the post of director of the NZM between March 2021 and March 2022.“I’ve been a New Zealand–based editor for twenty-five years and have had the", "The next Biennial should be held in 2020. The next Art Biennial will be held in 2021. The next is scheduled for 2022. The next will be held in 2023. The next will be held in 2048. Advertisement\n\n\nThe Museum of the City of New York is planning to move two hundred works by seventy-five artists, including Katherine Johnson, Alighiero Chescan, and John McGraw, from its collection into storage rooms at its new headquarters in the Tenderloin. The move will allow the museum to consolidate its holdings of the artists' conceptual practices and their final creations into one location.“We are committed to preserving the legacy of these artists as they continue to shape our understanding of how art is expressed and created,” said director Paul Mpagi Sepuya, adding that the museum will not discontinue exhibitions or create new programming without their cooperation. The move follows a wave of consolidation and auction-house activity in the city, which is undergoing a major rebuilding campaign, as New York City residents brace for the worst economic fallout from a serious coronavirus outbreak in the United States.The Whitney Museum of American Art, which recently announced it will close its doors in early March", "The next Biennial should focus on “intersection of art, culture, and technology.”\n\nThe first edition of the Fine Art Biennial was held at the Bonner Museum in Vienna in April 2019. The twenty-one-day event, which featured eighty-six works by fifty-four artists, featured work by artists from sixty-six countries and territories. The event was organized by the Bonner Museum in conjunction with the Max Meyer Foundation and the Max Höllendorfer Foundation for Contemporary Art. The submissions of works by artists also featured in the museum’s exhibition “The Collectors” (2019–20) and “Art, Technology, and Technology” (2015–16) respectively.\n\n\nThe Smithsonian’s National Museum of African Art (NMAA) in Washington, DC, announced today that it is preparing to reopen to the public in March 2021 following a $300 million expansion. The reimagined institution will boast a more than three hundred-foot-wide, three-story-high, glass-enclosed, circular-glass-enclosed, glass-enclosed vault, and will incorporate the largest contemporary installation in the United States.“The renovations to the museum have revealed", "The next Biennial should be held in 2019. \n\nThe American Museum of Natural History, which has been closed since December 29 because of the Covid-19 pandemic, announced on Friday that it is reopening in March. The museum has been closed since March 14 for construction, maintenance, and operations. The museum is also planning to reopen in late April or early May. “The American Museum of Natural History is reopening in March with the intent of reopening in May,” director Christopher Johnson said in a statement. “We will have more to share about this and other topics in the coming weeks.”Johnson added that he anticipates an additional $10 million in revenue for the 2019–20 season, which is expected to run from March 15 to March 21. The institution also expects to make a profit of $6 million. Commenting on the reopening, museum director Anne-Marie Olszewski said: “We are thrilled to be reopening at a time when our tour guides are telling us that March is the best time to visit the museum. We are confident that with the new spring cleaning schedule, the museum will be able to welcome visitors again and reopen with the full power of its", "The next Biennial should be held in 2020, 2020, 2020.  The Ordinary World is on hold. The Bamboo Ceiling is on hold. The Basel Show is on hold. The Brooklyn Museum’s exhibition of “Bessie Smith” is still on schedule. The Bronx Museum of the Arts will continue its programming of “Bessie in Paris.”In an email sent to the public, PRIDE Executive Director Kimberly Abel wrote: “We are grateful to the thousands of Pride supporters who have supported this exhibition since it launched in 2020 and to the many artists who have contributed to its successful launch in 2019. We are all investing in delivering a truly inclusive, innovative, and contemporary exhibition that reflects the richness of the Pride community.”\n\n\nThe Metropolitan Museum of Art in New York has announced that it has received a $10 million donation from the Andrew W. Mellon Foundation in support of the construction of a new campus for its Rema Hort Mann Center for Contemporary Art. The gift will enable the organization to extend its existing lease at 600 East Seventy-Third Street, which will be completed in 2021, and undergo a $10 million expansion. The extension is part", "The next Biennial should focus on the history of the living and the dead, with a particular focus on the art of the body and the arts, including architecture, landscape, and sound. This will be the year to present a new digital version of the exhibition, which will comprise many works by the artists who had the most to say about their lives and cultures, and to engage with their art and their lifetimes.”\n\n\nOn Monday, the European Court of Art upheld the convictions of three Tunisian artists who were found guilty of painting a work that was meant to represent the body politic’s collective memory.Imad Mughni, Saad Al-Khatib, and Alaa Al-Khatib, who were convicted of violating a law that requires a minimum of six works by a single artist to be included in a major collection, were sentenced to a total of three and a half years in prison.Two other convictions were also overturned on appeal, and two other charges were dismissed. Al-Khatib and Al-Khatib were acquitted on appeal, but Al-Khatib was acquitted of the third count because he had been imprisoned for only two years, while Al-Khatib and Al-Khatib", "The next Biennial should be ready by the end of the year. We will bring you more information as we receive it.\n\n\nThe Solomon R. Guggenheim Museum in New York has released the results of its  designated designating August 17 as the date for the museum’s reopening, which has been suspended since June 30 due to the Covid-19 pandemic. The institution opened in April 2019, following a $1.2 billion expansion that added a new floor plan and expanded the existing Museum of Modern Art, which has been closed since March 19. The new Guggenheim was originally scheduled to open in April 2020, but the work of sculptor Norman Rockwell and his colleagues, including John Cage and Hans Ulrich Obrist, and the delay led to the museum’s reopening on April 9, 2021. The reopening date of August 17 has been updated to reflect the reopening of the Guggenheim’s new location and the opening of the Central Library’s inaugural season.The redesigned Guggenheim opened on June 2, 2019 with an exhibition titled The Transformation of Concept,” featuring works by artists such as R. H.", "The next Biennial should include a review of the works that have been selected as biennial winners and how they will be presented in the biennial. Among the works being discussed are Allmans work \u0097\"The Making of American Art\"\u0097which explores American art from the 1870s through the present and was presented at the 1904 Biennial; Michael Kaye’s depiction of the American Civil War in his first exhibition at the County Museum of Art; and Herman Hunter’s Tattoo, which is a composite of work by four artists who created the work as well as a new installation that will have the final touch of the artist’s tattoo. The 2019 biennial will take up the theme “American Art: Its Legacy, Its Past, and Future,” which was first posed by curator Amber Lyon in 1976.The 2019 biennial will be curated by Laura Topping, curator of contemporary art at the Smithsonian American Art Museum in Washington, DC, and will be presented by Riccardo Spagnoli, curator of the American architectural arts at the Museo Astilad, Spain, and the New Museum in New York.\n\n\nThe New York City Department of Cultural", "The next Biennial should be inaugurated by an exhibition comprised of a selection of works and twenty-one of them . . . The exhibition should be commissioned by the architect “Riccardo Logothetis.” Logothetis, who is collaborating with Zaha Hadid on a new exhibition entitled “Art of Life” in Lisbon, will present a selection of “Fast Forward” (2013), a work which draws from contemporary materials, including metal, concrete, and riverbeds, and will present a “spring of life” sequence, designed to resonate with the current state of contemporary art, during which Ai and Zhuang will both reenvision the “modern” in the form of a series of three exhibitions. Commenting on the project, Logothetis said: “We are both deeply inspired by the simple yet powerful freedom of art as a tool and by the powerful visual feedback of the human body that makes art work.”\n\n\nThe Metropolitan Museum of Art in New York has received a major donation of twenty-eight works from the estate of the late French colonialist René Magritte. The works, which were ultimately", "The next Biennial should take place in 2021, according to a statement by the Arts Council in London. It will be hosted by the Tate, and will take place in the Tate’s existing premises in London. The event will also feature an expanded programme, which will include more public activities, a reopening of Tate Britain in 2020, and the reopening of Tate Modern in 2022.The statement continued: “We are looking forward to the 2019 iteration of the theme, which will allow Tate Britain to mark the centenary of the birth of British industrialist and philanthropist Sir John Kingman, and to the 2020 iteration which will include an exhibition of new works by the new and established artists, new programming, and new exhibitions and public activities.”The announcement of the 2019 biennial coincides with the opening of Biennale 2012, which explores themes of history, the environment, and art through the exhibition “Past, Present, and Future.” The exhibition, which explores themes of history, art, and the environment through the exhibition “Tracy McVeigh,” is on view through June 2.\n\n\nThe French Ministry of Culture is trying to push back the launch of a new cultural initiative devoted exclusively to the representation of", "The next Biennial should take place sometime in the late spring of 2020 and will feature both new anime and live action works by over seventy artists, including Eiichiro Oda, Takeshi Kitano, and Tanya Guggenheim. The exhibition will be based in the Miyazaki building, a contemporary art museum in the city of Okayama, Japan, and will run concurrently with the Tokyo Triennale and the Tokyo Metropolitan Museum of Art.Guinness World Records has announced that it plans to suspend its annual judging awards for the third edition of the Guinness Book of Records, which was held in New York from March 13 to March 15, 2020, and will instead focus on revising its 2018 list of finalists. In a statement, the company said: “We are considering a number of factors in order to ensure the best possible outcome for our artists and the record of the Biennale in 2020. ”Guinness World Records has been working toward revising its 2020 list of finalists since February 2019, following a public consultation on the subject with more than 1,500 participating arts professionals. The deadline for submissions was March 2 and the jury\u0097which consisted of Peter Dewar, director of the Center for Contemporary Art at the University of", "The next Biennial should take place in early May, and the event’s first edition will be held at Gartenstadstrasse 8, the former Kunsthalle Basel, in January 2020. The next IMF rating cycle will be held in early June. The next edition of the US pavilion will also be held at the Metropolitan Museum of Art in New York, the January 2020 edition at the Metropolitan Museum of Art. The next edition of the International MOCA will be held in June. The US pavilion will also host a retrospective of the artist’s work in July 2020.\n\n\nThe Los Angeles County Museum of Art (LACMA) announced today that it has received a gift of more than one hundred works by a number of contemporary artists in the works’ collection. The gift includes works by artists such as J. Alexander Hoehn, Joyce Carol Oates, Peter Andre, Cécile Barone, and Ray Luo, as well as a selection of works created in the late 1960s and early 1970s.The institution also revealed that it is planning to move the collection to a new home in Downtown Los Angeles, which was recently renovated by the architect and urban designer", "The next Biennial should be held at least twice a year. The theme of the next exhibition should be something like “The Ebb and Flow of Waves.” The theme of the exhibition should be the energy of the sea. The theme of the next performance should be something like “The Path of Beauty.” The theme of the next exhibition should be something like “The Motion Picture.” The themes of the upcoming menswear shows must be something like “I.D.,” “Tit and Tatami,” “The Sculpture of the Republic,” and “Celestial Flight.” The theme of the upcoming opera will be “The Desolation of the Phoenix.”Christo, who cofounded the sculptor residency in London in 1963, is a pioneer whose work explores the human condition in a stylistically experimental way. He is best known for his work depicting the prelude to a cosmic event, the cataclysmic end of a solar system in which the sun and the planets are falling apart. The sculpture and performance work of his career has been inspired by his experiences in the late Ottoman Empire, where the artist has lived", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) has announced that it will redesign its campus with a new 'mission statement' in 2022. The redesign, which will begin with the construction of a new visitor entrance at the institution, will be led by a team of four artists, including David Alvarez, Laura Owens, and Benny Lee. The team will also incorporate a greater variety of contemporary art and will incorporate elements from the institution's collection, including new works by artists such as Paul Gauguin and Pierre-Auguste Renoir, and will include a library that will host the museum’s permanent collection, including works by artists who have recently been excluded from exhibitions.The redesign will incorporate more contemporary modes of transport as well as an increased emphasis on social justice. The redesign will also prioritize sustainability and sustainability-related work in the museum. The redesign will prioritize the conservation of the museum’s collection and its collection experiences in the museum. The redesign will research the conservation of works by artists whose works are currently in storage and will present the team with a project that will act as a prototype for the museum’s new green spaces.“The new mission statement is an evolution of MoCA�", "The next Biennial should be held at the Museo de Arte Contemporáneo Especial de Barcelona, in 2021. The Independent Festival is currently co-organising with Madrid’s FEMMEIE, and will present the new edition in March. In addition to its Museum Biennials, the fair will also present a number of exhibitions organized in response to the theme of its second edition, which will be held at the Palacio de Arte de Barcelona in 2019. The exhibition will be organized as follows:The exhibition will include work by 151 contemporary artists and designers and will be directed by Junot Gonyo. Sao Paulo and Rio de Janeiro will be represented by Marcelo Maio and José María Azar, respectively. Brazil will be represented by Santiago Oiticica & Fotologia, Brazil; Brasília; Nova São Paulo; and Nova M Aspens, Brazil.\n\n\nNadia Tanay, an American artist and educator, has won the Renzo Piano Award for Excellence in Arts and Sciences. The accolade is made in recognition of her work’s connection to modern art and science,", "The next Biennial should take place in the city of Nantes in France in 2019. \n\n\nThe Institute of Contemporary Arts (ICA) in Vienna announced today that it has appointed Alexandra Zobak as its next director. Zobak comes to the ICA from the Royal Academy of Arts in Paris, where she has served as the prize director for the past two years. During that time, she has organized sixteen exhibitions, including “Alexandra Zobak: The Life of Party” (2015); “Avant Garde” (2017); “Museums and Creative Research: Art and the Future of Art” (2019); “Zacharie Ooi: Architecture as Monument” (2019), and “Viktor Salle: The Rise and Fall of Modern Art” (2019). During her tenure, Zobak has also shown the work of sixty artists, including the Danish artist Lars Berggruen, the Polish sculptor Wojciech Szczepanowski, and the Italian architect Riccardo Poli.“It is with great delight that I welcome Alexandra Zobak to the ICA,” said ICA president Monaghan", "The next Biennial should be announced shortly and will take place between October 27 and November 3. The theme, “Atoms of Light,” will be taken from the original show, which is scheduled to run from March 19 to March 21. \n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it is preparing to hold an emergency art conservation conference next week in order to help cultural organizations protect the cultural heritage of their buildings and preserve spaces for performances, performances, and other events. The next iteration of the ­Convention on Art in the City of New York will be held at the Metropolitan Museum of Art (MoCA), from March 19 to March 21.In a statement issued by the DCLA, which represents the city, the department cited the recent Covid-19 pandemic as a reason for the reopening of several museums, including the Metropolitan Museum of Art, the Bronx Museum of the Arts, and the Whitney Museum of American Art, among other institutions. But the majority of museums are not reopening and will remain closed through at least April 15. “We are preparing to mobilize to protect, preserve, and promote the cultural and historic heritage of our cities, and are working with policymakers and the broader", "The next Biennial should be called for the museum’s collection and exhibition program, as well as the collection and exhibition of works from its collection and exhibition program, sometime this spring. The museum plans to mobilize a combined 2,500 art professionals to participate in the event, which will be held on the museum’s first floor. “The museum is going to continually leverage our collections and our exhibitions to inspire and inform the public, and to create new stories in the exhibitions, and to showcase our exhibition-based programs,” Mark Shaw, the director of Rockefeller Center, said. The new pavilion will be inaugurated by an exhibition featuring more than fifty works by the curators of the museum’s first exhibition, “Movements of the Body: Art and the Body,” which opened in 1994. The museum will also inaugurate the new pavilion with an exhibition of contributions from artists and collectors, including Charles A. Birnbaum, William Eggleston, and Mary Lo Pomeroy. The other two-hundred-and-sixty-second iteration of the Whitney Biennial will be held at New York’s Lincoln Center, in January 2021. The restructure of the", "The next Biennial should take place sometime this year. The captions on the exhibition, which will be curated by a group of South-East Asian artists led by Hsu Kwai Tak, will be translated by a group of curators from the Asian Art Museum in New York. The theme of the 2019 edition is Inspiration, and the importance of the concept of inspiration in art. The show will be divided into subjects that are related to art, such as design, architecture, and cuisine. The first exhibition will be held in late March or April 2020. The second Biennial will unfold in late April 2021.\n\n\nThe National Gallery of Canada (NGC), in Ottawa, is revamping the way it presents new works by African American artists. Its new curriculum vitae, which will be introduced in April, will include two hours of lectures by two additional African American artists: Billy Ray Cyrus and Tonia Benavidez, who will lecture in April and May 2020.“This is an unprecedented time for us as we embark upon our redesign of the NGC,” Catherine Montpetit, director of the NGC, told the Art Newspaper. “The redesign of the NGC is not", "The next Biennial should be held in 2020.\n\n\nThe British artist Mark Elder is suing the Metropolitan Museum of Art in New York over a painting it did not sell and is asking for $10 million. The painting, a piece titled Sextant (The Shadow of the Sun), was sold in 2006 but never became part of the museum’s collection. Instead, the piece ended up in the private collection of collector Mark Elder, who was on the board of trustees of the Metropolitan Museum, when it sold it.The lawsuit alleges that the museum failed to disclose that the painting was “symmetrical” and “non-rectangular” and that the work was “deliberately contrived” by Elder, who also painted the work in a very limited palette. The suit also charges the museum with fraudulently claiming that the work was purchased by Elder from a third-party, an apparent attempt to defraud the public.“The defendants have systematically removed Mark Elder’s works from exhibitions and from the public collection, with the knowledge and approval of the board of trustees of the Met, and have done so in an effort to discredit and discredit their critics,” said Christopher Wool, the attorney", "The next Biennial should be held in 2022; the custodians of the site, the Künstlerhaus in Freiburg, are currently negotiating with the city of Frankfurt, which will own the festival as well as the property it will be staged in, about the redevelopment of the campus.The exhibition will be hosted by the Hermitage Museum in Kassel; the Mainz Galerie in Mainz, Germany; and the Nemer Museum in Bergen-Belsen, Germany. The selection of the artists chosen for the event coincides with the launch of the “Battle of the Bands” exhibition in Berlin, which features works by twenty-four artists in the upcoming Art Basel Berlin. The exhibition will feature the work of seventy-five artists from forty-seven countries and include works by artists such as Lanugoa, Marx, Cátia, Todos, Pierre-Auguste Renoir, and Pilar Cornejo-Real.The Künstlerhaus and the Künstlerhaus Freiburg will jointly hold an exhibition in the Hermitage Museum on Friday, September 16, 2019. \n\n\nThe museum’s collection, which includes more than four", "The next Biennial should take place in Madison Square Garden in 2021. “I’ve been involved in and involved with the city of New York my entire life and have been a lifelong fan of the art of our time,” said Lewis Tam, the executive director of the Museum of Modern Art, which is currently seeking a new location for its fifth exhibition series. Tam, who is also a cofounder of the Harlem Arts Community Development Corporation, is urging the city to take the Fifth Avenue Armory’s renovation and expansion project, which involves adding 250,000 square feet of exhibition space, a restaurant, and a public green space, and turn the space into a public park.Next year, the museum will unveil its first new sculpture by artist and activist Kiowa Iyeko. “In the process, we are redefining the context in which the Armory is envisioned,” Tam told the New York Times. “We are open to the idea that what we are doing is revolutionary, and that the city’s art institutions can become important instruments for social change.”\n\n\nArt Basel Hong Kong has announced that it will not renew the contracts of models from the company’s California branch, leaving", "The next Biennial should be held in 2022 and will be hosted at the city’s Museum of British Art, which is currently undergoing a $1.5 billion expansion. The 2019 event was hosted at the Getty Center in Los Angeles. The museum expects to begin welcoming visitors in 2020.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has announced that it has received a $1.3 million donation from the estate of the late collector and philanthropist Howard Zinn, who passed away on January 13. The gift was made by his daughter Mia, who will assume the family’s left-over property, the Howard Zinn Center for American Art, in honor of her father’s passing. The gift comes amid a major restructuring of the Met, which is facing a $1.5 billion debt service on its $1.3 billion expansion plan. “Howard Zinn was one of the most generous, forward-thinking, and visionary collectors of American art in the twentieth century,” Mia said. “I was privileged to work with him and his daughter to develop a compelling and visionary collection. His work made a lasting impression on me and I will always cherish the memories of our many conversations over art", "The next Biennial should take place in 2020.\n\n\nThe Museum of Jewish Heritage (Museum Stony Brook) has appointed Andrew W. Mellon as its new chair. He succeeds Sady Doyle, who retired in January 2019. Mellon joins the institution from the City Museum of New York where he has served as deputy director since 2007. He succeeds Doyle who will continue to serve as director of the museum as the institution prepares to reopen to the public in 2021.“Andrew brings a wealth of experience, knowledge, and a commitment to innovation to the MGH,” said director Nicholas Negrete. “Although he has extensive experience in many fields, Andrew is uniquely qualified to lead MGH into the future as we enter the fourth decade of our new century. We are honored to welcome him to the MGH and are confident that he will further enhance the MGH’s mission to present the most compelling contemporary art.”Commenting on his appointment, Mellon said: “The MGH’s team has been working hard to reinvigorate its collection, which is a strong point of differentiation for many art museums. With the completion of the $150 million Rebuilding the MGH, we are committed to continuing", "The next Biennial should include a discussion of the history of the exhibition, and the next should turn to a list of contemporary curators who have influenced its development. To date, the biennial has only presented a single work by a single artist, and all of its works were created in the 1950s, the early 1960s, and the 1970s. Until now, the biennial was a collaboration between the gallery and the poet Pia Fries. This year’s edition will be held at the Museum of Contemporary Art Berlin, and will run from March 6 to March 8, 2020. Inaugurating the Biennale are the first exhibitions organized by the South African photographer and former Homebush performance artist Tobias Montgomery. Montgomery’s latest work, The Slums of the Third Reich (1988–1999), is currently on display at the Israeli Museum in Jerusalem. The exhibition will also introduce the world to the work of Kinde Ahtisaari, a Nigerian American artist whose large-scale paintings, sculptures, collages, prints, and animations explore the concept of the 'slum.’s significance in American and European visual art and will further develop the Bienn", "The next Biennial should be held in 2021. This article was originally published by the Art Newspaper.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is developing a new strategy to conserve and reuse works from the museum’s collection, which currently comprises more than 2,500 artifacts, and is working with the Los Angeles County Museum of Art (LACMA) to develop a new master plan for the institution.According to LACMA’s Frank Gehry Foundation, the strategy will “shape our future relationship with the world as we know it—by equipping us with the tools and knowledge to drive thoughtful, collaborative, and innovative conservation and reuse.” The foundation will also work with museums to develop a conservation framework for future exhibitions, education programs, and other programs, and will collaborate with local, state, and federal policymakers to craft a conservation plan for the city of Los Angeles’s 375-acre campus.“With this new strategy, we want to re-create a more meaningful way for our visitors to the Museum of Contemporary Art to return to the museum.” Basel Blankenship, the director of the Museum of Contemporary Art, said: “This is", "The next Biennial should be held the same weekend as the next, and the following year, and should take place in the same venues: the Museo de Cultura de Belem, Braga, Madrid, the Museum of Contemporary Art, Las Palmas, and the Museum of Modern Art, New York.  In an interview with Artforum, Mariano Bogdan, the president of the Venice Biennale Foundation (BGF), described the event as a “historic milestone” that will “strengthen the museum’s role as a global bridge between art and practice.” The exhibition will return to the Venice Architecture Biennale in 2019.\n\n\nThe Haus der Kunst (HDK) in Munich has appointed Paul Meissner as its new director and curator-general. He succeeds Christoph Meissner, who has served as director of the central museum since 2008, and will take the helm from Meissner. Meissner will assume his post in January 2020. “Paul has the ambition and the ability to build both a strong and dynamic art programme at the HDK and a strong and vibrant art city in the city of Munich,”", "The next Biennial should be held in 2021, the organizers said—but the date has yet to be set.\n\n\nThe Metropolitan Museum of Art in New York announced today that it has received a $12 million donation from the Fred and James L. Knight Foundation, a New York–based organization that supports arts institutions in need of financial assistance, and will award the organization $10 million in support of its 2018–19 fiscal year. The grant was made through a partnership between the organization and the L.A. County Museum of Art (LACMA), and will help LACMA in its quest to secure the L.A. native Jodi Lynne to the keynote role in the upcoming exhibition “Fred and James L. Knight: New Artists in the Age of Art.”The exhibition will feature fifty artists, including Julie Dash, Jeremy Deller, Jhokey Park, and Rosalind Russell, and will open on November 3. The exhibition will feature “Uka and the L.A. Vampires” (2019), a selection of work by Chantal Fouch�s paintings. The event will also feature a retrospective of the works of Gabriel B. Braga, F. Clement, and M", "The next Biennial should be announced by August and will include a selection of work by seventy artists, including Mihai Csokai, Domenick Dolce, Daniel Fierer, and László Hansen, and will be held at the Museum of Modern Art, New York, from October 28 to November 5.The biennial was established in 2010 to commemorate the centenary of the founding of the International Committee of Museums, who advocated for the reorganization of the museum industry, which would have led to the creation of a new national museum. The idea was to consider the evolution of contemporary art and how it relates to European and cultural heritage, the history of art, and the contemporary world. The institution has since expanded to include a commissioning board and a two-year residency program. The third and final Biennial, set to open in 2021, will focus on the history of art with a particular focus on the visual arts. Its publication will be delayed to 2020, coinciding with the ninety-ninth Olympiad in Florence.\n\n\nThe Museum of Modern Art (MoMA) has appointed John Colombo as its next executive director. He will take the helm from Mary Pat Clarke, who has served as the museum�", "The next Biennial should be held in the fall of 2020. In an interview with the Art Newspaper last year, he also said that he hoped to start a new organization that would organize workshops and seminars around the theme of reinventing the human organism.\n\n\nThe Institute for Contemporary Art (ICA), Pennsylvania, announced today that it is expanding its program of exhibitions, residencies, educational programs, and partnerships with local, regional, and international artists. The project, which began in 2020 and runs through 2022, will include a number of new initiatives that will engage with local communities and are modeled after the institute’s ongoing partnerships with artists and local arts organizations in Philadelphia.“We are thrilled to be able to present an exhibition at the Institute in 2022 and to continue to present the series of exhibitions each year,” said ICA director Daniel H. Weiss. “The extension of the series is a reflection of the Institute’s commitment to supporting emerging artists and artists-driven projects. The series will exhibit a fresh approach to the art world, emphasizing the creative and design aspects, while still incorporating the exploration of the natural sciences and humanities in a meaningful way.” The series will include fifteen new works by ten artists, including Mo Farah", "The next Biennial should include a review of the recent exhibitions in the exhibition field; a discussion of new proposals and programs; and an introduction of new works. \n\n\nThe Centre Pompidou in Paris has received a gift of more than thirty thousand photographs from the artist Georges Apostuilu. The museum acquired the works from the Sudan­-born, French-born, photographer and collector François Origlèvre in a show at the Contemporary Arts Centre de Strasbourg (CAS) in 2015.“Aphístu’s photographs are considered in the first place as a close reflection of an ideal form and a particular orientation: a very strong intuition of the human form in the process of photography,” said curator Jean-Baptiste Astour-Maréchal, who curated the show. “Their presentation in this show was made on the occasion of a new work, ‘The Operation of a Mood,’ which will open this year’s iteration of the exhibition. The work consists of a series of portraits of individuals in the cultural sphere, including Léger Baroque, Gérard Bouvet, Jean-Pierre Burg, Pierre Gauche, and Pierre Huyghe,", "The next Biennial should be held in the autumn of 2020, in the autumn of 2021, in the autumn of 2022, and the biennial will be completed by the autumn of 2022. “We are taking great care to ensure that the forthcoming exhibition’s programme and exhibitions align with the themes of the previous two, and we hope that the public will welcome it with enthusiasm and respect.”The reopening of the museum will coincide with the opening of the five-thousand-work exhibition “Revolution: Artists and the New Politics” at the Voorhees Museum of Art in Melbourne, the Melbourne Museum of Art (MMA), and the Australian National Gallery of Art. The 2010 exhibition, titled “Art and Politics,” was organized as part of the Biennial and was co-chaired by Michael Collins and John McKinnon, a curator and writer. Later, in 2011, the museum staged a “Future Present” exhibition, titled “Anatomy of an Exhibition,” which examined the development of art in the twenty-first century. \n\n\nAfter the Massachusetts Museum of Contemporary Art (MassachusettsMCA) in Boston announced on Friday that it is seeking", "The next Biennial should be held in the summer of 2021. The twenty-fifth will be held in the fall of 2021, and the twenty-eighth in the spring of 2021. The revival of the festival, which has been held each year since 2009, will be supported by a $5 million gift from the Rockefeller brothers. The donation will enable the museum to expand its display of the work of Huw Edwards and Robert Irwin. The biennial will also host the exhibition “Harlan Archibald: The Other,” which will feature the work of a team of twenty artists, including Marilyn Atkins, Robert Irwin, and Robert Johnson, and will be organized in partnership with the artist-run nonprofit Art in America, which has been staging the event in New York for more than twenty years.\n\n\nThe Art Newspaper has announced that the triennial “Triumph of the Muse” will be held at the New Museum in New York from March 13 to March 15, 2020. The event will be centered around an exhibition of work by sixteen artists, including Alice Aycock, Christo, Elisea C. Paz, Ian Cheng, Tomi Olsson, and Tiwani Nalas, and will take", "The next Biennial should be held in 2022. “A century from now, I am optimistic that we will be able to make a new 'Amerika’s Anthropocene,” said Virgínia de Sousa, President of the Congress of the Americas, in a statement.At the same time, De Sousa emphasized that a new constitution should be crafted to address the ongoing displacement and climate change that Indigenous nations are facing.“The future of our planet and our inhabitants is at stake,” she said. “A new constitution must be forged that ensures Indigenous nations have an independent existence on Earth, one that also expresses the courage and the determination of the peoples of South America and the Americas to live together in solidarity with Indigenous peoples around the world.”\n\n\nWhile the California Polytechnic State University in San Luis Obispo, California, was working to overhaul its campus in preparation for its reopening in 2020, the university was also preparing to welcome visitors from the Far East. The reopening will coincide with a wave of construction projects in China, where the country is currently constructing a massive steel and concrete megastructure for a new capital city.The $7.5 billion Beijing City", "The next Biennial should be held in 2020. The institution is currently negotiating an extension to the current ten-year cycle.\n\n\nLos Angeles’s Museum of Contemporary Art (LA MoCA) announced today that it will continue its Pacific Standard Time (PST) initiative, which aims to draw the city’s attention to contemporary art, with a new exhibition, “Pacific Standard Time: Stories,” which will run simultaneously at the institution, the Los Angeles County Museum of Art (LACCA), and the San Diego Museum of Art (SDMo). The exhibition celebrates the work of seventy-five contemporary artists from around the world. The show is organized by artist Michael Mitchell and will run until November 21.“Pacific Standard Time’s’s’ stories are rooted in the idea that understanding and inhabiting art is a central task of the human condition,” said Mitchell. “These stories often feature artists whose work is in some sense an extension of our own, who are at the same time borrowing from and transforming the practices of contemporary art and from our own practices. They are works that challenge our own practices in ways that challenge the very foundations of our identities.”The show will examine themes of", "The next Biennial should be staged in 2021. The next Art Basel Hong Kong is set to take place in 2022. The next Seoul Art Biennale is scheduled for 2020. The list of 2019 and 2020 biennials is as follows: 2019: Art Madrid, Art Basel Hong Kong,  Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art Madrid: Art", "The next Biennial should be in September 2020.\n\n\nThe London-based nonprofit Art Project has named the twenty-third edition of its annual fundraiser, Art in the City, the theme \"Art in the City, and the Future of Politics, Art in the City: Politics and the City, 2020.\" The biennial will feature fifty artworks by twenty-nine artists, including Alice A. Baron, Tunga A. Marchetta, Rina M. Najar, Adam Martin, Alice A. Brewer, and Adam Carsey, and will run from September 10–September 12, 2020.The festival consists of performances, lectures, tours, screenings, and public lectures by artists from forty-five cities and six countries. The event will take place at more than 250 venues across London and will run concurrently with the annual London Assembly, which is slated to take place in May.The institution also revealed that thirty-six artists will be featured in its 2021 edition, which will focus on issues of sustainability. Among the artists selected for the event are Wolfgang Puck, Janice Pind, Paul Mpagi Sepuya, Angus Scott, Landa Suárez, Rirkrit Tiravanija, and Susan Takeda. The seventy-", "The next Biennial should take place in 2020. The biennial will be comprised of twenty-four artists in twenty-six cities around the world. Its inaugural iteration was held in 2022. The 2019 event, titled 'Lessons and Notions,” is now slated to run from January 28 to March 5, 2020.\n\n\nThe Museum of Modern Art (MoMA) has developed an innovative new way to support Los Angeles’s arts and culture. Inaugurating the museum’s new six-story, fifty-one-thousand-square-foot building at 900 South Santa Fe Avenue, the institution will offer free admission to New Yorkers through the institution’s newly redesigned galleries and will host two free concerts.In a statement, the museum said: “This is a transformative year. The future of the arts and culture in Los Angeles is at risk as we confront a resurgent and more aggressive China. We are excited to support the local, independent, and public galleries and artists in the City of Angels by offering them three years of free admission.”The move follows MoMA’s announcement that it would begin charging admission in January 2020, and follows a wave of anti-establishment uprisings that have swept", "The next Biennial should be held in 2021.\n\n\nThe Walt Disney Museum of Contemporary Art (DMA) in Los Angeles is planning to open a new location for its 70-year-old collection, which recently received a $2.5 billion overhaul and reconstruction project, in the city in August. The new space will be named the Disney Contemporary and will boast a new exhibition series, larger theaters, and an increased collection.The refurbishment project, which also included the addition of three new galleries, was part of the $4 billion overhaul and reconstruction plan approved by the city council in July. The historic residence, which comprises a 1935 expansion of the Disney Studio, is located in the heart of Los Angeles and is a major draw for visitors from coast to coast. The new DMA, which will sit on the ground floor of an industrial neighborhood, will offer a new fifty-three-minute animated film, the first of three planned, will showcase Under the Black Sun, and will host a series of concerts and other events.The refurbished DMA’s collection is divided into twelve galleries. The institution will be inaugurated with an exhibition of photographs by Walt Disney, who is best known for creating Disney’s original animated films, which have since", "The next Biennial should take place in 2020, with a budget of $57 million.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles plans to move to a new twenty-four-hour, seven-day-a-week, 365-day-a-year schedule in 2020, effective June 1. The move was made in response to the city’s demand for longer days and more frequent programming. According to the Los Angeles Times, the museum anticipates spending around $100 million to remodel the building, which it describes as a “monument to the city.”The project, which will involve the demolition of nearly three hundred buildings in the city, is part of an ambitious plan to reduce the city’s footprint and adapt to the needs of a rapidly growing region. Mayor Eric Garcetti announced the plan in March. “Our current system is not working,” Garcetti said at the time, “and it’s going to continue to break down. We need a new way to organize and to think about events, to think about what kind of world we want to create for our city and region.”Construction is expected to begin in the spring of 2021 and be completed"]