["The next Biennial should be held sometime in the spring of 2021.  A 2017 symposium on the exhibition, titled Art and the Spheres, was held outside New York and was attended by more than twenty curators. The 2019 edition featured work by seventy-two artists, and the pieces exceedingly provocative. The exhibition also introduced new principles and new ways of organizing events. The 2020 edition will be the last before the Museum closes indefinitely in March. Some of the artists who have expressed interest in the biennial are Olu Oguibe, Jumaane Thapa, Sibyl Aboud, Elina M. Zuber, and Kaori Takala; a selection of contemporary works by Renzo Piano; and works by Rainer Bolle, Hsin-Chien Huang, Kiki Smith, Barbara Shaw, and many more. The next Biennial will be held in the spring of 2022.\n\n\nThe Michigan Museum of Fine Arts (MFA) in Ann Arbor has appointed Stephen Rooney as its next executive director. He will be responsible for continuing the work of the museum’s board of directors, which was abolished in March 2019, and integrating the museum’s collections and programs", "The next Biennial should take place in 2020, and the following year in 2021. The first show was staged by the Los Angeles County Museum of Art (LACMA), which also has the space to house the institution’s permanent collection.The Los Angeles County Museum of Art (LACMA) was chosen as the venue for the 2019 edition of the Biennial, which was originally scheduled to run from October 20–November 3. The venue was chosen by a panel made up of David Winton, LACMA’s director of conservation and restoration; Rebecca Henry, the director of the Center for Art and Preservation at the Los Angeles County Museum of Art; and Vinnie Bagwell, the head of the LA County Art Museum.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a $125,000 donation from the estate of Mitchell and Virginia Bridges. The donation, which was made on behalf of their son, Alexander, who passed away on June 25 at the age of sixty-eight years old, came courtesy of a $20,000 donation made in honor of his parents’ generosity, which also went toward the purchase of the land where the museum will build a new home.“Mitchell and Virginia", "The next Biennial should be held at The Institute of Contemporary Arts in London between May and November 2020, and the first in Zurich between November 2020 and March 2021. \n\n\nThe Center for the Study of Modern Art (CSAAM) in New York announced today that Marc-Olivier Mouret, who helmed the museum for twenty years, has died at seventy-two years old. Mouret was one of the curators who introduced David H. McCandless to the art of mixed-media performance and the cultured human condition. The six-time winner of the Prix de l'Art et l'Human Sciences, 1963–1965, and the 1951–1953 recipient of the Prix de l'Art et l'Humanistie, both died of natural causes at their home in Manhattan on Friday.Born in Paris in the early 1940s, McCandless moved to the United States at age ten. Upon hearing of the launch of “Studio Museum in Harlem” in 1967, McCandless immediately requested the modernist building’s installation space, which was at first denied. But after he and a small group of other artists assembled a show of Work in the Window to protest the museum’s “", "The next Biennial should be held in 2020.\n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed a new chief executive, Martin Rimmer, who will assume his post at the institute in January 2022. Rimmer joins the institution from the Royal Academy of Arts, where he has served as chief executive since February 2019. Rimmer will be accompanied in the role by an assistant chief executive, Clare Rowland, who will assume her post in March 2022.“Martin Rimmer is a seasoned and distinguished curator whose career has included a number of significant exhibitions, including the first solo shows in the United States at the Institute of Contemporary Arts in Manchester in November 2017 and ‘Lumia’s ‘Laundromat’,” which opened in March 2018. He currently serves as director of the Institute of Contemporary Arts, Manchester.Commenting on his new role, Rimmer said: “I am incredibly proud to be the new director of the Institute of Contemporary Arts, and to have moved to finish the work of improving the ICA through the retirement of director, Ruth Hunt; expanding the ICA’s reach by launching new projects and exhibitions; and securing the ICA’s future by securing the 2019", "The next Biennial should take place at least ten years from now, and should focus on the themes of the exhibition, the programs carried out at the exhibition, and the representations made in the exhibition.Al Jazeera America, the parent company of Al Jazeera, the English-language broadcaster that is owned by Qatar, was awarded a $10 million contract to host the 2022 edition of the Sharjah Biennial, which is currently in the works of the Sharjah Art Foundation (SAF) and is expected to open in the spring of 2022. The contract is for the remainder of the year, and Sharjah Art Foundation president Ismaila Al Qasimi said the organization hopes to stage the exhibition in the first half of the year.The organization is working with a team, headed by architectural and landscape architect Haroon Mirza, who has worked in Dubai for the past ten years, to redesign the Sharjah Art Foundation, which is located in the Sharjah Art Foundation District, into a more culturally relevant venue. The project, which involves the creation of new works and will be completed by the end of 2020, will be part of a five-year plan that aims to create a more harmonious environment for the art of the arts.The design of the pavilion dates", "The next Biennial should take place in the autumn of 2021, and the biennial will open to the public in the spring of 2022. The exhibition will be organized via a mix of online and physical exhibitions, curated by Maurizio Cattelan and Tomislav Cvetkovski, and will feature works by eighty artists, including Peter Dreher, Svetlana Ivanovskaya, David Turpin, David Mazzucato, Charles Ray, and Robert Irwin. The full list of participating artists is as follows:Antonis Fine Arts (USA)Alfred Webre Contemporary Art Museum (USA)Alfred Webre, Modern Art, and the Modern Life of Art (USA)Alfred Webre, Bowers and Ives, Chicago, 1966. Alfred Webre, Modern Art’s Legacy (USA)Alfred Webre, The Future is Present (USA)Alfred Webre, The Sculptor’s Garden (USA)Alfred Webre, The Sculptor’s Home (USA)Alfred Webre, Mould and Stone (USA)Alfred Webre, The Sculptor’s Garden (USA", "The next Biennial should include the first exhibitions devoted to the art of the African diaspora; the first exhibitions devoted to traveling art; and the first exhibitions dedicated to the art of the African diaspora in a region where art is a universal language. The biennial is currently on view through October 29. Each year, the museums invite sixty artists to participate. The biennial will also feature a number of new commissions by internationally recognized artists such as Martin Ejaz, Mariza Dalloul, and Mohandas Gandhi.One hundred percent of the prize money will be donated to the Nelson Mandela Foundation. The other eighty percent will be donated to the respective artists. The winner will be chosen by a committee composed of Barbara Bennett, a South African curator of African art, and Yashar Ali, a curator of contemporary art.\n\n\nThe Kunsthalle Basel, Switzerland, has announced that it will recognize the Palestinian call for boycott, divestment, and sanctions (BDS) against Israel. The organization will also offer Palestinian artists and cultural workers two thousand euros as a gesture of solidarity with the BDS movement. “Kunstverein Basel is committed to supporting a more just and lasting peace between Israel and the Palestinians,", "The next Biennial should be held at the Metropolitan Museum of Art, which is currently renovating its former space in Lower Manhattan, the Museum of Modern Art, and the Museum of Modern Art in Philadelphia; and will include the first public exhibitions of work by artists such as Berti Vogt, Frank Gehry, and Alfonso Minaudi.The exhibition will also include a virtual reality experience that will feature works by leading contemporary artists such as Frank Cho, John Dean, and Mark di Suvero. The project was organized by the London-based nonprofit London-based non-profit the London Foundation for Contemporary Art (LFCA), which is affiliated with the Tate, London’s Art Gallery and Tate Modern.“This is a moment of great change for art and humanity. It is an opportunity to reexamine the fundamentals of art. This is an opportunity to re-shape the future,” said LFCA director Tristram Hunt. “LFCA is dedicated to supporting artists and inspiring new thinking about what art can become and how art can change the world. We welcome you to join us in this project and to create a new kind of relationship between London and New York.”\n\n\nThe Central Library of Art in", "The next Biennial should be held in 2020.\n\n\nJean-Michel Jeunet, chief executive of the French company that owns the estate of the Cor-Bon collection, has warned that the company is preparing for a loss of up to €100 million ($110 million) if its plan to sell the artworks to the Sotheby’s auction house is not accelerated.The estate is currently negotiating a deal that will see the works, which include works by artists such as Ed Moses, Hong Kong, and Paul Gauguin, bequeath to the Paris-based company the same year as the biennial. Under the agreement, the company will sell the works in the first half of the year and the collection will then return the works to the estate for its collection.The estate is also facing a legal complaint from the heirs of a former Sotheby’s employee who died a year after being deprived of a pension heist at auction. That individual claimed he was denied his retirement benefits by his employer after he died. The heirs were denied a hearing in a local Paris regional court last month, but their lawsuit was dismissed last month after a judge ruled that the plaintiffs had not proven a loss.“We are still working through", "The next Biennial should take place next year. The exhibition will be hosted by the Württembergische Kunstverein Stuttgart and will run in both 16 and 24mm format.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Mary Lou Bourgeault as its new director. She succeeds Nancy Robertson, who has helmed the institution for twenty-two years, and will take up the post on January 4.“We are thrilled that Mary Lou Bourgeault has come to lead our Boston-based institution into the future,” said director Matthew Teitelbaum. “Our talented and dedicated staff, which has included many of the most accomplished and successful artists in the country, including Susan Sontag, Mark di Suvero, Mark Halperin, and Joe Raeder, have been instrumental in our remarkable transformation over the past twenty-two years. We look forward to her continuing this remarkable legacy.”Bourgeault comes to the MFA from the Tuskegee Airmen, where she served as chief of staff and director of public relations. During her tenure at the Tuskegee Airmen, she was instrumental in establishing partnerships with major American artists, including Sally Mann", "The next Biennial should be held in 2020.\n\n\nThe French Ministry of Culture has awarded $1.2 billion in grants and loans to arts and cultural institutions across France as part of a new $3.2 billion package, which aims to repair the damage that the Parisian riots and the Sousse massacre did to France’s image. France’s Culture Ministry announced the grants on Thursday, January 10, and released a statement saying that the investments would reverse the Parisian riots and reduce the number of deaths in the ongoing criminal unrest. The money is being used to support the takeovers of art institutions by 10 French and foreign arts groups, including the grand prix, the Lyon Biennial, and the prestigious New York Biennial. The institutions are currently undergoing a restructuring led by the French billionaire Patrick Drahi, who in March announced that he would sell his majority stake in Sotheby’s to the heirs of the late oil magnate Henrique Cardoso, who was a major collector of art and a major collector of modern art.“The Grand Prix de Lyon is no more,” said Bouma. “It was a travesty of democracy. The tragedy was that", "The next Biennial should be dedicated to the Technologique’s history and its development, and should include the first exhibition dedicated to the Technologique at the Museum of Contemporary Art, New York. The museum declined to commit to the date, nor did the Biennial’s director, Mark DeVito, confirm its plans to hold the exhibition.DeVito told Artnet, that he will not be able to reveal many new developments at the museum until it is closed until March 23. “I’m going on record as saying that we’re not moving forward with the exhibition,” he said. “We’ve spent the last three years and a half trying to work through the issues that the exhibition raised. . . . We’ve presented the exhibition in person and in digital form at different venues. And we’ve had a great response.”DeVito added that the exhibition will be reassembled under the new title “Technologique.3: International,” a title that will be announced in the coming weeks. The show will then return to the Museum of Modern Art in New York to undergo a major renovation.\n\n\nThe National Gallery of Scotland announced", "The next Biennial should take place in 2020 and will be organized around the theme of the “Towards a New History.” The theme will be based on the work of the late German poet Arne Glimcher.\n\n\nThe Center for Contemporary Art (CCA) in New York has appointed Jodi Thayer as its next executive director. Thayer takes the helm from Mary Mattingly, who has worked as the director of the New Museum in New York since 2013 and has helmed the museum since 1981.“Thayer’s leadership and vision for the CCA reflect a deep commitment to the museum’s collection and mission,” said David Kern, the museum’s board chair. “Just as she has expanded the museum’s collection beyond what could be imagined in a decade, she has demonstrated a deep understanding of the role of art in shaping the global conversation.”Previously, Thayer worked at the Metropolitan Museum of Art, where she oversaw the construction of its new 100,000-square-foot outpost; as the director of the Whitney Museum of American Art in New York and oversaw its renovation in 2017; and in the private sector, where she worked as a career curator", "The next Biennial should be held in 2021.\n\n\nThe City of London and the National Galleries of Scotland have launched an initiative to help the London-based arts community through the Paris-based Middle East Center (MEC) as it works to reopen following a $1.4 billion expansion.MEC, which was completed in September 2019, will boast 120,000 square feet of exhibition space, a library, and a café. The center will also boast a 300-seat theater that will be able to house several thousand people. Following the reopening of MEC, the city of London and Scottish premier Vince Cable announced that they would develop a new partnership. Cable’s office and the City of London have enlisted the services of British architecture firm Foster + Partners, which designed the center’s new headquarters; London-based designer Alexander Gray; and MEC’s architect, Bénédicte Savoy, to help re-conceptualize the center.“The city of London is creating a unique and exciting new environment for art and creative life in Manchester,” said Savoy. “A new partnership between the city and the National Galleries will allow us to continue to support and extend the best", "The next Biennial should be held in 2021. The twenty-fourth will take place in 2022 and the forty-sixth in 2023. The seventy-ninth will take place in 2024 and the eighty-seventh in 2025. The seventy-ninth will also be the last exhibition organized under the Biennial banner.“The Art of Winter,” a major survey of the art of the cold season, will be staged in the spring of 2021. Its thirty-second edition will be held in March 2022. The twenty-third will take place in March 2021. The forty-eighth will be staged in March 2022. The catalogue for the twenty-third exhibition will be published by the Danish contemporary art exhibition Wunderkammer in March 2022. The catalogue for the twenty-fourth Biennial will be published by the Danish contemporary art exhibition SLAV, in March 2022. “The Art of Winter” will be held at the København Gallery in Denmark from March 19 to March 21, 2021. \n“The Art of Winter” has won the prestigious Ernst and Marian von Karmann Award for Art, which is given annually by the København Foundation in the", "The next Biennial should be held at least every other year, to allow for reopening of the museum, according to the museum. Artist residencies will also be offered once a year, in a manner similar to the Arturidae, the Greek artists who settled in Olympia in the late fifth century BC. The institution is currently planning to reopen in the spring of 2020, but the date has yet to be set.\n\n\nThe Museum of Modern Art (MoMA) in New York has released the schedule of its upcoming sixteenth edition, which will take up the themes of the past twenty years and culminate in an exhibition featuring work by forty artists. Titled “The Future Is the Present,” the event is being organized as part of MoMA’s expansion into an “intersection of art and culture,” which will include projects and performances by artists whose work has recently been selected for the forthcoming biennial, including Adam Pendleton, Olufemi Olafurri, and László Pál, and will also feature collaborations between internationally known and underrecognized artists.“In supporting this new position of MoMA as an interdisciplinary institution for the celebration of forty artists who have recently received", "The next Biennial should be held in 2022, and the first in 2024.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York, which has been working with the National Gallery of Art in Washington, DC, on revamping the institution’s collection in an attempt to reduce its carbon footprint, has commissioned an artist-designed installation by the artist Hans Ulrich Obrist to commemorate its sixtieth anniversary this fall. The exhibition will feature works by fifty-four artists, including Robert Irwin, Jay-Z, and Els Saavedra, and will run concurrently with the museum’s upcoming reopening of the museum.The pieces in the exhibition will be curated by American artist Jennifer Weiner, who, together with David H. Durslade, created the project “Year Zero: Art in the Age of Black Power” at the gallery in 2015. The work, which was inspired by the 1968 uprising in Egypt against the country’s authoritarian government, was commissioned by MoMA and focuses on the legacy of the Black Power movement in the United States.The exhibition, which will be on view in the museum for twenty-four hours, will also feature work by artists including Yunus Anaica, Paulo Coel", "The next Biennial should take place in the Fall of 2021, and the first exhibition should open in the Spring of 2022. The first show will feature works from the museum’s collection, which comprises more than 4,500 items. The exhibition will also feature works created by artists who have been implicated in the ongoing protests, including Barbara Etchison, Arsht Kremer, and Jean-Michel Basquiat.“We are committed to continuing to present contemporary art in an open and exhibition-oriented manner,” said Jean-Luc. “The Biennial will only become more important to the history of art, and to the future of art, with the future exhibition of the first show of the biennial. We believe that the exhibition will help raise awareness of the importance of art and will encourage us to think of the exhibition as the beginning of our work.” While the institution will be closed until January 21, 2021, a preview show of the selection of the first work of Biennial 1 will open in the spring of 2022.\n\n\nThe Tate’s board of trustees has voted to reduce the museum’s annual income by $1.5 million by shifting the bulk of its executive and artistic responsibilities to a", "The next Biennial should take place in 2022, but it has yet to make any concrete decisions about the location or the date.The event will take place in the historic city of Biennale Mallorca. The mall’s redevelopment plan, which included the renovation of the city’s old City Hall as well as the creation of two new buildings, is currently under way. The new buildings will be inaugurated by an exhibition of works by the forty-six artists currently represented in the exhibition, such as Adrian Piper, Javier Téllez, María Berrío, Andén Álvarez, and Santiago Caluñez.The twenty-fifth edition of the exhibition, which was originally scheduled for January 28–February 4, 2020, was pushed back to March 2022. \n\n\nAs part of a larger plan to secure the future of the Tate’s collection of more than 4,000 works by modern and contemporary artists, a commission by the Tate’s board of governors was presented on Thursday to strengthen the organization’s engagement with the wider cultural and arts community. The initiative, called for renewal of the museum’s relationship with the Welsh Assembly for Wales, which represents Cardiff, and is", "The next Biennial should coincide with the reopening of the National Gallery in London. Although the theme of the forthcoming exhibition will be “The Lovers,” the exhibition will not be set in the gallery; rather, it will be a virtual reality experience set in the National Gallery. Labyrinth and co-founder Hanna Bloom, who launched the virtual reality company HMD Showroom with her husband, tech entrepreneur Markus, in 2004, have both left the museum to pursue new creative projects with their families. The exhibition will explore the concept of virtual reality through works by the artists currently representing the exhibition and will take the form of a large installation. The show is being organized by the Smithsonian American Art Museum (SAAM), which will stage a virtual exhibition of works by the group of artists known as the American Group, in collaboration with curator and SACMA graduate Phyllis M. Smith.The show will feature works by the artists whose work is currently on show at SACMA, including Anne-Marie Curie, James Currier, Jean-Michel Basquiat, David Cezanne, Louise Bourgeois, Bob Marley, Hans Zimmer, and Louise Bourgeois-Williams. The exhibition will also include testimonies from three artists who", "The next Biennial should be for “The Unfalsified Art of Non-Western Art” (2019), to be held at the Museum of Contemporary Art Los Angeles. Following “The Man Who Sold the World: Art and the Politics of Pain” (2019) at the Museum of Modern Art in New York, the first biennial for the museum’s collection of paintings and objects by American artists will open in 2020. The museum has already announced that it will hold its first exhibition dedicated to the work of Nelson-Atkins’s art in 2021.\n\n\nThe National Gallery of Scotland has announced that it will make the annual Arts Council Award (AC) more affordable for the public by extending the lifetime of its annual grant, which will run from April 2 to April 5. In a statement, the institution said that it hopes the change will help ensure that the grant will continue to be grantable for the foreseeable future. The curator of UK’s 150th anniversary exhibition of the work of Alice Aycock, which opened at the National Gallery in London last year, Catherine Taylor, said: “I’m delighted that the National Gallery of Scotland has decided to make the", "The next Biennial should be on tap for late 2017.  Dahl and her team are currently negotiating with the city of Grand Rapids, Michigan for the fair’s location, which should be near Grand Rapids University, and the state of Michigan for its blessing.\n\n\nThe Walt Disney Company has announced that it is establishing two new divisions to further collaborate with local local, state, and federal governments across the United States to promote environmental stewardship and innovation. The divisions will be led by Marc Spiegler, director of the Classic, and Christina Li, publisher of the magazine Modern Love, and will work in partnership with the Smithsonian American Art Museum (SAAM) and the Smithsonian Design Museum (SDC). The Smithsonian American Art Museum (SAAM), which is currently undergoing a $1.5 billion expansion, will receive a portion of the funds raised by the new organizations. The Smithsonian Design Museum (SDC), which is currently under construction and scheduled to open in 2021, will receive grants from the new organizations instead.“We are thrilled that we can expand the Smithsonian’s relationship with the communities we serve by creating these new programs,” said David Levin, chair of the board of trustees of the Smithsonian American Art Museum. “", "The next Biennial should be held at the Grand Palais in Paris in the Spring of 2021, and the first exhibition should open in 1506.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles, California, has appointed Jason Kander director. Kander comes to the institution from the Los Angeles County Museum of Art (LACMA), where he served as the deputy director of exhibitions from 2017 to 2020. He succeeds Natalie LaPorte, who departed in the summer of 2020 after eleven years at the helm of the museum.“Jason has been instrumental in helping LACMA become a world-class museum and is committed to transforming LACMA into an institution that redefines the role of art in our communities\u0097one that sets the standard of excellence for how we connect with the arts, our world and the natural world around us,” said LACMA director Josh Fox. “A true visionary, he is talented, dedicated, and focused, and I look forward to working with Jason to help realize the vision of the museum as a truly global community hub.”Kander will assume his responsibilities on December 31. During his tenure at LACMA, he helped organize over twenty exhibitions\u0097including “The", "The next Biennial should be held in the second half of 2020, at the earliest, and will be hosted at the Museum of Fine Arts, Boston. The event will be hosted in conjunction with the upcoming exhibition “The San Francisco Museum of Modern Art: From the Bay,” which will run concurrently with Art Basel Hong Kong and Art Nouveau in the United Kingdom.\n\n\nThe Art Newspaper, a Japanese publication owned and distributed by the state-run Tokyo Shimbun, has published an article about the exhibition “Love Live: School Idol Project,” which will premiere in Tokyo Metropolitan University from March 17 to March 21. Titled with an English translation by Kunos Kenkyu, the article claims that the show is attempting to reinterpret the history of the school idol group, which was founded by a group of girls in 1964 by their collective name, KARA. The article points to the show’s “unusually serious take on the history of idol groups and how they were affected by the political and social upheaval in Japan in the 1970s and ’80s,” as well as comments from artist Ai Ma, who was the group’s first member and the group’s third artist,", "The next Biennial should take place in the city next year.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has announced that it plans to open its new new home in the Santa Monica Mountains in 2020. The museum is currently working with architect James A. Farley on the design of the complex, which will sit in a series of glass towers and will launch in the foothills of the Santa Monica Mountains. The project, which will see the installation of eighty works, has been in the works for more than a decade and has undergone numerous iterations.The institution plans to begin welcoming visitors in 2022. The museum is currently constructing a new building, a new museum, and is preparing to open the new headquarters in the former auto body shop, which is currently undergoing a $300 million expansion project, in 2017. The first exhibition of the new space will open in January 2020.\n\n\nThe Brooklyn-based artist Maurice Greenberg, known for his dramatic and profoundly personal sculptures, has died at age eighty-one. The artist is best known for his brightly colored geometric works, which fuse domestic and social concerns such as grief, love, and food. Born in New York City in 1940, Greenberg first began creating in the 1960s, when he was still", "The next Biennial should be organized as follows: The exhibition will be held in the archives of the National Museum of Modern Art, Kiasma, Italy. The exhibition will include work by thirty contemporary artists, including Kelsey Renee (New York), Gianluigi Nuzzo (New York), Mina Akpan (New York), Ricky Vaughan (New York), Léa Wallace (New York), and Hannah Wilkes (New York).  The Museum of Modern Art (MoMA) in New York has also announced that it will no longer be honoring the biennial winner, Christine Campbell, at the conclusion of the 2021 edition, and will instead award $100,000 to the author, Jodi Throckmorton. This year’s edition, titled “The Artist,” featured work by forty-six artists, including Alexa Antoniou (New York), Dame Cherise Berner (New York), Gianluca Bolli (New York), Samantha Britten (New York), Lonnie Brenner (New York), Tina Burchill (New York), Celui B", "The next Biennial should open next April.\n\n\nThe Museum of Contemporary Art (MCA) in San Francisco has appointed Imane Bryan as its next director. Bryan comes to the institution from the City of San Francisco, where she has served as interim director since July 2019.“Imane's leadership and vision for the MCA and the Bay Area are extraordinary, and we are deeply grateful for her inspiring leadership for the past two years,” said director Rebecca Wheeler. “Imane’s record of success, coupled with her eagerness to collaborate with artists, brings an incredible outlook for the future of the MCA and the Bay Area, as well as a proven track record of building strong relationships with respected national and international artists.”Bryan comes to the MCA after serving as director of the renowned Museum of Modern Art (MoMA) in New York from 2016 to 2018. For her tenure at MoMA, she oversaw the reinstallation of the museum’s London and North America galleries with additional funding; expanded programming for collectors, collectors-to-buy, and art professionals; and oversaw the acquisition of more than 1,500 works by twenty-four artists. During her tenure at the MCA,", "The next Biennial should take place in the autumn of 2020, as part of the third iteration of the André Breton International, which will be held in the city of Marseille from May to September 2020.  The program’s director, Maryam Mirzay, said: “There are many things that can be developed and developed in parallel, but there are so many things that need to be coordinated. The Jupiler Collaboration is an example of what we hope will become a new kind of platform for such coordination.”\n\n\nThe Museum of the City of New York (MOC) in New York City and the Bronx has received a $750,000 donation from philanthropist and collector Jacob Kallenberg, who has given $1 million to the museum since 2008. The sum surpassed the $1 billion mark in funds raised by the institution during its five-year fiscal year, which began on August 1, and will be invested in promotion of free and reduced-price admission.“Jacob Kallenberg is an extraordinary man, and an extraordinary collector,” said MOC board president Christopher Duhigg. “He has been and will continue to be a critical partner to MOC as we build the", "The next Biennial should focus on the history of art in the city and will announce the list of participating artists in October.\n\n\nArt Basel Hong Kong announced today that it is suspending the exhibition “Art for Future Living” due to concerns about the coronavirus. The show, which was scheduled to run from March 19 to March 21, 2020, was canceled in February after the coronavirus was confirmed in China. “We were disappointed by the curators” decision to cancel the show, Artnet reports. “We were not able to create a work that would truly reflect the spirit of Art Basel Hong Kong in 2020,” said Peter Schäfer, chief executive of Art Basel.Schäfer said that the company is taking a more cautious approach to the coronavirus and has tightened its supply chain. He said that Art Basel will continue to collaborate with the company to develop new content and to deliver events such as Art Basel Hong Kong 2020 and Art Basel Hong Kong 2020 New York, which will be held in April. “We are actively working with our suppliers and partners to ensure we have the means to deliver the excellent events we have been bringing to the city since 2011", "The next Biennial should include a presentation of the work of and the first exhibition of Carolingian sculptures by Johannes Wolfgang von Goethe, a selection of which will be presented on Sep. 7–Oct. 11 at the Musée Marcel Braille in Paris.\n\n\nThe Museum of Fine Arts (MA) in Atlanta announced today that it is preparing to reopen in October 2020 with an exhibition of works by artists such as Joachim-Axel Gramm, Claudia Benavides, Natalie Johnson, and Timur B. van der Merwe. The public is invited to view the first presentation of this exhibition on the MFA at the MFA, which is currently closed until May 25, 2020.“We are grateful to the city of Atlanta and the people of Georgia for their enthusiastic support through the construction of our new facility,” said Mark Levinson, director and CEO of the Museum of Fine Arts. “We are also grateful for the work of our Georgia team to bring our 2020 exhibition to life and to develop an exhibition that will enhance the Museum’s mission, enrich the community, and prepare our visitors for a new season of programming.”\n\n\nThe New York City Department of Cultural", "The next Biennial should take place in the spring of 2021. In the autumn, the 2020 edition should return to the city of Bern, Switzerland, to return to the theme of the year 2020.The biennial will be held at the Museo de Arte Contemporáneo in Madrid. The Madrid-based artist, Bernat Lopes, will create a new work for the exhibition, titled Tear Into Me, which is an amalgamation of twelve works, which were created in the early 1900s; this is the first time the exhibition will be staged in the Spanish capital.\n\n\nItalian artist, theorist, and educator Marcella Beccaria, who frequently experimented with the artist-built environment in which she lived and worked, has died at the age of ninety-eight. Known for creating worlds formed in and around the artist-built environment, in which materials and forms are often intentionally arranged, Beccaria began her career as an architect in the city of Rosso Boggio, near Venice, in the late 1940s. Her practice expanded later that decade with her experiments in the '60s and 1970s, including her monumental “GAMBLAST” (later renamed Palazzo Bianco) and �", "The next Biennial should be held at the National Gallery in London, which is currently under construction and will reopen in 2021. \n\n\nThe National Galleries of Scotland announced today that Diana Fiamm-Palladino has been selected as the new director of the National Gallery of Ireland. She succeeds Neil Reid, who retired this week after twenty-five years at the helm of the institution. Fiamm-Palladino comes to the institution from the James Dyson Foundation, where she serves as director of collections and exhibitions.“Diana is a highly regarded and accomplished director, and has been instrumental in the development of our collection architecture and collection strategy,” said National Galleries of Scotland director Anton C. Kidd. “In addition to her curatorial experience, she has a track record of transforming collections, developing best practice and delivering highly successful and sustainable exhibitions, and has won numerous awards. I’m delighted to welcome her to the National Gallery of Ireland and look forward to working with her.”In a statement, Catherine Mackay, director of the Dyson Foundation, said: “In her role as director of the National Gallery of Ireland, Diana has established herself as an", "The next Biennial should have been on the theme of “knowledge,” said Raich. “But when it wasn't curated for only five years, we decided to move on.”The museum will also soon unveil the first permanent English translation of the novel “The Death and Life of Christopher Marlow” by James Patterson. It will be on view in the exhibition “Christopher Marlow: Untitled,” in the exhibition “Christopher Marlow: Untitled,” curated by Dr. James S.A. Corey. The first episode of the first season of the animated shows, “Sci-Fi Life” (2019–20), will also be shown.Commenting on the work, Rizzoli said: “This is an extraordinary exhibition. It’s full of extraordinary characters, from some of the most extraordinary people, to people who have shaped the very history of the art world, to people who have left behind them all in their obscurity and were forgotten by others. To take part in this exhibition is to be part of their stories.”\n\n\nThe Museum of the Fine Arts (MFA), Boston, has announced its representation of the Polish American painter Oskar", "The next Biennial should take place in 2020. Lattimer has said that the next edition will focus on contemporary art from the Commonwealth and will focus on how biennial exhibitions can be used as an instrument to advance the practice of art. It will also promote the work of Commonwealth artists and those in the Commonwealth from Australia around the world.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has announced that Mark B. Smith will serve as the institution’s next director. Smith currently serves as the interim president, chief curator, and head of the department of modern and contemporary art, and was appointed the director of the museum in 2016.“After a thorough search, we were able to select B. Smith as the right person for the role of director,” said Elizabeth Barratt, interim director and chief curator of the museum. “He has the vision, the ability, and the ability to bring MoCA’s contemporary art to life and engage audiences across the country, and will continue to shape MoCA’s mission and artistic practices as he continues to shape the architecture of the stage and the stage to audiences.”Smith’s appointment comes on the heels of the opening of the museum’s newest", "The next Biennial should take place in March 2020 and will include a presentation of works by twenty-five artists, including Irina Mendoza, Katerina Kliussova, and Anke Haraldsson, and a selection of works by fifty-three artists. The 2020 project will be hosted by the Museo del Biennial de Santiago, located in the city of Santiago, Chile; the Instituto de Cultura Artística in Madrid; and the Museo de Arte Contemporáneo in Buenos Aires. The 2019 edition was held at the Museum of Modern Art, Los Angeles.\n\n\nLONDON (The Art Newspaper)—Britain is considering new laws that would force Internet service providers to keep customers in touch with loved ones who are ill or dead. While the move would prevent some deaths from a lack of communication, it would also introduce new privacy protections that could stifle online freedom. In a July 4 letter to the British Parliament, the British Digital Society (BDS), and the Open Society Foundations, British Culture Secretary Sajid Javid wrote: “The responsibilities of a provider are enormous, and the existing digital privacy rules cannot keep up with the demands of complex online environments. .", "The next Biennial should assemble all of the works in chronological order, the theme, and the dates. The twenty-second, “Letter from the Native American,” will be devoted entirely to the history of Native American art and will be staged at the Navajo Museum in Flagstaff, Arizona. The twenty-third, “The American Indian and the American Indian Art,” will be held at the Smithsonian American Art Museum in Washington, DC. The twenty-fourth, “American Indian Art and Architecture,” will be staged at the Museum of the American Indian in Minneapolis. The twenty-fifth, “Apache Art” will be presented at the Museum of American Indian in New Mexico. The twenty-sixth, “American Indian Art and Architecture,” will be presented at the Museum of the American Indian in Phoenix. The twenty-seventh, “American Indian Art and Architecture,” will be presented at the Arizona State University Museum of Art. The twenty-ninth, “American Indian Art and Art of the West,” will be presented at the Arizona State University Museum of Art. The twenty-ninth, “American Indian Art and", "The next Biennial should also include an examination of the contributions made by indigenous art to the development of the contemporary art world—an area where the Filipino arts community has been largely neglected.The project, titled the “Pangaea” (Pole of the Earth), was initiated by the Philippine Cultural Heritage Commission (PCHC) and the Department of Culture and Tourism (DCT). The PCHC is a coalition of Manila-based organizations that promote the preservation, protection, and promotion of the cultural heritage of the Philippines. The Department of Culture and Tourism (DCT) will hold a series of exhibitions, seminars, workshops, and other events across the country in commemoration of the centennial. The inaugural event, “Pangaea: A History,” will open on March 15 and will include the curation of artists such as Barbara Pimentel, Ejel Abdurraqib, and Kendra Jauregui, as well as the artists whose works are currently on display at the forthcoming exhibition, “The Evolution of Visual Art” at the theme park Ruiz, in Manila.\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed exhibit curator and artist-in-residence", "The next Biennial should be held in Hong Kong in May 2020, and will then return to Paris for another edition in 2021. This year’s event was originally scheduled for March 20–March 23, but was pushed back again three months due to the Covid-19 pandemic. “The new date reflects our ambition to present an international exhibition of the best contemporary art from the Republic of Korea,” said Arts Council president Paolo Massimo. The ten artist-in-residence selected by the council will be announced in early May. Last year, the institution unveiled a new collection of new art, a collection of works by Yoon Gyung-Min, a collaboration between ten Korea–based artists, at its inaugural exhibition in Seoul.The new exhibition will be hosted by the Korean Peninsula Museum of Art in Seoul and will be curated by Seoul-born, Hong Kong–based artist Ino Kang. The panel will be chaired by Kang, who is also a founding partner of the Kunstbau, and will be comprised of Fuk Chang-kwong, director of the Contemporary Asian Art Museum, South Korea; Yoon Gyung-Min, creator of the Biennial", "The next Biennial should take place in 2027, the organisers said. The exhibition is being organized by the Museum of Fine Arts (MFA) in New York and will take up various themes, including the exhibition of work by artists of the Harlem Renaissance, the history of the American visual arts, and social and political issues.The exhibition will focus on the relationship between artists and the public, including their work and the public artworks, and will feature works by artists who are represented by the institution. The show will also feature work by visiting curators and other artists from participating countries, such as Mme. Jules Verne (France) and Mme. Alexandra Rochat (France), who will be represented by the artist collective The Hairy Bikers, whose first show in Milan is slated to open in the new year.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the display of works in public places across the city, including in the city’s financial district and the Financial District Art Museum. The guidelines outline a four-pronged strategy to promote the city’s cultural diversity, encourage the relocation of cultural institutions, and encourage the circulation of information about cultural institutions.“The guidelines", "The next Biennial should be held at least in March 2020. The institution’s next Biennial of Personal Art will be held at least in October 2020. The next Japan Contemporary Art Exhibition will be held in March 2021. The 2020/21 edition of the Hong Kong Biennale will be held in October 2021. The upcoming Biennale of Contemporary Art in Kassel will lead the way for the next two years for the exhibition-maker’s flagship exhibition at the event’s new venue in the German city of Kassel.\n\n\nThe National Museum of Fine Arts in Washington, DC, has added two new members to its board of trustees: artist-activist Mary Bonilla-Sanchez and designer and educator Caroline Satterwhite. The museum also appointed Kate Martin as its next director and chief curator. Martin previously became the director of the James A. Farley Galleries in New York, where she curated the twenty-fourth edition of the James A. Farley Presidential Medal for Art and Arts in 2018.“What started as a little-known board of trustee exists today as a major national institution dedicated to the art of design,” said Bonilla-Sanchez. “Our new members represent a wide array", "The next Biennial should be held in 2022, and the exhibitors will be announced in 2020. The event will be organized according to a theme inspired by the novel, “Mines and Modern Life.” In the novel, which debuted three years after the outbreak of World War II, a working class family in the coastal city of Kochi, India, collects antiquities to buy the family a set of modern tools. Although the family initially uses the tools to make steel, the family eventually discovers the inspiration for the product came from a newly built slave market in the city. The story of the slave market and the family’s discovery of the origins of modern life is one of the themes of the exhibition, which will also include a documentary film and a virtual reality experience.\n\n\nThe Solomon R. Guggenheim Museum in New York has named Jason Patrick as its next director. Patrick comes to the institution from the Museum of Modern Art (MoMA) in New York, where he currently serves as director of public engagement. In his new role, Patrick will oversee staff reopening and programming for the institution, which recently underwent a major expansion. Following the reopening, the museum, which recently underwent a $1.4 billion expansion, will", "The next Biennial should take place in 2021.Details are still being worked out. The 2019 event, titled “Institution,” was held at the Upwork Arts Center in Harlem. The biennial will also begin with a new book by artist and scholar Tristyn Hall and will include artworks by artists such as Bob Smith, Willem de Kooning, and Alice Maudlin.\n\n\nThe Iran-backed American Friends of AlUla (AFA) are suing the Saudi Arabian branch of the Quilliam Foundation, accusing it of funding terrorism and violating Qatar’s sovereignty and claiming that a breach of the country’s territorial integrity began when the AFA, which works in the United States, erected a monument in honor of Zaki Nusseibeh, an American citizen who was executed in Saudi Arabia in January 2019. The lawsuit was filed in New York federal court on February 5 and seeks $10 million in damages.The AFA, which was founded by Nicole Shea and Basil Blackwell in 2006 as an organization dedicated to preserving and defending democratic values in America, condemned the lawsuit as “vindictive” and said: “This lawsuit is a malicious attempt to exploit the Saudi Arabian", "The next Biennial should be called the 'triennale of modern art', and the theme of the event should be the French avant-garde. The exhibition should revolve around a set of suggested responses to the French Revolution, and in particular around the avant-garde movement of the late nineteenth century. The theme of the show should be the 'Paris Salon of the late nineteenth century, and the contemporary Paris of the late twentieth century.”The biennial, which will be held in the city from March 8 to March 13, 2020, will be the longest-running exhibition in the museum’s modern history. It will also be the first in the museum’s history devoted entirely to the reconstruction of its grounds, with an exhibition of works from the collection dating back to 1928.\n\n\n\n\n\n\nIvan Albright, a longtime curator and avid author whose interests include Renaissance paintings and sculpture, died on Tuesday at age eighty-seven.Born in New York City in 1941, Albright studied with Barbara Comstock, Nancy Spero, and Joseph and Louise Barlow, among others, at the Yale School of Art. After graduating in 1960, he went on to work for the museum, where he trained under Or", "The next Biennial should be held at the Museum of Modern Art in Rome, in April 2021. The new edition will focus on the art of transport and will feature twenty-one new works by forty artists. Partners include Halston, Andrea Izzo, Alexander Calder, Steven Kreuz, and Thaddaeus von Karakar. For the first time in the museum’s history, the institution will house a full collection of over three hundred works representing the full range of Italian art, which came to the museum in 2007.\n\n\nThe Art Newspaper has launched three new digital platforms, Artforum, Artforum Digital, and Artforum Online, which will launch in the coming weeks.The platforms will allow visitors to view a given exhibition in real-time through a broad range of platforms, including the New York–based company Artforum. The first platform, which will initially be launched in the United States, will present all twenty-five exhibitions of the year, from January through March 2020. The second platform, which will be updated daily, will feature the works of forty-seven artists and will be hosted by Artforum’s parent company, Artforum.com, and will run until March 26. A third platform, Artforum.co", "The next Biennial should take place at the Museum of Modern Art in New York, in 2021. Kohn is currently developing a new project for TUF that will be curated by former curator of African art and museum director Thamer Glimcher. The event will be hosted by Marian Goodman, the former chief curator of the Metropolitan Museum of Art, next July. \n\n\nThe Museum of Modern Art (MoMA) in New York has released three new artists for its upcoming exhibition “Museum of Modern Art: Representations of the American Past,” which will open on September 9. The exhibition will feature sculptures, paintings, photographs, videos, and installations that represent the museum’s collection. The institution plans to present the three works by Josh Helmer, who created Museum of Modern Art: Museum of Modern Art: The Art of Moving Images, and Museum of Modern Art: Museum of Contemporary Art,” in conjunction with “The End of the Museum,” a new exhibition that will open in December.Helmer was born and raised in New Orleans, where his family owns a hardware store and where he studied at the local community college. He moved to New York in 2009", "The next Biennial should commence in 2021, with the same date as the last, and should be in partnership with the city of Beijing. \n\n\nThe Sheffield Art Gallery (SAG) is launching a new digital platform that will allow researchers, artists and curators from throughout the world to share their research and collaborate online. The platform, called the Research Hub, will allow researchers to share data, images, audio, videos, interactive maps, and other relevant information about their recent projects.“What we are creating is a platform for scholars to exchange data and ideas,” said Saâd Shakir, the director of the Sheffield Art Gallery. “The hub will be an extension of our existing relationships with artists and researchers, and will enable them to share knowledge and resources across disciplines and disciplines.”This is the fourth iteration of the Research Hub, which was launched in partnership with the British Council in collaboration with the Royal Society of Arts (RSA), the Institute for Contemporary Arts (ICA), the Arts Council, and the Monash University Art Gallery (MUAC), and will be hosted on GitHub, a platform created by the artists and the British Council. It will also be hosted by the Department of Digital, Culture, Media and Sport (", "The next Biennial should be held in Paris in 2022 and will be curated by a committee comprising Eric Fischl, the artistic director of the Kunsthalle Basel; Joëlle Bousquet, the director of the Musée d’Art Moderne d’Cherbourg; and Thomas Hooton, the secretary of the Royal Academy of Arts in London.\n\n\nThe British Museum in London announced today that it will welcome visitors back to the institution in December 2020 following a short reopening window during the pandemic. The institution, which has experienced a significant decrease in visitors over the past three years, announced its intention to open as many of its galleries as possible to help reduce the number of people visiting its galleries and reduce the number of exhibitors.The reopening of the museum will be timed to coincide with the start of the Chinese New Year, which will start on December 17 and run through January 21. The reopening will be coupled with the completion of a major renovation, the museum’s first in more than seventy years, which is scheduled to be completed in December 2021. The museum is also overhauling its galleries, adding new artworks, remodeling the galleries, and creating new spaces for educational activities and special programming", "The next Biennial should take place in 2020. \n\n\nThe Solomon R. Guggenheim Museum in New York has appointed David H. Koch as its new chief innovation officer. Koch is a billionaire industrialist and the founder of Koch Industries, the world-renowned American oil company. He is also the owner of Koch Industries, Sierra Pacific Natural Gas, and Koch-Weinstein, the chemical company that was responsible for the massive spike in the price of gasoline in the United States. He has donated $7 billion to the Guggenheim.David H. Koch’s foundation will be given $5 billion in grant money; $2 billion for infrastructure development; and $1 billion for cultural heritage conservation. The rest of the funds will come from the trust's endowment. The Guggenheim will use the funds to build and renovate the museum, which is currently under construction on the west side of the Guggenheim’s building, and to consolidate and expand the collection. The public will be able to visit the museum in 2023.The museum will receive $3 billion in public funds to construct the building of the museum, which will open in the autumn of 2022. The rest of", "The next Biennial should focus on the history of the exhibition, which raises the question of whether the exhibition has been mismanaged. The exhibition is currently closed and will reopen in the spring of 2020.\n\n\nThe National Gallery of Canada has announced the completion of its long-awaited redesign, which will engage with the National Gallery of Canada’s natural setting, the National Museum of Canada, and the surrounding region. The redesign, called the National Museum of Canada 3, is the largest undertaking of the National Gallery’s twenty-six-year history.“The redesign of the National Gallery is an ambitious and unprecedented project that has required the cooperation of an international team of experts across the country, Canada and the world, and has introduced new challenges and opportunities,” said Jean-Michel Courvoisier, director of the National Gallery. “The outcome, which will demonstrate the National Gallery’s reinvention as a globally recognized cultural institution, will be a thrilling experience.”In addition to the redesign, the National Gallery of Canada has launched the National Treasure Survey, a new initiative that will draw from an international panel of curators to gather and showcase cultural heritage treasures across Canada. The survey will aim to increase awareness of the treasures", "The next Biennial should be held at least once every two years. The next edition of the Art in Motion will be held at the Art Institute of Chicago, which will be redeveloped by the Chicago Art Institute. The 2020 exhibit will be curated by Matt Mullen, the director of the Chicago Art Museum, and will take up a theme of the artist’s legacy. The theme will revolve around a seemingly endless circle, the artist’s physical form, the possibility of movement, the interplay of materials and works and the relationship between objects and people.“The Art In Motion 2020 will engage in a broader and extended range of modern, contemporary, and rural art in the form of sculptural and material work,” said Markus Schäfer, the exhibition’s curator and director. “The new venue will enable us to present a new generation of work by Oskar Eustis, Jürgen C. Degenhardt, David G. Griffin, Jesse James Olmsted, and Richard Avedon. We are thrilled to extend the theme to the art of motion, reworking the themes of earlier exhibitions such as the Art of Motion (2019) and Art of Time .", "The next Biennial should take place in 2021, and the inaugural exhibition will be staged in the United Kingdom in 2022. The decade after that should be spent in a permanent institution, with exhibitions organized in both the UK and Europe.“All of our future shows will be set in different cities, with different artists, in different places, and we are determined to continue to present a unique and extremely high-quality exhibition programme,” said Nusseibehre Maar.\n\nThe Washington-based arts advocacy group the Noguchi Foundation announced today that it has committed $500,000 to the fight against the spread of Covid-19, the virus that causes inflammation and organ damage in humans. The organization made the donation as part of an initiative to protect the livelihoods of millions of people worldwide through the use of art and cultural artifacts. Covid-19 is spread primarily from person to person, but also from person to pet, from person to pet, and from person to cat, and is spread only through the direct contact with the virus. According to the CDC, the number of people infected with the virus has climbed to 791,4,600, and the number of cases is on the rise. A total of 6", "The next Biennial should be held in the fall of 2021 and will aim to redress the imbalance between art and culture in all of its forms. It will be organized in collaboration with artists and drawn from their practices. Upon the initiative’s launch, the president said: “When we think of art and culture as a unified whole, we are surrounded by it. And when we think of the varied traditions and modes of communication between artists, we realize that they are all interwoven and connected. The times themselves and their stories make their visions more accessible.”\n\n\nThe Museum of Fine Arts (MMFA) in Boston has announced that it received a gift of more than one hundred rare books from the Israeli-American artist Yair Gottesman. The collection, which includes six volumes from his celebrated book “The Declaration of Independence” (1936), a monumental, fifty-two-hundred-page work inscribed with Hebrew letters and associated with the 1967 Six-Day War and the 1967 Arab-Israeli conflict, was donated to the museum in 2015 by a group headed by the late Israeli collector Yair Gottesman. A spokesperson for the museum said the gift, which was made in recognition of the institution’s partnership", "The next Biennial should take place in 2021. \n\nLos Angeles’s Milk Bar has announced that it will no longer host its first-ever Tate-sponsored exhibition, “Tate at Home: Art and Safety in the City, 1956–1958,” at the museum next month. Instead, the organization will partner with the Museum of Contemporary Art to present a series of exhibitions at its building, as part of a “post-Tate landscape.” Titled “Tate at Home: Art and Safety in the City,” the first part of the exhibition will open on September 15 and run until November 15, 2020. The second part of the exhibition will run from November 19 to December 3, 2020.“The Tate has long sought to foster a more integrated, cross-disciplinary, and trans-national culture through partnerships with institutions, artists, and institutions and artists. As part of our long-term programme of work with the Tate, we are working hard to create a more integrated, cross-cultural environment for art and artmaking across the board, so that we continue to be open to the world and to each other,” said Tate director Maria Balshaw. “We are also", "The next Biennial should take up the themes of Visual Art, Architecture, and Design and will be held at the Art Institute of Chicago, which is currently undergoing a $50 million renovation and will be completed in the spring of 2020. The institution has not yet announced the work of the biennials’ artists.\n\n\n\n\n\n\nA rendering of the 2020 winner of the $10,000 Mink Contemporary Art Award. \n       \n\n\n\n\nThe Los Angeles County Museum of Art (LACMA) has revealed the twenty-two artists who have received grants to date for their work in the organization’s 2016 season. The recipients are Andrew Calder, James Turrell, Keith Storm, Carlotta Corrias, Harald Szeemann, and Alfredo Martinelli, as well as the ten finalists who were selected by an international jury in partnership with the Los Angeles County Museum of Art (LACMA).The artists were chosen through a biennial jury\u0097Christa Pape, director of the Griffith Museum, Los Angeles; Meredith Elwood, executive director of the Whitney Museum of American Art, New York; and Setyana Fogg, president of the Association of Independent Curators.L", "The next Biennial should be held at the nearby National Museum of Fine Arts, where artist Henri-Paul Neubert and his wife, Joan, have been organizing a series of exhibitions devoted to the life and work of the late American filmmaker Robert C. Beasley. The title of the new exhibition, “Magic,” will be a nod to the C.S. Gist’s “In the Time of Magic” (1988).The new exhibition will open with a “Dream Café.” David Foster Wallace’s artworks will be included in the show, which will include the work of twenty-six artists and collectors. The biennial’s three-day run will run from March 16 to March 20.The inaugural Biennial of Fine Arts will feature work by artists such as Andrew Ridge, who has represented the United Kingdom at the Venice Biennale twice; Mark Haddon, who has presented work at the Venice Biennale twice; and the Dutch artist Cornelis Kohn. The biennial will also include a dinner on March 20 and a Q&A on March 19.Commenting on the new series, Christopher Wool, director and CEO of the National Gallery of Art in Washington, said:", "The next Biennial should be held at the Biennale, with the approval of the city council, in 2021. Toguo, who commissioned the original exhibition, and his wife, Amy, were married in the Grand Theatre of the Arts in London in 2009.\n\n\nThe Commission for the Defense of Democracies (CDM) in the Czech Republic has received a donation of fifty-six works from the Prague-based artist Jasaů Norberg. The works, which were donated by the artist and the Vienna-based Foundation for the Defense of Democracy, will be exhibited in the upcoming biennial, entitled “The Future Is Not Present,” at the CIMAM Museum in St. Pilar in October.The works, which were given to the organization by Norberg as part of a project titled “Against the Machine” in 2016, were originally presented at the eighty-third Venice Biennale in December 2019. According to the Art Newspaper, the project garnered strong criticism from critics who saw its exhibition as a “tribute to the ‘dictatorship of the past’ and a ‘cover up’ of the communist era.The museum received the works in March and the biennial itself took place", "The next Biennial should be held in the near future. I hope that it will be a landmark event for Milan.”\n\n\nThe Metropolitan Museum of Art (the museum) in New York has released the list of sixty artists whose works will be included in this year’s edition of the Met Galerie Basel, which is slated to run from March 13 to March 14. The seventy-six-minute exhibition, titled “The Innocents Gallery,” will feature works by eighty-five artists and will run across forty floors of the museum.The exhibition, which also features works by artist-activists and activists from the Sierra Club and other environmental organizations, was inspired by a presentation of work by artist-activists Gloria Steinem and Susan K. Levey at the Met in 1988. The two were making a show about the ongoing impact of the climate crisis, which included photographs of the students at the nearby Art Institute of Chicago, the school of the same name, who were protesting work by artist-activists Robert Irwin and Frank Gehry.While Gloria Steinem’s art has been featured in multiple other exhibitions, including during the 1993 San Francisco Museum of Modern Art exhibition “Innocence of Muslims”", "The next Biennial should take place at the Museum of Modern Art, Shanghai, in 2021.  The inaugural episode was held in the summer of 2018 and was titled Banish the Killing.  The second episode was held in the fall of 2018 and was titled Bullshit.  The exhibition was curated by Francisco Ato and Stanley De Rosa. \n\nThe twenty-sixth edition of the Berlin Biennale will be held at König-Strasse in Berlin from March 20 through March 23, 2020. Organizers announced the dates for the event on Wednesday, December 21, and the event will be held until February 12, 2021.“Originally, the Berlin Biennale was conceived as a series of tours by a unique group of international artists, chosen by a committee comprised of Jean-Jacques Neu, the director of the Museum of the Modern Art, Paris; Annette Neumann, the artistic director of the Berlin Biennale; and Manuela Cipolletta, the artistic director of the Bodega Bistro in Fiumale, Italy; all of whom were invited to Berlin to see the new works by this year’s theme, ‘Politik", "The next Biennial should be in 2020. \n\n​The Museum of Fine Arts, Houston (MFA Houston) has received a $50,000 donation from artist and collector John DiMaggio. The donation became available after MFA Houston president and CEO Kelly Chen reached out to DiMaggio about the possibility of a fundraiser for the institution. Chen asked DiMaggio to donate the funds to the institution to help with the cost of a new building and to encourage the growth of MFA Houston’s collection. DiMaggio agreed and was gracious enough to donate $50,000 to MFA Houston.“It’s been a great honor to meet John and to help him with his vision of what a museum could be,” said Kelly Chen. “We are now excited to open the new MFA Houston with a project from his collection that will engage with both the Houston community and the region.”\n\n\nThe Museum of Fine Arts, Houston (MFA Houston) has appointed Melissa Bailey as its next director and chief curator. Bailey arrives at MFA Houston after helming the museum from 2015 to 2017. Prior to joining the institution, she served as a curator at the Museum of Modern Art in", "The next Biennial should be held in 2022.\n\nIn the past, the museum has been largely shuttered since March 11, 2019, in protest of the coronavirus. Since then, the institution has faced a series of setbacks, including a planned renovation of its existing collection, which was supposed to start this month, and a strike by employees; the UK’s Arts Council has since announced plans to provide financial support for the workers affected by the Covid-19 pandemic.While the museum has since reopened, it will remain closed until at least March 12, 2020, in protest of the disruption caused by the shutdown. The Biennale of London will continue to take place as planned across the city.The British Alliance for Democracy (BAD), an organization that represents British cultural workers, is calling for the government to step in and help the BAD, which represents around fifty unions, including the British Film Union, the British Dance Union, the British Music Union, the British Screen Writers Union, and the British Triennale, raise £10 million to help pay for the professional staff of some two hundred museums across the UK that need assistance.“Museums are facing unprecedented challenges and the Government needs to act now to help them through", "The next Biennial should take place in California in 2021. \n\n\nThe Art Newspaper is reporting that the Christie’s auction house has received a record $30.7 million donation from the Royal American Fiftennial Commission (RBFC), the United Kingdom’s governing body for British art. The total sum is considerably more than the $26 million that the British Museum received from the commission in the last auction, which took place in 2022.“The total sum is considerably more than the British Museum received from the RBFC in 2022,” said Becca Carey, the British Museum’s senior director of contemporary art. The donation, which is in addition to the $17 million that the Tate received from the RBFC in 2016, is also thought to be the largest ever for a single auction.Commenting on the donation, Royal British Foundation curators Karen Cartwright and Tom Finney said: “The royal commission is an enormously significant step in the longstanding Royal British Museum’s ambition to become a major global cultural institution. It enables us to reap the benefits of the institution’s new location in central London, while ensuring that our exhibitions, collections, exhibitions, conferences, and other programming is delivered by", "The next Biennial should take place in the summer of 2022. By the end of the decade, the museum will have been transformed into the central hub of a network of museums and research centers in France. “The Biennale Paris is a great success,” said French Culture Minister Franck Riester. “The event will allow us to move even closer to the city, to the city of art and its visitors and the people of Paris. And, of course, to the city of art, the museum, the collection and the collection of Jacob-Picasso.”\n\n\n\n\n\nJacob’s-Picasso’s original installation, “Arts of Life and Death” (1902), a sculpture about life and death in the context of the French artist’s studio in Paris, has been removed from view. The work, which will be on view in the exhibition “Le Monde d’Art Contemporain�” in June 2022, was unveiled by the artist in the first of two projects he created in the capital of the former German state of Brandenburg. The installation, which was commissioned by the Berlin-based artist Helmut Niebuhr", "The next Biennial should be held in 2020.\n\nIn an email, director Anu Dang of the Jindoe Art Museum, and curator and educator JUNNAI Tanaka said: “We are grateful to the board, the trustees, and the staff of the Great Western Sydney Biennial Board and Museum for their decision to support our work through the downturn in the global financial and economic landscape. . . .We hope this further clarifies the trustees’ understanding of our role in this year’s event.”\n\n\nThe Los Angeles County Museum of Art (LACMA) has appointed Rishi Raj as its first director. Raj will assume his responsibilities in January 2022 and it will be his first assignment at the museum since he was hired in 2012. Raj succeeds Michael Edelman, who departed in March 2019 to head the University of Southern California (USC) as director of the Museo del Banco Artística in Madrid, and will begin his new post in January 2022. “Rishi Raj brings over two decades of experience as an architect, educator, and collector to LACMA, a museum that has been an essential part of the city’s cultural community for more than thirty years", "The next Biennial should be held in 2022. The venue will be renovated for the 20th edition, which will be held in the National Museum of Art, in Washington, DC.\n\n\nThe Uffizi Museum in Florence has appointed Milan-based artist Dario Catellani as its next director. The appointment was made in an announcement made by the institution on Friday, March 8, the day before the worldwide day of mourning for the victims of the devastating fire that broke out in a 19th-century former textile factory in the city on March 15.Catellani is the founder of the artist-run nonprofit engagement center Cinema Lorraine, which works with artists to produce projects to raise funds for victims of the fire and the city of Florence. The center plans to stage the inaugural exhibition, “For the Victims,” at its new location on March 16–March 20. The exhibition will include works by thirty-eight artists, including John Akomfrah, Renata Cervetti, Rosa de Córdova, and Ricardo Campos, among others based in Milan and Rome.Catellani has had a string of collaborations with artists, including Giacomo Balla, Andrea Bocelli, and Marcella Cor", "The next Biennial should be held at the Helsinki Contemporary Art Museum in Helsinki in January 2020. Moki Gätti will run a retrospective of work on paper at the July-August exhibition “Art’s New Year” at the Autumnavall Cultural Center in Vilnius in January 2021.\n\n\nThe Maryland Institute College of Art (MIA) in Baltimore has officially received a gift of twenty-six works from a collection that was housed at the institution since 1980. The works are works by artists working in both contemporary and traditional media, including Thaddaeus Ropac and Mary Beth Salter.The gift includes three original works, as well as new works by Ropac that were made with a new type of textile making and as well as a work by Salter, who is known for her organic pieces made from milk cartons.Commenting on the works, Mia Chair of Curatorial Affairs Vanessa Williams said: “These pieces were created as part of Mia’s ‘New Renaissance,’ ‘Formative and Contemporary,’ exhibition program, which explored the relationship between art and technology and its use in new and challenging ways.”\n\n\nThe British Film Institute (", "The next Biennial should be a real treat.” The show will also be hosted by artists such as Annie Prouvé, Mark di Suvero, and Kayode Ohnuki and will showcase work by thirty-four artists, including Akiko Nara, Leonardo DiCaprio, and Anna Atkins. The exhibition will be the largest and most ambitious exhibition of the artist’s work to date. “I’m thrilled to share with you the latest project that I’m working on, and I’m eager to see the results,” said artist Ana Paula Zuleta. The sixteen-foot-long sculpture, titled “Humanae (God’s Love),” will be performed by Zumba and will be on display in the exhibition “Prayer at the Masses” in September 2019.\n\n\nThe Museum of Modern Art (MoMA) in New York has removed a stone monument to Italian prime minister Giulio Andreotti in his honor that was deemed discriminatory by a group of Italian lawmakers. The blow was delivered in the form of a resolution that demanded that the museum move the bronze figure from its home in the East Village to a more prominent", "The next Biennial should be held later this year. We hope that the show will be able to welcome visitors soon. \n\n\nThe Museum of Fine Arts (MFA) Chicago is planning to open in a repurposed, 278,000-square-foot former furniture factory on the southwest corner of North and Western Avenues in the city on March 18. The museum will be named the \"Taylor & Francis\" Center for Art and Culture, and will feature an exhibition of work by seventy-eight artists. The museum’s inaugural iteration will feature a retrospective of Italian artist Paolo Verin’s “Nina and the Swan” (2016) and “The Box of Bones” (2017), and a solo exhibition of work by Theodoros Stamos’s \"The Dreamer in the Night.\" The exhibition’s show “Nina and the Swan” will open on March 22. In a statement, the museum said: “The Taylor & Francis will be a significant addition to the Museum of Contemporary Art Chicago, and we are excited to work with the team at the Francis-Dietrich Taylor & Francis, Inc. to make it the art destination it should be. The", "The next Biennial should be staged at the National Gallery of Art in Washington, DC, in 2021. Curator Larry Achiampong was named the winner of the 2019 Biennial Award for his exhibition The Fire, which is part of a global project addressing human-induced climate change. Jackie Kornbluth, the president of the Biennial Foundation, said: “The National Gallery of Art has been a leader in championing artworks and programs that address climate change and our shared environmental challenges in the twenty-first century. We are proud to receive the 2019 Award, which is a reflection of the National Gallery’s exceptional and sustained efforts over the last twenty-five years to advance the work of artists addressing climate change.”The National Gallery of Art in Washington, DC, is one of the largest collection centers for art in the United States. It has featured works by Alighiero Che Guevara, Frank Gehry, and Ed Moses, among others, and the institution recently completed a major renovation, adding new galleries, galleries with public spaces, and a new museum. \n\n\nThe 16th edition of the BALTIC Triennial, “Building Bridges,” curated by British architect", "The next Biennial should begin with a review of the current exhibition programme at the museum, and should be open to the public from February 28 to March 7. The theme of “American Art: From the American West to the Modern Middle East” will be “Art, Politics, and the Struggle for Civil Rights” and will be organized as follows: Beginning from the American West to the Modern Middle East. February 28–February 28. The following artists have been selected to represent their countries at the upcoming exhibition:  David C. Driskell, USA: David C. Driskell: Far from a political statement, this work is a statement of personal belief. It is a statement of a personal history, a history of upending the status quo. David H. Hart, USA: Hart is a self-taught painter whose method combines a creative process––his practice includes painting, sculpture, and collage––with a political and cultural critique of contemporary art. David M. Heiss, USA: A fifteenth-century Danish artist, Heiss depicts a world where art and politics are fused in a visual way that is both seductive and disturbing. The work is", "The next Biennial should have taken place in 2016 and will open on October 20, 2020. The pavilion will house works by twelve artists, including Yoko Ota, Dusan Andoje, Andrianja Antulova, and Masha Gessen, and will showcase the cutting-edge work of twenty-seven artists in the next two years. The first exhibition, titled “Tribal Signs,” was held at the Mies van der Rohe Museum of Art in Paris in 2016 and will return to the museum in 2019. The second “Heat,” will be held at the Botanical Gardens in Kiasma, Japan, in 2020. In 2018, Biennales of China and Japan awarded the same twenty-six artists seventy-nine awards.\n\n\nThe San Francisco Museum of Modern Art (SFMoMA), which recently commissioned an artist whose work was also recently featured in the 2019 Whitney Biennial, has released a statement regarding the work of Artist-in-Residence Tionga Ulukaya, who is currently incarcerated at San Francisco State Prison (SFU). Ulukaya’s work, which was featured in the commission by the San Francisco Museum of Modern Art, is now available for", "The next Biennial should take place in 2020. \n\n\nFrance will host the first edition of the prestigious Golden Lion for photography in the country’s history from December 5 to December 8, 2020. The event, titled “Photographique du Livre” (The Camera and the Life), will include interviews and expert curation by professional and emerging artists. It will take place in the Louvre and will be supported by the Royal Academy of Arts.The event’s organizers cited the upcoming May 6 reopening of the Louvre as a reason for the move. “The exhibition will be a celebration of photography, which has always been at the core of life,” said Audrey Desmarais, the director of the Royal Academy of Arts. “The upcoming months offer great opportunities for photography, as we return to our daily lives and reflect on the life and death of our heroes.”The event’s first exhibition will be “Cézanne at the Louvre,” which is scheduled to open on May 19, 2020. The show will feature images by the Belgian master, whose work was inspired by a journey he took on the Pacific Coast around 1972, to the Louvre.", "The next Biennial should be announced soon. \n\n\nThe Museum of Contemporary Art (MoCA), Buenos Aires, has appointed México Índo Pérez as its new deputy director for curatorial affairs. The recently retired professor of art history and director of the Centre of Contemporary Art, History, and Art at the University of the Peruginos, Puntarenas, will be responsible for supporting the work of the curators and historians who have shaped the institution’s collection.“In this exciting new role, Pérez will play a crucial role in ushering in a new era of exhibition curating at the Museum,” said museum director Santiago Pimentel. “Pérez’s history of working with and for the Los Angeles–based artists and curators, as well as his expertise in the art of international exchange, make him the perfect candidate for this extraordinary opportunity.”Last year, Pérez became the first director to lead the museum’s collection and administration since its founding in 1972. The appointment was made possible by the funding of a select group of individuals, including architect André Bézier, art historian and curators María", "The next Biennial should be held in 2021.After the exhibition is completed, the Centre will re-engage with the community to further engage with the cultural heritage of the city through programming including the Repatriation and Future Present exhibition, the Digital Divide exhibition, and the Rating the Future exhibition. The opening of the exhibition commemorates the centenary of the outbreak of World War II, and the centenary of the outbreak of the pandemic. The exhibition will also include a selection of biennial materials.\n\n\nThe California Academy of Fine Arts (CAFA) in Santa Barbara, California, announced today that it is planning to open a new museum dedicated to the arts in the city next year. The exhibition will be a “festival of the arts,” co-organized by the CAFA and the Los Angeles–based nonprofit arts advocacy organization the Los Angeles Community Foundation (LACCAF), and will focus on California’s art and culture, large and small, urban and rural, and will run from August to December.The institution will boast an outdoor courtyard and will be located on a 16-acre campus, which also includes a studio, a bookstore, a gallery, and a public gathering space. The museum will be co-", "The next Biennial should take place on September 23 and September 29. The premiere will be hosted by architect-designer Jan Neumann, who designed the exhibition. The biennial will be hosted by the National Museum of Modern Art in Washington, DC, and will be led by curator and curator of photography Michael Radcliffe.\n\n\nThe contemporary art space Sotheby’s announced today that it has received a $50,000 donation from the artist and philanthropist Mark di Suvero. The donation includes a lifetime achievement grant of $75,000. Di Suvero and his wife, Jodi, were longtime patrons of the artist and philanthropist. Between 2008 and 2013, the couple gave a total of $52 million to support artists. Di Suvero, who is known for his lavishly documented artworks, including works by the Dutch-born Dutch artist Joost Tversdijk, the late Italian artist Stefano De Bruno, and the Surrealist Antonin Artamonov, is survived by his son Christopher; his two children; and his partner, Sarah.\n\n\nThe Lerba Foundation, an umbrella organization that supports the annual fundraiser, which takes place in the Colombian city of Lerba, and the Art Fund", "The next Biennial should be held in 2018, the organizing committee said.\n\n\nThe Maryland Museum of Art (MMA) in Baltimore announced today that it is planning on closing its doors permanently in 2022 because of the cost of the coronavirus, which has infected more than 210,000 people around the world and caused 19,000 deaths in the United States. The museum estimates that it will lose $10 million a year due to the ongoing Covid-19 crisis.While the cost of the coronavirus has been reduced significantly in recent months, the institution had already indicated that it would be closed until at least April 20, 2022, the date that is now officially set for the closure of the museum. The announcement of the timeline for the closure coincides with that of many other cultural institutions, including the Metropolitan Museum of Art, the Brooklyn Museum, and the Bronx Museum of the Arts, which will be closed until June 30.The closures were prompted by the anticipated $8.5 billion Covid-19 emergency aid package—the largest set of federal spending packages since the pandemic first began in late March—and the institution’s decision to divest from the biennial. While the museum has yet to determine whether it will continue with the program or cancel", "The next Biennial should focus on the genesis of mathematics and science, art and art history, and the creation of culture, according to the organizers. The event will be organized as a biennial event, so that the first exhibition will open on October 26 and the second will run from October 30 to November 3. “We are extremely grateful to the government of Parma, to the beloved Pio Beach, to the public, and to the artists who have made the Festival a success,” said Giulia Cattelan, president of the association and president of the European Council. “Through dialogue with the Piedmontese community, we are convinced that a biennial event, as a way to develop understanding and cooperation between Italy and the surrounding regions, is the only way for the Italian and Italian-speaking people in general and the Piedmontese community in particular.”\n\n\nThe Honorees of the Order of the British Empire have been chosen for the 2019 edition of the Birmingham Biennial, which will focus on “the history of art in the city and region of Birmingham.” The honor is bestowed by a committee made up of representatives from across the United Kingdom and comprises James Cuno, director of", "The next Biennial should be held in 2021.The Thirteenth will be held in the United Kingdom in 2022.\n\n\nThe National Galleries of Scotland have announced that the organisation will shut down itsÂ arts and culture program and move the museum into an art museum. The institution’s last exhibition, “Museum of Fine Arts Glasgow,” which was staged in the summer of 2018, will be moved to the National Museum of Scotland, Edinburgh, later this year.“The National Galleries of Scotland has always operated as a cultural hub for the national community and is proud to have contributed to that work by providing a platform for the collaborative work of leading UK arts and culture organizations,” said National Museum director Nicholas Cullinan. “This year’s programme, which was assembled in partnership with curators, writers, and arts professionals across Scotland, was a reflection of that commitment. We are very much looking forward to the future with the team at the National Galleries of Scotland, while also knowing that the work of our curators and writers will continue in the institution alongside those of our partners across the UK.”The National Galleries of Scotland’s collection of more than one hundred thousand works by contemporary artists", "The next Biennial should be held in 2020. \n\n\nThe Museum of the Fine Arts (MFA) in Boston is planning to move the entire collection of art made in China to a new campus in the city. The move, which is slated to be completed in 2021, is part of a larger investment of $2 billion in the region by the museum. The move will also see a major revamp of the building, which is currently undergoing extensive restoration, making it more aesthetically pleasing and functional.“This is a transformational project for the MFA,” said Michael Patchett, MFA’s director and CEO. “The Canlis Foundation, which owns the collection, has committed to paying for the entire project and we are fully committed to this vision. We are working with the Canlis Foundation to determine the best course of action for the collection, which is housed in an original building designed by Frank Gehry.”Construction on the new museum began in the late 1950s and is nearly three hundred years old. It is currently being overseen by architect Marc Straus, who previously served as director of the MFA’s Pacific Standard Time, and is being funded by a $1 billion donation from the Stra", "The next Biennial should focus on the history of cities as well as on the future of cities and how they relate to one another and to the world. We will also discuss how the city of Seattle is engaged in a transforming process that is shaping our understanding of the future role of a city and the city’s role in the world.”The 2019 edition of the event, “Falling Into the World: The Architecture of City Living,” will be held at the Seattle Performing Arts Center (SPAC). The 2019 edition of the event will be hosted by Mike Moffitt, curator of contemporary art at the Museum of Fine Arts, Houston, and Will Gardner, director of the Museum of Contemporary Art, Los Angeles.\n\n\nArtist-run nonprofit Space, a New York City nonprofit dedicated to promoting and supporting artists, has released guidelines for how it may use images of seized artworks and objects seized in crimes that involve the collection, transportation, display, or sale of art. The guidelines state that “[p]olitical action may include, but is not limited to, the legal action of a court or a jury.”The organization may use the seized artworks and objects as collateral in criminal cases but must use them in", "The next Biennial should be held in the city in the autumn of 2020.  The theme for the 2020 edition is “Essays on Life and the Art.” This year’s event is titled “Essays.” The inaugural exhibition will include - “I’ve Never Seen a Church in My Life,” a monograph on the church of Saint Patrick by Peter Wächter, a German artist who was born in North Rhine-Westphalia but moved to Berlin at age twelve; “Human Nature” (2016), an exhibition organized by the New Museum in New York, and “Affections,” a 2016 exhibition organized by the SPA. The 2019 edition of the biennial, titled “Birds of a Feather,” featured work by Daniel Mouwadri, Mandy El Jalil, Naima J. Ibrahim, and Bérénice Parreno. A selection of artworks by Sara Goldstein, Mami Berrada, Patrick Corrigan, Rachel Chiu, and Dorothea Rockburne will be presented in 2020.The 2019 event was also hosted by the New", "The next Biennial should be held in the second quarter of 2021. The opening of the 1:1,000-piece curated exhibition, “Feminine: The Art of the Body” (2019), was marked with a performance by the contemporary artist Yeo Eun. Closed until March 21, the festival will return to the Park in December 2021.\n\n\nThe museum in the Israeli city of Beersheba, where the Museum of Jewish Art (IM) in Jerusalem will soon occupy a 150,000-square-foot space, has announced that it will postpone the opening of the museum by a year and has even revealed that it expects the renovation of the institution to begin in 2021. The announcement coincides with a yearlong campaign by the Beersheba municipality to raise $5 million for the construction of the city’s largest museum and the museum’s modernization, which is anticipated to be completed by 2025.“The municipality of Beersheba has launched a rebuilding program to fund the renovation of the museum, as well as the expansion of the city’s cultural and educational network,” said Mayor Nitzan Dov, who added that the project will be a model for the region", "The next Biennial should take place in the city in 2021.<|endoftext|>It has been a busy year for the New York City Department of Cultural Affairs (CADA). In the coming months, it will hold both its first annual exhibition “Theater” and its first festival, “Culture at the Zone,” both of which are scheduled to take place in Manhattan on September 11–September 12. The commissioner of the agency, Paul Browne, also revealed that there will be a redesign of the agency’s pedestrian, cross-town, and bicycle network, a $100 million expansion of the agency’s Digital Humanities Research Lab, and a reimagined NYC’s subway system.In an interview with the New York Times, Browne also revealed that plans for the agency’s 2020 edition are still in the works. The agency is currently collecting feedback on its redesign and will present the first version of the redesign during the agency’s annual pavilion at the Fifty-Ninth Venice Biennale.\n\n\nThe Museum of Modern Art (MoMA) in New York has added more than twenty-five artists to its curatorial team, including Uluwase Pazu, Kayode Ndz", "The next Biennial should take place in 2022. “The mission of the Museum of Contemporary Art is to present, in a historical and contemporary context, a collection of works that are both innovative and timeless in their production,” said Matthew Breer, director of the Museum of Contemporary Art. “We are excited to design and create the optimal environment for the museum’s upcoming exhibition, ‘The Basel Incident.’” In a statement, the Museum of Contemporary Art said: “The Museum of Contemporary Art is thrilled with the announcement of its new international partner, the Japanese conglomerate, Tochigi. With its extensive experience in international collaboration and dedicated support for artists, artists can play an important role in shaping the exhibition and exhibition programme of this great contemporary art museum.”\n\n\nThe fifty-fourth edition of the Biennale d'Art Contemporanea (BAC), which opened on August 29 and runs until November 22, will not include France’s role as host of the forthcoming edition of the Triennale, scheduled to take place in the city of Lyon in 2021, as a result of the coronavirus. BAC’s board of directors voted unanimously (47", "The next Biennial should be a biennial of the moon, with a new moon landing sequence, and should take place in the year 2021. Garima will represent Italy at the 2020 event. Garima will take the helm of the first exhibition, 'Regret and Repose', in the new pavilion, which has been developed by the design firm Manfreda Bocchia, at the Tiwani, Rome. The exhibition will be launched by an Italian artist, Elena Catellani, in a collection of 14 works that will be presented in the new structure.The biennial will be hosted by the Italian governor, Dario Franceschini, who will also assume the role of president of the Federal Institute of Design and Design+Architecture of Tomorrow, which is affiliated with the Italian Ministry of Culture, in the capital. The institution will be supported by the Italian NGO the Cooperative Art Foundation, which also organized several exhibitions at the Museum in Venice and the Museo di Arte Contemporanea in Venice. As Italy struggles to contain the coronavirus, which has sickened at least 123 people in the country and has infected more than 8,000 in the last four days, the government announced on Tuesday", "The next Biennial should be held in 2021. \n\n\nThe first exhibition of work from the new British pavilion at the Venice Biennale, which opens this month, has opened in the city of Bristol. Titled The Expanse, the exhibition is based on the novel concept of a vast expanse of uncharted, inhospitable land and will include works by thirty-four artists, including Mark di Suvero, Anish Kapoor, Vito Acconci, and Zoya Eid, and will present a search for a new kind of ocean. Its inaugural iteration, “The Red Sea,” will run in the city from May 21–May 27 and will be followed by “The Blue Sea,” in July.The 2017 winners of the Carbuncle Fellowships, a $5,000 prize whose inaugural iteration was held in May, include and . Last year’s biennale, which was focused on the ocean between the continents and was curated by British artist and curator Craig Davies, featured work by thirty-two artists. It was also the longest running exhibition of work by all the winners, who are: Amanda Bovall, Stephen Chbosky, Daniela Da", "The next Biennial should take place in 2021.\n\n\nThe British Museum has appointed Conor Dolan as its new director. He will be responsible for promoting the institution as part of a new partnership between the institution and the City of London, and will take up his new post in March 2021. “Conor has a deep and distinguished history at the museum, in terms of his achievements in developing new scholarship and developing the museum’s collection and exhibitions, and in his global career, which spans more than sixty years,” said Andrew Nesbitt, director of the museum. “This appointment marks a turning point for the museum as it enters a new phase of its history, one that will be guided by his international and institutional knowledge of art and history. This is not a moment of transition for Britain, but a moment of transition for the world.”Dolan comes to the museum from the Royal College of Art, which he has led since 2011, and will take up his new post in March 2021. He succeeds Simon Callender, who retired in September after twenty-two years at the institution, and will commence his first day on the job in March.“The Royal College of Art is the perfect home for Conor", "The next Biennial should be held at the Museum of Contemporary Art, Miami Beach; the Museum of Fine Arts, Houston; and the Museum of Contemporary Art, Chicago. Grand Jury Prize: Winner: Winner nominated and announced June 23.\n Sources: Artforum, Artnet, Artnet News, Artnet.com, Artnet.com, Art, Artforum, Artnet.com, Artforum.com, Artnews, Artnews.com, Artnews.com, Artnews.com, Artforum.com, Artnews.com, Artnews.com, Artnews.com, Artnews.com, Artnews.com.au, Artnews.com.au, Artnews.com.au, Artnews.com.au, Artnews.com.au, Artnews.com, Artnews.com.au, Artnews.com.au, Artnews.com.au, Artnews.com.au, Artnews.com.au, Artnews.com.au, Artnews.com.au, Artnews.com.au, Artnews.", "The next Biennial should take place in 2021 and will be hosted by the Hirshhorn Museum and Sculpture Garden in Washington, DC. The biennial will include the works of twenty-three artists, including Christie Golden, Eva Hesse, Lynne Melancon, Alex Katz, and Alan Shepard, as well as a selection of contemporary and experimental works. After the exhibition, the biennials will be moved to the Smithsonian American Art Museum in Washington, DC. The Hirshhorn Museum and Sculpture Garden will host the biennial for a limited number of guests in 2021. The exhibition will be inaugurated by a solo exhibition of work by artist and scholar Mona Hatoum, whose work was included in the first Biennial. The first Biennial was held in 1994 and was centered on African American art and culture, the Black Power movement, and the history of women in American art. The second Biennial was held in 2013 and focused on contemporary art and culture.\n\n\n\n\n\nKirk Adams, the longtime director of the Denver Art Museum (DENMA), one of the nation's most celebrated arts institutions, died at eighty-three years old on Monday. The cause of death was dementia, according to Denver7.", "The next Biennial should be held in 2025.”The royal commission, which was established to ensure that the institution’s $2.5-billion expansion would be completed in time for the 2020–21 season, was organized by the Turnpike Museum of Art in Portsmouth, New Hampshire, with the support of the Painted Ladies Foundation and the Turner Prize. The commission was led by curator Girard Pinchot, director of the Painted Ladies Museum, and curator of modern and contemporary art Martin Pacey, and was led by a British-born, American-based judge, Andrew Gilligan.Commenting on the commission, Gilligan said that the work “is about to be granted a new life through the extraordinary work of the judges, the consultants, the artists, and the curators, and about to enter a new phase of its evolution.”\n\n\nThe Carnegie Museum of Art (CMA) in Pittsburgh has appointed Patrick Keefe as its new deputy director of curatorial affairs. Keefe will be responsible for coordinating the curatorial team of the museum, which has two other locations in the city, and will take up his new post in January 2020. He succeeds Kelly Rind, who was hired as interim director of", "The next Biennial should be held in 2022, but the organisers say that because of the health crisis, there are additional dates to be announced. “We are at a critical time for our society, for the world, and for the biosphere,” said Adrienne Edwards, who has organized the exhibition for the past thirteen years. “We are in the process of rebuilding, rebuilding, rebuilding,” Edwards said. “It’s not going to be an easy process.”\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles is planning to move the exhibition “The Third Reich Years” from its current location in the Adler Center to a new space in Downtown LA. The move will allow the museum more time to prepare for a reopening in 2020 following the completion of a $100 million expansion.“The Third Reich Years” is a special exhibition that focuses on the ’20s German occupation and the transition to democracy,” said museum director Martin Pfeifer. “In partnership with the German government, MoCA is striving to present a comprehensive exhibition in honor of the thirtieth anniversary of the Nazi state, focusing on the themes of the Third", "The next Biennial should begin in 2020 and will include the completion of a major reforestation project (expected to involve the planting of several hundred thousand trees), improvements in climate and water security, and conservation practices. The themes of the exhibition will be “The ecology of the body” and “Economic development and ecology” and will be curated by an international team.The exhibition has also announced the opening of the seventy-fourth edition of the Biennale de Lyon, which will take place in the city of Lyon from March 14 to March 17, 2020. The exhibition will be held in the city of France from March 21 to April 3, 2020. The exhibition will feature more than five hundred works by seventy-five artists, including Aria, Adrian Piper, Chris Robinson, Charlotte Prodger, and Masa Takao.“We are thrilled to open the forty-seventh edition of the Biennale in 2021 with the sculpture of the artist John Akomfrah,” said Ritchandro Pirotte, director of the Biennale. “We look forward to the next iteration of the exhibition, which will be an exceptional showcase for the work of the new generation of contemporary art.”\n\n\nThe", "The next Biennial should kick off in March 2021. A selection of works by the artists will be presented by national and international artists in collaboration with the Department of Culture and Tourism. The theme for the 2020 event will be “Temporality in Motion” and will be based on the work of Italian painter Nino de Simone, whose bodies and landscapes are often interlinked. The biennial will run as a two-month event, from May to October, and will include a number of reimaginings of Milan’s Sicilian Village and a project examining the relationship between the artist and landscape.The selections for the 2019 edition of the Biennial include The Painted City, a series of sculptural tributes to the late Italian architect Raffaello Cattelan, whose body of work includes some fifty works; The Great Wall, a monumental study of the historical and physical landscape of ancient China; and The Teapot, a monumental urban landscape with a water-based sculpture that sits in a river. The biennial will also include a production of the works of Benthic Mayan artist Angel Maseres and a work by Paz de la Peña.\n\n\nThe Museum of Contemporary Art (MoCA),", "The next Biennial should be held in the next four years, with the goal of developing a new conceptual framework for the exhibition. The show will highlight the work of the biennial’s curators in their respective mediums, and will explore the intersections of biennial and contemporary art. “Art is not a luxury, it is a necessity: it is what we are and what we do,” said Olga Cesarco, chair of the Biennial Commission. “‘Art is a necessity for the survival of the species.’”In the exhibition Biennial of the Arts, the artists created works that engage with contemporary issues such as climate change and the impact of art on society. The festival will take place in the Museo de Arte Contemporáneo de Buenos Aires (MASA), located in the city of Buenos Aires, Argentina, from January 6 to February 3, 2020. The exhibition will also be traveling to Cancun, Mexico, and Hong Kong. “The Biennial will be a collaborative project, a journey of artists, curators, scientists, artists, architects, filmmakers, journalists, and the artist, by visiting the works of the artists, and sharing their", "The next Biennial should be held in 2021, from the date of the inaugural exhibition in the ten-year anniversary year. The next edition of the Biennial will be held in the same location, in the same period, in the same location, on the same date, and with the same content. The 2019 edition, which was organized as part of the Tenenbaums’ cooperation with the city of Hamburg, saw a total attendance of 6,200 people.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Lauren Ritchie as its next director. In her new position, Ritchie will be responsible for orchestrating a comprehensive cultural revitalization plan that includes the reopening of the museum, expanding its public programming, and revamping the building.“We are delighted to welcome Lauren to MFA,” said Matthew Doyle, the museum’s deputy director and chief curator. “With her vast experience and passion for art and her expertise in shaping cultural experiences through her work in retail, she has the opportunity to further develop and strengthen the MFA’s collection and exhibition program while creating a new kind of public space and an exciting new experience for visitors to the museum.”Ritchie comes to", "The next Biennial should bring together forty artists, twenty-nine writers, and twenty-three curators, comprised of thirty-four artists and twenty-four writers, in order to receive the award of its occasion. The winners will be announced on June 27.The biennial will be staged in a concert hall in the city of São Paulo, Brazil, in the Brazilian state of Bahia, Brazil, and will be led by an artistic director and curator from the city of São Paulo, João Pimentel. The show will include “futurism,” art history, and design, as well as “painting, painting, painting,” design, and sculpture,” and will take place at the Museu de Arte de São Paulo (MASP), the Universidade Federal do Rio Grande do Sul, and the Largo da São Paulo.The biennial’s artistic director, Marta Milad, said: “This year’s Biennial has been a very positive development for art and art history. We’ve been able to increase the visibility of the field through our exhibitions, through our exhibition program, and through our publication program, and these", "The next Biennial should take place in 2021. \n\n\nThe National Geographic Society, which has faced mounting pressure to shed more than a third of its staff after it closed in 2016 to undergo a costly restructuring, has agreed to relieve some twenty-five employees of their duties as part of a ten-year deal worth $7 million.The employees are scheduled to be relieved of their duties on January 31, 2021, and will be retained on a part-time basis, reports the Washington Post.The seventy-third edition of the National Geographic Society, entitled “What Everyone Should Know,” was canceled in March because of the pandemic. The eighty-third edition of the National Geographic Society, titled “Who Moved My Brain,” was also canceled, but the full run of the exhibition will resume in September.The National Geographic Society’s board of directors approved the management-resignation plan in a five-to-one vote on Tuesday, after the board of trustees released a statement which reads: “The board of trustees of the National Geographic Society is pleased to announce that Whitney Pope will be the next president. Whitney’s long-standing commitment to advancing National Geographic’s mission and maintaining a strong and", "The next Biennial should focus on the history of photography and the twentieth-century, with a particular focus on the creative process and the relationship between director and audience through the medium. We will present the exhibition together with a selection of works that have been selected to be included in the exhibition and we invite you to join us for a journey through the history of photography. The theme of this year’s Biennial is “Visionary Visionaries: A Retrospective of Andy Warhol and Maxim Gorky” and we invite you to follow our journey as we follow the work of our artists and explore the many contributions of the exhibition. Andy Warhol and Maxim Gorky are among the most important figures of the twentieth century. They were together from 1953 until their deaths,” said Deana Haggag, chair of the board of trustees of the Biennial. Haggag also thanked Los Angeles’s Art Institute of Chicago, which was also represented by the Biennial board, for its work on the project, which was launched in partnership with the Los Angeles County Museum of Art (LACMA), as well as Pittsburg’s Paul Hamlyn Gallery, New York; and the Los Angeles County Museum of Art,", "The next Biennial should be held in January 2021.\n\n\nPilgrims the world over are exhorting local authorities and cultural institutions to seize the massive untapped natural resources on the planet, such as the world’s fresh water and agricultural biogas, and redistribute them widely through social and cultural activity. As more countries realize the economic and climate realities of climate change, they are demanding that the global community act swiftly to curb greenhouse gas emissions.In the coming months, the United Nations Framework Convention on Climate Change (UNFCCC) will launch a multi-year campaign that will draw global governments, including the United States, China, and France, together to the Paris Climate Action Summit in December 2020 and December 2021. The campaign will emphasize the global imperative to slash greenhouse gases and prepare for a rapidly rising planet.\n\n\nThe Museum of Arts and Design (MAD) in New York has received a major gift of forty-five works by the late American artist Richard Anuszkiewicz. The donation includes works by thirty-six of the artist’s works in a single edition, a massive set, titled “Richard Anuszkiewicz: Daughters,” that was released in 1966 and is currently on display", "The next Biennial should be held at a suitable location in the city, which already plans to move several thousand people from its current home at 174 Wall Street to the expanded museum. The move will also see the building renovated, and will involve the addition of a retail, dining, and conference space.The announcement that the museum would be moved prompted protests from some who said the museum’s planned location was not in the city’s best interest. Meanwhile, a group of local residents, led by architect Robert Foster, began a campaign to prevent the redevelopment of the museum, which is located on the ground floor of the former site of an auto assembly plant, by staging a demonstration in August. The group included architects Richard Rehn, Michael Resnick, and Mark Stirton, who created the space-based installation The Platform, which blends three themes: science, technology, and art. The installation was inspired by the museum’s history with the auto industry, an industry dominated by two companies, General Motors and Chrysler, that merged in 2006. The merger forced the museum to shift its focus from cars to a different museum, the Chrysler Assembly Plant in Marysville, New York. The building is slated to reopen in 2022. ", "The next Biennial should be held at the campus of the University of Cambridge, in March 2020. It will receive $125,000 from the Arts Council to develop the first programme of public artworks in the United Kingdom. \n\n\nThe Solomon R. Guggenheim Museum (SGR) in New York City has received a gift of forty-nine ancient Roman mosaics, dating from the second century CE to AD 250, from the Royal Institute of British Architects (RIBA). The donation was made by the international artist-collector the Italian architect Daniel Merhi. The mosaics, valued at between $3,000 and $5,000, were acquired by the RIBA in partnership with the British Museum, the Metropolitan Museum of Art, and the National Galleries of Scotland. The organization also provides funding to partner institutions for conservation, preservation, and research.“We are incredibly grateful to the RIBA for allowing us to collaborate with the museum in developing this important collection,” Merhi said. “The works will be displayed in the institution’s permanent collection galleries in 2020 and will be accessible online through the late 2020s. The work will also be included in the exhibition ‘The Universal Period,’ which", "The next Biennial should be held in January 2020. “The visionary mission of the Biennial is to define and articulate the radical possibilities of art in a post-digital world,” said Giulia Biagi, director of the Biennial. “The new exhibition will give the audience a new opportunity to experience art through the eyes of Cassini, to understand how art has made possible all the great innovations, and to be inspired by the future.” Since its inception in 1982, the Biennial has been a platform for artists and thinkers, connecting them and their concerns. The first edition, which took place at the Veneto Museum in Milan, was staged at a space in Rome, the Palazzo Bernini. It was followed by the second in Turin in 1986 and the third in Venice in 1998.\n\n\nThe art museum in the capital of Bangladesh, Dhaka, has appointed former principal curator and ex-chief curator of contemporary art Kamila Matsuryo as its new artistic director. Matsuryo currently serves as the principal curator of the exhibition “Amenity/Baba Alayib” (2017–18), an interactive exhibition organized by the Center for Contemporary Arts (CCA)—a project of", "The next Biennial should be held in 2021.\n\n\nAn open letter addressed to the Dubai Art Museum (DAM) and signed by more than 1,500 art-world professionals is demanding the institution stop selling works by artists whose practices are considered “outside the mainstream.” The letter, which is dated November 1, 2017 and addressed to the director of the Dubai Art Museum, Ashraf Al Qasimi, and was written by Sarah Blesener, director of the Contemporary Art Museum St. Louis, and Kamiar Shah, the director of the Abu Dhabi Museum of Art, reads:“The museum has been working to remove works by artists considered ‘out of the mainstream,’ including Abdul Majeed, Arwa Majeed, Zina Abou-Rahme, and Ali Sina. This is a step in the right direction in that it recognizes that these artists are not part of the current museum atmosphere and that their practices are not supported by the institution. We ask that the museum take this step in line with its commitment to diversity and in line with our values as a museum. In a future edition of the exhibition, we hope that the works will be permitted to be displayed and that this", "The next Biennial should be led by an independent curator and curated by a jury comprising: Partha Subramaniam, director, Delhi Art Museum (DAM); Partha Natarajan, director, Delhi Art Museum (DAM); and Chitra Srivastava, director, Mumbai Art Museum. The next edition of the event will take place in the coming months.\n\n\nThe Museum of Modern Art (MoMA) in New York is planning to cut more than $100 million from its budget for the 2020 cycle, including more than $65 million from its editorial department and its curatorial staff. According to the New York Times, the move was made in an effort to reduce costs as it works to restructure its business and attract more money from donors.The restructuring plan, first reported by Artnet, will involve layoffs, furloughs, and hiring freezes—a combination that will reduce the museum’s total work force by more than one-third. The Art Newspaper reports that the museum is planning to close its Palazzo della Fioritta, the well-known space in the heart of the Museum of Modern Art in Manhattan, to make way for a $1.2 billion renovation that will include the construction", "The next Biennial should take place in Amsterdam in 2021 and will be hosted by the Flemish city of Fribourg with Kunstkamera at the Radisson Center in Brussels.The exhibition will also feature works by artists such as Nari Ward, Nara Shah, and Ulla and Kiruna.<|endoftext|>Peter Abel, the British artist most closely associated with the German Expressionist movement, has died at age seventy-nine. His work—comprising over nine thousand paintings, drawings, and collages, as well as sculpture and photography—was most celebrated in the United States, where he lived and worked for some fifteen years, from the 1940s to the 1980s.Born in London in 1940, Abel moved to Paris at age seven, where his father took him to the local art galleries to see paintings and drawings by Pierre-Auguste Renoir, Georges Apostène Renoir, Pierre-Auguste Lalanne, and the Russian avant-garde, Alexander Chekhov. Working in the States, Abel often used his mother for inspiration, and he later confided to a friend that his mother was the reason he had chosen to leave England to emigrate. He returned to London in 1961, only to live there for another", "The next Biennial should take place at least five years after the date of the last edition, and should assess the status of contemporary art in the country.The twenty-first edition of the Biennial will be held at the Stedelijk Museum in Amsterdam, in November 2021.\n\n\nThe Avon and Somerset Museum in London announced today that it is planning to close for a period of eighteen months, beginning on March 19, 2020, to re-evaluate its future plans. In a statement, the institution said: “The exhibition programme, exhibitions and the program of public programming in the museum has changed dramatically since we were first established in 1871, and we need to re-imagine our future.”“We believe that the right balance between exhibition and research needs to be struck, and between research and presentation needs to be maintained,” said museum director Philippa Cole. “We will continue to provide programs that engage with the body of work in the museum, and on our website and to engage with the people who visit us in the local area.”Cole added that the museum expects the closure to be \"the longest phase of its reopening program since its reinstallation in 1971.” The museum will continue to", "The next Biennial should be curated by Paul Mpagi Sepuya and will include a selection of works by Wangechi Mutu, he of the Kenyan National Union of Arts, and include works by artists such as Mpagi Sepuya and the late Ntokozo Ndzube (1913–1988) and the late Nkosazana Ndzube (1913–1988).The next art fair, planned for next year, has been postponed until 2020. According to a statement on the fair’s website, the theme of the year will be “Security, the Future and the Present: Beyond Art and Politics,” and will be updated with the 2019 edition. Artforum has reached out to the organizers of the next fair for comment. \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Adam Gopnik, who formerly served as deputy director of curatorial affairs at the museum, as its next executive director. Gopnik comes to the institution from the Metropolitan Museum of Art (MoMA), where he has served as director of curatorial affairs since 2013. He succeeds David H. Ribas, who retired in February 2019 after eighteen years at the", "The next Biennial should be hosted at the very moment when we are facing a crisis of systemic and transnational violence against Indigenous people and vulnerable people in particular. I encourage all Indigenous people to take part in this next biennial, both as a matter of principle and as an expression of our collective responsibility to address the world in our behalf.”\n\n\nThe National Gallery of Scotland has appointed Kim Ford as its new deputy director. Ford joins the institution from the Institute of Contemporary Arts, where she has served as chief curator since 2017. During her tenure, she has led exhibitions such as “NIRIN” (2019) and “MONARCH: FORGOTTEN WOODS” (2019) and has organized more than eighty shows. She will assume her post next month.“It is a fantastic opportunity to have worked with Kim and to have had the opportunity to work with her,” said Phil Gins, director of the National Gallery. “Her demonstrated commitment to the museum and her ability to bring people together across disciplines and disciplines and perspectives and the breadth of her international career experience makes her ideal for the role of deputy director.”Ford will take up her new post in January 2020.\n\n\nThe", "The next Biennial should take place in December 2021. The next iteration of the theme, “Art and Design—The Future of Humanity as We Know It,” will be staged in February 2022.The first edition of the Exhibition was held at the Museum of Fine Arts, Boston, in November 1958. The curator of the exhibition was Allen Ginsberg. The exhibition culminated with the installation of the sixteenth Biennial in May 1963, and the year before that, the seventeenth in June 1963.\n\n\nThe New York State Court in Manhattan has determined that American Grownal, the popular New York flower shop founded by David and Margot, is not liable for more than $2 million in market damage caused by a fire that broke out in their space in the building on Atlantic Avenue in November 2011.The New York Times reports that the defendants, American Grownal, were ordered to pay $1.5 million by the court, which also ordered the defendants to refund the owners of around $1 million. The court determined that the defendants failed to warn the plaintiffs that the space was being used as a growing and processing center for the defendants’ commercial plants, which were contracted to the plaintiffs.The defendants are expected to appeal the ruling.\n\n", "The next Biennial should take place in the country from March 19 to March 21, 2021. The show will offer visitors a glimpse into the life and work of this enigmatic artist. Commenting on the theme, Adrienne Rich, chair of the festival, said: “For the past twenty years, our program has attempted to present a wide range of work by contemporary artists in a manner that allows visitors to experience Biennials as a unified entity. With the new exhibition, we hope to do that by integrating the work of fifty artists into a single exhibition.”The 2019 edition, which featured work from seventy-seven artists, featured work by seventy-six artists, from Elizabeth Peyton to Wolfgang Paalen.\n\n\nThe Toskvarna Art Gallery in central and northern India will be transformed into a museum dedicated to the art of the Indus Valley by the National Galleries of India (NGA) in the next few weeks. The new venue will house the museum’s collection of more than one hundred thousand works from the Indus Valley region. The museum will inaugurate the museum with an exhibition of work by the late Indian artist and thinker Joy Godfrey-White, which will also include works by artists such as Satyajit", "The next Biennial should take place in 2020. The 2018 event—which featured work by sixty artists—was held at the San Francisco Museum of Modern Art.\n\n\nThe museum where the groundbreaking exhibition “The Crying of Lot 49” was staged is facing an uncertain future as the city of Seattle looks to replace the iconic Safeway Building with one that preserves the building’s historic significance and can accommodate a rumored expansion of the Museum of Northwest Art.Commissioned by the Seattle Asian Art Museum (SAAM) in 1954, the exhibition was one of the first documented encounters between Asian artists and Western art. In an attempt to bridge the gap between East and West, the museum featured works by twenty-six artists in a limited-edition exhibition entitled “The Art of the West.” The final panel of the show, by artist Franz Kline, featured the work of artists such as the Polish American painter Jozef Rand, the German sculptor Erich Maria Remarque, and the Brazilian choreographer/actress Cara Carrington.The new building is slated to open in the fall of 2022 and will house a selection of Kline’s works. The institution is currently working with architect Stephen Gould to determine the layout", "The next Biennial should focus on visual art and create an open platform for a new generation of artists, and should address the current crisis of public health and the possibility of a negative impact on art and culture through climate change. The theme of this year’s exhibition should be sanctuary, so that art and culture can be experienced as resources to be nurtured, protected, and used in the service of healing and well-being. Maria Balshaw, chairman of the trustees of the Museum of Contemporary Art Indianapolis, said: “We are thrilled by the enthusiastic response from the museum’s community, the portfolio of work selected, and the public to the 2018 exhibition. We look forward to the 2019 exhibition and to engaging with our community in 2020.”\n\n\nThe National Gallery in London has appointed Emma Harrison as its next director and chief executive. Harrison comes to the institution from the National Centre for Contemporary Art (NCCA), where she has served as chief executive since 2013. She succeeds David McAllister, who led NCCA through a $100 million refurbishment and expansion project, and will take up the post on August 1.“Emma has been instrumental in transforming NCCA from a closed museum into a world", "The next Biennial should focus on regenerative urban planning and the blueprint for sustainability in cities,” Andreas Hültner, chair of the exhibition’s curatorial team, told the Art Newspaper. “The new theme will be ‘Resonation,’ and will be organized as a series of interrelated exhibitions that will include new and emerging artists and crafts and will be organized in collaboration with the artist-run spaces in the city.”The inaugural exhibition, “The Future is Here Now,” will open on June 1 at the Mannheim Museum of Art, and will be on view through August 18.\n\n\nFollowing an exposé by the New York Times in April 2018 that exposed the massive, decades-long conspiracy of professional and amateur researchers employed by New York museums to generate research for their exhibitions and acquisitions, the city attorney’s office in Manhattan filed a lawsuit against the museums on Monday, May 11. The suit alleges that the New York Museum of Modern Art (NYMoMA) and the Metropolitan Museum of Art (MoMA) are guilty of “deliberately and maliciously altering the exhibitions and acquisitions presented in their exhibitions, with the intent to promote and perform artist-centered exhibitions at", "The next Biennial should take place in September 2021.\n\nThe Metropolitan Museum of Art in New York is currently working on a new exhibition dedicated to the work of the late American painter Alice Miller, a major influence on artists such as Vincent van Gogh and Robert Irwin. The exhibition will be titled “Her Body and Her Dreams” and will be organized as follows: “The Met, ‘Her Body and Her Dreams: An Exhibition of Her Art, 1950–1959” will run from November 15 to December 16, 2020 at the Metropolitan Museum of Art and will feature the work of seventy-two artists. “Each artist will be given the opportunity to present their work for a one-hour solo residency as part of a program of nearly thirty years,” the museum said in a statement. The residency program runs an annual fee of $50,000 and will host fifty artists. The announcement follows the recent exhibition “Alice Miller: A Retrospective,” which ran at the Museum of Contemporary Art Los Angeles from September 19 to September 21, 2019. The exhibition included works by seventy-six artists including Charles Atkins, Camille Blatrix, Mary Boone, Harry Walker, and Arthur Primas.The exhibition was", "The next Biennial should focus on reconciliation and the centrality of art in indigenous histories and the life cycles of people, culture, and nations. It should also address how art and history intersect to shape our collective identities and the ways in which we relate to the world around us.”The 2019 edition of the Biennale will be staged at the Grand Budapest Museum in Hungary, which opened in March. The venue will present the highlight of the year, featuring the work of forty-four artists. The full list of participating artists is as follows:• Peter Bjerggaarden (Denmark)• Jörg Lück (Austria)• Tomáš Ljubljana (Croatia)• Martin Skrota (Croatia)• Peter Ujthnates (Austria)• Klaus Von Neumann (Austria)• Sven Wohn (Sweden)• Atmos (France)• František (Switzerland)• Anuszków (Poland)• Kieŧel Jánmíček (Poland)“The Body ” (Italy) “Helen Frankenthaler: The Body in Space (1955", "The next Biennial should focus on how to protect the delicate ecosystems of the world’s oceans and how we can work together to address climate change. The 2020 edition of the event will be hosted at UC Berkeley.\n\n\nThe Philippine Museum of Art (PMA) is now allowing the public to visit the institution’s former exhibition space in the city of Makati, Manila, for the first time in 2019. The museum has also made it easier for visitors to visit the former space through a digital portal launched on Saturday, March 21.The new digital-only pavilion at the museum will showcase work by forty artists, including Antronio Caro, Carlos Conti, Edgardo Paz, Ana Paula Real, and Joan Jonas, as well as a selection of public works. The museum has also revealed that it will bring back its original 2006 exhibition, “The Greatest Happiness.” The show, which featured works by forty famous Filipinos, is currently on view in the museum’s newly renovated building.According to the museum, the exhibition was critical in establishing the institution as one of the leading Philippine art museums. It also organized the show, “The Breath of Life,” in 2007 and won the International Filipino", "The next Biennial should focus on placing artworks in the public imagination within the context of local and historical stories. The theme could be “Performative Democracy” or “Art and the Conceptual State.” The trial runs of two new works—one a giant, two-dimensional collage on paper and a painting on canvas, the other a canvas and a sculpture—are planned for August and September. Nam Y. Huh, a professor of English at the University of Hong Kong, said: “The theme of the exhibition is ‘solidarity.’ Movement and movement is key to the narrative.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has announced that it will reopen to the public in early 2020 as part of a new $1.1 billion renovation. The reopening will coincide with the opening of a new exhibition, “Sensation,” with works by fourteen artists who are participating in this year’s Fifty-Eighth Venice Biennale, “Through the Camera, Into the Wild,” at the Venice Architecture Biennale. The work, which was first staged at the Venice Architecture Museum in 2009, is now on view", "The next Biennial should be held in the spring of 2021.  The challenge now becomes to build on the momentum created by the exhibition and to use it to increase the visibility, both locally and internationally, of contemporary art in Mali.\n\n\nThe French architect Arnaud de Bont as well as the Vienna-based firm maLADe, which helped Sahel-based art by artists such as Pierre-Auguste Renoir, have been awarded a total of €1.2 billion ($1.3 billion) in the second round of the annual Paris Biennale, which was canceled due to the coronavirus. The sum is more than six times the French government’s pledge to the event—€124 million was allocated for the fall edition, and the venue has reportedly received a further €130 million from a consortium of French, Belgian, Italian, Dutch, and Portuguese artists, including Pierre-Auguste Kudacki, Michel-Michel Aigner, and Pierre-Olivier Huyghe.Among the additional funds are €106 million (€100 million with a limit of €50 million) to the festival’s artistic program, the rest going to logistics, €100 million (€90", "The next Biennial should also take place in 2021, and is expected to take place in the seaside village of Baccarat in the island of Ceylon\u0097the site of the original exhibition, which was held in 1962.The selection of the seventy-three works, which were selected for their \"performances’ and \"thematic vision of the artists’ work in the context of the life and work of the artist at that time, will be based on the cultural, social and aesthetic values of the country.”\n\n\nThe Centre Pompidou, the Paris-based arts institution, has announced the opening of a new digital platform, the biennial d’Art pouvoir, on September 25, 2020. The inaugural edition, “Pineapple,” will feature twenty works by forty-nine artists and will run on the Centre Pompidou’s server as part of a commissioned exhibition by the institution. The exhibition is a redesign of the institution’s current programming that was inspired by the architect-built Centre Pompidou, a multidisciplinary, modernist art complex inspired by the architect’s original vision for the building.“The project", "The next Biennial should be held in December 2020. When asked about the possibility of a 2024 edition, Tung said: “Absolutely. I am very excited about the show, what we will be able to see in 2024, and to be able to share this show with the world.”In a statement, the biennial said: “The exhibition is already a huge success, attracting many millions of visitors to Hong Kong, which is a microcosm of the world. We are very happy that the show has become a huge success, reaching new audiences and that it has become an internationally-recognized symbol of Hong Kong. To be able to present this exhibition in a new setting in Hong Kong will also be a great opportunity for us to build on the success of our inaugural exhibition.”\n\n\nThe Stockholm Biennale Foundation, which has been hosting the event since 2008, has announced that it is launching a new initiative to boost the visibility and preservation of the artworks and collections from the Swedish city of Gothenburg.The foundation, which consists of the Swedish Cultural Heritage Agency and two regional councils, has established a new initiative titled Gothenburg Projects, which will focus on acquiring works by individuals and groups in the city. The", "The next Biennial should be announced in the fall of 2019. The theme of this year’s iteration is “Sustainability, Innovation, and Design.” The work will be curated by Lorenzo Cipolletta, the chief curator of the illustrious Stedelijk Museum in Amsterdam, and will be collaboratively curated by Doane Herwen, the curator of contemporary art at the Ankerbauer Aquaria in Venice, and Carolana Iannone, the curator of contemporary art at Museo de Arte Contemporáneo in Venice, and will be presented by Bertrand Lajoie, the director of the Stedelijk Museum, in collaboration with Simon LeVay, the curator of contemporary art at the Ankerbauer Aquaria.“With such a long history, the collection of the contemporary art of the Sixteenth International in Paris, the collection of the contemporary art of the Ato Balti Museum in Venice, and the collection of the modern and contemporary art of the Venice Biennale, the collections of the Biennale de Lyon and the Künstlerhaus in Cologne, were established by the same people, the same people for generations,", "The next Biennial should take place in 2021, but the organisers said that a decision on the fate of the exhibition is still being taken.\n\n\nThe Art Newspaper reports that the 10,000th edition of the Venice Biennale will take place on June 4 in the city of Venice, Italy. The event will mark the fifteenth anniversary of the Venice Architecture Biennale and will mark the fifteenth anniversary of the Italian pavilion at the Venice Architecture Biennale, at a time when the Venice Architecture Museum (VAM) is currently being renovated and plans to reopen in 2021. The theme of the 2017 edition, “New Landscapes, New Life,” was “New Things to Live For,” a concept first developed by Italian architect and architect-in-residence Paolo Tosatti.“We are happy to be able to celebrate the tenth anniversary of the Venice Architecture Biennale in a very short space of time,” said VAM director Antonio Catellani. “This is the moment when we are able to see the full picture of architecture, to understand the depth and dynamism of the theme, the great contribution of Paolo Tosatti and his teams, and the breadth of architecture from", "The next Biennial should be announced in the second half of May, with the exhibition to run until November. In a statement, the Museums Association (MA), which represents the worlds' leading biennial collectors, said: “We are delighted to be working with Zara to bring you an exciting exhibition celebrating the life and work of our collection at the Museum of Modern Art. We hope the show makes clear the importance of the work that our collectors have done to define the boundaries of contemporary art.”The institution is also planning to create over three hundred new curatorial and research positions through the acquisition of works over the next two years. The artists selected for the new positions are a selection from the collection of Richard Avedon, the Swiss collector and philanthropist whose vast holdings include works by Salvador Dalí, Damien Hirst, and Pierre-Auguste Renoir; paintings by sculptors Remo Althaus, Robert Mapplethorpe, Cécile B. Anton, and Andrew H. Wilson; and video works by artists including Claude Monet and Jasper Johns.\n\n\nThe British artist Anatole Shagal has won the 2017 Turner Prize. Shagal, whose works investigate the origins and potential of art, was nominated for", "The next Biennial should take place in 2020 and will aim to present a collection of works from the collection of the late artist Joan Miró. The museum will also be preparing for the creation of a new exhibition of works by the museum’s contemporary artists and will organize an extraordinary exhibition of contemporary art in the museum. The franchisee of the museum will be transferred to the artist’s heirs.The first show to be presented by the new president will be “Art for the Future,” a show organized in collaboration with Zaha Hadid Architects of the US Pavilion, “Architecture of the Future,” a show organized in collaboration with Carthusian Italian artist Guadagnoli. The exhibition will consist of sculptures, paintings, drawings, photographs, and installations, which will be presented by an international team led by Winthrop Posen, the curator of contemporary art, and will open in Helsinki in January 2021.The new exhibition will include thirty works by a group of artists who are currently represented in the US’s pavilion at the Fifty-Ninth Venice Biennale, with works by artists such as Julian Schnabel, Vicki Rogers, and Kate Mulgrew. The show will be curated by L", "The next Biennial should take place in the city of Osaka in 2020. The event will host fifty artists, including Hiroshi Kawai, Karen Hsu, and Simone de Beauvoir.\n\n\nThe Museum of Modern Art (MoMA) is finally giving New York a retrospective of the work of Sixto Scarme. The collaboration between the artist and the museum is unprecedented in scale and, as director Alexander LaTourette explained, has a number of important themes.“In the early 1900s, Scarme discovered an experimental way to create large-scale works that were not bound to any specific notions of form, while also cultivating a winningly intimate relationship with his subjects, who were often themselves experimental and artistic,” said LaTourette. His first retrospective was in 1967, for which the artist donated six paintings by his wife, Anna Sebastian. Since then, Scarme has had twenty-six exhibitions, including in New York, Los Angeles, and Mexico City.In the exhibition “The Work of Sixto Scarme” (2016–17), the artist created three works by his wife, Anna Sebastian, using acrylic paint and artificial materials including cement, plastic, and", "The next Biennial should be held in the spring of 2021. The work, which will be presented by Harjit Singh, will be centered on the life and times of a legendary Hindu sage and will also address themes of family, caste, and spirituality. The entry will be open to the public for free and will contribute to the themes of the biennial.The biennial will be organized with the help of the National Museum of Indian Art (MoI) in Delhi and the National Gallery of Art in Washington, DC; the National Gallery of Art; and the Art Institute of Chicago. The inaugural exhibition, “Between the Earth and the Air,” will feature work by sixty artists. The show will also feature new works by the British artist Luke Davies, whose life and work is currently featured in a solo exhibition at the National Gallery of Art in London. The exhibition will include work by eighty-two artists, including Pierre-Auguste Eschbach, Jean-Michel Salomé, Heinan Chiu, Luis Fernando de la Barra, Vijay Guptill, and Amr Atallah. For the second half of the exhibition, titled “Between the Earth and the", "The next Biennial should be held in 2021. The Biennials are an annual event that has been held since 1962. The biennial was founded by the Gujarat government to commemorate the 150th anniversary of its independence from India. The 2020 edition is on December 28 and will be hosted by the Gujarat Museum. Anne-Marie Oostra, who is the director of the Biennials, said: We are looking forward to this year’s exhibition to be inaugurated by fabulous artists such as Anuradha Ghandi and Praveen Ghandi, who are transforming the Golden Temple in Oman and bringing the art of the Arabian peninsula to our visitors.It is an exciting time to be a curator in the UAE, with the coming years marking the centenary of the establishment of the UAE’s independent state and the 2020 show is shaping up to be a new chapter. We are fully committed to supporting artists, arts and institutions who work in our country and to ensuring that they have the opportunity to showcase their work.”\n\n\nThe Museum of Fine Arts (MFA) in Seattle announced today that it is waiving its annual admission fee for its newest exhibition, “Paintings from the European Union,", "The next Biennial should be held in 2022.\n\n\nThe National Geographic Society’s proposed redesign of its headquarters in Washington, DC, has been put on hold by a judge in a federal lawsuit brought by artist Jordan Peele after the organization announced plans to eliminate more than three hundred of his photographs. The suit, filed by Peele and the US District Court for the District of Columbia, accuses the National Geographic Society of creating a “significant and irreplaceable ‘debris field’” by removing nearly two hundred Jordan Peele photographs from the institution’s collection.“It is unprecedented in its scale and scope,” US District Court Judge William Alsup wrote in a three-page order issued on Tuesday. “It is an outrageous violation of the plaintiff’s First Amendment rights to the free exercise of his own artistic expression.”The National Geographic Society’s proposed redesign of its headquarters in Washington, DC, has been put on hold by a judge in a federal lawsuit brought by artist Jordan Peele after the institution announced plans to eliminate more than two hundred of his photographs. The suit, filed by Peele and the US District Court for the District of Columbia, accuses the National Geographic Society of", "The next Biennial should take place in the autumn of 2021. During that twelve-month span, the curators will engage with a number of new and previously unexamined works, including the recent exhibition “Centre-stage: Remaking Modern Art” (2019) at the National Museum of Fine Arts in Washington, DC, and “Theater of Operations: The Gulf Wars” (2019) at the Institute of Contemporary Art, Prague.The 2019 edition of the Biennial—which focused on the aftermath of the Gulf War and “the fragmentation of modernity”—was held at a venue that had previously served as a meeting place between artists and the local community. The venue had been a space for demonstrators in solidarity with the Black Lives Matter movement, and was slated to reopen in spring 2020. However, the decision to shut it down was made after the museum became embroiled in a legal battle with the government of Kuwait over the sale of thousands of items from the collection, including artworks and works on display.In February 2020, the Kuwait Museum and Library (MoML) obtained a temporary restraining order against the institution, which was granted by the High Court of Justice in the Emirate of Abu Dhabi on July 23. The court"]