["The next Biennial should take place in 2021 and will feature works that have not yet been published or shown in the exhibition.\n\n\nThe Rema Hort Mann Foundation in New York announced today that Stefan Rattner has been appointed as its new executive director and chief curator. He succeeds Laura Mulvey, who was appointed as the foundation’s executive director last year.In his new role, Rattner will work closely with the foundation and its board, which comprises three curators: Anna-Marie C. Jalabi, Matthew Cartwright, and Daniel J. Weiss. He will also serve as curator of its upcoming exhibition “Be/longing: The Art of Rema Hort Mann,” which will be staged at the museum next year. Rattner’s first exhibition in the United States, “Ratt and Laura Mulvey” (2019), was staged at the artist’s home in New York from April 24 to April 28. The show, which includes works by forty-seven artists from around the world, opened at the Whitney Museum of American Art and will run until November 5, 2019.“Stefan is a thoughtful and capable curator whose knowledge, experience, and passion for art makes him uniquely qualified for", "The next Biennial should be held in 2020.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles (MCA) has announced that it plans to dedicate an entire section of its collection to the visual arts as part of an effort to create an enduring legacy for its former campus. The section will be titled “The Center,” and will be housed in a portion of the former Arts and Culture district known as the Arts District, which is currently undergoing a $2.7 billion expansion.The announcement follows the museum’s yearlong celebration of its 150th anniversary, which will also include a redesign and construction of a new Benjamin Franklin Building, and will mark the first time that MoCA’s new home has been dedicated to the arts. The renovation and expansion, which began in 2017, was supported by a $1 billion gift from MoCA board president Jeffrey Rosen. The donation also included the construction of a new auditorium and a new gallery for the institution.“MoCA’s commitment to supporting the arts has never been more important than it is today,” said museum director Mark Gardner. “As we embark upon this new chapter in our history, we are grateful to the board of trustees and staff for", "The next Biennial should be held by June 30, 2020.\n\n\nThe National Museum of Women in the Arts (MoA) in Washington, DC, has received a gift of twenty-three works by the late artist Barbara Al-Khalili. The works, which are valued at between $10-and-$20 million, were donated by the late philanthropist and arts patron Ted Halili.Born in 1941 in Washington, DC, Halili studied at the Academy of Fine Arts in Cairo, then at the Cooper Union in Harlem, then at the Art Institute of Chicago, and finally at the Rhode Island School of Design. In 1965, Halili relocated to Paris, where he eventually found a collaborator at the Paris Museum of Fine Arts, where he became the first Muslim artist to conduct an exhibition. In 1967, he moved to Los Angeles to study at the University of Southern California.In 1978, the artist was invited to participate in the inaugural Biennale of Paris. He accepted the invitation in 1999, and the show was staged at the institution until 2002, when it moved to the Musée d’Arles in Paris. In 2011, the museum reopened in honor of the artist’s seventy-fifth birthday.\n\n\nThe National", "The next Biennial should take place in 2020, and the first exhibition in the new venue will open in the autumn. The 2019 event, titled “The Mechanism of Revolution,” featured works from twenty-eight countries and fifty-two cities.The 2020 event will draw from approximately sixty new works. The biennial’s theme will be “The Mechanism of Change.” The work will include the first exhibition dedicated to the work of the work of the work of the work of the artist Georges Seurat, a selection of photographs that were acquired through a major restoration project in 2002, and will bring together young artists from twenty-six countries and fifty-two cities. The biennial will also consist of a number of special exhibitions, including “Papa's Workshop: Design and Law in America” (May 22–May 28), and “The Mechanism of the Body” (May 29–May 31). The subject of the latter exhibition will be a landmark work, an early work on the body by the American artist Thomas M. Stephens that was presented at the Art Institute of Chicago in 1957.“It’s absolutely vital that our public think of art as a tool to create,”", "The next Biennial should be the latest iteration of the venue, which aims to present artists' works on a large scale. Among the artists selected for this edition were Thamiqada, Fatima Al Qasimi, Aneesha Narsim, and Durga Kumari.Next year will mark the five-th anniversary of the inaugural exhibition, and an exhibition of the work of the Colombian artist and curator Hélio Oiticica, entitled “Killing the Wolf: Art in the Struggle for Human Rights in Colombia” (2014–15), will open in the former government’s government residence in Madrid.The new venue will consist of two exhibition spaces, a library, and a large auditorium. The town hall will be located in the city of Maricá, in the metropolitan municipality of Cádiz, and the exhibition space will be located in the port of Maricá. The venue will be inaugurated by the upcoming 60th anniversary of the founding of the Socialist Federal Republic of Northern Cyprus, and will host a number of events including screenings of the newest biennials curated by Arab and international artists, and the official opening of the permanent collection of Spanish painter Mário Sánchez-Tá", "The next Biennial should be held in 2021.”\n\n\nArt Basel Hong Kong and its Hong Kong-based dealers were ordered to shutter by the Hong Kong government and handed a $2 billion fine for illegally withholding artworks from the fair, Artnet reports. The organizers also faced a civil suit filed by a Hong Kong collector who claimed that the extra costs of the two-week closure were prohibitive.The Art Event Centre (AEC) in Singapore issued a statement about the shutdown on Tuesday, saying that the lockdown was not related to the recent unrest in the city, nor was it related to the six-month closure imposed by the Hong Kong government. Instead, it said, the lockdown was prompted by an emergency measure taken by Singaporean authorities due to concerns for the safety of corporate executives and senior officials. “There is no emergency situation,” a statement from AEC reads. “The safety of our staff, guests, and the exhibition is of paramount importance to us and our teams. We are working hard to review the relevant safety measures and will update you as we implement them. We will continue to work with our partners and with the relevant authorities as necessary.”The non-emergency lockdown was instigated by a", "The next Biennial should be in 2021–20, the institution said. The exhibition will be hosted by the National Museum of Art in Washington, DC. The next iteration of the exhibition will be held at the National Museum of Asian Art in Taipei.\n\n\nThe Toronto–based nonprofit group Canadian Artists’ Legacy Foundation (CALF) announced on Wednesday that it is suing the City of Toronto over an overcrowded arena in support of the upcoming Canadian Pavilion exhibition, entitled “In Praise of the American Dream,” which will run from March 15 to March 18. The organization is asking for $3 million in damages and an injunction that would prevent the city from demolishing the Gardiner, the former Toronto Police headquarters, in favor of making room for the exhibition.“We are suing the city of Toronto to publicly demand a real plan to reverse the dangerous and unjustifiable increase in homelessness and overcrowding in Toronto’s city limits,” said CARF president and CEO Maxime Gallant. “We are also suing the city to make sure that the construction of the new pavilion, and the expansion of the old pavilion, will not exacerbate or exacerbate the current emergency situation in Toronto.”Gallant added that", "The next Biennial should take place at the Museum of Modern Art in New York in 2021.“We are not changing our philosophy or our approach, but rather we are expanding the art in the museum, taking advantage of the modernist craft traditions that have been dormant for thirty years,” biennial director James Cuno told the New York Times. “Our 2020 version will be ambitious and daring, in the spirit of our best-known exhibition, ‘Theus’s ‘Oddsmakers.”The biennial was founded in 1998 by artist-in-residence Lawrence Abu Hamdan as a way to engage with the history and art of the Sudan. Over the next decade, it staged more than sixty exhibitions, including a retrospective of work by twenty-six Sudanese artists and an exhibition of photographs by the late American architect Frank Gehry.\n\n\nThe building’s new permanent home will be funded by a new $3.2 billion fund set up in the wake of the pandemic to fight the AIDS and cancer diseases. After an initial campaign of more than one hundred, the fund received $2.5 billion in a bipartisan $4.3 trillion deal on August 3. The agreement is the largest", "The next Biennial should be held at that location, which is currently being restored, in 2021.  The transformation of the city, which is regarded as one of the most beautiful in the world, is part of a $5 billion plan to modernize and remake the city. The city also plans to create more than 1,500 new jobs.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has announced that it is investigating the possibility of moving some or all of its collections from its current location in downtown Los Angeles, California, to the city of Mountain View. It is also considering the possibility of opening up a new museum in the historic downtown area.The institution, which has been in a temporary location in the same building as the California Academy of Sciences (CAAS), for more than twenty years, will expedite the transition when it reopens in twenty years' time. The museum will also extend the hours of its regular daytime hours and open an additional space on the second floor of the academy, which occupies approximately 8,600 square feet of area.“As we continue to work collaboratively with our partners to find the best location for our collection in Mountain View, we are increasing the Museum’s hours and expanding the", "The next Biennial should take place in the year 2021.\n\n\nThe Danish artist Lars-Uli Larsen has been named the winner of the 2020 Nobel Prize in Literature. The previously unknown Norwegian author of several books that have recently drawn the attention of critics and activists for their controversial theoretical and political leanings was chosen by a committee of four Nobel laureates, including Norwegian cultural historian Berit Reemers, art historian Olafur Eliasson, and Swedish artist Linda-Louise Olsson.The panel was made up of Oskar Groot, curator of contemporary art at the Centre Pompidou in Paris; Kjetil Petersen, director of the National Museum of Art, Copenhagen; Berit Reemers, chair of the committee for writers; Larsen, artist and winner of the Nobel Memorial Prize; and Larsen descendants Ulrich and Olafur Eliasson.The committee also awarded the prize to Swedish author Anna-Sophie Malmstrom, who has been advocating for the Swedish government to revoke the citizenship of Larsen descendants who are in the country illegally. Malmstrom, a self-taught author who often wrote in a haiku-like style, was criticized for her outspoken criticism of Swedish Prime Minister Stefan", "The next Biennial should be held in the spring of 2021.\n\n\nThe Israeli government approved a $46 billion bailout for the country’s arts and cultural institutions on Thursday, and the United States approved a similarly large aid package, with $43.5 billion for the film and video industry, the media, and the arts. Bloomberg reports:“After the US Congress approved a $2.2 trillion package for the arts and cultural sector on Thursday, the Israeli cabinet approved a $46 billion aid package for the culture sector, which is expected to be passed by the Knesset and is expected to be enacted into law by the Israeli parliament in the coming months, on Monday, according to the Israel Arts and Heritage Foundation. The arts sector contributes a sizable portion of Israel’s gross domestic product and employs roughly 80,000 people. The Knesset approved the $1.8 billion in aid on Thursday, and the US House of Representatives voted by 309 to 201 on Friday, approving $2.2 trillion in aid for the environment and health sector.“This is a historic moment, and it is a defining moment that will help us to forge new paths and new relationships with our neighbors", "The next Biennial should be held in the year 2024. Bibi has stated that she is in discussion with the city of Bologna in Italy about the possibility of hosting the event in 2020. With the approval of the local government and the Italian parliament, the city of Bologna has also approved a long-term plan to renovate the historic Pont-Emmertango building in the city of Emmertango to become a museum dedicated to the collection of the city’s art. The plan, which was criticized by some locals who objected to the renovation project as an attempt to make the building larger and more expensive, was dropped after an outcry from the city’s cultural sector. The city of Emmertango filed a lawsuit against the city of Bologna in the Federal Administrative Court of Emmertango—the court granted the city’s request for a preliminary injunction last month. According to ABC News, the city’s complaints about the renovation had been heard by the court on December 14 and had been resolved by the time the Leonardo Biennial was set to open its inaugural exhibition in March 2020.The city of Emmertango had also asked the court to declare the building a public health hazard", "The next Biennial should focus on how to reconcile art and ‘nature’ in urban areas. The exhibition should focus on how to preserve and inspire the history of the city by examining the preservation of the city’s real cultural heritage sites, the soil and minerals of the city, andÂ the city’s current situation and the future of the city.”According to Berliner Zeitung, the installation of the Lending Tree sculptures was taken as a signal for change in the city. The pieces were created in response to the ongoing project, which has been in progress since 2008, to reroute traffic through the city. The project was launched by Alexander Lüpertz, the former head of the Kreuzberg-based Cultural Centre Bauhaus Berlin, and photographer Andrea Fiorentino, a former art-star.Under the direction of artist Markus Slohr and his team, the Berlin-based museum has constructed a large outdoor plaza in the city’s Kreuzberg district to house the permanent collection as well as the exhibition space. The plaza has also featured a number of exhibitions on Löwenhejsektür (Landscapes) and Mies van der Rohe.Art in Berlin will open on", "The next Biennial should be held at the Auditorium of Modern Art in Berlin, with a view to the upcoming exhibition “Ghost Stories” by the Bauhaus. The first edition of the new event, which will be curated by Kuna Bannister, will open on September 3. The museum has received a $10 million donation from the German state of Hesse. The funds also support the construction of new galleries and the reopening of the Biennial Bodega in Bodega, near the city of Maastricht, in 2019.\n\n\nThe French Ministry of Culture and the Musèque Nationale in Paris have agreed to jointly develop a new exhibition that will draw from the existing collection and focus on modernism and design. The show, titled Away From the Path, will be organized by the two institutions as part of a five-yearly cycle. The theme of the new exhibition will be “The Present: The Art of Eroticism” and will be curated by Gérard Depoly, the director of the Musèque Nationale in Paris. Over the course of the next five years, the two institutions will collaborate in the development of a series of exhibitions and programs that will be", "The next Biennial should take place in Mexico City from June 8 to June 13. Participants have until then to register for the event. “This is a moment of great change for Mexico City,” said Raja, who is also the president of the Institute of Anthropology at the University of the Andes in Bogotá. “We hope that the new exhibition will serve as a step on the way to greater integration, greater democracy, and greater equality.”\n\n\nThe Museum of Fine Arts (MFA) in Seattle has issued an important new curation guidance on how artists can work with and display works in a collaborative fashion. The document, “The Art of Collaboration,” was written by veteran curator and curator of modern art Mark DiGiovanni and was first published in the May/June 2018 issue of Artforum. The document focuses on the history of the art of collaboration and offers a brief overview of how to think about the relationship between art and design, and how to address the challenges associated with the art of collaboration. “The Art of Collaboration” is organized according to a three-step process. First, the artist collaborates with the museum in order to create a work that", "The next Biennial should take place at the Arne Glimcher Museum in Berlin (October 22–November 24), in the city of Württemberg, Germany. \n\n\nThe Leitner Kunsthalle in Cologne has received the fifth-largest donation in its history. The sum of $56 million will go toward the restoration and expansion of its existing collection, which is located in the area of the Stadio Allianz and the Kunsthalle Stuttgart, and has been organized by the Kunsthalle Cologne and the Fondazione Prada. According to Fondazione, the donation includes a selection of works, including works by Henri Matisse, Louise Calland, and René Magritte, as well as a large collection of modern and contemporary art. The donation also includes a new exhibition, “Modern and Contemporary Art from the Leitner Kunsthalle” (October 16–October 20), which will open at the new museum on November 1.The museum is in the middle of an extensive renovation, which is led by architect Michael Cottam, which will take place across a total of fourteen floors. The work, which will include the reconstruction of the existing exhibition space, the", "The next Biennial should aim to explore how artworks, the environments and narratives within which they are held, and how the artist’s work—both as a whole and in its many mediums—provides a window into and a framework within which to engage the contemporary world.\n\n\nThe New York City Department of Cultural Affairs (DCLA) revealed today that it received more than a hundred complaints about the exhibition “Pier 40,” a virtual reality installation that debuted at the Museum of Modern Art (MoMA) in November and was set to open next week. The criticisms centered around the staging of the installation, called “Paranormal Activity,” at a boardwalk in Atlantic City in May. The installation, which premiered at the Venice Biennale in April and was staged in New York, was canceled last month due to concerns over the virus.While the DCLA considered various complaints, the majority of the complaints were against the installation’s theme of the afterlife and the boardwalk. According to Artnet, the majority of the complaints are centered around the physical environment of the installation, with the majority of complaints coming from New Yorkers who have come to Atlantic City to view the work. In response, MoMA", "The next Biennial should be held in the coming months and will be organized as follows:   January 22–February 16, 2020 January 23–February 26, 2020 February 12–February 19, 2020 February 19–February 21, 2020 The next exhibition should be held in the coming months and will be organized as follows:   February 11–February 16, 2020  February 16–February 20, 2020 February 12–February 19, 2020 February 19–February 21, 2020 The next exhibition should be held in the coming months and will be organized as follows:   March 8–March 11, 2020 March 6–March 9, 2020 March 12–March 14, 2020  March 13–March 16, 2020 March 15–March 17, 2020 March 13–March 19, 2020 March 15–March 18, 2020 March 14–March 19, 2020 March 15–March 21, 2020 March 15–March 21, 2020 March 16–March 22, 2020 March 16–March 21, 2020 March 13–March 27, 2020 March 14–March 18, 2020 March 13–March 28, 2020 March 13–March 28, 2020 March 14–", "The next Biennial should focus on the history of the exhibition, its development, including the range of work that is currently exhibited, and its future plans. The 2019 theme “Between the World and Me: Art and Memory” will be announced in 2021.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has appointed Laura Hoenig as its next director, effective immediately. The appointment was made on October 29. She succeeds Marc Straus, who retired on October 14 after a fifteen-year tenure.“Laura has demonstrated an innate ability to bring to light the work of underrecognized and underrepresented artists and thinkers across the globe, and her expertise and passion for art will continue to be central to our museum’s mission,” said Michael Govan, the institution’s director. “Her approach combines a deep commitment to art research and an understanding of the complexities and challenges of managing a large-scale institution.”Hoenig comes to the institution from the Museum of Contemporary Art (LACMA), where she served as director for the last four years. She was previously the deputy director of curatorial affairs, curator of twentieth-century art, and curator of contemporary art. During her tenure,", "The next Biennial should move to the capital, Helsinki, in the spring of 2022.\n\n\nThe Philadelphia Museum of Art (PMA) is launching a national tribute to the late artist and philanthropist Nikola Tesla in 2022, the institution announced on Thursday. The event, which will take place at the museum in April, will serve as a springboard for the public to reflect on the legacy of the late inventor and historic contributor to the field of electric vehicles, known as EV. The exhibition will feature works by forty-one artists, including Beholda Harlan, John Harrison, Ira Jacobs, Jean-Michel Basquiat, Alan Brown, Marian Goodman, Tanya Gerber, and John Lee Hooker, as well as three of the pioneers of biennial design, the sculptor Thomas Heatherwick and the architect Richard Avedon. The exhibition will focus on the legacy of the late American architect, inventor, and philanthropist Frank Lloyd Wright, whose work provides inspiration for the PMA’s exhibition.“Frank Lloyd Wright was an American architect and philanthropist who reshaped the course of Architecture and Design for the twentieth century. His legacy affirms our mission to present the work of American artists in an accessible, accessible way", "The next Biennial should explore the interconnections of memory, memory, and art, and should consider how memory and art are intersecting and interweaving with one another.”The winning entries will be presented in a biennial exhibition that will also include the work of a selection of the show’s predecessors, which were staged at the site of the museum. The inaugural exhibition, “L.A. Art: The Last Tycoon,” will run from March 14 to March 16. The exhibition will also feature a “memorial,” and the exhibition “theoretically,” in an attempt to reflect on the history of art in the United States.The 2020 biennial will include work by seventy-four artists, including Walter de Maria, Tunga Faisal, Michael Jordan, and Carlos, and will be held at the Arts and Humanities Research Center (AHRC), a nonprofit arts institute in Southern California, from March 14 to March 17. The 2020 edition will be organized as a “forum for thought and reflection.” The 2019 version of the show, which utilized a special exhibition space in the museum, took place in the museum’s Pershing Square, and was the", "The next Biennial should be held up as a model for how a new art space should operate. It should instill confidence in Montreal’s curators who have been systematically dismantling the Biennial’s brand.“What is necessary now is a change of direction,” said Alexandre Bisson, the executive director of the Institute of Contemporary Art in Paris. He added that the event should focus on themes of identity, migration, and the collaborative nature of art. Earlier this week, the French art writer Alain Guiraudy wrote a scathing dissent in the Art Newspaper over the exhibition “Theater of Operations: The Gulf Wars 1991–2011”\u0097a show organized by the French artist Martine Aubry and the German curator Hans-Ulrich Graf for the sixth edition of the Biennial d’Art Contemporain in Paris. In the piece, Guiraudy argued that the exhibition wasn’t “a critique,” but rather an “opportunity to abandon all the above,” and to “be the first to go.”Aubry defended the show, which she described as “fragmented” and “comp", "The next Biennial should have been held in 2018, but was postponed due to the Covid-19 pandemic. The 2019 event will be held at the Metropolitan Museum of Art, and the 2020 event will take place at the Library for the Arts, and the 2021 event will take place at the Wythe Museum of Art, and the 2022 event will take place at the Brooklyn Museum.Admission to the new museum is free, with the exception of the first-year arts program, which will cost $30,000. The museum will be inaugurated in 2022 with a free evening of lectures and public performances. The museum will be inaugurated in 2023 with a free evening of lectures and public performances. The museum is also committed to supporting the local arts and community by increasing the exhibition and rental of works by artists and transforming the artistic and cultural environment.The 2019 edition, “The Roots of Our Voices: Essays from the Biennial” (2018), featured contributions by artists such as Jenny Holzer, Daniel Johnston, and Paul Graham, and was curated by Kenichi Hoshine.The 2019 edition will be the last held at the Met, and will be replaced by a revitalized and expanded edition, “The Future of the Met", "The next Biennial should be held in 2022, but it is unclear when the event, which will take place in the Warehouse District, will actually begin. In the meantime, the museum will continue to host regular programming, including free admission days each week for children 12 and under, as well as a variety of special exhibitions, such as the first retrospective dedicated to Rembrandt.In a subsequent statement, the museum said: “We have been working hard to make sure that the opening of the exhibition will not compromise the show, nor will it have to make any changes in order to continue its exhibition program. It will be a remarkable exhibition and we are looking forward to presenting it next year.”\n\n\nThe Smithsonian’s National Museum of African Art (MMAA) in Washington, DC, has received a $10,000 donation from the private collection of the late collector and philanthropist Woods-Manning. Founded in 1957 by the late industrialist J. Paul Getty, the museum has faced numerous challenges since its founding, including a $25 million expansion project and a lawsuit by the estate of the late senator Edward Kennedy (D-MA). Since the museum’s current exhibition venue—a former army barracks in downtown Washington, DC—", "The next Biennial should be held in 2020, and the tenures of the architects who are making the presentation should be renewed for the 2021 edition. “The entire project has been very much about creating the exhibition to show that architecture is not only a universal language and a way of life, but a way of life, too,” central to the project and its exhibit, a \"wonderland of contemporary art.\" The upcoming exhibition will feature work by seventy-three artists, including Dominique de Menil, Osei, Daniel H. Wilson, Mark Halperin, and Stéphane Le Tribe, and will be open to the public from March 20 to March 22. “The exhibition is not just a way of life, but a way of life that is universal,” said Kota. “This is a way of life that is timeless, that is eternal, and that is in the DNA of the project.”The next two sections of the biennial will be devoted to the storage of artworks and to the collection of information related to the exhibition. The exhibition “Will Work: Art and the New Socialist State” (March 21–March 26) will be organized as a “", "The next Biennial should take place at the Royal Institute of British Architects (RIBA), London, in 2021. The museum is currently planning to build a new institution, the Biennial Museum, in a former coalmine in the heart of London.\n\n\nThe forty-fifth edition of the Cannes Film Festival—the largest and most prestigious film festival in the world—has announced that the event will move to a new venue in downtown Cannes, France, in early 2020. The announcement coincides with a wave of criticism directed at the Cannes Media City, which has been under construction since 2016, and the exhibition was supposed to take place in the seaside city.“Cannes Film Festival is a little more than a year behind schedule and behind schedule in terms of planning, programming, and execution,” a statement from the festival said. “We have been working hard to get to the finish line, but this has proved difficult given the many expansions and renovation plans that have taken place since the city’s reopening in March 2017. We have now reached the point where we believe we must move forward.”Advertisement - Continue Reading Below\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of twenty-eight works", "The next Biennial should be held in 2020 and will be hosted by the Museum of Fine Arts, Boston, and will be hosted at a location not far from the Museum of Fine Arts. The biennial, which will be devoted to the art of the American South, will be organized as a series of exhibitions that is organized around a theme—as demonstrated by the museum’s construction of the Biennial Partnership, which will include thirty-two artists in collaboration with thirty-eight local institutions. The theme will be “Southern Comfort: art of America” and will bring together artists from thirty-seven Southern states in the US—Georgia, Louisiana, Mississippi, North Carolina, South Carolina, Tennessee, and Texas—as well as from fifty-eight other countries. Next year’s event will feature work by forty-six artists in collaboration with thirty-ten local institutions. Among those selected for the 2020 biennial are Betsey Winslow, Andrea Humphries, Paul Lindsay, John Salter, Alex Toth, Michael Olszewski, and J. Allen Stantz. “I’ve been a fan of the Biennial Partnership since I first met and worked with the artist community of Birmingham,” said Anton", "The next Biennial should be held simultaneously in New York and Geneva. The 2020 edition will be held at Rockefeller Center, New York from March 21 to March 23. The biennial will also feature the artist-in-residence exhibition, which will feature works by more than 30 artists.\n\n\nThe Raft Museum in Boston has hired Charles A. Cohen as its new executive director. Cohen comes to the institution from the University of California, Berkeley, where he has served as a curator and writer since 2009. Previously, he served as director of the Center for the Study of the Imagination (CSAIG), which includes a residency program that houses sixty artists.Cohen comes to the institution from the University of California, Berkeley, where he has served as a curator and writer for the last decade. Over that time, he has written for publications such as Artforum, Artforum: Art of the Spectacle, and Artforum: New York; published two books, The Art of Reality and The Art of Embeddedness; and edited books such as Raft: A Contemporary Art History (Raft Digital, 2015) and Living in the Art of the City (Raft Books, 2007).Among the artists whose works the institution will display this", "The next Biennial should be held at the Brooklyn Museum in New York in the spring of 2021.  The 2019 edition, titled “Telling Stories,” drew 483,000 visitors. It was the largest‐scale exhibition devoted entirely to contemporary art in the United States.Commenting on the new partnership, the museum’s director, Daniel H. Weiss, said: “In the two decades since our last exhibition at the Brooklyn Museum, we have grown and matured as an institution, and as a technology platform. We have adopted new methods to reach audiences in new ways, and we are in the process of rethinking and modernizing a number of key aspects of our exhibitions and programs, including the visual arts. We are eager to work with the new partners at the Brooklyn Museum to further develop and expand the exhibition program in a way that enhances the museum’s future vision.”\n\n\nThe National Gallery in London announced today that it is planning to close permanently the galleries just outside the institution’s permanent collection to make way for an ambitious new development, “dramatic change,” of the entire National Museum. The museum will move to a new, four-story building designed by the international firm G", "The next Biennial should be held in 2020 and will host tours of the site, which is currently being restored along with the original building. On the opening of the new exhibition, Cajexas’s director Andrew Wiles said: “The Biennial is an extraordinary museum, a living institution, reflecting the spirit of the region and the city of Cajexas. It will be a great celebration of our history. . . . We believe that the best way forward is to have a biennial which is inclusive of both visitors and the local community, which we believe will demonstrate that Cajexas remains an important cultural and historical site in Mexico.”\n\n\nThe Shoreditch Arts and Culture Hub, a new cultural hub and arts complex designed by architect and urban designer Peter Shoreditch, has received funding from the Rockefeller Brothers Fund. Based in New York, the fund will distribute $150,000 toward the $661,000 in capital expenditures associated with the project, which aims to provide access to a larger audience and greater opportunities for creative exchange.“The Shoreditch Arts and Culture Hub is a transformative public cultural destination that will make an important contribution to the revitalization of the Shoreditch district and its surrounding", "The next Biennial should take place in the autumn of 2021, with a design by artist and architect PT Christensen. In June 2018, the museum’s staff held a final exhibition of work by the artist, including his bronze sculpture, Talia Al-Anani’s Twenty-Thousand Years of Human History, which will go on display in the show “Future Life: The Art of Paul Graham,” which will be on view in the museum at least until March 22, 2020. That show will invite the public to experience the work in a virtual format as well as the exhibition of photographs by Graham with a special emphasis on his work in the early ’50s.\n\n\nIn March 2019, the New York City Department of Cultural Affairs (DCLA) issued an official public apology for the city’s selection of a controversial American painter, Gertrude Vanderbilt, as the next chair of the Metropolitan Museum of Art (MoMA) in the Bronx. “The board of trustees of the Met made the decision to include Adrienne Barozzi in the selection process because of her ability to bring a new and compelling vision to the museum,” said director Daniel H. Weiss. “Her", "The next Biennial should focus on gathering additional readings, collaborating with other research groups and museums, and presenting new scholarship. Shirley was asked to lead the next iteration of the event by the public, and she agreed with the decision. “I think we've done a really good job of expanding the scope of what makes an exhibition great,” she said. “I think the next year will be a real reflection of that ambition to create something new, and I am incredibly excited by the prospect of working with you.”\n\n\nThe New York City Department of Cultural Affairs (CADA) has released guidelines for the exhibition “The Body (2018),” a partnership between the City Museum and the Metropolitan Museum of Art, which aims to raise awareness and understanding about diversity and health. The exhibition, which will focus on the history of human body image, is being curated by the artists Yoko Ono, Grant Delahanty, and Evelyn Becker. The exhibition will include works by artists such as Q-Tip, Maria Martins, and Monica Bellucci.“Body (2018) is a work of life,” said Adam D. Weinberg, director of the MET. “We are", "The next Biennial should aim to elaborate the notion of the 'self' as a 'multi-dimensional being'\u0097that is, as a living and dynamic entity that may change and develop in time\u0097and should include a critical reflection on the history of art and how it has been conceptualized, embodied, and conceptualized in the contemporary historiography.”In a letter addressed to Beijing-born artist Chen Yifei, the biennial’s artistic director, Wang Wei, said: “The next Biennial will be a reflection of the creative and intellectual spirit of China, a reflection of the cultural and cultural exchange between China and the rest of the world.”\n\n\nThe J. Paul Getty Trust in Los Angeles announced today that Maureen Evans has been appointed as its new president and CEO. Evans will assume her responsibilities on August 1. She succeeds Delores Hujar, who has served as deputy director of the trust since March 2019.“After spending more than two decades as custodian of the trust, Maureen brings an exciting perspective, a proven track record of leadership and the ability to bring creative and institutional partners together,” said Delores Hujar. “We look forward to", "The next Biennial should be held in 2020.\n\n\nThe National Museum of Fine Arts in Washington, DC, has received a gift of eighty paintings from the private collection of the late collector and philanthropist Al Smith, who, in addition to his art career, also organized many exhibition programs, including the first-ever National Foundation for the Arts (NFA). The gifts were made by NFA president and CEO John S. and James L. Stuart, and his son, James L. Stuart (J.L. Stuart), and the late collector and art historian Armand G. A. Smith.“Al Smith was an extraordinary collector and a tireless champion of art,” said George C. Marshall, chair of the National Museum of Fine Arts. “He put art on the front pages of newspapers, and he collected great art. He will be greatly missed.”The museum also revealed that it made several key acquisitions in the past decade that will help it expand its collection beyond contemporary art. The organization recently unveiled its first building expansion in the central city, which will add two new galleries, a museum, and an auditorium. It also plans to renovate the existing space and add more galleries, restaurants, and bar spaces. In", "The next Biennial should be more accessible to the public and less about the curator role.”\n\n\nThe Crystal Bridges Museum of Art in New Orleans has received a gift of twenty-four works by nineteenth-century American painter Mary Cassatt. The institution is currently working to date the donation, which was made in 2017 and was added to its collection in 2020. Tate director Maria Balshaw said:“As we continue to explore the legacy of Mary Cassatt, it is with great excitement that we are able to present this remarkable collection to the public. The work of Mary Cassatt’s artists and collectors are inextricably linked to the passionate, multifaceted, and bold feminist politics of the American South. I am deeply grateful to Tate and the many artists who have come before her, to the activists who inspired her to paint, and to the wider world for believing in the vision of an artist who was known for her radical and immediate, masculine-feminine vision of art and artmaking as a woman.”The works, which are housed in the museum’s Heritage Room, are curated by artist Naomi Campbell. The main hall of the museum, which celebrates Cassatt’s 200th birthday this month", "The next Biennial should be rescheduled for December 2020. \n\n\nThe Museums Association (MA), a UK-based advocacy organization that represents more than 1,600 museums, has released a statement condemning the decision by the Royal Shakespeare Company (RSC) to pull its production of Macbeth, which opens this weekend, from the stage in London. The company explained that it was considering whether to continue with the production, which follows the life and death of Macbeth author Macbeth, at the Tudor Revival site of Whitechapel Gallery in Stratford-on-Avon, England.According to a statement by the group, the decision is an \"egregious breach\" of the Royal Shakespeare Company’s agreement with the government, which commits the corporation to staging an original work by the author in the first instance.The statement continued: “We condemn this outrageous decision by the RSC, which disregards our long-standing commitment to Macbeth by refusing to consider whether continuing with the production is in the public interest. We believe the best way forward for the RSC is for it to end its association with the Shakespeare Company and to focus on continuing to present the work of its own artist. We hope the", "The next Biennial should take place at least four months after the 1964 event, in early May. “I cannot think of a better time for us to begin,” Dr. John Oliver, director of the artist’s residency program and the Phoenix Art Museum, said in a statement. “It will, in no uncertain terms, be a transformative moment for Phoenix and the arts. It will also be a time for us to reflect on the past, on the city, on our place in the world, and on the future of this city, its people, and the arts.”The museum, which opened in 1976, was founded by philanthropists Charles and David Kastner in a three-story, brick-and-steel building a few hundred feet north of downtown on a former industrial site in 1989. Steven Spielberg, the director of Spielberg’s 1967 classic In the Mouth of Madness, was invited to direct a biennial of contemporary art in the city. The program was founded on a foundation centered on the idea that the noncollecting art museum, which presents museum-quality art at affordable prices, could also serve as a model for the political, social, and economic evolution of a city.A pilot program was", "The next Biennial should also include an exhibition of work by a group of artists in the United States who are working from the memories of those they have lost--the recent exhibition “Lost Voices: Transformations of Memory,” 2016, at the Center for Contemporary Art, Los Angeles, will focus on how memory can be used to create new works and reinterpret the past through installations and performances.Hosoka Shinozuka, the curator of the 2020 biennial, said: “With the Biennial 2020, we are establishing a new dimension for the exhibition, which also aims to create a space for the exhibition to remain open beyond 2020, whilst reflecting the spirit of the exhibition. . . . If we continue to present works in this way, we will be able to continue to present the works of our artists, who are still working today, but will have a longer and more stable career.”In a statement, the Biennial said: “We are delighted to continue our work in this area, and to take more risks with our future exhibitions, exhibitions programs, and collaborations with our artists. And to continue to display their work in the exhibition. Each year, we invite artists to the exhibition to present new works, and also", "The next Biennial should be held in 2021, and the current edition will be held in 2021. The biennial will feature a selection of more than two hundred works by thirty-six artists, and is being organized by the Museo de Arte Contemporáneo in Madrid. \n\n\nThe Chateau Marmont in Paris is preparing to reopen following a $110 million renovation, following a $105 million expansion, with a major exhibition dedicated to the French-born architect Harald Szeemann, whose sculptural and institutional legacy encompasses the construction of the Allein family’s Grand-Duc-le-Fleuriel and the architectural and cultural highlights of the city. The twenty-fifth edition of the exhibition “Mariner Laursen: Architectural Legacy” will open on March 21, 2022 and will be guided by the first-timer Szeemann’s apprentice, Michel Temkin, who is currently working on the renovation of the structure. The works will then be transported to the Museum of Modern Art in New York.The Marmont’s new interior design includes a reimagined lobby and auditorium, a glass-enclosed courtyard, the Grand-Duc-le-Fle", "The next Biennial should take place in 2020 and is expected to be held in the city of Cologne. It will also include a lecture series and a public gathering space designed by the architect Kiyomi Hasumi.\n\n\nThe Art Newspaper in New York has released the list of twenty-six artists who will participate in Art Basel Hong Kong, which will run from March 16 to March 21. Titled “Art of the Future” and curated by artist and curator Yoona Park, the exhibition will also feature new works by artists such as Taji Gomes, who created a new work for the exhibition titled “You and I Know Not What I’ve Got” and will focus on issues of identity and memory.The twenty-fourth edition of the San Francisco art biennial, originally scheduled for February 2020, has been pushed back to March 21, and the twenty-fifth edition, originally scheduled for March 22, is slated to open on March 27. The exhibition will also feature a photo essay by artist Marina Abramović, an intergenerational performance by the Korean artist Park Eung-kyung, and a new painting by artist Andreas Phijssen. The twenty-sixth edition of the Seimatsu/", "The next Biennial should take place in 2021. The 15th will be held at the Grand Opera House in London in 2022.\n\n\nThe Seattle Art Museum (SAM) is revamping its collection of nineteenth-century American masterworks in an attempt to better reflect the city’s cultural landscape. The changes will introduce new exhibitions, screenings, and projects, including a documentary on the life and work of Walter de Maria.The redesign, unveiled last month, aims to bring the institution’s holdings more in line with the region’s cultural traditions, according to director Martha Catlin. “I think it’s really important for us to be able to see the past, to see how the atmosphere of the city has changed, and how we could be reflecting that with a contemporary exhibition,” she said. Catlin explained that the institution is focusing on two themes in the redesign, the design of the building on the east side of the museum, and the view of the former Cascade Home for Women, the home of the Northwest Women’s Christian Association, in the grounds. The changes will also address the institution’s relationship to the surrounding neighborhood, with the goal of making the building more welcoming.Commenting", "The next Biennial should be ready by the end of March, and the exhibition should open in March 2020.\n\n\nNew York’s Metropolitan Museum of Art (MoMA) has received a $1 million donation from the ultra-wealthy collector and philanthropist Lacy Chesley. The gift will support the twenty-fifth anniversary of the Metropolitan Museum of Art’s Metropolitan Museum of Art Foundation (MMFA), which was established in 1957 to preserve the works of Edward Hopper and to promote the art of the late American artist Michael Haneke.“Chesley is a pioneer in the field of contemporary art, having established the museum as the first major center for the collection and presentation of the works of Michael Haneke, whose exhibitions included “The American Dream” (1963) and “The Battle of the Sexes” (1964) at the Museum of Modern Art and the Whitney Museum of American Art, respectively,” said museum director John Lindsay. “Having spent more than forty years developing this program, I’m delighted that Lacy has agreed to donate his personal funds to this year’s Met.”Haneke’s work, which depicts the artist’s", "The next Biennial should take place in 2021. Although the biennial will be a retrospective, it will focus on the themes of the exhibition and be divided into four parts: (1) The Making of The Human Centipede, (2) The Life and Death of John Cage, (3) The Art of Life and Death of Walter de Maria, and (4) The Art of Life and Death of Peter Paul Rubens.The first part of the biennial will be a retrospective of the work of Michelangelo Antonioni, (1949–2000), which will be presented as a four-hour exhibition that will take place in the first floor of the lobby of the Museum of Modern Art in New York on August 30–August 31. The second part of the biennial will be a collaborative effort between filmmakers and architects, with the planned installation of The Elephant, 2006, and an architecturally themed sculpture by Helen Cammock, the first living recipient of the Maurice Berger Award, on September 4. The third part of the biennial will be a program of interviews with artists, activists, and scholars, including Charles Taylor, Susana de Córdova, Jovanka de Barbaglini, and", "The next Biennial should be held in 2021. The coming edition will be organized in conjunction with the twenty-fifth edition of the Berlin Biennale. The event will include a special exhibition of work by artists belonging to the European Commission.\n\n\nJust days after four women’s suicide bombings killed dozens and injured hundreds in the Russian city of Saint Petersburg, Russia’s Federal Anti-Terrorism Committee (BKA) declared that the country’s storied theatre calendar had been a “catastrophe.” The BKA cites the destruction of the city’s Botanical Gardens, the Palazzo di Scala, and the Saint Petersburg Opera House as a terrorist attack.The BKA also cited the “unprecedented threat of terrorism,” as well as the coronavirus pandemic, as its reason for suspending the calendar. The deadline for the calendar is October 29, and the BKA says that it expects theatres to remain closed for another seven weeks.The BKA has yet to declare a state of emergency. According to the New York Times, the terrorist threat has reached a breaking point. According to the New York Times, the US has confirmed 232 deaths from the virus, which is spread mainly", "The next Biennial should be announced this fall. Koons will remain involved with the exhibition for the next two years.\n\n\nThe Center for Art, Research, and the Environment (CARE) in New York has appointed Kaytke Auke as its new deputy director. She will take up the post in January 2021.“Kaytke’s appointment is a perfect match for the Center’s mission to foster the development of research, education, and conservation in the field of art and design,” said center director Adam D. Weinberg. “We are grateful to Kaytke for her leadership and career-long commitment to CARE and our mission. She is a leader, and has been since 2011, in the field of design.”Previously, she served as the director of the Graduate Center in Italy, where she led a major exhibition in the form of the “Moralist” series. She also previously served as the director of Mendes’s studio in the 1980s and as the director of the Kunsthalle Basel in the 1990s.“The Center for Art, Research and the Environment also has an important legacy to build, having donated thousands of works by artists to CAR", "The next Biennial should be in 2022, with an opening in 2024. \n\n\nAs Europe struggles to contain its coronavirus, the number of new cases in the country has slowed and the death toll has dropped to 11,813. However, the number of people infected with the virus in the United Kingdom has risen to the equivalent of four times the total number of cases in France and four times the number of cases in Germany.The number of people infected in England has increased, but not nearly as much as in France and Germany. In England, there have been three times as many cases as in the country as a whole. On Thursday, the BBC reported that an estimated 54,000 people were infected, with another twenty-seven thousand having recently come into contact with the virus.The cases are concentrated in the West Midlands, where at least seventeen people died from the coronavirus and another fifty-eight people are in a critical condition last week. On Friday, the British Medical Association (BMA) warned that the coronavirus could spread to other parts of the country as the outbreak in the UK worsens. If it does, the number of people infected in the UK would likely spike again.The coronavirus outbreak was sparked when an outbreak", "The next Biennial should focus on creating new public spaces, gathering artists and curators together on a similar scale, and connecting audiences with artworks and the experiences of others, which are the core values of the event, Mr. V.\n\nAnnual meetings of the board of trustees will take place in the week of the third Saturday of the month at the San Antonio Museum of Art.  The inaugural edition, which was held in the museum from October 26–October 28, 2018, featured work by twenty-eight curators, including Phyllis A. Pérez, Stephanie Barron, and Vanessa Anderson, as well as artists such as Julie Dash, Nari Ward, and Cheryl Strayed. \n\n\nThe Philip Johnson Foundation, a New York–based organization that provides financial support to artists and their families through the acquisition of their works, has announced that it is giving $1 million to fifty-six artists and their families in the form of grants. The foundation has received a grant of $1.5 million for the 2019–20 cycle. “Philip Johnson is one of the most generous philanthropists in America,” said James Cuno, president of the foundation and director of the Judith and James Lipson Center", "The next Biennial should take place sometime between September and December 2021. The exhibition will be hosted by the National Museum of Contemporary Art (NMA) in Washington, DC, and will be led by artist-in-residence Max Beckmann. The exhibition will feature work by twenty-three artists, including Anish Kapoor, Alex Katz, and Anuradha Agrawal.\n\n\nThe Zheleznaya Museum of Jewish Art in Moscow, which was founded by a group of principal dealers in the city, has announced that it is planning to cease operations as an institution in March 2021. In a statement delivered by the museum, the founders said that the decision to cease operations was made in order to “dismantle the structures of the museum and its collections, which are currently being dismantled by the state.”The building, located at 433 N. V. Hernovoi Street, was constructed in 1941 and opened to the public in 1948. Since its inception, the museum has hosted more than 1,500 exhibitions, including “Theatrum Herzog,” “The Fad,” “Leo and Samos,” and “The Artist as Architect,” and has staged", "The next Biennial should have no more than three hundred participants with the exception of some of the largest and most important museums. We should therefore focus our attention on the projects which are most meaningful for local communities and should not introduce new measures, nor should we try to fully assimilate the cultural traditions of the country into our own.”The abolitionist movement of the 1960s and ’70s was reinvigorated by the renovation of Tate Britain, the UK’s largest art museum, in 1988, when the museum reopened to the public. The museum also became the first institution in the UK to hold its annual Freedom of Expression Day in December, in solidarity with the March on for Democracy.The March for Democracy, which first took place in London in January 2019, was supported by more than 1,500 arts and cultural organizations, including the National Union of Journalists, the Association of Photographers, and the Association of Cinecators. \n\nThe Museum of Contemporary Art (MoCA) in Los Angeles announced today that it is planning to move the forty-ninth edition of the Gold Derby, which was scheduled for August 21–October 13, 2020, to October 29–December 21, 2020. The exhibition will now be held at", "The next Biennial should be held in the spring of 2021. “Our mission is to organize, present, and present our collection of contemporary art in an open, accessible, and surprising way, with a view to drawing attention to the art of the future,” said curator Alexander Lüders. “This year’s exhibition will reflect this intention. Based on a long-term project of the Berlin Biennale that started in 2016, the exhibition will be a mix of new and established artists, curated by an experienced curator and assembled by a talented and devoted team. The theme of the exhibition will be ‘art for art’\u0097to use the term more broadly.” The exhibition will be staged at various points of the Berlin Art Biennale’s five-year, nine-month, and twelve-month cycle. “The exhibition is a response to the current situation,” said Lüders. “Making new work is a part of the process of producing art, but it is not the essential point. I aim to present new work in an open way, as if it were a process, a way of understanding art.” While the exhibition will", "The next Biennial should take place at the The Strand in London and will include twenty-eight artists and collectives, including Yuki Yamamoto, David Hockney, and David Karp, in commemoration of the biennial’s fifty-fifth anniversary. The show will run from December 2 to December 9, 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Rebeca Pindell as its next chief curator. She succeeds Meg D. Gordon, who retired after twenty-six years at the helm of the institution last November.“The museum has been and will remain an important platform for the collection and exhibition of work by and to significant audiences across the country,” Pindell said in a statement. “I’m eager to continue to innovate and to support the museum’s diverse audiences and practitioners, while continuing to build on the foundation of my predecessors.”Gordon, who served as director of the museum since 2011, was succeeded by MFA’s current director, John Guggenheim. As director of the Museum of Modern Art (MoMA), he launched a $50 million initiative to upgrade its photography and design and oversaw a series of exhibitions,", "The next Biennial should be on \"overcoming historical memory\" and his comments about the exhibition should be taken as a call to reconsider the maintenance of institutional memory of the Shoah. If the biennial is to continue on as planned, the archives should be reopened for a public exhibition of works by artists who have chosen to remain anonymous.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of eighty-one works from the Harvard Collection in the form of twenty-six rare works by John Adams, who is best known for his sculptures—some of which are nearly five thousand years old—and for creating a “memorial of the two worlds” (Kohn, 1984). The work is currently on display in the museum’s collection galleries.“In the early years of the museum, we had a very specific collection of Adams’s works, which were in the collections of many great collectors,” a curator involved in the exhibition told the Boston Globe. “It was a real hybrid of contemporary and classic, with a lot of standard types. . . . We now have a gift of eighty-one of those works, and we are excited to present them to the public. They belong", "The next Biennial should be released sometime in the second half of 2021. The Los Angeles–based filmmaker, writer, and educator shot his first documentary, The Portrait of a Young Lady (2013), at the Academy of Motion Pictures. He also founded the documentary-film-maker-cum-symposium Los Angeles Biennial (LLAB) in 2018 to expand its reach and to help it meet the city’s needs, and he developed the documentary film-by-the-s-library-to-film the show.“I’ve always been a believer in what Artforum called its Gold Rush,” Takeda said in a statement. “It was my dream to work with filmmakers to explore the ideas and projects that had been lost in the film-making process, and to try to make a documentary about these lost projects. The Biennial is a big step in that process.”The Biennial’s project team also announced its introduction of the new digital platform ラブビイング, which will enable people to share their biennial experiences and will integrate biennial programming with other platforms, including the Smithsonian American Art Museum. The platform will be free to the public and will be", "The next Biennial should be held in 2022.  This year’s event will, as usual, be hosted at New York’s Museum of Modern Art, and will include performances by contemporary artists, documentaries about contemporary issues, a variety of exhibitions, a musical performance by the New York Philharmonic, and a book signing by the artist-in-residence, Tora Fitzgerald. The 2019 edition of the exhibition, “The Body Rules the Soul,” received a retrospective at the New Museum in New York last month.\n\n\nThe Museum of Modern Art (MoMA) in New York is taking a new approach to its annual September fundraising gala, launching a new online fundraising platform called the MALT.Museum.com. The platform will launch with a free trial period and will charge museum members as little as $10 per month to use the service. The program will also include additional events, including a special event at MoMA on October 17.“We are so excited by the opportunity to further build upon the successes of the past years with the 2018/2019 season,” said Michael Govan, director of the artist-in-residence program at the institution. “The MALT.M", "The next Biennial should begin in 2021 and will focus on the artist’s contribution to the art of the Americas. The theme “Lítica Acapulco” will be drawn from the town of Acapulco, Mexico, and will be inspired by the artist’s line Mestiza, which is often used as a representation of the memory of the city of Acapulco, Mexico.“The world is eager to experience the essence of Mexico’s beauty and to leave its mark,” said Creative Admirer artist and curator Teresa Ibarra. “The upcoming event will strive to expose the beauty and warmth of Mexico, as well as to consider the role of art and architecture as essential elements of a harmonious and inclusive future.”The 2017 edition of the Biennial, which was staged in Mexico City at the Grand National Palace in the city of Mexico City, marked the ongoing work of artist and developer Pedro Armendariz, who created the sixth instalment of the project, “El Buen árboles,” which opened at the Palaise de Tokyo in Paris in July 2018. The exhibition was curated by Andrea Bruguera, the", "The next Biennial should take place at the San Francisco Museum of Modern Art (SFMoMA) in 2021. The Chicago Biennial will be held at the University of Chicago’s Kendall Gallery in 2021.The thirty-second edition of the San Francisco Sketchfest will take place at the Oakland Museum of California (OMCA) in 2020.\n\n\nThe Chilean artist Maria de Armas, whose body of work evoked sculptural form and the rhythms of the night, has died at age ninety-three. For two decades, the artist has been a fixture at the Los Angeles County Museum of Art (LACMA), where she delighted in portraying the spirits of California, the sky, and the sea.In her work, which ranges from the fantastical to the mundane, de Armas conjures images of her own body, which she often reclines upon in her studio, or of a woman in a nude, skin-tight gown. Their combinations evoke a romanticism that is both sensual and spiritual, a kind of shamanism.De Armas’s paintings often include transfigurations such as in her “Luccia,” 1967, which plays with the idea of light and shadows. The work is about a man", "The next Biennial should be held in 2020, when the exhibition will be running alongside that of the French art historian Georges Apostu. While Francis has pledged to prioritize the preservation of art in its collections and institutions, the UK museum has indicated that it is open to the concept of future exhibitions featuring works from the Biennials, and will partner with other institutions to launch such a project. \n\n\nThe Ministry of Culture in Japan announced on Monday that it will begin a campaign to raise ¥50,000 ($6,000) for the construction of a new county museum in the capital city of Nagoya, where it intends to expand the collection of the city’s art and culture. The campaign will target everyone from the lowest echelons of the art and culture industry, who will receive a ¥100,000 ($155,000) contribution as well as an invitation to the new museum.The project is part of the government’s four-year, $42 billion 'Vision 2020,' which aims to draw attention to the challenges and opportunities facing Japan, and will initially involve the design of a new building, designed by Kiyosha, and the restoration of some of the city’s most important historic sites. More than one-", "The next Biennial should be held sometime in the 2020s.\n\n\nAlexandre de Tochentl, a French artist, architect, and educator, has been named the winner of the twenty-fifth edition of the Biennale d'Art Contemporain (BAT), which will take place in St. Petersburg from March 4 to March 6, 2020. De Tochentl, the first African artist to win the prize, was presented with the award for excellence in architecture and design at the eighty-second Paris International Art Week. While the other finalists consisted of Jules-Winnebago, Michel-Olivier Besnard, Antoine Caussé, Noel Chiu, André Cernay, and Michel-Yves Klein, de Tochentl and the three other finalists—Abraham Karsen, Mpagi Sepuya, and Wolfgang Guttmann—were selected by a jury comprising the artist, architect and producer Barthelemy Bouwmeester, the French curator Gilles Braudel, and the journalist Edith Bouvier.Born in Paris in 1969, de Tochentl is a French–born, French–based artist who studies both African and European traditions. He is", "The next Biennial should be held in the autumn of 2022. If all goes according to plan, it will open in the spring of 2021.The museum is also working on a series of exhibitions that will be staged at different times throughout the year. According to the New York Times, the first phase of the project, titled 'Anticipating Tomorrow,” will open in September, followed by a second phase, “Reclaiming Tomorrow,” in December. The third phase, “Believing Tomorrow,” will open in March of 2021.The project is funded by a $5 million gift from the Agner family, who have been active in philanthropy for decades and include businessman and philanthropist Richard Agner; Victor Agner, the chairman and chairman of the United States; and the German philosopher Max Hetzler. The centerpiece of the project, a ten-acre campus in the city of Adler, in the province of Bonn, is being renovated by German firm Düsseldorf-based firm Adler + Künstler. The firm plans to turn the campus into a research center for future conceptual studies and exhibitions about the history of art.Inaugurating the campus are new sculptural", "The next Biennial should also be an exhibition dedicated to the life and work of the artist, yet another implementing a new sort of symposium, one in which the artist and the audience would discuss and rehash the themes of the exhibition. The new project will consist of two parts, one for the public and the other for the gallery. The public will have a 50-foot-long digital mosaic of the artist’s works, a playwright will be given a preview of the exhibition, and a new online viewer will be made available. The artist, who is currently in a wheelchair, will lend his name as a keynote speaker. One hundred copies of the exhibition will be made available, with a pledge of forty-five thousand copies, to the public. The other part of the project will be a site-specific series of paintings, sculptures, photographs, and videos that the artist made in the 1960s and 1970s.  The Biennial will be held at König-Bickelhaus in Berlin and will operate for six months. The opening will be on September 16.\n\n\nThe Worcester Art Museum in Massachusetts has received a donation of ninety artworks by nine artists in an untimely and mysterious way.", "The next Biennial should be held in 2020.\n\n\nArt historian Ana Mendieta has won the third edition of the São Paulo Triennale, which will be held in March of 2022. The Argentinean painter, sculptor, and educator was selected for the prize for her work “The Equator” (The World) and “The Sky that Grasps Life” (The Sky That Dies), 1998, in which she explores the concept of the “nature” in relation to human life, art, and artmaking.Born in Buenos Aires in 1976, Mendieta moved to Buenos Aires when she was only five years old. She attended the local school of sculptors Iñigo and Raquel Ritz, the late president of Argentine Academy, and is a graduate of the State Polytechnic in San Andrés, Buenos Aires, where she studied with the award-winning art historian Emilio Nava. She has also taught at the Institut de Arte Contemporanea Argentina (IAC), Universitat de Buenos Aires, and the Universitat de São Paulo.In the second round of judging, the exhibition was staged at the exhibition space México", "The next Biennial should be held in the fall of 2020. If all goes as planned, an exhibition of the first half of the arXiv–curated exhibition\u0097\"Life Stories, Image Stories, and Image: Images, Physical Objects and Objects.”The 2019 festival, which was founded by Tibor de Kooner, Henryk van der Meyden, and Hartmut Müller\u0097was held at the MAMCO in Stockholm. The 2019 exhibition, titled “Life Stories, Image Stories, and Image: Images, Physical Objects and Objects”\u0097was organized by the MAMCO and curated by Kenneth von Storch. The show opened on March 14 and ran until March 21.\n\n\nThe Los Angeles County Museum of Art (LACMA), the Museum of Contemporary Art, Los Angeles, and the Hirshhorn Museum and Sculpture Garden have announced the launch of a new digital platform containing work by more than 7,500 artists from forty-five countries and fifty-six countries across the globe. The platform, called the Art Newspaper, will provide an in-depth look at the work of forty-six artists in the next two months through a curated series of interviews with artists.The", "The next Biennial should be held in June 2020.\n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, announced today that it received $5.25 million from the National Endowment for the Arts (NEA), the Corporation for National and Community Service (CNS), and the Arts and Humanities Foundation (AHCF), the charitable organizations which are helping to create a new biodiversity center that will benefit thousands of underserved and historically Black communities throughout the United States. The new center will be a hub for cultural exchange and the exchange of ideas and experiences among scholars and communities and will provide access to new works by artists of color. “One of the most pressing challenges facing our country and our world is the crisis of urban life,” said   Saun H. Hamilton, director of the Smithsonian. “This new center will deliver transformative experiences for thousands of people in the black community in the central region of Washington, DC, and will help us understand and address the challenges and opportunities of our current environment.”The NEA and CCS grantees are The Arts and Humanities Foundation, which will provide $3 million, and the Corporation for National and Community", "The next Biennial should take place in an underground exhibition space on the ground floor of a building housing the DIAMETAMUSE museum in Gdansk in 2019. It will be a public event and will mark the twentieth edition of the event. The inaugural edition, 2014, was staged at the Wissinský Palace in Warsaw and the KW Institute in the city. The event will be held at a beautiful new venue in the city, the Wissinský Museiv Prazejne, just outside of the city. The theme of the exhibition will be “Itallie aus dem Alle Deutschland,” which will focus on a female artist who was German during the Third Reich and is known for creating works such as the monumental “Hindenburg Monuments” (1919) and the monumental “Deutsche Entwicklung,” a collection comprised of the works of Tadeusz Krivac, Christian von Kleist, and W. M. Keats. The exhibition will also feature works by other international contemporary artists such as Jenny Holzer, Li Ka, and Tunga.Commenting on their works, the artists said: “The Biennial will", "The next Biennial should take place in the coming months, with exhibitions and screenings of selected works spanning the history of the exhibition in the coming months. The biennial’s first edition, titled “Feminist Women and the Modernist Female Body,” took place from March 28 to March 31, 2019 in the United States, and featured work by fifty-eight artists. Unlike most biennials, the show was curated by women, with Rebecca Black, Margot Hopper, and Teri-Lynn Billingsley serving as cochairs. The show’s second edition, “The Diagnostics,” was staged in January 2020 and was curated by two women: Lynda Barry and Teri-Lynn Billingsley. The 2020 edition of The Biennial, titled “The Future Is Present,” will be held at the San Francisco Art Institute (SFMI), and will be free to the public. View the complete list of participating artists here: http://www.thefemaleproduction.com/\n\nThe Cranbrook Museum of Art in Bloomfield Hills, Michigan, has received a gift of fifty-six works by seventy-four artists that were", "The next Biennial should include a selection of works by the artists who have given the greatest assistance to our museums, and should include a short-form question-and-answer period. The institution will also work with the Los Angeles County Museum of Art and the San Diego Museum of Art to develop a new public programming program that will start this fall.If the project is successful, the museum will be able to attract more than 3 million visitors to its new home in downtown Los Angeles. The restoration of the Museum of Contemporary Art (MCA), the San Diego Museum of Art, and the Museum of Modern Art in New York City has been supported by funds from the National Endowment for the Arts (NEA), the Ford Foundation, and the John D. and Catherine T. MacArthur Foundation.\n\n\nThe Museum of Contemporary Art (MCA) has added two new artists to its growing list of supporters, adding Barbara Jane Miller and Suzie St. Laurent to its roster and associating them with its recently inaugurated 78th anniversary celebrations. The Los Angeles–based artist, whose work explores the relationship between the body and the world, was selected to represent the United States at a ceremony held at the San Francisco Museum of Modern Art (SFMoMA) on Tuesday", "The next Biennial should be held in 2021; and the next in 2022.  The museum’s current exhibition, “The Black Wave—” will go on view as part of the event at the new exhibition space ART+ in Paris in 2021, and will return to the gallery in 2022. The exhibition, which celebrates the exhibition and recordings, “The Black Years” (2019–2020), will be accompanied by a series of new works by the artist-in-residence, Melane Haddad, which will open at the museum on January 14, 2021.Haddad’s first show with the Biennial will be “Two Years After,” which will be on view in the Contemporary Art Museum Paris and the National Museum of Modern Art in London in July 2019, and “Six Years After,” which will open in the National Museum of Modern Art in Beijing in April 2020. The show will be preceded by “6:00 AM,” which is part of the “Theater of Operations: Stories from the Gulf,” which will open at the National Museum of Modern Art in Washington, DC, in January 2021.\n\n\nThe Dutch government granted", "The next Biennial should have been held in 2020, but due to the Covid-19 outbreak and a scheduling conflict, the 2020 event was rescheduled to 2020. “In reality, the first Biennial was an absolute success, and we are now in the process of rebuilding the biennial experience for our guests,” said Park Chae-kyung, chair of the board of trustees of the Biennale. “The next edition will be even better, and will return the biennial to the core of Seoul, where it belongs.”The 2020 edition will focus on issues such as the social safety net, homelessness, climate change, and the impact of cultural heritage on the environment. The theme “Walking across the River: Art, Politics, and the Future of the Korean People” is closely linked to the film and television series Walking on Water, and the 2017 reopening of the Seongju District Museum of Art in Seoul. The 2020 iteration will also feature a new musical number by Choi Min-sook, who made his debut in the biennial alongside Lee Seung-kyung as the duo were making their début feature Jung Yong-ho and Lee Seung-kyung", "The next Biennial should be held at least twice a year, with the possibility of rotating a year to coincide with the seasons.The institution’s director, Pamela Blatchford, also said that the institution will continue to collaborate with arts institutions and organizations in the UK to support their programming, and that it hopes other UK-based organizations will benefit from the biennial’s programming.\n\n\nThe London-based nonprofit the London-based nonprofit the Fund, which supports artists and organizations facing financial difficulties, has pulled its funding from the Royal Shakespeare Company (RSC) as part of a move that will safeguard the financial future of the theater company and its iconic Stratford premises. The organization confirmed that it will not be renewing its annual grant of $3 million to the RSC, which has physically staged the Royal Shakespeare Company—which has staged the Royal Shakespeare Company since 2015—in London every year since it opened.Established to provide financial support to British theater, the Royal Shakespeare Company currently receives $3.6 million from the Royal Shakespeare Company Fund, which was established in 2018. The organization said that the decision to decertify the annual grant was made in light of the company’s latest financial results, which were", "The next Biennial should take place in 2021, and the first in 2022. https://www.theguardian.com/film/2016/jan/03/biennial-event-forecast C, which will mark the opening of the exhibition.\n\n\nThe Christie’s catalogue of art has been updated to include the first major redesigns by American contemporary artists in more than twenty years. The redesigns, which were made with a new technology called Post Media, were commissioned by the brand to increase the realism and intimacy of its artworks. The first redesign project was “The Body,” a series of sculptural interventions that were made in collaboration with Jennifer von Bruenchenhein, Sarah Lawrence, and others. In 'The Body,” a sculpture made from fourteen pieces of contemporary art, the artist creates a living, breathing, and breathing body. The work, titled “The Body of a Woman” and curated by Michael Lichtman, shows a woman, dressed only in a white frock, lying in a tub with her arms wrapped around her. Lichtman calls the work “Aerialism” and the transformation of the water in the works, which are currently on display in", "The next Biennial should be announced soon.\n\n\nThe London-based art center the Tate will pay more than $1 million to settle a lawsuit alleging that it entered into a “previously unspoken understanding” between the Tate and the Royal Shakespeare Company (RSC), the British theater company that was forced to cancel a production of the play The Merchant of Venice in April 2019 in order to protect the future of its partnership with the RSC, the New York Times reports.The Tate and the RSC signed a preliminary agreement in the summer of 2019 in order to avoid a disruption to the two-year-old partnership, which has been under threat since the start of the pandemic. The agreement, which is not legally binding, calls for the two institutions to begin reopening when the pandemic ends, and is signed by George Hamann, the director of the RSC, and Marie Williams, the director of the Tate, in the presence of former RSC chairman Nicholas Cullinan and former directors Rishi Sunak and Carmel Allen. Hamann and Williams declined to elaborate on how the partnership would be restored in a statement to the New York Times, but they did say that the partnership “will remain intact and strengthen", "The next Biennial should take place in the city in 2021. Up for grabs will be the city’s public art and architecture and will be organized in a similar fashion to that of the recent Art Basel Hong Kong and Art Dubai Biennials. The event will be hosted at the city’s two urban villages—Civic Center and Art Park—and will be hosted by the Art Gallery of San Francisco (AGS) and the Museum of Modern Art (MoMA).“I’m excited to begin the next Biennial as a San Francisco institution,” said Richard Roskam, chair of the committee and chair of the board of trustees of the Civic Center Foundation. “This is an amazing opportunity to build on the legacy of the Civic Center and add a new dynamic to the contemporary city.”The Civic Center Foundation was established in 2007 as a private charitable organization. The organization raised an initial $3.5 million for the foundation in 2009, and in 2012, the Civic Center Foundation gave $5 million to the foundation. In 2017, the foundation received a $10 million grant from the City of San Francisco. The next edition of the Civic Center Foundation Biennial will take place in the city’s Marina", "The next Biennial should take place in 2020.\n\n\nThe Krägers' Bechtebauhaus, located in the otherwise empty former Prussian Ministry of Culture in Berlin, has received a gift of more than two hundred works by the late German designer Edsel Nachlass. Curated by sculptor Barbara Streif, the exhibit will highlight Nachlass’s legacy in a series of exhibitions that will take place at the Bechtebauhaus’s Kunsthaus in the spring of 2021.The show will also include works by artists such as Herbert Leibniz, Tadao Ando, and Wolfgang Paalen; influential architects such as Ulrich Gehiff, Dietmar Polke, and Renzo Piano; and works by African and European artists such as Charlotte Blatchford, Tarek Atoue, and Edward Kmett. In addition, the museum will display fifteen works by Nachlass’s protégés Ulrich Neuer, Edvard Mather, and Otto Speyer; as well as numerous works by her colleagues and students, including her protégé Joachim Neuer, her protégé Harald Szeemann, and her prot", "The next Biennial should take place in 2020, but the current plan is to hold the event in 2021. The Khimjung Arts and Technology Center (KAC), founded in 2012 by the descendants of the late billionaire JiaYu Lu, has also expressed an interest in hosting the first exhibition dedicated to the Chinese city of Nanjing.“We hope this announcement will be a signal of our continued cooperation in the matter of art,” said KAC director Sun Jiegui. “As an international organization, KAC has the duty to ensure that the exhibition is a platform for the cultural exchange between China and Korea. We will carefully review the proposal and discuss the various issues raised by the city of Nanjing and consider the opportunities and risks presented by the exhibition.”\n\n\nThe Allen Memorial Art Museum in Atlanta has received a gift of twenty-eight works by American painter Georges Apostu - a total of twenty-nine works by the artist that were previously undiscovered. The work is part of a collection that includes works by all seven of the artists nominated for the fifth Academy Award for Best Foreign-Language Albums in 2020, which will be presented at the Allen Museum on August 30. Curated by Kiyomi Matsuda and", "The next Biennial should be in the fall of 2020. Art for America’s president, Robert Smith, who is also the director of the North Adams Museum of Art, said: “We are thrilled to support the Biennials by providing a platform for the artists whose work reframes the meaning of art and art history, and elevates the practice in ways that create new opportunities for the future.”Smith added that the biennial “seeks to move beyond the usual model—that of a single institution dedicated to a single medium. Rather, it seeks to examine the possibility and the impossibility of disembodiment, the interplay between human and natural objects, and between past and future.”Though the Biennials are a virtual reality environment created by the artists, the event’s organizers have enlisted more than sixty arts professionals to create virtual worlds that will occupy the Kastner Sculpture Garden, the Museum of Fine Arts, and the Art of Living Arts throughout the summer of 2021. The virtual worlds will be created using an open-source technology called VRBO, an ecosystem created by Daniel Ek. The company will pay the artists $1,500 for their work in exchange for the virtual worlds becoming a part", "The next Biennial should be held as soon as possible. The 2018 edition, titled “Return of the Biennial,” was held in July. Founded in 1995, the annual event, also known as the Biennial of Modern Art, is one of the longest running, most prestigious, and most prestigious film festivals in the world. It was staged at New York’s Metropolitan Museum of Art and has been held at various locations on the grounds of the Museum of Modern Art. The biennial was organized as a joint venture between the Museum of Modern Art and the Foundation for Contemporary Art, with the support of Audrey Fisk, David Kordansky, Barry Levinson, and Benjamin Wolf, among others.During its seventy-five-year history, the biennial assembled forty masterworks for the exhibition, including “Arts of Life” (1999), “The Shape of Things to Come” (1999), “Male and Female Together” (2000), “The Three Senses: Spinoza” (2003), and “A Room Full of Ghosts” (2005). The event also included performances by Joseph Beuys, James Brown, Peter Sellars, Lawrence Fer", "The next Biennial should be held in 2022. \n\n\nThe Tate’s board of trustees has nominated Walt Whitman’s The Velvet Fantasy as the fifteenth biennial art project of the Tate’s 150-year history. The work, which one critic characterized as a “spiritual transference, a poetic reworking of life and the world,” will also begin its presentation at the Tate in London next month.“The Velvet Fantasy was a choice by Tate’s artistic director, Carmen Ballenger, a former head of the Tate, to present a work by a hitherto unknown artist in a show that celebrates the voices of artists that have had an outsized impact on the Tate’s artistic mission,” reads a statement on the board’s website.Ballenger said she couldn’t have asked for a better artist to represent the museum, whose collection comprises a “truly amazing array of works,” and said Whitman’s work is “a powerful reminder of how much more can be done.”The creator of “Sylvia’s Room,” 2009, a sixteen-by-sixty-one-inch photograph that can be found", "The next Biennial should focus on the role of the artist-culturator in contemporary and post-modern art, and should feature an exhibition that will engage with the artist-culturator.”\n\n\nThe Arusha Art Museum in northern Uganda has appointed Alexandra Sendero-Sakagal as its next head of curatorial affairs. She succeeds SSP Acremba, who was dismissed in April after a year as director of Museu de Arusha, and will take up the post at the institution in September.“Our institution is delighted to welcome Alexandra to Arusha,” said Joachim Heimann, chair of the museum’s board of directors. “We believe that her expertise and ability will be particularly effective in addressing the challenges and opportunities posed by the rapid spread of HIV/AIDS throughout Central and East Africa.”Sendero-Sakagal previously worked at the Museu de Arusha in the latter part of 2016 and 2016, both as a producer and as a curator. She will now take up the post after working as a curator at the Museu de Arusha for six months. Commenting on her new role, she said: “My first time working as", "The next Biennial should take place in the spring of 2021.  The 2020 edition of Dada was held at the Art Place in Berlin, and the 2020 edition of Nerve Gallery in Paris, a partnership between Nerve and the Fondazione Prada.  Nerve will also collaborate with the Venetian Museum, the Museum d’Art Contemporanea in Venice, and the Art Gallery Basel in Switzerland to present the Dada Biennial in Paris in February 2021. Speaking at the launch of the new exhibition, artist-performer Martino di Berbolo, who has been featured in several exhibitions at the Venice Biennale, said: “I am proud to be a part of the next edition of Dada, and of the work of the artists who created it. The new exhibition will introduce new and interesting subjects and will additionally focus on a very specific point: the history of a certain place, the Voskvaert-Zug, in the Belgian city of Antwerp.”\n\n\n\n\n\nThe Museum of Contemporary Art (MoCA) in New York is working with the artist-run nonprofit The Sanctuary for Performing Arts (StP) to create a new", "The next Biennial should be held in a location that can provide a stable and convenient location for visitors. Should this be the case, the 2019 edition will be staged at the Museo de Arte Contemporáneo Dario Franchitti, in Rome, Italy, which is currently undergoing a major facelift, and will take place in the Margherita Dei Museum in Turin, Italy, in 2021. The 2020 edition will be in the Museo de Arte Contemporáneo Ato, in the Piedmont region of Italy, and will be staged in the city of Turin. The 2021 edition will be staged in Rome and will take place in the Palazzo Reale, the historic palace, and the Forum of Vittorio Storaro. The 2022 edition will be held in the Museo di Arte Contemporáneo in Turin, and the 2022 edition will be staged in Rome. The 2020 edition of the Venice Biennale will be staged at the Museo di Arte Contemporáneo in Turin from November 27 to December 3, 2020. The 2022 edition will be hosted by the Museo di Arte Contemporáneo", "The next Biennial should be held in the spring of 2021. \n\nIn a letter to the Museum of Modern Art (MoMA), Kayode Ailiwui, president of the Ghana Cultural Centre, wrote: “We are deeply concerned by the recent events in Ghana, which place our community and community-building activities at risk and threaten the long-term health and well-being of our communities. We ask that MoMA and the City of New York protect the quality of life of Ghanaian and Ghanaian-American artists and staff, and support their work.”\n\n\nThe University of Central Florida (UF) has received a $25,000 gift from the MacArthur Foundation. The grant, which also came with a $5,000 contribution, will help fund the construction of a new MacArthur Research Office on the campus of the university.“We are incredibly grateful to the MacArthur Foundation for this generous gift, which will enable the University to build on the legacy of Dr. Charles MacArthur,” said Katherine Flannigan, the foundation’s executive director. “By providing a research and outreach center and a central location for MacArthur scholars to communicate with one another, this new MacArthur Research Office will give UF a", "The next Biennial should be held in Japan, the United Kingdom, and Hong Kong in 2021. The exhibition will include work by artists such as Maren Basso and Richard Anuszkiewicz and will run until March 28. The 2018 event was held in Dusseldorf, Germany.\n\n\nThe Institute of Contemporary Arts (ICA) in Vienna has announced that it is planning to launch an online platform that will host exhibitions, concerts, and other events strictly by invitation only. The news comes amid a global climate crisis that has seen the number of cases of COVID-19 increase by more than six hundred percent since the onset of the pandemic.The future of ICA is now uncertain, and curator Konstantin Przybylska was recently given a three-year contract at the new digital venue. Przybylska, who often works in collaboration with artists and other cultural producers, is currently developing a new work for the inaugural edition of the platform, which has yet to be named, which will be housed on the ICA's website.Artforum has published a preview of the inaugural edition, titled “We Fall Apart: Celebrating Art” (Artforum/ca), which will be held at the I", "The next Biennial should be held in 2021. \n\n\nThe Andy Warhol Foundation for the Visual Arts (AWFA) has announced its 2020 commitment to supporting artists and cultural producers through grants of creative, professional, and community-focused support. Established in 1979 by the Andy Warhol Foundation for the Visual Arts (AWFA), the program provides financial assistance to an array of artists, including the American painter John Ashbery, whose own sculptures are featured in ​Charles and Paul Gauguin’s The Birth of a Nation (1921), and the French sculptor Jean-Michel Basquiat’s Un Forme (1922), which will receive a $100,000 fund.“For more than three decades, AWFA has been committed to supporting artists in their creative pursuits,” said John Griffin, director and CEO of AWFA. “Over the years, we have established a rich and moving legacy of well-deserved recognition: Andy Warhol won a Pulitzer in 1971 for the presentation of a work by a female artist, and for his work for the New York Public Library in 1977, a prize for which he received the Presidential Medal of Honor in 2007. The program has developed over time,", "The next Biennial should be held in 2022. “We are very excited to collaborate with our local artists and the many other institutions that make up British Columbia,” said Director Linda Gold. “This is a moment of immense change, and we are eager to use our power to help shape it into a more just, compassionate, and prosperous future. We are committed to empowering our local communities in the construction of a more just, compassionate, and prosperous world and will continue to advocate for change in British Columbia.”\n\n\nArt historian, curator, and writer Aya Chibber has been nominated for a $10,000 Grant for Research, which was established by the J. Paul Getty Trust as part of the “J. Paul Getty Foundation for the Visual Arts (J. Paul Getty Memorial Grants)” in recognition of her contributions to the visual arts. Inaugurating the grant program is the release of “J. Paul Getty’s Sculpture of Life: A New History” (2017–18), a new study of the artist’s work and of the legacy of the Getty Trust.Chibber was also recognized for her contributions to international art and Canadian biennialism by the", "The next Biennial should be held in 2020.\n\n\nThe Polaroid Garde du Palais de Tokyo in Paris, which celebrates the city’s heritage architects, has received a gift of roughly one hundred works by a group of contemporary Japanese painters that included works by Tadao Ando, Tatsuki Noguchi, Aoki Takayama, and Yoshitomo Kiyomasa. Curated by Richard Langret, the director of the New Museum Tokyo, the event will also feature artworks by artist Mira Nair, French artist Etienne Leclerc, and Israeli artist Binyamin Larmon.“The gift from the Pilbara's Nadine Lubigny and Richard Langret is a milestone in the history of the institution,” said Robert L. Futter, chair of the Board of Trustees. “Together they have created a powerful platform for the exhibition to present the work of the past year, and to reflect the contemporary imaginings and passions of the Pilbara, its contemporary spirit. It is a powerful statement that these artists have been selected on the basis of their work for a new exhibition. The show will also be a new creative and intellectual tool for the museum to present the Pilbara", "The next Biennial should take place in the port city of Thessaloniki, Greece, in October 2021. \n\n\nThe Institute of Contemporary Arts (ICA) in Oslo announced that it has received a gift of fifteen works by the artist Odili Olafsson, who was imprisoned for fifteen years for his involvement in the Thessaloniki bomb attacks, which killed thirty-five people and wounded thousands more.The gift, which was made by an anonymous donor in the Norwegian capital, was made in recognition of the artist’s work relating to violence and the impact of art on society. It also comes on the heels of a major exhibition organized by the artist at the Museum of Contemporary Art Oslo, which was organized with the assistance of the Institute for Contemporary Arts.The exhibition “Odili Olafsson: Violence and Violence” will be on display at the Institute from October 16 to October 23. The institution also announced that it has received a gift of twenty-four works, including Odili Olafsson’s The Body in Flight, which was organized as part of an exhibition of work by the artist at the Bergenbakken Gallery in Copenhagen in early November, and a manuscript by the artist that was published", "The next Biennial should be held in the spring of 2022. Curated by my sister, Cheung-li Lee, it will be organized as follows: The exhibition will include the world-class work of photographers, including Alexander Calder, Pia Camille Pousette, William Eggleston, and Evelyn Oostra; the biennial’s first exhibition, “Vanity Fair,” which was organized in 2001, will be on view in April 2019; and the biennial’s second exhibition, “Pillars of the World,” will debut in May 2020. “Actual production is still a ways off,” said Lee. “But we are confident that we will be able to present the most compelling works in the best possible way.” Inaugurating the Biennial will be a series of exhibitions devoted to the work of emerging international artists, including the inaugural exhibition “John Akomfrah: The Structure of Performance” (March 14–March 21), which is slated to run March 23–March 26; “In the Shadow of the Wind: Photographs at a Time of Transition” (March 19–March 21), which will", "The next Biennial should be held in between August and November 2020.  The next exhibition should be held in between December and March 2021. The next event should be held in the first half of March 2021.  The next exhibition should be held in the first half of March 2022. The next exhibition should be held in the first half of March 2022. The next exhibition should be held in the first half of March 2022. The next exhibition should be held in the first half of March 2022. The next exhibition should be held in the first half of March 2022. The next exhibition should be held in the first half of March 2022. The next exhibition should be held in the first half of March 2022. The next exhibition should be held in the first half of March 2022. The next exhibition should be held in the first half of March 2022. Toothpaste Collection, London: The collection will be relocated and will be available at various museums across London, including the Tate, the National Portrait Gallery, the Tate Britain, the National Gallery of Scotland, and the National Museum of Scotland, where it will be exhibited as part of the museum's reopening in March 2022. The exhibition will also return", "The next Biennial should focus on the exhibition of new work by emerging and established artists. The biennial will be organized in the same way as last year’s edition, but will be held in London, Paris, and New York. The upcoming event will feature a total of fifty artists, ranging in age from eighteen to forty-nine, and will take place during the year of our Lord 2021.\n\n\nThe National Gallery in London recently informed the gallery that it will no longer receive visitors from July 21 through the end of the month. It announced in a statement on July 22 that the move was made after a review of the galleries’ current exhibitions, and while it acknowledged that it was “committed to giving the National Gallery the best possible platform for our upcoming shows,” it stated that it “does not wish to reopen with the exhibition schedule currently in place.”The exhibition schedule for the National Gallery’s upcoming two-year event, “The National Exhibition of Art”, which will run July 23–July 27, 2019, has yet to be announced. The 2019 edition, titled “From the New World to the Old,” featured work by thirty-one artists from forty-nine countries and", "The next Biennial should take place in 2021.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has canceled the upcoming edition of the Biennial of American Visuals Arts (BVA), citing the health and safety of visitors to the venue. The decision was made after the biennial’s commissioner, Davide del Valle, was hospitalized last week following a serious crash in the city that involved a tractor-trailer and took place in mid-March.According to the New York Times, the thirty-eight-year-old driver of the tractor, which was used to unload construction materials for a new luxury apartment complex in the city, was fined for violating the New York State Fast and Furious law. However, the conviction was overturned on appeal.“Based on the information we have at this time, we are canceling the upcoming edition of the Biennial of American Visuals Arts,” the museum said in a statement. “This is a very complicated issue for us and our team, but we felt it was the right thing to do, given the recent developments. We wish Dion a speedy recovery and we hope he and his family and friends have a full and speedy recovery.”Del Valle was taken", "The next Biennial should be held in 2020, and may be extended to 2021. The theme of the first edition was “Eternal Urgency.”  For the second edition, an exhibition of work by forty-five artists, including Zenio, Agostino Zingaretti, and Sara Cwynar, would be staged at different times of year and would be similar in theme but less well-known. The biennial would be hosted at the Museo de Arte Contemporáneo Loreto in Madrid, and would be organized as a two-part exhibition. The first part would include works in the collections of the Museo de Arte Contemporáneo Loreto (Arte de Catalunya) and the Museo de Arte de Madrid (Museum de Arte de Madrid), and would be on view in December and March, respectively. The second part would be a combination of works by the Museo de Arte de Madrid, the Museo de Arte de Barcelona, and the Museo de Arte de Paris. The six works by the artists represented in the exhibition would be the same, but different, as in the first edition. In an attempt to", "The next Biennial should aim to create a new context for the exhibition “from the artist’s point of view.” The four-day event will take place in the West Bank village of Nablus, in the West Bank, in the country where the biblical city of Bethlehem is located. The 2016 edition of the exhibition, titled “Theatre of Light”\u0097named after a biblical passage in which Alia and Nima Biennalis, women who became the first inhabitants of Bethlehem, Bethlehem “Theater of Light,” remained in the exhibition after it closed in March, drew 800,000 visitors to the West Bank.The theme of the fifth edition of the exhibition was “Theater of Life”\u0097a reference to the life and work of artist and activist Arsht. On April 4, the exhibition will reopen in the West Bank and will continue to be held in cooperation with the Palestinian Authority until the end of June.\n\n\nSinger-songwriter Ben Harper, whose body of work encompassed both transcendence and melancholy, was found dead on Sunday at his home near Paris, France, at age fifty-three. According to Entertainment Weekly, the cause of death", "The next Biennial should be held in the fall of 2022. The next edition will be held in the spring of 2022. The next edition will be held in the spring of 2023. The next edition will be held in the spring of 2026. The next edition will be held in the spring of 2028. The next edition will be held in the spring of 2033.The next Biennial will take place in the fall of 2022.The next Biennial will take place in the fall of 2021. The next biennial will take place in the fall of 2022.The next Biennial will be held in the fall of 2022. The next biennial will take place in the fall of 2021. The next biennial will take place in the fall of 2019. The next biennial will be held in the fall of 2021. The next Biennial will be held in the fall of 2022.The next Biennial will be held in the fall of 2022.The next Biennial will be held in the fall of 2022. The next biennial will be held in the fall of 2021. The next biennial will be held in the fall of 2022.\n\n\nThe Cultural Institute of Chicago (CICA) has appointed Suzanne Van Doren as its next director.", "The next Biennial should prepare the way for a new kind of public art. We must decide not to wait for the past but choose the future . . . We have chosen to transform our world and create a new future through art, not through fear and hate. We are a community of fellow travelers, of neighbors united by a common need to make things of beauty and usefulness. We are one people, one society, one indivisible nation. We are one America. We are one people, one nation. We are one people, one nation. We are one people, one nation. We are one people, one nation. We have decided that we are not going to allow these hate groups and extremists to define who we are as Americans or as a society. We are going to define ourselves by our common humanity. We are going to define ourselves by our common humanity. We are going to define ourselves by our common humanity. We are going to define ourselves by our common humanity. We are going to define ourselves by our common humanity. We are going to define ourselves by our common humanity. We are going to define ourselves by our common humanity. We are going to define ourselves by our common humanity", "The next Biennial should take place in the summer of 2021. Art in Motion will still be held in the capital city, and will be supported by a new grant by the Robert Giard Foundation.\n\n\nThe Center for Middle Eastern Art (CMA), New York, announced that Michael Alvarez, the director of the SculptureCenter in Manhattan, and Nan Goldin, the director of the Museum of Modern Art, have been appointed curators for the 2021 iteration of the exhibition. The center will focus on creating a platform for the exhibition “the Stories of Art,” a partnership between Goldin and Alvarez that will unfold across three floors of the SculptureCenter and will also include a show of work by artists who are longtime collaborators, including Zulfiqar Jumana, Nima Nusseibeh, and Lina Turner. The program will run from March 19 through March 23, 2021.“I’m really excited that we’re finally getting the chance to present these stories with the artists who are participating and to have them be a part of the exhibition,” said Michael Alvarez. “I’ve been an admirer of Nan Goldin’s work since the early 2000s,", "The next Biennial should take place in 2020.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has released guidelines for the relocation of cultural artifacts from its holdings that were donated to the city by the estate of Holocaust survivor Alfred Stieglitz, who was executed by the Nazis in the camp of Auschwitz in 1944.The guidelines, which were drafted by DCLA commissioner Doris Young and were released on May 23, 2020, state that the city’s cultural institutions may move the works’ contents to another facility managed by the estate for a number of reasons, including “the preservation of the legacy of a great Jewish teacher,” or “the safeguarding of a Holocaust survivor’s collection.”While the guidelines do not directly address the relocation of works by individual artists, they outline steps citizens can take to help ensure that cultural institutions such as the Museum of the City of New York, which was founded by Lévy Gorvy (a French department store chain that merged with French luxury conglomerate Saint Laurent in 2015), and the Museum of Modern Art (MoMA, the Museum of Modern Art, and the Metropolitan Museum of Art), which is housed in a former Nazi concentration camp in the Bronx, are not demolished", "The next Biennial should focus on the history of community engagement and the social and political economy of art, and the possibilities of the local, national, and international. It should also present a variety of artists from different parts of the globe. The theme of the twenty-fifth Biennial ’s fourteenth edition is the history of art in the twenty-first century. The theme will be the theme of the twenty-sixth Biennial’s fifteenth edition. The theme will be the theme of the twenty-seventh Biennial’s twenty-fourth edition. The theme will be the theme of the twenty-ninth Biennial’s twenty-second edition. The theme will be the theme of the twenty-seventh Biennial’s twenty-third edition. The theme will be the theme of the twenty-ninth Biennial’s twenty-first edition.  \n\nThere are currently more than 650,000 objects in the collections of more than ten thousand museums across the United States. Many of the objects are well-known and celebrated: the career of Indiana Jones, the work of Ed Moses, and the future of the American Dream. Others are less well-known and are on display at rare and", "The next Biennial should be held in the city of Worcester, Massachusetts, in the spring of 2021. Originally scheduled to take place in the spring of 2019, the event was pushed back a year due to Covid-19. “The Biennial is just beginning to emerge from this global health crisis, and at this stage I would like to see the exhibition remain in Boston, which has been such a magnet for visitors,” said Michael Guggenheim, the art historian and cofounder of Guggenheim Partners. “We need more cities like San Francisco and New York, and I look forward to seeing how these cities respond to the biennial’s theme of connecting people and generating new ideas.” The Biennial of Modern Life, curated by the same team that curated the exhibition-centric fourteenth edition of Art Basel Miami Beach in March 2019, is slated to run from March 11 to March 13, 2021. “The future of our city, and the future of our art, is at stake,” said Mayor Martin J. Walsh. “This is a crisis for all of us, and it is an exhibition of how far our city has fallen far enough that we cannot continue as", "The next Biennial should be held in 2022.\n\n\nThe Julliard School in New York has released the list of thirty recipients of its 2021 Elizabeth H. and Edwin H. Kahn Awards, which honor outstanding contributions to the field of contemporary art. The honor, which are also given by the Society of American Art, will be presented at a gala dinner celebrating the biennial at the Javits Center on Thursday, April 19, at 8 PM. “These awards represent the future of the Kahn prizes, and reflect the past years of collaborative work between scholars in our programs,” said Ilka Kwon, the chair of the biennial. “The awards have drawn from many areas of contemporary art, but the most important and compelling are the essays presented by philosophers such as Mark Halperin and Paul Sfege.”Among the essays chosen for the award are “The Self-Reflection Art of Paul Gauguin” and “The Persistence of Vision in John Akomfrah”, which will both be exhibited at the Museum of Modern Art this fall.\n\n\nThe Solomon R. Guggenheim Museum in New York has announced that Aditya Jovan, the first Indian artist to", "The next Biennial should be held in the fall of 2020 and will be curated by Dennice Maasbach from the University of Exeter. The show will take place at the newly renovated Royal Academy of Arts, which is currently undergoing a $120 million facelift, in London between November 16 and November 20.Commenting on the upcoming exhibition, the museum said: “This is an exciting time to launch a new series of Biennials. We have been able to accelerate the pace of change and extend the life of our collection by four years with a single event. The series will become more powerful as we embark on our new research-based, collaborative, and institutional model. This will allow us to shape future exhibitions through our new digital platforms and to share our stories with a new international audience.”\n\n\nCinema Nara, an independent experimental nonprofit located in the mountains of the city of Nara, Japan, has received a $50,000 donation from the John and Polly Sackler Foundation. The gift was made in recognition of the organization’s long-standing support of the arts. Since its inception in 2006, Cinema Nara has awarded more than two hundred artists residency at the nonprofit’s studios and has worked", "The next Biennial should have been held in September, but was postponed because of the Covid-19 outbreak, which began in the United States and spread to more than 150 countries. The show will now be held in March 2020. “We are deeply grateful to our partners, our board members, our staff, our sponsors, and our audience for their understanding and support during this difficult and unexpected time,” said Serena.  Last year, the museum decided to end its current exhibition “The Natural History of the Body: Art, Technology, and the Art of Life” after a yearlong project. It also shifted the focus of the exhibition from the body to the environment. \n\n\nThe São Paulo Foundation, which organized a series of shows and workshops that explored Brazilian art history through the medium of photography, has announced that it will suspend the next edition of its biennial, “Photographs in the Life of a Family,” in March. The event, which featured works by thirty-three artists, is scheduled to run from March 7 to March 10.The Foundation was forced to cancel the exhibition in December 2018, following months of protests from art historians and artists whose works were featured in the event", "The next Biennial should consider “the possibilities of a digital and/or augmented world,” said Michael Rosenbaum, chairman of the Los Angeles County Museum of Art.   The forthcoming event, titled “Emissions,” will be held at the California Academy of Sciences (CAAS) in Pasadena.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has appointed Daniel H. Weiss as its new chief curator. Weiss will be responsible for organizing and curating a series of exhibitions over the course of the next eighteen months at the institution, which was established in 1972 by veteran curators Robert Steine, Steven H. Feinberg, and Charles Weidman.“We are thrilled to have Daniel Weiss as our new curator,” said MoCA’s director, Carolyn Bell. “He will bring a wealth of experience and knowledge to the table, and will be a critical voice in our ongoing exploration of the rich collections and exhibitions of our late and early directors.”Weiss will assume his responsibilities in February. Prior to joining the museum, Weiss was the founding curator of the exhibition “Theology of Modern Life,” which opened in the fall of 2019. He also worked as a", "The next Biennial should focus on “Intellectual Property and the Art,” Artforum editor-in-chief Lévy Gorvy said, “a topic which presents a paradox when examined from the same perspective as the artworks. The fact that these two subjects touch on so many areas of art history means that they are interrelated.”\n\n\nThe San Francisco Museum of Modern Art (SFMoMA) has announced that it plans to exit the city of San Francisco, which it describes as a “monopoly on commercial space” in an attempt to increase the visibility of works by artists outside of the Bay Area. Launched in 2012, the museum has since expanded to a five-story building and has staged exhibitions such as “Theater of Operations: The Gulf Wars 1991–2011” (2016), “Theater of Operations: The Iraqi Twenties” (2016), and “Theater of Operations: The American Invasion of Afghanistan” (2017).The museum’s new five-acre campus will be inaugurated by “Theater of Operations,” a major overhaul of the museum which will feature new works by ninety-nine artists, including Nelli Chiu, Terry", "The next Biennial should be more ambitious and give more representation of the varied and dynamic art of the Americas. We would like to work with indigenous, non-European artists, indigenous artists of the Americas, artists of Europe, and artists of the Middle East.”\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it will begin welcoming visitors back to the institution next week after a temporary closure due to the Covid-19 crisis. The museum is currently closed indefinitely due to the pandemic and has been unable to reopen since March 13, when it was forced to cancel its Sixth edition. During the pandemic, the MoCA’s regular exhibition schedule has been disrupted, and its California Design Center, where the museum is located, closed. In addition, the institution has been forced to prepare for the possibility of a loss of revenue and has been working with consultants to develop a comprehensive reopening plan. Although the institution hopes to reopen in the coming weeks, it is still assessing the best way to reopen.“It is physically impossible to reopen the institution without damaging the work and campus, and we have been working with consultants to learn how to reduce the risk while minimizing disruption to the exhibition program,” said museum director", "The next Biennial should be in December 2020.  The tour guide will be Joan Donovan, the curator of Théâtre dansai (1962), and will be accompanied by a twenty-one-foot replica of the Pan Am Museum in New York, which opened in 1971. Last year, the exhibition also included a seventy-five-foot replica of the Museum of Modern Art in New York. Art in the City is an annual event, which was hosted by the Charles de Gaulle Foundation in Paris and organized by Frederick Engels Group in Paris. The show will be held at the Museo de Arte Contemporáneo Argentina (MASA), Buenos Aires, from January 3 to January 6, 2021. The theme of the biennial will be “What is art?” and will be directed by Luis Angel Pérez.The first edition of Art in the City was held in February 2019. This year’s edition, entitled “3D,” was organized in partnership with the Foundation for Contemporary Art in Buenos Aires and the Institut de l'Art in Paris and is slated to run from January 22 to January 26. The twenty-fifth", "The next Biennial should feature a selection of works such as the work of the Dutch sculptors Jochen Haag and Nils Stølle; the next will take place in the central city of Freiburg. The biennial’s inaugural edition was held last autumn at the Gropius als Christian Museum in Freiburg. \n\n\nThe National Gallery in London has appointed former director of display design Renaud Le Brun as its new deputy director for contemporary design. Le Brun will have his first full-time role at the gallery in three years when it reopens in October 2020. He succeeds David Moberg, who has led the museum since 2014, and will assume his responsibilities in October.“Renaud is a leading curator and art historian with a proven track record for connecting the imagination with art and I’m looking forward to seeing where he takes the institution as we enter the next phase of its history,” said Matt Wrzesby, director of the National Gallery. “David’s vision for the National Gallery as a museum of the future was to create an environment for contemporary art that would reflect the values and aspirations of the National Portrait Gallery, while also becoming an ideal platform for", "The next Biennial should be held in 2021, and the year 2021 must be marked with a biennial exhibition that invites the community to its space. “We hope that this show will inspire you to think of your city, where the theme of our year is to re-imagine the biennial,” said Michaela and Hernán. The duo also noted that the exhibition should aim “to change the biennial, not to change the theme. . . . We would like to see more exhibitions that reflect the diversity of the city and the diversity of the city’s history.” Earlier this month, the New York–based nonprofit Brooklyn Center for Art and Culture announced that it is running a biennial of portraits by women artists in the city, which was launched in 2015 by Brooklyn-based artist Tia Holden. The show, called “Women in the World: Portraits from the 20th Century,” will run from March 20–March 26, 2021. The first show, “Reconstruction,” will be staged at the Brooklyn Museum, which will stage the second at the Brooklyn Museum and is currently closed until March 22. The biennial will feature more than 60 artists", "The next Biennial should open in 2020. Biennial director Naima J. Keith says that the event will be “titled ‘Beliefs of a Nation,’ and will be ’fully online and accessible by all, including students, faculty, and staff. It will also include new and original works by the artists represented, as well as a selection of works by the major contemporary artists of India.”\n\n\nThe Philbrook Museum of Art in Miami Beach is suing the city of Long Island City, New York, alleging that the institution is violating the city’s landmark Winston-Salem law by reopening to the public on December 25, as originally planned.The lawsuit contends that the building’s reopening on January 7 violates a section of the landmark’s landmark decree that prohibits structures built or renovated before January 7, 1970, from being reopened. The building’s reopening on December 25 would violate the law again on March 20, 2019, when it reopened as the City of New York’s new headquarters for the Environmental Protection Agency.The lawsuit was filed by the Philbrook on April 8, following an April 19 public hearing held at the city’s Department of Cultural Affairs", "The next Biennial should be held in 2021.\n\n\nThe Swiss collective Retronaut has announced its representation of artist Raymond Boivin, a French-Canadian Canadian artist best known for his large-scale, ethnographic installations that employ various materials and create a surreal, geometric landscape. Boivin’s show “Open Sky” (2017–18) at the Art Biennale in Rome, the Museum Stedelijk in Amsterdam, and the Art Biennale in New York will open in Hamburg in 2022. The upcoming exhibition “Open Computer” will be held in Stockholm in 2024. Boivin’s work will be included in the upcoming exhibition “The Age of Sculpture,” which will open at the Art Biennale at the newly renovated Museum Freie Kunstverein Kunst in Geneva in 2021.The festival, which aims to examine the role of art in contemporary life, will be hosted by the Zurbar Alkind Foundation in partnership with the city of Hamburg, the city of Zurich, and the city of Bern, and will mobilize more than 1,000 artists, curators, and scholars to create a unique “new era of art in Europe” through the exhibition", "The next Biennial should be held in the coming months.∞\n\n\nThe Institute for Contemporary Art (ICA) in Berlin has appointed Paolo Baratta as its next president. Baratta comes to the institution from the Institute for Contemporary Art (ICA), whose previous president, Wolfgang Fischer, departed the institution in January 2019.Baratta will take up the post on March 16. “One of the most exciting events of the last year has been the transformation of the Museum of Modern Art into the ICA,” said Fischer. “Paolo represents the future vision of the ICA, which is to become a powerful and important cultural center, a museum that is a bridge between the Arts and the City and between the arts and the city.”Baratta will succeed Zbigniew Bzdak in the role of president, which has been vacant since Fischer stepped down in March 2019. Before he was hired, Baratta served as deputy director of the Institute for Contemporary Art in the city of Leipzig. He is the author of More than a Century of Modern Art in Berlin: From the Unfinished Art of Max Beckmann to the Biennale (EA Berlin, 2019) and is currently working on a", "The next Biennial should be held at the Stedelijk Museum in Amsterdam in 2021. It will welcome the first visitors on January 24, 2021. The fifth edition of the Biennial will be staged at the Museum of Contemporary Art in Prague in 2021. The seventh edition of the Biennial will be staged at the Museum of Modern Art in New York in 2021. The eighth and final edition will be staged at the Museum of Contemporary Art in Chicago in 2021. The inaugural edition of the Biennial at the Museum of Contemporary Art, New York, USA, was held in October 2019.  The inaugural edition of the Biennial at the Museum of Contemporary Art, Chicago, USA, was held in October 2019. The inaugural edition of the Biennial at the University of Texas at Arlington, Texas, USA, was held in October 2019. The inaugural edition of the Biennial at the Museum of Contemporary Art, Texas, USA, was held in October 2019. The inaugural edition of the Biennial at the Museum of Contemporary Art, Texas, USA, was held in October 2019. The inaugural edition of the Biennial at the Museum of Contemporary Art, Texas, USA, was held in October 2019.\n\n\nThe National Museum of Women in", "The next Biennial should be held in 2020.\n\n\n\n\n\n\nThe Clay-Knox Museum of Art in Memphis, Tennessee, has received a donation of seventy-five works from the artist who was one of the first artists to be featured in the exhibition “MUSEUM,” which opened on May 24, 1970, at the Clay-Knox Museum of Art. The donation comes from the artist’s estate, David H. Neumeyer, and comes amidst a global outpouring of support for the Clay-Knox Museum of Art. We are grateful to the artist and her family for their generosity.”Commenting on the gift, Clay-Knox director and CEO Edward Neumeyer said: “David is a gifted and influential artist whose work, including his sculpture and painting, has been displayed in many important exhibitions and has been collected by numerous museums around the world. His gifts, and his legacy, are celebrated by his great-grandchildren. David has been a friend and ally of the Clay-Knox for more than thirty years, and we are very proud of his contributions to the museum. It is a great honor to receive this gift and to see his work in the hands of our collectors and of", "The next Biennial should focus on material culture and the relationship between art and the environment. The project biennials are not meant to be a replacement for a symposium but a way of engaging with the urgent issues of the contemporary world.”“We are the future,” said Melek, who is based in Vienna and Amsterdam.Bianco has been planning to hold a Biennial for two decades. The institution has presented multiple proposals for the exhibition in the past, but the 2001 iteration was deemed too ambitious by the National Museum of Fine Arts in Paris, which then decided to cancel the exhibition. A second edition, titled Diagram 3, was staged in 2006 in Italy, but it was never staged.The Biennial will also include a survey of global trends in art at the same time as the exhibition, which will be at the Institut de l'Art et de Lettres (I L A T E) in Paris from March 12 to March 25. The theme of the exhibition will be “The Future of Art.” The exhibition will feature new works by thirty-eight artists from twenty countries, including Brazil, Australia, China, France, Italy, Mexico, Russia, and Sweden.\n\n\nNational Geographic", "The next Biennial should be in the spring of 2021. Nairobi’s Art of Living: The Artistic Experience with Modern Technology (2019) is also slated to start in April 2021 and will run till April 24. Inaugurating the Bay Area Biennial is the May/June/July edition of the Art of Living, which will be held in the spring of 2022. Nairobi’s Museum of Contemporary Art (Nairobi) has also announced that it is reopening in the coming weeks and will welcome visitors via the Palais de Tokyo. The new Nairobi Art of Living, a project of the Nairobi Art Foundation, will be inaugurated with a public tour of the palace. More information about the reopening will be made available during the grand opening ceremony in Abuja on April 29.\n\n\nThe Vienna-based company that runs the Mondrian Museum in Milan, Italy, has received hundreds of millions of euros in funding from the German government. The German federal state of Berlin has allocated around $10 billion to support museums in the city since it was founded in 1942. The funding was made possible through a €9.7 billion package, which also included the creation", "The next Biennial should occur in 2020, during the ten-year anniversary of the New York art world’s founding. In response to the recent events in France, Artforum wrote: “The exhibition organizers have decided to postpone the tenth French edition of the Biennale to 2021 so that the event can truly celebrate the fifty-ninth anniversary of the exhibition. The announcement was made at a press conference held at the club's headquarters in the city of Lyon. “From the date of the announcement, the organizers have been in touch with the public and artists to let them know that the show will be postponed. They have also been in touch with trusted guests and galleries to let them know that the show will be cancelled for a period of seven weeks. The full list of participating galleries can be found here.”In the United States, the Art Newspaper reports that the forty-fifth edition of the Biennale will now take place at the National Museum of African Art, Washington, DC, in 2021. The event will be held in the museum’s new home on the National Mall and will be inaugurated by a concert featuring twenty-six African artists.“I’m thrilled that we will be able to", "The next Biennial should focus on rethinking the history of contemporary art, both in the United States and internationally, and will aim to create a more inclusive and equitable narrative through the collection and exhibition of Indigenous art.\n\n\nThe Venice Architecture Biennale has released the list of ninety-five artists who will participate in the upcoming edition, which will take place in the city of Venice from May 27 to May 29. The theme for the exhibition, “The Architecture of Life” will be a combination of life and the landscape and will take place in conjunction with the Venice Architecture Biennale, the annual exhibition, “Art for Life” in March 2019.“The project has been further developed in collaboration with our partners, who are working to organize a marvelously diverse group of artists, from the Italian sculptors Stefano Cattelan and Stefano Cipolletta, to the Icelanders Þórín Kauffman and Birgitta Jonsdottir, to Senegal and Thailand, and we are pleased to present it to them,” said Venice mayor Roberto Cicutto.The artists chosen for the biennial are:Paul Mpagi Sepuya, Ethiopia;Adam Alighier, N", "The next Biennial should be held in 2020.\n\n\nFrance has demanded the return of four cultural artifacts that were confiscated by the French military from a museum in the northern city of Marseille in an anti-terrorism operation codenamed Enfants Terribles (The Return of the Fourth). The pieces were part of a controversial exhibition organized by French minister of culture Franck Riester in 2015 that was staged as part of a public art project in the city. “After the terrorist attack in Paris, our justice department decided to respond by ensuring the authenticity of works,” Riester said at a press conference in the capital on Friday. “In order to establish a clear identity of the objects, the pieces were transferred to the State Museum of Contemporary Art (VMAC), Paris, and a team of experts, comprised of forensic experts, was sent to the region of St. Gall, where the event would have taken place. The third team returned two of the four artifacts to VMAC, and the fourth team two.”Riester said that the pieces will now be returned to the province of North Rhone-Westphalia, where they were purchased by VMAC in 2018, and the resulting exhibition will now be held at", "The next Biennial should take place in 2021. The organizers of the 2017 exhibition, which was organized by the German government and centered around a single artist\u0097Damien Hirst\u0097said that the exhibition will “have a new meaning from the exhibition of the first Biennial in 2020.”\n\n\nThe National Museum of Italy is currently undergoing an expansion designed to increase its exhibition space by more than four hundred rooms and accommodate additional works by contemporary artists. The project, dubbed “The Architecture of Light,” is part of an ambitious new plan for Italy to become more digitally connected to the outside world, including more museums and more galleries. The plan, which was approved in February 2018, aims to make Rome’s Rialto di Rivoli, the city’s biggest arts complex, by 2021.The project, which is being led by the Italian architectural firm Tevfik Arndt, involves the construction of a new gatehouse, which will sit on the Veneto River, and the construction of a new building for the exhibition space. The museum is also preparing to move the exhibition space from the third story of the building to the first floor of the new building, which will replace the Rialto di Riv", "The next Biennial should be held at least every other year, and will be inaugurated with a virtual exhibition of the project’s works on the virtual platform MotionArt. The event will be hosted by the Dreyfuss-Kassel-based artist and director Alexandra Katzmann, who is also the founder and director of the museum Stuttgart; artist Wolfgang Paac; and Wolfgang von Eschenbach, the curator of Art and Architecture, in Berlin, and will close with a special performance by the artist Peter Dreher.The second edition of the inaugural exhibition will be held in the Dili Art Museum in Rome, with works by artists such as Shilpa Gupta, Fritz Kremer, and Hans Jäger, and closed to the public this March. The exhibition will be held in conjunction with the 50th anniversary celebrations of the Italian state.\n\n\nThe Hong Kong–based publisher Eva Curanova, who was accused of plagiarism in the English-language version of Artforum magazine in the United Kingdom, has been awarded a $14,000 MacArthur Grant for her first project, a curated exhibition at London’s Tate Britain in 2021. Curanova, who is based in New York, said that she is excited by the project", "The next Biennial should take place in 2021, while the first will be held in 2022.\n\n\nThe Danish Film Museum (Damm) in Copenhagen has appointed Søren Magnusson as its next director. Magnusson succeeds Mikkel Bech, who has led the institution for nearly twenty-five years, and now takes up the post on March 12. Prior to his appointment, Magnusson was a senior curator at the London museum, where he served as director from 2001 to 2004.In the new role, he will be responsible for reopening the museum and promoting films in a way that fosters a deeper understanding of cinema within Denmark. Magnusson said: “I am very much aware of the urgent need for further cultural and physical renewal in Denmark, and of the vitally important role that the Danish Film Museum plays in this, the country’s cultural life and cultural identity. I am confident that this new challenge will help me to develop new and exciting programs for the Danish Film Museum in the coming years.”Magnusson came to the institution in 2013, following two years as director of the Wolfenbæk Film Festival in Oslo. In his new role, he will work closely with director Lars von Trier", "The next Biennial should take place in 2021. The fifty-ninth edition will be held at the LASALLE Museum in Venice, the Lévy Gorvy Museum in Paris, and the CECAM Centre for Contemporary Art in London.\n\n\nThe European Commission has released its proposed legislation that will allow the private sale of digital images and video clips seized by the Italian police and will require the transfer of personal data. The legislation, which has been in the works for several months, was passed by the European Parliament and is expected to be approved by the European Council this week.The legislation will give the police the power to make criminal complaints against individuals suspected of infringing a number of civil liberties. It also requires the police to obtain a court order to search a person’s home or vehicle, and requires internet service providers (ISPs) to retain customer data for two years. While the legislation does not specify what specific personal data should be held by ISPs, it will likely involve some form of data retention scheme.The COPE law is being described by critics as too lenient towards Italy’s police and does not address the criticism that the law will allow the Italian government to circumvent the EU’s General Data Protection Regulation (GDPR),", "The next Biennial should be held in 2022 and the last in 2020. The 2019 edition of the festival, which marked the conclusion of its first year, was cancelled due to the Covid-19 crisis.\n\n\nThe Manchester Art Gallery (MAG) in England—which announced on Tuesday that it is temporarily shuttering because of the coronavirus—is taking steps to mitigate the health risks posed by the novel coronavirus.On Wednesday, the museum revealed that it is preparing to begin phase two rehabilitation, in which it will invest in the care and rehabilitation of the building and its surrounding environment, including the Manchester Art Gallery, the Institute of Contemporary Arts, and the National Maritime Museum. The plan, which will begin with the reopening of the museum in March 2019, will culminate with the reopening of the museum in March 2021.The announcement came via a letter sent to the MCA by the charity Art for Britain, which represents the interests of the institution and its staff. In the letter, which was signed by the Royal Society of Arts and the Tate, as well as the Royal Shakespeare Company, the National Trust, and the Royal Shakespeare Company, the MCA wrote: “We have been made aware that the Manchester Art Gallery is temporarily closed", "The next Biennial should be held in St. Louis in 2021. \n\n\nThe Nassau County Museum of Art in Massachusetts announced today that it received a gift of more than 1,000 works from a private collection that consists of cuneiform tablets, papyrus scrolls, and plaster casts of bronze sculptures dating to the late tenth century B.C. to the museum in September 2019. The gift includes works by artists such as Giovanni Martini, Alessandro Cattelan, and A. M. Moschino, as well as a collection of elaborate pottery vessels dating to the late sixth century B.C. and dating to the early third century C.E. The collection also contains work by Sylvia Mottola, Nina Sze, and Jean-Baptiste-Augustin. Advertisement\n\n\nNassau County Museum of Art director and CEO Jeffrey Rosenblum announced today that Nassau Art Museum curator Matthew Smith will retire after twenty-five years at the helm of the institution, which is currently undergoing a $50 million expansion. During his tenure, Smith has organized sixteen exhibitions and has organized numerous shows dedicated to contemporary art, including “The Art of Painting�", "The next Biennial should be held at the San Francisco Museum of Modern Art in 2020. The announcement of the 2019 edition came as no surprise, as Artsadia’s board announced the inaugural exhibition in the US in February of this year. The event drew more than 4,500 visitors and featured work by ninety artists. This year’s edition will be staged at the Los Angeles County Museum of Art (LACMA), which opened in 2019 and has recently been considered a contender for the 2020 Pulitzer Prize. The inaugural exhibition was organized by artist-worshipper Matt Souther, who is based in New York and was honored by the Lauder Prize for his work in November. The 2019 edition was held at the San Francisco Museum of Art and featured work by fifty-eight artists, including Antony Adams, Alejandra Iannone, Karin Barry, and Marisa Morrison.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it is planning to begin moving works by major American artists such as Edward Hopper, Robert Rauschenberg, and Richard Diebenkorn\u0097a move that will dramatically alter the city’s art ecosystem\u0097from its holdings. Starting", "The next Biennial should be held in the capital city of the Republic of Belarus, Minsk; next year will mark the centenary of the birth of the founder of the Communist Party, the former Soviet leader Leonid Mikhelson.The first edition of the exhibition, titled “The Struggle for the Unity of the Soviet Union” (2013), explored the history of the Communist party and its relationship to the Soviet state. In the second exhibition “The Struggle for Democracy” (2015), an article by Leon Trotsky was shown alongside photographs of Soviet monuments in the capital city of Belarus and of the Red Army in World War II.Other works in the biennial will be the first of a “Collective History of Belarus,” in which Minsk-born artist Marina Sirotová will produce works that will engage with the history of Belarus from the 1917 founding of the state to the present. Her project will also include the first exhibition of work by a contemporary artist in the country.A full list of exhibitors is as follows:*Arts Foundation of Belarus (2016)Arts Centre (2016)Arts Festival (2017)Art Gallery of the South (2017)Art of Life (2017)Art of Life: Contemporary", "The next Biennial should take place in 2020 and will showcase work by fifteen artists selected by a jury comprising Felicity Hammond, Samer ElSohrab, Akram Karimi, and Barnaby J. Henry. The theme of the exhibition will be “The Greater West,” focusing on the idea that the “West is where the future of humanity lies.”The 2019 edition of the biennial, “The Dark Tower,” showcased [Priya] Ramchandani’s work, “The Light,” a series of photographs that depict the solar system as a vast, interconnected network of interconnected glassed chambers populated by humanoid life forms, as well as the two‐dimensional environments in which they are recorded. The exhibition was curated by artist Adam Arkadi, and the biennial is organized by the American artist and curator Anthony Kiedy.\n\n\nThe Regina Art Museum in Winnipeg has received a gift of twenty-eight works by renowned Winnipeg artist Jennifer Stoddart. The works were provided to the institution by the Stoddart Foundation in honour of its eighty-fifth anniversary, which is being celebrated on April 12. The gift includes eighteen new works by Stoddart and her husband, Peter St", "The next Biennial should focus on the practice of photography in all of its forms in a contemporary context, and should include films, video, photography, sculptures, performance, and installation, as well as the “cult of the medium”\u0097a reference to the recent controversy surrounding Damien Hirst’s The B-Side. The Exhibition will take place at the Museum of Contemporary Art, Los Angeles (MoCA). \n\n\nThe Museum of London (MoCA) has launched two new digital platforms to bring the works of a select group of curators, including Lesley-Anne Berrington, Becca Davey, and Karen De Corff, to the museum. The first platform, called “The Audience,” will debut in January 2021 and will provide visitors with a digital experience of the work of the curators, including descriptions of the works, biographical information, and how to get involved. The Audience will be accessible by visiting the museum on its website.The second platform, “The Open House,” will be free to the public for a limited time and will engage with guests before the exhibition of the museum’s first exhibition, “The Audience.” The program will be curated", "The next Biennial should begin as soon as possible, and include the work of all artists represented. We are currently working with a committee comprising Professor Zoya Al-Saadi, artist and director of the exhibition “The Spiritual Life of a Woman” (2019); Dr. Akram Kazim, director of the museum of contemporary art in Baghdad; and artist and scholar Ayman Al-Dulaimi, to make sure that the biennial will be inclusive of all groups, including women and people of color.\n\n\nThe French Ministry of Culture and the National Assembly in Paris have named Helene Berthold, a curator and educator who has served as head of the Institut de la Haute-Marne for the last two years, as the next director of the Berthold Collection. Berthold will be responsible for the care and management of the museum’s holdings of the Getty, the Sargent’s Museum for British Art, and other cultural treasures.Previously, she worked as head of the Bourdin–Parré collection in the northern city of Bordeaux and as head of the following cultural institutions in the capital: the Museum of the National Historical Museum, the museum of the Art of the French Revolution"]