["The next Biennial should be held in 2021 – and that should be the year of British Columbia’s first truly indigenous artist-in-residence. Not far off is the year of the first indigenous TV artist-and, besides, of the first indigenous-produced work. David Lebovitch is the president of the British Columbia Folk Art Museum, and he has made clear that he wants the museum to become the Nordic Model, a sort of national archive of Canadian art. “There are many great ideas in the Biennial, and some of them are revolutionary,” Lebovitch said. “But I think that the most important thing for museums in the future is to consider their place in the landscape and their role in shaping the future.”In an upcoming issue of Artforum, writer R.J. MacFarquharson argues that contemporary art museums are failing the most vulnerable among us: “Why do we insist on buying art that is so pathetically unsuitable for children as well as for the elderly? Why do we continue to put art on display in a place where there is already so much work to be done—at the Nelson-Atkins Museum of Art,", "The next Biennial should take place in early 2021. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, and the Los Angeles County Museum of Art (LACMA) have decided to merge. On January 13, the two institutions will announce that they plan to break apart and begin a new collaborative project, named the Future Foundation, that will focus on envisioning and implementing new ways in which art can be shared and enjoyed.“It is an exciting time to work with MoCA and LACMA, but we believe the Future Foundation will be of great help to both institutions as they continue to expand their collections and new innovative approaches to exhibition design and installation are sought after by museums,” said Karen Boone, the director of MoCA. “We look forward to collaborating with the Future Foundation as it works to redefine how we engage with the museum’s collection, exhibitions, and programs.”The institutions’ announcement follows a February 16 letter from sixty-four art-lovers to the Museum of Contemporary Art (MoCA), which urged the museum to not cancel the upcoming exhibition “The Art of Intersection: Contemporary Art from the 1960s to the Present.” The letter,", "The next Biennial should be on January 22, 2019, and will be organized in collaboration with the local communities of Biennale di Consiglio, Rome, and Galerie de Seilen. The exhibition will be centered around the theme 'Paradoxes of Reproduction: Art in a Time of Reproduction,' and will be curated by the contemporary artist Christina Milano, who is currently working on a new series of paintings and sculptures.“The new project will be a combination of exhibitions and performances that will showcase the work of the new generation from the late twentieth century, and will be organized in a meaningful way,” said Marta Grazielli, president of the Italian institutions. “We are very pleased that the next Biennial will be dedicated to the work of the artists who have given our country and the world a new and original way of sculpturing bodies and minds.The future of the Biennale di Consiglio and Galerie de Seilen lies in the hands of the Biennale di Todi and the Biennale di Marzio, and we look forward to their involvement in shaping the future of the Venice Biennale.”The work of the artists in the", "The next Biennial should take place in 2022 and will focus on the contributions of women and girls to the history of the exhibition. The exhibition will be organized as follows: The exhibition “Born in Hell: A Collection of Women Art” is currently on view in the exhibition “Polaroids of the World” at the Black Rhino in London from November 5–March 22, 2022. The exhibition will be followed by a new paper presented in collaboration with the Italian biographer Gio Ponti and the Swiss artist Holle Eijck (whose work is included in the exhibition “Feminine Theory and the Body”).In a new research project, titled “Towards a Feminist History,” Nell Painter will present a survey of the feminist movements of the twentieth century as they are reflected in the work of contemporary artists, in the works of women artists, and in the work of female artists. Mana Contemporary will present “The Male Gaze: A Feminist Art” at the Seattle Art Museum from March 19–March 21, 2020. The first exhibition will feature work by artists Cara Langham, Anita Agar, Oksana Bacsinska, and Addison Cunningham.", "The next Biennial should be held in 2022–23, when the exhibition will mark the fourteenth anniversary of the success of the first one. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, announced today that it, too, is looking to the future with a new “scientific” exhibition-driven by curator and artist Rosemarie De Onken. Launched in conjunction with the retrospective exhibition “Life in the Digital Age,” which opens on December 7, the show will focus on the intersections of technology and digital life, art, technology and art, art and art, art, art, art, art, art, art, and art. The show, which will also feature artworks by Justine Suissa and Yuki Kondo, will take place at the Los Angeles County Museum of Art (LACMA).“The exhibition is an extension of MoCA’s mission to continue shaping the future through original and thought-provoking projects that reflect the creative principles of the curators, of the curators’ own lives, and of art in general,” said MoCA director Philip Stern. “In addition to the exhibition, we are excited to introduce new programming for our audiences", "The next Biennial should take place in the year 2020. The exhibition will be an extension of the Biennial, which will be relocated to a new venue in the city. The new exhibition will feature work by seventy artists and will be presented by the same curators as the exhibition.\n\n\nA British sculptor has been sentenced to ten years in prison and fined £43,000 for stealing a painting by Jasper Johns. The work, \"The Screaming Image of the Sun,\" is from the American artist’s series “The Sun, the Moon, and the Moon,” a series of compositions that explore the impact of the sun, moon, and planets on our environment and our lives. Both the jury and the judge were impressed by the work’s ability to shift between space and abstract visual structures.“The court was struck by the extent and the complexity of this work,” said David Clark, the lawyer for the artist and the defendant. “By the time it was over, it was impossible to separate the two. The jury was satisfied that the jury saw both sides of the case.”In a statement to the court, he said: “I never intended to harm the artists who created this work.", "The next Biennial should be held in the spring of 2022. In the meantime, the Art Museum Dubai has released new exhibitions that explore the life and work of the late Egyptian artist Naguib Mahfouz, who exhibited his work at the museum in the 1970s and was a notable supporter of the arts. “The future of art is at the core of our mission,” said Annamaria Ruparel, the curator of the exhibition. “Naguib Mahfouz has played a vital role in the museum’s mission to present and explore the African diaspora, and the exhibition series ‘Biennials’ is a reflection of that. We are eager to see how his work and legacy will connect with our exhibitions.”In October 2022, the organization will honor his legacy with an exhibition featuring two of his early works, ‘The Laundress’ and ‘Hindenburg’. The show will be accompanied by a new work, titled ‘Blindspot,” that will be dedicated to Naguib Mahfouz, and will inaugurate the organization’s new exhibition space, “Jupiter,” in the", "The next Biennial should take place at the Palazzo Cruz Boetti in Venice, Italy, in 2021, and the first will be held in the port city of Venice in 2022. The 2019 edition, titled L'Arc-de-Ciel, will be held at the Venice Biennale, which will be moved to the city of Rome for a second edition in 2021 and will be held in 2019.\n\n\nThe Museum of Modern Art (MoMA) in New York has indefinitely postponed its next iteration of the “Mogadishu: A Biennial of Art in Minneapolis” (MMAM 2020) due to concerns over the coronavirus, which has killed at least 183 people in the country. “We are currently assessing the potential outcomes of the ongoing Covid-19 emergency,” the institution said in a statement on Monday. In an attempt to contain the virus, which is spread mainly from person to person through close contact and can only be contracted from animals, the United States confirmed that it will phase out the use of camels in January. The American Civil Liberties Union (ACLU) is now urging states to enact emergency legislation and to extend the deadline for people to avoid infection.The AVMA", "The next Biennial should focus on “the African Diaspora,” according to the Festival. In light of recent events, however, it is unclear whether the exhibition will be held in the African diaspora, or at least not in Africa. The festival will also be held in the United Arab Emirates.\n\n\nThe Chicago Architecture Center (CAC) has appointed Patricia Lynch as its new executive director and chief curator. Lynch comes to the organization from the City Museum of Chicago, where she has served as curator of contemporary art since 2003, and will assume her responsibilities on February 10.“We wanted someone with the kind of background and vision to lead the CAC through this difficult period and the kind of global perspective to help guide the CAC through it,” said CAC director Loring Randolph. “Patricia has demonstrated a remarkable ability over the past five years to organize and execute a number of exceptional exhibitions, and to ensure one of the largest collections of Chicago’s most important artists and institutions, the Jacob Javits Center, in a city where it is rapidly becoming a must-see destination for tourists from around the world.”Prior to joining the CAC in 2014, she worked as a curatorial assistant at", "The next Biennial should take place in 2020 and will be hosted at the Museum of Fine Arts, Boston.\n\n\nThe Greater Reston Arts Center (GRACE) has received a $1 million grant from the National Endowment for the Arts (NEA) to organize a free annual arts event for women in the District of Columbia. The grant, which was announced on Monday, September 21, comes a year after GRACE board member and D.C.-based nonprofit artist and educator Susan Segal helped organize the inaugural exhibition, “Women in Art,” at the Washington, DC–based nonprofit Artscape, which was founded by filmmaker Elizabeth Gilbert and artist Antony John-Williams.“We are thrilled to be able to present the first exhibition devoted entirely to the extraordinary contributions of women artists to our nation’s history,” said GRACE board president Kate Hoberman-Hutchinson. “Itis necessary to recognize that we are only now entering a new phase of our history, one in which we are able to celebrate the contributions of women artists and not only in the '60s but also in the '70s.”Over the past twenty years, a total of sixty artists have been appointed to the event", "The next Biennial should be staged in 2021, and the next three years should be devoted to programming, exhibitions, and research. When asked about the possibility of the festival returning to New York in 2021, the Harvest organizers said that no decision had been made regarding the future of the exhibition. \n\n\nThe Israeli art historian Avital Ronell, who died in Paris in May, has been appointed director of the Centre Pompidou in the city of Paris. She succeeds Yair Hochner, who departed the institution in May after nearly two decades as director and was replaced by the Tunisian Culture Minister, Nima Bulbul, who was appointed deputy director of the institution and has since taken the title of director of the Centre Pompidou.Ronell will be responsible for organising and conducting programming at the Centre Pompidou, which was founded in 2000 by Brigitte Bardot and her husband, Jacques Bardot. She will be responsible for increasing the Centre Pompidou’s international profile and amassing a larger international audience. Ronell is expected to begin her role in July. The Centre Pompidou is one of about a dozen Israeli cultural institutions that were established in the former German state of West", "The next Biennial should be held in 2021.\n\n\nCole Wilkes (1909–1985) is an American painter and sculptor whose work, in several forms, embodies the unique aesthetic and psychological contours of the American Southwest. He is the founder of the New World Foundation in the West, which helps support artists who are in the process of returning to California, and has represented the United States in the Venice and the Venice and the Venice and the Venice and the Venice and the Venice and the Venice and the Venice and the Venice and the Venice and the Venice and the Venice and the Venice and the Art Deco, among other cultures.“Cole Wilkes is one of America’s great living sculptors” American Art and Art History, us’s annual publication, said. “His sculptures, paintings, and prints are as absorbing and psychologically compelling as his drawings and paintings, and their mediums, which often express a more or less intimate understanding of the natural world around them.”Born in Helena, Nevada, on January 1, 1909, in a small town in the middle of the American West, Wilkes studied with Hal Foster in Albuquerque, New Mexico, before moving to the Santa Fe Institute, New", "The next Biennial should be held in Lisbon next year and will be hosted by the Museu de Arte de Lisbon. The theme of the show will be “Art and Culture as Displaced Objects” and will be directed by Rui de Sousa, currently the curator of late-modern art at the Museu de Arte de Lisbon.The biennial will present a selection of work by seventy-five artists, including Giacomo Balla, Domenico Cattelan, Meret Oppenheim, and Michael Brunoni, and will culminate in a performance by the collective The Killing Fields. The show will also feature works by artists such as Thomas Calvert, Yoto Mio, and John De Sousa, and will focus on how art and its visual form may be considered as displaced objects.“This is a moment of great uncertainty for many of us. The biennial will be a living thing, a constant exercise in vision, in the making of new directions and new futures,” said Corina de Souza Lima, artistic director of the Biennale. “It is in our collective interest to support artists in their many endeavors and to shape their work as well as they may. Therefore", "The next Biennial should be held in the spring of 2020. The deadline for the exhibition is May 27, 2020.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has announced that its collection has been acquired by the private, California–based arts organization the David Geffen Foundation, which will now have the responsibility of managing the museum through the 2020 iteration of the David Geffen Memorial Art Walk. As part of the agreement, the collection will be moved to a new home and will no longer be housed within the museum, where it will be managed by the Richard and Lois Geffen Foundation. “The David Geffen Foundation has been a long-standing supporter of the Museum of Contemporary Art in Los Angeles and has been instrumental in developing its collections and programming,” said Mark Goffman, the board chair of the David Geffen Foundation and the director of the Margot Geffen Collection. “This acquisition will allow MoCA to become a more vibrant, innovative, and resilient museum. We are excited to be working with the Margot and the David Geffen Foundation to create new and exciting works for the collection and to encourage the exhibition and production of new work.” David Geffen Foundation president and CEO Victor Schrager added:", "The next Biennial should take place in 2021. Šukas has since said that its plans to rebuild the museum are not yet finalised and that it is still reviewing the site where the art was first located. “It may go into a state of reconstruction,” he told German newspaper Frankfurter Allgemeine Zeitung. “I don’t wish to exaggerate the importance of the work, but it is absolutely vital that the Biennial be reconstructed,” the artist said.The Austrian-born, New York–based architect has designed many of the most important works of modernism, including the Saint-Tropez and the Potsdamer Straße, which were completed in the summer of 1957 and became the first buildings in the former First World War home to enter the public eye. In the latter, a large glass structure adjoins the Biennial’s new installation “The Future of Life” (2019–20).The work was inspired by a conversation between Karl Luescher and Bertram Rydingschlöv, then the head of the Two Rivers Museum of Art in New York, who expressed concerns about the future of the former German", "The next Biennial should be titled “Revolutions in Art,” which will take place in 2020 and will be curated by Paulo Coelho, the curator of contemporary art at the Museu de Arte de São Paulo; Jera Waitzko, the director of the Museu de Arte da São Paulo; and Paulo Ferreira, the director of the Museu de Arte da São Paulo. The exhibition will include the works of 105 artists, including artists working in Brazil, China, South America, and Europe.The event will also include a keynote address by American artist and critic Julian Barnes, who will discuss the future of abstraction and design in the museum’s collection and the importance of the museum’s collection in the history of art. In a statement, the Biennial said: “This year’s edition will be an exploration of both the powerful work of a very large group of artists and the ways in which the museum presents new possibilities for exhibition and research.” The full list of participating artists is as follows:Adelyn Alessandro de AlvearAlessandro CaldasAlessandro de CastroAlessandro de ChávezAlessandro de da RosaA", "The next Biennial should be held in the spring of 2021. The 2023 edition will be staged around the year 2023.“It is our duty to create a dialogue with our audiences, both at home and abroad, to provide them with the meaningful knowledge, skills, and perspectives to identify and reflect upon how we can continue to move the biennial forward,” said Yael Weizman, director of the Grantmaking Center.The biennial will also introduce the technology and means by which the museum can engage with the public. The exhibition will explore the cultural and ecological significance of the Land in a manner that is both collaborative and respectful of the Land. The exhibition will consist of an array of works and installations that are part of the Global South, focusing on the question of how these areas of the world are intersected and interwoven by social, economic, political, and ideological forces.Art historian and curator Richard Langdon, chair of the Phyllis and Regan Langdon Foundation for Contemporary Arts, said: “Art is about to become more crucial to the future of our planet and our people than ever before. The global distribution of art is rapidly changing and our planet is becoming increasingly fragile for the future of life on Earth. The", "The next Biennial should take place in 2021, and the 2026 edition will be held in partnership with the Institute of Contemporary Arts (ICA) in Paris. The 2019 event, which was organized by the Council of Europe and drew some 1,400 artists, was also supported with a $30 million gift from the Belgian government.The biennial will be inaugurated by a public exhibition of work by the 86 artists who have been selected by the Council of Europe for the 2030 edition of the European Biennale. The exhibition will be followed by a lecture series that will highlight the explorations of Hanna Rosalind Halvy, Oskar Eustis, Kiki Smith, Yinka Shonibare, and Ann-Marie Walker. The 2020 edition will feature works by artists looking to the future, young contemporary artists, and select works from the last two years of the world’s biennial.“The Biennale of London reflects a new way of looking at the world, one that is authentic and forward thinking,” said Khaled Abou-Rahme, artistic director of the Biennale. “By connecting contemporary art and philosophy with the arts and culture of the future, the show presents a chance to reimagine", "The next Biennial should be a comprehensive reflection of the history of modern art.  “Alexa’s new Vision for the Future will address the history of art in our contemporary world, and its future as a vital tool for social change,” said Sarah Dessen, director of the National Museum of American Art. Previously the curator of modern art at the Museum of Modern Art, Dessen curated twenty-three exhibitions at the Smithsonian American Art Museum in Washington, DC, and is a member of the curatorial team that developed the exhibition “Sharon M. Hunt: The Modern Bursar” (2017–18).\n\n\nThe Luhansk Biennial of Contemporary Art (LBU) has announced that it is planning to present a new edition of the exhibition, “Art and the Luhansk Empire,” at the Artsaz, a former cattle factory in the industrial city of Luhansk, on February 16–February 19. The twenty-fifth edition of the exhibition will be hosted by the cultural institution, which has hosted the exhibition since 2014, and will be organized in collaboration with the Artsaz. However, due to the ongoing conflict in eastern Ukraine and the authorities’ refusal to allow the exhibition to", "The next Biennial should be held in 2021. The thirty-nine-year-old art museum, which is located near the city of New York, announced the move in January 2019. The move sparked outrage from the art world community and prompted the New Arts Alliance to launch a petition, signed by more than 2,500 people, demanding that the museum cancel the exhibition and reconsider its exhibition format. The petition argued that the move would negatively affect the institution’s future programming and called for the show to be moved. In response, the museum clarified that it was “not’s intention to leave the exhibition and would have no further involvement with the program.” The museum also said that it has already retained the rights to the exhibition in perpetuity, along with any proceeds from selling or rentals of the work. “We have indeed retained the rights to the work, and we have already retained the right to rent the work for a period of thirty years,” Michael Sirota, the chief marketing officer at the museum, told the Art Newspaper. “The question is, what happens to the work if we don’t exhibit it, and if we don’t present it, and if we don", "The next Biennial should take place in 2020. The Museum of Contemporary Art San Francisco has commissioned artist Scott Tobias to create the theme for its upcoming edition, which will be held in the former Stock Exchange building on the city’s waterfront. The first edition of the annual event, titled A Future to Believe In (2019), explored the idea of the self and the role of art in promoting social change.  Tobias will create an abstract abstract and human-scale installation for the show. The installation will consist of twelve pieces, spanning five decades of Tobias’s career, such as Tobias 2000, 2008, 2011, and 2012, where the artist participated in the first major public engagement with the city. The works will be on display in the exhibition “After the Fall,” which is slated to open in October 2020.\n\n\nArt historian, scholar, and curator Hernán Díaz Ferrer, a tireless advocate for the authenticity of art through original research and self-directed scholarship, died on November 30 at the age of eighty-seven. He was justifiably celebrated for his persistent and uncompromising work as a historian of art and his commitment to the study of", "The next Biennial should take place in the city in 2021.”The initiative, which was initiated by the City of Los Angeles in 2005, has faced strong opposition from many cultural groups, including those from the Los Angeles County Museum of Art and the San Diego Museum of Art, and has been repeatedly thwarted by the California Coastal Commission and state lawmakers.\n\n\nThe Metropolitan Museum of Art in New York has added two more works by Kiki Smith to its collection, marking the fourth and fifth installments of the artist’s multi-decade career, which spanned from her first exhibition at the museum in 1967 to her last, “Lollipop: The Paris Diaries,” at the Met in 1988. The works, which will join the objects in the museum’s collection that have previously appeared in Smith’s works, are the work Departamento Latina, 1967, and “One Piece,” 1987, which both explored social experimentation and the notion of art as a “social experiment.”The Met previously announced plans to open an exhibition of Smith’s works in the new year. The announcement coincides with the opening of a new documentary film, “Kiki Smith: A Very", "The next Biennial should be held in 2020. [Update: March 3, 10:00 AM] The 20th Venice Biennale will be held in 2021.  Update: March 3, 10:00 AM] The Venice Architecture Biennale, which was originally scheduled for February 2019, has been postponed to February 2021. The event, which was originally meant to take place in March, has been rescheduled for March 22–March 26. A new edition of the Venice Architecture Biennale will now take place in May 2021. Source: The Guardian (March 2, 2019) Artnews (March 3, 2019) Artforum (March 3, 2019) [Update: March 3, 10:00 AM] Pacex 20 is no longer accepting invitations to participate in future editions of the annual art fair. In a statement, the fair said that it is exploring all of its options. [Update: March 3, 10:00 AM] Artnews (March 3, 2019) Artforum (March 3, 2019) This year’s Venice Art Week was marred by an unprecedented number of incidents and injuries, both physical and mental. For the people of", "The next Biennial should be held in 2022. *\n\n\n\n\n\nSinger-songwriter and activist T.J. Delahanty, a longtime activist for LGBT issues in the United States, was found dead in his home on Monday, March 13, at his home in the small town of Winder, North Carolina, on the border of Greensboro and Wilmington, North Carolina, at approximately 3 PM. His death was ruled a suicide.Born in 1972 in Greensboro, North Carolina, Delahanty studied at the University of Central Oklahoma before moving to New York, where he met and married his partner of twenty-nine years, T.J. Delahanty, with whom Delahanty had been together for thirteen years. Together they have five children, Vincent, Jenna, Jonathan, and Harry. They married in 1993 in New York and have two other children. Delahanty’s work encompasses poetry, performance, photographs, video games, theatrical productions, and video games as well as his solo shows at the W.A.S.K. Theater in Saint Paul, Minnesota; the Exposition Series in New York; and the Brooklyn-based nonprofit Stonewall Bisexual Arts Center in New York. His most recent retrospective,", "The next Biennial should begin in June, with an opening reception in July. The 2019 edition, titled The Unseen, was held at the Arts Assembly in Lisbon and was presented by artist-run nonprofit organization the Creative Alliance.The show, which comprises twelve paintings, five sculptures, and four performances, will also include two films, a book, and a performance. The exhibition will be titled Between Two Worlds, a collaboration with artist Olafur Eliasson and will run for ten weeks. The exhibition will return to Berlin in April 2020.Other works on display in the show will include Anna Atkins’s Wise Men: Avant-Garde Painting in the Modern World, which was made in 1954, and the work theater of the artist’s Los Angeles residence, 1992, which was created in 1989. Among the works on display are Javier Bueno’s Anachronism: Painting in the Modern World, 1965, which was created in 1958, and Nelson Brontë’s The Witch and the Hundredth, 1959. The artist’s latest exhibition, “The Witch and the Hundredth: Painting in the Modern World II,” will be on", "The next Biennial should be ready for exhibition by the end of the year.The following months will determine whether the Biennials can last.Sara Tew/Gallery FrameworksSince the museum’s initial campaign for the 2020 biennial was launched by artist-activists in February 2019, the event has faced many obstacles and suffered from delays. Artforum in March 2019 published an article highlighting the challenges facing the event. In addition to the codevelopers, several actors are involved in the running of the museum, including the curators, artists, and staff. When the 2020 edition of the exhibition opens on October 29, the Biennials’ board of directors said that it expects the event to draw an additional 3 million visitors.\n\n\n\n\n\n\nThe Camden Sculpture Park in North London has received a £2 million donation from the British Museum, which was asked to return 2,500 artworks by artists such as William Kentridge and Stella Creasy. The museum’s director, Maria Balshaw, said: “I’m delighted that the British Museum has agreed to return these works to the artists whose works have been lost or damaged because of the Covid-19 pandemic.", "The next Biennial should focus on a film by Daniel Libeskind, which is currently on display in the exhibition “Frontier: The Life and Art (2018),” formed by Natalie Glaze and Will Shatner at the London Biennial of Art, and its post-film, “An Affair of the Eye,” in 2019. The selection committee will decide on the themes for the 2019 edition of “Tours of Jerusalem” on September 25.\n\n\nThe Museum of Egyptian Art (MCA) in Cairo has appointed Luxor-based artist, curator, and curator Ahmed al-Qasimi as its new artistic director. He will take up the post on September 1.“I’m excited by the prospect of leading the MCA through this difficult new phase,” al-Qasimi said in a statement. “The past eighteen months have been a great success for the institution, particularly with regard to its spectacular reopening in March and the reconstruction of its Egyptian exhibition hall. As I’m sure you know, the MCA is full of talented people and we work hard to find new ways to engage people in the art and architecture of the Middle East through exhibitions", "The next Biennial should be held in 2020.\n\n\nThe European commission has released a series of guidelines for museums and academic institutions across the EU that will allow them to better protect the collections and intellectual properties of their cultural heritage sites. The guidelines were developed after the biennial Viva Palestina, which was staged in the Italian city of Palermo in 2017, and the 2017 edition of Tre Triennale di Venezia, which was staged in the Italian city of Venice.In the new guidelines, the commission states that “a maximum of five staff members should be responsible for managing the collections and the protection of a single exhibition space.” It also states that “the museum has to be able to demonstrate that it has the capacity to cope with the future needs of visitors and staff.”The commission also recommends that the institutions adopt “robust management systems that support the collection and protection of the cultural assets of the institutions.”The guidelines are divided into five sections: 1. Managing the collections and the protection of the cultural heritage of the institution. 2. Managing the collection and the protection of collections and the administrative archives of the museum. 3. Three specific types of exhibitions: exhibitions, performances, and “", "The next Biennial should take place in 2021, with the winner selected by an international jury comprising artists, curators, artists, journalists, and academics. The jury will consist of, among others, Ming Xi, director of the Biennial of China, Shanghai; Xu Erling, director of the Museum of Contemporary Art, New York; and Ralph Karon, director of the Museum of Contemporary Art, Los Angeles.“We are thrilled that this year’s Biennial will have the opportunity to present the next great Asian exhibition,” said Paul Mpagi Sepuya and Deborah Sattler, who created the first original works by contemporary Asian artists in Los Angeles in 1998. The jury will be comprised of senior curator and curator of Asian art and architecture, Bruno Palma De’Souza, director of Palomar Ranch; artistic director Arne Glimcher, director of the Venice Biennale; film editor and director Leonor Antunes, a curator at the Los Angeles County Museum of Art; and artist and curator Quan Wen, whose work is currently on display at the Keller Institute for Contemporary Art. \n\nA new exhibition at the Museum of Contemporary Art (MoCA) in Los Angeles is facing backlash from critics", "The next Biennial should be held in 2020 and will be about seventy thousand square feet.  Art historian Richard Shand said: “The Prince is one of the most significant exhibitions to be staged in the city of London for centuries and its curator, Bridget Riley, has been instrumental in introducing the exhibition to new audiences across the world. ”\n\n\nThe Maria Balshaw Foundation announced today that, in honor of its twenty-fifth anniversary, it will hold its next event, “The Gift of the Sea,” on October 21, 2021, at the Elizabeth Bridge. The event will be curated by Martha McSweeney, who will introduce the project and will present a selection of work by artists including Mark di Suvero, David Kline, and Alice Aycock.“Maria Balshaw’s building of a new narrative around the sea began with the question: What is the miracle of the sea—a question that has led to many transformative endeavors, from the monumental reconstructions of the US.S.S. Missouri and New York to the multimillion-dollar restoration of the Venice Biennale,” said curator and founder of the foundation, Mary Balshaw. “The foundation has had", "The next Biennial should include an exhibition focusing on the state of Black Consciousness\u0097what it means to be Black in America today\u0097and an exploration of the meaning of art through the life and legacy of Afro-American artist Clara Rainer.“I want to be particularly sensitive to the work of Black women artists and understand their pain and their power as an entire community,” Baroness Moore, the chair of the council, said. “We are so busy competing with each other and with ourselves, we forget our histories and our own histories. It is about time we remember them.”The 2019 Dāmān Art Biennial will showcase work by twenty-eight artists, including Abby Agyeman, Allen Mogg, Chad Griffin, Chad Smith, Doris Smith, Dorothea Rockburne, Evan Owens, Elizabeth Peyton, Frank O’Hara, Harmen Goodman, Julia Jane, Minga Arsht, Minga Johnson, Minga Mathews, Minga Olmi, Minga Sarr, Nia Wong, Nina Z.", "The next Biennial should be held in 2022. All of these dates are within a year of each other. While the Olympics will be held in Seoul from August 5 to August 8, 2022 will be the first time the South Korean artists will participate in an international exhibition in the country. The new venue will also be located in a historical district in Seoul, and will be inaugurated by the South Korean president Park Geun Hye, who is in the process of recovering from a serious concussion suffered in the 2016 Rio de Janeiro Games. The building will be inaugurated by Park Soo Hyun, who in turn will receive the biennial’s first prize. The prize ceremony, which will take place on August 17, will take place at the National Museum of Contemporary Arts, Seoul, and will run for ten days.\n\n\nThe Museum of Fine Arts (MA) in New York has released the list of twenty-four artists whose works will be included in the upcoming exhibition “Art from the New Arab World,” which will run from February 12–March 4, 2020. Titled “Egyptian Modernism” and curated by Andrea Giddens, the show will feature work by fifty-six artists from", "The next Biennial should take place in 2019.\n\n\nArt historian Janette Laverrière is suing her former employer, the French Ministry of Culture, for copyright infringement by presenting a plausible case for the museum’s collaboration with the US-based biotechnology firm Monsanto. In a lawsuit filed on July 29 in the French Court of Cassation, the English-language publication The Guardian reports that Laverrière alleges that the institution collaborated with Monsanto by incorporating elements from Monsanto products into its exhibitions and programs. Laverrière argues that the ministry framed a conflict of interest by allowing Monsanto to represent itself as a cleaner alternative to the company that avoids the environmental risks associated with the biotechnology industry.While the ministry briefly suspended the annual exhibition “Monsanto Science,” which was staged in 2017, according to Laverrière, in protest of the biotechnology industry, it has since been restored and will go on as planned. Since the trial is expected to last three weeks, the Guardian reports that the court is expecting to award the plaintiff a verdict in the next few weeks.\n\n\nThe Metropolitan Museum of Art in New York has appointed Laura Lamone, who currently serves as the director of", "The next Biennial should take place in the spring of 2021. The first edition, held in 2019, was extraordinarily successful. It was nominated for a Pulitzer, for its coverage of the Paris COP21, and for its exhibition “Contemporary Art” (2019). The 2019 edition included the exhibition “Matisse & Picasso” (the first of two; the second was held in the fall of 2020), “Hammock Mather” (2019), and “Angel Grito” (2019).The 2020 Biennial will be held at the Fashion Institute of Chicago (FIAC), which is currently undergoing a $50 million expansion project; the American Ballet Theater (ABT); and the Dix–Wang Center for Contemporary Art (DWCCA). “The Dix–Wang Center for Contemporary Art is an exciting project that has been in the works for more than two years, and has received a tremendous amount of support from local, state, and federal government officials,” said the Museum’s director, Michael Rosenfeld. “The initiatives that have been launched to support the Dix–Wang Center for Contemporary Art are very promising and represent a large step forward", "The next Biennial should be held in 2021 on the fifth floor of the Museum of Contemporary Art, Los Angeles. The contest was established in 1991 by the American Contemporary Art Foundation (ACAF), as a way for young curators to earn a residency at the museum. The competition invited forty galleries to present their works for a jury\u0097which was made up of Alfredo and Agostino Zingaretti, director of the Biennale of New York; Alfredo and Agostino Pérez, the president of ACAF; Harald Szeemann, the director of the Museum of Contemporary Art, London; and Harold Vogels, the director of the Museum of Contemporary Art, Los Angeles.In a letter addressed to the judges, Pérez wrote: “The current exhibition ‘Frontier Live’’ is a great example of the artistic process in action. It contains original, significant works, as well as carefully selected, often experimental, works that are both playful and elegiac. It also incorporates new technological advances in the art world and new media in a way that is new and exciting. This is a unique time in the history of contemporary art, and it is planned that the exhibition will take a new and", "The next Biennial should be held at least two years after the fall semester of the 2020–21 school year. The exhibition “inaugurates the project of the Biennial, of the development of our place in the world, of the possibilities of our art and our collaboration with the world.”The publication of the twenty-fifth Biennial edition, “The Waking Dream,” will take place at the Museum of Contemporary Art (MoCA), New York, on March 19–March 21, 2020. The exhibition will highlight works by twenty-four artists whose imaginations and potential are at the center of new creative movements. Among the artists chosen for the exhibition are Diana Castillo, Dario Catellani, Naima J. M. Akbayan, Joel Pettway, and Kiki Smith.\n\n\nThe twenty-fifth edition of the Venice Biennale, titled “The Unseen,” will be held at the Museo ASUS in Venice from May 13 to May 20, 2020. The event, which is also known as the Venice Art Biennale, was established in 2009 as the first major international event devoted to new art created in the city, Italy. The exhibition will preview", "The next Biennial should focus on the concept of culture, ‘in the service of the community,’ and on how the collection and presentation of art forms can be transformed through the exercise of creative and artistic energies. The exhibition ’s next edition will be held at the Dubai Art Museum (DAM), where it will open on September 14.\n\n\nThe Museum of Modern Art (MoMA) in New York has hired Jodi Throckmorton, a curator and academic who has spent the last decade researching and writing about European art, as its next curator. Throckmorton will be responsible for overseeing the collection and presentation of works at the institution’s existing collection, which consists of more than 1,500 works, including works by the Paris-based artist Kamel Musa and works by artists who are currently in the process of moving to other cities, and will take up the position on September 10.“It’s an exciting time for art and the museum,” Throckmorton told the Art Newspaper. “I’m excited to be responsible for shaping MoMA’s collection and presenting the most important artists’ art-histories, and to further expand the museum’s", "The next Biennial should feature work by ten new artists, including the Tunisian artist Hamyd El Masraei, the Yemen-born artist Hisham al-Qasimi, and the California-born and Berlin-based artist Olu Olu; and the first biennial since the festival in 1997 to feature a woman artist. \n\n\nThe Metropolitan Museum of Art (MoA), the Museum of Modern Art (MoM), and the Whitney Museum of American Art are among the major institutions that announced today that they are shutting down their physical spaces in an attempt to reduce the environmental impact from industrial production and are planning to hold auctions to promote conservation practices. The four museums are part of the larger plan to phase out fossil fuels and fight climate change, which was developed in partnership with the City of New York, the State of New York, and the Environmental Protection Agency (EPA), and was released on Thursday.“As we work to adapt to rapidly changing environments and address the climate crisis, it is important that museums remain organized and functional in order to continue to engage audiences, learn from one another, and provide a platform for the continued public benefit,” said Scott Mullen, the director and chief curator of MoA. The institution will begin", "The next Biennial should focus on “Intersection,” an exhibition that will be curated by Sharon Osler, based on a previous show, “Cooler Heads,” at the Museum of Contemporary Art Chicago.The next edition of the Biennial will be held at the Governor’s Palace in Riyadh, Saudi Arabia, in March 2021.\n\n\nThe New Museum in New York is planning to remodel and expand its campus in the city’s Chinatown neighborhood with a $750 million renovation and expansion. The plan involves the construction of a new $4.7 million exhibition hall, designed by the New Museum’s architecture firm, and the addition of 315,000 square feet of gallery space. The project will also introduce a new teaching and research center, the new space for associate professor and director Naima J. Keith, and the expansion of the museum’s existing public realm.“This is a transformative project for New Museum, and we are eager to share it with our community,” said museum director Daniel H. Weiss. “This is a project that will open new worlds and challenge existing notions about how we engage with the world and create for future generations.” The project is part of", "The next Biennial should take place at the Josuwa Museum in Hakodate, Japan, in 2021.  The next annual will take place at the Omi Theater in Nagoya, Japan, in 2022. The next edition will be held at the Mitsui Museum in Kyoto, Japan, in 2022.The next edition of the Kōdō Taiko (Kōdō Prefectural Museum of Art) will be held in Hiroshima in 2022.  Next year, the 2020 edition will also be staged in Hiroshima and will be celebrated at the Hiroshima Museum of Art. The 2020 exhibition “Kōdō tokubutsu” will also celebrate its fiftieth anniversary. The 2020 exhibition “Nihon Hōdō Jidō” will be held at the National Museum of Fine Arts in Tokyo, and Nihon Nippon Art Museum in Nagoya, and will be held November 24–December 3. The 2020 exhibition “Tokyo Nippon Museum” will be held at the Tate Modern in London and will open on November 24 and November 26. The 2020 edition of the Kōdō Taiko will be held", "The next Biennial should take place in 2020, and in the meantime, the museum has created a special exhibition of work by contemporary artists. According to the New York Times, once the museum reopened in the summer of 2021, the gallery will exhibit a new exhibition of the same year’s work. The first show will be “Painted in the Mood: Art and Painting in the ‘70s’s.”\n\n\nThe National Gallery in London has appointed Ged King, who has helmed the institution since 1993, as its next director. King succeeds Mark Haddon, who was appointed director of the National Galleries of Scotland in April, and will take up the post on May 18.“Ged has been an outstanding chair of the National Gallery for more than twenty years and has been instrumental in expanding the gallery’s historical and contemporary presence in ways that have made it a defining cultural institution in the city of London,” said National Garden director Nina Higgs. “I’m looking forward to his leadership role in making the National Gallery as vibrant and compelling a place as possible, while remaining true to the mission of the institution.”King joins the National Gallery after completing a ten-year term", "The next Biennial should take place in the autumn of 2021. The first iteration was held in the spring of 2018.The project was initiated by artist-witness Yoko Ono and the Japanese art historian and scholar Akio Matsui. In the exhibition “Photosynthesis” (2018), Ono and Matsui explored the art of photography in the context of the history of photography. The exhibition was supported by the K. M. University Museum of Art in Tokyo.\n\n\nThe British artist David Hockney, who sculpts beautiful landscapes so compellingly alive with life and color, has died at age seventy-two. Born in Bristol, England, in 1939, Hockney studied at the Royal Academy of Arts in London before receiving a commission from John Constable. In 1960, he began working in the art world, first by association and later by arrangement. He is now best known for his unique riddles, often involving photographs, that are, at once, playful and enigmatic, and often evoke the ideas of the surrealist.Featuring in the exhibition “David Hockney: Photographs” (2018), at the British Museum, which opened in London on October 4, and “David Hockney: The Warhol", "The next Biennial should take place in 2021. \n\n\nIn an interview with the London Book Fair this week, Australian writer and curator Graham Knyper, who is best known for his critically acclaimed and archival work, The Glorious Gipsy: Australia in the Years 1815–1866, has won the Turner Prize. The twenty-nine-year-old Australian, whose work focuses on the history of the Australian aborigines, was nominated by the Australian writer and curator Harriet Jacoby for the $50,000 prize.In the same year, Knyper published The Mysterious Tribe: Aboriginal New Zealand, an account of his travels to the Pacific island nations of New Zealand and Samoa to trace the ancient origins of his eponymous tribe. Since its publication, the book has gone on to become a best-seller. It is also currently a selection from the annual Turner Prize, which will be presented at the 40th Venice Biennale in 2021. Knyper’s story is told in paintings and sculptures made in his native New South Wales. The artist—who is one of the first Australians to be granted a visa, in 1886—reimagined the ancient landscape of New South Wales in", "The next Biennial should be held in 2022.\n\n\nThe Spanish government has unveiled a five-year, $1.3 billion plan to upgrade the country's crumbling infrastructure. The program will aim to create more than 2.5 million square feet of indoor space and 1.35 million square feet of outdoor space in Madrid and will include the construction of thirty-nine miles of roads, twenty-seven miles of public art, and the renovation of the city’s sewage system.The plan is funded by a combination of taxes and fees collected by Madrid’s transportation and utilities companies, which are expected to generate around $247 million. The transportation sector accounts for around eight percent of Spain’s total economy, and the government is hoping the funds will be used to widen the city’s existing network of interconnecting railways and to build new tunnels and lines.The program will also dedicate $124 million to improving water and wastewater systems, $72 million for cultural sites, and $52 million to improving the wider environment. A new cultural center, the National Museum of Contemporary Art, will be built in the city and will be inaugurated in 2020. The museum will house approximately three hundred thousand objects from the artist’s studio and archives,", "The next Biennial should be up and running by the end of the year and will showcase the work of seventy artists across twenty-three countries. “The biennial is a platform for artists to connect, to engage, and to collaborate,” said David Lebovitz, chair of the biennial’s board. “We look forward to seeing the exhibition space through which the artists will deliver their work to their audiences, and to collaborating with their communities in New York, London, and Seoul.”\n\n\nThe Tate is planning to shutter twenty-four galleries this summer in an attempt to reduce the number of exhibitions it participates in, in an attempt to save the arts organization more than $1 million a year. Titled “Tate,” the initiative was launched to “save” the British Museum, the National Galleries of Scotland, and the Tate’s own London outpost, which were all forced to close due to concerns over the Covid-19 pandemic. In a letter dated May 3, the Tate’s director Maria Balshaw wrote: “I cannot overstate the importance of these venues for our organisations. They have sustained us through this crisis: they have survived the", "The next Biennial should be held in 2021. The 2019 event, “Celesai,” was held at the Center for Contemporary Art (CCA) in Budapest. The exhibition was a collaboration between artists from all over the world and featured work by Nirvanus J. Hahn, Fumihiko Ito, and Nino M. Iglesias. The 2020 event, “Celesai II: Anecdotes,” will be a combination of interviews, performances, screenings, and installations. The show will kick off with an artist retreat at the Museum of Fine Arts in Lisbon, where the first event took place last year. On its website, the festival said: “Celesai II*: Anecdotes,” which was organized by the Center for Contemporary Art in Budapest, was originally declared “unfinished” by the organizers. However, it was reorganized to include the first quarter of the project due to the exhibition in January 2020. The other half of the event will be held at the Fotografiska in Oslo in March 2020, and the third portion of the event will be held at the Fjolfsborg in March", "The next Biennial should be held in December 2020. The institution plans to create a new platform for the show, which will be hosted by the curator of contemporary art, and will launch an online version of the event. The first edition of the Biennial was held in May 2019.\n\n\nThe Art Newspaper in New York has revealed that the forty-fifth edition of the New Museum in New York will go online on April 9, 2020, and will be hosted by curator and educator Bruce Boudreau. The show will feature works by forty-five contemporary artists, including Damien Hirst, Damien Hirst & Partners, John Akomfrah, Mark Di Suvero, Jean-Michel Basquiat, and Josef Koudelka, and will draw from the collections of the Museum of Modern Art, the Metropolitan Museum of Art, and the Whitney Museum of American Art.The full list of participating artists is as follows:* Artforum’s preview preview: The Deuce, 2019, with Jonathan Capehart, Peter Schaar, and Pierre Steidl. The exhibition opened at the Museum of Modern Art in New York on September 28, 2019.At the time of its opening, Bruce Boudreau said: “The", "The next Biennial should be held at least once in each of the next two years—the redesigned site will cost about $40 million and will inaugurate the new iteration of the exhibition, which will highlight the work of emerging and established artists, with a focus on the United States. The Biennial will also give the public a new opportunity to see work from the exhibition.“We have spent the last twelve years crafting a new platform for symposia at the Museum of Modern Art, in partnership with the artists, and we hope it will be transformative for the biennial experience,” Frank de Cardenas, director of the Biennial, told the Art Newspaper. When asked what the future holds for the biennial, Cardenas replied: “It’s a great honor to stand alongside some of the most distinguished artists of our time, and to present one of their works for the first time. I’m looking forward to working with you and your team, and to working with all of you.”\n\n\nThe Museum of Arts and Design (MAD) in New York has received a $7 million donation from the Doris Duke Charitable Foundation. The funds will go towards reconstruction and renovation of", "The next Biennial should take place in the spring of 2020. Currently in the process of organizing, Fulcrum will put out a call for ideas for a pavilion. “This is an unprecedented crisis for art and culture,” said Fulcrum president and CEO David McAllister. “We are working with an unprecedented number of institutions, from the University of the Arts to the Air and Space Museum, to the Lawrence Art Museum, to the Museum of London, to twelve museums, including the Metropolitan Museum of Art and the National Gallery, to come together to reflect and reimagine our world. We are in the process of identifying artists and architects to represent the South Coast of Australia at the 2020 edition.” \n\n\n\n\n\nAllie Campbell, a Green, Brooklyn-based, artist, curator, and educator, is suing New York City to secure that the Christopher-James dual-carriageway (DCC), a park near Gramercy Park and the Brooklyn Navy Yard that serves as the city’s primary public gathering place, will remain closed until the end of June. In a lawsuit filed on January 7, Allie claims the city is illegally restricting the artistic freedom", "The next Biennial should take place in the fall of 2020. The selection committee will discuss the biennial in a meeting that will be held at the FEN, Brussels, on Saturday, March 6. The exhibition will feature twenty-four works by forty-eight artists, including Dusan Mody, Huygens, Piet Mondrian, and Neuer Galerie Bibliothèques, and will run for fifteen weeks.The biennial is hosted in partnership with the Flemish Federal Association of the Arts. The biennial will be organized as an exhibition, a symposium, and a concert series. The biennial will start on March 15 and conclude March 17. The next edition will be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has released new guidelines on how to deal with protesters who have blocked entrances at the institution in an attempt to prevent visitors from accessing the museum. The document, which outlines steps that activists can take to exert pressure on museum employees, was released on March 3.The document states that protesters should have remained within designated time frames and provide documentation that proves their intent to stop visitors from entering the institution—although it says that protesters should have provided visual evidence that they", "The next Biennial should be held somewhere in the city. “The city is more than a thousand years old and has always been an integral part of the city,” said Yuki Tange, the president of the Biennale Fondazione Dallù. “We have a responsibility to preserve the city for future generations and I am sure that we will.”\n\n\nOn Thursday, the Italian cultural ministry announced it is planning to award more than $1 billion in subsidies to the art and design sectors in the country, which is hoping to raise $130 billion in the next few years. The funding is divided between the Ministry of Culture, the Secretari di Stampa and the Ministry of Education. It aims to prevent the country from going bankrupt and to help companies and small and medium-size arts institutions stay afloat during the economic malaise.“The future of art and culture is at stake,” said Italian culture minister Maria Elena Cintoli. “Italy’s artistic and cultural heritage is at the heart of the world, and the future of a healthy and vibrant Italy lies not only with Italy but with the entire world.”The government hopes the arts and design sector will", "The next Biennial should present a selection of works that examine the boundaries of spectacle and the visual arts in a global context and should incorporate performances, performances, performances, performances, performances, and collections. The biennial will be a collaborative undertaking that combines artmaking, activism, education, and research to engage the diverse communities and environments that inhabit our planet. “We have not envisaged a future in which the experiences and ideas of our present and future generations are lost, but we can and must do what we can to help them through this new and challenging reality,” said Korotayeva. “The biennial was born from the desire to create a platform for reflecting and analysing the global art world landscape, which is still in transition. By combining research, artmaking, and activism, we hope to create a new kind of platform for the discussion and discussion of art, and of artmaking in general.”\n\n\nThe Museum of Contemporary Art (MoCA), San Francisco has launched a new initiative to help artists who are struggling financially due to the Covid-19 pandemic. Called the Artist Relief Fund, the initiative will provide financial assistance to creative workers who need it most, including home-based artists, artists who are", "The next Biennial should be held in January 2021. \n\n\nThe Albanian Contemporary Art Museum in Athens (ADAM) has appointed Reza Ghani as its next managing director. Ghani comes to ADAM from the Cultural Center of the University of Denver, where he has served as its curator of contemporary art since 2016. He succeeds Marko Mihaljevic, who has been director of the institution for more than twenty years.Mihaljevic mainly directed the museum of modern art, but he also oversaw the exhibition and research program of the al-Azhar Islamic University in Cairo, the development of the literacy center in Alte Islamia, and the construction of the new museum in Albright-Parsons.Ghani previously served as the director of the Contemporary Arts Museum, in Bergen, New Jersey, from 2003 to 2009. He also worked as a curator at the Flemish Museum in Oslo for several years, and held various curatorial roles at the Museo de Arte Contemporáneo Nacional in Madrid. He was the director of the Museo de Arte Contemporáneo Dúbívan from 2007 to 2009.“I wanted someone highly experienced in", "The next Biennial should be held in the fall of 2022.The next edition of the International will take place in September 2022.\n\n\nThe Fine Arts Museums in London and the Scottish city of Aberdeen have launched initiatives to redress the balance of power between art and culture. The Museum of Modern Art (MoMA) and the National Portrait Gallery, in London, announced that they are working together to establish a new fund that will support curatorial projects that address the needs of the museum and the city. The initiative’s board consists of Alexis Hufkens, director of the National Portrait Gallery; Catherine Hsu, chief executive of MoMA; and Heather Brooke, director of the National Galleries.“The museum will sponsor a number of curatorial projects over the next twelve months, including a series of collages inspired by contemporary art by two young artists from the West Indies, Bagnall Graham and Tino Sehgal, and a project, ‘Talking About My Life,’ that will examine the history of contemporary art from a queer, feminist, and anti-racist perspective,” said Brooke. “Together we will look to meet a future where art and art-making is central to the lives and well", "The next Biennial should be held in the United States and the future of America’s borders should be decided by how many people participate in the event and not by the borders themselves. The United States is already heavily reliant on immigration for its economic well-being and with the upcoming elections set to take place in November, the biennial is an issue that cannot be ignored.\n\n\nThe New Museum in the City of New York has received a gift of forty-two works by artist George Michael. The works were donated by artist and collector Richard Fung, who recently embarked on a campaign to raise $100 million for the museum. Fung, who collected Michael’s works in the United States since 1987, has raised nearly $110 million in support of the museum, which is currently closed in honor of the pandemic.Fung told the Art Newspaper that the donations would be used to build the new museum’s collection of Michael’s art and to develop programs for its collection. The museum is currently working to secure a permanent home for the collection. According to its website, the museum holds twenty-seven works by Michael, including his fourteenth and last studio album “The Colour and the Shape” (1994), his first solo", "The next Biennial should be on October 20.\n\nThe Art Newspaper, one of the largest and most popular art magazines in India, has announced that it will move the twenty-third edition of the Milan Biennale from the city of Milan to Bangalore. The news follows a $1 million cost overrun on the exhibition; a change of venue for the 2019 edition, which will be held at the special exhibition space the Art Gallery of Modern Art; and the cancellation of a show by the British artist Marina Hyde.Dubbed 'Dubai, Mumbai, and London: Events in Contemporary Art” and running November 5 to November 7, the event will be hosted by Memorial Hall in downtown Dubai. The sixteenth edition of the event will take place in the Al Nasr neighborhood of the city from December 15 to December 18.“The event will be an unprecedented combination of worlds,” said editor-in-chief Aditya Ghosh. “The entire event, from the opening of the Biennale show in Al Nasr to the closing of the exhibition, will be made accessible to the public. The exhibition will be integrated seamlessly into the Dubai International calendar, which will offer visitors a virtual experience of the theme,", "The next Biennial should be held in the spring of 2022, with the first exhibition being “The Conceptualization of Light,” a catalog of new works from the exhibition series “The Future Is Present.” The exhibit will be curated by Bianca Delvalle, who has worked at the exhibition for almost three years and has curated the “Roman Biennial” (2016–17) and “Adriana Varejina” (2019–20) and will feature works by more than seventy artists.\n\n\nHolly Delaunay, who served as artistic director of the Parrish Art Museum in Long Island City, New York, has announced her retirement from the institution after a decade as director, effective June 30. Since her departure, she has helmed the Parrish through a number of iterations, including as the center’s permanent collection arm and as its exhibitions arm. She is also the author of several books, including Art and the Conceptual, Art and the Limit, and Art and Time.“Holly’s contributions to the Parrish have been numerous and varied, and she has been instrumental in both establishing and sustaining the museum’s", "The next Biennial should be held in March 2021.  Convention organizers say that the decision to postpone the fifth edition was made just five weeks after the coronavirus outbreak in West Africa began. The current exhibition, which was due to run from March 13 to March 16, has drawn some 6,500 visitors.  The cancellation of the exhibition was made in order to make room for the construction of a larger Biennial in 2019. While the location of the exhibition has yet to be announced, the exhibition will still be held at the Grand Palais in Paris, which is currently being renovated.\n\n\nThe New York City Department of Cultural Affairs (DCLA) has announced that it is reopening its first phase of its Cultural Institutions for Change (CICs) program, which was suspended for three years due to Covid-19. Through a two-year grant program, $4.7 million will be allocated to re-imagining how institutions can become cultural hubs for the city’s diverse communities. “Cultural Institutions for Change will provide critical support to cultural producers and their families through a two-year phase of re-imagining how institutions can become cultural hubs for the city’s diverse communities", "The next Biennial should take place in the village of Grosvenor Hill at the southern end of London in 2022, with demonstrations and public events planned for the month of March. The three-day event will include twenty-nine artists who represent the UK in the exhibition.The 2018 edition of the Biennial featured twenty-seven artists, including Andy Warhol, Nada Rivera, and Franz Kline. The 2019 edition of the event, titled The Truth, saw twenty-six artists represented by twenty-four artists. \n\n\nThe New York City Department of Cultural Affairs (DCLA) has issued a statement reaffirming its commitment to the redevelopment of public art and preserving the city’s historic cultural institutions and terra forma\u0097calendar, theater, and rodeo grounds.In a statement issued on Thursday, the DCLA said: “For years, the Department of Cultural Affairs has worked closely with the city to preserve and develop the cultural and recreational assets of New York City. We are proud to continue this work by reopening the cultural and recreational assets of our neighborhoods. The new management team at the Department of Cultural Affairs is dedicated to delivering on our promise to deliver a revitalized Cityscape in 2020 and", "The next Biennial should be held in the fall of 2020. \n\n\nThe Arabian Institute (A.I.) in London has issued a statement regarding the arrest of Aya Al-Hadid, a twenty-three-year-old American citizen who was held in Saudi Arabia since March 26 and who was released on Thursday, March 21.According to the Art Newspaper, Hadid was arrested at London’s St. James’s Palace Security on March 22 after he allegedly assaulted his girlfriend in Manhattan on March 6. Al-Hadid was charged with assault and harassment on March 23, but his asylum claim was denied on April 3, and he was returned to the United States on April 5.The I.M. Peiks Museum in New York City has also expressed concern over the safety of its staff and visitors. “We are aware of the arrest of Aya Al-Hadid, and are in contact with the authorities, but we are not aware of his whereabouts or the nature of the allegations,” the museum said in a statement. “As is standard procedure, the museum is not in a position to comment or respond on an individual’s individual situation. We follow all applicable laws and follow all local policies", "The next Biennial should be held at least three years after the completion of this project.”The twenty-fifth Biennial, which was scheduled for 2021, was rescheduled from February to May 2019. The twenty-eighth Biennial, which was originally scheduled for 2020, was also suspended; the twenty-ninth, which was rescheduled for March 2021, has since been postponed. The twenty-sixtieth and twenty-sixtieth biennials will now take place in the same location throughout the year.The 2020 Biennial will be hosted by the Museo de Arte Contemporáneo in Madrid. The date will be changed accordingly.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of fifty rare works by the late British painter Ian McEwan. The donation includes works by works by fifty artists whose careers were formed during the late 1960s to early 1970s—many of whom had never been seen by the public before. Among the works that will be included in the museum’s exhibition “Ian McEwan: Past Lives” are a pair of paintings by McEwan, among them a painting by Wayne Shorter and a painting of", "The next Biennial should be held in the spring of 2020. The announcement follows a year of organizing and the commissioning of works by artists whose work has recently been included in the Biennial. The first Biennial, “The Atlantic Unveils a New World,” was staged at the 2015 Venice Architecture Biennale. The second Biennial, “Power and Politics” was curated by Teresa Dolores and aired on PBS. The third and final Biennial, “The Varga Project: A Vision of a New Life,” was presented by Arne Glimcher at the Berlin Biennale in 2013. The artist-in-residence at the Biennial will be Peter Neumann.\n\n\nAmerican painter Abraham Al-Khoury, the sixth and final creator of the Figure Sculpture and Figure Painting movements in the United States, died in New York on January 23, 2020, at the age of ninety-four. Al-Khoury, whose palette encompassed the organic, the abstract, the surreal, and the fantastical, was born in New York City in 1941. Following a brief stint in Europe, he returned to the United States in 1953, settling in the state of", "The next Biennial should be held in the spring of 2020.\n\n\nThe National Maritime Museum in Lisbon (MM) has appointed Astrid Baltazar as its new director. She will assume her post in January 2020 and will begin in her post in the institution on January 3rd, 2021.Baltazar comes to the institution with extensive experience in the field of maritime arts and culture. In recent years, she has directed the Museu de Arte de Lisbon (MASL) in Lisbon and the Museu de Arte de Lisbon (MASL+), the museum in the capital of Portugal, as well as the maritime museum at Porto Alegre and the Museu de Arte de Lisbon (MASL: Avenida da Marina) in Lisbon. In 2012, she received the Marco Polo Prize.“I’m very excited to be working with Astrid,” said Andreas] Ghebener, director of the National Maritime Museum in Lisbon. “We are already very well established in the field of maritime arts and cultural heritage, and she will continue to advance it in all ways possible, as she continues to shape the museum’s current exhibitions and educational programs in the", "The next Biennial should consider repurposing existing works for educational purposes, and should expand on the ideas of the previous one. In the event that the exhibition is rescheduled, the exhibition will be relocated and its program reconfigured. The twenty-third Biennial of Modern Art will be held in 2021. \n\n\nThe Corcoran Gallery in London announced today that it has received a gift of twenty-four works from the United States, including four American Studies figures, Benjamin Sargent (1903–1974), Mark Etchells (1908–1973), and John Israel (1908–1973). The gift also includes a selection of works from the American painter Henry David Thoreau.“As we are confidentially opening our new gallery at the Corcoran Art Gallery in London, we are thrilled that the American Studies artists will be joining us in the new building and are very much looking forward to working with them,” said Samuel Corcoran. John Israel, whose work is on display in the exhibition “The Art of Manliness,” will be the first American to lead the Corcoran. His biennial will take up themes such as the role of sexuality in modern life and its relationship to", "The next Biennial should take place in the spring of 2021. The 2019 edition, titled The Autobiography of Malcolm McLaren, is currently on view in the UK and Ireland. The exhibition will feature new works by seventy-three artists, including Kiki Smith, Yoko Ono, Tanya Olszka, and László Moholy-Nagy. The first show of the new catalogue will be entitled The Longing for the Utopia of the Old World: Revolutions in Art and Philosophy at the New World. The biennial will kick off on April 16, 2020 with a presentation of the work of the Danish artist Bjørn Støjberg. The exhibition will visit Columbia University, New York; Tate Britain; and the Kassel-Çatal, Germany.  The 2019 edition featured work by sixty-four artists, including Lech Wałębok, Akiko Murakami, Ming Wong, Rajendranath Tagore, and Shimon Attie. For the first time since its inception, the event will feature a category dedicated to art from the United States. The exhibition will feature work by forty-eight artists", "The next Biennial should be in 2021, and the 20th will take place in 2022. \n Members of the commission who will oversee the event are Andy Pandolf, Ian Lee, Mike Hampton, Rory McAlpine, Samantha Rosenberg, and Claudia Momiglio.  The selection committee comprises Jorge Pérez, director of the Museo de Arte Contemporáneo in Barcelona; Domenico Cipolletta, director of the Museo de Arte Contemporáneo di Roma in Rome; Ricardo San Martin, director of the Museo de Arte Contemporáneo de la Plata in Madrid; Arturo Vidal, head of the Institute of Contemporary Art History in Milan; Artsier Dries, director of the Museum of Modern Art in New York; and Jean-Jacques Julien, head of the Centre Pompidou in Paris. \n\n\nThe Italian government approved a series of subsidies last week that will help the Italian fashion industry as it attempts to cut its way through another global health crisis—the coronavirus, which has infected more than 5", "The next Biennial should be staged in the spring of 2020. The club will also be inaugurated by a live performance of pieces by artists whose works are on display at the exhibition.  “It took us a long time to decide to open a museum in 2017,” said Arne Glimcher, president of the Frankfurt Art Museum (FAI). “We were not prepared for the outpouring of support. We are still not prepared for the outpouring of support for the Biennale in 2019. We should have begun a year ago, but we did not. We acted too quickly, and we need to act again.”The project has also received support from some of the architects who participated in the show. While the exhibition was completed in 2016, the lobby of the museum was completed in 2017, and the building of the exhibition grounds was completed in 2018.\n\n\nThe Museum of Art in Beijing has announced the launch of a new digital platform, the Museu de Arte de Beijing, in partnership with the Chinese Academy of Fine Arts (CAF), that will focus on the art of China, and will also serve as a platform for cross-cultural exchange and collaboration. The platform will feature new and previously under-seen", "The next Biennial should prepare the gallery for what a new era will bring: new challenges, new opportunities, and new possibilities for our project and our audience. We are confident that within the next twenty-four hours, the Biennial will be able to better reflect the unprecedented global challenges which the exhibition has presented. Our vision is to create a new kind of Biennial, one that, in future years, will be about the art of society, about integrating the works of the different disciplines in an exhibition that will be not only a reflection of the various ways of life in the city, but one that will also reflect the diversity of our collections, our community. We believe that a Biennial of Contemporary art will be the best possible asset to the city of Barcelona.”\n\n\nThe American folklorist, painter, and architect Frank Gehry has been named the recipient of this year’s $1.2 million Cohen Prize. The honor, which was established by the Cooper-Hewitt and MacDowell Art Museum in New York in honor of the museum’s founding cofounder, comes with a $500,000 cash gift and an audience with the late architect and physicist Alan Sokal.Born in New York in 1962,", "The next Biennial should be held in Berlin in 2023 and would begin hosting in early 2021. The first exhibition would be a retrospective of the work of Wolfgang Althau (1930–1975) in the city of Bonn, and the second biennial would coincide with the conference of the institution to be held in the coming years. The exhibition would be organized around an ongoing theme of “toward a new and enhanced conception of bodies and their relation to their surroundings, with particular reference to the body and its relation to its surroundings.”\n\n\n\n\n\n\n\"The most important work on the present moment in the history of art, which I believe must be the first exhibition, is being held in the present,” Konrad Kraus, chair of the Foundation for Contemporary Art (Kunsthalle Berlin), told the German weekly newspaper Frankfurter Allgemeine in an interview published on May 14. “For me, art history is not a past past past, but a future. And the future of art is a critical question.” The Swiss-born, Berlin-based artist, who is known for his overlong, three-dimensional paintings conceived of as if they were floating in a vast inner ocean of", "The next Biennial should be held at the Singapore International Film Festival (SIFFF), which is currently underway in Singapore. The design of the venue, which is being designed by Tan, is based on the theme “The Past Always Resides in the Present.” The Biennial will be hosted by the Singapore Arts and Culture Authority (SAFA), which is not affiliated with the museum, and will be organized under the auspices of the Centre for Contemporary Art Singapore.In a statement, the Singapore Arts and Culture Authority (SAFA): “We have been working closely with the Singapore Art Gallery (SAG), the Museum of Modern Art (MoMA), and the Museum of Contemporary Art Singapore to shape a theme that is relevant and contemporary to Singapore. The theme of ’The Future is Present” has been chosen as the new theme for the 2020 edition of the Singapore Biennale. With the addition of three new collections, the biennial’s total number of works will surpass 131, and it will be held in the iconic art museum SACC from October 29 to December 14.The new works, which will be organized under the theme “The Future is Present” will", "The next Biennial should be held in 2020.\n\n\nThe National Trust for Scotland has welcomed J. M. W. Muir, chairman of the Salisbury Biennial Trust, to its board of advisers. He will be responsible for overseeing the care and conservation of the thirty-six-acre site at Salisbury Cathedral in London.Since the cathedral’s founding by William Shakespeare in 1686, it has hosted more than fifty thousand visitors, including Sir Richard Attenborough, Sir David Attenborough, and countless other artists, musicians, writers, and archaeologists. The trust also owns the land where the cathedral is located, and oversees the care and management of its buildings and grounds.“We are delighted that for twenty years the Trust has been able to support the National Trust for Scotland with its annual biennial,” said Hannah McAllister, director of the trust and chair of the biennial Trust. “The partnership between the Trust and the National Trust has been the single most important factor in the museum’s continued success. Over the past thirty years the Trust has been able to support the National Trust financially, develop new programming and exhibitions which has made it an ideal partner for our artists and staff, and further strengthen the relationship", "The next Biennial should take place in 2020 with the plans to extend the series to 2022. Artforum will be following the unfolding events closely.\n\n\nAmanda Marcotti, the director of the Berkeley Art Museum (BAM), California, where the institution is currently renovating a building that will house the museum’s collection of 100,000 items, has announced that the museum is working with architect Dietmar Keesler to create a new space for the arts and cultural heritage.Responding to a question about whether the building’s rearrangement—which is part of an ambitious plan that involves the removal of all of the museum’s historical art, including the Stanford Collection and the Cambridge Collection—would compromise the institution’s future use, Marcotti replied: “I’m not going to pretend that this is going to be the last time that the museum is on a building-by-building basis. I do think that this is a very important moment in terms of the emergence of the museum as a significant cultural institution in this country. There are going to be critical moments for the institution as it navigates this next great transformation; for the museum as it continues to grow; and for the city of Berkeley as", "The next Biennial should be held at the Gallery of Modern Art in downtown Prague. The institution is currently working on a new exhibition for the series, which is organized under the theme “Art and Memory: Transforming the Long-Term History of Modern Art” (Art and Memory), and is also working on a project for the series, which will be inaugurated in the summer of 2019.\n\n\nBritish artist Ian Williams has been named the recipient of the Nobel Prize in art history. The prize jury awarded the pan-African artist his award for’s “Spirit of a Nation: Six Centuries of African Art,” which was presented at a ceremony at the Cultural Centre in Whitechapel on December 21.Williams’s work was selected from a shortlist of five artists—Sara Cwynar, Rachel Whiteread, and Robert Creely—who were nominated by a committee chaired by Helen Cammock, the former director of Tate Britain. This year’s finalists included Lari Ward, Pei Lung, and Tarik Khan.Ward, who was shortlisted for the prize in 2007, will receive $256,000. Whiteread will receive $203,500; Clynar will", "The next Biennial should take place in 2020, and the forty-fourth in 2024. The museum will continue to receive visitors from the United States even after the relocation of the museum to a new site in the city of Birmingham, Alabama. The biennial, which was named for the Birmingham city center, The Brain, is scheduled to run from March 14 to March 21, 2021.  Ten other editions of the biennial have been announced, and the 2020 edition, titled The Future Is Present, will be staged at the Museum of Contemporary Art (MoCA). The theme of the upcoming exhibition is The Body in Space, with works by twenty-six artists from twenty-seven countries. The exhibition will be divided into two parts—the exhibition of work by Christophe Agliani (Italy), and the exhibition of work by Lotte Ahearn (Germany). The exhibition of works by Agliani will open on March 15 and the exhibition of works by Ahearn, the German artist who was hired to create works for the inaugural exhibition, will take place on April 21. The full list of participating artists is as follows:\n\nThe Bathhouse Art Gallery in London has hired Nadeem Akram", "The next Biennial should take place in 2020, the organizers said.\n\n\nThe Central Library of Art in Philadelphia (CLPA) is planning to open a digital platform that will allow members of the public to view exhibitions and other programming through the institution. The platform, which will be called the Central Reading Room, will allow visitors to select from a list of participating artists and will then present the works in real time.The platform will be powered by the CLPA, which in turn will collect and display the works. Part of the funding for the project comes from the Getty Trust. Its grant also went to the Philadelphia Museum of Art for its display of a work by artist Kathleen Cleaver, who died in 2015, as well as from the Getty Trust for the Philadelphia Orchestra for their 2018 season-opening celebration of its 150th anniversary. The Getty Trust also provided $10 million for the undertaking.\n\n\nAfter a judge in the United States District Court for the District of Delaware ruled yesterday that Apple must help the National Security Agency access the iCloud account of a suspect in a terrorism investigation, the agency admitted that it had failed to act in a timely manner to prevent the account from being accessed and that it is now attempting to reset the password of the suspect’s iCloud", "The next Biennial should focus on confronting the limitations of art and design as resources expand and change over time. The theme should be “Design As History,” and the exhibition should highlight the cultural legacy of the artist and design, particularly in the twentieth century. “Through the use of materials, with an eye to preserving the work of the artist, the Biennial should encourage the reflection on life and the future of art within the context of a great city,” said Art Historian Iwan M. Collins. “This is an unprecedented and incredibly exciting time to be a curator at the Museum of Modern Art. I will miss the Biennial in its entirety, but I look forward to working with the talented team and gathering new voices and projects in a museum that I love and have given my life to.”\n\n\nThe Museum of Contemporary Art (MoCA) in New York has received a gift of fifty-six works from the Ashmolean Museum of Art in Oxford. The donation includes six new works by artists such as Jill Scott, Janice Dirks, and Laura Owens, as well as a selection from the Ashmolean’s holdings that date from the 1970s to the early 2000s.The rich gift", "The next Biennial should be in 2022.\n\n\nThe National Endowment for the Arts (NEA) announced today that Angela Padilla has been named the next chair of the Institution’s board of trustees. As vice chair for culture, politics, and international relations, Padilla will be responsible for overseeing the management of the Smithsonian’s collection of more than six hundred works of art and will be responsible for overseeing the collection’s exhibitions and programs.“Padilla’s appointment reflects her leadership qualities and commitment to building a breadth of cultural knowledge and experience,” said Kati Thompson, president of the NEA. “Through her leadership, we’re looking to the future and seeing how she will continue to shape the collection through innovative programing and through cultivating the NEA’s reputation as an outstanding center for American art and ideas.”Born in Alameda County, California, in 1962, Padilla first attended the University of California, Berkeley, where she studied with David Salle, who had joined the institution at the time of his death in 1997. Padilla later completed her master’s degree in art history at Columbia College, Los Angeles, where she earned her Ph.D. Pad", "The next Biennial should focus on the history of art from the 20th century to the twentieth century and on its projects, both public and private, and should be open only in collaboration with the local communities that have made the work of art. The next year will also explore the radical shift in the postwar twenty- first century with a focus on the history of art from the 20th to the last decade.”\n\n\nArtist and activist Leonard Cohen, who along with Don and Yoko Ono launched the E-Strokes collective in 1988, has died at age eighty-two. The foundation founded by their many collaborators in 1996, the E-Strokes collaborate with artists across the globe in a range of media to produce works that address issues and ideas that range from climate change to the history of race, gender, and philosophy. Cohen’s work has been exhibited at the Museum of Modern Art, New York; the San Francisco Museum of Modern Art; the Museum of Modern Art, New York; the Whitney Museum of American Art, New York; the Museum of Modern Art, New York; and the Museum of Contemporary Art, Los Angeles.Through the group, he has become an important advocate for climate justice and a crucial source of inspiration for", "The next Biennial should take place in 2021 and the first in 2022. Though the program has had a limited time frame, organizers said that the theme for the 2020 iteration, “The Future Is Now,” will be familiar to those who have experienced the exhibition. The program will have a retrospective of the artist’s work, which is currently on display in the exhibition “Binary: Subversive Art in the Age of Suburbismo” (2019), alongside work by the likes of John Crowley, Arne Glimcher, Sam Goldwyn, and William James.The 2020 iteration of the show will be hosted by the artist’s son, Anton, and will feature works by the likes of Murilo Benitez, Airo Baruano, and Victoria Miro, amongst others. “This is a platform for both my parents to continue to present their work and to have it seen by a huge audience,” said Anton.  \n\n\nAfter the California native, Chicago native, and New York–born, Los Angeles–based artist, architect, and filmmaker Laura Owens, who is known for her high-paneled installations and urban landscape works, was named the winner of this year’s Contemporary Art", "The next Biennial should be held in 2021, with the 2020 edition situated in London. The twenty-first edition will be held in the city next January, with the 2020 edition taking place at Tate Britain in London in February 2021.The auction house previously announced that it would not be taking part in its largest event ever, the 2017 World AIDS Day auction, which took place in New York. “We are very much looking forward to continuing to support the creative and philanthropic work of Janet, Stephen, Olivier, Thierry, and the team that has created the series for these past twenty-four years,” said Andrew Sargent, chief executive of Christie’s. “When the iconic auction house was founded in 1968, it was a time when the art world was in its infancy, with many pioneers such as Alfred Sisley, Donna Karan, and Richard Partridge. We are delighted to be joining their ranks and bringing the works of our artists to life through the exhibition ‘Loving Images’ at the Venice Biennale in 2020.”The 2018 edition of the Venice Biennale, which featured work by thirty-eight artists, was staged in the elegant fashion of a mid-century", "The next Biennial should be held in 2022; the program has yet to announce a specific date for its second edition, which will take place in the city of Monza in Italy. \n\n\nThe Institute of Contemporary Arts (ICA) in Lisbon has appointed Joana Pimentel as its next director. Pimentel currently serves as the chief executive of the division of contemporary art in the city between the US and Italy. The Lisbon-based organization, which is currently led by Mina Gomes, will now have its first director in fifteen years.It has been fifteen years since Pimentel joined the ICA. She assumed the helm from Lluís Figueiro, who departed in the summer of 2019 to head the Art Museum in San Miguel. The organization has since hosted more than fifty exhibitions, which were organized by thirty-seven artists, and has long been considered one of the city’s most promising cultural organizations.\n\n\nThe Metropolitan Museum of Art in New York has appointed James Cuno as its next director and CEO. Cuno arrives at the Met after more than twenty-five years at the helm of the private museum, which has its headquarters in the former J. Paul Getty Building on East Seventy-Third", "The next Biennial should be held at the Museum of Modern Art, New York. It will showcase works by sixty-two artists.  Qualifications: Artistic and historical awareness;\n\n\nThe Berkeley Art Museum in California announced today that the institution will reopen to the public in the city on December 22. The reopening will mark the third time the museum has been open since it was founded by political radicals in 1972. The original intention of the museum, which occupies a former CalArts building on Golden Gate Boulevard, was to begin welcoming visitors in May. The museum’s board of trustees also voted to continue funding the museum through the end of the 2020 fiscal year. The decision was made in conjunction with the California Coastal Commission, which issued a statement on Thursday describing the Pacific Standard Time, the height and inclination of which changes with latitude, as a “crucial time for coastal communities in California.”The museum has faced numerous setbacks. It announced last February that it would not be able to keep up with the surge in coronavirus cases in the state as health officials scrambled to contain the outbreak. The onset of the pandemic coincided with a sharp drop in the number of visitors to the institution. According to", "The next Biennial should focus on the Trans-Pacific Partnership, a $1.15 trillion trade deal currently being negotiated between the United States, Mexico, and eleven other countries, including Australia, Canada, Chile, Hong Kong, New Zealand, Peru, Singapore, and Vietnam. The third and final exhibition should focus on the history of the Palacio de Cultura y Cultura Plus, the historically neglected exhibition space in the city of Santa Fe in New Mexico, which is renowned for its large-scale art exhibitions.The eleven-city selection will open in Mexico City on November 1, 2020 and will last for twenty days. In the United States, the first exhibition will be announced later this month.\n\n\n\n\n\nGroups of artists, activists, scholars, and other cultural workers have been demanding the release of political prisoners, including Chimamanda Ngozi Adichie, Hoei Ik, Khaled al-Asad, and Amina Kazran, as well as the immediate release of political prisoners held in Japanese prisons, the Makuhari Prison and Hotel, and the Kadena Prison in Okinawa. Not long after the Jakarta-born Adichie called for the immediate release of the dozens of political prisoners in Japan held without charge or trial", "The next Biennial should take place in 2020. The first, titled “Theatre of the Absurd,” was staged in 2006 and comprised artworks by artists who were influenced by the work of the late British experimentalist Wilfred Arthouse. Other contemporary works that were added to the collection include “Just After Midnight: Herbert & Mary Rose” (2011), a performance and installation by British artist Mark Leckey, and “Gavin Brown: The Complete Story” (2014), a documentary about the life and death of the late British actor and comedian Wilfred Anderson. \n\n\nThe Royal Society of Edinburgh has commissioned artist Billie Blake to create an exhibition of eight works by the late British writer and activist Yoko Ono. The exhibition—originally titled “In the Skin of a Whale” and curated by veteran artist and scholar John Black, who died last year—will open at the Royal Academy of Arts in London in December. The exhibition will also mark the seventy-fifth anniversary of the artist’s birth.Blake’s last-minute intervention in the selection process came in 2007, when she persuaded the academy to install a portrait of Ono, titled “Cindy", "The next Biennial should be in late September, with a preview event in September 2020. The theme will be “Two Worlds,” a response to the exhibition “The Sustainability of Art” (2019) at the Art Gallery of New York. The biennial will take place in the Battersea Power Station, which is being converted into a new 1,500-seat museum, and will be curated by Jane Panetta, the director of New York’s Museum of Modern Art.The full list of participating artists is as follows:Asociación Artísta de Barbos:Alberto Barrio: Día de los Muertos (20Más de la Mágica)Nicolás Bocán: Pedrito de Lima (19Más de la Mágica)Adrián Bichir: Lucha de Bellas Artes (The Cassandras, No. 1)Juliana Bicch: La Universidad del Pueblo (4Mánuel)Adrián García: La Universidad de los Andes (2Más de la Mágica)Hélio Abreu: Vivian and", "The next Biennial should be held in 2021. “We are delighted to be collaborating with renowned artists of the Museum of Modern Art (MoMA) and the National Gallery of Art in Washington, DC, on an exhibition that will inaugurate our new space, the Biennial, at the Museum of Modern Art, and inspire visitors and collectors to think critically about art, history, and the world anew,” said Michael Levine, director of the Museum of Modern Art.The museum will construct a thirty-foot-wide, seventy-foot-tall, and twenty-foot-wide pavilion at the museum and will position the exhibition within the walls of the institution, which is located on the fourth floor of the Museum of Modern Art. The pavilion will feature one hundred works by the artist, with the artist invited to present each work in a one-hundred-minute performance. The show is being organized by the artist and will run through December 21. The exhibit will be divided into five themes: the Holocaust, human rights, art, and politics. Each theme is curated by artist Alexander de Kooning and will be presented by the artist himself or by an alternate artist chosen by Levine.“In the late nineteenth century, the Holocaust became a", "The next Biennial should be hosted by the Württemberg Museum in Zürich. The Tallin Contemporary Art Museum in Saint Petersburg will be the venue for a biennial in the Bay Area. The 2019 edition will be held in the National Museum of Modern Art in Dresden. The Düsseldorf-based artist Theo Schneemann, whose practice combines sculpture, performance, installation, installation, and performance, will stage his first exhibition at the venue in 2022.In the event of a global crisis, the National Gallery of Art in Washington, DC, will open its new permanent exhibition, “This Is Not an Emergency,” in October. The first show of the show is currently on view. Theologian Gerhard Richter’s series of works on paper will open at the Museum of Modern Art in New York in September. The Bolshoi Gallery in Moscow will stage its third exhibition of the year, “Feminine/Anthem: A Feminist Odyssey,” at the Institute of Contemporary Arts in Moscow in October. The exhibition will be followed by a show of works by the New York–based artist Mary Anne Rosler in December.\n\n\nThe architects at the Museum of", "The next Biennial should explore the possibility of creating a relational context for the work of art. The third and final installments of the series will take up issues of art history and the future of art. The third part will be examining how the relationship between art history and contemporary life has changed over time. As the second biennial opened in 2019, the museum also unveiled a seven-million-piece collection of art.\n\n\nNew York’s Metropolitan Museum of Art (MoMA), which was forced to move the opening of its new location in mid-March after it failed to secure the necessary state permission, has announced that it is moving the exhibition schedule for its first-year exhibition “Expose Your Soul,” which will take up the theme of the upcoming thirtieth edition of the Metropolitan Museum of Art, “Beyond the Met: Art and the Emotions” from March 19 to March 22. In the wake of the March 19 setback, the museum says that the exhibition has been postponed until March 21, when it will be open again.The exhibition, which was originally scheduled for March 20 to March 22, has since been moved twice, once on March 16 and once on March 22. It will", "The next Biennial should take place in 2021, when the exhibition will be hosted by the Art Science department of the Faculty of Arts at the Royal College of Arts (RCA). The biennial will be led by Professor Anne Littman, who was appointed curator of the first edition of the exhibition in 2007, and will draw from a selection of the most recent exhibitions and lectures in addition to original works.Commenting on the forthcoming exhibition, art historian Ciarán Finlayson said: “The new program will introduce a new range of work, bringing together new themes, and capture the imagination of new audiences. The new venue will allow the RCA to present the show in a modern contemporary context. The biennial will encompass the full range of contemporary art, taking into account both the artist’s and audience’s requirements, reflecting the RCA’s founding aspirations in the 1950s.”\n\n\nThe Solomon R. Guggenheim Museum in New York has appointed Farideh Farman as its new deputy director for exhibitions and collections. Farman succeeds Michael LaComande, who has served as associate curator and head of the collection throughout the museum’s thirty-year history. Farman comes to the Gug", "The next Biennial should take place within forty days of the date of the notification of the expiry of the twelve-month period of community service imposed by the court. The thirty-second and thirty-third biennials will be held in August and September. As the parties involved in this dispute continue their negotiations, it is possible that the dates of the entries in the exhibition will be finalized by the time of the exhibition.\n\nThe British Museum has accepted an offer of $1.75 million to purchase the artworks of the late Israeli designer Hillel Silver, the founder of the prestigious design company Jil Sander. The donation comes just months after British Prime Minister Boris Johnson unveiled a new five-year conservatorship for Silver’s design studio, Silver & Co., which he began working at in the late 1970s. The studio is a hub for artistic experimentation and experimentation’s legacy.“In support of the ongoing work of the Silver Museum and the direct support of the artists whose creative work has shaped the modern state, we are offering $1.75 million in support of the institution’s curatorship program,” said British Culture Secretary Maria Miller. “This represents a new contribution, unprecedented in", "The next Biennial should take place in August 2021, said to be the earliest date ever for the event. A statement by the Biennials said: “It is so important for us to have a dedicated location that is completely dedicated to the exhibition and exhibition-making of the past.” The new venue should include a collective exhibition space and a research library on the biennial, the first biennial to feature works of the artist-in-residence, Deborah Cox.The Biennial of Exhibitionism, which was held in 2009 and was attended by forty-seven of the seventy-eight artists who have won the Prix de l’Amiti-Cinéma, is the largest event dedicated to the contemporary art of the late twentieth century. The event was organized by the Biennials in partnership with the Royal Institute of British Architects (RIA) in London and the Ritz-Carlton in Paris. The event, which raised over $9 million for the RIA, will be staged at the museum’s new home in the capital, a former British Royal Navy vessel that is currently being renovated by the French company Thyssen-Bornemisza.The new venue will be inaugurated by a three-", "The next Biennial should include a discussion of the oft-overlooked work of French master Pierre-Auguste Renoir’s Dreams of the Pale Horse, which is currently on display in the exhibition “The Last Nude: Art in the Age of Sex in Paris” (2019). It should also feature a discussion of artist-made elements such as cardboard, wood, paper, and metal.\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it is reinstating a series of fines and penalties that were previously suspended by the city in an attempt to curb the spread of Covid-19. The reinstitution of the original $50 fines, which were suspended by the DCLA in 2016, was spurred by pressure from the city’s cultural leaders and lobbyists, who had lobbied for the fines to be suspended for at least a year and were pushing for the suspension to be increased to $175. Covid-19 is a coronavirus that is spread primarily from person to person, but can also be spread through food, water, and air; there have also been cases in people’s homes. The reinstitution of the fines was made possible", "The next Biennial should be held in 2022, and the 2018 edition was held in the city of São Paulo. The 2017 and 2012 editions were both held in the city of São Paulo, and the biennial was staged in the historical city of Vitoria, Brazil.The 2017 edition featured twenty-six works on paper, twenty-eight drawings, and a special exhibition devoted to Brazilian literature, art, and fashion. The exhibition also featured the first-ever films made by the artists in Brazil. In the film section, the artists represented the twenty-eight countries that make up the country, and the twentieth-century Brazilian artist Luiz Felipe (1946–1998). The upcoming edition will be the first to focus on contemporary art and will take place in the city of Recife, in central Brazil. The full list of the participating artists is as follows:João de Jora (Portugal)Alex Alaux (Brazil)Igor Almeida (Portugal)Zico-Inés (Brazil)Zico-Inés (Brazil)Zico-Ricardo (Brazil)Zico-Ricardo (Brazil)Kelvin Allen (USA)Igor Alejandro Sousa (Brazil)Pari H", "The next Biennial should be the first in the US under the new leadership of the artist-run nonprofit the Museum of Contemporary Art (MoCA), which moved from its current space in the former Copper Box in Downtown Los Angeles to a new home in the historic Arts District in Pasadena, California, in February. The museum, which is currently undergoing renovations, will be inaugurated by an exhibition of works by Gabriel Garcia Marquez, Leo del Campo, and Mario Puzo. The exhibition will also feature works by artists such as William Gibson, Ed Ruscha, and Adrienne Kuzma.\n\n\nJoin us in celebrating the new and refreshed Art of the Party at the Museum of Contemporary Art (MoCA) with a pair of special exhibitions, the first of which will be offered in the museum’s new location at 1600 S. Santa Fe Avenue on October 23 and 26. The second, which was organized by artist-run organization Artadia, will be presented in the museum’s new space at 1600 N. Santa Fe Avenue on December 8.Following the inaugurations of an exhibition of works by the same group that organized the inaugural show, Artadia will hold an open house from 10 AM to 5 PM on January", "The next Biennial should take place in 2021 and will be led by the Danish artist Nanna Norberg. She will be working with the new medium of sculpture to create works that address issues of the body and the body-materials. The free event will be curated by artist and curator Eva Aagaard.\n\n\nThe Museum of Fine Arts (MFA) in Boston has appointed Stephanie D. Bagnall as its next director. Bagnall arrives at the museum from the Massachusetts Institute of Technology (MIT), where she has served in various roles, including head of the Massachusetts Contemporary Art Museum (MCA), since last September. She succeeds Bob Fulton, who was named director of the MBTA in January 2020 and will assume his responsibilities at the MBTA in March.“We look forward to collaborating with Stephanie as she develops and enforces the museum’s mission and vision, achieving institutional excellence in our areas of expertise,” said museum director Mark Donahoe. Bagnall succeeds Michael Scott, who departed in the spring of 2019 to become the recipient of the Nobel Prize for Arts and Sciences. She succeeds Arthur J. Clarke, who has helmed the museum since 1987, and will begin in her role in April.Comment", "The next Biennial should include a new selection of works by artists such as Nia Vasquez, Lucinda Williams, Catherine O’Leary, Jane Reich, and Cindy Sherman. “This is a moment of great change for the world of art and it is our responsibility as curators to shape it in our own image,” said Adrienne Edwards, executive director of the Biennial Commission. “I’m looking forward to seeing how this new biennial reflects the spirit, the scope, and the breadth of the contemporary world.”\n\n\nThe National Gallery of Art in Washington, DC, has appointed Mark Arcman as its next director and chief curator. Arcman currently serves as deputy director of curatorial affairs and chief curator at the Diller Scofidio + Renfro–designed National Museum of African American History and Culture, which opened in 1976 in Washington, DC.He succeeds Kirsten Harris, who retired in October after five years at the helm of the institution. Harris will continue to chair the museum until the end of the year.“Mark brings a compelling history as an institutionally committed scholar, championing the humanities and the social sciences, while retaining a", "The next Biennial should take place in the United States in 2021. \n\n\nThe MCAW Foundation, which supports artists whose work has been exhibited at the MCAW Foundation’s annual Siskel Fellowships, will increase the number of fellowships awarded by up to twenty-five percent this year. The initiative, which was announced in April 2019, will be led by David Scharf, the director and chief curator of the Museum of Fine Arts, Boston; Barbara Kruger, the director and CEO of the New Museum; and Norman Foster, the director of the Museum of Modern Art.“The MCAW Foundation was founded by Richard C. Alexander, a Boston native, to have a positive impact on the lives and work of Boston’s emerging and established artists, and to facilitate their careers,” said David C. Alexander, chair of the foundation’s board of trustees. “The MCAW Foundation Fellowship program is a vital way for artists to advance their careers in the United States. The MCAW Foundation Fellows will receive $100,000 in support of their careers and will be honored at a ceremony in Boston this fall.”The fellowships were announced in April 2019, during the", "The next Biennial should include a selection of works on paper in order to create a virtual exhibition space that reflects and probes the context of the exhibition. For the next edition, the audience will be able to enter a virtual space through which they will be able to experience all works selected by the artist.“The Biennial is a living organism, responding to the viewer’s behavior and to the physical environment around it,” Zhang said in a statement. “After completing the exhibition, the audience will have an opportunity to share their thoughts with the artist and participate in the development of the exhibition’s theme. The exhibition will continue to move forward as one of the central concepts in Biennial.”\n\n\nThe Solomon R. Guggenheim Museum in New York announced today that it is planning to open a new digital-only museum dedicated to the artist-in-residence, Paolo da Rocha, on September 5. The new institution will serve as a hub for visitors to the museum, which is currently closed since the Covid-19 pandemic, and will be propelled by the Guggenheim’s $50 million expansion project.“Paolo da Rocha was a master of the surreal", "The next Biennial should launch in the autumn of 2021, with a presentation of the work of selected artists taking place in the autumn of 2022. The work of the artists chosen for the 2019 edition and the twenty-first will be presented in the autumn of 2020.The exhibition of artists participating in the 2019 edition, which featured work by twenty-four artists\u0097all of whom were nominated by the public\u0097was held at the Museum of Contemporary Art, Houston. The works featured in this year’s exhibition include work by artists such as Arsht, Hernán Barral, and Adam Higniz, and are based on requests from the public. Exhibitions opened on January 27 and February 23, 2020.\n\n\nThe British artist Andy Warhol and the Italian designer Anne Fontana, who met in the early 1950s, have collaborated on a new project that will involve the erection of a massive, glass-enclosed sculpture that will stand for eighty years in Picasso’s studio in Manhattan and then float on a river in the city, an experience that will culminate on October 25, 2020, with a tribute ceremony and an exhibition of works by the two artists.The artist’s group Biennial, which is based", "The next Biennial should be held at the Museum of Modern Art in Shanghai in November 2022. \n\n\nThe Art Newspaper, the Berlin weekly newspaper, has published an open letter from nine Berlin-based artists, including Haus der Kunst, Hans-Ulrich Richter, and Markus Szeemann, demanding that the German government take immediate action to halt construction of new Jewish synagogues and art museums in the German city of Berlin. The letter, which was addressed to Berlin city council member Peter Münster, reads: “We have been following the developments in Israel and Palestine closely and we believe that the current political crisis will only intensify anti-Jewish feelings in Germany. This makes us question the future of our cities and our neighborhoods. Therefore we call for an immediate halt to construction, relocation, and expansion of existing structures in Berlin, in the city of the Jewish people, and in general in the entire of Germany.”The letter explains that its actions are not meant to be taken as an endorsement of the positions taken by the city council members, but rather to demonstrate their commitment to the artists’ demands. It concludes: “We hope that this letter will be of some comfort to the artists, who are facing the uncertain future", "The next Biennial should focus on the history and theory of art, covering the history of art and art history, the history of art and artmaking, and the history of art and artmaking in a contemporary way. The exhibition should allow the audience to experience the work of many artists in an exhibition environment that represents the broadest range of artistic practice.\n\n\nFollowing an exhibition of work by Antony Hudgens at the Museum of Fine Arts in Prague in July 2017, the museum announced that it is planning to begin the formal process of organizing an annual edition of the European Biennial. Originally scheduled for 2020, the inaugural edition will take place at the Museum's new home in the Beljiro Theater in May 2021.  The announcement followed the retrospective, “Between Worlds: Art and the Creation of Modern Life” (2019), which featured forty paintings by the Ten Commandments, a group of artists who were active in both Eastern and Western art in the fifteenth and sixteenth centuries. The work was selected by a jury of curators, scholars, and art historians. In a statement, the MFA said: “This year’s edition of the Biennial is dedicated to the work of Anton Hudgens, who embodies", "The next Biennial should take place in 2020. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has received a gift of nearly three hundred works by American painter Hans-Georg Maier\u0097a monumental gesture that will allow the institution to further expose its collection to a global audience. The gift, which was made in celebration of the institution’s 150th anniversary, was made on January 6, 2020, in lieu of the artist’s death.“Maier’s works are a treasure trove of nineteenth-century American art in a changing world,” said museum director Angela Sun-Hua. “We are grateful to our visitors, our faculty, our staff, and our supporters for their enthusiastic response to our 2016 exhibition ‘Maier: The Master’s Vision,’ and we are proud to unveil this new collection to the world.”The gift includes a selection of Maier’s paintings, sculptures, photography, collages, prints, and collages\u0097a selection encompassing his earliest works and works from the twentieth century\u0097from the series “Avant Garde: Painting in the Age of Abstract Expression” (1939) to “", "The next Biennial should be held in 2022. The announcement followed the announcement last December that the museum would be closed until March 19, 2022. In a statement, the museum said: “Since its inception, the Biennial has been a collaborative endeavor. The introduction of the new exhibition series and the redesign of the museum brought the Biennial full circle. . . . We have accomplished a lot since we opened in 1992, and I look forward to the next chapter.”\n\n\nThe National Museum of Fine Arts (NMFA) in Atlanta is planning to launch a $250 million fund that will help small to mid-size arts and cultural institutions across the United States survive the Covid-19 pandemic. The initiative will also provide a tax credit of up to $150,000 to small businesses that have one hundred or fewer employees.“The fund is a continuation of the National Museum’s work to support local, regional, and national small businesses through financial assistance and other tools,” said Nicole Boccardo, director of the NMFA. “The fund is a critical step toward ensuring that small businesses and arts organizations have access to critical support in the aftermath of Covid-19.” ", "The next Biennial should be held in 2020.\n\n\nThe museum’s final exhibition of its fourteenth-century political theorist, Pierre Bourdieu, was canceled because of a lack of interest from France’s cultural sector. The decision was made by the chamber of culture in the capital, Paris, after it received a petition signed by more than 1,500 society members protesting the exhibition’s location in a public space.The petition argued that the exhibition, which would have featured paintings, drawings, sculptures, photographs and other works by Bourdieu, a political theorist of the French Enlightenment and a leading member of the Méhisto-Politique movement, was “too close to the current events.” The petition also said that the “premier pick” for the title of “Ideologist,” was the “Solipsism” exhibition, directed at the Míli Museum, where it is currently on view through June 21.The institution announced that the show will now be held at the Paris Museum of the History of Art, a museum founded by the late architect Jean Nouvelle in 1976. The announcement was made on May 25, the same day it held its first exhibition of the", "The next Biennial should be held in the second half of the year. It will be held at the newly renovated Museum of Modern Art (MoMA), which reopened in November 2018.Hearings on the next edition of the Biennial are scheduled to begin on August 4 and last for twenty days. The biennial will close on August 26.\n\n\nThe European Commission has released guidelines for the future participation of artists in the European Space, which was founded by Jean-Marie Le Pen in 1989 and is currently run by the French president and was dissolved by his successor, Jean-Claude Juncker, in March of 2021. The guidelines, which were drafted by Juncker, who is now French prime minister, propose that the Commission take over the organizing of the space, which is currently managed by the Association of European Photographers (AEP), and reassess its strategic situation following a 2020 reopening of the Hoa-Ora region.The French president hailed the guidelines as a \"historic step,\" which will enable the Commission to \"respond to the challenges posed by the digital revolution and to develop a new space for art and culture.”Commission president Jyrki Katainen said that the guidelines are a “good start, leading to a", "The next Biennial should be held in 2021. Since the theme is “the role of culture in challenging the domestic, the future of art is also threatened,” the exhibition will be organized as a series of interdisciplinary projects, with the first episode to be held in the city of Antwerp.The Biennial will organize a “spaces of meaning” exhibition, which will take place in the city of Antwerp and will be organized as an “open-air museum,” and will include an online version of the exhibition. The project will also include the creation of a digital platform that will allow visitors to access a “hierarchy of knowledge from the world of art,” and will include several new projects that will push the Biennial’s ambitions.Among the projects that will be undertaken by the exhibition are the “Living Works'” exhibition; “Paintings in Construction” (in collaboration with Judith Wechsler, of the Hellenic Institute of National Art and in partnership with the Hellenic Museum of Art); “Our Old World: Contemporary Art from the 1930s to the Present” (in collaboration with the Kiel Institute for Contemporary Art); and", "The next Biennial should be held in the autumn of 2020 and is also building on the internationally recognized tradition of presenting contemporary art by artists from the Little North American tradition to include artists who are not currently represented by the Biennial.”The festival has been running since 1987, under the aegis of the Metropolitan Museum of Art and has been held in cities across the United States, including Chicago, New York, and San Francisco. The 2019 edition drew an impressive 2,058 visitors.The biennial will be the only work of its kind at the San Francisco Museum of Modern Art, which opened the new building that houses the event in 2012, and will coincide with the 40th anniversary of the institution. The exhibition “Between the Sun and the Moon: 1965–1976” will be on view until March 31. The 2020 edition of the event is currently on view through April 3. \n\n\nFollowing the Paris-based arts organization, Art Basel, which announced it is giving the auction house its first ever internet auction, the New York Times reports that Art Basel is facing a legal complaint from the United States of America. The complaint was filed by New York attorney general Eric Schneiderman on April 21, after Art Basel failed to register", "The next Biennial should open in the spring of 2021. The site of the new exhibition will be located near the Biennial exhibition hall and the Pier de l'Etoile des Beaux-Arts in Paris. The exhibition will feature more than 200 works by artists from the collection of the Museum of Modern Art and of the Louvre.The Biennial will be hosted by architect Lesley-Anne Giuffrida, who was appointed as the curatorial director of the Museum of Contemporary Art Paris (MAC), and will be organized by Gabriel Bagnès, the deputy director of the Museo de Arte Contemporáneo in Mexico City. The exhibition will take up themes such as urbanism and the environment, new media and urbanism, and new photography.\n\n\nThe Julliard School in New York has confirmed the seventy-eight students who have signed an open letter condemning the school’s affiliation with the Qatar Foundation, the United Arab Emirates’s charitable organization whose ties with the Qatar royal family have been the subject of intense scrutiny since the London-based arts institution announced last month that it would move two of its planned trips to the region—the 2022 and 2022 editions of the Doha Bienn", "The next Biennial should be held in 2020.\n\nThe Central Library of Chicago will soon house some eight thousand photos by renowned artist Joan Miró, the Spanish daughter of the Spanish colonialists and the first Latin American artist to enter the United States. Known for her surrealist paintings and sculptures, which explore the notion of the imaginary, Miró often depicted herself in three dimensions. In the 1950s, Miró became a favorite of the Disquiet School and the New York Academy of Art, where she would teach for the next decade.Her work is currently on display in the exhibition “Miró: Crossings.” In a 2017 interview with the New York Times, Miró said that she wanted to “exercise self-abstraction.” “I am a Cubist–like person.” This exhibition will launch the exhibition “Miró: Crossings,” which will take up the theme of the twentieth century in late March.\n\n\nThe museum has received a $50,000 donation from the estate of the late British artist Tanya Tucker. The gift is the culmination of a ten-year campaign to raise awareness of the impact that the artist\u0097whose distinctive, yet often enigmatic, artworks", "The next Biennial should focus on a “new form of literature,” the art critic Lukasz Janiak told the Art Newspaper.  \"The next Biennial should focus on a ‘new form of literature,” the art critic Lukasz Janiak told the Art Newspaper. Photo: Artforum.\n\n\nThe Tohoku Region Museum of Art (The Tatōkū) in Japan has announced that its exhibition “KiBC” will be moved to the Tohoku region, where it will open in 2021. It will then return to the capital Tokyo where it will open in 2022. The announcement follows an announcement in March that the Tatōkū will stage a retrospective of the artist and anti-war activist Takashi Onishi, who was a vocal proponent of anti-nuclear protests, in March 2019. The exhibition will focus on Onishi’s work KiBC, which was shown at the Takashi Onishi Museum of Art in Osaka in the spring of 2019.The museum has also said that it expects the exhibition to draw up to twenty-five thousand visitors in 2020. Onishi has been working on a new series of artworks that will be performed", "The next Biennial should focus on the history of the International. Citing the current events surrounding the coronavirus, which is carry by people who are ill and has killed at least 6,000 people in China, Artforum has decided to cancel this year’s event.The decision was made in light of the coronavirus’s emergence as an international health crisis and as many of the major art museums in China, Hong Kong, and the US are closed through at least February 8. Cultural leaders from China, India, and Japan have recently met to discuss ways to stem the outbreak. In an interview with the Art Newspaper on March 31, Zhu Ruofu, the director of the Beijing Art Museum, said: “We must continue to focus on exhibitions, books, concerts, and performances and create new opportunities for international interaction. We must also continue to develop the art and technology of [the museum].”While Artforum.com previously reported that the bank would partially compensate artists who are eligible for the prestigious $75,000 Biennial Prize, the organization announced on June 12 that it has decided to break up the $150,000 prize into two separate awards. The first, which will be awarded at an award ceremony in New Delhi", "The next Biennial should be in December 2020 and should include three exhibitions: “Mapping the Landscape: Photos from the 2020 Biennial,” which will highlight the work of contemporary artists; “Future Present: Photos from the 2020 Biennial,” which will include art from a range of contemporary artists; and “Forbidden Art: Fifty Artworks by the German Workers in the 1930s.”\n\n\nNew York’s Metropolitan Museum of Art (MoMA) is expanding its partnership with the Museum of Art Research (MARM), a collaborative multidisciplinary arts institution that aims to advance the study of the arts through both theoretical and experimental research. The partnership will include a new two-year fellowship program, which will launch later this year, and will also present an exhibition at the museum during the fall.“We are thrilled to partner with MoMA to further its work to make sure that research and scholarship on art and art history will continue to be a critical part of our mission and to make a difference to the lives and well-being of artists, scholars, and the public,” said Joseph Suss, the museum’s director and chief curator. The partnership’s inaugural year will include", "The next Biennial should be held on March 30, 2020.  The museum will continue to host events and exhibits in the form of programming that embodies the vibrancy and vitality of South Asian art, and will continue to do so in line with our long-standing mission to present a diverse array of art in the United States. We will continue to work with our curators, staff, and supporters to advance the museum’s mission and are excited to see where this program takes us next.\n\n\nThe Institute of Contemporary Art (ICA) in London has appointed Rishi Sunak as its new chief executive officer. Sunak comes to the institution from the Museum of Modern Art (MoMA), where he has served as chief executive officer since March 2019. Previously, he was a director of the Chisenhale Museum of Art in London, the Women’s Museum in New York, and the Aramis Museum of Art in Athens, which he led from 2010 to 2012.During his tenure at the museum, he oversaw a $500 million expansion project; launched a new youth program, the Rishi Sunak Fellowship, which funds summer work for under-25s in the United States; and oversaw the reinstallation of the museum�", "The next Biennial should be held in 2020 and will be hosted at the newly constructed Art Museum Rotterdam. The show, titled “Thinking About the Future,” will be on the theme of “future crises.”\n\n\nThe UES Art Museum Miami (UMMI) announced today that it plans to move from its current location on the first floor of the institution to the fourth-floor auditorium of the museum. The move will allow the museum approximately 3,300 square feet of new space to be installed, distributing more of the collection, programming, and exhibits across its two brick buildings.“UMMI’s collections are here, and they’re growing, with new and exciting exhibitions, collections walks, and educational programs,” said UME’s director, Roosevelt Sargent. “On our new mission to present the art of the Americas to the world, we are committed to expanding the collection’s reach and expanding the museum’s public impact.”Inaugurating the new space will be a new collection of contemporary art from the Americas. Titled “Fashion’s Future: Trans-Atlantic Fashion,” the exhibition will feature works by", "The next Biennial should be held in 2020.\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a $50,000 donation from the Charles and Lucille King Family Charitable Foundation. The grant follows a $25,000 donation made by the family in 2017. The donation was part of a $150,000 initiative that began in 2018, and is the largest gift the King Family has ever made. “The funds will allow us to establish a new endowment to support future work by this and future generations,” said Marc Glimcher, director of the MFA. “It is an honor to receive this award for the museum’s 75 years of leadership in providing a free and comprehensive public education to all children in our community. We extend a warm welcome to the King Family and their extended family, the Stashestas, and look forward to continuing the work of the past century to teach our generation about art history.”\n\n\nNew York Governor Andrew Cuomo announced today that the city’s art museums will receive $250 million in aid from the $1 trillion federal stimulus package, which was passed by Congress in December and signed into law by President Donald Trump on Friday. While", "The next Biennial should be held at the Museum of the African Diaspora (MoAD) in Malmö, Sweden, in 2021. \n\n\nThe Museum of Contemporary Art (MoCA) in Los Angeles has placed the final touches to its renovation, which will include the installation of a new sculpture garden, a new performance space, and the renovation of its main building. The institution will officially open the new space in 2020, and will have a permanent retrospective of the work of Paul Gauguin, Robert Rauschenberg, and other contemporary artists in the museum in 2021.“We’ve been working toward a new building for some time now, and the new plan integrates our existing physical space with a vibrant new contemporary art program,” said curator Anna Lindblom, who is overseeing the renovation, which will also introduce a new narrative branch of the museum. “MoCA is a truly unique institution, a beacon of modern and contemporary art in Southern California. The renovation is a reflection of our mission to present a broad range of art in a variety of settings and to build on our legacy as a premier center for contemporary art.”The new building will boast four levels with a total of eight thousand square feet of usable", "The next Biennial should be held in 2020. \n\n\nThe Carnegie Museum of Art (CMA) in Pittsburgh (CMA) has approved a $10 million donation from the Andrew Carnegie Foundation in support of the Pittsburgh Cultural Alliance (PCA), a nonprofit arts organization dedicated to supporting the arts in the city. The gift comes amid an ongoing campaign by Pittsburgh residents to save more than sixty historic buildings, including the Carnegie Museum of Art and the Pittsburgh Art Museum, from the wrecking ball.“This gift will enable the CMA to fulfill its mission of celebrating the life and art of Andrew Carnegie by hosting his final performance and designing a new exhibition for his collection,” said CMA director Joshua Helmer. “This gift also allows the CMA to recognize the cultural and financial significance of Marcus Garvey’s legacy by preserving and presenting the collection’s collection in the museum’s collection. As we continue to support the CMA’s mission by funding programming and exhibitions that connect with local communities, we are grateful for the support of the Carnegie Foundation and the Carnegie City Council.”The donation is part of the $25,000 “Carnegie Challenge: Moving the City,” which was established", "The next Biennial should be held in 2022 and the date of the inaugural event has yet to be determined. The institution will also continue to receive financial support from the general public through its priorities fund. The Duchy of Cornwall, which has a budget of £515 million, will receive £156 million from the UK’s Department for Culture, Media and Sport and will receive £110 million from the UK’s Department for International Development. In an attempt to encourage greater collaboration between art and science, arts and technology, and students, the Duchy’s new $50 million Arts and Science Academy is also planning to create a new $50 million fund for students from disadvantaged backgrounds. The University and College Union (UCU) has called for artists and academics working across disciplines to be given more support, including a $300,000 grant from the Arts Council. Theatre students are also protesting a proposed £150 million boost in student fees, which would be split between London, the South Bank, and the East End. They claim that the sum is not nearly enough to cover the expected tuition fee rise and are calling for a higher national minimum grant. The proposed £150 million boost in student fees, which were", "The next Biennial should be at least two years from the date on which the exhibition will close. International support should also be provided for the assembly of the show’s database, which should be open by invitation only, with the proviso that the public should only be offered access to this information through direct communication with the artist.“The Biennial is a unique institution,” said Director of the Museum Wolfgang Pfeifer. “The success of the exhibition depends on not only its aesthetics, but also on the public’s deep understanding of what makes the art world work and how art can change lives and the world. We are actively working on this, and are proud to have the public involved. The show will also be a living thing, evolving in response to the public. The first Biennial will be hosted by the artist and his family in the Museum, and will run from March 19 to March 21, 2020. The second will be hosted by the artist’s children in the Woodlands and will run from March 20 to March 21, 2020.”The Biennial will also be accompanied by a series of public exhibitions at the Museum. The first exhibition, “Our Body in Pictures,” will open on March", "The next Biennial should be an international gathering that captures the spirit of the Paris of today with its contemporary artists, designers, scientists, musicians, architects, writers, and the ever-changing landscape. I look forward to continuing this tradition of cooperation with the creative community of the city of Milan.”\n\n\nThe Museum of Fine Arts (MFA) in Boston has received a gift of thirty-four works by artist Don Suggs: The Artist’s Path, a collaboration with the MFA, The Artist’s Will, The Power of Life, and The Infinite Life; all three of which were on view in the museum’s newest exhibition, “Suggs: Color. The Artist’s Path” (2019), and The Artist’s Will’s efforts to use color to create an image of a man’s body, a work titled “Man and Body” (2019), both of which were also on view at the MFA.The gift includes thirty-four works by the artist, and three masterworks of color. The works were donated by Don Suggs and are currently on display in the museum’s new exhibition, “The Color of Paint", "The next Biennial should be held in 2021.\n\n\nThe Museum of Contemporary Art (MoCA) has released a statement in response to the Covid-19 pandemic, which has affected all facets of its mission, including its collection, exhibitions, education, and programming. In a statement, the institution said:“As we always say, we do not control what happens to us or our collections. The collection is preparing to reopen soon and we are working hard to re-establish a positive and holistic relationship with our visitors. As we have always said, we do not want a new Covid-19—this is a significant development in our history.”Commenting on the pandemic, MoCA CEO Christian Krebs said: “We are conscious of the challenges that we face and the importance of collaboration with our partners. . . . We have a long-term plan in place to mitigate the impact of the current crisis and we will continue to work with our partners to ensure the sustainability of our exhibitions, our collections, and our programs for the next six to twelve months.” He added that the institution is working with state, local, and federal partners to prepare for reopening and is committed to reducing the use of transportation and", "The next Biennial should be called a New Front. Details about the new exhibition will be announced soon.\n\n\nThe Neue Galerie in Berlin has announced its representation of Belgian artist Marina Markvits. Markvits usually creates sculptures that involve a combination of skeletal elements and organic materials, but in her work for the fairs 'Kunsthaus Bremen: Parte della Terre' (2017–18) she made a new work that focused on the body and the environment, including the water. Its exhibition runs until March 23.“The work combines a rich history of natural history with a contemporary, yet delicate, approach,” said Kimerly Rorschach, artistic director of the fair. “All the elements of the theme are brilliant: the combination of the body and the environment, the body and the elements, the water and the atmosphere. It is a story of a woman and a house, of a woman and a landscape, of an earth and a sky, that is universal and timeless.”\n\n\nThe Michael Jackson Foundation announced today that it will create a new $50 million fund to support critical research, conservation, and education efforts to conserve historic and contemporary artworks. To date", "The next Biennial should be the last, and so will the first. The exhibition will be relocated to the Institut National de la Parte de Paris, where the director is expected to take up the post in the coming months.The announcement of the museum’s redesign came as a surprise to many. The institution’s current facilities, designed by French architect Marcin Zemljen, were featured in a 2018 exhibition at the Museum of Modern Art in New York, but that show was focused on the museum’s previous incarnation as the Palazzo delle Papesse. In 2020, the museum hopes to open a new, modernized version of the Punta della Dogana, complete with a glass-enclosed garden and a fountains.\n\n\nThe Museum of Modern Art (MoMA) in Manhattan announced today that it is reopening to the public once more in the coming weeks, following a temporary closure due to the Covid-19 pandemic. The reinstallation of the institution has been delayed due to concerns over the coronavirus and the city’s health care system’s ability to absorb the additional 1.4 million cases that are expected to be diagnosed in the United States during", "The next Biennial should focus on the body politic, the practice of art, and the materiality of the body, and should investigate and dismantle the structures that perpetuate and support the decomposition and dissolution of bodies.”The inaugural exhibition, titled “Power to the Body: Biennial Art in the Age of Resistance” (2015), was staged at the Johannesburg Art Gallery and Museum (Jana) and will run March 27 to March 31. The biennial’s conceptual predecessor, “Conceptualizing the Body: Biennial Art in the Age of Resistance” (2008), drew from work by the early masters—among them the Russian artist Aleksandr Golub and the late American painter John Edmonds—to investigate and dismantle concepts of resistance and resistance structures. The 2013 triennial, titled “Be/longing: Art and Resistance” (2013), was organized by a group of South African artists, activists, and curators who were inspired by the Green Movement in the United States and the Black Power Movement in the United States.\n\n\nArt historian and curator Nick Turse, who has served as director of the UCCA in New York since 2007, has been named director of the Museum of Contemporary Art", "The next Biennial should be in January 2021.\n\n\nThe Museum of Toronto announced today that Tina Gillett has been promoted to associate curator of modern and contemporary art at the institution. She succeeds Emily Maturin, who was hired as associate curator of photography last month, and will take up her new post in January 2022.“Tina is a star curator and scholar whose work has been seminal in establishing the museum’s status as a distinctive international leader in modern and contemporary art,” said Museum chair Deborah Garner. “Her broad cultural and visual interests reach beyond the modern and contemporary, and reflect the breadth and depth of her career as a curator. Her research and writing make her a formidable collaborator and scholar, whose expertise and experience make her an ideal choice to be the next director of the Museum of Toronto.”Gillett will lead the museum through its transition to a new curatorial organization comprised of two new staff members, Patricia Heaton, who has worked as associate curator of photography at the museum since 1992, and Marie-Marie Ouellette, who has worked as a curator at the institution since 1980. In her new role, she will work closely with curator of modern and contemporary art Tycho Nestor", "The next Biennial should be held in 2020 and will bring together over forty artists from twelve countries for a new exhibition, “The Art of Destruction: Painting and Destruction,” which will be on view through October 30, 2020. The event will be curated by Vladislav Zemlianic, a former director of the Institute of Contemporary Arts of the Russian Academy of Sciences, and will take place at the XVII-XVI Museum of Art in Saint Petersburg.“The current program of the XVII-XVI Museum of Art is a reflection of the relationship between Russia and the West,” said Tatyana Gushko, director of the museum. “Since the XVII-XVI Museum of Art, the focus has been on the historical period and on preserving the contemporary artists’ work, but also the artistic heritage of the past. We will make new interesting presentations about the art of the future, and we will aim to create a unique environment for contemporary art in the museum.”\n\n\nThe Institute of Contemporary Arts in the Russian State Museum in Moscow has announced that it plans to open a new digital media center dedicated to the works of the country’s contemporary artists. The center will be inaug", "The next Biennial should be held in 2020. The concert will be held at the Sandberg Museum in Stockholm. Pace Roesels, the architect behind the project, is planning to continue in the city with his wife and his children. The artists who will participate in the exhibition include Ana Mendieta, Debora Graziani, Pia Camil, and Luis Fernando de Torres.\n\n\nAn artist-run school in the Russian city of Nizhny Novgorod is planning to reopen in the autumn. The school, which is run by the Nizhny Novgorod Academy of Fine Arts (NPM) and the Nizhny Novgorod State University (NOVA), will welcome visitors in 2020 as part of a reopening of the city’s National Gallery.The school will also provide free admission to students, who can take part in programming such as painting exhibitions and concerts. The museum, which was founded in 1994 by Alexander Mereschenko and his wife, Katerina, the school’s current schedule is as follows:Wednesday, March 3:\n\n11:00 am – 12:30 pm Friday, March 5:\n\n11:00 am – 12:30 pm", "The next Biennial should be held in the spring of 2020. The inaugural edition, titled A Vision of a Fox, was held in Los Angeles in March 2019 and raised more than $190,000. Next year, the exhibition will take place in New York City and will be produced by the London-based charity Animals Asia Pacific, which is supported by $500,000 from the billionaire industrialist and British financier Lord Browne. Browne, who famously financed the founding of the University of Oxford by giving $100,000 in 1993, is currently the largest individual donor to Alistair C. Hutton Foundation, the prestigious British arts center. The foundation has given £30 million to over thirty arts programs in the last ten years. In recognition of his largesse, Browne is donating his own money in support of the foundation. The donation will also provide $50,000 for the program, which will run from April 5 to April 7 and will feature work by sixty artists. It will also include a performance by the British artist Amanda Palmer. The biennial will be hosted at the Art Institute of Chicago, in partnership with the art center and the Alistair C. Hutton Foundation. The institute will"]