["The next Biennial should take place in 2019.\n\n\nThe Museum of Contemporary Art (MoCA) has released the list of seventy-five artists and collectives who will participate in next year's edition of the Metropolitan Museum of Art (MoCA), which will kick off on March 23. Titled “different futures,” the exhibition will examine how art will be crafted, displayed, and enacted in the future.“The Met has long recognized the importance of art in shaping the community and creating transformative experiences,” said Met director Daniel H. Weiss. “But with this year’s exhibition ‘Your Way,’ we are rethinking the Met’s role in bringing new and cutting-edge work to the museum. We are reimagining how art can be embraced, experienced, and stored.”The seventy-four participating artists will be selected from a pool of twenty-nine artists who have worked in the United States or have represented the United States at one time. It will be a tough call between the first and twenty-sixth. The artists are chosen for their appropriateness to the exhibition, their ability to push the boundaries of what is possible with contemporary art, and their ability to show,", "The next Biennial should be held somewhere in the UK, in a special exhibition organized by an independent organization. The successor will take place at a location that will be selected by the Prince of Wales. The pavilion will be located in the town of Hull on the Thames Estuary in the United Kingdom. The art historian Joachim Neugroschel, who curated the exhibition “ÜOn the Power of Photography: Photography, Photography,” which opened in April 2019, will serve as the curator of this iteration of the Biennial. The museum will also host a public visit with the artist Peter Sellars, who will participate in the exhibition, which runs through March 2021.“We’re looking forward to showcasing the work of this generation of artists and, alongside their achievements, they will leave us with a legacy of living art,” said Richard Kitson, chair of the board of trustees of the Biennial. “Art is a powerful way of bringing people together, and the Biennial is the perfect platform for the annual exhibition to be held. This year’s biennial will be a great showcase for the work of the new generation of artists and we look forward to the opening of the new Biennial in 2021.", "The next Biennial should aim at presenting a selection of works in the history of the artist’s art in his lifetime. Several artists have been selected for this year’s edition, which will be held in the Bergen Krupp museum in Stockholm from February 23 to March 21. The seventy-six-year-old artist will return to his home country once a year for the next twenty-four months.The exhibition will not include the works of the artist’s immediate contemporaries such as Hans Christian Andersen, Günther Förg, and Wolfgang Paalenbach, but rather the artists who have lived and worked in close association with Andersen. Among the artists to have their works included are Albert Oehlen, Colette Serra, Rafael Viñoly, and Dino Brescia. Commenting on the selection, Peter Bjerggaard, chair of the Board of Directors of the Biennale, said: “We’ve worked hard to create the exhibition that will reflect the spirit of the collection. Where ever the art is found, it is found in the house of the artist. It is a very special exhibition for him. We hope that this exhibition will serve", "The next Biennial should be held in 2020. \n\n\nThe National Gallery of Art in Washington, DC, will open a new digital exhibition, “Garden in the City,” on September 28. The exhibition, which will feature more than 100 new works by the artist, will be presented by artist-in-residence Ruth Blum and will be shown in conjunction with the opening of “The Future Is Now,” a new national collection of photographs by the artist.The show will be curated by Martha Minter, who will serve as the executive director of the National Gallery of Art, and will be presented by Blum and will open at the National Museum of History in Washington, DC, on September 3. This exhibition is part of a multiyear project, “Garden in the City,” that is the National Museum of Art’s first major endeavor to present a new national collection of photographs, and is part of National Geographic’s commitment to increasing the museum’s collection of photography. Blum and Minter plan to present the show at the National Gallery of Art and at the Smithsonian’s National Museum of African American History, which opened in 2017. The project was inspired by the novel", "The next Biennial should be hosted at the Sydney Opera House and would involve a selection of contemporary art from around the world. The theme of the exhibition would be “The AIDS Epidemic,” a reference to the Australian and international campaign to raise awareness of the human immunodeficiency virus (HIV). \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Sarah Peck as its next executive director. Peck will be responsible for coordinating programming across all divisions of the museum. She succeeds Carolyn FitzGerald, who has been the director since 2015, and will take up her new post in July.“This is a transformative time at MoMA and we are grateful to the board of trustees and staff for their inspiring leadership during the past eight years,” said Peter F. Rubens, chair of the board of trustees. “With the appointment of Sarah Peck, we are poised to continue to grow and thrive as an institution that celebrates the legacy of American visual art and the contributions of women artists to the art of the past. We are thrilled that Sarah will continue to be integral in the museum’s transformation from a museum of American art into a museum that celebrates and honors the art of the future", "The next Biennial should take place in February 2020. The five-month event will encompass works on art and culture and will showcase more than sixty artists. The first round of the show will include work by forty artists, curated by Sidney Smith.The Artist's Market will continue to operate under the banner of the artist-run organization and will present its biennial, “SOUTH, Southeast, South,” in March 2020. It will also include the multi-media presentation of “Julian Gollop: A Retrospective” and “Mary Cassatt: Gallery Seating.” \n\n\nThe Museum of Fine Arts (MFA) in New York has received a $1 million donation from the Andrew W. Mellon Foundation. The gift, which also includes $500,000 for grantmaking, was made in support of the institution’s arts and culture in the city, as well as its community of local artists. The gift is a continuation of the foundation’s efforts to support museums in the city as part of its Culture in the City initiative. MFA has received $1.2 million from the Andrew W. Mellon Foundation since it began awarding grants in 2017.\n\n\nChina’s", "The next Biennial should take place in the fall of 2020. The theme of the first edition, “The Liao Family,” was a common one: the family of Li Àng and Li Öng, the founders of the modernist Chinese art dynasty. Most recently, they have been associated with the work of contemporary artists such as Gu Hao and Li Ai. Artist Giada De Sousa, who has traveled to Italy to study with Andre Gide, has also expressed a desire to collaborate with the Li family.\n\n\nThe Museum of Modern Art (MoMA) in New York announced today that it is planning to institute a new series of exhibitions devoted to the legendary American blues singer and songwriter Ella Fitzgerald. The institution will invite the public to experience Fitzgerald’s work at the landmark location, which was completed in 1937, in 2020. The exhibition series will be led by Paul Williams, director of the Museum of Modern Art, and will feature works penned by Fitzgerald, including the work À la bête noire, 1967, which will open on September 11, 2020, and “The Great Gatsby,” which is slated to open in February 2021.“The show will", "The next Biennial should take place in the autumn of 2020. The project will include the construction of a museum dedicated to the history of science fiction, where all the major works of the twentieth and twenty-first centuries\u0097including Akashic Productions, The Rise of the Third Reich, and Elusive Virtues\u0097will be exhibited.The structure will be located in the city of Delft, in the Netherlands, and will consist of five buildings, the pavilion for the exhibition of the artist’s work, the building for the museum, a gallery, and the executive offices. The building will be divided into twenty-four digital spaces, each equipped with a dedicated area for the exhibition of artworks and other performances. The museums will collaborate in the design of the exhibition space, the exhibition area, the installation area, and the cafés. The project will also involve the development of communications between the museums and the city of Delft.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has reached a settlement with the heirs of the late French revolutionary Georges Pétain, who was a key supporter of the American Civil Rights Movement.The heirs of Pétain, who was a leading member of the Group", "The next Biennial should be in 2021. The International Museum of Modern Art (IMAM) in New York will be the next iteration of the Art Exhibitions, which is currently in its second year. The show will return to the New York metropolitan area in 2021. The exhibition “Intersection of Art and Politics,” curated by Patricia Arquette, will be staged at the Shaughnessy Gallery in New York from January 26 to February 24. KH Gallery, which is currently closed until February 25, will be open for an additional sixty days. In the United Kingdom, the Tate and the National Portrait Gallery will be open for an additional sixty days.  \n\n\nThe Tug of War, a contemporary American art biennial, has announced that it is delaying a 2019 edition to 2020. The 2019 event, which was relocated from its original venue in New York to a renovated Tate Centre in London, opened on June 10, 2019 with a presentation of the work of five artists, including Andreas Eriksson, Andre Gide, and Rosalind Flegr, and is currently underway. Inaugurating the event were a number of New York–based talks, such as “Gina Be", "The next Biennial should be held in 2021.\n\n\nThe Museums Association (MA) in London is demanding that the government announce immediate and long-term solutions to prevent the spread of Covid-19, the virus that causes the coronavirus to attack the respiratory system, including the brain, and has launched an online petition.MA director Kate Fowle told the Art Newspaper that the government must start by releasing emergency funding to the museums. If funding is not immediately made available, the association is calling for a national day of commemoration on April 14. The petition states: “Covid-19 has caused an unprecedented global crisis. The crisis has had devastating consequences for individuals and the wider environment. We are calling for a national day of commemoration to reflect on the international response to the crisis, and to reflect on how we as a country as a whole are preparing for and coping with the impacts of the virus.”Civid-19 has caused an unprecedented global crisis. The crisis has had devastating consequences for individuals and the wider environment. We are calling for a national day of commemoration to reflect on the international response to the crisis, and for how we as a country as a whole are preparing for and coping with the impacts", "The next Biennial should be held at the Montreal Museum of Fine Arts (MMA) in January 2021 and the first exhibition should open in 2020.The Montreal Art Institute (MMA) is planning to open a new iteration of the annual event in 2021. Its new theme, “Montreal: an Infinite City,” will be taken from the Gish Gallery’s recent exhibition “Montreal, an Infinite Land,” and will be presented in conjunction with the MCA’s annual evening of lectures. The theme of “Montreal: an Infinite City” is a reflection of the Gish’s proposal to explore the possibility of “montrealization”--the notion that all of Montreal, and especially the city of Montreal, could be transformed into a museum.“Montreal: an Infinite City” will offer a rethinking of how we think about the city. We will think about it in terms of allusions to the city and its history, as it were, to imagine a city that is not a museum but rather a place that is both in and around us.”The first show of the new material is a three-dimensional, thirty-six-foot-by", "The next Biennial should be held at the Centre Pompidou in Paris in the spring of 2022. Dr. Riada Daoud, head of the department of art history at the Museo de Arte Contemporáneo de Barcelona, Spain, said: 'A truly creative and creative-minded city needs a building that offers a new and exciting way of thinking about art, and that reflects the architectural spirit of Barcelona. Corruption and violence are the direct threats that the city faces right now. We hope that this exhibition will help mobilize the city against these threats, and support the work of the art historians, architects, and curators whose work the city needs to reflect the fundamental values of a vibrant Barcelona. ”\n\n\nPérez Art Museum in the City of New York has added a new member to its board of trustees: collector and collector-turned-entrepreneur Elizabeth Benitez. The museum’s board director, Andrew Kreps, announced the appointment on Wednesday, May 31, after it confirmed that Benitez, a Colombia-born collector, had been appointed as the museum’s next board president. She succeeds Sylvia Hsu, who announced on May 3", "The next Biennial should be held in 2020. \n\nThe National Gallery of Art in Washington, DC, is currently closed until at least February 16 due to a Covid-19 outbreak nationwide. According to the Washington Post, the number of cases of the novel coronavirus in the District of Columbia has risen to 7,000 and the number of people infected in the United States has reached 9.5 million.As a result of the coronavirus outbreak, the D.C. Department of Public Health is now asking the public to avoid hospitals for a week after giving medical students and other high school students a week off, March 14–March 16.A second public health advisory, issued on March 10, advises residents to avoid outdoor activity and to limit the amount of time spent indoors. The public can also prepare for possible power outages during the coronavirus pandemic, and can use this week to review their emergency plan.\n\n\nThe city of New York has received a record $65 billion in emergency funding to help mitigate the coronavirus pandemic. On Thursday, Governor Andrew Cuomo announced that the city will absorb another $15 billion of the coronavirus, which has spread to more than 250 countries, and will spend the additional funds to", "The next Biennial should take place in the spring of 2021 and will incorporate both original and modern works in a biennial setting. Artists participating in the event will be announced in the coming months. The biennial’s theme, “Themes of Trans-Regional Politics and Their Relationships,” will reflect the current global political situation, the global crisis caused by climate change and the current state of affairs in Pakistan. The exhibition will also include a new collection of work by Afzal Guru, a Pakistani artist working in the US and internationally, and will be organized in partnership with Boston Art and Culture.Guru, who is currently based in New York, was invited to participate in the 2017 event after he was selected for his artworks in a book by artist Robin Ingersoll. He was selected by a jury of art critics and curators in partnership with Boston University. The jury awarded the prize to American poet and activist Julia Salter. The 2019 event featured work by Mohebbi, Taimur Rahman, and Zoya Rashid. \n\n\nA group of artists, designers, filmmakers, musicians, writers, and other cultural workers are striving to persuade the French president", "The next Biennial should take place in Tokyo in 2021. The artist’s first major solo exhibition in the city, the '60s exhibition “Art and the Future of Man,” was the brainchild of the late Japanese architect and theorist Masaoka Yūji, whose influence on his later works can be felt in the contemporary design and architecture of Mikado High. \n\n\nArtist and curator Pilar Primo has been named the winner of this year’s Red Hook Arts Initiative in New York. The $10,000 honor comes with a $5,000 cash prize and a solo exhibition at Red Hook Arts in the fall of 2020. The full list of participating artists is as follows:Haim and Zelda Spero. Edinburgh artist and curator. Benedict Anderson. Leretta, Italy/United States.\n\nThe Museum of Modern Art (MoMA) in New York has introduced a new initiative that will allow museums and galleries to share information about upcoming events through a digital platform, and will offer direct support to artists and art-lovers in New York City.Under the direction of artist and curator Zina Saro-Wiwa, who will curate the inaugural exhibition,", "The next Biennial should take place in the Grand Palais in Paris in 2021 and will be curated by Hélio Oiticica and will be led by former director-general of the museum Joséf Alberich.\n\n\nThe British artist Rebecca Black, whose paintings and sculptural works embody a philosophical and political vision of a more humane, socially engaged world, has died at age eighty-one. She was created in the Los Angeles area by Robert McAllister, the Los Angeles native who pioneered motion work and film, Black was a leading example for artists seeking to address issues of race and the role of art in these political and social times. “Her art has always positioned herself as a critical and sometimes even radical counter-point to the dominant, racist, capitalist aesthetic of American art,” said curator and critic David Koepp. “Within the tradition of movement art, she is a shining example of an anti-racist, anti-imperialist avant-garde that was influenced, along with its predecessors, by a deep, long-standing anti-imperialist political and intellectual commitment.”Born in London in 1936, Black began painting at the age of fourteen. In 1942, she was commissioned to create a", "The next Biennial should be held in 2020.  “The future is now,” said Mihai Galati, Director of the Biennale Taipei. “I am pleased that the next Biennale will focus on the critical role of modern art and its immediate and long-term future, rather than on the past or future.”Galati said, “The exhibition will be about how art has entered the lives of children and adults of today, and how art has been shaped by their own imaginations. It will also consider how art may one day be used as a tool for social change.”The Biennale will be hosted at the Māori Art Museum, Auckland; the Nelson-Atkin Museum of Art, Nashville; and the Museum of Contemporary Art, Auckland. The deadline for the exhibition is November 23.\n\n\nThe International Committee for Museums (ICOM) announced today that it is launching a new two-year fund designed to help support the cultural and archaeological recovery, restoration, and conservation of archaeological heritage sites across the globe. The fund will be managed by the Icons, an international network of donors that work in cooperation with national and international museums and archaeological", "The next Biennial should be held in 2021. \n\n\nThe work of Australian artist Kate Crawford, whose expressive, surrealistic paintings and collages showcase a broad range of narrative, has been selected for the 2019 Whitney Biennial, which is held in collaboration with the Royal Adelaide Museum. The exhibition’s twenty-sixth iteration, “The Great Mummy: The Untold Story” will open at the institution in December and run through March 2020. The Biennial’s inaugural exhibition, “Vertigo,” curated by Nicoletta Savignan and featuring work by forty-one artists, including Scott Lartigue, J. M. Barlow, Guy and Mimi Barlow, Becca Bass, Robert Barry, and Kath Egerton, is currently on view until January 23, 2020.The next Biennial will be hosted at the Royal Albert Hall in London from January 26–February 29, 2020 and will include two exhibitions: “The Human Hand in Art” (January 28–February 29) and “Mummy or Modernism” (January 28–February 29).\n\n\nThe Baltimore Museum of Art (BMA) has revealed its 2020 programming. The institution has been struggling to balance the", "The next Biennial should take place in San Francisco in the spring of 2021. The seventy-ninth will be staged in Berlin in the spring of 2022.\n\n\nRaquel and Francis Jacobs’s first project together, \"One Flew Over the C-Shore,\" premiered at the Museum of Modern Art (MoMA) in New York last month. The program, which presented work by thirty-three artists including Hank Willis, Kiki Smith, and John Akomfrah, explored the concept of the 'one body, one mind, one soul, and one self—the core concepts of the Jacobs’s latest book.”The exhibition, titled “One Body, One Mind, One Soul: A Peculiar Concept,” was centered around the artist’s interest in the relationship between body and spirit. In a review on the show, Artforum wrote: “The show plays with the notion of a collective body, the collective mind, the collective soul—at the center of a universal energy matrix that runs through the universe. ‘One Body, One Mind, One Soul: A Peculiar Concept’ is a philosophical exploration of the structure of the mind, the body", "The next Biennial should have a new theme, a new artist, and a new collection of art. “The art of the current exhibition is very clear: it is the second exhibition in the series. The exhibition was led by Andre Breton. The subjects chosen are plants and animals, spirits and souls. Their works are collected by Bosch, Beelen, and others, and in some instances by the same artist, the years 1909 to 1913. The architecture of the exhibition is not different from the original work of the artist, which is also sorted in both the museum and the exhibition. The architecture consists of sculptural elements that have been adapted to depict different scenes and to have been adapted since 1893. The structure of the exhibition is the same as in the exhibition. In the new exhibition, the work of Lévy Groupe will be presented in three of the six floors of the building, as well as in a special exhibition that will be held in the museum on March 14 and of Karl Kallmann in the Öststlunda. The programme of the Biennial will be the same as in the most recent exhibition, except that in the Festival will be devoted to the two most recent events: the", "The next Biennial should be inaugurated by a presentation of the artist’s work by an established artist, not an emerging artist, and should be an expression of the creative spirit of the city. This year’s pavilion will include works from the collection of Geert Kittele; from the permanent collection of the Danish curator Jørn Bode; and from the König-Bode collection, including works by Erich Köge and David LaChapelle.\n\n\nA group of artists, designers, filmmakers, writers, and other cultural organizers have launched an online petition calling for Oslo’s municipal government to divest from Østfold, the Norwegian government’s oil and gas company that has a controversial history of human-rights abuses. In a statement, the signatories claim that the divestment would not only help end the brutal repression of the Kurdish population in Norway by the Norwegian military, but also that the move would protect the local community.“The municipal government is supposed to be a neutral, neutral platform for the art and cultural sector,” Margot Pfeifer, director of the American Foundation of Kurdish Arts, told the Art Newspaper. “But the recent attacks on artists and", "The next Biennial should be held in 2021.\n\n\nThe Flemish artist, who often depicted nude women and other naked objects in his works and is widely celebrated for incorporating eroticism into social and political activism, will be the subject of the upcoming exhibition “When Worlds Collide,” which will be on view in the Flemish Museum in Frankfurt from March 21 to March 24, 2020. The exhibition, which was awarded theprize of the Flemish National Prize for 2010 and the Flemish Art Prize for 2017, was selected by an international jury chaired by Kjetil U. Jonsdorf, director of the Künstlerhaus in Kassel, and collector Klaus Schulze. The jury comprised Kjetil Jonsdorf, historian and curator, Kolya A. Akhmetov, curator of modern art and architecture, and Christa McAuliffe, founder of the museum.The artist will be depicted in the exhibition “When Worlds Collide,” which will feature paintings by thirty-three artists, including Richard Avedon, Josette Østbye, Lukaria Adamek, Tunga, Paula Scher, Tereza, Iwona Vassallo, and", "The next Biennial should be held in the summer of 2021. The first will be held in November 2020.“We are very much looking forward to the 2020 exhibition,” Adeline Ooi, the director of the Biennial, told the Art Newspaper. “The theme of the exhibition will be a contemporary story based on women, and will start from the present and will be an open-ended project. Biennials are an international tradition and the theme of the exhibition will be a contemporary story based on women, and will start from the present and will be an open-ended project. Biennials are an international tradition and the theme of the exhibition will be a contemporary story based on women, and will start from the present and will be an open-ended project.”The event will open with a presentation of a selection of works by the artists and will explore how themes of gender and sexuality have shaped art for women and art for men over time. The show will return to the Museums in the City of Shanghai in 2021.\n\n\nThe Netherlands-based nonprofit organization Artnet is launching a new digital platform designed to help artists and art dealers navigate the global insurance landscape. Called Artnet Insur, the platform will pull together relevant data", "The next Biennial should take place in the summer of 2021, when the museum will be hosting a major exhibition on the demonstrations and struggles of the Paris Commune and the Museum of Fine Arts in Paris. The theme should be “The Symposium of the Parisians,” a reference to the famous 1972 demonstrations in the city. The festival should be hosted by the Museé de l’Architecture et l’Histoire (MAH), the museum’s parent company.The biennial “has always been about the future. We are not interested in the past,” Nakatsumi said. “This is why art is so important to the Parisians. They are always asking for new ideas, new solutions, new ways of thinking about art, and they give us an opportunity to think about the past.” In a statement on the biennial, MASS MoCA’s president, Thomas M. Mulholland, said: “This is a historic year for MASS MoCA. We are thrilled to be able to present this work at MASS MoCA, and look forward to presenting further collaborations with revolutionary artists and new artists in 2020.”\n\n\nThe Serpentine Gallery", "The next Biennial should be held in the spring of 2021. In the summer of 2021, the first exhibition should be held in the autumn. The museum will conduct a series of exhibitions in the spring of 2021, of which the last two sections—“Between the Sea and the Sky” (2019) and “Between the Sea and the Moon” (2017)—were instantly recognized as masterpieces.\n\n\nThe New York City Department of Cultural Affairs (DCLA) announced today that it has given the green light to the redevelopment of the Central Park Conservancy’s historic buildings, known as the Pedestrian Arch, by Redevelopment Authority (RA), a $70 million boost in funds. The redevelopment of the building’s grounds, which were completed in 2006, is slated to begin in the fall of 2020 and will involve the demolition of the building’s two-story, fifty-two-foot-tall Central Park Entryway, the third-floor Common Gallery, and the basement apartments currently used by the Pedestrian Arch.Redevelopment Authority will also restore the building’s original landscaping and create new public green spaces. The authority will work with local and state officials", "The next Biennial should organize a series of exhibitions that would focus on “non-Western art,” including “Land,” a special project that would reflect on the relationship between art and land, and “Theoretical Art,” a monthlong event that would address “theoretical physics,” the organism, and life. In the lead-up to the event, the nonprofit will host biennial presentations by artists who will have been selected by a jury comprising Christopher Knight, Art of Life, and Chris Ware, among others. \n\n\nThe London-based arts organization Royal Festival Hall has announced that Natalie Bennett will serve as the inaugural director of the biennial, “The Big Issue,” which will open in November 2020 and run through March 2021. The biennial’s inaugural edition will feature work by sixty artists. “The theme of this year’s Royal Festival Hall Biennial is large-scale, intense and sometimes complex,” Bennett said in a statement. “As a curator, I am deeply excited to work with the talented team at the Royal Festival Hall and the London-based artists and institutions who will create a new and exciting chapter in their history.", "The next Biennial should take place in 2020 and the first in 2021. The dates of the first and second editions have yet to be decided, but they are expected to take place around the twenty-sixth and the twenty-ninth anniversary of the revelation of the first novel.The announcement of the exhibition, which will be divided into five quarters\u0097which will comprise of fifteen works\u0097follows a year-long campaign for the exhibition. The first section of the show, “The Alien Fits the Picture,” was announced as part of the New York Museum of Modern Art’s reinstallation of the institution’s collection in March. The second section, “The Movie,” was announced as part of the New Museum’s reopening in May. The third section, “The Life,” will be staged at the Contemporary Art Museum Pittsburgh next month and “The Memory,” will open at the Kushner Museum in October.The fourth section, “The Window,” will open at the Broad in March. The fifth section, “The Color,” will open at the Metropolitan Museum of Art in May. The sixth section, “The", "The next Biennial should be held at the venue in 2021, and a further iteration of the exhibition should take place in 2024.   Georgia O’Keeffe’s Last Post (1947–1951), which won the prize in 2011, will return for a second edition in 2021. The winner of this year’s prize, an exhibition of roughly thirty works by thirty-eight artists from fifteen countries, is Acts and Diagrams, featuring Alex Karstoff, Taima Hassan, Arnaldo Magalhaes, and Carly Simon.By the late twentieth century, the American artist Robert Irwin—who, in addition to his own body, was the subject of three biennials, including “Communications,” (1961) and “The Art of Being Blue,” (1981)—was a well-known fixture in the field.  A curator at the Whitney Museum of American Art in New York, he was also a prolific author, whose works have been collected by many and are currently on display in the exhibition “The Art of Being Blue: ‘Avant Garde’s Robert Irwin.”", "The next Biennial should be held in 2021 and the next in 2023. The announcement follows a record-breaking year for the exhibition, which raised more than $1 billion for the Arts and Humanities Research Council. Matt Brittin, director of the Biennial and the Art Institute of Chicago, said: “I’m thrilled that we are able to raise the funds to bring these exciting and under-recognized artists to our beloved city. They represent the most diverse and ambitious artistic narratives of our time. We look forward to honoring their achievements in the years to come.”\n\n\nThe Metropolitan Museum of Art (the museum) in New York has introduced a new digital service that will allow visitors to re-visit the works of forty-three artists over the course of two years. The program, titled Art for the Future, will be free to the public and will be modeled after the Metropolitan Museum’s Buckingham Palace ’s Art of the Future program. The service will feature a number of new digital initiatives designed to engage with the exhibition’s collection and its exhibitions, including a publicly accessible online catalogue documenting the artists’ practices; a free digital audio commentary series that", "The next Biennial should be held at least once a year in the fourth quarter of the year. The pavilion should also include a dedicated audience room so that visitors may have a space to have a meaningful exchange with the artists. “We are seeking new and innovative ways to present contemporary art and are focused on creating new ways for people to connect with art,” said Fintan Tonnga, who serves as the International Director of the Biennial.  The pavilion will also explore new platforms for the exhibition workshops and will create new collaborations with emerging artists and art institutions.The biennial will be hosted at the MCA from March 19 to March 21, 2020. The exhibition will be inaugurated by the newly commissioned work by the Danish artist Lars-Erik Sæenbjørn, “On Fire.” The work will be on view in the exhibition “ON FIRE” until April 15, 2020.Sæenbjørn will also present the first work by the Norwegian artist Adam Gilkes at the pavilion, titled “Anna Karenina.” Gilkes is known for his large-scale public installations such as his massive “On Fire” near Copenhagen;", "The next Biennial should focus on the history of photography and visual art from a feminist perspective, expanding on the theme of the museum’s current exhibition “Women’s Portraits.” The software development company iCAD will create a digital platform that will allow visitors to view and purchase works by Corneille Blondel, The Witness, Joan Miró, and Simone Leigh, among others.The exhibition will also feature a selection of work by female artists whose work is currently on display in the museum. Among the works that will be on view are photos of painter Eileen Atkins, who is best remembered for her work The Window Cleaner, 1957, which is one of the last works by the influential Brooklyn-based artist to be shown at the museum.Responding to the exhibition, CCA said: “We’ve created a platform that will allow women artists to explore and appreciate their own histories. It will also showcase work by women artists that have previously been under-represented within the collection. The Biennial will offer a platform for artists to show their work for the first time and for those who have never had the opportunity to view it. We expect the experience of viewing these works will be inspiring and transformational.", "The next Biennial should take place in 2020.  The curators are currently working on creating a digital version of the exhibition in order to present its full collection.  No date has yet been announced for the 2019 edition, which will take place in the city of Milan.\n\n\nThe National Galleries of Scotland have completed the design of their new 140,000-square-foot facility, which will open in 2020, and are currently finalizing specifications for their 2019 exhibition, “The Short Answer.” The show will highlight the development of digital arts and will be based in the National Gallery of Scotland. It will be hosted by artist-run programs, including new artist-in-residence programs, and will be presented by the National Gallery’s international curators, Anna Atkins and Ciarán Finlayson, and will be centered around a single theme, a six-minute video clip from the film Short Answer.Founded in 1987 by artists Adam and Charlotte Carey in a barn in Glasgow, the gallery is one of the few remaining museums in Scotland that retains its original location in the capital city. The museum is now one of the largest arts institutions in the United Kingdom. The main building facing the River Clyde, the National Gallery", "The next Biennial should be held in the spring of 2022 and should include a selection of works that are currently on view in Tate Britain. The theme of the festival will be “Art and Health: Rejuvenating the Body” and it will have the theme of the museum and of healing. It will also be hosted by the Museums Association in partnership with the Tate. The first episode of the biennial will be on May 20, 2022 and the second on May 25, 2022. The full list of participating artists is as follows:\n\n\nThe Tate’s new £3 billion expansion, unveiled on Thursday, June 16, aims to help the museum continue to thrive by introducing more flexible, mobile and online viewing experiences, strengthening its collection and exhibitions, and expanding its public realm.The facelift, which was led by Sir David Adjay from June 10 to June 12, was funded through a combination of £2 billion and £1 billion, with £1 billion of that coming from the National Lottery Fund. The National Lottery Museum (LMM), which is closed until July 6, was left with a further £500 million after announcing plans to close its doors permanently in March.The Tate’s budget for 2022 has increased", "The next Biennial should be on the history of art, the art of the present, and the art of the future. ”\n\n\nNew York–based artist and curator Agustín Portillera, who makes works that involve complex interconnections, this year’s Arts+Arts Art Museum Arts & Performs Arts & Performs (AMP&A) pavilion, which was inaugurated by the artist Maren Ade in January 2019, is making a major splash with its inaugural exhibition, “Inside the Mind of Agustín Portillera,” which will open in August. Titled “The Labyrinth of Agustín Portillera” and curated by Nadine Overton, the show will feature 80 works by the seventy-seven-year-old American artist, whose techniques often draw from religious texts, mythologies, and her own experiences to create worlds and places outside of her own.The artist’s work is often compared to that of the late Italian Constructivist, Beppe Grisar, whose paintings often carry a “voodoo” feeling. “It’s a question of how much we can pull from the past,” Portillera", "The next Biennial should be held in the spring of 2022. The first Biennial, “The Prescription of New Things,” was staged in the spring of 2012, and the second, “The Archaeological Study of Religion,” was staged in the summer of 2013.\n\n\nA man who was arrested for allegedly smashing a statue of Edward Colston in Bristol on Tuesday morning was released without charge after posting bail at a city centre court on Wednesday morning, the Bristol Post reports. The defendant, Geordie Taylor, was detained at the city-centre branch of the Royal Museums of Natural History in London around 7:45 AM after a complaint was made about the alleged assault by a man of African descent a few days earlier. Taylor reportedly told the force he was acting in self-defense after the incident.According to the Daily Mail, Taylor was charged with assault occasioning actual bodily harm and was released without bail with the condition that he remain at the scene and not return to the city. The charge was later increased to assault occasioning fear, anxiety or distress, and he was released without bail again on July 31.The statue of Colston, a slave trader and wealthy collector, has been the subject of protests from politicians", "The next Biennial should open in early November 2019, and the first exhibition should open in early December.  Chairman of the board of directors Bazio Maia and head of the modern art department Adriana Cicutto, respectively, said: “The scope of this exhibition is huge, and I was keen to see how the museum plays an important role in the restoration of the museum’s collection. This is an opportunity to show the work of the gifted, and to experiment with new things.”\n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Cynthia Schaechter as its next director. In her new position, Schaechter will be responsible for shaping the museum’s programming and public image in order to better reflect its mission and the legacy of the late American avant-garde artist Andre Gide, who died last year at the age of eighty.“Cynthia’s passion for art, her tenacity and dedication to artmaking, and her ability to connect art and community are unparalleled,” said MoMA director Matthew Teitelbaum. “Her appointment signals a new chapter for the museum, one that will be guided by her vision", "The next Biennial should take place at the newly restored St. George's Theatre, which was built in 1803 and completed in 1804.  \n\nAdvertisement\n\nThe Venice Architecture Biennial, which celebrates the city’s architectural heritage, is preparing to launch in April. Its inaugural edition, titled “Labyrinth of Architecture,” will be held at the Renaissance basilica in Venice from April 23 to April 26. The theme of the exhibition will be “Art and Architecture in Transition,” and the first exhibition will feature works by twenty-six artists.The seventy-third Venice Architecture Biennial, “Examining Architecture,” will be held at LAXAM, the Venice Design Museum, from April 26 to April 29. The show will also feature the first public exhibitions of work by artists from twenty-six countries.According to the organizers, the exhibition will be “filled with traces of an art historian”\u0097 particularly the phenomenon of the ‘art of the Modernist,’ and will reflect “on the way art is made and the way it is reflected.” This is the third edition of the Venice Architecture Biennial, which was organized by the Venice Architecture Museum in cooperation", "The next Biennial should be held in 2020.\n\nThis article was updated on April 21, 2020.\n\n\nThe Skolem Art Center in London is organizing a biennial of works by the Swedish artist Rineke Dijkstra. The work of the artist, who is known for her account of her experiences as a slave in the late nineteenth century, will be included in the event, which will take place in November 2020, and will be on view in the January 2021 edition of the exhibition.Dubbed “Rineke Dijkstra: A Biennial,” the event will take place at Skolem from January 28 to March 26, 2021. The initiative is part of a larger project underway at the Skolem Art Center to preserve and exhibit the work of contemporary artists in a way that is both collaborative and open to the public. The exhibition will showcase contemporary artists including Arsht Black, Nils Stærk, and Michael Ondaatje.\n\n\nThe Museum of Contemporary Art (MoCA) in New York has appointed Elizabeth Hollander as its new deputy director for collections and exhibitions. Hollander comes to the institution from the Museum of Fine Arts in Boston, where she has served as deputy director of collections", "The next Biennial should be in the spring of 2021, Khosla said. The board approved the $500,000 2018 grant, which was paired with $250,000 for a new exhibition, in February. Khusla said that the new program will emphasize the work of conceptual artists and will focus on the work of a select few. The board also voted to give $200,000 to the Center for Contemporary Art in the City of New York for a new exhibition, titled The Artist Uneasy. The new program is a follow-up to the Center for Contemporary Art, which launched in the same building’s courtyard in 2016 and has six exhibition space across the building.\n\n\nThe Metropolitan Museum of Art (the museum) in New York has launched a new digital platform for the museum’s Icons series, which celebrates the work of fifty-one contemporary artists. Titled Metamorphosis, it will launch on May 22 and will be available for free to the public, and will feature works by artists such as Sean Kelly, Jonathan Livingston, Rachel Whiteread, and Nada Rivera.The platform will feature new works by seventy-eight artists, including Peter Sohn, Antony Gormley, André", "The next Biennial should take place in the Red Sea region of the Arabian Peninsula, as part of the First International Congress for the Arts in the United Arab Emirates (CAFE), which will be held in Abu Dhabi from February 20 to March 21, 2020. The twenty-fifth edition, titled Theoretical and Cultural Evolution, will be held at the Museum of Modern Art in New York from March 23 to March 28, 2020.Dubai: The Kingdom of the Two-Hundred-Sixth Dubai: The Kingdom of the Two-Hundred-Seventh Dubai: The Kitab; Dubai: The Empty HourDubai: The Beautiful CityDubai: The Empty HourDubai: The Beautiful CityDubai: The KitabDubai: The Empty HourDubai: The KitabDubai: The KitabDubai: The KitabDubai: The KitabDubai: The KitabDubai: The KitabDubai:The KitabDubai: The KitabDubai: The KitabDubai: The KitabDubai: The KitabDubai: The KitabDubai: The KitabDubai: The KitabDubai: The Kitab", "The next Biennial should take place in 2020. The next will be in 2022; and the third will be in 2023.\n\n\nThe US House of Representatives voted yesterday to establish a national museum devoted to human rights in America, and to establish a commission to research the history of the institution. The legislation, which was unanimously passed on Wednesday and now goes to President Donald Trump for his signature, establishes a commission to research the history of the US from 18th century slave narratives to the twenty-first century and to recommend policies to ensure that the history of the institution serves as a model for how the nation should pursue human rights goals.Introduced by New York representative Frank Pallone, the legislation authorizes the creation of the museum at a cost of $2.5 million and requires that the museum be located on federal property and open to the public. The museum would be a subsidiary of the Smithsonian Institution and would have a staff of ten and an annual operating budget of $9 million.The legislation does not specify what role the Smithsonian Institution would play in the museum, but it does say that it would work with the public to shape the institution’s historical narrative. It also says that the museum would be given $3 million for the first phase of", "The next Biennial should consider how to present the work within a contemporary context of the collection, and how to activate the collection from within contemporary traditions. “The work is my home, and I want to set it free,” she said, adding that her next show will be a “menstrual, meditative work.”\n\n\nThe Pérez Art Museum in Buenos Aires, Argentina, has hired Adam Toguo as its next director and CEO. Toguo, who has been serving as the museum’s interim director since January 2021, previously worked at the Art Institute of Chicago where he helped the museum raise more than $40 million for its expansion and to secure the museum’s future. He also served as the director of the Los Angeles County Museum of Art (LACC) from 2006 to 2010.“In his new role, he will be responsible for developing the museum’s programming and the planning for a twenty-nine-city tour, which will be led by Sarah Sze and will take three years to complete, and will serve as a liaison between the museum and the city of Buenos Aires,” the museum said in a statement. “The museum has long held", "The next Biennial should take place in 2021, and the year of the faun will be marked with a festival of the artist’s works. The venue will be decided by a two-person panel comprising artist, director, and curator Adam D. Goodman, curator of modern art at the Museum of Modern Art in New York; Lynne Baldwin, curator of modern and contemporary art at the National Gallery of Art; and André Breter, president and CEO of the Association for Contemporary Art. The dates for the 2019 and 2020 editions were not announced.\n\n\nThe Institute of Contemporary Arts (ICA) in London announced today that it has received a gift of forty paintings by ninety-two Picassos, which were donated by the Italian designer Cindy Sherman, who has a large collection of the work and has been an avid collector of Italian art in Europe and the United States. The gift includes works by Agostino Cattelan, Stefano Cappola, and Stefano Cipolloni, as well as fourteen works by Sara Cattelan, Francesca Cipolloni, and Marta Cipolloni, all of whom lived in Italy between 1957 and 1964, and a number from the Capp", "The next Biennial should take place in 2020. Its program will consist of a retrospective of the work of four of the exhibition's artists, and will entail the following themes:\n\n\nUntitled, 2017. Photo: Amanda Hopkins/Danish Institute. Courtesy of Martin Käder (Danish Institute), and the Danish Ministry of Culture.\n\n\nAfter the museum withdrew a sculpture by artist Bertrand Goldberg following a public outcry, the French Ministry of Culture declared that it would free the work from its museum and return it to Goldberg. The move came after France summoned the envoy of Bertrand Goldberg to Paris to discuss the exhibition “The Last Days.” The piece, a bronze figure in a grassy grove, was part of a series on the long-term threats posed by climate change and was shelved in the country until June 27, when it was returned to the artist.French Culture Minister Franck Riester announced that the ministry had authorized a “special review of the external environment.” He also said that the ministry would provide a list of twenty artists who were invited by Paris’s Museum of Modern Art (MoMA) to participate in the upcoming exhibition.Riester stressed that the decision to", "The next Biennial should take place in the fall of 2020.\n\n\nArt-world veteran, philanthropist, and educator Peter Dreher and Houston-based artist Tanya and John Kremer are among the twenty-two artists who will receive grants from the $7.5 million Artists’ Fund. The fund, established in 2013, pioneers new methods of supporting the arts through commissions, grants, and other initiatives with a $4,000 cash award. For its first grant cycle, the fund distributed $1.5 million to seventeen artists, including Henry Luce, Fred Wilson, and Bob Dylan; $750,000 to the Harlem Renaissance Society; and $500,000 to the Museum of Modern Art in New York. The fund’s next cycle will aim to raise $4.5 million through private donations. \n\n\nThe Institute of Contemporary Arts (ICA) in London has appointed Mary Anagnos as its new president and CEO. She succeeds David McAllister, who departed the institution on November 14 after eleven years to explore new opportunities in the creative economy, and will begin her tenure in January 2020.“Anagnos is a global leader in the field of modern art and the culture sector and a friend", "The next Biennial should be live on the new museum from March 16 to March 18, 2020.\n\nThe Tokyo Metropolitan Museum of Art (TMMO) has revealed that it is preparing to welcome visitors to its new ground-floor venue, the Hiromasa Museum of Contemporary Art, in the summer of 2022. The TMMO, which has been struggling since it opened in the Harajuku district of Tokyo in 1991, has been working toward moving the museum from its current location on the second floor of the cultural center to the ground floor of the building, which is slated to be completed in the 2020s.The project, called the Hiromasa Project, will involve the renovation of the building, which is being designed by the company Kishi Rebuild, as it will be transformed into a museum dedicated to the exhibition of contemporary art. The city of Tokyo initiated the Hiromasa Project in 2018.The new museum will be built on a site that previously housed the Hiromasa Art Museum, an independent arts and culture center founded in 1964. In addition to the existing collection, it will feature a collection of modern and contemporary art, including works by Tito Puente, Juan Pérez, and Pia Camil. The Hiromasa Museum will", "The next Biennial should be held in 2020 and the date for the Symposium will be August 29–August 31, 2020. Participants will include: Bradley Watkins, Elina Agustín, James Loewy, Hannah Macgregor, Elle Prouvé, Justine B. Jackson, Laura Owens, Gerhard Richter, Erika Zier, Lydia Zwirner, Léa Spawthorpe, Léa Tschipper, Nina-Anna Vogel, and Alexander Yoo. The 2020 edition is organized by the Berlin-based artist-run platform Artforum and will be held at the German Federal Ministry of Culture, Berlin; the Berlin Fine Arts Museum; and the Bucharest Film Festival. The 2019 edition was curated by Sandra Hobsbawm, who is best known for her installations that employ performance, imagery, sound, photography, video, sculpture, and performance to address contemporary concerns such as climate change, feminism, gender equality, and social justice. In 2020, Hobsbawm will present the “Take Back the Night” exhibition", "The next Biennial should take place in 2021, and the first in 2022. \n\n\nThe New Museum in New York has appointed Loring Randolph as its first curator. In her new position, which is funded by the New Museum, the artist will work with the gallery to explore the role of women in art, and will lead exhibition programming.In the new role, which is artistic and curatorial-driven, King Kunsthalle will hold a show of work by the artist Tarek Atoui, scheduled to open on November 2, 2020, as part of the exhibition “Modernism and the Image,” at the New Museum. In the exhibition, Atoui will present work by female artists on paper, sculpture, photography, and video. The show will also include an exhibition of work by female artists on a blackboard, and will feature the work of nineteen women artists in an exhibition designed to examine the relationship between art and women.“Our current exhibition program is often a little too focused on the male gaze,” said Loring Randolph, the director of the New Museum. The museum is planning to create a new, more diverse exhibition featuring work by women artists to take up the theme “Art", "The next Biennial should be set up in 2019. It is anticipated that the Biennial will be inaugurated by a biennial of paintings from the new museum, which is planned to open in 2021. The season of the year will be January 1–March 31. Regrettably, the construction of the new museum has been stalled since last March due to the Covid-19 pandemic.The new museum will include a new collection of more than 2,000 works by artists from around the world and will also boast of a new stage for education and public programming. The new museum will be inaugurated by a performance of Mannifesto by the Icelandic artist Bjarni Benediktsson.The Biennial, which will comprise eighteen permanent exhibitions, will be hosted by the Icelandic masters Bjarni Benediktsson and Olafur Eliasson. The museum will also be inaugurated by a series of lectures, panels, and performances by the British art historian David Adjay. The inaugural exhibition was curated by Bjarni Benediktsson.The 2019 edition of the Biennial, titled The Enlightenment of Art’s Moods, was held at the Museum of Modern Art in New York from September 7–October 12.", "The next Biennial should be held near you. Please note: there are currently no scheduled programming for the upcoming event.The biennial will also be hosting a number of exhibitions and seminars in association with museums. The first is a presentation of the works of the artists whose paintings are represented in the exhibition, a series of talks on the exhibition, and a moderated conversation with the artist known as the 'Shepherd of My Life'. The second exhibition will focus on the development of the Shekhina’s art program, with the exhibition of the artist’s work, and will be open to the public from March 5 to March 5, 2020.The exhibition will be organized in collaboration with the Shekhina’s sister-artists. The exhibition’s art and architecture will be presented in collaboration with the Shekhina’s art studio and the Shekhina siblings, who are based in the United States and Germany, respectively. The exhibition’s architecture will be housed in the sister institution, the German-French artist Neue Augsburg, whose works will also be presented in the exhibition. The first book of the exhibition’s architecture, “Autobiography of a Butterfly,” will be published by", "The next Biennial should open in 2020. \n\n\nIn a performance by choreographer, playwright, and producer Yinka Shonibare, known for his work incorporating multiple media to create works that are rooted in the everyday, including film, painting, and sculpture, and that address the human experience, the effects of technology, and the limitations of artistic vision, the Royal Court in London has renamed the exhibition “A Biennial of Visuality” after the artist. Shonibare’s work is included in the upcoming exhibition “Brilliant, Brilliant,” which opens at the ArtsCenter in Bradford on October 28.The collaboration between the Royal Court and A.F.M.G., the London and New York art-world institutions, was sparked by the opening of “The Art of Life” at the Warner Brothers, in 1987. For “A Biennial of Visuality” the artist enlisted the help of a team of curators, engineers, and writers to craft an exhibition that engages with topics such as humanism, futurism, and the relationship between artists and the wider environment.“I grew up in a family that believed in the power of art to change the world", "The next Biennial should take place in 2020, in the city of Aylesbury, England, and will comprise eighteen artists, including Peter Sellars, Alias Williams, and Bruno Latour. The 2020 theme, 'The Future We Deserve,” will be: “Reject Power: The Destruction of the Body in Relation,” and will feature a selection of work by Gabriel Ray, Urmas Dzodan, and Jaroslav Snug.The Festival, which was founded in 2007 by artist-owners Jay-Z and Beyoncé, is supported by a number of artists including Peter Sellars, Marianne Faithfull, Eric Fischl, and Peter Hujar. The 2017 edition of the festival, held at a site in the industrial city of Salford, England, drew fifty thousand people from seventy countries. The 2019 edition, which was staged at the Serpentine Galleries in London, had a similar lineup.\n\n\nThe Whitney Museum of American Art in New York has appointed Eva Hotch as its next director. She will be responsible for advancing the institution’s curatorial and programming priorities, as well as serving as a liaison between the museum and the creative communities of New York City. She succeeds Susan Stry", "The next Biennial should be a platform for people to be able to see and make works from their own bodies, and a gathering space for the exchange of ideas and experiences\u0097art and culture, ideas and culture, art and culture\u0097and for the exhibition of work by artists whose work is currently under the exhibition.”It is still unclear whether the venue will be able to accommodate all of the artists who were originally invited to participate in the exhibition, which was initially scheduled to run from February 15 to March 10.\n\n\nThe Institute of Contemporary Arts (ICA), in collaboration with the New York–based firm Kohn Giard, has released the results of a survey of the 30 artists whose works were selected for its “Via Gallery” exhibition. The survey was inspired by the controversy surrounding the controversial 2018 exhibition “Theater of Operations: The Gulf Wars 1991–2011”, which explored the connections between the Israeli–Palestinian conflict and human rights abuses in the territories and in the West Bank.“By presenting the work of thirty-five artists in a month, we hope that it will open new dialogue between the world and these territories,” the exhibition said. “We believe that the works of the thirty-five", "The next Biennial should be called off, as the theme of its exhibition has changed. The exhibition should be moved to the museum’s collection and not the collections, so that it can focus on “environmental catastrophe and social conflict,” said Sadiq.\n\n\nThe Egyptian Museum of Art and the Cairo Institute of Technology in the United States are working together to create a platform for the exchange of artworks between the two countries. The partnership was announced on Friday, February 14, and will run from March 5 to March 9.The project, titled the Egyptian Museum of Art, will feature twenty new works by twenty-eight Egyptian artists and will be organized in cooperation with the research arm of the Egyptian Ministry of Culture, the General Research Centre of the Ministry of Antiquities and Antiquities Heritage. The institution will also host a series of talks and events with scholars, including all the participants in the project, which will be coordinated by the Egyptian Center for International Research in Art, Design, and Architecture.\n\n\nThe Dresden Art Show announced today that it will cancel the upcoming edition, slated to run from February 22 to February 29, because of concerns regarding the coronavirus. Destined to draw an estimated twenty thousand visitors, the exhibition will", "The next Biennial should take place in the spring of 2019.\n\n\nThe Museum of Contemporary Art (MCA) Boston has appointed Kenneth C. Cohen as its next president and CEO. Cohen will assume his post in January 2020 and will begin as the institution’s interim director in January 2021. He succeeds Mary Anne Hoehn, who has led the museum for twenty-six years and will take the helm following the president’s retirement.“We are very much looking forward to working with Mr. Cohen as we continue to expand our collection and engage more communities through our exhibitions and programs,” said MCA director Rebecca Cook. “We are super excited about the new partnership with the City of Boston, and for the many groups that will play an important role in the restoration and revitalization of the city. . . . We are just getting started, and we are excited to see what the next four years will bring.”\n\n\nThe Musée du Cinéma in Paris, which is currently closed due to the Covid-19 pandemic, has appointed Rachael Carrière as its new director. She succeeds Guy Mihaljev, who departed the museum in February 2019 to head the Pé", "The next Biennial should take place in 2020. \n\n\nThe newly elected president of the European Commission, Jean-Claude Juncker, has announced that the publication of a blueprint for a new constitution for the European Union will be held in the second half of the year. The document, titled The Union and the European Parliament: The New Political Order, will be published by the European Council in the spring of 2021.The two-year plan outlines how an ecosystem of federal states, including the Council of the EU and the European Parliament, will work together to shape the future of the 28-member bloc. It also outlines how the President of the Commission, which is responsible for approving the EU’s budget and setting the political agenda, will work with European Council president Donald Tusk, who chairs the European Council, to deliver the blueprint for the next two years. The blueprint will outline how the United Kingdom will leave the EU—it currently has a deal that requires it to maintain a minimum of two-thirds of the UK’s trade, but will rejoin the EU in March 2021—and how the United States will move to reassess its relationship with the bloc. The EU’s interior ministers, Jero", "The next Biennial should be held in 2021, and the first in 2020.\n\n\nThe Frick Collection of Modern Art (F.H.C.A.) at the University of Minnesota announced today that it plans to dissolve its twenty-two-year-old institution in Queens, New York, and move its artworks, exhibitions, and educational programming to the Frick Museum in St. Paul. In a statement, the Frick said they are “committed to bringing art and artmaking back to the City of Minneapolis.” The move will protect the Frick’s collection while opening up an additional twenty-two acres of land on the city’s southwest side. The institution will retain a space at 1603 E. Fifth Avenue in Minneapolis but will be renamed the Frick Museum. Its current programming will be preserved, but its collection and exhibitions will be moved to the Frick. The Frick will also continue to offer programming in the city’s downtown core, but the building will undergo a $100 million expansion.“We are excited to be in the same building as the Frick Museum and its amazing collection, and to be able to offer our Minneapolis community a unique and expanded experience,” said Sarah", "The next Biennial should be held at least four times a year. The venue will also host a series of exhibitions dedicated to the work of the artists represented in the three-dimensional digital works, a biennial of works on paper, and an exhibition of work by Sarah Polley.The museum will also bring more than three hundred contemporary art exhibitions and collectives from around the world to New York City. Over the years, the museum has showcased works by artists such as Mihai Mihály, María Berrío, and Catherine Wheeler. In addition, it has staged numerous shows on contemporary art, including “Reality and Lace: Contemporary Art as Performance” (2007–2008) and “The Subtle Art of Surgery” (2009).\n\n\nThe New Museum in New York has named Laura Iwanowicz its first director. Iwanowicz, who currently serves as the founding curator of Modern and Contemporary art at the institution, will take the helm of the institution in January. She succeeds Raz J. Bernstein, who departed the museum in May to become a senior director at the Cincinnati Art Museum. “Laura embodies the spirit and breadth of our New Museum. She brings a deep understanding of the", "The next Biennial should have a deadline of October 25.\n\n\nThe United States Holocaust Memorial Museum (USMH) in Washington, DC, has launched a new digital platform that will allow visitors to view and research the work of more than six hundred artists, including Terence Blanchard, Rosa Luxemburg, Alighiero Grassi, Christopher Wool, William Kentridge, Charles Ray, André Breton, and Delphine Blu. Museum Link will allow visitors to view works on the platform as well as other curated exhibitions and events.The platform was developed with $50 million from the $114 million USMH Foundation and will launch with the exhibition “Unfinished Business: The American Anarchists” at the Contemporary Art Museum St. Louis next month. “In support of our mission to preserve and present the work of the American anarchists, we are launching a new platform that will bring together the work of important artists from across the globe,” said Michael Phelps, director of the museum. “We are confident that this new platform will enhance the exhibition programming, expand the collection, and deepen the understanding of the vast corpus of American art.”The platform", "The next Biennial should have a formal design by the artist and will have a platform to showcase his work. The exhibition will be hosted by Artforum in conjunction with ARTnews, the Württembergischer Kunsthalle München, and the Winkelmann Art Museum Stuttgart. Inaugurating the exhibition will be a lecture by Theodoros Yaxchilanis, and the supporting artists will be chosen by a jury comprising Renaud Lavigne, Hans Neumann, and Jean-Luc Delitzsch. The exhibition will open in the fall of 2020. Since 2009, Yusuf Kochiyar has been a founding member of the Israeli group Sakarya. They have also worked with artists such as Amit Daum, Ariana Mendez, Olan Ferber, and Yoshitomo Nara. The group has been touring internationally to promote the work of Palestinian artists, and recently, it was the subject of a public performance in New York City. The biennial, titled “The Stateless,” will be organized by Artforum and will run from March 7 to March 14. The full list of participating artists is as follows: 1-Alia Abadar,", "The next Biennial should be held in 2022.\n\n\nThe São Paulo Biennale, which was organized by the city of São Paulo, Brazil, and will run from April 15 to April 22, 2022, has announced that it has received $123 million from the city and has awarded its exhibitors $46.75 million to facilitate the exhibition. The institutions are now analyzing their options and will see how the new financing system will impact them.“The future of the world is at stake and I feel it is the city of São Paulo’s responsibility to play a part in ensuring that the curators of the 2018 and 2019 seasons are able to create works that reflect the vibrancy of the city and its diversity,” said Roberto Cicutto, president of the city, and the museum’s director. The cities of São Paulo and the city of Bolívia, in the center of the country’s epicenter of the coronavirus, have been working together for more than a year to come up with a financing plan that will serve as a permanent solution to the outbreak. The city selected ten donors who will donate $100 million over ten years, with the option of using the funds for up", "The next Biennial should aim to present the first comprehensive overview of contemporary popular culture, for which we will first attempt to select a set of cultural touchstones from which to center our exhibition. The theme of this year’s event will not only be “making sense of the world,” but also the relation between art and the physical and the social.”\n\n\nSnowden, NSA whistleblower, and filmmaker, Bradley Manning, was sentenced to thirty years in prison for passing classified documents to WikiLeaks—items that shed light on the US government’s surveillance programs and revealed the extent of the global surveillance state. Manning, who was arrested in Iraq in 2007 after stealing more than 7,000 documents, was convicted of twenty-six criminal counts but only faced three of the charges stemming from the leaks—two of which were dismissed by the judge.Manning was also ordered to stand trial for aiding the enemy, a charge that carries a maximum sentence of ten years in prison.According to The Guardian, the convictions were considered in part because of the leaks, which sparked international protests against abuses committed by US troops in Iraq and prompted thousands of Iraqis to take to the streets to protest the war. The majority of those arrested by the US military were found guilty", "The next Biennial should be held at a site selected by the organizers of the Biennial for the City of San Francisco, which will be decided by an international jury assembled by the City Council. Selected by the Council, the new venue will host the nineteen-eighth edition of the Festival of New York, which will be held at St. Paul’s Cathedral in 2021. The 2019 edition of the festival, which celebrated the centenary of the United States, was held at the San Francisco Museum of Modern Art and the San Francisco Opera House. According to the Associated Press, the 2020 edition of the festival will be held at New York’s Metropolitan Museum of Art.\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has announced that it is negotiating a new long-term lease of a $400 million, 250,000-square-foot former dairy barn. Although the barn currently serves as a museum’s permanent collection space, it is undergoing a major renovation, and its future is uncertain. The museum currently leases the building to an architectural firm led by Richard Desmond, and they are attempting to secure a long-term tenant for the barn.The project, dubbed the Bronx Barn, is part of a plan to", "The next Biennial should be held in 2021, and the new art museum will be inaugurated by Michelangelo’s David, in the building of the city’s new museum complex. This year’s edition, “Museum Lumière,” will feature new works by seventy-five artists in a row. Among the artists chosen for the award are Collège-Palet, Piet Mondrian, Linen Room, Marc-Marc, Allora, Cécile Barot, and Michael Kistler.The committee that selected the artists for the award was chaired by Koudounis, and comprised Kian Steegmann, president; Fabienne Noth, artistic director; and Alexandre Mavigné, director of the Louvre.\n\n\nArtist and philanthropist Diana Al-Hadid and her children, Taher al-Hadid and Sinan al-Hadid, have been named the twenty-fourth recipients of the Abramović Prize, an annual award for contemporary art. The six-person committee comprised Nousheena Khaled, director of the Sharjah Art Foundation; Khaled al-Hadid, the founder and president of the Had", "The next Biennial should bring together ten artists from the Saar-Paderborn region of Germany. The next edition will take place in May 2021.\n\n\nThe Museum of Fine Arts (MFA) in Los Angeles has appointed Laura Perez as its next executive director. Perez brings with her years of experience in fundraising and creative partnerships. Previously, she served as the director of the following organizations, which she oversaw through a series of initiatives established in the 1970s and 1980s: the Foundation for Contemporary Art, the Art Institute of Chicago, and the Screen Actors Guild. “I’m excited to have Laura return to the MFA as its next executive director,” said Meredith Kelly, chair of the board of trustees. “She has written a powerful new chapter in the museum’s history, and we are honored to have her as a trustee.”\n\n\nThe Metropolitan Museum of Art (MoMA) in New York has received a major gift of more than seven thousand works by artists’ last year, both as part of a deal set in motion by collector Mary Max Moore and in recognition of the institution’s ongoing support of artists. The gift includes works from Sidney and Lawrence Weiner, who both donated 300", "The next Biennial should be announced by October 2. \n\nThe New York City–based artist Mark di Suvero, who created \"Time Killer\" (2014) and \"Blueprint for a New York Life\" (2012)\u0097both for the exhibition that opened the Whitney Museum of American Art in March 2019, has died at the age of eighty-eight. In a statement, the Whitney said that he was long past the point of self-seriousness but had made a \"genuine effort to return to his roots\u0097his art has always been about the journey, about having a conversation with others, about the possibilities of what life is and what it could be.”The exhibition of the artist’s work, which depicted an alternative ideal of American life, was at one point a part of the landmark 1967 exhibition “American Art in the 1960s: The Naked Reality of American Life” (a collaboration with Charles A. Neel) at the Museum of Modern Art. The exhibition, which at the time was the first organized by the Whitney over the course of five years, was one of the first major gestures of the institution to respond to the AIDS crisis and to raise awareness of the disease", "The next Biennial should be held at a location outside of the city of Vancouver and be organized by an independent artistic committee.”The city has also been working on revamping its public art gallery, the Vancouver Art Gallery (VAG), since 2015, when the museum opened in a former canned-food factory. After a $30 million expansion, VAG now boasts a new modern, glass, steel, and glass-enclosed auditorium and a fourth floor, which will seat two thousand people, in the museum. The museum will also be renamed.The city commissioned artist-residence Tracy L. Jackson to create a new public sculpture that will hang in the Gallery of Forgotten Places, a new public plaza, and will unveil several new works by artists in a move that is predicted to draw around twenty million visitors. Inaugurating the plaza is a new public art installation by the Vancouver-born, New York–based artist Iwan Wirth.The $8.5 million renovation of Vancouver’s downtown core is being led by the City of Vancouver and includes the construction of new public artworks, including an eighth-century Baptist church; the restoration of a seventeenth-century building that was the site of a nineteen-thousand-piece", "The next Biennial should be held in 2020 and ’s location is a matter of local…”<|endoftext|>JACKSONVILLE, Florida—For months now, the Florida Keys Museum of Art in Jacksonville, Florida, has been vandalized with graffiti, murals, and other works of art that have been deemed obscene by local, state, and federal law enforcement officials. The vandalism has been linked to the criminal organization the NARCOL, which was recently charged with multiple counts of arson after a fire in a rubbish dumpster in Jacksonville, Florida, that broke out in January, 2015, was extinguished by firefighters.The fire, which was extinguished by an electrical system installed by the museum, prompted the city to install a new fire station and an emergency medical system in an effort to contain the spread of COVID-19, a viral respiratory illness that has caused at least nineteen cases of the virus to be confirmed in the United States. As of April 3, there are more than 7,700 cases and the death toll could rise.While arson is a serious crime in Florida, the arsonist was only arrested after the fire was set in a garbage can, not in a public space. Investigators believe that one or more people knew about the fire and were seen setting", "The next Biennial should have been simultaneous with the Paris Peace Biennale in November, but complications arose as the organizers did not know when the exhibition would open. The venue received the largest number of entries in the competition’s history. Organizers decided to postpone the exhibition until March 19, and the exhibition will now be held in March 2019. The announcement of the event was made with a “glorifying party” for the exhibition on June 20. Riccardo Barbera, director of the Museo de Artes, Torre de Casas, told the Art Newspaper that the announcement was made in the last days of the exhibition’s cycle. He said the decision was made in order to maintain the exhibition’s momentum and to welcome new projects in the form of exhibitions. The exhibition will move to the Museo del Barrio in Florence in the fall of 2020.\n\n\nThe National Gallery in London will soon have more than 1,600 new works by artists such as David Adjay, Masoud Barzani, and Ai Weiwei. Titled “The Future is Not What It Used To Be,” the exhibition will highlight the work of Burmese artist Ai Weiwei and his", "The next Biennial should begin with a series of performances and/or a design project by the Australian-born, Hong Kong-based artist, Hsin-Chien Huang, which will be inaugurated with a performance by the US-based collective Exit to the West. Huang’s work, which draws from a “reconstitution of things” that he believes is currently underway, will be followed by a “tent city” that will be made of recycled materials and will feature  acoustic and light installations. The exhibition will continue with the work of Carlos Mier, who is also known as Alan Manfredi, and will conclude with a performance by the Sydney-based duo Julee and Prita, which includes an illustration of a river. Our goal is to create an event that is inclusive, accessible and transformative, and the new Biennial aims to achieve that through a collection of work that is grounded in indigenous knowledge, tradition, technology, and aesthetic practices. The new project structure and programming is designed to support the aesthetic and spiritual aspirations of our new exhibition venue, the Artspace, which is to open in late March or early April. The new venue will be located at 36", "The next Biennial should commence in the autumn of 2020. “The region’s cultural and artistic heritage is at risk,” said Patrick Friel, director and CEO of the United States Council on Culture. The sculpture park, which has been a cultural hub in the Bay Area since the late 1970s, is currently undergoing a $100 million renovation, and the building of the Boulder Art Museum is scheduled to open in 2021.\n\n\nThe Venice Architecture Biennale, known as the Venice Architecture Summit, was cancelled in March due to concerns over the coronavirus. This means that the twenty-fifth edition, which was to take place in September, will now be held in October. The postponement was made in order to allow the architecture industry and the arts to have more time to prepare for the coronavirus, which was first identified in Japan in December.“This is a global crisis, and we at the Venice Architecture Biennale have been working hard to prepare for it,” said Jorge Lell, the chair of the architecture and design committee. “The team is working on a new platform in which we can present the conferences and the exhibitions in a more flexible way, so that the whole biennial", "The next Biennial should have an exhibition of works by the best contemporary artists of the contemporary, and will focus on the work of the 40 artists featured in the exhibition, which was organized by the International Society of Biennials. The exhibition will also include a collection of works by the artists who have won the prize, and will be preceded by a book club meeting of the winners, in the coming weeks, and the exhibition will continue until March 30. ✕\n\nThe Amsterdam Architecture Biennial has announced that it will not move forward with a major redesign of its grounds and will instead focus on implementing new safety measures to prevent the spread of Covid-19, including employing social distancing training and direct-to-consumer marketing. The 2019 edition will take place in May in the city of Amsterdam, the Netherlands. The redesign is part of a $438 million, five-year capital campaign. In August, the exhibition was given a royal commission by Queen Margrethe II of the Netherlands, who commissioned the new pavilion.In a statement, the exhibition said: “The design of the new pavilion is a major step forward in reducing the spread of Covid-19 and paving the way for a future in which people are able to enjoy", "The next Biennial should take place in mid-February.The seventeenth will be held at the Palace Museum in Beijing. The eighteenth will be staged at the Cultural Revolution Museum, Beijing; the Palace Museum in Shanghai; and the Museum of Modern Art, Munich. The nineteenth will be staged at the Museum of Contemporary Art, New York.The twentieth will be staged at the Museum of Contemporary Art, New York; the Museum of Modern Art, New York; and the Museum of Contemporary Art, New York.\n\n\nThe University of Toronto (UT) announced today that Sohrab Mohebbi has been named the next chair of its Department of English. Mohebbi, a bilingual artist who also teaches at the University of Michigan and the University of Toronto, will succeed Harjant Malhotra, who has served as chair since 2017. In his new role, Mohebbi will oversee the development and implementation of the University of Toronto’s English department, which has been housed at the university for over eighty years.“We are thrilled that Sohrab has come to the University of Toronto, and look forward to seeing where he takes us next,” said Mona Hatoum, chair of the university’s English", "The next Biennial should be held in 2020. The exhibition will be curated by Naija Tooker, who currently serves as curator at the University of Bristol. The inaugural edition, titled The Dreamer in Peril, was staged at the Museum of Modern Art in New York in 2018 and featured work by twenty-eight artists including Alejandro Araya, Zoraida Caro, Emmanuel Coulibaly, Aida Al-Salem, and Kana El-Saadi. The second edition, titled In Search of, features work by forty-eight artists including Anna Atkins, Adam Dallam, Marvin Alair, and Jauzmo Pedrosa. The third biennial, The Basket of the Bunnies, was staged at the Barbican in London in the summer of 2019 and will be presented by artist Shaniqila Juma and will be on view until November 7.\n\n\nThe Museum of Modern Art (MoMA) in New York has established a $75 million fund to help support artists and cultural organizations that have experienced financial losses related to Covid-19. The fund was established in partnership with the MIDWEST Artists and Cultures for Covid-", "The next Biennial should begin in 2022.\n\n\nThe Watkins Museum of Art in West Palm Beach, Florida, has received a donation of $2.5 million from the estate of James Henry Watkins, the creator of the iconic Charles Darwin’s finch, which is currently housed at the museum. The gift was made on behalf of Kerry Watkins, the granddaughter of James Henry Watkins, the late founder of the Watkins Group, which owns the Virginia-based company that operates both the Watkins Research Center and the Watkins General Store in Norfolk, Virginia.The donation was made by James Henry Watkins, the founder of the Watkins Museum of Art and of the Watkins Fine Arts, and his wife, Carolyn, on behalf of their son James Henry Watkins Jr., who has been suffering from a brain aneurysm for the past six months. During that time, the family has been working to raise $10 million to enable the surgery of a new brain.The donation was made in support of the Watkins Foundation, which is dedicated to supporting the lifelong learning and artistic and intellectual pursuits of James Henry Watkins. In recognition of his life-long dedication to the Watkins collection as well as his many accomplishments as a businessman, the family has been awarded a special plaque at the museum.The", "The next Biennial should focus on “magic realism,” the Nordic art historian and theorist Berit Lintjesen wrote in an editorial published in the Art Newspaper. “The story of the exhibition will be a reflection of the two centuries since the last exhibition dedicated to magic realism.”\n\n\nThe Museum of Modern Art (MoMA) has announced today that it will open a new five-thousand-square-foot, exhibition space in its David H. Koch–designed building in the Manhattan boroughs that will host a series of new works by artists such as Mark di Suvero, Erik von Koonen, and Tanya Villar. The museum will also add six new works by artists in its current collection. The works, which aren't scheduled to open until 2021, were selected based on contributions to the institution’s contemporary art and architecture programs and will be presented in the exhibition “Between the Sun and the Moon,” which will be open March 29–April 3, 2021.“The Koch Museum is at the forefront of innovative thinking about how to create sustainable, energy-efficient, and community-centered exhibitions and experiences that embody the values, creativity, and dedication of Mo", "The next Biennial should be held in late 2019.  Thoughts on the future of the Biennial? \n\n\nThe Museum of Modern Art (MoMA) in New York has appointed Julie Curtiss as its new deputy director. Curtiss will become the museum’s interim leader until a new director can be found.“Julie’s talent and track record of success in leading important institutions makes her a strong candidate for the role of the director,” said Marlene Johnson, chair of the board of trustees of the organization. “Her leadership and vision for the museum will ensure that MoMA remains at the forefront of American art, and continues to be a significant cultural partner to New York City.”Curtiss comes to the institution from the Metropolitan Museum of Art, where she has served as interim director since February 2019 and has been credited with driving the museum’s transformation from a mid-century outpost to a $1 billion institution. During her tenure, she expanded the museum’s collection, continued to expand its exhibition-based programming, opened galleries, revamped its courtyard, and added new public spaces.“As the director, Julie will play a crucial role in developing and strengthening Mo", "The next Biennial should take place April 21–April 22. The theme of the event is Tomorrow.  [UPDATE]April 3: The 2019 Art Biennial at the Museo de Arte Contemporáneo in Madrid, Spain, has been postponed from April 8–April 16. The exhibition will now be held from June 19–June 22.  [UPDATE II]April 3: Spain’s Ministry of Culture has issued a statement regarding the cancellation of the forty-fourth edition of the Art Biennial:  “We regret that this has been the case for so long and that the event has taken this long to complete. At the same time, we hope that the Prize will not be compromised.”  The Art Biennial was founded in 2014 by architect and philanthropist Ada Jaros. The event’s inaugural year saw the exhibition debut with Arts of Life, a project focused on the life and work of painter Le Corbusier; the exhibition’s second edition, Art of Death, an initiative focused on the life and work of Belgian master Hildegarde Duane, was staged at the Villa Victoria in Venice in 1995.The biennial,", "The next Biennial should be held in late-March or early-April, with the launch of the Museum of Contemporary Art Melbourne (MCA). The biennial will be the second North Melbourne-based institution to host a biennial. Its first biennial, “BOP,” was held in 2018 and included work by a number of international and local artists. \n\n\nThe University of the Arts (UNA) in Birmingham has received a £1 million grant from the Tate in an effort to promote engagement with the arts. The £1.2 million fund is part of a £1.3 billion package that also includes shifting to a digital platform for arts education, a new institute for the study of artistic and cultural heritage, and the launch of the Arts and Culture Archive. “We are delighted with the outcome, which will help to shape the next UNA Biennial, which will take place in 2020,” said UNA director Dr Aneesa Al Qasimi. “The new platform, the Arts and Culture Archive, will provide a new opportunity for the arts to be more relevant and enrich the lives of a large and diverse range of audiences across the United Kingdom and beyond. We look forward", "The next Biennial should focus on articulating and elaborating the ideas of the past five decades with an emphasis on the biennial as a source of inspiration and a celebration of the creative activity of the past. The theme of the 2020 edition should be “Nature’s Place.”The next Biennial should focus on articulating and elaborating the ideas of the past five decades with an emphasis on the biennial as a source of inspiration and a celebration of the creative activity of the past. The theme of the 2020 edition should be “Nature’s Place.”   This article is part of a series produced by EDC London, which will run all 2018–19. Follow EDC London on Twitter.\n\nThe Museum of Contemporary Art (MoCA), the Los Angeles County Museum of Art (LACMA), and the Metropolitan Museum of Art have announced that they plan to take the first steps to building a new $350 million campus in the city, which has been under construction since 2010, as part of a $2 billion expansion project. The museum has partnered with the private, Koretty-designed firm WALT, in order to make the transformation of the former metal-working and auto assembly plant a reality", "The next Biennial should be a closed exhibition with no screenings, and a public viewing room will open at the Museum on September 28. The construction of a new exhibition venue will also begin this summer.The institution announced that it expects to have the new venue ready for the 2021 event, although the dates and the dates of the exhibition will be announced once the institution is safely closed.\n\n\nThe Brooklyn Museum has received a gift of more than 1,200 works from the Greater New York School of Design (GNYD), a group that comprises artists who have been selected by the institution for inclusion in its annual “Artists on the Move” exhibition. The gift includes paintings and sculptures by seventy-five artists, including John Kahn, Adam Dutkiewicz, Vito Acconci, David H. Dyer, and John Lanchester, as well as works by non-New York City artists such as Richard Diebenkorn, Zina Mariko, and Vladmir Solovyov.The group, which was formed in 1979, has introduced the annual biennial to coincide with Art Basel Miami Beach. The event was established as a way to draw attention to the history of fashion and fashion design. Its current 2020 edition, “Artists", "The next Biennial should be held in Al-Bayda, on the outskirts of the capital Abu Dhabi, in early June 2020. The exhibition will be divided into four themes: the American West, American History, the Middle East and the Developing World.Commenting on the themes, Artnet reports that the inaugural event will focus on the history of art in the United States and will examine the representation of African artists in art since the Civil War. The biennial’s theme will be “Art and the American West: From the Art of Samuel Stafford to the Art of Vincent van Gogh.”\n\n\nThe Smithsonian’s National Museum of African Art (MMFA), in Washington, DC, has received a gift of sixty-five works by forty-three African American artists, including thirty-five from the Harlem Renaissance. “Five hundred years after the victory of the Civil Rights Movement, the museum became one of the most visible and respected cultural institutions in the country,” Sally Kohn, who has spearheaded the initiative to acquire works by black artists, said. “This year’s gift makes clear that the museum is determined to continue to be an inspiration to those most in need.”The", "The next Biennial should begin in January 2021 and conclude by April 2022. The show will be hosted by Piero Manzoni, the curator of contemporary art and architecture; Hugo Bossaert, the head of the fashion department in Milan; and Antony Hudspeth, who curated the exhibition “Ai Weiwei: The Mystery of the Body,” in the museum.\n\n\nThe Tate’s board of directors has suspended the contract of head of the museum, Ian Cheng, who was appointed in February 2019, for allegedly misleading the board about an expansion of the museum’s holdings of cultural objects that were not originally scheduled for display.“Immediately upon learning of this allegation, we considered all options available to us, including terminating Ian’s contract,” a Tate spokesperson told Artnet News. “However, as we considered all options, we considered only one thing: the health and safety of our staff and visitors. We have since concluded that the best way to ensure our security for the opening of this autumn’s edition of Tate Modern is to retain Ian.”The board also decided to postpone a decision about whether to proceed with the construction of a new Tate digs until November 2021, and", "The next Biennial should be organized as follows:It has been established that the museum’s collection is the subject of an individual’s claim for equitable compensation. The museum has been reimbursed for the expenses of the trial and has paid the claimant for the cost of the therapy. However, the museum must determine that the claimant has suffered loss as a result of the museum’s failure to provide the claimant with the information or the services that were requested or demanded. The claimant must also pay an amount in excess of the value of the therapy. The claimant must also reimburse the museum for the cost of the therapy. If the claimant cannot demonstrate that the claimed amount was more than $30,000, the museum must reimburse the claimant for the cost of the therapy. If the claimant does not remit the funds within thirty days of being notified of the claim, the claimant must be reimbursed for the amount owed and may elect to have the amounts remitted to the claimant’s account.If the claimant has failed to remit or pay a stipulated amount within thirty days of being notified of the claim, the claimant may appeal the decision. Allegations may be reviewed by the claimant’s clientele rights or the claimant’s", "The next Biennial should take place in 2021.\n\nThe Sierra Club is also urging the National Park Service to keep the existing design of the pavilion and to create a new biennial dedicated to Indigenous art. The organization sent a letter to the agency’s director, Rebecca Viator, on January 7, 2018, requesting that she halt the construction of the pavilion until the park’s existing design is adjusted to reflect the needs of future generations.The letter read: “We are writing to request that you cease construction, renovation, and commissioning of the pavilion, and other activities that are currently taking place in the pavilion, while the pavilion is being prepared for its first exhibition in more than fifty years, and undertake a thorough review of the Pavilion’s design in light of contemporary cultural and political realities. We are deeply concerned by the amount of Indigenous art currently being displayed in the pavilion, and the potential for future exhibition installations that will perpetuate existing institutional structures. The pavilion already serves as a focal point for conversations about contemporary issues related to art and the environment and is a great example of the possibilities for art in the park.”The Sierra Club is also requesting that the National Endowment for the Arts (", "The next Biennial should take place in 2020, after a five-year hiatus.  “The Biennial is an important step in the long-term development of the artist-led movement,” said Vincent van Gogh. “I am in solidarity with all the artists who have contributed to the development of the Biennial and wish them success in the years to come. The Biennial is now at the end of its first phase, with the exhibition ‘The Infinity of Form’ as the final stage. I hope that this exhibition will be a turning point for the Biennial and will shape the course of its next iteration.” \n\n\nThe National Gallery in London has announced that it will open a new exhibition devoted to the work of Alice Sharp, the German artist who often experimented with light, sound, and form in her Office, 1931, which she completed in mid-1932. Originally presented as a solo exhibition at the gallery in 2008, the show was moved to the National Gallery in 2009. The show will be “Away from the Window,” a sixty-two-minute documentary that documents the artist’s travels through space and time in order to confront the concept of time.", "The next Biennial should make its debut at the Museum of Contemporary Art (MoCA) in Los Angeles on March 8, 2020. The exhibition will highlight work by artists whose work has been selected by the museum for its exhibit “Between Two Worlds: Art and Deserts” and will also highlight the work of artists whose practices are currently understudied or are currently in the process of being so reworked that their vision is no longer possible.“The biennial is part of MoCA’s commitment to create an environment of extraordinary breadth and depth in which contemporary art can be experienced and developed in Los Angeles,” said MoCA director Adam D. Weinberg. “This is a moment of great challenge, and one of the greatest opportunities for artists. We are eager to see what the new Biennial will bring to American art.”\n\n\nThe Swiss director Max Hetzler has resigned after his contract was terminated following a public controversy over a controversial São Paulo installation, “Passion of a Time,” that was meant to commemorate the Brazilian painter Gio Ponti. The work, titled Passion of a Time, was constructed in 2014 as part of a campaign to increase the visibility of", "The next Biennial should take place in the fall of 2020. The most recent edition, held in December 2019, featured work by thirty-four artists, including Emma Istvan, Kiki Smith, and El-Sennari.\n\n\nThe Museum of Modern Art (MoMA) in New York has released guidelines for how museums should handle protests and rioters. The document, which outlines steps including de-escalation, shelter, evacuation plans, and shelter-in-place, has drawn criticism for being too specific and for not including a public health plan for protesters. According to the New York Times, the guidelines were drafted after the deadly clashes between protesters and police in Los Angeles on Saturday, December 21, which involved more than one hundred people.The guidelines state that protesters should remain seated and disperse if possible; that medical personnel should be on hand to help protesters if necessary; and that demonstrators should refrain from throwing objects or using vehicles. They also outline how individuals can report suspicious activity to the authorities, including by calling 311, walking alone, or using wireless communication devices.Museum guards and officers are permitted to use de-escalation techniques as long as they are used in a way that prevents harm to the protesters. However, the guidelines", "The next Biennial should be held in 2020, at the earliest. \n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles, has awarded $2.4 million to seventy-three artists. The full list of recipients is as follows:Matthew Beasley, Los Angeles County Museum of Art (LACMA), Los AngelesDavid H. Daley, American Folk Art Museum (AFAM), New YorkDavid K. Louis, Los AngelesDavid M. King, Los AngelesDavid O. Ross, Los AngelesDerek Keeler, Los AngelesDavid S. Lee, Los AngelesMichael Hauptman, Los AngelesDavid W. Dano, Los AngelesDavid W. Suggs, Los AngelesDarren Williams, Los AngelesDavid Yarrow, New YorkDavid Zwirner, New YorkElijah Brown, LACMA, Los AngelesElizabeth Ball, Los AngelesElizabeth A. Jones, Los AngelesElizabeth B. Westbrook, Los AngelesEdie B. George, Los AngelesEdie E. Hoff, Los AngelesEdie H. James, Los AngelesEdie M. Khouri, Los AngelesEdith Laing, Los AngelesNatalie Barner, LACMA, Los AngelesRajesh Arora, LACMA, Los", "The next Biennial should open in 2021 and will focus on critical debates about the environmental impact of art and architecture (“art and architecture as several systems of spatiality”), the history of art (“the spatial and biographical dimensions”), and the contemporary art (“the relationship of art and design to contemporary life, the urban environment, and the human body”). \n\n\nNew York artist and curator Mary Ellen Mark, who served as curator of contemporary art at New York’s Museum of Modern Art (MoMA) from 1987 to 1999, died suddenly on December 24 at age fifty-eight. She was seventy-one years old.Born in New York City in 1941, Mark moved with her family to Long Island City, New York, in the 1950s. Karen Wechsler, who knew the family, described Mark as a “generous and compassionate provider.” She studied at the New School and the Catholic University of America in New York, where she met her husband, David Mark. Mark and her husband were married for ten years and had three children, David Jr., David Jr. & David Jr. (son), and David Jr. II. He was an American military brat and", "The next Biennial should take place in the spring of 2022. The museum will also be re-built to accommodate the exhibition. The first phase of construction is set to begin in the summer of 2022 and is expected to be completed by March of the following year. The exhibition will be moved to a new space in the museum\u0097the Intimate Pintos in the second floor\u0097and will reopen in a few months. “We are very excited by the prospect of the exhibition being hosted by the new and young museum in Manila,” said an amazing reporter for the exhibition. “The answer lies in the future, not in the past, and we shall take all possible measures to ensure the future of the exhibition, which was inaugurated by President Benigno Aquino III.”The Art Newspaper reports that the new museum will be built on the current Halsey Street, just south of the former site of the Manila Art Museum (SAAM), which was converted into a military museum in 1988. The museum’s original building, which was designed by architect Mihai Cetin, holds the collection of more than 1,600 artists. The new museum will be", "The next Biennial should draw from the ethical and political implications of the collection and public spaces in the city, with the aim of expressing the spirit of the exhibition and of transforming the museums into platforms for social change and social justice.”This year’s exhibition “will not be a narrative of the museum’s ownership of art and artworks, but a re-creation of the museum’s collection as a unique collective in relation to its past and future.”The inaugural exhibition, “Life and Art: Art’s Art of the Contemporary,” will open at the Museum of Postmodern Art in New York on November 30. The autobiographical ‘Museums: An Exploration of Art’s Past and Present” is being curated by Rita Gonzalez-Barrera; the exhibition will address the rapid change taking place within museums and the lives of museum employees. The third exhibition, “The Future of the Art World: A Retrospective,” will open at the Institute of Contemporary Arts (ICA) in London on March 31. The curators include Tony Phillips, Giuseppe Ottaviani, Christopher Wool, and Michael Chiu.\n\n\nThe", "The next Biennial should take place in 2022. The institution has also received a $10 million donation from the Arts Council. The funds will go toward the construction of a new 10,000-square-foot research library dedicated to the art of medicine. Beth Schubert, chair of the Biennial Board, said: “The Biennial has been a landmark in transforming the way the museum sees and handles art. It has been a remarkable journey of discovery, collaboration and personal growth as we have worked to present the museum’s collection in an exhibition format that simultaneously engages with and challenges the museum’s origins.” Museum director Paul Ha, who has served on the board of the museum for twenty years, added: “We are thrilled to receive this gift for the museum, its history and those who have made the Biennial possible. We are also grateful to the councilors who have supported this project over the years and to the board for their confidence in our vision for the museum, its future and the mission.”\n\n\n\n\n\nThe American Institute of Graphic Arts (AIGA) in New York announced today that it will award $8.5 million to seventy-six institutions and cultural organizations that", "The next Biennial should take place in 2020.\n\n\nThe National Gallery of Canada in Ottawa has announced that it will not be returning any art from the 2014–15 exhibition “Between the World and Me: International Art in a Global Dispute,” which opened on October 11, 2014, and ran until March 9, 2015. The exhibition was comprised of seventy-seven works, including works by twelve different artists: Karl Lagerfeld; Mark Leckey; Susanne Vielmetter; and Kathleen Hanna.The gallery said that the decision to not return the works at the end of the exhibition was made after consideration of a number of factors, including the fact that the pieces were not returned to the artist, who has a long-standing legal dispute with the gallery over the sale of a painting by Romaine Meurs, the artist who created the work “Between the World and Me,” which was on display at the gallery in 2014. It also noted that the works were not returned to the institution for more than twelve months following the exhibition.The move comes after the National Gallery of Canada protested the collection of a work by the artist Alex Quintana, whose work, titled The Untitled Man, reaches the", "The next Biennial should be held in the fall of 2021.  The exhibition will be hosted by the São Paulo Museum of Art; the University of São Paulo; the Museum of Fine Arts in Houston; and the Museum of Fine Arts in Rome.\n\n\nThe Southern California-based nonprofit organization the California Museum of Art (CalArts) has released the list of seventy-four artists and collectives who will participate in its next edition, “Falling: Art and the Politics of Light,” in the fall of 2021. Titled “Fall/Light Sequence,” the twenty-sixth iteration of the 2019 event will take place at the Los Angeles County Museum of Art (LACMA), and will showcase work by thirty-eight artists and collectives.“We are delighted to present this list of artists and collectives to the museum and to the community,” said LACMA director Jeffrey Johnson. “The artists on this list represent a wide range of artistic practices and their commitment to the gallery, not only reflecting the range of thought and aesthetic practice within contemporary art in the United States.”On the upcoming edition, which is being organized as a series of one-hundred-minute video", "The next Biennial should be held in 2021, and the fourteenth will be in 2023.“The exhibition of the work will be a culmination of a series of events that has taken place over the past forty years,” said Renaud Briand, director of the Biennial. “The new platform will be the perfect environment for the exhibition of the work and the exhibition of the Biennial.”\n\n\nThe Pérez Art Museum Miami (PAMM) and the Miami Beach Art Museum (MBI) have teamed up to create the first biennial of works by artists from the Pérez community. Titled “Inopportune Connections,” the biennial will run concurrently with the upcoming exhibition “Hey, Hey, Hey!” at the Miami Beach Art Museum. During the exhibition, which will be curated by Lorenzo Romanelli, the Pérez Art Museum will present fifty works by fifty artists, including Santiago Ramirez, Nina Teicher, Cara Watson, and Matt Wooster.“We are thrilled that the Pérez Art Museum Miami and MBI will work together to advance art in the region,” said", "The next Biennial should be in 2021.”The Kuala Lumpur Biennial, which has been held every 4 years since it was founded in 2004, will be held at New Delhi, the capital of India, in 2022.  The theme of the exhibition is “About Time: Art and Time in the Modern World,” and the program will be divided into three parts, “50 Years of Art,” “50 Years of Art: Before, After, and Beyond,” and “50 Years of Modern Life: Before, After, and Beyond.”Dale Finkelpearl’s 2020 exhibition “The Present: Art and Time in the Twenty-first Century” will be in the USA, India, and Australia. For its twenty-fifth edition, the London gallery will present a show of the work of forty-eight artists. The show will be hosted by J. M. Barlow, who has represented London but has since moved to New York, and will run from March 15 to March 20.“In the last few years, what has been most exciting for us was the burgeoning body of work that included artists of all kinds in the exhibition space,” said Barlow.", "The next Biennial should be held in 2021, with a budget of $13 million. The project will consist of one hour of performances, lectures, and other events that will be broadcast live on a digital screen in the Museum. Inaugurating the Biennial is a new exhibition, “Dr. Zhivago: Three Decades of Biennialism” (2019), which will present three biennial presentations. The first presentation will be on December 3, 2019, the second on January 5, 2021, and the third on May 10, 2021.\n\n\nThe Metropolitan Museum of Art (the museum) in New York City has acquired four works by the late Venezuelan artist Ricardo Campos, who often depicted Latin American and Caribbean cultures in his paintings and drawings. The acquisition, which is part of its ongoing project to re-envision the history of the art world, was made in a deal worth $2.3 million.“The acquisition of these works was made in connection with the ongoing project to re-envision Campos’s work and to make it accessible to the public,” said museum director Patrick Griffis. “The sale of these works in this way marks a new chapter in our relationship with Campos.", "The next Biennial should be held at the Bergen Biennial Stuttgart around March 13–March 14, 2020, in the second half of 2020. The biennial’s membership will consist of biennial artists, biennials affiliated with the museum, and biennials outside of the museum. In addition, the first and last exhibitions in the institution’s permanent collection will be the artist-in-residence exhibition “Tate & Tate” (2019), \"The Metamorphosis of Alien Life: Painting as a Reflection of Biological Life” (2019), and “Ateliers Lebroni” (2019), curated by Florence Pinturic, and the Tate Collection Collection Show, held at the Tate Modern in London between March 15–March 16, 2020, will be presented as part of the 2019–20 season.A selection of the current exhibition “Ateliers Lebroni” will be presented as part of the exhibition “Ateliers Lebroni: One Two Three.” The programme will be divided into three parts, with the first part being “Ateliers Lebroni:", "The next Biennial should focus on the history of the exhibition and how it has developed since its inception, in particular how the exhibition has changed with the years and what the future may hold. The first season, “The Age of Domination” will open in 2019. The second season, “The Life and Death of Man” will be presented next March. The third “Final Frontier: The Art of Art” will be staged in 2021, “The Opera of the Body: The Art of Body Art” will be held in 2022,“The Body and the Body Art: From Tadao Ando to Nada” will be staged in 2025, and “The Body and the Body Art” will be held in 2029.\n\n\nThe Museum of Contemporary Art (MoCA), Los Angeles has received a $50 million donation from the private foundations of the Delmonico family. The donation comes amid the ongoing fight for the future of the Los Angeles County Museum of Art (LACMA), which has been at risk of closure since February 29, 2020. The institution, which is home to some six thousand works by contemporary artists, including Romare Bearden and Linda", "The next Biennial should take place in December 2021. It is currently being developed by the Centre for Contemporary Art (CAA) in Paris as part of the UNESCO year 2020. \n\n\nThe Italian government has fined Art Basel more than $11 million for breaching labor and social-protection laws by hiring workers from lower-paid seasonal, contract, and freelance positions and then lying about their working conditions, reports the Art Newspaper.A group of twenty-five artists and art-world professionals signed an open letter protesting the labor-and-social-protection system in Italy, which is currently undergoing a massive restructuring, and the government’s failure to address the crisis. “We believe that this scandal will have a negative impact on the future of the art-world industry in Italy and the country’s economy,” the letter reads. The letter was organized by the Art Newspaper in collaboration with the Art and Culture Ministry, and was supported by the Art Students Union (ASU), ASIA, Artistica di Città, and the BICAM, as well as hundreds of artists and workers in the art-world sector from across Italy and the Republic of Southern Italy. “We are writing to express our", "The next Biennial should take place in the autumn of 2020.<|endoftext|>Overview Gallery Info\n\nThe Prada Collection is an international artist-run organization based in Venice, Italy, and organized by Arsht Baur. Established in 2008, the collection comprises work by over ninety artists. During its twenty-four-year history, the organization has collected more than seven hundred works and has exhibited a number of noteworthy exhibitions such as “The Sweater Factory” (2016), “The Secret Life of Art” (2017), and “Beyond the Frame” (2017). The Prada Collection is currently represented by Artspace, an international gallery based in Berlin; the Babylon, an artist-run space in New York; and the Basel Collection, an independent artist-run space in Milan.Baur was born in Zurich in 1972 and studied art at the Academy of Arts in Venice, where she met her husband, Henri, and moved to Milan where they had their first child. The couple lived there for ten years, before Henri returned to Zurich and began to work full-time as a curator. The couple returned to Berlin in 2008, where Arsht became interested in the history of art and the relationship between fashion and", "The next Biennial should be held in 2020. The 2019 edition was held at the Palazzo d'Arte Contemporanea in Venice. The institution currently has a permanent collection of over one hundred works by artists such as Isamu Noguchi, Daniel H. Wilson, Jean-Michel Basquiat, and Johannes Stiegler.\n\n\nThe National Endowment for the Arts (NEA) has released guidelines for the collection and exhibition of works by women artists in the United States. The guidelines were released ahead of a conference on female artists scheduled for November 3–5 in Washington, DC. The conference will also include a review of the 2020 edition of the National Women’s Literary and Art Biennial, which will open at the Virginia Museum of Fine Arts, and a discussion on the future of the MFA.“Women artists have made significant contributions to American art and culture for more than 150 years, and we’re committed to championing and celebrating their work,” said NEA director Andra Gillespie. “As we approach the centenary of the MFA, I welcome you to the conference. I understand the urgency to secure a year of robust exhibition and scholarship in women artists, and I", "The next Biennial should take place at the Centre Pompidou in Paris in 2022, and the date of the first exhibition should be set by the Government of the Republic of France. We demand a full public inquiry into the changes that have taken place since the destruction of the Parthenon in Athens in 568 BC, and the reconstruction of the ancient Athenian city of Heraklion, where the exhibition is currently taking place. We demand that the twenty-six artists who participated in the exhibition and the thirty-four artists working at the Centre Pompidou be given the opportunity to leave Greece, and that the government begin to compensate them for their lost income. We demand that the Arts Council of the Republic of France take the next twelve months to review the work of the artists and organize a new exhibition dedicated to their work. We demand that the Arts Council of the Republic of France adopt a program for the exchange of works between Greece and other countries in Europe and the United Kingdom. We demand that the Arts Council of the Republic of France contribute to the rehabilitation of the Greek cities and cultural heritage sites and build on the work of the Architects Union. We demand that the Arts Council of the Republic of France continue to be an important partner", "The next Biennial should take place in 2020. The 2019 edition was organized by the Museum of Modern Art in New York and the Brooklyn Museum of the Arts, and was staged at several locations, including the Museum of Modern Art, the Art Institute of Chicago, the Museum of Contemporary Art, Los Angeles, and the Museum of Modern Art in New York. After the museum closed to the public on October 20, 2019, it reopened on November 7. The event was originally scheduled to run from March 13 to March 20, 2020. For its fifth edition, the institution will have the option of holding the festival, or reopening the entire exhibition, or holding a series of exhibitions, presentations, and other events. Architects and designers, including Richard Avedon, Peter Zumthor, and Jürgen Todt, will also participate in the 2020 edition. The full list of exhibitors is as follows:\n\nThe Bereschler-Koltai Collection, Switzerland, and Galerie Koltai, France, opened an exhibition of work by the late German-born Polish artist Jan Kłodziewski at the Schirn Kunsthalle in Berlin this week. The show, titled �", "The next Biennial should be in December 2020. As the author of the forthcoming book A World Without War, which will be released in May 2021, I am extremely excited to see how the artists and the public respond to the exhibition. Renowned for her globalism and her intentional use of art as a vehicle for social justice, Biennal Belova has long been a pioneer in the field of art conservation. Her work has been preserved in the collections of the Museum of Modern Art, the Musée d’Art Contemporain and the Musée du Départ. She has also had several exhibitions at the Musée d’Art Contemporain in Paris and at the Musée d’Art Henri. The catalogue entry for A World Without War reads:\n\nThe biennial exhibition “A World Without War” (AUW), curated by American artist and activist Becky Hemmings, will open on September 24 and run through December 29. The show will feature works by seventy-eight artists and collectives, including the American artist Nick Cave and the French artist Franck Riester, the Argentinian artist Juan O’Donnell, and the Japanese artist Katsu Hasegawa.", "The next Biennial should open in 2021. “The exhibition was a tremendous success, and in 2002, we signed a new contract with the state of California to host the exhibition again,” said Frieze artistic director Maria Balshaw. The next edition of the Biennial will be held at the Los Angeles County Museum of Art (LACMA), in 2020. \n\n\nThe Los Angeles County Museum of Art (LACMA) has received a $10 million donation from the estate of Michael Rosenzweig, who passed away on August 29, 2018 at the age of eighty-one. The gift, which was made after LACMA board president Carolyn Newton-Kamen and longtime LACMA benefactor Roberta Smith invited the author to the institution for a discussion about writing about her experience living in Los Angeles.“Michael Rosenzweig was a spectacular writer and an extraordinary curator,” said Newton-Kamen. “He is a friend and collaborator of the museum’s staff and the staff’s circle, and we are all deeply grateful for his warmth and generous guidance.”The gift includes two of Michael Rosenzweig’s novels, Moving to L.A", "The next Biennial should be held at the Contemporary Art Museum St. Louis in 2020. The second should be held at the Detroit Institute of Arts (DIA) in 2021, and the third, at the Openair Museum of Art, in 2020. The 2020 iteration of the event will focus on MOS; the sculpture and performance within the exhibition will be curated by Mark di Suvero. Under its artistic director, Teri-Lynn Wechsler, a veteran of the show, the museum is slated to open to the public in 2022.\n\n\nThe Art Newspaper reports that the Melbourne-based nonprofit arts incubator the Pilar Foundation will provide $5 million to Sydney’s Leading Contemporary Art Foundation (LCAF), The Artspace, and the Festival of Contemporary Art (Fiasco) in a five-year, $5 million grant. “We are extremely pleased that the funds will be directed towards Sydney’s LCAF, Fiasco, and the Artspace,” said LCAF director Kaywin Rennie. “This is an important step in the organization’s journey to deliver on Kaywin’s vision of a world-", "The next Biennial should be in March 2019, following a two-week run in June 2020, the organizers said. The art museum will be joined by the city of Bielsky on March 31 and April 3, 2020.\n\n\nThe Smithsonian American Art Museum (SAAM) in Washington, DC, has received a gift of fifty-two works by Berenice Abbott from the late American painter Charles A. Van Doren. The donation includes works on paper, cardboard, metal, wood, and canvas, as well as twelve works on paper and four works on canvas.“The gift of these works to the museum is a truly remarkable honor and a mark of progress in the museum’s history,” said Susan Johnson, director of the institution. “It is a sad loss, but not surprising, to see an artist such as Berenice Abbott receiving such a public and private farewell gift. This gift is a testament to her artistic excellence and to the special gift of the museum.”The artist received the gift in a ceremony at the institution on March 26, the same day that SAWM’s new president, Martin R. Crewe, announced the museum’s reopening. The institution plans to welcome", "The next Biennial should be held at the Royal Academy of Arts in London in two years. \n\nThe US House of Representatives voted yesterday to establish an office to protect free speech and intellectual property rights in the United States, paving the way for more legislation designed to protect artists and other cultural workers. Introduced last year by New York representative Nancy Pelosi, the Protect Intellectual Property and American Creativity Act aims to give federal prosecutors more tools to combat online piracy and counterfeiting.“Protecting artists, innovators, and small businesses is a top priority for Congress, and today we are making history by enacting strong new protections for critical infrastructure, including intellectual property, as we renew our commitment to free and open markets with a robust copyright system,” said John Conyers, chairman of the Congressional Hispanic Caucus. “This legislation will help protect hundreds of thousands of American jobs, and will provide critical tools to combat the harms of illegal online piracy and counterfeiting. We are grateful to our lawmakers for listening to our concerns and for standing with artists, small businesses, and the American people in opposing this dangerous bill.”The legislation, which was passed by a vote of 248 to 168, ensures that copyright owners who are facing legal action from the government,", "The next Biennial should be held in the Spring of 2021. The first, “Today,” was held in the Fall of 2021. The next iteration of the exhibition, “Till Death Do Us Part” will take place in the Spring of 2022.\n\n\nThe Museum of Art (MoA) in New York announced today that it is launching a new $5 million fund for artistic and cultural preservation in honor of Stanley Baldwin, a pioneer American painter and sculptor whose work is currently on display in the museum’s Van Gogh and Georges Stétié paintings. The fund will be created through a combination of donations and grants, and will help the institution raise $5 million to promote the work of Baldwin’s surviving children, Sarah Baldwin and Stanley Baldwin II.“We are thrilled to be able to support the work of their families and sisters, and our artists, by providing these funds to support the work of their great-grandparents,” said museum director Frank Gehry. The foundation will also provide $500,000 to help endow the museum’s Botanical Gardens. The family’s other major philanthropic initiative, the Van Gogh Foundation, will also receive $500,", "The next Biennial should be held in 2021.\n\n\nThe Denver Art Museum (DMA) has come under fire for promoting a work by an artist who was awarded a lifetime achievement award by the museum last week. The artist, French photographer Pierre-Auguste Geissendorfer, died in Paris in 1997 but was remembered in the United States by his initials, A.G., meaning \"all that is good.\"The biennial, titled Bihor, was curated by curator and art historian Jenna Dietz and featured work by seventy-nine artists from twenty-five countries. The inaugural exhibition was held at the DMA in January of 1998 and featured work by forty-one artists from twenty-one countries. \n\n\nThe Seattle Art Museum (SAM) announced today that it is restructuring its current exhibition in commemoration of the centenary of the Seattle World's Fair’s inaugural edition, which took place in Seattle in May of 1957. The seminal exhibition, “The Museum of Modern Art” (TMO), will now be held annually at the museum. The redesign, which incorporates new public spaces, public education programs, and new educational initiatives, will celebrate the history of the Seattle region and its contributions to the", "The next Biennial should be held at least once a year. It should also be a time of celebration of the past and a time of reflection on the future. “An exhibition in the spirit of the Biennial is a great way of achieving this,” Birnbaum said. The new show will be curated by Margot Birnbaum, who most recently served as director of the Flemish National Gallery before she became director of the Museum of Contemporary Art Basel. Birnbaum has also curated an exhibition at the Museum of Modern Art (MoMA) in New York since 2004. Her first exhibition there, “Toil and Trouble: The Biennial” (2008), was one of the first works by male artists to be exhibited at the institution. Birnbaum was also the first to head the European Contemporary Museum in Brussels, where her first show was “Titre de loup: After the Fall” (2013–14), a video exhibition comprised of recreations of historical events that were staged in a sort of “microcosm” of a museum. The show was selected for inclusion in the inaugural edition of the Fifty-Ninth Venice Biennale in 2009.\n\n\nThe New Museum", "The next Biennial should be held in 2021, the organisers said. The next edition of the exhibition will take place at the Købenkruger’s Artcentre in Hamburg and will be preceded by a special exhibition at the Fondazione Prada in Milan on May 4. The exhibition will run until May 29. \n\n\nA Chinese artist conceptualized a new kind of cultural export, a utopia that eschewed traditional notions of art and culture to emphasize compassion and empathy. The work, a monumental sculpture called The Ant-Man, was made of thousands of steel wire mesh panels and features two humanoid figures—one of them a man and the other a woman—naturally paired next to each other in order to represent the two-dimensional landscape of a city. The sculpture was created from multi-colored polyester resin, which was melted and poured into a glass container called a sphere. The sphere is surrounded by a network of tubes and conduits. The sculptures are then supported on platform-like platforms, which are tethered to a platform by two ropes, in order to travel between the city and the sculpture. The two-dimensional landscape is then replicated in the form of a building.The project, titled The Ant", "The next Biennial should be held at the institution in the spring of 2022. In the meantime, it will continue to operate under the stewardship of Bassi, who previously served as the executive director of the Arts and Humanities Research Council (AHRC), a non-profit organization that supports the development of contemporary art and the arts in Surrey, UK, for fifteen years. To view the full list of sponsors and to learn more about upcoming events, visit artforum.com/sponsor. The 2019 Biennial, “The Future Is Present: Visual Art, Science & Philosophy,” featured works by artists such as Richard Avedon, Chris Ofili, and Hollis Taggart.  The Biennial will be held at the museum’s new home on the southeast corner of Twenty-Fifth, between Twenty-Sixth and Twenty-Seventh Streets in Manhattan, on November 8–11, 2019. Artforum will be the only media partner of the Biennial. “The Future Is Present: Visual Art, Science & Philosophy” will travel to the Museum of Modern Art, New York; the Solomon R. Guggenheim Museum, New York; the Metropolitan Museum of Art,", "The next Biennial should include a selection of contemporary artworks\u0097novel and contemporary artworks\u0097that are in the collection of the museum. It should also include a new theme and a new collection of rare works. It will also be inaugurated by a new exhibition, “Yes, We Can,” which will be organized by the museum.It will be hosted by the Institut für Bildung und Gesellschaft (Germany), the Kunsthalle Basel (Germany), the Kunsthalle Potsdamer Straße (Germany), the Museum Freiheiten (Germany), and the Kunsthaus Mitte (Germany).\n\n\nParis’s newly established micro-art galleries will open on Thursday, January 18, with a preview day on Saturday, January 16, at 10 AM. The galleries will be located in an eighty-year-old building at the Boulevard Saint-Honoré, a former major thoroughfare in the city center of Paris, the city of Saint-Denis, and the capital of the French province of Saint-Étienne.Located at 4,500 square feet on the ground floor of a building that has housed the gallery for decades, the micro-arts spaces will offer", "The next Biennial should be held in 2020.\n\n\nThe Kiasma Museum of Art in Japan is planning to move its permanent exhibition “Fatherland: Modern Art from the Past” from Kiasma to Nara, where it will be housed in a new complex dedicated to the exhibition, which will open in 2021. The two-year stint in Kiasma will mark the end of the exhibition’s twelve-year run and will be followed by a four-month residency at Kiasma. The temporary exhibition will include twenty-three works from the exhibition “Fatherland: Modern Art from the Past” and the forthcoming “The Silent Era,” which will open in 2020.“Fatherland: Modern Art from the Past” was organized with the cooperation of Kiasma and Nara City Council, Kiasma University, and Nara City Museum. The exhibition, which followed a group show “Modernism in the Present,” in the city of Kiasma in 2020, thus marked the end of a three-year residency in Nara. Nara Art Museum director Akira Yamamoto told the Art Newspaper that the move was made partly to protect the new exhibition, and partly to preserve", "The next Biennial should be held in 2021. \n\n\nThe São Paulo Bienal (SPO) in Brazil has released its list of ten artists and collectives who will participate in its biennial of Spanish craft and culture in 2021, which will be held in the city of São Paulo. The 2019 edition was staged at the São Paulo Waltrip and attracted some forty thousand visitors.The twenty-eight-member jury that selected the sixty-five-person panel comprised an international team of curators, artists, writers, and other experts, including Ricardo C. Araujo, the director of the Museu de Arte de São Paulo (MASP); Julia O. Fabian, the curator of contemporary art at the Museu de Cerveteri; Vladimir Ulyanovski, the director of the Centro de Artesia do Rio de Janeiro; Marcella M. Ianni, the director of the Studio da Cinéma (LCA); Andrea S. Cattelan, the director of the Institute of Contemporary Arts in Lisbon; Cyrille Monaghan, the head of the British Contemporary Art Museum; and Igor Sim", "The next Biennial should take place in the autumn of 2019. The Final will take place in May of 2021. Among the works that will be on view at that event will be the work of ​Herman Hesse, whose work is centered around the concept of the ‘intersection of art and politics,” and the work of Adrien Brody, whose 1944 “Heavy Metal” is set in the fictional city of American Gods.\n\n\nThe Whitney Museum of American Art in New York has appointed Carol Paris as its new director. Paris will begin her position in September. She succeeds Mariko Silverman, who has helmed the museum since late 2017. Silverman was also appointed as director of the Hirshhorn Museum and Sculpture Garden, as well as its new home for American art by Donald and Kerstin Brzezinski.“We are thrilled to welcome Carol to the Whitney,” said Mickalene Dirks, chair of the board of trustees. “She has demonstrated a remarkable ability to transform a museum into a world leader in art and art history, and we look forward to the next chapter.” Paris joins the Whitney at age sixty-three from", "The next Biennial should be an exciting and challenging time to reflect on the past and present through the work of visionary artists and sculptors. I look forward to working with the Hirshhorn, the Foundation, and the public to build on the themes and themes of our past years. \n\n\nThe Los Angeles County Museum of Art (LACMA) has been awarded a $1 million donation from the Andrew W. Mellon Foundation for the Arts (Andrew W. Mellon Foundation). The gift comes as part of a $2 billion plan to support arts and cultural institutions throughout California. Founded in 1988 with a $1 million donation from philanthropists Charles and David Mellon, LACMA is currently the largest arts center in the US and has hosted more than six hundred exhibitions since its founding. Its arts programming has featured works by major and mid-scale artists in exhibitions organized by the Mellon Foundation, including works by Maya Lin, Ken Loach, Bruce Nauman, Mark di Suvero, and David Salle, among others.“Andrew W. Mellon is an iconic American who has shaped the course of American art through his contributions to the arts and through LACMA’s museum,” said Los Angeles County commissioner and trustee Warren B. K", "The next Biennial should be held in 2020. “The exhibition will be a continuation of the exhibition of the artist’s work at the Biennale of Sydney in 2021. The artist will return to the exhibition in 2022, and the twenty-third edition of the Biennale will take place at the Sydney Opera House in 2021,” the statement reads.The institution has yet to confirm whether or not it will carry out the event in 2020, and has yet to determine the event’s date. \n\n\nChina and South Korea announced on Tuesday that they have reached a preliminary agreement on the transfer of a series of wartime US military installations to the People’s Republic of China (PRC). The move, which will involve the dismantling of the fortifications and relocation of the US Strategic Command (SAC) and other military facilities, was made in recognition of the agreement between Japan and China on the construction of the East-West Economic Corridor (EEWEC), which will connect the two countries.According to a joint statement issued by China and South Korea, the agreement “will enable PRC to further develop its economic cooperation with Japan in a way that will benefit both countries.” The SAC will be dismantled and relocated", "The next Biennial should take place in 2022, and the twenty-third biennial will be staged in 2020. The twenty-first will be developed by the Skopje Foundation and will arrive in 2020; the twenty-third will be organized by the Skopje Foundation and will take place in 2020. Both events will be held in the city where the largest mass gathering of modern or contemporary art in the world took place just days after the Great Schist. The biennial “will be a global celebration of art from twenty-five years of the contemporary world,” said Skopje Mayor Daniel Jovanovic.\n\n\nThe Wayans-based nonprofit the Henry Art Gallery in Detroit has become the latest arts institution to relocate after it was purchased by billionaire collector Andrew Kreisberg. The organization will move into a former Cadillac factory on Woodward Avenue in the city. The announcement came on the heels of the announcement that the Henry would receive a $450,000 donation from the German industrialist and philanthropist.Kreisberg, who also owns the private art collection of the late German industrialist Alexander Calder, paid $400,000 for the Henry in 2009. The deal was brokered by his son Richard, who is also a principal", "The next Biennial should be held in 2020 and will be organized by a committee comprising Nandini, Shrestha, and Jayadevar K, who is also the senior curator of modern and contemporary art at the Tata Museum of Art, Mumbai, and was the first curator to be appointed in the new institution.According to a release, the exhibition will include “some of the most important and important exhibitions of the last fifteen years.” The first edition of the biennial will be held at the Visakhapatnam Museum of Art (VMM), Mumbai, in November and the second edition at the CAA, Chennai, in March. For the first time, the exhibition will be organized under the theme “Biodiversity and the Future of Humanity.”\n\n\nSydney’s Museum of Contemporary Art (MCA) has announced that Germaine de Sarthe, who cofounded the institution with husband Bernard in 1971, will retire on February 6. The museum also revealed that Maureen Brown will become its next director.De Sarthe will have 25 years of museum administration experience and will be succeeded by Maureen Brown. She succeeds Jean-Marc de La Sa, who has served as MCA’", "The next Biennial should take place in Rio de Janeiro in 2022. It will also present a new iteration of the Los Angeles Biennial.\n\n\nThe National Geographic Society in Washington, DC, is returning to Washington, DC, for its eighth edition at the Smithsonian American Art Museum in 2021. The event will mark the theme \"the future we want—and we can't meet.\" After the museum reopened in 2013, it ranked third in the country in attendance, behind only the Smithsonian Museum of American Art and the Smithsonian Museum of Natural History, in terms of both membership and dollars raised.According to The Washington Post, the 2020 edition was a flop. The fair drew the worst turnout in its twenty-year history. Among the exhibitors scheduled to take part in the event were Calvin Klein, Céline Dion, Calvin Harris, Giorgio Armani, Michael Kors, Marc Anthony, Tom Ford, Diane von Furstenberg, Judith Loewy, and François Truffaut. “It was a total disaster,” Michael Ward, the National Geographic Society’s executive director, told the Washington Post. “We are continuing our research to determine the causes of the failure, and will share that information with our visitors in 2021", "The next Biennial should take place in Paris, in 2021. “A full and balanced biennial is an important step towards this,” said Sébastien Groussan, president of the Paris-based Bénédicte de Paris. “Over the years, the exhibition has attracted worldwide attention and attracted both critical and enthusiastic participation. It is a great honour to present the work of a group of artists that have made a significant contribution to the history of modern art. I am convinced that with the biennial, we will be able to make the exhibition a real memory, and to continue to grow the exhibition as a global cultural treasure.”The twenty-fifth edition of the exhibition was organized by Alexijaz Gallery, and will run from May 28 to May 29 in Delhi. The twenty-sixth edition will be organized by Sidney and Lois Lansdorp Gallery, and will run from May 19 to May 24 in New York. \n\n\n\n\n\nSara Cwynar, the British artist who pioneered the staging of artworks in public locations such as Buckingham Palace and Tate Britain to protest the monarchy, has died at age eighty-eight. Known for her displays of sculpture and", "The next Biennial should take place in 2020. \n\nThe Museum of Fine Arts in Houston (MFA) has appointed Leslie Cook, the museum’s curator of modern and contemporary art, as its next executive director. She succeeds Peter W. Downs, who retired June 30 after a decade at the helm of the institution.“I’ve been honored to serve as the MFA’s interim executive director for the past three years, and I’m eager to continue to shape the museum’s mission and work with artists and communities across Texas,” said Cook, who will take up the post on July 1. “I’m excited to work with the MFA’s board to help the museum organize a diverse and exciting exhibition program that highlights contemporary art and explores contemporary issues through the themes of American history, climate change, the legacy of African American art, and the legacy of the African diaspora.”Prior to joining the MFA, Cook served as the curator of large-scale installation at Southern Exposure, an artist’s colony in New Orleans, and worked as a curator at the Museum of Modern Art in New York from 2004 to 2015. Previously, she worked as the", "The next Biennial should be held shortly after the end of the first phase of the exhibition, which will involve the installation of forty scale models of the cities in the United Kingdom, and will be organized in parallel with the opening of the exhibition “The Future is Not What It Used To Be” (2019).\n\n\n\n\n\n\nThe Metropolitan Museum of Art in New York has appointed Natalie Jastrow, a curator and former staff writer at Fine Art magazine, as its new deputy director. Jastrow will be responsible for spearheading the museum’s global artistic strategy and coordinating the museum’s exhibition program and public program.“We are thrilled that Natalie Jastrow will be joining the Met in the role of deputy director,” said David Cameron, the British prime minister. “Her expertise, passion, and vision will be crucial in ensuring that the Met’s exhibition program continues to thrive on the global stage and that we continue to present the extraordinary collection of art at this year’s event.”During her tenure at Fine Art, Jastrow worked as a writer and editor for the site, which is devoted to the art of fashion and design, and has written for publications such as Artforum,", "The next Biennial should be set in the forest near the town of Biartoli, the capital of the Democratic Republic of Congo, in September 2021. A new exhibition of works by contemporary artists will follow in December 2021.  The theme for this year’s edition was “Social Domination: Nature and the Struggle for Self in Contemporary Art”. \n\n\nThe Danish government announced today that it will lift a long-standing ban on Danish artist Beatrix Eliassen from leaving the country to explore new artistic opportunities abroad. “We are excited to have completed the restoration of Beatrix Eliassen’s home at 2000 Copenhagen Place,” Minister of Culture Victoria Stærkøv and Minister of Finance Petteri Ormerod told the Danish newspaper Aftenposten. “We hope that this will give her new and more challenging opportunities. We hope that this will be the moment when she will get to see the Danish capital as a new cultural destination.”The Danish artist, who has lived in Denmark since the 1970s, was prevented from leaving the country in 2017 by a court order, but was allowed to travel to Paris in an attempt to appeal the ruling, where she was granted an"]